{"review-url":["http://www.imdb.com/title/tt0076478/reviews"],"review-text":["Shock-A-Rama offers this DVD edition which features two different versions of the movie, commentary track on one feature by producer Sam Sherman, and the usual assortment of trailers that come with the majority of DVDs released under the Seduction Cinema umbrella.Essentially, there are two different movies presented: Possession of Nurse Sherri, a remastered release of the horror cut with optional track with Sherman, and Nurse Sherri, the original drive-in release of the sexploitation version.  Sherman provides juicy details on the canny presentation of the \"horror\" version, detailing what was edited/added to the initial release.  At a glance, 70% of both movies are the same, but with noticeable differences:  the horror cut has at least three additional scenes with character actor JC Wells being pursued by the disembodied spirit of a dead spiritualist, while three edited scenes of sex/nudity are provided by the sexploitation cut.  These last three scenes are certainly eye-openers: a scene of hospital seduction between a buxom nurse and blind patient, another that has the chief surgeon receiving oral gratification at his podium while giving a lecture in front of a college classroom (!), and an extended scene between the surgeon and our Nurse Sherri with ardent lovemaking culminating in Sherri's flashback of her sole lesbian encounter.  These last two segments show how Sherri fills that nurse's uniform with more than ample results!Previous reviews at IMDB have decried the lack of horror elements and nudity, one even saying that if released today the movie would probably get a PG rating!  I can assure anyone that neither of these versions are remotely PG.Al Adamson--along with Jerry Warren and Jess Franco--had the notoriety of \"film doctor\", constantly re-editing and re-marketing product that had already saturated a film niche.  This wonderful DVD shows how Sam Sherman and Adamson worked in that process.A highly recommended DVD (regardless of the quality of the movies) which begs one question; whatever happened to star Jill Jacobson, and where is the inevitable Celebrity Sleuth layout?","I love just about everything the late Al Adamson directed in his long and varied career, but \"The Possession of Nurse Sherri\" stands head and shoulders above fun yet admittedly grade-Z schlockfests like \"Horror of the Blood Monsters\" and \"Blood of Ghastly Horror\". This film is actually scary! Am I saying that you're going to jump out of your seat when you watch \"Nurse Sherri\"? No, of course not. But this pastiche of elements from \"The Exorcist\", \"Ruby\", and \"Carrie\" is one of those nice, eerie little horror movies common to the '70s. You can't put your finger on what's so spooky about it, but the film drips with atmosphere. (And what an ending! Don't worry, I won't spoil it for you.) Adamson and producer Sam Sherman really nailed it with this one, and it doesn't matter whether \"Nurse Sherri\" was a calculated success or a happy accident. Jill Jacobson is likable but not outstanding as the hapless nurse who becomes possessed by the spirit of a recently deceased cult leader (Bill Roy, who shines in his brief role). Geoffrey Land is okay as her surly doctor boyfriend. There are some blaxploitative elements here (profit was the bottom line with these cheap drive-in flicks, after all) but they actually contribute to the plot rather than just being window dressing. \"Nurse Sherri\" was a Poverty Row production, and it shows at times (sets, special effects, etc.). Still, the film has heart, mostly decent acting and direction, and some genuine chills. Sam Sherman also saw fit to use Harry Lubin's theme music for the late '50s/early '60s television series \"One Step Beyond\" in this film, which certainly adds to the creepy atmosphere. The DVD contains two significantly different cuts of the movie (the early version features a lot of T&A that wound up on the cutting room floor to make way for more horrific stuff) as well as the theatrical trailer, the TV spot, and a great commentary by Sherman. Does anybody know whatever happened to Bill Roy, by the way? Next to John Carradine, he's the best actor I've ever seen in an Al Adamson film, and he plays the cult leader like he means it.","I bought this on VHS as \"Terror Hospital\", and when I got home I checked IMDb and was like OMG it's the legendary \"Nurse Sherri\"!!! So here's another one from Al Adamson, who had clearly learned some minuscule amount about film-making since the \"Blood of Dracula's Castle\" days. Where that earlier effort is a more or less totally sclerotic lump, this one mixes it up a little, adding a definite element of variety and surprise amid the incompetence. Sure half of the movie is a blind post-op football player shooting the breeze with his stacked nurse, but at any moment we might be cutting away to the cackling disembodied head of the satanist mastermind, or Nurse Sherri running a farmer through with a pitchfork, or a wee bit of abstract student-film quick cutting to go with the pulsing-blob effects in the possession scene, or the most gratuitously half-hearted topless bit ever, or god knows what else (I forget, to be honest). As dumb-ass pieces of sh*t go, this one runs toward the high end. Congrats, Al.","Yes...this movie is bad.  After all, what did you really expect?  It was directed by the king of low-budget exploitation films of the 70s....Al Adamson.  He was, if you remember, the same cinematic genius that brought us Dracula Vs. Frankenstein, Brain of Blood, and the classic Blazing Stewardesses.  Yet, despite all the negative response to this film, I liked it.  There is no question at all that it is poorly acted, poorly directed, has poor sets and scenery and terrible special effects.  The story is ludicrous about a religious zealot who exacts his revenge on those people that would not let him die naturally.  What the film DOES have is heart. The people involved really seem earnest about what they are doing, and it comes across the screen.  The film is also a fountain of laughs. a fun time for anyone who likes to see the ridiculous treated like the sublime.  If you like bad film-making, then look no further than Nurse Sherri.  I promise you will not be disappointed!","I first saw this movie at the local drive-in as part of a double bill with \"Eyeball\" - What a complete laugh-fest! The \"acting\" and production values are definitely par for the course for Al Adamson (In one scene alone is it daytime or night - or just blue filter over the camera lens? Who cares? Apparently not Mr. Adamson) I had to buy this one as soon as I found a copy and now that it's on DVD, I highly recommend this to any fans of the genre...I think it's Al Adamson's...uhhh...masterpiece (?!) One that truly has to be seen to be believed...Oh yeah! Jill Jacobson's breasts should have had their own credit in the movie (if you know what I mean) Whatever happened to Jill Jacobson??","Al gives us his take of THE EXORCIST. A cult leader has a heart attack in the desert while performing a ritual to raise a follower from the dead and subsequently dies on the operating table at a local hospital. No big deal, he'll just turn into a glowing green blob and possess Nurse Sherri (Jill Jacobson) to get revenge on the doctors who he feels killed him. This is bad news for Sherri's love life as her boyfriend Peter (Geoffrey Land) was one of the docs. Peter notices the changes in Sherri and it seems only a blinded former NFL player with knowledge of voodoo (!) who is a patient can offer the way for two nurses (Marilyn Joi and Mary Kay Pass) to help release Sheri from this transcendental terror. If you are familiar with Adamson's work, you'll know what to expect here as this has lots of static shots that go on too long and flat acting. There is also one of the funniest and most random car chases when a drunken follower confronts Peter – who is oddly not intrigued by this man's story, despite knowing his girl is now possessed – in a parking garage. They then burst out onto the city streets and end up in the desert within minutes. The poor follower survives having the roof of his car ripped off and leaps out just before it drives off a cliff and explodes (the film's highlight). The Shock-o-rama DVD offers an alternate version of the film title simply NURSE SHERRI and it is actually really interesting. It removes all of the drunken follower bits (including the car chase) from the POSSESSION version and replaces them with nude scenes.","The introductory prologue to Nurse Sherri has a small devil-worshipping cult in the desert trying to bring a man back to life. In the midst of conjuring up the forces of evil, the head necromancer Reanhauer has a heart attack and is rushed to hospital. Whilst in hospital he is attended to by Nurse Sherri and he speaks to her in long monologues regarding the supernatural. Reanhauer's condition rapidly worsens and he ends up on the operating table under the scalpel of Peter, Sherri's surgeon boyfriend (with the assistance of Sherri) where he eventually expires. Later on when Sherri is at home masturbating on her bed, a strange animated green ethereal fog floats into her room and rapes her(although she doesn't really put up much of a fight). This is definitely one of the \"trippiest\" rapes I've ever witnessed on celluloid, and probably the highlight of the film.It turns out that the green fog was the blasphemous cult leader's spirit and now Nurse Sherri is possessed! You can tell cos she speaks in a man's voice and bugs her eyes outta her head. She then goes a killing spree, massacring a few doctors - one is dispatched via pitchfork impalement, another is stabbed in the chest. A blind ex-footballer hospital patient whose grandmother is a Haitian Voodoo priestess says the only way to exorcise Nurse Sherri's evil possessor is to dig up and burn the corpse of Reanhauer, so a couple of Sherri's nurse friends cruise to the cemetery for some good ol' grave desecratin'.I actually dug this cheapie from Al Adamson quite a bit more than I'd expected to. I mean yeah, there are a lot of slow parts, the ultra low budget sets and amateurish acting are blatant and the films theme song is stolen directly from The Godfather, but that just goes to show this flick for what it essentially is - a typical slice of 70's exploitation fare, designed to draw in the crowds who are eager to see some gratuitous nudity and a bit of blood.And there's enough exploitable elements here to make for some entertaining (if slightly tame) sleaze, mainly of the sexed-up female nurse variety. Whether it be pointless flashbacks to \"the craziest sexual experience'' Sherri and her boyfriend have ever had (a lesbian encounter and a naughty blowjob), patient \"relief\" that goes far beyond the call of duty, some semi-bloody kills, and a grand finale that has a bugged out Nurse Sherri covered in blood with a meat cleaver in each hand preparing to slaughter her boyfriend Peter. All in all one of the more enjoyable pieces of trash I've seen from schlock-maestro Adamson.","Reanhauer (Bill Roy), the leader of a strange religious cult, suffers from a heart attack while trying to resurrect a three week old corpse. When he pops his clogs on the operating table, his spirit possesses buxom nurse Sherri Martin (Jill Jacobson) and forces her to exact revenge on those present at his death.Nurse Sherri is incredibly cheap and technically inept in almost every way imaginable. The production values are pathetic: for the operation scene, cult director Al Adamson shells out for an oxygen mask and a saline drip—and that's it. The film also has one of the worst optical effects that I've ever seen in the form of the badly animated spirit that possesses Sherri, which looks like someone spilt some corrosive chemical on the negative and then scribbled on it with crayons. The performances are uniformly crap and the direction amateurish. The only half-decent death scene is an impalement by pitchfork. I watched the film last night and it had me drifting off quicker than a shot of Diprivan in the ass.However, today I have learnt of an alternative editVersion two is, of course, still cheap and technically inept in almost every way imaginable, but Adamson compensates for this by throwing in a lot more T&A, which as all fans of low budget horror know, always makes z-grade trash far easier to bear. In the spirit of fairness, I've checked out these racy scenes on YouTube and can testify that the naughtier 'adult' cut is the more entertaining option: curvaceous star Jill Jacobson gets naked (she remains frustratingly clothed in the tamer version) and the film benefits from a lesbian fantasy and an amusing scene in which a nurse gives a doctor head while he is presenting a lecture—all of which is more likely to keep the viewer awake for the duration.2/10 for the tame version; 4/10 for the saucier cut (which I'll average out to 3/10 for IMDb).","\"Nurse Sherri\" is proof positive that even a hack genre filmmaker like Al Adamson can still have it in them to produce something interesting and worthwhile. Compared to much of his output, this is actually pretty good. The acting (some of it, anyway) and the script (by Michael Bockman and Greg Tittinger, who also edited the picture) are above average. Dare I say it...Adamson crafts some striking and memorable horror here, especially the scene in the foundry.The film is still rather crude if you put it up against slicker, more mainstream horror, and the animation effect is primitive, but this viewer still has a good time with this one.Jill Jacobson plays the title role, who was present for an operation performed on a cult leader / necromancer named Reanhauer (Bill Roy). The trouble is, this was an operation that the patient did NOT authorize himself, so when he dies, his angry, vengeful spirit comes to rest inside Sherri, and compels her to murder the doctors who were involved. Sherri's lover (Geoffrey Land) and two of her co-workers (Marilyn Joi, Katherine Pass) all try to do something to reverse this possession.There is some stiff and awkward acting, but the actors and their characters are engaging nevertheless, especially lovely exploitation veteran Joi, whose nurse lusts after star football player Marcus Washington (Prentiss Moulden), who was blinded in a car accident. Although quite serious overall, there is time for levity as Pass demonstrates a very sexy bedside manner to a male patient. Jacobson isn't really given enough to work with to make her character all that sympathetic, however. It's the devilishly good Roy who manages to steal the show, although J.C. Wells gives him some competition as a follower who is terrorized by the dead mans' spirit. John F. Goff, another prolific actor in exploitation features of the time, does a fine job as a psychiatrist.It appears that the music used is stock music, but it's wonderfully theatrical schlock horror movie music that suits the material. And Adamsons' filmmaking may not be that slick, but it's clear that after a decade or so in the business, he'd honed his craft to some degree.Good fun, for undemanding genre fans.Also available in an 85 minute alternate version which puts the accent on sex rather than horror.Seven out of 10.","The film opens with a cult leader attempting to resurrect a dead member with his followers chanting for his rebirth as the sun strikes upon them in the desert. Reanhauer(Bill Roy)believes wholeheartedly in his power, and gets so worked up that he collapses with what appeared to be a heart attack. Unable to keep him alive, all those involved, doctors and nurses, are sentenced for attack with Reanhauer's demonic spirit invading the curvaceous body of nurse Sherri(..big-chested Jill Jacobson)targeting each one using her as a tool of vengeance. Forced against her will, with no memory of inflicting such harm, Sherri's host body murders selected victims. Fortunately, Sherri's fellow co-worker, nurse Tara(Marilyn Joi)begins a rather blossoming romance with a blinded patient, Marcus Washington(Prentiss Moulden), once a star football player, whose mother was a practitioner of voodoo. Through Marcus' knowledge, passed down from mom, Tara finds out about possession and how to possibly save Sherri before she murders everyone unknowingly. Meanwhile, Sherri's lover, Dr. Peter Desmond(Geoffrey Land)worries about her present condition and welfare.Well, this was my first Al Adamson film and I must agree with his detractors that, just from this film alone, it seems he holds them together with paper clips and Elmer's glue. The animation with which we see the spirit take control of Sherri is beyond awful and rather laughable. A little soft-core nonsense as filler, some demonic possession thrown in the mix(Sherri actually speaks in another voice when she's possessed), with naughty nurse behavior(..the three nurses focused on in the film all are quite sexually active and free-spirited)and a little bit violence/gore. The film is essentially shot in tiny rooms with dull dialogue from a rather mundane cast. The sexual situations aren't that hard-core and Al often shoots them without revealing all that much. The film looks embarrassingly cheap and there's an absence of thrills, although the chilling score(..which sounds like something from Dark Shadows)does help a little bit. Jacobson and Mary Kay Pass(..as nurse Beth who seems to be a nymphomaniac if she'll even screw a nutty patient, always complaining of illnesses he really doesn't have, with enough chest hair to declare him a Neanderthal)aren't bad looking, and Adamson's story-line, although frail, is somewhat coherent(..it seems he rarely directs films which are). Overall, the movie looks like it cost 5 bucks and Adamson just can not overcome the budgetary restrictions(..or, in my opinion, create an unpleasant enough atmosphere due to a sometimes plodding narrative and tedious scenes which do little for the story). John F Goff has the role of the hospital's psychiatrist who wants to commit Sherri, not believing the idea that she was possessed;he constantly bickers with Peter over her. I watched the unrated \"lost\" version which I guess is the real version to watch of Nurse Sherri.","The first 20 minutes were a little fun because I don't think I've seen a film this bad before {acting, script, effects (!), etc....}  The rest of the running time seemed to drag forever with every cliche in dialog used to no effect.  These people seemed to not really like horror movies or how to make them or any other movie.  There's no adult language, a bit of brief nudity, and no gore except fake blood smeared over no open wounds, etc..  It would have been rated PG in the early eighties and PG-13 nowadays.  I'm not sure how it got an R rating or if it really did.  I saw the American International release titled Hospital Of Terror.  I've seen 100 horror films in the past 12 months and this is probably the worst film I've ever seen. Here's an example of how bad it is:  There's one scene where something green comes through the door.  I'm not sure what it's supposed to be but what it is on screen is some kid's green crayon scribblings {I'm not exaggerating} super-imposed over the film, semi-moving inside the door, then its supposed to do something to Nurse Sherri to possess her I suppose.  I could not believe they had the lack of pride to show this embarrassment.","Nurse Sherri (1978) ** (out of 4) - Erotic version * 1/2 (out of 4) - Horror versionA religious cult leader is doing some sort of voodoo on a dead corpse when he suffers a massive heart attack. He's taken to the hospital where his spirit leaves his body and enters that of Nurse Sherri (Jill Jacobson). Soon the nurse is possessed with the spirit and goes on a killing spree.Oh yes, here's another film from cult director Al Adamson. If you're familiar with Adamson's work then you probably already know that he would make a movie and often times it would be released under countless titles and sometimes different versions. NURSE SHERRI is one example of there being two different versions out there and thankfully Vinegar Syndrome has released them together. Both versions try to cash-in on the \"Nurse\" genre that was so popular in the 70s. One version adds in some CARRIE moments and tries to pass it off as a horror film while the other contains more softcore sex scenes.Personally speaking, I thought the erotic version was much better simply because you've got some very beautiful women and seeing them naked was a major plus. As with most of Adamson's films, this one here has a rather sluggish pace but for the most part it's coherent and entertaining. I thought the softcore version worked the best because it didn't have as many boring dialogue scenes and instead we're treated to the beautiful Jacobson and Marilyn Joi doing what they do best. The horror version has them delivering more lines of dialogue than anything else so the spicy version is much more entertaining.The horror version does contain some pretty bad special effects with a green animated thing floating around the screen and this here was supposed to be the spirit. I doubt this would have scared anyone who originally saw this at the drive-in. I think Jacobson was entertaining in the lead role and she certainly at least keeps your attention throughout. With that said, NURSE SHERRI certainly isn't a masterpiece but if you're a fan of Adamson then it's worth watching.","I only came here to check Terror Hospital for an alternate title so I'd know what not to pick up. Not only do I get the original title, but I come to find Terror Hospital is one of seven more aliases.This one is a real clunker. Movies like this can usually be forgiven for any number of reasons, mostly unintended consequences of the feature on every level of production that result in at least a mild form of entertainment, mostly amusement. This has none of that. Instead, the viewer is witness to redundantly unnecessary and way-too-convenient-for-the-situation exposition and drawn out scenes of characters warily moving from room to room, and all this is half of the film. Forget trying to figure out where anybody is (or who they are) during darkened or nighttime scenes, too; you probably won't care, anyway. There is also a random car chase sequence that seems quite dull when compared to some of the old driver's ed movies I slep... er, I mean sat through and watched way back in high school. Really, we're talking about mysticism, possession, and a killer on the loose here - not a bad recipe for trash cinema. Unfortunately, there's nothing here to make it even \"good\" trash; when joined to the aforementioned, the bad acting and not-so-special effects are just that - bad acting and not-so-special effects. This one's just trash, pure and simple. Leave it on the rack at the pawn shop or in that box at the yard sale. There's a reason its there...","In 1978 the drive-ins were still the best place to find horror films. Always treated like the red headed step child they were the bread and butter for those passion pits across the country. The movies that played there ranged from mainstream films to low budget flicks but the low budget horror film seemed to fill those outdoor screens on a regular basis. With the success of THE EXORCIST and CARRIE it wasn't long before bits and pieces of both were used in some of these films. NURSE SHERRI used plot points from the first and ad images from the second. The end result is a movie that isn't all that great and doesn't quite make the \"so bad it's good\" ranks. But it does come close and is a part of drive-in history so I was glad to see it given this new treatment by Vinegar Syndrome.The story involves a cult leader named Reanhauer (Bill Roy) whose small group listens to him as he tells them one of their number recently deceased will be raised from the dead if they only have faith. While the tone here seems to draw connections to the occult it's never quite stated for sure that this is a devil worshipping cult or not. Needless to say the leader's promises of rising the now rotting corpse fall through and during a last ditch effort to pull it off he has a heart attack and is rushed to the hospital.He dies on the operating table but not before he has the chance to pass his soul off onto Nurse Sherri (Jill Jacobson). Lying in bed we watch as a green glowing blob makes its way beneath her door and wraps around her, transferring his soul. The effects are cheap but work, at least for this low budget flick.Angry that the doctors performed the operation without his permission Reanhauer now Sherri decides to have his vengeance on the surgical team. Killing them off is the intent and that doesn't matter who it involves, including Sherri's boyfriend and head surgeon Dr. Desmond (Geoffrey Land). The killings are fairly tame for movies of the time let alone by today's standards with little visuals but plenty of blood. With such a small amount of story to work with the film is padded with so much extra it almost feels like it was made up of various films tossed together. The whole sequence with the cult in the beginning seems to take forever. A side story involving a pro-football player who's been in an accident that caused him to lose his sight is tossed in as well as the adoring fan and fellow nurse who is attracted to him. Don't be fooled, this movie is definitely one of those ultra-low budget films that were there to sell popcorn and to offer something on the screen that horny teens could care less about while at the drive-in. That being said there is a certain amount of charm to the movie. It might not be something to watch on a regular basis but a night of bad drive-in flicks would be complete if this were in the line-up. There is another group who will demand that this film be added to their collection and that's fans of director Al Adamson. Adamson is well known for his low budget films and as co-founder of Independent-International Pictures he had plenty of chances to make movies that filled those outdoor screens for years. Perhaps his best known films were SATAN'S SADIST, a biker flick, DRACULA VS FRANKENSTEIN and THE NAUGHTY STEWARDESSES. His films have been rediscovered in recent years and this one is certain to be a must have.I'd seen this film years ago on DVD but forget who released it at that time. Needless to say the quality offered for the film was severely lacking. Vinegar Syndrome treats the film as if it was a rare gem to be polished and presented in the best possible way releasing it for the first time on blu-ray. The film was restored using the best prints available using the 35mm original negative. Not only that there are more extras included here than can be found on some major motion picture releases. These include a commentary track with producer Sam Sherman, NURSES CONFESSIONS a featurette with co-stars Jill Jacobson and Marilyn Joi, THEN AND NOW a locations featurette, a promotional still gallery, the original trailers and reversible cover artwork. The disc also includes an alternate feature length \"exploitation\" version of the film called KILLER'S CURSE. Several companies have made it their goal to resurrect lost treasures like this one and Vinegar Syndrome continues to do a bang up job of it. If you've seen this film before the odds are you haven't seen it in as clean a version as presented here. Adamson fans should grab a copy immediately. Horror fans should consider picking up a copy as well. And lovers of drive-in flicks will find this one worth buying too.","Young and beautiful nurse Sherri Martin (an appealing performance by buxom brunette Jill Jacobson) gets possessed by the dangerous and vindictive spirit of crazed preacher Reanhauer (a solid and charismatic portrayal by Bill Roy). Reanhauer uses Sherri as a means of getting revenge on all the people he believes are responsible for his death. Notorious drive-in schlockmeister Al Adamson handles the familiar, but still enjoyable premise with more competence than usual: The story unfolds at a fairly constant pace while Adamson crafts a reasonably spooky atmosphere and stages the gruesome murder set pieces with flair. The acceptable acting further holds this picture together: Marilyn Joi as the sunny Tara Williams, Katherine Pass as sassy strumpet Beth Dillon, Geoffrey Land as dashing doctor Peter Desmond, Prentis Moulden as easygoing blinded football star Marcus Washington, John Goff as a helpful psychiatrist, and J.C. Wells as booze-sodden paranoid Stevens. The spirited shivery film library score hits the stirring spot. The chintzy (not so) special effects possess a certain loveably shoddy charm. A pretty fun fright flick.","This is a hard film to rate. While it truly deserves its 3 (or perhaps even a two), for an Al Adamson film, it's exceptional--and practically Adamson's very best. That's because unlike many Adamson films, there are times when NURSE SHERRI almost looks competent. But, being an Adamson film, you know that sooner or later that crappiness MUST rear its ugly head! The film begins with some bizarre cult leader of a huge congregation (six) trying to resurrect a dead guy who looks like he's made of blue cheese. However, in the process, the cult dude has a heart attack and it taken to the hospital. He apparently dies, but it also seems like many of these hospital scenes are missing and a few of them appear much later in the film. In other words, when you see the film, he appears to have possibly recovered--only to hear later that he'd died. Because the guy is the b.f.f. of Satan, however, his evil soul can't die and he comes back to both haunt one of his henchmen and to possess Nurse Sherri.Now, Sherri is obviously a very disturbed lady--demonic possession or not. At times she acts like a zombie and at others she's violently homicidal. So I ask...\"why didn't her boyfriend (a doctor) think this was, perhaps, problematic?!\". In other words, after trying to kill a patient, he neither gets an exorcist nor commits her to the booby hatch!!! Oh, and speaking of boobies...this movie is NOT the breast-filled sex romp its title and posters would indicate. While there are a few bare breasts here and there, they are irrelevant to the plot and only seen very briefly (1/2 second or so) in all but one scene. So, if you are a perv, this movie is not for you--though a few places in the film (such as the nurse undressing for a patient) make it look like the film MIGHT have, at one time, been designed as a porn flick.If you are a bad movie fan, however, there is enough to whet your appetite. Some examples of incompetence are the inability of many of the actors to deliver lines that aren't zombie-like--and I am not even talking about Sherri. Especially noticeable is one of the very final scenes--I have never seen and heard some stilted acting and dialog in my life--and this includes Ed Wood's films! There are also a few more cheap touches, such as the bad animation of the \"green stuff\", the doctor finding a murdered nurse yet continuing to investigate in a house where walls are covered in blood (I'd get a cop...better yet, an army of cops).So despite these problems, why do I think it's good for an Adamson film? Well, the story isn't all bad and he was able to build tension very well. Many false alarms early on made my heart race a bit. Also, the car crash, while irrelevant, came off pretty well and was practically big-budget for Adamson.Overall, not a good film and one most people would be bored watching. However, fans of Adamson or inept films will like it--it does deliver some entertainment in a cheesy manner that will provide a few laughs.","This film, which I rented under the title \"Black Voodoo\" should be avoided. I was expecting a blaxploitation/horror flick; but what I got was a very dull, standard \"ghost extracts vegence\".  In this case the ghost was that of a religious cult leader who tried to refuse treatment, but who's plea was ignored and he died in an operation.  The result:  his spirit posesses Nurse Sherry and forces her to commit acts of murder. The only voodoo connection was to one of the three black characters, in this case a blinded ex-football player, who's mom practiced voodoo.  The film is very slow and very dull. There is a very standard ending that provides on excitement, followed by a horrificly stupid ending (warning: SPOILER)In which a woman actually manages to defend herself against murder charges by saying she was possessed.  This movie is slow, and bad in a non-funny, just stupefying way.  Avoid it at all costs."],"review-user":["exoticafan","InjunNose","jonathan-577","BaronBl00d","evildead1978","udar55","Rapeman13","BA_Harrison","Hey_Sweden","Scarecrow-88","Nate-9","Michael_Elliott","nowherefast72762","kirbylee70-599-526179","Woodyanders","MartinHafer","DrSatan"],"review-date":["7 April 2003","21 June 2005","7 June 2007","12 October 1999","25 September 2004","20 February 2012","15 July 2007","20 June 2015","29 May 2017","31 December 2008","25 February 1999","17 October 2009","12 June 2006","31 May 2018","30 May 2018","3 December 2009","24 August 1999"],"review-rating":["7","4","5","3","7","4","1","1","5","7","3","3"],"review-title":[" Review of DVD edition\n"," File under \"Spookier and More Atmospheric Than It Should Be\"...\n"," Adamson masters his craft, such as it is\n"," Bad...No Question..It's Adamson\n"," Rise William...RISE!\n"," Al Adamson jumps on the possession bandwagon\n"," Amusing piece of trash from schlock-maestro Adamson\n"," 2/10 for the version I saw. But there is an alternative\n"," My powers are limitless!\n"," Nurse Sherri\n"," This PG-13 fare is so bad it's numbingly horrible\n"," Decent if You Enjoy Adamson\n"," Avoid This One\n"," POSSESSED RN\n"," One of Al Adamson's better entries in the horror genre\n"," At times, it almost smacks of competence...almost.\n"," Awful mess...\n"]}