{"primary":["Quai des Orfèvres (1947)","https://m.media-amazon.com/images/M/MV5BZDQ4NDBkNzMtYTM1Mi00ODE3LWE5YTQtYjk5YjZiNDA0MmZhXkEyXkFqcGdeQXVyNTA1NjYyMDk@._V1_UY1200_CR92,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0039739/reviews","tt0039739"],"secondary":["\"Quai des Orfevres\", directed by the brilliant Henri-Georges Clouzot, is a film to treasure because it is one of the best exponents of French film making of the postwar years. M. Clouzot, adapting the Steeman's novel, \"Longtime Defence\", shows his genius in the way he sets the story and in the way he interconnects all the characters in this deeply satisfying movie that, as DBDumonteil has pointed out in this forum, it demonstrates how influential Cluzot was and how much the next generation of French movie makers are indebted to the master, especially Claude Chabrol.The crisp black and white cinematography by Armand Thirard has been magnificently transferred to the Criterion DVD we recently watched. Working with Clouzot, Thirard makes the most of the dark tones and the shadows in most of the key scenes. The music by Francis Lopez, a man who created light music and operettas in France, works well in the context of the film, since the action takes place in the world of the music halls and night clubs.Louis Jouvet, who is seen as a police detective, is perfect in the part. This was one of his best screen appearances for an actor who was a pillar of the French theater. Jouvet clearly understood well the mechanics for the creation of his police inspector who is wiser and can look deeply into the souls of his suspects and ultimately steals the show from the others. In an unfair comment by someone in this page, Jouvet's inspector is compared with Peter Falk's Columbo, the television detective. Frankly, and no disrespect to Mr. Falk intended, it's like comparing a great champagne to a good house wine.Bernard Blier is perfect as the jealous husband. Blier had the kind of face that one could associate with the man consumed with the passion his wife Jenny Lamour has awakened in him. Martineau is vulnerable and doesn't act rationally; he is an easy suspect because he has done everything wrong as he finds in the middle of a crime he didn't commit, but all the evidence points to the contrary.The other great character in the film is Dora, the photographer. It's clear by the way she interacts with Jenny where her real interest lies. Simone Renant is tragically appealing as this troubled woman and makes an enormous contribution to the film. Suzy Delair, playing Jenny, is appealing as the singer who suddenly leaps from obscurity to celebrity and attracts the kind of men like Brignon, the old lecher.The film is one of the best Clouzot directed during his distinguished career and one that will live forever because the way he brought all the elements together.","The Director loves the actress and it shows. The actress inhabits the character, whom we love at first sight and sound. The character loves her jealous unprepossessing husband and he loves her. His childhood friend secretly loves his wife and the fact that his friend is a beautiful woman makes the love tragic and ironic. His wife is jealous of his childhood friend and thinks her attentions are out of secret love for her husband.Then there is a murder and the investigating police lieutenant, who loves only his bi-racial son, and resents being taken from his company by the above characters, who have had some unpleasant contact with the deceased and are all lying to one degree or another, unravels the mystery with some of the most precise and authentic procedural detail ever captured on film.And then there are the atmospherics of a post-war Paris, where coal is in short supply, music is filled with erotic longing and wistful memory, and innocence has long ago been washed away by the rain.All of this in a milieu of magicians whose tricks don't always work, dogs who walk on their hind feet and express music criticism, hungry news reporters and exhausted cops.And then there are many of the finest actors of their generation who have been through some very bad years directed by, to come full circle, a man who is in love with his lead actress and who, with full justification, was a respected friend of Picasso.I've seen this film often and I love all of them and it.","The extraordinarily adorable Suzy Delair plays a statuesque performer obsessed with succeeding in the theater. Her husband and accompanist, played by Bernard Blier, is a composed but jealous man. When he finds out in a less than preferable way that his flashy wife has planned a rendezvous with a lecherous old businessman with the intention of advancing her career, he loses all control and threatens the businessman with murder. Now, at that point, I must stop describing the film to you because it skates on such thin ice with its twists, revelations, ambiguities and suspense that to imply any of it would endanger it. I am not sure how good or bad that is for this French police procedural emanating from the song- and-dance community, though it is certainly interesting that what we do know throughout is who did not do it. We just don't know who did.The story depends upon the procedure of following clues, where ideal alibis fail and where cautiously created fabrications and deceptions disintegrate. Interestingly, this is a suspense film in which suspense is generated in spite of the knowledge one would traditionally think too much too soon.Quay of the Goldsmiths is the least dark of Henri-Georges Clouzot's films. It's nowhere near as sinister as the shocking Les Diaboliques, as tragic as the riveting Wages of Fear or as eery as Le Corbeau. Maybe it is due to the vibrance of the dance halls and theater settings of 1940s France, which all work as the milieu of this crime thriller.Clouzot both understands and approves of his characters, even the more rotten ones, where he has more of a vindictive streak with his other films. Where he may have had understanding for the scheming women in Les Diabolique or the truck drivers who sink to the level of risking horrible death in order to oust themselves from miserable life in The Wages of Fear, there isn't necessarily support or agreement on the part of the filmmaker, for these are characters who plainly made the direct decisions that determine their fate. All the characters in this more settling film have scenes and moments that endear us to them, even the harsh, cold detective played by Louis Jouvet, who worries about his young adoptive son amid all the trouble and despair that happens in his life at any time with the drop of a hat.There is humor and unabashed sexiness, the latter mostly on the part of Delair, that neutralize the pressure to a degree. Clouzot was quietly practicing his craft, patient till he made his unrelenting later films, in which he would permit his audiences no pardon from the tension.","First of all,there is a detective story:\"légitime défense\" by Belgian Stanislas André Steeman whose \"l'assassin habite au 21\" Clouzot had already transferred to the screen in 1942,with Pierre Fresnay and the same actress Suzy Delair.Steeman complained about Clouzot's adaptation for both movies.The movie from 1942 was excellent,but the \"detective story\" side had been kept,so why complaining?As for \"Quai des orfèvres\",Clouzot was now in a new phase of his brilliant career.After having directed \"le corbeau\" and been blacklisted,he had a lot more to say than a simple whodunit.Steeman complained essentially about the poor detective ending,which I will not reveal of course,but Clouzot focused on the social vignettes,on his characters's psychology,and he did not give a damn about the puzzle à la Agatha Christie.By doing so,he becomes the genuine predecessor of CLaude Chabrol who has always been closer to him than to Alfred Hitchcock whom he admires much though. Suzy Delair has great screen presence,and you will love the song she really sings(she was a singer too)\"avec son tralala\".Bernard Blier gives ,as ever,a sparing of gestures and words performance,and he really pulls it off .Two characters are particularly interesting and disturbing:the first one,Dora,the photographer:she takes pictures of female models ,and Clouzot,by subtle touches,reveals us she's a lesbian.Of course,the word is never uttered(How could it be in 1947?) The police chief (fabulous Louis Jouvet) tells her:\"You and me,WE are not lucky with women.\"The portrait of this cop is very detailed:we learn a lot of things about him,not necessarily connected with the Delair/Blier plot:he's a widower ,with a son he adores and who runs into school difficulties,particularly in geometry.So we get to know all the characters in depth.One of the most important manifesto of post-war French cinema.","This is an exceptional picture with so much to recommend it. The acting and writing are terrific and there are lots of great twists and turns in the plot. As a French \"Noir\" film, its language is certainly a lot earthier than its American counterparts, but to me this just added to the realism. Additionally, I liked how non-glamorous everyone was--particularly the husband and the lieutenant. About the only negative, and the reason the film gets a 9 and not a 10, is because there was a glaring plot hole. Like another famous French film, Drôle de Drame, the confusion between the cops and the accused could easily have been settled in the beginning, but the characters made rather stupid decisions. For this, you just need to suspend disbelief and keep watching--the payoff is well worth the wait.This is simply one of the finest French films I have seen. Period.","H.G. Cluozot had difficulties working in France after he had made \"Le Corbeau\" in 1943 which was produced by the German company and later judged by French as a piece of anti-French propaganda. Louis Jouvet, an admirer of Clouzot's work, invited him to direct a thriller \"Quai des Orfevres\" where he played an ambiguous police inspector investigating a murder that happened in Paris Music Hall. Without each other knowledge, the seductive cabaret singer Jenny Lamoure (Suzy Delair) and her jealous piano-accompanist husband Maurice who is madly in love with her (Bertrand Blier, father of director Bertrand Blier) trying to cover up (without each other's knowledge) what they believe to be their involvement in the murder? Enters tenacious policeman (Louis Jouvet) who is determined to discover the truth. Jouvet practically stole the movie with wonderfully cynic and sentimental in the same time performance. \"His character, his eagle-like profile and his unique way of speaking made him unforgettable.\" \"Quai des Orfevres\", witty and atmospheric observation of human weaknesses was a great comeback of H.G. Cluozot, the fine director, \"French Hitchcock\".","A nice, humorous mix of music hall (in the first third mostly) and police procedural mystery as the various suspects' stories start to collapse.  The final exposure of the murder may come as a surprise if you don't watch closely. A gritty look at Paris of the time. You can ignore the final scene (the Hollywood ending). Louis Jouvet is best as the police inspector who seems to be just passing through, but is really on top of things.","After his shocking masterpiece LE CORBEAU was denounced by both the Gestapo AND the Resistance (who felt its negative portrait of the French was pro-German; and they did have such a wonderful war), Clouzot was suspended from film-making activities for three years.  If it was expected on his return that Clouzot would try to 'atone' for his bleakness with more reassuring fare, than people didn't know him.  QUAI DES ORFEVRES seems an easier pill to swallow than its predecessor - the brooding Expressionism of LE CORBEAU is more restrained here; the characters are nicer; there is even a bright, happy ending set at Christmas, time of rebirth, renewal, redemption - then it's just as hard to digest.Although billed as a Louis Jouvet film, the great theatrical innovator who plays the bluff detective, the first third concentrates solely on the build up to the crime, and is a wonderful insight into the theatre and domesiticity.  Jenny Lamour is a singer determined to make it big in the music hall.  This, of course, means pursuing dubious contacts, inflaming the insane jealousy of her timid, balding, accompanist husband, Maurice Martineau.The more successful Jenny becomes, the more elderly gentlemen friends push themselves in her interests.  One in particular, an odious, wizened, lecherous old goat keeps inviting her to restaurants and his huge town mansion.  Exasperated, Maurice storms into his booth and threatens to kill him.  One night, his wife goes off to meet him anyway.  Armed with a pistol, he goes to the lecher's mansion, only to find signs of a struggle and the man's corpse.Made during the great cycle of Hollywood noirs, ORFEVRES departs from its more famous counterpart in a number of ways.  There is no chic fatalism here: the working class background roots the characters in genuine social problems, rather than some vague existential trauma - Jenny's urge to make it as a star is as much an attempt to escape poverty and paralysis as it is to court attention, while Maurice's conservatoire training has only kept him down as a virtual menial.  This complex mixture of class and gender relations is uniquely European.So when Clouzot overlays the screen with bars - on windows, doors, stairs, grates etc. - he is not using an overused trope suggesting metaphysical claustrophobia, but showing how his characters' lives are a literal prison, partly through chance, which is why we have a thriller, but also by a circumstance that means Jenny has to virtually prostitute herself to raise her station.  The film, then, concentrates less on the thriller mechanics (which are still exciting) than on the plot's effect on two ordinary people way out of their depths, one driven to despair.  When, at the end, amid the bright lighting and festive japery, Clouzot frames his couple through a frighteningly tangible set of bars, as well as sadistically (if comically) interrupting their idyll, we feel a chill.In keeping with the French crime tradition, Clouzot's surface realism is subverted at every point.  The dingy flats, the packed, smoky  nightclubs, with their lecherous men and disapproving women, all bespeak authenticity. But the theatrical setting gives the movie a playful feel, as if people are playing a role, nobody being quite what they seem.  The film frequently breaks for musical interruptions as if the whole thing is a show.  The importance of mirrors, especially when Maurice comes to the nightclub on the night of the murder, seems transformative, as in a fantasy, an entry into a mirroring, but alternative universe, as well as revealing the fragmentation of characters torn between desire and reality.  Clouzot's strange, alienating editing in moments of high realism confirms this.  This is not to minimise the characters' trauma, or the seriousness of the film - Clouzot just asks us not to accept the surface of the film too passively.For a supposed misanthrope, Clouzot was always a great director of actors, and he has three of the best here - Suzy Delair offers a vibrant vulgarity rarely seen in elegant French cinema; the incomparable Louis Jouvet suggest the perversion and sadism behind his gruff, decent Inspector.  Bernard Blier, through, is a revelation - sweaty, blank, passionate, a 40s Monsieur Hire; his continual buffeting in this film, from envy to despair, is painful to watch.","Is it a murder mystery? Is it a police procedural? Is it a back-stage look at seedy French music halls? Quai des Orfevres is all of these, but more than anything else it's an amusing comedy of infidelity, jealousy and love, set in post-WWII Paris. It may be surprising that Henri- Georges Clouzot, the director of such grim films as Le Corbeau or such suspenseful nail- biters as Diabolique and The Wages of Fear, is the director of this one. Clouzot, however, was a shrewd film-maker. \"In a murder mystery,\" he tells us, 'there's an element of playfulness. It's never totally realistic. In this I share Hitchcock's view, which says, 'A murder mystery is a slice of cake with raisins and candied fruit, and if you deny yourself this, you might as well film a documentary.'\" Quai des Orfevres is a wonderful film, and it's no documentary. Jenny Martineau (Suzy Delair) is an ambitious singer at music halls and supper clubs. She's a flirt, she's sees nothing too wrong with using a bit of sex as well as talent to get a contract. Her stage name is Jenny Latour. And she really loves her husband, Maurice Martineau (Bernard Blier). Martineau is something of a sad sack. He's her accompanist and arranger. He's a bit balding, a bit chubby and jealous to a fault. Then we have their neighbor, the photographer Dora Monnier (Simone Renant). She's blond, gorgeous (think of Rita Hayworth) and capable. She and Martineau have been friends since they were children together. Dora, however, is definitely not thinking just of friendship when she looks at Jenny. Then comes along Georges Brignon (Charles Dullin), a wizened, rich and dirty old man, who often has Dora take \"art\" photographs of his young female proteges whom he poses himself. He offers a contract for a film to Jenny, and suggests a dinner at his home to discuss the details. Jenny is more than willing. Maurice is furious and forbids it. Jenny shouts right back at him, \"You're jealous of the rich! Well, I want my share of their dough. I'm all for royalty!\" \"You're dad was a laborer,\" Maurice shouts back. \"So what? Under Louis XV, I'd have been Madame de Pompadour! I'd have heated up their tights!\" And after Brignon is found dead with a smashed champagne bottle next to his bleeding skull, there's Dora to try to make things safe for Jenny. But wait. Inspector Antoine gets the case. Antoine (Louis Jouvet) is a tall, tired, middle-aged bachelor with sore feet. He has seen it all. He served in \"the colonies\" with the Foreign Legion and returned with an adopted baby and malaria. The child is now about eight-years old and Antoine dotes on him. One of the first things Antoine discovers is not only did someone brain Brignon with a bottle, someone shot him in the heart. Who did it? Before long Jenny, Maurice and Dora all are making up alibis, lying and, at one or another point, confessing. How will Antoine discover the murderer? Will we have a chance to see some great music hall songs sung by Jenny Latour? Everything becomes clear, but only with time and Detective Antoine's persistence. We are left with many kinds of love leading to all kinds of motives, from hair-trigger jealousy to longing glances...and all played with a nice mixture of Gallic amusement. Clouzot takes us to a Paris of seedy but not threatening neighborhoods, to downtrodden music publishers where tunes are played on the piano for buyers, to restaurants with discrete private dining rooms. Most of all, he takes us to the music hall where Jenny Latour often performs. We can see Jenny as she sings, with couples in the seats and single men wearing their coats and hats in standing room. And everyone smokes. The first third of the film, in fact, takes place largely in this milieu. With Jenny singing about \"Her petite tra-la-la, her sweet tra-la-la,\" we follow her from trying out the song at the publishers to a rehearsal to a saucy performance with Jenny in a feathered hat, a corset, gartered stockings and not much else. Delair, Blier and Renant all do wonderful jobs, but it Louis Jouvet who holds everything together. He was a marvelous actor who disliked making films. The stage was his world, and he took on films only if he happened to like the director and to make money to finance his stage work. Jouvet was tall with a long face and broad cheekbones. He was not conventionally handsome but he had what it takes to dominate a scene. For a look at how skillfully he could play comedy, watch him in Drole de Drame. He's a fascinating actor. At one point he says, \"I've taken a liking to you, Miss Dora Monnier.\" \"Me?\" she asks. \"Yes. Because you and I are two of a kind. When it comes to women, we'll never have a chance.\" Jouvet brings all kinds of nuances to that line, from rueful regret to a gentle amusement.","In the postwar Paris, the accompanist pianist Maurice Martineau (Bernard Blier) is a jealous man from the upper class married with the ambitious singer Marguerite Chauffournier Martineau, most known by her artistic name Jenny Lamour (Suzy Delair), a woman with past from the lower classes. When the lecher but powerful Georges Brignon (Charles Dullin) harasses and invites Jenny for dinner promising a role in a film, Maurice goes to the restaurant and threatens Brignon. A couple of days later, Jenny tells Maurice that she is going to visit her grandmother in another town. However, her husband finds a piece of paper hidden in the kitchen with Brignon's address. Maurice goes to the theater to have an alibi and heads to Brignon's manor during the show with the intention of killing the old man. However, he finds Brignon's house open and the man dead on the floor. When he leaves the crime scene, his car is stolen and Maurice has to walk back to the theater. Meanwhile, Jenny arrives in the house of the lesbian photographer Dora Monier (Simone Renant), who is an old friend of Maurice and has a crush on Jenny, and tells Dora that she has just killed Brignon. But Jenny notes that she had forgotten her fur on the couch in the living room of Brignon's house and Dora takes a cab to retrieve the stole. Inspector Antoine (Louis Jouvet) is assigned to investigate the case and sooner he visits Jenny, Maurice and Dora to check their alibis for that night in the beginning of his investigation. \"Quai des Orfèvres\" is an amusing story of an efficient detective investigating a murder in a comedy of errors of the three lead suspects. Henri-Georges Clouzot is one of the best French directors ever and \"Quais des Orfèvres\" is another gem in his filmography. The witty screenplay has many twists and is supported by the magnificent cinematography in black-and-white and awesome performances. Bernard Blier, the father of Bertrand Blier, is perfect in the role of a jealous cuckold without confidence in his wife and self-respect. Suzy Delair performs an ambitious woman that has a past with lovers and wants to climb positions in the show-business, but loves her husband. Simone Renant is great in the role of a lesbian photographer. But who steals the film is Louis Jouvet, in the role of a detective that seems to be naive, but is capable to find the truth that each character intends to hide. My understanding is that Antoine might be gay since he does not like women. My vote is eight.Title (Brazil): \"Crime em Paris\" (\"Crime in Paris\")","I know a lot of people will say that the director made this potential thriller into a dull film deliberately, but, to my way of thinking, that doesn't excuse the fact that it is often downright boring. Frankly, I and at least 97% of the audience don't care why it is dull, simply that it is dull -and that makes it a chore to sit through! So what we actually have here is an extremely old-hat detective yarn with a lame conclusion. It's rather sluggishly paced. But not only is it slow in the telling, it is saddled with an unsympathetic lead (Bernard Blier), and a heroine (Suzy Delair) who admittedly has a few bright moments, but is mostly rather boring. On the plus side, the great Louis Jouvet does what he can with the detective part and the film has been well produced on a sizable budget. Occasionally, the direction is quite slick. On the other hand, the photography is always skillful and the music score attractive.","Henri-Georges Clouzot's \"Quai des Orfevres\" (1947) stars Suzy Delair, Bernard Blier, Louis Jouvet, and Charles Dullin. The story takes place in post-war Paris, where an accompanist, Maurice Martineau (Blier) lives with his singer wife, Marguerite, better known as Jenny Lamour (Suzy Delair). An important man, Georges Brignon (Dullin) promises Jenny work, and because she's ambitious, she flirts with him. Maurice is an extremely jealous man, so he finds Brignon in a restaurant and threatens him.Later on, Jenny tells Maurice she is visiting her grandmother, who lives in another town. This gives Maurice a good opportunity to bump off Brignon, especially when he finds the man's address on a piece of paper in the kitchen and realizes Jenny was lying. But when he gets to Brignon's house, Brignon is already dead.Inspector Antoine (Juvet) is assigned to the case, and it doesn't take him long to realize that some alibis aren't very secure.Wonderful film, with the excellent Juvet outstanding as Inspector Antoine, and an excellent performance by Simone Renant as a lesbian photographer, Dora, in love with Jenny. Delair, who was involved with Clouzot, is good as a lower-class woman who loves her husband but wants to get ahead in show business as well.This is Clouzot at his best, with a witty script with some plot twists and a true Parisian atmosphere.","Clouzot followed Le Corbeau, where no one knew who was penning the poison thus everyone was suspected, with another masterpiece, Quai des Orfevres four years later in which we know from the outset (or think we do) whodunnit. Top-billed Louis Jouvet doesn't appear for forty minutes by which time Clouzot has established a rich milieu of Music Hall, music publishers, etc and a fine cast of colourful characters; Angela Lansbury lookalike (Lansbury appeared in Woman of Paris that same year) Suzy Delair scores as the chanteuse whose desire to improve her lot inspires the jealousy of her husband/accompanist Bernard Blier who follows her to the home of an elderly letch only to find he is already dead. From here things go seriously wrong, his car is stolen before he leaves the premises so his pre-arranged alibi is out the window whilst meanwhile, unknown to him, his wife confesses to the murder to the photographer neighbour, a closet lesbian in love with her, who volunteers to return to the crime scene and retrieve Delair's scarf and as long as she's there,thoughtfully wipes her prints of the murder weapon, a champagne bottle. At this point investigator Jouvet gets involved and from then on it's a case of keeping the plates spinning in the air. Clouzot's output was relatively small but virtually all of it was, as Spencer Tracey said in another context, 'cherce', with Le Salaire de peur and Les Diaboliques still to come. In short this is a must for French cinema buffs.","Great artists, always suffered while they were young. I could mention Mozart and Beethoven, but that is not the point. This movie was made by H-G Clouzot whose family wanted him to succeed in the Law professions.Its main star is Louis Jouvet who studied and practiced as as pharmacist before becoming \"The Greatest Actor\" and also director of France's Theater before and after WWII.They both had health problems. Clouzot had TB while young, Jouvet had cardiac problems and died on a theater..Such events shape the character of men (and women, of course). One might even say that today's Artists are so poor, because they had never suffered and fought for their lives.To me, this is the greatest of Clouzot's movies. \"Wages of Fear\" is greater in \"suspense\", \"Diabolique\" also has more \"suspense\" and a better plot and is more about \"female evil\".Quai des Orfèvres is more human. Clouzot was falsely accused by De Gaulle's entourage (mostly communists and Jews) of collaboration with the Nazis and banned from making films until until De Gaulle left France's Government in early 1946. De Gaulle came back in 1958, as President.The main characters are all good souls: Jenny L'Amour may perform as a \"putain\" on stage, but she is not a \"whore\" (dictionaires make synonyms of those words, but they are not the same), loves her husband, and refuses the slight \"advances from her (presumably Lesbian) friend Dora, the photographer.Maurice the husband is jealous and timid, but runs away from the scene of the crime. He is a coward because he fell in love with a woman and traded an eventually more upscale career for love..Antoine, the detective (interpreted by the great Louis Jouvet, basically a stage actor, performs in this French \"Gray\" not Noir, as well as E.G. Robinson in \"Double Indemnity\") shows flair for pseudo criminals, tenderness for a Negro son(?), and compassion for the true author of the crime, because he remembers that is father cleaned the latrines at some nobleman's château!!Clouzot was capable of slapping an actor's face in order to put him in the right frame of mind, but deep inside he was very human. I have his horoscope in front of me. He had Venus in Sagittarius which means open-heartedness, devotion, charity and altruism. For those who do not believe in Astrology, my most sincere apologies...","What do you get when you have a tenacious, seasoned French police inspector by the name of Maurice Martineau is called to solve a murder case?  Well, simply a very entertaining, fun film.  The re-mastered black-and-white film \"Quai des Orfevres\" delivers the goods despite romance, jealousy and marriage that seem to just get in the way towards the truth of 'who done it?'Inch by inch, technique by technique as seasoned by experience and intuition,  the patience of this master Inspector etches into the truth -- but of course, with the help of a bag full of dirty police interrogation tricks.Martineau is the centerpiece of this film.  The use by director Henri-Georges Clouzot of raucous background music to intensify the drama in grand film noir style is a wonderful wrapper around the visual experience.Martineau eventually solves the mystery and arrests the culprit.  Hey, he is good!!  But alas, Martineau, too, can keep a dark secret in his past.  Who is that boy that is perhaps not his son?Some things can never get solved -- even beyond the closing credits.","Henri-Georges Clouzot's film is quiet an example of the french transition cinema. A film between the realism of the postwar cinema and the full-of-magic and symbolism nouvelle vague. With some spots of the American classic films (but not imitating it) the director tales us a story about love, crime and the importance of points of view. We can find great actors too (Suzy Delair is impeccable).Is interesting too, how we can find aspects of this film nowadays. Quai des Orfèvres inheritance is palpable in Woody Allen tradition. Plunging a crime situation in a picturesque environment. The naive ending is also typical in Steven Spielberg's good-ending films. And finally I would like to point out, the deja voo sensation during the photography session between Jenny Lamour (Suzy Delair) and Dora Monier (Simone Renant) in which the first one confess that she thinks her husband is being unfaithful and exactly with the woman who is photographing her. That scene is exactly the one between Natalie Portman and Julia Roberts in Closer (Mike Nichols, 2004).","Finally getting hold of Studio Canal/Optimum World's excellent box set of auteur Henri-Georges Clouzot work,I discovered that along with 2 Clouzot movies that I've read a lot about,that there was a third Clouzot film that I've never heard of before!,which led to me deciding that it was time to take a glimpse at the unknown Clouzot.The plot:Catching everyone's attention on stage, Marguerite Chauffournier Martineau dreams of being a major star. Desperate to see her name in the bright lights, Marguerite starts getting very close to stage owner Georges Brignon.Less than happy with the advances his wife is making to Brignon, Maurice Martineau meets Brignon in public,and tells Brignon that if he sees him with Marguerite again,he will kill him.As the threat that Maurice made is left lingering in the air,Brignon is found brutally killed.Getting assigned the case,inspector Antoine soon discovers that Brignon was recently threatened with murder.View on the film:Returning to the champagne opened from his 1942 movie The Murderer Lives at Number 21,co-writer/(along with Jean Ferry) director Henri- Georges Clouzot and cinematographer Armand Thirard cloud the bright sparks of the past with the clouds of Film Noir.Going backstage,Clouzot gives the title a touch of old Hollywood glamour,by treating the Cabaret songs (!) and slap-stick antics with an elegant shine. Tearing away at the dazzle with Film Noir blades,Clouzot superbly aims for a stylish depth of field which pulls the darkness over the Lamour's into the limelight,which cracks the backdrop into dazzling shadows seeping Film Noir blood over the decadence.Adapting Stanislas-André Steeman's (then) out of print book from memory (!) the screenplay by Clouzot & Ferry strikes the murder mystery with a brittle Film Noir edge. Firmly placing the Martineau's in a light and fluffy showbiz world,the writers brilliantly criss-cross the \"caper\" genre into Film Noir,by cleverly cracking the Martineau's \"caper\" mind set with short,sharp shots of Film Noir reality.Finishing on a Christmas final,the writers thankfully make the path a far from merry one,due to the snow by swept away by Antoine tents investigation shattering the Martineau's pristine image.Enchanting everyone on stage, Suzy Delair gives a glorious performance as Femme Fatale Jenny Lamour,whose thirst for the bright lights Delair drinks up,with a delicacy to keep everyone else coiled round Jenny's fingers,which is displayed by Delair keeping Jenny fixated on the lights,even as Brignon's blood bleeds across the stage.Trying to break the silence, Louis Jouvet gives a great performance as Antoine,thanks to Jouvet pilling Film Noir tension on Antoine's shoulders to make cracks appear in the Martineau's icy relationship.Cast out into the wilderness, Bernard Blier gives an amazing performance as Maurice,who Blier locks into a pressure cooker of rage and doubt,as Maurice tries to keep Jenny in the limelight.","One of the best film I ever saw.The performance of Louis Jouvet is fantastic. He really 'fill' his part, and this is wonderful. He's such a good actor that you can't think of anyone else to take his part. And both Suzy Delair and Bernard Blier are good as standard french people, trying to defend themselves in the struggle born with a murder...The story is breathtaking and well built. You can feel the ambiance of Paris for that period (which is about 1930-40), between two wars... The clubs, the old little buildings, the neighbors.All those things contribute to make a great movie.","It's hard to believe that the same Henri-Georges Clouzot who made \"Le Corbeau\", \"Le Salaire de la Peur\" and \"Les Diaboliques\" made this terrific comedy-thriller. It's about the murder of a loathsome businessman and impresario and the three main suspects are one of his potential protégés, (Suzy Delair), her jealous husband, (Bernard Blier), and a female photographer, (Simone Renant). Louis Jouvet is the investigating inspector and his methods are, to say the least, somewhat unorthodox. The setting, superbly captured by Clouzot and his cameraman, Armand Thirard, is the seedy milieu of the Parisian music-halls. It's very funny and beautifully acted and less obvious than its surface suggests. But perhaps the most surprising thing is that the usually morose to the point of morbidity Clouzot could display such a light touch. A real treat.","To non-French audience, \"Quai des Orfèvres\" carries the same resonance than 'Scotland Yard' for British people as the legendary Police headquarter Police in Paris, preceded by number 36, and the setting of the most memorable criminal resolutions that nourished French pop-culture of the early century: Landru, la Bande à Bonnot etc. So as the title indicates, Henri-George Clouzot's classic, is a police procedural, but there's more to see in the film besides the realistic and thrilling elements of a crime investigation.What strikes first and what I immediately associate with the film is the score, the musical version of the main song \"Avec son Tralala\" which is continuously sung by Jenny Lamour (Suzy Delair) during the first act. What begins as a simple ballad turns into a smash hit, joyful, naughty and unbelievably catchy, to a point I kept it stuck in my head for many days after watching the film. The 'tralala' is a sort of childish onomatopoeia referring to the beautiful behind of a Spanish gypsy girl, who didn't need 'maracas' to charm men, only her magnificent, natural assets. The music remarkably contrasts with the overall tone of the film but efficiently establishes the setting of the investigation: the music-hall, a decadent and permissive world. Henri-Georges Clouzot has an endearing quality, his thrillers are appealing to universal audiences but they're always set in a particular world: truck drivers, boarding school, a small village, his movies are an opportunity to discover a slice of French life in a determined era. And it's precisely for his ability to be so specific that his films can work as universal explorations of the human soul. The music hall or showbiz is the perfect setting to crystallize such emotions as ambition, jealousy or cynicism. They are also mirror the vices of a society, through the character of Jenny who makes eyes on anyone who can help her to succeed in theater, to Maurice, his mild-mannered and jealous accompanist and husband, played by Bernard Blier, and Dora, Simone Renant as the cynical charm photographer, friend of both. Yet the most despicable of all is Brignon (Charles Dullin), an old lecherous businessman, who visits Dora just to admire some naked girls. With Dora, Maurice and Jenny, the film seems to open on a triangular love, a plot device cherished by Clouzot.But as usual, clichés are misleading, Dora is obviously not interested in men, but ready to help their friends, Jenny loves her husband and Maurice is the kind of guy who can make death threats but is not so hot when it comes to pull the trigger. These flawed but realistic characters are inevitably put in a tricky Hitchcockian situation. Jenny has a secret rendezvous at Brignon's house but the date turns sour and she knocks him out with a champagne bottle and escapes. Maurice finds his address and goes confront him in the house, before ensuring a perfect alibi, but when he enters his house, he finds him dead and when he leaves it, his car has disappeared. This might suspend some viewers' disbelief, but nothing is hazardous in the film. To make things even more intricate, Dora goes at Brignon's to erase the fingerprints, take Jenny's fox scarf and while she's there, knocks the dead man in the chest, in one of the most cruel and memorable scenes from any Clouzot's film. Last revelation, the man was shot with a bullet in the heart, which makes four people who went to the victim, four potential suspects. The plot starts like a reverse whodunit, but at the end, it's still a whodunit. Maurice is supposed to go the music hall, only when he comes back, he raises suspicion by being the only one not to notice one flaw in the show, Jenny went to her grandmother at the last minute, and Dora left a blonde hair on the crime setting.Still, the film would never have reached its legendary status without Jouvet as Inspector Antoine, a fifty something inspector, tall and lanky, with cut head and sharp eyes, he's intimidating without being unfriendly and cool without fooling anyone, the Anti-Columbo with the same likability. As soon as he makes his entrance, he's the one driving the action and all the characters turn to a passive status while he confronts them to their contradictions. The genius of \"Quai des Orfèvres\" relies essentially on the writing, the way the character interact, the social discussions, the way each clue is obtained after a clever trick. Pierre Larquay, one of Clouzot's regulars, plays a taxi cab driver that took a blond blonde to Brignon's, but while some people genuinely go to the police, the driver refuses to be a stool. The last exchange with Antoine before he would finally confess is simply delightful, and a clever demonstration of police procedural à la Française. I wondered if the driver wasn't meant to make up for the villagers of \"The Crow\" and the whole paranoid and denunciation-inducting atmosphere. One even has to wonder if the film doesn't carry some dark and pessimistic undertones inherited from the German Occupation, which contributed to the deterioration of the Police's image. But the film doesn't make statements about who's right or who's wrong, it doesn't manipulate our empathy but rather offers us a gallery of characters who're all identifiable by their jobs: cab driver, policemen, singers, photographers, and this is why \"Quai des Orfevres\" surpasses many French stories, like all Clouzot's films, it's a slice of people's life, a powerful social commentary, set during the Christmas holidays, which gives its final Dickensian flavor.Clouzot is the director who gave its letters of nobility to Popular Cinema, I'd rather watch one Clouzot film ten times in a row rather than any other so-called New Wave existential stuff.","Should we take the opening shot as a strange frame??? I guess we have to. Anyway two women are behind a closing umbrella, they walk upstairs to the talent agency and we go with them...and then they are never to be seen again. Okay, how come not INSIDE the place, at the piano, or even outside with the SOUND of the piano, then track inside and over, a la Hitchcock??? So I guess Clouzot is already telling us in a not very subliminal manner that we are following a segment of postwar society: especially how he then uses a Citizen Kane=like song cut up into about five pieces to show the lady singing traveling from the talent agency all the way to her first roses and applause of her Vaudeville debut.After that we are relentless observers of more or less small disgusting details of a defeated country getting off its war torn tattered knees. And nobody ever handled small disgust better than Clouzot. In fact, too bad he never tried Sartre's Nausea. Almost everything we see after the first few minutes makes us ever so slightly queasy. ....okay, okay I'm grossly overstating that, let's just settle for a general feel of a lot of the film. Look carefully, in fact, and you will even see one of the cops picking his nose. And in how many films has anyone ever done that. Then there is a very loud nose blowing bit in front of the photographer lesbian by the main cop, and notice that she does not, literally, blink an eye or raise an eyebrow.The point of all this is an almost feverish immersion in contiguity, seemingly, until you can smell practically every scene as well as see and feel it. As for the other aspects of the movie, others here have covered them in a lot more detail than I. But forget about the mystery here: this is the ultimate McGuffin. Clouzot is about as interested in the real killer as those two women coming in out of the rain in the first few seconds of the film and are never seen again. From beginning to end all he wanted to do was follow a bunch of people around, not even particularly interesting ones at that, and say, here look at this woman's twitch, that man's hitching of his pants in all their insignificance, years and years before Tina Turner was singing we don't need another hero. \\Even the forced levity of the ending is bleakly done in a dilapidated part of Paris, and rather chilly bare walled apartment. With only the couples love for each other to see them through, as if to say there must be two or three million like you throughout the city, working your fingers off by the day for a little love at night.From this it was just a short step to Wages of Fear and the ultimate in despair. They don't even know how to make films like this anymore in the U.S. For that matter, they didn't even know how to very much in France then, much less now. The relentless detail of gesture makes even the neorealists of Italy look like bad psychologists. Which I guess makes Clouzot a kind of Rosselini on speed. Very enjoyable nonsense, this movie. The only flaw, seems to me, and as was pointed out by another viewer, the lead woman is somehow not quite right. Everybody else in the film is just about perfectly cast.","Pretty good movie about a man and his wife who get caught up in murder and the police officer investigating the case. It starts off marvelously, but kind of hits a wall at a certain point. We're sure we know what happened, then a tiny plot thread that seems at first like a red herring pops back up and disappoints. Still, Clouzot's direction is great, and the acting is quite good. Louis Jouvet, who also co-starred in Marcel Carné's Drôle de Drame, gives the best performance as the clever detective. I wonder if the Coen brothers were influenced by this film when they wrote Fargo. Much like that film, the police officer doesn't appear until nearly halfway through, and then he becomes almost the focus of the film. There's also a lot of droll comedy surrounding him (although sometimes his methods seem sort of fascist).","Satisfying bit of post-war French existentialism. Clearly informed by American Noir, the universe of this film is, however, a very different one than that of the American films. \nThe society of American Noir is one in which the old, patriarchal values have been eroded by the absence of men during the war. Women have become independent, and therefor dangerous, leading the traumatized former soldiers astray into darkness. The downfall of such characters in most Noir is the reinstatement of order, or at least of justice. Perhaps the world is no longer one that deserves happiness, but it will not be a place where transgression is rewarded. \nThe characters in this French film engage in many illegal, dangerous activities. Yet the film does not feel the need to moralize about them. Indeed, neither does law enforcement, which is depicted here as simply another weary faction of the working class. This is a cosmos that is neither punitive nor loving but simply, in Camus's phrase, \"gently indifferent.\"","This is a major disappointment and Clouzot fans should be wary. This is no Wages of Fear, Diaboliques or Le Corbeau. I have a feeling that this project was foist upon him after Le Corbeau so upset the French and was his way back. Whatever, this may have a easy going melodramatic charm for some but there is just no edge, no strong and believable action. The characters are hard to believe in and although some allowance should be made for the time and circumstances, I found it hard to stick with this to the end. The music should have been more rousing, the central couple more attractive with some sense of being 'real' and although the police inspector does well there is such a madhouse of characters involved by the end that the film almost turns to farce.","A murder followed by a sequence of misunderstandings and deliberate cover-ups successfully fool the audience in this story. The film is a bit long, so falters in places but the storyline and cast are good. You can tell that certain actions are going to come back to haunt the relevant characters and it is entertaining to see if these actions will be found out. Nothing gets by detective Louis Jouvet (Antoine). He is tenacious and is no fool. Can he get to the truth? Simone Renant (Dora) plays a glamorous lesbian photographer who seems to lead a lonely life of unreciprocated love, although it is suggested that she may well be involved with wannabe heterosexual Suzy Delair (Jenny) who is prepared to do anything to get to the top. That includes sexual favours with influential sleazy Charles Dullin (Brignon) who can get her into movies. Her husband Bernard Blier (Maurice) is her musical accompanist and he is no fan of Dullin. For me, Blier is what is wrong with the film as he doesn't cut it as a leading man – he's short, fat, balding, unattractive and his whole countenance is slightly retarded. No way would Delair be by this man's side. Or so this film leads us to think.Renant is clearly in the right profession of photographing nude young women and she is my favourite character. All the lead characters have an inner strength when dealing with the police that is admirable. It's a French determination that should be applauded. The women are particularly good in this film. Shame it drags in places and Dullin is slightly unconvincing.","jotix100","heliotropetwo","jzappa","dbdumonteil","MartinHafer","G_a_l_i_n_a","psteier","alice liddell","Terrell-4","claudio_carvalho","JohnHowardReid","blanche-2","writers_reign","SixtusXLIV","tommyg","polleras_argentino","morrison-dylan-fan","Maevan78","MOscarbradley","ElMaruecan82","loydmooney","zetes","treywillwest","christopher-underwood","AAdaSC","16 December 2005","8 October 2006","2 November 2008","14 August 2001","20 October 2005","26 September 2007","29 October 2002","12 June 2000","8 March 2008","27 January 2011","10 November 2016","2 June 2012","15 October 2006","27 September 2005","20 January 2003","31 March 2005","3 July 2016","14 April 2007","25 April 2014","3 February 2013","21 January 2005","17 September 2003","1 May 2018","18 April 2018","22 November 2017","10","10","7","10","9","9","8","6","8","8","6","8","9","9","9","8","10","10","9","10","7","8","7","5","6"," An inspector calls\n"," Genre bending Tragi-comic love story-character study-police procedural.\n"," Clouzot's Least Dark Suspense Thriller\n"," Chabrol's predecessor.\n"," wonderful and earthy\n"," A great comeback of H.G. Cluozot\n"," Perhaps Clouzot's best film, certainly the lightest\n"," Magnificent misanthropy, although slightly more sympathetic than usual (possible spoiler)\n"," A marvelous, amusing movie about murder, jealousy, music halls and love, with enough raisins even for Hitchcock\n"," An Efficient Detective in a Comedy of Errors\n"," Disappointing!\n"," Clouzot strikes again and hits his mark\n"," (Don't) Shoot The Pianist\n"," Tenderness with a cynical twist.\n"," Who was that boy?\n"," Great piece of the French transition cinema\n"," \"It's his upbringing,his parents were bourgeois,he sees vice everywhere.\"\n"," Excellent movie\n"," Surprisingly light comedy-thriller from Clouzot\n"," French popular cinema at its best ...\n"," veddy nice...even if a little strange\n"," Somewhat disappointing considering the skill involved, but still good\n"," nope\n"," I found it hard to stick with this to the end\n"," Quayful of liars\n"]}