{"primary":["The Happiest Days of Your Life (1950)","https://m.media-amazon.com/images/M/MV5BMjAyNzgwMDE0OF5BMl5BanBnXkFtZTcwMDM2MjA1MQ@@._V1_UY1200_CR35,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0042541/reviews","tt0042541"],"secondary":["From the golden period of British films, this has my vote for one of the funniest of all time. Screened yesterday at my Film Society to a rapturous audience, I was astonished at how well the comedy has lasted (made in 1950!).  It is really down to the expert timing and inimitable playing from two of the finest actors Britain has produced: Margaret Rutherford and Alastair Sim. Adapted from a play by John Dighton, this farce is briskly handled by director Frank Launder. The plot is simple: A ministry mistake billets a girls' school on a boys' school. I will always laugh when I think of this film.","A bumbling error at the Ministry Of Education results in Nutbourne Boys School having to share with St Swithin's School For Girls. This bemuses the respective head teachers of each school and leads to all manner of chaotic goings on, however the two are forced to come to an uneasy alliance in the hope of averting major trouble.The Happiest Days Of Your Life is based on the John Dighton play from 1948, with Dighton writing the part of Headmistress Whitchurch specifically for Margaret Rutherford. Replacing George Howe from the play in the role of Headmaster Pond, is Alastair Sim, and herein lies the crowning glory of this filmic adaptation, Sim & Rutherford are perfectly wonderful, bouncing off each other to keep what is basically a one joke movie, highly entertaining. Directed by the gifted Frank Launder, and produced by the equally adroit Sidney Gilliat, The Happiest Days Of Your Life is a quintessentially British movie, obviously a precursor to the St Trinians franchise, the film entertains the children with it's high jinks clash of the sexes heart, whilst tickling the watching adults with its very saucy undercurrent. Thankfully the chaotic ending cements all that has gone before it to leave this particular viewer with a grin as wide as Nutbourne Rail Station. Great fun. 8/10","This film, without doubt, is the clearest example of the British humour the Germans can't understand. One-liners run rampant in a film spawning one of the greatest series of films in British cinema history (St.Trinians). The story of bureaucratic incompetence amid post-war trials enables Frank Launder to direct maximum talent from all the cast. It's probably the only film in which Margaret Rutherford meets her match, in Alastair Sim, for forceful characterisation (she still wins though). Joyce Grenfell (bless her) and Richard Wattis both deserve mentions in Dighton's masterpiece of English etiquette and stiff upper lip under pressure.No Rutherford/Sim/Grenfell fan would be without this in their collection. Absolutely brilliant. Why 9/10? Only 83mins long.","After a long run in the West End this charming film re-cast Margaret Rutherford as the Headmistress 'Miss Whitchurch' in this financially successful adaptation made in 1950.All interior shots took place at Riverside studios in Hammersmith, London. The exterior scenes were filmed on location at a public girl's school near Liss in Hampshire.  During the 12 - week shoot both Margaret Rutherford and Joyce Grenfell were staying in a hotel nearby and would often visit the school during the evenings where they would happily enjoy the company of the real school mistresses.Although the film's script contains only two original lines from the original play the leads and supporting actors are in fine form and you can only feel sympathetic for their predicament especially in the final scenes.","This film was made thirteen years before I was born but I still think it is the wittiest, dottiest, most harmless piece of fun ever made. It simply could not go wrong with the cast of superb British character actors it boasts.Where to start? Alastair Sim-peerless; Margaret Rutherford-ditto;the wonderfully alkward, innocent Gossage, played to perfection by the imperious Joyce Grenfell. The caddish Victor Hyde-Brown (a Guy Middleton special) and the rest of the staff sum up post-war middle-class England to a tee.The humour is sometimes obvious, but it is of that special \"Ealing\" variety and is never offensive.I have watched this film more times than I care to remember and still laugh like a drain at the antics every time. The storming of the dorms occupied by the girls school, the magnificently-planned but ultimately doomed twin tours of the school and the chaotic ending involving the arrival of a third school to add to the anarchy, are priceless.It's an old cliché I know, but they really do not make them like that anymore. How I wish they did. If you haven't seen it, please do, you won't be disappointed.","No point in giving too many plot details here, just take the basic premise of an all girls school being assigned to an all boys school by mistake, add that on the same day the girl's headmistress has to show a group of visiting parents around while the boy's headmaster (who is due to be promoted to a senior position at a new college) has to show his new employers around and I think you'll get the picture.This fifty year old comedy wears well. The pace is frantic, like a French farce with doors opening and closing and much dashing along corridors with split second timing as the two groups try to avoid each other. Magaret Rutherford and Alistair Sim ham it up superbly and there are many familiar faces in the supporting cast, all of whom react with great professionalism. At ninety minutes the film doesn't out stay it's welcome, and there's even time for a little romance that doesn't slow up the action one bit. Incidentally I had forgotten how sexy the gym outfits of English schoolgirls of that period were. It bought back memories.","\"Gaming? Nicotine? Fisticuffs? We're moving in a descending spiral of iniquity!\" So says the head of St. Swithen's upon inspecting the master's common at Nutbourne. The faculty and students of St. Swithen's have been ordered to share facilities at Nutbourne to avoid German bombs during World War II. Then there's the masters' library. \"The Diary of Samuel Pepys? Abridged...well, that's something to be thankful for. What's up here? The Memoirs of Casanova? Wasn't that the book we caught Jessica James reading in the closet? Decameron Nights! Well, really! What ever else this place may or may not be, it's no place to bring carefully nurtured girls!\" Yes, a terrible mistake has been made by the Ministry of Education. Nutbourne is a school for boys. St. Swithen's is a school for girls. And what makes this one of the best post-WWII British comedies, Nutbourne's head master is Wetherby Pond...played by Alastair Sim, while St. Swithen's head mistress is Muriel Whitchurch...played by Margaret Rutherford. \"St. Swithen's?\" says Pond. \"You don't mean to say that yours is a school for boys and girls?\" he asks one of the early girls. \"Only girls\" she says cheerfully. \"Does this mean, sir,\" asks one of Nutbourne's teachers, \"that we are to expect 100 young girls?\" \"It means that not only have the ministry made a mistake in sending a school here at all, but that it is guilty of an appalling sexual aberration!\" Margaret Rutherford's Miss Whitchurch, as positive and immovable as a battleship, intends to make the best of it, by briskly taking over Nutbourne if possible. Alastair Sim's Pond is exasperated up to his big bald head and is determined to salvage his school. In the meantime, there are 100 young girls and 170 young boys to be fed and places found for them to sleep (along with all their teachers). The cooks and caretakers, totally put upon, walk out. Miss Whitchurch and her girls, however, are up to the cooking tasks. \"Come now, Angela,\" she says to one girl who is trying to stir something in a big pot, \"haven't you made porridge before?\" \"Yes, but no one ever had to eat it.\" \"That's a defeatist attitude, my dear. Stir it well and don't shilly shally.\" Things are hardly going well when Pond discovers four governors from a school he hopes to lead are arriving at any moment to see for themselves how well led Nutbourne is. And Miss Whitchurch learns that four wealthy and influential parents have just arrived to see how their daughters are doing in the new -- boy free, they were told -- facilities. The only solution? Miss Whitchurch and Pond, their teachers and their students, concoct a split-second shifting of classes to give the allusion that Nutbourne has no girls and that St. Swithen's has no boys. After the parents inspect a dorm and leave for a class, the girls in the beds duck under and the boys who'd been hidden under leap up into the beds, just as the governors walk in. The boys are observed at rugby and, as soon as the governors turn their backs, the goal posts are taken down, nets for lacrosse are put up, and just then the parents walk over to observes the girls. One parent spots her daughter in a science class, then moments later sees her in a choir practice, then moments later.... \"There's Angela again,\" she says to Miss Whitchurch. \"Why so it is,\" she replies, hustling the parents out to avoid the governors who are approaching just around the corner. \"The child's quite ubiquitous.\" When we leave Nutbourne, everything has been discovered. The students are milling about. The teachers are dazed (except for two who are kissing.) The Education Ministry has just sent several more busloads of students. The parents are speechless but the governors are not. \"We're waiting for an explanation,\" one says sharply. Pond holds his head and shudders. \"Can't you see I'm trying to think of one.\" The film moves from one complicated and ridiculous situation after another, braced by a very funny script and two hugely comedic performances by Rutherford and Sim. Sim's droll exasperation and Rutherford's implacable determination are so well matched that's it's a shame this is the only movie they ever made together. Joyce Grenfell, as Gossage, St. Swithen's tall, awkward, loping sports teacher gives them some competition. If you keep your eyes open, you'll also find some amusing references director Frank Launder works in, including a gong at Nutbourne that looks just like a midget version of J. Arthur Rank's, a faint echo of the zither theme from The Third Man and a shot stolen from David Lean's Oliver Twist, except this time the little boy walks up holding his porridge bowl and says, \"Please, sir. I don't want anymore.\" Frank Launder and his partner, Sidney Gilliat, were responsible for some of the best films produced in Britain during the Thirties, Forties and Fifties. They wrote, produced and directed, sometimes doing one, sometimes the other. In one way or another they were responsible for such first-rate films as Green for Danger (with a masterly droll performance by Sim), I See a Dark Stranger, The Lady Vanishes, Night Train to Munich, Wee Geordie, The Belles of St. Trinian's, The Rake's Progress and many others. With The Happiest Days of Your Life, Launder wrote and directed while both produced. It's one of their best.","One of the flat-out drollest movies of all-time. Sim and Rutherford are at their best matching wits over the predicament of an all-boys and all-girls school sharing the same quarters.  Slapstick has never been this sophisticated.","I seldom write 'over-the-top' reviews, but, in my opinion, Happiest Days of Your Life is the funniest of all comedies issued during Britain's golden era (late 1940s-early 1950s) of filmed fun. Directed by Frank Launder, Happiest Days of Your Life provides peerless comedy actors Alastair Sim, Margaret Rutherford, Joyce Grenfell, Richard Wattis, Muriel Aked, Guy Middleton and Edward Rigby with a witty script by John Dighton & Frank Launder filled with opportunities to perform at their best. Although the film is laugh-out-loud funny, convulsively so, at times, it provides a sharply satiric critique of a no-longer-so-Great Britain as it stumblingly tries to negotiate in a few years time a century of bureaucratic transition from ossified Victorian empire to a modern welfare state amid the wreckage and turmoil following WWII. I suggest that Happiest Days of Your Life ranks with the best work by Keaton, Chaplin, Marx Brothers, W.C. Fields, Alec Guinness, Peter Sellers, Monty Python and Mel Brooks.","This English classic couldn't miss with Alastair Sim and Margaret Rutherford in the same movie (he's the head of a boys' school who has to accomodate her school and staff during wartime alongside their own).  There's also the delightfully dotty Joyce Grenfell (Miss Gossage, 'call me sausage').  The Happiest Days ... falls back on slapstick farce and, rather like the St Trinian's series, sends up the whole boarding school culture with glee. It all gets incredibly silly and, as such, is a genuinely hilarious and harmless hour and a half of entertainment.","The play is cleverly constructed - begin with the porter, Rainbow - & let the audience see the background unfold through his eyes.   The film follows the play with great faithfulness, working, no doubt, on the simple premise that it couldn't be bettered.  Now throw in a host of superb character actors - & the result is a resounding triumph.A definite must-see.","This film is just plain lovely. It's funny as hell and as old as the hills. The acting is superb and it's fascinating seeing post-war Britain and how we used to behave in those days. This seems to have been some pre-runner to the St. Trinians films (given the Alastair Sim and Margaret Rutherford connection - there's also a very young George Cole in there who appeared in many St. Trinians films) but I don't myself understand the connection. It was shown on BBC4 recently after a biography of St. Trinians creator Ronald Searle, however I missed enough of the biography to miss the connection with this film. Anyway a great film in its own right and something that should be preserved for all time!","In my younger days in the '60's/70's I used to prefer this film over The Belles Of St. Trinian's, Alistair Sim's other schoolmasterpiece from 4 years later. Happiest Days has the delicious meeting between the unflappable Sim and the indomitable Margaret Rutherford while Trinians had the unrepeatable meeting between Sim and Sim. Also this story didn't have such a broad canvas and watching it tonight for the first time in 20 years and finding I remembered perfectly every line and every image made me realise it's gone deeper than I thought. Simpler is often more effective, is that how come it appears so short? A lot of half-baked and over-baked ideas were thrown into this brief 80 minute mix.Boys school run by Sim and his band of bachelors is physically invaded by girls school run by Rutherford and her set of spinsters thanks a series of lackadaisical mistakes at the Ministry Of Inboxes (still in existence) and they all have to try and make do and mend. The main comedy is in adjusting to the novelty of the situation and trying to maintain the pretence that there was only one school in the building to the various visitors to both schools descending at the same time. Sly jokes fall thick and fast delivered by an expert slapstick cast, sardonic Richard Wattis – who went on later to Trinians and Sykes, ladykiller Guy Middleton, fluffy Arthur Howard – who went on to Jimmy Edwards' Whack-O as Mr Pettigrew, and flighty Joyce Grenfell. But it's the sparking, the verbal sparring of Sim and Rutherford in every scene they're in that's so wonderful to behold and is the big reason for watching the film.The time has now gone, the Britain this shows was murdered decades ago. For instance we now live in a world where the two Guard Thine Honour jokes in here will be meaningless to most or if understood probably treated with contempt by most of the rest. But recommended by this simple guy for a laugh and a sigh.","Somehow, in a lifetime in which I estimate having seen over 25,000 films (starting about 72 years back), I had totally missed \"The Happiest Days of Your Life\". I can be counted upon to rave about a film I like, but rarely go off the deep end over such things. Not until now, anyway. If this isn't the absolutely funniest movie I have ever seen in my life, I can't recall what is. Of course, there are different comedy genres, from French Farce to British Droll, from The Three Stooges and Abbott and Costello to \"Some Like It Hot\" and \"Tom Jones\", possibly ending up with Woody Allen and Mel Brooks. But of the kind which relies on sparkling, witty, and cutting dialog delivered by masters (especially British masters), this one has no equal. I live alone, and do not laugh out loud all that often when viewing comedy of any kind, but at 3am this morning, my neighbors could probably have heard me a dozen times laughing right through the walls; this film is just that funny. The slapstick elements that commence about three-quarters of the way through are in themselves hilarious, but the first quarter of the film, given over to the male masters of an all-boys school, is like nothing I have ever seen or heard before, and the actors delivering this scintillating portion of the dialog - Alastair Sim, Richard Wattis, Guy Middleon and Edward Rigby, in particular - are irreplaceable in all of their individual splendor of delivery. When Margaret Rutherford, Joyce Grenfell and others from the distaff side of the proceedings arrive to place their unwelcome mark on what had been a pretty much all-male environment, the dialog and humor remain impeccably delightful (and British; God almighty, it is all so wonderfully British!), but increasing comedic physicality becomes the order of the day. Indeed, the confrontation scenes between Sim and Rutherford - and there are many, constituting the middle portion of the film - are so powerfully comedic that the lines and rejoinders attain an almost corporeal physicality. I've never seen anything of this type so perfectly done on the screen, and the entire 75 or 80 minutes of verbal and physical mayhem are so overwhelmingly delightful that, as one other commentator remarked, I could easily have done with another half-hour of it incorporated into the glorious whole of the film. Anyway, as far as my memory serves right now, from a dialog and one-liner standpoint, this is surely the funniest movie I can recall having seen. I will watch it again tonight and on many subsequent nights, since I have 68 years of catching up to do","Based on a play by John Dighton, this is a precursor to the \"St. Trinian's\" films and involves the staff and pupils of an all-girls school, St Swithin's School, being billeted at Nutbourne College, an all-boys school, by mistake. It was also co-written and directed by Frank Launder and features much the same cast, most notably Alastair Sim, Joyce Grenfell, Richard Wattis and, in a very small and uncredited role as a junior assistant caretaker, George Cole. It's less anarchic than the \"St. Trinian's\" films - at least until the last few minutes - but it's still incredibly funny. It is more of a comedy of manners really of a kind which sadly isn't made anymore. The film's comic timing is exquisite.Sim is wonderful as Weatherby Pond, the headmaster Nutbourne College, as is Margaret Rutherford as his counterpart Miss Whitchurch, a role written specifically for her. Their timing and chemistry is marvelous. Both are absolute perfect in the roles. Incidentally, Rutherford was supposed to play Miss Fritton in \"The Belles of St. Trinian's\" but she could not do so because of other commitments and Sim was cast in the role in her absence. Their characters work so well because of the contrast between them: while a kind headmaster, Pond is extremely concerned with discipline and order and, as such, is not too happy with the arrival of 100 girls and the resulting disruption caused to his school - not least because he is up for another job! - while Miss Whitchurch is a non-traditionalist who takes over Nutbourne College with nary a thought about the inconvenience caused to Pond. She even takes over his office and bedroom. They do eventually warm to each other though! I've always loved his performances but I've become a huge fan of Alastair Sim after watching him in three films in quick succession. He's one of those fantastic actors who makes it all look so easy but probably worked harder than anyone at his craft. As is to be expected from a former elocution lecturer at the University of Edinburgh (my alma mater!), he has beautiful diction.While Sim and Rutherford certainly have the lion's share of the best scenes and lines, it has a strong supporting cast including Grenfell (who is excellent as the well meaning overgrown schoolgirl and games mistress Miss Gossage), Wattis and Laurence Naismith. However, I have to give special mention to Edward Rigby, who is brilliant as Nutbourne's put-upon, 70-year-old caretaker and general dogsbody Rainbow. It's a shame that he died in 1951 as he would have been a great asset to the \"St. Trinian's\" films.","There is very little I could add to the viewer remarks already posted. Suffice it to say that this film cemented my love for the understated English humor. I first saw it on TV. Channel 9 in New York during the 1950s had a movie slot called The Million Dollar Movie. It was a 90 minute format and each film shown had to fit into this time frame, which included commercial breaks. Any film is this series was cut badly to fit. Each film was shown daily, plus twice on weekends. I watched The Happiest Days almost every time it was shown and laughed anew at every showing. Later on The Million Dollar Movie also showed The Belles of St Trinians, another Alastair Sim marvel of a film about a school chock fill of nasty little girls. In 1959. I was lucky enough to find a theater which was showing a double feature of the Happiest Days and The Belles. Even through I sustained a flat tire and a parking ticket, I have always considered this trip to a movie theater, the best movie night I've ever had","THE HAPPIEST DAYS OF YOUR LIFE is redolent of an era of 'make do and mend,' when everyone in Britain had to endure the privations of education on a shoestring. Based on a stage success, Frank Launder's film boasts two towering central performances by Alistair Sim and Margaret Rutherford as the head teachers of the boys' and girls' schools forced to share accommodation. The two actors have a field day, using their full range of facial expressions to create characters who, although harassed, can make the best of an almost impossible situation. The supporting cast contains some memorable cameos, notably Joyce Grenfell as Miss Gossage (\"you can call me sausage\"), Richard Wattis as a harassed teacher (no one could do harassed like Wattis), and Guy Rolfe as a slimy boys' school teacher with an eye for young women. The film zips along at breakneck speed, especially at the end, when the two head teachers try their best to convince some visitors that everything in their school is perfectly normal. THE HAPPIEST DAYS OF YOUR LIFE is only seventy-five minutes long, but is nonetheless packed with incident and humor. Definitely worth a look if you're feeling low.","THDOYL has been one of my favourite films ever since I saw it, aged 9 or 10, when it was first released. It is witty, supremely well acted, especially by Alastair Sim, Margaret Rutherford and Joyce Grenfell, and above all human. I last saw it ten years ago on television in the United States and was enjoying it, despite long commercial breaks every few minutes, until just before the end when the station chose to show a long preview of a forthcoming programme and in consequence simply cut the last ten minutes or so. Anyone seeing it for the first time would have been deprived of its conclusion. Sacrilege.However to me the plot of the film has always contained one enormous fault. Much as Pond and Miss Whitchurch dislike each other, they become allies in the effectively impossible task of convincing his governors and her group of parents that only one school is occupying the premises. Why? The fault is not theirs, it is that of the Ministry of Education for wrongly allotting a girls' school to a boys' school. Pond and Miss Whitchurch are the innocent victims of an incompetent bureaucracy and could simply have told their visitors as much. If anything there might well have been some kudos for both in dealing in as able a way as possible with a situation not of their making.Of course if they had done so there would not have been much of a film and despite the weakness of the McGuffin the beautifully filmed efforts to replace girls with boys and vice versa at exactly the right moment are a joy. As is the performance of Richard Wattis for once not playing a stuffy bank manager/civil servant.As others have said, if you've never seen this film, please do so. But preferably not on television in the States.","........and when precision of thought and speech was not considered a social handicap.\nThe script is witty and erudite,the performances universally polished.\nProbably not a single character in the film has any currency in 2018.\nThat is this century's tragedy.\nIn another world,almost an alternative universe,\"The Happiest Days of Your Life\"was merely one of a number of British comedy films whose quality and bloodline we took for granted.\nThere would be,it seemed,an endless conveyor belt of such productions stretching into the infinitely distant sixties.\nSadly it was not to be.\nAs time passed,subtlety disappeared,the funny bone moved rather lower down the anatomy and innocence became a quality to be mocked at every opportunity.\nThere are lovely people in this film - long dead - who deserve you indulgence.\nTheir like,and the like of \"The Happiest Days of Your Life\" will not occur again.\nThat,also,to the lover of British Cinema,is also this century's tragedy.","I watched this film when it came on recently mainly because it was noted as a reference point for Gregory's Girl (1980).Thoroughly entertaining but at least fifteen minutes, probably half an hour too short. For me, it ended shockingly quickly.The attempt by Alistair Sim and Margaret Rutherford as joint heads of a boys and girls school, thrown together by an incompetent bureaucracy, to hoodwink parents and school inspectors comes to such a sharp stop that I can't help thinking that some over-drastic pruning was at work here. Nothing illustrates the British class system than educational opportunity and it is on exhibition here during the final year of the first British post-war Labour government. I suppose you could say that the Saint Trinian's series was a sort of sequel but, however funny that was, it was devoid of the subtlety of social commentary that this film was. However, someone obviously noted the potential of Joyce Grenfall and cast her in that series. Alistair Sim also, in the first such film.","A boy's school receives some very unwelcome visitorsStarring Alastair Sim and Margaret RutherfordScreenplay by Frank Launder and John DightonDirected by Frank LaunderFor an old movie this is a fun runaround.It's short and witty and a great way to pass just over an hour of your time. It's silly and easy to watch and passes really quickly so that says something about it.If you fancy a laugh without too much of a plot headache, give it a shot.7.5/10","Apparently this had them rolling in the aisles in 1950, that was, of course, long before there was at least one casino in every large town. It's astounding to realise that a REAL comedy, Blithe Spirit, had been produced on stage a full ten years previously yet dramatist John Dighton cheerfully snatched a suet pudding from the jaws of a soufflé'. It's hardly even a one-joke plot, a 'what-if' idea carried to its logical conclusion. After establishing that Nutbourne Boys School is run by an inept staff of stereotypes a bureaucratic error merges them with a Girls school (though we are not informed of the teaching standards that obtain there. After a reel and a half or so of hostilities between the respective heads we descend into farce as a group of parents turn up to see their daughters in their new school at the exact same time that a group of Governors from the Boys school turn up for a regulation inspection. The two antagonists are obliged to join forces and improvise a time-table to avoid the two groups meeting and each group unaware that the school is now mixed. For those who find the 'Carry On' series cutting edge.","Hugh-14","Spikeopath","filoshagrat","Mark Whiston","odde63","Cajun-4","Terrell-4","aromatic-2","fcullen","didi-5","Learner5","trojanfoe","Spondonman","joe-pearce-1","GusF","postenjc-18566","l_rawjalaurence","andeven","ianlouisiana","cmcastl","allyatherton","writers_reign","14 April 1999","17 August 2008","8 February 2006","31 March 2001","13 June 2007","19 September 2000","8 April 2008","28 November 2000","20 April 2014","7 December 2003","11 June 2001","9 October 2005","20 August 2013","29 January 2018","28 January 2015","19 December 2016","24 November 2013","26 June 2010","14 March 2018","13 March 2017","13 August 2016","3 July 2012","10","8","9","10","10","8","10","10","8","8","8","10","10","7","10","10","10","7","5"," 80 mins of absolute joy\n"," St Swithin's versus Nutbourne!\n"," Great place to start for British wit\n"," Margaret Rutherford at her Best!\n"," My all-time favourite comedy film\n"," This classic British comedy leaves a warm, cheerful glow.\n"," Margaret Rutherford and Alastair Sim join forces in the only film they made together, and it is a classic\n"," Be prepared to laugh out loud\n"," One of the great comedy films of all time\n"," funny school-based comedy\n"," What a script - & what a cast!\n"," Classic!\n"," In retrospect just like real schooldays: All too brief\n"," How Hilarious Can a Movie Be?\n"," Incredibly funny\n"," Hold your sides, English humor at its very best\n"," Frenetic Farce Evoking a Bygone Age\n"," Schooldays as we would have wished them\n"," A gem from the time before glottal stops and dropped \"Haitches\".........\n"," Thy don't make them like this anymore\n"," Short movie, plenty of giggles.\n"," Blackboard Jingle\n"]}