{"review-url":["http://www.imdb.com/title/tt0082084/reviews"],"review-text":["I can't believe I rarely ever see this title mentioned by all you eighties horror freaks and I definitely won't be joining all my fellow reviewers here in saying that 'Bloody Birthday' is awful viewing. On the contrary, I enjoyed it very much and I was pleasantly surprised by the ingeniousness and surprise twists it offers. Don't just refer to this film as being 'another 80's slasher' because the victims here are rather unlikely and so are the killers. We're introduced to three cherubic-looking youngsters who were all born during a solar eclipse. At the moment they were delivered, planet Saturn was blocked by both the sun and the moon and, due to this, the kids are emotionless and seemly without conscience. This really starts to show around their tenth birthday as they go on a merciless killing spree.Granted, this stuff is incredibility far-fetched and even slightly offensive but, seriously, who cares? Unlike many other horror films from this period, it at least attempts to bring something original and imaginative. For once, the kids' acting is good and the entire film has a creepy atmosphere and grizzly music. The murders sequences are grim and tense, and it's always eerie to see them getting committed by angel-faced kids. I don't know who hired the 3 kids but they did a good job. Especially the girl and the kid with glasses are highly memorable. The bleak images of the heartless trio remind you of classic highlights, such as 'Village of the Damned', 'The Bad Seed' and 'Children of the Damned'. This film is nowhere near as memorable as these milestones but great fun and not one horror lover will regret watching this. Bloody Birthday was written and directed by Ed Hunt. Not particularly the greatest genius in cinema, but a pleasantly deranged fella who also brought us immensely entertaining cheesefests like 'The Brain' and 'Starship Invasions'. If all this isn't enough to convince you yet, Bloody Birthday has a lot of nudity. And not just any nudity, but a topless dance-act by MTV-VJ Julie Brown. Oh, and keep your eyes open for a completely redundant cameo by Joe Penny, later the star of TV-series 'Jake and the Fatman'. Check it out!!","An absolute classic of 80's scare flix. This one isn't like any other as it pits pint-size, wild-eyed, psychotic youngsters with an urge to kill against all the grown-ups in town. Bud from JUST ONE OF THE GUYS (80's gold again) plays one of the killer-kids and he's paired up with one of the little girls Jake Blues tries to purchase in the BLUES BROTHERS. There is a third blond boy, but he keeps disappearing from the movie for whatever reason. The violence is hilarious at times and also surprisingly gruesome in spots. The demonic gang of smiling kids, though somehow possessed by extra-planetary means, bear little resemblance to the droid-ish Children of the Damned, who never thought to use pistols, crossbows and shovels to kill those pesky adults. Julie Brown (not Downtown Julie Brown-the other one) shows her rack, like three times, as she dances around in her bedroom. This movie is a rarity that I cannot believe I missed growing up in the 80's. This would have been my absolute favorite movie as a kid if I had seen it. Where is the sequel the ending begs for? This movie is just incredible. Seek it out at all costs.","This is an interesting and fun little horror movie from the early 80's that probably had a brief run in the drive-ins I would imagine. I won't break down by ridiculous \"categories\" such as \"suspense\" or \"gore\" which I personally find quite hilarious, but in sum, if you like grind-house films of the era, you might enjoy this. It seesaws between very dumb and quite entertaining with a few genuine scares (such as the opening sequence) and a little splash of suspense. It has that cheap, raw 70's feel that try as they might, horror movie makers just can't correctly emulate, and scenes of such utter nonsense that would never slip by editors these days; which is a good thing. Performances are pretty good. For instance, the updated Omen suffered severely by the less than convincing devil-child performance. However, the kids here are totally fine. This is a kooky little movie and I enjoyed every minute of it.","In Meadowvale, California three babies are born simultaneously during a solar eclipse. Years later, the kids (Billy Jacoby, Elizabeth Hoy and Andy Freeman) turn ten and go on a violent killing spree, offing horny teens, schoolteachers, cops and others. It's a pretty sick/tasteless combo of THE BAD SEED, VILLAGE OF THE DAMNED and Friday THE 13TH, and kind of jarring to see these calculating kiddies shooting, stabbing and strangling their victims (making some look like accidents), stalking people with guns, spying on people having sex, pretending to put poison in birthday cake, keeping a scrapbook with obituary clippings and doing all kinds of other horrible things!Name-value stars Susan Strasberg as a stern teacher and Jose Ferrer as a doctor receive top billing for bit roles; the real star is Lori Lethin (also in THE PREY and RETURN TO HORROR HIGH) as the astrology obsessed teen who catches on. I don't know where they found the child actors at, but they're all very good. You may also want to catch this for comedienne Julie Brown's topless dance scene.Score: 6 out of 10","'Bloody Birthday' is one of those movies that surprisingly ages well enough to remain watchable nowadays. Not a masterpiece for sure, but still entertaining and surprisingly enough, it doesn't really have a lot of unintentionally funny scenes. I know it's a shocker if we keep in mind that this is a low budget flick from the early 80s about a group of evil children who kill people. But trust me, the movie manages to remain respectable and watchable for the most part.The story revolves around three children who are born during a a total eclipse. According to astrology, during eclipses, the sun and the moon block Saturn, which controls emotions. As a consequence, the three children who are born that day, eventually become uncaring and evil. Since they don't experience any feelings of remorse whatsoever, these 10-year-old kids gang up against basically everyone who stands in their way, including their own parents and siblings... and kill them! The body count increases day after day and the police authorities believe that there's a psychopath lurking around the place. In the meantime, Debbie, Curtis and Steven, don't hesitate to keep butchering people.I was expecting some hilariously bad scenes, but the movie proved me wrong. True, it's not exactly what most people would consider a 'serious' horror movie, but if I have to be fair, I'd say that the story is decently executed. One of the most important reasons why one would normally expect laughable situations (like I did), it's because in these kind of movies in which the main villains are children, the young actors tend to be plain awful and they make the whole thing laughable. Let's face it: kids tend to be horrible actors, which is understandable and we can't blame them for that. But to my surprise, the three young actors who played the merciless killers in this film, looked very disturbing and not at all funny. The rest of the actors are also good and if you're a George Clooney fan, you can see his uncle playing a doctor in this movie. Yeah, I know right?... who cares?. Also, Julie Brown, the great actress, singer, comedienne and gay icon, gives a solid performance as the naughty older sister and in case anyone is interested in nudity: she also strips in one of the scenes and she looks great naked. Too bad she didn't have more time on the screen though! Julie is 'absolutely fabulous':PSo basically, this movie is fine if you're in the mood for some modest horror from the 80s. My only objection regarding 'Bloody Birthday' would be the way to justify the children's motives. This is perhaps one of the lowest points of the film. Let's see: if children who were born during an eclipse end up being heartless killers, then how come these three were the only ones who actually murdered people? I'm sure there were other children who had been born the same day... and during other days of total eclipse too, oh well!. Overall, no big deal, it's just a simple observation, that's all. I've seen worse, trust me. Take 'The Children' (1980) for example, in which the precocious killer get their evilness after being turned into zombies by toxic cloud. No, believe me, 'Bloody Birthday' is far more decent and if you enjoy simple slashers, you're going to enjoy this one very much.","Three ten-year-old children born at the same time during a solar eclipse begin to slyly murder anybody that offends them.While killer kid movies weren't exactly new at the time of this twisted 80's slasher the theme of children as murderers works nicely for this film. Bloody Birthday does deliver some good chills and suspense, while managing to be a competent killer thriller with some strange qualities. It straddles a fine line between cheesy and creepy, but it does remain entertaining throughout with an interesting plot. There's some strong murder scenes, as well as a good bit of nudity to establish this as a solid slasher guilty pleasure.The cast does a fairly good job. Young stars Elizabeth Hoy and K.C. Martel deliver some menacing performances, while rising star Julie Brown does a striptease before a memorable murder scene. Veteran star Susan Strasberg does well as the teacher and Jose Ferrer has a cameo appearance.All around this off-beat slasher entry isn't bad, though it's admittedly not flawless, but it is well worth watching for genre fans.*** out of ****","Story about three eclipse (maybe even Indigo, ha) children beginning their love for murder. Oh, and the people who are \"hot\" on their trail.Bloody Birthday, a pretty mediocre title for the film, was a nice lil surprise. I was in no way expecting a film that dealt with blood-thirsty psychopath kids. And I may say it's also one of the best flicks I've seen with kids as the villains. By the end of the movie I seriously wanted these kids to die in horrible fashion.It's a really solid 80s horror flick, but how these kids are getting away with all this mayhem and murder is just something that you can't not think about. Even the slightest bit of investigation would easily uncover these lil sh!ts as the murderers. But there seems to be only a couple police in town, well by the end, only one, and he seemed like a dimwit, so I suppose they could have gotten away with it. Haha, yeah, and I'm a Chinese jet-pilot.Nevertheless, this movie delivered some evilass kids who were more than entertaining, a lot of premarital sex and a decent amount of boobage. No kiddin! If you're put off by the less than stellar title, dash it from your mind and give this flick a shot. It's a very recommendable and underrated 80s horror flick.","Talk about controversial story lines, this is THE GOOD SON taken to the next level! The plot concerns a murderous trio of triplets (two boys and a girl) who suddenly develop homicidal tendencies on their 11th (bloody) birthday and decide to try out their newfound murdering tendencies on their sleepy little town. Everybody thinks they're little angels, so the only people who can bring them down are a college student and her younger brother, who know the psychotic threesome's true nature. But our two heroes have just been added to the hit-list..It doesn't have the best acting in the world and the movie print seems more than a bit fuzzy, but overall this is an effective little low-budget horror with effective moments of suspense and even a dash of gore. The novelty of having children as the villains helps the plot through its slower spots, and the movie makes good use of the weapons the kids have at their disposal, be they rat-poison smeared onto the icing of a cake or arrows shot into the peephole of a sister's bedroom. Some may find the premise of these youngsters going around slaughtering at will a little hard to swallow, but for anyone who can suspend disbelief for 90 minutes, this is a fun ride. I give it a 5/10. Watch out for the nice twist at the end..","This movie is not the scariest of all time, but it is a great example of a campy eighties horror flick -- low budget, no stars, lots of  inventive death scenes, and enough nudity to keep the teenagers in their seats.  The premise is interesting and fun and the three evil kids play their parts well.  A nice starting point for \"Just Say\" Julie Brown exposing her talents early in her career.  This film won't be seen by many, but for fans of 80's horror it's a must.","Bloody Birthday plays on the assumed innocence of children and shows them as bloodthirsty monsters. Steven (Andy Freeman), Curtis (Billy Jayne;credited as Billy Jacoby), and Debbie (Elizabeth Hoy), were all born on the same day during an eclipse. Besides sharing a birthday, they also share a love of murder (and they're not picky about who they kill either). Young Billy, Elizabeth, and Andy play the parts of these emotionless monsters quite well but they know when to put on the charm too. But they can't go on fooling everyone. This is an overall good horror flick, its not too unrealistic, there are a few good moments of suspense and the kids portrayed the roles well, (the grown-ups are pretty hammy though). I'd say its well worth seeing, (I own a copy myself).","A lot of fun, a lot of kills and effectively devious in its simplicity. The main three bad kids are pretty charismatic, considering the low budget side of 'Bloody birthday'. Then, there are some pretty teen girls of the legal age for the more spicy, topless scenes, and we're getting closer to a truly fun horror film from the (in)famous '80s.The story does not make much sense, with Jupiter being blacked out by the moon when the three killer kids are born, but who really cares? The kills are fun, the cast is pretty enthusiastic and the atmosphere of yet another American smalltown is caught on screen more than well enough.Yes, if this is the sort of cult horror you seek, you can't be disappointed. 8 out of 10.","Bloody Birthday is one of the best psychological thriller/suspense films from the 80s. The title alone is quite misleading though since the body count and gore (blood) pale in comparison to other slasher films. It's theme is similar to the Bad Seed and Godsend, in which a child, or in this case three children born during a solar eclipse end up being ruthless murderers. Billy Jacoby is Curtis the leader of the pack, but at times the little blonde haired girl Debbie seems to give all the orders ( Blues Brothers.\"How much for the little girl ?\") while the other kid Steven (Beyond Witch Mountain) just swings a bat like he's trying to hit a home run. SPOILER WARNING: I saw this film when I was young and the scene that disturbed me the most was the main character (KC from Amittyville who teases his sister with fake Spiders, E.T.) gets locked inside of an old fridge in the junkyard. This part was simply terrifying to me and later the theme ended up in an episode of the TV show Punky Brewster. Debbie's sister is played by Julie Brown (the homecoming queen has got a gun) and Timmy's big sister Joyce looks like Joanie from Happy Days (she was in a ton of old 70s shows like Charlie's Angels,Different Strokes,and Dukes Of Hazard). If you blink you may miss Jose Ferrer's bit part and Susan Strasberg plays the school teacher who...well, let's just say this is a great scene in the film. The child killer theme can be seen in films like The Pit, The Children, Devil Times Five,Sailor Who Fell From The Sea With Grace, Paper Boy, Milo, Good Son, the Child, and Children Of The Corn. Bloody Birthday is just a messed up little film that is beginning to gain a cult following.","This little shocker was made in 1980, and you can really see it, but! It's not that bad, i will be honest. The film centers around 3 10 year olds, who were born at the horizon of an eclipse. now this has turned them into cold blooded killers, almost from today's headlines. The next door neighbors (older sister and her little brother), catch on to their ways. And we get to see julie brown (from MTV) naked, this is worth the rental alone. We also get to see, strangulations, arrows through eyes and naked people shot, hope i am not ruining the plot. watch for the poster of van halen, getting shot with bulletholes.  check it out..... it is an interesting flick.","Three 10 year old kids who were born during a solar eclipse, become serial killers with no consciences because Saturn was blocked during the eclipse - um, OK, whatever gimmick works to get these kids murdering is fine with me. It's an above average slasher, which doesn't really mean much since most of the subgenre is below average, but it's competently made and feels more like a demented black comedy than a horror flick. The kids do a good job and seem to have a blast being as bad as possible, turning their neighborhood into slasher territory. There are some elements here lifted from Halloween, despite being barely anything like the Carpenter film - especially a tracking shot down a suburban street with our meek lead and her friend, who even gets a quick visit from her cop father - perhaps a misinformed producer decision to cash in on a film that's nothing like the one they're making. There's a quick blink and you miss it appearance from the American Ninja himself, the anti- charismatic Michael Dudikoff. Bloody Birthday isn't especially bloody, but this lunacy is never anything but entertaining.","Bloody Birthday, it cannot be denied, is certainly original. It takes place in a small town where during an eclipse over Saturn, three mothers give birth to two boys and a girl. Timmy, Curtis and Debbie look like normal children, play like normal children... but they're as insidious as the environmental movement as they cause various tragic events in town, from the death of a cop to a comedic yet disturbing incidence of Curtis being a peeping tom. After shooting the maid and locking a little boy in a mini-fridge, only one person gets suspicious, but it proves very difficult to get the townsfolk to listen.Why do these three little creeps have such violent actions? They were born when Saturn was covered in the eclipse, somehow leaving them lacking in emotion.Bloody Birthday is by no means perfect in fact. For one thing, the children supposedly have no emotions, yet they show a great level of sadism, they laugh and plan and fear together, they're friends with one another, they sure do love looking at Curtis' sister through the hole in his closet, all implying that they are heavily disturbed but certainly not unemotional.Bloody Birthday is like Mikey (1992), The Paper Boy (1994), Village of the Damned (1995) and The Bad Seed (1956). It's a typical killer kid movie but goes a little bit beyond so there is a small element of surprise. The soundtrack was okay, the acting not too bad, and I found it hilarious and cheesy. I recommend watching it with that in mind, it is an extremely cheesy but entertaining horror film.","Lacking consciences because they were born during a solar eclipse, a trio of 10-year-olds embark on an indiscriminate killing spree.This is such a strange film. Because of the time it was released and the title, I figured it was a slasher film. It is not -- it is a \"killer kids\" film. That threw me off, expecting something else. But, that being said, it is not a bad movie and the premise is certainly something different.I enjoyed how frustrating it was for the heroine to know these kids were evil but there was little she could do about it. How do you tell people that 10-year olds are murderous miscreants? No one will believe that.Elizabeth Hoy, the killer girl, gave up acting while still a child (she apparently is now a hairdresser, happily married with kids of her own). This is too bad for us, as she clearly was the best actor of the three kids and I think there was a promising future for her.","This movie is great. 80's sleazy slasher movie about three kids born during an eclipse, so they kill everyone they see. The reason they kill makes practically no sense, but it just adds to the charm of this movie. And dang, these kids are crazy, especially Curtis. If you've seen the movie, you know who I am talking about. That kid's vicous! Although the movie doesn't have much gore, it is entertaining, and for some reason you kind of care about the characters. It also has some nice nudity. Has some decent acting as well, really a decent 80's slasher movie, it's worth a look if you ever get the chance to see it. You'll have nightmares about those darn kids though, I guarantee you!","~Spoiler~ Bloody Birthday is a curious little horror film from the year I was born. It's not the greatest film, but it still packs a punch. The punch here comes from three mischievous 10 year olds who go on a killing spree for no apparent reason other than that they were all born during a solar eclipse. So it has shades of Village of the Damned but these kids aren't the cold, detached kind. They take sheer pleasure in the mayhem they create. And that is the shocking part. Watching these children gun people down and then get away with everything using their innocent looks is the best part of the film. A real love-to-hate relationship is formed and you can't wait for the little b*stards to get what's coming to them. At least I couldn't. The worst part of the film comes from the lazy plot devices the writer/director relies on. The house that our heroes become trapped in has bulletproof windows so they cannot escape. How do we know this? Because some random kid runs up to the house and throws a football at the glass. It's incredibly dumb and there are a few instances of this. Regardless of these, watching the child actors is still fun. Billy Jacoby, Elizabeth Hoy, and Andy Freeman all give great performances as the unholy trio. Sometimes they are creepily adult-like. So if you've exhausted all of you're rental choices, dust this one off of your local video store shelf.","A mean spirited, repulsive horror film about 3 murderous children.  Susan Strasberg is totally wasted in a 5-minute cameo, even though she receives star billing.  If your a Julie Brown fan, you'll want to check it out, since she's naked in a couple of shots.  All others,avoid.","When you make a film with a killer-kids premise, there are two effective ways to approach it; you can either make it as realistic as possible, creating believable characters and situations, or you can make it as fun as possible by playing it for laughs (something which the makers of \"Silent Night, Deadly Night\" did, for example, on an equally controversial subject: a killer Santa). The people who made \"Bloody Birthday\", however, do neither of those things; they simply rely on the shock value of the image of a kid with a gun (or a knife, or a noose, or an arrow) in his/her hand. The result is both offensive and stupid. The whole film looks like a bad idea that was rushed through production (and then kept from release for several years). It's redeemed a tiny bit by good performances from the kids, but it's VERY sloppily made.    (*1/2)","Bloody Birthday opens to a shot of Meadowvale General Hospital. There three babies are being born at precisely the same time during a total eclipse. A caption informs us that it is now 'Meadowvale, California June 1, 1980'. Two teenage lovers, Duke Benson (Ben Marley) and Annie Smith (Erica Hope) are getting down to business in an open grave. They hear noises and Duke investigates. Both Duke and Annie are murdered. Sheriff Jim Brody (Bert Kramer) is baffled and only has the handle of a child's skipping rope that Annie was holding, as a clue. Unfortunately before Sheriff Brody can solve the case his youngest daughter Debbie (Elizabeth Hoy) and two of her friends Curtis Taylor (Billy Jayne as Billy Jacoby) and Steven Seton (Andy Freeman) murder him. Just as they are finishing Sheriff Brody off another young boy from their class named Timmy Russel (K.C. Martel) turns up, the three killers are unaware of how much he saw. Soon after the incident Timmy plays with Steven and Curtis in a junkyard. Curtis locks Timmy into an old locker. Timmy manages to escape and tell his sister Joyce (Lori Lethin), but she doesn't believe him at first. The three children carry on their murder spree. Their strict teacher Miss Davis (Susan Strasberg) a lovemaking couple (John Avery and Sylvia Wright) in a van and Debbie's older sister Beverly (Julie Brown) are among their victims. Joyce begins to have her suspicions about Debbie, Curtis and Steven which makes her and Timmy a target for the evil trio. Will they be able to convince the authorities that these three innocent looking 10 year olds are really soulless killers?Co-written and directed by Ed Hunt I have an intense dislike for this film. I think it's absolutely awful and doesn't have a single enjoyable aspect to it's 83 minute running time. The script by Hunt and Barry Pearson gives us no explanation for the child killers motives beyond the solar eclipse that blocks out Saturn and therefore for some bizarre astrological reason these three children don't have any conscience, so these are the only children ever born during a total eclipse? If that is true why do they wait until just before their tenth birthday's before starting their killing spree? I guess it just suddenly kicks in, right? To it's credit it is reasonably well paced but I still found it incredibly boring and tedious to sit through. The film as a whole is very unexciting and predictable, the children are revealed as the killers within the first 10 minutes and as I've mentioned next to no motive is given. It's very silly at times, too. Check out the scene where Debbie stops Steven by throwing a bowl of water over him! The Sheriff's death is put down to him falling down some steps, yeah right the injuries suffered from that type of accident aren't going to be the same as if your beaten to death with a baseball bat like he was in reality, any competent Doctor or Pathologist would have spotted that within 5 seconds. There isn't a single drop of blood spilt in the entire film and all of the lame killings are dull and unimaginative. There is some out-of-place looking nudity as Debbie charges 25c to let boys peek through a hole while her sister Beverly strips. There is an early scene just after the 5 minute mark when Joyce walks from the kitchen to the living room and the boom mike is clearly visible at the top of the screen, not even a little bit of it the whole damn thing. The general incompetence continues throughout the film. The whole production is bland and instantly forgettable. The acting is poor throughout, those three kids are very annoying and got on my nerves right from the start and made sitting through this film even more of a chore, especially Curtis in his geeky over-sized glasses. I just hate this film really, simple as that. I can't think of a single good thing to say about it. Definitely one to avoid.","As a fan of \"The Bad Seed\" movie and book I had to see this movie. Instead of 1 we have now 3 kids who were born during a full moon. That's actually the only reason that is given why they do lack a conscience. Fine with me, \"The Bad Seed\" never explained why Rhoda was born evil anyway. As expected BB went for a higher killing rate which were all shown on screen (The Bad Seed all happened of screen in comparison). But it definitely isn't slasher as little detail is shown. Okay the killings are somehow entertaining but the movie lacks in story and character development. The only ones who are somehow developed and actually bothering to find out who does the killing and get suspicious about the 3 are Joyce (played by the beautiful Lori Lethin) and her little brother Timmy. The 3 bad kids do a good job especially Curtis (Billy Jayne is also the only one getting a real film career after this) the kid with glasses who seems pretty eager to go for killings and doesn't fear to act out on his own without help from the other 2. He seems smart but towards the end gets a bit too confident. Than there is blonde Steven who is easily the least interesting. He has that mean look on his face but he is actually a follower, never acting on his own and really has no clue what to do unless the other 2 instruct him. That leaves Debbie, blonde and cute girl. She does resemble Rhoda from \"the Bad Seed\" most not only in appearance but also the way she performs the killings. She seems to have much more of a motive, does it in a much more clever way than the other 2 .","Three kids are born during a solar eclipse and turn into vile murderous little tykes who're above suspicion by everyone, save for Joyce (Lori Lethin) and her younger brother Timmy. That's the story in a nutshell. The acting in this one is tolerable for the most part. Notable for MTV-J Julie Brown (not the 'Downtown' one) showing some skin, and a very early part (albiet small) for Michael Dudikoff. Not a great film by any stretch of the imagination, but in the 'killer kids' sub-genre it's a bit of a guilty pleasure.Eye Candy: Julie Brown shows T&A (the only film thus far, to claim that honor); Sylvia Wright gets topless DVD Extras (R1): 16 minute interview with Producer Max Rosenberg (wherein he insults the director AND Canada, great stuff); Biography of Ed Hunt; and trailers for \"Kiss of the Taratula\", \"Don't open the Door\", & a red-band one for \"Homework\" (which features nudity) My Grade: B-","This agreeably perverse and oddball early 80's teen body count flick may never reach the astonishingly bent pinnacle of the deeply unsettling and criminally underrated murderous moppets movie \"Devil Times Five,\" but it's still an above average killer kid opus nonetheless.The slim, but serviceable plot centers on a trio of misfit tykes -- two bratty boys and one creepily twinkle-eyed, albeit angelic-looking little girl -- who are all born during a solar eclipse on June 9th, 1970. When the strange antisocial trio, who stick together in a tightly self-contained and exclusive circle, reach ten years of age they suddenly go homicidally bonkers and declare open season on the hapless, unsuspecting local yokels of the heretofore sleepy and peaceful California suburb of Meadowvale. Writer/director Ed Hunt, the usually incompetent unsung hack responsible for such wonderfully wretched clunkers as the delightfully dopey \"Starship Invasions,\" the uproariously inane Jesus Christ vigilante parable (!) \"Alien Warrior,\" and the stunningly silly \"The Brain,\" does a pretty solid and capable job here: the kill scenes are abundant and reasonably brutal (the arrow-through-the-eye gag is especially nasty), there's a sizable smattering of gratuitous nudity and soft-core sex, a goodly amount of tension is neatly created and maintained, some nice dollops of dark humor punctuate the arrestingly warped mayhem, and the surprise grim ending manages to be truly jolting.Moreover, the top-drawer cast further elevates the proceedings to the perfectly watchable and absorbing: Jose Ferror as a small-town doctor, future \"Jake and the Fatman\" TV series star Joe Penny as an amateur astrologer, \"The Prey\" 's Lori Lethin as the plucky babysitter heroine, Susan Strasberg as a bitchy school teacher, \"American Ninja\" 's Michael Dudikoff as a chowderhead jock, and Cyril O'Reilly (the lonely misanthrope vampire in the hauntingly melancholy \"Dance of the Damned\") as a libidinous teen dude who gets bagged while doing just what you think with some naked hot chick in back of a parked van. Billy Jacoby (who went on to star in such late 80's direct-to-video dross as \"Dr. Alien\" and \"Demonwarp\"), Andy Freeman, and especially the eerily adorable Elizabeth Hoy are genuinely creepy and convincing as the terrible troika of chillingly evil and amoral rugrats. And, yes, that's none other than Julie Brown, the brassy comedienne who scored a surprise Top 40 hit with the hilarious novelty tune \"The Homecoming Queen's Gotta Gun,\" as the lovely, vacuous, full-breasted redhead bimbo who does a great lengthy, totally extraneous, yet still sizzling and much-appreciated nude striptease while dancing in her bedroom to a cheesy blaring rock song! All in all, this baby sizes up as a sturdy and satisfying slasher item.","Is it a poorly acted, cliche-ridden pile of trash?  Of course.  Anyone who doesn't realize that when they pick up the box in the video store probably doesn't have any right judging movies in the first place.  Thus, I will now rate the aspects of the film that we actually care about on a scale of 1 to 10:Violence and gore: 4   -- For this genre, there are very few deaths, and the gore is almost non-existent.  Anyone looking for a little blood should probably look elsewhere.  The only redeeming quality is the fact that kids are doing these awful things, which raises the bar a little.Suspense: 1 -- Okay, I feel bad for anyone who gets scared by this trio of dorky looking kids.Nudity/sex: 7 -- Lots of boobage from three different women, one of whom is the MTV vj Julie Brown.  There are two sex scenes, but little is shown in them.Unintentional humor -- 4 -- There are a few good laughs with the kids trying to act scary, but all in all, it's just bad, not funny bad.Overall -- 4 -- It's not unwatchable.  There are a few fun moments, and enough nudity to keep your attention for the entire movie.  However, only watch this movie if you're a big fan of the 80's slasher flicks.  This definitely falls on the lower end of the scale, but it's not all the way at the bottom.  The real downside is the disappointing ending.  It almost ruined the movie for me."],"review-user":["Coventry","choppyno","mwold","capkronos","Milo-Jeeder","Nightman85","ElijahCSkuggs","anxietyresister","Ysman","terr7u","punishmentpark","peliculajunkie","saint-21","TheMarwood","TheBlueHairedLawyer","gavin6942","whammy666","Backlash007","theeht","gridoon","poolandrews","Johan_Wondering_on_Waves","movieman_kev","Woodyanders","woolyboy76"],"review-date":["21 October 2004","28 July 2005","5 April 2007","11 April 2003","12 July 2008","12 January 2009","26 August 2008","7 November 2004","19 February 1999","18 March 1999","11 May 2016","5 October 2004","22 February 1999","27 June 2014","31 October 2014","3 October 2012","28 May 2008","17 September 2006","27 September 2000","19 January 2003","27 January 2005","14 January 2015","14 May 2007","4 December 2006","12 April 2001"],"review-rating":["7","7","5","6","7","7","7","7","10","8","6","7","7","7","1","3","1","7","7","8","3"],"review-title":[" Kids do the darndest things!\n"," Kids Slay The Darndest Things\n"," Interesting oddity\n"," Dust this baby off! Fun 80s horror.\n"," It's gonna be a killer birthday party!!\n"," The bad seeds!\n"," Night of the Little Sh!ts.\n"," Someone cancel the babysitter!!\n"," A nice creepy little horror film\n"," Bad Seed X3\n"," Kid's stuff...(!)\n"," the Best of The Worst\n"," For a cheesy early 80's horror film, not bad!\n"," Awesome evil kids movie\n"," Bad Eggs!\n"," Not the Film I Expected it to Be\n"," Hahaha...awesome!\n"," \"Just because you all have the same birthday doesn't mean that you're special\"\n"," extremely ugly horror pic\n"," Cheap, illogical, sloppy, offensive.\n"," I have a real intense dislike for this film.\n"," Not as Good as \"The Bad Seed\" but almost as entertaining\n"," Born under a bad sign\n"," An enjoyably bent early 80's killer kid horror hoot\n"," Stereotypical 80's slasher flick...with KIDS!!!!\n"]}