{"review-url":["http://www.imdb.com/title/tt0044417/reviews"],"review-text":["Beware, My Lovely is an experimental studio film from the early fifties and was directed by a man, Harry Horner, better known for his set designs. Robert Ryan plays a handyman who is hired by Ida Lupino to do some housework for her. The problem is that he is a psychopathic murderer and doesn't know it. Miss Lupino is an empathetic soul and tries to win Ryan over, to little avail. He is not the sort of man compassion could help or cure. Thus we have an interesting situation of two people who basically mean well, but one of them can't do well because there is something wrong with him. He suffers periodic blackouts during which he commits acts of violence, which he later forgets. Essentially the effect Ryan has on Lupino is that of the hunter and his prey, or in another sense a sadist. The audience finds out early on that Ryan is a mad killer, but it takes Lupino much longer. Thus we must live with this knowledge as we watch poor Miss Lupino try everything in her power to 'win' Ryan over in order to make things work, get the job done, get on with life. But getting on with things isn't in Ryan's makeup, as he is incapable of any but the most rudimentary forms of normality, and as soon as there is an opening his paranoia asserts itself. As a study in mental illness the movie isn't too impressive. What it's superlative at is showing the effect of major mental illness, with dangerous psychopathology in the mix, and its effect on a normal person. In this regard the film is realistic and compassionate, though relentlessly logical in that we know Lupino can't 'fix' Ryan, yet we want her to. The result is that, if one is willing, one can get extremely involved in this film emotionally if one can put aside, so to speak, its melodramatic structure.Horner shows us, gradually, the layout the Lupino house , a forbidding gothic monstrosity that never feels like a home. We become familiar with staircase, kitchen and pantry; and we come to know which windows Miss Lupino can use for an escape and which ones she can't.","I can see that the ratings for this film aren't all that high for this film, so I must be in the minority for liking this film so much. Well, I am right and everyone else is wrong (just kidding). I guess I like it because I am a psychology teacher and I really liked the brooding character played by Ryan. While he truly is dangerous as well as VERY menacing, you can't exactly hate him because he is clearly mentally ill and probably suffering from some sort of brain trauma. And wow did Ryan do a really good job portraying this man! You really find yourself feeling for Ida Lupino as he destroys her life. So with such intense acting and menace, why is the movie rated relatively low? Well, probably because it isn't exactly believable,...but boy is it entertaining and creative. Give it a try and don't believe the score of 6.4--it's a lot better than that!","Intense domestic suspense with the mistress of the house (Lupino, excellent as always) threatened by a psychotic migrant housecleaner (Ryan).  The 2 masters of the genre are at their heady, erotic best as they match wits, emotions, and wills in a bizarre hostage situation right out of the Saturday Evening Post.  Richly hued B & W photography with an unusual amount of close-up head shots.  The young girl who teases Ryan is really well directed here.  Improbable, but satisfying suburban melodrama.","We are in a small town, a homely widow (Ida Lupino) hires a handyman (Robert Ryan) to look after her house. She soon starts to regret it as Ryan grows erratic by the hour, it appears that she is host to a dangerous schizophrenic, and now she is unable to escape her house.Beware, My Lovely is adapted from Mel Dinelli's {The Spiral Staircase} story and play called \"The Man\". Pretty much a one set movie and a two character driven piece, the film boasts two great central performances and offers up an interesting take on mental illness. One however shouldn't be fooled into thinking this is a violent and nerve shredding picture, because it isn't. It's clear from the get go that Ryan's Howard Wilton is a dangerously troubled man, but this is a different sort of \"peril\" movie. One that throws up another slant on psychosis and thus makes it difficult to hate our dangerous protagonist.Ryan and Lupino are a great combination, they had also done the excellent, and far better, On Dangerous Ground this same year. So with both actors clearly comfortable together, it brings out a finely tuned character story all based in the confines of one house, re: prison. Ryan is particularly strong as his character flits in and out of madness, with some scenes powerful and at times inducing fear and at others garnering deep sympathy. The direction from Harry Horner is safe {he in truth doesn't have to do much other than let his actors run with it} and George E. Diskant's cinematography contains some smart and impacting visual touches. With one involving Christmas tree baubles immensely memorable. Falling some where in between being average and great, Beware, My Lovely has enough about it to make it a recommendation to fans of borderline and easy to follow Film-Noir. For fans of Robert Ryan tho, it's something of an essential viewing, oh yes, and then some. 7/10","Mel Dinelli , whose contributions to the movies include the intelligent scripts to the minor classics \"The Window \" and \"The Spiral Staircase\" wrote a play called \"The Man \" which ran on Broadway and provided the source material for this entertaining minor thriller . Ida Lupino plays a widow in small town middle America ,shortly after World War one ,who gives a job as house cleaner to a vagrant ,played by Robert Ryan ,unaware that he is a psychopath ,with a tendency to memory lapses ,and a history of killing his former employers as well as having a major persecution complex. It is not too long before she is being held prisoner in her own home and in mortal fear of her life .Crisp direction from Harry Horner and two coiled spring performances by the estimable leads keep interest and tension high . Only a strident and conventional score ,replete with skittish strings and discordant brass ,plus a somewhat rushed ending mitigate against a higher rating.Gripping and enjoyable all the same with both stars confirming how undervalued they still are.","Beware My Lovely originated from a play written by Mel Dinelli who apparently liked writing about frightened women. His first and best effort was the screenplay for The Spiral Staircase. He also did a Loretta Young suspense thriller Cause For Alarm a couple of years earlier. The play Dinelli wrote was originally entitled The Man and it ran for 92 performances on Broadway during the 1950 season. It was Dinelli's only effort on Broadway and it starred Dorothy Gish and Richard Boone. The roles that Gish and Boone played are taken by Ida Lupino and Robert Ryan. For whatever reason RKO thought to eliminate the age difference. Dinelli himself rewrote his play for the screen so I'm wondering what he thought about that. Certainly the frailty issue was eliminated completely from the story.That wasn't the only thing that was eliminated. The people are all wearing period clothing from around World War I yet there's no reference at all to the time this story takes place in. I thought that strange and later on when the telephone company repairman comes to Ida Lupino's residence, I noticed his truck was a vintage one of the same era.The film is almost entirely set within Ida Lupino's home where she's hired an itinerant stranger in Robert Ryan as a handyman. The film is a great object lesson in not hiring strangers without reference. It turns out that Ryan is a schizophrenic who imprisons Lupino in her home for about a day.Both the leads do fine jobs even with the changes made. Films like Beware My Lovely are the stuff that a small studio like RKO did best. If this were done at MGM or Paramount the glossy trappings would have overwhelmed a solid story.","The movie with its single set, minimal cast, and straightforward photography (except for a couple of brief special effects) reminds me of one of those old 60 minute playhouse dramas so popular during TV's early years. Nonetheless, the suspense hangs heavy over poor war widow Ida Lupino as she tries to deal with her semi-psychotic handyman Robert Ryan before one of his mood-swings kills her. And who better to play the troubled part than that great actor Ryan. He wasn't very versatile-- watching him essay comedy is almost painful. But no one was better at wounded idealism (On Dangerous Ground) or the psychic pain of this movie. Few actors could express as much with their eyes as this lean and towering figure.Lupino's problem is that she's locked up in her house with a man who is kind and gentle one moment and raging the next. The suspense comes from her various ploys to keep him happy while trying to escape. It's a nail-biter all the way. This is not one of Lupino's many fine \"soulful\" parts that she was so good at. Instead, it's a role many lesser actresses could have handled well enough. My favorite scene is with Ryan and bratty teenager Margaret Whiting. Ryan's already having difficulty with his masculinity and what others are saying about him. Then when Whiting walks in and finds the attractive-looking Ryan scrubbing the floor, she starts getting coy, flirting with her budding sexuality. Sensing trouble, Ryan abruptly fends her off-- finesse is not his strong suit. Insulted, Whiting attacks his masculinity by calling his work \"women's work\". That does it. Up to that point he's been courteous and professional with Lupino, trying to set himself on a normal path. But Whiting has hit his raw nerve. Now there's heck to pay as Whiting bounces out the door, leaving Lupino to pay the price. It's a riveting scene, expertly done.Anyway, this is one of the dozen or so films produced by Lupino and her husband at a time when audiences were moving away from these little black-and-whites in favor of wide-screen spectacles. Too bad. What a hugely talented figure she was both behind the camera and in front. She deserves at least an honorary Oscar from a movie industry to which she contributed so much.","Howard Wilton is a troubled man, driven by an anger he can barely control far less understand and plagued by blackouts and spells of amnesia. Finding a dead body in his pantry, he flees the scene and boards a train to continue his nomadic life. He takes a job at the home of widower Helen Gordon as a cleaner but soon finds himself feeling mocked and judged by Helen and others. When he breaks loose, Howard holds Helen in the house, with her fearing for her life from this irrational stranger.I was attracted to this film because the title suggested a tough detective film noir  something that was backed up by the description of the film as such on this very site. Very quickly though I realised that this was down to some people's assumption that anything that is black and white and tough gets called a \"noir\" but I was not disappointed because this domestic thriller is driven by two very good performances. The film starts well with Howard quickly being marked out as unbalanced at best as he runs in fear and disgust from the very crime that he has committed; it isn't long before we see this end result starting to develop again in his new house. The plot is simple in this regard but it is the delivery that keeps it tense, with the confines of the house adding to the feeling of claustrophobia and lack of an escape route. It isn't outstanding stuff but what makes it work as well as it did was a pair of strong performances from the famous lead actors.Ryan has the hammy role but manages to play it just right, delivering the complex character well while also convincing me that he could neither explain or control what he was doing. Lupino is as good as always and it is her palatable fear and confinement that gripped me and really made me buy into it. The support cast are ample but really Ryan and Lupino are hardly off the screen and it is the film's strength that they are all that it needs to do the job.Overall this is not the film I was expecting but it was still very enjoyable and effective. The story is mainly kept within the house, upping the tension and the story is well delivered by two strong performances that make the film well worth seeing.","Whenever Ida Lupino appeared or directed a film in the 30's,40's and 50's, you were guaranteed great entertainment even if the picture was black and white.  Ida was able to capture audiences and keep them spellbound until the very end of her pictures.  In this film as Mrs. Helen Gordon,\"High Sierra\",'41 along with Robert Ryan,(Howard Wilton),\"Golden Gloves\",'40 she keeps you guessing just how the relationship is going to turn out and just how poor Mrs. Gordon will be able to have a normal and happy marriage with love and real affection. If you liked Ida Lupino, who could play the roles as a criminal in a woman's prison and prison warden who was hated, this is the film for you to enjoy.  I truly believe that Ida Lupino was not given the true credit she deserved for her great talents in the Movie Industry!!!","When I first saw this film it was about 1956 and even though I saw it again recently I have not changed my mind about it. I think it was Robert Ryans best film, because he portrayed someone like my father, and he was a schizophrenic in real life,(my father) although he never murdered anyone but was affected more so during the second world war which made him worse. Having to humour him just to get by and get through the day was so apt. (My mother and brother had to do this)When I saw Robert Ryan portraying this type of man, it was a very good imitation of this type of individual, and I was impressed.","I particularly enjoyed Delly's review of this film and agree that Howard is not the only \"damaged\" character. Howard is rather ruthlessly \"set-up\" by the script, but there is no evidence that his previous employer is actually dead or, if she is, that he murdered her. Howard doesn't know and neither do we. In terror and confusion at seeing the woman lying there, he bolts. However, he never actually harms Helen Gordon, no matter how enraged he is. Indeed, he reacts with horror at Helen's fainting spell and the fact that he is holding a pair of scissors...then he resumes his tidying up and greets the recovered Helen with the almost pathetic \" I'm very tired now. I think I'll go home\". Frankly, I don't think he's a psychopath. A sick puppy, certainly, but not a psychopath.The problem with Howard is that he has no real male identity. He wanted to serve his country, but his mental condition denies him a place in the army. He is singularly rootless and isolated: no wife, no girl, no home (again, at least as far as we know). And, he does a woman's job - \"Floor's are my speciality\". Helen's niece ruthlessly strips away this pride in his thoroughness by exclaiming caustically that she would want a man with a real job. Also, although he finds himself strongly attracted to Helen, he is unable or unwilling to do more than scare her by making a strong sexual pass. He is remarkably powerless - can't fight, can't work, can't make love.Helen is justifiably terrified, however. She tries to connect to him but, finding that he doesn't respond normally (i.e. way outside the comfort zone provided by her rose-tinted memories of husband Ned), unwittingly presses all Howard's buttons by lying to him in her attempt to escape.Both characters, trapped in the house, trapped by fear, neuroses, rage and memory, deserve sympathy. I know the sudden ending has disappointed some reviewers, but I felt it fitted well, as it offered a kind of release to the characters. Helen is freed, I think, from the past. When Howard tries on her husband's army coat, Helen's disgusted reaction is highlighted. She no doubt feels that the \"sacredness\" of Ned's possessions has been violated but, hopefully, her need to keep everything \"untouched\" has been lost in the reality of her own struggle with danger. Perhaps she can move on.Howard is also freed - from his endless cycle of anger, hurt and violence. Whether he moves on to treatment or to jail is debatable, but I hope it's the former.Great performances from Ryan and Lupino. I prefer \"On Dangerous Ground\", but this is pretty good too.","A terrific B-feature. A virtual two-hander and set over the course of a day, (you can see it's stage origins and even how it must have worked as a radio play), and although only 77 minutes long, played out in sequences akin to something like real time. Robert Ryan is the psychopath who keeps Ida Lupino trapped in her own home. Both are superb, especially the under-rated Lupino whose initial independence and self-control soon crumble before Ryan's unhinged intruder. Today, of course, it would be all guts and gore but the restraint shown by director Harry Horner, (much better known as an Art Director), only adds to the suspense which at times is worthy of Hitchcock.","Wow, what an overrated movie this turned out to be! It was supposed to be \"an extremely suspenseful tale of a crazed killer holding a woman hostage and in terror in her home.\" Well, I doubt it terrorized audiences in the early '50s and I know it would put today's audiences asleep.\"Sends shivers down the spine,\" proclaims the New York Times. No, the only shivers I get is that anyone is left on the planet who believes anything the N.Y. Times prints about anything.Well, it was about a deranged man who held a woman hostage for a short time in her house but the man. \"Howard Wilton\" (Robert Ryan) was actually harmless and friendly. In fact, this was one of the nicest roles Ryan ever played! Yes, \"Wilton\" was nuts but he never harmed the woman and only wanted a friend to trust.The film even turned boring after awhile with very little going on except a lot of yakking. Beware, my reader.....this sucks.","Beware, My Lovely came on TV on BBC2 recently during the early hours so I set the video to record it and was pleased I did.A man finds a dead woman so he escapes so he don't get the blame for her murder and gets a job as a handyman at a widow's house but she does not know what she is taking on here. It turns out this man is a psychopath and possible killer. He starts tormenting her and locks her in the cellar. He then cuts the phones line so she can't get help from the outside. A young boy who regularly does shopping for her notices something isn't quite right when he comes to drop her shopping off. Eventually, the man leaves, acting as if nothing has happened.I can see why Beware, My Lovely was given an X certificate when released in the cinemas. Some of the scenes are rather nasty for this time. I also thought the man was going to do something to the young boy too.The cast features an excellent performance from Robert Ryan as the psychopath, Ida Lupino as the widow and are joined by Barbara Whiting and Dee Pollock as the boy.This is certainly Robert Ryan's most chilling performance I've seen. A must see.Rating: 4 stars out of 5.","Ida Lupino is trapped in her own home by crazy Robert Ryan in \"Beware, My Lovely,\" a 1952 film from RKO. Lupino and Ryan did three films together and worked well as a team, both being consummate professionals and strong performers. In this film, based on a Broadway play called \"The Man,\" Lupino is a World War I widow who rents out a room in her home. She's very active and well-liked in her community and though her husband has been dead for two years, she's not ready to move on. The man who rents her room goes on vacation, and Lupino hires Robert Ryan to help her with some heavy-duty cleaning in the house. He's friendly enough to start, but later terrorizes her, locking her in the house, and not allowing her to answer the phone or the door, as he grows violent and more out of touch with reality.The character played by Ryan is shown in the beginning of the movie running away when he discovers a dead body in another house he's working in. It isn't clear whether or not he's the killer, since he seems surprised to see the body. He might be a split personality, as when his personality turns ugly toward Lupino, he seems to have no memory of his activities when he comes out of it. He doesn't know that he has the keys to Lupino's house in his pocket and doesn't know why he has tickets to a party that he bought from young children who came to the door.\"Beware, My Lovely,\" is a very suspenseful film, and the two leads give terrific performances. The tension builds to a very high level and ends in a way you're not expecting.","The subject is World War II and Robert Ryan is a rejected soldier whom Lupino hires as handyman. She is a war widow.The set is limited but the acting makes up for this. Robert Ryan is conflicted: one moment he seems nice, then confused about where he lives. At first Lupino tries to help him. He seems troubled but nothing more dangerous. But how do we know? The suspense builds. I truly enjoy films like this, which rely on the human element for suspense. What is this man capable of?. There are some scenes with O.Z. Whitehead and Dee Pollock as an annoying grocery boy who sees something is wrong. We keep thinking she will be helped, then Ryan's personality turns again. He becomes like a Jekyll/Hyde character and eventually chases Lupino with a knife.Worth watching for these two superb actors. 9/10.","Suspense film of limited style ( despite attempting a Wellesian shot of Robert Ryan reflected in some Christmas ornaments ) that wins points for an anticlimactic ending that nagged at me. The concept of order, rigidity, playing the assigned role always seems to be under the surface in this movie, with Robert Ryan initially seeking employment as a handyman who polishes floors and rearranges furniture. He will continue to try to put Ida Lupino's ramshackle house in order throughout the movie and she will resist. When she's left cradling the dog at the end, the desolate feeling of the image makes you wonder if, just maybe, she should have tried to accept Robert Ryan's proposal to to live with her, as abrupt and irrational as it may have seemed...In the end, the movie may be just as much about Ida Lupino's \"insanity\" -- her and our loneliness -- as Robert Ryan's. The difference is that she has a place in society as a war widow, and this role, unsatisfying as it is for her, at least gives her the outward stability and community respectability that the rootless vagabond played by Ryan doesn't have. When he puts on the dead soldier's uniform, after having told us that he was too sickly to join the army, Lupino is given one of those reaction shots that Fritz Lang perfected, where the subject comes off like a robot given an order that contradicts his entire reason for having been made in the first place, yet must accept it logically -- she seems more offended than ever before, but also more connected to Ryan. Could it be that only Robert Ryan, the psychotic murderer, could have made Lupino face the truth about our senseless, anarchic universe, and that they could have bonded together against it, if she had just been as openly and unashamedly broken as he was? Could this very question be at the root of the war between the sexes, with women trying desperately to maintain the status quo, no matter how inwardly sick, while men pace the streets with chaos visibly battering their skulls?","Ida Lupino and Robert Ryan are two of my favorite performers from the 1940s and 1950s. They're well matched, and this movie has none of the cloying nature of their \"On Dangerous Ground.\"I watched the beginning twice and still am not sure what Ryan did or didn't do before taking it on the lam and ending up in the town where Lupino is a war widow. He is a very troubled person, though. He's paranoid, insecure, and has occasional violent impulses.The suspense in this essentially two-character drama builds. It is especially tense when the repairman comes to fix the phones Ryan has pulled out of the wall. Lupino asks if he will give Ryan a ride home -- not that we have any idea where his home is, nor, clearly does Ryan (though he initially acquiesces.) Unbeknownst to Lupino, Ryan has left the repair van and returned to her house. But she asks the repairman to lock her in for her safety. Uh-oh! But then Ryan leaves of his own accord and she is safe in her home. The viewers when this was in theaters, surely on the edge of their seats at this point, were left to put on their coats and drive home, scratching their heads. We, looking at the video or watching it on TV, do the same today.","SYNOPSIS: 1918: A psychotic killer hires himself out as a handy-man to a young widow. NOTES: \"The Man\" was originally written as a short story. Mel Dinelli adapted it himself for the stage. Kermit Bloomgarden produced it on Broadway at the Fulton, opening 19 January 1950. Running a very modestly successful 92 performances, the play starred Dorothy Gish, Don Hanmer, Peggy Ann Garner, Richard Boone and Robert Emhardt. The director was Martin Ritt. \nAlthough the movie is credited solely to Harry Horner, Ida Lupino directed some scenes. \n \nCOMMENT: Minor psychological thriller, obviously based on a stage play as most of the action takes place in the one set and centers mainly on just the two characters. Robert Ryan gives a competent study of mental illness, but Ida Lupino is mostly called upon to look frightened. One of the film's defects is that we never get really close enough to the Lupino character to sympathize with her dilemma. The conclusion is both tame and predictable, though Horner and his cinematographer do what they can to give it a bit of suspense. But what was the sense in setting the film in 1918 when so little use is made of period detail and atmosphere? Lupino's home could have been any old mansion. In any case, such modern devices as telephones seem anachronistic. \nProduction values are very moderate. The film was undoubtedly shot on a two or three-week schedule. OTHER VIEWS: Superbly photographed film noir, boasting fascinating performances from the entire cast. Not only are the principals appropriately edgey, but the minor roles are also charismatically played. We particularly enjoyed Barbara Whiting's account of a provocative teenager and O.Z. Whitehead's insistent would-be tenant. As might be expected from an art director and production designer, Harry Horner angles his camera to make impressively atmospheric use of the large interior set in which most of the action occurs. The pace is taut enough to disguise the script's stage origins until the downbeat and somewhat disappointing conclusion. - JHR wrting as George Addison.","I don't think it's ever a good idea to begin a story about a psychopathic killer when the opening scene has a potential murder victim blink their eyes. How could the film makers let that slide after seeing the rushes? It would have been an easy enough scene to fix, OR, it could have been explained away as the faulty interpretation of Howard Wilton's (Robert Ryan) fevered mind, except that he had already turned away to leave and wouldn't have seen the victim do it.There's other stuff in the story that didn't make sense to me either, but you know what - I liked it anyway. Ida Lupino and Robert Ryan portray their characters fairly convincingly, and the story builds the requisite amount of fear and tension as it builds to a suspenseful climax. Except there really was no climax to speak of when you get right down to it.One scene that really caught my eye was a nicely created effort by the cinematographer. It was when Helen Gordon collapsed in relief on the chair next to the Christmas tree, and Howard (Ryan), who made it back into the house, came down the stairs with his image reflected in the ornaments on the tree. There had to be some thought put into that shot and it was staged really well.Without really knowing the psychology of real life nut cases, I didn't know how to react to Howard's sudden in and out lapses into paranoia and delusion and back again, so that was a bit unsettling. However it did up the ante on whether or not he would explode at some point and do some major damage. Ultimately though, this madman went out without too much of a whimper, making the ending somewhat less than satisfying.","With two Christmas cookies and a cup of coffee, I retreated to our bedroom to watch TV. I was able to see a first rate movie, one that I had not heard of before and realized that the name of the movie( Beware, My Love), indicated something other than a typical love film. Indeed it was. I was enthralled with the acting of Robert Ryan and Ida Lupino. It captivated my attention from beginning to end. Done in black and white and for the most part action within the older home of the widow played by Ms. Lupino. Ryan's acting, subtle, then powerful, then confused, then manic was so superbly done. He, this most handsome of men, could sweep any lady off her feet. However, in this drama, one feels a strange sadness for him as he displays his mania and then a feeling of insufficiency, and then a human demeanor to boot. As always, a superb and talented actress, Ida Lupino played a believable role of a woman treasuring her thoughts and mementos of her late husband. I rate this movie much higher than the few kudos that it has been given. A thriller to see again.","This tense \"woman-in-danger\" thriller is a low budget offering from Ida Lupino and Collier Young's independent production company \"The Filmmakers\". Its brief running time and claustrophobic atmosphere contribute strongly to the intensity of the piece but its impressive visuals and the marvellous performances are what ultimately make it so enjoyable.Howard Wilton (Robert Ryan), a handyman who never stays in one place too long, arrives at the small town boarding house run by teacher and war widow Helen Gordon (Ida Lupino) and is immediately hired to help clean the large property in readiness for the Christmas holiday. With no boarders currently in the house, Howard and Helen are alone in the place and it quickly becomes apparent that Howard's behaviour is a little unusual. He sees his previous dead employer's image in a bucket of water and anxiously asks for reassurance from Helen that his work is satisfactory. He works hard at cleaning the floors but is uncomfortable because he thinks Helen is always watching him.Helen's flirtatious niece Ruth (Barbara Whiting) reacts badly when Howard doesn't appreciate her behaviour and taunts him for doing \"a woman's job\". This makes him furious and after she leaves he locks the doors of the house and keeps the keys in his pocket. He then becomes increasingly unstable and threatening as he effectively makes Helen his prisoner. His violent mood-swings become extreme and unpredictable and he also has alarming lapses of memory. On various occasions, he terrorises Helen in various ways including shutting her in the basement and threatening her with a pair of scissors. He even tries to kiss her after putting on her husband's military uniform-coat and tears the telephone lead out from the wall.When Helen's nightmare finally comes to an end, it happens unexpectedly and in a way that's certainly not typical of this type of thriller.Robert Ryan's facial expressions convey his character's anxiety, confusion and anger very convincingly and he's also similarly believable in showing how vulnerable, insecure and lonely Howard is at other times. Ida Lupino strikes a perfect balance in showing the combination of control and sheer terror that Helen experiences and in doing so, is very credible as an intelligent woman who tries to use different strategies to extricate herself from her ordeal.The use of superimposed images seen during a train journey and in a bucket of water are very effective as are the use of mirror images (a favourite noir motif) to visually emphasis Howard's schizophrenia.\"Beware My Lovely\" is typical of much of \"The Filmmakers\" work as its quality easily surpasses what would normally be expected of so modest a production.","I saw this film yesterday for the first time, and I guess it shows that one's opinions of beauty (and the caliber of acting) really are in the \"eyes of the beholder.\" I decided to write this \"review\" for one primary reason: The writer of the first review referred to Ida Lupino's role as that of \"a homely widow.\" Homely? If Ida was \"homely\" in this film, then my taste in women must be flat ass backwards. I thought she was gorgeous, quite possibly the best I've ever seen her look. The other reviewers with whom I strongly disagree are those who criticized the acting. Say what you will about the film (it undeniably had it's flaws as well as its strengths), IMHO, the acting of the two principals was absolutely spectacular. Robert Ryan's expressions changed almost by the second as he slipped into, and out of, reality. And Ida was magnificent from beginning to end. I agree that the ending was a major disappointment. My immediate reaction to it was to say to myself, \"THAT'S the end?\" Nevertheless, the experience of watching those two performers play off each other for an hour and a half is definitely one that I would strongly recommend.","****SPOILERS**** Since her husband was killed in action on the Western Front war widow Helen Gordon, Ida Lupino, has been having a hard time keeping up and cleaning the Victorian style house her husband left her. It's when the handy man Howard Withon, Robert Ryan, showed up for work that Helen's housekeeping troubles were not only solved by the very eager to do a good job Howard he also put her safety and very life in danger as well.Howard being the good and excellent worker that he is is very sensitive in what he thinks what people think of him and his work. He also has trouble remembering things like where he came from what he did and who he worked for previously as a handy man and most of all does he have a criminal record like assault & battery or even murder. Were shown that at his previous place of employment the lady of the house was found murdered by Howard and he just took off feeling that he while in some kind of self induced hypnotic trance murdered her. All throughout the movie Howard goes from hot to cold, and bad to good, in his feeling about what Helen thinks about him and especially his work cleaning up her house. Helen at first thought that Howard was a bit of an odd-ball but harmless. That's until he went nuts when he found out that the room he wanted to stay at that Helen was renting out to Mr. Armstrong, Taylor Holmes, was not available to him. It's when Howard did find out that in fact Armstrong's room was rented out to a Mr. Franks, O.Z Whitehead, without his knowing that he completely flipped his lid!With Howard now completely out of control Helen tries to get help by calling the police only to have Howard pull out the telephone cord and locked her in the house as he tries to figure out his next move. With Howard having serious memory problems he keeps forgetting what he's doing making Helen's desperate situation, in her being a prisoner in her own house, far worse then it already is. ****SPOILERS**** Even though Howard isn't someone you'd want to invite home for dinner with the family he is at times very childlike in his behavior and entertaining even if a bit nuts! Howard soon himself realizes that he's a dangerous and possibly homicidal lunatic in the few lucid moments he has in the film. It's then when he decides to turn himself over to the telephone repair man Mr.Stevens,James Willmas, who drives him to the local hospital mental clinic to get him help. The kind of help that Howard needed his entire life which by now, with him possibly involved with a slew of murders of housekeepers in and around town, he just about ruined.","I can't believe the high marks people have given this film on this site. The writing is incredibly bad with people coming in at just the right time and revealing exactly what the heroine is doing to try to escape. (Don't you just hate it when that happens?). And the acting is so very, very bad that you may get a splinter in your eye from all the scenery being chewed.A nut is holding her hostage, children are outside the open screen, so she whimpers for help instead of screaming when only a moment ago she was brave enough to be smashing windows to yell to these same children.She's finally free and alone in the house. Her chance to go for help, so what does she do? Wanders around the house and lies down. She's in the basement, locked away. So what does she do? Takes a little nap. Come on! Most of the movie is the nut wandering away and finding her sitting there snoozing when he wakes her up. Four times! What? If the writer is too bored to actually write a real plot why should we be paying attention? I think the key here is that it was originally a play for the radio, so they filled in with the heroine just sitting around rather than pretending to be screen writers and actually writing any action.And the ending is horrendous.The whole movie is completely implausible, horribly written and almost comically acted. Beware this movie at all costs!"],"review-user":["telegonus","MartinHafer","funkyfry","Spikeopath","lorenellroy","bkoganbing","dougdoepke","bob the moo","whpratt1","imogen.chiv","elf-65","MOscarbradley","ccthemovieman-1","chris_gaskin123","blanche-2","MarieGabrielle","Delly","Handlinghandel","JohnHowardReid","classicsoncall","hfbhill0423","seymourblack-1","oversplayer","sol-kay","arieliondotcom"],"review-date":["18 July 2001","9 February 2006","3 October 2002","5 November 2009","9 June 2003","10 November 2009","22 November 2007","27 March 2005","6 March 2004","15 May 2002","15 August 2006","11 June 2006","1 December 2006","5 April 2005","20 May 2006","23 June 2007","12 July 2005","7 November 2004","28 March 2018","21 December 2016","29 December 2014","15 August 2014","27 November 2012","12 October 2011","20 May 2006"],"review-rating":["9","8","7","7","8","10","9","8","8","3","8","7","9","6","7","7","9","7","6","7","1"],"review-title":[" Beware Of Strangers\n"," wow--is Ryan a nut-case in this film!\n"," Don't beware this film, it's lovely!\n"," The Man, The Play & The Actor.\n"," Proficient ,and gripping thriller\n"," Schizophrenia\n"," Don't Place That Ad\n"," A confined and tense story made very engaging by great performances from Ryan and Lupino\n"," Ida Lupino was a Great Actress & Director!\n"," So True\n"," Thought-provoking Suspenser\n"," A small gem\n"," Beware Of Misleading Reviews & Overrated Movies\n"," Robert Ryan at his creepy best\n"," Don't be alone with the handyman\n"," well-done....\n"," Hits you long after watching it.\n"," Two Great Stars In A Promising, Ultimately Disappointing, Noir\n"," Superbly photographed, but somewhat tame and predictable!\n"," \"...I wouldn't want to hurt you. But I might you know.\"\n"," High on Suspense\n"," Impressive Visuals & Marvellous Performances\n"," Ida Lupino a homely widow?\n"," Howard's not such a bad guy.He just has trouble remembering things thats all.\n"," Spoilers: Beware Bad Acting and Horrible Writing\n"]}