{"review-url":["http://www.imdb.com/title/tt0082525/reviews"],"review-text":["HONKY TONK FREEWAY involves a small Florida tourist town named Ticaw and the people who live there, led by William Devane playing the part of the Mayor/Preacher Kirby T. Calo who also operates a hotel and tiny wildlife safari park.  The town's major draw is a water-skiing elephant named Bubbles.  When the state highway commission builds a freeway adjacent to the town, Devane slips an official 10,000 dollars to assure an off ramp.  The off ramp doesn't come so the townsfolk literally paint the town pink to attract visitors.  Meanwhile, we are introduced to several characters from various parts of the United States all for one reason or another are heading to Florida.  We know they will all end up in Ticaw but finding out why and how is half the fun.  There are bank robbers from New York (George Dzundza, Joe Grifasi) who pick up a cocaine dealing hitchhiker (Daniel Stern), a Chicago copy machine repairman and wannabe children's author Duane Hansen (Beau Bridges) who picks up a waitress Carmen Odessa Shelby (Beverly D'Angelo) who is carrying her mother's ashes to Florida, a dentist and his family (Howard Hesseman, Teri Garr, Peter Billingsly) vacationing cross country in their RV, an elderly woman Carol (Jessica Tandy) with a drinking problem and her loving husband Sherm (Hume Cronyn, of course), two nuns (mother superior Geraldine Page, novice nun Deborah Rush), a wannabe country song writer hauling a playful rhino and other wild animals to Ticaw, and more.  This is a very funny movie with quirky interesting characters, good actors, a great director (John Schlesinger who helmed Midnight Cowboy, Marathon Man and The Falcon and the Snowman) and a mix of slapstick comedy in the tradition of It's a Mad Mad Mad Mad World and biting satire of American small towns such as Cold Turkey.  Think Mayberry meets Picket Fences, or Hal Needham meets Robert Altman.  A fun film with where half the fun is to see who's going to show up in the film and what's going to happen next.","VERY memorable comedy. It's fun to watch the many situations develop and finally converge after a long journey on that greatest collection of eclectic humanity (and the world's largest honky-tonk) - the great American Freeway. Like \"...mad, mad world\" it's got loads of contemporary talent, old-boy politics, good comedic action and dialog. Unlike that one it is the target that seeks, not the unwitting seekers - they have no idea what they really want as they drift along America's great road. Nor does it carry the weight of having a great fall guy who is saved only in the end by a great belly-laugh. But the ending stunt sequence is nothing short of spectacular with excellent film editing, humor and timing, and the big city bank scene is hilarious with very original acting by one very talented character in particular. The total aplomb of the city dwellers in the face of chaos leaves one feeling like the proverbial fly on the ceiling. The slapstick is funny, but Honky Tonk Freeway deserves to be heard and seen closely because it is surprisingly loaded with nuance and character reactions that are easily missed. All in all a very funny reflection of who we were and are, good or bad, and the goofy situations we find ourselves in. It was just meant to be FUNNY and it is!","A notorious big budget flop when released. This Robert Altman inspired comedy has some terrific moments and an occasionally inspired cast. Although it goes on to long an loses its focus completely, there are enough funny moments that will keep a curious viewer watching until the end. If you are a fan of character actors and actresses, this will be a treat for you; you will recognize so many terrific little known performers throughout this movie (you may not know their names, but you know their faces), heck even the kid from A Christmas Story turns up in a small part. Rent if from Netflix, if you read this, I bet you will enjoy it.","Unappreciated in a way MAD MAD WORLD was celebrated, HONKY TONK FREEWAY is an international view of crass funny Americana. A megaton flop in its day, it does deserve reappraisal and basically awe for the extravagant scope and cost of the production. Also like NASHVILLE or THE BIG BUS or even RAT RACE it is an ensemble comedy cruelly harpooned by dumb critics of the day who only reviewed the excess and the cost. This must have been an unappreciated accounting legend, like CLEOPATRA, or 1941 (which I love), HEAVENS GATE, LUCKY LADY or later THE BLUES BROTHERS as demented American films that are clever and made with vision, especially when one considers the cost and failure of Mall releases of today. A DVD reissue with the sort of 3rd disc that Cleopatra has will be very welcome.","Back in August, '81 there was a country-ish buzz to movies, big hits like \"Urban Cowboy\", \"Every Which Way But Loose\", \"Smokey and the Bandit\" were all the rage. For that reason I suspect the producers of this movie chose \"Honky Tonk Freeway\" as the title hoping it would help the movie's box office receipts by drawing in that same \"Urban Cowboy\" crowd. Instead \"Honky Tonk Freeway\" bombed at the theaters and I suspect it do so in part by being burdened with a poorly chosen title. Thats same problem burdens it now on video and thats too bad because its a pretty good movie and in a comedy style ahead of it's time. No matter what, probably anybody who can remember 1981 will enjoy it.Its too bad this movie bombed. But I think it would have anyway even if it hadn't been saddled with a poor title. Its a movie ahead of its time. One could look at this movie now and see that its clearly a father or *great-uncle anyway) to the kinds of comedy made today. For its day \"Honky Tonk Freeway\" was pretty full of innuendo and a kind of frankness about life that didn't get popular in comedy till much later on. While clearly its a child of \"Airplane\", its more mature, and while its certainly no \"Knocked Up\" it clearly points in that direction. The characters are more \"comedy-mature\" in that they are low-key and don't ever think anything they do is anything other than serious. The jokes are in the choices of what to emphasize and the camera views and the way the view themselves and their situations.But, more than that, \"Honky Tonk Freeway\" is a real time capsule. A great look back at the exceedingly early 80's. The people in this movie are dressed and act as everyday people of 1981 did. It was clearly meant to reflect the times and be a sly comedic comment on everyday life around them.I don't know if my review is helping you, but this is really a good, sometimes kind of excellent, movie thats worth renting if you want to see how a lot of faces that are familiar today looked when they were 30 years younger. Beverly D'Angelo is so young its hard to realize its her sometimes. So are Beau Bridges and Terri Garr. Terry Garr was just about to become the toast of Hollywood as her next movie after this one was \"Tootsie\" which finally made her a star. Howard Hessmann was arguably the biggest \"current\" star of the the day when this movie was made. Back in 1981 Howard Hessmann was the star of the big hit TV show \"WKRP in Cinncinatti\". He played its lead character, the rascally night DJ. Daniel Stern was just about to break out as a star as the grown-up narrator voice of the lead child character in the popular 80's sitcom \"The Wonder Years\" There are also several faces that are no longer with us these days, its nice to see Hume Crowyn and Jessica Tandy as a an old married couple on a journey. Jessica Tandy would finally pick up her Oscar ten years after this for \"Driving Miss Daisy\". There is also the great Geraldine Page in one of her final movie appearances. Though she'd had a brilliant career she didn't get her Oscar till four years after this in 1985's \"Trip to Bountiful\", for which she richly deserved it, and she died very soon after getting that award.Plus, there are lots of other faces in this movie, actors who aren't big stars but who have done tons of supporting work. Many are familiar even if you can't think of their name.This movie is a pleasant little diversion. A bunch of people with a variety of problems set out from various locations each for their own individual unrelated reasons who all, in a vaguely Altman-esk way, end up heading towards Florida and unbeknownst to them a rendevoux in the little town of Ticlaw, Florida, which happens to be reeling from the effects of being bypassed by the recently constructed interstate nearby which did not construct an exit to Ticlaw which effectively takes the town off the map.And thats also what this movie is about, fascination with the whole idea of the interstate system, which had only recently been \"completed\". It had taken a generation to build, from when it was authorized by congress around 1960, through many years as different parts were built and then \"went live\" and by 1980 most of the system had finally been built and all connected together and first the first time the promise of what the interstate system would be had turned into what is. And people were enchanted by it. Everybody by 1980 was pretty much an \"interstate freeway veteran\" in the sense that by then everybody had used parts of it and knew how it worked and how it was different from other roads in that it had no red lights or stop signs, only on and off ramps, and that it went to places that were formerly less accessible. By 1980 anyone could drive anywhere in comfort and without having to stop for anything except to eat and sleep and a bathroom. And this was all new then. The ending is anti-climatic and isn't that satisfying albeit its one spectacular moment. What makes it great is it's the journey not the destination that makes Honky Tonk Freeway timeless in spite of it being such a product of its day. Forget its title; instead let it take you down memory lane.","This movie bombed at the box office and in the voting here but I loved it. One measure of a movie's worth is how much of it you can still remember after 25 years. I won't bore you with a list but there are dozens of deeply comic scenes, also a good story and great casting. The inept robbers are a hoot. See it and judge if it ever gets on TCM.","In the early '80s, I recorded Honky Tonk Freeway from the cable.  Since then I have waited, hoping it would be on DVD.  Yesterday I found it.  It is one of the best humorous character studies I ever saw.  The Old Fashioned episode is priceless.  At this time (4/28/02) only two have reviewed it. One hated it, the other loved it. If you have a DVD player, either rent it, or buy it as I did.","I remember watching this movie over and over again when I was a kid. I loved it. Whilst I haven't watched it recently, I am sure I would enjoy it just the same today. Its a very light funny movie guaranteed to make anyone laugh. The situations with each one of the characters were so funny and imaginative! I particularly liked the one with the girl traveling with her mother's ashes (who ends up picking them up on the highway after the explosion) , the robbers and the nuns. This nice humour style is much missed these days. Also, this movie proved that actor Paul Keenan (Dynasty/Days of our Lives) was off to a great start. I recommend it to anyone lucky enough to find it in their local video shop.","The obsession of modern society with the ownership of a personal automobile is a very appropriate subject for satire. One could consider the role of private vehicles as one of the important elements in population control (although limited in its value by the associated medical costs!). Alternatively one could assess the role of the automobile in the atmospheric pollution that threatens dramatic changes of climate which will have a devastating effect on the lives of all of us; or one could look at the long term impact of more and more fertile agricultural land becoming sterilized by the construction of wide concrete freeways. There is plenty of scope for the inventive film maker to deal with such major themes. Instead most of the films dealing with this issue which have been released so far, raise only such trivial concerns as the infatuation of teenagers with acquiring ownership of their own vehicle, or occasionally with the problems associated with 'driving under the influence'. The film Honky Tonk Freeway is a noble exception to this collection of triviata. In it, the director John Schlesinger takes a long and very devastating look at yet another aspect of the automobile culture, the need for small towns to be closely connected to a major highway network if they are not to just fade away.\tThe film features Ticklaw, a Florida town that has become largely dependent upon the income brought in by short stay tourists heading towards the nearby coast. A new freeway under construction does not provide a promised access junction and the long term implications for the town are serious. The story line is the series of increasingly dramatic steps taken by the town to ensure that it remains an attractive stopping off point for through travellers. The film is a comedy with an edge and with very sharp characterisation. Unfortunately much of it is overdrawn to the point where it almost becomes pure slapstick, and for me this detracts a lot from the message of the film. However, although overlong, it remains quite enjoyable to watch; and the sequences showing an elephant being trained to waterski to entertain the visitors are almost etched in my memory. This could have been a really great film, but unfortunately much of it was so overdrawn that I can only recognise it as a near miss.","A wonderful film ahead of its time,I think so, In the eighty's it was all about winning, Greed is Good ? Remember that one ? I have seen this film more that 20 times, To me this is a real desert island film, I keep watching because there is always something more to learn about these flawed characters that I just love, Jessica Tandy, and Hume Cronin, are simply wonderful,Also Beverly D'angelo, Beau Bridges come in at a close second, don't get me wrong there are many more great performance's in this film, and it is also the way it is written that made it for me, and I hope you, a film that you will want to see over and over, I think TV shows like \"Northen Exposure\", and now \"Earl\" owe a lot to this film. but remember it is not a Tom Cruise film.","A sprawling, overambitious, plotless comedy that has no dramatic center. It was probably intended to have an epic vision and a surrealistic flair (at least in some episodes), but the separate stories are never elevated into a meaningful whole, and the laughs are few and far between. Amusing ending, though.    (*1/2)","I found this movie on Netflix and had to add it to my queue. I wasn't disappointed when I got it as it's just as funny now as when I saw it at a local drive-in theater back then.It builds to a climax nicely with you getting glimpses of the various characters as they begin their trip across America on the \"Honky Tonk Freeway, America on wheels.\" This was a strange comedic role for William DeVane as I remember him as Kennedy in the 1974 TV film \"The Missiles of October\" and felt no one could have pulled that dramatic character off as well as he did.It reminds me a bit of Dick Van Dyke in \"Cold Turkey' where Van Dyke played the local minister. DeVane's role as mayor, minister, and activist was typical for small towns so it makes his character seem amusing and real.Howard Hessman and Teri Garr as the spoiled family in the RV was on target for the time as well. Anyone who has traveled across country with small children, (Are we there yet?) will appreciate those scenes.The scenes of a small town struggling to survive reminded me a lot of the small town I grew up in but they handled it with the charm and humor that you often only saw in small towns. It's sad that many small towns disappeared because of the freeway system and it gives a realistic if humorous view of what they had to do to survive. (Used zoo animals anyone?)All in all, it's a lightweight comedy with no particular message but a humorous glance at America during the early 80's. Well worth watching if you just need a bit of good cheer.","I think I've been in the movies.The freeway scenes were filmed in Orlando, on the East-West Expressway (today known as SR 408.) I worked evenings for a bus company on Division St. (about 20 blocks south of downtown) and one summer night in 1980 I got off work about 1 a.m. and took the East-West Expressway home to Goldenrod (on the east side of town.) Back then, the toll was only 25 cents (man!) and it shaved half an hour off your driving time, so I went up Orange Ave., hung a right on Anderson St. and burned rubber up the entrance ramp. There was some guy standing there with a flashlight and he almost jumped out in front of me to get me to stop, but I swung around him and floored it! I thought \"who the H*** is that?\" as I swung up onto the Expressway at 65 MPH.Suddenly I realized something funny was going on... the traffic was bunched together in one giant wolf-pack, and the whole pack was only going about 45. Thinking nothing of it, I just started weaving from lane to lane through the pack, still going at least 65, until I popped out the front and left 'em all in the dust.It was only later that I found out that the cops had closed the expressway for about 2 hours that night so that they could film a scene in Honky Tonk Freeway! (Everybody was driving 45, but the film was sped up later to make it look like 65 or 70.) I busted right into the middle of their scene, and maybe I messed it up! Maybe they had to re-shoot that scene! To the director, I can only say: sorry!So, if you see a brand-new pastel-blue 1980 Chevrolet Citation notchback coupe in that scene really hauling butt, it was me!","Meant to be some sort of a social commentary about the way that our lives were spinning out of control in the 1970's, this movie plays more like something Mr. Schlesinger threw together after having a bad day on the freeway. A mish mash of snippets about the nuts encountered along the freeway in Florida, and along the freeway of life, the cast is mostly wasted and probably ended up on the cutting room floor. The problem is that what DIDN'T end up on the cutting room floor probably should have! Now available on DVD, it's kinda fun to see a comedy that would have cost $100 million to produce had it been made in 2004. It rolls along and isn't too difficult to sit through, and, strangely enough, in 2004 we're all still pretty much justhopping in our cars and going faster and faster, heading nowhere.","From writer Edward Clinton and director John Schlesinger (\"Midnight Cowboy\") comes this offbeat collection of character driven vignettes. It's overall quite engaging and it's too bad that the film was a major flop upon its initial release. The cast is excellent and the movie is generally amusing, the kind of thing that should generate some smiles if no outright belly laughs.The main story thread is that of a tiny Florida town named Ticlaw, whose only real claim to fame that they can make is a safari park (including a water skiing elephant) operated by mayor / entrepreneur Kirby Calo (William Devane). When the government creates a brand spanking new freeway, but neglects to put in an exit leading to Ticlaw, Calo and the various citizens resort to some desperate measures to ensure tourist traffic - such as painting the town pink. As this goes on, we're introduced to an assortment of people who each have their own reasons for travelling to Florida. Among them are a pair of bank robbers (George Dzundza and Joe Grifasi), a waitress transporting her mothers' ashes (Beverly D'Angelo) and a copy machine repairman / wannabe children's' book author (Beau Bridges), a veteran nun and a novice one (Geraldine Page and Deborah Rush), a dentist and his family (Howard Hesseman, Teri Garr, Jenn Thompson and Peter Billingsley) in an RV, an old ad man and his alcoholic wife (Hume Cronyn and Jessica Tandy) and a truck driver & wannabe country & western songwriter (Paul Jabara, who does co-write some of the songs for the soundtrack).One of the delights here is in checking out a cast just FULL of familiar faces - in addition to those mentioned, David Rasche, Daniel Stern, Celia Weston, Frances Lee McCain, Jerry Hardin, John Ashton, Frances Bay, Nancy Parsons, Leo Burmester, Jeffrey Combs, and an uncredited Anne Ramsey all turn up as well. There are enough lively and amusing moments to make for decent entertainment, as well as an ingratiating mixture of satire and slapstick. Schlesinger proves himself quite capable of handling comedy on a grand scale and keeps things interesting throughout, allowing the large cast time to create some memorable and endearing characters. While watching, the viewer will be intrigued to see how all of these people will meet, and what their fates will be. Plus, you just can't help but root for Calo and his crazy comrades, no matter what their methods might be.Overall, \"Honky Tonk Freeway\" is good fun, is punctuated by some catchy songs, and has enough spirit to make it watchable for a decently paced 107 minutes. Another review here describes it as \"Hal Needham meets Robert Altman\", which is a very good way to put it indeed. Hopefully more comedy fans can discover it and lift it out of obscurity.Seven out of 10.","I was stunned to read here that this film was big-budget; like others, I saw it long ago and remembered certain things clearly and lovingly. But I never thought of it as anything but a B flick. As such - it's good. Sometimes it's far, far better than good, mostly due to the sublime Jessica Tandy and Hume Cronyn. There are overdone, clumsy moments, and there are moments that are tiny gems (the two nuns at the seafood restaurant, for instance). The whole thing is also supremely early 80's. Yet. This works beautifully as a comfort film. Don't expect great things, take it as it is, and you'll have a fine time. (And, if you own it, you'll do as I do and cut back to the 'old-fashioned' scene a million times.)","The film travels at a frantic pace, has an amazing cast of character actors, a catchy theme tune, and converging plot lines. All this mayhem is headed for a small Florida town in need of a freeway exit ramp in order to survive. \"Honky Tonk Freeway\", is a wonderful time capsule of the 1980s. With \"Ricky the Carnivorous Pony\", a water skiing elephant, a drive through mortuary, a rampaging rhino, and the town of Ticlaw painted pink, what's not to like? Also included are political payoffs, a nun having impure thoughts, a hilarious pair of bank robbers, and a nymphomaniac traveling with her mothers ashes. The finale includes blowing up a highway, and great old cars being crashed. All the carnage is nicely tied together with insults, toilet humor, and stupidity. Despite some drug use, and a few four letter words, \"Honky Tonk Freeway\" really is harmless fun, and flat out funny. - MERK","The credits read that this was directed by John Schlesinger but that's very hard to believe. VARIETY called it \"Nashville on wheels,\" and that's even harder to believe. This $24,000,000 mess about a small town in Florida trying to get an exit ramp off of a new highway is more head scratcher than anything else. It's a way too long, rambling curiosity that manages to cast William Devane, Beau Bridges, Hume Cronyn, Jessica Tandy and Geraldine Page and utterly waste all of them. None of these people are known for their comic prowess and having them bicker, talk in silly southern twangs and dress like nuns is almost embarrassing to watch. Ironically, genuinely funny actors like Howard Hesseman, Teri Garr and Beverly D'Angelo have zero to do. The screenplay is by Edward Clinton, who, not surprisingly, has no other screen writing credits. If you've been dying to see a water-skiing elephant, here's your chance. The great Schlesinger got back on track with seven more feature films including the excellent THE FALCON & THE SNOWMAN and PACIFIC HEIGHTS."],"review-user":["SanDiego","xj40jeff","rockabilly-1","ptb-8","HoldenSpark","mmm-16","Cidla","HL-UK","bbhlthph","sonnythefat","gridoon","gwcohn-2","borisratnik","joesorce","Hey_Sweden","jacklmauro","merklekranz","JasparLamarCrabb"],"review-date":["24 May 2002","8 October 2005","9 January 2008","27 February 2004","5 July 2008","23 February 2002","28 April 2002","9 October 2004","23 August 2004","7 August 2006","22 June 2001","6 November 2009","21 March 2006","10 October 2004","21 April 2013","16 June 2010","2 June 2010","26 August 2014"],"review-rating":["9","8","7","10","10","9","5","10","4","8","5","9","7","7","7","1"],"review-title":[" A fast, funny and surprising satire of American enterprise.\n"," Great slapstick at freeway speeds with original lines and honky tonk action, if seemingly a bit disjointed at times.\n"," Almost forgotten, this huge flop deserves a look.\n"," Box office KA-BOOM\n"," A great little time capsule of 1981\n"," Puzzling lack of support\n"," One of the best humorous character studies\n"," Good Laugh\n"," A satirical look at the automobile culture\n"," A wonderful film ahead of its time ?\n"," Sprawling and tiresome.\n"," Funny movie that still wears well with time.\n"," You might see my car in it . . .\n"," Talented Cast is mostly wasted\n"," Deserves another look.\n"," Good little, fun film\n"," Harmless fun ....... and flat out funny ..............\n"," Head scratcher\n"]}