{"primary":["Touch of Death (TV Movie 1991)","https://m.media-amazon.com/images/M/MV5BMGZiMWE4YzEtZThhZS00OWNlLTk1YjMtMmY1YmVmNmRhNzkzXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_UY1200_CR110,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0095941/reviews","tt0095941"],"secondary":["For an 80 minute TV flick from Italy you could do a lot worse I'm sure. It's got a made for TV look. I'm guessing it was videotaped rather than filmed since it was made for TV. That is the main downfall in what is otherwise a pretty decent horror flick.We have some top notch splatter here. Very disgusting and vile. Nothing pleasant whatsoever. But it never really takes itself seriously since it's a black comedy. Portions of the score are good and then portions are atrocious making this TV cheapie seem even cheaper.Fulci does what he can with the budget and provides some interesting camera work and makes us laugh at some nasty stuff (interesting since Fulci didn't do too many straight up black comedies). As with many Fulci films, the ending leaves one with a feeling of 'WTF?' Which is exactly what we should expect from this king of horror.Not a great film by any means but if you're a Fulci fan, pick it up.","\"Touch of Death\" is the story of Lester Pearson, a down on his luck gambler whom starts seducing wealthy women with various deformities, then killing them off for a prie fixe lunch of human flesh and cash for his horse racing betting debts.Fulci has an oft tenuous grasp on his plots, but this has to be the most ridiculously over the top entry in the canon. Though the gore is the usual splatter spectacle (the best of which effects wise is probably the scene where the blackmailing vagrant is run over with Lester's car), it's housed in too goofy of a context to be scary.After several of the least politically correct murder scenes in film (a bearded lady meets death in a microwave, an inexplicably opera singing widow who solos in her sleep is interrupted by being strangled)and some darkly comic body disposal (complete with silly cartoonish theme music), Lester realizes he has a larger problem than lady killing. An imitator is leaving incriminating evidence at the scene of his crimes that points to Lester. Before long, his picture, modus operandi and DNA genetic code (?!) are being broadcast on the nightly news. Will his latest target (\"Cannibal Ferox\"'s Zora Kerova) find out before it's too late? The final twist makes no logical sense and shoestring budget shows, but \"Touch Of Death\" is a mindless guilty pleasure of Fulci poking fun at himself that will entertain his devoted fans.","Lucio Fulci is the kind of director who, years down the road, will achieve the stardom he deserves. As of now, he is pretty much infamous. His later works, especially post 1990, are really pretty bad. In truth, they are no worse than many early 90's American horror films, but the dubbing is so bad that it's hard to take Fulci's later work seriously at all, really. When possible, any 1990's Italian horror movie should be viewed in Italian with English subtitles. They are MUCH better that way.\"Touch of Death\" is so funny in parts that I almost peed myself the first time I saw it. The woman's head in the oven, the car mauling, the baseball bat scene...the list goes on from there, trust me. It's got pretty decent gore, too. I'm sure Fulci focused a lot more effort on that than he did on the plot, which is not meant to be taken too seriously. \"Touch of Death\" is just a fun movie. It's not going to scare you, it might gross you out in some parts though! Watch it with all this in mind, and you'll enjoy it for what it is.7 out of 10, kids.","I saw this in Japan. My first fully laden gory Fulci, although I had seen a heavily censored version of Zombi a few years earlier. Nonsensical storyline, misogynistic \"humour\", and poor gore FX. However, the level of sadism in this film is its redeeming factor, if you like that sort of thing.\nA killer who sleeps with and then kills women (presumably for their money) is being shadowed by someone who is either copying his murders or placing clues as to his identity at the scenes of his crimes. The movie has a poor narrative so we are never quite sure what the position is.\nWell, that's enough of that. You don't get a Fulci film to watch plot but gore, so here goes.....The first scene consists of our hero chopping up a dead body with a chainsaw, but the body is quite obviously a mannequin loaded with red paint. He is then seen cooking a nice steak (de human) and feeds some to his cat. Other notable gore scenes include a head being microwaved (Fulci was obviously not a physics major nor one who had ever used a microwave before) which again is quite obviously a mannequin and a homeless witness to a murder being run over and over again by a car. This scene is actually quite well done. My favourite scene has to be one where the hero kicks a cat across the room. I put the video in slow motion time and time again looking for strings or any sign of mercy to the poor cat but cannot find any. My conclusion is that the cat was actually kicked across the room to film this scene. No Italian Humane Association involvement here then. To wrap things up is a thoroughly stupid conclusion and explanation for the movie's events.Notwithstanding that, I think that this film is actually worth seeking out. Not only is it very rare, but it has a high level of violence and doesn't get boring. It is also quite short. Notwithstanding complaints about plot (it has to be said that the story here is one of the worst in Fulci's canon), it is something which you can quite healthily pass an hour or so vegging in front of.","This is just dreadful. I regret every second of the 80 minutes I spent watching this dreck. I think it's supposed to be a comedy, but I don't remember laughing much, except at a few blatant inconsistencies and downright glaring errors.An unattractive middle-aged man called Lester meets up with rich unattractive middle-aged women via lonely hearts ads, and then murders them for the money he needs to feed his gambling addiction. That's the whole plot, and that's really all that happens. Along the way there is an attempt at intrigue when Lester starts to get phone calls from a mysterious stranger who taunts him about knowing his secret, but its so badly implemented, you may not realise what is actually supposed to be happening. The sequences in which Lester murders the rich widows are all quite brutal but also seemingly dressed up as comedies. One sequence has a woman bludgeoned with a wooden pole and then shoved into an oven. It's very cruelly depicted, but it is played out against blaring big-band waltz music, with Lester pulling faces and adopting comedy poses throughout. Another scene has the victim murdered while she constantly sings shrill opera songs...you have to see this to believe it! Actually - you don't have to see it at all, in fact I strongly recommend you avoid this flop. Fulci does not seem to know which hat he is wearing and there's no evidence of any of the flair seen in his earlier career. One sequence stood out to me as particularly wretched: the revelation when Lester suddenly realises that he has no shadow. Fulci seems unable to think up any visual representation of this phenomena on screen, so from this point on he just films the actor as normal, shadow and all!! And thus totally blows the whole angle. Either he had zero budget for effects, or he just didn't care enough to think up any way of showing it. Whatever it was, that should give you a taste of how lame this whole project is. I couldn't even understand most of the film, and there certainly wasn't anything on screen worth looking at half the time. Even the ending was as flat as a pancake. A real dud.","Hailing from 1988, Touch Of Death is probably the most frustrating Fulci film I've seen to date, prompting me to join the chorus of horror fans who generalise that his films get worse as you get later into his career. Considering the plot synopsis, I was expecting some bloody bad-natured fun with this one, but for all its bizarre flourishes, it feels tedious even at a running time of just 80 minutes, and suffers from nauseatingly shabby production values and film-making craft (or lack thereof).El Story: A gambling addict widower wines and dines rich (and strange) women he finds via lonely hearts columns before offing them in gruesome fashion - sometimes eating them or feeding them to animals - and stealing their money to keep his debtors at bay. Sure, it's unlikely that just one man would be the host for so much screwed-up pathology all at once (addict, psycho/sociopath, cannibal), but this is Fulci!Touch is actually the cheapest and sparsest looking Fulci film I've seen. There's almost nobody in it, even in the background of shots out on the street, for instance. A newsreader who keeps appearing on the film's televisions to warn the non-existent cast about the maniac's latest doings operates out of the most pathetic TV studio on the planet. He never even gets to look at the camera because has to read all the headlines off misaligned sheets of paper.Some scenes just go on and on with the protagonist muttering to himself about what he's done or what he's about to do, but the acting is nowhere near good enough to sustain this kind of thing, so the main outcome is viewer boredom. The film also looks bland and ugly in general. I've read that it was intended to be an Italian telemovie (did it ever screen in that venue? With the amount of gore involved, it seems unlikely), and it does reek of crappy old telemovie production values.This is also Fulci's first foray into outright black humour, but he's just too graceless a director to make it work. Sometimes conspicuously cheerful or 'wacky' music is used to play against a gruesome scene, for instance while the hero/villain is carving up a dead body in his basement. The effect isn't really chilling or funny or ironic anything that you'd like it to be - it's mostly just hamfisted and crappy.There are of course some redeeming moments of gore (that you'll be waiting for while trying to stay awake), including the eventual murder by oven(!) of a woman who just won't quit life, even after her face has been totally bashed apart with a bloody great club, and a homeless guy who gets a car run back and forth over him about five times. The most outrageous element of Touch, however, is all the physical deformation on the widows courted by the crazy guy. Beards, hairy moles, messy harelips - it's not like he sought out women with these features, it's just the way all lonely hearts widows are, apparently. There are plenty of shots of Mr Crazy secretly grimacing while he's smooching up these women. The black humour of such garish misogyny might have some staying power or resonance if the film wasn't so poorly executed in general. In the end, Touch Of Death just seems like a really lazy, inarticulate mess.","Wow, this one really swiped me off my feet. When seeing a Fulci movie, you really don't expect much of an intentional comedy, but this time it's exactly what you get. At least in the macabre, grotesque way. With a healthy dose of gore and disturbing images.Lester Parson is a cannibalistic psychopath and a degenerate gambler who kills ugly, rich women and steals their cash and personal property to fund his lifestyle. And he has meaningful conversations with a mysterious person he knows (or perhaps with his own voice?) through a tape recorder. Pretty soon Lester finds out that there's also the other killer around, who imitates his killings and leaves out evidence that all points to Lester.This film is like a low-budget version of American Psycho. (And even with it's problems way better than the said drivel of Hollywoodism that so poorly tries to turn Bret Easton Ellis' text into film.) Lester's \"adventures\" are projected in a grotesque and hilarious light, and Fulci has succeeded in creating a very twisted humorous mood, which abruptly changes into horrific carnage. I found myself several times laughing my buttocks off, and within seconds I'm cringing and staring in shocked disbelief at the brutality of violence. That's a pretty hard stunt to do for a film maker, also considering that I've pretty much seen everything there is. :) I must say that Fulci has always had some extraordinary nihilistic vigor in the depiction of violence.Too bad that the film doesn't follow this line to the end, and the last 30 minutes is plunged into senseless drivel with some obscure doppelganger plot. Maestro Fulci fell into this kind of goofing so regrettably often, I must say. Also, the obviously small or almost non-existent budget unfortunately shows on this one, and the photography is depressingly ugly to watch. Still, I have to say that Fulci's experience shows in doing the best that can be done with the limitations.Despite being flawed, ridiculous (in a bad way) at times, and ugly looking, my thumbs are way more up than down on this one. Still, it leaves me asking, what this movie could have been with better production and more thought out ending. Well, I guess we'll never know. Definitely recommended for the friends of grotesque comedy, despite the poor ending.This is my truth. What is yours?","I got hooked on Fulci thanks to Zombi 2, New York Ripper and The Beyond, after which I started collecting Fulci DVDs. Although I'm still in progress, this movie convinced me that Fulci lost most of his \"touch of death\" after 1982.Touch of Death was originally conceived for Italian TV, and if you consider that, it's a pretty gory movie. If you just watch it as a normal movie it is quite boring. Although it contains some good gore - that's why you watch Fulci, right? - it is a long way from The Beyond and not nearly as scary.This movie was released on DVD by EC Entertainment in Europe. It seems to be taken from a very bad copy. Nonetheless, we should be grateful that EC took the time and effort to release it, because it will probably sell badly.","Lucio Fulci was famous for his Italian splatter movies, mostly his undead films like Zombie or The Beyond. Here he directed a black comedy of sorts, but there's just one problem: its nauseating. I say this knowing that I like City of the Walking Dead (which is also gross but not like this). A compulsive gambler gets money for his habit by romancing ugly and deformed rich women then murdering them and stealing their cash. The film makes this plan look that easy. I guess the women were too ugly to go to a bank, so they always had their cash on person. After the upteenth murder I began to suspect what I've always heard about Fulci: he hated women. He must have. At any rate this film stinks, its not funny, and Fulci should have stayed with giallo and supernatural zombie movies. Avoid this film at all costs.","Lucio Fulci, a director not exactly renowned for his subtlety, ill-advisedly tries his hand at black humour in Touch of Death, a made for TV movie about Lester Parsons (Brett Halsey), a psycho who seduces and murders rich widows in order to pay his gambling debts.Starting off with a wonderfully gory scene in which the lethal lothario disposes of his latest victim via chainsaw, mincing machine and hungry hogs, Touch of Death starts promisingly enough, but Fulci soon loses control of proceedings, introducing a weird sub-plot involving a mysterious copycat killer and some heavy handed 'comedic' scenes. There are several more graphic murders which, in true Fulci fashion, are extremely violent and gruesome, but even the high level of bloodletting doesn't stop this from being one of Fulci's poorer efforts.As I have found with many of his other movies, a comprehensible storyline is not exactly high on the agenda when Lucio is behind the camera. This film has many peculiarities which left me more than little perplexed: why didn't Lester dispose all of his victims using the dismemberment method seen at the beginning? Why are all of his victims either hairy or disfigured? What the hell is that ending all about?Fulci is considered by many to be one of the 'greats' of horror cinema; I don't understand his popularity, finding the majority of the films of his that I have seen so far to be generally lacking both decent narratives and technical proficiency. Touch of Death certainly does nothing to change my opinion.","Lucio Fulci is one of the leading names in gore-soaked horror cinema, and Touch of Death certainly does that reputation proud! Fulci's films started to get worse as his career progressed (with the exception of the hilarious Cat in the Brain in 1990), and as this film was released in 1988; you can count on it not being as good as his previous output. In fact, with films like Don't Torture a Duckling and The Beyond in mind; Touch of Death is one of Fulci's weaker efforts, but even so - there's plenty here to delight the man's fans. The film is clearly meant to be something of comedy, but the comedy is more of the absurd, over the top variety than one that will have you in stitches. Fulci's use of music helps to instill the absurdity of the film, which sees lonely widower/gigolo Lester Parson taking women home and putting them to use. He likes to mutilate them in horrible ways, such as beating them with a stick and chopping them up with a chainsaw; and just to add to the proceedings, he eats them too. Fulci also installs a subplot about the investigation into the murders, and the murderer's descent into madness.This film is something a prelude to Cat in the Brain, and it's obvious that Fulci had Touch of Death in mind when he made his self-starring vehicle, as many of the gore scenes from that film are taken from this one. The scenes of gore are really quite nasty, but their impact is lessened by the comic tone. The first scene of gore sees our 'hero' going to work with a chainsaw (surely horror cinema's finest weapon), and then putting the remains of his victim into a meat grinder. Then we are treated to a beating scene (which features some of Fulci's trademark eye violence), a nasty sequence involving a car, a corpse having it's feet cut off and several other scenes along the same line. The film is really dirty; with the poor cinematography adding brilliantly to the overall unclean feel of the movie. The acting is typically low level, but the actors portray their (mostly silly) characters with gusto, and the result is a film that people will like more it's fun value than its credibility. Being a Fulci fan, I am more susceptible to this sort of trash; and I cant really say that non-Fulci fans will get much of a kick out of it.","Caution: Spoilers!With \"When Alice broke the mirror\", Fulci tried to deliver a black comedy for Italian TV. The result is an extremely mean-spirited and - in the first half - gory movie, even for a Fulci product.The story itself about a serial killer copied and betrayed by his own shadow is not without potential, but what Fulci makes out of it is a rather over-cynical and disgusting film - and it starts right away: The movie opens with Brett Halsey as Lester Parsons eating a steak which he has cut out of his latest victim while watching a video recording of her. A few moments later, he descends to his cellar and dismembers the corpse with a chainsaw. Not enough yet, he passes the remainders through a meat grinder and feeds them to the pigs. Sick, isn't it?Lester Parsons is probably the most unappealing character Fulci has ever created. He is addicted to gambling and horse betting and, in order to finance his costly hobby, he slaughters women.In the first half, Fulci inserts a lot of extreme gore. The effects vary from bad to acceptable.Fulci devised the movie as a black comedy, probably a) to make up for the cheap special effects and b) to disarm it a little bit (recall that it was intended for TV).The result remains problematic because Parsons' victims are mostly women with physical defects and Parsons explicitly mocks about them. Such a premise is simply repulsive and makes the whole movie extremely ugly. Fulci doesn't possess the necessary black humor to treat such material with taste.Most surprisingly, this gory movie was shot for TV - and shown, though only \"late at night\" as Fulci once declared. These Italians!","A moody, middle-aged gigolo (Brett Halsey) kills off women after he gets bored with dating them and uses their body parts for trophies and for consumption.Though many fans are divided, generally \"Touch of Death\" is regarded as a better latter era Fulci film. The overdone black humor touches, \"unconvincing\" gore effects and baffling ending does turn off some fans. While it is true that some of the film is hard to follow because we are unsure how much is madness and how much is reality, this really is a solid effort from Fulci. And for me, the gore may be unconvincing but still unsettling.Where does this fit in his overall canon? Not top three, probably not top five, but I would still have to say it is firmly on the top half of Fulci's works. Certainly superior to \"Cat in the Brain\", which has gotten much more exposure over the years.","This latter-day Fulci schlocker is a totally abysmal concoction dealing with an incurable gambler (Brett Halsey) who decides Bluebeard-style to pay off his ever-rising debts by seducing some of the ugliest bitches you will ever lay your eyes on and who just happen to be wealthy widows! The Fulci-penned script also contrives to incorporate a few blackly comedic elements - which only result in some unfunny business involving a corpse which won't stay put, an opera singer victim who won't stop singing, etc. - not to mention a doppelganger theme straight out of THE STUDENT OF PRAGUE - although, in this case, the two personas communicate via pre-recorded radio messages!! In the end, I can't say I'm surprised that this film shows no sign of the sophistication of Mario Bava's HATCHET FOR THE HONEYMOON (1970) which it resembles in several ways and that it is content to merely pile up the disgustingly gory (but none-too-convincing) effects of dismembered limbs and squashed or melting faces with which, alas, Fulci had by then become completely associated.","There are certain horror directors for whom I've built up so much respect & admiration over the years, that they can't possibly disappoint me know matter what garbage to decide to put on film. Lucio Fulci is surely one of them, but damned, he's trying to disappoint me with his later efforts! You can easily afford yourself to skip most of the films Fulci directed or produced during the late 80's and simply watch \"Cat in the Brain\" instead, because that one title gathers and repeats the best and absolute goriest footage of no less than SEVEN other Fulci-flicks, including the sickest murders sequences featuring in \"When Alice Broke the Mirror\". As a whole, this movie definitely ranks among our director's weakest and most pointless achievements. The script is incoherent as hell, the basic premise is totally implausible and somewhat stupid and there's absolutely no suspense to enjoy. I love the title, but it's actually quite meaningless. There is a character named Alice in the story, but it's only a supportive role and she certainly doesn't break any mirrors. I suppose she could break stuff simply using her voice, as she's an opera singer, but she doesn't. The plot revolves on a middle-aged and gambling-addicted playboy who spends his days seducing wealthy widows and killing them for their money. Lester Parson butchers the ladies (as well as unwelcome witnesses) in gruesome ways, makes steaks out of their juiciest body parts and feeds the remainders to his cat. There's also a silly psychological sub plot in which he thinks his own shadow is responsible for the murders instead of him. The difference between \"When Alice Broke the Mirror\" and some of Fulci's greatest horror films (\"The Beyond\", \"City of the Living Dead\", \") lies in the fact that he totally doesn't bother to create a horrific atmosphere. The characters, Lester included, are colorless and boring and the murders are ordinarily depicted; like it's the most common thing in the world to put a woman's head in a microwave or repeatedly run back and forth over a human body with a car. The lighting is poor, the cinematography super-ugly, the editing clumsy and amateurish and the acting performances are downright miserable. If I didn't know any better, I would think Lucio deliberately made a lousy film in order to protest against all the harsh critics that dislike his repertoire no matter how much spirit and effort he put into it. The obvious element to enjoy here is simply the outrageous gore & bloodshed, because even the attempt to blend in black comedy doesn't work properly. As long as Lester swings around his chainsaw and cuts off women's feet, \"When Alice Broke the Mirror\" is an undemanding piece of horror entertainment, but other than that, there's isn't a whole lot to recommend.","I was actually very pleasantly surprised. I didn't go into this expecting much as i've never been a huge Fulci fan, but I do enjoy him, and as far as Fulci this probably had tighter editing and a more straightforward storyline than anything else I've seen by him. The 'twist' was obvious the entire time but it didn't make the film any less enjoyable and there were no plot holes- maybe a first for him?\nThis film was less surreal than most and mainly focused on dark comedy and a simple crime tale, not much in the way of sets or cinematography, but it did what it set out to do, and with less stumbling than I've come to expect from the 'godfather of gore'. \nAll in all a worthy watch if you can get your hands on the BluRay edition.","If Touch of Death was simply the poster filmed for 70 minutes, it'd be such a better movie than what I just watched.Lester (Brett Halsey, Demonia) is a cannibal serial killer who meets, dates and eats various women, sometimes giving parts of them to his pigs. He also talks to a tape recording of his own voice and has plenty of gambling debts that Randy (Al Cliver, Zombi 2, The Beyond) is ready to collect.There's a long scene that involved Maggie, a woman he marries. She's an oversexed, overweight, overmustached woman that is such a caricature, it reduces the film to pure comedy. He tries to kill her several times with poison, which she thinks is just a love game. Then, Lester bashes her brains in — literally — with a stick, leading to her eyeball popping out and rolling down the hallway. If you thought New York Ripper was too restrained, Fulci is ready for you. Because she isn't dead, which means Lester has to repeatedly punch her and then cook her head in the microwave, where we watch the flesh melt off her face. Then, in a moment of absurdity, her body can't fit into his trunk, so he has to saw her legs off.I don't want to see Fulci be a second-rate Herschell Gordon Lewis.Lester is caught by a homeless man (who has the mark of Eibon on his forehead), who he runs over and leaves for dead. He doesn't have any follow-through, because the man shares his description, which means he has to shave and get contacts.His next wife is a woman who likes to sing opera during sex, who he strangles to death with some stockings. Even after getting pulled over by a cop — with the body in the front seat — Lester gets away. He tries to sell her jewelry, but it's all fake. And now, the cops know what he looks like — again — so he dyes his hair and puts on glasses.Depressed at home — and with even more gambling debts — Lester gets a phone call from Virgina (Zora Ulla Kesler, Anthropophagus, The New York Ripper), who is like all of his victims, except much younger. She's DTF for Lester, but he is grossed out by her facial scar and decides to kill her and steal everything she has.Meeting her for dinner, she pulls a gun before he can kill her. She recognized him from he news and Lester barely makes it out of her apartment. As he has a conversation with his other self, now a shadow on the wall, he merges with this second voice. Then, he dies.Also known as When Alice Broke the Looking Glass, this film is everything Fulci detractors accuse him of being — misogynist, leering, obsessed with gore and slapdash. It was an effort to even finish it — as I love his movies. Up until now, even with Ripper, it felt as if there was a balance of art and bloody organs being severed and smashed. Touch of Death's 81 minutes of screen time feels like 81 hours.Postscript: I did not care for the scene where the killer kicks a cat, at all. Yes, I was not upset by a woman's head smashed with a stick and more peeved at an orange cat being booted.","Running over the tramp was great. The character speaking to someone/or to self by way of tape recorder was interesting. Cinematography was great. Decent acting. Good music. The story was OK, not great. Better if they left out the comedy. The ending sucked. Very watchable.Running over the tramp was great. The character speaking to someone/or to self by way of tape recorder was interesting. Cinematography was great. Decent acting. Good music. The story was OK, not great. Better if they left out the comedy. The ending sucked. Very watchable.","Dutch are Deaf is Fulci's attempt at combining black comedy, slapstick and extreme gore into a bundle of low budget headscratching late eighties nonsense that raises loads of questions but doesn't bother answering any, just like Fulci's Sweet House of Horrors and basically any other film he made after 1987.This time, Brett Halsey of naked harpoon wielding ghost nun film Demonia and Demons 6 plays Lester Parson, whom we first see cooking himself a nice steak and watching a video of a less-aesthetically pleasing woman prancing around. Turns out the steak was once part of this woman's thigh and we get to see Lester graphically chainsaw the rest of her corpse and feed it to his cat and pigs. All this is done rather humorously, if you're Lucio Fulci.Lester's constantly in debt to gangster type/book keeper Al Cliver (from Demonia, Zombie Flesh Eaters, New Gladiators, The Beyond and House of Clocks – basically, he's Fulci's go to guy for supporting actors), and in order to get cash, he constantly tracks down, seduces and murders rich widows, all of whom are disfigured for reasons that are beyond my six or seven functioning brain cells. Maybe Lucio's trying to say something there, but who knows? To make things worse for Lester, he's now apparently got a copycat killer on his tail, who keeps killing people and leaving evidence at the scene, including his genetic code. \"That's my DNA!\" He shouts at one point. Do you know your genetic code? Things get dafter and dafter as this film goes on, and less gory too, until you're hit with Lester's wooing of Zora Kerova (of Anthropophagus and Cannibal bloody Ferox) and Lester trying to track down the other killer. Looking for a logical conclusion? Then, tough sh*t.I forgot to mention that Lester often talks to himself via a tape recorder.At least the film does have some sort of ending though, unlike other Fulci films of this era. It moves fairly quickly and is mercifully short, but if you've seen Cat in the Brain, you've seen all the gory bits. All you're missing is the Al Cliver footage and the wooing of Zora. Plus, the ending makes no sense and yet again I get the feeling that Fulci might be trying to subtly say something about something or other, but it's lost under the low budget, his vision, and my brain damage. It was worth a watch.Speaking of Brain Damage, I've decided to review as many of these late era Italian horrors. I've done a few already, but I've still to review: The Church, Red Monks, Ghosthouse, House of Clocks, Sweet House of Horrors, Demonia, Cat in the Brain, Nightmare Beach, Stagefright, Aenigma, House of Witchcraft, House of Lost Souls, Creatures from the Abyss, Troll 2, Graveyard Disturbance, and Demons 3: The Ogre. I've already reviewed Zombie 3, After Death, Maya, Dial Help, Demons 5, Demons 6, Witchouse, Spectres, Spider Labyrinth, Shocking Dark, Body Count and Cut and Run. Am I having a mid life crisis?","This films shows all the characteristics that have made Fulci a clearly-recognizable filmmaker: no logic, no plot, very bad actors on one hand ; but on the other, lots of fun and an incredible sense for splatter which has turned him into a world-wide acclaimed king of the genre. This film in particular offers gruesome and spectacular representations of deaths and murders , very well expressed by incredibly-low-budget but proper special effects : Fulci here is disgusting probably as never before, but if you like the kind it's an experience to be made...","Quando Alice ruppe lo specchio is not Fulci s best. Its far from his \"golden era\" but its still a good movie, at least a funny and with some good gore elements. Lester is a psycho playboy who needs to seduce and kill rich women to steal their money and keeps his status quo. Also, he is a lost gambler, and he always lose money...so, ugly rich women is his salvation...always. Some good gore (mostly at the beginning of the movie), good funny moments (the mustached lady part is amazing), also some reminiscences to \"American Psycho\". Its a horror thriller with gore and black comedy. Off course, if you compare this to other Fulci movies (L Aldilla, Paura, etc) this will looks tame and crappy. But, you don't need to compare, and its a good Fulci movie. 7/10","\"The name is Parson, Lester Parson. That's right, almost like a person. But not quite.\"Such a strange little, gory Fulci movie. Lester Parson is a sadistic serial killer with a gambling problem. He also talks to his shadow by pressing play on a tape recorder. His shadow talks back with advice and words of wisdom. Yes, this is a freak of a movie which is why I like it so much. Of Fulci's later movies, Touch of Death is definitely one of his best. It has some decent gore and is short and sweet(82min). Most of the clips from Fulci's Cat in the Brain film were taken from Touch of Death.This movie is only for Fulci fans. It might be considered crap by normal folk.","Touch of Death (1988) ** (out of 4) Lester Parson (Brett Halsey) is about as evil as you can get. He spends his time looking for rich old women to fall into bed with and then takes pleasure when it comes time to brutally murder them.This later day Lucio Fulci picture is certainly a mixed bag. On one hand it's a low-budget version of Bluebeard but the budget is just so low that it gives the film an incredibly cheap and unprofessional look. The other side, and the positive one, this does contain some outrageous gore scenes and graphic violence that you can only find in a Fulci film. In fact, the majority of these gore scenes were later used in the director's A CAT IN THE BRAIN.There are some rather surprisingly good elements that can be found here including the black humor that the director brings to the picture. There are some really funny moments including one of the women who is a tad bit hairy and Halsey has to deal with her role hair getting into his mouth. Another funny bit deals with a woman whose legs keep popping out of the trunk that he's trying to stuff her in.The main reason to watch this movie is for the gore. The special effects aren't nearly as good as what we saw in earlier Fulci movies but there's no doubt that the majority of the budget went to them. We've got some pretty brutal stuff here including one woman who gets her head bashed in with a large stick. This here is one of the goriest and most violent moments from any of the director's films. There's also a chainsaw scene, which is just pure Fulci in the campiest way.TOUCH OF DEATH has some major problems as well. The story is pretty much non-existent because it's just a bunch of small scenes. We see him meeting a woman. We then see him killing the woman. There's really not too much that happens here so we're basically just sitting through a bunch of boring stuff waiting for the next death to happen. Halsey offers up a fine performance and you can also spot Al Cliver (ZOMBIE).","I am 25 years old so this movie was released when I was two years old. I'm upset that it took me this many years to find it! Touch of Death runs about 1:20 which is a few minutes short of a \"complete\" film experience in my opinion but Touch of Death plays more like a strange dark horror-comedy of its own variety.Extremely creative gore and special effects implemented throughout much of the film. At least one scene is guaranteed to make you cringe and then just when you think things can't get anymore extreme Lucio kicks things up a notch and takes it about 10 steps farther! Very awesome use of blunt weaponary against a victim.","So I decided to rewatch Lucio Fulci's \"Touch of Death\" aka \"When Alice Broke the Mirror\".Unfortunately this gore/black comedy is one of his weakest films.\"The New York Ripper\" was the last solid flick of the Godftaher of Gore.Anyway,Brett Halsey plays a maniac who kills rich women for their money,butchers their bodies with a chainsaw and fed their remains to his pigs.Sounds great,but the action drags and the characters are idiotic.There is also plenty of silly comedy that seems out of place.Fans of Italian cult cinema should recognize Zora Kerova and Al Cliver in small roles.There are only four brutal gore scenes in \"Touch of Death\" including chainsaw dismemberment,running over with a car and finally there is a pretty nasty sequence,which has a woman bludgeoned with a wooden pole and then shoved into an oven.6 out of 10 and that's being kind.","pumpkinhead_lance","missmonochrome","coldwaterpdh","Esteban27","adriangr","Bloomer","The_True_Meller","tim_age","phibes012000","BA_Harrison","The_Void","AS-69","gavin6942","Bunuel1976","Coventry","nick121235","doe-33491","Bababooe","Bezenby","flavio_c","ultra_tippergore","dweeks-1","Michael_Elliott","bradleybean86","HumanoidOfFlesh","5 November 2005","31 December 2005","26 December 2007","6 November 2002","20 June 2009","4 June 2006","5 October 2007","26 May 2002","10 July 2005","14 January 2007","26 January 2006","6 August 2001","31 October 2017","2 December 2006","2 May 2007","22 March 2018","7 December 2017","20 February 2017","6 August 2014","3 July 1999","23 December 2006","5 February 2005","9 July 2016","21 January 2012","2 September 2010","7","2","4","6","7","2","4","6","5","6","1","4","6","2","6","6","7","8","10","6"," Not a bad Fulci flick... **1/2 out of 5\n"," Lifestyles Of The Rich And Disfigured\n"," Absolutely hilarious.\n"," Plot? What's that? Ah who cares, a guilty pleasure\n"," Really bad\n"," This ain't good Fulci.\n"," Small Fulci gem, if quite flawed\n"," Not the Fulci I hoped for\n"," Fulci Makes A Splatter-Comedy\n"," Another ropey effort from Italian 'godfather of gore', Lucio Fulci.\n"," Absurd sick comedy\n"," Disgusting TV(!) movie\n"," Brett Halsey is Nasty!\n"," TOUCH OF DEATH (Lucio Fulci, 1988) BOMB\n"," Who's Alice? What Mirror? Who or what is broken?\n"," Pleasantly surprised\n"," So this is the Fulci no one likes\n"," Decent, sick film. Acting and music are good. Story is OK. Better if they left out the comedy. Ending sucked\n"," Touch of Deff\n"," You wanted the gore,you got the gore!!!\n"," Not the best Fulci but...\n"," Short and sweet Fulci gore flick.\n"," No Story and Rather Cheap but Insane Gore\n"," Blunt Weaponary vs Unattractive Women = YES!\n"," Mediocre Fulci's gore/black comedy.\n"]}