{"review-url":["http://www.imdb.com/title/tt0077245/reviews"],"review-text":["The other reviews here give a pretty accurate view of the story and how it plays out so won't rehash any of it here. In presenting a review I would only add the filmmakers appeared to have a distinct vision of the film they wanted to make. Once a hardcore horror film viewer I've sat thru a lot of low budget dreck, so while some horror fans may describe Blood Stalkers as a bad and poorly made film, I would strongly disagree. Certainly not on par with say Sam Raimi's early work (The Evil Dead trilogy), it is an entertaining and sometimes scary film. The actors are not the buff and pretty people found in today's slasher films and Chainsaw remakes, but instead ordinary looking middle aged folk. And within the context of a low budget horror story they give rather good performances. The film has a terrificly crude visual style, and makes nice use of it's locations. Not as polished as much of today's low budget fare but worth seeing if you can find it.","BLOOD STALKERS is a small dramatic movie with horror overtones. The body count is high and there's some on-screen violence and gore but the script is more concern with Mike (Jerry Albert)'s fragile psychological well being than scaring or grossing out the viewer. The film ain't bad but it's not stellar too. For instance, the three hicks, who keep fighting with each other, and the old man who runs the gas station, look more like cartoon characters than real people living in the backwoods. As for the good guys, Ken Miller is a strange actor, if you know what I mean. Jerry Albert is also an odd looking fellow. One rarely sees his average type of face in today's films, which, when you think about it, is unfortunate. The two women are buxom and don't make fools of themselves (a rarity in these types of films). The actors are okay in their roles but their characters are pretty limited. The cinematography is at times pretty good. The worst thing in BLOOD STALKERS is the music. The soundtrack actually nullifies all attempts at suspense or empathy towards the characters with its terrible TV-like generic music. Had the music been better and the gruesome foursome had been a bit more believable, BLOOD STALKERS would have been fairly good. As it is now, BLOOD STALKER is okay, nothing more.","I rented this film about a year ago at a 'mom n pop' video store, thinking it would be trash, but perhaps entertaining trash. I made fun of the movie for the first thirty or forty minutes before I finally shut up and began to enjoy it. I'm not going to exaggerate and say this is a classic or anything, but it is a surprisingly good film with a few twists and some acceptable performances. It also has what, for my money, has got to be the greatest \"scared sh*tless\" performance in a single scene of any horror film I've ever seen; just keep your eyes on Jerry Albert (Mike) when he goes back to the car to get the beer. Albert may not be that great of an actor, but in this scene he delivers and then some! Albert redoes his \"scared sh*tless\" moment with Toni Crabtree later in the film. All in all, a great \"C\" movie that's hard to find, but worth it if you do.","You would think with a name like \"Blood Stalkers\" your defiantly getting a gem here, i mean just look at that awesome movie poster. Sadly, this thing is a hour and a half of nothing but boring plodding crap. Two couples go to a isolated cabin were they screw around and get terrorized by a group of caricature hillbillies (sometimes dressed like Bigfoot). Our villains look like they were pulled from \"Redneck Zombies\", the first kill isn't until the 51 minute mark and its a dog!!, and finally when stuff starts to go down towards the end its at freaking night when nothing can be seen, and its all intertwined with footage of an all black church choir singing. So by this point if something actually did happen I either couldn't make it out or was to bored to give a crap. The final 15 minutes does give us a nice little bloody battle between our last surviving hero and the hillbillies which warrants this two stars, but, by then you've probably either turned this off or have stopped caring all together.","Two couples -- rugged, traumatized Vietnam war veteran Mike (an excellent performance by Jerry Albert), his sweet wife Kim (nicely played by the lovely Toni Crabtree), jolly goofball Daniel (a solid and likable portrayal by Ken Miller), and Daniel's sassy spouse Jeri (a delightfully spunky Cisse Cameron) -- vacationing in a remote cabin in the Florida Everglades run afoul of vicious local redneck psycho poachers. Writer/director Robert W. Morgan relates the gripping story at a steady pace, develops a considerable amount of suspense (a sequence with Mike running through the woods trying to get back to his friends is an absolute tour-de-force of nerve-wracking tension that makes inspired use of strenuous slow motion and snappy crosscutting with a gospel tune acting as ironic counterpoint to the harrowing on-screen action), and really piles on the brutal graphic carnage with a rousing last reel slaughter spree. Moreover, Morgan smartly explores such provocative themes as heroism, cowardice, revenge, and man's indifference and inhumanity to his fellow man. The main characters are well-drawn and engaging. Herb Goldstein as a creepy old gas station proprietor, John R. Meyer as the coarse, mean Lester, David Faris Legge as the ornery Pip, and Morgan as the bald, knife-wielding Jarvis are all genuinely menacing as the nasty hillbilly villains. The lush sylvan location projects a profoundly unsettling sense of dread, isolation, and vulnerability. Irv Rudley's cinematography is rather plain, but overall effective. Stan Webb's shivery score further enhances the eerie atmosphere. Recommended to fans of regional low-budget fright fare.","I give it 8 out of 10 because it is a cult classic. Also it is directed by legendary sasquatch hunter Robert W Morgan who also plays the part of Jarvis in the film. In listening to recent blogtalkradio show called the AARF show(Robert Morgan is a co-host)he tells that because it has become such a cult classic and does well at movie conventions and such,there are plans to maybe do a sequel to this film. I think he said that two of the original stars have signed on and he hopes to have a few more. Robert is a good man and I hope it does well. He has devoted 50+ years of tireless work as a Sassquatch Researcher(which is also one of my interests)and author. Check out his show on the paranormal and maybe look for Blood Stalkers II sometime in the near future.","This is a pretty obscure, dumb horror movie set in the 1970s Everglades. It is really stupid and lame for the first half, then it actually starts to get good for the last half. There is a scene with the hero running to save his friends interspersed with shots of a church group singing, I don't know. It is mesmerizing. I was impressed with the night time scenes, because it actually looked like night, unlike most low budget horror films where it still looks like daytime. I feel like the director was really talented but was working with a miniscule budget and a tough schedule. There are a few scenes towards the end, the one mentioned above and also the end credits that are extremely cool. This movie could have been a genuine classic if it left its Scooby Doo conventions behind and went straight for the throat. I was surprised at how good this movie turned out to be. I couldn't take my eyes off of it, and I had to ask myself \"why?\"","Two married couples decide to spend their vacation at an old hunting cabin located deep in the Florida everglades.On their way to the cabin they meet an old gas station attendant who warns them to turn back because of Blood Stalker territory.They also meet a trio of hillbilly hunters,who leer at the women while they play with their guns and knives.They aren't too friendly to begin with.The upcoming night quickly turns into blood-chilling nightmare with Bigfoot-like creature on the loose...\"Blood Stalkers\" is a perfect example of low-budget regional film-making.It features few nasty gore bits((a gutted dog,a hand being severed,an axe to the stomach)during its pretty tense climax,unfortunately the action moves at a snail's pace.The soundtrack is truly annoying and pretty much destroys any mood.The director Robert W.Morgan has a small role as bald-headed hunter,who is always having fun with his knives.A generous 6 out of 10.","This film is about a couple that decides to take a vacation to The Everglades along with another couple and the family dog.  When they first get there, they are not welcomed by the neighboring gas attendant that warms them to stay away from the cabin in which they are to spend the night at for the week.  After pestering with the old man, three hillbillys also do not take kindly to their arrival as they approach their car and threaten them to leave.  After asking some of the local dummies that can't speak or just don't want to answer, they finaly find the cabin.  After they settle in, strange things happen to the visitors including discovering crap on their car, the man thats the head of this trip thats an idiot shoots the family dog thinking it was a killer clawing at the door and a series of deaths later on in the end.  Adding a church group did not make the story any better.  Then at the end, the idiot that survives the whole ordeal goes around the town carrying a shot gun.  Lame.  thats what this movie is."],"review-user":["actionfilm-2","Maciste_Brother","utgard14","b_kite","Woodyanders","MovieWiz66","reverendtom","HumanoidOfFlesh","lthseldy1"],"review-date":["11 April 2010","27 May 2003","18 August 2002","12 July 2018","13 July 2010","19 September 2008","3 November 2005","9 August 2009","20 August 2001"],"review-rating":["5","5","5","2","8","8","7","6","1"],"review-title":[" Sasquatch meets Deliverance\n"," More drama than horror\n"," A Lot Better Than It Has Any Right Being\n"," Don't let the cool name and poster art fool you like I did!\n"," Nifty backwoods horror shocker\n"," Director Robert Morgan...sequel in the works for 09!\n"," Really Bad Movie With Some Really Incredible Scenes\n"," Suitably dull piece of low-budget rural horror.\n"," This film is lame\n"]}