{"primary":["Almost Summer (1978)","https://m.media-amazon.com/images/M/MV5BY2RhZGUzZWUtZTAxMy00Zjg3LThkNGMtOThhY2VjYWRmNjI2XkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_UY1200_CR81,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0077152/reviews","tt0077152"],"secondary":["This movie is a little known film about a high school election. It's got some comedy, a little drama and a little romance, with Beach Boys-esque music (most of it was composed by Mike Love) It has Bruno Kirby, as Bobby DeVito, who will stop at nothing to see that Christine Alexander (Lee Purcell) doesn't win. They once dated, and now he wants to help an unknown candidate named Darryl Fitzgerald run against Christine. Meanwhile, Christine is having problems with her boyfriend and Darryl and Bobby's sister, Donna start to fall in love, too! Great hijinx and cool music make this one cool movie, which is worth seeking out, as it has never been released on video.","I caught this movie one weekend afternoon years ago when the clothes and hairstyles were still fashionable.  What intrigued me I have no idea, maybe it was the woman in the bikini caressing her body and the music was very Beach Boys. I had the unmistakeable impression I had seen Didi Conn and Bruno Kirby in something else, but no idea what it could have been, especially Kirby.  They were perfectly cast as brother and sister.  John Friedrich, as the new kid Darryl Fitzgerald, rounded out the group for me. Kirby sought to get back at Lee Purcell by pushing Friedrich to run against her as class president. With his slogan 'you don't know me, but. . .' and his weak, adolescent behaviour, Friedrich was very convincing for me as an insecure teen.  When he learns of underhanded dealings perpetrated by Kirby, he drops out of the race.  This was my intro to the teen vehicle of everything wrapping up in the end.  I always wondered why the film never became more recognizeable or launched more successful careers for the actors and actresses.","I've only seen this movie once. And I liked it. Yes, as someone commented, it is similar to \"She's All That\". Bruno Kirby was always an underated actor (i first remember him in an episode of room 222), and does a fine job here. Hey, it's not Shakespeare. It's a cute teen movie from the late 70's that kept my interest. If you're into these \"coming of age\" type movies, definitely try to catch this one. I don't know what I rate the movie, but I rate it better than the other people who commented.","i saw this teen comedy at a drive-in double feature along with 'thank god its Friday',which had some of the same cast. lee Purcell as a snotty b**ch type,is devilishly sexy,as she was still a hot little fox,in the Nancy Allen vein. Didi conn plays the ugly duckling type,who becomes a swan,ala 'shes all that',she shows surprisingly,an incredible set of bazookies in a tight red gown during the prom scene,who would of thought that frenchie was such a sexpot?. john Friedrich,Tim matheson and Bruno Kirby,round out the cast of guy characters and 'the beach boys' mike love adds music. this movie also had the lovely actress 'sunny Johnson',who sadly in the early 80's would pass away quite young,she would go on to appear in 'national lampoon's animal house','the night the lights went out in Georgia' and 'flashdance'. i thought this movie was pretty good at the time and it obviously had a reliable cast,this movie should definitely be repackaged in a double DVD set along with 'shes all that',as they both have a lot in common.","This is one of the most enjoyable teen movies I have ever seen (and that I wished was released to video). It was released the same year as another great comedy in which Tim Matheson played a role \"Animal House\" (Which is probably why it was overlooked). One of the most memorable parts of this film would definitely be the soundtrack, which could have and should have been a formal label release. The soundtrack features a lesser-known 70's act named High Inergy whose song \"We are the future\", played a marquee role in the movie's Prom scene. I remember purchasing the group's album \"Steppin' Out\" as a kid mainly because of the look of the girls and not necessarily for their musical talents. The closing song is one of the best ballads I have ever heard, and I can still hear it in my head. I wish I knew the group's name so that I could look for it somewhere in cyberspace.If you liked films such as \"Over the edge\" and \"Rich Kids\", I think this is one that you will enjoy as well.","Practically forgotten today, this teen movie from my early teenage years is a sweet, affectionate look at the importance of school spirit and a view of the early education of political wanna-bee's. Lee Purcell's Christine Alexander is the typical do-it-all teenage girl, president of practically club she's in, head cheerleader and extremely ambitious. She's running for Student Council President, a seemingly shoo-in to win, that is until the underdog steps up to the plate. That's Tim McIntire, the kid you don't know, but...., that is until fellow student and political organizer Bruno Kirby finds him checking in late for school and realizes that he's the perfect late entry candidate to toss Christine, whom he once dated, to the curb. Kirby's cute younger sister (Didi Conn, as adorable as she was in \"Grease\") has a huge crush on him, and encourages McIntire all the way. Purcell, who had ruthlessly exposed the previous candidate for falsifying school documentation, has no ammo this time around, so as they face the end of their junior year, Purcell must campaign honestly. But that doesn't stop Kirby from doing all he can to get McIntire elected, something that the honest young man will have to face as a moral dilemma in a moving finale.Never released on VHS or DVD, this is one of those nice little surprises to find if you had not seen it. Having gone to the movies practically every weekend in the summer and fall of 1978, I had seen this one, searched for it for years, and could only find the enjoyable soundtrack album. Great opening credits over the title song (featuring some clever lyrics and a Beach Boys style beat) leads to the introduction of all the major characters, reminding me of several people I knew back in those days. I had one quibble with realism, showing Purcell and several other girls in their cheerleading outfits long after the sports seasons having cheerleaders had ended. While Purcell's character is overly ambitious and determined to be a leader everywhere she goes, she's actually quite low key and not at all your stereotypical bitchy teenage girl, possibly crafty underneath in getting what she wants, but not somebody you'd find it easy to hate. Kirby seems slightly too old for his part, but does well in allowing you to overlook that, and McIntire is somebody whom everybody would be proud to call an older brother or best friend. Various other stereotypes are low-key, so there's nothing to quibble about in that area.A minor subplot has Kirby's black friend (and school basketball hero) Tom Carter romancing the pretty Petronia Paley who has singing ambitions and keeps him at a distance when mingling with those who can help her. Paley, who would go onto major parts on \"Another World\" and \"Guiding Light\", was a decade older than her character, but she manages to pull off being a teenager miraculously. She gets to perform a Supreme's type song, while Purcell as part of her election promotion does a brief version of \"Frankie & Johnny\" that shows some pretty impressive dance moves. McIntire's domino follow-up is pretty cool, and while it seems outlandish now, made a big impression on me back when I was a teenager. This film is very similar to the more recent \"Election\" where Reese Witherspoon's over achiever character pulled way more scheming stunts to win her high school class presidency, making Purcell practically a saint when compared to her.","Odd and obscure teen movie. Ambitious senior Christine (Lee Purcell) is running unopposed for student body president after getting her rival suspended. Her ex Bobby (Bruno Kirby), rushes to find an 11th hour replacement. He enlists Darryl (John Friedrich), an unknown but likable candidate. Dirty tricks ensue on both sides as the election nears.Almost Summer is almost completely forgotten for good reason. The premise is simply dull, and while other teen movies from this era like Malibu Beach and Van Nuys Blvd are more lighthearted, Almost Summer takes a more serious, soap-opera tone. Whoever said this was a comedy must have seen a different movie, there isn't one laugh in it. There is a food fight scene, but it seems perfunctory, as if the producers were checking it off their list. The acting and dialogue is competent, but the actors are almost all well into their twenties, and play it all too serious. Bruno Kirby glares and shouts at everyone, acting like a fixer for the mob, while 30 year- old Lee Purcell wears the dress and demeanor of a young attorney, not a teenager.The main plot line is never resolved, either. Darryl wins the election with his every-man approach, but turns down the office after learning Bobby staged a drug bust earlier to boost his image. His integrity only makes the student body want him as president more. It's assumed by the final scene at the prom that he's accepted the job, but it's never made explicitly clear. There are a few other subplots, but they're not worth mentioning. All plot lines are ended abruptly, and everyone gets a partner at the prom.Hard to recommend this unless your a die-hard Kirby fan, or are trying to watch every last 70s teen flick. Beach Boys fans should seek out the soundtrack, composed mostly by Mike Love's side project group Celebration. The title track was written by Love, Brian Wilson, and Al Jardine, making it nearly a lost Beach Boys song.","\"Almost Summer\" was worked on by four screenwriters (Judith and Sandra Berg, Martin Davidson--who also directed--and Marc Reid Rubel), yet it opens with the oldest visual cliché in the teen-movie manual: anonymous girl in a red bikini lying on a beach towel next to her suntan oil and radio. Who is she? It doesn't matter. For a film that wants to examine cutthroat high school politics with a somewhat serious face, this opening shot--more than any other--tips the writers' hand: what they really wanted to make was a girl-ogling flick on the level of \"Beach Blanket Bingo\". When his candidate for student body president is suspended, wheeler-dealer Bruno Kirby has to come up with a last minute replacement to challenge Lee Purcell, the class brain. Most of the actors look old enough to be in college (one of the reasons, I think, the movie didn't catch on with its target audience), although Didi Conn does her oddball outsider thing to good effect (even if the sight gag with her braces is overdone). One tires quickly of wise guy Kirby, who swears like a seasoned sailor and gambles on the side like a streetwise hustler. \"Grease\" beat this into theaters by three months and, while that film also featured kids too old for class, it had a real feel for classrooms and teachers and puppy love. \"Almost Summer\" wants to be hard-shelled and yet sentimental--the underdog as teen idol--but the dialogue is too smart and worldly and cynical. Where's the fun of being a teenager? ** from ****","I enjoyed this movie very much, seeing it on TV 12 years ago. One of my favorite of the coming-of-age teen movies. In fact, this one is often credited as being a fore-runner to the dozens of 80's teen movies (fast times, 16 candles, pretty in pink etc). The plot has been summarized elsewhere (if you care to know), needless to say its charm for me was the solid acting and decent script. The main characters were very believable in their roles and they seemed to have genuine chemistry. I think the ending made it for me, and the presidential speech has remained in my head for many years (despite that I haven't seen the movie since). am very surprised the movie didn't do nearly as well as I would have thought (I am usually a very good barometer for 'what is popular'). If you have a few hours to kill, I'm asking you (if you can find this movie anywhere as it is pretty tough to find...its still not out on DVD!!!) to give it a try. It may show its age, but you cant go wrong with it.","great movie for any ages, especially if you liked high school.  Kirby and Conn have unique voices and Conn has awesome legs.  Friedrich plays a likable character and seeing a pre-Animal House Tim Matheson is cool.","Popular kid doesn't want to see his down to earth ex-girlfriend win high school election for president, so he gets an unpopular kid to run against her and eventually his stock rises.I saw this on Encore some time ago and it hasn't been released on video yet. It is kind of like a reverse She's All That, only this is about high school elections instead. Not really any good, nothing about this movie is pratically memorable. Ok acting, direction, script, etc.Rated PG, Profanity","bifboy69","richard.fuller1","karchad","surlygreaser","mr-collier","mark.waltz","pav777","moonspinner55","riffraff-50-494650","bonan9202","brandonsites1981","5 March 2001","23 July 2001","12 September 2003","24 June 2005","12 December 2005","2 April 2018","16 August 2017","12 August 2017","10 May 2011","26 January 2004","25 May 2002","10","5","8","6","4","5","8"," GREAT LATE 70'S TEEN MOVIE!!\n"," Pure Seventies Teens, my intro to Kirby and Conn\n"," not bad, worth watching\n"," o-k teen comedy,w/t Didi conn showing off her 2 incredible frenchies!\n"," Pre - Fast Times Goodie\n"," Overshadowed by the same year's \"Grease\", this was not a sad, sad summer.\n"," Almost Bummer\n"," If it's \"back to class, crack the books\", it wouldn't be almost summer--it would be the end of summer\n"," Worth watching\n"," loved this movie\n"," * * out of 4.\n"]}