{"review-url":["http://www.imdb.com/title/tt0037620/reviews"],"review-text":["I saw this on TCM recently and, through the IMDb I found that there were seven \"Crime Doctor\" movies with Warner Baxter as the psychiatrist-detective. Baxter is a bit long in the tooth compared to his stolid performance in 42nd Street a decade earlier. Not noir, and a bit campy today, the movie also has a touch of the possible supernatural. The plot, black and white cinematography and characters are far more complex than those of the Mr. Moto and Charlie Chan series. There are subplots, unexpected twists and appearances by a number of B movie stalwartly we all should recognize immediately (none ever made it to the A status). It is a wonderfully unpredictable 70 minutes.I would love to see a boxed DVD series of these films.","Of the original Oscar winning actors (prior to Lionel Barrymore, Fredric March and Charles Laughton), an unfair curtain of neglect has descended on them. In one case, Emil Jannings (the first Best Actor winner), he only had himself to blame because he insisted on not only working for Germany in the Nazi period, but he was a full throated supporter of Nazi policies. Despite doing some first rate work after 1927 (including Profesor Emanuel Rath in Von Sternberg's THE BLUE ANGEL), most of his film work is ignored as Nazi propaganda. The second winner - well more about him in a moment. The third was the splendid George Arliss, the first British actor to win Best Actor (for DISRAELI) and who really gave pretty entertaining performances in his talkies that hold up pretty well. But too many modern critics decry his many \"biographical\" films, claiming he made Dizzy, Alexander Hamilton, Cardinal Richelieu, Nathan Rothschild, Voltaire, and the Duke of Wellington all look alike and all seem to have two traits: reorganizing or saving society, and uniting young lovers. Actually, Disraeli, Richelieu, and Voltaire do look something alike from their paintings and pictures, but Hamilton, Rothschild, and Wellington don't look alike.As for the second winner (and first American born actor to win the Best Actor Oscar), Warner Baxter is a peculiar case indeed. From 1928 through 1933 he was turned into a cog in the Hollywood dream factory, turning out one picture after another in rapid succession. Most of these (including his Oscar Winner, In OLD ARIZONA) are rarely shown. Yet some of them (SUCH MEN ARE DANGEROUS, DADDY LONGLEGS, TWELVE HOURS TO LIVE) are pretty good performances. Later films he made showed he was not a performer to brush aside: THE ROAD TO GLORY about the hopeless trench warfare of World War I, THE PRISONER OF SHARK ISLAND about Dr. Samuel Mudd, and KIDNAPPED based on the Stevenson novel, were all worthy films. Yet most people, when asked for his typical film role, recall only one (maybe they'll recall SHARK ISLAND too): Julian Marsh in 42ND STREET. His fate was to be broken by overwork. His last major performance in a leading production was as \"Kendall Nesbit\" the wealthy publisher and suitor in Mitchell Leisin's LADY IN THE DARK (1941) with Ginger Rogers, Ray Milland, and Jon Hall. He also played the title role in ADAM HAD FOUR SONS which helped introduce Ingrid Bergman and Susan Hayward (as \"good\" girl and \"bad\" girl respectively) to American audiences. But he suffered a nervous breakdown due to overwork in the early 1940s. So his output decreased afterward. And his appearances were somewhat easier to take - his intensity was removed, for better or worse.It was Baxter's luck that he got a detective series' role to play with. In 1943 he first appeared as psychiatrist, Dr. Robert Ordway. Ordway gets the moniker of \"the Crime Doctor\"* in his series, and solves murders like Nick Charles or Sam Spade or Philip Marlowe. Yet the films about those three sleuths (and Charlie Chan and Mr. Moto) are still remembered quite fondly, whereas \"The Crime Doctor\" series was as forgotten as Chester Morris' \"Boston Blackie\" or George Sanders / Tom Conway \"The Falcon\". (*Interestingly enough, in the unrelated Sherlock Holmes spoof, WITHOUT A CLUE, Ben Kingsley as Dr. Watson offers his services to a skeptical Scotland Yard as a replacement detective to Holmes, to be called \"the Crime Doctor\"!)The series did have a good number of character actors supporting Baxter. In THE CRIME DOCTOR'S COURAGE the cast included Jerome Cowan, Lloyd Corrigan, Hillary Brooke, and Emory Parnell. The production values may not match MGM's values for THE THIN MAN series or Warner's for THE MALTESE FALCON, but they aren't to be sneezed at. Look at the sets for the nightclub scenes in this film, where the Bragas (a brother and sister dance and magic act) perform an illusion in which the sister vanishes in front of the audience. It does look like a realistic theater setting. Dr. Ordway is on a vacation trip to California, and gets drawn into the murder of a fortune hunter. The man apparently committed suicide in a locked room. Ordway is certain the victim was murdered. Gradually methods of entry are turned up (one by Corrigan, who notices a trap door's frame under the carpet - oddly the police did not notice it). The plot soon bogs down into motives and theories of guilt. The Bragas are odd - they never appear out of their home before sundown. They have no mirrors in their home or in their make-up room in the nightclub. And at least one seems able to be invisible. Could they be vampires?Baxter does solve the case later, and finds a more prosaic explanation. But the film lacks any sense of reality - it gets so bogged down in details about the supernatural that one suspects it should have stayed in that area for it's solution. Also, Baxter is workmanlike in his detective work, but he's too relaxed (even in his final battle with the villain). One gets the impression that the production staff decided to go easy on him due to the recent breakdown.My favorite character in this is Emory Parnell as Lt. Birch. Typically impatient and ham-handed (like Donald MacBride or Nat Pendleton in similar films), he admits (at one point) to Baxter that his father wanted him to have a career as a real estate broker. As the film ends, we realize that Parnell would have been an excellent real estate broker!","This one is not only baffling, it's weird.It starts off with a good hook for drawing the viewer into the story--but then veers off in so many different directions that the plot is soon downright bizarre. The opening has HILLARY BROOKE urging Dr. Ordway (WARNER BAXTER) to attend a dinner at her home so that he can have a good look at her husband (STEPHEN CRANE), a man whose previous wives have died mysteriously and whom she suspects might be insane.When Crane is murdered that evening, behind doors in a locked room, Dr. Ordway must solve the case. LLOYD CORRIGAN is on hand as a bumbling carpenter friend but the plot revolves around Spanish dancers (ANTHONY CARUSO and LUPITA TOVAR), suspected of being vampires because no one has ever seen them in daylight.A series of baffling twists and turns shed little light on whatever the outcome of the case will be--and the explanations that come forth during the film's last five minutes are less than satisfying, nor are they the least bit credible.It's a murky yarn that starts out acceptably in typical mystery fashion, but soon gets bogged down in a far-fetched story that deals with vampirism, a jealous suitor, trick effects to make a dancer disappear, and a rather abrupt ending with virtually no character development to prepare the viewer for the final explanation.Summing up: Interesting, but a bizarre mixture of mystery elements.","Another nice entry in the Crime Doctor series [#4/10], with atmospheric almost noirish black and white photography and some splendid Spanish American backdrops and sets. And a more off-the-wall storyline too!A man who looks like the insane murderer of his first two wives is found dead in a locked room after a dramatic dinner party. The Crime Doctor is on the scene (ostensibly as a guest) to immediately and resignedly proclaim it murder, and so we are presented with a quite weird set of people to mull over, for one of them did the deed. Was it the frothing brother of the dead 1st wife, the 3rd wife and rich widow Hilary Brooke, the dancing brother and sister vampires, the intense young man, the eccentric cabinet maker Lloyd Corrigan on loan from Boston Blackie, the irreplaceable butler, or odds-on Jerome Cowan? Police Inspector Emory Parnell had his work cut out, but Warner Baxter as Ordway was as unflappable as ever in working it all out. One of the goofs listed on the IMDb is wrong: On breaking into the murder room Ordway says \"Right through the centre of the forehead\" and Cowan replies \"He didn't miss this time\". Favorite bits: Baxter and Cowan travelling through club sandwiches and beer at the nightclub to make amends for their interrupted dinner party; The scene where the Braga's place of repose is seemingly rumbled. The plot does seem to meander a bit at times and the way it was all explained off was perhaps more worthy of Monogram, but leaving it in the air as supernatural wouldn't do either!Well worth a watch if you already like the genre, you won't be disappointed unless you really don't like the genre.","Better than average World War II-era \"who-dun-it\" featuring Warner Baxter as a former gangster who suffered amnesia and has been reborn as a psychiatrist now known as Robert Ordway who helps both the police and criminals who want to go straight. Crime Doctor's Courage is the fourth in the series of ten and also involves a victim who might have some mental problems. The link to \"courage\" is not particularly clear.This entry revolves around the death of fortune hunter Gordon Carson whose two previous wives have under mysterious circumstances and who in turn dies in a locked room under conditions that resemble suicide but Dr. Ordway labels murder. Hillary Brooke plays the part of widow Kathleen Carson who is involved with Anthony Caruso - a mysterious Spanish dancer whose act includes his sister that disappears on stage. As a mystery novelist, Jerome Cowan is a good supporting actor as is Lloyd Corrigan as an aficionado in crime.Spooky houses with creaking doors, caskets in the cellar, and suspects that are never seen in daylight add to the air of suspense. The set for the dance sequence is quite elaborate and the ballet music very good. Direction, production design, and photography stand out. The exterior shots and costumes suggest more affluence rather than normally found in the average \"B\" detective thriller.Strongly recommended.","The Crime Doctor series was usually consistent in it's style and excellence, helped enormously by Warner Baxter as the unobtrusive doctor. The stories were always a bit different to the usual cops and robbers fare with Doctor Ordway's most important job to get to the root of the patient's problem. This movie, though, seems to have it's fair share of holes and starts out with a troubled man, having lost his first wife on their honeymoon and soon to lose his second in a rock slide - again on their honeymoon. Even though the fall was an accident it was caused by the young man's strange behaviour and though he is acquitted, the brother of his first wife feels it was no accident.Dr. Ordway enters the picture when a newly married socialite Kathleen Massey (Hillary Brooke) begs him to come to dinner to observe her husband and diagnose whether he is insane or not!!! Yes, it is the same husband whose former wives were involved in those honeymoon accidents. The brother who made the original allegations keeps popping up everywhere driving Carson (dare I say it) insane, until this particular night he makes his appearance as a waiter and has it out with Carson in front of everybody - minutes later Carson is found dead!!Now the storyline goes off on a completely different tangent - wants you to forget about Carson and his troubles (the brother doesn't appear again!!) and concentrate on Kathleen, who apparently has always loved Miguel Bragga (Anthony Caruso) (well for a few weeks anyway) - who, along with his sister (Lupita Tovar) have a mystical disappearing dancing act that they perform at a local night club. As Kathleen tells yet another of her love sick suitors, she liked Carson \"well enough\" but only married him for the financial help he could give her father. I think the viewer loses sympathy for her and seeing she tends to disappear from the second half - it doesn't help her case!!The movie then concentrates on the Braggas who, publicity says, are a pair of modern day vampires who are never seen in the day time, never sleep in their beds and when Ordway makes a search of their \"castle\", finds two silk lined coffins in the basement. His buddy in this movie is a writer (Jerome Cowan) who has cooked up the vampire publicity for the pair and brings them to Ordway's notice when he comments on their amazing disappearing act. Even though production values are good and events are explained, the ending seems hastily put together - it would have been interesting to keep the angry brother around, at least as a red herring!!Still it was nice to see Lupita Tovar again. She had a few roles in the early thirties, usually as \"native girl\" and she was in the Spanish version of \"Dracula\" but she married director Paul Kohner and retired (their daughter was actress Susan Kohner). And I am definitely convinced that it is Virginia Mayo by the pool - what do other people think???","***SPOILERS*** One of the most strangest of all the \"Crime Doctor\" films has the \"Crime Doctor\" police psychiatrist Dr. Robert Ordway, Warner Baxter, go on vacation in sunny Southern California to sooth his nerves only to run into a pair of Spanish vampires who spend all their daylight hours in coffins and at night do an on stage brother and sister disappearing act.The Vamps Miguel & Delores Bragga, Anthony Caruso & Lupita Tovar, get involved with Dr.Ordway in an out of the way connection in the murder of Gordon Carson, Stephen Crane. Gordon who's two previous marriages ended with with the bride getting killed in a mysterious accident was just married to bride #3 the gorgeous Kathleen Carson,Hillary Brooke. It in fact was Kathleen who invited the \"Crime Doctor\" to the Carson Mansion where she was throwing a party so he can check out her husband Gordon whom, after being married to him for just one day, she suspects him to be a both homicidal lunatic as well as being completely off his rocker! Katheen had gotten these mysterious letters and newspaper clippings about Gordon that convinced her she made the wrong choice in marrying him!It's during dinner that one of Gordon's dead wive's brother David Lee, Dennis Moore, disguised as a waiter crashed the party accusing Gordon of murdering his sister. Hurt and humiliated in being accused of murder in front of all his friends including his wife Kathleen Gordon locked himself into an outer room and before the guests at the party could get the door open shot himself to death! Dr. Ordway smells a rat right away in that the gun that Gordon used to kill himself was ice cold, instead of warm, proving that it was planted on the dead Gordon after he was murdered. What's even more strange is that the Bargga's who were at the party are the only one's who could have pulled, Gordon's murder, it off in the fact they had the means, by making themselves invisible, to do it!****SPOILERS**** Dr. Ordway plays it both cool and straight in solving Gordon's murder not for once falling for the con-job that there in fact are such things as vampires which later turned out to be a red herring in order to cover Gordon's killers tracks. What really lead to Gordon's murder as well as number of other killings to cover it up was that fact that he married Kathleen! The killer was so obsessed with Kathleen that when he heard she left him for another man, Gordon Carson, he completely flipped out. Using the phony vampire angle that mystery writer Jeff Jerome, Jerome Cowan, provided him with the killer planned to get Kathleen back by both murdering her husband Gordon and at the same time pining his murder on the totally innocent Bragga's!This plan would have worked with the police, who fell for the phony vampire act, but not with the wise old and experienced \"Crime Doctor Robert Ordway! After over 12 years investigating the strange and the unknown there's very little that the Doc doesn't know about con jobs and the shysters who try to use the supernatural to throw the police off their trail. In this case Dr. Ordway saw right away, through his friend Jeff Jerome, that the Bragga's were being set up to take the rap in Gordon's murder! The only thing left for him to uncover is who was the person who set them up!","As Doctor Robert Ordway, the Crime Doctor, Warner Baxter gets involved in all kinds of mysteries. But one usually doesn't get invitations to dinner like this even from beautiful women like Hillary Brooke.Brooke married Stephen Crane whose two previous brides both had accidental deaths. For some odd reason, she's beginning to have second thoughts about the marriage. So the famous Crime Doctor is invited for dinner and a consultation to observe the behavior of her husband.In true murder mystery style the husband is shot to death last night in a locked room with the house still full of guests. Baxter calls the police and Captaine Emory Parnell arrives on the scene. Of course Baxter is no small help in eventually arriving at the identity of the culprit though another murder takes place.We've even got the supernatural involved because one of the suspects is half of a mysterious Spanish dancing team of Anthony Caruso and Lupita Tovar. They're suspected of being vampires.The Crime Doctor's Courage I'm sure didn't people running for the exits when it played the bottom half of double bills in the Forties. One thing I will say though, the behavior of one of the suspects during a scene that didn't involve Baxter kind of gave away the identity of the murderer. Still it's a passable enough murder mystery.","It's Saturday, it's raining, and I think every movie should have at least one comment... so I just watched \"The Crime Doctor's Courage\" all the way through. It's a murder mystery with a typical cast of characters, and a couple of the usual suspects -- each with their own possible motive for the crime. The story starts abruptly and the viewer is thrown into the plot with no character development or storytelling whatsoever. I guess that's not too surprising for a B movie of this period. There are also some moments which look and feel like this is pre-WWII, but perhaps that is due to the writer's background in radio shows.The \"Crime Doctor\" is the sleuth who happens to be visiting California for some R&R from his psychiatry practice on the East coast. He hooks up with a mystery novelist friend with whom it is implied has been along for one or more previous mystery solving capers. The novelist occasionally fills the role of sidekick to our sleuth (AKA Dr. Watson), and also occasionally lightens things up with a bit of comic relief (sort of).There is also a somewhat simple, but not quite bumbling police captain who at times is annoyed by the meddling sleuth. And then there are the mysterious Braggas, a brother and sister who are dance artists at a night-club. The dance is sort of an interpretive dance that happens to be one of those moments which feels more like the 30's than the 40's. Though the story location is California, the Braggas appear to live in a castle!There was one plot element which managed to keep me somewhat amused, but I won't divulge any more than that because I always enjoy movies more when the story is discovered, rather than known in advance. (even though I can think of many, many, B films which would rate higher and it is difficult to say that watching this one is time well spent) I have not seen any other movies from the \"Crime Doctor\" series, so I can't make any comparisons.","If they hadn't used the title in the Crime Doctor series of films two years earlier, this one probably could have gone down as his 'Strangest Case'. Because this one had me going with it's interesting plot and Gordon Carson's (Stephen Crane) alleged 'suicide' right up until the word 'vampire' was introduced into the story. With that 'huh?' moment, one can only hope to stay attentive long enough to scramble together a host of disparate elements in order to close out this baffling murder mystery.It didn't start out so confusing. You had a wealthy businessman who's first two wives died mysteriously within days of their respective weddings under unusual circumstances. Coincidental enough to cast doubt on Carson's innocence, sure, but having him wind up dead shortly after marrying the third time was turning the tables on the story. Eventually it becomes clear that wife number three (Hillary Brooke) did it for the money, so even if she were to be a suspect, the fact that her husband died of a gunshot wound in his locked study with no means of entry or exit to be found, seems to make this an open and shut case for suicide.But then you have the brother and sister dance team (Anthony Caruso, Lupita Tovar) who's publicity guru (Jerome Cowan) suggests they're never seen during the day, don't have mirrors in their dressing room, and sleep in coffins. Well then, the vampire angle gains some traction and the crime doctor has one more bizarre hurdle to overcome to solve the crime of Carson's murder. It all hinges on the idea that one or the other of the Bragga's can 'disappear' at will, thereby suggesting that one of them could have killed Carson while invisible.Well I won't give it all away here, but the resolution to the mystery is a whole lot more mundane than anything that went before. I think if you watch this film a second time after knowing how the story ends, it would make more sense and not seem so bizarre with the vampire angle thrown in. Still, questions remain, like why was it necessary for Miguel Bragga to give Ordway the knockout drink? And why, even if they went along with the vampire pretense, would the Braggas sleep in coffins? Who would ever know?","Of all the B-detective series films of the 30s and 40s, one of my favorites has been the Crime Doctor films starring Warner Baxter. Most of this is because the basic premise and style of the films is different enough from the average film of the genre to make unique and worth seeing. However, despite my enjoyment of most of these films, I must say that I agree strongly with Neil Doyle's review that found this particular film to be interesting but also very bizarre and confusing due to its strange plot--making it one of the lesser entries in the series.The film begins with a man on his honeymoon. His new wife tells him that she just discovered that he'd been previously married and there were accusations he'd murdered his first wife. Then, in a case of lousy acting and poor directing, the second wife falls off a cliff accidentally--leaving a groom who has had two wives die quickly after the wedding and both suspiciously.A short time later, you see the husband now married to his third wife! I found myself wondering WHY this guy kept getting married--especially when his first brother-in-law kept following him and accusing him of being a murderer! A short time later, the husband is murdered but HOW the murderer was able to escape from a locked room without being detected is a real mystery. I really liked this aspect of the plot a lot--the classic \"how did they kill a man and escape undetected\" plot line is exciting. However, where the film went next is just bizarre and was too much of a weird distraction that involved a couple of dancers who MAY just be vampires!!! This just left me baffled and confused and resulted in a less than satisfying conclusion.Don't take the silliness of this film convince you the series is bad--it isn't. It's just that this particular film, though interesting, is also pretty silly and confusing. I guess you can't win 'em all!","This is a watchable mystery but you can't really say why. It has a sort of meandering, rambling plot but strangely it works. Although the films are no way comparable, it is same type of unpredictable plot as Tarantino's \"From Dusk Till Dawn\". You just don't know where it will go next, and maybe they were making up the plot as they went along, but you want to watch it anyway. The performances here are delivered straight, even the vampire angle (which the characters know is suspect, if weird.) As usual Baxter is strong and trustworthy, Brooke is classy and untrustworthy. These two solid performers do a good job and will not disappoint you.The very last scene with a cop and the Crime Doctor talking real estate exemplifies the ambling but viewable style of this type of script, where sometimes the action is quick, yet characters have time to chat about whatever. Be it Tarantino or the writers here, you are always able to watch and be entertained all the way through.","... might be a better title than the vague \"Crime Doctor's Courage\".The film starts by showing a young couple on their honeymoon. The new bride insists on going to the edge of a rocky cliff. Her husband (Stephen Crane as Gordon Carson) wants her to move away from the edge because his first wife died in an accident during the first week of their marriage just a year ago. She hit her head while swimming, it was ruled an accident, but the deceased bride's brother still thought it was murder.The couple argue. During the argument, Gordon's new wife pulls away from him, loses her footing and falls off of the cliff to her death. The sheriff calls it an accident, but the brother of the first wife believes that now Gordon is some kind of maniac that enjoys marrying women and then killing them in ways that look like accidents. His parting words to the sheriff are \"Who will it be next year?\".The answer to that question is Hillary Brooke as Kathleen Carson. She interrupts Dr. Robert Ordway (Warner Baxter) the psychiatrist on a vacation to sunny California that he is taking on doctor's orders. Kathleen has only been married one day and believes her husband could be insane. She asks Ordway to dinner to observe her husband. There are quite a few people at the dinner besides Ordway and the Carsons, and one of the servants is actually the first bride's brother who apparently has been popping up all over the place for the last year urging Gordon to either commit himself to an asylum or commit suicide before he kills someone else. Gordon is obviously troubled, retires to his study alone, and a shot rings out. Ordway and crime novelist Jeff Jerome (Jerome Cowan) burst in and find a gun near the body of Gordon, but the gun is cold. Somebody has tried to cover the murder of Gordon Carson with a fake suicide. But who could murder Gordon when he is locked inside his study and there are bars on the only window?Ordway finds his help unwanted by the local police, but he can't help coming across clue after clue. For one, the newly widowed Kathleen disappears right after the murder, hiding at the castle like home of the mysterious Braggas. A new will leaving everything of Gordon's to Kathleen was made out the day before Gordon's death. As for the mysterious Braggas, nobody has ever seen them out after dark, there is a portrait of them that is apparently 300 years old, they keep coffins in their basement, and they perform a dancing act at a local club in which one family member disappears and then just as mysteriously reappears. Did I mention that Miguel Bragga is in love with Kathleen? Could a vampire that can disappear and reappear at will possibly be the murderer? Watch and find out in this atmospheric entry to the crime doctor series. There are more suspects than I mention here, so it is not so cut and dried as you might think and remember, this is the crime doctor we're talking about, a man of science and reason, not Kolchak the night stalker! Highly recommended.","In \"The Crime Doctor's Courage,\" Dr. Ordway investigates the death of a man thought of as a black widower - both his wives plunged to their deaths on their honeymoons. The investigation leads to brother and sister Spanish dancers who might be vampires - no mirrors, one of them disappears during their dance number, and no one sees them during the day. The third wife of the black widower becomes engaged to the male dancer, and the plot thickens.The plot is all over the place, but it's quite entertaining nonetheless. The other mysteries I've seen in this series have been pretty good. This one features, besides Warner Baxter as Dr. Ordway, Jerome Cowan and Hillary Brooke.Baxter, who at one point made more money than any other star of his era, suffered a nervous breakdown, and these films offered him a chance to work without killing himself. He's so laid back and casual with his speech - it almost seems like he's ad-libbing. He lived for another six years after this film was made and after a lobotomy, developed pneumonia and died.These films were made very quickly, so little details were often missed. These Spanish dancers supposedly have this amazing act where the female disappears in the midst of it and then reappears - yet they're doing it in this little club. They receive polite applause, and afterward, the host gets up and says that the audience may be wondering about the disappearance mid-dance, but it's no trick. The dancers have the ability to make themselves invisible. Tepid applause. A statement like that deserved a little more!","This Crime Doctor film starring Warner Baxter, (Dr. Robert Ordway) causes the doctor to investigate a murder of a man who lost his both wives on their honeymoon. The doctor is approached by Hillary Brooke,(Kathleen Carson) while the doctor was on vacation and there becomes evidence that there is vampires operating in an old house who are dancers and can only be seen at night time. Their act consists of a mysterious dance created in bright lights and then the female dancer disappears into thin air. This film has many twists and turns and you will have no idea just who the killer is or just what direction this film will take you and why all these murders. This is a rather hopeless film.","Crime Doctor's Courage, The (1945) ** 1/2 (out of 4) Strange fourth entry into Columbia's series is your typical detective film until half way through when it turns into a horror film. The Crime Doctor (Warner Baxter) is asked to check out a husband who is on his third wife. The guy's previous two wives all suffered accidental deaths days after the wedding but there's a subplot with vampires thrown in. This is the third in the series that I've seen and it works the best because of how strange it actually is. I'm really not sure what made the writer turn to vampires but it makes for some interesting plot twists, although none of them really add up in the end. Baxter also seemed to do his best work here and the supporting cast is interesting if not totally successful."],"review-user":["marrj-1","theowinthrop","Doylenf","Spondonman","Jim Tritten","kidboots","sol1218","bkoganbing","cosiz","classicsoncall","MartinHafer","Panamint","calvinnme","blanche-2","whpratt1","Michael_Elliott"],"review-date":["31 March 2007","1 April 2007","31 March 2007","10 June 2007","31 March 2007","1 August 2012","1 April 2011","7 November 2007","31 March 2007","22 June 2014","8 November 2007","4 April 2007","21 November 2015","14 December 2008","11 April 2007","26 February 2008"],"review-rating":["8","6","6","7","8","7","6","5","4","6","6","6","7","6","6"],"review-title":[" One from a little known series\n"," Warner's last \"big\" role\n"," Bizarre story with Warner Baxter again as the crime doctor/sleuth...\n"," Wonderful nonsense\n"," Locked room mystery\n"," It Was Nice to See Lupita Tovar Again!!\n"," I think my husbands insane!\n"," Doctor, Come to Dinner to See if My Husband is Crazy\n"," I've seen worse...\n"," \"Ordway, I tell you, there's drama in the air.\"\n"," I agree with Neil Doyle, this one is good but bizarre\n"," Good Mystery With Meandering Plot\n"," The case of the invisible dancing vampires....\n"," Bizarre craziness\n"," A Mixture of Everything\n"," Strange\n"]}