{"primary":["Tattooed Teenage Alien Fighters from Beverly Hills (TV Series 1994–1995)","https://m.media-amazon.com/images/M/MV5BNTgxMDkyMDctNmVmYi00MzEwLTg0ZWQtYmI1ZDA4MTcyZTE3XkEyXkFqcGdeQXVyNjExODE1MDc@._V1_UY1200_CR104,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0126175/reviews","tt0126175"],"secondary":["Like a few of the other commentators said, this show was low-quality knockoff of the Mighty Morphin' Power Rangers.  I always thought the whole show was meant as satire back when I was watching it, because the writers seemed to be consciously making it so much more stupid than the Power Rangers, which was stupid enough on its own.  My favorite episode was when our four teenage heroes were turned into retards by the main evil dude or somebody.  Nimbar tried to gather them all up in one place by telling them things like \"I have candy\" or \"Barney will be there\".  If it wasn't meant as parody, then pretend it was, because otherwise it would be too sad to think about.","In the long history of television oddities, this one has to rank darn near the top.  It was a cheap attempt to cash in on the Power Rangers craze of the time, and featured special effects that would make Edward D. Wood Jr cringe. Basicly the storyline was that four teenagers were chosen to protect earth from this bad guy who looked like Darth Vader sitting in a dentist chair.  They were called to action by their glowing tatoos, which summoned portals that somehow replaced them with bodybuilders in spandex who looked pretty much nothing like the original actors. This looked friggin hillarious, because you'd see these stand-ins fighting a guy in the rubber suit that always looked like he was about to tip over, while stomping on a cardboard city.  Eventually, the heroes would all lock wrists and turn into and incredibly cheesy looking giant knight.   I make none of this up, I swear to God.. this show actually existed! There had to be only 5-10 episodes, because I remember after telling everyone in school about it, I turned on the TV like a week later to see that it was no longer on.  Trust me, I was devestated.  I'm suprised that to this day I've been unable to find a video of this show on ebay or anywhere else on the net, and I'm also very suprised this classic has yet to pick up the cult following that it deserves.","Wow. I can't believe how relieved I am that this show actually exists.You see, I clearly remember it from way back when I was a little kid. Four teenagers with strange magical tattoos would tel-port into this black room with a pedestal. On the pedestal was a blob of slime called Nimbar that gave the teens missions. They would then transform into laughably bad costumes and fight villains. The whole thing was like an incredibly low budget power rangers. I honestly don't remember much of what went on, but for years I've remembered this show but have never seen anything else about it until now. It just vanished like the vapor it was.I only remember one episode, in which a monster sprayed the teens with a gas, then all sorts of bad things happened, including the death of Nimbar. Finally the token African girl said that everything bad had happened since they got sprayed. Then they will themselves to wake up. They had been sharing a dream, or something for 18 minutes since they'd been sprayed, and THE MONSTER FREAKIN' DID NOTHING the whole time they were asleep. Even at seven I wondered what the Kessel was with that.That is how dumb this show's plots were.","But, yes bad. The writer-producers were initially promised they'd have either A: Japanese monster footage from Tsuburaya,or B: A reasonable American alternative. They got C: crap. When you get crap, you make the best of it, which they did. Was it a parody? Mr. Fisher and Mr. Staahl came from Chicago's Second City, so you make the judgment. Made the judgment yet? It was a joke. It would have been a more successful joke if the shows had more than a ten cent budget, but everyone did the best they could. And if it hadn't been at least a slightly memorable joke, you wouldn't be reading this now, would you? Personally, I think David Lander's portrayal of Lechner totally rocks. Well, rocks a bit.","Tattooed Teenage Alien Fighters from Beverly Hills is the super ghetto knock off of Mighty Morhpin Power Rangers. This series was actually funnier though because of its cheap qualities. They all had a tattoo of a zodiac sign I think, and then they would turn into zodiac warriors and fight these foam rubber monsters. Their mentor was also a house plant, probably of the ficus family. This show is great pop culture, because it is so terribly lame and short lived. If this ever re-airs it means the end of the world but go ahead and watch it because you will laugh your hinder off.","I came across this gem of a program during an episode where somehow, for some unknown reason, the 2 male characters and 2 female characters switch bodies. Basically the female voices were coming out of the men's bodies, and vice versa. Before my friends and I had a chance to catch the real name of the show, we lovingly referred to it as \"The Gender Morphers\".But my glee turned to horror the day of my birthday. On that day, we were all gathered round the tube, watching this horrible show, when the character named Lechner announced it was HIS birthday. I HAVE NEVER LIVED THIS DOWN!! I am reminded every year that, yes, I share a birthday with a badly stitched puppet named Lechner from an ultimately campy show named \"Tatooed Teenage Alien Fighters\".","Tattooed Teenage Alien Fighters from Berverly Hills is one of those shows that is so horrible you can't take your eyes of it.Being a Sentai fan, I enjoyed Power Rangers, but Saban was also trying to adapt stuff like the much-loved kamen Rdier, and the result was complete crap. Meanwhile, during the Power Ranegrs craze, Dic created the awesome and underrated super-Human Samurai Syber squad, which was based upon an Ultraman incarnation. I never really cared for Ultraman, but Samurai Syber Squad was entertaining, more so than anything Saban chucked out in 1994 other than Power Rangers. Dic soon created this abysmal masterpiece, which I am going to call a parody. It was all-American, meaning no Japanese stock footage is here to destroy the world, no, we have entirely American footage instead.let's start with plot. its actually pretty standard, compared to syber Squad. An intergalactic villain known as Gorganus, who is basically Dentist Vader, sits on his throne in search of the Power Portals, bad special effects that will help him to take over the universe. loyally perched by the villains' side is a bad puppet bird who gives me nightmares. anyway, Earth is a focal point for the bad special effects, so Monthy Python's Black Knight decides to conquer it. Nimbar, a cross between the almighty Zordon and the Blob, is the protector of bad special effects everywhere, calls upon four carbon copies of each power rangers, Laurie the cheerleader, resembles Kimberly the gymnast, then we have a tomboy who reminds me of Trini, a black guy who is a cross between Billy and Zack I suppose. the final guy is non-existent in power rangers. Nimbar gives the outfits of gay pornstars and sends to battle a giant samurai named Ninjabot (WTF)However, they combine their Powers to form their *cough* megazord *cough* Nitron, a really bad looking cheap Halloween costume who destroys Ninjabot by shooting him in the crotch. I haven't seen much other episodes, but who needs to?Nimbar gives them glowing tattoo's which act as the communicators and teleporters. they stand on Transo Discs, which serve as morphers, and the use different star signs which act as dinosaurs. The acting is cardboard, The blonde girl is the most wooden actor I've ever seen. But i do have to say, Leslie Danton is quite hot in this roll, pity she can't act her way out of a paper bag. Bottom line, this show is horrendous, but it is a hidden gem amongst numerous toku shows and deserves more of a cult following. go watch some eps on you tube, they are there.","When I first saw this in Dragon Ball Abridged I thought nothing as horrible as this could exist. It was worse than expectations but not manos bad. Don't Watch it.","I loved this show which contained the campy youthful humor of shows like Saved By The Bell and California Dreams and mixed it up with action to capitalize on the Power Rangers / Superhuman Samurai / VR Troopers / Beetleborgs craze of the 90s! Four teens were given the power to turn into giants to fight equally gigantic monsters, and strangely enough, always in the same city set! The monster suits were cheesy even by campy Godzilla standards and when necessary, the teens joined together to form...not a giant robot, but a cheesy knight in shining armor! By not taking itself seriously, it was actually more entertaining to me than the higher budgeted shows aforementioned. I'd love to see them collected on DVD but am equally sure they never will be. From the USA Network!","The special effects for this series is from the 1970's. Its horribly bad. I have never seen mid 90's series with such horrible, horrible effects. The good thing is the creators of this series didn't spend much time on the superhero part of the show. The storyline is fun and interesting. You care about most of the characters, and you look forward to each episode to find out what happens to everybody. Leslie Danon is the star of the show, and she adds so much to it. She is extraordinarily beautiful, nice acting abilities, and has a great voice. In the episode where she is turning primeval she literally scares everybody with her primal scream. I don't where she got that from, but it was truly intense. Its a shame her career never took off. I think she could give all the current A-listers a run for their money.","This show tired to cash in on Power Ranger craze during the mid 90's.  In some way this was an American knock off Ultraman mixed in with Saved By the Bell.The shows main villain is Emperor Gorganus who wants to take over Earth because it's a center point for him to control the entire universe.  He was successful and conquering other worlds and Earth would seal the deal in universal domination.  However Nimbar (who looks like slime) recruited a unlike group of teenagers.  Ones who are mainly upper class stuckups from...you get the ideal.  Nimbar give them glow in dark tattoos and have the abily to become Galactic Sentials though a Transporter pads. They then appear enlarged like giants ready to take on Gorganus's monsters.  Their was one interesting twist.  The Sentials had the power to merge into one single super Sential.  Other than that the only great thing about this show was the action even though it was shot on video.Neverless they should have kept this ideal of a show to themselves.  We could live without it.","Contrary to what people say that this is worse than power rangers it is not! Power rangers was more about absurdity as a lot of things were bad about it even if it didn't come out of Japan. This show on the other hand goes back to old days when there were the rubber monsters. The acting is much better than the other, not that its saying much for many. The effects are low-budget, but who cares? I like the imaginative monsters. I haven't seen them all yet, but there are some I like more like Norakula the brain monster, and Slaygar the toxic waste monster. The last part I should add is the character development. We don't have the cookie-cutter characters like we saw in Power Rangers. We have Gordon, although vain, has a strong sense of justice, Laurie the cheerleader known for bringing everyone together, Drew the gutsy one, and Swinton the innovator and genius. If you want to watch some episodes go onto the KEWL cartoons website and you'll see what I mean.","Back in 1994 the Power Rangers had become a huge franchise and t.v. executives at the USA Network were hoping to get in on the action and came up with the Tattooed Teenage Alien Fighters from Beverly Hills, in which the evil Emporer Gorganus, who looks like he's wearing a home made Darth Vader costume, and his talking bird, that looks like a rubber dog chew toy, come to earth to invade it using giant monsters that look like rejects from a 1970's Godzilla film. Fortunately Nimbar an alien that looks like a giant piece of clear jello recruits four teenagers to defend the earth, Nimbar gives them each a tattoo of a different star constellation that allows them to transform into buffed up superheros who look like dancers from an eighties tech no music video, they could also combined into a giant knight. Forty episodes were made. The USA Network clearly did not have the money to try to adapt a show from Japan like Power Rangers did, and made up this show on their own using the budget of a 1950's scifi film. The fights scenes are generic, the special effects are poor, and some of the sets look like they could fall down. The actors pretty much realized how ridiculous the show was and pretty much ham it up and overact. I can only imagine their shock when the show was cancel led.","The only reason I even sat thru this horrendous excuse for a TV show was because it came on USA Network around 4PM right before Knight Rider (watching an automated black Trans Am and a guy with the same leather jacket in every episode was choice entertainment for me :P) So anyways yes, I had the un-pleasure of watching T.T.A.F.F.B.H. It was a wierd and nonsensical show that seemed like an even less palatable version of Power Rangers (which I hated more than Barney, Masked Rider was okay, talking cars RAWK!)\nI always wondered about those similarities, like the Tatoo's seem to have the same function as the Ranger's communicator watches. And what the heck was that thing that they always called upon in some Captain Planet-esque fashion to vanquish the bad guy? It looked like a 2 dimensional cardboard cut-out. Old Godzilla flicks had better costumes and special effects. Zodiac signs? Elements.. sure. Animal totems..Why not? But Zodiac signs? WTF? Maybe they should fight the bad guys with mood rings too?This show was good for laughs and thats about all it was good for. Welp, I'm gunna go watch Knight Rider on the SF channel. Skareeew you 1990's and your damned 70's flashback bell-bottom hippy crap. Long live the 80's! Witness the re-birth of MY decade! Behold, clueless trend-mongers! It is coming!*insert maniacle laughter*-BFK","I was in college when the Power Rangers craze hit so I was too old to be the target audience but my little brother was into all things Power Ranger-y, this show included. That's how I started watching it.Yes, the budget was shoestring. They only had four sets for the scenes to take place in: Drew's backyard, the coffee shop, Nimbar's lair, and the school hallway but it amazed me how much they could accomplish with just four sets. Of course, the writers had to jump through hoops to make all the scenes fit into three sets (for example, I seriously doubt the mayor of Beverly Hills would have a press conference in the local coffee shop).Otherwise, I think it was no more or less cheesy than other shows like it. I feel like the stories are good - not great, but good. The acting was fine, actually a lot better than Power Rangers in my opinion. The stunt work wasn't amazing but it was watchable and they did it all from scratch as opposed to using footage from an entirely different show like Power Rangers. Yes, different actors were used in the fight scenes but it's not like the Power Rangers actors did their own fighting.My little brother was 12 years old at the time and I think this series was for people his age. It's super cheesy but it's not as bad as everyone thinks and I prefer it over watching Power Rangers.I still watch episodes of this show today. Good news for TTAFFBH fans. The DVD came out a few years ago so you can get your hands on it if you like.I know I sound like I'm bashing Power Rangers but it's an okay show too. It's just a good comparison since it's the most popular show of it's kind.","This is a Power Rangers rip off just barely, no Japanese TV show monster clips, I under stand this was supposed to happen but never materialized. Even if it had the clips could not have helped this show.First of all you have 4 supposed teenagers, I say supposed because the all look like they are 25 plus years old. They have little acting ability and could be easily replace by voiced over tongue depressors with a face drawn on them.Second you have a blob as an obvious replacement for the power rangers' Zordon, it obvious when the fake teenagers transform to their Alien Fighters Form they change people. It's so obvious it's not even funny. One of them even changes skin tone, she gets darker(Scorpio). They also become well muscled tone adults which none of them are supposed to be. The actors that portrayed the \"Alien Figther\" version are never credited and probably a good idea they aren't.It's unfortunate that THIS TV (in Sept 2011) started to air this abysmal show. Don't let your children watch this show.","rot_j","Orgazmo","SupaSmashBrotha","beverlyvista","Bad Ash","thefatheroftime","adamoconnell","iankenney-74574","Kimiakane","Ragnarok-5","donmccullen-1","reddragonhero17","n-stackhouse","BlazeFox","moriarty1972","watchtiger1","30 March 2003","20 March 2002","27 November 2004","16 June 2004","5 October 1999","7 October 2005","30 July 2010","12 December 2017","7 June 2006","7 June 2012","18 November 2002","28 May 2008","19 May 2006","3 September 2003","27 April 2017","26 September 2011","8","8","8","2","7","1"," Great if considered as parody. Quite horrid if taken at face value.\n"," Had to be seen to be believed\n"," I'm NOT Crazy after all!!!!\n"," Not as bad as you think\n"," An extremely crappy knock off of a crappy show\n"," This is classic garbage! Must see!\n"," Utter garbage...a must see!\n"," I literally only know it from Team Four Star\n"," More entertaining than most Americanized Sentai\n"," An exquisite series that deserves better treatment\n"," Ultraman meets Power Rangers meets Saved By The Bell?\n"," I like this much more than power rangers!\n"," This could only have happened in 1994\n"," Hurry up end end so I can watch Knight Rider!\n"," Just As Good/Bad As Everything Else Like It\n"," Bad Copy of Power Rangers\n"]}