{"review-url":["http://www.imdb.com/title/tt0121765/reviews"],"review-text":["The second episode of the new trilogy of \"Star Wars\" was much better than the first. He is much more gloomy, eventful and full of the sense that soon the customary world will collapse ... Moreover, it can be considered the most romantic film of the saga - speech, of course, about the love line of Anakin Skywalker and Padme Amidala performed by Natalie Portman. It is not only very well developed, but it also takes place mainly in very beautiful, blooming locations, which is generally uncommon for Star Wars. Even sad to realize that it is waiting for a tragic ending ...In all other respects, the \"Clone Attack\" can be considered a good film. Excellent battles on light swords, skirmishes, long conversations and flights on space ships - all this is done very qualitatively and interestingly. There are a lot of really unexpected plot twists, which will be appreciated not only by the fans of the universe, but by all the rest. For example, when a small dwarf Yoda takes a lightsaber in his hands and almost starts on an equal footing with the formidable Count Dooku, perhaps everyone was surprised ...However, in spite of this, the second episode can not be put on the same level as the classical trilogy. And it's not even the quality of performance, but the fact that those films evoked much more emotional response, they had the notorious \"Star Wars magic\", which is practically absent in the first two prequels.However, watching the \"Attack of the Clones\" is worth all fans of fiction - these films are shot too rarely.","Much like its predecessor, Star Wars - Episode II: Attack of the Clones has gained a rather sour reputation on the internet. Fortunately, many of the popular complaints about this film are either highly exaggerated or downright wrong. Chapter two of the Star Wars Saga is an energized and highly enjoyable two hours at the movies.Attack of the Clones follows Anakin Skywalker ten years after his exploits in The Phantom Menace. An older Anakin, played surprisingly well by Hayden Christiansen, is now training under the watchful eye of Ewan McGregor's Obi-Wan Kenobi. Searching the Internet, you won't find many fans who praise Christiansen's performance, but I found him to be very effective in the young, arrogant hotshot role he'd been given. McGregor does similarly well in the older brother, mentor role. I enjoyed Episode I a lot, but the story is much more focused this time, with major events happening for Anakin, and an actual political conflict engulfing the Republic. The two major story lines in the film are, one, the political underpinnings that eventually lead to the start of the infamous Clone Wars, and two, the personal story of Anakin Skywalker, including the romance between him and the former Queen, Padme Amidala. The first of these story lines is wildly interesting, following the two opposing forces of the Clone Wars, The Republic and their clone army, and the Seperatists and their droid battalion, as they prepare for an imminent war. After an assassination attempt on Senetor Amidala, Obi-Wan embarks on a detective mission to a track down the people behind the plot. The political espionage and behind-the-scenes dealings make for a fascinating and focused story. The other major storyline is not as focused, but still works as a chapter in Anakin Skywalker's overall story. Anakin and Padme's love story works as a throwback to the grand, old-fashioned film romances of the 1930s and 40s (think Gone With the Wind), but for contemporary audiences, the few extended scenes of corny \"love speech\" dialogue might be pretty drab. However, these aren't as distracting or offensive as some claim. In fact, a couple of them actually work well, such as the meadow picnic, where Padme and Anakin discuss the futility of politics in the beautiful fields of Naboo. The actors have chemistry, and both are likable, especially Natalie Portman as Padme. Yes the love story can be a bit forced, and sometimes drab, but it fits the feel of the saga. It is a grand, sweeping, throwback to Hollywood's golden age.If the love story might be hit or miss, it's the other facet of Anakin's character arc that Lucas gets absolutely right. Plagued by visions of his mother in pain, Anakin takes Padme to Tatooine where he tracks down his mother, only to see her die in his arms. His response is chilling and powerful. The scene between him and Padme in a garage after he brings his mom's body back is perfectly executed, unveiling a dark, angry side of Anakin, while simultaneously showing his frailty and confusion. It truly is one of the very best scenes in the saga.Even if you didn't find the story as interesting as I did, there is no question that Episode II is an audio/visual feast for the senses. Lucas and company introduce a stunning variety of sprawling landscapes, crazy creatures, fanciful vehicles, and formidable weapons. Once again, the sheer amount of imagination contained in this world is unbelievable. While Attack of the Clones does tend to favor CGI backgrounds and creatures too much, it still looks undeniably cool. The nighttime skyline of Coruscant, the rain-drenched clone facility on Kamino, the termite mound planet of Geonosis; They all, along with the creatures that inhabit them, feel real, and look great. On these beautiful planets, we are treated to tons of terrific Star Wars action. George Lucas once again revels in directing off-the-wall fun. This film is an adventure through and through. Set-pieces range from a one-on-one battle between bounty hunter Jango Fett and Obi- Wan on the rainy platforms of Kamino to a gladiator-like fight against intergalactic monsters. The last half hour of the film particularly impresses, with a massive battle between the two giant armies, dozens of Jedis, and a helping of fantastic war machines. The whole thing ends with an epic face-off that sees Yoda battle with mind and sword against Christopher Lee's devilishly evil Count Dooku, a memorable villain with an air of gravitas. He's a classic Hollywood archetype with a Star Wars spin; an elegant villain who just happens to have a lightsaber (with an awesome curved handle) and can shoot lightning from his hands.Needless to say, Attack of the Clones is much better than its reputation suggests. Complaints of poor story, too much politics, and \"fake\" looking CGI are almost completely unfounded, and the few moments of clichéd dialogue (the only complaint I can really understand) are such a small part of the film, that I barely notice them. However, for some reason that I honestly can't understand, it has become increasingly more \"uncool\" to like this film. Personally, I value energy and atmosphere in a blockbuster like this, and Episode II of the Star Wars Saga is packed with it. Attack of the Clones is a grand, sweeping, large-scale adventure. The story is mostly great, with only a few stretches that drag, and as with all the Star Wars movies (especially the prequels), the special effects and action are top notch. That is, after all, why you watch the Star Wars movies; to visit unknown worlds and have a ton of fun doing so. Star Wars - Episode II: Attack of the Clones isn't a world-class lesson in dialogue, but between the visual spectacle, first-rate action, and heavenly John Williams score, it is entertainment of the highest degree.86/100","It seems as though there is no way to dispel negative atmosphere once it has been started. George Lucas's STAR WARS trilogy was well-loved by audiences (even though critics were split) but for some reason (and I can't figure it out), the first entry in the prequels, THE PHANTOM MENACE, earned a HUGE onslaught of critically divided posts just about everywhere in the world, from the press to the internet to fans in real life. While I do agree that the original trilogy is a tough act to follow, I wasn't as grossly let down by this movie as some were.The same thing has happened to the second of the STAR WARS prequels, ATTACK OF THE CLONES, released in 2002. Many predicted that this movie would satisfy those who disliked Episode I with a vengeance, but alas, such was not the case. Once again, critics damned the movie for one reason or another, and the heated debate on whether Lucas \"trashed the original trilogy\" or not is still going on. I find it very sad that Lucas would still receive unfair critical attack, even after making a much darker, somber, and ominous movie in ATTACK OF THE CLONES. I'm guessing that such naysayers will continue to say nay to Lucas no matter what just like rabid fans of Anime would continue to slam-dunk dubs... even if a lot of them have recently proved to be excellent.This is not to say that ATTACK OF THE CLONES is a flawless film. It actually has its share of problems that THE PHANTOM MENACE didn't have. The dialogue, although nowhere nearly as bad as critics and some disgruntled fans say, lacks the spark of the original trilogy. My biggest gripe with the movie is that it moves at a leisurely pace, with lots of weak, unsatisfying sequences that last too long. Most of these scenes consist of a love subplot involving Anakin Skywalker and Amidala Padme. When not interacting with each other, Hayden Christensen and Natalie Portman are fine in their respective roles. (Christensen's monologue about his slaughtering of not only Tusken Raiders but--horrors!--women and children is frightening.) But there is a sense of awkwardness when they contribute to scenes which involve schmaltzy lines and screen kisses. I'm guessing that they both felt uncomfortable doing these scenes, hence why the chemistry between them isn't as interesting as, say, Han and Leia's from the original trilogy.Only when the movie is in action does ATTACK OF THE CLONES become worthwhile--there's a dizzying chase through Coruscant on floating cars, maneuvering through a dangerous asteroid field near a planet, and a half-hour long showdown that showcases a lot of amazing CG work. Actually, what also make Episode II worth watching are the fantastic set designs. Every location in the movie, from the metropolis skyscrapers of Coruscant to the water planet where prototypes of Stormtroopers are being constructed literally bursts with imagination and eye candy.Of the performers I liked Ewan McGregor (Obi-Wan) the best; his acting is still a little shaky at times, but here he seems more comfortable with the role. Christopher Lee makes a surprise appearance as the new villain, Count Dooku, and once again he delivers first-rate evil with this character. And it's great to see C-3PO and R2-D2 up to their usual banter again (although sometimes some gags occur when not necessary). Ultimately, however, the film belongs to Jedi Master Yoda, played to perfection by Frank Oz. His appearances in THE EMPIRE STRIKES BACK and RETURN OF THE JEDI featured him as a rubber puppet (and a delightful creation), but in this movie he really comes alive, thanks to first-rate CG effects. His mouth is perfectly in sync with every word he says, and the final showdown between him and Dooku is an absolute highlight.While ATTACK OF THE CLONES is, in some ways, a lesser entry in the STAR WARS franchise, its assets outweigh its weaknesses; most of the questions I had from the first episode seem to be addressed a little bit in this chapter, and, frustratingly enough, provides more questions for Episode III. Flawless or not, this is still a STAR WARS movie, and for what it is, it's still worth a look.","I happen to be one of the folks who really has enjoyed these films in the prequel trilogy.  I also can see why people would not like the films and I don't deny people the right to their opinion.  What has been bothering me has been some of the reasons people are giving for hating these new films... they are childish, they have too many special-effects, the acting is bad, the writing is bad, Lucas has sold out and has lost his touch... it makes me wonder if people are actually remembering the original trilogy correctly. Don't get me wrong, I love the original trilogy, but they weren't exactly well-acted or well-written movies.  We didn't love them because they were these great Shakespearian works of art; we loved them because we were little kids totally enraptured by this exciting fantastical world.  It seems that those same kids that loved the films 20 years ago have grown up into stuffy old yuppies that have no idea how to have fun anymore.  Our generation has grown up and it seems that we wanted Star Wars to grow up with us, to morph into some new R-rated grown up version to satisfy our more mature needs. Well, we didn't like the original trilogy because it was all grown up and serious.  We liked it because it was silly and fun and awesome to look at. I am personally glad that George Lucas did not make the prequels into a new grown up version.  I like the adventure and excitement and I challenge the one major complaint that says that they do not live up to the originals. Let's look at what people have complained about when comparing these to the original trilogy.-The new movies are too childish and geared towards kids: So, somehow we're supposed to believe that the droids, aliens, spaceships swamp monsters, and warriors with mystical powers from the original trilogy were of the more mature variety.-The new movies have too many special effects: We're forgetting that the original movies were also special effects laden.  Lucas has always pushed the limits of technology, even inventing new technology all the way.  He has not sold out or changed or just now relied on special effects, he has always concentrated on the effects.  If he had digital technology 20 years ago, he would have done the same thing then that he has now.  That's what he does; he makes up worlds that don't exist and then comes up with a way to put them on film.-The writing has been bad on the new films: Does anybody recall Lucas ever receiving a Pulitzer Prize?-The acting has been bad on the new films: Carrie Fisher???  Mark Hamill??? Harrison Ford???  We're not exactly talking about Academy Award winners here.  Name me one of the original main actors who was actually a great actor (other than Sir Alec).  Now, Harrison Ford has had a great career, but he's no Jack Nicholson.  And where are Carrie Fisher and Mark Hamill now?-Anakin is just a whiny little brat: Does anybody also remember how whiny Luke was in the first two movies?  I mean, he did nothing but whine and complain until Jedi.  And how many times did they say that Luke was just like his father?  Should anybody then be surprised that Anakin was a whiny adolescent?I think my point here is that people from my generation have taken something they loved as a kid and put it up on a pedestal so high that they are confused as to why they liked it.  They think the original movies were these serious Academy Award caliber pieces of art and that's why they liked them. In fact, we liked them because they were cool and had monsters and space battles and there were toys that we could play with and have fun.  The new movies are of the same mold as the original, they are unchanged.  WE have changed and we're having a hard time dealing with that fact.  Some would argue that these movies are not true Star Wars movies.  I say, they are exactly the same... that's why I love them.  If I want a serious film, I'll go find somethings starring Daniel Day-Lewis.  I like action and science fiction, so I'll stick to the childish, poorly acted stuff.","First off, don't blame the actors or the special effects. It's not their fault. Whenever someone knocks a bad movie, which Episode II qualifies as, they immediately raise the pitchforks towards the actors. If your going to lay some blame, lay it at the feet of George Lucas. It was his puerile script that brought the actors to their knees, and his lack of direction that made them stay there. It was George's unholy fascination with all things digital that massacred the screen with billions of wasted pixilated images, making the flesh and blood actors seem like they stepped into the Twilight Zone.This movie serves one purpose and one purpose only...to manually pleasure George Lucas' fanbase. The only things that seperate this wheelbarrow full of fertilizer from the average sci-fi schlock are the overinflated budget for Lucas' digital toys and the useless insertion of previous Star Wars characters.(SPOILERS ABOUND BELOW)The movie flows like a frozen sewage runoff. It goes from high speed, high altitude car chases, to boring, forced angst by the fireplace. To say that Christensen and Portman have no chemistry is to say that the Middle East might be facing some political problems. Their romance is about as believable as grass growing on the moon. Maybe they could have done better if the script hadn't been written with crayons.I thought these prequels were about Anakin's spiral downward from the path of balance into the Darkside. Is that ever going to happen or are we going to be forced to watch a third episode of video game previews for the Game Cube? We were given a lackluster hint with the slaughter of the Sand People but that barely cuts it. It wasn't even shown, thereby castrating the power of the scene. We just have to hear Anakin whine about it for about three seconds. Usually, when someone butchers a whole village of men, women, and children there's a whole lot more soul searching going on afterward. Of course, Lucas goes the pansy route and glosses over the whole thing. Most people I've talked to didn't even remember the scene until it was brought up to them.I'm probably one of the few people completely disgusted witht the Yoda fight at the end with the unimpressive Darth Sarumon (Lee plays the exact same character in LOTR: former wizard turned evil lackey=former jedi turned evil lackey). It's almost as if instead of a hand being up Yoda's posterior they've inserted a heroin suppository. Lucas has, in a brief half-minute, meaningless fight scene, destroyed the mystery of Yoda. The entire fight was unwarranted. If Yoda can raise ships from swamps and hold big chunks of pillar in the air, why can't he just pick up Count Poopoo and bang him against the wall a few times, soften him up a little, so to speak. Why? Because Lucas has toys he must abuse, that's why.The real star of this movie is the CGI. And CGI doesn't make good film. CGI is a support for a movie, that's it.There were far too many real world references, as well. Death sticks=cigarettes. Lame. Fifties diner in a galaxy far, far away, complete with sassy robo-waitress. Lame. This is supposed to be far removed from our world in the aforementioned galaxy far away. All I missed was the Fonz. Where the Hell was he? It might have been an improvement.In closing..Lucas needs to stop writing, directing and editing. Let a grown up handle these things. All that crap about these movies being for kids is a lark. These movies are for the nerds of the late seventies and early eighties who can't seem to move on in the world. The charm of Star Wars was gone before Lucas unveiled his uber-deluxe, special treatment of the films for the third time. And now he's doing it again. Maybe he'll go the Spielburg route and replace all the blasters with peace symbols.\nRating 1 out of 10. I'd rate it lower, but I was never good with fractions.","This episode of the Star wars saga was criticized by some when it came out for having wooden dialogue and too much digital landscaping to be any good. I wasn't overly impressed with it myself, but having seen all 6 films now, AOTC is actually a very important and well done section of the overall series.Lucas has said time and again that this movies are meant to be seen as one long film, not to be taken as 6 individual movies. This particular installment features so much that affects every other episode. The discovery of the clones, the immaturity and arrogance of Annakin, the beginning of the clone wars. All of these events happen in this one movie, which is actually a lot more than what happens in some of the other films. I don't consider this to be the best of all 6 by any means, but it is certainly not nearly as bad as some people make it out to be.","*WARNING MAY CONTAIN SPOILERS* If you remember, I was one of the few who did not hate The Phantom Menace, in fact, I gave it a positive rating. If you'd like to get a different opinion on the prequels, please be sure and check that review out as well, but now, let's talk about The Attack of The Clones. This movie has a few rough spots, Hayden Christensen and Natalie Portman don't have very good chemistry together, despite both of them giving decent performances in the rest of the movie. No, Hayden Christensen isn't that bad, he's a bit wooden, but I think he plays a believable confused young man who has been isolated all his life. In fact, I think that most of the hate surrounding Christensen is less about how he plays his role, and more about what role he's playing. People don't want Vader to be a bitter and over- reacting teenager, but in the scenes where Christensen is able to show who he'll become, he's great. Besides, this is all about how Anakin becomes Vader, he can't start out as Vader in Episode II. The movie also gets heat for other stuff, too boring, too much CGI, etc. The CGI effects look great, it makes it look like a more advanced culture, by having surroundings that we can't yet physically create. Now, maybe a few practical effects wouldn't have been amiss, but I think the use of CGI is a relatively minor complaint, and one that doesn't really effect the over-all quality of the film. The plot may be slow at times, but don't forget, we have lots of action in here as well. A full scale battle at the end, a high speed chase through Courscant, a duel between Obi-Wan and Jango Fett, etc. Yes there are slow stretches, but there are also plenty of scenes that are really fun. I know Yoda fighting with a light-saber, you know, a Jedi's weapon, is supposed to be just like heresy or something, but I can't take that complaint seriously. How else would Yoda have fought? With a stick? It's not like he doesn't use the force or anything! But enough with the negatives, let's talk about why this movie is genuinely good. Ewan McGregor as Obi-Wan is great! He brings the right level of sophistication and intelligence to the character, while still managing to seem like a less experienced version of the character in A New Hope. Jango Fett is a really good villain, he brings in great action and is just over all a really cool character. I already said I like Hayden Christensen, who I think accurately displays youth, and provides a relate-able character for everyone who's ever been a teenager ever. The action is top-notch as well. The speeder chase on Courscant is a great start to the movie; humor, good effects, and very fast-paced. The finale is very well done also, and it's a blast to see the first full scale battle in a Star Wars movie (the gungans don't count). The story, thought admittedly a bit muddled, is interesting enough (let's be honest, Star Wars isn't story based, it is driven by characters and action). I understand very few will agree with this review, but I wanted to give my own opinion on the Star Wars movies, so, I started reviewing them. I'll try to have my Revenge of the Sith review up soon!","I am a huge fan of Star Wars. I am also not the best critic, so I don't usually give things low ratings unless they really were bad. But I don't believe that Attack of the Clones was that terrible. Allow me to explain.I loved the original series. I think those movies were great. The Characters were amazing! The movies were action-packed and dramatic, yet hilarious too, and the action and comic moments didn't interfere! The Models looked so real, if you told me when I first saw it when I was 6 that they were CGI, I would have believed you! Everyone did their best. Han Solo, Luke Skywalker, Princess Leia, Darth Vader, etc. They were all so great!Now the new series is not nearly as good as the old series, but I believe that the prequel trilogy is SERIOUSLY underrated. They aren't as good as the old movies, but they are still amazing movies! It shows a new side of things. It brings something new to the plate. It shows how Anakin was able to turn from an innocent boy to the menacing Darth Vader. It showed how Palpatine set up the trap that destroyed the Republic and created the Empire. It dug deeper into what it meant to be a Jedi, and how we can be easily led astray if we let our guard down. It gives us 2 paths. The Path of Luke, and the Path of Anakin.Now that I have done some explaining, it's time to do what I wrote this review for. To review Attack of the Clones. I do agree it did have many flaws. I do agree that there was a lot of CGI in this movie. However, I do not think it was just to advertise its special effects. If you want a movie that does just that, go see \"2012\" or \"At World's End.\" This was one of the weaker movies, but it was still amazing.If you look closely, you see a lot of parallelism in the trilogies. \"Phantom Menace\" and \"A New Hope\" both introduced to us the characters. A major character has a major loss (Obi- Wan/Luke). The main character destroys the ship that is causing all the trouble (Anakin/Luke). The main character comes from humble origins (Anakin/Luke). The same thing happened in \"Revenge of the Sith\" and \"Return of the Jedi\" (my 2 favorites of the series). Except there are some opposites. Anakin and Luke choose different paths. But they each fight someone close to them (Obi-Wan the mentor/Darth Vader the father). Palpatine has set his plan in order. But the results are different (Destruction of the Republic/Destruction of the Empire). In one we see great sadness (Padme's funeral and Creation of Darth Vader) and in the other we see great joy (Celebrations throughout the galaxy). We also see parallelism in \"Attack of the Clones\" and \"Empire Strikes Back.\" We see the characters evolve from what they were in the first movie into what they will be in the third.In \"Attack of the Clones,\" we see many things. We see how Anakin struggles with the loss of his mother (Luke struggled for his friends who were in danger). We see how Palpatine sets up the plan that will slowly destroy the Republic. We see what started the Clone Wars, which Palpatine used to his advantage. We see the Jedi Order starting to crumble. It wasn't the best Star Wars, but it was still Star Wars.People criticize its flaws. They say that Anakin acts like a selfish brat. That is exactly what a young Darth Vader would be like! Anakin's anger got the best of him, and consumed him. We see that he has always struggled between good and evil (just as Luke did, on the Second Death Star). They say that there was too many special effects. I feel like the special effects didn't detract from the story. It's not like they animated all those battle scenes for no reason. They needed to show the intensity of the fight. The plot was a little confusing at first, and I feel it could've been better, but it was still better than other major series installments (such as Kingdom of the Crystal Skull).All in all, it wasn't as strong as the other Star Wars movies, but it was still Star Wars, and I thought it was amazing! 9/10, because it had some flaws.","This is a film that took three of the most beloved films of all time and sold their souls to CGI. The original Star Wars Trilogy were not labelled as the greatest films ever made because of Light Sabres, or Storm Troopers, or groundbreaking motion capture special effects, but because of the human side. The quality of the acting from Sir Alec Guinness, the chemistry between Harrison Ford and Carrie Fisher, the excellent dialogue that made every line a memorable quote and the context of faith and religion are what made them so everlasting. In this film Ewan McGregor's acting is surprisingly wooden for such a talented actor, Hayden Christensen has less chemistry with Natalie Portman than a 12 year old student's test tube, the dialogue is boring, the lines are cheesy and clichéd, there does not seem to be any actual emphasis on plot, it just being an excuse to glue one over-long action set piece to another, so the intrigue disappears fast and the themes and contexts are given a back seat to (admittedly impressive) CGI. It seems that George Lucas thought that what made a good film was as much soulless eye candy as possible.Star wars was once a trailblazer in Science fiction and its originality gave most of the future Blockbusters the templates for their scenes, and what was originally Star Wars innovation became cliché at the hands of other films. Now it is Star Wars using the same plot lines we have seen over and over again, copying others and Episodes 1, 2 and 3 in a lazy attempt to seem interesting.You do not need spectacle to create a good film you need drama and humanity both of which this film sorely lacks. In my opinion the best Light Sabre Fight of the series was the Showdown between Darth Vader and Obi-Wan Kenobi. The fight didn't have any flipping or flopping or any fancy kung-fu, but it did have the enormous tension of the concept of the final fight between Master and Pupil. That made for a great scene, and the elements of drama are completely void from this movie. This is a cheap CGI fest that misses the point entirely.","I'm going back and watching all six Star Wars films so I can go see \"The Force Awakens\", and last night I watched \"Episode II: Attack of the Clones\".I have to say that I find this to be a really enjoyable movie. I tried not to like it when it first came out due to its name. Seriously, George Lucas...\"Attack of the Clones\"? I mean, I get it, but there were lots of options for a better name than that. \"The Clone Army\" would have sufficed. But I digress...Again, I really like this movie. It suffers from a bit of poor dialogue and bad acting between Natalie Portman and Hayden Christensen--their on screen romance feels very much like a bad daytime soap opera rather than something worthy of the Star Wars franchise.And yet, that bit of dissatisfaction aside, I find this to be a fantastic film overall. The storyline is great. The opening chase scene is great. Obi-Wan's search for the missing planet is great. The final battle is great. Most all of it is great.And, one thing that I greatly appreciate about this film is Christopher Lee's performance as Count Dooku. Funny name aside, Lee turns out a convincing portrayal of a lead antagonist that makes you understand what the Dark Side is all about. I found Darth Maul to be rather lacking as a villain in \"Phantom Menace\", but Lee makes up for this in profound fashion.But I suppose the most important thing that I enjoy about this movie is that it just brings so many pieces of the puzzle together. Anakin's story advances in a way that is plausible and believable, even if Christensen's portrayal suffers at times. This movie sets up his path to the Dark Side in profound fashion, and makes the six films flow together. I like that sense of continuity, and so I'm giving this movie 8/10 stars. Again, the cheesy soap opera stuff between Anakin and Amidala is a major blow to the film--but all in all it's a great movie.Side Note: If I wanted to, I could get really critical about one element of the overall plot here. This whole Dark Side thing and the people involved in the plot to take over the Republic goes completely unnoticed by Yoda and Mace Windu (Samuel L. Jackson). That really cheapens the whole Jedi thing, in my view--the most powerful Jedi in the world are right in the midst of the people who are orchestrating the fall of the Republic, and they can't even sense it. Strange. Same goes for the fact that Dooku's back story is so wrapped up in the Jedi. How could they never sense this disturbance in the force in a way that would root it out?Whatever the case, that does bother me when I think critically about the film. But I try not to do that, but to instead watch it at face value and enjoy it for what it is, and on that merit I give it the 8/10 stars.","If you listen to some fans of the original Star Wars trilogy, the new one is crap. This is, I've found out, true only with the Phantom Menace, which was very poorly directed and edited piece of film.Attack of the Clones in the other hand is in comparison a superior achievement from PM. But it does contain couple of unnecessary segments, which drag the speed of the film down. And some of the acting is, even in the standard of the Star Wars, pretty horrible. But happily all those under achievers are not in any important roles and seasoned actors like Christopher Lee (Count Dooku) do deliver what you expect of them. others deserving nomination here are Samuel L. Jackson as Mace Windu and Ian McDiarmid as Palpatine.So, the plot. Obi Wan Kenobi (Ewan McGregor), and Anakin Skywalker (Hayden Christensen) are told to watch over senator Padame (Natalie Portman) because of assassination attempts towards her life. This soon leads in Obi in discovery of secretly manufactured clone army. Who is behind all this? Will Padame and Anakin fall in love? When does Anakin fall in to the dark side? Will he become a Jedi before all this? Some of these questions are partly answered in AOTC, but some are left waiting for the third installment of the new trilogy.But as said, this is much better film than Phantom Menace. It's not best film in the Star Wars saga, but in my opinion it does deliver. It's mostly fun to watch, action sequences are good, special effects are even better and despise some bad acting and some pretty horrible dialogs, it wasn't pain in the back side to watch.So, my advise: don't listen to roaring Star Wars fans who claim this movie to be one of the worst things ever and don't listen to those, who claim this one to be best thing since sliced bread.Attack of the Clones is above average, but not the greatest thing ever either.","Although I'm not a Star Wars fanatic (I certainly don't read the books or anything), I love the old Star Wars movies.  In fact, when I was littler, The Empire Strikes Back was my favorite film.  Now that I'm older, I respect them for what they are: incredibly creative, exciting and touching films. I have yet to see Episode 1. My friend recommended Episode 2 to me, telling me that it was better than its predecessor, but warning me \"don't see it if you expect anything more than a Star Wars movie.\" Maybe I just have a nostalgic love for the first trilogy, but I would never think that they were anywhere near as poor, in any way, as this new garbage. I can't think of a high budget movie that I've seen that has such bad directing, bad acting, bad casting, bad special effects (or lack thereof), bad music, bad dialogue and bad plot, as ATTACK OF THE CLONES (bad title too).  The reviewers on this site giving this movie positive reviews must all be brainwashed. Maybe they're all just excited that it's better than Episode One, which I can only assume must be the worst movie ever made, considering this one definitely belongs in the bottom 100.Let's begin with the directing. WHAT THE HELL DID GEORGE LUKAS TELL HIS ACTORS? My only guess that the conversations went something like this... LUKAS: Hey Sam, sit in that chair and say your line. S.JACKSON: How do you want me to deliver it? LUKAS: Don't worry about that.  It doesn't really matter.  All the animated creatures don't really show any emotion anyway.  In general, you should just say your line like you're reading it.  Oh, but if you're supposed to be angry or upset, just screw up your face a little bit.S.JACKSON: Okay. I guess...I can't begin to describe how boring the non-action sequences are in this film.  The actors aren't interacting at all.  It's astounding.Furthermore, talk about a classic example of bad acting, Ewan McGregor spends the entire movie doing a really bad impression of the actor who played Obi Wan in the original series...uuuugh, yuck. Whoever cast this movie needs to get their head examined.  I've always learned that one of the prime objectives in film, especially a drama, like this one, is to suspend the audience's disbelief (perhaps George Lukas was striving to suspend belief with this one).  How could anyone accept Samuel L. Jackson, one of the most prolific actors in Hollywood, as \"Mace Windu\" and Jimmy Smits, another instantly recognizable household name, as Senator \"Bail Organa\".  My God, Lukas could have at least picked actors who haven't reached idol status yet, but no, he had to make his budget LARGER.  The majority of people who liked this casting probably just liked seeing Sam Jackson meditating next to a poorly animated Yoda (SHAFT AND YODA TOGETHER IN THE SAME ROOM, MEDITATING LIKE BUDDHISTS! AWESOME!).The digital special effects were disappointing and not convincing.  I prefer people in elaborate costumes to the digitally animated, and amazingly generic looking, critters that Lukas used here.  You've seen 'em in the fifth element, in the trailer for men in black II (before the film started) and here they are again, a long time ago in a galaxy far far away.   Go figure. Furthermore, juxtaposing digitally composed fantasy settings/landscapes(as ridiculous as they are on their own), with a real, easily recognizable, famous swiss tourist attraction was appalling.The music as a whole sounded like a parody of the original score (in other words, it was fitting).  The dialogue was laughably atrocious.  Probably my favorite line *POSSIBLE SPOILER* was when Anakin (or little Ann(ie?,y?,e??) as the Senator calls him) tells the senator, \"I didn't just kill the men...but the WOMEN...and the CHILDREN TOO!\" \"Ooh am I a bad guy.  I'm such an evil dude that I use cliches to describe my horrible deeds.\" *NO MORE SPOILERS* The plot is so delightfully convoluted that thousands of viewers at home will be able to watch this movie in less than half it's running time when it comes out on VHS.  They can all simply fast-forward to the action sequences and not miss anything important in the film.  In fact they might as well fast-forward through the whole thing, given that the ending credits are by far the movie's finest sequence.I'm getting tired of writing, so I'll just say that there are so many problems with this movie that this review hasn't even nearly given it justice. PLEASE, DON'T DISMISS THIS REVIEW JUST BECAUSE IT'S NEGATIVE.  IF YOU HAVEN'T SEEN THE MOVIE YET, PLEASE, WAIT TILL COMES OUT ON VIDEO.  AT LEAST THEN YOU CAN GET THE PLEASURE OF TAKING THE TAPE OUT OF THE MACHINE AND SMASHING IT TO BITS IN FRUSTRATION.","Before seeing Attack of the clones I had seen neither the original star wars nor episode I and I didn't have any particularly strong ambitions to see them, I am a big cult fan but star wars just never really appealed to me.I happened to come across the episode II DVD going cheap while browsing in my local library and thought I might as well buy it. And to my slight amazement, I really loved it. Many fans complain that the new ones are nothing compared with the originals, having never seen the originals to compare it with I thought it was brilliant. The action, the adventure, the love story, the lightsabres, C-3PO. The chase through the city near the beginning was fast and furious and had great special effects, as did the scene when Obi-Wan first sees the clones. The arena scene is a particular favourite of mine as it flows so well passing from one piece of action to another with such ease. The fights were amazing (particularly Obi-Wan's and Jango's) and very well choreographed. The film made me laugh (which is something I almost always look for) just little lines like 'I retransmitted it to Coruscant, just as you'd requested, Master. Then we decided to come and rescue you.' [Obi-Wan looks at his handcuffed hands] 'Good job'. The whole thoroughness of it all just made me wonder about the sheer immensity of George Lucas's imagination and it made me realize why all those boys in my class used to make lightsabre noises. I admit that some of the Anakin/Padme dialogue was sickly sweet but being a typical teenage girl when it comes to love, I'm fine with that. Also overall the acting was slightly wooden but I admit that this did suit the Jedi style characters. Overall, it was my ideal film, action, adventure, romance, comedy and some nice epic not too drawn out battles. If this is bad compared to the originals, then I really should get round to seeing those originals.9/10","There used to be a time when Star Wars was the best thing since sliced bread. Of course I was about 7 then but nonetheless it was the ultimate for many people of my generation, and then we grew up but perhaps it is that I have grown up that I didn't enjoy this one wanting a film for adults. I entered the cinema expecting some good old fashioned galatic action despite the let down of the Phantom Menace but instead what I got was two hours of largely tedium.At base level all the ingredients were there but there was nothing else, this film was completely empty at heart. What the original movies had in charm, in script and in the endearing performance of their cast (even Mark Hamill pulled it off in the end) was largely lacking here. The two leads of Christensen and Portman cannot act to save their lives, sadly in this movie their lives were saved and we'll have to experience more of their slushy badly scripted romance in the third. They have all the physical chemistry onscreen of a couple of neutered dogs.The depth of their romance which is one of the central planks of the movie is comparable to an infants swimming pool, clearly George Lucas has been reading too much Mills and Boon and spent way too long on his special effects computers to remember just how humans work.The supporting cast headed by Macgregor are patchy too though Macgregor is head and shoulders above the two teenage leads and at times manage to act with some gusto. Much has been said about Christopher Lee and Samuel L Jackson but they are just playing themselves being competent enough actors to just turn up for work and perform regardless of what he director says. Compared to their past performances they are both underwhelming too.I've already mentioned the love aspect of the story, this was also supposed to be a dark plot with plenty of evil and of course Anakin turning to the dark-side. For what is supposed to be the defining moment of the entire series we get a whole three minutes of screentime where he kills people. As to get a PG rating the slaughter is glossed over and barely shown on camera it's left to the actor to communicate what happened but the evil growing in him is completely skirted around with a little bit of sobby stuff that simply isn't convincing - at no time do we see someone being corrupted by power which is really a lost opportunity.Lost opportunities is what this film is full of though, inside is a really good story struggling to get out but the issues are dumbed down to make them suitable for children to understand. The lack of invention in it is also stunning, why introduce Jango Fett at all except to cash in on the popularity of Boba Fett, why have Kenobi hide behind an asteroid like Han Solo does in Empire Strikes Back with a star destroyer? Why did we get those terrible C3PO puns and what was it with Yoda ever having a walking stick if he can fight like a whirling dervish on speed? Why does a changeling keep it's face and not get a new one then try to kill Kenobi.The only part of the script I did appreciate was the ever annoying Jar Jar being the cause of the rise of the Empire, ooh the irony. Script aside Star Wars has always been something of an effects movie but these days it's simply not impressive enough when compared to Lord of the Rings. The saturation of the colours throughout the film make it all look cartoony, and the CGI does look like CGI although it is much improved on the previous film with Yoda at last looking real. I imagine this is where the majority of the work went on the film but it's just not good enough. I do wish that Lucas would get back to the gritty colour tones used in the first two films, they certainly added to the realism but the Disney look seems to have infected the franchise too deeply.Not only are many of the effects lacking any believability but Lucas can't direct action, something that is a major flaw in a film that has perhaps half of it as action scenes. We get lasers zapping everywhere but there is no coherence with the editing and it all ends up a bit confusing with none of the excitement that should be there.The problem with editing recurs throughout the film with the love story intercut with the discovery of the clone army badly done, why do we keep coming back from an interesting story to one that just turns people off, something that was obvious in the cinema as you could hear people groan everytime the teenage lovers were on.The sound though is superb, watching at home on my Dolby 5:1 did make it a bit more of an experience but if you are relying on technical details to carry a film then you really shouldn't be making it to start with. Anyone can buy a decent sound engineer for a movie, and just be limited by budget but not anyone can get a good performance out of an actor, then the limit is talent.Let's face it that George Lucas is nothing more than a glorified technician being way past his limits is trading on the goodwill of fans from movies he did 25 years ago. He's no great director or writer and should leave that to others, perhaps then we can get the Star Wars movies that we all want, and perhaps he can come to rival the grosses of the old films again but I fear the magic will have gone by then. score - 4/10 for sentimental reasons.","I was 12 when i watched this and i wouldn't even believe that this movie was panned as the bad movie.For me it was almost life changing experience,because i had never seen movie like this,even though i had glimpse of original trilogy.Well i have grown up,i realized its strength and weaknesses but that didn't lead me to hate it.Pros of the movie are 1.Never seen before Django Fett and amazing concept of him raising his clone as son. 2.\"Death sticks\" scene that i think is as amazing as \"looking for droids\" scene. 3.Shmis death scene and Anakins reaction 4.Subtle foreshadowing of him becoming Darth Vader and actually meeting future adoptive parents of his son 5.Battle of Geonosis 6.Clones 7.How Palpatine gains power through political manipulations,this adds depth to the character's arc and also symbolizes how our world politics operates on this matter. Cons: Dialogue maybe cringe-worthy but for me it still works,and especially didn't have slightest negative impact on me when i was teenager?Who is target audience of this movie?12-15year old me or a film critic,that approaches this movie like some sort of art-house movie.its Star Wars universe where even in original trilogy almost everyone talks that way,why aren't they considered cheesy? Love-Story maybe considered as very rushed but i have theory why it worked.Anakin became attached to the first woman after his mom,when he was taken from her by Jedi.And It was Padme.Padme felt in love with Anakin,because it was the first time in her boring,aristocratic life someone came and expressed direct opinion towards her. You could say that Dialogues could have been executed much better,but Panning down this movie and hating on George Lucas is another extreme.\"I hate sand\"-is considered by prequel haters as a metaphor of this movie,it being cringe-worthy and awful but read it in contextPadme: \"We used to come here for school retreat. We would swim to that island every day. I love the water. We used to lie out on the sand and let the sun dry us and try to guess the names of the birds singing.\" Anakin: \"I don't like sand. It's coarse and rough and irritating and it gets everywhere.\" This line could have been delivered much better,but it still shows contrast between life of a Queen and a slave.And him being teenager just makes this line not only tolerable but acceptable. Movie could have been less faulty,executed better without loss of it's \"concept\" , but i still appreciate this as Star Wars movie and i thank George Lucas for it.","I gave this film 1 out of 10 because it is honestly one of the worst films I have ever seen. *****SPOILERS***** The log-fire scene where Anakin Skywalker woodenly tells Natalie Portman about his intense \"pain\" and \"suffering\" was fortunately drowned out by the sound of the entire audience failing to suppress their giggles and guffaws. We know how you feel, Anakin. Am I the only one who thought this was actually worse than the Phantom Menace? I don't remember anything about the plot of that film but I remember feeling mildly entertained. This was just plain boring. From the high-speed chase in the city to the weird tall thin aliens to the political assassination attempt it all felt like a TV spin-off of the Fifth Element without the famous actors, the beautiful models, the slick direction, the humour, the dialogue or the fun. The waterfalls in the background on Naboo looked like the tongue-in-cheek idyllic backdrop on a Kraftwerk CD. The gladiatorial scene was straight out of your first Dungeons & Dragons game. The big battle at the end was SO BORING people were leaving their seats and returning ten minutes later... they'd probably gone outside for a cigarette. The acting and the dialogue would, by and large, not have passed muster on a Mexican soap opera; the most interesting part of Natalie Portman's performance was the surprise appearance of her nipples. On the plus side: Yoda drew some genuine laughs with his \"kung fu\" stance, although high-speed Yoda was a bit too fanciful for my liking. Ewan McGregor's effort was good considering the material, and his fight with Jango Fett should put him in the running for a role as 007. But what this franchise really needs to do is bring back Harrison Ford... perhaps Han Solo was a clone?","Say what you will about George Lucas, you have to give the guy credit for setting himself a difficult task in `Star Wars: Attack of the Clones' (and I do mean beyond trying to deliver a film that will meet the almost impossibly high expectations of his millions of fanatical followers).   By choosing to place Anakin Skywalker front and center as the story's main focal point, Lucas does what few others in this business are willing to do  which is to risk making a crowd-pleasing epic without a likable central `hero.'  After all, since this film is a prequel and not a sequel to the original trilogy, we all know that this brooding young man will end up turning into the irredeemably evil Darth Vader.  Of course, Luke Skywalker fulfilled the requirements of conventional hero for the original series and even Han Solo, though he was a bit of a rogue and a scoundrel, always allowed his virtuous side to break through when the chips were down.  Anakin, though, for all his internal struggles in this film, is predestined to go over to the Dark Side (certainly in the next installment).  The pre-knowledge the audience is privy to from our acquaintance with the later chapters gives the film a kind of poignant sadness at times - or at least it would if Lucas had done a better job as both writer and director in bringing it out.  Unfortunately, the dialogue is so poorly written that Anakin comes across as little more than a petulant, peevish, moony-eyed schoolboy most of the time  hardly either the `greatest Jedi knight' we keep being told he has the potential to become nor the future Hitlerian dictator we know he will one day be.   His romantic, puppy-love interludes with Senator (former Queen) Padme Amidala are embarrassing at best.  We have indeed come a long way from the fun love triangle involving Luke, Han and the feisty Princess Leia.In fact, that seems to be the basic trouble with this film, as it was with the previous installment, `The Phantom Menace.'  Somewhere along the way, someone drained all the FUN out of `Star Wars.'  The first three films seemed so fresh, so adroit, so light on their feet.  The prequels, though they are not without interest, feel bloated, top heavy and devoid of any real conviction or excitement.  One cannot fault Lucas, I guess, for becoming overly fascinated with his matted backgrounds, computer graphics and special effects, but it does no one any good to have all that hardware whirling by in the background when the action in the foreground is so banal and uninteresting.  Even the set pieces here  a flying car chase through a crowded city that defies all known laws of physics, a cluttered battle scene that takes place in a gladiatorial stadium  don't get the adrenalin pumping in the same way that the space battles in the original `Star Wars,' the race through the forest in `Return of the Jedi' or even the pod race in `The Phantom Menace' did.  And I will reiterate a comment I made three years ago about that last film.  Why is it that, in a movie with `Star Wars' in its title, are there virtually no outer space battle scenes in this picture?  Is that really too much to ask?A few other problems plague the picture.  R2D2 and C-3PO, whose one-sided bantering lent such charm to the original films, have become virtual extras in the story by this time.  And since the rest of the script is so entirely witless, the few moments they have together stick out too much as obvious (and not very effective) attempts at comic relief.  No longer do these two uniquely nonhuman characters feel like an integral part of the action.  Even worse, the once endearing Yoda, with his annoyingly inverted sentences and his never-ending string of sanctimonious pearls of wisdom, has, quite literally, become this movie's Jar-Jar Binks (who does appear but in a much more limited role).  The acting by Hayden Christensen (Anakin), Natalie Portman , Samuel L. Jackson and Ewan McGregor (a young Obi-Wan Kenobi, and who is going to believe that McGregor will mature to become the distinguished Alec Guiness?) is serviceable at best, as the performers have been put there basically to deliver the stilted dialogue and serve as foreground for the upstaging special effects.So, after all these complaints, is `Attack of the Clones' worth seeing? Surprisingly, the answer is `yes' and it really has nothing to do with the special effects.   The reason this film is worth seeing is because Lucas has undertaken to pull off something virtually unique and unprecedented in modern cinema.  He is attempting to tell a complete story over the span of six different movies.  Even when we can see how the film isn't coming together the way it should, we can't help but plug into the narrative development itself.  Because we know how it will all end up, we want to see how the missing pieces of the puzzle will fall in to place to give us the complete, total picture.   So even if each individual installment doesn't exactly carry us away, there's enough interest in the vision itself to keep us coming back for more.","Unfortunately, I had ruined this movie for myself long before seeing it. Bored one summer, I started looking up a lot of \"spoiler\" information. Thus, I was worried that regardless of how of the film was, I would not be very impressed simply because it would be nothing surprising... ...but whoa, was I so unmistakably wrong! I have never been left speechless by a film, ever. In fact, I figured that people saying that were simply being dramatic. However, I was, in fact, speechless for about 20 minutes after leaving the theatre. George Lucas has truly outdone himself.Attack of the Clones is the most emotionally complex Star Wars film Lucas has made. Its tone is not simply good vs. evil, like episodes IV-VI. Instead, it is good people and a good government becoming evil. Of course, this is embodied by the central figure in these films, Anakin Skywalker, played by Hayden Christensen, who, though somewhat awkward at times, gives an overall good performance (he's brilliant in Anakin's break-down scene). Natalie Portman returns with a solid performance, and the love story between Anakin and Padme is, for the most part, charming. The dialogue becomes a bit too much in one scene, but hey who's the more foolish: the screenwriter, or the person who goes to a Star Wars film expecting anything less than corny dialogue? Ewan McGregor, delivering the best performance in the film, is superb as Obi-Wan Kenobi! He is the consummate Jedi, the serious, straight-arrow center of the film. However, what makes the performance so excellent is the manner in which, through this stern exterior, he can be so perfectly comical. Most of the laughs in the film come from his witty one-liners.This film sports a strong supporting cast. The two Sith lords, Palpatine (Ian McDiarmid) and Count Dooku (Christopher Lee) provide much of the film's intrigue. These two are the puppet masters behind all the events of the film, with Palpatine serving as the supreme mastermind, as he did in Phantom Menace. However, the interesting nuance in Clones is that we see these two Sith lords attempting to betray each other! If any film demonstrates that being on the Dark Side is an uncomfortable position, it is this one. In Palpatine's scene with Anakin, and Obi-Wan's scene with Dooku, we see each of them attempting to find a new ally, each hoping that, though in league with the other at the time, he will eventually overthrow him. It is this brand of intrigue that makes this film, and the prequel trilogy in general, a richer, more fascinating story line.Yoda (Frank Oz) and Mace Windu (Samuel L. Jackson) lead the Jedi entourage. They emerge as the generals in the film, the heroes who save the day. Jackson lends his usual \"coolness\" to Windu, making his action scenes all the more enjoyable. But Yoda is the real showstopper. We've loved Yoda since Empire Strikes Back, but in this film, he's in his prime. He is stern yet funny, as lovable as ever. He steals the show, though, as Yoda the action hero. His light saber battle, the film's climax, will have you cheering, a brilliant achievement of which Industrial Light & Magic should be proud.Another notable aspect of this film is that Lucas seems to have become much more creative as a director. His visuals in this film, especially the rain planet Kamino, are beautiful as always, but it's his camera-work that is noticeable different in this film. As Steven Spielberg noted, Lucas does his best directing in this one. He captures the proper emotions of each scene, each close-up occurring at just the right time. Most interesting, though, is Lucas's \"artsy\" camera-work, which shines a bit in this film. There's an interesting scene in which he plays with the shadows of Anakin and Padme on Tatooine. Another scene between the two, a romantic shot of them silhouetted while moving into a sun-drenched arena to which the camera pans, is fairly breathtaking (thanks in part as well to the swell in John Williams's love theme). My favorite of these scenes, though, is the light saber battle between Anakin and Dooku. It's unlike any light saber battle ever seen in a Star Wars film. The two characters appear to be blending into one another, their faces illuminated by only by their light saber blades, the blue and red flashing across each of their faces. Perhaps this is George's way of linking these two characters, the Jedi fallen to the Dark Side (Dooku) and the one who will soon take his place (Anakin). Brilliant moment, brilliant.Thus, my hat's off to Lucas and company for this film. I love the others, all of them, but this one truly stands out. It is massive, emotionally and visually, and altogether satisfying.","Like so many others I hoped and prayed that Episode 2 would turn out to be an improvement over the awful Episode 1 \"The Phantom Menace\" but it turned out to be just as bad.  About an hour into the movie I was already looking at my watch, hardly believing what I was seeing.As it was with The Phantom Menace, there were no interesting characters to speak of and those that did show promise were never given the chance to truly shine, and a movie where you don't care what happens to the characters can never be very exciting.So much of the movie was in C.G.I that it left me wondering why they bothered to have live actors in it, but as with The Phantom Menace, the Special effects are the star and apparently the only thing that mattered to the film makers, since the storytelling is this bad.  Too many action sequences seemed to be just thrown in because they might look good in a computer game (which I'm sure will be coming out) and far too many stupid one-liners which had me shaking my head, thinking \"My God, Star Wars has been turned into an Austin Powers movie\" .... Silly one-liners work for Austin Powers but NOT for Star Wars.Still, it should have been possible for George Lucas to make an entertaining movie using just special effects and a lot of brainless action, but no, he could not even manage that.  A screenplay without characters to care for, and even though the story (as we all know from Episodes IV-VI) is a good one, the screenplay is just TOO awful to make an entertaining 143 minute movie with the first hour being mainly an unbelievable love story.This movie, as stated before, is about two and a half hours long, but it feels a lot longer, and it left me with the feeling that I had been watching somebody playing a computer game for two and a half hours.Unbelievably this movie was worse than a waste of money, it was a waste of time, and I for one will not be wasting time or money on Episode III, no matter how much I love Episodes IV-VI.","Ten years after the invasion of Naboo, the Galactic Republic is facing a Separatist movement and the former queen and now Senator Padmé Amidala (Natalie Portman) travels to Coruscant to vote on a project to create an army to help the Jedi to protect the Republic. On the arrival, she escapes from an attempt to kill her and Obi-Wan Kenobi (Ewan McGregor) and his Padawan Anakin Skywalker (Hayden Christensen) are assigned to protect her. They chase the shape-shifter Zam Wessell (Leeanna Walsman) but she is killed by a poisoned dart before revealing the identity of who hired her. The Jedi Council assigns Obi-Wan Kenobi to discover the bounty hunter that has tried to kill Amidala and Anakin to protect her in Naboo. Obi-Wan discovers that the dart is from the planet Karmino and he heads to the remote planet. He finds an army of clones that has been under production for years for the Republic and that the bounty hunter Jango Fett (Temuera Morrison) was the matrix for the clones. Meanwhile Anakin and Amidala fall in love with each other and he has nightmares with his mother. They travel to his planet Tattoine to see his mother and he discovers that she has been abducted by the evil Tusken Raiders. Anakin finds his mother dying and he kills all the Tusken tribe including the women. Obi-Wan follows Jango Fett to the planet Geonosis where he finds who is behind the Separatist movement. He transmit his discoveries to Anakin since he cannot reach the Jedi Council. Who is the leader of the Separatist movement? Will Anakin receive Obi-Wan's message? And the secret love between Anakin and Amidala will succeed?\"Star Wars: Episode II - Attack of the Clones\" is the second chapter of the saga with great action, but also a boring romance. The action scenes are breathless, with many battles. The romance between Anakin Skywalker and Padmé Amidala is annoying in many parts and weird since Amidala was a queen when Anakin was a nine year-old boy. Christopher Lee, the favorite villain of many films, is perfect as usual. My vote is eight.Title (Brazil): \"Star Wars: Episódio II - Ataque dos Clones\" (\"Star Wars: Episode II - Attack of the Clones\")Note: The last time I saw this film was on 17 December 2002.","That's pretty much the general sentiment about the Episode II, but I would have to disagree because that would imply that The Phantom Menace was any good.  A better assessment might be that Attack of the Clone was no worse. It's basically a bunch of long drawn out sequences involving indiscernible politics (except, perhaps, to the fanatics)  and a painfully forced romance, plus another annoying scene involving a fat, four-armed alien in a diner, punctuated by a string of action sequences that just barely save this film from being a total waste of $9.25.But one other thing that kind of spoils Star Wars for me is that Boba Fett is given an origin.  I don't know about anyone else but I thought the one thing that was cool about Fett was that he was just this bounty hunter sent by Jabba the Hutt to capture Han Solo.  Period.  He didn't seem to have to do anything with the Jedi; he only entered the picture because of Solo.  He was a character that seemed to exist apart from the whole Jedi storyline and simply was doing a job for a powerful gangster.  That made the Star Wars mythos richer for me, the idea that the Jedi storyline wasn't the only thing going on in the universe.  Now ATotC has gone and entwined his story with that of the Jedi and it suddenly all seems less plausible.  Now, presumably, Boba Fett will exact his revenge by killing some Jedi or some such but then what?  In eps IV-VI, we see him as *just* a bounty hunter and, considering the import attached to him in ep II, his death in ep VI (falling into a living pit) comes across as anti-climactic.  Just my impression...","The fundamental flaws in Star Wars: Episode II - Attack of the Clones are pretty much summed up in a single scene in this film. Anakin Skywalker and Padme Amidala are sitting at a dinner table (?), and decide to share a piece of fruit. And during this entire scene, the piece of fruit is completely computer generated, and it shows. It's horribly obvious when Anakin slices it in half, and becomes downright inexcusable when Padme takes a bite of it. We can see the actors are just miming the motions. God has killed a kitten because of this.That piece of fruit symbolizes everything unholy about this film.\nIt symbolizes the hollow acting Lucas deliberately set out to draw from each performer. We have talented actors here, we know they can do better than this because we've seen them do better than this. Well, except Hayden Christensen. A friend's mother really gave an accurate assessment of him when she said that he was really good at what he did: going berserk and then crying about it later. \"I don't wanna fight.\" His performance was as forced as everything else in the film.The script? Don't even get me started. People who defend this film from its detractors as saying \"Star Wars never had good dialogue, that's not the point\" are certainly semi-justified, but what they aren't realizing is that there was at least a small standard of quality in the first trilogy. There's a reason The Empire Strikes Back is actually considered a good film. No, the dialogue and acting were never really that great, but they were tolerable, and light years ahead of this dreck. Every plot development seems forced, every line cliche. The worst part is that this is even a step backward from Episode I, and is liberally sprinkled with painful one-liners that are supposed to be witty exchanges. Folks, when I want one-liners, I'll watch Army of Darkness. If this is going to be a serious film, they need to take a hiatus.Perhaps the piece of fruit is most symbolic of the film overall in that the film, like the fruit, looks beautiful but somehow horribly false and impossible to believe (the CG looks like a step DOWN from Phantom Menace, I swear), and is ultimately nothing but air. It's hollow, there's no substance here. The sense of fun present in the original trilogy, and even a little in Phantom Menace, is totally gone. It looks and feels like it was a chore for everyone involved to make, including Lucas himself.I suspect Star Wars fans will finally wake up to this one like they did to Episode I and it will plummet off the top 250 here. The reality of it is that the only true Star Wars films are the original trilogy, and this senseless new trilogy will probably ultimately be disowned like Alien 3, RoboCop 3, Halloween III (noticing a pattern?), and other poor sequels. ...all in a piece of fruit.","I was extremely excited about seeing Episode II, especially since Lucas promised a \"dark\" episode reminiscent of Empire.  Wow, I thought, we could really use a dark episode.  Since Jedi and Phantom Menace were clearly aimed more towards children (in my opinion) rather than the original Star Wars faithful, both had warm and fuzzy endings (and in some cases, characters too).  Well, \"dark\" wouldn't be an adjective that I would use to describe this movie at all.  How about \"hardly dingy\" instead?  I mean, the bad guys just weren't very bad.  I may be mistaken, but I only remember seeing Darth Sidius in costume one time.  If he did appear twice, he obviously didn't leave much of an impression on me, which only proves my point.  Now come on, EVERYONE remembers all of Darth Vader's and Darth Maul's scenes, right? To me, Darth Tyranus actually comes off as a decent guy for most of the movie.\nIt seems that Lucas is more interested in showing off a lot of special effects rather than telling a compelling story.  There just wasn't much material in the script for the actors to be passionate or excited about. Kenobi has a nice civilized conversation with Jango Fett.  Anakin has a calm chat with Palpatine.  Kenobi has an even keeled conversation with Tyranus. Where's the passion and hate?  Where's the fire?  Where's the dark side George?  Since we all know how it's going to ultimately end, I was really expecting some heated emotions in this movie.  You know, Anakin's struggle and all?  I didn't feel a lot of that at all.As an aside, I really noticed a lot of dull filler scenes.  Is it really necessary to show everyone getting on and off transport ships?  I, for one, am willing to make a leap of faith here and take for granted that characters in this universe can get from point A to point B.  If you see them in the next scene on a different planet, I guess they made it.  Right?  Picture this:  The ship pulls up, picks up the passengers and takes off.  It then lands, and the passengers get off.  Sound exciting to you?  If the movie was cut back about 10-15 minutes, I think it would have helped to pick up the overall pace and flow of things.Overall, I think I was disappointed mainly because my expectations were so high.  Hopefully, I just lowered yours and you can enjoy the movie for what it is, rather than for what it is not.","Can you follow moving objects with your eyes? If that's all it takes to thrill you, then watching \"Attack of the Clones\" may well be the most titillating experience of your life! The barrage of mobile things on the screen just doesn't cease. There's even something here for the audio buffs...plenty of those signature rumbling ships, whizzing lasers, and humming lightsabers. Pair up those noises with the visuals, and you have a summer blockbuster!George Lucas is back, all right...with the second worthless Star Wars movie in a row. I can't understand the ridiculously effusive praise that the majority of reviewers here seem to be heaping upon this stinker. I can only hope that most of the people who hated it felt no inclination to review it at all. I especially love the masterminds who proclaim, \"If you don't like it, don't go see it.\" Yeah, thanks. So we're supposed to walk into the theater with a pre-formed positive opinion? Morons!If I plunk down $10 for a widget that I soon discover doesn't work, am I not entitled to get a refund or at least a replacement? Of course! Warranties and the Better Business Bureau were created for precisely this purpose! Well, I paid money to see Episode II, and I was extremely disappointed. So why is it that I'm somehow not entitled to criticize Lucas?George Lucas is just plain lazy...a lazy director and a lazy storyteller. And audiences are lazy for letting him off the hook so easily. Incidentally, Lucas himself deserves absolutely no credit for the \"incredible\" CGI. His studio paid other people to do that. You will probably never know their names. And I'm positive that Lucas is profiting far more from this venture than all of them combined.Look, Lucas has countless millions at his disposal. He damn well should shoot for an Oscar-caliber film! Or maybe he's just too afraid of the challenge, so he rests on his laurels and hides behind the brand-name of this movie franchise. And when the critics come out of the woodwork, he can babble on about how it's \"not supposed to be great filmmaking\" or some other lame excuse. Lazy, lazy, lazy.A few others here have panned the lifeless acting, glaring plot inconsistencies, and general lack of true Star Wars atmosphere more eloquently than I could, so feel free to comb through the effluvium of laudation below to find the few precious gems of honest criticism.Never mind the absurd Yoda fight scene, which will only appeal to those who can't let well enough alone and who demand that every movie character be proficient in some martial art. Why, why, why must every big budget sci-fi or action movie nowadays give a nod to \"The Matrix\"? Can't Yoda just remain a gentle, wizened teacher?The only thing I really liked about this movie was the Tusken Raider encampment. It wasn't overdone or garish, just very Star-Wars-ian. Of course, it was quickly ruined by Schmi's hilarious death scene. In reference to Anakin, a little boy sitting behind me in the theater said, without a trace of irony, \"What's he so sad about?\" From the mouths of babes!","George Lucas has finally done it. He has made a movie for the fans. This ranks as high as my favorite Empire Strikes Back in someways better. I love the themes, the music the plot. A very eree parallel to the same series of events and similar circumstances Luke went through however Anakin is having it a lot worse than Luke did in my opinion. This new kid Hayden Christensen was perfect for Anakin. He played a very convincing person I could forsee becoming Darth Vader. He better be in Episode 3. And Natalie Portman, she gets more and more beautiful in every movie. Ewan McGregor is the best Obi Wan Kenobi. I hope that the actor playing Jango returns as Boba Fett (with some growth acceleration) for Episode 3. This movie was such an excellent parallel to Empire Strikes Back. Episode 1 paralleled A New Hope, kind of their own establishing movies that weren't that in depth. You know they are going to parallel Episode 3 with Return of the Jedi, I forsee Anakin fighting and slaying Dooku taking his place at Palpatine's side.Nice Job George! This film was fantastic. I hope he keeps the momentum and story ties in Episode 3, they have alot of story to cover. A+"],"review-user":["BiiivAL","jaredpahl","JTurner82","sixpack-3","bigstonemonkey","lawnboy1977","danielloe","Gelatart","The_Crow666","caseynicholson","tomimt","andrfenlon","beccaj_ilh","gothicform","talantgio","deckford","Buddy-51","kentacarter","Wobler","claudio_carvalho","paulo20","Caustic Pulp","rkurtz-1","all_other_things_being_equal","tp13fox"],"review-date":["4 June 2018","2 December 2015","20 May 2005","26 March 2003","6 July 2002","28 November 2005","19 June 2015","14 July 2010","3 June 2005","26 December 2015","22 February 2005","16 June 2002","17 November 2004","23 November 2002","10 January 2016","17 May 2002","12 June 2002","26 May 2002","14 June 2002","11 December 2015","8 July 2002","31 May 2002","16 May 2002","2 June 2002","30 May 2002"],"review-rating":["8","9","5","10","1","8","7","7","1","8","7","1","10","4","8","1","10","1","8","1","1","1","1","10"],"review-title":[" The most romantic episode of \"Star Wars\"\n"," Underrated Star Wars Adventure, Full of Intrigue, Drama, and Jaw-Dropping Fun\n"," \"Begun, the Clone War has....\"\n"," I loved it and I think it's getting too much criticism\n"," Movie for the fans (and no one else)\n"," Looking back this episode is much better\n"," Slow at times, but the story and action make up for the flaws\n"," Attack of the Clones: Not as bad as people make it out to be\n"," An insult to the great original Star Wars Trilogy.\n"," A Terrific Addition to the Franchise\n"," Mostly entertaining\n"," Attack of the Crap\n"," Better than I expected\n"," The Magic is Gone\n"," In defense of the movie\n"," Attack on the Clones\n"," not up to par but worth seeing\n"," An emotionally complex and visually stunning film.\n"," A 140 minute computer game.\n"," Great Action, Boring Romance\n"," \"Well...it was better than Phantom Menace...\"\n"," All in a piece of fruit.\n"," Very disappointed. Not a lot of story here...\n"," Great Big Steaming Pile of Dooku\n"," Fan Film\n"]}