{"primary":["Pulp Fiction (1994)","https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UY1200_CR97,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0110912/reviews","tt0110912"],"secondary":["One of the early scenes in \"Pulp Fiction\" features two hit-men discussing what a Big Mac is called in other countries. Their dialogue is witty and entertaining, and it's also disarming, because it makes these two thugs seem all too normal. If you didn't know better, you might assume these were regular guys having chit-chat on their way to work. Other than the comic payoff at the end of the scene, in which they use parts of this conversation to taunt their victims, their talk has no relevance to anything in the film, or to anything else, for that matter. Yet without such scenes, \"Pulp Fiction\" wouldn't be \"Pulp Fiction.\" I get the sense that Tarantino put into the film whatever struck his fancy, and somehow the final product is not only coherent but wonderfully textured.It's no wonder that fans spend so much time debating what was in the suitcase, reading far more into the story than Tarantino probably intended. The film is so intricately structured, with so many astonishing details, many of which you won't pick up on the first viewing, that it seems to cry out for some deeper explanation. But there is no deeper explanation. \"Pulp Fiction,\" is, as the title indicates, purely an exercise in technique and style, albeit a brilliant and layered one. Containing numerous references to other films, it is like a great work of abstract art, or \"art about art.\" It has all the characteristics we associate with great movies: fine writing, first-rate acting, unforgettable characters, and one of the most well-constructed narratives I've ever seen in a film. But to what end? The self-contained story does not seem to have bearing on anything but itself.The movie becomes a bit easier to understand once you realize that it's essentially a black comedy dressed up as a crime drama. Each of the three main story threads begins with a situation that could easily form the subplot of any standard gangster movie. But something always goes wrong, some small unexpected accident that causes the whole situation to come tumbling down, leading the increasingly desperate characters to absurd measures. Tarantino's originality stems from his ability to focus on small details and follow them where they lead, even if they move the story away from conventional plot developments.Perhaps no screenplay has ever found a better use for digressions. Indeed, the whole film seems to consist of digressions. No character ever says anything in a simple, straightforward manner. Jules could have simply told Yolanda, \"Be cool and no one's going to get hurt,\" which is just the type of line you'd find in a generic, run-of-the-mill action flick. Instead, he goes off on a tangent about what Fonzie is like. Tarantino savors every word of his characters, finding a potential wisecrack in every statement and infusing the dialogue with clever pop culture references. But the lines aren't just witty; they are full of intelligent observations about human behavior. Think of Mia's statement to Vincent, \"That's when you know you've found somebody special: when you can just shut the f--- up for a minute and comfortably enjoy the silence.\"What is the movie's purpose exactly? I'm not sure, but it does deal a lot with the theme of power. Marsellus is the sort of character who looms over the entire film while being invisible most of the time. The whole point of the big date sequence, which happens to be my favorite section of the film, is the power that Marsellus has over his men without even being present. This power is what gets Vincent to act in ways you would not ordinarily expect from a dumb, stoned gangster faced with an attractive woman whose husband has gone away. The power theme also helps explain one of the more controversial aspects of the film, its liberal use of the N-word. In this film, the word isn't just used as an epithet to describe blacks: Jules, for instance, at one point applies the term to Vincent. It has more to do with power than with race. The powerful characters utter the word to express their dominance over weaker characters. Most of these gangsters are not racist in practice. Indeed, they are intermingled racially, and have achieved a level of equality that surpasses the habits of many law-abiding citizens in our society. They resort to racial epithets because it's a patter that establishes their separateness from the non-criminal world.There's a nice moral progression to the stories. We presume that Vincent hesitates to sleep with Mia out of fear rather than loyalty. Later, Butch's act of heroism could be motivated by honor, but we're never sure. The film ends, however, with Jules making a clear moral choice. Thus, the movie seems to be exploring whether violent outlaws can act other than for self-preservation.Still, it's hard to find much of a larger meaning tying together these eccentric set of stories. None of the stories are really \"about\" anything. They certainly are not about hit-men pontificating about burgers. Nor is the film really a satire or a farce, although it contains elements of both. At times, it feels like a tale that didn't need to be told, but for whatever reason this movie tells it and does a better job than most films of its kind, or of any other kind.","To put this in context, I am 34 years old and I have to say that this is the best film I have seen without doubt and I don't expect it will be beaten as far as I am concerned. Obviously times move on, and I acknowledge that due to its violence and one particularly uncomfortable scene this film is not for everyone, but I still remember watching it for the first time, and it blew me away. Anyone who watches it now has to remember that it actually changed the history of cinema. In context- it followed a decade or more of action films that always ended with a chase sequence where the hero saved the day - you could have written those films yourself. Pulp had you gripped and credited the audience with intelligence. There is not a line of wasted dialogue and the movie incorporates a number of complexities that are not immediately obvious. It also resurrected the career of Grease icon John Travolta and highlighted the acting talent of Samuel L Jackson. There are many films now that are edited out of sequence and have multiple plots etc but this is the one they all want to be, or all want to beat, but never will.","I can only speak for myself, but I had never seen anything as stylish, cleverly constructed, well written and electrifying as this milestone when I first saw it in 1994. What really pulled me in right from the start is what we've now come to know as a Tarantino trademark: the dialogue. When gangsters Jules and Vincent talk to each other (or all the other characters, for that matter) there is a natural flow, a sense of realism and yet something slightly over the top and very theatrical about their lines – it's a mixture that immediately grabs your attention (even if it's just two dudes talking about what kind of hamburger they prefer, or contemplating the value of a foot-massage). Then there's the music: the songs Tarantino chose for his masterpiece fit their respective scenes so perfectly that most of those pieces of music are now immediately associated with 'Pulp Fiction'. And the narrative: the different story lines that come together, the elegantly used flashbacks, the use of \"chapters\" – there is so much playful creativity at play here, it's just a pure joy to watch.If you're a bit of a film geek, you realize how much knowledge about film and love for the work of other greats – and inspiration from them - went into this (Leone, DePalma, Scorsese and, of course, dozens of hyper-stylized Asian gangster flicks), but to those accusing Tarantino of copying or even \"stealing\" from other film-makers I can only say: There has never been an artist who adored his kind of art that was NOT inspired or influenced by his favorite artists. And if you watch Tarantino's masterpiece today, it's impossible not to recognize just what a breath of fresh air it was (still is, actually). Somehow, movies - especially gangster films - never looked quite the same after 'Pulp Fiction'. Probably the most influential film of the last 20 years, it's got simply everything: amazing performances (especially Sam Jackson); it features some of the most sizzling, iconic dialogue ever written; it has arguably one of the best non-original soundtracks ever - it's such a crazy, cool, inspirational ride that you feel dizzy after watching it for the first time. It's – well: it's 'Pulp Fiction'. 10 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","If you think \"Pulp Fiction\" is brilliant, you're wrong. It's more than that. It's a milestone in the history of film making. It's already a classic. But why? Because of the many \"f\" words, or maybe because of the brain and skull pieces on the rear window of a car? No, that's surely not the point (unfortunately some other users - fortunately the minority - don't get it). Tarantino has made a movie that's someway different from many other action, gangster or crime movies. What's so different? He knows the subject of the movie is \"cool\", he knows it's a product of mass culture, and he even likes it by himself. But he smiles at it and tells three great stories with a lot of irony. And this irony is the first point. The second point is that he gave souls to extremely schematic characters. They surely aren't another action heroes who you forget as fast as you can twinkle. They are human beings like we are, talking about Burger King and McDonalds, about TV series and a foot massage. They just earn their money with killing others or selling drugs. What else is so great about \"Pulp Fiction\"? It's the acting, the directing, the cinematography, the soundtrack, the sense of humour and the whole rest. In my opinion it's all worth nothing less than a 10 out of 10. A masterpiece.","Viewers are taken on a ride through three different stories that entertwine together around the world of Marcellus Wallace. Quentin Tarantino proves that he is the master of witty dialogue and a fast plot that doesn't allow the viewer a moment of boredom or rest. From the story of two hit-man on a job, to a fixed boxing match to a date between a hit-man and the wife of a mob boss. There was definitely a lot of care into the writing of the script, as everything no matter the order it is in, fits with the story. Many mysteries have been left such as what is inside of the briefcase and why Marcellus Wallace has a band-aid on the back of his neck, which may be connected. The movie redefined the action genre and reinvigorated the careers of both John Travolta and Bruce Willis. This movie is required viewing for any fan of film.","Pulp Fiction may be the single best film ever made, and quite appropriately it is by one of the most creative directors of all time, Quentin Tarantino. This movie is amazing from the beginning definition of pulp to the end credits and boasts one of the best casts ever assembled with the likes of Bruce Willis, Samuel L. Jackson, John Travolta, Uma Thurman, Harvey Keitel, Tim Roth and Christopher Walken. The dialog is surprisingly humorous for this type of film, and I think that's what has made it so successful. Wrongfully denied the many Oscars it was nominated for, Pulp Fiction is by far the best film of the 90s and no Tarantino film has surpassed the quality of this movie (although Kill Bill came close). As far as I'm concerned this is the top film of all-time and definitely deserves a watch if you haven't seen it.","My oh my.  \"Pulp Fiction\" is one of those roller-coasters of a movie.  It is both a joy and a trial to sit through.  Amazingly original and unforgettable, Quentin Tarantino's trash masterpiece never gets old or seem outdated.  It put a face on American independent film making in 1994. Miramax had been around since the 1970s and no one had heard of it before this film.  Studios went into a panic when this film came out because they knew it would be an amazing hit.  Of course it was.  Independent film making became the rage and hit its peak in 1996 when four of the five nominated Best Picture films were from independent studios.  The screenplay and direction by Tarantino are quite amazing, but the cast makes the film work. John Travolta (Oscar nominated) re-invented his career with this film. Bruce Willis cemented his celebrity.  Samuel L. Jackson and Uma Thurman (both Oscar nominees) became marketable superstars.  Others who make appearances include: Ving Rhames, Christopher Walken, Eric Stoltz, Rosanna Arquette, Steve Buscemi, Frank Whaley, Harvey Keitel, and of course Quentin Tarantino himself.  They all leave lasting impressions as well.  Samuel L. Jackson stood out the most to me, his lack of substantial screen time may have cost him the Oscar.  Just an amazing accomplishment, all involved deserve recognition.  Easily 5 stars out of 5.","Tarantino is without a doubt one of the best directors of all time and maybe the best of the 90's. His first film, Reservoir Dogs was amazing and claustrophobic, his segment in Four Rooms was by far the greatest (even though Rodriguez's was excellent too)and Jackie Brown is a wonderful homage to the Blaxploitation films of the 70's. However, Pulp Fiction remains my favourite.It was nominated for so many Oscars that I still find it hard to believe that it only got one: Best original script. I'm not complaining because Forrest Gump got best picture, since that film was also Oscar-worthy, but come on, movies like Tarantino's or the Shawshank Redemption deserved much more.Anyway, going back to the movie, I particularly liked the first and second chapters, and that's really a contradiction because one of the movie's finest characters, Mr. Wolf, appears on the third. Bruce Willis also does a great job, and as far as I'm concerned he fell in love with the movie right after having read the script. I like the way his character gives a \"tough guy\" image at the beginning and then we discover he's so affectionate and tender to his wife. Travolta is obviously the star of the movie and his second encounter with Bruce Willis in the kitchen along with the scene where he dances with Uma Thurman is when the movie reaches it's highest point.The other star is Samuel L. Jackson, who plays a wise assassin that obviously knows how to handle situations. \"And I will strike down upon thee with great vengeance and furious anger...\" is my favourite quote.Summarizing, Pulp Fiction is a modern classic and a must-see for anyone who is at least aware of what a movie is. I give it a 9 out of 10.","Quentin Tarantino's Pulp Fiction is a terrific film. It also gets better with each viewing, especially if one of those happens to be on a big theatrical screen where all of the BIG compositions get bigger and more detailed. How much else is there to talk about it after all these years? It's filled with dynamite, sudden and always interesting action, great and naturally clever dialogue, and memorable characters. Also, the acting is always something to behold as by turns straightforward, over the top, subtle, and just downright menacing and spot-on. The directing is one of the strongest that we've seen from Tarantino, as he makes his choices in pacing with shots in unconventional ways but never in a way that would be distracting. And writing, already noted, has been copied by many, and only equaled by a select few. The dance sequence. Samuel L. Jackson's superlative monologuing. It has loyalty among low lifes, and many other odd characters that are all bad and not one is a villain or hero. And somehow even after years of parody and terrible rip-offs, it holds its own and- as one can say after seeing it at a midnight screening- holds its audience as much as it had the countless times before they saw it (or if they are, the first time). The first time you're surprised, the second time you look for the clues or other ambiguity, and then the third time you laugh you head off. The fourth time... I'll leave to you.","I just finished screening this movie for the first time after putting it off for a number of years because of what seemed like equivocating appraisals from some of my friends. In hindsight, however, it seems to me that while the movie must have definitely bowled them over, overall they weren't sure exactly what to make of it or how to articulate what were probably a confused mix of feelings. But I am so impressed that I feel compelled to add a few specific observations to the many fine reviews already on this database.First, this movie hits you with an impact somewhere in between, say, APOCALYPSE NOW and A CLOCKWORK ORANGE, and for some people may be just as disturbing (however, in this respect I am happy to report I didn't think it rose to the level of NATURAL BORN KILLERS). Full of graphically violent action and language, PULP FICTION is not a picture for everyone - I would definitely not recommend it to my parents, born in the 1930's (even to my one fairly \"hip\" relative of the same generation who, at age 66, still teaches high school sex education and likes to talk about things like sunbathing nude, among other potentially sensitive issues).Irrespective of audience sensibilities, however, the film-makers, supported by superb acting in every role, manage to create a world full of the most fascinating sleazy characters possibly ever to appear on screen. From Travolta's pronounced almost-child-like curiosity about the world to Jackson's sincere and thoughtful philosophical ruminating and Willis's deep devotion to the memory of his father, I think such fascination lies not only in the characters' personalities as they are portrayed but in the way they tantalize the viewer into considering the possibility that such people could actually exist. As a lawyer of some years' experience dealing with all sorts of people I was particularly drawn to this aspect of the film.Thus, and in response to some other reviewers' comments, I think this movie is more character-driven than plot-driven. Instead of a story peopled by basically weakly developed characters employed primarily as a mere device to move the plot along, as is too frequently the case in the movies (especially these days), the undeniably strong, clever, and unpredictable plot lines in PULP FICTION are actually of essentially secondary interest and importance, serving primarily as vehicles to get you worried about the fate of characters you can't help caring about despite the truly low attributes that otherwise form the basis for their respective personas. As at least one other reviewer noted, when the film ends you are actually disappointed, left craving more of these crazy people and their explosive lives.Finally, and as strange as it may sound, this film reminds me of another Monumentally Great Film which one would never typically associate with it in any way in a million years - CASABLANCA. As in that film made way back in 1942, and as another reviewer has suggested, perhaps its special appeal - its unusually high degree of emotional impact - lies in its distinctly successful simultaneous application of several different genres in a single film - drama, action, dark humor - with the whole thing bound together by essentially flawless execution in every department. And while CASABLANCA is no doubt clearly much more wholesome and high-minded, like the older film PULP FICTION is not without a pronounced theme of redemption, even if it is not as strongly felt, considering all the later film's sleaze and violence.In sum, when people say that this is probably the best film of the 1990's, it is easy to see why. Fundamentally a truly outstanding movie, it is a must-see for anyone who considers themself a film buff and can handle graphic subject matter.(Incidentally, if you would like a more toned-down, much more overtly humorous and less serious picture with a not-altogether dissimilar look and feel, don't miss another 1990's Travolta picture, GET SHORTY.)","Pulp Fiction, despite borrowing from just about every movie ever made, is the most invigorating cinema experience a filmgoer can ever hope for. Its hodgepodge of violence, mayhem, and generally deviant behavior is an assault on the senses, not to mention political correctness. However, despite all the film's cleverness and style, it hinges on the performance put forth by Samuel L. Jackson as Jules. The fact that he was denied an Oscar is a downright shame. Martin Landau, the best supporting actor winner that year, was terrific and funny in Ed Wood, but Jackson was perhaps the most commanding screen presence in film history as the bible-quoting, godfearing hitman. The last scene in the coffee shop with Tim Roth still sends chills down my spine, no matter how many times I've seen it. Rumors of a prequel involving Jules and Vincent (John Travolta) have been floating around lately. If Quentin Tarantino wishes to regain the fans he lost with the dissapointing (but still pretty good) Jackie Brown, he should get to work right away. I'll be the first in line to see the finished product.","The proof of the pudding, they say, is in the eating. The proof of the movie is in the watching. Most of the top 250 IMDb movies have kept me glued to my seat--with this one I found my mind wandering to that jigsaw puzzle I hadn't finished or the possibility of some popcorn. I found I had very little interest in the characters or in what was going on.I asked myself why. Technically the film is very good. The actors all hit their marks and Samuel L. Jackson is particularly outstanding. I liked Maria de Madeiros also as Bruce Willis' wife Fabienne. The camera work is occasionally interesting, as the long scene where we watch Bruce Willis listen unemotionally to Marsellus go on. Interesting, certainly, but rather pointless.Indeed, that's the problem: so much of what goes on is pointless. It's a big long shaggy dog story, told by one of those irritating people who can't get the story straight and have to keep going back: \"Oh yeah, I forgot to tell you about that. Well, you know what I was telling you before . . .\" I tried to find some justification for the higgledy-piggledy way in which this story is told. It does result in the best scene being the last one. But if this scene was the point then why not design the script so that the action is seen to be moving toward this goal and cut out everything that happens afterward? In the end I don't think Tarentino knew what story he was telling and that's why so much is so pointless.The scenes of Butch attempting to control his temper, of his dilemma whether to help Marsellus, and the final scene in the restaurant are all good and entertaining as far as they go but they don't fall into a coherent framework. And the rest is quite dull.The dialogue is not witty or clever although it occasionally has its moments. The constant profanity is as pointless as the rest; the point of profanity is presumably to emphasize what one is saying, but if everything is emphasized, nothing is. The mind becomes numbed by it. It's like someone who shouts all the time. Eventually you stop listening. The quotes give you a pretty good idea of what the dialogue is like: when \"Shut the f*ck up, fat man!\" is listed as a memorable quote, you know how inane the conversation is.That this poorly composed script should have won an Oscar is a pretty clear indictment of the Academy.","There are many differing schools of thought regarding Quentin Tarantino and his so-called \"style\". There are those who believe that the director who began his career as a humble video store clerk with a voracious appetite for movies of every conceivable style is talented and worth imitating. While Tarantino has made some movies worth discussing for their positive qualities (Reservoir Dogs is, by far, his best effort), this group of movies is rather small, especially considering that he has only directed five movies. There is another school of thought who regards his works as inane, self-indulgent, and bloated. Pulp Fiction, written and directed by Tarantino, and released in 1994, is his most divisive movie simply by virtue of being his most well-known. Upon its release, it was hailed as a warning shot to a complacent Hollywood- the maverick behind the indie hit Reservoir Dogs apparently had something else up his sleeve.Pulp Fiction is ostensibly a crime story featuring the interconnecting lives of several characters. However, upon repeat viewings, the viewer begins to wonder exactly what that something is. Personally, I found this movie ran too long in spots, likely because Tarantino is so ridiculously in love with the sound of his own voice as spoken by different actors that he is afraid to cut one speech or even a single line. Dialogue, though it doesn't necessarily need to serve the story to justify its inclusion, should not be so dense as to drive the viewer out of the experience. When John Travolta and Samuel L. Jackson, on the way to retrieving a briefcase for their employer, are talking about European hamburgers and foot massages, the scene plays like a witty outtake- as though the actors so understood the style of the movie that they were in that they felt comfortable riffing with the material. Not so- the rest of the movie is filled with conversations of a similar type, including (but not limited to) body piercing, blueberry pancakes, hamburgers (again), and coffee (this one performed by Quentin Tarantino himself, as though he couldn't wait to get a shot at delivering his own lines).The strangest thing is, while the characters are \"in character\", as Samuel L. Jackson says in an opening scene, the movie is quite enjoyable. When the characters are placed into real confrontations, the movie takes on an entirely different persona and becomes at least a decent crime movie. Ultimately, however, these scenes are few and far between and, unfortunately, the movie clocks in at 154 minutes. There's really only a decent short film in all of this.The movie also lacks what I would call a plot. The movie is described as three stories about one story, though that one story (ending, chronologically, with Bruce Willis and his irritating Euro girlfriend riding off into the sunset) doesn't connect the characters enough to be truly about one thing.Ultimately the movie is a prime example of what happens when a VCR and a wide selection of movies replace film school. The movie lacks a coherent center and seems more like something that was made for the sake of just committing something to film and resurrecting the flagging career of John Travolta. The movie is too large in scope to sustain itself, and, in the end, implodes because there is really no conviction behind the presentation- too concerned with being a hipster-cool riff on a crime story, rife with pop in-jokes and 70's music (perhaps the best part of the movie is the soundtrack), somebody must have neglected to mention that the movie went nowhere and lacked the momentum to even get there.While all of these qualities combine to form a truly deplorable viewing experience, I do have to mention Bruce Willis and Samuel L. Jackson as two performers in this movie who, I felt, got away clean. Bruce Willis probably gets away with it because he's alone for the majority of his segment and, therefore, doesn't have anybody with whom to trade despicably derisible dialogue. Samuel L. Jackson gets a mention because of the scene at the very end of the movie in which he confronts Tim Roth's character and makes him realize that there are far more fearsome powers at work in the world than robbing a diner. In fact, the scenes coming directly at the beginning and the end of the movie are the two best, and everything else is filler.As you no doubt have guessed, I fall squarely in the latter of the two groups I mentioned at the beginning of this review. Pulp Fiction is inane, self-indulgent, and bloated.","The hugely overrated trivial chatting, the grotesque violence, the moral vacuum, the deadly slowness, the length --- about an hour too long --- make it incomprehensible today how this picture ever made people rave the way they did on this board.The greatest film ever? Excuse me, this is a feature film that says nothing, depicts no authentic feelings or character development, is grossly self-indulgent and filled with idiotically implausible situations, such as people firing powerful handguns repeatedly, simultaneously and then hanging around chatting as if nobody would ever report the firing and summon the law.Perhaps the most implausible character of all is played by Mr Tarantino, who shouts at the two hoodlum killers as if they were playmates from school and complains that his wife will divorce him if she returns from work to find a car in the garage containing a man with his head blown off.Where is the moral compass of the people who revere this schoolboy nonsense? Nobody in the film is remotely principled, and nor is anyone (except possibly the pawnbroker) actually evil. The scene where he releases a leather-studded sadist from a cage is possibly the most unbelievable rubbish ever deployed in a Hollywood feature.\"It's only entertainment,\" I hear people protest. Well the difference between Mr Tarantino and film-makers of stature is that they are capable of entertaining while instructing, and of integrating the two.","Is it possible that something so loathsome and awful could actually be adored and lauded by millions of people?  Is it only a matter of chance that some movies are loved and others hated, regardless of their content?  I hope this is true, because I cannot believe that there is actually anything good about the movie Pulp Fiction to lead any sane, reasoned, drug-free person to write the glowing comments that surround mine, much less the oodles of people who actually handed over their money to see this thing.Why is this movie so bad, you ask?  Okay, I'll tell you, even though it's like pointing out why windows are transparent.  Starting with the script, I see no reason to be impressed by an assemblage of overly stylistic dialogue and flat, boring characters.  There is nothing amazing about two guys talking about French McDonald's restaurants, and then killing some guys. Every awful stretch of dialogue is dragged out as long as it will last, and then some.  It's as if Tarantino said to himself \"I think I can cram one more line about milkshakes in here\".  You have to give him credit for padding the film in ways that nobody's ever tried before.  The actors look as though they're doing their best to salvage this turkey (and they are talented), all the while knowing in the back of their minds how much of a cow pie the whole thing is.  As far as Tarantino's directorial style is concerned, he should just get himself a career in Nike commercials because that's where his talent level cuts off.","You want to do something really neat? Take the movie \"Pulp Fiction\" and re-cut it, so that, instead of being out of sequence, it is actually in proper sequence. It can be done. Why do this? Because if you do, you will see what a nothing movie this really is. There is no central plot, there is no real theme, or story or climax. It is just a bunch of tricks and overly snappy dialog, masquerading a piece of fluff that has as much depth as the kiddie pool. Hey, more power to Tarantino, the guy is a Houdini, full of slight of hand. But are we really so simple, that we are ranking this one of the ten greatest movies ever made? Come on! OK, I know that Travolta is cool and Jackson is funny. However, let's reserve the greatest films of all-time category for real masterpieces and real stories, and not some overly slick pulp geared towards video store geeks.","I think one of the problems many people have with this movie is that it defined and set into motion an extremely irritating trend in contemporary film. The god-awful clones of Tarantino pouring out of indie and mainstream studios alike should not, however, detract from the brilliance and subtlety of this movie. It works simply because those moments of brilliance (I have to admit I know the whole \"Jules redemption-speech\" by heart) that its imitators lack come in the midst of the camp and gore they all do so well. Tarantino alone uses an adolescent obsession with shallowness and morbidity to high satirical effect--like all great films (or even novels), this movie sets itself into a two-dimensional genre (absurd, pop-culture, comic-book situations) and then undermines its own genre by exposing the heart and soul underneath. There are too many points in the movie in which this happens to mention, but a few come to mind: the blown kiss from Vincent to Mia at the end of the first (or maybe second) story; the death of Vincent; the obvious emotional dedication of Butch to his wife at the end of his own story; Vincent's unwillingness to believe in his own supernatural salvation without realizing he's doomed; and, of course, the climactic speech. With the exception of Jules's final words, many of these moments seem at first to be horrifying or funny--but this is only because they fit so well into the flow of the script. A second glance shows them to be moments so poignant that the only reason they work is because they are so unique to the characters and their situations. The changes in each (or the lack of change) come, in a sense, as they individually choose to either drive for them or fall behind. Most die-hard fans of the movie, I'm sure, have heard the story of the briefcase and the band-aids on the back of Wallace's neck (the entire movie being a quest to bring back his stolen soul), and although Tarantino has denied it, he can't deny that the movie is full of such heroic themes: escape by trial, the reclamation of past, love as both physical salvation and personal security, a will to believe in something beyond one's own selfish world. I won't say that if you don't like this movie that you're mistaken or ignorant, but I think that Tarantino puts his audience into settings much like his characters are in: cheap, full of profanity and nastiness, fleeting. The best of them break through; I think he asks that anyone watching do the same.","Wow, a lot of people have been fooled into believing that this was a great film. I've never seen anything like it, and I hope I never will again. This is one slop of a film, and I'm disgusted to know that it has so many high reviews. It was a confusing ball of goo that amounted to nothing. I didn't care for the characters and never will. What a hopeless bunch of freaks. I don't jump on the \"freak bandwagon\" unless they're natural ones, not arrogant embodiments of deranged entertainment. The glorification of smut is worse than the smut, and that is exactly what this movie is. The sad thing is, I don't believe that some of these actors were acting at all. They were just being themselves. Travolta and Jackson in wigs??? That was scary! The only interesting thing about the movie was the sequence of events. I like the way that it started at one point and ended in the same, but dislike everything in between. The problem with this film is that it tricks the audience into giving it great reviews. It uses the \"peer pressure\" method. You know, \"this movie is for intelligent and cool people\" CRAP!! Well, I'll gladly stand among those who know that this was nothing more than a \"shock flick\". It was produced to see if the letter could be pushed a little further. Unfortunately, it drags what little respect that Hollywood has with it. I'm afraid that this is one of the major stepping stones to a pathetic industry that only produces films for vulgar lust.There's my two pennies, don't spend them all in one place!","Sorry for the image, but if you take a bowl of crap, rearrange it, put some sugar and a little cherry on top, what to you get? ... a bowl of crap.This is the most overrated film of all time. I'm even feeling strange to call it a film. It has no story, no feelings, no plot, no music - just 4 different scenes of disgusting, violent, abusive, offending and racist content put together in a mixed sequence.How this crap scores a 9 on IMDb is beyond me. Sometimes when people see a 9 they automatically deceive themselves into believing this is a masterpiece and that maybe if they didn't like it, something is wrong with their opinion or taste. Nothing's wrong. It's a bad movie from beginning to end. The problem is that sometimes Hollywood movies are over-hyped for business reasons like what happened in Titanic and Avatar which by the way were \"OK\" movies but didn't deserve the huge credit they received.I gave this a 1 because Samuel L. Jackson was the only thing interesting in this disaster. I'm not going to tell those of you that haven't seen it not to, you have to go through the experience on your own and make your fare judgment. Don't listen to anyone's opinion - especially the ones that think if you love this one, then you're COOL!","I really find it difficult to believe this movie is rated highly by people. It's hands down the worst movie I've seen in my life (58 years). When my wife and I went to see it, soon after it came out, multiple people walked out of the theater saying either it was a terrible movie and/or it sickened them. Maybe all of us were just allergic to Tarantino's sick fascination with violence. The violence is just so gratuitous and casual as to make it seem like a bad video game. Outside of that, the overall movie has the feel of being viewed through the eyes of someone high on bad drugs. Please excuse my lack of specifics regarding the film, but I've fortunately blocked most of them from my memory. In any event, I worry about a society that thinks this is a good film, I really do.","This movie is definitely the most overrated piece of sh*t ever.No story, no plot, no message, just Tarantino so totally in love with his own \"witty\" dialogue.The movie is empty in every sense of the word. In addition, it's also horribly boring and therefore ridiculously hard to watch. I always try to sit through every movie I start, but damn, with this one it was a hard task not to simply get up and walk away.Pulp Fiction does not deserve to be on top of IMDb's list of best rated movies with actual masterpieces like \"The Shawshank Revenge\". The latter is a work of art, Pulp Fiction is merely a piece of sh*t dressed up as one and it's amazing how many people fall for it.","This is what I call a fad movie.  People say it is a great movie because other people said it is great.  People are afraid to express their true feelings because they don't want to be ridiculed by their friends, especially if one is a member of the so-called X-generation.  I would imagine that the number of people who rented the video or saw it on cable that stopped watching the movie because it was so bad is fairly high, especially for a movie that is considered a great movie.However, I concede that a number of people truly like it.  However, I find that there are just as many people who are repulsed by this movie.  They just don't express their feelings in this type of format because a bad movie isn't worth the effort of making a negative opinion.","Pulp Fiction is often considered the coolest and greatest film of all time. But, the people who usually say this are pretentious film snobs and people who think this is something extraordinary. Excuse me, it isn't.First of all the film has NO plot. If a film has no plot, then why should we care about the unlikeable characters? Second, the diagloue is so....BAD. Does the director think people actually talk like this, because, well they don't.Third, the grossly, glamorous violence, is disgusting. This isn't a horror film, so why do we need such violence popping in and out of the movie? So, I urge everyone to avoid the hype of this pretentious, terrible mess.","Quentin Tarantino is a good director who has a knack for combining wildly imaginative music selections for his movies that seem to work so well you have to laugh with joy.He also is known for dark comedy, combining unexpected twists that dismay audience members to the point they often refer to him as a \"genius\".The problem with \"genius\" is that what is genius to some is mundane to others. Tarantino is also known for his plot twists. However the excessive focus on plot twists creates an expectation from the audience, which opposes the basic appeal: the element of surprise.In Pulp Fiction, twists are introduced with little finesse. Tarantino has improved with the years, but Pulp Fiction, an early film, becomes boring before it is over.Certainly worth watching, but early and raw compared to Tarantino's later films.","It kind of feels redundant trying to write a review for Pulp Fiction as it approaches its 20th birthday. As a film it needs no introduction, it won the Palme d'Or at Cannes, won a BAFTA and Academy Award for Best Original Screenplay (Tarantino), and garnered a whole host of other awards and nominations. Box office beef was meaty and its reputation even now shows no sign of waning (it currently sits at number 4 on the IMDb top 100 list), it is by definition one cool MOFO of a movie, a picture loved by a cross section of demographics. But why?Pulp Fiction oozes humour, romance, violence and stylish flourishes. It remains compulsive viewing throughout; even as it threatens to get submerged in its own complex structure. Film lover Tarantino takes a number of low life and unfortunate characters from Los Angeles, mainlines then with movie clichés, and then amazingly breathes new life into them. It knowingly winks at B movies from the past yet always remains fresh on its own terms. I myself having just revisited the film after a 5 year gap can attest to just how well it holds up, laughing at the dialogue, perched on the edge of the seat as violence starts to rumble, and yes, singing along with that most catchy of soundtracks.Yet for all its flashiness and hipster chattering, there's one thing that often gets overlooked when talk of Pulp Fiction's greatness arises. That of a basic human urge to survive or find salvation, Tarantino's main characters may be bottom feeders or scummy operatives of the underworld, but there's love and needing beating slowly in its dark heart before the drugs and violence take a hold. Neat trick that from Tarantino, brilliant in fact. 10/10","kylopod","wolvesrug","gogoschka-1","Luke-20","cooplander","discoelephant64","tfrizzell","guybrush105","MisterWhiplash","Gatorman9","verbal-15","Bologna King","AdamG87","rowmorg","KubricksRube","Tecun_Uman","leopold-3","cojosh","zuma777","garykbell","kstroll66","Wakuwaku","IcyRoses","frunobulax1","Spikeopath","17 November 2005","9 January 2005","24 July 2014","30 December 1998","8 December 2004","19 January 2005","25 June 2000","4 April 2000","20 January 2000","18 April 2004","2 August 1998","17 August 2006","18 February 2008","18 December 2005","9 April 2002","17 July 2005","18 January 1999","9 September 2006","7 March 2013","3 December 2005","15 June 2013","25 September 1999","25 December 2009","24 August 2014","13 February 2012","10","10","10","10","10","10","10","5","1","1","1","1","1","1","1","1","1","1","6","10"," The masterpiece without a message\n"," Simply The Best\n"," The rebirth of a genre – and film history\n"," One of the best movies of the century!\n"," The Movie that redefined a genre\n"," Unbelievable.\n"," It's Wild, It's Chaotic, It's Pulp Fiction!!!\n"," Great director. Great story. Great characters. A masterpiece\n"," One of the Best Film's I've Seen In A LONG Time... and still is\n"," Awesome!\n"," Hands down, the best film of the '90s.\n"," Enormously Overrated\n"," A tale told by an idiot, full of sound and fury, signifying nothing.\n"," The most ludicrously inflated reputation of any film\n"," One-dimensional modernist pap (minor spoilers)\n"," A creative and slick waste of time\n"," blood and f****** spirituality\n"," What??? Where??? Who Cares???\n"," 9 IMDb? Really?\n"," The worst movie I've ever seen\n"," Terrible\n"," Extremely overrated!\n"," Could Be Most Overrated Movie Of All Time\n"," Good Yet Over-rated\n"," Ah, so by that rationale, if a pig had a better personality, he would cease to be a filthy animal. Is that true?\n"]}