{"primary":["Star Wars: Episode III - Revenge of the Sith (2005)","https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_UY1200_CR135,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0121766/reviews","tt0121766"],"secondary":["May 19, 2005 was not a simple day for fans and fans of the \"Star Wars\". It was a day when all pieces of history fell into place, finally opening a riddle that lasted more than 28 years. People imagined and thought out, wrote books and stories, collected facts and made legends, and everything for the sake of one saga, which will forever remain in the hearts of its admirers. Probably, almost every person, leaving the hall, could not convey or describe in words, what happened during these several hours in the cinema. Joyful, sad, tearful, shocked faces, slowly headed for the exit, promising to come back and see this episode again.This is the chapter of history, truly the most intense and the most powerful. It penetrates into the lungs, not allowing to breathe, touching hearts and souls. We are just spectators. But we can experience. And at some point, there is only a doomed sigh, realizing that there is no way out.Indeed, the third episode is the most cruel and tragic. There is much more pain and despair in it than in any other part. Here the republic collapses like a house of cards, turning into an empire, the Jedi perish at the hands of their \"single minded\", and the face of Anakin Skywalker forever hides the black helmet of Darth Vader. And all this inspires horror, the horror of hopelessness, when you slowly begin to understand that all this is only part of the plan, the way of a petty senator to a ruthless emperor, where everyone is just a pawn, in a huge game of the big world. And every word said accidentally becomes the key to this great puzzle, which accompanies the imperial march. But when you realize it, it's too late.\"I swear the faithfulness of your teachings,\" whispers the future dark lord to his master with despair and devotion, asking only one thing - to save her beloved. At this moment Anakin Skywalker perishes, dies together with the republic, along with the Jedi, together with her beloved, giving birth to Darth Vader - the future tyrant, which inspires terror and fear, driven by hatred and despair, in the eyes of which something like love is reflected ...\nAnd the most terrible thing was that it was inevitable. The Jedi themselves dug themselves a pit, while the enemy stood behind them, alternately, pushing them down. This is war. Order 66. The army of clones. Padmé Anakin. Alone, these errors are not so significant, but together they form a whole madness and panic, in one hour destroying everything that the galaxy has been working on for many millennia. Therefore here the absolute evil and absolute good unite in the struggle, this cinema and consists of some contrasts. Good and bad, the Jedi and the Sith, Obi-Wan and Anakin, the emperor and Yoda, Anakin and Padmé.Such a controversial character went to Hayden Cristian. In essence, he plays two opposites in one body. Nobility and sincerity at the beginning and anger and hatred in the end. And all fear began, which slowly grew into panic, then into despair, anger, getting to hatred. It was thanks to fear that the emperor firmly grabbed Anakin's soul, not wanting to let go of his new servant. The glitter of embittered eyes, in which hatred for everything and the thirst for power breathe. It is difficult to imagine someone who could better cope with this task. Therefore, there are no more words left than one: \"I believe\".It's all over, Anakin. I'm above you!The battle of Obi-Wan and Skywalker is what remains in memory forever. This is not just a battle between two people who have spent together their whole lives, this is a battle between two brothers who sacrificed their lives for each other's sake. Here, the side and skills of each are determined. Obi-Wan (in the brilliant, by the way, performance of Evan McGregor) does not try to follow the easy ways to achieve his goals. He goes to Mustafar, he understands with bitterness what is going on. Therefore, this battle is not only with the darkness, it is a battle with yourself, with your feelings and attachments. Unlike Anakin, Obi-Wan is firmly committed to duty, goals, order. For some reason, he is sorry for the most in the end. A person who, in any situation, acted as correctly, and not as easily.\nAt the same time, we see the battle of two other opposites. Yoda and the emperor. Here, the battle goes for other concepts, for democracy, peace and freedom. The fate of the entire galaxy is being decided. And as the swords are crossed, good and evil are constantly side by side, weaving and maintaining the balance of power, crossing swords, but achieving different goals.But where did it start? Padmé Amidala, without knowing it herself, is the center of the whole string and culmination that unfolds during these few hours. A tragic figure that unwittingly became the key to the empire, from which they simply got rid of unnecessarily. Natalie Portman, like no other, fits into a gloomy sweep and the helpless panic that reigns around. Her heroine is touching and ardent, but unable to change anything, she is only an outside observer of the war and the collapse of the republic.Painful and sad ...Most of the attention of the film is given to Anakin, whose fear and sweeping increasingly turns him into the ruler of the Sith. However, about the persecution of General Grievous, powerful battles and amazing planets, also did not forget. This is a movie that will not leave anyone indifferent. Yes, and whether to restrain feelings? After all, this legend, which will be remembered.Bravo George Lucas.The highest ball.","The final entry in George Lucas' Star Wars saga, Episode III - Revenge of the Sith is one, giant climax to arguably the most popular movie franchise in history. It's also the most riveting of the series; A movie of such visual and storytelling intensity that it makes our typical standards for summer entertainment seem trivial. Sith has wall-to-wall action and jaw-dropping special effects, yes. By all measures, Episode III is a grand success when it comes to giving the legions of Star Wars fans any and everything they could have hoped for after Darth Vader uttered the words \"We meet again\" in 1977. The beauty of Revenge of the Sith is that it earns much more than diverting summer thrills. Strip away all the baggage that comes with the name 'Star Wars' and what you are left with is one of the most enthralling films of 2005.Star Wars: Episode III - Revenge of the Sith serves as a bridge to the first Star Wars, A New Hope, where we see the culmination of Anakin Skywalker's fall to the Dark Side. This is where Darth Vader is born. In addition to finally delivering on the promise of the entire prequel trilogy, Revenge of the Sith also has the gargantuan task of telling the story of how the Clone Wars ended, how an evil Empire emerged from a democratic Republic, and how Luke, Leia, Obi-Wan, and the rest found themselves where they are at the start of the original Star Wars movie. With all these massive story lines, it's a wonder that Lucas manages to squeeze the best out of every plot line, without straying from the film's most important element, Anakin's seduction by Chancellor/Emperor Palpatine. After having a vision of his wife, Padme, dying in childbirth, Jedi prodigy Anakin Skywalker consults with the chancellor, who expertly influences the young Jedi into turning to the dark side of the force. The entire seduction works brilliantly. With the seeds of Anakin's tragic flaw planted way back in The Phantom Menace, and expanded upon in Attack of the Clones, Revenge of the Sith is free to focus on the straw that broke the camel's back. Anakin's desperation to save Padme's life makes his eventual turn believable, and Ian McDiarmid and Hayden Christensen both do well portraying an icy relationship that turns into a destructive mentorship. Anakin's final fall, framed alongside the rise of the Empire is a storytelling masterclass. Palpatine's seduction is subtle, yet dramatic, and the numerous loose ends from the originals are all tied with a certain kind of poetry. For all his writing deficiencies, Lucas spins this fable elegantly, with a delicacy that makes you realize, he's been dreaming of telling this story for a long, long time. The plot marches relentlessly forward with commanding momentum, but it is only one side of Revenge of the Sith. The special effects and action are in a class of their own. Episode III is the biggest of all the Star Wars movies in terms of story, and the visual effects return the favor. Once again, Lucas and company revel in all kinds of wide, sweeping shots of new worlds such as the lava fields of Mustafar or the city-sized sinkholes of Utapau. It's all part of a grand, dramatic style of filmmaking that makes Revenge of the Sith look like a finale, through and through. It's also remarkable how certain elements like the ships, soldiers, and costumes seamlessly blend into what is seen in the originals. As sophisticated as the effects are, its George Lucas and his painterly talent for composition that propel the effects from technically well done exercises of CGI and miniatures to truly beautiful cinematic images. Lost in all this is the action. The film begins with an old-fashioned space battle on an epic scale. It's a feast for the eyes, and it feels distinctly like classic Star Wars. The lightsaber duels, the lizard versus mono-wheel chase scene (which includes the villain General Grievous; a half droid, half alien, wheezing wonder of imagination and digital wizardry), and the Clone War battles are dazzling on levels rarely seen in traditional summer blockbusters. The final duel between Obi-Wan and a newly christened Darth Vader is operatic and straight-up Shakespearian in its emotional complexity. Along with the Order 66 montage, the action of the last half of Revenge of the Sith is as powerful as anything in the series.As with any movie, there are things in Episode III that could be criticized. The dialogue isn't dramatically better than it was in the previous two movies, and the acting can be wonky at times, but none of this amounts to anything in the grand scheme of things. In the end, Sith does so much right that complaining about a line or two that was corny or delivered awkwardly is an utter waste of time. The finale to the Star Wars saga aims so high and nails so many key notes, that its minor flaws are almost completely inconsequential. Revenge of the Sith is one of the boldest works of blockbuster filmmaking ever made. I can't name another tentpole franchise movie that comes close to the level of operatic emotional poignancy that marks the best moments of Episode III of the Star Wars Saga. Movies like this don't come around often. A New Hope is still the Star Wars movie we will cherish most, but in its boundless ambition and breathtaking power, Revenge of the Sith is high art in the form of a summer blockbuster. George Lucas puts every idea he's had about good vs evil, fathers and sons, and the rise and fall of empires into this masterpiece of popular entertainment. Star Wars: Episode III - Revenge of the Sith is a brilliantly crafted epic, one that cements George Lucas' Star Wars Saga as one of the great achievements in filmmaking history.92/100","When I asked the reviewer sitting next to me to sum up Revenge of the Sith, he simply said \"great!\" That seemed to basically be the consensus of virtually everyone in attendance at an advance press screening of the final chapter in the Star Wars saga.There was an exuberant mood leaving the theater, as if everyone was in collective agreement that Lucas had finally done it. That he had gone out on top, with a stunning, rock-solid coup de grace. And from all the feedback I've heard from that screening, my sense of that collective mood was right.There are no real spoilers in ROTS. Everyone basically knows what happens in Episode 4: A New Hope. We all know Anakin becomes Vader. We know Obi Wan lives and we know Luke and Leia are born. What we don't know is how Lucas weaves those story lines into the large, six-part opus and better yet, why?No, it's not a perfect movie. There are those moments that make us cringe. Bad dialog and High School drama class acting make for a few awkward moments where you can hear audible moans and giggles in the audience, but we have come to expect this from modern Star Wars films. The upside is that these moments are rare in Episode III. OK, get ready. Take a deep breath. No Jar Jar! Yes, you read that right. You can let out that deep breath now.Fortunately, we have one savior to rely on for stellar acting. Mr. Ian McDiarmid as Supreme Chancellor Palpatine. McDiarmid brings the elegance of an Alec Guiness back to the franchise in a knockout performance that leaves the audience riveted and exhausted. He is the lifeblood of the film.As someone who saw the original 30 times in it's first month of release at the age of 13, I currently consider myself a Star Wars moderate. I don't have volumes of SW merchandise, nor can I debate whether or not carbonite contains enough oxygen to make it float. All I know is that magical feeling Star Wars gave me in the original 1977 release and that I'm happy to say, after a disappointing pair of prequels, has been finally restored and reinvigorated.Here's to Mr. Lucas for giving us all something spectacular to remember for our entire lives that embodies the whole point of going to the movies in the first place, to escape and lose ourselves in another world.","For several years now, it's been a rather uneasy proposition to be known as a STAR WARS fan. First, we had to put up with the great embarrassment of the clownish Jar Jar and the gut wrenching \"acting\" from the muppet known as Jake Lloyd in PHANTOM MENACE. Then came the laughably stilted dialog and the clumsily told love story from ATTACK OF THE CLONES. Fans far and wide were wondering what George Lucas had done to their beloved STAR WARS franchise! Something that once was so rollicking and without peer was being transformed into kiddie-pandering, muppet populated, CGI over-loaded dreck!Mr. Lucas, all is forgiven. Welcome back. REVENGE OF THE SITH is the prequel installment we've been hoping for all along. Gone is the overly wooden acting and the ridiculously petrified dialog. In there place is a logical and believable storyline. Anakin's transformation is inexorably sensible. It is natural and not forced into shape by wooden dialog. Scenes between Anakin and Padme, are heartfelt and honest- a far cry from their nearly unwatchable scenes in ATTACK OF THE CLONES. The same can be said of scenes between Anakin and Obi Wan Kenobi (Ewan McGregor is legitimately great in this film. He gives Kenobi real depth and the viewer thoroughly believes that he grows up to become Alec Guiness). There exists a real bond of deep feeling the viewer can feel between master and apprentice thus making Anakin's fate all the more tragic, as he slowly becomes more and more entangled in Palpatine's (Ian McDiarmid, in a joyfully malevolent turn) web of deception and evil.Visuals have never been an issue in the prequel films and this is most certainly the case with REVENGE OF THE SITH. The opening sequence is a jaw-dropping collage of ships in movement, dazzling colors, and frenetic combat. Additionally, the technology used to create Yoda seems to have grown exponentially over the already impressive wizardry used to animate Yoda in CLONES. Front to back, the vistas Lucas shows us are entirely believable and staggering joys to behold. George Lucas goes right for the jugular in this film (the PG-13 rating is well earned! Parents be advised!!). This is a very well-told story of a fall from grace told in an unflinching manner. And yet, the hope for the future is so firmly in place as this film rolls to an end, a tear will roll down your cheek if you've lived with this series of films as long as I have. STAR WARS is back. It's cool to be a fan again.","The last of the star wars films to be made and done in spectacular style. The only thing with this film is that it relies too much on digital technology, which causes it to lose some of the charm of the original trilogy.That aside, Star Wars Episode 3 is by far the most dramatic and spectacular of all the Star Wars films. Continuing the story of episode 2, this film tells of the events leading up to the original trilogy. It tells the tale through three key elements,1. Tragedy 2. Betrayal 3. RomanceThese elements make this film the most stunning and the best of the prequel trilogy, and a debatable best in the saga. It is my favourite but others may disagree. But the film is worth a look, even if you're not a hardened star wars fan.","(No Spoilers!) Excitedly submitting my comments two weeks prior to the opening of the film (after a preview screening at the Ziegfeld Theater), I am thrilled to add to what appears to be a growing wave of positive reaction to Lucas's effort in Episode III. As a life-long fan deeply caught in a love hate relationship with Episodes I and II, I cautiously awaited this final installment. I felt in my heart that this would be a great film, but feared that somehow I would again be disappointed. Maybe I was starting to succumb to the notion that I no longer had the spirit of that six year old boy who was mesmerized by the original Star Wars, long ago in 1977 at that far away NJ theater. Maybe.From the opening 20th Century Fox logo, the movie hits the ground running, proving once again the CGI capabilities of ILM and the thrills they inspire. However, unlike the first two films, where spectacular effects were layered upon complicated, contrived and sometimes dramatically vacant scenes executed with some of the worst performances in memory, there is solid story telling here. And that's the difference.The drama builds steadily in the first act before hitting light speed with a combination of excitement, dread, intrigue and pain. This strong dramatic spark ignites the entire cast, helping them turn in what are easily their best performances of the three films. When you have a script with this kind of thump and talented actors, the result is fun to watch. And for once, perhaps most importantly, the special effects serve the script, not the other way around.Anakin's internal struggle, present from frame one, quickly consumes him, catapulting the film towards its inevitable conclusion. While its no surprise that the film ends on a desperate note, there does remain a glimmer of possibility as the story segues into the aptly titled classic \"Star Wars Episode IV: A New Hope\". It's thought provoking and inspiring.It's also worth noting that as advertised the film is dark, makes no apologies, and is much less child friendly then the others. All pluses in my opinion.The final result with \"Revenge\" is a complete film that I will never forget, a somewhat renewed perspective on what Lucas was going for with Episodes I and II, and assurances that that little boy inside me is still there, popcorn in hand, ready for a good movie.","I personally am more of a fan of the original trilogy than what I have been of the prequels. Although I did enjoy TPM, and AOTC, they definitely were not as well done as A New Hope or Empire. I think the general criticisms of the first two prequels was lack of good story, and poor acting. First I would like to say that the acting is much better in Revenge of the Sith than the first two prequels, but what truly stood out in this movie was the story. It was delivered perfectly, for the first time since Empire, Lucas connected emotionally with his audience. The last hour of the movie was especially powerful. Although probably not planned, I think this movie will be the bridge that brings the old star wars sheep back into the fold. Just as Anakin eventually brings balance to the force, Revenge of the Sith will bring balance back to the Star Wars Universe. And judging by the reaction of the test audience I was part of, everyone I was with feels the same way, no one left their seat for at least a couple minutes after the movie ended.","i loved star wars as a kid. i grew disenchanted with the new trilogy. i was prepared for another letdown.i was surprised to see that things really come together. 'sith' has a coherent story, well told, well paced. the movie is full of fireworks, but they always support the progression of the story, nothing felt unnecessary like some stuff in the earlier episodes. the characters were all solid. some were even great. there were quiet, slow paced moments that made sense, felt right. the transformation of the characters came across well. the conflicts are complex, personalities are multifaceted. this movie carries a lot more weight than episodes 1 and 2.not everyone will be happy. there are weak moments, there is wooden dialog, there's cheesy romance. nevertheless, for most of the audience, even non hard-core star wars believers, this movie works. it's great entertainment, and it ties in very well with episodes 4-6. the sense of disconnect that people felt with episodes 1 and 2 is gone. you will want to go home and watch 'a new hope' right after seeing 'revenge of the sith'.","***Spoilers!****Lucas finally leaves behind the childish stupidity of the first two episodes and delivers a much grimmer movie. Too bad he does it so poorly. The first problem with the movie is the acting. The forced, pitiful dialogue is enough to make a person cringe. It is glaringly obvious during the exchanges between Padme and Anakin. But rather than leave a movie to be destroyed by bad dialogue and acting, Lucas decides to take it a step further and brilliantly adds a pointless robot villain named General Grievous. This robot's special power was that he had reptilian organs and suffered from a bad cough yet could somehow mysteriously breathe in space. But the hardest thing to stomach about this movie is Anakin's sudden and whimsical switch to the dark side. Lucas tries to create all of these different factors for Anakin's change to darkness, yet none are convincing enough. First Anakin struggles with visions of Padme's death, then he gets placed on the Jedi Council and is asked to spy on his dear friend Palpatine, and to top it all off, those stingy Jedi have the gall to not award Anakin with \"Master\" status. Then Palpatine reveals himself as the Sith Lord to Anakin and tells him they may be able to save Padme from death. One thing leads to another, and Anakin lops off Mace Windu's hand and decides to become a Sith. It is truly unbelievable. Out of 6 or so hours of movie-time between Episodes I, II, and III, 10 minutes are dedicated to the Dark side's \"seduction\" of Anakin Skywalker. It takes Palpatine 3 whole scenes to convince Anakin to switch sides. But the fun doesn't stop there, oh no! After walking the path of good(except that Sandperson incident in episode II) for all these years, Anakin has little problem slaughtering all of the Jedi younglings and hating all of the Jedi, especially Obi-Wan. The truly glorious thing is that this movie all takes place in maybe a week's time, and Anakin's complete switch to darkness takes about 1 minute. I suppose it is possible that the events in this movie were supposed to span a few months, but that is not made clear, due to the story-telling genius of Mr. Lucas. Lucas had two movies before this in which he could have shown a gradual change to darkness. That would have been believable. But Lucas is such an idiot and has no idea how to develop characters, and this is the result. Yes, it is understandable that Anakin is troubled and frustrated and supposedly loves his wife very much, but that just isn't enough to make his sudden change to the dark side believable. Lucas has had 28 years to figure out how Anakin became Darth Vader. You'd really think he could have come up with a more convincing story than this. But then something truly wonderful and realistic happens that nearly redeems the film. Padme simply \"loses the will to live\" and kicks the bucket. This is really great coming from a formerly strong and independent character, who now has children to concern herself with. But I guess that's not a good enough reason to live. It's a good thing that this trait isn't passed down to Luke, otherwise he may have dropped dead from depression in that Death Star trash compactor. I would also like to point out the stunning use of the drawn-out soap opera-esquire \"NOOOOOooooooo!!!\" that Darth Vader bellows forth upon discovering that Padme has perished.","I'm going to sum up Star Wars Episode 3 in one word: AMAZING! In my opinion, this was the greatest movie out of the Star Wars saga. Better then the original, just AMAZING.I loved how there were multiple lightsaber fights throughout the movie, unlike the others where there was only one at the end of each movie.General Grievous was a great villain. Though I still liked Darth Maul better, Grievous was just a bad-ass.The way Anakin turned to the dark side and destroyed the Jedi, it was sad but once again just simply amazing.Glad that Chewbacca was finally back he was always one of my favorite characters. Same kind of goes with Jar Jar, glad that he wasn't in the movie, he was always one of my least favorite characters.Finally, the epic battle between Anakin and Obi Wan, the fight that pretty much connects both trilogies. This fight was the greatest fight in all of the Star Wars movies.10-10 GO SEE THIS MOVIE!!!","Let me start by saying quickly that I am a huge Star Wars fan like many others however I have no problem admitting Ep. 1 & 2 were mediocre films. I thought to myself that if RotS lived up to the story and to the hype that it would be all better. It turns out the effect was the exact opposite. After this installment I will probably never watch the prequels again with their lack of plot progression and clunky conclusion. The first problem with Revenge of the Sith is the same problem that plagued Ep. 2: TOO MUCH CGI!!!! We don't care about the characters or the story because we have no way of identifying with them! We knew Luke was cold on Hoth and that Tattooine was hot and muggy, we could probably guess what it smelled like, etc. This movie has no aesthetic value whatsoever because there are no aesthetics! Everything is fake so why would it be believable?Another problem that umbrellas the entire movie is the excruciating acting/directing/writing. Frankly, my first reaction would be to blame Lucas because we all know he can't write dialog. However in this particular case I blame the actors: No one could even pull off ONE line(with the exception of McGregor, Portman and MAYbe Ian McDirmid). I realize the dialog is horrible and feels awkward for the actors but you have to be able to spin it at least a little bit.The only thing that redeemed the prequels to this point in my mind was the choreography of the light saber battles which felt like the battles of the old trilogy unleashed to their potential. Lucas has even managed to evolve this positive in a huge negative. Now with Ep. 3, instead of precise, deliberate yet incredibly quick movement designed to deftly engage an opponent we have basically the old trilogy's lightsaber battles at the speed of pressing fast-forward. No one even fights in this movie they just swing their lightsabers wildly as fast as they can perhaps hoping to induce a seizure upon their opponent (I know I felt this way as an audience member). And, sad to say, this applies especially to the final, \"climactic\" battle between Obi-Wan and Anakin.The pacing is also bad. You have somewhat interesting action at the beginning where Anakin kills Count Dooku like it's no big deal with no subtlety whatsoever on the part of Lucas. When this event occurs it is the equivalent of stopping the movie and displaying the message \"Now officially changing to the dark side\" on screen. To be honest the entire middle part of the movie (I'm guessing roughly an hour and a half) isn't worth summarizing because frankly nothing happens. If anything is to be mentioned it would be that the Jedi know something is up with Palpatine but do nothing about it and also willingly let Anakin hang around him knowing he is a huge threat and that Anakin is a bit unstable. They could've done something but instead they say \"well let's just let it go because we read some legend that said he's a good guy so let's just go with that.\" The dramatic transformation and progression of Anakin from light to dark that could've been cleverly paced over three new films is horrible. After his hand in Mace Windu's death(which,like everything else seems forced) all of a sudden he's a Sith. As a viewer there is no mounting tension just \"....oh I guess he's a bad guy now.\" Probably the most offensive part of the movie was how they sugarcoated Anakin's reasoning for turning to the dark side. Throughout the old trilogy you assume that the dark side is the shorter but more haphazard way of learning the force and that it will turn you into an agent of evil and that the light side takes more commitment but is more fulfilling. This is a universal theme that everyone on the planet can relate to and before this movie it was tragic to think that Anakin, who had so much potential for greatness, could not resist the Dark Side. It turns out even this theme that is threaded throughout the entire trilogy is not sacred to Lucas. Instead of just sticking with it he develops a storyline where Anakin dreams of Padme dying and, well it's a dream so it must be true right?? Then Palpatine tells Anakin some totally irrelevant legend about a Sith lord who could propagate longer life and prevent dying. Based on a random nightmare or two and an old wives tale told by Palpatine Anakin is ready to sell his soul to learn this power. It would be like someone telling you the lost city of Atlantis was in Lake Erie so you dropped everything to find it. Give some of the film's responsibilities to the experts or, God forbid, ask for constructive criticism! I cannot believe that people like Rick McCallum viewed the final cut of this movie and felt confident about it. They couldn't feel that way. They've spent decades of blood, sweat, and tears to end their efforts with a jilted, emotionless mess like RotS and nothing is said? The only thing I can imagine is that with Lucas at the helm no one dare criticize him or he is too set in his vision. At any rate, this was one of those rare movies where I could've made a critical comment after EVERY scene about at least one thing. That may sound arrogant but keep in mind I love Star Wars more than any other piece of media in history so it's not like I wanted anything but to love this movie. That statement alone should make you start thinking about all the \"positive\" reviews this movie is getting.","In Coruscant, the Jedi Obi-Wan Kenobi (Ewan McGregor) and Anakin Skywalker (Hayden Christensen) rescue the Supreme Chancellor Palpatine (Ian McDiarmid) from the Separatist General Grievous' spaceship and Anakin kills Count Dooku (Christopher Lee) with his light-saber after a fight; however Grievous escape from the Jedi. When they land on Coruscant, Padmé Amidala (Natalie Portman) comes to tell Anakin that she is pregnant. Soon he has premonitions of his wife dying during the delivery. Palpatine requests that Anakin joins the Jedi Council against the will of the members but his is not promoted to Master and stays Padawan; further they ask him to spy Palpaline. Anakin is manipulated by Palpatine about the true intentions of the Jedi and is tempted to know the dark side of the Force that could be capable to save Padmé. Further Palpatine discloses that he is Sith Lord Darth Sidious. What will Anakin do?\"Star Wars: Episode III - Revenge of the Sith\" is the final part of the saga initiated in 1977 by George Lucas. This episode is among the best ones and shows how Darth Vader was born. George Lucas in 1971, surprised the world with the cult \"THX-1138\". In 1973, another great movie: \"American Graffiti\". Then, in 1977, he directed the fantastic \"Star Wars\". Since this date, he basically dedicated his life only to the excellent Star Wars saga. With his potential, he could have contributed much more to the cinema industry. My vote is ten.Title (Brazil): \"Star Wars: Episódio III - A Vingança dos Sith\" (\"Star Wars: Episode III – The Revenge of the Sith\")Note: Last time I saw this film was on 19 November 2005.","To all the fans out there, it is time to rejoice. George Lucas has delivered in Revenge of the Sith. In my list of favourite Star Wars movie, it ranks up there with Empire Strikes Back in its emotional level, and action sequences.It's natural that this review contains no spoilers, as most of you would already know of the plot, and of the ending, since it leads to A New Hope, and given the countless slew of marketing techniques used to promote this movie.But the question is, what actually pushes Anakin Skywalker to the Dark Side. And this is the crux of the movie - if the delivery or narrative is poor and unconvincing, then this movie will sink. Fortunately, Revenge cuts to the chase, and to the point, elaborating without being boring, pacing kept consistent with breathtaking action in between serious dialogue.The best scenes in this movie is however, not the action. They are each time Supreme Chancellor Palpatine and Anakin Skywalker share a scene. After all, this movie is about the Sith, and every time these two are together, there is an ominous sign hanging that Anakin gets closer to the Dark Side, waiting for the inevitable to happen. If you're with Palpatine, I'd bet you will be smittened by his subtle sweet talk of power. George has written all these scenes well, and you really feel the seduction.But what really hit the spot was Hayden Christensen's performance. He brought out fear in Padme's death in his nightmares (which was actually a self fulfilling prophecy), arrogance of his knowing his Jedi powers being improved and unmatched, confusion of his dilemma of being in a corner, torn between the Jedi Order he belongs to and his confidante Palpatine. You feel Anakin's sadness and loss each time he makes a mistake when doing evil deeds - you feel his tears, every time he is torn in a world of political plotting, of being an unwilling double agent.Which makes me ponder, being a child prodigy Anakin Skywalker is, it is without proper supervision that he is being seduced by false promises of unlimited Dark power. Yoda gets sent off for a mission, so does Obiwan, leaving Mace Windu (who doesn't like Anakin, and vice versa) looking after him. It is precisely this opportunity that Palpatine gets closer and pushes Anakin over the edge. In a way, the Jedi's arrogance (or probably Mace's) caused their downfall, and Anakin's love for Padme being the fuel that Palpatine openly exploits.The Jedi Massacre, though short, is extremely painful to watch. You see the Jedis trying their utmost to survive in their respective war zones, yet being murdered in cold blood by hordes of \"friendly fire\" - Order 66. It is a sense of great loss and pity, and you'll be holding your breath to see how Yoda survives.And yes, the lightsabre battles - this film sees the most duels in the series. Obi-wan and Anakin vs Count Dooku, Obi-wan vs General Grievious, Mace Windu vs Palpatine, Yoda vs Palpatine, and finally, Obi-wan vs Anakin. Amongst them, I would rank Obi-wan vs General Grievious the weakest of them all, despite the boast that Grievious can weld 4 sabres and fight with them simultaneously. The ones which packs a punch, are Mace vs Palpatine - the battle between the Jedi's best in the lightsabre swordsmanship, and the power of the Dark Side, Yoda vs Palpatine - masters of the Light and Dark side dueling, with one of them admitting failure and loss, and finally, the battle amongst brothers, Obi-wan vs Anakin. I like this one the most, as the speed and red fiery environment they do battle in, really bring out the blue glow of their lightsabres as they duke it out in fantastic speed. The only time when sabres of the same colour clash, and the best.Fan favourites like R2D2 (don't we love this droid!) and even Chewbacca make appearances. Jar Jar Binks too, but without dialogue. C3PO however, got limited screen time. My only gripe, if any, will be Padme being reduced to Tears - from the tough cookie she is in the prequels, probably being an expectant mother has mellowed her a lot, and she is always so sad when she comes on screen.John Williams, there seems to be no wrong he can do with his score, as his Battle of the Heroes track highlights the fight between good and evil, between the surviving Jedis and the emergence of Sith power.I would be watching this movie again, to take in the fantastic seduction scenes of the Dark Side, the sense of loss, helplessness and confusion, and the agony of betrayal from those whom you trust. Powerful themes brought out in a tribute finale to the entire series, a fitting film that bridges the past films to the Original Trilogy loved by many.May the Force be with you.","Finally we have the episode3 of Star wars. So many things happens in this episode, that I need to make a summary of the things that happens. First of all, some years have passed since the Clone War. Anakin and Obi Wan are fighting as hard as they can, specially now that Palpatine was kidnapped by general Grievous, the leader of the droids army. Anakin finally menage to kill Count Dookan,( with Palpatine motivating him)and Obi Wan killed Gen. Grievous.Anakin continues to maintain the marriage with Padmé hidden, but things starts to become complicated to him when he starts to have nightmares with Padmé dying when she gave birth .Anakin becomes a sith and an apprentice from Darth Sidious, and even Padmé who could not believe that Anakin turned to be bad, is shocked by his behavior(as well as obi wan).Anakin's looks are much better then episode 2(he is more similar to Luke) and R2-D2 has more participations in this episode as the others.The clones executing order 66 has strong scenes, because seeing so many Jedis and Wookies being killed is heartbreaking for everybody who is a big fan of Star Wars.(specially when the little Jedi children are killed by Anakin's hands) This episode is the mark when the Empire begins and the Jedis fall. The only jedis alive are Yoda and Obi Wan, the first one stays isolated and the second one goes to Tatooine to give Luke to her uncle and to be watching him. (Leia and Luke are isolated from each other to be safe from the siths, and Leia stays with Senator Organa,who always wanted to adopt a little girl).We also can see Anakin's body being destroyed in the fire, and for that reason he cannot live without the black and famous suit of Darth Vader, that nowadays is an icon for every fan.Padmé only died because she gave up of living, since Anaking broke her heart. (By the way, she only dies because of Anakin himself) In his desire to make PAdmé alive, he went to the dark side and this is what makes her sad and heartbroke.(Palpatine,who is lord sidious tempted him with the offer of knowing how to produce life, and Anaking, being too much an ambitious person and angry with the jedi council that not trust him very much, became a sith.R2 and CP3O has their memory erased, that's why they don't remember anything and never told Luke about his father.*A Thing that I really don't like: 1-First, I personally think that Anakin surrendered too easily for the dark side, specially for someone who was full of doubts all the time. But in general, this the best episode from the new trilogy.","I was never one of the millions of Star Wars groupies. I enjoyed the films, except for Attack Of The Clones, but wasn't a huge fan. Having seen the first five, I eventually got around to checking out this last one, if for no other reason than curiosity. Wow, it changed my whole outlook.I cannot believe how impressed I was with this film, how well the writers wrapped up the whole saga and put all the pieces together. This was an excellent film, the best of the entire series. It inspired me to buy the latest DVD set which had the first three movies released and then reacquire the Clones film to complete my DVD collection of it.I'm writing this review months after seeing \"Sith.\" so it's just a few general thoughts. I remember thinking, after watching the wild opening, that this was going to be another one of the modern-day action films with too much action....but it settled down and wasn't vastly overdone in that area, although it could have toned it down a bit. Better than the action or special effects was simply the way the writers tied everything up, how Anakin Skywalker became Darth Vader, and his son wound up being the hero \"Luke\" that we saw in those early episodes of the 1970s and 1980s. The special effects were, of course, top-notch. When you go back and see those early films you really see how far Hollywood has advanced in this area. I cannot imagine how many hours of work it took the put these storyboards and computer artwork in this film, there is so much detail. It's mind-boggling.I know a lot of fans of this series feared the writers would mess up the final but their fears were not realized: this was a super ending to a memorable saga that endured for almost 30 years amazing.","Despite almost 30 years of warm up, Lucas still didn't come up with a  strong enough character motivation to explain Anakin becoming Darth  Vader.  Now when I watch the original do I have to imagine a sniveling, pouty  little punk in the suit? Lucas gave James Earl Jones some of his  trademark magic dialogue for his return: \"Nooooooo!\". Thanks, George.  I love how they have C3PO's memory wiped at the end, as if that closes  the plot hole. R2 would have been able to remind him. They should have  mentioned disabling R2's ability to fly and somersault out of planes  too.  Yes, this is the best of the new 3. It couldn't be worse than the  first, which only avoids the title of \"Worst Film of All Time\" because  it wasn't shot on film.  The political parallels are the best thing the film has going for it.  However, I would like to remind everyone that \"If you're not with me  you're my enemy,\" has been said for a MILLION years! If you want a real  laugh try attributing anything to W and convincing them it is a quote  he came up with other than his malapropisms.  The flipping Yoda is stupid. I know some geek somewhere thought it  would be really coolbut it isn't.  Ian McDiarmid gives a pretty good performance, but the silly faces he  makes while shocking people remind one why he is otherwise noticeably  absent from the annals of film history.  Keisha Castle-Hughes with the tiny part is pretty funny. The best  actress nominee walking behind the casket of the best supporting  actress nominee.  Ummmwhy did Padme die? She was \"giving up\"? When she had two new kids  to look out for? Maybe if they had her give birth, have the kids hide,  go to try to win Anakin back and he kills her the movie might have  actually worked.  Sorry, Fanboys, I know you are all ready to dive back into the pool,  but this was still stale, unengaging and trite. I wish Lucas had never  made these three. There isn't a single moment in the entire new trilogy  that conveys the thrills of the trash compactor scene in the first  trilogy, or the fight on Hoth orwell, anything, even anything from  THX-1138. It's junk. If you'd held out after Episode 1 and demanded  better you might have got better, maybe he would have given up  directing like he did after Episode 4, but you didn't and they're crap.  If this is your idea of good then you deserve Jar Jar and what the  movie studios give you.  Sorry if this isn't a funny arch review but I found how terrible these  movies are, along with Lucas's systematic violation of our memories  with the pathetic changes he made to the original to be seriously  depressing. The man has no judgment. Why would Anakin at the end of  \"Jedi\" reappear as Haydn Christensen? He would appear as the redeemed  old shell he was when he died, like he did originally. Any fool could  see that except the fool with the control. Lucas makes studio control  look good.  A friend said this and I agree: what do I feel about this film? Relief  that it is all over.","...like Frank Miller did for Batman.It would be impossible to truly spoil this movie. It's outcome is already determined and the movie spoils itself.You might hope the PG-13 indicates that Mr. Lucas saw the light and/or heard his audience and raised the story from the Telly-tubbie schlock that was Ep1. You'd be wrong. It's still written at (perhaps) a 3rd grade level, but this time with flashes of gore -- guess who gets the full body burn -- that make the movie unacceptable to children for whom the only hope of enjoyment is turned into a nightmare.War is bad is a primary theme, but in Lucas-world, devoid of interesting characters or credible violence, the endless assault of epic fight scenes is sterile and boring.Like Ep2, the dialog is laughable - literally. I saw the movie on opening night, in the San Francisco Bay Area (Lucas Films back yard) and the audience was laughing, embarrassed for the otherwise strong acting cast. Any other writer + director could have sneezed a classic from this cast. What a waste. Ewin MacGregor sneaks through as the only actor to somehow sneak by Lucas and deliver a credible performance.The special effects are strong of course, but the scenes move and switch so quickly, you'll probably miss a lot being too busy popping pills to prevent epileptic seizure.You'd think the 27 year climax of a six movie series would be one of the most carefully delivered in history. You'd be wrong. While Obi-wan is sent specifically to kill Annakin and save the universe, he casually walks away. What's worse, he'd have every motivation to put Annikin out of his firey misery, he casually walks away. \"Sorry old chap, you were supposed to be the chosen one, and we were like brothers, but yet I'm compelled to deliver this odd soliloquy while watching your legs burn off. Then, I think I'll casually walk away.\"Almost any other possible scene could have been written to deliver the necessary result. Lucas blew it once again. This is the worst episode of all. Don't be fooled by the rating, or the inexplicable ratings of the sycophantic 'professional' reviewers out there. Save your money and gain a couple hours of life that I and too many others have lost.HTH.","This film was awful - as bad as The Phantom Menace, but without anything as good as the Darth Maul light sabre fight. I was checking my watch throughout the film, waiting for it to be over.Episodes I-III have been a lesson in how not to make a film. Aside from the unbelievable characters, planets, spaceships, droids etc, terrible script, poor acting, awful direction, horrendous reliance on CGI, this film highlighted one thing - Lucas hasn't actually watched the original (and phenomenal) trilogy. For example:Luke: Leia... do you remember your mother? Your real mother? Leia: Just a little bit. She died when I was very young.Err according to New Lucas, she died when Leia was three seconds old! hmmm...I will say, however, that this film did have one of the funniest scenes I've ever seen - when Darth Vader finds out Padme is dead. It isn't supposed to be funny, but is hilarious!Mr Lucas - come on now, you've had your joke, you've had your bit of fun, now can you make Episodes I-III properly?","By giving this film a perfect score, I am in no way suggesting that it is free of flaws, but ambition makes up for imperfection, and, with this movie, George Lucas has set out to film a Greek tragedy on the largest scale ever attempted. The film certainly has its clunky moments, but so did all the other \"Star Wars\" films. Just go back and listen to Mark Hamill whine to his uncle in A New Hope.Whate gave me chills as I watched Revenge of the Sith were the numerous mythological and literary references. These were always highlights of the Star Wars films. It's what raised them above simple space adventures. There are references to Paradise Lost (Count Dooku to Anakin: \"Twiced the Pride, double the fall), Prometheus, Frankenstein (Vader's birth) etc.Anyone that enjoyed their first viewing of this film should see it again. There are so many details that are not explicitly stated but are meaningful none the less. These include plot details and various modes of symbolism employed by Lucas. Notice how, in their scenes together, Obi Wan is always more in the light and Anakin is more in the shadows. Additionally, there are hints at things that we are never told, but become more obvious with a repeated viewing. One such detail is that Anakin suspects Padame of having an affair with Obi Wan. He says accusingly to Padame, \"Obi Wan was here,\" when they are in her apartment. Then, in one of his vision's of Padame's birth, Anakin sees Obi Wan helping her with the delivery, suggesting that he is perhaps the father of Padame's child. Finally, on Mustafar, when Anakin sees Obi Wan come off of Padame's ship, he feels betrayed, not just because he thinks she's siding with Obi Wan, but also because he feels there might be something between the two of them.As for the criticism that Anakin's conversion to the Dark Side is unbelievable, I think that it is baseless. Lucas did a superb job of showing Anakin as someone who is too prideful and impatient. He will save Padame at any cost. Additionally, in the scene between Palpadine and Windu, the line between right and wrong has been blurred. By killing Palpadine, Windu would be violating the Jedi code. Palpadine also plays on Anakin's confusion by suggesting the Jedi are attempting to rule the Republic, something Windu already mentioned when he stated that the Jedi would have to take over temporary control of the Senate after Palpadine's arrest. Anakin draws his light saber, not to kill Windu, but to prevent him from committing a crime. He wants to stop Windu's light saber from killing Palpadine--the man who represents his only chance of saving Padame, but in his haste he accidentally cuts off Windu's hand. Once Anakin does this, he is lost. His life as a Jedi, the only life he's ever known, the only thing he's ever aspired to be, has been destroyed. When someone as prideful and immature as Anakin makes such a HUGE mistake it is often almost impossible for them to come to terms with what they have done. The result of this denial is often a defiant repetition of the bad act, a way of insisting to themselves and the world that they have done nothing wrong. These bad acts gain a momentum that eventually complete distorts their sense of morality.We must also remember that Sidious, or his Sith master, has used the Force to impregnate Anakin's mother with the expectation of him one day becoming the galaxy's most powerful sith lord. Palpadine/Sidious has spent all of Anakin's life grooming him for the moment he changes his allegiance. Sidious has befriended Anakin, given him a taste of power and planted seeds of doubt regarding the Jedi's true intentions. He has been the closest thing to a father Anakin has ever had. With all this in mind, Anakin's conversion seems justified.As for the acting and dialogue that are being relentlessly bashed, I submit that it's not as bad as some would suggest. Christensen's angry, confused brooding is mostly dead on while portraying a major shift in his character. MacGregor is at his best as Obi Wan. Even Portman's diminished role in this film is thoughtfully portrayed. Above all, the actors and Lucas seem to be having much more fun with this film. They have loosened up and it shows. There are humorous moments that cut through the political debate and relentless action. There are even a few quiet moments that subtly allude to strong emotions that Lucas fails to portray through his dialogue, such as the scene where Anakin is looking out of window of the Jedi council, across the city to where Padame is looking back across the city at him. This important scene illuminates Anakin's frame of mind before he hurries to the Senator's chamber to stop Windu from killing him.Visually, this film is absolutely stunning, so much so that I had to see it a second time just to take in the tremendous amount of detail. The action, the score and the sound effects all work to enhance the main plot and theme of the film, rather than overwhelming them. Revenge of the Sith attempts so much more than most \"popcorn\" movies in terms of pure entertainment, and thematically, it trumps many of the more \"serious\" theatric releases. All of this combines to make Revenge of the Sith far and away the best film of 2005, and maybe of the last five years. It is certainly a galaxy far, far above Million Dollar Baby, though that is saying very little.","I saw Star Wars Episode III: Revenge of the Sith once, and I will never see it again. This movie is utterly devoid of anything positive or enjoyable. The first half of the film is basically about Anakin being an idiot and messing everything up, and the second half consists of him on a killing rampage. Sure, I know that the story of Anakin's transformation into Darth Vader absolutely HAD to be told, but therein lies the problem. This movie (and the other two, for that matter) was created solely to explain what is present in Episodes IV, V, and VI. There is no point to the film other than explanation.The plot was not the main aspect of the movie that upset me, however. What really bothered me was how negative the movie was. There is so much unnecessary death and agony in this film that I can't even justify viewing it. I am thinking in particular of the scenes when Anakin assaults the Jedi Temple, and when he storms the Trade Federation HQ. In the former scene, Anakin kills almost everyone. He enters a room of young Padawan learners, little kids, and slays them all. That is just plain disturbing. I am sure most people who see this film are desensitized and gloss over this, but I am sensitive to violence in movies and I didn't feel good about seeing senseless killing.Later on, when Anakin assaults the Trade Federation, he enters the T.F. control room, with the Neimoidians under the impression that he came to assist them. Instead, he slaughters them all. The Neimoidians are unsuspecting and don't put up much of a fight. They try to plead for their lives, but Anakin doesn't listen. The last one he kills (Nute Gunray?) even explains \"The war is over!\" Anakin's killing is totally unnecessary. Yet Anakin slashes Gunray across the chest and kills him. I was so confused during this scene because the Neimoidians are previously portrayed as cunning and selfish, but I feel sad when I see Anakin murder one of them. I used to think that the Neimoidians were stupid characters, but they suffer so much in Ep. III that I feel bad for them, and bad about the violence they are involved in.Everything basically adds up to a great deal of suffering and violence. Each good character either dies or fails in this movie. Obi-Wan fails (he says so during his final showdown with Anakin), Yoda fails also, Padme dies, the Jedi are wiped out. Anakin is a big, big idiot who does everything wrong and destroys the loved one he was questing to save. He strives to obtain the legendary dark power of resurrection because he saw in a vision that Padme would die in childbirth. He destroys the Jedi order, kills little kids, and turns against his master, just to save Padme. But he even kills Padme! His anger at and total rejection of Padme drains her will to live.The fact that the movie is poorly made doesn't help the horrid content. This brings me to my final complaint, and the one most relevant to the Star Wars universe. First of all, let me say that I am a Star Wars fan. Not the kind of fan that simply thinks the movies are good. I have obviously seen each episode of the original trilogy many times, and have come to appreciate the cinematic experience they bring the viewer. The reason they are so good is because, aside from being excellent from a movie-making standpoint, they offer a completely absorbing universe for you to step into. As a collector of Decipher's Star Wars CCG cards, I have immersed myself in the amazing scope of this universe. Have you ever wondered why people watch the original three films hundreds of times and never tire of them? This is the answer. There is so much intricacy, so much care in each detail, that the Star Wars universe comes alive. That is what makes a Sci-Fi movie good, and that is why Star Wars endures to this day. Thousands of models and landscapes were created by hand. In the new trilogy, everything is computer generated, which contributes to the washed-out, boring scenes. As I have previously stated, the new films are so plot-driven that they don't engage the worlds they take place on. In the original trilogy, scenes were staged in memorable locations that an interested viewer will become very familiar with. In Ep. III, the plot jumps from planet to planet without creating attachment to a particular place. In contrast, everyone knows Tatooine from seeing the original trilogy. They know what it looks like, the creatures that live there, and why it is so important. I don't even know the names of half the planets that appear in Ep. III, and if I did, I wouldn't care. The environments are so indifferently rendered that no attachment to a particular place is created.I am sorry for writing a review this long. I simply wanted to express my depression after seeing this movie. It absolutely fails at everything. Not only is it poorly made, but it is so depressing that there is no point in watching it. Who would want to watch a depressing movie if there is not some positive benefit to outweigh the negative? Not me. I don't understand what George Lucas was thinking when he made this film. He is obviously so full of himself that he forgot how to make a good movie. As abysmal as Episode III: Revenge of the Sith is, it helps me appreciate the magnificence of the original movies a little bit more. Episodes IV, V, and VI were so amazingly well done that even the man who thought them up doesn't understand what makes them enduring classics. There is nothing more to do except treasure the experience of those original three Star Wars films. Nothing like them will ever happen again.","Why do so many IMDb members rate this movie highly? \"The actors really pulled it off,\" they say. Are you kidding, a third-grader couldn't be fooled by that acting. In fact, it wasn't even acting. It was the sound of thespians being tortured. \"The plot-line was gripping,\" they say. Gripping?! This must be the MTV generation talking: \"Give me flashes of light, give me staccato scene changes, give me words dropped like concrete balloons from another dimension, and I'm totally gripped.\"** Major Spoilers follow ** Here are a few highlights, so to speak: (1) In EpII, we see Anakin struggling with Democracy. He says to Padme something like, \"If I'm in charge, I'll make everything right.\" So we see the root of his lust for power: to improve the Republic by controlling others (of course, the viewer knows this to be a recipe for disaster, so we see the end coming). But Lucas drops the ball. In EpIII, this premise has nothing to do with the key plot turner that makes Anakin turn to the dark side (which is: a personal love story). (I won't even bother with the mechanics of Anakin's conversion. It's too painful to discuss.) (2) (Paraphrased) Anakin: \"Are you joking?! You won't make ME (Anakin Skywalker, a barely pubescent noob) into a Jedi Master right this instant?! How could you do this to me?!!! Waaa, waaa, waaa!\" I wanted to crawl under my seat.(3) Anakin physically abuses the woman he's risking everything to save. What?! I'm totally confused. Then he looses because he jumps too far? Come on, Lucas. And then Obi-Wan just stands there and delivers a monologue while his \"friend\" sizzles and toasts, then he walks away without finishing him off or taking him into custody or to a medical center to be incarcerated later. Arrrrgghhh!(4) (Paraphrased) Anakin: \"What happened to Padme?\" Palpatine: \"You killed her.\" Anakin: \"Noooooo!\" Um, forgive me, but wouldn't Anakin be just a little pi**ed off at Palpatine at this point and a little less willing to believe him? From the beginning, it was impossible to believe that Anakin would be so totally comfortable accepting everything that Palpatine claimed to see in the future or in his own mind. Yet he did. Now, suddenly Palpatine bears no responsibility for failing to see this coming or to do anything about it. And it never occurs to Anakin that it was Palpatine who put him up to this in the first place. So stupid it hurts.(5) Padme dies of a broken heart. Me, too.This rating system on IMDb teaches us all a lesson: If a person wants to believe in something badly enough, he will do so. It's a rather sad commentary on modern culture. (And a good reason to invest in CGI studios.)","The main problem that this movie has is that it just goes too fast. This is because Lucas left a LOT of loose ends for this third movie, which results in an incredible effort to explain all of them in only one movie. The best example of this is that in this movie characters die all too often, such as Count Dooku (like in the first ten minutes), General Grievous (who was publicized too much but ended up being just a secondary character), and Mace Windu. Another example would be the Jedi; we get to see just a few deaths, and have to interpret those few killings as the extermination of most of the Jedi all over the galaxy. And even as they tried to pack this one full, some topics were not completely resolved, like why some Jedi disappear when they die and others don't. Also, the Wookiee battle is too short. Compare it with the Ewok battle in Episode VI, which lasted like one third of the movie. It just seemed like an excuse to cash in on the reappearance of Chewbacca. The romantic dialogues between Anakin and Padmé, just as in Episode II, are boring as hell. Aside from that, I was left wondering how come in \"Return of the Jedi\" Leia says she remembers her real mother, when Padmé died just minutes (or less) after she was born. Another important goof in this movie, thanks to the horrible DVD release of the original Trilogy, is that Anakin never wore the Jedi robes he appears wearing as a ghost in the new end of Episode VI, unlike Obi-Wan and Yoda, who appear wearing the robes they had on when they died. I am also curious about why they didn't bring back David Prowse to play Darth Vader. In this Episode he looks smaller and thinner than he was in the original Trilogy. All in all, I am glad that the prequels are finally over, because I was getting tired of watching \"Star Wars\" go down the toilet.","Little could Mark Hamil have known when he uttered these words in A New Hope that he was making a profound prediction of the future of the Star Wars movies. Did he also foresee the rise of an actor who would make him look like Laurence Olivier?As a Star Wars fan I so wanted Sith to be good, but after the first five minutes I just wanted it to be over.I can't recall the last time I witnessed such a poor performance from a professional actor as from Haydn Christansen. All his lines were delivered in a monotone totally devoid of any emotion, nor did his facial expression ever change - he could have been pushing a trolley round his local supermarket rather than being in a film. I belong to an amateurdrama group and any of our blokes could have acted him off the screen.Perhaps that was why Christopher Lee had so little to do - he wouldhave acted Christansen off the damn planet!! I have never seen Haydn in anything else so I'm prepared to admit that I could be doing him a disservice. Maybe that monotone was the only way he felt he could deliver such lousy dialogue without laughing or puking up. During the film I wanted to do both.Even if I could have ignored the lousy acting and the even worse dialogue (and it would have taken a Jedi mind trick of gigantic proportions to make that possible) the CGI was just as tiresome after about five minutes of it. The opening space battle looked more like a traffic jam on the M1 Motorway than a battle.I wasn't thrilled, I wasn't moved, I wasn't touched by any of it. I cared more about the slaughtered Jawas in New Hope than I did about Padme and Anakin through all 3 prequels. This film said more about Hollywood's obsessions with youth and thinness than about a galaxy far, far away. If the following films were made now there would probably be no Han Solo character (a type of character the prequels badly needed) - way too old! They can't even show a woman properly pregnant with twins - I swear in some shots that Natalie Portman wasn't even wearing any padding.If you are a true Star Wars fan there are only 3 ways to deal with these prequels-:1) Wipe them from your memory 2) Bombard Peter Jackson with frantic pleas to remake them 3) Write your own I'm going to try the last one - I'm sure it will be a million times better, just a shame I won't get paid millions for it!","MINOR SPOILERS AHEAD!Yep, I got to catch an advanced screening of the long awaited final episode of the Star Wars saga, up here in Nothern California.All I can say is, WOW! This has the best action sequences of any of the six Star Wars films! The battle sequences at the beginning with Jedi star fighters and separatist forces is by far the most spectacular special effects sequence ever put to film.Anakin's downfall towards the dark side begins after an opponent of his is killed, which lures him more and more towards the dark side of the Force.Anakin and Obi-Wan spend the first half of the film trying to end the Clone Wars between the Republic and the Separtist forces.Acting wise, Heyden Christensen does a much better job this time around portraying the darker Anakin Skywalker as he heads towards his destiny, all of the wooden Anakin from The Phantom Menace and Attack of the Clones is finally free from his shackles this time around. Ewan McGregor, excellent as always does a great job portraying Obi-Wan Kenobi as a jedi master who knows his pupil is headed for the dark side.Natalie Portman does a great job portraying Padme Amidala as the tragic wife of Anakin who knows that the Republic and her husband are slowly drifting away from her. Padme's final scene is heartbreaking to say the least and adds some serious emotional impact towards the ending of the film. But, the real scene stealer is Ian McDiarmand who does an excellent job portraying the kindly Supreme Chancellor Palpatine as well as another major character in this film.The new villain, General Grievous, is cool, but I liked Jango Fett and Darth Maul a little more. Grievous isn't in the movie too much but when he and Obi-Wan are fighting on the planet Utapau, it's war on a large scale, with Obi-Wan riding this large lizard and Grivous riding this wheeled vehicle. While this is going on, Anakin grows even more closer towards the dark side, with fits of rage and jealousy towards his fellow jedi and towards the Republic.In this film you see how all of the jedi are exterminated, what finally happens to Padme, the mother of Luke and Leia, how Anakin becomes Darth Vader, and how the crumbling Republic becomes the first Galactic Empire. Warning though, Anakin's change to Darth Vader is quite scary and will definitely upset the little ones! Wow, Lucas has done it, and made a successful connection to the original Star Wars film, A New Hope! One of the coolest bits is seeing the Tantive IV, Bail Organa's rebel blockade runner, from A New Hope in action towards the end of Revenge of the Sith.We finally get to see Alderaan, and the wookie Chewbacca for the first time since the classic films, and the best bet, only a short glimpse of Jar Jar Binks towards the end of the film during a highly important funeral.The final confrontation between Obi-Wan and Anakin on the planet Mustafar, a lava planet, as well as the final duel between Yoda and Darth Sidious are far the best lightsaber battles of any of the films so far, and their tragic endings will only highlight the impact of the events that unfold in the film!While I'm sorry to see the cinematic portion of Star Wars come to an end, Lucas has ended the Star Wars saga on a grand fashion. All of John Williams music has pieces of the earlier prequels and some elements from the classic films to tie Revenge of the Sith with the other five films of the saga.Now, I'm more excited than ever for the upcoming television series, which takes place right after the events of Revenge of the Sith! Here's hoping that Revenge of the Sith, knocks off Titanic as the highest grossing film of all time!Buy your tickets now, because Sith doesn't just happen, it rules! By far the best of the three Star Wars prequels. Thank you George for thirty years of great entertainment! Get in line now!","Truly, this movie should not have been made. I do not understand how George Lucas saw the final version of this and proceeded to release it. The script had so much cheesiness it was hard not to vomit while seeing it. Honestly, I have seen better scripts in the worst soap operas. I liked some of the original movies- they had this excuse of \"oh it's the 70s they didn't have better movies back then.\" They were fresh. DO NOT WASTE YOUR MONEY ON THIS MOVIE. Now I know I am one of 2000 people voting on this movie and one of many reviews - so most likely those who read this will go see it, but I cannot imagine anyone finding this movie good. The actors must have smoked crack before coming to work. I would hope that Lucas thought to himself to get rid of the dialog completely when he saw the final cut. Such impressive failures such as the (paraphrased)- \"oh I love you Anakin\" \"No I love you Padme\" \"No I love you\" are so hard to sit through. or \"I will follow you master and I will do anything you say,\"\"Gooooooooooooood.\" I DO NOT UNDERSTAND HOW THE CRITICS RATED THIS WELL. Did Lucas Bribe them? He must have, because this movie will go down as a terrible addition to the art of film-making. Unless you can ignore all the dialog and the actors and just focus on sabers and fighting, spare the money and rent Godzilla- your money would be spent better.","BiiivAL","jaredpahl","mrbiscuit","actorman_us","healinghoe","cpricciardi","hyrumnephi","hanneskruppa","deaconblues1979","quinnburroughs","mjk280","claudio_carvalho","DICK STEEL","Lady_Targaryen","ccthemovieman-1","mockturtle","phusmus","robert-simpson","mshawn2196","sho32","toiler","esaborio","Fizzgig70","StarWarsFanForLife","pp460","5 June 2018","19 December 2015","8 May 2005","6 May 2005","3 May 2006","4 May 2005","4 May 2005","8 May 2005","19 May 2005","1 February 2010","27 May 2005","12 December 2015","18 May 2005","23 January 2006","5 February 2006","20 May 2005","21 May 2005","23 May 2005","24 May 2005","27 May 2005","2 June 2005","21 May 2005","27 May 2005","4 May 2005","20 May 2005","9","9","9","9","10","9","10","8","5","10","3","10","10","10","9","3","1","1","10","1","2","1","1","10","1"," This is war\n"," Epic, Emotional, and Powerful. George Lucas' Farewell to the Star Wars Saga is an Operatic Masterpiece of Blockbuster Cinema\n"," Lucas Redeemed!\n"," It's OK to be a STAR WARS fan again.\n"," The saga ends, or does it?\n"," Story + Special Effects = Success!\n"," A movie to bring balance to the two Trilogies...\n"," surprised.\n"," And Lucas' failure is complete.\n"," The greatest movie of all time!\n"," A disgrace\n"," The Final Part of the Saga\n"," A Nutshell Review: Star Wars Episode III Revenge of the Sith\n"," The saga is complete.\n"," They Really Did Save The Best 'Til Last\n"," Failed I have. Move to Canada I must.\n"," Perhaps a writer will rescue this franchise someday...\n"," Ignore the comments above\n"," Addressing Criticism and Glorifying Sith\n"," I am depressed and saddened.\n"," Rest in Peace, CGI Wars (er, I mean Star Wars)\n"," Final Episode doesn't improve much over the previous two (SPOILERS)\n"," What a piece of junk!\n"," All I can say is that Lucas has finally redeemed himself!\n"," Script worse than Godzilla, more cheese than in cheese factory\n"]}