{"primary":["Born Bad (1997)","https://m.media-amazon.com/images/M/MV5BMjA2NDQ4NjQ4OF5BMl5BanBnXkFtZTgwODAzNzUxMjE@._V1_UY1200_CR92,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0118752/reviews","tt0118752"],"secondary":["My wife and I loved this film.  Smart dialogue, great characters, clever plot construction.  The pacing in this film is non-stop.  Couldn't even get to the kitchen for some munchies.  We have never seen Corey Feldman this funny.  Taylor Nichols plays a good Fed...my wife loves him on that \"Married Man\"  HBO show.  The ensemble cast were all strong.  The twist at the end had us cheering.  That is why we give this film a \"Standing O.\"","This picture doesn't have any big explosions or expensive chase sequences. However, it does have really wonderful performances and an exceptional script that puts this at the top of my \"indie-must-see list.\"  Taylor Nichols and James Remar are terrific together.  The young cast surprised me with really consistent acting.  Usually, indie pictures have some weak link, but there are no weak links here.  Impressive.  Go get this one.","I love this film. Tense with great characters. The kid from \"Sandlot\" is excellent as is Corey Feldman. When the kids storm the bank, it is pure adrenaline. Inside of the bank, it becomes a bit like a \"Lord of the Flies\" situation where they turn on each other. Justin Walker from \"Clueless\" is wonderful. I saw this on \"Showtime\" while channel surfing. It was a pleasant surprise. James Remar is also quite good here as the small town Sheriff. Taylor Nichols who I love from \"Barcelona\" does a nice job too as a Federal Agent. I recommend this film for any fan of bank robbery movies with a lot of good characters. I was shocked to discover that Roger Corman was a producer on this, since the film is not a B movie.","This movie about a group of small town teens that decide to rob the local bank is excellent. Brian (Justin Walker) wants to get out of his small town, much like Jimmy Stewart in \"It's A Wonderful Life.\" However, unlike George Bailey, Brian is going to rob a bank to finance his dream of attending art school, even if his father is not supportive. The offer to Brian is to act like a customer and distract the guard. It's a tempting offer that if offered to many, I question what they would do. Anyways, Brian does it. When the Sheriff (James Remar) and his force surround the bank, things go from bad to worse. It's a standoff with even the Feds moving in to kill the kids if they have a clean shot. The Sheriff must prevent this and try to end the standoff in a peaceful way. Unfortunately, tensions rise, and the teens inside turn on each other. Some are out of control. The paper cutter scene is gruesome and hard to watch. Very intense!","The efficacy of this picture was best proven on the intended target audience, namely teens.  My 14-year-old son became so engrossed in this film that I rate it considerably higher than its imitator \"Mad City.\"  It sparked debate in our household on issues such as peer pressure and  loyalty vs. doing the right thing.  For that alone, I rate this film a 10!  Parents should watch it with their teens and discuss it afterwards.I very much liked the smart dialogue and consistent acting.  I thought that James Remar was adequate in his role, but the teenage cast really carried this picture.  Other IMDB users have praised Corey Feldman's performance, which truly is inspired.  All in all, I give this picture my highest recommendation.  Go get this one!","This film was so well-paced that I don't think I actually blinked while watching.  One intense situation after another kept me glued to the set. However, I would have liked to have seen Corey Feldman a lot more in this picture.  He just steals every scene that he is in.  This could be my favorite grown up Corey performance.  The ending was clever and unlike other films which back away from severing body parts of likeable supporting characters, this film goes for it!  I liked that it was not graphic blood and gore but left more to the viewer's imagination.  Bravo.  I literally had to wipe sweat from my forehead during this particular torture scene with a paper cutter.  Ultimately, the film works because of its likeable lead character and the awesome presence of my all-time favorite bad guy, James Remar(48 Hours, remember?)  I strongly recommend this film for anyone looking to break a sweat.","This film is like \"The Breakfast Club\" meets \"Mad City.\"  It's got one plot twist after another with Justin Walker, Corey Feldman, and James Remar delivering really great performances.  However, this movie is not for everyone.  If you don't like movies that \"go all the way\" with regards to violence, then don't watch the last twenty minutes.  My wife had to leave the room.  Of course, I couldn't take my eyes off the screen.  This is a really gritty, realistic teen drama.  I can't believe it came from B-Movie king Roger Corman.  This film is a must-see for those who are not faint of heart.  Highly recommended.","I just watched the DVD version of BORN BAD and found it to be tense, gritty and, near the end, too graphic for the faint of heart.  Justin Walker (Clueless) and Corey Feldman turn in superior performances.  For a low budget film, this picture delivers.  The depth of character and clever dialogue are two things not usually seen in a Roger Corman picture.  Check it out on DVD!","I recently rented this video after seeing \"Final Ascent\" by the same writer. I wasn't prepared for how intense this film would get.  I found it engaging from start to finish, and was rooting for the teenagers to get away with their attempted crime.  The ending was definitely disturbing with some of its implied violence, but well-done.  I highly recommend this picture.","this is a great movie for all Corey Feldman fans. This movie has a great cast of young actors. a group of teens decide to rob a bank to get some quick cash, but all goes wrong when a security gaurd gets shot and they take hostages","Born Bad is a well put together crime drama about a group of teenage kids. Teens as well as young adults would find this movie  well acted and entertaining. The movie is similar to The Black Circle Boys in the sense that a bunch of teenage boys go around their town making up their own rules and not caring about the consequences.","I just saw this movie on Showtime in the wee hours of the night.  I was viewing the beginning with one eye open, but instead of drifting off to sleep, I became invested in this crafty, nail-bitter of a movie.  It was very believable and engaging.  I could have done without so much profanity(as with every David Mamet movie I see), but thoroughly enjoyed the experience.  I know teenagers swear, but I don't need to listen to it. Anyways, the story had some interesting surprises which I won't reveal but if you have a chance to catch this movie on Showtime, I think you will enjoy it as much as I have.","As a camera operator, I couldn't help but admire the great look that this picture achieved.  The performances were excellent, as was the story. Just when I thought this film was about to slow down, it didn't. Heart-pounding tension, great pacing through editing, and a score that knows when to be quiet all come together here under competent and capable direction.  The camera was always in the right place.  Love that.","You get a bunch of young bank robbers and they hold up this bank in a small town and they get caught up in a hostage crisis.Born Bad is simply terrible,a film without logic or reason.The local police in the film coddle the teen crooks in the film thus allow the crooks to do anything they want to the hostages they have in the bank.Bank robbing is a federal offense,but the local sheriff doesn't want the FBI to do its job therefore he tells the head of the FBI task force at the scene that \"you don't want to kill a bunch of local kids do you?\" Ahh those \"local kids\" are now bank robbers something that is lost on the producers,director and writers of this lousy film.Filled with needless violence,profanity,political correctness more than enough to sink a real mainstream movie,the film shows how PC it is by having the female member of the bank robbing gang get away after the Feds finally get into the bank.She gets away,how she got past all those cops surrounding the block where the bank was is beyond comprehension,and she takes all the money and we see her running off supposedly the hero of the film without a scratch on her.The FBI agent wanted to talk to the kid who was the go between with the crooks and the police,he knew where she was and where she was going.But the town Sheriff(James Remar)said enough was enough and the kid was driven away,the girl escapes.Bad cop.Bad film.","A group of youth rob a bank, but the robbery turn into hostage situation as the police surrounds the small town bank.  The two stars James Remar and Corey Feldman has little to do as Remar plays a cop, and Feldman plays a supporting part as one of the robbers.  The film runs like a standard video release with nothing special, and the last reel of the film gets pretty bad. Not recommended.","This movie started out okay and had plenty of chances to turn into a better flick, but unfortunately, especially the last 30 mins, it really just drags and is boring.  In the end, it's a relief that it's finally over.  This movie is about some bored kids that decide to rob a bank so they can get out of their boring little town.  Anyway, Corey Feldmen is quite talented, but unfortunately we don't see much of him in this movie.","As an adult, I am grateful to have caught this movie by chance when I was a teen. During the time, I was experiencing familial problems. This particular movie managed to capture what I was seeing from a closeted world. How much peer pressure is too much? I actually had to purchase this movie because it reached me on a level unlike most films try to reach an audience. How far might an individual go for social acceptance? Who is the \"bad\" crowd? Teenagers do struggle trying to find out the answers to these questions, but ultimately...who is the \"pack leader\" if there must be one? Is it the strong? The beautiful? Perhaps the person we just all seem to like? Could it be the moral character? As far as the movie goes, the cast worked together as if it were predestined. I only hope that more directors and producers try to create a piece of work that reaches all of us like this particular movie reached me. I wish I could vote higher than ten because this particular title deserves much more.","rorydelmar","tere222hudson","righton2245","pjwhite286","cinecritdga","derekwalters007","Tim_Folger","singingbabies","sheilastein2003","jora26","barbara728","wilmaornstein","chitownframer","pooh-24","Serpent-5","Sarina","blaacabour","14 March 2003","10 March 2003","11 August 2007","11 August 2007","2 March 2003","26 February 2003","14 February 2003","27 June 2001","20 February 2003","16 October 2000","2 June 2000","17 March 2003","20 March 2003","22 August 2000","12 November 1999","30 November 2000","13 August 2008","10","10","10","10","10","10","10","10","10","10","8","10","10","10"," Standing O!\n"," Great actors make up for low budget\n"," Great Movie!\n"," Born Bad is AWESOME!\n"," A MOVIE THAT SPARKS DEBATE\n"," Whoa! Had me sweating bullets.\n"," One of the best independent films I've seen\n"," Tense, low-budget film a la \"Reservoir Dogs\"\n"," Disturbingly Great!\n"," Great Performance\n"," Good crime drama for the younger generation.\n"," A late night eye-opener\n"," Cinematography compliments fine drama\n"," Film Bad ***SPOILERS***\n"," Low-budget crime drama.\n"," Starts okay, goes downhill\n"," A lesson for us all\n"]}