{"review-url":["http://www.imdb.com/title/tt0107290/reviews"],"review-text":["In the year 1993, Hollywood saw something unlike anything else, the film Jurassic Park. Never before 1993 had dinosaurs been so breathtaking and realistic on the silver screen.The plot is very original. A group of scientists cloned dinosaurs, and are about to open an amusement park where people can see the dinosaurs. The creator John Hammond(Richard Attenborough) invites a group of people, along with his grandchildren, to see the dinos and enjoy a relaxing time at the park. Could anything go wrong, at the time it doesn't seem like it, but something else is going on. Employee Dennis Nedry is planning to steal dinosaur embryos. In order to do this, he causes a security breakdown so he can get the embryos and escape. He isn't the only one that can escape, as hungry dinos also escape. After this, everyone on the island is in danger, and loose dinosaurs are everywhere. That is where the fun in Jurassic Park comes in.This is an underrated movie according to the IMDb ratings. It isn't even in the top 250. Today, people don't appreciate it as much, mainly due to the fact that other movies like it have been made. Growing up in the 90's, this was one of my favorite movies. As a kid, I only watched it to see the dinosaurs, as I didn't understand a whole lot of it. Today, I realize how great the plotting and suspense are.This spawned two sequels. The second one wasn't bad, but the third wasn't very good. I would recommend seeing the second after this, but the third is passable.The story is great, how at first we see how the magic was created, and then later we see the magic turn into a disaster, in which everyone's life is at stake.The special effects are still good today, but they were revolutionary for back in 1993. The acting is good, and the ensemble cast is great. All of the action sequences are perfectly executed, creating plenty of suspense and tension.Younger kids may get scared by this, as I remember a lot of young kids being scared by it in 1993. If kids aren't scared by dinosaurs, they will probably enjoy the movie.I highly recommend Jurassic Park. It is quite underrated in my opinion, it deserves more credit than it gets.Watch this at all costs if you have somehow missed it and see what everyone was amazed about back in 1993.Enjoy","Even though it was adapted from a book, this unique story was destined to become an incredible film. Great casting, decent acting, great special effects, beautiful and perfect score by John Williams, incredible directing. I believe this movie has to be one of the greatest science fiction films ever made. Although not entirely true to the book, (though someone should never say a movie is not good because it is not exactly like the book because that really doesn't matter) Steven Spielberg made this story a landmark in special effects and a standard for thriller films to be compared to. It also contains some scenes that are instant classics, such as the first time they see the dinosaurs, the kitchen scene with the raptors, the end scene with the raptors and the T-Rex, the scene with the T-Rex and the kids in the jeep, and of course the scene where the T-Rex chases the jeep. I will keep this movie in my list of favorites and classics till the day i die.","I don't know why I loved this movie so much.  Maybe it was the utter amazement when I first saw the Brachiosaurus eat from a tree.  Or maybe it was my adrenaline rushing when two 12 year old were attacked by velociraptors.  It might possibly be the chills that went down my spine when the T-Rex first made his terrifying roar.  Whatever it was, it made me write this review.Allan Grant (Sam Neil) and Ellie (Laura Dern) are two successful paleontologists who are asked by a rich man John Hammond to come at his park for a major tour.  They agree and are taken to an island where \"Jurassic Park\" logos are everywhere.  The two paleontologists have no idea what they are getting themselves into.  The first dinosaur to make an apearance is the Brachiosaurus, which both of them are extrememly amazed by its giant apearance, and so is the audience.  What the two of them don't know is that there are much more terrifying and carnivorous dinosaurs who are about to escape and run loose....Directed by the mighty Steven Speilberg, Jurassic Park relied on more character development than any other creature-feature.  Usually you get second-rate actors who can't act, getting terrified by monsters that don't really exist.  Jurassic Park was the opposite.  It changed the way we looked at the world, and it will forever.  Based on the novel by Micheal Crichton, Jurassic Park was an amazing movie.From beginning to end, Jurassic Park bedazzled us with dinosaurs.  Dinosaurs that are EXTINCT.  There are a lot of cool cameos and the stars give great performances.  The whole family should watch this movie.  Not for the glossy title, but because of the dinosaurs.  I remember being a kid when I first watched it, and I remember loving this movie so bad.  The climax was excellent, and I am not saying what happens, unlike the sequel to this film (Jurassic Park 3).  A climax-less bad film, that was.  But this....this was magic.  And yes, it was a masterpiece.The magic of this film is what brought me into dinosaurs, too.  I had a \"Jurassic Park\" marathon today and I watched this movie, and I can still feel the magic.  You will feel the magic too once you see it.  I just have absolutely nothing to say except that Steven Speilberg will put a spell on you.  Even if you don't like creature-features, this movie will entertain you.  Steven Speilberg will take you to places that no one else ever will. And the \"life will find a way\" speech is here, ready to make someone feel that creating dinosaurs that have been extinct for millions of years is a good thing.Absolutely needless to say, Jurassic Park was a golden diamond.10/10 (One of the greatest films ever made)","Jurassic Park is a 1993 American science fiction adventure film directed by Steven Spielberg. It is the first installment of the Jurassic Park film series. It is based on the 1990 novel of the same name by Michael Crichton, with a screenplay written by Crichton and David Koepp. The film centers on the fictional Isla Nublar, an islet located off Central America's Pacific Coast, near Costa Rica, where a billionaire philanthropist and a small team of genetic scientists have created a wildlife park of cloned dinosaurs.Jurassic Park is the second Steven's Spielberg Classic cult Film. A great science fiction/action/adventure film. This film is great edge of your seat action sequences. It has a wonderful cast with wonderful performance of their characters. John Williams music score is excellent the same like is in Indiana Jones films. Beside Raiders of the Lost Ark is the second Best classic movie in the franchise. Jurassic Park (1993) was nominated for 3 Academy Awards for Best Sound, Best Effects, Sound Effects Editing and Visual Effects.I love this film to death! It is been 22.years since we got this awesome adventure dinosaurs flick. I know a couple of friends of mine that love this film including me. It is a cult classic film and It has a heart. We have Tyrannosaurus Rex chasing the group, Velociraptors chasing Tim and Lex after they are reaching the visitor center and they are in inside the main kitchen. Dilophosaurus killing Nerdy. We also have Triceratops in it and Brachiosaurus. They are other dinosaurs used in the film: Gallimimus, Parasaurolophus and Alamosaurus they both had a cameo scene in it. The special effects creating the dinosaurs by Stan Winston are FANTASTIC! The dinosaurs were created with groundbreaking computer-generated imagery by Industrial Light & Magic and with life-sized animatronic dinosaurs built by Stan Winston's team. To showcase the film's sound design, which included a mixture of various animal noises for the dinosaur roars, Spielberg invested in the creation of DTS, a company specializing in digital surround sound formats. Stan Winston and his team did a great job animating live Dinosaurs on a screen. Steven Spielberg did a wonderful job directing this film, it is definitely my second best childhood film from Steven Spielberg. The first best film would be Raiders of the Lost Ark (1981) which I love this film to death. The screen play written by Michael Crichton and David Koepp did a great job and the plot of the film was just awesome. The plot: During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.The crew cast all did a wonderful job of acting. The acting of this film was terrific and believable. Sam Neill as Dr. Alan Grant, a leading paleontologist did a wonderful job portraying his character. He act the character like he was written on his skin. Laura Dern as Dr. Ellie Sattler, a paleobotanist. did a wonderful job like how she cared about an ill Triceratops. I was really surprised how the character cares about an ill dinosaurs that she barely know and she wanted to help him was out stating! Laura Dern for me in this film was a heart and a key watching this film of how a good hearted person she is. Jeff Goldblum as Dr. Ian Malcolm, a mathematician and chaos theorist was really good in his acting and his character. Richard Attenborough as John Hammond, InGen's billionaire CEO and the park's creator was awesome playing his character. It is really a shame Richard Attenborough died last year and he isn't with us anymore. Ariana Richards and Joseph Mazzello as Lex and Tim did a wonderful job portraying John Hammonds grand children. I didn't know Samuel L. Jackson was in this film I really didn't know that. The whole cast was awesome in here.Music by score by John Williams is fabulous and fantastic I always love this song to death. There is everything in this film I love. How Dr. Grant, Lex and Tim are fighting to survive when they are trapped alone in the park. How tough and strong they are they don't panic and screaming they are fighting to come back save home. Lex and Tim are cornered by a pair of raptors inside the main kitchen. In one of the most terrifying scenes in the entire film, the raptors stalk through the dark kitchen, searching for the kids. Eventually, Lex and Tim manage to lure one of the raptors into the freezer and lock it in, but the other raptor chases them out of the kitchen. The scene was the most memorable to me and terrifying. Another terrifying scene is when Ellie discovers Ray's severed arm in the maintenance shed and she sees the raptor that eat Ray try's to eat her, that also scared me a lot. After the power was cut off on the electric fences and the kids with Alan are climbing over the fences and the power is turn back on by Ellie and Ray the fence electrifies Tim and he fly's down off the fence. The scene was awesome but also terrifying and real. I'm not sure what else you would want in a movie like this?! It is a perfect 10. I love this film to death! I love this film to death!! The action sequences are also awesome, the plot, the cast everything is great about this film.","My first epic movie to see on the big screen was Jurassic Park. I was only 8 years old and I had no idea what I was in for when I watched this movie. I was terrified but so enchanted by this world. Steven Spielberg brought back the dinosaur genre, a genre that was only used with caveman movies. Not to mention did it with incredible special effects. I remember seeing this movie for the first time and asked my mom if the dinosaurs were real or if they made giant robots. Those dinosaurs not only looked real but were absolutely terrifying. But what an adventure we took with Jurassic Park, the land where anything could happen with a crazy billionaire and upset employees who pretty much destroy the world for a nickel. One of the most memorable movies of all time that still holds up to this day, Jurassic Park is a film not to be missed.Billionaire John Hammond, has recently created Jurassic Park: a theme park populated with dinosaurs cloned from the DNA extracted from insects preserved in prehistoric amber. After a park worker is attacked by a dinosaur, Hammond's investors, demand that experts visit the park and verify that it is safe. Gennaro invites Dr. Ian Malcolm, a mathematician, while Hammond invites paleontologist Dr. Alan Grant and paleobotanist Dr. Ellie Sattler. They are joined on the island by Hammond's two grandchildren Tim and Lex. Hammond asks Malcolm, Grant, and Sattler what their thoughts are about having recreated dinosaur species. The group sets off to explore the park. The head computer programmer, Dennis Nedry, is secretly in the employ of one of InGen's corporate rivals, and has been paid to steal fertilized dinosaur embryos. During his theft, Nedry deactivates the park's security system, allowing him access to the embryo storage. The group is now parked in front of the T-Rex's cage and now they are fighting for their lives in Jurassic Park.I think one of the most memorable scenes is definitely the raptors chasing the children in the kitchen. What a tense scene that made you hold your breath the whole way through. You have to love Jeff Goldblum in this movie, when he tries to \"save\" the children from the T-Rex and instead pretty much gets his butt kicked, he gets saved later and as they are chased in the car by the T-Rex the only thing he can say as this giant monster is catching up faster and faster with each footstep, he says \"must go faster\" so calmly, how funny! But there is a moment that scares me more than the dinosaurs that I'm surprised no one noticed in the editing room, the granddaughter is scared to death screaming at Sam Neill that the lawyer left them and he replies with a dark look \"that's not what I'm going to do\". I responded that with \"I have much darker plans for you\", I mean his look was just so creepy! I digress, Jurassic Park is still a very fun movie that is the ultimate adventure. It's timeless and I can't wait to show my kids one day, what a great movie with wonderful effects and a wonderful cast and crew.9/10","JURASSIC PARK was the film that ignited my interest in filmmaking and drove me to get a degree in it, so I will always have a soft spot for it. I was eleven when I read the book, but all the technical stuff lost me and I never finished it. A couple years later when I heard the movie was coming out, I decided I would just see it instead. With advance tickets selling out fast, my mom was lucky enough to get some a few days before it's premiere. We stood in line for roughly thirty minutes before we finally got in. Even as the lights were dimming, I still had no idea what to expect. Within moments I was glued to my seat. The opening sequences remains one of my favorite scenes in any film and continues to give me goosebumps to this day. For the next two hours, I sat in my seat just staring at the screen as these marvelous, life-like creatures that were unlike anything I had ever seen before. The film was full of awe and scares. I walked out of the theater virtually trying to catch my breath. What a thrill ride the film had been, and I eventually went back and saw it a few more times. The film was a turning point in my life, as I said, because I walked out saying to myself, \"That's what I want to do.\" Sure the characters aren't deep and the dialogue isn't great, but who cares when the film is this entertaining? The actors are good in their parts, especially the always great Sam Neill, and the dinosaurs are incredibly life-like. The action is great, and the pacing (after a slow start) is relentless. The film has a few continuity flaws, but none of them matter. This film is great entertainment.","What can I say? Jurassic Park is one of the most underrated movies ever. Yes, I did say underrated. True, it is the fourth highest grossing movie ever (for the time being) and was a motion picture bible for eight-year-olds across the country, but it has never been regarded as artistically superior. When, in reality, it is one of the most artistically inventive movies ever. It contains all of Spielberg's magical strokes of genius from fantastic art direction and wonderful camera techniques to astounding technical quality ( which comes from his well known control over technology). The minor flaws of a theme park are masterfully embedded into the art direction, script etc. and the acting is superb. This is one of the only movies I've seen with great acting by children. Spielberg's camera usage ranges from foreshadowing the appearance of dinosaurs with extreme up-angles to exquisitely composed scenes of the dinosaurs' \"interaction\" with the characters. Aside from technical quality, Jurassic Park bears powerful social messages of human intrusion and destruction of natural environment and the self-revering nature of man. Also, it had an undeniable effect on cinema being one of the first movies to use CGI at such a large scale. However, the most ingenious aspect of the film is the portrayal of the dinosaurs as animals rather than ruthless monsters. At many times throughout the movie, the humans are portrayed as antagonists and the respect and appreciation of the dinosaurs is wonderfully developed. And, best of all, like star wars you can analyze the movie all you want or just sit back and enjoy the ride.","This was obviously the most sophisticated portrayal of dinosaurs at the time, and it doesn't age a bit.  Sam Neill plays Dr Alan Grant, a paleontologist who is persuaded to check out Richard Attenborough's new theme park, only to find that he has managed to clone dinosaurs.  There is plenty of action, and the dinos look so real as to be positively scary!  Sam Neill puts in his usual incredibly brilliant performance, and you can really believe he is acting with the creatures!  Jeff Goldblum as usual seems to play himself, as Professor Ian Malcolm, an expert in chaos theory who is convinced the park is a bad idea.  The cast are amazing, the effects are amazing, this whole movie is amazing.  It doesn't get any better than this!","Simply one of the greatest films of all time. How on Earth it is only rated as 7.9/10 I'll never know.It has a great plot, structured of course around Michael Crichton's equally brilliant novel, and the graphics are absolutely superb. Jurassic Park, along with the sequel 'The Lost World: Jurassic Park', had Dinosaurs that were actually convincing. Of course, there was some artistic license involved - certain behaviours of the animals were exaggerated or entirely fabricated - but that in no way detracts from the film. They are certainly better than those in the comparably average third instalment in the franchise, 'Jurassic Park III'. Living in the 21st century (or 20th, as it were) this film gave us a recreation of these creatures that was genuinely believable.For all their fancy graphics and obscene budgets, films such as 'Avatar' will never compare to the likes of Jurassic Park.","What can be said about this movie that hasn't already been said? Who knows. We all know that this has some of the greatest special effects, even today. Also, if there's anything that can match the awesome T-Rex, it's the movie's musical score. I swear, listen to it more than once, and you're bound to see the movie yet again, if for that sole reason. It's that powerful. Oh sure, acting isn't this movie's strong suit, but who looks for acting in a Dinosaur thriller? Who?!Anyway, I think I've made my point. Jurassic Park: One of America's greatest classics. Steven Spielberg created magic with this movie. If you haven't seen it once, you haven't seen it at all.","Wow! That's about all one can say about this movie. The first time that I saw it I was mesmerized. The movie looked so cool and hey, it actually had a good plot. If you haven't seen this movie yet, get out from your cave and see it right away. I have seen this movie umpteen times and it still shocks and suprises me. If you have a DVD player I suggest that you buy the Jurassic Park 2 pack as soon as possible. The movie sounds and looks great, and the extras are cool too. So to summarize go see this. Spielberg is a true genius. Almost all of his movies were great. 10/10!","I first saw this back when I was little. If I remember correctly, it was also a big thing when it came out. I even had a backpack with a Velociraptor head sticking out of it for school. It was such an amazing achievement as a movie itself and the film is so wonderfully done that there's no doubt of why it has held up as long as it has and will remain the best dinosaur film ever created.The dinosaurs in this film look more realistic than any other prehistoric film, or even most movies today that try to pass off crappy CGI has reality. The acting was spectacular, and aside from how wonderful the creatures look and how vicious and exciting they were like no other dinosaur film had had them before, the plot and characters were solid and incredibly entertaining where you didn't think they would be so amusing. I will have to say again that one really huge reason why most people loved this movie was because of the special effects, but here again, isn't that an accomplishment in itself? Having your audience enjoy the film because of how realistic and fresh you are able to make it feel and look? I have never seen another movie with better effects than this one, ever. I am sure none of these horrible effects dinosaur movies that have been coming out lately could ever live up to the greatness of Jurassic Park.I am always going to love Jurassic Park for it's witty, unbelievable maneuvers and incredible screenplay though, as well. It was so properly thought out and executed, where most might have been expecting it to be nothing but high levels of adrenaline rushes with brainless action, which there was pulsating action, it just certainly wasn't as mindless. Many who dislike Jurassic Park really just have all the same reasons the average movie-goer would have for disliking a film, yet I haven't heard anyone fully describe and explain, well, what they truly thought were faults with this film, which gives me reason to believe that Jurassic Park is a masterpiece, for I, myself, have no faults with this film, except that I have seen other films that I enjoyed more. . . just a little more.","Look up the word \"awe\" in the dictionary... ya know what you'll find? Jurassic Park. And now in 3D! Usually, I don't really like post- converted 3D in movies, but this one won me over. Ever since I was a little kid, I've always loved Jurassic Park (I think we all did) and I'd always heard that it was one of the best movie theater experiences ever. Unfortunately, I wasn't born when this originally came out so I never got the chance to experience that... until now! And damn, were they right when they said it was an awesome movie theater experience because it sure as hell is. It's so fun, engrossing, and thrilling to watch it on the big screen, with all the sound surrounding you (the sound in Jurassic Park has got to be some of the best sound in a movie ever). Jurassic Park is also one of the most monumental movies of all time. It defined CGI. The CGI and special effects in this movie still holdup today and are even better than most movies today.The story of Jurassic Park is that a really rich guy has cloned dinosaurs to make an amusement park full of living dinosaurs (you would do that if you could too). Because they are these live dinosaurs in the park, his investors say that he needs approval from experts, so he recruits Dr. Alan Grant (a paleontologist who is more or less the protagonist of the movie), Dr. Elli Sattler (a paleobotanist), and Dr. Ian Malcom (a mathematician who's character is pretty much the show stealer). Through a number of circumstances, the dinosaurs get loose and all hell breaks loose. Now, we have our movie being one of the most awe- inspiring movies ever; as well as being one of the most suspenseful movies ever. When the characters first enter Jurassic Park, you see the many dinosaurs in the distance and the theme (one of the greatest movie themes of all time) is playing in the background. Your jaw just drops. And the dinosaurs look awesome. Sometimes they're CGI, sometimes they're animatronic. Sometimes they're amazing... oh wait, that's all the time. One of my favourite scenes is when the T-Rex is attacking the car and a flashlight shines in its eye and the eye dilates. That just shows how detailed and alive these dinos are.But the dinosaurs don't wreak havoc until about halfway, or even 3/4, through the film. Even yet, the movie does a brilliant job of immersing you into it, bringing you onto this island, and getting you to care for the characters. The dialogue and acting are so good that you feel as though you're there with the characters (it drags sometimes but it's easy to get past that). And when they're in peril, you feel as though you're in danger too. I just can't stress how substantial the suspense in Jurassic Park is. The 3D does add to that, too. The 3D in this movie is probably the best post-converted 3D I've ever seen and it works really well.Jurassic Park is really a movie that everyone should experience (notice how I didn't say \"watch\"). If you get the chance, see it in theaters and have your mind absolutely blown. The movie is full of awe and imagination; it sometimes makes me feel like a little kid again. The characters are likable; their dialogue is believable and sometimes humorous. The dinosaurs are awesome. The suspense is intense as hell. The soundtrack is perfect. It's a classic...","It's hard to believe that it's 6 years since this film appeared at the cinemas. At the time it was a truly ground-breaking film, managing for the first time to portray dinosaurs in an extremely realistic manner, unlike those plasticine monsters that we were forced to watch in previous monster movies. Jurassic Park will also be remembered as the movie that finally made George Lucas sit up and realise that it was possible for him to make his prequels.In hindsight, while it is still an extremely well directed and tension filled movie, the script did seemed dumbed down in order to appeal to as many people as possible - but that's really irrelevant since this film is all about dinosaurs. One of Spielberg's brilliantly directed films, it even managed to make me forget Spielberg's previous disaster of a movie - do you recall HOOK?8/10.","Steven Spielberg is known for making great movies like, \"E.T.\" and \"Schindler's List\". But on June 11 1993. He released my favorite movie, \"Jurassic Park\".What make's this movie great is the special effects. They really brought the Dinosaurs to life. It also had some nice suspenseful scene's. Also, the acting was good. Sam Neil does a nice job as Alan Grant and Richard Attenborough does a great job as John Hammond. Plus, the theme song was incredible. Sometimes when you listen to it, it feel's like you're going to cry.In the end, \"Jurassic Park\", is a great film and it is definitely worth watching.","This movie was released during my childhood while I was already a dinosaur enthusiast. I saw it 2 times at the cinema and as far as I can remember these were the only 2 times I ever saw an audience applaud at the end. It made an big impression. Computer generated images were new at that time and we didn't know what to expect. But I think I can speak for everyone if I say we were blown away. The dinosaurs looked so real. And even in the years after that computer generated images in other movies were just not as good and realistic as in Jurassic Park.Another thing that made this movie is the soundtrack. John Williams (the composer) absolutely nailed it! The music at the arrival to the island combined with the the adventure ahead was just breathtaking.So you have a good story, good actors (I loved Jeff Goldblum for his humor), state of the art special effects and an thrilling adventure. This makes it still my number one of all time and I don't expect that to change anytime soon (or ever).","''Life, uh... finds a way.''One of the best & most iconic movie quotes of all times.I don't know what can I say about this movie that hasn't been said. Really...Considering this movie was made in 1993, visual effects are of incredible quality, as you see it better on blu-ray. When it comes to story, it's completely original, nearly flawless. I can't say too much about the acting. I believe acting is not the movie's strongest point. But still, it was enough for that movie. You don't need to be like Marlon Brando in a sci-fi movie about dinosaurs and has great visual & sound effects. The movie is very fun to watch.I also sensed a small message like, ''don't mess with nature''.Best thing about the movie (for me) was the score. Especially the ''Welcome to Jurassic Park'' scene. Of course we're talking about John Williams, the guy who wrote the theme for Star Wars, so that's not a surprise.Highly recommend it.9/10","Jurassic Park. An island full of dinosaurs who terrorise people; a simple premise but extremely well done. From beginning to end this film is just an enjoyable watch. Back in 1993 when it was released these never-before-seen effects had to have wowed audiences, and even now it still holds up with the anamatronics, CGI combo, it is really good; I've seen worst stuff in other movies and TV series. The characters I thought were pretty well done and acted, you really didn't want certain things happen to certain people and I really like Sam Neil as Alan Grant. Now, I was really exited to watch my favourite film on the big screen and especially in 3D, I watched it in IMAX as well, something I had never done before, and boy did it deliver. The 3D in this movie was one of the best I've seen in ages, better than Man of Steel and Iron Man 3 by far. Jurassic Park in the third dimension brought a whole new life too it, just some of the scenes with the trees, and leaves and then an awesome scene in the kitchen was good in 3D. So yes, I think Jurassic Park will continue being my favoured film for a long time to come.","I was an eager, dinosaur loving child the first time I experienced Jurassic Park. Needless to say, I expecting a fun, action packed adventure featuring dinosaurs. I never foresaw the unforgettable memory of a white-faced me wailing at the shocking death scene of a side character (hint: Dilophosaurus spit).Now, in anticipation of the upcoming Jurassic World, I re-watched Jurassic Park (along with watching it's 2 sequels for the first time). The film was absolutely stunning the second time around.The plot revolves around a group of people employed to verify the safety of a theme park being built by the CEO of InGen and creator of the park John Hammond (Richard Attenborough); the group consists of lawyer and the representative of investors Donald Gennaro (Martin Ferrero), mathematician and chaos theorist Ian Malcolm (Jeff Goldblum), paleontologist Dr. Alan Grant (Sam Neill) and paleobotanist Ellie Sattler (Laura Dern). Ad they are inspecting the park, a series of events lead to dinosaurs breaking loose and instilling peril among the crew.All of the characters are richly developed. Jeff Goldblum's in particular delivers plenty of memorable and quotable lines while always remaining cool throughout the mayhem. Others are similarly well rounded and developed, including the side characters that ultimately get eaten (or spit at) by dinosaurs. Jurassic Park isn't an action packed film. However, it's world building and rich characters make sure that there is no need for constant mayhem. The first 45 minutes or so is full of setup and visual wonders. Interesting characters are introduced, breathtaking dinosaurs are seen and a well built theme park is full of wonder and intrigue. Due to all the well executed setup, when the dinosaurs actually break free, we know the characters well enough to actually root for them to survive the ordeal. Furthermore, due to the lack of action, every time there is action, it's instantly unforgettable. That is one of the things that makes Jurassic Park special. The special effects and realistic looking amimatronics are still awe inspiring over 20 years after its release and have set a high bar for later films to follow. The sheer terror is this film is unmatched by nearly every other film in existence (excluding Jaws, Aliens and The Exorcist). There is plenty of suspense (the kitchen scene is a highlight) and tense moments to make the most out of each jump scare. The score orchestrated by John Williams is simply genius. His two main themes are absolutely iconic, catchy and unforgettable. They make scenes of awe even more awe inspiring and scary scenes scarier. It complements the film more than perfectly. Overall, Jurassic Park is a timeless classic that still affects films released decades after. A true masterpiece.","This movie is simply a legend. A date in history of cinema.With Terminator 2, Jurassic Park is one of the first movie that shows wonderful CGI. And now, it is forever one of the best, until his 21 years. Everything is just awesome. Spielberg at the summum of his art, John Williams create another time a legendary ost, and all the actors are just more than best, and especially two of the them. Richard Attenborough(RIP) play John Hammond, owner of Ingen and creator of Jurassic park. He is a very great actor (and director). He don't play John Hammond, for everybody who love cinema, he is John Hammond. And Sam Neil, what can i say about him ? Simply he is one genius. He is at the best with playing Alan Grant. For some people, he became just one role. Watching him in another program, i am sur that somebody would automatically said : it's the guy from Jurassic Park, Doctor Grant ! And that is the best for an actor, he leave his mark in the collective inconscious. Sam Neil is more an actor, he is a great man.","Perhaps more so than any other director in film history, Steven Spielberg has locked into that most desirable niche of movie-making: pleasing everyone at the same time. When his spectacular action-adventure Jurassic Park was first released in 1993, he left critics, film buffs, casual viewers, parents and children equally spellbound. Twenty years later, the film has been re-released in both 3D and IMAX, allowing a new generation to experience the magic, and old fans the chance to relive it again.Eccentric millionaire John Hammond (Richard Attenborough) has created the ultimate theme park on a secluded island, and he wants to offer a sneak preview to a select group of individuals (Sam Neill, Jeff Goldblum and Laura Dern). Of course, the prehistoric attractions don't much appreciate being detained for the amusement of others, and begin to cause havoc as soon as they take the opportunity to escape from their enclosures. An extremely imaginative plot adapted from Michael Crichton's novel of the same name, it sets the foundation for a rip-roaring battle for survival.For many viewers that first saw Jurassic Park as pre-teens, the greatest thrill will come from appreciating, to a greater degree, the way the film deftly builds suspense. Cleverly building up to the revelation of the 'meatasauruses' by stunning us with the visual treat of cuddly herbivores, when we do finally meet the imposing Tyrannosaurus, it is one of cinema's most exhilarating set pieces, only to be topped some time later by the thrilling cat-and-mouse game in the kitchen.It is a testament to the incredible skill of the animatronics and visual effects team that the film's most dated quality is the occasionally cheesy dialogue that burdens Lex and little brother Tim. The dinosaurs are clearly the main event, but the undercard of Jurassic Park spares no expense, with touches of class including Dr. Grant's personal evolution from a child apathist to a fully-fledged family man and a miasma of Shelley-esque criticisms of man's innate desire to play god while drunk on the illusion of total control.To call this the movie event of the year would be to make the grossest of understatements. Experiencing this glorious monument to total escapism on the world's biggest cinema screen is simply mandatory for anyone was has ever felt goosebumps in a theater. Bring your kids- they'll never forget it.*There's nothing I love more than a bit of feedback, good or bad. So drop me a line on jnatsis@iprimus.com.au and let me know what you thought of my review. If you're looking for a writer for your movie website or other publication, I'd also love to hear from you.*","i really enjoyed this movie. it was worth my time. i also loved the casting and the director. i would see it again. in fact i actually bought it. i recommend it to someone who has not seen it because it is entertaining. even thought there are a few flaws in it it still is worth it. my sister also loves this movie and my whole family enjoys it as well. i love the sequels too. they actually match up with the first movie and there not one of those movies that you have to watch for a half hour to figure out what is going on.thanks a bunch-Elee","It still baffles me why this brilliant movie isn't in the top 250 movies for IMDB! it's amazing! I think this is the kind of film that people take too seriously and don't see the obvious reasons what make this such a great movie.  For one such as \"Jurassic Park\" it represents everything a summer blockbuster should be, (and why Spielberg is the king of 'blockbuster summer' movies).In all fairness, a film like this is only worth watching for the special effects (which still remain top-notch).  It is a dinosaur movie- it does exactly what it says on the tin- it thrills and amazes and never lets up, it is perfect popcorn fare and not since \"Jaws\" (the first proper summer blockbuster!) has a film so brilliantly had such an affect on movies which were to follow. Essentially it is \"Jaws\" on-land and it does so perfectly, with great pace great set-pieces.  I wish this film was in the top 250, if any movie deserves it , \"Jurassic Park\" does, not just for being such a great film but also for revolutionising films from there on out!!Brilliant!!!","This is a film that has truly stood the test of time and has remained a modern classic of the Hollywood blockbuster system. Deservedly becoming the biggest film of all time in 1993 and launching the most entertaining film series ever made, Spielberg's film contains all the cliches a blockbuster should have and ensures that it remains good fun. We have the courageous scientist in the shape of Sam Niell, his fiesty girlfriend courtesy of Laura Dern, a doom and gloom expert in the causes of the problem at hand thanks to a brilliant performance from Bob Peck and the quirky scientist type who prophesises doom from the get go in the shape of Jeff Goldblum. This is fun and has remained so for the last ten years.Where the film has remained so good over the past decade is in its use of CGI and at the time state of the art special effects. They still haven't dated and look fluidly real as if the technology had only been made yesterday. Undoubtedly the dinosaurs are the star here (none of the actors have headlined each film with a change of performer for each one, Goldblum in the second installment, Niell returning for number three), but it doesn't matter because the dinosaurs here are truly movie stars in their own right and like characters in an ensemble film they all get their moments. The T-Rex gets to cause spectacular destruction, the Raptors get to be the vicious and conniving villains of the story, the Brachiosaurus ensures it grabs our awe while the Tricerotops gains our sympathy.However, Spielberg ensures that it isn't just the dinosaurs who are the stars here. He creates tension in the way that only he can with prolonged set pieces such as the T-Rex attack and the moment Alan and Tim have to race down a tree with the threat of a car falling on top of them. Sure it ain't art, it's great entertainment and it is great fun and it here where Spielberg ensures the film classic status. He uses the two hour frame to set up events and the story in the first hour and then let the chaos rip in the second with suspenseful action sequence after suspenseful action sequence and it works. While you may not look to performances in a film like this, it does have some fantastic actors. Niell seems surprisingly well suited to being a Spielbergian hero who starts of disliking children only to have his heart melted at the end. He appears to be having great fun playing the guy who saves the day. Jeff Goldblum almost runs away with the entire film as Malcolm, the quirky off beat nature of the character ensuring many a great one liner while Richard Attenborough is heart breaking as the Walt Disney like John Hammond whose dream becomes a violent nightmare.The film is great fun from beginning to end and deserves to be up there with Jaws and King Kong as one of the all time great monster movies.","This film is easily one of my favorite movies. I saw this movie when it came out in theaters back in 1993; I was only 9-years-old and, though some scenes scared the crap out of me, it blew me away. I was amazed at how, for the first time in a movie, I felt like I was watching REAL dinosaurs. For those who haven't seen this movie (there are people like that?), it centers on a billionaire's attempt to create a new amusement park on an isolated island creating bio-engineered dinosaurs; when a group of specialists are brought in to examine the park, things go terribly wrong.I absolutely loved the story of this film; I loved it so much I had my parents buy me Michael Crichton's novel and I read it 3 times through the course of my fifth grade year. It was then that I fell in love with the work of Crichton and found myself reading the rest of his work. While, yes, the movie did divert pretty heavily from the book, I still felt it was a great adaptation. It's Spielberg's version of Crichton's story, so I don't mind the mass differences. The movie is much more family-friendly than Crichton's novel and I would love to see a another version eventually, a darker version that sticks closer to Crichton's novel. Unlike most instances when I can say \"The book was better\" or \"The movie was better\", I don't feel the need in this case because they were both fantastic.The cast did a terrific job. Sam Neill, Laura Dern, Richard Attenborough...all were great in their roles. Though my favorite performance came from Jeff Goldblum as Dr. Ian Malcolm, the arrogant chaos theoretician. I've been a fan of Goldblum for a while and I thought he was the perfect choice for the role in this movie. Of course, I have to rave a bit about the film's special effects. As I mentioned before, this film contains probably the most realistic dinosaurs seen in cinema. A seamless combination of practical animatronics and CGI were used to bring the dinosaurs to life. By now, the effects seem a little dated but they continue to stand strong even now, 15 years later.This movie is one of those films that every must see. It grossed $350 million in the US alone. The film marked yet another milestone in special effects in cinema. And most importantly, it's just entertaining."],"review-user":["FrankBooth_DeLarge","STACorpus","Go_rated_R","ivo-cobra8","Smells_Like_Cheese","MichaelM24","master of the obvious","stephie-12","bluemoonrising26","Pythonman","dvdmrp","Dragoneyed363","rahmannoodles22","Rob Paul","Criticman12","Leporinum","MrLunatic","OlieRendch","vikesh2206-921-864154","BobbySixkillerHammond","Jonathon_Natsis","ELEEsHalfArabs","seamaso","eamon-hennedy","brando647"],"review-date":["5 September 2005","4 October 2005","16 August 2001","10 October 2015","18 November 2003","6 July 2001","21 June 1999","26 February 2004","22 November 2011","8 June 2005","6 November 2000","4 May 2008","19 December 2013","9 July 1999","26 January 2011","18 June 2015","6 July 2018","26 August 2013","19 June 2015","29 October 2014","1 April 2013","21 April 2006","9 August 2002","11 June 2003","2 May 2008"],"review-rating":["10","10","10","9","9","10","10","9","10","10","10","10","9","10","10","10","10","10","10","10","10"],"review-title":[" A Groundbreaking, Heart Stomping, Dino Sized film\n"," incredible movie\n"," One of the greatest films ever made.\n"," A Spielberg Cult Classic Film and a great science fiction action adventure film of all time.\n"," A time when I thought dinosaurs were real\n"," exciting\n"," Brilliant\n"," Groundbreaking!\n"," Criminally Underrated By IMDb!\n"," As said, the Definitive blockbuster movie\n"," Great Movie! One of Spielberg's best\n"," The best dinosaur movie there is; one of the best movies in general\n"," Welcome to Jurassic Park.... Noodles Review\n"," Still a land mark in film making\n"," My favorite Movie\n"," Unlike anything the world had ever seen before.\n"," Life finds a way...\n"," A milestone in cinematic history, a huge achievement in CGI effects, and by the most well-known director in the world.\n"," After careful consideration, I've decided to endorse \"Jurassic Park\"\n"," A legend\n"," A genre staple gets a much deserved re-release in 3D and IMAX.\n"," Excellent\n"," I'm amazed this isn't in the top 250!!\n"," The way all blockbusters should be...\n"," I LOVE this movie!\n"]}