{"review-url":["http://www.imdb.com/title/tt0110604/reviews"],"review-text":["An amazing piece of film that was well-conceived and kept me on the edge of my seat. Brilliantly orchestrated in its timing, and the comedy kicked in exactly when the tension needed a release. The acting was generally well-done (the \"Director\" should've asked Alec Guinness for acting lessons), and the shot selections were impressive (as in elongating the hall as Billy tries to race to the door in the studio). This movie didn't let up since the opening scene...","\"Mute Witness\" is a terrifying roller coaster ride, with lots of black humor thrown in to perfect balance. What makes it so totally different from the usual thriller/horror, apart from its Moscow setting, the Russians are played by real Russians actors, even the American mute woman - excellent casting idea, because she acts brilliantly. More twists to the plot than you could hope for and the main part of the nerve wrecking tension comes from suggestion or chases and less from graphic violence, which one would expect from a film of that genre and plot. Apart from Alec Guinness' guest appearance, no big names, which only makes the film more attractive. I would be surprised if \"Mute Witness\" hasn't got cult status by now among the fans of the genre.","** 1/2 out of ****For the better part of an hour, Mute Witness is a first-rate thriller. So good, in fact, it was quickly becoming one of my genre favorites. Good premise, great direction, mostly terrific acting, smart writing, this one had it all. That is until just a bit past the one-hour mark, when the film suddenly makes a mind-boggling idiotic decision to change the tone and approach of the material, and it all devolves into a cheesy mess that left a sour taste in my mouth. This is the perfect example of a would-be great film that's merely recommendable thanks to an awful finish.Billy Hughes (Marina Zudina) is the make-up artist for a cheesy slasher flick being filmed in Russia. A quick intro shows us that she may be mute, but she's pretty good at her job, which she may have also gotten because her sister is married to the director. After shooting for the day is wrapped up, Billy stays behind and is accidentally locked inside the soundstage. Waiting for help to arrive, she stumbles upon two of the film's crew members shooting a porno film, which quickly becomes a snuff piece. After a fairly amusing opening scene and an effective set-up of the characters, Mute Witness kicks into full throttle quickly. Immediately after Billy witnesses the murder, we get one of the more suspenseful extended setpieces I've ever seen. These fifteen minutes consist of Billy creeping around the soundstage, desperately trying to avoid those crew members she just witnessed. It's a genuine breathtaking, edge-of-the-seat sequence, quite possibly the movie's highlight.But the fun's not over. A little over halfway through the picture, we get another great stalk-and-slash sequence inside Billy's apartment. You even get to see cutie Marina Zudina fully nude, in some of the more gratuitous bits of flesh baring I've seen in a while (she has a great-looking butt), not that I'm really complaining. Zudina is probably the best thing about the film, she's not only extremely cute, but also smart and likable, a quick thinker who evades her attackers not because she's physically stronger or faster, but because she's smarter. (spoilers) While I figured the film couldn't possibly keep the momentum up, I wasn't expecting such a sharp turn of events, either. The film suddenly goes from edgy thriller to a cheesy spy film, packed with silly and predictable double-crosses and plot twists. The simplicity and stark atmosphere of the first hour is gone. The number of villains is bloated from two scary individuals to what is apparently the entire Russian mafia. The introduction of the undercover cop robs the movie of its key strength. The fun of the plot was watching Billy outthink and outsmart her attackers by herself. Bringing this guy into the mix shoves her into almost a supporting role and virtually reduces her to a mere sidekick/damsel in distress. Possibly worst of all is the decision to place Billy's sister and her husband into the thick of the action. I don't think I've ever seen such an extreme case of two characters who I initially liked that come to annoy me so much by the climax. These two are made into bumbling fools, they've basically become the film's comic relief. Attempts at humor include them accidentally killing the bad guys, dropping bullets in crucial situations, and generally acting as clumsy as possible but still somehow not getting themselves killed in the process. Director Anthony Waller had such a firm handle of the movie's pace and tone that I find it hard to believe he'd suddenly undo all his solid work in an instant. But the film's downward spiral is entirely his fault, the man wrote and directed the picture. He should have just stuck with what worked. But the first 2/3's are so much fun, it's worth recommending to thriller fans.","This may be the most tension-filled movie I have ever seen.In fact, it's so nerve-wracking, I haven't been able to watch it again after viewing it two years ago, but I will since I have the DVD. There were a couple of scenes in here that are almost too much to watch....so if you've got problems and need to \"escape\" for an hour-and-half this film will get your mind off anything else. The Russian actress Marina Zudina did a super job in facial expressions alone, which she had to do since her character in here is a mute. She plays a cute and wholesome makeup artist for a sleazy filmmaker. After the day's shooting is done and \"Billie\" is about to leave, she hears something. She takes a peek into the room where they were filming and discovers they are now shooting a \"snuff film\" and actually killing someone. Billie's eavesdropping is discovered and she runs for her life as the killers go searching for her in this big warehouse-type building.There are two extended scenes in which our heroine is running for her life and both of them will wear you out. The first I described above. The second scene, the climactic one, goes on too long and isn't as well done as the first. In fact, the film should have been trimmed a bit but, overall, since it's so good at keeping our attention, then it served its purpose as entertainment.","In Moscow, the clumsy director Andy Clarke (Evan Richards) is making a slasher movie in a studio set with Russian and American cast and crew. The responsible for the makeup is the mute Billy Hughes (Marina Sudina), who is the sister of Andy's girlfriend Karen Hughes (Fay Ripley).One day, Billy needs to find a mask for the shot on the next day and she stays after hours in the studio set seeking out the object. However, the janitor locks her in the studio alone and Billy cannot find a way out.When Billy sees light in the studio, she accidentally witnesses the Russians Arkadi (Igor Volkov) and Lyosha (Sergej Karlenkov) making a porn snuff movie and brutally killing a woman. Billy succeeds to escape, but the police officers do not trust on her. Further, the powerful Russian mafia chases her believing that Billy has a diskette with evidences against the mobsters.I saw \"Mute Witness\" eighteen years ago and I loved this film. Yesterday I saw it again, now on DVD, and it still is a great film that combines thriller and horror with black humor in a plot with many twists. The director Anthony Waller masterly raises tension and relieves with black humor, startling the viewer and then making him or her laugh. Unfortunately the conclusion is a little disappointing but it is worthwhile watching this wonderful little film. My vote is eight.Title (Brazil): \"Testemunha Muda\" (\"Mute Witness\")","I don't know how this film went unnoticed for so long.I saw this film on TV, i was flipping through the channels and came across this unexpectedly well made film. i missed the first, probably , 10 minutes, but that does not matter..this film literally gripped me, it is a real spine chiller.The absence of well known actors in the film adds on to the effect,u do not know what to expect from the actors because they are new. U never know when they will get killed or what they are up to. so it is all the more tense.Even though there are many new faces their performances were top class.The filmmakers play with your mind, just revealing enough gore to make imagine the rest. The shock, fear, horror and helplessness are also brought out well by characters in the film.The well written situations n twists,fast camera movements, slick editing and superb direction makes it an excellent suspense thriller. This film actually switches between the genres - horror and suspense thriller leaving the viewer clueless and tensed. Undoubtedly comparable to Hitchcock. I could not even move from the TV even during the commercial breaks .. i was the helpless MUTE WITNESS to this superb film.","I couldn't stop watching this movie, though it was far past my bedtime. \nComparisons to Hitchcock are deserved -- this thing really plays with you. It walks a wonderful line between real, immediate suspense and a dark, distancing humor.  Like many of Hitch's heroes, our doe-eyed mute witness has innocently stumbled into something truly horrific -- and we are taken on quite a ride with her, at turns identifying totally and feeling her fear, at turns watching in thrilling suspense as she is placed further in jeopardy.The filmmakers have put in a lot of tender care in working this out.  Right from the opening shots, they engage and challenge you to determine what is real and what is fabrication; who is to be trusted and who is a monster. The plot twists and turns unpredictably.  Suspense is created with a combination of carefully chosen camerawork, imagery, music --  but most simply THE EYES of the characters, which sends raw fear right into you. \nA warning:  there is some frighteningly real gore, as well as some nudity. The horror scenes are done in an emotional way that make them far more scary and disturbing than in any teenage-slasher pic.And a teen-slasher pic it AIN'T.  The characters are quirky and feel like real people, for one thing -- a couple (including the heroine) you may even find endearing as I did.  There will be no mistake you're watching a movie made for grown-ups.  I mean, Alec Guinness is in it, briefly, and you know he didn't NEED the work!Pop this in the VCR some night when you can't sleep. . . and don't want to, yet.","A couple of years before SCREAM spoofed the slasher/horror genre with savvy, self-conscious young things knowing every trick in the book of what to do and not to do in a precarious situation, a little movie produced in Russia hit the theatres without any grandiose pretensions.This movie was MUTE WITNESS. Starring a cast of unknowns (except an extremely brief cameo by Sir Alec Guiness whose scenes were purportedly filmed eight years prior to the actual filming of this movie), it told the story of a mute make-up artist, Billie, who is working on a film on location in Russia produced and directed by her sister's boyfriend Andy. She is unaware that the set has closed when she goes to retrieve her belongings and inadvertently stumbles onto a porn shoot that becomes extremely bloody. Overcome with horror she alerts the murderers of her presence, a chase ensues, and finally she is rescued by Andy who take her home as they alert the police. The trouble is... there is no body, no evidence that anything of the sort took place. Even so, a mysterious inspector seems to be on Billie's side of the story....And to say more would be criminal. MUTE WITNESS is the kind of film that demands a scrutiny of viewing similar to the most intricate, clever thriller because as much as it is a convoluted thriller, it's one that pays its dues to movies like WAIT UNTIL DARK and the best of Hitchcock in its choice of camera cuts, deadpan humor, Americans reacting in foreign countries where they are powerless, and nail-biting suspense until it seems something must snap. Even if the story does become a little too implausible due to the fact that the story arc suddenly becomes the focus of an even greater conspiracy, the film succeeds in not trying to trick the audience with cheap shots (for example the sudden appearance of a person on camera accompanied by a crashing swell of violins) but with the fear of the unknown and that death is only a shadow away. Very smart.","I went into this film expecting a slasher, and while Mute Witness does take influence from said style of film-making, this is much more than just your average slash flick. There are a number of thrillers that focus on a certain disability - blindness is more common (Blind Terror, Wait Until Dark, Cat o'Nine Tails to name a handful), but the implications of having a mute lead in a thriller such as this are well portrayed, and actually integral to the plot as the fact that the lead character can't speak is often the reason why she finds herself in dangerous situations that would be easy for anyone else to get out of. Our mute witness is Billy Hughes, a make-up artist working on a horror film production at a studio in Moscow. She finds herself locked in after hours one night, and after attempting to phone her sister for help, she stumbles upon what at first appears to be the making of an illicit sex flick, but soon turns out to be a snuff movie! She tries to convince the authorities of what she's seen, but finds that no one believes her story...Recently Hostel made the headlines for showing snuff movie making in a foreign country, but this film did it first and actually does a better job. It's maybe not quite as nasty as Eli Roth's opus, but the gore is more effective, and since director Anthony Waller (who went on to direct one of my favourite modern thrillers with 'The Guilty') implements a good sense of humour into the proceedings, Mute Witness is both sufficiently gory and fun to watch. The director certainly has a talent for crafting suspenseful thrill rides, as this one never stands still. The plot is put into action quickly, and Waller constantly introduces plot twists which give a big helping hand to the overall entertainment value of the film. The acting isn't bad for a B-movie, with young performers Marina Zudina, Fay Ripley and Evan Richards delivering good performances. The atmosphere is gritty, and the Russian locations are suitably unfriendly, which helps the film to retain a foreboding atmosphere. Overall, Mute Witness is a much better film than you might expect it to be. The plot flows well, and the atmosphere and tension are spot on.","Billy Hughes is a mute young lady working for make-up on a cheap horror picture being filmed in Moscow by an American director. One night Billy gets locked in the movie studio. Later that night she hears that someone might be in the building and goes to check it out. That's when she stumbles across a woman being brutally murdered, while being filmed. After escaping the clutches of the murderers, Billy informs the authorities, only to be red-faced when the men show it was an act. Billy knows what she saw and soon her life is in turmoil again from underground figures that believe she has something of importance.I don't know how this heart-pounding sleeper passed me by, but I thought it was a much older flick. There's one thing though, it's got to be one of the most jarringly, and intense thrillers I've seen in quite a while. It's just a great suspense builder and mostly everything clicks into place! The first half of the feature is surprisingly gripping with taut sequences that have your heart in your throat and clouds us with an atmospherically foreboding environment of alienation. Underling this is a humorously wicked black streak. Faults do pop up in the story, as it does lose that furious grip it held so early and goofy humour (or better putter comic relief) between Fay Ripley and Evan Richard's characters is a hit and miss affair by being too forceful. In the long run, it probably could have done without. Despite some cringe moments, this aspect didn't hinder my enjoyment of it. For me, the soft ending they decided to go with just didn't feel right.The interestingly mysterious premise was eerie to the bone and packed some unsettling goods. So multi-facet was the context and its thrills, there was something fresh to how this all plays out and the nervy jolts and unbearable tension are weaved into a range of sudden plot turns and twists. Really, they made superb use of the novel idea of this disability and to handicap the situation, by staging it in a foreign place where not too many spoke English and so we are caught up in the confusion too. The delicate Marina Zudina gives a harrowing portrayal of the American mute girl Billy. The way she able to display the erratic emotions through her eyes and actions gave it some gruff and believability. Director Anthony Waller shoots the flick in a rather stylish, well-timed and skillful manner, without loosing that grimy look that eventuates from its rigid surroundings and a powerfully airy music score persistently nags at you. The only real name to make an appearance was small cameo part by Alec Guinness. The performances by the cast were all fine, especially the nail biting turns by Oleg Yankovsky and Igor Volkov as the Russian murderers.This riveting feature that's mostly made up of unknowns, is way better than your average dark thriller. Highly Recommended.","An American film crew are based in Moscow with Russians making up much of the actual crew outside of the main elements.  Andy is the director with his girlfriend and her mute sister Billy as makeup artist.  One night after a shoot Billy finds herself locked in the large building being used as the main studio.  She comes downstairs having heard a noise to find two men making a porno film that quickly becomes a snuff film before her eyes. Billy flees the men but finds herself with no evidence to back up her claim. Meanwhile the shadowy figure behind the murder plans to cover all loose ends.I have managed to miss this film everytime it has come on TV and everytime it was in a cinema.  The closest I got was taping it once but it started late and I only got 20 minutes.  Happily I finally got my video skills together and caught it late the other night.  I had heard average reviews of this and only hoped that it would be enjoyable  which it was.The plot starts simple (mute girl in peril) and builds later into a bit of a wider conspiracy. The first half of the film is it's strength, real terror, genuine tension and thrills.  The actual murder is horrible and shot well to let you imagine more than you see. The following pursuit is also excellent and very well directed.  The second half of the film is still very enjoyable and tense but never reaches those heights again.  The plot opens up to a wider conspiracy and shadowy figures and it looses much of it's tightness as a result.  The film is still very good mind you  and is much better than a lot of large budget thrillers.It isn't scary but it is very thrilling.  The director makes plenty of good shots to help crank it up a notch when needed, however his script does falter at the final few hurdles   Zudina is good and does really well as the girl in peril.  She can't scream or cry and has to carry her fear in her eyes which she does well.  Ripley and Richards are more there for comedy value but do help lighten the tone.  The rest of the cast are anonymous chasers and don't have too much presence, but the director has done such a good job with the tension that they don't need to be monsters, only men. Guinness is OK I guess.  It's interesting to have him in such a film but did no one else notice how badly redubbed he was.  It was clear he had redone his lines in a studio  the sound quality was to crisp compared to other's dialogue and it didn't match with his lips as it should have done  shame.Overall I enjoyed this film.  For the most part it is simple, tight and very effective.  Great tension.  All the cast really put their fear in their eyes rather than relying on screams etc to convey it.  The second half of the film dips a little as the plot gets a bit baggy and slightly less convincing but by then you should be sold and it's energy carries it over some bits that drag a little.  Overall a really good little thriller.","It is always a well-known, and important directorial device to set up the atmosphere of a film within the first 5 minutes. In the crucial opening scenes, the film should assert itself and make the viewers take notice and get interested in the rest of the film. Here, in \"Mute Witness\", we find a prime example of this.*Scene spoiler* In the first 5-10 minutes, the film opens to a very Hitchcockian scene of a pretty blonde lady in her apartment, with the radio on. She's wandering around, applying lipstick, dolling herself up, and ignoring the news report of a serial killer on the loose. Of course, the serial killer is in her house, and monitoring her moves, knife in hand. She hears a noise, looks in a room, and there is her partner in a pool of blood. At the very point of her screams, she turns around to be faced with the knife-wielding maniac, who stabs her repeatedly in a brutal and horrifying act.......then something odd happens. As the woman convulses in her death throes, the killer sits down and takes out a cigarette to watch his victim perish. Before he finds his lighter, his cigarette is lit...from someone else in the room! The camera pans out, and we realise that there are more and more people in the room, some taking notes, some filming, some recording the death, and that the lady is taking an awfully long time to die, and making a very hammy job of it too. When the audience realises what's going on, and the whole scene is part of a film, the suspenseful and horrific scene takes on an element of humour.*End Scene Spoiler* I have highlighted this opening scene for several reasons. Firstly, it portrays the atmosphere of the whole movie perfectly. A thriller in the style of Hitchcock or De Palma, with some very disorientating, and even blackly humorous moments. - It conveys a central subject matter (that of the difference between a 'movie screen death' and a 'snuff film death', an issue which is elaborated on later in the film), and finally, it introduces the viewer to the characters, all as silently as possible.The plot of Mute Witness centres around Billy Hughes, an American special effects make-up artist who is working on the set of the film, being shot in a large warehouse in Moscow. Billy cannot speak, but she communicates in sign language through her sister. After the end of an evening's filming, Billy inadvertently finds herself locked in the warehouse by accident, and in her attempt to escape, is witness to two of the crew making what first appears to be a porno film, but turns out to be a snuff movie. Suddenly, her escape from the warehouse is a matter of life and death.Without doubt, the first half of the film is powerful and absolutely gripping. Billy's saving grace, and her handicap is the fact that she isn't able to utter a sound. (In fact, in my opinion, one of the best aspects of the film is the fact that it isn't chock-full of women screaming). There are some utterly disturbing moments, and some superb set-pieces of real suspense (The corridoor, and the elevator shaft are perfect examples). The timing is fluid, and the whole first half is an incredibly satisfying experience in itself.The second half of the film introduces new concepts. While there are still several suspenseful moments, the focus is on plot twists. New characters are introduced, and it is ambiguous as to whose side they are on. While there is nothing wrong per se with the second half of the film, it just doesn't quite measure up to the first half. There are some neat moments of black humour that perfectly juxtapose and punctuate some very dramatic scenes, but there are also some very lame comedy moments (coming specifically from Billy's sister and her fiancée, who happens to be the director of the movie Billy is working on), that almost ruin the film, just because they are badly misplaced and/or mistimed and ruin the pace. - At the end, the twists keep coming at a rapid-fire speed, and the climax of the film is, appropriately, as tense as the first half.There are several things that really make the movie work. The barriers of communication that Billy must face, both as a mute, and as an American in Moscow, mean that even an emergency call for help becomes a dangerous situation. The actress that plays Billy, Natasha Zudina, does a wonderful job in the film, with an engaging on-screen prescence, and a brilliant performance, and finally, the direction as a whole, but most particularly in the first half of the film, which truly is a study in Alfred Hitchcock's suspense/thriller film techniques.As I have already said, though, the let-downs in the film are from some terrible comic relief moments that really do not need to be added. There is already a consistent and effective streak of dark humour that appears in the film without the need for the characters of Karen Hughes and Andy Clarke (The sister and the moviemaker) to turn their scenes into some unusual sit-com. However, despite these shortcomings, the film is a thoroughly enjoyable thriller, and ideal for a group viewing at halloween. (Certainly better than the usual slasher horror film...!)","In today's world of advertising and teenage horror and sensationalism it is very rare that one gets to see a movie and no nothing about it. Movies like Psycho and Blair Witch, while being great in suspense (both with great build ups) are spoiled by the fact that we know all about the best scenes and at least the plot before we see them. With Mute Witness, a rare treat, I stumbled upon this film and watched it, scared witless, in the middle of the night. I was scared by the menacing Russian ambience, the 'snuff' theme and the claustrophobic plight of the mute and the fact that the (amusing, which always leads to likeable) characters could meet the end at any second. Since this is a low budget and rare film we watch it without any expectations. It also has Fay Ripley in a rare movie role, watch and prepare to be excited, scared and thrilled in totally unexpected ways.","I was loaned this film on DVD by a friend, and would advise anyone else of the warning he gave me: don't be put off by the first ten minutes. After that, the film offers laughs and scares in pretty much equal measure, and throws in Obi-Wan Kenobi for kicks (but the soothing voice of the Jedi Master does come off as incongruous). Overall, I enjoyed the movie, but felt that it was not sure what it wanted to be, as it never committed to horror or comedy, but in flirting wholeheartedly with both, didn't seem to be a horror-comedy either. There was enough mileage in there for a highly effective thriller, but losing the comedy (wait for the devastation of Billy's apartment!) would also seem a shame, so I guess sticking with the schizophrenia works.","If you enjoy suspense this movie has it. The fact that Marina Zudina portrays a mute adds to her haplessness and increases the suspense. Alec Guiness's appearance was nice, but didn't really add to the movie. I'm not sure if Evan Richard's part as Andy Clarke was an attempt to add a little humor or if he was supposed to just be a bumbling idiot. I thought the cinematography was excellent. This added not just to the quality of the production but to the suspense as well. The bathtub seen with the water droplets in slow motion was wonderful. Also the scene where the knife comes down and then it switches to Andy Clarke cutting an extremely rare piece of meat was very well done. I would call it overall good entertainment","The plot is somewhat original, and all the actors did their job pretty well. There is a plenty of comic relief, too. Some things do not make a lot of sense (e.g. the first \"chase\" scene, why would the heroine not just hide somewhere and wait until the baddies leave?). The Russians actually speak Russian without accent, but the cars are extremely strange, with models spanning like 50 years, and so the place seems weirdly out of time. Overall, if you like thrillers you will probably like this one as well.","I like to watch independent films. Some of them are way better than anything Hollywood could ever create. That's why I'm happy I get IFC (Independent Film Channel) on my TV. I saw this film was going to be on IFC. I didn't really know much about the film at the time I decided to watch it, but I felt like watching a thriller movie.It is a good thing I caught this film. It is definitely a superior indie suspense picture. The leading actress, Marina Sudina, is beautiful and sexy and acts in her role very well. It is too bad that none of her other film work is available on video or DVD in the U.S.A. I would definitely see another one of her films. Anyhow, I think very highly of this film, not only as an indie thriller, but just as an overall excellent movie.","I tend to chew on a fingernail or two during great fights and great movies and that doesn't happen very often. Not saying this movie is an all time classic but it is indeed a supreme nail biter and should have a place among great suspense movies. I gave it a vote of 8 just because I wanted to do my part to get this movie over the current 6.8 rating and up to a solid 7 where it deserves to be. I found this movie on a single list of top 100 best suspense movies of all time while searching the internet for same. I had no real expectations about this title but wow, this low budget movie delivers big time. Name another movie made for $2.000.000 that delivers even 10% of the thrills and chills. It feels like an American movie shot overseas even though it is a joint effort from Russia | UK | Germany. There are no over the top gore scenes and only one or two gratuitous nude scenes which for me is a big plus. I don't mind a nude scene in its place or a little blood letting but many of todays so called horror and suspense movies have absolutely nothing to offer except some weird competition to see who can be more creative (grosser) at removing body parts. Todays movie goers are lazy, they don't want to think or use their imagination, they just want everything laid open in front of them and explained down to the last detail. They have to see the knife in slow motion entering the body from every angle to be entertained. If a character says \" they found her head in a hat box\" I don't have to see the head, thank you, I do have my own imagination. I see many reviewers calling this director a Hitchcock wannabe but who in the business wouldn't want to be compared to a great director like Hitch. I see this guy closer to Brian De Palma with his quite, nerve twisting pace. I promise you this movie will have you on the edge of your seat almost from the title screen and constantly guessing whats coming next. SEE IT!","Man, I never laughed so much this year, and it's quite hard to make me laugh. While I expected some Hostel-style movie, the smile came to my face even from the beginning. This film-inside-film start with a female stabbed \"victim\" messing the whole set until she finally \"die\". Her overacting drive the director nuts and his funny reaction tell us, the viewers, that Mute Witness is not a typically horror movie.The main character, the mute American make-up artist Billy Hughes, is played by the beautiful yet talented Russian actress Marina Zudina. Her performance is top-notch; her character can't speak, so the body language and the emotions on her face must compensate.And, oh boy, she did a wonderful job. Her sister (Fay Ripley) is the girlfriend or the fiancée or the wife of the \"in-film director\" (Evan Richards). They were both very funny most of the time. I won't spoil more, but the scenes following the bathtub moment, with them both, the fake policemen and later the angry neighbor were plain brilliant black comedy.The plot got twisted near the end, possibly misleading at one particular moment. But don't worry. Such a delicious movie can be viewed in family or with your boy-/girl-/friend.","This is a very good surprise,this horror low budget movie.The influences are definitely European,and Dario Argento's fans should relish with that:the cinematography and the direction recall such works as \"suspiria\" and \"l'ucello della piume de cristallo\" with a simpler script and less showing off.The mute  heroine will make old cinema buffs think of Dorothy MCGuire's part in \"the spiral staircase\"(Robert Siodmak,1946),but this latter movie was hitchcockian to the core whereas this one ,I say it again,is more \"argentoesque\":the scene in which the baddie tries to force open the frightened girl flat was in the two mentioned movies.The comic relief (the people above who cannot sleep because of the \"noise\" ) might be an allusion to HG Clouzot's \"les diaboliques\".This is an action-packed story,using the settings with intelligence and dexterity.And very honest,at that:Russians speak Russian and thus are credible.This adds to the suspense because there are actually three languages:Russian ,English,and the heroine's one who can only communicate by looks and gestures.To top it all,there's a superb cameo for sir Alec Guiness -the only star of the movie,at least in western Europe and America-,who appears billed as \"mystery guest star\" in the credits.All psychological suspense afficionados must see this overlooked gem.","I saw this movie over two years ago and it still sticks in mymind.  It is a movie which due to the setting and therelatively unknown actors gives this movie a sense oforiginality.The movie has plenty of scary moments and in a lot of places isvery funny (whether always intended or not).  If you arelooking for something different, then go and see this one.You will be pleasantly suprised.","At first this movie really had my full attention. I'm not saying this was an original movie, like I had never seen before, but it sure had something to offer that really appealed to me. It's a pity that it all went wrong in the second half of the movie.Billy Hughes is a mute make-up artist who works on an American slasher movie that's being shot in Moscow. One fine evening she witnesses the making of a snuff movie in the studio where her crew works. Now she has to try to escape from the murderers (Russian people who work in her film crew), to stay alive and to convince the authorities that the murder that she witnessed is real.I like to watch good thrillers and I'm a fan of European movies, because most of the time they pay more attention to the character development and the story. Even though this movie sometimes reminds me of a Hitchcock movie and even though it has a European cast and director, it can't convince me all that much. It has some good potential, but somehow they have messed it up and made it look like a mediocre Hollywood movie. The story is quite original, the locations are nice, but it is the acting that doesn't always do the trick. I'm not saying the actors are bad, but they aren't great either. I guess there are people who really love this movie, but I'm certainly not one of them. I give it a 5/10.","Mute Witness is a modest, yet very solid thriller that never really received the attention or good comments it deserves. The film  written and directed entirely by Anthony Waller  is a tense, action-packed thriller with black comedy aspects and horror influences. No pointless mumbo-jumbo or endless plot-twistsjust straight to the point mystery. Mute Witness handles about the vicious topic of `snuff'-movies and is effectively set in Russia. *** SPOILERS *** Since the production costs are cheaper there, a US film crew temporarily moves to Russia for shooting a horror film. An old hangar is used as film location. The female make-up artist of the team accidentally gets locked up overnight and while trying to find a way out, she witnesses the recordings of an authentic snuff-movie! She's caught and tries to escape but, since she's a mute, she can't cry for help and neither can she explain what she saw to the police properly. The girl's life is in real danger now, since there's a whole hidden network behind these snuff productions and they don't want the witnesses to be alive *** End Spoilers ***. Mute Witness contains multiple highly exiting action sequences and is rather bloody. Some of the mystery clues are effectively kept secret till the very end. Regarding the similar topic, I'd say it's definitely better than the more famous `8 mm', directed by Joel Schumacher and starring Nicolas Cage. The acting in Mute Witness isn't great, but the leading actress (who's Russian herself) looks really cute. Sir Alec Guinness makes a special appearance, too. And a very cool one, I may say. Surely recommended with guaranteed fun and scares.","The story is airtight from the beginning until the latter third of this movie. Then the story gets more and more outrageous. The Main character portrayed by Marina Sudina is fantastic and had a difficult role. This could have been a super-great movie had the ending been more realistic."],"review-user":["Bannik","pa-12","Li-1","ccthemovieman-1","claudio_carvalho","prabanand-c","Old_Abe","nycritic","The_Void","lost-in-limbo","bob the moo","Trelloskilos","switzer-2","lee_a_scott","shornby-1","laxy56","TakingBackSunday","cworld14-989-991707","nose_smasher","dbdumonteil","eireguy08","philip_vanderveken","Coventry","hrjhughes"],"review-date":["20 December 2003","17 September 2001","1 November 2003","21 March 2006","14 September 2012","17 May 2009","11 October 1999","20 December 2005","20 February 2007","15 September 2006","14 October 2002","20 October 2006","20 November 2000","3 September 2006","1 March 2007","15 February 2004","23 March 2003","28 April 2014","28 August 2009","12 December 2001","29 October 1998","24 January 2005","4 June 2004","23 November 2002"],"review-rating":["9","7","8","8","8","8","7","9","9","10","6","7","8","8","10","5","7","9"],"review-title":[" Excellent!!\n"," .terrifying, balanced by black humor, nerve wrecking tension\n"," How does a movie that starts off so well conclude so horribly?\n"," When You Need A Diversion, This Will Do It\n"," Still Great after Eighteen Years\n"," Gripping and Tense Thriller !!!\n"," Late Night Surprise -- Suspense!\n"," Clever Homage to the Thriller Genre\n"," Tense and gritty little thriller!\n"," Words cannot express the horror.\n"," A really tense little thriller\n"," A great, fun and effective (if sadly overlooked) thriller\n"," russian rollercoaster\n"," Indecisive but fun\n"," Well worth watching\n"," a decent thriller\n"," Excellent leading actress, overall suspenseful film\n"," Nail Biter Supreme\n"," superb action-comedy\n"," Back in (almost) USSR.\n"," A movie that will surprise you\n"," It FEELS like Hitchcock, but it certainly isn't as good as the real stuff\n"," Action packed and tense thriller.\n"," Great beginning but weak ending\n"]}