{"review-url":["http://www.imdb.com/title/tt0120915/reviews"],"review-text":["\"Episode I: The Hidden Menace\" is perhaps the most ambiguous film in George W. Lucas's \"Star Wars\" series. Met by the rather coldly stern gaze of critics, the first film of the new trilogy can cause some confusion in the viewer. There are not many action scenes in it, there are many dialogues and just a leisurely development of actions, which sometimes may seem like a forced filler with a connecting function between fights and races. But this is only at first glance, because if you look closely ...Young Obi-Wan Kenobi (Ewan McGregor) and his teacher, Qui-Gon Jin (Liam Neeson), go to negotiations with the Trade Federation, which threatens to blockade the peaceful little planet of Naboo. In Obi-Wan's eyes, his mind and vision are already visible, his movements are already full of courage and confidence. Confidence and powerful, unquestioning dedication are seen in the young queen Amidala (Natalie Portman) that she is ready to do anything to help her people, the inhabitants of the occupied world federation. It is in \"The Phantom Menace\" most accurately and correctly disclose the nature and fragile at the same time in BOGATYRSKY solid Padme: it is able to stand alone against the decision of the Senate, venturing recklessly brave adventures and combine intuitive dictates of the heart with equanimity of mind.Qui-Gon Jin is unshakable and calm, in whatever situation he was. His eyes radiate wisdom and strength, a smile condescendingly reasonable, and the movements are smooth and weighed. But the main feature of Obi-Wan's teacher is not in these, of course, the most important qualities. Qui-Gon, first of all, is a man of exceptional faith. Some of his actions seem too risky and thoughtless, but somewhere in general they can be mistaken for a desperate bluff. But for him, extremely sensitive to everything around him, holding in an unsurpassed harmony the awareness of his own forces and the sense of difficulty of the tasks set, for him, who knows how to feel the situation on many, many forward steps, faith is the main tool. With her help, he stands unshakably on his feet, seeking his own, by all means.Once having set a goal - to certainly train quite a young Anakin Skywalker - Qui-Gon will go to her persistently and steadily. He alone believes in the Prophecy of the great destiny of the boy, as if he did not hear the fears of the Jedi Council that Anakin's uncertain future could pose great troubles to the Galaxy. But the foresight and the unique sense of Qui-Gon's world allow him to see far further than to his eminent like-minded people and mentors, like Master Yoda and Master Windu. In addition, an extraordinary faith allows Qui-Gon to destroy any of his fears and doubts that can obscure his clear eyes. The moment of the film is very important, in which the wise Jedi tells Anakin about the medichlorians, micro-organisms existing in symbiosis with the cells of any living organism.\nPerhaps, in these mysterious media chlorians lies the human soul, elusive to the eye and non-existent for touch. Then the wise counsel of Qui-Gon Jinn and unselfish greed deprived the boy Anakin Skywalker, wanted to visit every planet in the universe, it seems quite clear and sharp, Go up to the call of the heart, and you go on the right path. And even though this road is lost in the darkness of the gathering clouds, there will always be someone who sees a little farther than everyone else, and builds on this sagacity its most powerful faith. Qui-Gon believed in Anakin from the first second and believed in him to the end; most likely he understood the suffering and upheavals that promised further training of the boy for the Galaxy and for himself, but in one thing he was certain that in the final analysis Skywalker would return the Force to equilibrium ...Finishing on the major note of universal jubilation and festivities, \"Episode I: The Hidden Menace\" at first glance does not justify its mysterious and menacing title. But, having looked a little closer, we see that the holiday is just a calm before the storm, and a sweet truce is a tricky tactical ploy. It also becomes clear with horror that all the actions of all the heroes are quite comparable with the freedom to choose the actions of puppets tied to strong threads, for which someone is confidently pulling, able to control the movements of dolls by the easy fingering.And the violent protest of Padme Amidaly at the Senate meeting, and the murder of the mighty Darth Moule, and the fiasco of the Trade Federation, and the heroic death of Qui-Gon Gin, are all foggings in the plan of the mysterious strategist who is still hiding far from the battlefields, its galactic war. And Anakin Skywalker's aching lead heart, which is filled with a burning, drying fear after the death of a Jedi so much loved by him, also lies in a small coin, albeit of a larger value than the rest, on a comprehensive battle map of the devilish clever and cunning puppeteer.\nThe beginning of the saga is laid, the heroes are represented, the plot knots are tied. Star Wars Beginning","Lucas may have problems as a director and writer, but I've always thought that those flaws are balanced by his great storytelling ability. The problem with \"The Phantom Menace\" is that he simply has no story to tell. The film merely adds an introductory chapter to a story that has already been told, and stretches it out into a two-hour movie. It is no accident that prequels of this kind are rare. They are very difficult to make properly. And apparently he's just not a sophisticated enough filmmaker to pull it off.For one thing, this project is limited by the fact that anyone familiar with the first trilogy knows the story's outcome, and it therefore lacks some of the suspense associated with a gradually unfolding saga. More importantly, however, this situation leaves Lucas with very little freedom as a storyteller. It also encourages him to gloss over key events; because their outcome is a foregone conclusion, he forgets to bring them to life.For example, we know there will eventually be a romance between Anakin and Padme. So Lucas has the two characters meet here and--surprise, surprise--they seem to like each other. Their developing friendship isn't portrayed that clearly, and their motivations for becoming close aren't explained. Because Lucas fails to make scenes like these believable, we can't help being conscious of how he's manipulating the plot in his effort to connect the two trilogies. Another good example of this problem is Anakin's portrayal as a potential Jedi. There doesn't appear to be anything about this kid remotely out of the ordinary, even though the other characters keep talking like there is. Our only reason for thinking he's special is that the plot requires it.If the story fails to be engaging, it is because we never see the important events. Lucas makes a fatal error in not showing what's happening on Naboo, the small planet whose capture is the focus of the plot. Numerous atrocities are supposedly being committed against the planet's inhabitants, but we only know about this because the characters on screen refer to the events, usually rather woodenly.The deadpan performances are a problem in themselves, but they only highlight our lack of involvement in the story. Think of Han Solo sweating in fear, then think of the emotional vacuums passing for characters in this film. Whenever any of the characters do express emotion, as in the scene where Anakin and his mom part, it still seems awfully restrained. Somehow, Lucas manages to keep the emotional reactions of his characters to a minimum, which gives the film an almost mechanical feel.It's true that \"A New Hope\" never showed Alderaan's inhabitants, but we still could feel the tragedy of the planet's destruction through the horrified reactions of Princess Leia and Obi Wan. Moreover, there were many other involving events which we witnessed directly, such as the slaying of rebels at the beginning; the capture and torture of the princess; and the murder of Luke's foster parents. Furthermore, the major plot elements were intriguing in and of themselves. They weren't there merely to show us how they were to be linked to later events, which seems to be the case with the new film.I suspect that Lucas was not as concerned in the first trilogy with what had to happen later in the story and was therefore able to focus his attention on the events at hand. The weakest segment was \"Return of the Jedi,\" which had the task of bringing the story to an end. Only then did Lucas start to show signs of forcing plot points. In \"The Phantom Menace,\" he gets so bogged down in the task of bringing his story from point A to point B that he ends up with only the bare bones of a plot, and none of it comes alive.This is especially true of the characterization. In the old trilogy, characters like Yoda and Han reveal distinct personalities in their first few minutes on screen. This film goes for more than two hours and the characters, including the familiar ones, come off vague and nondescript. We aren't given much of a chance to experience their personalities in the way they interact. We must take Qui Gon's word for it when he describes Obi Wan as \"headstrong.\" What's most odd is that the cartoons seem better developed than the humans. The scenes where Qui Gon negotiates with the birdlike slave-owner Watto are amusing and well-done--probably the movie's best scenes aside from the stunning action sequences--but they can't hold a candle to the constant interactions throughout the first trilogy.One thing I cannot do is accuse the film of lacking creativity. The design of the creatures, the technologies, and the planets is impressive. Watching the film is sort of like reading a children's book that isn't very good but abounds with beautiful illustrations. There is certainly a \"wow\" factor in the movie's visuals, but the effect of it is short-lived.I get irked when I hear fans talk as though the \"Star Wars\" movies were never about anything beyond special effects. While the inventive visuals are part of what made the originals so revolutionary, they're not what made the films so fun to watch. And in no way can they explain the trilogy's continuing popularity today. After all, many of the original effects look primitive by today's standards, and their novelty has certainly worn off. Only an enduring and compelling storyline could have allowed the first three films to become the classics they're almost universally acknowledged to be.","I recently rewatched everything Star Wars including this, the Clone Wars cartoons etc. In preparation for seeing The Force Awakens.Well for someone who wasn't a huge fan of this initially I made a few discoveries and in light of the Force Awakens this movie is a cinematic masterpiece.The story is really quite original (except for that main reactor bit). I really quite liked it and the politics is easier to follow after a few viewings. I remember being quite shocked when I found out the 'queen' wasn't always who we thought.The sets and costumes are really beautiful.JarJar isn't really that bad, let's face it he's there to keep kids happy and that's OK isn't it? Obi-Wan is great, I really liked seeing him younger.I did feel quite sorry for Anakin this time around and I think the actor did quite well with the material he had.Yes this movie has it's issues, it can be slow at times and the bit about Midichlorians still makes me cringe but at least it's original and had a story to tell. It does remind me that Star Wars was really Anakin's story told in 6 parts. The newest 7th 'instalment' is reductive and undoes a lot of the history.Star Wars finished with return of the Jedi and most certainly after George Lucas left. the new Disney stuff has no heart.Please come back George.","While it received generally positive reviews upon its release, and captured the imaginations of an entire generation of younglings, The Phantom Menace has garnered an almost toxic reputation on the internet in the years since. Sure, it's not a perfectly structured film, and yes, there are more than a few dopey decisions, but the sheer spectacle and sense of fun in Star Wars: Episode I cannot be denied. George Lucas' return to a galaxy far, far away is a triumph of creative vision. A movie that overcomes any and all of its narrative deficiencies through the pure drive of its creator to wow, thrill, and inspire.The Phantom Menace is chapter one of the Star Wars Saga, and it feels very much like the beginning of a larger story. It introduces all of the important players in the saga, including Obi-Wan Kenobi, The Jedi Council, and Anakin Skywalker, the tragic hero who we know will one day become the legendary Darth Vader. On a micro level, the plot revolves around an intergalactic trade war that leads to tensions between the Trade Federation and the inhabitants of the peaceful, Garden of Eden-like planet called Naboo. Jedis Obi-Wan Kenobi (Ewan McGregor), and Qui-Gon Jinn (Liam Neeson), are sent as peacekeepers to protect the planet's leader, Queen Amidala (Natalie Portman) from the evil Trade Federation and the ancient Sith Lord, Darth Maul, one of the most frightening and iconic characters ever to come out of the Star Wars universe. The Trade Federation plot does not have the same level of buoyant escapism as the originals', but it's not far off. The politics are kept at a minimum, and they only serve to create bad guys for our heroes to fight. The more important element of Episode I's story is the extended introduction of young Anakin Skywalker to this new Star Wars universe. The most interesting beats of the story center around Anakin and his mother, and The Jedi council's trepidation regarding the boy Qui-Gon suspects is the Chosen One. You get the sense that there is something special, yet sinister about the young podracing phenom from Tatooine. It's a great aspect of the film that largely goes unrecognized. None of the pieces of the plot really mean much for the prequel trilogy's overarching story of the downfall of Anakin Skywalker, but The actual conflict of Episode I is largely unimportant. At it's core, The Phantom Menace serves as a feature length introduction to George Lucas' new (old) Star Wars Universe. Episode I is the prologue to the Saga, telling a simple story that puts the pieces in place for later films while still standing on its own. On that level, it's kind of brilliant. Lucas takes a universe that was, as sweeping as it felt, still confined to a small collection of characters, and tears the lid off. The Phantom Menace does more to create a fictional history and detailed lore for the Star Wars universe than any other film. All of a sudden, this universe was no longer just a backdrop for the characters to play around in. It became a real place, with real politics, history, tradition, and age-old myths of its own. Remarkable if you ask me.Next to their storytelling, Star Wars movies have always been known for their special effects. With 16 years between movies, George Lucas' ILM team had the chance to perfect all of their award-winning visual effects, and perfect they did. Incorporating a litany of techniques from miniatures and animatronics to innovative use of CGI, The Phantom Menace is a breathtaking film to look at. Every single shot of The Phantom Menace is a work of art, and the sheer amount of imagination put into the world is worthy of praise. From the environments to the vehicles, the costumes, and the creatures, everything in this universe is unique, and ILM and company craft them with an unrivaled eye for detail. That expert craftsmanship extends to the action sequences. George Lucas' strengths as an editor and technician translate to more than a few show-stopping set-pieces. My favorite of which is young Anakin's bid for freedom, a kinetic and thrilling race across the vast deserts of Tatooine. The Podrace is a visually stunning and genuinely tense showcase of absolute speed. It still remains one of the most fun sequences in recent movie history. The same goes for the climactic three-way lightsaber duel at the end of the film. With brilliant visual effects, fast-paced and furious choreography, and a euphoric sense of scope, it brought something brand new to the Star Wars Universe, large-scale lightsaber duels. The battles, both in space and on land, stand out as old-fashioned, innocent fun. Despite a few silly moments, they tap into that Saturday matinee spectacle that resonates with the kid in us all.I love The Phantom Menace, but I won't pretend that it is perfect. The script is clunky, especially in the first act where the plot seems to spin its wheels. There are slow moments and plenty of silly gags that fall flat. But my God this movie is fun to watch! The visual splendor, the larger-than-life action set-pieces, the grand fun of the whole thing, The Phantom Menace is irresistible entertainment. An event movie with this kind of innocent charm is something unique in Hollywood, and that child-like earnestness is what makes this movie particularly endearing for me. The Phantom Menace might be different from the original trilogy in certain aesthetics, but importantly, not in feel. For the majority of this movie's runtime, it exudes the same brand of vibrant movie magic that made A New Hope a beloved classic. I won't call TPM a classic. I have my hangups with it, but I personally cannot bring myself to dislike this movie. Star Wars: Episode I works as an introduction to a brand new world, and as a stand-alone adventure that celebrates the innocent fun of the Original Star Wars. 86/100","I loved this movie as a kid. I still love it at age 21. Sure, it can be a bit sloppy at times, and it switches from plot a to plot b constantly.The stereotypes can be jarring at times. But you know what, it is still brilliant. The characters are likable. Even jar jar is not that bad. The acting is OK. Not great, but OK. The hate seems to stem from old trilogy fans, not knowing that this film was merely trying to be something different. Yes, if you want a film that feels like the old trilogy, this is not for you. But if you are looking for a fast-paced, lighthearted sci-fi action movie with one or two smart scenes, good scenery, and interesting alien designs, then this is for you.","This movie begins the back story of anakin skywalker and obi wan (amongst other characters).This movie has received a lot of criticism over the years, including some recently with the release of Ep 7 in the franchise (although to be honest I won't ever count that as canon.Having just seen The Force Awakens I had to come home and rewatch this. It is certainly not a perfect movie, some of the dialogue is awkward and George Lucas has tried to explain stuff that didn't really need explaining and it's a bit too 'american pop culture' in parts for me but the story is good.The story of Anakin being taken away from his mother (albeit with good intentions) is a good story and the young actor who plays him is quite likable. Natalie Portman is great.All in all a much better movie than it is usually given credit for","This movie, the most hyped movie of all time, has been put under the microscope and looked at in a variety of different ways. It seems that everyone had prejudged the movie before it was even released, and then strutted about claiming that they told you that it would be that way. There was the die-hards, who were impossible to dissapoint. There were of course the disenchanted and the unimpressible, who probably would not had conceeded the movie was good no matter what. There were the people who acted as if this movie symbolized their disapproval of media hype itself, and by principle decided to dislike the film. Looking over the other comments I see the opposing viewpoints clearly. OK, the movie was overhyped, but what do you expect in 1999, the year of hype? I was four years old when the A New Hope came out, and of course, I loved it. I was four, and a science fiction epic can have its way with a boy of that age. I think many people in the 20-35 age group expected to have that same life changing event that happened to them twenty years ago this time around. That is the equivalent of going to Disney World for the first time since you were a kid and being let down: Did you expect the impact to be the same? Take the movie for what it is. OK, it isn't just any movie, but it behaved like one, with strong points and weak ones as well. First the strong points.1. All the acting was terrific, with the exception of Jake Lloyd. Many critics complained of the stiffness of the Jedi characters. What some people saw as flat acting I believe was well acted restraint by Neeson and Mcgregor. Their characters were kung-fu monks, not the pirate Han Solo and the upstart Luke. 2. All of the sets and costumes were beautiful. Even Oscar worthy. 3. The music was terrific. John Williams outdid himself with the otherworldly choir at the end. Breathtaking! 4. The fight scenes were excellent as well, better than the ones in the Matrix because they had less special effects woven in. 5. The plot had more substance than the prior three combined. The intricate dealings of politics, the metaphysical properties of the force, the nature of bondage and the messianic innuendos sent me reeling. 6. The pod race. Ben Hur for the Space Age.And for the weak points: 1. The flow changed speeds too often, making it seem somewhat unnatural. 2. Something did not work for me with Anakin's success at the end. It seemed more haphazard than the supernatural workings of the force. 3. Jake Lloyd is not a good actor. Period. the scenes between him and Portman awkward and seemed difficult. 4. The fact that some of the races of aliens resembled ethnic groups should not be considered offensive (I wasn't offended, and could have been). It does, however, seem like a lack of imagination.Personally, I put this movie ahead of ROTJ, but behind the first two. It still definitely is worth watching. By the way, I was rather indifferent to Jar-Jar, as I was to the plight of R2-D2 and C3PO in all the other movies. I have a feeling history will smile on this movie as the story progresses in the future installments and we become more familiar with some of the new concepts introduced in this one. If you have decided not to go to any of them anymore, fine. That means just less of a line for me.","This chapter in the Star Wars Sage is vastly underrated, and is always given the short end of the stick by the so-called Star Wars purists.These are the people that live for the original trilogy and will never ever realize the flaws those movies have, but will always look for anything to criticize about the new ones.That is the wrong attitude to take towards this movie.If you hate the movie because you hate Jar Jar and the Gungans, then you are required to hate The Return of the Jedi because of C-3PO and the Ewoks. Both are equally annoying, yet no one seems to have a problem with the ever obnoxious C-3PO simply because he is in the original. And come on... Ewoks? But I digress...Also, you may hate Jake Lloyd, in which case you should hate Mark Hamill in A New Hope. Bot are equally high pitched and annoying. And both their acting can be criticized to the extreme. At least Jake Lloyd was in only one movie...This movie boasts the best lightsaber duel in the entire Saga, and has the best villain after Darth Vader. The music is flat-out amazing, and the special effects are dazzling.It brings new elements into the Star Wars universe while staying true to old elements. Yoda is still a puppet here, and that counts for a good amount of nostalgia.Criticizing it because the special effects are too good for what is supposed to be a prequel? Come on people... that is lame.Anyway, the reason this movie is so criticized is because people are comparing this one movie to the entire original trilogy instead of looking at it as a stand-alone movie. Which, let's face it, is what it was meant to be.If you come into this movie expecting a fresh, new take on Star Wars which broadens the universe, then you won't be disappointed. If you came here expecting it to be a rehash, remake-style of the originals with no innovations, then why on earth are you still watching movies?Take the movie for what it is, not what you want it to be. Watch it without bias (if that is possible) and you will see that it is brilliant.Why in the world does Episode I have a lower score than Episode II?","After a long delay (and much anticipation) we finally got the first part of Lucas's story, and where the trouble all began. Many other people viewed it as a rather sub-par attempt, uncreative and unsurprising. I couldn't disagree more. One could go with the impressive state-of-the-art digital effects, one could go with the great cast of new characters (the awesome Liam Neeson as Qui-Gon Jinn, for instance), the return of old favorites (Kenny Baker as R2D2 or Frank Oz as Yoda), John Williams' ever-wonderful score, the complicated story (I won't bother discussing the plot; everyone knows what it's about by now) or the awesome action sequences (the light saber duel at the end of the film is the best!). It's obvious this film was misunderstood by many, and too many movie-goers set their expectations too high, which is unfair to Mr. Lucas to say the least. I was excited for the chance to see a new Star Wars film, but I took no expectations into the theater with me -- I went in ready for nothing and walked away very satisfied. I saw this film four times in the theater, something I don't do much of these days. Lucas did a great job, and since this film is really only exposition for the overall series, how can one expect it to be a topper to the original trilogy? He's just setting everything up! Give Mr. Lucas a break. If this film had been released first, it would have been the rage of ages just as A New Hope was when it first came out. Everything in this film was very nicely done; the cast and crew all performed their jobs exceptionally. The story was far more complex and interesting than usual, with more going on and more problems to solve. By the way, everyone, the \"Phantom Menace\" referred to by the title is so obvious that very few people truly understood what it was... the Phantom Menace was the orchestrator of the evil deeds, the driving force behind the attacks, the central villain of the picture... a character we see mainly as a hologram (only once otherwise): Darth Sidious. Darth Sidious is the Phantom Menace, and the evil single man who drives the entire plot. The movie was perfectly named. I loved this movie, and it has become one of my favorite Star Wars films (alongside A New Hope). I can't wait for Episode II!","Well, after waiting 16 years for his next installment,  George has given us \"The Phantom Menace\".  As a Star Wars fan I got what I expected - another chance to immerse myself in the Star Wars universe - a film whose sole purpose is essentially escapism.  But as a movie fan, and judging it as I would any other movie, I frankly feel mildly disappointed.  Any movie that's made can always be improved upon but I feel that this SHOULD have been better.  Firstly the good points :1)  The visuals are stunning - a lot of love and hard work has quite obviously gone into the effects and the people involved can quite rightly be proud of their work2)  All the performances by the main cast were good.  Particularly Natalie Portman and Pernilla August.3)  The Pod Race was exciting and amusing.4)  The final sabre duel was quite fantastic : Darth Maul prowling up and down like a caged tiger was a particularly excellent touch - it added real tension and anticipation to the scene.5)  The music as always was magnificent.  The Star Wars saga would lose much of its charm and intensity without Williams' scores.And now the negatives :1)  The pacing was too fast in parts!  The first half hour of the film just left me cold - you weren't led into the story.  You were dumped straight into the action.  On paper I'm sure the first half hour looked fantastic but I found myself sitting in the theatre going - 'hey, great special effect shot there!'  I wasn't involved in the story and the scenes lacked tension and danger.2)  The film only truly started for me on reaching Tatooine.  I finally got a chance to get to know the characters.  However there still was not enough character development in the film as a whole.  For example,  Obi Wan had nothing to do or say throughout the movie except flash his light sabre around from time-to-time.  Who is Obi Wan???  After seeing the film I'm none the wiser.  And the final sabre duel (good as it was) would have been infinitely better had the relationship between Qui-Gon and Obi Wan been explored past the mere mentor-apprentice motif.  The final sabre duel lacked emotional involvement as a consequence.3)  Why did they make Jar-Jar so incomprehensible??  I found myself becoming annoyed at having to strain to understand his nonsensical utterings! (Having said that, he wasn't as annoying as I'd been led to expect)  Why George used easily identifiable racial accents for his alien characters completely puzzled me. It just shows a lack of imagination!4)  Not enough Darth Maul.5)  What's with the biological exposition on the Force!  Was that necessary? The first three films pointed to links between the Force and genetics but I don't need tiresome cold scientific explanations as to the Force's origin, thank you very much!  It just ruins the mystique.6)  Can we have less of the mindless gaffes that occur in the final battle scenes (You know the ones that save the day!)  Its an insult to the audience's intelligence (In a full theatre I swear I didn't see a single soul who looked under sixteen! - has George forgotten about the original fans).  In the original trilogy there was none of this cringeful embarrassing material (Ewoks excepted!!)Well I think I'll stop there.  To summarise : a good movie that could have been a whole lot better.  Perhaps there was too much story to cover in two hours?  In which case the plot should have been shortened on the adage that \"less is more\".  I've always thought that episode one was always going to be the lamest of the new films so I await the next installment with anticipation and hope .....","When I first rented this movie at my local DVD rental store, I didn't have high hopes for it at first. But that's only because at the time, I had virtually no interest in Star Wars at all. One day after watching a review of the films, I decided to give the movies a try, and see if they were worth all the fame they have. But little did I know that when I first hit 'play' on that DVD menu, i had taken my first step into a larger world.In the first half, I thought that the CGI and effects looked great. Now let me just say something for a second: Most people dislike the Prequels for overuse of CGI and not enough real things. But to me, the wonder and mystery of Episodes IV-VI works in a different way. Seeing all of the CGI in the Podrace, the Droids, and a few of the characters, I was stunned. I had never seen CG quality to such an extent before, and much of it really did look real. I had wondered how much work it must've taken to put it all together with the lighting and textures and stuff.Now that we've gotten that out of the way, we can move on. Personally, I didn't really find that much to complain about. I was able to follow the story just fine, and i thought the characters were really interesting. Anakin as a child didn't bother me at all, and i thought he was pretty likable. He had an interesting character, and I kind of actually felt sorry for him since he lived on such a dusty old planet such as Tatooine. When Jar Jar Binks first appeared, I feared the worst based on some of the reviews I saw. But in the first minute or so, Jar Jar actually didn't bother me at all. In fact, I thought he was quite entertaining and funny. For example, when he got his head stuck in the pod race electrical line, I was laughing out of control.Now let me explain something else for a moment: Some people may argue that that comedy doesn't belong in a Star wars movie. But to debunk that, I'm only going to say this: In the Empire Strikes Back, remember when Yoda first appeared?...Near the middle of the film came the saga's first chronological lightsaber dual, between Qui Gon Jinn and Darth maul, the movie's secondary antagonist. his motive is to wipe out the Jedi and overthrow the Galactic Republic as a a way of getting revenge. (Anyone who paid attention during the Jedi Council parts would know that the Jedi wiped out the Sith a long time ago, and Darth Maul is the apprentice of one of the last Sith Lords who want the Sith to come back.Now that that's out of the way, let's move on. In the second half of the film, the effects only got better. The Naboo Starfighters near the end looked seriously real, the trade Federation battleship looked pretty wicked, and the battle between the gungans and the battle droids looked spectacular, but soon after this happened, came the highlight of the film. While the Theed palace soldiers are trying to take back the palace, they ran into Darth Maul, who had been sent by his master to kill the two Jedi and everyone who stood in their way to victory. After that came the second best lightsaber fight in the entire saga. For one thing, Darth Maul has a double bladed (duel bladed) lightsaber. And I thought it was nice to see an update on the lightsaber formula. Anyway, when the fight starts, three key factors make it a great fight. 1 is the music, called Duel of Fates. no words can describe how well this piece of John Williams Gold fits into the fight, and the film in general. The second factor is the movements, or choreography. For the first time, we were introduced to lightsaber duels with back flips, jumps, several hits a second, and some seriously fast paced action, which the Original films seriously lacked from the reviews. And the third thing that makes the fight so great is the location its in. The Theed Palace reactor is such a bad ass place to have a lightsaber fight, its almost as if Darth Maul purposely waited nearby it so they could fight there. Overall, just watch the fight on Youtube and you'll see what I mean.Overall, The Phantom Menace was a great entry in the Star Wars franchise. It's got great effects, lovable characters, a great storyline, and doesn't deserve all of the hate that it has. I highly recommend watching this any day.I'd give this a 15 if I could.","I know it's fashionable to scorn the \"prequel\" trilogy, but if one stands back a bit, things tend to snap into perspective. Compare \"Phantom Menace\" to most any other fantasy/sci-fi film, and it has to rate very high indeed.Plot: this is the more \"adult\" side of the Star Wars galaxy. The politics are remarkably credible, with the entire plot hinging on the result of a vote of no-confidence! How many adults even know what that is? (Hmm... maybe this explains the low ratings.) The relationships between the races on Naboo, the role of the Jedi... these things are established more clearly, and depicted more credibly than in any of the other five films.Technical achievement: Lucas paints on a vast digital canvas, and creates a world of wonders that have simply never been imagined by lesser talents. This is a living, breathing, believable world, that makes the world of the original trilogy seem cartoonish and contrived by comparison. Naboo, from the city, to the underwater kingdom, to the rolling green hills, is one of the great fantasy worlds, up there with those of the Thief of Baghdad (both versions), Blade Runner, or 2001. And our first glimpse of Coruscant has got to be one of the most memorable \"wow\" moments in the history of the movies.Characters: Liam Neeson's Qui Gon is one of the strongest characters in the Star Wars films, and Ewan McGregor's Obi Wan a worthy, more-dashing successor to the older version created by Alec Guinness. And Jar Jar Binks? Annoying? Not compared to the insipid C-3PO, or the insufferably perky R2-D2. Jar Jar is a fully formed character, with surprising depths. His manner is odd, perhaps abrasive, but he offers far more than the single note that Lucas used for his original comic-relief characters. And, of course, the fact that he is one of the first fully digital characters in film history has to be worth something. But Ian McDiarmid's Senator Palpatine is perhaps the most under-appreciated of all. This is an Oscar-worthy supporting performance, a character who is both frighteningly real and perfectly ambiguous. McDiarmid balances his performance on a knife's edge, managing to be both fatherly and deeply unsettling.Yes, it may be that a certain human dimension is weaker here than in the original Star Wars. We don't have a clear \"hero\". There's no Luke, no Han. That's a valid point, but it is not inevitably a criticism. Qui Gon and Obi Wan aren't the comic-book heroes of A New Hope, but they are likable, heroic, and rich in characterization. If I had a choice between seeing 10 more episodes of the life of Han Solo or of Qui Gon Jinn, I'd choose the latter without hesitation.Story: The storyline in this film seems more real, more substantial than in the other five. We have the perfect sense of scale, from human drama to global (or interstellar) conflict. The one quibble might be the pod race. It's certainly entertaining, but does it go on too long? I think perhaps so. This is a structural weakness, but not a huge one. (Does Luke spend WAY too long on Dagobah, listening to warmed over Zen platitudes from that rubbery little jerk Yoda? Yes! Yet this is in the film most viewers seem to, unaccountably, pick as the \"best\" of the six. Clearly, there's some latitude for narrative digressions...)And then there's the climactic sword fight. I'd rate the three-way duel in Phantom Menace as the second-best sword fight in the Star Wars series, close after the finale of Return of the Jedi. The latter has a wonderful mythic quality, but this one is more visceral, more scary... partly because Darth Maul is such a cold, merciless villain, and partly because you know from the outset that the outcome is genuinely in doubt, that one of the Good Guys really could die. And the staging, using three master swordsmen, each with very different technique... This is just about as good as action film gets. Only two or three other movie duels come close: Rob Roy, again with Neeson, oddly enough; Scaramouche; Robin Hood... I can't think of a fourth. The closing duel ALONE should raise Phantom Menace into the front ranks of action and fantasy films.Bottom line: there is so much to enjoy in this film, so much to see, so much to feel, that it is amazing how anyone can possibly rate it below a 7 or 8. This is a scale of film making that few have ever attempted, let alone pulled off so beautifully. Perhaps that's the film's biggest fault: Lucas makes it all seem too easy.But, of course, we all know the REAL reason people can't give this film the 10 it richly deserves. That reason lies within themselves. Viewers in 1999 (let alone 2007) just couldn't feel as young, as innocent, as optimistic as they did when they saw the very first Star Wars. (Especially if they saw it way back in 1977, 30 years ago). Star Wars hasn't changed, George Lucas hasn't changed, nearly so much as the audience has changed. Alas. Moviegoers who are truly so jaded that they can't feel the passion and revel in the breadth of vision of The Phantom Menace have my sincerest sympathy. Yes, you can be ever so-o cool by putting down the prequel trilogy, but missing one of the best movies of all time is a very high price to pay.","WARNING: CONTAINS A SPOILER WHICH EXPLAINS THE TITLE!Having read some of the reviews posted here before seeing this movie, I was pleasantly surprised!Why are there are so many gripers? I think it's because:1) \"Star Wars\" has been done 3 times before. It's just not possible to make a \"Star Wars\" film that's as fresh as the first 3.2) We have new characters. Gone are the ones we loved. Star Trek suffered this as well.3) Those who saw the original 3 movies as gaga teens are now pushing 40. It just ain't the same.4) Folks have seen SW:TPM with expectations NO movie could have met.\nI LIKED the movie and found it well-done. Jar-Jar was really not that annoying! True, we could've learned more of Qui-Gon and Darth Maul. But those are small flaws in an otherwise solid film.I was pleasantly surprised by two small but neat plot twists. The light-sabre-fighting was great. So too was the little romantic twist.\nLet me explain the title. (WARNING: MAJOR SPOILER JUST AHEAD!!!)This movie is about ONE thing and one thing only: the hidden, shadowy, absolutely ruthless drive for power by a man whose public face is totally that of a gentle, helpful, servant-hearted Senator from the planet Naboo. Yes, that nice, kind man who wants to HELP Queen Amidala -- Senator Palpatine. This nice man IS \"The Phantom Menace.\" He and the evil Sith Lord lurking in the shadows are ONE AND THE SAME. The nice-guy image and Naboo's entire \"war-with-the-Trade-Federation\" incident -- this entire movie! -- have been planned for years in advance and meticulously engineered by Palpatine SOLELY in order to bring himself to power in the Senate. He is prepared to sacrifice his entire home planet in his lust for power.And the galaxy, even the Jedi, have utterly ZERO CLUE of the hell this \"nice man\" will soon begin to unleash, now that he has the platform of highest elected office to work from. It's TRULY a \"Phantom Menace.\"The broad plot is very reminiscent of how Adolf Hitler turned the position of chief political -servant- into an absolute dictatorship in the 1930's -- except that Hitler was more open about his true nature and intentions.The title is brilliant. It hearkens back to the cool way they pulled the wool over our eyes years ago with \"Return of the Jedi,\" the central point of which was Darth Vader's return from evil to good. \"ROTJ\"'s WORKING title, leaked to the public as a red herring, was \"REVENGE of the Jedi\" -- a majorly slick move which blinded us all from seeing what the real title actually meant!The Defining Moment of \"The Phantom Menace\" is the moment at which the Queen (or her decoy) stands in the Senate Chamber and calls for a vote of no confidence in the existing Chancellor. This is the one instant about which the entire movie turns.All in all, an outstanding start to the Star Wars saga. I give it a 9 out of 10 -- high marks, for me.","It's interesting how times change. It's very fashionable to hate this movie and give it one star (and no one calls anyone a troll) and it's very unfashionable at the moment to give TFA one star (and lots of people call you a troll).This just shows the power of group-think and marketing.This movie has a new story to tell and if you remove the dialogue in your head about everyone hating it (JarJar, trade federation etc) it has some great bits.Darth Maul is great and would easily kick the butt of the newest 'villain' in the series in about two moves. The music is amazing, particularly Duel of the Fates.It doesn't appear to have the heartless grab for cash in the form of new toys and other useless bits of plastic that no one needs that is all the craze at the moment.I believe this movie is made because George Lucas, who is and always was the heart of Star Wars, had a story to tell. Unlike recent efforts which are clearly just there to make money.","What fun I had at this movie!  The whole experience, from the crowd cheering and excitement as the words \"A long time ago, in a galaxy far, far away\" appeared, to the music, the opening scenes as Qui Gon and Obi Won battled the droids, to the escape of Queen Amidala, to the pod racing, to the unleashing of Darth Maul, to the climatic fight, etc., etc.!  This was a great time.  I hear some complain that it wasn't anything like the first Star Wars, A New Hope.  Well, of course not!  Had it been, everyone would have complained that all they did was try to recapture the magic of the first movie!  I highly recommend this movie to anyone, any age, anywhere!","When I was a small kid, I used to wonder what the Star Wars universe was all about. Imperial soldiers, droids, flying spaceships and starfighters, Jedi Knights, Darth Vader, etc. I was curious with all of these stuff but when I watched all the three Star Wars movies, I began to understand what George Lucas, the creator of the popular sci-fi saga itself, was trying to accomplish: explore the awe and wonders of our ever expanding universe. And now, 22 years after the release of the first movie, George Lucas and his entire crew at Lucasfilm bring the most anticipated movie of 1999, Star Wars Episode I: The Phantom Menace. I am truly impressed with this incredible film despite its noticeable flaws. The evil Trade Federation has stopped all shipping to the peaceful planet of Naboo. To resolve that matter, the Galactic Republic decides to dispatch the two Jedi Knights, Obi-Wan Kenobi and Qui-Gon Jinn to the Trade Federation Battleship to arrange a negotiation with the Neimodians. Unfortunately for our heroes, the negotiation never takes place and so they fight face-to-face with thousands of battle droids, escape to Naboo, and there they meet the annoying yet kind-hearted Gungan, Jar Jar Binks as well as the beautiful Queen Amidala (ok, I know some of you out there complaint about her make-up).  Later, our heroes meet Anakin Skywalker, a mysterious boy who is believed to bring the Balance to the Force. In my opinion, Anakin is such a cool person because he is a great podracer who never wins a single match until his recent confrontation with rival Sebulba (he is going to fly a Naboo starfighter too during the battle of Naboo. Bravo to Jake Lloyd!). You need to see the rest of the film if you haven't watched one yet. Episode I: The Phantom Menace is a very enjoyable movie that may even attract those who are not widely known to the Star Wars universe. I especially like the locations on some planets (the Naboo Palace and the wondrous city of Coruscant) as well as its awesome special effects. To heighten up the action, Darth Maul makes an incredible performance during the climatic battle with the Jedi Knights. However, I never say that The Phantom Menace is a 100% perfect movie. The storyline is pretty weak  (gee, I wonder what George Lucas is thinking) and some characters aren't well developed.  Still, this IS just only the beginning, and perhaps there will be a major improvement by the time Episode II is released.","The main line of defence seems to be: lighten up, it's just entertainment / just a kid's movie / just a special effects flick.  Pausing awhile to note that people who run this line of defence have all but conceded that the film is, in fact, bad, let's take these points one by one - shall we?As entertainment it's poor.  Dialogue is flat and perfunctory (don't expect to be dazzled by repartee); the story lacks the beauty of the first Star Wars film and the tension of the second ... and then there's the magical `character development' everyone complains about.  We must distinguish character development from character delineation.  The former is nice, but the latter is absolutely essential, and it's the latter that's missing from `The Phantom Menace'.  Jar Jar, the young Obi Wan, Darth Maul, Armidala, Annakin - all are scarcely characters at all, and are very difficult to get enthused about.  Jar Jar in particular is a collection of mannerisms, nothing more.  This lack of character doesn't just prevent the film from becoming the darling of the intellectuals - it makes it dull.  There are hundreds more entertaining films.  Only those people who entered the cinema carrying plastic light sabers, grimly determined to enjoy themselves, failed to notice this.It's a kid's movie.  Well, yes, in a sense - but not a good sense.  Good children's movies form a proper subset of good movies - simply because adults have access to all childhood emotions and desires, but not vice versa.  So in one sense a `kid's movie' is just a movie that can be understood and apperaciated by children (as well as adults).  Is this a kid's movie in that sense?  Maybe.  But it's also a kid's movie in the bad sense: it's deeply witless, and inexperienced children might - I say, MIGHT - fail to notice just how witless it is.  Children may - I say, MAY - ignore the fact that Jar Jar Binks is a deeply irritating non-character because he is all colour and movement and he speaks funny.  Is this really all we want?Special effects.  These aren't so hot, either.  George Lucas has fallen in love with computers and failed to notice that his digital animals don't move at all in the way that real animals move - worse still, they don't move like any kind of physical object at all.  Nor do most of the alleged physical objects.  Compare the trundling white juggernaut at the start of `Star Wars' - a convincingly solid model - with the insubstantial collection of pixels that darts past us at the start of `The Phantom Menace'.  The special effects have actually deteriorated, and to make matters worse, there are more of them.So the defence that `The Phantom Menace' is allowed to be a poor movie because it really wasn't trying to be something great in the first place, just won't wash.  Especially so, given the ludicrous claims George Lucas has arrogantly made, again and again.  So Jar Jar Binks is the first digitally created main character?  Rubbish - the dragon in `Dragonheart' predates it (and, one might add, is at the very least a genuine character).  So George Lucas is pioneering a new kind of filming-making, more like painting and less like photography, than the old?  Absolute twaddle - Walt Disney did THAT in the 1930s.  I'll tell you what IS new.  Never before has there been so much sizzle, and so little sausage.","It's kind of hard to review this because I don't see this as one movie, but as a chapter part of one larger story. The reason why I say this is cause George Lucas once said that every Star Wars film are intended to be one big movie split into six parts telling a very complex story. I actually think of this an underrated film cause a lot of people don't listen to what George Lucas has to say of the Star Wars saga is intended to be and how it's to be structured. On it's own, I'd probably rate it as a six or seven out of 10. But as a part of a larger story, it gets a 10 out of 10 cause in the long run, it's the very elements of what happens in the film that really make it matter in the Star Wars saga. If you disagree with me about what I say the structure is, just send me a message or place a comment.I saw The Phantom Menace twice in 3-D. The first time was the day it was released Feb., 10 and the second time was with my sister on the Feb., 20. Overall, I thought the post 3-D conversion was fairly impressive and it was worth seeing it again after nearly 13 years of its original release. Probably the most impressive 3-D shots were with the holograms and some lightsaber fight scenes. You could also see Jar Jar's tongue stick out of the screen in one shot. My eyes did strain a little bit at times with the transition from shots that were dark and kind of dole colored to very bright colored shots. But that's my only problem with the 3-D conversion. It was worth going to see again and recommend to any hard core star wars and general moviegoers.","Unlike some other viewers or critics who underrated this movie (and sometimes reviewed before having seen it and made Lucas very angry) I believe it's a fantastic movie, a successful addition to the saga.\nIt's full of action, adventure, incredible jedi-battles with a refreshing hint of politics and diplomacy. (These last two points were absent from the originals since the Empire and the Rebels were in a state of civil war. Check out Star Wars' introduction.)We can see at last see the \"old\" republic and how it worked and functioned; in fact setting the background for the events to come.We have in this movie all the elements of the originals with touches of Lucas' magic: the queen's incredible dresses, the computer generated characters which completely blend in the action, Darth Maul's painted face (which has some asian influence in it) and the human interactions master/student conflicts, tricks, jokes and deceptions.All in all a 10-star movie!","The story to SW1 is actually very detailed and interesting. Now I will admit the dialogue is not superb, but the story does flow and leaves viewers anticipating the next sequel. This movie is a backdrop - an introduction of the Star Wars Universe, the Republic, the Jedi, Other characters and the Trade Federation. This is not an easy task to accomplish - explaining to viewers where all the elements of the original trilogy come from. I think people were expecting this to be right up there with the first three, but forgot to realize that this movie is the beginning of the saga..... Viewers also complained about the complexity of the plot with all the politics....my thoughts are that we need to be informed of the fragile and crumbling centre of the republic in order to completely understand the birth of the Empire. But now that this has all been done, I believe that the action will kick into full swing with \"Attack of the Clones\" (Episode II) Check out the documentaries on the Official site.....especially \"trying to do my thing\" Take a look at our next Anakin.....I think we all will be pleasantly surprised with what the next movie has to offer. Anyway my rating for The Phantom Menace is a healthy 8.5/10.Good stuff George. Looking forward to the next one.","I disagree completely with all the people, who criticize the film, because there's nothing really bad in it. George Lucas and  all of the others worked very hard on TPM, and it shows. After seeing the film a couple of times, I am more and more amazed, how good the script is. GL really thought all details through to make an entertaining experience, and there ARE NO PLOT HOLES. I know that a lot of people out there disagree with me on that, but all of the little problems a lot of people have with the plot can be explained with a little thought, and I believe that GL really thought everything through -- he just didn't tell us the whole story. What surprised me was the German dubbing -- it's really good, and sometimes even better than the original version (I've seen both). Unfortunately we all have to wait too long for the next two episodes...","The release of hardly any other movie was met with the same kind of anticipation and hype than the first chapter in the Star Wars Saga after sixteen years of absence: Episode I. One thing most people at least agree with is the fact that the Prequel's story, including Episode I's, is quite a bit more complex than the story of the original films. While many claims say it turned out unsuccessfully complex, I can't agree. For its insane focus on so-called wooden dialogue\", it's perplexingly sad how the achievements of Episode I's screenplay are publicly missed, forgotten or lightly dismissed. It's as overlooked as it is to be appreciated how George Lucas managed to write a script that introduced a lot of overarching themes and developments while still telling a very basic and immediate story of people fighting for freedom. After all, there are five corresponding story lines depicted in Episode I (Palpatine's rise, the Invasion and Liberation of Naboo, the Jedi's mission introducing the galaxy's workings, the return of the Sith, the discovery of a young boy).It's hardly appreciated how these story lines become one story and how they were worked out to flow into each other, giving room to multiple interesting characters and themes. Those characters are certainly treated in an unconventional way, which feels strange at first, but allows all of them to play a crucial role at some point in the film. You kind of wonder why this or that character is there until at some point of the film it becomes obvious. The films main story is certainly driven by the character of Qui-Gon Jinn, who leads us through the events and gives audiences an anchor for orientation. Despite some contrary claims, this did not go on the expense of Obi-Wan Kenobi. Obi-Wan, after all, was allowed to grow in the wind shadow of his master. In their end fight, Obi-Wan is neither as aggressive as Maul nor as calm and Qui-Gon Jinn and when his master is killed, he almost fails by giving in to his anger and thoughts of revenge. Ultimately though, he remembered his master's teaching which allows him to defeat and kill Darth Maul with Jinn's weapon and become a Jedi Knight. While Qui-Gon is obviously the main driving force of the story, the story itself revolves around a young Queen who is challenged with the struggle of being peaceful and passive or going into a fight to help themselves. In her journey to find the right answer, she meets Anakin Skywalker. Looking at The Phantom Menace with the knowledge of the following two movies, it's remarkable how fluent the groundwork for Anakin's character played out. Anakin's birth into slavery and the following strong need to be free of orders, independent of authority were obvious in both Episode II and III for one. The boy's relationship with both his mother, Shmi (finally introducing the mother), and his surrogate father, Qui-Gon Jinn, is the other side and the emotional heart of the movie. The sense of family that they convey gives a maturity to the series that has been absent before. As part of that, we get to see how Anakin is deeply skilled and gifted while at the same time being confronted with the roots of his fall. Contrary to other Jedi, Anakin has been grown up with his mother and he has become attached to her. Leaving her was a big challenge and the ultimate fate of Shmi (her death with him being unable to stop it) would greatly affect Anakin's action when again confronted with the need to let go (of Padm) to a great extent. Ironically, little Anakin has become almost as hated on the internet as Jar Jar Binks. His reception in nerd culture is sad, not least because Jar Jar is a characters that's supposed to teach us to respect every being because every being has its worth  even if it's sometimes annoying to reach that potential and worth. Jar Jar unconsciously made the first step to bond the Naboo and the Gungans and those who believed in him, particularly Queen Amidala and Qui-Gon Jinn, were rewarded for their faith and humanity. So after being somehow irritating for more than half of the film, Jar Jar becomes important and that's characteristic for the movie. You get to see its full potential and the value that it brings to the Star Wars legend once you allow yourself to let the movie unfold in its own way. All of these characters do have their function in various parts of the story, filling the film's epic imagery with humanity and relevance. The Phantom Menace provides us with an astonishing range of visual expression, showcasing Lucas's talents and sensibilities. The many wide shots showing characters in the context of their environment and the situation the go through just as much call for attention as precise and haunting close-ups of characters like Amidala. In the middle of all this, there are numerous shot that mirror each other or can be seen as inversions of each other or variations of ideas and occurrences. All old, we end up with a movie that's thoroughly entertaining while still saying good things. The movie gives us an idea of how a evil man corrupts a political system and thereby harms society. It gives us an impression of the challenges that leaders are confronted with, being faced with the task to question their whole world-view. It makes it obvious how we all depend on each other (Naboo/Gungans, Jar Jar and the others, midichlorians and the people they live \"inside\"). It tells a story that highlights the value of all beings, from the skilled Jedi to the strong-willed Queen and a gifted young boy to a clumsy but good-hearted stranger. They all play their own specific part to make a better world.","As a devout fan of the whole Star Wars phenomenon, I become increasingly frustrated with comments on how this new Star Wars doesn't stand up to the originals.  For those who remember the originals, they were just as much filled with bad acting, poor dialogue, and flat characters.  The Star Wars movies are meant to be fun, nothing more.  and The Phantom Menace is just that.  Who can deny the excitement of the light-saber dueling, the thrill of the pod race, or the sheer beauty of the alien locations?  Too many people are expecting the saga's content to have matured along with them, but Lucas' heart is still where it was in 1977 (though perhaps notably more profit-oriented).","and this is coming from a huge fan of star wars BEFORE the prequels. These are all the same thing..cheesy dialogue? yup, the OT had that too...bad acting? I fail to see it...Music? Once again, an overly exceptional score by John Williams as always..the prequels aren't perfect by any means, but the hate for them is absolutely ridiculous. These are the backstory to Lucas original ideas. whether you hate them, that is your opinion, but this was Lucas' original intent, and for better worse, this is what they are. For those who say he raped your childhood, well, I guess that sucks for you, but let those who aren't little babies enjoy these. Another solid addition to the Star Wars franchise. 9/10","Do not listen to these butt hurt fanboys. This movie is another great addition to the Star Wars universe. Sure, like every movie, it has some flaws, but overall, this movie is an amazing success. People do not understand that the man who created Star Wars in the first place wrote this one as well. This is how HE wanted it to be. Who cares how YOU wanted it to be. If you don't like it, stfu and gtfo. This movie brought amazing new technology from the old Star Wars, and also wrapped up the awesome ties between old and new. It also brought us some awesome new characters. If you didn't like it, sorry. But for me, as well as REAL Star Wars fans, it was a great success."],"review-user":["BiiivAL","kylopod","laura_brady_au","jaredpahl","billosaurus","mazarmishaw-72504","jugophon","pecr007","zaldymir","wgh","tonymph","fung0","john in missouri","pollycamplin","HulkVader","pip-7","Spleen","jackluckystarwars","mrochette","phizza","Dukat-4","myystery-46766","pundle","dead_pool09","bscar21"],"review-date":["4 June 2018","29 October 2005","29 December 2015","1 December 2015","31 December 2015","29 December 2015","9 January 2000","24 March 2006","26 December 2001","18 July 1999","18 April 2012","28 January 2007","2 July 2000","31 December 2015","12 September 2000","9 March 2001","6 August 1999","3 December 2011","12 June 2001","8 August 2001","4 November 1999","17 January 2016","18 August 2001","6 January 2010","29 September 2010"],"review-rating":["8","5","8","9","9","9","9","10","9","7","2","10","9","9","9","10","4","10","10","10","9","9","10","10","10"],"review-title":[" The path of one person: the pool of fear\n"," A perspective after all the hype has died down\n"," recently rewatched and it's a pretty decent story\n"," The Beginning of the Star Wars Saga Introduces a Vivid New Universe and Celebrates the Innocent Fun of Star Wars, Despite Its Flaws\n"," This scapegoat of a movie definitely needs more appreciation.\n"," good story\n"," Take it for what it is\n"," One of the better Star Wars.\n"," A great addition to the Star Wars legacy\n"," A solid but flawed addition to the Star Wars Saga\n"," Star Wars Episode I: The Phantom Menace\n"," Leave Your Preconceptions Behind\n"," Ignore the Whiners -- The Phantom Menace is Brilliant!\n"," i liked it\n"," A great ride\n"," Star Wars: An Incredible Beginning\n"," Let's stop playing games - bad is bad\n"," One chapter of a much larger story (3-D update)\n"," Fantastic movie - worthy addition to the star wars saga\n"," The Movie which lays the foundations...........\n"," One of the best thought through movies.\n"," The Phantom Menace: Creativity misunderstood.\n"," Too many kids have grown up\n"," Highly Underrated...\n"," Give it up already!\n"]}