{"primary":["Lammbock (2001)","https://m.media-amazon.com/images/M/MV5BM2VhZjMwNDMtZmQ5Zi00YWVjLWJhZGItYzUwYThjYzk3OTM2L2ltYWdlXkEyXkFqcGdeQXVyMzA3Njg4MzY@._V1_UY1200_CR109,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0258760/reviews","tt0258760"],"secondary":["This film breaks the boundaries of the 'typical' German film, creating a whole new genre for the German speaking film. It is a film full of catchy lengthy dialog, which is dominated by the very funny character Kai. The film deals with the issue of being cool, and how you present yourself towards others. Kai is very observant of this fact, constantly judging other peoples actions and commenting on these. Whilst doing this he comes up with new wild theories, which are highly entertaining ranging from Baywatch actresses breast implants, to golden goal theories.His partner in crime is fed up with his lax attitude to life and the aimless life he leads. He himself though is also never happy with what he is doing, always complaining that he's wasting his valuable time doing nothing, but never realises that this is his own fault. His attempt of studding law seems pretty vague and half-hearted and remains a grey area throughout the film whether he is ever going to complete it.Spun into these issues of the main characters, the film shows their new innovative and highly lucrative business plan of distributing cannabis products through their own pizza delivery service: 'Pizzaria Lammbock'. This business of there's goes extremely well allowing them to lead a relaxed and carefree life. In their new found 'paradise' they become careless and too trusting, ultimately letting in an undercover cop in their little secret. Turning their environment and that of their friends into a hostile terrain. The two weed mongers don't find out what kind of mess their in until its all too late, and the undercover cop comes out of the closet!!! What follows then after is a desperate fight to come clean of their deeds which are now not only drug possession with intent to distribute, but also a lot of other things have heaped up on their shoulders. Yet the serious situation the two main characters are in and how they manage to deal with it, by no means lowers the entertainment level, varying from extreme laughter to suspense and surprise. Whether their encounter with the police, leaves them behind bars, or just makes them turn over a new leaf, or indeed leave them unchanged remains the little incentive to learn German and then find out for yourselves!!!","I don't think it is justified to diss Lammbock because of a) \"toilet humour\" or b) low moral standards. It's a funny movie, which demonstrates the problems of growing up instead of making a pure comedy out of it. There may be some harsh scenes, but in no way are they dominating the film. instead the movie treats its characters with honesty and doesn't sell them for a cheap joke, which you can see in so much \"growing-up\"-comedies: it has a certain warmth at his heart. It is indeed a german attempt to make an \"earnest Tarantino-style\" -movie but Lammbock doesn't even try to hide these facts - it is in some way a homage to Tarantino-style dialogues.","I think that Lammbock is one of the best movies ever about dope. If you don't like dope you will likely think that the dialogues are boring and the film is lame - if you have ever liked cannabis, you will laugh loudly about the funny dialogues and the great humor. No, I am not saying that you would have to be stoned to see this movie, this movie is just one of the very few realistic drug-movies. Well, the story isn't realistic, but the atmosphere is. I think that is it, what makes this movie so great, it has managed to catch the atmosphere like it would be in a real smoke-inn. In most cannabis-related movies (i.e. saving grace, cheech&chong,  half-baked) , the effects of this drug are pretty unrealistic, the users are described as stupid, brain-amputated, mumbo-jumbo-bubbling monkeys and many of those have this \"drugs are bad\"-morality. Not so in Lammbock. The users are normal people, some are crashed, most aren't, and they behave pretty much like real,  pot smoking people (well not WHAT they do, but HOW they do it). The acting is just great! Lammbock is free of morality and thats good - I want to watch comedy to be entertained, not to be educated. Well, there are some scenes I didn't like either (i.e. how they treated the forest-worker), but that's not the humor of the whole movie and it doesn't spoil the film! This movie gave me back my faith in German comedy!","This movie is by far one of the best Independent-ish ones I have seen in a long time. Very fresh, original look at a genre where you would think that they've just about done it all.So there are these two potheads who grow their own weed (...and lots of it - all in all a field of well over 250 square feet, well hidden somewhere in the woods). They operate a run-down, back-alley pizza delivery service which really just serves as a cover for selling their weed to customers. You order a \"Gourmet\" pizza and they will put some weed on it, wrapped in aluminum foil and carefully hidden under a big sausage slice. Business goes well until they're in for some bad luck... one of their newly-acquainted friends turns out to be an undercover cop, and one day while they're at the field, they get caught by a forester. From there on, it's all just hilarious mayhem.What makes this movie so refreshing are the dialogues, for one thing, and the storytelling in itself. As can be seen in an interview on the DVD with one of the main actors, the idea with the dialogues in the film was to a great extent to improvise rather than clinging to some script word-by-word. Moritz Bleibtreu (Kai) and Lukas Gregorowicz (Stefan) are REALLY good at this in their two lead roles- they are hilarious together and make it look more like real-life buddy talk. And especially Kai talks a lot of nonsense while \"under the influence\" ;-)The storytelling with its numerous sub-plots is very well done. Just a bunch of things that most \"twentysomethings\" can relate to in one way or another. Stefan is almost out of law school and is worried that all the dope will keep him from studying hard enough for his finals. And then his ex-girlfriend walks back into his life and he really wonders if he should leave his current girlfriend for her. Kai on the other hand has trouble dealing with Stefan's little sister who is coming on to him... and so on.Rent or buy the movie, watch it, watch it over and over, and you will probably never get tired of it!!!I don't know if this movie will ever be available on the Anglo-Saxon market, but if not, you'll definitely be missing out.****1/2 out of *****","Stefan (Gregorowicz) and Kai (Bleibtreu) are best buddies who run a rundown little Pizzeria named \"Lammbock\". However, rather than Italian delicacies, the customers tend to order their home-grown Marihuana, which is hidden under a leaf of salami. While Kai is your typical Stoner, content to smoke until the end of his life, Stefan comes from a more rigid, upper-class background and tends to worry about his examinations to become a lawyer (and getting caught smoking by his stern father (Wepper). Other than that, the duo is concerned only with their marijuana-plantation in the woods, getting stoned, playing video-games, getting stoned, talking trash, partying with their friends-slash-customers and, well, getting more stoned. Trouble arrives when. Trouble arrives when their plants are infected with parasites and they seek aid from smooth-talking Achim (Weigend), who just happens to be a young, ambitious underground-cop.Let me say first of all: I'm not the biggest fans of many of the actors in \"Lammbock\". Especially Bleibtreu, who for a while was hyped as movie-star and Wotan Wilke Möhring, later hyped as protagonists in crime- and action-films have a rather limited acting-range, examples that almost anybody can learn how to function a piano but many will never become master-musicians. However, for their roles in \"Lammbock\" they fit like fists in gloves.The movie often has a very witty dialog and incredibly funny scenes, that makes it sorta a German mix between \"Dazed and Confused\" and \"Fear and Loathing in Las Vegas\". To mention a few highlights would be Möhrings performance as stoner suffering from Tourette's syndrome (making ever second word from his mouth an unintentional obscenity), a scene where Gregorowicz is forced to swallow some highly potent hashish and then attend a formal dinner with his father's colleagues or a policeman (himself a pothead) who lectures future underground-cops.There are some uneven, even unnecessary subplots and plot lines, especially those involving Stefans little sister Laura (Zielcke), her Aids-test, a potential liaison with Kai and of course the infamous \"unintentional incest\"-scene, which go nowhere and add nothing to the movie but time. But those moments are few and far between and take nothing from the overall quality. What separates \"Lammbock\" from many similar-themed films – say, for example, the Jay & Silent Bob or Cheech and Chong flicks – is, that \"Lammbock\" is rarely over the top or some overblown parody and shows the protagonist as people easily can relate to, be they friends of this kind of horticulture or not. It's not like in the mentioned Cheech / Chong films, where you simply know that the duo will escape while smoking the largest joint since Bob Marleys last birthday party, but rather, it keeps the viewer rooting for our \"heroes\", even fevering along with them (especially in the last quarter of the movie).Word of warning though: some of the dialogs will make little sense if you're not familiar with the German background in which the topics take place and if you've never been out with your buddies, smoking the \"hooch\", well, you might not get the point in the first place.Other than that, I'd call it one of the best (if not the best) stoner-comedies produced in Germany (where possession generally carries a hefty fine, possibly jail, social discrimination, etc, etc).7/10","This movie is one of the best German comedies I've ever seen. It was fantastic to see a comedy that was so different from the actual teen comedies. I think the director is a big fan of Kevin Smith because of all the funny dialogues and also his German version of Jay + Silent Bob. When I first saw this two guys on screen I just couldn't stop laughing. I can't wait for the DVD to come out in July. If you have the possibility to watch this movie than go see it!!!LIMBO! FOTZEN! SCHEIßE!!!","\"Lammbock\" is a German 90-minute movie from almost 15 years ago. The writer and director is Christian Zübert and he is still busy making film in 2015. I have seen some of his other works and must say that I preferred these over Lammbock, especially the recent \"Hin und Weg\". But back to this one here. You could probably call it a stoner comedy. It attempts to be more relevant and better in terms of quality than the likes of Axel Stein comedy that was famous back then, but it does not succeed. Lead actor Gregorowicz worked with Zübert on several projects and that is probably also why he got cast here. Marie Zielcke, who play the biggest female part, has not really managed to prove she has good range, but is not much more than a beautiful face. Even if she is not as bad as Neldel, she is fairly irrelevant today, just like Gregorowicz.Bleibtreu, however, is still among Germany's biggest movie stars. Apart from him, you may recognize Wepper, Monot and Möhring in here if you have an interest in German cinema. Unfortunately, all these talented actors cannot really make the script work. The marijuana/police struggles are neither funny nor dramatic enough to make this one worth the watch. Same goes for all the relationship issues. The characters in here were as unlikable as uninteresting, pretty much all of them. Maybe some people perceive this film as hip or trendy, but it really does not offer a lot, neither in terms of writing nor in terms of acting. Thumbs down, one of Bleibtreu's weakest films. Good thing it does not run longer than 1.5 hours.","It's a must watch for every Stoner or for people who accept this way of living. Sometimes the film is getting really crazy but the dialogs are just awesome. You know movies like Half Baked, Cheech and Chong or Grandma's Boy they are classy stoner Movie's. But Lammbock is a special one. The two main actors are playing a very god role and they are both stoner's in real life. It seems like a fictional anarchy movie but when you watch it high it turns into a real story and you can perfectly understand the behavior of the actors. When you don't like Cannabis this Movie doesn't get you happy, but if you do you will love this Movie. Trust me ;)","I have to admit, guiltily, that I quite liked Lammbock, even though it manages to serve up cinematic gaffes faster than McDonald's soggy hamburgers: plenty of silly dope-induced jokes aimed at a very immature audience, cheap rip-offs from Kevin Smith, Roger Avery and Quentin Tarantino (... etc.) 's oeuvres, totally improbable subplots that lead nowhere fast, pointless and -- even worse -- unentertaining violence, underdeveloped characters; in short, a movie that doesn't quite gel. Still, the director Christian Zübert seems to know how to handle actors and consequently there are some great performances (notably from Lukas Gregorowicz, Marie Zielcke, Julian Weigend, the ever- dependable Moritz Bleibtreu, and the underrated Elmar Wepper) despite the somewhat deficient script. Heck, there are some great, memorable scenes as well, only they are outweighed by others that that are born dead. I would suspect that the film's problems are mainly due to the directors lack of experience, which in turn would have required an experienced producer, who should have known when to step in and call the shots.I will be on the lookout for Christian Zübert's next film, and overall I enjoyed watching his film -- on the telly. Had I seen it in the theatres I probably would have been disappointed.","A friend of mine and myself find new Tarantino (he's a Tarantino expert, i only like Kill Bill II) Hommages, in the dialogues, as well as in the non-dialogue scenes. The trashtalk at the beginning reminds of the \"Like a virgin\" discussion from Reservoir Dogs, the (violent?) part of getting rid of the hunter could be an imitation of the PF scene where Vinces blows his hostage's head off by mistake. The \"thought behind\" could have been making a Tarantino-lookalike movie, just without (or less) violence and strong language (what I personally dislike about his movies. Cutting ears off, come on!).Of course the humor is not everyone's taste. If you like drug-influenced trashtalk, this is your film. the single episodes seem pieced together without the \"red line\" between them (except the characters like Frank and Schöngeist. I love those guys - \"Halt's maul du Scheißf...\" - \"Frank. Contenance!\"). Actors do imo a pretty good job - W. W. Möhring always playing with his hair, and, one of my favorite scenes, the headshop scene, where L. Gregorowicz stand still looks impressed.I personally love the movie, for I'm quite in this kind of twisted humour (I love The Big Lebowski as well).stay tunedDK Lord Marshmallow","I like \"Lammbock\" very much. To me it is not a typical \"Stoner\"-Movie, but more about friendship, about making your way in life and how narrow the cliff between good life and danger/peril sometimes is. It has very good dialogues too; from the acting Moritz Bleibtreu delivers most jokes, but Lukas Kantorowicz to me prevailed and was just great. Mainly is a comedy; but some of the content is very deep and like the \"small man in your head\"-discussion (which starts about the two guys discussing if anyone would suck only soccerstars Mehmet Scholls dick or anyones dick) true in a psychological sense. There were two things I did not like: the scene, where Stefan mistakenly humps his sleeping sister and discovers it only in the morning, is just disgusting. Not only that it has nothing to contribute to the story, it is just vile and no content worth for joke (I think this was their intention). also, I did not like the end of the movie so much; when Stefan by free will fails his final exam and also leaves the country. It was like a plea for egotistic behavior, leaving all behind, after his father - who helped him out in a very difficult situation - and Kai helped him so much.","Lammbock is one of these - new modern german movies, made by \"hot young\" directors - bullshit. The movie is supid from the first minute on. The six minute starting dialogue about Pamela Andersons Breasts is a sign of that, what follows. Boring quotes, humor about incest, puking and drugs. But there is nothing new in it. It seems, that the director has made a summary of every urban teeny legend he ever has heard in his high school time. No Joke was bad enough for him to fit his 110 pages Screenplay. There is only one word with wich i could describe this movie - cheap! A black chapter in the career of Moritz Bleibtreu, Marie Zielcke and Sönke Wortmann.","Yeah, what did I expect? I thought this would be a film about young adults at their turning-point in life, something like \"Sonnenallee\" or \"American Pie\", which I liked a lot. I wanted to see a funny film, perhaps with an ironic look on idyllic Wuerzburg. And what did I get?\nAttention, spoilers ahead!\nThis film starts with a lengthy dialogue which gives you a good hint of what will inevitably follow: more lengthy dialogues. Sometimes I thought Moritz Bleibtreu might have forgotten his text and trying to hide that fact by improvising and just repeating what he was saying before. But as I think of Bleibtreu as one of the better german actors, I believe that this effect really was intended. I think the author wanted to show how boring talking to close friends can be - especially when they are stoned. But really, I don't need cinema to be bored by stoned friends' talk. Boring dialogues make up most of this film.But okay, that's one thing. I can cope with that, I have seen nice films with abominable dialogues, just think of Schwarzenegger's life's work. But the next thing is that characters are cheap and flat and that the storyline is as foreseeable as anything. Just one example (SPOILER!!): Why, do you think, does someone take a garden hose to his hemp-plants deep in the forest? To water them? Of course not, usually you don't find water-pipes deep in forests, do you? The only reason this water-hose is there is that a hunter who happens to come by while the two protagonists are harvesting their dope can be drugged, maltreated and finally filled up with three bottles of Jaegermeister. I truly hated this scene, because it's really violent. Usually, I don't mind violence in films - slapstick-comedies are full of it. But in that sort of comedy there is a silent agreement between the film and you that people don't get hurt if they fall on their faces or get beaten with chairs or things like that. But if that happens in a film which is otherwise realistic enough, slapstick-scenes also seem real. In this particular scene in \"Lammbock\" I really thought that this hunter must be badly injured, if not dead - the final scene really invoked in me the impression that he is left to die there, totally filled up with more booze anyone could handle. And the protagonists just walk away. It would have been otherwise if the author had consistently followed one style; the scene could have been quite funny.Talking about being consistently - that's what I missed most about this film. The whole film seems to be a listing of small episodes that came to the author's mind. Things just happen without a apparent reason  - yeah, I know, that's life, but that's not cinema, because cinema is meant to tell a story, not to show boring episodes without any significance. I found myself asking \"Where's the point?\" all the time. Characters besides the two main ones are not elaborated, you never get to know why the protagonist's sister wants to sleep with his best friend Kai, in fact, she tells you but I could not buy it, not at all. I think she just was there to give Kai an opportunity to act this childish AIDS-test sketch, which you sure have seen a thousand times before, and mostly better. The protagonist's girlfriend you meet once, then she leaves Germany (what you don't even see and the guy doesn't seem to care) and finally it is mentioned in one sentence that she has met someone else in America and splits up with the protagonist. It seemed to me that the author wanted to tie up a few loose ends. He actually didn't, you never really get to know what's so bad about studying law, being daddy's son (daddy fixes everything in the end and serves coffee in the middle of the night, which to my mind made him one of the nicer characters in the whole film) and living in beautiful Wuerzburg. Even the dinner with daddy's layer-friend, which maybe was intended to show how horrible it is to have to live up to dad's expectations, seemed flat, just another nice dinner with the family's friends (except for the trip the guy is on later, but I think showing that eating dope before you dine with parents isn't healthy was not the point of this scene, if there was any). I have experienced far worse dinners in my life than this one and still finished my exams. I couldn't understand one single character in the whole film, they just seemed flat and implausible.All this made it a not-so-good film, but not one I wouldn't watch again on television. It really had a few good scenes (most of them were not new, though, like the one with the nice and understanding policemen), some were really funny, some dialogues were nice and I like Bleibtreu's play, although he repeated his well-known stereotypes again this time. Not good, not abominable, that's what I thought after the film was half over.But then came this incest scene and this I really found repulsive. Incest simply isn't funny. I don't even know if this was intended to be funny, some people in the audience laughed, so it could have been meant this way. This scene spoiled the whole film for me, I couldn't feel sympathy for the protagonist any more - I can't feel sympathy for anyone who f**** a helpless person, to me, this is rape and rape isn't funny. So it might have been a hint of drama or so, but the incest is never again mentioned (although we thought this could have been one reason for the protagonist to leave Germany in the end, but as it is never mentioned again, we don't know.), it is even totally unnecessary. I almost expected the sister to become pregnant in the end, which would just have added the finishing touch to this tasteless story, but not even this final cliche is fulfilled, just as nothing is really solved or thought through to the end in this film. It isn't really funny, it isn't really a drama, it isn't at all a road movie a la Tarantino despite desperate tries on violence, it is definitely not enjoyable.Skip this film. Watch \"Final Fantasy\", that's also bad, but at least with beautiful pictures and not that tasteless.","Countenance! Antoine Monot, in a copycat impersonation of Kevin Smith's Silent Bob, keeps asking for it, but writer/director Christian Zübert never listens. Zübert just can't say no to a joke, no matter how cheap. The best thing about this movie is its soundtrack. Of course, Joey Burns of Calexico and the divine Jonathan Richman, understated old-school bard of \"There's something about Mary\" fame, would grace any small-town dropout story. In visual allure, Stefan (Lukas Gregorowicz) looks cool enough riding his tan six-series BMW two-door, wearing aviator shades, going nowhere. True, he *accidentally* sleeps with his wild-eyed bohemian kid sister (Marie Zielcke), but then, who wouldn't? Thumbs up also to how he goes black-and-white on a liberal dose of that mysterious substance they call zero-zero, but if you're looking for a slightly more serious rendering of what intoxication can do to you, I suggest you check out \"Fear and Loathing in Las Vegas\".","Lammbock is a very special comedy, as I have never seen it before from a german director. He doesn´t try to impress the audience with brilliant pictures as in our days most of the german directors do in order to show how german movie has developed. No, this movie lives from its brilliant dialogues. Moritz Bleibtreu shows once again, why he is one of my favorite german actors. In some scenes I had the impression that this conversation happens just now, \"live\". In my opinion Bleibtreu had the chance, to improvise in some scenes.Of course Lammbock is a Low-Budget-Production if you compare it to Tarantino´s works for example (who deals with the same kind of humor) but it works and it is good enough to compare it.Great Actors, Great dialogues, great soundtrack - great movie! 7/10","suitram","Christian_alternakid","Spaceant","gvf","t_atzmueller","andre_albrecht","Horst_In_Translation","niklas-r-1994","Karl Self","Lord_Marshmallow","Ehrgeiz","Gargarin","amschu","richard_sleboe","Sybok","3 August 2004","28 August 2001","11 September 2001","18 October 2004","25 January 2014","14 April 2002","9 December 2015","17 March 2014","20 March 2004","17 May 2004","13 June 2007","16 August 2001","26 August 2001","11 April 2007","26 September 2002","10","8","8","7","9","4","10","8","2","4"," A brilliant comedy, not only for stoner's\n"," little black comedy about life and growing up\n"," A great movie!\n"," not your average stoner comedy ;-) (spoilers)\n"," Great stoner-comedy even though it has some uneven moments\n"," Really great comedy\n"," Not really funny and the characters and story are forgettable too\n"," Best Stoner Movie!!\n"," Ihr kennt meinen Standpunkt, ich bin Ästhet\n"," Tarantino for Softies?\n"," Very good movie, but with one vile scene in it\n"," A Black Chapter in German Film History!\n"," Was this intended to be funny?\n"," Because they were high\n"," Great Comedy - but not for everybody\n"]}