{"primary":["Wonder Showzen (TV Series 2005–2006)","https://m.media-amazon.com/images/M/MV5BMTI5ODUyNDA1OV5BMl5BanBnXkFtZTcwODk1NzMzMQ@@._V1_UY1200_CR285,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0450357/reviews","tt0450357"],"secondary":["i won't bother elaborating on how funny and witty i find this show. and i don't think i can really advise anyone to or not watch it based on other shows they like. i just wanted one more voice to be written in something permanent,,, y'know,,,, like digitally,, in some database somewhere. that way, when the time comes to cancel this show, which is just around the corner i'm sure, i can be heard. and all the lords of demography out there who reign over the most important elements of decision making (e.g. which commercials we will get to see,what shows will air and at what times, etc.)will be able to guide their wands not so blindly this time, and actually hear me as a slight statistic when i say \"HEY, THIS SHOW IS SO FUNNY THAT IT MAKES ME LOSE CONTROL OVER MY BOWELS\". ---- so please, for the other 5 people who enjoy wonder showzen, cast your vote like how i did and vote yes on \"hey, don't cancel this please.... please.... for the love of god, what else are you gonna play instead?, that one real world episode where the kids get drunk again?\"","Just saw the premier of this show on MTV. I was completely surprised to that they had the balls to give it a go. Wonder Showzen is a crazy compilation of animated shorts and puppet skits. Honestly I can say that I have not laughed this hard since I don't remember when. This is a very bold statement considering how much of my life i waste away watching anything and everything on television. It's getting to the point where i'm tired of settling for the run of the mill bs thats become so popular. This nonstop laughathon was very refreshing. The show takes on any and every aspect of everyday life without any shame whatsoever. It's unceasing honesty left me on the floor laughing until it still hurts. Really, it still hurts.","I'm disabled, and I watch a LOT of TV. The network stuff is usually pretty bland and tedious to me, re-running the same routines they've been milking since I was a little kid. The sitcoms are still telling the same jokes! So, I wander into all sorts of odd corners of cable, usually to little result. stumbled into \"Wonder Shozen\" on MTV2, and was quite impressed. Edgy, daring, weirdness from another zone entirely. it's often more strange, than innovative, but they are actually trying to create something here, and you gotta respect that. the \"Kidshow\" parody is an old idea, (heck, goes back to \"Groove Tube\" and such, at least), but having little kids asking Stockbrokers who they exploited today, was truly strange, (though I'd have liked to see more reactions from the brokers.) It's quick, and a lot of it falls flat. but the constant barrage of attempts, guarantees something will fly, eventually. Scattershot, but dedicated.","I couldn't stop laughing throughout the entire first episode. The meat factory sequence, the kid in the butcher shop, \"Where do babies come from?\", the Letter N soap opera, the \"Mexico\" wipe effects... oh man, truly one of the funniest things I've ever seen on TV. And I've seen every episode of \"South Park.\" I would go as far as to say this material transcends regular comedic TV and is a work of art. I know a lot of people will disagree, but that was my gut reaction after seeing the first episode.Please give this show a chance. I hope it gets renewed for several years. I know it's on MTV2, so most of you are thinking it can't be that great, but they somehow managed to hit a home run on this one.","About a year ago, I came upon a delightful kids show called Wonder Showzen. Think Sesame Street for smarter kids. Episodes teach children about History, Nature, Health and the Ocean. They also show kids how hot dogs, TV dinners and money is made. The adorable puppets live in a happy land consisting of letters and numbers. Chauncey is the leader, and quite the snappy dresser (top hat and saddle shoes). Between puppet skit and cutesy cartoons involving A doggy doctor, the dangers of having a potty mouth, etc, there are \"Kids Say the Darndest Things\" type Q&A with the children. The things that come out of their mouths... Wonder Showzen isn't afraid to give the kids the facts, but while encouraging them to use their imagination and having fun adventures. Any way, it's nice to see a kids show that is insightful, intelligent and genuinely entertaining to watch. I would recommend this show to anyone who has small impressionable children. Wonder Showzen will make them worldly beyond their years, and cooler than the other kids in class. Wonder Showzen is the best kids show ever. And I am a liar.","I agree with the posted comment, this show is brilliance at it's finest. I hope it remains on the air as long as possible, and I would suggest purchasing MTV2 as a station solely to watch this show if nothing else, it's that great. Well it's certainly my favorite show already, and there have only been several episodes. It is on MTV2, so not as many people may watch it because it is of course viewed by a lesser audience, but because of this it is allowed to push ( and I mean PUSH) the envelope more than a series on basic cable would. It's so great to watch such a witty and fearless show on television. I eagerly anticipate the new ones, and hope more people enjoy this show. Do yourself a favor and do the same!","You may remember the segment \"Kids Show\" on the popular comedy website Ebaumsworld, well MTV2 bought it and now its \"Wondershowzen.\" This is THEE funniest damn thing on television. Think of Sesame Street meets TV Funhouse. Kids saying things you never thought you'd never hear them say, twisted satirical cartoons, numbers and letters having gay sex, weed smoking hippy puppets going on shower strikes. Sometimes the show doesn't even make sense but its still hilarious. This is comedy for a generation of sadistic hyperactive anti-christs. Jimmy Uringer (of MSI) probably loves Wondershowzen. I know I do, and if you're lucky enough to catch it, you will too. ^_^","Ah, having a boy dressed as Hitler ask people about the Youth today (get it? The Hitler Youth??) seems like the demented dream of Trey Parker or Matt Stone, who, incidentally probably wouldn't have the stones to try it with a real kid in a real place. This is a delicious, delirious take on the kids shows we grew up watching that is so smartly put together that it elicits wonder at every creepy turn. The first half of the show about \"Patience\" which tried the audience's patience with its slow, boring repetitive nature is actually rewound and played in its entirety backwards once the show's runner realizes that they're losing the audience and then a new episode on \"SPEED\" (edited for TV) is played in its place. It's just one example out of a hundred real risks the show takes in order to bring the shine out of that old Tom Green commercial surreal. What makes things work so well is how the show plays it straight. It's not a winking, nudging thing. It's a devastating scathing commentary on the life cycle, our world, and our social constructs and the balckhole they all inhabit. It's just so damn funny about the tragedy of it all. Kids will say the darndest things.","I never heard of Wonder Showzen until the other night, when I randomly found it on the shelf at the local rental place. A quick glance at its description on the back of the cover sold me instantly. What I didn't expect was how funny it was. Sickly funny. I've never seen a show so blatantly and brilliantly awful. It's anarchy at its finest, packaged neatly in a vintage Sesame Street vibe that only kids born between 1969-1979 can really understand. Watching this brought back memories of watching The Electric Company and Sesame Street through the mind of someone mentally ill tripping on acid. LOVE IT. I don't think anyone could top the genius of Wonder Showzen. In a way I'm glad there were only 2 seasons of it, because it would have been a shame to see it go downhill and lose its sense of vitriol and vim. Highlights include \"Beat Kids!\" and educational films with kid commentary (saying gems like \"DADDY!\" when a slaughtered pig appears on screen) and Muppet-ish puppets in pornographic situations - it's everything a cynical adult secretly thinks about kids' TV, but manifested with unabashed glee. GET IT.","\"Wonder Showzen\" is everything it set out to be: outrageously funny while at the same time standing against everything right and good in this world. Abortions, sex changes, atheism, child abuse... alcoholism, drug abuse, suicide... if they haven't touched upon it, it probably hasn't been invented yet.Obviously, the show isn't for everyone. Kids shouldn't be watching this, most likely. Religious people or conservatives may be grossly offended. Vegans might be a bit upset. So, if you're uptight about anything, just stay away. If you're jaded like me, though, you'll love this.My only complaint is that the shock value wears off quickly and the show's jokes get repetitive once you catch on to their targets. The first episode is by far the funniest, with the following shows being funny but more derivative of the opener and not nearly as original. That, and after you hear \"a cougar in Wyoming is having a nightmare\", there's really nowhere else to go.","Everyone else will say it sucks. Seriously, I haven't enjoyed a new show like this in quite some time. This show makes me believe in Teevee again. A scathing satire of children's educational teevee, the show simultaneously mocks and cherishes many childhood (and adult) ideals, like cooperation, imagination and diversity. I like a show that's not afraid to take risks, and I wish there were more shows that had as much heart and balls. PS-Anyone saying this show is mean-spirited is probably not paying attention. It is cynical, but cynical and mean-spirited aren't the same thing now, are they? Recommended only for people who don't suck a big one. Everyone else stay clear.","Wonder Showzen was a spoof of Sesame Street and similar children's shows, and more broadly represents MTV's attempt to launch an Adult Swim-type franchise. On both fronts, it had decidedly mixed results.At times, the show is genuinely funny, with an audaciousness that would put even the most offensive Adult Swim shows to shame. For instance, the episode revolving around nature has a particularly gruesome joke regarding the fate of the castoffs from a sex change operation. Another memorable bit involves a young boy interviewing people while dressed up as Hitler.However, the series just as often falls flat, becoming either tedious or annoying. For example, the skits where the puppet Clarence tries to interview people comes across just as annoying to viewers as to the people subjected to it.","Sex, drugs, racism and of course you ABC's. What more could you want in a kid's show!------------------------------------------- -------------------------------------------\"User Comment Guidelines Please note there is a 1,000 word limit on comments. The recommended length is 200 to 500 words. The minimum length for comments is 10 lines of text. Comments which are too short or have been padded with junk text will be discarded. You may only post a single comment per title. What to include: Your comments should focus on the title's content and context. The best reviews include not only whether you liked or disliked a movie or TV-series, but also why. Feel free to mention other titles you consider similar and how this one rates in comparison to them. Comments that are not specific to the title will not be posted on our site. Please write in English only and note that we do not support HTML mark-up within the comments\"","Wonder Showzen, the brainchild of PFFR (Vernon Chatman and John Lee), is THE most offensive thing I've ever seen, and I've seen every episode of South Park! It's so obscure, that you can't help but laugh. It's pretty shocking what these kids say, but that's what gave it the extra zest! Wonder Showzen is considered legendary for it's use of children (for example, in the intro, they have a picture of a crying child on Santa's lap) and it's use of obscure stock footage (for example, the have footage of a fox deteriorating) all used in a creative and dark way. The main amount of the show was amazing and clever, but there are two episodes in particular that are just not sub-par with Wonder Showzen, Mathmatics and Clarence's Special Report, but besides that, the show is pure genius.There are only two shows I've enjoyed from MTV, Beavis and Butthead and This. Such a show like this must be experienced...unless you're easily offended.","Anyone who thinks this program is bad for its shallow portrayal of kids shows is totally missing the point. Wonder Showzen's political undertones are genius and provide a refreshing perspective to an increasingly conservative TV network system. Believe it or not, this show is extremely intelligent and effective on so many levels.This show is excellent at poking fun at the American people and their ignorance toward important societal issues. It manages to subtly sneak in inferences pertaining to our government and its powerful hold over the collective citizen mind. In the end, Wonder Showzen becomes the Sesame Street for adults, providing an educational wake-up call to the apathetic public.I'm guessing this show will not return for a second season, but I am extremely thankful that every episode was released. I praise MTV for letting this show air, and hopefully in time, people will come to appreciate it.","In my opinion, today South Park is worn out and is basically just the same thing over and over so it needs for something to come in and take it's place. Wonder Showzen is the show that I think will do that.If you liked the Kneehigh Park sketch from Chappelle's Show then you'll likely love this (like I do) It's like Sesame Street on an acid trip! This show is everywhere (and I mean that in a good way!) It has (judging from the early pilot and the episode I just watched today) a storyline that goes throughout the episode involving puppets and in between that cartoon bits, Beat Kids, a news program that has kids go out on the street to ask different people questions, Funny Noy Funny is bits of random stock footage and the kids judge whether it's funny or not funny.This is a must see! I thought it was hilarious and I'm going to start watching it every Friday! And you should too! It comes on MTV2, Fridays at 9:30 PM EST/6:30 PM Pacific time (currently) It's likely to become a cult hit and will probably be cancelled seeing as how it has it on MTV's bastard channel MTV2. Too bad because this is some hilarious stuff.If/when it is cancelled they better give us a DVD release of the entire show!","In today's America, one of the most powerful ways of communicating with people and sharing new ideas and thoughts is through media, particularly TV. Now, that the GOP rules one of the most powerful and influential countries in the world, directly writing down the thoughts of how this world is so disturbing and unhappy is not tolerated. It's a shame that the democratic forces have to use comedy to express themselves freely. That way half of the people consider it just comedy, nothing more. Wonder Showzen colorfully expresses views of the world that the majority of wealthy western folk just ignore. Things like vegetarianism, corruption, poverty, sexual freedom, war, love and hate are dealt here from an outstandingly new and refreshing viewpoint. It's a shame it's just comedy. It's a shame that the people refuse to see where we're heading. It's such a shame.","The warning titles at the beginning say that some viewers may find this show offensive. & it's true cos the show which is based on the themes like perversion, sadism, nihilism, satanism, masochism, racism, pedophilia, necrophilia, profanity, discrimination, Nazism & outrageously relentless graphic or content violence simply can't be not offensive to some viewers. So, if you are middle age catholic priest, don't watch this show! It is a direct descendant of old violent MTV shows like Beavis & Butthead and Jackass. It is absurd and senseless nut intentionally so. It is an unconventional humor, politically, morally, ethically incorrect, like a guided missile which has lost all the guidance and cruises loose at the risk of striking the innocent. And at last Wonder Showzen is a mind-bending chaos the effect of which is something like lysergic journey or ether euphoria. five jokes in five seconds. War of the Colors. playing the first half backwards during the second half.result is FUN+SATIRE+MINDBENDER – the mix that makes Wonder Showzen the cocktail you have never experienced before.& KIDS, WATCH THIS SHOW!","Network: MTV2; Genre: Parody, Satire, Comedy; Content Rating: TV-MA (for strong language, adult content, animated blood and violence, scatological humor and - what the hell - crazy puppet sex); Available: Uncensored DVD, MTV; Perspective: Contemporary (star range: 1 - 4);Seasons Reviewed: 2 seasons Tucked a way on satellite-only MTV2 and trading in a Tom Green-style post-modern anti-comedy, \"Wonder Showzen\" is truly the hip show watched only by those in the know. So, I know exactly what I'm supposed to say about it. I know I'm supposed to point to all the reality shows, mindless sitcoms and procedural crime dramas on TV and call \"Wonder Showzen\" a brilliant work of originality. A piece of absurdist art. That there is nothing else on TV like it.Usually, with TV we are just happy if we see a show with some guts or that just doesn't embarrass us with stupidity. But \"Wonder Showzen\" is bad in a different way, a way that we aren't used to on TV. \"Showzen\" passes all these rudimentary tests and then fails spectacularly on the next level - I think it just doesn't achieve the lofty goal it sets for itself.The creators of this surrealistic nightmare of a puppet show, Vernon Chatman and John Lee (of the Brooklyn band PFFR), like its fans, would probably tell you that it is a satirical parody of the kid shows of yesteryear. Immersed deeply in a perfect recreation of every kid show we suffered through as children, the show's only saving grace is that everything it does is with an unblinking straight face. But what about kid shows is it satirizing? \"Showzen\" seems furious that children's shows exist and are pumping young minds with lies sanitizing the horrible state of the world. \"Showzen\" is going to correct the record.The kids show that is \"Showzen\" is hosted by Chauncey (Chatworth), a puppet rag of an indecipherable species (Chauncey as a stoned hippie gets my biggest laugh). A cast of other puppets (including Mother Nature having a sex change and piles of crap with eyeballs) and real kids (the subject of some heavily edited voice-overs to make them say the darndest things) join Chauncey. Lee performs street-interviewer Clarence with a voice so adorable it lets him get away with saying just about anything.Why do I feel like I've seen all this before? Comedy Central has based countless series over the years on taking the template of a children's show and juxtaposing it with something adult, bloody or blasphemous and letting the hilarity ensue. \"Showzen\" is another drained exercise in the concept that this juxtaposition is just inherently funny. It most recalls Robert Smigel's short-lived children's show parody \"TV Funhouse\" (as well as Triumph, the Insult Comic Dog) only less focused, not nearly as clever as it thinks it is and not a fraction as funny. This is your chance to see what \"Funhouse\" would look like running around on a violent cocaine high. Funny. Not Funny.What it lacks in skill, it makes up for with balls. \"Funhouse\" found laughs in racial and scatological jokes. \"Showzen\" finds them in race, vulgarity and angry left-wing middle-school-age anti-war, anti-capitalist politics. What is the show really saying about slaves, American imperialism, God, the meat industry? Nothing really. It is just a subversive re-affirmation of what an angry viewer already believes. Which takes me to its biggest crime: how derivative it becomes, repeating the same jabs on the same targets over and over.The show desperately wants to be controversial, but Nazism, plantation slavery, mushroom clouds, the meat industry and \"He Haw\"? The show's targets aren't just stationary, they are decomposing. As a result, its desire to be a dead-on retro parody and a contemporary social satire crash into each other. It cycles between making sharp jabs, taking back those jabs and straight-up lecturing us. After the DVD comes out, the show lectures us about pirating DVDs. Season 2 goes off, almost entirely, on a rant voicing the liberal fear that Middle America (literally, a puppet shaped like a red state - get it) and \"He Haw\" watching hillbillies are trying to take over the world.It might sound like I'm contradicting myself. How can the show be unoriginal, gutsy, irrelevant and iconoclastic all at the same time? To understand that is to understand that there is a fundamental disconnect going on between TV and the public - the traditional TV viewers it wants to offend and every other TV show out there pushing the same buttons also trying to offend them. Yes, its true, the \"He Haw\" crowd that still exists would surely get up in arms over a blasphemously amusing bit called \"God's Biggest Boners\" or God killing himself with a pistol over loosing a game of rock, paper, scissors. However, when you look at it in the context with the rest of TV  as I am - none of this is that revolutionary. Some time in the last decade all this became TV normality. The difference between them and \"Wonder Showzen\" is passion. To say that \"Showzen\" is angry would be the understatement of the year.So, forgive me if I roll my eyes at this show's pre-teen level rebellion against authority. This is normally the type of twisted enterprise that I like, but \"Wonder Showzen\" is more a dull, crass, mean-spirited, nearly unwatchable and socially irrelevant exercise that delights in torturing its audience for 22 minutes to make unoriginal points. It is like being hurled around in a cyclone of dementia, anarchy, pedophilia and puppet sex.\"Wonder Showzen\" has gotten being awful down to a science, but there will always be an audience for this and if you are going to watch an angry, cheap, mean-spirited, pure ideological spit-wad show, this is the one to watch.* ½ / 4","Seeing this show gives me respect for MTV, though i imagine that MTV sees this random, edgy material as its main selling point and is much less concerned with the pertinent truths it expresses. I write and play music for a living and this show gets me really emotionally riled up. For me, Wondsershowzen serves a completely distinct function from most TV. Instead of dulling or distracting the senses, (which can be often really nice at times), it awakens my spirit of right and wrong. It makes me very uncomfortable, but in a very comforting way. I don't think a lot of viewers absorb most of this show's content, but if they do, kudos to television viewers everywhere.","Anybody who talks crap on this has no taste, or a sense of humor. This show is hilarious! If you like abstract slapstick humor this show is just amazing. Completely brilliant! It features puppets, kids in sick twisted situations and commentaries. Now if that isn't funny, I don't know what is... The puppets are very like cracked out muppets, or sesame street characters. Both the kids in the show and the puppets in combination will surprise you with dirty, hilarious, outragous dialog. One of the comments posted dissed Napolean Dynamite, which I personally find insulting because I think that it was one of the best movies I've seen in quite a while. If Napolean Dynamite is the kind of humor you like then this is the show for you. It is a shocker to those easily offended though, so if you don't like it dirty, this isn't for you. Highly recommended!","WONDER SHOWZEN tries--and fails fantastically--at making an adult orientated parody of classics kids shows. Well, here's an A for effort...and a big middle finger for the end result. The creators of the show seem to have completely forgotten what makes an adult remaking of something originally for kids work, and that is a witty approach to the often false lessons given in the average kids show from the standpoint of the much dirtier (and wiser) adult mind. The unfairly canceled and sadly underrated TV FUNHOUSE was great at doing this, by holding up the often overly familiar clichés of kids shows we've all grown to know and mocking them with witty and knowing panache. SHOWZEN, however, seems to just be an adult sketch show with puppets and kids with little understanding of how to parody classic kids show in any way except to shock. Another thing, the show itself is remarkable tedious. It isn't because of the shocking material, but because the creators decided to go for shocking material in and of itself. They seem to think shocking people is a means in and of itself of good comedy, not realizing shock value in comedy only works when it skews and usually satirizes taboos with wit and humor. SHOWZEN can barely muster up enough wit to make half the jokes even memorable, much less worthy of wasting 24 minutes of your life. These bad jokes, combined with the onslaught of eye-rollingly bad attempts at being edgy (really, it's like a 13 year old Slipknot fan thinking he's cool because he's angry all the time, not realizing it just shows how little he knows about life) and the pointless tedium of some parts of the show (like the screaming heard during the disclaimer) makes it a worthless piece of sh*t. Well, I never said the truth was nice. It's obnoxious, slow-witted, and like being locked in a room with a gaggle of teens too in love with their own bitterness. In other words, it's perfect for the imbeciles at MTV.","Brilliant. Sarte couples with Monty Python then does it again with Sesame Street. Nowhere else can racism, misery, homelessness, despair, dismemberment, inner childness, addiction, sadness, blasphemy and existential crisis be so damn entertaining. It is so wrong that it's right. This show is absolutely genius in a guerrilla theater kind of way: it works because it seems that the show's creators don't give a rat's about pandering to the masses. They're writing to entertain themselves. And that is why the sick and twisted thing works. If you are sensitive to the nasty truths about human nature, this show is not for you. But if you embrace the futility of it all, well kids, this might just be your kind of entertainment. Toxic amoral golden joy in tasty 30 minute bites. This should be shown in smarty ass colleges in the stead of Philosophy 101. Because it doesn't just go to the heart of the truth: it disembowels it and lights up a smoke after. I'd give it thirty stars if I could. In fact, scratch that. I give this sucker ****************************** out of **********. Amen","We all remember the days of Sesame street, watching and growing up with it. Learning new stuff stuff everyday from the show, teaching kids how to count, spell. It wasn't long before i saw wonder showzen. I caught it one night at a friends house, kinda pondered as to what that kind of \"show\" was doing on that late, until i started seeing the jokes and realizing that this wasn't just any kind of show. I had done some research on the show and i began to just fall in love it with it. This was the kind of show that wasn't afraid to do anything, and when i say anything, i mean ANYTHING!! come on where else would you see a kid dressed as Hitler walking around asking people questions, as to who's more offensive. Or the Jewish J and Arab 8 who fall in love, and showing them pornographically in sexual positions. It's everything like Souht Park but 10x more, this show crosses every line there is, and it does it remarkably. Each week the show has it's regular \"puppets\" like Chauncy, and the news caster who has almost like a thousand eyes, and of course Clarence, the puppet who annoys the hell out of anyone, and isn't afraid to do it, it gets so bad people actually attack him on the street.The Show has many memorable segments including Beat Kids, Clarence on the Street, D.O.G. O.B.G.Y.N., a regular cartoon and many many poor. The kids on this show are foul offensive and you sometimes wonder how the hell they got there in the first place! But this show never takes it self seriously, in fact if you take things way to seriously or a joke sometimes offend you steer clear of this show. Mainly this show pokes fun at religion, the government, people, Just about anything. I'd recommend Wonder Showzen to just about anyone looking for a fun comedy with some great laughs and all around Rotten Humour. This Show is definitely not for Children no matter how cute the box may look, keep your kids away from this. This is one show I love and will recommend a lot.Chekc it Out Sometime","I was channel surfing late at night, when the name \"Wonder Showzen\" caught my eye. But the sheer shock value was enough for me to fall in love with this (probably doomed) series. Basically, it adds dark humor to all the forms of early education. Be it puppets (Sesamie Street, infant level), Cartoons (ranging from toddler to elementary level), and those educational videos of the old days.You really have to see this show to understand it's genius. So Godspeed, as this show is most likely to get canceled like other MTV gems (Sifl and Olly anyone?). By the time you read this, the test season is already over .","kjosentoin","burke8","Judexdot1","fac21","kibblesthepig","LoganLOneill","BlazeFox","sallyfifth","act123","gavin6942","hwajar","TheExpatriate700","monkeycrap97","EvelPlatypus","stakahas","gluba2000","molox","naturalborndirector","liquidcelluloid-1","ismasta","g0regasm","eetstatik","haileris","Se7en14","walloonking","4 April 2005","17 March 2005","6 May 2005","16 March 2005","5 May 2006","31 May 2005","3 April 2005","8 April 2006","9 December 2007","9 September 2008","19 June 2006","16 July 2011","4 July 2006","31 January 2009","27 October 2005","26 March 2005","25 April 2005","9 December 2005","10 June 2006","11 May 2006","10 June 2005","29 March 2005","18 March 2007","7 August 2006","28 April 2005","10","9","10","5","10","9","10","10","10","9"," i have an idea, let's not cancel this one.\n"," F'in hilarious\n"," Wow! never seen anything quite like it before\n"," Hilarious. A brilliant work of art.\n"," Best Kids Show Ever...Choke On That Elmo!\n"," Wonder Showzen\n"," Sick, twisted, blasphemous. I LOVE IT!!!!!\n"," Subversive Fun.\n"," Thanks for the best show on TV.\n"," One of the Best Comedy Shows of All Time\n"," Only people with brains and a sense of humour will enjoy this\n"," Funny...Sometimes\n"," It's Like Sesame Street on CRACK! I'm serious\n"," Delightfully Devious!\n"," Extremely Underrated\n"," Likely To Be The Next South Park!\n"," One of the best shows ever\n"," like space shuttle getting a speeding ticket\n"," If you are going to watch a dull, derivative, cheap ideological spit wad show, than this is the one to watch\n"," Brilliant Show Brilliant Brilliant Brilliant\n"," Best Show Ever!\n"," Miserably Bad\n"," Existential Slapstick\n"," Direspectiful,Shamful and You Gotta Love It!\n"," Probably Some of the Best Television Airing Currently\n"]}