{"primary":["Sarkar (2005)","https://m.media-amazon.com/images/M/MV5BZTYwNGU2YzQtMDRjNS00MjlmLTk1MDEtMjBmYWQ3ZjY0NWRjXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_UY1200_CR127,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0432047/reviews","tt0432047"],"secondary":["SARKAR is a creation of a life time from Ramu, it will remain as a highlight in all the artists careers, a great movie...it sucks you into it and throws you out. I watched the movie and before i could realise it started...it finished. When someone says slow narration...they are just ignorant of what cinema making is all about. Amitabh is excellent...on par with him is his son playing hi son in the movie, Abhishek. He is the one actor out of the young genre who will stand tall for a long time. The music of the movie is first rate, it plays a very important role in keeping us glued to what happens on screen.I read a post saying \"a bad adaptation of godfather\" lets get this one clear that this is not Godfather. We get that impression because Ramu says he is inspired by the Hollywood movie, very kind of him. I have seen the movie and can confirm that approx 5% meets with what we have seen in Godfather. Talking about direction, i could write a couple of pages about it, but i prefer to say it is exceptional. Its a pity our movies do not get as much exposure as international cinema, but having watched movies from all other languages, Indian cinema coming from unorthodox directors like Ramu are far better. Watch the movie or you will miss out on something special.","I recently read a review on IMDb completely destroying Sarkar. I found it to be quite untrue. This movie is one of the best i have seen. The performances are mind blowing. Its the first time amitabh has been told to underplay his role.Amitabh is incredibly restrained, and his task is to sit there and look simmeringly angry.The first half focuses on the Big B and the second on the smaller one. Abhishek tries to copy his father's angry look from yesteryear and does so brilliantly. Even Kay Kay Menon does a great job as the bad son. Of course credit must go to Ramu who always makes his stars perform. The camera work and the background score keeps you riveted to the movie. Truly a very good movie.","The movie is as well made as any of the better Ram Gopal Verma movies. The man knows the language of Cinema well and his technique flows very smoothly, but what takes this movie upwards and above RGV's other movies are the stellar performances.The movie follows the story of the family of Sarkar, a powerful 'Bhai' of Mumbai who runs his own law. He executes justice for the down-trodden in the way he deems right, even if it may be (as it invariably is) outside the law. His seat of power, the opposition to it, and it's eventual inheritance is what the movie deals with.AB Sr. does his most balanced portrayal since Aks. His 'Sarkar' comes across as a person aware of the power he controls, rather than one basking in it. And it is this underplayed demeanor that covers the Superstar we otherwise tend to see over the character he plays.AB Jr. plays 'Sarkar Jr' in the movie and he pulls off the double-whammy of proving to be a worthy son/successor of 'Sarkar Sr.' & AB Sr. - I say that coz the dad took a lot more years & movies to prove himself as good as what AB Jr has already proved himself to be.Most of the other characters are played by non-names, or small-names but each of them paints their characters with a reality portrayal - these people ARE the characters they play. I have come to realize that one of the trademarks of a RGV movie is to use actors that have rarely been seen in roles otherwise, leading the viewer into the character without any set expectations/typecasts.But put all of that aside - and watch Kaykay. He plays the elder son of Sarkar, and does he play it. The director knows that this man can shout out words from his eyes what actors fail to do with their mouths, and uses it to full advantage, much to the delight of cinephiles. There are three distinct shots where the camera focuses on Kaykay's face, and one shows only his eyes. What we see in them is as clear as this text you are reading. The fact that this man does so few movies and so far apart makes his performance much more valued, coz one tends to forget how good an actor he is. Never is his name mentioned among the better actors of India, and would it be even now? I would rate this above Company. The reason? Company was a movie about selective performance - Ajay & Vivek doing it then. But Manisha, being the wonderful actor she is, was nothing more than a distraction. And was Ajay Devgan ever able to shed his *star* from his role? No. As real as the movie's story was, the picturization made it quite 'filmy'.The only other movie close to Sarkar in the RGV element is Satya - more so coz of the grittiness and lack of deliberate stylization. It stays in the real world creasing out any clichés that would give it a fictionalized feel.Sarkar is the movie that would be played in the tributes of everyone associated with it, especially Ram Gopal Verma, Amitabh Bachchan, Abhishekh Bachchan and Kaykay (if he ever has one).My Rating --> 4.5/5","Ram Gopal Verma's Sarkar is the best movie I have seen ever. Being the Indian version of The Godfather, it has the perspective of an Indian man who comes out of the system to fight the evils in the society.Comparisons made by the media between the title character Subhash Nagre and a well known politician in Mumbai fall short for the viewer who would liked to have seen the film for knowing the politician. There are similarities - it is not the same.Also, this film is not the straight translation of the epic Godfather although one might see certain similarities. This film is an original by itself. One must stop comparing and enjoy the film. One is sure to enjoy it then.Look out for amazing performances by Amitabh and Abhishek Bachhan, Kay Kay Menon, Supriya Pathak and also a small appearance by Anupam Kher.","First of all..I begin by saying that I AM A HUGE FAN OG \"THE GODFATHER\"-Novel. But Sarkar is not a complete adaptation of Gofather. Only the basic undercurrent of a mafia Don has been taken from it. I feel Sarkar is a great film. RGV proves himself a wonderful director who is truly different from most of the contemporary directors of today who make films for mass appeal. For a film like 'Sarkar' to get mass success, it should be surprising. But go see the film and you will know why! IT is truly the best film of 2005 with 'Black'.The sets are wonderful...Dark and intense...and so is the look given to all characters. They were all very apt to the theme. The background score especially 'Govinda' one is truly intense and helps make you spellbound to this film. The editing is cool and thumbs to everyone behind this genius of a film.The most important thing here is the standout performances! Abhishek Bachchan handles his role very well and we see the rising superstar of tomorrow here. Great job by AB junior. Same goes for Kay Kay...he was superb as the bad son Vishnu. I don't actually agree where some people say he stole away the show...Because...it truly belonged to the Bachchans alone!!! The new meanie in town Rashid rocks!!! Truly what a performance man!!! Standing ovations to him...But if you are pitched against the actor-Amitabh Bachchan in any film, then he is sure to be too bhaari on you. He just excels like anything in this role. This is surely one of his finest performances and goes on par with that of Black. He truly beats Marlon Brando in the role. He makes you go spellbound with those piercing and intense eyes and stands tall and strong as the best actor ever born in Indian Cinema. He excels as Gofather/Subhash Nagre and you get to feel the pulse of his power!!! Had Black not released the same year, Bachchan needn't have worried...Because he would get all the awards and accolades for this performance in Sarkar. He proves himself the 'SARKAR' of bollywood...still going strong in an unbeaten 64!!! He is the ultimate actor without doubt.TWO THUMBS UP TO THE BACHCHAN, ALL THE OTHER ACTOR AND RGV for such a great film!!!","i saw this movie on its first weekend and i was just stunned after watching it.i can't even remember that how 2 hrs. have been passed.The performance from the actors are really wonderful, specially Jr. bachchan. i think the Jr. is taking some acting skills from his father. i strictly recommend that he is 2 step ahead from his father in this film.The script, Background Mscore, Editing, Cinematography, direction, everything is just next 2 great.SUMIT","Ram Gopal Verma has not intended to actually remake \"The Godfather\". Its his tribute to the original great story & subsequent adaptation for Indian audiences. Hence, if one thinks that Sarkar is an Indian remake of Coppola's \"The Godfather\" he might get disappointed as for fact even the director has not intended to revive the original Master piece.\"Sarkar\" is an Acting galore. After Agneepath, we see the best performance of Amitabh Bachchan of his career. Here is an absolutely unique genre of Acting skill depicted by Amitabh Bachchan, playing Subhash Nagare (Sarkar) illustrating all emotions through his Eyes. With very less dialogs spoken, Amitabh Bachchan proficiently establishes a massive screen presence captivating the audience throughout the movie.Its finally proved that, its only Amitabh Bachchan who can reach or excel the act of Marlon Brando as Vito Corleone from the original.Sarkar begins with a common man visiting Subhash Nagare seeking justice for his rape-victim daughter. The first 30 minutes is an explosive drama. The meeting with Rashid & Sarkar is riveting. The villains in the movie are like any other Hindi movie Villains and are shown larger than life which possibly was a setback unexpected from R.G.Verma Film.The strength of the movie drama again slightly suppresses by pale acting from Kay-Kay, who plays Sarkar's elder son. Abhishek as Sarkar's younger son is shown as obedient & modest as Al Pacino in The Godfather. The Script is then changed from the Original, and in a better fashion to suit Indian cinema. The Elder son joins the Baddies & Sarkar is caught in a conspiracy of killing a honest politician. Sarkar is arrested and an attempt to murder Sarkar in Jail is planned by the baddies just when the younger son saves his father. The gradual transformation of Abhisekh's humble human person to the tough-guy is splendid.The major drawback of the film includes the lack of display of the Operations & Business Conducts carried out by Sarkar. We don't come to know primarily what are their various source of income. What governs the strength of \"Sarkar\" ? What are the mutual benefits deriving from relationships of the Politicians with Sarkar ? In R.G.Verma's Satya & Company, they perfectly dispayed the operations which the gangs conduct, their source of income & various businesses they do. Finally the film is a journey revived through \"Agneepath\" where we relish the powerful performance of Superstar Amitabh Bachchan.","Its not easy to choose a subject rather a film that has been made in almost all languages and by everyone who calls himself a director. Still, Ram Gopal Varma (RGV) has chosen it and has made the best Indian version of The Godfather. Dialogues or the lack of it makes a wonderful statement about the style of RGV. It could have been easy for RGV to have gone an self-indulgence trip and shoot a 4 hour film. But he has kept it short, true to the characters, script and definitely has come out trumps.Casting is wonderful in this film. K K has done a fantastic job. Amitabh has been well handled. Abhishek is getting better with each of his films. There are certain dialogues which are riveting and RGV has chosen the characters to speak them to have the effect on the audience like the Swamiji saying, 'You cannot kill the man, you should kill the philosophy' is easily the best dialogue in the film that epitomizes the script.Camera, Music all positively adds to the film. Definitely an effort the original crew and cast would be proud.A Must watch for film fans!","A very Indianized version of Godfather... When I went to watch the movie, I thought that this will be just another hyped up movie with a good trailer... But Sarkar was a pleasant surprise. RGV puts together an ensemble cast making this the best RGV movie till date. Brilliant performances by Big B and Kay Kay. AB junior is overshadowed by his dad in the first half but after watching the whole movie, I think this is one of his better movies till date. If you liked AB Jr in Yuva, you will definitely like this one too. The entire cast did total justice to their roles... One of the best movies released this year. Its worth the money... And please watch it on the big screen... The dull lighting and the echoing voice of Big B is sure to give you goose bumps. But if you looking for the regular Bollywood mix of action, drama and songs, you will be disappointed.","Sarkar a bolly wood remake of Godfather is not even remotely close to the original as par to execution wise. The next major fault of the movie is that RGV remained principal characters in the movie underdeveloped. Even the title character of the movie played by Mr. Bacchan is not clearly developed. But still this movie need some mentioned because for its powerful performances from lead cast. Specially the surprise element is the performance from Jr. Bacchan. If You disagree with RGV version that Abhiseikh is ahead of Big B in terms of natural talent of performing arts go and watch Sarkaar you will realize he has said nothing wrong. He least speaks and he performs with his eyes. Shahrukh & Amir this guy is superstar of tomorrow and like Hrithwik I can bet you cannot stop him. He is undeniably the best actor of this generation and Hrithwik Roshan is next to follow. Story is Crime Saga like all RGV films. Amitabh is the most powerful person in Bombay who believe in his own Principal and ethics. He run his unparalleled government and even Chief Minister of the state can do nothing against him as he has so much popularity in between masses. He believe in helping poor and helpless people and he is known for giving justice to the innocent one. The problem comes in his life when he deny to help his some of the colleagues for unethical work. Further he became victim of grand design operated by gangsters and Chief Minister of the state. For this purpose they even took help of his elder son. Suddenly a leader of the opposition played by Anupam Kher in the movie get murdered and Amitabh Bacchan became the prime suspect of all these. He became arrested but Abhiseikh his younger son took a mission to find out guilty. And finally he do what he owe from his heart. Love triangle between Katrina, Abhiseikh & Tanisha runs along with the principal story in the movie. Anyway I love this movie because of the performances of Jr. B, K.K. Menon & of course Big B.9 out of 10. Watch it you will definitely love it for some good reason it has, to be 1st hit movie of next 6 month of year 2005.","The opening credit clearly puts a disclaimer that like many, he is inspired by Puzo/ Copolla' \"The Godfather\". The very first scene reminds you of the opening of \"The Godfather\". What follows next is an engaging and captivating tale though remaining within the basic framework of \"The Godfather\". Too many close-up shots puts immense pressure on the actors when the camera begins to roll. And guess what barring a few, everyone delivers. ۞ Big B:: RGV's dream come true first outing. Its a tailor-made role for him. Fans both RGV's and Big B's would have been satiated at this deadly combo, and it worked very both for both. ۞ Kay Kay:: After Big B, this movie will be remembered only for Kay Kay. He stands tall opposite Big B and leaves a tremendous impact (to an extent that he topples Big B with his towering performance). ۞ Aby Baby:: Silent, resilient performance start to flesh out in the second half of the movie. He does it quite effectively. The stubble and the introvert character suits him actually.۞ Kota:: You will love to hate this character called Selva Mani. ۞ Supriya Pathak:: Authentic performance.۞ Tanisha:: Weakest link.۞ Katrina:: Extended special appearance. RGV fans will get their quota of unconventional camera angles and violence. The chantings of \"Govinda Govinda\" could have been little more subdued. Otherwise the background music is engaging. Sarkar is no-nonsense narrative with practically zero relief moments. Its gritty, and fast, so the viewer has to concentrate. The sepia colour adds to the rustic/ raw look. It ensures to leaves an impact, to the extent that you would love to watch it again to catch those finer nuances which you would have missed in the first instance. PS: Don't forget to the sequel which propels \"Sarkar\" to a different level altogether.","Hollywood guys can forward this movie to Mr.Francis Ford Cuppola and say this is the best version of his \"godfather\" (regionally) ever made on the face of this planet....movie rests on three pillars screenplay ,narrative technique and acting.... as usual Amitabh Bacchan delivers with venom...Abishek shines through...but the special mention should be given to Kay Kay for his role of elder son \"vishnu\" ....Kay Kay s eyes were intruding as were his fine acting skills.. there are some spoilers though..but the three pillars cover them up equally.... Kota srinivas Rao as \"madrasi\"...saying \"mera style south,operation north\" was to the bonesworth watching ...RGV stamped movie..signature .....","This movie is a very difficult to review movie. Lets start by going through the good part. Amitabh Bachhan as always is brilliant. There are so many pictures amitabh is doing in the current times and still he makes me wonder by doing something in one of these movies which again reminds how good he is . There could not have been any body else in Indian film industry who could have played this role with this conviction as amitabh has done. Same goes for other actors in the movie as well , Abhishake and Kay kay have both come out so good that if you have not seen original , you would be surprised by the sheer rawness and seriousness of the movie.But thats where the crux is , if you have seen the original than even if you don't want to feel like that you will feel to put this movie on the second grade. Abhishake is excellent but Al pachino is much better than that. The conflict of a person caught between love of his father and a clean life demanded by his would be wife is depicted in such a way by AL pachino that it would be nearly possible for anybody to come closer to that.over all it is an excellent movie but the way it is , comparisons to original is inevitable and when it is done original proves the point that it is original.","Sarkar is a good movie by any standard. It portrays a fictitious do-gooder who is a messiah to the down-trodden. In the Indian context where the rule of law is but a mockery of its own self, Sarkar (played by Amitabh Bachhan) does a very good job running a parallel government of sorts.The movie does have its lacunae, e.g., the source of Sarkar's income is not shown anywhere. The movie does not have any unnecessary song sequence and it is a welcome relief.I am sure it is going to remain on my list of top ten Hindi movies of all time for a long time to come.","a rushed project is what i can call this movie, which had the potential to be great, but the director, Ram Gopal Verma, just to imitate The Godfather & The Godfather II, rushed so many things and made a mess of so many scenes.The movie is watchable for the performances & background score & some of Amitabh's lines are praise worthy but there are many contradictions within the character of \"Sarkar\"..At 1 moment Sarkar(Amitabh Bachchan) says \"power is gained by joining people together, not by making them go against you\", then when someone visits him(Rashid) to strike a deal with him, he himself acts in such an offensive way asking that man to become his enemy and forgetting his own basic rule.At another moment Sarkar says \"I don't interfere in other's business\" yet after telling Rashid that he wont do business with him he specifically calls him and tells him that he would not even let Rashid do the business himself.(Note:in the Godfather how wonderfully Marlon Brando tells Solozzo who comes 4 a similar deal that drugs is a dirty business etc etc and he cant help him but also he wishes him the best in whatever he does, thats what should have been done here, since Sarkar is a man for the people, he should act nice even with an enemy so that he doesn't create a hostile environment around him) Now the son played by Abhishek(Shankar Naagre) and killing his own brother played by K.K(Vishnu Naagre), this was put in just to copy the Godfather II and nothing else, because it was so unconvincing the way it was handled, it took two parts for The Godfather to show Michael Corleone order the killing of his own brother, showing every inch of change in his character till the last scene of the Godfather II, whereas in Sarkar, it was rushed, out of no where you see Shankar telling his father he killed his own brother & the reaction of the father was very bad, it was not convincing at all, as if not a son but an enemy died.So overall it was a good movie judging by Hindi movie standards but still, for me it was a huge disappointment because when this movie was announced, I thought RGV would handle it so well & make a movie better than his own Satya, which remains his best movie.","Yet another version of mother of all gangster flicks-the Classic \"Godfather\" and yet another case of over-hype due to media circus. Sarkar, the 13th Hindi film of Ram Gopal Varma as director is also the weakest in his Underworld trilogy including the other two being the excellent-Satya and Company. The Charisma, the magnetic persona of the two Bachchans playing father-son duo on screen for the first time is definitely a treat to watch out for. Not just strong performances but their perfect chemistry is the biggest scoring point here for which Varma should be applauded. However, the same equation of the duo is missing with the other characters in the film. Reason-the other characters look more like cardboard caricatures esp. the villains represent the typical Bollywood baddies. A character who attracts attention is elder son played by Kaykay but again not able to hold due to half-baked characterization. . The Drama and conflict is brought alive by the excessive use of Close-shots, which brought a claustrophobic effect rightly needed to construct an ambiance. The haunting Score (Amar Mohile) and the sound design (Kunal Mehta, Parikshit Lalwani & Anup Dev), together with dark, murky background overlapped by shinning powerful images (camerawork by Amit Roy) contributes to Visuals so typical of Ramu's style. But there is an overuse of Music though fortunately no songs are there in the film. But can interest of today's \"intelligently growing\" audience be sustained just on shoulders of two performers and strong Visuals ? I don't think so. Surely, audience \"maangey more\" and here film fails to deliver. In any adaptation, in order to add a new dimension, the biggest pre-requisite is the Screenplay, which is sluggish here not being crisp at places, and therefore the pace slackens quite often. What finally audience is subjected to is a highly predictable, very commonplace drama with very little surprise elements. Top Stunt director Allan Amin Ghani is also not in his best form. Some scenes which require a different treatment includes- a Minister is talking foul about Sarkar and the son is overhearing; a very amateurish shoot out in the jail on Sarkar, Sarkar Jr. escapes from the clutches of his enemies, a Son easily motivated to kill his own father, a son is secretly entering his father's room to kill him, a police commissioner slapping Sarkar Jr-all this requires a more realistic, hard-hitting approach which is the back-bone to create the required conflict. The dialogues are weak for eg. look at an amateurish line where a CM says to Sarkar Jr. \"Wo jo Police Commissioner tha na usay maine hata diya\".. The women folk take on Sarkar's working is completely ignored. The uninterrupted negotiations about criminal activities while Sarkar is with his family also look slightly out of place In fact, the film follows a graph quite similar to Ramu's own production-Ab Tak Chhappan. In depicting the battle between good and evil, the other side of life-the law, police, administration, politics is completely ignored. Certainly, more is expected in content. Here the film definitely falls short and could not rise above an average fare. Dear Ramu, agreed that now you are laughing your way to the bank, you definitely need to take some drastic overhauling measures in your film production factory, before it is too late.","A remake can be successful. An adaptation can be successful. It isn't relevant whether its a remake or an adaptation.A good movie is a good movie and a poor movie is a poor movie, regardless.Sarkar, I am afraid, was a very poor movie. First of all, just by making characters look dangerous, or macho, they don't bring in an aura about them.What was so brilliant about Nagre(Amitabh Bacchan's character) that we should have been in aura of his 'power' and what showed the 'benevolence' of the character? Nothing.This fact was said by a commentator and Amitabh kept giving facial expressions. Now Amitabh can give brilliant facial expressions but why should it mean any thing if there is no history or story to go with it.There wasn't proper charecterisation of the characters who worked under 'sarkar' too. Just because a man had spectacles, why should we assume he is wise. ] The flow of the movie was generally dullbecause scenes from the Godfather were created (like the policeman slapping Abhishek Bacchan), the older brother being killed by Abhishek (like Fredo was killed on instructions of Pacino) but too much was sought to be packed into the movie with too little story and depth to go with it. That was indeed the problem.If you try to pack 3 hours of intricate detail like a Godfather in 2 hours and that too with few dialogues, what you get is a highlights show from a cricket match, never making the full impact watching a full match will make.","The movie made out to be a tribute to the Godfather comes nowhere close to the legendary Don Corleone. Overall the movie fails to create the desired impact in-spite of a good storyline and a star studded cast. Amitabh Bachchan is Sarkar, the parallel law for those that cannot help themselves. He is not his usual over the top self and while some would be relieved, he somehow seems to have lost his edge. Supriya Pathak is extremely believable as the wife of Sarkar and the mother of her misguided son Vishnu(Kay Kay).In the end it is Abhishek Bachchan who steals the show as Shankar. He moves effortlessly in his role as the US returned son to the son who finally takes over the reigns as Sarkar. RGV sure knows how to get the best out of him. After Lallan in Yuva, this is AB Baby's best performance.The movie is a sure watch for Abhishek Bachchan and Amitabh Bachchan. The father son duo create magic when on screen together.","First of all to put an end to the never ending debate to the Sarkar Vs Godfather, this is NOT a Godfather and can never be one, thanks to it's over-hyped characterisation, thin plot & most importantly an underplayed protagonist. When you see a director of the class of RGV making statements like \"I wanted to make this movie from 25 yrs ... This is my best movie so far ...\"., your clinical analysis should be prefect. Read this review & you will appreciate why I've said so, without any prejudice.First of all, why do you think Godfather is bible for many young directors? Put it simply, its characterisation, its drama & powerful dialogues set amidst a realistically paced screenplay. Of course we need not copy Godfather but what we need to understand is the essence of film-making taken from the Godfather saga. RGV himself has attributed his inspiration from this film by which I will assume he does justice to its style of film-making. Unfortunately he disappoints in many sectors.1) The PLOT The whole plot of the movie is about two things - killing Sarkar & taking revenge on Sarkar's assassination attempt. This is where the film fails to justify its protagonist's role. Where have you seen Sarkar;s character growing.., sharing his principles with the family, where did you see Sarkar's treatment of the business, where is it captured the nuances of the character building?In fact the first 15 mins is the only place where Sarkar has been portrayed well. The rest just sidelines the main theme - SARKAR to a mere revenge, plot killing saga of hero vs villain.2) Too many villains. This is a conventional storyline with too many caricatures throwing in as Goons. OK., now for comparison with Godfather(mind you this is just the style of film-making & not the actual film), have you seen a single villain glorified in the whole trilogy? The whole crux was on Godfather & his son, how they manage the business. SIMPLE. You don't throw in loud music, lots of characters to over emphasise a bad guy. This is absolute cliché. Too many reels wasted on showing the bad guys when its not so important to show them.3) Too loud music. Whatever happened with RGV, he seems to be choosing the wrong person for BG score these days. Amar Mohile is annoying and irritating most of the times. He doesn't know that adding music for every scene actually spoils the impact & effect. Besides if you notice, there are 4-5 instruments used in the same scene ( Sitar, classical, dhol, violin. synths .., which change the mood of the film in seconds). For a dark movie, you only need violin & bass. or else no music. Perhaps ar rahman or Sandeep Chowta are the only ones who know the basics in this dept.4) Underplayed characters. As mentioned, Sarkar is underplayed. There is not much scope or role for him after 45 mins of the movie. & for all those who are praising AB's acting skills., they need to justify the same. There isn't much scope for him in this. I don't remember a single powerful, yet subtle dialogue from him in this movie. It's a shame that a protagonist himself is underplayed. The only person who exemplified in acting in this movie was Kay Kay. Absolutely brilliant !!! But unfortunately we don't see much of his character being built up after the interval which is bad. There could have been so much scope to his dark shaded side. Abhishek is good, nothing extra ordinary again. (Yuva has much larger scope & its still his best)There was so much talk about Sarkar's \"power\". Unfortunaltey Amitabh looks helpless, throughout the movie. He seems to be dependent on his sons & associates & post interval is a mere waste for his role. This is where RGV loses balance & focus. This movie is all about SARKAR & his power (Remember Satya?) not his chamchas, not the villains, not his sons., not the plot. So bingo ! You are lost again.5) Ending. A shabby ending which sounds quite banal. Son kills goons., takes over & he is now the DON. In fact they waste 30 mins of reel (in the 120 mins) just to show the chasing, revenge killing which was all unnecessary. (could have done in 5 mins)The bottomline is RGV like many others fail to understand why Godfather is such a prodigy in film-making. In an attempt to make an adaptation they only take the principle characters & leave behind the characterisation & the plot. But yes, there are a few good moments in the film which deserver an applause, for ex., Abhisheks reaction when he kills his bro etc. The cinematography is brilliant with it's black n grey shades. Talking of adaptations., \"Nayakan\" is a far better adaptation than Sarkar. In fact you will be taken aback by the power, performance, story & direction of that movie. Sarkar doesn't even come close to it. Sarkar fails on both the grounds - Godfather adaptation as well as RGV's capability (Just to mention, Satya still is a cult movie & remains his best direction till date). RGV probably is suffering from a post satya syndrome where he is self assuming his films to be near perfection, sadly they are lost in the pipeline.","GODFATHER: Bonasera asks Godfather to have the men who raped his daughter to be murdered. He says that the government has failed in convicting her daughter's molesters. This scene explains how Godfather is approached by commoners and how their problems were solved.SARKAR: An old man seeks the help of Sarkar after his daughter was raped. This scene explains how Sarkar is approached by commoners and how their problems were solved.GODFATHER: Kay Adams - Michael's girlfriend - dislikes mob culture SARKAR: Pooja - girl friend of Shankar - dislikes the culture of Sarkar.GODFATHER: Solozzo wants to do drugs business and asks Godfather for protection.Godfather treats it as purely business deal and rejects in extending protection. And asks Solozzo to do his business independently, and Godfather does not have any objections so long as their interests do not conflict.SARKAR: Mastan wants to do drugs business and asks Sarkar's permission.Sarkar treats it as social/personal problem. He refuses to give permission. At the same time warns Mastan that he would not let him do drugs business.GODFATHER: Assassination attempt on Godfather leads to his hospitalization. The incidents followed bring Michael - who has alternative career plans - close to his father.SARKAR: Arresting of Sarkar brings Shankar - who has alternative career plans - close to his father.GODFATHER: When Michael tells police commissioner that life of his father at hospital is at risk, he was provoked and slapped by the police commissioner. Later on Michael takes revenge by killing him.SARKAR: When Shankar complains to Police Commissioner that his father's life in jail is at risk, he was provoked and slapped by the police commissioner. Later on CM sacks Police Commissioner.GODFATHER: Michael orders the assassination of his morally-weak brother Freddy and gets him killed.SARKAR: Shankar kills his morally-weak brother directly.GODFATHER: Simultaneous mass assassination of rival gangs towards climax while the baptism ceremony is going on. Michael has the alibi.SARKAR: Simultaneous mass assassination of rival gangs towards climax with Shankar participating in one such assassination.","One of the most talented filmmakers of India, Ram Gopal Varma, finally stops insisting people to watch Antra Mali and decides to work with superstars and how! No one can make a underworld/gangster film as beautifully as RGV. Amitabh, as we all know, can play any role to perfection with Sarkar just being another feather on his cap. Amitabh plays Subhash Nagre, a man with power, a man with principles, and a man who will stop at nothing to ensure justice--a very interesting character indeed. Where all branches of government are falling apart through corruption, Nagre becomes the new Sarkar. Abhishek, \"the new superstar,\" as RGV aptly puts it, plays Nagre's son, who is caught in the midst of a political turmoil where his dad is at stake. Father and son created magic on the screen making it difficult to decide who did a better job. Let's see how the sequel turns out!","I recently saw Sarkar and to say the least was not impressed at all. It seems to be a movie made in hurry and in process giving blind eye to so many things associated with good movies like Satya and Company. People were talking about the acting of Amitabh and Abhishek but I think a person who deserves applause is KK. But than you don't expect any thing less from Mr. Bachhan. Junior is also shaping up really well but he still needs to bring the nuances in his acting which is so essential for the accomplished actor. Rest of the cast has nothing much to do.As to comparison with Godfather it is not even remotely close in terms of execution and than there are so many things unexplained. Also characters of Baba which is a take on the pope in the original is a complete stereo-type. Background music does not adds to the characterization although it goes with the moods of the movie, but again it is nowhere close to Satya and Company (both by Sandeep Chowta). Dialogues were not good enough leaving at one or two places. Again how does Abhishek comes to know about the mole is not explained. Also original was about the family and but this is only about father and son.If I were Ram Gopal Verma and the critic of good cinema I will not call it inspired by Godfather. Mr. Varma we expect from you only path breaking cinema. You are the original and you can't ask us the expect anything less.","I was always apprehensive of a film inspired from \"The Godfather\". But RGV proves once again that he is one of the best filmmakers in Indian cinema. Sarkar is as different from Godfather as east from west. Its a fitting tribute to the greatest film ever made and i don't think anybody can do a better job than this. You just can not make a better Indian adaptation of GF.From the opening sequence till the last scene this is film-making at its finest. Camera-work is so amazing that it should put another Indian filmmakers to shame. The background score though repeated a few times is superb. The story is simple and predictable but its the execution which is simply excellent.Sarkar also boasts of some excellent performances by Amitabh and particularly Abhishek who proves his Bachchan surname in the last 20 minutes of the film. Seems like if he gets the right directors and the right roles he will be able to form a league of his own. Sarkar is a brilliant film and some people are dumb enough to look for godfather in this film and some idiots watch too much chopra/johar crap that they have to criticise this film without any valid reason. Its a brave effort from RGV and it needs to be seen and admired. Well done Ram Gopal Verma and thank you for a great film.","SARKAR is as good as the original classic GODFATHER!!!SARKAR belongs completely to AMITABH BACHCHAN and ABHISHEK BACHCHAN!!!! People you have got to watch this movie!!! Please do!!!!Cinematography is just mind blowing!!! What brilliant camera shots, the angles...... man this movie rocks!!!!! All the actors were perfect for their characters which were completely defined with a razor blade!!!!!! This movie, as it is suppose to be, a true tribute to the original GODFATHER movie!!!!RGV has done a brilliant brilliant job!!! Right from start to till the last scene of the movie, you are completely spell-bounded!!!!! The movie wreaks of perfection!!!!!!!! DEFO DEFO DEFO NEED TO WATCH THIS MOVIE!!!!!!!!!!!!!!!!!!! *****************AVOID VIDEO PRIRACY********************","One would expect a better movie from Ram Gopal Verma.The Indian adaption of The Godfather turned out to be a turn off. I personally feel,Ramu, having Amitabh as well as Abhishek in the movie could have used them in better way.The movie is very predictable from the start and one really needs to put in great effort to remember various characters,some of whom don't in figure in rest of the movie ... like in the movie Amitabh calls for \"Luca Barazi\" after his meeting with \"Sollozo\" but as it turns out .. the \"Luca Barazi\" is never shown in the movie afterwards.Very ambitious project of Ram Gopal Verma. High expectations from people.Those who haven't read the book or seen the original movie may even like it. But i would recommend to those who have seen the English version or read the book to stay away from this one.","rdig1-1","aditya_sridhar","shariqq","apurvk","diligentdrool_14","polysuravi1","Asphyxiod","itsvalli","rekha-r-nair","pankajshakya","AvinashPatalay","kaliom","santoshtiwarih3g","dmohanty","maqbool","sandhirflora","pratyush","pujapatankar","infinityToHeaven","alok-jethanandani","AishFan","viveck_thakur","darksideofmoon","varuna12","rishab_jain","4 July 2005","6 July 2005","30 July 2005","2 July 2005","9 November 2006","4 July 2005","5 July 2005","22 August 2005","4 July 2005","1 August 2005","13 October 2010","1 July 2005","19 December 2005","25 September 2005","11 August 2005","17 July 2005","3 July 2005","1 July 2005","7 July 2005","20 December 2006","15 August 2005","9 July 2005","4 July 2005","3 July 2005","3 July 2005","10","10","9","10","10","10","7","8","7","8","7","7","6","4","2","7","6","10","7","5","8","9","6"," RAM GOPAL VARMA - A mature magician\n"," Ramu is back with a bang!!!!\n"," As well made as any of the better Ram Gopal Verma movies\n"," The Indian version of The Godfather.\n"," Amitabh the 'Sarkar' of Bollywood\n"," Absolutely Stunning\n"," Powerful\n"," Francis Ford Coppola will be proud!\n"," The Desi Godfather\n"," Sarkar is not even remotely close to Godfather\n"," RGV's ode to \"The Godfather\"\n"," brilliantly paced with good screen play..8 stars\n"," A good Movie but pales in front of original\n"," one of the few Hindi movies worth your time\n"," Good but disappointing.....\n"," sarkar-average ruling\n"," Sarkar, I am afraid, was a very poor movie.\n"," Mr. Abhishek Bachchan comes of age. Stands up in front of his father and gives a stellar performance.\n"," Sarkar disappoints & its NOT a Godfather - NO way !\n"," sarkaar is a godfather's clone, but it is way better\n"," RGV + Big B + Abhishek = Magic!\n"," I didn't like it!\n"," Sarkar is Ram Gopal verma at his Best.\n"," SARKAR is as good as GODFATHER!!!!\n"," Bad Indian Adaptation of The Godfather\n"]}