{"review-url":["http://www.imdb.com/title/tt0406816/reviews"],"review-text":["I'm a Petty Officer 1st Class (E-6) and have been in the USCG for 6 years and feel that this movie strongly represents the Coast Guard. There were only a few scenes that were far fetched. The most far-fetched was when PO Fischer (Kutcher) went down inside of the sinking vessel to pull the vessel's captain out of the engine room... that would never happen. Swimmers are not allowed to go inside of any vessel no matter the circumstances. Second, the Command Center (supposedly in Kodiak), it looked more like a NASA command center... we don't have any gear that hi-tech. Third, the Captain of the Airstation would not be running the search & rescue cases with like 10 people on watch. In reality it would be an E-6 or E-7 as the SAR Controller and maybe 2 other support personnel like an assist SAR Controller & a Radio Watchstander. Otherwise the movie was dead on, I think they should have incorporated more of the other rates in the CG and their roles in search & rescue instead of just Aviation based rates. Some of the scenes from \"A\" school reminded me of my days their and the dumb stuff I did and got in trouble for in my younger days.","As others that have commented around the web... I'm a 130 pilot in the Coast Guard. Having said that, and being the skeptic I am, I went expecting the over-the-top cheese factors. There was some cheese, but all in all, not much.. and the film was pretty accurate.I watched the trailer again today. After seeing the film yesterday, I've realized the trailer gives the impression the movie is nothing but rescue after rescue action scenes. This isn't the case.The movie is truly more character/story driven than action. The inner struggles both Costner and Kutcher are dealing with.. Kutcher's is revealed further into than movie than Costner's is.Of course, there is a minor love story.. no surprise there. But for the most part, the movie tells the tale of two lives that come together, and after some time, help each other heal old wounds.As girlie as it sounds, Costner and, as much as I try not to like him, Kutcher do actually work quite well together and compliment each other very well in the movie.As critics have stated, you've seen it all before.. Top Gun, Officer and a Gentlemen, etc. But what movie hasn't been remade a million times.I can recall only one F word being spoken.. and can't really recall any other language.The movie is 2+ hours, and for some, may tend to get a little long towards the end.You'll laugh, you may cry, but I can honestly say, it was worth the $4 I paid.I hope you enjoy the movie.","I work at a movie theater and every Thursday night we have an employee screening of one movie that comes out the next day...Today it was The Guardian. I saw the trailers and the ads and never expected much from it, and in no way really did i anticipate seeing this movie. Well turns out this movie was a lot more than I would have thought. It was a great story first of all. Ashton Kutcher and Kevin Costner did amazing acting work in this film. Being a big fan of That 70's Show I always found it hard thinking of Kutcher as anyone but Kelso despite the great acting he did in The Butterfly Effect, but after seeing this movie I think I might be able to finally look at him as a serious actor.It was also a great tribute to the unsung heroes of the U.S. Coast Guard.","I went to an advance screening of this movie thinking I was about to embark on 120 minutes of cheezy lines, mindless plot, and the kind of nauseous acting that made \"The Postman\" one of the most malignant displays of cinematic blundering of our time. But I was shocked. Shocked to find a film starring Costner that appealed to the soul of the audience. Shocked that Ashton Kutcher could act in such a serious role. Shocked that a film starring both actually engaged and captured my own emotions. Not since 'Robin Hood' have I seen this Costner: full of depth and complex emotion. Kutcher seems to have tweaked the serious acting he played with in \"Butterfly Effect\". These two actors came into this film with a serious, focused attitude that shone through in what I thought was one of the best films I've seen this year. No, its not an Oscar worthy movie. It's not an epic, or a profound social commentary film. Rather, its a story about a simple topic, illuminated in a way that brings that audience to a higher level of empathy than thought possible. That's what I think good film-making is and I for one am throughly impressed by this work. Bravo!","I was looking forward to The Guardian, but when I walked into the theater I wasn't really in the mood for it at that particular time. It's kind of like the Olive Garden - I like it, but I have to be in the right mindset to thoroughly enjoy it.I'm not exactly sure what was dampening my spirit. The trailers looked good, but the water theme was giving me bad flashbacks to the last Kevin Costner movie that dealt with the subject - Waterworld. Plus, despite the promise Ashton Kutcher showed in The Butterfly Effect, I'm still not completely sold on him. Something about the guy just annoys me. Probably has to do with his simian features.It took approximately two minutes for my fears to subside and for my hesitancies to slip away. The movie immediately throws us into the midst of a tense rescue mission, and I was gripped tighter than Kenny Rogers' orange face lift. My concerns briefly bristled at Kutcher's initial appearance due to the fact that too much effort was made to paint him as ridiculously cool and rebellious. Sunglasses, a tough guy toothpick in his mouth, and sportin' a smirk that'd make George Clooney proud? Yeah, we get it. I was totally ready to hate him.But then he had to go and deliver a fairly strong performance and force me to soften my jabs. Darn you, ape man! Efficiently mixing tense, exciting rescue scenes, drama, humor, and solid acting, The Guardian is easily a film that I dare say the majority of audiences will enjoy. You can quibble about its clichés, predictability, and rare moments of overcooked sappiness, but none of that takes away from the entertainment value.I had a bad feeling that the pace would slow too much when Costner started training the young guys, but on the contrary, the training sessions just might be the most interesting aspect of the film. Coast Guard Rescue Swimmers are heroes whose stories have never really been portrayed on the big screen, so I feel the inside look at what they go through and how tough it is to make it is very informative and a great way to introduce audiences to this under-appreciated group.Do you have what it takes to be a rescue swimmer? Just think about it -you get to go on dangerous missions in cold, dark, rough water, and then you must fight disorientation, exhaustion, hypothermia, and a lack of oxygen all while trying to help stranded, panicked people who are depending on you for their survival. And if all that isn't bad enough, sometimes you can't save everybody so you have to make the tough decision of who lives and who dies.Man, who wants all that responsibility? Not me! I had no idea what it was really like for these guys, and who would have thought I'd have an Ashton Kutcher/Kevin Costner movie to thank for the education? Not only does The Guardian do a great job of paying tribute to this rare breed of hero, but lucky for us it also does a good job of entertaining its paying customers.THE GIST Moviegoers wanting an inside look at what it's like to embark on a daring rescue mission in the middle of the ocean might want to give The Guardian a chance. I saw it for free, but had I paid I would've felt I had gotten my money's worth.","I attended an advance screening of this film not sure of what to expect from Kevin Costner and Ashton Kutcher; both have delivered less than memorable performances & films. While the underlying \"general\" storyline is somewhat familiar, this film was excellent. Both Costner and Kutcher delivered powerful performances playing extremely well off each other. The human frailties and strengths of their respective characters were incredibly played by both; the scene when Costner confronts Kutcher with the personal reasons why Kutcher joined the Coast Guard rescue elite was the film's most unforgettable emotional moment. The \"specific\" storyline was an education in itself depicting the personal sacrifice and demanding physical training the elite Coast Guard rescuers must go through in preparation of their only job & responsibility...to save lives at sea. The special effects of the rescue scenes were extremely realistic and \"wowing\"...I haven't seen such angry seas since \"The Perfect Storm\". Co-star Clancy Brown (HBO's \"Carnivale\" - great to see him again) played the captain of the Coast Guard's Kodiak, Alaska base in a strong, convincing role as a leader with the prerequisite and necessary ice water in his veins. The film wonderfully, and finally, gives long overdue exposure and respect to the Coast Guard; it had the audience applauding at the end.","I was pleasantly surprised to find this movie showing as a sneak preview in my local theater.We have all seen this plot line before (Top Gun, GI Jane, An Officer and a Gentleman) but a good script still works. This story is basically about the training of a Coast Guard rescue team with a couple of side story lines. Kevin Costner plays a highly successful rescue team leader, Ben Randall, who is forced into heading the training team after a tough mission. The movie takes us through the rigors of the training process and the personal stories of both the Costner character and that of Jake Fischer, played by Ashton Kutcher. I am happy to say that Ashton is great in this part.There are no great surprises in this movie and you will probably realize what is coming long before it arrives. However, the use of humor, the exploration of the toughness of the training and the fun of watching Ben Randall \"do his own thing as a trainer\", kept me riveted and thoroughly entertained. I really enjoy watching a movie that makes the entire audience laugh out loud, gasp here and there, and clap at the end as a tribute to the movie.We all had a good time (despite a couple of tough moments in the movie)and, I think, you will too.","I've seen this story before but my kids haven't. Boy with troubled past joins military, faces his past, falls in love and becomes a man. The mentor this time is played perfectly by Kevin Costner; An ordinary man with common everyday problems who lives an extraordinary conviction, to save lives. After losing his team he takes a teaching position training the next generation of heroes. The young troubled recruit is played by Kutcher. While his scenes with the local love interest are a tad stiff and don't generate enough heat to melt butter, he compliments Costner well. I never really understood Sela Ward as the neglected wife and felt she should of wanted Costner to quit out of concern for his safety as opposed to her selfish needs. But her presence on screen is a pleasure. The two unaccredited stars of this movie are the Coast Guard and the Sea. Both powerful forces which should not be taken for granted in real life or this movie. The movie has some slow spots and could have used the wasted 15 minutes to strengthen the character relationships. But it still works. The rescue scenes are intense and well filmed and edited to provide maximum impact. This movie earns the audience applause. And the applause of my two sons.","If you had asked me how the movie was throughout the film, I would have told you it was great! However, I left the theatre feeling unsatisfied. After thinking a little about it, I believe the problem was the pace of the ending. I feel that the majority of the movie moved kind of slow, and then the ending developed very fast. So, I would say the ending left me disappointed.I thought that the characters were well developed. Costner and Kutcher both portrayed their roles very well. Yes! Ashton Kutcher can act! Also, the different relationships between the characters seemed very real. Furthermore,I thought that the different plot lines were well developed. Overall, it was a good movie and I would recommend seeing it.In conclusion: Good Characters, Great Plot, Poorly Written/Edited Ending. Still, Go See It!!!","I wish I knew what to make of a movie like this. It seems to be divided into two parts -- action sequences and personal dramas ashore. It follows Ashton Kutsher through survival swimmer school, guided by Master Chief Kevin Costner, then to Alaska where a couple of spectacular rescues take place, the last resulting in death.I must say that the scenes on the beach struck me as so stereotypical in so many ways that they should be barnacle encrusted. A typical bar room fight between Navy guys and Coast Guardsmen (\"puddle pirates\"). The experienced old timer Costner who is, as an elderly bar tender tells him, \"married to the Coast Guard.\" The older chief who \"keeps trying to prove to himself that he's still nineteen.\" The neglected ex wife ashore to whom Kostner pays a farewell visit. The seemingly sadistic demands placed on the swimmers by the instructors, all in pursuit of a loftier goal. The gifted young man hobbled by a troubled past.The problem is that we've seen it all before. If it's Kevin Costner here, it's Clint Eastwood or John Wayne or Lou Gosset Jr. or Vigo Mortenson or Robert DeNiro elsewhere. And the climactic scene has elements drawn shamelessly from \"The Perfect Storm\" and \"Dead Calm.\" None of it is fresh and none of the old stereotyped characters and situations are handled with any originality.It works best as a kind of documentary of what goes on in the swimmer's school and what could happen afterward and even that's a little weak because we don't get much in the way of instruction. It's mostly personal conflict, romance, and tension about washing out.It's a shame because the U. S. Coast Guard is rather a noble outfit, its official mission being \"the safety of lives and property at sea.\" In war time it is transferred to the Navy Department and serves in combat roles. In World War II, the Coast Guard even managed to have a Medal of Honor winner in its ranks.But, again, we don't learn much about that. We don't really learn much about anything. The film devolves into a succession of visual displays and not too much else. A disappointment.","Our family (and the entire sold out sneak preview audience) enjoyed \"The Guardian\". Kevin Costner and Ashton Kutcher gave convincing performances as the fictional helicopter rescue swimmer characters Ben and Jake. After seeing this movie, you can't help but imagine how difficult it must be to graduate from the USCG helicopter rescue swimmer school and one day take part in real rescues.Even though this is a fictional movie, it delivered rather convincing virtues of team spirit, dedication and bravery exhibited by all the members of the actual U. S. Coast Guard.The special effects used to create the rescue scenes were incredible. You actually felt like you were taking part in a real rescue.I feel the movie could have been made without the \"Hollywood\" bar scene (when you see the movie, you might agree) since the real Coast Guard does not condone such behavior. Very entertaining, very action packed, definitely worth seeing. Thank you, U. S. Coast Guard and the REAL helicopter rescue swimmers, \"So Others May Live\". I'd highly recommend this movie to everyone.","I was fortunate enough to see this movie on pre-release last night and, though I wasn't expecting to, actually really enjoyed the movie for the most part. The rescues and sea effects were amazing to watch and definitely provided edge of the seat tense moments, probably all the more so knowing that there are guys who do this for a living. The weaker parts of the movie revolve largely around using stereotypical set scenes. I'm not going to spoil the movie but this really follows along the lines of An Officer and a Gentleman and those moments give it a little bit of a cheesy aftertaste.Like I said over all this movie is pretty good and worth checking out as long as you can get past the clichés.","Wow, another Kevin Costner hero movie. Postman, Tin Cup, Waterworld, Bodyguard, Wyatt Earp, Robin Hood, even that baseball movie. Seems like he makes movies specifically to be the center of attention. The characters are almost always the same ... the heroics, the flaws, the greatness, the fall, the redemption. Yup, within the 1st 5 minutes of the movie, we're all supposed to be in awe of his character, and it builds up more and more from there.And this time the story ... story? ... is just a collage of different movies. You don't need a spoiler; you've seen this movie several times, though it had different titles. You'll know what will happen way before it happens. This is like mixing An Officer and a Gentleman with Backdraft, but both are easily better movies. Watch Backdraft to see how this kind of movie should be made ... and also to see how an good but slightly underrated actor, Russell, plays the hero.","There's a point in 'The Guardian' where it reaches its logical conclusion and I expected the credits to roll and was mentally ready to leave, but they didn't and another section which could have ended the film followed, with another two after that. Ostensibly a recruiting film for the US Coastguard, 'The Guardian' works best when Costner is trying to get through to Kutcher just as others had tried with Tom Cruise in previous films. The 'Top Gun' meets 'An Officer and a Gentleman' via 'Men of Honor' ninety minute training section of the film works well and is entertaining, but when this is over it really drags.","I only went to see this movie because I have always liked Kevin Costner. I felt that Ashton did a great job in the Butterfly Effect. Unfortunately, even though these two actors were/are capable of good if not great acting moments some of that was missing here. Some of the scenes were just not believable and didn't have enough story line support.Though the movie claims influence from the hurricane Katrina aftermath, there was very little (none) to that effect in the movie.Overall, I liked the fact that the movie brought forward some of what goes into saving lives from a water perspective.The special effects were pretty good and more than a little intimidating. Not sure I'll ever go deep sea fishing again...I expected a little more emotion in the film than what was presented.Definitely a movie that could've been seen on DVD.","Alas, another Costner movie that was an hour too long. Credible performances, but the script had no where to go and was in no hurry to get there. First we are offered an unrelated string of events few of which further the story. Will the script center on Randall and his wife? Randall and Fischer? How about Fischer and Thomas? In the end, no real front story ever develops and the characters themselves are artificially propped up by monologues from third parties. The singer explains Randall, Randall explains Fischer, on and on. Finally, long after you don't care anymore, you will learn something about the script meetings. Three endings were no doubt proffered and no one could make a decision. The end result? All three were used, one, after another, after another. If you can hang in past the 100th yawn, you'll be able to pick them out. Despite the transparent attempt to gain points with a dedication to the Coast Guard, this one should have washed out the very first day.","Variations of this have been done so many times in so many other movies, you will be predicting the story several scenes in advance. I could not help thinking of other movies while watching this one, and that can't be good. I mean, a movie is supposed to keep you enthralled with what is currently on the screen, right? During the film I was recalling movies like Top Gun and The Perfect Storm, just to name a couple.Also, Costner is, quite simply, a flat actor who is devoid of character. The only thing I've really liked him in was Bull Durham and he was just OK in Open Range. It's too much of a \"stretch\" for him to do anything other than a baseball player or a cowboy. The other actor who's name escapes me (you know the 25 yr-old who's married to 45 yr-old Demi Moore?), is nothing to write home about either.","While not entirely a miss, THE GUARDIAN could have been better. Hats off to the Coast Guard, but the story line could have been better. This was a paint-by-numbers screen play. Not at all original, and much too many clichés'. Acting is OK, with no great shakes. But as written, not even the best actors could do much with the material, although better actors could probably save it a bit. Too much attention to the Kutcher and Kostner characters, while the others go by the wayside. Not good writing. What happened to the cute gal in the gang? You'll have to watch the deleted scenes on the DVD. The movie would have been much better if it had ended without the predictable resolution. Again, see the DVD for the more \"happier\" ending. However, both endings were terrible. And the final scene with Kutcher going to the classroom of his girlfriend was just too corny for words. The best things about the movie were the training scenes and the rescue sequences. Forget the rest. Boy oh boy, am I tired of the Special EFFECTS. They look just like that...EFFECTS, not real.","This is a pale imitation of 'Officer and a Gentleman.' There is NO chemistry between Kutcher and the unknown woman who plays his love interest. The dialog is wooden, the situations hackneyed. It's too long and the climax is anti-climactic(!). I love the USCG, its men and women are fearless and tough. The action scenes are awesome, but this movie doesn't do much for recruiting, I fear. The script is formulaic, but confusing. Kutcher's character is trying to redeem himself for an accident that wasn't his fault? Costner's is raging against the dying of the light, but why? His 'conflict' with his wife is about as deep as a mud puddle. I saw this sneak preview for free and certainly felt I got my money's worth.","I'm sick and tired of no talent and over-rated actors that receive quality roles and continue to believe their own hype. Ashton Kutcher is a horrible actor; granted, he had some pretty funny moments on That 70's Show, but in all actuality anybody can play an idiot. I know he is very attractive and that draws a huge female crowd, but he can't act to save his life. He is the poster-boy for exceptionally good-looking actors with no skill what-so-ever receiving exceptionally good roles. Any movie that he is in is going to be all about a studio receiving large sums of money; it is not going to be about great acting and making the film in question the best picture live up to it's full potential. This problem is plague to the movie industry and hopefully people will eventually start to look beyond pure good looks and begin to observe talent and skill. Another problem with this movie is that is full of military movie clichés; I liked it better when it was called An Officer and a Gentleman. This studio should be ashamed and Ashton should quit stealing good roles from quality actors.","With these kinda films, I'm always torn between two thoughts: I want to judge the film on it's own merits. But I also want to respect the men and woman (in uniform) the film portrays. It's like George W. Bush telling me to respect the men and women fighting terror: I don't agree with his policy, but the men and woman he sends abroad fighting terror deserve and do earn my respect. So my conclusion: the men and women of the Coast Guard deserve a film like this, but the movie-going public deserved a better film.The Guardian doesn't separate itself by anything other than a cool movie poster. The script is corny (and borrows heavily from films like An Officer and a Gentleman), the production is pretty bland and the special effect are not that good. And then there is the acting: Costner walks around like he hasn't been inspired by a role in years and Kutcher... he should stay doing pranks: because the kid CAN NOT ACT.Overall is this is like many other \"homage to the uniform\" films (like We Were Soldiers, Ladder 49 etc.): the people portrayed deserve our respect, but we deserve, as paying film fans, a better film.","This movie ORIGINALLY HAD one of the most perfect endings I've seen come out of Hollywood in a LONG, LONG time... I mean it. It was perfect! The movie built and built to a tremendously satisfactory finish. The kind of finish that leaves you walking out of the theater with tears rolling down your cheeks yet with a big smile on your face and enlightenment in your soul.Then someone sold out their principles because that perfect ending \"didn't test well in the demographic we're seeking.\" So an additional voice-over was quickly recorded and a new scene was hurriedly shot and spliced into the final releases before they were sent to the theaters.I know this in my heart. The ending you will see in the theater is NOT the director or writer's true vision.I feel sorry for you guys. I can only rationalize that you just didn't have enough \"creative control\" (because I can't say balls), to keep your original vision as you meant it to be.Please, when the DVD comes out. FIGHT for your vision to be returned to this fine movie.Okay, for the audience yet to be and I of course mean those of you outside the demographic that those soulless, visionless hacks that handle the money-side of film-making are seeking You, gentle, mature, moviegoer, let me share with you a few words of wisdom: When the late voice-over by Kutcher finishes as it was originally meant to be finished, SPRINT for the exit. Trust me, unless you are a soulless, visionless hack yourself, you'll know the exact moment I'm talking about. But it passes so quickly that you will have little time before the SELLOUT begins.If you happen to miss that opening and fail to get out before a wonderful movie becomes just okay. Well, like me, you'll find yourself laughing and shaking your head as you walk to your car. Like me, you will wonder at the opportunity lost when a truly great movie is sacrificed on the altar of having to \"test well\" with an audience that thinks Ren and Stimpy are great actors.Like me, you'll find that the tears that a perfect ending drew from you, that you willingly gave in public, in front of total strangers and were unashamed of, are now quickly drying on your face after you tried to wipe them away in embarrassment for shedding them for THAT ending.And that sense of spirit and wonder that a great movie leaves you with long after the lights come up. Well, it ended up on the altar as well.","My friend and I really did want to see The Guardian when it was released in the theater, but we never got the chance or had the money when we had the opportunity. I just rented it and we watched it together last night and I fell asleep 3 times! I thought maybe it was just me, but even my friend said that she thought it was a little dull. Then we asked our other friend what he thought and he just sighed and said that he was with me on the sleeping. The story was just so dull and predictable, Ashton and Kevin, I'm so sorry to say this, but they're not strong enough leading men to keep a story moving.So as you can figure pretty much from the trailer, Kevin is traumatized from a rescue mission that was fatal to his team and victims, Ashton comes into the camp to train to be a rescuer, but he's a punk without a cause, until he and Kevin discover how much they have in common. But Kevin sticks with Ashton and pulls him through the camp, watch An Officer and a Gentlemen for the sub plot, and of course Ashton makes it through camp and becomes a rescuer, but the task becomes more difficult when Kevin can't face his inner demons.The story is so incredibly predictable, like I said just watch An Officer and a Gentleman, that's the plot over all. Kevin's character I just felt wasn't that sympathetic, I don't know if it was just the writing or the way it was presented, but I just wouldn't recommend this movie, it was too long and too predictable. Why this movie has a decent rating? I'm still not sure, but believe me, you'll fall asleep a few times trying to get through this movie.3/10","I was, in the beginning, very hesitant to go see this movie. Both of my parents had been in the coast guard. My father died and my mother is still alive. I didn't want it to bring back the memories of losing my father, but I went anyways.The movie started out a little slow, but as it got going, I was impressed. Costner did a wonderful job in his role and I was surprised I could take Kutcher seriously. He did his role alright as well.In the end, I walked out of the theater with soaked eyes. No, I will not tell you how the story ended. I would recommend this movie to anyone who has a heart. That's how much I enjoyed it.Go U.S. Coast Guard!"],"review-user":["zzsilentbobzz","easyeee","goodapollo2","patrick-682","TheMovieMark","burt12","geebeegb1","bart-233","bpdmailbox-collegebound","rmax304823","japoti1","barryk_76","kazaadude2000","enoonmai","JMLovely","MDavenp900","slatoid","ryancm","joebdox","elliott_dyer","supah79","mack_i_avelli","Smells_Like_Cheese","princess_katelan"],"review-date":["17 September 2006","30 September 2006","28 September 2006","16 September 2006","29 September 2006","8 September 2006","17 September 2006","18 September 2006","25 September 2006","30 June 2007","19 September 2006","20 September 2006","12 March 2007","3 November 2006","1 October 2006","28 January 2007","5 October 2006","6 June 2007","17 September 2006","19 December 2006","6 March 2007","28 October 2006","8 February 2007","2 October 2006"],"review-rating":["9","10","9","8","8","8","9","7","7","5","9","7","4","6","7","4","5","5","3","3","5","6","3","10"],"review-title":[" Accurate portrayal of the USCG...\n"," Decent flick\n"," Much More Than I Expected\n"," Costner's Comeback\n"," Interesting look at an under-appreciated group of heroes\n"," Worthy of audience applause\n"," Familiar story but still great.\n"," Retold story holds water\n"," Left a Little Disappointed\n"," The perfect stereotype?\n"," An excellent fictional portrayal of the USCG, its aviation crews and their helicopter rescue swimmers!\n"," Overall good movie but has some weak points\n"," Cut-and-Paste\n"," The film that didn't know when to stop\n"," Drama misstep\n"," Don't expect too much...\n"," A Very Formulaic Plot\n"," So so\n"," all the electricity of a one-watt bulb\n"," When is it going to stop?\n"," Respect for the sacrifice vs. respect for the movie-going public\n"," Someone sacrificed their principles on this one...\n"," No, thank you\n"," I loved this movie.\n"]}