{"review-url":["http://www.imdb.com/title/tt0902952/reviews"],"review-text":["This was a decent movie for the first half. Too many cheap BOO! moments but the tension builds, the bad guys are creepy and everything seems to be setting itself up nicely. The kids are not particularly deep but hey, that works for teens. Then it just gets ridiculous and tries way too hard- the \"why in the world would he/they do that?\" moments overwhelm anyone's capacity for suspension of disbelief, the twist involves too many ridiculous coincidences, and the title comes from a late attempt to philosophize some meaning into the film that goes nowhere and is quickly dropped. There was laughter in the theater at moments that were in no way supposed to be funny. Great premise but just badly written and doesn't hold together. Some very nice shots but they're hard to enjoy while you're rolling your eyes.","I saw what I believe to be the best Australian film of the year so far, Jon Hewitt's Acolytes.Acolytes is a stylish thriller with a killer premise. Get thistwo bullied and molested teens discover a local serial killer in their suburb AND then set about blackmailing him to kill the bully who molested them. Hewitt has picked a top notch cast including excellent new comers Sebastian Gregory, Josua Payne and Hanna Mangan Lawrence to play the teens. Add to that three, yes, thats right three great psycho's! Lead by Joel Edgerton in an outstanding performance of serial killer du jour, Belinda McClory his deranged spouse and Michael Dorman as the teen raping bully, with swastika tattoos. Once you add these teens and these menacing adults, all hell breaks loose Hewitt has crafted a balls to the wall serial thriller thats damn original and accomplished. You can see the influence of Larry Clark and David Lynch's Twin Peaks but Hewitt makes it all his own, in a Qld suburban back water, always ringing with the drones of emptiness. The script by Shayne Armstong, Shane Krouse and Hewitt is tight.If marketed correctly this film could be a break out hit with teens. The next Wolf Creek? It could well be. It makes all the right moves. The teens are real ala Larry Clark. They don't suck and have an attached PC agenda, they are non communicative, good looking and hip. The killers are dark with real menace. Joel Edgerton steals his scenes as the mild mannered local Ted Bundy, who sports a butterfly on his 4WD spare ala John Fowles The Collector. Dorman's petrol head rapist pours on the menace that tops Suburban Mayhem and provides a creepy thug who you can't wait to see buy the farm.The film is fast paced, tough and brutal. Not only that, it displays a confidence and directorial mastery from Hewitt that is surely to win him an IF or AFI nomination, if not award! Its nuanced and poetic mise en scene, brilliant sound design, excellent cinematography and tight structure mark it as clearly one of the best directed Oz features I have seen so far this year.The film leaves you shaken, thinking and unsettled. Its a truly great edition to the return to genre going on in Australian cinema at present. It will surely garner the interest of Hollywood. Oh, and did I mention it got into Toronto? What other Oz feature films can say that much? The world should get ready for a new auteur, Jon Hewitt.","I Would have to disagree strongly with the previous lame comment. I watched this not expecting too much from it. The Fact is that the cast were superb, Especially The lead Teen Female. The dark sides of them all came through, all were messed up in an not obvious way. There was an underlying current which ran through the movie of teenage angst and sexuality. The serial killer role was played well also as you could feel he had gone through what they had as children. What this movie is, is a strong drama/thriller. Yes I would agree they don't do the obvious, but you could relate with the messed up teenage heads they did what they did and it is believable. Also a decent dark ending, instead of which could have so easily been an opt out happy one. The attention to detail in the movie was fantastic also. I very good solid 7 out of 10. A little slow at times, but lets a thinking person see where the characters are coming from.","The teenager Mark (Sebastian Gregory) has a crush on Chasely (Hanna Mangan Lawrence), who is the girlfriend of his best friend James (Joshua Payne) and is always teasing him. Mark and James share a secret: they were raped by the punk bully Gary Parker (Michael Dorman) when they were younger. While wandering in the woods, Mark witnesses a suspicious man with a shovel filling a hole and then sneaking from the place in a 4x4 Discovery with a butterfly cover on the spare tire. Mark tells James and Chasely and they return with shovels to dig the location, where they find the corpse of a woman. Instead of calling the police, they decide to find whether the killer lives. They discover that his name is Ian Wright (Joel Edgerton) and lives in the suburb with his wife and their baby. Mark and James blackmail Ian, ordering him to kill Gary Parker. However, the killer presses Gary and discovers the identities of the teenagers, reverting the situation and disclosing a dark secret about Mark.\"Acolytes\" has a promising beginning with the weird relationship among Mark, James and Chasey and their discovery of the grave of a Caucasian woman. The first unreasonable and absurd situation is when the trio does not call the police and decides to investigate the possible killer. However, the conclusion when Ian teams up with his acolyte is so stupid and unthinkable that irritates. My vote is five.Title (Brazil): \"Caçada Sinistra\" (\"Sinister Hunting\")","Jon Hewitt's little Aussie horror / thriller 'Acolytes' had a strong base to work with as it focused on two teenage boys Mark and James who were physically abused when youngsters by a psychotic bully, Gary and he still happens to be on the scene. By chance Mark discovers a fresh grave in the woods and witnesses the culprit leaving in their 4WD. Thinking maybe its drugs or cash. Himself, James and his girlfriend Chasely head back the next day to unearth it, but discover a body. Still wanting revenge on Gary, they decide to find the whereabouts of the serial killer and secretly blackmail them into killing Gary, or they'll go to the cops. The opportunity might be worth the risk, but they soon find out it won't be all that easy.Director Hewitt sets up a deceitfully macabre and hauntingly slick serial killer film well the serial killer element can almost be seen as the tool for the story's progression because the central piece could be labelled more so the relationship between the three broodingly angst, but damaged teenagers who really succumb to a lack judgement. The sound idea is made up of many possibilities, but the ambitious narrative does become a bit of jumble losing shape with its jaded editing techniques and jerky flashback sequences. I was getting a little confused with the incoherent shifts in the story's developments, but soon after the film had finished the pieces did eventually come together, despite the contrived occurrences for these things to actually work. It's visually atmospheric style was very similar of the enigmatically uncanny 2003 Australian horror 'Lost Things'. Just like that film, the pacing is purposely slow-going (too casual or artsy for some) and keeping a downbeat frown throughout, but remains psychologically gripping with its metaphorical undercurrents and pessimistic tone. After the ponderous set-up, it storms up moments of suspense and explicit brutality, by transcending in to a game of survival when those who thought they were in control find out they bit off more than what they could chew or did they? When it erupts there's a real dark edge leading to a dangerously murderous impulse revealing a little more than we first thought. While it's not a perfect balance and feels rushed, it's intriguing to how it eventually goes on to play out. Nonetheless watching the two alternative endings on the DVD, I actually preferred those two takes over the original theatrical choice.The dialogues are fairly sparse and if so quite straight forward, with it concentrating on its moody styling to invoke the emotional pull. Truthfully most of the characters that enter the frame (the main players) isn't particularly likable and can be said to be unpleasant or obnoxious. This however doesn't hamper any of the performances. Sebastian Gregory, Joshua Payne and Hanna Mangan-Lawrence provide good, honest portrayals of the teenagers who find they are in over their heads. Joel Edgerton emits a plausible intensity and uneasiness from his casually creepy facade as the suburban serial killer. Michael Dorman gives a capable turn as the crazily violent bully.Rich locations (filmed in Queensland) are made to great use, where the authentically stunning backdrops have the outskirts of suburbia intrusively entering the forlorn wilderness. Hewitt really does cement a constant eeriness to when the scenes hit the chilling woodlands because of the clinically sharp photography (as there's plenty of excellent imagery captured) and distinctively howling score. However there are some generic inclusions involving unnerving sound effects and clichéd jump scares.","Acolytes presents an interesting mix of original concepts in \"screaming teen\" cliché horror with a more thriller-like pacing. In some ways Acolytes is very successful, but in many other ways the film fails miserably.Overall Acolytes avoided the typical archetypes of the naivety and innocence of youth of endless horror films in the like of Cabin Fever, Texas Chainsaw Massacre, and countless other films where unsuspecting and relatively naive and innocent teenagers, have sex, run around screaming and one-by-one are plucked off by some sort of monster. Instead this innocence is replaced with pride, retaliation, and arrogance. The characters had several opportunities to save themselves from immanent death and despair, but failed to do so due to their own personal demons. In the end you were left with the feeling that there were no (and perhaps are no) innocent victims.As the name implies, the film also touches greatly on following a leader or authority. This was used in a direct sense of if the main character would become like the serial killer and was also used less directly throughout the film. Following a central figure is a reoccurring theme throughout the film.Through all this, the film makers also incorporated a lot of cliché, which I suspect was intentional and gave the film a unique mixture of depth as well as shallowness which I found intriguing. This, perhaps inadvertently, plays well with the characters who are, at first appearance very shallow but as the story unfolds it becomes obvious that they are, at least the two main male characters, quite complex.Technically the film has a lot of problems however. The cinematography, which is typically regarded highly, I find rather sophomoric and over-stylized, utilizing formulaic 2/3 approaches far too rigidly. Many transitions I felt were also over-stylized. The use of symbolism was not only vague, but also greatly over used.The plot was poorly planned and relied exclusively on misinformation in order to achieve a rather hokey twist ending, which was poorly resolved and leaves viewers confused. Methods used to resolve the climax are cheap and ill-prepared, motivations are routinely unclear, and major plot points remain untied in the end.Overall, the film's relative originality, themes and thesis are lost in a maze of poor technical execution, over-stylized imagery, unclear motives, obtuse and unnecessary symbolism and cheap twists maintained only by a lack of or entirely incorrect information.If the film were better executed, it would have been excellent. However, Acolytes receives only two stars in my opinion.","A rather lame teen slasher from Brisbane. While the plot hinges on a fairly decent idea, the writing is profoundly lame and two of the three main teens are absurdly wooden. The problem is that for the kids to go through with their plan they have to be far more reckless than shown, but if they were that devil-may-care, it would perhaps be hard for them to be likable, so they end up being neither really. In fact, I only started enjoying the film when I started wishing for their death. One of those movies where in about a thousand places the most sensible option would be to call the police. I realise we wouldn't have a movie if they did, but it would be nice if we could believe that they actually wouldn't. Avoid.","Whilst the film is beautifully shot and the two adult leads are very good, there was a lot I struggled with. To start, the 3 young teenage actors seemed like they were straight from drama school, but not a good one. The young girl was okay, but the guys were dreadful. Then there was the fact that they as characters were just not right in this film, they seemed out of place and doing things that young middle class school kids just wouldn't do. Would you imagine 3 young well educated kids digging up a body and then rebury it and all done with the same ease as making a cup of tea......Read more at my website: http://iheartfilms.weebly.com/acolytes.html","ACOLYTES – CATCH IT ( B ) Acolytes is about two teenage Boys and a Girl who find a dead body in the forest and rather then telling the police, the boys plan to use the serial Killer to take their revenge from the Guy, who molested them when they were kids. The concept of the movie is really interesting and the execution is also very enthralling. Although, in the end it became lot more Twisted than expected. Sebastian Gregory, Joshua Payne and Helena M.Lawrence make a dynamic trio. Watching them juggling through all was quite enjoyable. Joel Egerton is becoming my favorite Aussie Man, I loved him in Animal Kingdom and here he didn't have much scoop but he did creep me out through his mustache. Michael Dorman as Child Molester was pretty darn good. Overall, really good Aussie Thriller, I enjoyed it because of its story and performances by ensemble Aussie actors.","This is not truly a horror, more of a slasher variation. Three teens stumble upon a serial killer. They decide to not call the police. That about settles it right there and then. About one hour more of absurd behaviour and thinking and the movie ends.The film had its good parts, mainly the relationship between the three teens and the psychological tension at the end. The middle, however, was pretty damn annoying, especially the flashbacks at twice the sound volume that instead of frightening me were making me fast forward.Bottom line: some Australian movies are very good. This is not one of them. I rate it slightly below average because of the premise. Could have been a lot better with a minimum of effort.","This is a small but nicely filmed dark Australian thriller. As is the case with many Australasian films it never worries about veering away from the predictable and this makes for an absorbing film. It follows 3 teenagers who happen to find a dead body and knowing who the killer is attempt to bribe him to help them with a local thug. I found this film grabbed my attention from the start helped by good believable performances from the 3 young leads. They are backed up well by Joel Edgerton, who has recently made it big thanks to his role in the excellent 'Warrior', and who really shines in this as the creepy local psychopath.It's a pretty grim story but never less than compelling and builds an impressive amount of tension as the film nears it's climax. This is a chilling and bleak film and whilst it's no classic I was surprised at just how good it was. A very impressive effort which is well worth more than one viewing.","I was completely bored with this film, melodramatic for no apparent reason. Every thing just becomes so serious and people are swearing with really dumb expressions. Then there is a serial Killer who apparently can Kill one person to get the title of serial Killer. Well the serial Killer likes butterflies and is illustrated by sound effects you might hear in the dream sequence of most modern films;why oh why? I nave no idea. It really really wants to be scary, but I think in this universe scary equals talk a whole bunch and add dark ambient noises.Just for the record, this is in no way is a horror film, its most definitely a thriller (barely). Really movie makers nowadays need to do their homework before making \"horror\" films or at least calling a movie a \"horror\" film. it makes me say (in too may words ironically) \"acolytes, you take forever to say nothing.\"","Although one might charitably call the plot believable from the revenge point of view, that logic does not hold water as the trio had no original initial plan when they decided not to tell police. You find a dead body in the forest, you know details about the murderer, why not tell police? Why not tell parents? The one girl supposedly has a close connection to a previous girl who went missing, yet she is callous enough not to tell police about the body that might be her friend's. The group is able to find the man responsible, yet still do not tell police. All through this movie I was screaming at the screen, where are the parents?? One boy gets shot through the arm with an arrow, the sleeping arrangements are communal at best, and the parent of none of these kids seems to care where they are or where they sleep. It's just too unbelievable to be a thriller, too annoying to be enjoyable. A shame...","A student catches a man burying something in the woods and he seeks two of his friends who also make a couple to go there and dig out. In town a young girl has been missing and the kids believe that it's a possibility that indeed Tanya is buried over there and the cruel truth make their assumptions to be real. Fortunately, one of the boys manage to take a closer look at the killer's car so he decide to go after him and deliver to the police. Of course this will not be easy because in their way stand a man that wants to take revenge on the kids and they make the ultimate choice in order to get rid of the obstacle that stands between them. Will they succeed? The first 20 minutes are good, the action and the story keep the audience focused even through the middle of the movie but the last 30 minutes becomes dull and the story begins to get complicated towards the simple plot that has been at the start.An OK movie not a masterpiece but not the kind that you should neglect.","As always, a review by a horror films freak, not a professional critic nor even a cinema student.For starters - allow me to admit that, having watched the film from beginning to end with no pauses, as the credits rolled I was left completely bewildered. As the twists occurred, I was able to realize I was in fact witnessing a twist, but not thoroughly comprehend what the twist was or what made it a twist.As always, I came here to IMDb as soon the film had ended, and was much relieved to find out I wasn't the only one with more questions than answers... It was as if James's shirt slogan (\"question everything answer nothing\") was meant for this film. So after doing a little reading I was able to fully understand the plot, the twists and how they came together. All in all I'd have to say that the story was quite good and that the \"bully\" and \"serial killer\" genre clichés were collaborated in quite an original and artistic way (if somewhat unnecessary). However, the fact that I and many others found it so hard to follow and understand (whether due to poor storytelling or the extremely confusing shooting and cinematography) is a shortcoming in my book. Although I did find the cinematography, as well as the use of sound during the flashbacks, to be innovating and impressive. Some of you might find it tacky though.Finally, I really loved the soundtrack, definitely going to look it up! So in conclusion - while this film could have been better, if you manage to look closely and carefully follow every scene you'll probably enjoy it. Won't be easy though!","Just read some of the other reviews on here and I have to disagree.First - good cinematography with some really great shots. End of story. The tripe fest that is The Descendants that was filmed in beautiful Hawaii with a much larger budget looked like a brochure. Ugh.Second - cries of clichés, ridiculous plot twists and poor acting per reviewers. Can anyone really name a film that does not have some clichés (excludes any movie that did it first and more than 20 yrs ago). I've never seen 3 human beings sewn ass to face before, but then everyone cries how it's just for the shock value, too disgusting. Can't win either way. Poor acting from teen actors - was there room for improvement? Yes. Has anyone spent actual time around a couple of teen boys who were same sexed raped??? I'm thinking these kids are not too emotive, erratic, angry and confused with a dash of self-destruction and death obsession. I'm fine with the plot twists; kept it moving. As long as there was no cop-out dream sequence, then I'm willing to give some leeway.","What starts off as a sleepy drama about a damaged psyche turns into a fast-paced, terrifying, and entirely believable horror film. The filmmakers don't coddle the audience and don't dwell on the plot twists; that is to say, if you're not paying attention, you'll miss some key points. There were a couple scenes where I had to rewind and explain parts to my friends. This movie was visually compelling, and the young actors and actress did great jobs conveying their anger, fear, depression, and angst. So I was never able to pinpoint what my problem with this movie was. I'm not sure if it's the slow pace or the resolution at the end, but I ended up feeling disappointed with the directors. This movie could (and should) have been much more.","Wow I am just loving films from this country over the last decade that started with Wolf Creek. So buckle yourself up and get ready for a twisty, gutsy, gory and entralling thriller from down under that will have you head spinning to New Zealand. This was a film that could've been 3 hours long and I would've still wanted more. This film will never hit the house waves considering it has visited the filmfest circuit for years and just now has displayed its insidious roots to DVD. I believe the film was made in 2008 and just saw the light of day of DVD in 2011. What a shame!!!!!!!!!!!!!!!!!!!!!!!! because there are a plethora of great directors and films waiting but its too bad that they will lurk in the Panumbra and never see the eclipse...","This Australian movie presents a watchable take on the well worn serial killer thriller path. When one of three teenage school children stumbles upon the body of one of the killers victims he along with his two friends make a reckless and ill conceived attempt to blackmail the killer into murdering their own childhood nemesis. (That being the thug who abused them as young children and who has been released from prison). This plot reveal regarding the abuse the boys suffered is not immediately introduced and may help explain the somewhat disenfranchised attitude of the two teenage boys who come across as dreary anti social misfits. Their personalities in fact are really unlikeable and along with the thug and the killer this leaves room only for the third teenage character of Chasely (played nicely by young actress Hanna Lawrence) to empathise with.The killer as usual appears as a normal family man but beneath the facade lies the heart of darkness. Those critical of the movie have derided the teenage characters actions. Why not tell the authorities about the body for example- but then of course there would be no story to tell.The plot though is entirely predictable and when the wheels easily come off the children's plan the movie climaxes with the all too common bloodbath. I have seen the DVD release of the movie marketed as a horror movie which it certainly is not but if you are a fan of the serial killer genre its worth at least a rent.","This movie has a fantastic set up, and although the plot is a little ridiculous (two teenage best friends blackmailing the local serial killer into murdering the man who raped them as children), as a viewer I became so involved with the character dynamic that I really didn't question it much.The two teenage protagonists are very sympathetic. I think the acting on their part was what ultimately made the movie. What was weird was that the kids look exactly like these two guys that I knew out in California who were about the same age and actually acted kind of like these guys too, save for the whole being Australian part.Anyway, to get back to the point-I think that anyone who's a fan of the thriller and horror genre would like this movie. I imagine a lot of people who might be reading this, or looking into this movie have probably also seen 'The Loved Ones', which a decent movie in its own right. However, Acolytes is light-years better in terms of acting and plot, and as I get older I am starting to get tired of all this torture porn going around. Acolytes is 'tasteful' in that regard.The ending is a little weird, and probably could have been thought out better, but overall a good ride."],"review-user":["halejon","Richardm777","brian-2196","claudio_carvalho","lost-in-limbo","sk_arts","Tomrad","ihrtfilms","saadgkhan","siderite","MattyGibbs","carbonfiller","paq5528","adi_2002","nitzanhavoc","scoup","morrison71-547-384218","nightwatch4773","cmoyton","znegative"],"review-date":["9 September 2008","19 August 2008","17 May 2009","22 July 2009","5 October 2009","14 September 2009","10 August 2008","27 May 2010","2 January 2011","26 July 2009","8 June 2013","27 May 2009","18 January 2011","17 March 2014","12 November 2012","6 June 2012","5 December 2012","5 January 2013","26 June 2010","1 July 2016"],"review-rating":["2","9","7","5","7","2","4","2","6","6","7","1","2","4","6","7","8","9","6","8"],"review-title":[" Painfully Contrived\n"," Top Notch dark Aussie Thriller\n"," Excellent Movie\n"," Unreasonable and Absurd Plot\n"," Seemed like a good idea at the time.\n"," Interesting ideas in an exceptionally poorly executed film\n"," Flawed\n"," Oh dear\n"," Interesting CreepyMovie, though in the end it became lot more Twisted,Sebastian Gregory, Joshua Payne and Helene M.Lawrence kept me on Edge.\n"," Apparently, Aussie teenagers are just as dumb\n"," Unnerving and excellent Aussie thriller\n"," just boring,.. and not at all a horror film\n"," Interesting Start, Poor Follow-through, Useless Finish\n"," You pick the wrong men to satisfy your wish\n"," Innovative and artistic, yet too cluttered and hard to follow.\n"," Good Horror Thriller.\n"," A brilliant idea, poorly executed.\n"," beguiling Jem from down under.......\n"," Never try to blackmail a serial killer\n"," Great! Kind of like if The Loved Ones was a serious movie\n"]}