{"review-url":["http://www.imdb.com/title/tt3778644/reviews"],"review-text":["So I am of the generation who got to experience Star Wars feom the beginning. Standing in a crazy ling line, literally wrapped around the local theater back in 1977 as a kid. Totally unaware I was about to see a movie that would become my central interest for all my childhood, early teens and once again as an adult. And all these years later, able to share this fandom with my own son. \nI liked Solo. I wouldn't say it's my favorite but it was a fun ride and it evoked the feelings that I associate with Stat Wars. The world and characters felt right. It showed us some cool new things about life in that world, living under the Empire. The amazing cityscapes of Corellia... It felt similar to me to Rogue One. Modern filmmaking techniques yet convincingly evoking the vibes of the classic Star Wars world. \nAnyway, I just wanted to put in some positive review for this movie to contrast this strange wave of hate feom \"fans\" on here. I don't really understand it. I have liked something about every Star Wars movie there has been. Some are better than others. There are weaker moments in every one to be sure. But none are worth the irrational seeming hate some people are putting out there.\nSolo is good and worth your time if you like Star Wars. Just one fan's opinion.","For anyone who feels discouraged by the reviews, I tell you this: They're not complaining about the movie, they're complaining because they feel abused by a continous stream of movies from a beloved franchise. It seems ironic, I know, but having nothing for so long and suddenly watching different posters every six months, has to be confusing and bound to raise some eyebrows. \nHowever, we have to look at it as objectively and simple as possible: If you love movies, you want to watch as many movies as you can. And if you love Star Wars, you love to experience the Star Wars' story! So all of this backlash for having so much of the thing you love is simply a tantrum that I hate to see on so many of my fellow Star Wars' fans.This a very well made film that anyone can enjoy. Plot, acting, FX, Photography, Cast, etc. They did a great job with everything. Taking into account the enourmous pressure of making a film from such a historical franchise, I take my hat off for anyone who has the bravery to do this.So, go and watch it, not with skepticisim, but with that natural feeling of curiousity and love you have every time you sit at the movie theater. I promise, you'll be pleased.","I liked Solo.... much more than I anticipated I would. Like many people posting reviews, I am an old-school, die-hard fan of the original trilogy, and I am also a fan of the old \"extended universe\", much of which is now being overshadowed by the cash-grab that is this new Disney-driven galaxy.However, I must say that the negativity this film has received is undeserved. The story is solid, if a bit predictable at times. The dialogue and acting are FAR better than in any of the other recent Star Wars films, except perhaps Rogue One. Notably in comparison to Last Jedi, the story has a logical flow, there are no side-stories that make no sense, nor any ham-handed attempts to milk humor out of an unrealistic scene. I can't say it enough, this movie actually makes sense and has a believable story.If there is a problem, it is that Star Wars is becoming another Marvel Universe, where everything has already been done in one way or another. For non-star wars fans, this will be a perfectly serviceable action/sci-fi adventure, with characters whose struggles most people should recognize from other stories in these genres. I was pleasantly surprised at how some characters were killed- it actually made me worry that anyone could be in danger, even knowing that this was impossible. It was emotionally real.For Star Wars fans, there are heaps of references to the extended universe. These were done in a way that made sense and gave service to old Star Wars stories. Teras Kasi, Aurra Sing, Chewy being ~200 years old, among others. There are glimpses at what the every day life of an average citizen in the empire would experience (spoiler: not nice). Han as a character is played true to form: a guy who has seen some bad things, done some bad things, but still, deep down, is good.I liked it. Don't listen to the fanatical homers whose own self-absorption with Star Wars prevents them from enjoying anything that doesn't conform to their pre-determined view.","I'm a big Star Wars fan (watched Empire Strikes Back in the cinema when I was 8 years old) and I loved this movie. With Empire Strikes Back and Rogue One, my favorite in the series.As for the movie itself, my opinion is that it's a solid adventure movie, in the style of the great Indiana Jones movies, with lots of fun and intense action, witty dialogues, great humor and solid acting from all actors. Yes, Han must meet a certain Wookie, obtain a certain spaceship and meet a certain curly hair character to maintain coherence with past movies, but the \"necessary\" scenes, even if expected are still brilliantly developed. On top of these scenes, there are several surprising scenes that run the gamut of the best of what the Star Wars universe offers: chases, spacecraft battles, shootouts, aliens galore and lots lots of anti laws of physics split-second solutions.Still, my favorite take from this movie is that they finally managed to shoot an amazing movie that is far from the epic good-evil battles of previous Star Wars movies, and this is completely in tune with the Han Solo character (and, btw, I think Alden Ehrenreich is a perfect match for the role).In summary, if you think the movie is \"unnecessary\" and not needed, it will indeed disappoint you and I would advice you not to watch it, but if you go to watch it with a no-expectations open mind, I think you'll be greatly pleased and much entertained.(and my excuses for any English mistakes; my mother tongue is Spanish)","Solo: A Star Wars Story boasts one of the more inventive plots I've seen lately. They play with Han's story and aren't afraid to take it some unexpected directions (at least for those just familiar with the movies and haven't researched to extended continuity of the franchise). One of the small problems I had with Solo was while the movie does have some intriguing ideas and exciting sequences, they reside in the middle of the movie. The bookends of this movie (beginning and end) are the weakest with all the best stuff in middle hour and a half. This isn't a major flaw, but I had to be patient for it to get going and the finale felt a little rushed.After the news of Alden Ehrenreich needing some extra help to get the character of Han Solo, I wasn't sure he could capably perform in the lead. He caught me completely off guard, he was great as Han Solo. He's not Harrison Ford (and no one could have matched him as Han), but he has the charisma, the toughness and the comic timing and I think he pulled it off. He bounces off Joonas Suotamo (who plays Chewbacca) well and I thought he also had good chemistry with Emilia Clarke who played his love interest Qi'ra. Clarke did well, her performance as Daenerys is still better but this was a step in the right direction. She's had trouble getting off the ground when it comes to acting in movies and this will hopefully be that stepping stone for her. Donald Glover does a fine Lando impression, there was a lot of praise for his version of this character and I largely share those sentiments. Woody Harrelson is solid as Beckett, he's appropriately slimy but he invites you in enough that you want to believe in him. Thandie Newton is good for the limited time we get to spend with her. I also liked Paul Bettany, but he was kneecapped by his character.I would put this in the heist movie genre but there are a couple of big action set pieces. Despite the troubled production, they were actually pretty great. Between the fight on the train and the escape/heist from the spice mining planet are both excellent. I didn't have a problem with the ending fight for the action choreography and even that bit had its moments. They pack the thrills and there were some unexpected outcomes for that little extra payoff. If anything, Solo proves you don't have to have a lightsabre duel to keep audiences on the edge of their seat.My problems with Solo: A Star Wars Story boil down to 2 things. The first is that Bettany's character of Dryden Vos is a weak villain and although the ending boasts a couple of unique twists, its undercut by the lack of a real threat. Bettany's a great actor and they gave him a decent backstory, but a surprise betrayal comes in the 3rd act and instead of getting 2 sinister threats, we end up with none. The second is that Solo feels somewhat clunky or as if the movie is being too obvious when it brings in iconic items for Han or connects to the larger Star Wars universe. Solo works best when it operates as its own story, the seams only start to show when you really examine how it fits in the original timeline or when characters from other movies cameo.I expected very little from this movie. I already mentioned all the bad press the movie got and while I went into this movie open-minded, the negativity surrounding Solo did lower my expectations accordingly. While it's far from perfect, I had a lot of fun with this movie. Between the taught pace, the solid acting from the cast and the infectiously happy vibe the movie boasts, I was swept up in it. It doesn't nail every aspect, but it gets far more right than it doesn't and I'm not going to drop it down to a 4 or a 5 because of some nitpicks. My actual rating for Solo: A Star Wars Story is somewhere between an 8-9/10 but I'll go with an 8/10 to be safe.","As expected, the film has been met with huge criticism, which in my opinion is wholly unjust and just another opportunity for so called 'star wars' fans to voice their disapproval for Disney. Solo is not the biggest and boldest SW feature by any stretch, but it is true to the original trilogy material without resorting to overly complicated plots, ropey CGI effects and forced comedy. It provides action , excitement, great dialogue, romance and a vast array of alien creatures (that were lacking in Rogue 1) and genuinely feels like a SW film, albeit with an interesting western inspired spin. Its Star Wars with everything we love about the saga. If you hate it.. perhaps its time you realised you might not be a SW fan after all.","A nice adventure in the Star Wars Universe. No more, no less.. I enjoyed most of the movie. The negativity on this page is disturbing.What did you guys expect from an Anthology film? Ehrenreich does a decent job,the story is at least ok and contains a nice surprise in the end.","Gone is the time when an aloof and mysterious character like Han Solo can stand on his own. When the pure imagination of fans opened up countless debates on how the Kessel run really went down, or how Hans eventually won the Millennium Falcon and eventually became a staple of his character. The hard truth is, fans and casual viewers already knew these milestones in Han's story happened and will happen, so the only thing that mattered about this movie was, how was it going to happen? For awhile, the magic of Star Wars was that of not knowing what to expect and getting to analyze an entire lived-in universe by yourself or with your friends throughout the years. With Solo, that magic is lost. You know you will be dealing with limited stakes since Solo and Chewie are pretty much okay and surely alive after this movie. You know that it will hit the basic story beats of how he becomes an outlaw, a rebel and eventually the iconic smuggler with a secret heart of gold we all know and love. You know he'll get the Falcon, you know he'll end up with Leia anyway. There's no mystery here, everyone knows the answer and we're all left with awkward suspicions about how things will play out.  Alden Ehrenreich does a, for the most part, fantastic job as Han Solo and he makes the role his own, probably one of the better parts of this movie. Lando (Donald Glover) and Chewie both get their moments, and also stand out in their roles. Beckett (Woody Harrelson) and Qi'ra (Emilia Clarke) weirdly fall flat as the new additions for Solo, aside from an obvious wisecracking droid to entertain us and give us some emotional moments, the two side characters that are meant to be the people that influence the title character are bland and uninteresting. Beckett seems to be just a ticket for Han to go follow him wherever he goes only to just ride backseat in the mission in the end. While Qi'ra plays the love interest of Han who we never get to know much about aside from pointless and explicit exposition. She also has a vague and messy arc that makes not just Han, but the audience confused as well. At one point, you're not sure where her allegiance lies, what her motivations are and what drives her to stick or stay away from Han.  Moreover, the story really doesn't aim to tell a properly structured narrative, instead it felt like a \"Han's Biggest Hits Montage\" all through out. Now this is not to say that it's hard and impossible to tell a proper movie about iconic persons/events we probably know about and/or have learned about and theorized ourselves. Rogue One (2016) was able to do it to an admittedly better extent, and quite masterfully in the James Bond reboot with Casino Royale back in 2006. To use Casino Royale as an example, it's a perfect story that shows how James Bond became THE James Bond we know and love, the commanding, suave and rough 007 agent. When the movie starts, he's not yet quite the Bond we're used to know yet, but what happens in that film contributes to why he changes. Then in the end, that's the only time we get the iconic line of James Bond introducing himself because that character has earned it through the context of the film. \n While Solo tried to achieve this same level of success, it falls hard on its knees really hard in the process. The definition of \"context\" the filmmakers had in mind with Solo was just throwing in fan service after fan service of what made Han Solo iconic, but we never really see why THIS character in THIS film in particular earned that iconic status. Han is basically the same person from the beginning till the end, compare this to James Bond in Casino Royale wherein his relationship with Vesper and how it ended changed his character forever, inevitably giving strong emotional and narrative context as to why he became how he is. This is never explored in the film and it instead becomes a by-the-numbers, monotone, and dull looking film.Verdict: 6/10","On the new opus of the mouse house in the Star Wars universe I loved since childhood, I did not go immediately. I did not read the reviews, but I heard about the fact that the studio bosses are not very satisfied with the cashier of the film, because Salon solo expectations (sorry for the pun) were not justified.Personally, I liked it, but there are reservations.The plot is clear and digestible. There are no illogicalities and strange twists. Pianos, too, really one moment in the end (more precisely the appearance) of me (yes, I think most) surprised. Hint on the continuation of the story prequel Solo? Well I do not know. There is a problem with the arches of the heroes, especially with the line of the protagonist - he shows us from the middle point. There was no need to remove it from the young nails, but there was a lack of disclosure.It is important to note that in contrast to the serious \"Outcast\", humor appeared here. Relevant and adequate. To become a protagonist. And there are no excesses.Howard promised us fantasy with a touch of a criminal film. And this promise was kept. Even overfulfilled! In the film, there are notes of a western - robbery, chases, dashing guys. Not to mention some of the mise-en-scenes characteristic of the genre. And this greatly pleased me.In addition to westerns, there are a lot of Easter eggs for other films - I personally saw the \"Army of the Dead\" and \"The Empire Strikes Back.\" With fanservisom managed to cheer.That did not work with Khan. It is clear that the second Harison Ford can be obtained only by cloning, and then there are no guarantees. But somehow Alden does not stretch. Too so cute, and charisma is not enough. So harrowing young Solo, and not a brave captain-smuggler Solo. Eh. But Harelson and Bethany pleased so pleased. Suppose that the second does not have much screen time, but he used them in full. It's a pity that other directors, unlike Howard, do not notice him. Clarke. c. a. the Dragon Mammon? Yes, as always, no! I actually do not understand why she was loved in the Thrones? Quasi is cute, a doll with a doll and a game of eyebrows. Not ice.In the end, we got a good movie no worse, but not better than \"Outcast\". It turned out to be a kind of western in the network of Star Wars with good humor, but with a bad actor in the title role and strange story arches.It's strange and not clear - what rejected the audience? Disappointment with the 8th episode and the mouse house?I want to believe that the universe has potential! And the invitation of such craftsmen as Howard will contribute to good films in the lineup.","Let me first say that I'm a very big Star Wars fan. I saw the first one as a teenager back in 1978, had to wait a very long time for the new ones and thought that both Rogue One and The Last Jedi were brilliant. This one however isn't. I even think that Solo: A Star Wars Story is the worst entry in the series.Disney has bought the rights to Star Wars and in order to get their investment back they must earn money: I get that. So they made a sequel trilogy to Return of the Jedi and are planning a brand new one in the future too. I get that as well. At the same time they produce stand-alone movies so they can have a Star Wars movie every year. Logical. But why choose Han Solo as a subject, a project that can only fail?Making a Han Solo movie without Harrison Ford is a big risk. Who can follow in his iconic footsteps? Actor Alden Ehrenreich does a decent job, but he can't make us forget the original actor. It's not even close. Trying to see the movie as a non-Han Solo movie isn't possible either, because you're constantly reminded that Alden is supposed to be the real deal. I don't know how many times the famous dice (Solo's lucky charm) is shown to proof this or when Alden tries to smile like the famous scoundrel.Then the story... Well, somebody must have asked the question: \"Okay, we'll do Han Solo. Which elements of his past can we use? How he met Chewbacca, how he won the Falcon, the Kessel run... well, they all appear in the story. Wow, that's some lazy writing!\nAnd remember that famous scene in the Godfather part 2 when Vito arrives in America and somebody asks him his name? Well, there is a similar scene in this movie explaining Han's surname. What, has he lived his life all the time without one? No, it doesn't look like a tribute. Again, it's just some lazy writing. Visually the movie is also disappointing.\nThe first part, when we meet Han and his girlfriend Qi'ra for the first time, even looks like a middle-of-the-road Direct-to-DVD film. There is a nice scene however when Han and his crew must rob a train (as shown in the trailer). To me that was the (visual) highlight of the movie.In the end there's an effort to make this stand-alone film fit more into the Star Wars movie canon by showing a famous character that will probably play a big part in the sequel. This surprise comes out of nowhere and it just doesn't work.\nAnd yes: sequel. Depending on the success two sequels will follow. At the end of part 3 Han will probably walk into the cantina on Tattooine to meet Obi-Wan and Luke for the first time. So yes: that doesn't happen in this movie.It's incredible that the great Lawrence Kasdan (Empire Strikes Back, Raiders of the lost arc) co-wrote this story. There are absolutely no surprises in there and the character build up (of Solo and Emilia Clarke's Kira, pardon: Qi'ra) is very poor at times. The scene in which Han speaks Wookie (!) is an all time low in Star Wars history (only to be outlowed by the \"Yippie\" from Episode 1 and \"Nooooo!\" from Episode 3). And a robot with an attitude? Come on! Been there, done that.I think Disney - like so many Stormtroopers - pretty much misfired with this movie. Who the hell okayed this script? Donald Glover is charming as Lando, but could have had more screentime. Woody Harrelson and Paul Bettany always perform well and Emilia Clarke... well, the movie stops just when her character becomes interesting. Her character could be fascinating in the sequel (that hopefully will not be made).Ever since I heard of Solo: A Star Wars Story I had a bad feeling about it. I wasn't wrong. Solo is a movie made for all the wrong reasons (money) and should have never been green lit. It's just Star Wars overkill.\nLet me end with something positive: in the movie theatre there were also fans who did like the movie, so there's a slight chance that I'm too harsh for the film. So if you really want to see it: go ahead!Oh yeah: there's no aftercredits scene in this film!","Oh dear!! Never has a franchise been so abused for such a cynical cash grab. I'll give it to you straight. It wasn't teribble; but it wasn't good either. I tend to think that as the second stand alone Star Wars movie, they didn't need to deal with such an iconic character, unless the story was so compelling that it just needed to be told. And based on the evidence here, it wasn't and didn't. \nThe casting was clunky. Clearly aimed at luring a few more bums on seats by appealing to the fan bases of TV pop culture juggernauts Game Of Thrones and Westworld with their respective leads showing up here. I'd pay little attention to this gripe if the movie was fantastic, but it fell far short of that. \nThe attempts at humour are hit and miss, and whatever character development there was left me uninvested in their fates; No emotional engagement as I had in Rogue One. \nAll in all it was underwhelming and disappointing and as I'm well into my middle age years, I see this as purely an exercise at gaining box office dollars rather than delivering a worthy chapter in the epic Star Wars universe.","Solo: A Star Wars Story (2018) is a shooting game for Star Wars fans rather than cinematic storytelling. The story line is quite simple but boring. Han Solo meets Chewbacca and Lando to get smuggler business of hyper fuel done. However, they decide not turn it to evil dark side at the end. \n \nAlden Ehrenreich's acting is ordinary but it is quite acceptable. Audiences expected there would be some familiar actors in this Disney Star Wars marketing product however I unfortunately could not find Harrison Ford in this film. I remember there was his credit in online data but it had gone.\n \nRon Howard's directing had editorial support from Pietro Scalia. What factor made this product dull and boring? That must be the story, screenplay. Is there any dramatic moment in this film? \n \nI think that is when tragedy of Solo and Qi'ra happens at expositional sequence at the beginning. The worst moment is miracle of Solo easily reencountering Qi'ra. This plot defect failed the dramatic dynamics of the entire film and made it extremely boring. \n \nI'm sorry, in my mind, true Han Solo is only Harrison Ford. Only Harrison can make this film successful! \n \nMy rating is 2 out of 10. 1 for Pietro Scalia, and the other for tragedy of Solo and Oi'ra. Anyway, there is a translational gag for this film that Solo in Chinese means Soros the neoliberal demon. Thus, Chinese translation of this film is Han Solo (Han Suoluo). It is a great job to mention in this review.","It's an entertaining film with out the soul of star wars. i don't feel han solo is there, just an action movie full with clichés.","\"I have a really good feeling about this!\" That's the line that Han says in the trailer that's playing in the cinema before the movies. And I remember my friend leaning over to me and saying: \"I hate that he says that so much\". There's no denying that all of my friends felt that this movie was not needed, me included. But we got it nonetheless and I always wanna give every movie a chance. \"Star Wars\" has been a very meaningful and inspirational saga for me and my family since ever before I can even remember. When Disney took over I held out hope that the new adventures would give me some joy of revisiting these characters in this world that I love. Unfortunately, I have been feeling more and more let down about the whole situation. I'm not gonna get into it here because there's too much to discuss. And there's already plenty of people who have voiced their displeasure of the mishandling of this property. The fear of us getting a new SW film every year is that the specialness will fade away. That they no longer feel like the events they were and that SW becomes over-saturated. It's been talked to death on other platforms, I know. I'm gonna get to what I thought, since that's why you are reading. Well, I did my best to go in with no expectations. Just to be open with the whole \"expect the worst and hope for the best\" type thing. And yes, you feel the \"Star Warsy\"-ness, but I couldn't help but to leave the cinema less happy than you should watching a SW movie. The action set-pieces, the references and the practical effects are appreciated. But the core of the story needed more.Every beat of what you sort of expect to happen happens. Chewbacca and Han's friendship was what I bought the most. It honestly felt pure and sympathetic. They got that right. Of course, the heist stuff is fun, but the care for the people and story? Other than the fact that you already know some of them based on previous films, you don't feel the importance of why this needed to be told. It becomes an un-eventful film in the series that really adds nothing new to what you already know about our main characters. It's nice to see Lando because you know him, but in the end he is just there in surface-level form. Nothing against Donald Glover, he was a great casting choice. But if this was your introduction to him or Han, then I'm not sure how much you would care. The reason I felt I could care a little was based on knowing who Han or Lando are in the other movies. I will again say that I enjoyed when the sense of urgency kicked in. You know, when a mission or quest is presented and you go: \"Yeah, I'm ready. Let's go on an adventure\". It's unfortunate that the adventure leads to no special impact. Creature effects and designs felt organic to the world, so that was nice to see. I bought the underground gambling places a lot more here than I did in \"The Last Jedi\". Here they blended in to the world and didn't distract. Everything looked and felt like it belonged in the SW universe. Although I would be happy if they didn't over-relay on everything that's nostalgia. Some new element would be nice to introduce. But this movie lands in a safe zone where no big leaps of risks are taken. The problem is that it failed to engage me in the actual story.The movie didn't make me feel happy or angry, it's a feeling in between. It's probably just fine, but you won't remember most if it. An average sci-fi movie that doesn't do much more than to be mildly entertaining. I have nothing against Ron Howard. I feel more bad for him because he had to take over mid-production and fix what he could. I respect the commitment in his effort, but I think I would have done some changes to make sure it got a warmer reaction. How about Alden \"Would that it were so simple\" / \"The rules don't apply to you\" Ehrenreich? Well, he's not a bad actor, kids. Leave him alone. The issue is that I just couldn't buy him as Solo. I'm sorry, Alden. You did your best, but you seemed more like another character. There's glimmers towards the end that remind you that it's supposed to be Han, but again, it's surface level. Not to say that I didn't think his character was like-able. No, he has charisma and humanity about him. But it's sad that it's never to the point where he earns the role and you go; \"That's Solo!\". I'm gonna end the review by saying that I'm conflicted about it. There are fun scenes to enjoy, but the the bigger picture is... kind of ..uninteresting. I hate to say it, and the worst part is that I'm starting to feel ready to let go of the new SW. If \"Episode IX\" doesn't give me the motivation to see what happens next, then... What's the point?PS: There's a cameo at the end and it was actually the most unexpected and exciting part of the movie. But it's also a little bit like: \"Oh, I'm happy to see you.. But, what.. Why again?\"","Don't worry if you are busy and miss this film. It is one of 15 Star Wars films Disney will mass produce in the next two years, one of 78 action hero movies Disney will ship out on its conveyor belt and certainly has much to do with making money and as little to do as having a good story as any of them.You will never see a less emotional moment than when Han meets Chewy. Seriously. Pure conveyor belt Disney.Signed: in search of a good film","Better than I feared it would be, Solo is a different type of star wars film, which I welcome. No lightsabres, no mention of the force, and no big climactic battle. \n Alden Ehrenreich is passable as Solo,I found myself warming to him towards the end. Emilia Clarke is completely wooden and the most memorable thing about Woody Harrelson is his bad wig.\n Effects are excellent as you would expect, the set pieces (train heist, kessel run and the end fight with Paul Bettany are good. Only the middlesags because of Clarke's poor acting.\nWorth a watch","Really, there's nothing special here. Solo: A Star Wars Story is just another movie in the ocean of bad ones that tries to aim for the lowest common denominator in order to bring some bucks for the studio behind it, while it also shamelessly tries to capitalize on the Star Wars name that seen better days. It doesn't have a clear vision - hell, it doesn't have any at all. The pacing of it is all over the place. The story is cliched, weak, it lacks a strong direction. The jokes most of the time fall flat - most of the time they do not work or feel inappropriate and forced. Also the movie's tone is quite inconsistent, while the actors don't really do a convincing job portraying their characters either.This movie sums up perfectly what Star Wars has become. What once was the holy grail of pop-culture and a shining beacon of hope that showed how mass-appealing movies can carry just as important messages as art-house movies and dramas, turned into something that's anything but reminiscent of Star Wars. It feels like a 4 days old dry burger from a fast-food restaurant that was halfly chewed and spitted out.There's only one good thing in this movie that leads to my two star rating: as much as it tried through it's entire runtime, it wasn't able to spin SW in the mud the way The Last Jedi did. This movie just wasn't able to be as disrespectful to the world and characters of Star Wars and to it's fans as The Last Jedi was. Because making such an unbelievably bad and insulting movie takes true talent - that the 'masterminds' behind Solo (fortunately) did not have. Or maybe it just wasn't able to make things worse, because Rian Johnson already killed the Star Wars movies, at least in my eyes.","I can't say that Solo is a bad movie, because it's not really a movie at all. It's a mess of action scenes glued together by all the adventure movie cliches the director was able to find. \nIt's the first time in my life when I was so bored watching a Star Wars movie that I actually wanted to leave half-way through it. Honestly, this one is waaaay worse than even the Attack of the Clones-I guess it's an achievement in itself :)\nI've seen that people praise it for being true to the lore, but actually they've just took a couple of facts from the original trilogy and stapled their script (though I doubt they even had one) to it.\nThe cast is absolutely ininspiring and talentless. The main guy (I refuse to call him Han) and the Mother of Dragons had about four facial expressions between them in the entire movie. I felt such a pain watching Woody Harrelson and Paul Bettany, who are great actors, dragging along in this mess for 2 hours. \nHonestly, just believe me and don't go to the cinema for this one. It's not worth either your time or your money.","On an endless, meandering, dizzy and complicated, uninteresting cycle, one scene follows the next with zero substance or flow along the way. It feels like starting from the proverbial ceiling and dropping to the floor, again and again: New rooms, new ceilings, new floors... But no doors: An adventure needs to move across, horizontal, sideways, and throughout its foundation. SOLO is a tortuous, unending pogo stick. A hangover without drinking.How Alden Ehrenreich was cast in the first place is unbelievable. Reportedly, it was from a big critical splash (that no average moviegoer even knew about) as a result of the Coen Brothers' HAIL, CAESAR where he played a bad actor trying to fit into what's supposed to be a great film: A limited performer in way over-his-head. Talk about Life Imitating Art. But the poor kid didn't have a chance, nor would even a great actor who actually resembled Harrison Ford and/or channeled him correctly. The SOLO: A STAR WAYS STORY screenplay is almost entirely to blame...Lawrence Kasdan, who scripted George Lucas's stories for EMPIRE, RETURN and RAIDERS, and his son, Jonathan, had no idea what type of fantasy they were creating. Part Space Pirate, part Buddy Picture, part Action/Adventure, part Comedy, Part Western, Part Chase: all enveloped into a preachy melodrama involving the slave labor of children, teenage girls, and even robots (Set Your Blenders Free!)...The Kasdans had no vision. Instead, they only seemed to \"Have a dream.\" But that kind of force-fed melodrama is, at this point, tiresome, cliché. In SOLO, the message kicks the viewer in the face and doesn't let up.As for the box office, SOLO bombed on the opening weekend, which means audiences didn't care. And it continued (and still continues) to plummet: most likely due to people hearing bad news about what they already figured, feared, or expected. And this is terrible news for Disney. Their planned Boba Fett and Obi Wan prequels are now under a looming shadow: plus the fact George Lucas already covered those particular backstories in his rightfully maligned prequels...And in this case, hardcore fans, and even mainstream audiences, didn't need a reason for Han Solo to be anything but the character he was in the Original Trilogy where Harrison Ford's performance felt both effortless and driven, leaving no time to reflect upon a life that led to a position of needing to move forward beyond what he was hired for i.e. what he does is who he is...And while the significance of Han, Chewbacca and the Millennium Falcon obviously stretches beyond giving the young hero a ride to rescue a princess, they still exist to fill-in the \"now\" while Mark Hamill's often-thankless Luke Skywalker (along with Obi Wan and Leia) are left to suffer through the how's and where's, and especially the whys. What Harrison Ford brought to the character was a pointed, focused, glib and mischievous persona that is still involving, addictive, and timeless. Basically, SOLO: A STAR WAR STORY attempts (badly) to provide answers that the legendary Rebel's Rebel didn't need, or ask for. Bottom line: Han Solo never looked back... So why should we?","Overall the acting for the main characters is exceptional. However once a character more annoying, stupid, and pointless than Jar Jar comes in I lost all respect for the film. Disney stop throwing in your political opinions and make a decent movie. You guys are getting pretty good at ruining franchises. Maybe its time to say goodbye to Star Wars.","Before I tee off on this piece of garbage disguised as a Star Wars movie using only cheap cinematic nostalgia magic tricks and sleight of hand, all you really need to know is that this is the \"Greedo shot first\", version of Han Solo. The completely unbelievable version of a ruthless smuggler who owes the whole galaxy money and lives on the run. Nah, this is cutesy pretty boy Han, who's weakness would be savagely taken adavantage of among the space scum in that line of work. Point being; right off the bat, the character doesn't fit who he would need to be to believably live on the run breaking the law. So, now the fun part. You can always tell it's a Disney bot/click farm when they start the review with something like \"i didn't like the last one, but....\" or \"don't listen to The haters\" \"my opinion is worth more than anyone Bc I'm 13 years old and have never lived my life without a constant stream of dopamine release from internet likes.\". Matter of fact, it would be even worse if it wasn't bots working to keep the average score above 7. If these people are just average humans reviewing the movie, why do they care what other people think? It's almost as if it's really about not only feeling part of some arbitrary greater collective, but being the most loyal media slave. They need others to like the movie so they can know what to like; Actively fighting to deny Disney doing this for any other Reason beyond hi jacking & inserting subversive but subtle mind control into the most popular fictional franchise of all time. These people are clinging to a last shred of self dishonesty Bc they don't want their number one method of escapism taken away from them: leaving them only with the uncomfortable truth of which they've spent their whole lives sanding the edges down, if not running full speed away from it. All whilst being encouraged to do so subtlety underneath the surface of the 4-6 hours of tv watching daily. Throw phones into the equation and the average lemming is in front of a screen for 8-10 hours a day, happily and gullibly following the one directly in front of them off the proverbial cliff. When u start the review with not liking another movie, it's makes it sound real, ya kno? Like no one can watch this movie and actually dislike it, it has to be an attitude of disdain toward Disney that does it, or being a \"hater\". It's as if Thyre not lemmings who think they have to like something To be relevant in this culture of escapism and franchises that have risen above criticism. Well I'll take it to the opposite side, I thought both the new trilogy episodes were awful(TFA especially, watch it after the buzz of it being a new continuation to the orbital story wears off if you haven't, and there's zero redeeming value to it) but really enjoyed \"Rogue One\". I was robbed of so many of my passions when Disney bought everything from Marvel comic books to Vice news(go ahead and google it, u didn't know they Owned the propaganda for hipsters mill), with the only intention of wringing them dry of every cent, until every piece of power is stripped from the storytelling and we can't stand to even hear the words Skywalker or superhero without becoming nauseous. When u own the full spectrum of media consumption (ESPN, abc, A&E, soon to be FOX, Pixar, marvel, Star Wars, I can keep going but I wont)it's about something far more sinister than simply financial gains. Club 33 y'all. Shhhhhhh! Anyone find the classic hidden weird subliminal messaging designed to wear down a child's moral compass and initiate them, unbeknownst, into an occult state of being? Back to the point ar hand. Steer clear of this garbage. Beyond the inconvenience of remembering the real Han thru out the flick and how terribly off The guy who plays this \"I didn't shoot first\" version of solo is; he's also an absolutely horrendous actor. The only redeeming quality of this movie is Emilia being super easy on the eyes with her beauty. Boba fett is the next character to be systematically decimated by the Disney machine. At least rent this or DL it so that Disney doesn't get their cut of the ticket prices.....there's an attempt at a story in here somewhere under the cheap nostalgia triggering cinematic tricks in between lowest common denominator WAY over CGI'd space chases and laser fights that trick your subconscious into believing you're watching a Star Wars flick. This movie could've literally been 45 mins long but somehow got stretched to 2.5 hours. Anyone looking for an actual well told solo origin story should turn to AC Crispin's Han Solo trilogy of novels from the late 90s, far superior; way more enjoyable and believably character driven, and Ron Howard doesn't over milk every emotional sentence, thank God!!!","Despite being a huge fan, I had lost faith in Star Wars and Disney after the abomination that was TLJ and then the adverts for Solo. THE ADVERTS DO NOT DO THIS FILM ANY JUSTICE. I fully expected to hate it and ended up leaving the cinema completely shook. The casting is perfect and all of the lore is spot on. No ridiculously over comedic parts (like the ones in TLJ) Please give this film a watch, you will not regret it. FAITH RESTORED","Tonight I went to watch Solo: A Star Wars Story and all I can say is that I was incredibly entertained and that I enjoyed every bit of the film.\nI am not going to spoil anything, but it's one of those moments where I felt like I was really experiencing a Star Wars story. \nI did not like 'The Force Awakens' neither did I like 'The Last Jedi' much, but Solo blew them all away!\nIt goes above 'Rogue One' for me, as it cuts down on 'annoying things' like running after a child to save her in middle of the gunfire and the already seen moments. A lot of twists and turns in 'Solo: A Star Wars Story', moments you'd not expect and it's also quite dark, as it is set in the gloomy time where Empire controlled majority of the places.Parents and I have thoroughly enjoyed it and we finally felt that old Star Wars vibe again. \nDon't let the hate comments sway you, go see it and conclude yourself. \nIt's packed with constant action, it never felt boring!","I watched Solo on Wed, 23 of May 2018 at XXI at Baywalk Mall Pluit in Jakarta, Indonesia and didn't have much expectation as it shows low rating on IMDB (around 5.6 smthg). However, i was very surprised with the outcome. This movie is great, but why it shows such low rating here. Emilia Clarke performs so well here and i think she needs no 'blood of the dragon' any longer, as she looks hot here too. The American actor casted as Han Solo worried me a bit in the opening of the movie as he looks somehow a very serious personality compared to Han Solo played by Harrison Ford (a character which should be such a funny douche bag), but as the movie moves from scene to scene, the character played by Aldenrich convinces me that he is that Han Solo just like in the original Star Wars. I can't wait for the sequel, and don't tell me i don't know Star Wars, I grew up with it and already saw all Star Wars Movies from 1 to 6, and all the disney sequels. I'm giving it 8 out of 10!!!!","Maybe there are some things in the Star Wars universe that should just be kept a mystery. One of those things is the past of Han Solo. Not that the beloved character doesn't have an intriguing past, but this movie nearly disgraces the name of the character Star Wars fans know and love.\nAlden Ehrenreich is nowhere close to capturing the spirit of Han Solo like Harrison Ford. Yes the character of Han in general is a bit smug, but watching this guy deliver line after line of cheesy dialogue like an actor on his first day of drama class will want to make you punch him in the face. \nThe plot is decent. Nothing really special. But if you're like me, you'll be too busy cringing at nearly every line of dialogue and rooting for the failure of several annoying side characters to even remember what's going on in this story. Also, the romance between Han and Kira (Emilia Clarke) seems forced at times which doesn't help when the two have little to no on screen chemistry. \nIt's sad to say that the biggest redeeming quality of this movie is Chewbacca. Donald Glover as Lando Calrissian is probably the best performance by a human in this movie, and he's only ok. He manages to capture a good amount of the charisma of Lando from the original trilogy, but sometimes slips into this weird accent that will have you saying 'wtf?'\nLong story short, don't waste your money to go see this movie. I'm a Star Wars fan, not a die hard but still a committed fan, and following up a mediocre episode in The Last Jedi with this piece of hot garbage has me wondering if I should ever spend my money on a Star Wars movie again."],"review-user":["poopville","lastjosh","vandykeu","cogollo1974-612-157173","CANpatbuck3664","djmcghee-69855","kaiwallauer","SpoodermanDerp","BiiivAL","Joejoesan","danielkelso-10265","hilaryswank2011","lehoucq","paulijcalderon","ffw-00221","airsoftquartermaster","daemonxhun","justicedispencer","cultfilmfreaksdotcom","daggerhawx","sclafunk","ryanmillson","kristina-d-80904","asiuapau","madzima"],"review-date":["6 August 2018","31 May 2018","27 May 2018","24 May 2018","28 May 2018","24 May 2018","24 May 2018","23 May 2018","2 June 2018","17 May 2018","23 May 2018","27 May 2018","23 May 2018","24 May 2018","28 May 2018","29 May 2018","19 May 2018","26 May 2018","7 June 2018","3 June 2018","3 June 2018","24 May 2018","2 June 2018","23 May 2018","26 May 2018"],"review-rating":["7","9","7","9","8","8","9","6","7","5","6","1","6","6","7","2","1","1","5","1","10","10","8","2"],"review-title":[" A non-hateful Star Wars fan who liked it\n"," For anyone who feels discouraged by the reviews\n"," It's better than the new trilogy\n"," A solid adventure movie\n"," A Fun Sci-Fi Heist Flick When Viewed Independently From the Star Wars Saga\n"," True to the saga\n"," Better than expected\n"," Solo: A \"Skip This\" Story\n"," Solo episode\n"," I'm a big SW fan but I hated (almost) every minute of it - 5/10\n"," Spoiler Alert: This is a cash grab.\n"," Shooting Game for Star Wars Fans\n"," whats happening to star wars ?\n"," No happiness or anger - Just an average feeling in between\n"," Don't worry if you missed it\n"," Better than TheLast Jedi\n"," It's the same as every other generic CGI-fest movie that comes out of Hollywood every week\n"," Just sort your socks instead\n"," Don't Blame Old Luke (Last Jedi) On Young Han's SOLO Travesty\n"," Why Disney? Just Why?\n"," Thanks for the input Disney bots.\n"," Expected to hate it (based off of adverts) LOVED IT\n"," Satisfied and happy! Go see it, don't listen to the haters!\n"," Great Star Wars for Adult ! Why so underrated on imdb? I just watched it and it was great! at least 8 of 10!\n"," Never should have or needed to exist\n"]}