{"movie-duration":["\n                        1h 31min\n                    "],"movie-rating-count":["5,369"],"movie-rating-value":["7.9"],"movie-best-rating":["10"],"movie-year":["1971"],"movie-director":["Peter Watkins","Peter Watkins","Patrick Boland","Kent Foreman","Carmen Argenziano","See full cast & crew"],"movie-description":["    \"Punishment Park\" is a pseudo-documentary purporting to be a film crews's news coverage of the team of soldiers escorting a group of hippies, draft dodgers, and anti-establishment types across the desert in a type of capture the flag game. The soldiers vow not to interfere with the rebels' progress and merely shepherd them along to their destination. At that point, having obtained their goal, they will be released. The film crew's coverage is meant to insure that the military's intentions are honorable. As the representatives of the 60's counter-culture get nearer to passing this arbitrary test, the soldiers become increasingly hostile, attempting to force the hippies out of their pacifist behavior. A lot of this film appears improvised and in several scenes real tempers seem to flare as some of the \"acting\" got overaggressive. This is a interesting exercise in situational ethics. The cinéma vérité style, hand-held camera, and ambiguous demands of the director - would the actors be ..."],"movie-title":["Punishment Park (1971)"],"movie-image":["https://m.media-amazon.com/images/M/MV5BN2E5OTY5ODctOTQzOS00ZjlkLTg4ZTktNmI5MjQ2NTFiYjZhXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_UY1200_CR107,0,630,1200_AL_.jpg"],"movie-short-description":["Directed by Peter Watkins.  With Patrick Boland, Kent Foreman, Carmen Argenziano, Luke Johnson. \"Punishment Park\" is a pseudo-documentary purporting to be a film crews's news coverage of the team of soldiers escorting a group of hippies, draft dodgers, and anti-establishment types across the desert in a type of capture the flag game. The soldiers vow not to interfere with the rebels' progress and merely shepherd them along to their destination. At that point, having obtained their goal, ..."],"movie-url":["http://www.imdb.com/title/tt0067633/"],"movie-id":["tt0067633"],"movie-character":["First Tribunal Defendant","Jay Kaufman, Tribunal Defendant","James Arthur Kohler, Tribunal Defendant","Charles Robbins","Mary Jurgens, Tribunal Member"],"movie-actor-img":["https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png"],"movie-actor":["Patrick Boland","Kent Foreman","Carmen Argenziano","Luke Johnson","Katherine Quittner","Scott Turner","Stan Armsted","Mary Ellen Kleinhall","Mark Keats","Gladys Golden","Sanford Golden","George Gregory","Norman Sinclair","Sigmund Rich","Paul Rosenstein"]}