{"movie-duration":["\n                        1h 50min\n                    "],"movie-rating-count":["2,058"],"movie-rating-value":["6.9"],"movie-best-rating":["10"],"movie-year":["2004"],"movie-director":["Tom Hooper","Troy Kennedy-Martin","Gillian Slovo","Jamie Bartlett","Hilary Swank","Ian Roberts","See full cast & crew"],"movie-description":["    The South African lawyer Sarah Barcant travels from New York back to her hometown to represent the member of the Parliament Alex Mpondo in the Truth and Reconciliation Commission since torturer police officer Dirk Hendricks has made an application for amnesty. The parents of Steve Sizela request Sarah to represent them also since their son that was arrested with Mpondo but has gone missing. Hendricks uses one break in the trial to threaten Mpondo, promising to destroy his political career telling that he was a traitor. But Mpondo, who is a man traumatized with the torture, anticipates and tells what has happened to Steve Sizela and him in the hands of Hendricks and his superior Piet Müller. Will the remains of Steve be found and the truth disclosed?"],"movie-title":["Red Dust (2004)"],"movie-image":["https://m.media-amazon.com/images/M/MV5BMjA5MDkyOTQ5NF5BMl5BanBnXkFtZTgwNjUwOTkwMzE@._V1_UY1200_CR110,0,630,1200_AL_.jpg"],"movie-short-description":["Directed by Tom Hooper.  With Jamie Bartlett, Hilary Swank, Ian Roberts, Chiwetel Ejiofor. Police officer Dirk Hendricks (Bartlett) files an amnesty application for Alex Mpondo (Ejiofor), a member of the South African Parliament who can't remember the torture he once endured as a captive political activist. South African-born attorney Sarah Barcant (Swank), meanwhile, returns to her homeland to represent Mpondo, as well as Steve Sizela, Mpondo's friend who was arrested along with him ..."],"movie-url":["http://www.imdb.com/title/tt0388364/"],"movie-id":["tt0388364"],"movie-character":["Sarah Barcant","Alex Mpondo"],"movie-actor-img":["https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png"],"movie-actor":["Jamie Bartlett","Hilary Swank","Ian Roberts","Chiwetel Ejiofor","Hlomla Dandala","James Ngcobo","Glen Gabela","Connie Mfuku","Sylvaine Strike","Greg Latter","Zaa Nkweta","Marius Weyers","Sam Phillips","Elize Cawood","Nomhle Nkonyeni"]}