{"movie-duration":["\n                        1h 18min\n                    "],"movie-rating-count":["972"],"movie-rating-value":["7.6"],"movie-best-rating":["10"],"movie-year":["2004"],"movie-director":["Gregory Greene","Gregory Greene","Barrie Zwicker","James Howard Kunstler","Peter Calthorpe","See full cast & crew"],"movie-description":["    The modern suburbs have ultimately become an unsustainable way of living. They were originally developed in an era of cheap oil, when the automobile became the center of the way people lived and an era when people wanted to escape the inner city to a more pastoral or rural way of life. However the suburbs quickly evolved into a merely a place to live that had neither the benefits of rural or urban life, and where one was reliant on an automobile both to travel elsewhere and even travel within the neighborhood. The suburbs are not only dependent upon cheap energy, but also reliable energy. The reliability of energy is becoming less so as demonstrated by the multi-day blackout of the North American Eastern Seaboard starting on August 14, 2003. Part of the problem of getting out of the suburban mentality is that a generation has grown up believing it to be a normal way of life, and a life of entitlement, which they will not give up without a fight. But many developers and planners and ..."],"movie-title":["The End of Suburbia: Oil Depletion and the Collapse of the American Dream (2004)"],"movie-image":["https://m.media-amazon.com/images/M/MV5BMTQ3Mjg0OTI3OF5BMl5BanBnXkFtZTgwNTU0MDA2MDE@._V1_UY1200_CR135,0,630,1200_AL_.jpg"],"movie-short-description":["Directed by Gregory Greene.  With Barrie Zwicker, James Howard Kunstler, Peter Calthorpe, Michael Klare. The modern suburbs have ultimately become an unsustainable way of living. They were originally developed in an era of cheap oil, when the automobile became the center of the way people lived and an era when people wanted to escape the inner city to a more pastoral or rural way of life. However the suburbs quickly evolved into a merely a place to live that had neither the benefits of rural or ..."],"movie-url":["http://www.imdb.com/title/tt0446320/"],"movie-id":["tt0446320"],"movie-character":["Himself","Himself"],"movie-actor-img":[],"movie-actor":["Barrie Zwicker","James Howard Kunstler","Peter Calthorpe","Michael Klare","Richard Heinberg","Matthew Simmons","Michael Ruppert","Julian Darley","Colin Campbell","Steve Andrews","Ali Samsam Bakhtiari","Kenneth Deffeyes"]}