{"movie-duration":["\n                        1h 32min\n                    "],"movie-rating-count":["482"],"movie-rating-value":["7.1"],"movie-best-rating":["10"],"movie-year":["2003"],"movie-director":["Ntshaveni Wa Luruli","Yves Buclet","Peter Speyer","Junior Singo","Dana de Agrella","Innocent Msimango","See full cast & crew"],"movie-description":["    Kayelitsha, South-Africa, today. 2003 A township, close to Cape-town, after the end of Apartheid. Two kids, 14, Madiba and Sipho play along the railway. A train passes by. A dead man rolls to their feet. On him, they find a gun and a video camera. Sipho takes the gun and Madiba the camera. Their destiny is sealed. Benny, their friend makes a wooden camera and Madiba hides the video inside, in order to avoid embarrassing questions, racketing etc. He starts filming the township and its inhabitants. He discovers the strange beauty of his life's setting. Sipho, the boss, brings his friends to Cape-town, the white city, so close, so far, so exotic to the eyes of the children. While Sipho forms a gang with the street children and makes all kinds of illicit trading, Madiba films the town, its huge buildings, its business life, and its luxury. In a bookstore, he films a young white girl, stealing a book. They look at each other. Going out of the store, she drops book on road, knowing he will ..."],"movie-title":["The Wooden Camera (2003)"],"movie-image":["https://m.media-amazon.com/images/M/MV5BMTYyNzY3NTcxNV5BMl5BanBnXkFtZTcwMjI0NzcyMQ@@._V1_UY1200_CR103,0,630,1200_AL_.jpg"],"movie-short-description":["Directed by Ntshaveni Wa Luruli.  With Junior Singo, Dana de Agrella, Innocent Msimango, Lisa Petersen. A township near Cape Town. Two young teens, Madiba and Sipho, find a gun and a camera. Sipho takes the gun, and Madiba the camera, sealing their fate."],"movie-url":["http://www.imdb.com/title/tt0402590/"],"movie-id":["tt0402590"],"movie-character":[],"movie-actor-img":["https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png"],"movie-actor":["Junior Singo","Dana de Agrella","Innocent Msimango","Lisa Petersen","Nicholas Jara","Lynita Crofford","Nomhle Nkonyeni","Thembi Mtshali","Jean-Pierre Cassel","Fats Bookholane","Bo Petersen","Andre Jacobs"]}