{"movie-duration":["\n                        25min\n                    "],"movie-rating-count":["1,931"],"movie-rating-value":["8.7"],"movie-best-rating":["10"],"movie-year":[],"movie-director":["Lamont Johnson","Rod Serling","Marvin Petal","1 more credit","Susan Harrison","William Windom","Murray Matheson","See full cast & crew"],"movie-description":["    It all starts when an army major wakes up in a small cylindrical room with no way out. The walls are too high to climb and they're too hard to puncture. Trapped inside with him is a clown, a bagpiper, a ballerina, and a hobo. They have all woken up inside there and have no idea where they are, what they're doing there, how long they've been there or even who they are or how long they'll be there. They apparently are unable to feel anything, and every now and then a loud clanging sound makes them all fall down. All of them have tried various ways of finding an exit, unsuccessfully. The army major especially is determined to escape. He tries all sorts of ways to find an exit, but he cannot find one. Even when he hits the walls with his sword, it shatters. The major suggests that they are in Hell, so there IS no way out. Eventually the five characters decide that the only way out is to make a human tower. But then when the ballerina nearly reaches the top, the clanging sound goes again ..."],"movie-title":["\"The Twilight Zone\" Five Characters in Search of an Exit (TV Episode 1961)"],"movie-image":["https://m.media-amazon.com/images/M/MV5BMTQxMjI2MzMyMV5BMl5BanBnXkFtZTgwNDY1OTEyMjE@._V1_UY1200_CR485,0,630,1200_AL_.jpg"],"movie-short-description":["Directed by Lamont Johnson.  With Susan Harrison, William Windom, Murray Matheson, Kelton Garwood. An army major awakens in a small room with no idea of who he is or how he got there. He finds four other people in the same room, and they all begin to question how they each arrived there, and more importantly, how to escape."],"movie-url":["http://www.imdb.com/title/tt0734569/"],"movie-id":["tt0734569"],"movie-character":["The Ballerina","The Major","The Clown","The Tramp","The Bagpiper"],"movie-actor-img":["https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png","https://m.media-amazon.com/images/G/01/imdb/images/nopicture/32x44/name-2138558783._CB470041625_.png"],"movie-actor":["Susan Harrison","William Windom","Murray Matheson","Kelton Garwood","Clark Allen","Carol Hill","Mona Houghton"]}