{"primary":["\n                        2h 20min\n                    ","616,249","7.6","10","2005","    In Coruscant, the Jedi Obi-Wan Kenobi and Anakin Skywalker rescue the Supreme Chancellor Palpatine from the Separatist General Grievous' spaceship and Anakin kills Count Dooku with his light-saber after a fight; however Grievous escapes from the Jedi. When they land on Coruscant, Padmé Amidala comes to tell Anakin that she is pregnant. Soon he has premonitions of his wife dying during the delivery. Palpatine requests that Anakin join the Jedi Council against the will of the members but he is not promoted to Master and stays at the rank of Knight; further they ask him to spy on Palpatine. Anakin is manipulated by Palpatine about the true intentions of the Jedi and is tempted to know the dark side of the Force that could be capable of saving Padmé. Further Palpatine discloses that he is Sith Lord Darth Sidious. What will Anakin do?","George Lucas","George Lucas","Hayden Christensen","Natalie Portman","Ewan McGregor","See full cast & crew","https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_UY1200_CR135,0,630,1200_AL_.jpg","Directed by George Lucas.  With Hayden Christensen, Natalie Portman, Ewan McGregor, Samuel L. Jackson. Three years into the Clone Wars, the Jedi rescue Palpatine from Count Dooku. As Obi-wan pursues a new threat, Anakin acts as a double agent between the Jedi Council and Palpatine and is lured into a sinister plan to rule the galaxy."],"secondary":["\n            Obi-Wan Kenobi \n                  \n          ","\n            Padmé \n                  \n          ","\n            Anakin Skywalker \n                  \n          ","\n            Supreme Chancellor Palpatine \n                  \n          ","\n            Mace Windu \n                  \n          ","\n            Senator Bail Organa \n                  \n          ","\n            Yoda \n  \n  \n  (voice)\n  \n                  \n          ","\n            C-3PO \n                  \n          ","\n            Count Dooku \n                  \n          ","\n            Queen of Naboo \n                  \n          ","\n            Ki-Adi-Mundi /  \n            Nute Gunray \n                  \n          ","\n            Captain Typho \n                  \n          ","\n            Tion Medon \n                  \n          ","\n            Governor Tarkin \n                  \n          ","\n            Commander Cody \n                  \n          ","Ewan McGregor","Natalie Portman","Hayden Christensen","Ian McDiarmid","Samuel L. Jackson","Jimmy Smits","Frank Oz","Anthony Daniels","Christopher Lee","Keisha Castle-Hughes","Silas Carson","Jay Laga'aia","Bruce Spence","Wayne Pygram","Temuera Morrison"]}