{"review-url":["https://www.metacritic.com/movie/pulp-fiction"],"review-text":["One of the zaniest, funniest, smartest and most entertaining movies I have ever seen. One of my all time favorites as well. John Travolta and Samuel L. Jackson give terrific performances.","Even years after the release the movie feels fresher than many of the movies made today. Quentin Tarantino  takes a story, twists it and turns, plays with our expectations and leaves us with a masterpiece."," Best movie ever..hands down!"," Best movie of all time."," Incredible acting (especially Travolta and Jackson), incredible stories and incredible piece of art for Pop culture! Though the end is a bit frustrating, the plot is great, really I mean it."," This is one of the greatest movies ever made, absolutely brilliant.","One of the best movie i've ever seen."," Funny and entertaining from beginning to end. Amazing script and great acting."," About as perfect as a film will ever get. See it."," Easily one of the best, most finely-crafted films ever. The only movie that could ever reach the cinematic brilliance of Pulp Fiction was Wizard of Oz, more than 70 years ago.","One of my favorite movies ever, and classic Tarantino. Noone can shoot these disjointed action dramas with such finesse and creativity. He won't be able to top this one, but he has had great movies before and after it.","The greatest film ever made. Dialogue in the film is perfect, brilliantly written by Tarantino.A superb performance from John Travolta and Samuel L. Jackson.","This is a weak movie, not much stories that didn't connect, and I really didn't care. This not my favorites. I'll take Revservoir Dogs anytime.","Quentin Tarantino is absolutely a genius and this movie proves how is this geniality,an outstanding movie with an non-linear story is great,some movies would serve this movie as an example.","Great, great, great!\nAwesome movie, awesome characters, awesome dialogues! Just an unforgettable movie! One of my absolute favourites and I would definitely recommend to watch it. Like, seriously, go watch it. Now!","24 years later and not a single movie since has ever topped this masterpiece!","Pulp Fiction is both a technical masterpiece of writing and acting as well as a bonifide cultural artifact with an unmatched influence on filmmaking today.","Pulp Fiction is an astonishing classic with a superb cast and funny and violent story!!","This is probably one of the greatest movies ever to hit the silver screen (in my opinion that is). Tarantino, you're one hella director, keep it up. If you haven't seen this movie or you're debating on seeing it, well...SEE IT!!!!!!","Yo The Godfather: I'm really happy for you... Imma let you finish, but Pulp Fiction is the best movie of ALL TIME... of ALL TIME!!!  but really I have yet to see better movie"," Definitely belongs to the 10 best movies of all times !!! The story and the dialogues are just awesome and it's really sad to see that it only received the script-oscar. What about this ridiculous Forrest Gump is worth these many trophies !","Not a huge fan of all of Tarantino's films but this one is great. Great music.. great cast... great dialog!!!!!!Must see - *highlights* Samuel J, Travolta, Steve B... great performances","Overrated to the point of ridicule. Pulp Fiction, what is supposed to be one of the greatest films ever, was a cluster of bizarre scenes that were patched up like a rag doll."," One of my faves.","One of the most influential films of the 1990s, Pulp Fiction is a delirious post-modern mix of neo-noir thrills, pitch-black humor, and pop-culture touchstones.","apparently,this movie has been overatted by the critics.this movie's really an incorrigible and incoherant rubbish. i call this movie a \"ROTTEN FICTION\".","Pulp Fiction was something special. Something different, with fantastic character development as well as dialogue and memorable quotes. It's definitely worth watching.","one of the greatest films ever made in my opinion its better than the godfather if you havent seen it youd better because theres no other fil like it.","Quentin Tarantino creates something new and original - combing the stories of a boxer, two hit men and a gangsters wife into a 154 minutes of masterful filmmaking.","A very interesting movie. Its combination of extreme violence and creates something unique and fantastic. The cast is filled with some of the best actors out there and the writing is just fantastic. It's unlike anything you've ever seen before.","Silly hair, terrible casts. Watch it on 90's maybe will be better? I like Quentin Tarantino, but this flick seems pointless and strange. Universal acclaim didnt attract me give better score.","I know, everyone says it's a good movie. Yes it is, but not my type. I tried to watch it 2-3 times but I can not resist. Something attracts me at all, not at all, I get bored so fast ... No offense, it is my opinion","What the f222 was this sh7t? This is the worst movie i've ever seen! What a mind f777! And how the f999 this movie has this high scores? F777 the academy awards!","This is one of the most overrated movies ever made, I neither like this movie or think it is good or edge, people need to get over Tarantino as he is far from a good writer or director, terrible movie.","beautiful number 1 of all movies of all time no dought and if you do not like this movie than you will know my name is the lord"," This film is continuously hilarious from beginning to end. With it"," I still remember how giddy and excited I was while I was watching this movie in the theater. A top ten favorite of mine."," overall a good movie with great dialogue...i wouldnt really call this a movie though rather a combination of 3 short scenes."," I can honestly say that this is one of the best genre changing films of the past few decades since the godfather or the goodfellas. if i made a list of my top ten favorite movies pulp fiction would without a doubt be on there somewhere."," Really good, in a brutal, weird, unconfortable sort of way."," Travolta and Jackson are absolutely perfect together, one of the best duo's in movie history, and that's no overstatement."," Most people I know love this movie. It's decent. I'd like it a lot better if it weren't for the entire part of the movie with Uma Thurman."," This moive is amazing! It combines deep thought with a crazy story."],"review-user":["TheNewSpielberg","grandpajoe6191","dj1982","Michelep.","AlvaradoKTA","axelkoch","julesw.","ClifC.","KarstenN.","Ali","KentE.","TroyP.","DaveF","NinjaMafia","JamesM","NickyE.","DavidP.","WesE.","rodericrinehart","nboley08","Film_Fanatic_15","MetallicCritic","tedleanse","MikeTheGai","MouthofSauron","gzayas91","Swati","TheWalrus2000","theunholymesiah","MrPenman","joao1198pedro","JamisInsomia","TheRoyalMelon","VinceRocks123","MovieManiac83","CinemaBlend","YorkMan","Dyliebar","The3AcademySins","MasterRiley","Benkoko11","jaasieljunior","robertoiglesias","dmullz","KanyeWest","PeterP.","FelixK.","MM.","pgmark","cabrita","House0fWolves_","guess","Thegodfatherson","Raizulee1","Kiva","nashville13","JackTormentor54","dh","EricG","PamL.","KenL.","JohnH.","KentC.","JS","J.H.","KenL.","CK","Dalek","796712","Tubie","Duke","TheQuietGamer","JonnyFendi","asthobaskoro","theantonlolz","pos","RegOz","imthenoob","MegWhiteley","Marica","SHANKROID","ExKing","SEROJ","MovieGuys","Anonymous777","Proctorious","markkermode","daviddelnorte23","thedudethatreve","StevenO.","S.Barnes","C.B.","SamX.","IlirC.","adityam","zackm","marshallm","MarkS.","RodG.","JamieC."],"review-date":["May  2, 2011","Sep 27, 2011","Dec  3, 2011","Dec 20, 2006","Jun  7, 2012","Oct 15, 2012","Aug 19, 2007","Mar  9, 2009","Sep 10, 2005","Sep 20, 2005","Apr  1, 2007","Oct 17, 2008","Sep 19, 2008","Feb 11, 2004","Nov 19, 2005","Sep 14, 2005","Sep 21, 2007","Nov 15, 2005","Aug 14, 2010","Aug 15, 2010","Nov 22, 2010","Dec 20, 2011","May  6, 2012","Jun 23, 2012","Apr 18, 2013","Jul 22, 2018","Nov 25, 2013","Mar  9, 2013","Sep 25, 2013","Oct  8, 2013","Nov 23, 2013","Jul 10, 2014","Dec  2, 2015","Apr 12, 2015","Apr 24, 2015","May  6, 2015","Feb  1, 2016","Aug  3, 2018","Oct 20, 2017","Aug 10, 2016","Feb 23, 2017","Nov 21, 2017","Mar 16, 2018","Dec 28, 2010","Mar 19, 2011","Jan 22, 2008","Feb 14, 2008","Jan 23, 2008","Dec 17, 2010","Jan 23, 2012","Dec 16, 2011","Sep 26, 2005","Jul 20, 2013","Feb  2, 2014","Jul  7, 2013","Nov  2, 2011","Jun 24, 2017","Feb  5, 2008","Nov 15, 2008","May 20, 2006","Aug 30, 2006","Apr  2, 2006","Jan 13, 2008","Jan  8, 2008","Feb  7, 2007","Sep 12, 2006","Dec 26, 2007","Aug 18, 2014","Nov  4, 2010","Nov  2, 2010","Nov  4, 2010","May 16, 2013","Jan 11, 2011","Mar  2, 2011","Aug 12, 2011","Sep  2, 2011","Apr  5, 2012","Jan 24, 2012","Apr 16, 2012","Sep  2, 2014","Feb 16, 2013","May 24, 2013","Jan 25, 2015","Sep 15, 2013","Sep 12, 2014","Jul 23, 2015","Jun 19, 2015","Apr  1, 2017","Jan  2, 2018","Jul 10, 2009","May  6, 2009","Oct 20, 2005","Apr  1, 2006","Jul 30, 2006","Sep  5, 2009","Jan  2, 2010","Oct 20, 2005","Jul  5, 2006","Feb 20, 2007","Mar  6, 2007"],"review-rating":["10","9","10","10","9","9","10","9","10","10","10","10","10","10","10","10","10","10","10","10","10","9","10","9","10","5","9","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","10","9","10","4","10","10","5","9","0","0","4","3","0","1","2","8","1","3","1","0","9","10","10","10","8","9","5","5","10","7","8","10","0","0","3","0","8","1","0","10","10","10","10","9","10","10","8","10","10","9","9","6","10"],"review-title":[]}