{"review-url":["http://www.imdb.com/title/tt0084747/reviews"],"review-text":["Even if you're not a \"theatre person,\" I highly recommend that you see this. Based off of a play of the same name by Christopher Bond (which, in turn, had been based off of an old London legend), Sondheim did a wonderful job bringing it to the musical theatre stage. The score is just amazing-- by far Sondheim's best, and probably one of the best scores written for a musical ever. The show was cast extremely well, my only complaint being of Betsy Joscelyn's portrayal of Johanna. It;s good, mind you, and she's a very versatile actress, but she just doesn't sing \"Greenfinch and Linnet Bird\" too well. But other than that, it's all phenomenal-- Angela Lansbury *made* the role of Mrs. Lovette, and she just does it so well. George Hearn was a good replacement for Len Cariou in the title role, and Ken Jennings gives a great performance as Tobias. The ending will give you chills. Top marks for a wonderful show.","First of all, I have watched this show since I was a little toddler, and I have always loved it.  Sure, maybe I didn't understand it when I was that young, but I still enjoyed it!  And now that I have been able to understand it for several years, I love it even more.  The score of this musical is the most wonderfully detailed score I have ever heard!  Every note is perfect, I don't even need to hear the singing to enjoy it!Moving on to this particular production-  This is magnificent!  Of course no one could play Mrs. Lovett besides Angela Lansbury, and she does it perfectly.  And she should, she has been playing this part for several years.  George Hearn is absolutely brilliant.  The best Sweeney Todd I have ever heard.  He has a wonderful voice, yet he can throw his voice so well! His \"epiphany\" is incredible, as you can tell by the audience's reaction to it.  The Judge, Toby, Antony, and Pirelli are also so wonderful in their roles.  Everyone is perfect!  Well, I still have to fast forward through Johanna's Green finch and linnet bird.  She just doesn't sing that song well at all.This show CAN be appreciated at all ages, but it is not always accepted. I am not your typical middle-aged theater lover, I am only 15 years old, yet Sweeney Todd has given me a greater appreciation for music than I have gotten from any other musical.","Dark and bleak sets, thrilling music that cuts through your spin like aknife (or razor) a perfect cast lead by Broadway greats Hearn and Lansbury. This is exciting theatre flawlessly transferred to the small screen. Sondheim is the most talented songwriter of our age and Todd is his Masterpiece, from the Brechtian opening ballad to the darkly humorous Act I finale- \"A Little Priest\" where Lovett and Todd fantasize about the victims that will wind up in their meat pies , this play never ceases to thrill,excite and satisfy. Betsy Joslyn also excels as Johanna, even she, as the plays ingenue seems slightly mad.Edmund Lyndeck turns in a bravado performance as the corrupt Judge who lusts after Joslyn and is the subject of Todd's vendetta. Lansbury and Hearn command the show as only two great actor/stars can do. Other musical highlights include Todd's \"johanna\" Lovett's \"worst pies in London\" and the Act II opening 'GOD THATS GOOD\", And that is a title to describe this production !","I have only praise for this film. From start to finish it captured the brilliance of Stephen Sondheim's musical. I am not a big fan of musicals most of them are very overdone. This one however changed my mind. I am an actor myself and have actully played Sweeney and I know how hard this role is. George Hearn gave a stunning, masterful and rounded performance worthy of the highest awards that we can give him (He won an Emmy and that's something.) Everything he does he turns to gold. He is so good it will blow your mind why he's not in films winning oscars. Lansbury is also very good and very funny. Sara Woods is creepy and wonderful as the Beggar Woman. All in all a great video. Pick it up if you can.","I have owned a copy fo this for ages now, on video, but will definitely be buying the DVD release.Angela Lansbury and George Hearne are the unmistakable people to perform these legendary roles.This is suberb theatre at its peak, what a cast, the entire crew, the staging and the lighting are fantastic, as well as the ensemble who provide the extras in this macabe piece of theater.The new work with Patti LuPone and George Hearn is nothing in comparison, except for the lush surround sound provided by todays technology.A must see for any die hard Stephen Sondheim fanatics like me.","Though the video technology may be dated, this classic musical play, now on DVD, is the best version of Sondheim's most important and polished work on Broadway.  If you've never seen SWEENEY TODD, then you must buy this DVD.  I saw this production in November 1980 at Kennedy Center in Washington--and fell in love with a pre-\"Murder She Wrote\" Angela Lansbury.  Subsequently, I tried to find any and all of her work, among them:  MOVIES: \"The Harvey Girls,\" \"The Picture of Dorian Gray,\" \"Manchurian Candidate\";  CDs: \"Mame,\" \"Dear World,\" and \"Gypsy\"; and many more.  The rest of the cast is flawless, too.  All in all, this wonderful DVD gives us the definitive version of Sondheim's opera!","There are no flaws in this production. Perfectly entertaining, fun, and worthy of respect.This is what theatre is all about.  Definitely not for the very young, but slightly older kids will get a great kick out of seeing it and can be introduced to theatre this way.Astounding and amazing.","I own a copy of this film and have always loved it.  I comment here, however, because I saw the PBS presentation of a concert version of Sweeney Todd earlier this week.  That production was put on by the San Francisco Opera and starred George Hearn and Patti LuPone.  In the early '80s Hearn replaced Len Cariou as Sweeney (Cariou had won the Tony for his performance).  I saw Hearn and Angela Lansbury (who also won the Tony for her performance as Mrs. Lovett) perform Sweeney on broadway.  They must have made the film at about the time I saw the show.  To this day, the most moving moment I can ever remember in the theatre occurred when Hearn sang \"These are my Friends.\"  (\"These are my friends, see how they glisten.\"  \"My arm is complete again!\")  Hearn's performance in the San Francisco Opera production convinced me that he has lost nothing in the nearly twenty years since I first saw him perform the piece on Broadway and later in the film.  What a talent!  He is sympathetic, funny, and scary -- all at once; and he can sing, boy can he sing.  All of this reminded me of how terrific the film is.  Highly recommended. Ten out of ten.","One of Sondheim's most shocking musicals. After seeing it, it's hard to believe this is the same man who's given us musicals like \"A Funny Thing Happened on the Way to the Forum\", \"A Little Night Music\" or \"Passion.\" Lansbury and Hearn are both brilliant in their roles. The music is magnificent. The sets are devilishly grim. Terry Hughes' direction is superb. Hearn won the Emmy for his performance. Lansbury had won a Tony Award for her Broadway performance with then Sweeney, Len Cariou, who also won the Tony under the direction of Harold Prince.","I saw \"Sweeney Todd\" on Broadway in 1980.  It starred George Hearn and featured most of the other cast principals who appeared in the national touring company production, which was videotaped for TV in Los Angeles in 1982.  Last night I watched the new DVD release of the Los Angeles production, although I have owned the videotape for many years.  The production and the performances could have hardly been better but the original tape's age showed because both the audio and video quality are below modern standards, even on a newly pressed DVD.  Nevertheless I still give it 10 out of 10 because of the greatness of the work and George Hearns's and Angella Lansbury's startlingly wonderful performances.  Even today, my most memorable recollection from a live musical theater performance has to be Hearn's rendition of \"These are My Friends.\"  \"You'll drip rubies,\" brrr.","Last year, I fell in love with the Tim Burton's version of Sweeney Todd so I wanted to check out the other versions of this musical and I found this one at the library. Though I think Burton's is best, probably because I like film a lot better than theater, this is still a great production of the story. I haven't seen any of the other versions but I am trying to get my hands on them.After seeing Johnny Depp as Todd, it's hard for me to imagine anyone else in the role, but George Hearn does a fantastic job. Angela Lansbury is great, as always and all of the singing is fantastic. I found myself singing along. This is a play you won't want to miss, but try and see it before you see the film version so you won't have a biased view like me.","\"Sweeney Todd\" is in my opinion one of a few \"perfect\" musicals. Like \"My Fair Lady\" and \"West Side Story\" it has a wonderful, intelligent score. It offers the two leads and several supporting characters interesting roles. It has a timeless theme, revenge. It has a good deal of humor, and is just as powerful when presented simply or on a grand scale.\"Sweeney Todd\" tells the story of a simply wronged man during the industrial period in England. It shows mans' inhumanity to man, how in Sweeney's own words, \"There are two kinds of men. There's the one staying put in his proper place and the one with his foot in the other one's face.\" In an effort to correct the wrong that was done to him, Mr. Todd devices a plan to seek revenge. With the help of Mrs. Lovett, who owns a meat pie shop under Mr.Todd's barbershop, they set out to have \"those above, serve those down below\".I was fortunate enough to have seen the original Broadway version eight times (six with Cariou and Lansbury, the other two with Hearn and Loudon). I saw the revival with Bob Gunton and Beth Fowler, and several other concert versions.While the technical aspects in this production are lacking, to say the least, I believe that this filmed production version is the best. Lansbury and Hearn were the two best in these roles, and they have a wonderful time playing off of each other.Very good supporting work by Ken Jennings and Edmund Lyndeck. Although Betsy Joslyn and Cris Groenendaal, as the young lovers have absolutely no chemistry, and are basically unwatchable.9 out of 10","I own this video as well as the concert version of the musical with Patti Lupone and George Hearn with the San Francisco Symphony Orchestra.  George Hearn is fantastic in my book as are Angela Lansbury and the composer, Stephen Sondheim.  This musical is operatic in scope and shows much ingenuity in composition.  I certainly hope that this VHS becomes available on DVD!!  Hearn's performance is spookily sympathetic.  The one annoying performance is the young woman who sings the role of Joanna.  I believe this performance was at the Dorothy Chandler Pavilion in Los Angeles, rather than on a Broadway stage and am not sure that the minimalist set was utilized in New York, as it was in this production.  But I found the scaffolding being dragged across the stage to be quite effective to \"portray\" the streets of London.  I highly recommend this movie.","The story of Sweeney Todd evokes memories of the work of classic writers like Charles Dickens, and more contemporary writers like Edward Gory. As a musical, it naturally becomes more like the musical Les Miserables. Both deal with the grim effects of poverty in the Industrial Revolution, and the breakdown of organized society. But this musical is different from Les Mis in one very important aspect: Stephen Sondheim, the songwriter who can adapt to any style. To be sure, he's had his successes and failures, but one thing about his shows you can always count on: They will be something unique. Who would have thought someone would write a musical about a barber who slits people's throats and makes them into meat pies? Sondheim did, and he did it marvelously. The entire show is set in a factory, to suggest the ever-present catastrophic effects of the misery of those at the bottom of society, and this serves the needs of the show perfectly. The catwalks and railings are moved throughout to suggest streets and walkways and bridges. Techniques are borrowed from Kabuki and Noh, with the visual stagehands and set changes. Then, to top it all off, cast the great Angela Lansbury as the gruesomely practical and humorous Mrs. Lovett, and George Hearn, with his operatic baritone voice, as the murderous Todd, and you've got yourself a stellar musical vehicle. The rest of the cast moves smoothly through the clichés of the love story perfectly, except for Johanna and Pirelli, who sound a bit too forced. If the Johanna and Pirelli from the Broadway show could be here, it would be perfect. Hearn acts while he sings more than Len Cariou on the OBC album, and the accents don't sound as forced here. Through it all Sondheim's score never fails to underline the dark seriousness of the story. As I said, he can adapt to any style. In Follies he imitates the '30s '40s style of showtunes, in Pacific Overtures he captures the subtle art of Asian music, Into the Woods knocks off the 32 bar Disney style songs, and Assassins covers a history of American music. Here, however, he does wonders in making his score distinctly English, from parlour songs to operatic duets and soliloquies to society waltzes to Gilbert/Sullivan style patter. And yet still, the show remains deadly serious, even though it provokes more laughs than any musical comedy. In it still, is a grim warning on the evils of taking revenge. Here is where this movie makes a mistake, in cutting the Judge's solo in which he flagellates himself out of guilt for his crimes. Without it, the Judge is just a conventional villain, and this movie's point is that there are no straight villains. Both Todd and the Judge learn, too late, the horrors of having to accept responsibility for their actions, and Todd loses everything in his obsession. This is well brought out by the chilling reprise of the grim yet rollicking Ballad of Sweeney Todd, ending the show with Todd and Lovett rising from the grave to tell us that the end is the same: in a world full of Sweeneys, vengeance begets only vengeance. \"Attend the tale of Sweeney Todd. He served a dark and a vengeful God. To seek revenge may lead to Hell, but everyone does it, and seldom as well as Sweeney, as Sweeney Todd, the Demon Barber of Fleet Street.\"","The genius that is Stephen Sondheim was never more prominently displayed as it was in his 1979 \"Musical Thriller\" SWEENEY TODD, a Gothic, gory, grisly, yet delicious musical concoction about a demented barber who returns to London to exact revenge on the evil Judge who not only had him permanently exiled from London, but who is also raising his daughter as his own and plans to marry her to \"shield her from all the evils of the world.\" The barber finds love,sympathy, and assistance from a lonely pie shop owner who has her own agenda where Todd is concerned. This musical rocked Broadway and won nine Tony Awards, including Best Musical and Best Actress in a Musical (Angela Lansbury). The production was filmed in its entirety in 1982 with Angela Lansbury recreating her Broadway role as Mrs. Lovett, the daffy pie shop owner who finds a practical use for the heads that Todd makes mincemeat out of. George Hearn, who replaced Len Cariou on Broadway, is electrifying in the title role, so much so that you have to wonder why he wasn't originally cast in the role. Lansbury and Hearn are riveting from start to finish and commit 100% to their ghoulish characters aided, by a first rate Sondaheim score, probably the closest thing Sondheim has written to an opera. Lansbury shines on \"The Worst Pies in London\" and \"By the Sea\". George Hearn stops the show with \"Epiphany\" and is also compelling during \"Pretty Women\", a duet he sings with Judge Turpin, the man he has sworn revenge on. Cris Groendahl is vocally impressive as Antony, the young sailer who rescues Todd and falls for his daughter Johanna. Betsy Joselyn is a little over the top as Johanna and really pushes vocally to the point that during \"Green Funch and Linnet Bird\" she actually drives her voice off-pitch during a couple of moments. The rest of the cast is first rate, especially Edmund Lyndeck as Judge Turpin who gets to perform \"Johanna\" in this production, which was cut from the original production and Ken Jennings as Toby, whose gorgeous tenor fills the auditorium on \"Not While I'm Around.\" But it is breathtaking musical score by Stephen Sondheim and the mesmerizing performance by Lansbury an especially George Hearn that makes this night of Gothic musical theater an experience that stays with you long after curtain call. Not for all tastes, but if you're game and have strong heart, SWEENEY TODD is a joy for all music theater lovers and a must for fans of Stephen Sondheim and Angela Lansbury.","Get past the first five minutes of crap 80s focusing, and it gets good. Add Angela Lansbury at her peak vocals (at 57!) and it gets great. It's still the recording of a Broadway show so the visual isn't great compared to audio but audio is GREAT.","There is not much to say about this story. We all know it is a tale of miscarriage of justice, of sexual greed, of alienation and injustice, and of final revenge that turns sour. This is a typical Victorian story in the line of Jack the Ripper and so many other crimes of that type, and I should say multiple killers or serial killers one century before the FBI invented profiling.This particular production is special since it is a Broadway production of the musical that Tim Burton brought to the silver screen many years later. This particular production was actually brought to TV a long time ago and it is this TV version that they remastered and brought to us in this format. The sound is perfect of course since in the 1980s FM sound also call hi-fi sound was already arrived. The pictures are good though from a TV standard, probably professional, probably Betamax. The remastering was only used to clean up the sound and probably too to densify the resolution. So we can consider we have the best possible rendering of this old production.The interest is to have a stage production from Broadway and from a period when special effects were not yet the norm on the stage. The stage production was supposed to create emotion in the spectators and they mostly only had human means to do so. They only wrapped up the human means in a stage setting that could increase or decrease the realistic effect. They chose to break up that realistic effect with the systematic use of machinery visible to the audience. Constantly elements, some enormous, are moved on the stage, turned around more or less building up structures that are supposed to render the various locations and the various scenes. It is totally artificial and it works perfectly because of the other dimension which is used in the most genial way imaginable.This other dimension is the use of actors, singers and \"dancers,\" in one word stage performers. The music is good but we do not see the musicians. The singers are not opera singers but musical singers and they are good not so much because of their voices but because they use their voices as one element of their performing. That performing is physical and the voices are part of this physicalness. The voices, the physical performing on the stage (movements and other physical contact or absence of contact) and the phenomenal body language and facial expressions, it all is extremely effective to create emotion and density. The situations are deep and heavy because of this performing qualities. It is what has slightly been reduced in the most recent period by the use of special effects. In those old days special effects were hardly available and the actors had to work with their bodies, voices and faces to create those emotions. And that was a time that has unluckily mostly disappeared.In this case we have a real masterpiece because everything is looking artificial and yet the emotions look extremely realistic. That's a stage directing choice that was more or less the only solution at the time if the stage director wanted to produce an emotional and powerful show. This is a real success along that line.Dr Jacques COULARDEAU","This is the Sweeney Todd to watch. I first watched the Tim Burton version back when it came out and I liked it; it wasn't one of my favorite movies but it wasn't a stinker either. It wasn't until a few years later I knew what I was missing.After watching this version, you can never go back to that Burton garbage. Would you eat at Taco Bell after tasting food at a REAL Mexican restaurant? No. The first time I fully-understood the story was with this 1982 taping. The Burton adaption was a jumbled mess with many things cut out and many miscasted actors (Helena Bonham Carter being the worst one). Sacha Baron Cohen actually did a remarkable job though.Anyway, this review IS for the 1982 version, so I'll stop trashing the newer one. In my opinion, George Hearn performs Sweeney better than Len Cariou originally did, but that's just an opinion. Angela Lansbury adds lots of character to Miss Lovett, making her weirdly lovable. Ken Jennings (not to be confused with the high-neck Jeopardy geek)also reprises his role as Toby from the original show as does Edmund Lyndeck as Judge Turpin. Everyone does a remarkable job, however I know a lot of people hate Johanna's singing. But if you stop and think she's asking the birds how THEY sing wonderfully when trapped in a cage....so I suppose she's not supposed to sing well. Cris Groenendaal is wonderfully cheesy as Anthony and was much more likable than that young prissy guy they casted in the Burton movie.This show is NEVER boring. If you found the Burton movie confusing, I suggest you watch this. It's truly a treat to watch; you'll see why this has an 8.5 score. Hopefully they'll release it on BluRay so we can attend the tale of Sweeney Todd in HD!","I am not a fan of Broadway musicals but I can say without a doubt that Sweeney Todd: The Demon Barber Of Fleet Street is certainly my personal favourite. Why? Well I think the story is pretty good and some of the music is the best I've heard in the genre. I saw the Tim Burton blockbuster made a couple of years ago and I thought it was okay but then I discovered this version which is considered by many to be the definitive version to watch and... I agree.The plot in case you don't know is that a barber named Benjamin Barker, alias Sweeney Todd returns after 15 years of being shipped away wrongly because a courtroom judge wanted his wife. He goes to where his establishment was but finds it an unsuccessful pie shop and the owner named Mrs Lovetts tells him that his wife took poison and Judge Turpin raised Sweeney's daughter isolated from the rest of the world. Determined to get his revenge Sweeney establishes himself as a good barber to the rest of London. However, after a rival Barber who recognizes him threatens to blackmail him Sweeney kills him. This sets the idea in motion that, because meat is apparently expensive that if anyone comes in alone to Sweeney's barber shop that he should kill them and Lovetts serves them as pie to the public and they shall set their business going (or... whatever you want to call that!) until the Judge enters looking for a shave.The acting is amazing. I have never heard of George Hearn but he was the highlight of the show with his performance as Todd. I mean he plays the role coming off as downright psychotic in some scenes but in others he could come off as downright normal. His singing voice is also really really good. I could also say all the cast members are very very good. I would only bring up three exceptions - Judge Turpin (I mean he DID come across as a creepy old bastard but I just think his singing voice strikes me the wrong way), Tobias (I know they couldn't get a little kid to do it especially in a story this dark and twisted but even then I didn't really like the performance, mainly for the same reason as the Judge, something about their performance strikes me the wrong way) and Joanna but that maybe because she's my least favourite character in the entire musical.As far as the production goes I think the orchestra did a really good job and I also liked that it wasn't just the rotating set that was on the stage when I saw it live. I mean if you know what I'm talking about then I know that thing wouldn't be easy to make but I did prefer people rushing out and bringing the stuff in and out that's necessary to that part of the story. Just call it personal preference - either way for a stage production this is really good production design.I really don't think I can say anything else because I've covered almost everything. I would say if you're a slight fan of the Tim Burton movie or like the Broadway musical and haven't seen this I suggest that you check it out. I haven't seen many adaptations of Sweeney Todd but I think after this I won't be able to top it... still, I'm going to check them out anyway.","I don't think I can add to the praise given to this wonderful production. The musical itself is a masterpiece in its own right, and I honestly loved this production. I loved the darkness and bleakness of the sets, and that while the costumes are nothing fancy they are effective and nice to look at. The score is utterly magnificent, the music is completely memorable and the lyrics are something that I love to quote, the opening chorus, the epiphany, Green Finch and Linnet Bird and the ending stand out especially. The dialogue is darkly humorous, the story is suitably macabre and entertaining and even the make up is good.The performances, both acting and singing were superb. The only person I had a problem with was Betsy Joslyn's Johanna, I just found her singing shrill at times and there were a few moments in Green Finch and Linnet Bird where she was pitchy. Joslyn aside, George Hearn is superlative as Sweeney, funny, chilling and handsome, and what a voice. His Sweeney is by far my favourite Sweeney ever, and the great Angela Lansbury matches him perfectly as Nellie Lovett. Cris Groenendaal was a charming Anthony, and Edmund Lyndeck stands out in a considerable way as Judge Turpin. Even the chorus were great. Overall, if you love Sweeney Todd, this is a must see. 9.5/10 Bethany Cox","I finally got hold of a DVD copy of this production and was agog with curiosity, since I had read so many people praising it to the skies, particularly Angela Lansbury's portrayal of Mrs. Lovett. I saw the Tim Burton movie a few months ago and thought it over the top and overly bloody; thankfully this version is not so horrifying gory but it suffers dramatically in too many other ways for it to be in the least satisfying to me.To begin with, the casting. George Hearn is adequate and at least shows some expression (as opposed to Johnny Depp's unending wooden face in the movie). Angela Lansbury is, quite simply, annoying. At least she has enough power in her voice to get the point across as opposed to Helena Bonham Carter's piping and expressionless little girl's voice, but subtlety seems to be only a word in the dictionary to Ms. Lansbury. One cannot be drawn into the story when one of the main characters spends her entire time mugging and winking in a \"look, Ma, I'm acting!\" fashion and being far too aware of the audience. This is not something that is typical of stage productions, heaven knows--I have been a regular attendee of many productions at the Stratford Festial for many years and stage actors do NOT behave in that fashion as a rule (at least those who want to continue to find regular employment do not!)...Betsy Joslyn. Oh dear, oh dear, oh dear. Did anybody besides me notice that she can't sing this role even vaguely appropriately? And her playing George Hearn's daughter is just creepy, considering that she was married to him at the time. Isn't she supposed to be a sweet little sixteen-year-old? Yes, I realize that this is what acting is all about, but not once did she convince me that she was any younger than about thirty-five, and the phrase \"mutton dressed as lamb\" seems to have been coined just for her. Her butchering of \"Green Finch And Linnet Bird\" had me gnashing my teeth and ready to turn off the DVD player at once. That song was done so well in Tim Burton's movie, and this was a sad shock. The song requires the vocal range of Julie Andrews in the 1960's and a purity of voice that is only comparable to that of a boy soprano. Any vibrato at all kills it dead, and Ms. Joslyn spent the entire time warbling so hard that I thought she was about to fall off of her ladder because she was trembling so much from the effort at sustaining coloratura notes with a voice that is a mezzo at best. Let us pass over the spectacle of her vibrating at least a quarter tone flat on at least three of the higher notes... This is quite simply not a coloratura role and perhaps a discerning director should have told her that--but the fact that she was married to the star might possibly have tied the director's hands.Cris Groenendaal was adequate, but again obviously far too old for the role and there is zero chemistry between him and Ms. Joslyn, which makes the whole subplot fall completely flat. I am reminded a little of past stage productions of Wagner's Ring cycle where, due to the vocal power required for the singers to bellow over the sound of a full Wagnerian orchestra they would have to cast based upon ability to penetrate vocally as opposed to any appearance or acting ability or even a good voice, which is why you have the caricature of the massive mountainous Viking-horned Brunehilde with a triple chin and a beard, when the libretto calls for an ethereal beauty who is eternally young and bewitching. The casting of the \"juvenile\" leads is exactly like that--if you close your eyes you can almost believe in Mr. Groenendaal's Anthony, but as soon as you look at the screen the illusion is shattered. (And at NO time can you ever believe in Ms. Joslyn's Johanna...) For me, the rest of the production was completely lost because of three out of the four major characters were so obviously miscast. I cannot give a proper review of anything else because they were so distracting that they spoiled the rest of the production. I really can't understand why people rave about this badly-shot and self-conscious filming of a stage play. Surely there's more to camera work in the theatre than just plunking a camera down in the front row? If I want that, I'll go to a decent play, preferably at the Stratford Festival, where at least they work together for the production and aren't constantly mugging for the camera. I give it three stars only because the quality of the production apart from the antics of Lansbury and Joslyn seems adequate if not spectacular.Probably the best thing one can do is buy the soundtrack of the film and a cast recording of this play, and then combine the two to make a bearable whole. That's what I'm going to do, and try to forget that I ever bothered to rent this wholly unremarkable production.","Some aspects of this production are good, such as the performances of Angela Lansbury, George Hearn, Cris Groenendaal, and Sal Mistretta.  But am I the only one who is distracted by the horrible performance by Betsy Joslyn as Johanna?  She is terrible!  She slauters the songs with her screechy voice and overacts in a role she clearly doesn't understand.  I also think the chorus isn't up to snuff.  They drag the tempo and make the worst facial expressions.  Overall, I think this production is okay, but Sweeney Todd can be so much more if done correctly.  This production doesn't come near the level this material demands.  The concert version with George Hearn and Patti LuPone is much better.","George Hearn's performance is a bit over the top. Compared to Len Cariou, who created the role for the Broadway musical, and who can be heard on the Original Cast Album, he's pretty much a Warner Brothers cartoon character, and that is after you subtract the exaggerated stage makeup everybody is wearing so they can be seen clearly from 300 feet away.The 1982 video is a good piece of documentation for the musical, but it's not really playing the musical to its strengths, since it lacks the enormous mechanical sets, the full orchestra, and the real sense that early Industrial Age England was like a huge, oppressive machine, chewing people up and spitting them out, all of which were present in the original stage production at the Uris (now the Gershwin) Theater.","I saw this originally with Len Cariou and loved it but the filming doesn't capture the what live theater imparts. I honestly didn't care about the ingenuity of the staging; the physicality of the principal players was distracting. The 'youth', Chris Groenendahl had a nice voice but towered over the Judge and the Beadle and the idea that he was frightened by them was ludicrous. Joanna looked much, much too old and was not the figure of a fair maiden. When she sang \"Green Finchet And Linnet Bird\" I wanted to turn the sound down. Angela Lansberry played this as if she was informing the entire theater and it seemed too much overdone. This was a badly done filming and the defects overwhelmed any good points.","This has the feeling of going to the theater and seeing it live. That is because this is exactly what they have done. Because of that it is very good and is not done often enough. There is a silent live action film of Peter Pan done before Disney animated the story which was filmed much like the stage play that was originally done, and it is one of the best adaptions of that story because it was filmed that way.Sweeney Todd is about a wild murderous Barber and has a great Steven Sondheim musical sound track. All of it is here and lots more. The live stage feel is a great perspective and it is invaluable that this television version was done.Angela Lansbury recreates her Tony winning role here and is absolutely great, this shows why she won that award. The actor who plays Sweeney Todd is excellent at it, so good he has done it several times since this version. This show first came to my attention because of the great music. Now that I have seen the story as done here, I better understand the meaning of the music.TCM has done a great service by running this without the commercials except for the Intermission break. It is the best way to see it as the commercial breaks are not needed."],"review-user":["MdnightRadio7L","Kate-98","peacham","irishbasterd1","leadies","bekayess","Phil_H","gws-2","Coxer99","gws-2","Scars_Remain","alfiefamily","bratsche2","Will_Scarlet","ijonesiii","MikeGMitchell","Dr_Coulardeau","udrivemenutty","WakenPayne","TheLittleSongbird","keenan-1","fcouckey","adamantius","tireless_crank","DKosty123"],"review-date":["7 June 2000","31 December 1999","15 October 1999","9 October 2001","14 April 2004","15 May 2004","18 September 1999","2 November 2001","15 March 1999","28 April 2004","14 February 2008","14 October 2005","10 August 2003","15 December 2003","18 January 2006","7 April 2018","20 November 2015","31 December 2014","26 July 2014","11 May 2010","14 August 2008","29 July 2004","22 February 2004","21 March 2017","7 July 2016"],"review-rating":["10","10","10","8","10","8","10","10","8","9","10","10","9","9","10","10","9","9","3","3","4","8"],"review-title":[" Incredible, INCREDIBLE show\n"," Wonderful score and a WONDERFUL cast\n"," Musical Theatre doesn't get better than this !\n"," Brilliant\n"," Macabre Theatre at its' best\n"," The only SWEENEY TODD to watch\n"," Perfection in theatre.\n"," George Hearn: The Definitive Sweeney\n"," Sweeney Todd\n"," A great production of a great show spoiled by aging technology\n"," Attend the Tale...\n"," Perfect performances and classic Sondheim score\n"," My favorite musical\n"," Edward Gory & Charles Dickens meet \"Les Mis,\" meet Stephen Sondheim.\n"," Sondheim's Masterpiece\n"," Pretty good\n"," Superbly emotional\n"," God That's Good!!!!\n"," My, that was a close shave!\n"," Wonderful production of a truly great musical\n"," Completely spoiled by miscasting.\n"," AM I THE ONLY ONE??!!\n"," George Hearn\n"," Good as an aide memoire for those who have seen the live production\n"," RKO Does This Very Right\n"]}