{"review-url":["http://www.imdb.com/title/tt0078477/reviews"],"review-text":["I read the above comment and cannot believe it! Of course its a children's movie, its an adaptation of a children's book!! This film IS easy to get a hold of, try play.com or amazon and its very easy to gain a copy! The jokes are hilarious for kids and adults alike, and the adventure is clean with no violence! Its completely suitable for children of all ages! The songs are fab, and yes, a little repetitive but thats what children need and whilst watching it my little ones were heard singing \"hi hi cocalorum\" all night! They loved it, a story of innocence and friendship! Very lovely and well worth watching for kids and adults of all ages!","I saw this movie as a child and fell in love with it. It has a sweet sensitive story. Something children can appreciate. I loved so much as a child I had to find it for my daughter. It is definitely a movie I would watch with kids. It reminds me a great deal of story's of a Disney nature like Pete's Dragon and Mary Poppins. Both because of the live action and cartoon features but on its premise. It is also a good story to show kids that if they tell the truth they can be trusted and adults will listen to them. I think all kids should see it and would enjoy it. It is such a break from the violent movies of bad taste so many kids watch these days. It has all the charming qualities so many of today's movies don't have.","I was wandering through my local library, browsing VHS tapes, when I saw a movie that made my mouth drop--Waterbabies.  I have been hoping to see this movie again--it's been over 22 years since I saw it (cable-movie channel around 78-79).  I had recalled a good many of the details--Grimes in particular.  My son, who is 4, and I watched it.He agreed with me that Grimes was \"Not nice\", and the best way for me to describe it was that he didn't love Tom.  He accepted that.  It was amazing that I still recalled some of the songs, too!  They had stuck in my head for 22 years--which means they had to have some memorable-ness, eh?It's a good child's movie, with parental guidance in case of questions about what children had to go through that were not nobility/society in the time-frame.  This is what all the children faced daily (except for a few lucky ones), and while we try to Disney-coat movies, making them more pc for children these days, it doesn't mean that cruelty didn't exist--or even still doesn't.  I enjoyed the animation.  It wasn't Disney, no.  I don't think Don Bluth touched a paintbrush on this movie.There's a lot going for it, though. David T plays two roles!  (I really like him!)  James M does too.  The waterbabies themselves are cute.  You feel sorry for Tom, and root for him.  Then Billie herself is extraordinary in the multi-role part she's playing--it's as if her eyes ARE magickal!  I'm a huge fan of WoO, TLW&TW, and company (AND LOOKING FORWARD TO HP!), and I filed this along with those kind of movies.  Yes, he jumps in the water, but not because of suicide.  He jumped because he trusted the lady in black--she'd been appearing to him all along.I think it's a good movie!  If you have kids, pick up a rental copy.  If you happen to locate a buy-able copy, let me know where!  Ian liked it! :)Dee","I remember the first time I saw this movie I fell in love.  My parents taped it for me so that I could watch it over and over again. I actually still have a copy of it on an old BETA tape.  Unfortunately, I watched it so much that I ended up pretty much wearing the tape out.  Okay, so compared to the animation and acting of today, it can't compare but it was made in '78, what do you expect?  Animation and film have come a long way since then it's not going to be like the films of today. All I have to say is that it's a good family movie that I will always enjoy.  If you like classic movies, I would recommend this one.","Wonderful songs, sprightly animation and authentic live action make this a classic adaptation of a classic tale.  A nice British feel which sets it apart and above from the standard, saccharine sweet Disney cartoons.","Water Babies is a Victorian tale about a very young chimney sweep named Thomas (Tommy Pender) who becomes a fugitive from justice after being falsely accused of stealing the silver. Fearing the gallows (the punishment in those days for thievery), he jumps into a river, drowns, becomes a water baby and embarks on a series of adventures. For many people, this film was very childish, farcical and generally not good. Admittedly, it is not a great film by any means. Director Lionel Jeffries did far better with \"The Runaway Children,\" but this film has its charms.To begin with, Lionel Jeffries depicts life in Victorian England far more effectively than Franco Zefferelli ever did in Jane Eyre. It is one thing to dress actors in Victorian costumes, create sumptuous looking sets and have everyone speak in aristocratic accents, but quite another to bring the spirit of the Victorian age to the screen. Lionel Jeffries has a gift for doing that, whether it is with the scene in the pub where Tom is subjected to physical abuse and then given hard liquor by Mr. Grimes (James Mason) and Mr. Masterman (Bernard Cribbins) or in Hartover Hall, where we see the supreme pomposity and confidence exhibited by Sir John Hartover (played very well by David Tomlinson). The surreal touches are also very interesting.Now the bulk of the film is animation. Many reviewers have criticized the animated part for its poor graphics. No doubt, they are right. But this is my point -- who cares? Maybe I am old fashioned, but I did not care when they improved the graphics for the Nintendo games or when they combined computer animation with the older animation for the movie Alladin. That apparently matters to some people -- usually the kind of people who complain about the texture of food. But for me, as long as I can see the pictures on the screen, I am content. The bigger problem was with the songs, which children will find enchanting, but which I (and probably many adults) found childish and a waste of time.But with that said, this film has enough charming, good natured and funny characters to delight even adults. Characters like the lobster, the sea horse, the sword fish, the Krakon (whose bark is worse than his bite), the walrus, the polar bear and even some of the water babies (when they are not singing). Elly (Samantha Gates), the niece of Sir John, is also a delightful sweetheart.","This is a movie that I watched when I was a young girl and never forgot. It is certainly not the best movie ever made, but there is something very special about it that I can't quite put my finger on. I LOVE it. I am the kind of person who likes everything explained to me though and for that reason alone this movie drives me crazy. Exactly what/Who is that mysterious witch-lady and what is her relationship with Tom? WHY and HOW did he become a Water Baby ... why was he raised on the earth? It is questions like these that are just eating at me! I thought if I read the book I would get answers, but I just read an article that the book from which this story is \"based\" is a lot different. So I guess I'll never know what the writer was thinking! I still love this movie though and I recently watched it with my two year old niece. She loves it too although she insists on calling it \"Baby Water\" for reasons unknown to me. She loves the part where he jumps in the water and then declares \"I'm all clean.\" (You have to understand that my niece is the cleanest 2 year old in the world!) We watched that scene over and over. I am so glad that we can enjoy this film together! There should be more films like this. (But what is up with the gay seahorse??!!)","I absolutely LOVED this movie as a child. I can't seem to find it anywhere! I was mentioning it to some friends just the other day, and not a single one of them remembers it! Can anyone help me out? My older sister vaguely remembers it. There was also another movie I remember that was half live action and half animation, but I can't remember the name of it. The characters were animated and the background was real...I seem to remember it being about a kangaroo, and I believe the setting of the film was in Australia. I'm going out of my mind trying to obtain copies of these films that were such a memorable part of my very enjoyable childhood. Edit: I searched IMDb for this other movie and found out it's called Dot and the Kangaroo! All I had to do was type in \"kangaroo\" in the search bar under characters, and the name of the movie in the list was like a bell going off! MAN, I love IMDb! Thanks!","Very resistible but ultimately harmless film version of the children's literary classic which incorporates an animated portion in the style of MARY POPPINS (1964) and BEDKNOBS AND BROOMSTICKS (1971). The human cast is very distinguished - James Mason, Billie Whitelaw, David Tomlinson, Joan Greenwood, Bernard Cribbins - but their roles range from the miscast (a 69 year-old Mason as a thieving chimney-sweep!) to the inconsequential (Greenwood as a befuddled aristocrat) to the bizarre (Whitelaw plays several 'exotic' characters - including a circus performer, an old hag, a maid and a fairy - for no apparent reason).The animated segment of the film, handled by a group of East-European animators, is hardly inspired but mildly enjoyable in itself and, as usual, with this type of thing, there is an assortment of songs one has to put up with, one of which in particular is reprised far too often for its own good. The film was directed by noted character actor Jeffries who had previously directed (far more successfully) other children's films namely THE RAILWAY CHILDREN (1970) and THE AMAZING MR. BLUNDEN (1972; which I've yet to watch myself but which was released some time ago on R2 DVD by Anchor Bay UK).","I was 12 when this film was released and adored it. The song's were inspiring and it made me feel good, watching it several time's at the cinema. I actually had the soundtrack album and played the song's over and over.26 years later...I'm ashamed. Just sat and watched it with my 2 daughters who enjoyed it lot's but my cynical older grown up eyes hated it. It's very poorly directed in many places and considering it was Lionel Jeffries directing I really wanted to enjoy it. The character animation was so rough yet the backgrounds were quite good. I remember the critics at the time saying that it was a poor film and was horrified but now I agree.It is an old film yes, compared to what can be achieved now, maybe that's why I thought it was good then. But that does not excuse it for it's poor acting, directing and sloppiness. The main child actor's voice seem's dubbed which is very distracting too. Can't quite see what they were trying achieve when it was being made, all that it become was a weak film.","this is a dreadful adaption of Charles Kingsley's story. The animation is, to put it bluntly, awful. And the songs are a disgrace to film songs, epsecially the \"high cockororim\" song, which they keep repeating. I feel sorry for Jon Pertwee and David Jason, 2 of Britain's finest talents, providing the voice for the depressing animation sequence. Bernerd Cirbbins tries his best to perform in this awful production ,but fails.Avoid this film at all costs, even if it is the last film on this planet!","I loathe, despise, and hate this film with a passion that makes the red hot gates of hell look cold by comparison. it's nothing but a campy, frightening, and completly shoddy trip down memory lane to that oh-so-nasty time, the 70's, a decade im glad i wasnt a part of if this absolute trite is all that was on offer!the animation is sickeningly dated, not least of all with it's tacky, missing frames, and characters with huge, bulbous heads, this film is an eye-sore. from the knowing, snide nod to the parents with the freakily gay sea horse, and it's camp hand motions and kenneth williams-esque voice, to the overtly, unsubtly druggy anthem, High Cockalorum, this film, im sad to say, is one that was forced upon me as a child and i have never fully recovered from the terror it caused me....This ghastly display of complete terribleness should carry an R rated certificate, so disturbing it is in it's contents!","How times have changed. When this film was made in 1978 its content was deemed perfectly acceptable for children.Set in the Victorian age, it features a young child, Tom, who is beaten and forced into slavery by his two masters, most notably Bernard Cribbins as Masterman, and is often to be heard uttering exclamations such as the one above. His life is so horrific that as he passes through a town square (with a bare-knuckle fist-fight in full flow), his only escape is to drown himself. That's right, a children's film where suicide is seen as an acceptable form of salvation.Once underwater things get a little less entertaining, as the voices of David Jason, Una Stubbs and Jon Pertwee combine with an unconvincing animation to tell the story of Tom's destiny as a \"water baby\". There are four or five songs throughout this segment, though they are chiefly forgettable, with only \"Hicocalorum\" managing - just - to remain in the cerebrum a day after viewing.Tom emerges from the lake and it all comes to an end, with the revelation that a deformed old bag woman was his guardian angel. Well, at least it didn't adhere to traditional stereotypes and managed a PC characterisation ahead of its time. And the film? Hopelessly dated, and with vastly inappropriate elements for a family movie, it contains a perverse sort of enjoyment.","I first saw this film when I was about 6 ish - my grandma thought it'd be a nice kiddies film to entertain me and keep me occupied....however, every time I watched it I had nightmares the same night. Yes it masquerades as a kids' film, but even now I find it really dark in places, particularly the haunting music that is played each time the guardian angel woman is on the screen, and her rather hypnotic eyes and voice. The actual \"baddies\" of the film, ie the sharks, Mr Grimes etc didn't scare me at all, I just always found the whole film rather creepy and dark. This is obviously something I can appreciate now that I'm 21 years old, but speaking from experience there is no way I would show it to my kids!","When you start fast-forwarding, you know it's bad.I picked this movie off of Netflix expecting it to be a pleasant children's cartoon. Thankfully I have learned to pre-screen things, because this movie was absolutely terrible.Human misery, death, and suffering are not my idea of a children's story. This movie basically starts with a homeless woman begging for money for her newborn baby so they won't starve. We are then shown people stealing, beating each other, cheating, and human excrement being poured over food--all before we meet the men who are abusing our hero, Tom.All of this, meanwhile, is live-action. You have to sit through about twenty minutes of this awful display of inhumanity before you finally get to the cartoons you thought you were getting when you started, and then there's another 20 minutes of live action at the end, making for half the movie. I don't know about your kids, but when my kids want a cartoon, they want a cartoon. Not a bunch of folks wandering around London getting typhoid.The live-action plot then drags on and on with more of the cruelty. Finally Tom jumps in a lake and is--for no reason ever explained in the movie--transformed into an animated \"water baby.\" I suppose that's a bit nicer than saying \"Hey kids, he committed suicide and drowned.\" He makes some friends, sings some songs, encounters some random enemies, and finally finds the other water babies. This is the good part of the movie. But then the other water babies are randomly kidnapped, and Tom must go on a quest to save them.Tom then returns to the human world, where he is again abused and you wonder why he doesn't just kick someone in the groin already and run off. Finally he does stand up for himself, the bad guys are arrested and he achieves a Dickensian happy ending, which honestly I never did quite manage to understand (did rich people just adopt random street urchins?) and we learn that several creepy ladies who've been appearing randomly throughout the film are actually the same person, which doesn't actually add anything to the plot or make any sense.As a parent, I have seen plenty of bad children's shows. Heck, I've endured Barney the Purple Dinosaur. But this movie takes the cake. Yes, Victorian England was a terrible place in which children were abused and death might seem like a reasonable escape. This does not make it 'entertaining', for me or my children.","I watched this film from childhood - perhaps one of the first I ever saw (released when I was born)...I'm surprised it's marketed as a children's film, there are many aspects of this film to which children should be ignorant. The best actor by far is David Tomlinson, never failing to bring a smile to my face. As for the rest of the cast - Very odd indeed.I would not recommend this film personally. It looks dated, and the songs are pretty repetitive. I suggest Mary Poppins or Bedknobs and Broomsticks for children. Also, it would be difficult to locate this film nowadays, it never was released on DVD to my knowledge. The above films present a far more relaxed environment: With this film, it's hard to tell. I can tell that I am not the only one that feels this way about the film, but I still respect it, as I watched it at childhood and it was the first \"scary\" film I ever saw!Five out of Ten.","Classic author C.S. Lewis once wrote an essay stating that no children's story is worth the reading, viewing etcetera if it can only be enjoyed by children. I'd say this film is an easy one to hold up as a defence of his argument.Around the age of five or six, I loved it, tracked it down only three or four years later and found it to be wet, poorly animated, dully and confusingly written, and with distressingly repetitive and awful songs (I'm looking t you, hi-cockalorum), showing a production aiming at joyful silliness and whimsy, but resulting with an ugly, twee, frustrating mess.By all means, show this to your infant, but I would heartily recommend that you don't buy a copy or attempt to sit in on the viewing. If you want something set in the same era but with genuine charm and wit, go after 'Oliver Twist' or the BBC's brilliant adaptation of 'The Box of Delights'.","I loved Lionel Jeffries as an actor from when I was a young teenager. As CPO Sidney Kraut in Two Way Stretch he was nothing short of brilliant, stealing every scene from no less than Peter Sellers, Quite simply, he was a talent of surprising versatility best known for comedy but also with a a portfolio of character roles.His directing career started off like that of Orson Welles.... The Railway Children is simply in a class of its own, an outstanding film that appeals to the whole family but without patronising in any way.The Amazing Mister Blunden was not as good but it's still worth a look.So how the blazes did he end up directing dross like this? Did he need the money? I would like to think that, beyond directing the film, he didn't play much of a part in the production. The original idea, the (dreadful) script, the pitching of it to the investors.... please tell me it was all done by somebody else. Because this film is a crock. And just look at the cast. James Mason, Billie Whitelaw, Bernard Cribbins and the voices that you never get to see are pretty much a Who's Who of British acting talent of the time. Quite extraordinary.Anyway, to the film. I really didn't like the child actor in the lead role. He's an ugly little brat with too much hair and a nasty voice. And he's in every scene for the whole 105 minutes (and, believe me, it seems a lot longer). And, much as I admire James Mason and Bernard Cribbins neither of them are going to be pointing at this as a piece of work that they are proud of. The animation is poor, and the less said about the quality of the musical score the better for everybody.All in all, it's pretty damn poor, and a blot on the CV of the great Lionel Jeffries.","In 1850 in Yorkshire, a boy chimney-sweep is falsely accused of theft by his crooked master and runs away. He falls into a treacherous local river and is transported into an underwater realm, where he makes many friends and rescues the mythical Water Babies from an evil shark.Based on a book by Charles Kingsley, this is a lovely children's film, half live-action and half animation, which is both a grim and evocative depiction of Victorian times and a terrifically enjoyable undersea adventure. It really is two films in one, which somehow complement each other and combine into a much richer whole. The animation by Tony Cuthbert, Jack Stokes and Miroslaw Kijowicz is wonderful, as is the photography by Ted Scaife and the music by Phil Coulter and Bill Martin. Pender has a great rough-diamond quality as the (literal) fish out of water - I love the moment when he's on top of the mansion, sees all the chimneys and shouts \"Blimey !!\" at the top of his voice. Mason and Cribbins are the filthiest, nastiest bullies you could hope to see in a costume drama (if you want to see real Victorian values, don't watch Sense And Sensibility, watch this), and Whitelaw, Pertwee (who does umpteen voices) and Percival are all excellent. This is how a good children's movie should be - good old singalong fun, but also just a little bit thoughtful, sad and frightening. High Cockallorum !!","I can't tell you how much I loved this movie when I first saw it in 1981. The cable went all fuzzy and I watched the last 20 minutes through squiggles.  I was heartbroken because I could barely make out the happy ending.I was so excited to see it on DVD and was thisclose to buying it.  But money is tight, and I discovered my library had a VHS copy, so I restrained myself.  Yeah me.Cuz this is one rotten movie.  All kinds of rotten.  I think a grown woman was dubbed in over Tom.  The 'special effects' aren't special or effective, mostly stupid.  The animation is dull.  The acting is bad.  The songs overwhelmingly forgettable.  The dialog and pacing are painful.\nWho knew I had such bad taste when I was eleven?  Learn something new every day!","Oh my god.. i still have that song in my head after all these years!!!\nI remember seeing the Waterbabies when it was on the then new Home Box Office.... when I was about 9 or ten!I don't remember much else but that song!It seemed a good movie at the time to me but I was a kid.. maybe i should venture to watch it again :)brandy","OK. Who ever invented this film hates humanity and wants to see them all slit their throats. This \"film\" was absolute and utter filth. What the heck was up with the weird old bags eyes? Seriously, was she on some sort of horrible drug and then she like just thought she could control people? She was running around with her freaking evil eye and it was like what? Do I have a booger hanging out of my nose? What are you staring at? Are you like the sea witch or something? All and all though I thought the graphics were top notch old chap. For that alone I would give it a ten. But just cover your ears when you are watching it. The pure and complete evil that comes from that film will make your ears bleed and your eyelids fall off. Who knows? You might even get a knot in your small intestine. You better watch out fools.","This movie really is not what it would appear to be. A delightful children's animated fun-time is what you'd expect. This is not what is delivered. No one should watch this movie at a young age, because it will freak you out as much as 35 years later. I watched it at an early age, and now...roughly 16 years later or so....still freaked out a bit. You go from feeling very sorry for this kid who always has dirt on his face, to being scared of Mr Grimes, to receiving mental scars from the image and sound of the scary woman whispering \"run boy\" as her face is imposed over the normal footage, to thinking that maybe it's a good idea that we go animated from now on, to wondering what's up with that weird crab, and finally to trying to de-code the message on the cake at the end. It's all very odd. Maybe it's not really that scary. Maybe I was in a weird phase of my life at age 6, and this phase tainted the wonder of The WaterBabies. I guess you can judge for yourself, but only if you're over 18. Thank You.","THE WATER BABIES is another vibrant children's adventure film directed by the one and only Lionel Jeffries and made to directly reference MARY POPPINS and BEDKNOBS & BROOMSTICKS. This one's based on the forgotten-about Charles Kingsley novel and feels very Dickensian at the outset, with a young chimney sweep accused of theft and forced to go on the run. The first half of the film is live action and brings to life the Victorian era in an able and enjoyable way, with a wealth of actorly talent - including Bernard Cribbins, James Mason and David Tomlinson - around to add to the fun. Things slip a little when this becomes an animation, feeling rather Disneyfied, although the low-fi style of the animation is quite endearing. It's not THE RAILWAY CHILDREN but for kids it'll do the trick.","The 1978 adaptation had all the ingredients of a potentially wonderful film. It is based on an absolutely charming book by Charles Kingsley. It has a truly talented cast from the likes of James Mason, Bernard Cribbons and David Tomblinson, not to mention the vocal talents of David Jason and Jon Pertwee. There is also Lionel Jeffries, the director of wonderful classics such as The Railway Children and the Amazing Mr Blunden, and while the film is good on the most part, it was also a little disappointing. I had no problem with the performances, particularly those of Mason and Tomblinson as Grimes and Sir John Harriet respectively, and Tommy Pender and Samantha Gates are believable as Tom and Ellie. Billie Whitelaw is also intriguing in numerous roles, even if one or two of them are quite bizarre. The voice cast is also commendable, especially Jon Pertwee, voicing charming characters in their own right. I also liked the incidental music it is so haunting and beautiful, and the script was fairly faithful and in general well-written, particularly at the beginning. The characters, especially the Water Babies are very charming, and the villains are sinister and funny at the same time, I loved the part when Tom and his friends help the Water Babies escape, seeing the shark chasing the electric eel with an axe was very funny. However, I will say the film does look dated, especially the animation sequences, the live action parts weren't so bad, if you forgive the rather dark camera-work. The character animation was rather flat, and the backgrounds sometimes were a little dull, though there were some nice moments, like the scene with the Krakon and of course the first meeting with the Water Babies. I also had mixed feelings about the songs, the Water Babies's song was beautiful, but I found the first song forgettable, when Tom ends up underwater. Hi-Cockallorum is an example of a song, that is like marmite, you either love it or hate it. I personally don't know what to make of this song, it was fun to listen to at first, but once it's in your head, it is perhaps annoying. As much as I like Lionel Jeffries and his films, his direction just lacked the wonder and the magic it usually does. All in all, certainly not a terrible film, but could have been better artistically. 7/10 Bethany Cox."],"review-user":["melop","koalityme","gypsycaine","tiburon0134","gben","jonathanruano","boisenewbie","jbangel78","Bunuel1976","cinema-louise","andynortonuk","Catscanfly","The_Movie_Cat","sev127","hjones-170-894487","Quackle","pcu3brg","jd-116","ShootingShark","temo","target-4","tezzahorse","tahota49","Leofwine_draca","TheLittleSongbird"],"review-date":["11 November 2005","30 November 2004","5 August 2001","18 April 2004","10 November 2003","20 February 2009","4 September 2006","19 July 2005","2 January 2007","28 December 2004","20 August 2002","29 February 2004","18 December 1999","16 May 2005","26 September 2011","18 June 2005","4 October 2005","26 September 2013","21 August 2005","31 July 2003","1 February 2003","15 October 2006","14 October 2004","25 August 2018","29 June 2009"],"review-rating":["9","10","10","10","6","7","7","4","3","1","1","7","5","1","3","7","10","6","7"],"review-title":[" Good all round film!\n"," awesome\n"," A memory from childhood\n"," Brings back childhood memories\n"," Classic\n"," Water Babies\n"," I Love this movie ... even though it is far from perfect\n"," Does anyone know where I can find a copy of this?\n"," THE WATER BABIES (Lionel Jeffries, 1978) **\n"," Captures children's imagination but NOT adults.\n"," ghastly!!!!!!!\n"," Buttock clenchingly terrible\n"," \"Oh no, not me bum, sir!\"\n"," Do not show this film to your kids!\n"," Absolutely Terrible\n"," How odd...\n"," Only enjoyable for young children\n"," Crashing disappointment\n"," Touching, Melancholy, Half-Live-Action-Half-Animation Undersea Children's Fable\n"," Oh my...\n"," Hi Hi Hi Hi Hicocolorum(spelling?)\n"," absolutely horrid\n"," Welcome to Tom\n"," The live action scenes are excellent\n"," Good on the most part, but the film itself looks dated!\n"]}