{"review-url":["http://www.imdb.com/title/tt0098093/reviews"],"review-text":["Originally intended to be the sequel to \"Jagged Edge\", the Burt Reynolds vehicle \"Physical Evidence\" is just barely adequate. The veteran star, and noted author / occasional filmmaker Michael Crichton, seem to be just going through the motions. A very routine and forgettable picture, it's clumsily written, boringly handled, and saved to a degree by a solid supporting cast.Burt plays Joe Paris, a detective with a nasty temper who's currently on suspension. He makes a plausible suspect when a notorious sleazy criminal turns up dead, and it's up to the crusading public defender Jenny Hudson (Theresa Russell) to clear his name.Russell tries hard, and does look absolutely great, but she is indeed simply miscast in her role. Burt looks like he can't wait to leave the set and cash his paycheck. Burts' frequent co- star Ned Beatty has a welcome presence as the district attorney who is sure that the case is a slam dunk for him. Kay Lenz is also lovely as always, and appealing, as a mobsters' wife. Ted McGinley is appropriately odious as Jenny's smarmy yuppie boyfriend. Tom O'Brien is a convincing jerk as the obnoxious lowlife son of the murder victim. Kenneth Welsh is excellent as always as a snooty crime kingpin. And Ray Baker does what he can with an underwritten role as a cop.Somewhat slick, but too predictable, and too silly, to really work all that well.Filmed in Toronto and Boston.Five out of 10.","Michael Crichton directed this flighty, flimsy cop-show starring Burt Reynolds as an officer framed for murder. Crichton, who did not pen the script, seems a curious choice to helm such second-rate material, but he makes something enjoyable out of it--even though one is inclined to scoff at the plotting and outrageous incidents in place of laughing (I did both). Laid-back Burt is positively enervated, yet he actually does the picture a favor by playing it so low-keyed (Crichton's general handling is outré enough). Completely outlandish, though it contains some surprising bits of humor and an odd little nasty streak which is intriguing. It's a guilty pleasure, with Crichton chortling in the background. ** from ****","A lot before \" Payback \", with Mel Gibson, the cinema already showed violent and shocking stories in which the \" hero \" was, without a doubt, more evil than the bad guys! in those films it was impossible that the people who were watching it become indifferent to the intrigue, and therefore, these films won in the originality inquiry , exactly for showing the \" heroes \" without artifices, closer to the reality. In 1989, Michael Crichton directed an explosive and tense thriller, and he chose the star Burt Reynolds to interpret the main character... Perhaps Crichton didn't know, but the heavy, powerful and lowering presence of Reynolds helped to transform \" Physical Evidence \" in one of the best (and more violent) films of the gender, better than \" Payback \" or any other...with a hate and frustration glance , a cynic and bitter smile and his black and big mustache, Reynolds built one of the most complex and lowering characters of Hollywood's history. Joe Paris (Reynolds) is a hard cop, alcoholic and violent. A man who hates the world and the people in it.He doesn't get to control his temper and he is a true clock-bomb, an unexpected man who is capable to kill somebody at any second. When the body of a well-known boss of the crime is found with his throat cut, Paris becomes, in the eyes of the police, the main suspect, after all the criminal was an old enemy of Joe. Jenny, a public defender, decides to help him, she trusts this mysterious man and she tries to, at every cost, prove his innocence, and she finishes falling in love for him. Managing Michael Crichton builds an excellent film, with a good rhythm, always maintaining the exact dose of suspense and tension.As he had already shown in his other films, Crichton demonstrates that he knows how to ally a good plot with a cast at the same height and value. The scene in which Paris literally destroys some men who insult him is really frightening. He even  threads a man's head through the window of the car. Paris is not, without a doubt, the good and nice cop that Bruce Willis interpret, on the contrary, Paris is a killing machine, a man who finds himself strange and full of rage! unlike the characters that Bruce Willis interprets, Joe Paris is revengeful, unfriendly, explosive and intolerant, that is to say, he is not afraid of anything: the death, in the vision of Paris, is a marked encounter for which he waits a long time. Paris is not afraid of death, he knows he has no limits, and he'll kill anyone who trespasses it. \" Physical Evidence \" is a dark and dramatic thriller. It seems the crime-drama films of the seventies. The movie explores the corrupt policemen's cruel and degrading routine: the prostitutes, the homosexuals, the criminals. In this film, the cops smell cocaine and they kill without pity. The streets are filmed as stages of betrayal and tragedies. In the middle of this treacherous sets \"Physical Evidence \" intrigue is developed. This is not a film for sensitive people. Reynolds, after his fascinating return in the masterpiece \" Boogie Nights \", signed a contract with the television net TNT, owner of the best and largest studio for films made for television, and he offered to his fans of the whole world the same character type again. In \" Hard Time \", Reynolds interprets a violent, dangerous and explosive policeman, but perhaps Joe Paris has been his most frightening and mysterious character, a man consumed by the drugs and the hate... Fascinating and violent, this film is a true masterpiece of the gender! watch it! Burt Reynolds once again gives an interpretation show and he demonstrates the reason why he is one of the most consecrated actors of Hollywood! and in this film he has the chance of exploring all his charisma, all his charm and talent. Unlike similar films, like \" Die Hard \", a shot in \" Physical Evidence \" is more violent and shocking than each one of those films together, exactly because Reynolds' film explores the reality! in the films, when a thief is wounded, he falls down on the ground and he dies at once. In \" Physical Evidence \", you are wounded, you fall and you die well slowly as it is in fact! intrigue, romance and action, all this is shown in this sad and dark film!it is sad the fact that the Academy didn't recognize the effort and the beauty of this work, and it is also sadder for this film not to have been seen a lot. But you have to discover this work! rent \" Physical Evidence \" and get ready to root for the bad guy! (and this time the bad guy isn't Mel Gibson - He is Burt Reynolds, the man who makes all the difference!)...","\"Physical Evidence\" has a gripping opening sequence, with a man trying to commit suicide on a bridge, only to find a corpse hidden there. What follows, however, is little different than a TV movie, albeit a well-made and somewhat violent one. Burt Reynolds' character is a walking cliché: he is a burnt-out, suspended cop who \"plays by his own rules\", has a bad temper, and of course doesn't remember anything about the night he is accused of murdering an old enemy of his. Theresa Russell gives a strangely stiff, buttoned-up performance (except for one cute scene, where she gives Ned Beatty's character the finger). The whodunit aspect is at least sustained until the end, though of course we know all along that Burt is not the killer. There are some funny lines (-\"He has a police record longer than my d**k\" -\"Never been arrested, eh?\"), and \"Married With Children\" fans will have fun spotting Ted McGinley as Russell's rich fiancé, aka \"His Gucciness\"! ** out of 4.","***SPOILERS*** Just one of the string of bombs that Burt Reynolds made in the late 1980's that dropped him from being one the top 3 Hollywood macho man, behind Stallone & Schwarzenegger, actors to the point where he was regulated to doing gust appearances, to get cash, on local TV talk shows about grooming one's mustache as well as his or her dogs & cats. In here Reynolds as the disgraced and on suspension Boston police detective Joe Paris is in hot water in being framed in the murder of one of his stoolies Jake Farley, Tom O'Brien, who's dead body ended up hanging or being grabbed by a local suicide jumper who's death plunge he interrupted. It was Farley who was found dead by Kenny Bates that prevented his attempt to jump , with a rope tied around his neck, to his death off Boston's Tobin Bridge. Already in deep trouble for punching out a police captain and with a score of police brutally charges against him it looks like an open and shut case to pin a murder charge, incredibly his first, against Paris.It's Paris' court appointed attorney Jenny Hudson, Theresa Russell, who takes his case even though Paris, in not impressed in having a woman defend him, is dead set against it. As it soon turns out Jenny does come up with a number of suspects in Farley's murder that can prove her client's innocence. As for Paris who seemed to have lost interest, in how badly the movie is going for him, in if he's found guilty or innocent yet is let out, on good behavior, on the street tracking down and working or beating up suspects as well as carrying a gun that could easily have his bail revoked. There's a number of murders on the side in the film including a star witness in Paris's defense his secret lover Deborah Quinn,Kay Lenz, and her mob connected husband Vincent,Don Grnberry,shows that the late Jake Farley's blackmailing created far more people then Paris who were out to ice him!***SPOILERS*** Confusing final with Paris, to his relief, shot and wounded as well as out of the picture and his lawyer Jenny Hudson being confronted by Farley's as well as some half dozen other people's murderer in a life and death struggle on a deserted and dark staircase. Even though the killer had no trouble at all taking care of a number of people, including 6 foot tall and 200 pounds policemen, he had far more difficulty taking care or killing the 5 foot 5 inch 120 pound Jenny Hudson who must have been practicing beside law judo and Kung Fu on the side! P.S Strange coincident in the film has the man Kenny Bates trying to kill himself by jumping off the Tobin Bridge and failed where almost a year to the date after the movie was released on January 27 1989 real life wife murderer Charles \"Chuck\" Stewart did-on Januaruy 4, 1990- and succeeded in him trying to avoid capture by the police!","Physical Evidence (1989) *** (out of 4)Joe Paris (Burt Reynolds) is a disgraced detective who is picked up on a murder charge. Clear evidence is in his room that he committed the murder but he was so drunk that he can't remember a thing. Public defender Jenny Hudson (Theresa Russell) fights to get the case thinking she can save the man but before long her life is in danger as there's much more going on than she originally thought.If you're looking for a hard-hitting courtroom drama then I'd highly recommend INHERIT THE WIND. If you're looking for an \"A\" quality Reynolds film then I'd recommend DELIVERANCE. If you're looking for any of those things or any sort of art then you're not going to find it here but at the same time as long as you don't take the film too seriously you could get some mild entertainment out of this. There's no question that by this time Reynolds wasn't a \"A\" list star anymore and this is the perfect example of a \"B\" movie.I call this a \"B\" movie because the material isn't very strong. I mean, everything pretty much falls into place without too much logic and the ending seems more like something from Scooby-Doo more than anything else. The entire murder rap has countless bad guys brought into it and any of them could have been guilty so this too works against any sort of logic. I'd even argue that by the film presenting Reynolds as being innocent, it takes away possible drama because it would have played out better if the viewer didn't know if he was guilty or not.With that said, I still found myself enjoying PHYSICAL EVIDENCE thanks in large part to the cast. I wouldn't say Reynolds gives a great performance here but he's at least entertaining and this fits well with the \"aftermath\" of some of the rough cops he played earlier in his career. He's certainly believable in the role and I thought it was a good fit for him. Russell is good in her role as the woman trying to get him off, although the screenplay doesn't do much with her character and the forced attempted love story is trash. Ned Beatty is always good and he adds some nice entertainment value as does Kay Lenz, Kenneth Welsh and Tom O'Brien. Married With Children... fans will enjoy seeing Ted McGinley here, although his character is yet another weak one.As you can tell, there's a lot of negative things about this picture but it still kept me entertained throughout. I think it's best that you turn your brain off and just watch this on a boring day whenever you just want some light entertainment. This certainly isn't a masterpiece or a very good picture but if you're a fan of Reynolds then you should enjoy it.","Jagged edge was a real bad movie but this is not. Wonderful one-liners and new words like \"His Gucciness\" referring to your everyday yuppie, played by Mr. Darcy from \"Married with Children\" (Al Bundy's sidekick).I would have like to give this 10 stars to compensate for all the bad reviews given but that would not have been quite fair. It's still a solid 7 stars and that's not bad (jagged edge could maximally deserve 2 stars).The villain is also well chosen. He's rich and arrogant, like all real villains.In short: a decent movie.","\"Jagged Edge\" was quite a success in its day and created a thirst for sexy, mysterious courtroom thrillers, which soon was sated to the nth degree by many imitators. This film first began as a sequel to \"Jagged Edge\", but when that film's stars Glenn Close and Robert Loggia wisely took a hike, it was reworked with different characters. Reynolds plays a suspended police detective with many brawls in his past and many enemies who is accused of murdering a shady character he'd been tangling with previously. Russell is the public defender assigned to him who is trying to make a name for herself in the boy's club, though Reynolds is often more of a problem to her case than a help. She comes up against various roadblocks and red herrings as she tried to unravel what happened with Reynolds (he blacked out and can't even remember the night in question!) Meanwhile, prosecutor Beatty plays any dirty trick he can and her yuppie boyfriend McGinley whines about how little time she is spending with him. Reynolds was, at this time, in the midst of a string of unsuccessful films which portrayed him as a tough guy despite the fact that his health was failing somewhat and he was no longer able to bring his trademark sparkle to the screen as effectively as he had before. Fortunately for him, the TV series \"Evening Shade\" would soon rescue him and give him a steady  and award-winning  job for about five years until he made a comeback in supporting roles in feature films a few years after that. If he'd been playing opposite someone more appropriate in age and demeanor than Russell, his performance here probably would have come off better. As it is, he waffles between faint-hearted antagonism and near narcolepsy, battling a preposterous script that wouldn't be worth anyone's effort anyway. Russell is profanely wrong for her role and is often unintentionally funny. Not aided by a severe, all grey and black wardrobe, ugly, over-sized jewelry, tightly-knotted hair and pallid, ghostly make-up, she flounders helplessly as she tries to deliver her lines with anything other than a flat monotone. She seems out of place and shares virtually no chemistry with Reynolds. Beatty (whose \"Boston\" accent comes and goes) tries to steal every scene he's in and usually succeeds thanks to the lack of opposition on that front. Lenz appears as an ex-love of Reynolds and manages to inject some emotion into her few moments (one of which includes an uproarious Jazzercise get-up.) Gorgeous McGinley is both intentionally and unintentionally funny as the uppity, persnickety jerk with whom Russell lives. His blink-and-miss-it scene walking to their hot tub in some skimpy briefs is about the best thing the film has to offer. Baker, O'Brien and Welsh appear as other potential suspects in the murder (which is revealed in a wacky, tacky prelude involving a suicide attempt.) It's a mind-blowingly idiotic affair that wavers between dullness and jaw-dropping amusement. Though it was routine and inconsequential upon release, at least now it offers up some laughs as McGinley (decked out in the designer gear of the day) and Russell debate the merits of a \"cellular phone\" and Welsh speaks into one the size of a small Kleenex box! The convoluted plot at least keeps viewers guessing, though it probably left the screenwriters guessing almost as much!","A police officer suspended and now accused of murder is forced to join forces with his court-appointed attorney to assemble the pieces of a deadly puzzle to find the missing link before time runs out. Physical Evidence has some of the longest and funniest takes i have ever seen from the start with the body to the end with the cop and the girl it's like they took an entire week to finish them. Burt Reynolds was alright in this movie but it's very forgettable and B-type of movie stuff with nothing really good or memorable to say about it in the very much end also.","A suspended cop (Reynolds) gets arrested, suspected for murder. He has no money and settles for a public defender. At the Public Defenders Office a young female lawyer (Russell) fights off a few other lawyers to get the case, hoping a high profile case like this can make her career.I'm not going to go into the story much more than that, other than to say that the evidence against the cop is mostly circumstantial. As a plot, this could be taken anywhere. Corrupt cops, the defense's feeling of conspiracy against an easy target, suspect lawyers from the district attorney's office; it's all there, and more, and if played out right it could make for a really entertaining trial movie.But there's a problem in the movie, and her name is Theresa Russell. From the moment she open her mouth she stood out....in the worst possible way. I've seen thousands of movies, but I can seriously never remember seeing a worse acting performance than what she delivers here. EVER! It makes Vampira and Tor Johnson in Plan 9 From Outer Space look like Meryl Streep and James Stewart by comparison! Every time she opens her mouth I shrugged at her amazing ability to make even the easiest line come off completely wrong! There isn't even a hint of credibility about her, and her very presence in the movie - where she's really the main character - ruins everything. Every scene she's in is the worse for it, she is truly the most destructive force I've ever seen in an otherwise decent movie. And she's acting against a string of B- and C- grade actors, most delivering below-par performances, yet they still seem Oscar-worthy next to her.I'm giving the movie a couple of extra stars for the idea of a story that could've been entertaining if it had a real actress delivering the main female part, and for a couple of decent scenes without her presence, but really; this movie should be avoided at all cost!","Author Michael Crichton directed this crime mystery starring Burt Reynolds as suspended policeman Joe Paris, who is suspected of murdering an extortionist. With no alibi or money, Joe must use the services of public defender Jenny Hudson(played by Theresa Russell) who has her work cut out for her, since, even though the murdered man had many enemies, so does Joe, making her investigation difficult. Can she save Joe, and not fall in love with him too? Forgettable film was originally conceived as a sequel to \"Jagged Edge\". When that fell through, it was rewritten to its present form. Indifferently acted and utterly predictable film has little to recommend it.","Former cop Joe Paris (Burt Reynolds) was suspended for pushing his partner through a window after he shot an unarmed suspect. When criminal Jake Farley is founded murdered, Joe is arrested after finding evidence at his apartment. He's bloody, hungover, and can't remember the night before. Jennifer Hudson (Theresa Russell) is his eager new public defender who spent five years in the Peace Corps. James Nicks (Ned Beatty) is the prosecutor. Deborah Quinn (Kay Lenz) claims to be with Joe that night. She had contracted Farley to kill her powerful husband but changed her mind. He refused to pay her back but Joe somehow got the money for her. Jenny wants her to be Joe's alibi but Joe objects.Michael Crichton as an IP generator is beyond reproach but as a director, he is average at best. This does not raise his average. The narrative flow is lacking. Burt Reynolds is cold which is good for his possible guilt. His innocence is not really in doubt but twists are expected in this type of movies. Russell overacts in a couple of scenes. The pairing is not that appealing. None of the characters are rooting interest material. This is a forgettable thriller.","I got a kick out of Reynolds saying to his attorney, \"look,I've done a lot of shi%ty thing in my life, but I never killed anyone.\" Obviously he forgot about his career which slid down hill after he started making stupid movies like 'Cannonball Run.' Physical Evidence was originally supposed to be a sequel to 'The Jagged Edge' that Glen Close sanely rejected. The verdict is in, avoid Physical Evidence."],"review-user":["Hey_Sweden","moonspinner55","ary","gridoon2018","kapelusznik18","Michael_Elliott","karlericsson","Poseidon-3","BatmanFunReviews2018","cartman_1337","AaronCapenBanner","SnoopyStyle","spfi"],"review-date":["20 December 2015","16 May 2008","18 March 1999","31 January 2016","25 July 2015","19 August 2017","4 September 2010","29 May 2008","13 October 2018","4 September 2013","15 October 2013","10 July 2018","1 August 2002"],"review-rating":["5","5","5","5","7","5","3","3","4","1"],"review-title":[" Mild police drama.\n"," Agreeably dumb...\n"," \" Burt Reynolds is a hard, violent and corrupt policeman in this thrilling, cruel and realist film...\"\n"," Routine but watchable\n"," Well at least my socks match\n"," Flawed But Entertaining \"B\" Movie\n"," Crichton delivers as always\n"," DOA when released, at least now it has a few unintentional laughs.\n"," B-Movie..\n"," Decent story ruined by the worst acting performance I've ever seen\n"," Forgettable Film.\n"," bad thriller\n"," Poor Burt in another dud\n"]}