{"review-url":["http://www.imdb.com/title/tt0024500/reviews"],"review-text":["The good news is that \"Riders of Destiny\" just might be the best of John Wayne's Westerns for producer Paul Malvern's Lone Star Productions. The bad news would be that this was the first one, meaning that all the rest went downhill from here. Now don't get me wrong, I'm a 'B' Western fan from way back, but if you get a chance to view any of these, you'll have to take them with a good ole boy grain of nostalgia and an appreciation for simpler times.Actually, \"Rider of Destiny\" might have been the better title, since it's Wayne's show all the way. He portrays Singin' Sandy Saunders and has a reputation as the most notorious gunman since Billy the Kid. That's somewhat ironic though, since it's later revealed that he's a special Secret Service agent sent from Washington to investigate a land swindle scheme under the direction of town boss James Kincaid (Forrest Taylor). How would he have earned that nickname having just arrived? Some other bits don't quite jive as well, like Saunders' finesse with a six gun. In the only actual one on one showdown with a villain that I can recall in a Lone Star, Saunders neatly places a bullet in each wrist of Slip Morgan (Earl Dwire), thereby making him a threat no more to righteous folks. One wonders how he might have learned to shoot like that.But you know what? It doesn't make too much of a difference, because if you're a fan of these oaters, you'll have a blast with this one as much as all the rest. You've got your crazy horse spills, wild stage coach rides, and villainous intrigue to pull it all together. You also have your obligatory romantic leading lady, here portrayed by Cecilia Parker. Her character is Fay Denton, daughter of George (pre-Gabby) Hayes, and she signals her interest in Saunders right from the get go. He helps things along by serenading her with a few songs with Daddy present, and boy, they just can't get enough, even if his singing voice is nothing at all like his speaking voice.Yakima Canutt is on hand as an unnamed Kincaid henchman, and of course it's Yak that's responsible for all the daring stunt work, including that trademark 'jump on the horse team and go under the stagecoach' trick, simply remarkable if you consider the timing and logistics involved. His fellow baddies include a comedic pair of stage drivers also working for Kincaid, Bert and Elmer (Al St. John and Heinie Conklin). It would be a few years before Al becomes 'Fuzzy'.Modern day viewers might be left scratching their head over a line spoken by Wayne's character early in the film. When he discovers sheriff Bill Baxter wandering in the desert with a bullet wound, he tends him while adding - \"I'll have you in Starbucks before night\".A lot has been debated over who the singer was who dubbed Wayne's voice in this movie and \"The Man From Utah\". A couple reviewers on this board credit old time band leader and crooner Smith Ballew, although Ballew himself denied it consistently until he passed away. The odds on favorite seems to be Bill Bradbury, son of director Robert North Bradbury, and twin brother of another era cowboy star, Bob Steele. Bill had a fine baritone voice, and used his talent to make some extra money while going to medical school. For anyone who cares to learn more about the controversy, check out the following page - http://www.b-westerns.com/jwayne1.htm.You'll have to scroll down to the bottom part of the page, and it's a good read.Anyway, for old time Western fans, \"Riders of Destiny\" is as good a place as any to see how John Wayne learned his craft. Hard to believe that by the time he made his breakout film \"Stagecoach\" to become an overnight success, he already had fifty one movies to his credit! Only one question remains though while watching 'Riders' - where were all those geese hanging out when there wasn't any water around?","Forget the lame opening of Singin' Sandy (Wayne) warbling a tune that sounds about as much like Wayne's singing voice as mine does. This is still a solid Lone Star programmer. There's not a lot of hard riding or fast shooting, but there is a strong story-line, along with that stellar cast of Lone Star regulars-- George Hayes (before Gabby), Yakima Canutt, Earl Dwire, and Forrest Taylor, excellent as the head bad guy.I expect the plot really resonated with Dust Bowl audiences of the time. Bad guy Taylor wants to use water rights to buy up all the little farmers in the valley. The effects of water returning to the valley are quite well done for a programmer. Also the crowd scenes look like real farmers, while the 30 seconds of the plain-faced frontier woman appealing to the crowd should be studied by A-grade Westerns.Wayne is quite engaging as the good guy, looking every inch the part. Also, look for Al (Fuzzy) St. John, sans whiskers, as one of the bad guys, no less. One complaint-- there are two really tumbling trip-wire scenes that send the poor horses head over hoofs. I hope they survived. That was one real problem with these 30's Westerns. Anyway, it's still an entertaining 60 minutes for fans of Wayne and Lone Star.","I recently purchased this film on a special triple bill DVD from an overly cheap discount store, in fact it was so cheap that the three movie disc cost me just one single pound of my hard earned British currency.This film was both fantastic and atrocious in one. An exciting plot, but with laughable performances from the entire cast.We know that all great actors have to start somewhere and the lone star westerns of the early thirties were what John 'The Duke' Wayne cut his teeth on.To look at his work in his final film The Shootist in 1976, you can see just how much he had learnt over his 40 years in the business and what a great actor he did eventually become, but to look at his performances in these early days, you can understand why he spent most of the 1930's in relative obscurity.Although Wayne looks uncomfortable throughout most of these films and his acting is wooden to say the least, it can't all be blamed on him.These movies were the product of their day and cannot be judged by todays standards. Intended only as supporting features, these long forgotten studios turned out these 'B' movies by the shed load. Badly formed scripts with badly shaped characters must have poured though these fledgling studios like water through a hoop and with a stock company of actors who's style was still formed in the pantomime silent era, they were bound to be a bit cheesy. In fact if in 1933 there were Oscars awarded for the greatest achievement in over acting then this would be the motion picture with greatest ever hoard.Wayne's character is a notorious gunman with a name that must have put the fear of God into whoever crossed his path, Singing Sandy Saunders. Laugh? I damn near wet my pants.And if that wasn't enough to give me the biggest gut wrencher of the century, then George 'Gabby' Hayes certainly iced the cake.After an appalling song that sounded like two cats fighting over a piece of fish in a metal barrel, the great Gabby uttered the line, \"Mmmm. I could listen to that all night.\" The line itself is worthy of side stitching surgery, but the look of peace and serenity on his face was just too much for the old chuckle muscles which then went on to explode.I can honestly say that a truly inspired and well written comedy has never made me laugh as much as this film did.However the story is a good one, with the corrupt businessman holding the town's ranchers to ransom over his monopoly in the water market with a view of buying up all the farms etc.It survives today as nothing more than a nostalgic glimpse into the past, not only at a bygone era in cinema making, but as a chance to see a real Hollywood legend finding his feet. This alone makes it worth every penny of the thirty-three pence I in effect paid for it.","Had the good folks at Lone Star Productions only decided not to dub John Wayne's voice with some forgettable cowboy ballads this would have been a far better western than it turned out to be.Of course Wayne in later years would cringe at the mention of these films. If you want a good idea of how he really sounded listen to him in McLintock singing a favorite ballad of his, The Moon Shines Tonight on Pretty Redwing. The Lone Star people might have even looked for a young band singer working day to day in clubs in New Jersey around this time named Frank Sinatra who over 30 years later actually had his voice come out of Wayne's mouth during a Dean Martin show.If they could have cut out the singing gimmick, Riders of Destiny is not a bad film, in fact a cut above some of the westerns the Duke was doing at the time. Ranchers in the valley are being squeezed out by a greedy villain played by Forrest Taylor. He's built a dam and controls all the water and it's either sell to him outright or pay his exorbitant prices for water. Gabby Hayes and his daughter Cecelia Parker happen to have the only other water around because they dug a well. Taylor especially wants their land.The citizens have written to the federal government in Washington for intervention and they get it in the form of John Wayne. I don't think I have to go any farther. The Duke finds a very clever solution for the water problem which you should see the film to find out.But don't lose your lunch hearing that Nelson Eddy wannabe voice coming out of Mr. Wayne's mouth.","At the risk of sounding like a complete anorak, I have to confess to a deep affection for John Wayne's Lone Star westerns. Every one has a mighty fine title, usually nothing much to do with the story being told. They have that addictive quality that other people find in today's soap operas. In both types, the plots are familiar and preposterous, the characters are off-the-peg, the acting is poor, the heroines are pretty, and the leading man looks good (especially on a horse in J.W.'s case).Of all J.W.'s Lone Star films, this one is my favourite. It has all the virtues listed above, maybe not as developed as in some of the later films, but there nevertheless. I particularly enjoy the way a character is introduced in the first reel, made to disappear for most of the film, and reintroduced at the end. The heroine is delightful in jodhpurs, and the bad guy simply looks dastardly in them. Then there are the pistols that seemingly are deadly at several hundred yards. And an important prop is what I take to be a genuine stagecoach.But this film has notable extras: \"interesting\" singing, some truly exciting stunt work, and a remarkably lyrical climax that I don't think Robert N Banbury ever came close to emulating again. It's so good that you'd almost believe that Ingmar Bergman had seen this film and been inspired by it as he started on Virgin Spring.Note to students of film: it's probably a bad idea to try that suggestion on your teacher!","First of all, joeytheBrit says that Cecilia Parker \"...bakes cookies too.\" No, no, no. She does NOT bake cookies in this movie she bakes BISQUITS! Bisquits are entirely different from cookies! In the old west, biscuits were usually made with buttermilk and were eaten primarily with breakfast. Anyway, Joey is certainly correct in saying that Cecilia Parker is impossibly cute, I wish I could meet someone like her! As for the film itself the story is actually quite good and told in a fairly entertaining manner. Remember, this was filmed in 1933! The acting is just passable. Yakima Cannutt should have stayed with the stunt work as he was certainly no actor! John Wayne as \"Singing Sandy\" is ridiculous. The songs are just silly and don't belong in the movie. It is very obvious that Wayne did NOT do the singing. The voice in the songs sounds nothing like Wayne's voice. The songs only detract from the otherwise fairly decent story.","An evil land baron is holding up water to a group of ranchers in order to try and take their properties for pennies on the dollar. Along comes Singin' Sandy Saunders (John Wayne), who saves the day for Gabby Hayes and his daughter by going undercover as the villain's newest gunman.The first of sixteen films Wayne made for Lone Star/ Monogram Pictures, this tries to cast him as a singing cowboy, only with an obviously lip-synced voice. The title card prominently features his character as \"Singin' Sandy\" leading one to believe that this was meant to be the first in a proposed series!Yes it's ridiculous, but also a lot of fun to see Wayne singing songs and shooting guns, especially when he does a little ditty before shooting it out with gunman Earl Dwire.Riders Of Destiny features a rare villainous role for for Al \"Fuzzy\" St. John, who clowns around as much with the bad guys as he did playing a heroic sidekick, riding alongside Buster Crabbe and Lash LaRue.","Not the best of the Lone Star series, but it moves along quickly with good performances. Introduced as \"Singin' Sandy\" in the main title, John Wayne as a 'singing cowboy' isn't successful-- you never even see a front close-up of him while he's 'singing.' The actual singer is the director's son, Bill Bradley, who warbles away sounding like many popular singers of the day such as Hutch or Joseph Wagstaff. The film features: Cecilia Parker (also seen in \"The Lost Jungle\" serial, \"Tombstone Canyon,\" and as older sister Marian in the Andy Hardy movies) doing her best Katherine Hepburn-- \"Really they mustn't; really I'm not\"; Al St. John, before he literally became \"Fuzzy\" filling all his available screen time with his characteristic business of hat flipping, head and chin scratching, grimacing, and gawky physical gestures and movements; George (pre-Gabby) Hayes as a gentle pipe smoking father; and Forrest Taylor, minor vet of 395 movies and TV shows, playing the oily villain with string bow tie and prop cigar. Fun or odd moments: Yakima Canutt's great 'under the stagecoach' trick; the 'gay' scene when Singin' Sandy ties Bert and Elmer together face to face, drags them roped to his horse, and dumps them at Kincaid's office, where Kincaid says, \"You're a fine pair of lovebirds!\"; Denton's rapturous comment after an atrocious song and guitar playing performance by 'Sandy,' -- \"Ummm. I could listen to that all night!\"; Kincaid's reply, We won't go into that,\" after being told by a rancher \"You've got the soul of a snake!\"; and, of course, he utters the immortal, \"I've made Denton an offer he can't refuse.\" The plot of the movie is saved by Sandy's tricking Kincaid, and later saying the three magic words in many of these films: \"I'm from Washington.\" FDR has saved us from the Depression! (Is that why the villains are always either bankers or in real estate?) The shootout sequence is taken from the earlier Bradbury film \"Man from Hell's Edges\" (1932). All of the Lone Star westerns are special because of their unique mixture of interesting characters, the troupe of actors and stunt people, and the spin on the clichés and repetitive back stories and situations. This one ranks a little low, marred by the inappropriate and mis-used \"Singing Cowboy\" gimmick. I'll give it a 4.","Please don't judge this film by the first 10 min.. John Wayne, alias Singin' Sandy Saunders, gets out his guitar in two spots, including the opening scene, and lip syncs to two very different sounding singing voices. Please spare us any more of this!It's pretty bad when you have to hold up the stage in order to beat the bandits you know, from experience, are going to hold it up a little later and take the money being sent to you. But, that's the predicament striking blond Cecilia Parker found herself in when Wayne saw her horse shot out from under her by the stage driver. Seems the expected bandits were part of the same criminal outfit, headed by a Mr. Kincaid, as the stage drivers. Actually, their main racket was hoarding nearly all the regional water and selling it dear to the ranchers. The ranch owned by Gabby Hayes and daughter Cecelia has a well, the only other water source in this region. Thus, Kincaid especially wants to acquire this property for a full water monopoly, while threatening to cut off his water to the other ranchers unless they sell their land to him for next to nothing. Nice guy, Eh? Well, ole John has a plan how to get the ranchers out of this impossible situation. Kincaid falls for it like Cecilia falls for Wayne and vice versa. During the follow up horse chase of Kincaid by Wayne, poetic justice is served, and the valley ranchers presumably live happily ever after. See the movie to learn the rather unexpected details. Clever man, that Singin' Sandy Saunders. Clever, but sneaky.","This movie is surprisingly good. Director Robert North Bradbury, actor Bob Steele's father, did some of his best work here.There is an attention to detail in this film that is missing from too many B Westerns.The cast is top flight, with John Wayne, even this early, showing that personality that led him to become the single most popular movie star in the history of Hollywood. (Yes, even today there is no single star who has sold as many tickets.)Al St. John, later known as \"Fuzzy,\" plays a different kind of role, but still shows himself the champion scene stealer.Cecilia Parker was a doll, cute, perky, with animated features that should have led her into more fame.The stunt work shows the hand of that master, Yakima Canutt, who is also cast in a minor part.All in all, this movie is about as much fun as any one film can be; it is more than worth watching: it is worth watching again.","If you are a fan of early Duke movies, this Lone Star oldie is a good one. What more could you ask for than Duke, Yak, and Gabby. Lots of good ridin' and shootin'!!! I found it amazing that Duke's singing voice was Bill Bradbury, who is none other than Bob Steele's twin brother. It has been reported that Bob Steele was a high school classmate and friend of Duke, so twin brother Bill may have been too. Anyway, if you like good, clean, early western movies don't miss this one. We don't have to wonder about hidden meanings or try to figure out underlying themes. Just sit back, relax and enjoy a western movie from a simpler day and time. It's called entertainment folks!!!","\"Riders of Destiny\" was the first of several westerns Wayne made for the Lone Star arm of Monogram Pictures between 1933 and 1935. In this entry, the producers try to make the Duke into a singing cowboy called \"Singin' Sandy Saunders with hilarious results. Any Wayne fan knows that the Duke couldn't have carried a tune if his life had depended on it. His voice was apparently dubbed by Smith Ballew whose deep baritone sounds nothing like Wayne. Wayne looks awkward and uncomfortable in \"performing\" the musical numbers. Thank heavens the singing cowboy experiment soon ended.As for the movie itself, it contains a standard \"B\" western plot of the fight over water rights between the villain (Forrest Taylor) and the local ranchers. Duke, of course plays the hero. He had not yet developed his on screen character and still looked like a poverty row cowboy.Also cast in the film were George (pre-Gabby) Hayes as the heroine's father, Cecilia Parker as the heroine and Yakima Canutt as \"one of the boys\" who performs his \"falling from the racing horses under the wagon\" stunt while doubling Wayne. Both Canutt and Hayes would go on to appear with Wayne in most of the other entries in the series. Canutt, in particular would have a profound effect on Wayne's future development teaching him, among other things, how to move, fight and look comfortable on a horse.As \"B\" westerns go this one isn't too bad, however, I have to give it a failing grade because of the \"singing\".","During the 1930s, John Wayne was NOT the huge star many would have thought, but just one of many minor stars playing in B-westerns to eke out a living. His westerns were made for many so-called 'poverty row' studios in that they had minuscule budgets and limited resources--and very modest pretenses. If you are the critical sort, you can find a ton of problems with these films, though if you are a more charitable sort, you'll see that they are entertaining...provided you understand they are just B-movies...and not particularly distinguished ones at that.Here in 1933, Wayne was in some of his earliest Bs, so his persona wasn't yet established. Some knuckle-heads thought he'd be great as \"Singin' Sandy\"--a singing cowboy much in the mold of Gene Autry. The only problem was that Wayne sang about as well as Andy Devine--so they had to dub this singing--and it's painfully obvious it ain't Wayne doing any of this! Seen today, it's laughable as the movie begins and Wayne is crooning a very maudlin tune--especially as he begins to sing each time he's about to have a shootout! You just HAVE to see and hear these scenes to believe them!! In addition to Wayne, the film has a few other familiar faces. Gabby Hayes is here--like he would be in most of Wayne's Bs. Al St. John is also here for comic relief along with Heinie Conklin. It's not surprising the pair would be included as comics, as both had extensive silent comedy experience. St. John was Fatty Arbuckle's nephew and nemesis in many of his films...and later a very familiar western sidekick in the 1940s. Conklin had worked for Mack Sennett as one of the Keystone Kops. Unfortunately, too often the pair just seemed way, way too dumb to be bad guys--no gang leader is THAT desperate for henchmen!! Plus, they never are nearly as funny as Sandy's singing!! Like just about all of Wayne's films, here he is a lawman investigating an evil gang leader. In this case, the gang's fighting over water rights. Their scum-bag leader owns the water for the valley and now that his contract is about to expire with the nearby ranchers, he's planning on charging ridiculous prices for the use of the water in order to destroy them. However, he is willing to buy them out--for only $1 and acre! Nice guy, huh? Can Wayne sort all this out before the ranchers either give up or an all-out range war take place? While this film is diverting, I have to say that compared to the westerns made for this same penny-ante studio in the next couple years (Lone Star), this one is clearly inferior. Most of this is due to the stupid singing gimmick, though St. John and Conklin didn't help matters any.","Early talkie in which John Wayne accompanied by George ¨Gaby¨ Hayes and a beautiful damsel face ominous enemies who attempt to take the water supply . Bad guy Kincaid (Forrest Taylor) controls the local water supply and plans to do in the other ranchers . Government agent Saunders (John Wayne) shows up undercover to do in Kincaid and to find out who is stealing water from the local farmers . Meantime, Saunders wins the heart of one of his victims , Fay Denton (Cecilia Parker) . Sanders meets Charlie Denton (George Gaby Hayes, this time without beard and he bears the comic relief , as usual), an old rancher , become partners and Sandy helps as well as secures water rights for farmers . Meanwhile , the nasty wealthy Land Baron seeks vengeance and take lands from poor farmers at exorbitant rates. The picture gets thrills , Western action , shootouts , a love story , and several fights between Wayne and his enemies ; being quite entertaining and including some comical elements . It's a low budget film with good actors , technicians, mediocre production values , pleasing results and usually regarded as one of the best Westerns made by John Wayne during his ¨Lone Star¨ period . The picture packs brawls and fights in silent cinema style and and exciting pursuits . Nice acting by John Wayne as a young Singin' Sandy Saunders who finds himself involved with claim jumpers , powerful owners and ambitious guys . Very early Wayne has the Duke looking awfully young as an undercover agent securing water rights and he even sings some songs . Sympathetic performance from veteran George ¨Gaby¨ Hayes as short-tempered person , Gaby steals the show , as usual . One of the few sidekicks to land on the annual list of Top Ten Western Box office Stars, he did so repeatedly . In his early films, he alternated between whiskered comic-relief sidekicks and clean-shaven bad guys, but by the later 1930s, he worked almost exclusively as a Western sidekick to stars such as John Wayne, Roy Rogers, and Randolph Scott. After his last film, in 1950, he starred as the host of a network television show devoted to stories of the Old West for children, The Gabby Hayes Show (1950). Mediocre cinematography by Archie Stout , a notorious cameraman with a long career . Being necessary an alright remastering because of the film-copy is washed-out . The failure of the original copyright holder to renew the film's copyright resulted in it falling into public domain, meaning that virtually anyone could duplicate and sell a VHS/DVD copy of the film . Therefore, many of the versions of this film available on the market are either severely and usually badly edited and/or of extremely poor quality, having been duplicated from second- or third-generation or more copies of the film . The motion picture was professionally directed by Robert North Bradbury who made various early John Wayne vehicles .John Wayne played a great role in the super-production ¨The big trail¨(1930) but he subsequently fell in B series during the thirties . Most of them in ¨Lone Star¨ productions , usually directed by Robert N. Bradbury , such as : ¨Rough romance¨, ¨The range feud¨, ¨Texas cyclone¨, ¨Two-fisted law¨, ¨Ride him cowboy¨, ¨Big stampede¨, ¨Haunted gold¨ , ¨The telegraph law¨, ¨Somewhere in Sonora¨ , ¨The man from Utah¨ , The man from Monterrey¨, ¨The lawless frontier¨ , ¨West of the divide¨, Rainbow Valley¨ , The desert trail¨ , The dawn rider¨, ¨Lawless range¨, The Oregon Trail¨ , and ¨Born in the west¨ . In 1938 he participated in Republic series with ¨The three musketeers¨ replacing Robert Livingston and in which George Sherman directed 8 films . Later on , Wayne starred the hit ¨The stagecoach¨ by John Ford and took part in ¨A movies¨ such as¨: ¨Allegheny uprising¨, ¨Dark command¨, ¨The spoilers¨, ¨In old California¨, ¨War of the wildcats¨, ¨Tall in the saddle¨, ¨Flame of the Barbary Coast¨ and ¨Dakota¨ . And financed his first production : ¨Angel and the badman¨ . Subsequently , with ¨Red River¨ John rose at top box-office and after that , he starred many successes .","I happened to catch it in television and surprised myself by sitting through it all!  I enjoyed the story, action and corny humor; it was balanced throughout.  Seeing John Wayne's few stunts was fantastic-- nothing as far-out as Buster Keaton or Jakcie Chan, but impresive nonetheless. Overall, a well tempered genre film.","John Wayne in one of his early singing (well dubbed) cowboy flicks stars as a government agent under cover trying to get to the bottom of a water scam that has a bad guy controlling the water in an area refusing to let anyone have water unless they pay him sky high fees. Wayne comes into the mix by helping a girl who robs a stage coach in order to get back the money taken from her father. It's a rambling mess where 20 minutes pass with a minimal amount of plot transpiring while the two stage coach drivers wander about being silly in an attempt to capture the robber. The film then kind of settles down at that pint, with Wayne romancing the girl and taking on the bad guys. Its twenty minutes of plot stretched to 55 minutes and for me its intolerable. Things just ramble onward in such away that you can't believe its taking as long as it is. I wanted to scream. Actually I reached for the remote and began scanning through the romance and horse riding bits. Sure Wayne is clearly a star but the film he's in is a crashing bore. I'd avoid it unless you like this sort of thing.","To state the obvious - no one (absolutely no one) is ever going to mistake this for a great movie. I wasn't even really sure what the title was trying to get at. \"Riders Of Destiny\"? What does that mean? It is, however, an interesting movie. It's a short (53 minutes) B-Western; probably a secondary feature that would have introduced the main feature at a theatre. Most interestingly is that it's a very early example of John Wayne's work (he became such a legend that many probably didn't know that he started in low budget B-movies.) As far as I know, this is actually the earliest John Wayne movie I've ever seen (my previous exposure to his earliest work would have been 1934's \"Blue Steel.\") He was 26 years old when this was made, and - not exactly in keeping with his later persona that everyone is more accustomed to - he plays Singin' Sandy Saunders (you have to promise not to laugh) who sets out to help local ranchers whose water is being cut off by a greedy businessman in town who owns all the water rights. Now, in fairness, the story isn't actually all that bad. As befits a movie less than an hour long, it moves along crisply and it's pretty easy to follow. You kind of know how it's going to turn out, but there is a brief period of time when Singin' Sandy's identity becomes a bit of a mystery.Singin' Sandy sings (usually very maudlin and even depressing songs) - except that it was apparently not John Wayne's voice, but someone else (never definitely identified, apparently - probably by their own choice) dubbed over. The big question would be why - if they were going to dub - didn't they find someone who could actually sing? The singing was truly terrible. There's one scene in the Denton's ranch where Singin' Sandy kind of serenades young Fay (played by Cecelia Parker) while her dad (Gabby Hayes) watches. It is truly hard to believe that Fay wouldn't have burst out giggling at the awful sound emanating from Singin' Sandy's mouth (and in fact Parker did seem at one point to grin at whatever sounds if any Wayne was making as he mouthed the words) and the viewer has to laugh a bit as Singin' Sandy finishes the song and Denton (Hayes) looks at him, apparently in awe, and says \"I could listen to that all night.\" I'm sure there wasn't a lot to do for entertainment in the Old West - but, seriously, I don't think so.The singing aside, I'll concede that it isn't awful. It tries to incorporate some slapstick humour every now and then, usually featuring Al St. John and Heinie Conklin, two veterans of the silent movie scene whose slapstick in this looked like silent movie stuff as Bert and Elmer - the \"henchmen\" of the evil business man Kincaid (played by Forrest Taylor.)Watch it as a curiosity with a decent story but lots of problems. (4/10)","Copyright 22 January 1934 by Monogram Pictures Corp. Presented by Lone Star Productions. No New York opening. U.S. release: 10 October 1933 (sic). U.K. release through Pathe: 16 July 1934. 6 reels. 58 minutes.SYNOPSIS: Undercover government agent helps ranchers get their rightful water rights.NOTES: Wayne's first of sixteen Lone Star westerns. Negative costs rarely exceeded $12,000 on an incredibly rapid shooting schedule of less than a week.COMMENT: The first of the Lone Stars starts off on a distinctly wrong track by attempting to pass John Wayne off as a singing troubadour. Mouthing to the somewhat inappropriate voice of Smith Ballew, Wayne \"sings\" two songs. We like the one about \"There'll be blood a-runnin' in town before night. There'll be guns a-blazin; and singin' with lead. Tonight you'll be drinkin' your drinks with the dead.\" Wayne seems definitely uncomfortable in this warbling role, but fortunately is obviously much more at ease in the action spots, especially when doubled by Yakima Canutt. In addition to doubling Wayne and general stunting (he performs a fine quota of spectacular falls and leaps), Canutt has a minor genuine on-screen role as one of the villain's henchmen, though he disappears from view at an early stage. G.\"G\". Hayes, on the other hand, has a major part, doing a variant on his famous \"Gabby\" characterization. Heroine Cecilia Parker is a lovely girl, but though appealingly photographed, her acting is so amateurish it's a miracle she survived to be re-born as Andy Hardy's sister. Normally respectable Forrest Taylor has an off-beat role as the heavy, with Heinie Conklin of all people as a pratfalling henchman. Wayne himself is reasonably personable. There's enough action to satisfy the fans (\"Make it fast, Slippery. This is your last draw!\"), and for once the background locations are not drably uninteresting. Bradbury's direction is competent, though his fondness for whip pans as a scene-changing device will make the movie seem even more dated and old-hat to current viewers.","Having enjoyed watching a few of John Waynes previous Lone Star production's,I was very much looking forward to viewing the movie.After having seen the film,I feel that it has a very good plot and some unexpectedly impressive stunts.The plot: Secret Agent Slingin Sandy Saunders is sent from Washington to go undercover in a small town.When Sandy arrives to the town,he discoverers that the town is in big trouble due to a major businessman,declaring that he is to own all of the towns water supply by buying out all of the contracts. View on the film:Though screenwriter/director Robert N. Bradbury sadly does not film most of the excellent stunts (including a stunt that John Ford would use later on for the classic film Stagecoach) in close up.His screenplay makes up for it,by being surprisingly very ahead of its times with looking at the subject of small landowners getting crushed by huge corporations.With the performances,John Wayne gives a very good cunning performance as Sandy,especially in the scenes that he shares with the beautiful Cecilia Earler. Final view on the film: A well-written, surprisingly modern story with great stunts and fun performances from Wayne and Earler.","John Wayne as Singin' Sandy. If that doesn't make you snort milk out of your nose, I don't know what will. If you're a fan of the Duke but not very familiar with his early B westerns, the opening moments of this will probably have you staring at the screen in disbelief. I have seen quite a few of Duke's movies from this period and still my mouth hung open in shock. The plot is about government agent Singin' Sandy Saunders (audible groan from me just typing that) trying to put a stop to a bad guy withholding water from ranchers. Sandy also catches the attention of Andy Hardy's sister (Cecilia Parker), who's the daughter of Gabby Hayes.Now, as shocking as John Wayne doing the Gene Autry routine is, the bigger shock is that this actually isn't a bad movie! For a B western of the time, it's better than average. Wayne is personable and believable as the hero, of course. Parker is pretty and likable; one of Duke's better love interests in these cheapies. Some highlights are Gabby Hayes' enthusiasm for biscuits, Yakima Canutt's stunts, and all of the laughable scenes where Duke lip-syncs. But the single best scene is when Sandy is called out for a shootout and the townsfolk suddenly realize who he is. \"Why, that's Singin' Sandy,\" someone says with a straight face. Unreal.","REAL early John Wayne! He's young and active, doing his own stunts like jumping on to a horse at a full run, and he actually sings! Sure his acting skills are a bit rough, but he looks great, and you can see the great future as a hero in front of him","A passable first effort by John Wayne for Lone Star Westerns is undone by odd comic relief and an attempt at strangling the career of Hollywood's greatest cowboy before it began by giving him a guitar.That's right, it's time for the musical stylings in the key of Duke. Ellington, he's not.\"His eyes were blazing with flames of hate/ And his guns were loaded with poison bait/ As they hung and swung at his side.\"That's Wayne as \"Singin Saunders,\" known around the Old West as \"the most notorious gunman since Billy the Kid,\" apparently for his ability to mow down hombres acapella. As an offstage singer tunelessly mutters lyrics while caressing a guitar with an oven mitt, Wayne lip-synchs his way into battle.It's the first of three Lone Star singing-cowboy roles for Wayne, and the one that jumps out at you for the way it is doggedly incorporated into the plot, with five separate scenes where Wayne's character breaks into song.When Wayne isn't singing, his quiet strength and easy charm make him a good fit for a low-key oater about a rough boss named Kincaid (Forrest Taylor) using his water rights to starve out a law-abiding town. Cecilia Parker makes for a lovely love interest, and Wayne is partnered for the first time ever by George (not yet Gabby) Hayes as Parker's pa. They make a fine trio.Unfortunately, this film has other issues. Everyone in it operates as if no one has a memory lasting more than five minutes. For example, after Parker's character is saved by Saunders, she comes to believe he is working for Kincaid and confronts him. Saunders shoots Kincaid's chief muscle and then gets offered the vacated job because Kincaid doesn't hold grudges.One sequence involves Saunders' plan to bypass Kincaid's water- rights chokehold by having a stooge ride a water wagon to the town, wait for Kincaid's goons to ride up and shoot said stooge in mid-drive, then ride up behind the goons and board the runaway wagon before it goes off a cliff. It's a good plan because {BRIEF SPOILER} Saunders works for the government and clinging onto the bottom of a runaway wagon restricts his ability to burst into song.The film suffers from a strange decision to save on comic relief by having clowns Al St. John and Heinie Conklin double as Kincaid's main henchmen. They stumble around in pursuit of Sandy in a serious of contrived encounters, one of which winds up with them lassoed together. \"You make a fine pair of lovebirds,\" Kincaid sneers.But the real black mark on this lemon is the singing. Wayne didn't like having to do it, and it shows in a performance suggesting director Robert N. Bradbury had Wayne's family and dog tied up somewhere. It's an uncomfortable start to Wayne's Lone Star era, which did produce some decent results once Wayne left his guitar with Gene and Roy.",". . . inattentive viewers of this flick probably will ask. My fashion consultant swears that Cilia Parker's bubble butt riding pants would clearly define her as female from a mile away, but the DUMB AND DUMBER henchmen featured in RIDERS OF DESTINY--\"Bert\" and \"Elmer\" (almost Muppets, but no cigar)--mistake her for a dude when they're just a block off. They assassinate Cilia's horse, enabling John Wayne to step into her lurch and spread her biscuits. Since DESTINY involves more twists and turns over water rights than CHINATOWN, this may all sound kind of sexy. Rest assured that incest is hardly hinted at among \"The Dentons\" (Ms. Parker and her Pops, Gabby Hayes). Having a ranch and gold mine in her family is more than enough to titillate John, on top of \"Fay Denton's\" tasty biscuits and buns. But the cut from wounded Sheriff Baxter to the shot of Fay being dismounted is both abrupt and perplexing. The one saving grace is that this early conundrum only takes half an hour to resolve, since DESTINY runs less than 53 minutes.","The film has a wonderful plot with an exceptionally clever twist where john Wayne's character manages to secure the trust of the towns dark entrepreneur. The theme is almost a superhero comic style composition where the bad guy stops at nothing to protect his wealth, status and greed at the detriment to the town people. All in all this is not a bad film although some of the acting from the supporting cast is a little outdated and poor in contrast to what is presented by the main cast. When watching this film it is quite clear that this is a 1930s film so please do not expect the modern style of production. You should watch this film for what it is, appreciate its ability to stand the test of time and marvel at the chance of watching a less than popular film staring John Wayne.","not a bad little western.. once again the \"Duke\" is teamed up with George Gabby Hayes.. this time,, the good people are being harassed by a villain who is sucking the town dry.. literally,, he built a dam to hog up all the water in town,, so it's either pay up to the man,, to get the water , or you ain't getting any water,,, a man and his daughter however have the only other water in town,, course they were smart enough to dig a well, therefore don't need mr. businessman's precious water,, when he finds out about this he tries to go and root them out of their land and get their water as well.. the local townspeople decide they have had enough and write the federal government,, and the town get's the \"Duke\" just in time so save the day."],"review-user":["classicsoncall","dougdoepke","Scaramouche2004","bkoganbing","alan-morton","csimpkins53","FightingWesterner","Chance2000esl","weezeralfalfa","MichaelM-3","mge-6","bsmith5552","MartinHafer","ma-cortes","david_fish","dbborroughs","sddavis63","JohnHowardReid","morrison-dylan-fan","utgard14","SteveDir","slokes","oscaralbert","luapworrag","kairingler"],"review-date":["18 November 2006","26 November 2007","14 September 2004","3 May 2006","24 February 2004","2 May 2011","17 December 2009","19 February 2007","31 August 2007","17 August 1999","27 May 2007","6 February 2001","5 August 2010","1 July 2014","21 March 2000","19 May 2009","17 August 2018","14 April 2018","1 November 2010","3 May 2014","17 August 1999","29 June 2017","11 July 2016","28 October 2014","27 December 2013"],"review-rating":["6","6","7","4","6","10","4","3","6","4","5","5","6","3","8","6","6"],"review-title":[" \"You suppose you could, eh, go in and tell her you like her biscuits or somethin'...\"\n"," Hayes to Wayne, \"Tell her you like her biscuits\".\n"," I just had to comment on this one.\n"," Singing Sandy Saunders Sends 'Em to Jail\n"," Strangely addictive\n"," Bisquits, not cookies. Good story.\n"," The Duke Sings In His First Lone Star Production\n"," An Unsuccessful \"Singing Cowboy,\" Film, but Fun Anyway.\n"," No lip-syncing gunslingers, please!\n"," Remarkably good, one of directors' best, great cast\n"," If it has John Wayne in it, it has to be good.\n"," Introducing \"Singin\" Sandy Saunders\n"," Not up to the standards of Wayne films in the following two years...\n"," Old Western in which John Wayne takes on a powerful owner who is about to force the ranchers to leave their lands\n"," This western grabs you with excitement and charm!\n"," Bland early John Wayne film. The duke is fine, the movie isn't\n"," John Wayne As Singin' Sandy Saunders - Don't Laugh!\n"," Dated and old hat?\n"," \"You ain't gonna blow my well\"\n"," \"Make it fast, Slippery. This is your last draw.\"\n"," The Duke at 26!\n"," John Wayne Singing Debut Goes Like You'd Expect\n"," John butters the buns, but who shot the sheriff . . .\n"," 1933 film\n"," Water shortage\n"]}