{"review-url":["http://www.imdb.com/title/tt0069994/reviews"],"review-text":["Some can call it cheap, others can call it stupid and some may even call it pointless, but these are all adjectives once attributed to classics such as Night of the Living Dead, The Texas Chainsaw Massacre and The Last House on the Left. As the latter was also distributed by Hallmark, they obliged to reproduced the same tag line here - `To avoid fainting keep repeating: It's only a movieonly a movieonly a movie'.'Don't Look in the Basement tells the story of Charlotte Beale (heartstoppingly gorgeous Rosie Holotik and Playboy covergirl, April, 1972), a young nurse whose arrival at her new position coincides with a dramatic change within the Stephen's Sanatarium for the mentally insane. The unusual treatment here involves allowing patients to roam free around the hospital, allowing them to express their repressed inhibitions to cure their madness. The patients are a truly frightening gathering. One girl shuffles around with a doll she believes is her baby and if you offend her you'll die; A chap believes himself to be a judge, constantly preaching courtroom jargon; A nymphomaniac wanting love from anyone who lunges at all men; An ex-Vietnam vet watches over the premises, assuring nobody escapesetc. Soon, poor Charlotte realizes that all is not as it should be and '...a sense of unease creeps over her...' Will she solve the mystery of the Sanitarium before she too is driven insane?If you allow yourself to get with the flow of this low budget horror film, then you might even see the twist in the tail. I won't spoil it for you here","I was surprised how good this film was. The IMDB rating is so low. I'm not sure why it rates so poorly.The biggest problem with the flick is that it had a miniscule budget. The overall look is fairly shabby - a very thin production. BUT it has everything else you want in a cheapo horror flick...the script is original, the acting is actually decent, bordering on pretty good for a few characters. The camera work is creative. The heroine is a babe.\nA bit of gore and a bit of suspense. Seasoned horror junkies may be able to guess the main gimmick after the first couple of scenes, but it is still worth watching. The film does provide a couple of minor twists that you won't guess though. If you are looking for bland and well produced then perhaps you should stick with Phantom Menace. If you want to watch a nifty little throwaway horror flick, try Dont Look In The Basement.","If you love drive-in cheeze from the early '70s you will just love this one.How could you go wrong with a low budget film about bloodshed in a lunatic asylum? You can't! Crazy folks and sharp objects are always an entertaining combination.The film looks like it was shot inside someone's house for about $320.65. For me that just ads to the fun of watching this type of stuff.The gore is a bit mild compared to others of this ilk,but there is enough to keep us bloodthirsty sickos (like myself)happy.Some horror films drag in parts and leave you waiting for something to happen.That's not the case here.The characters are entertaining enough to make every frame quite enjoyable.There is never a dull moment from start to finish.The mind melting climax at the end that is just unbelievable. I liked it so much that right after the end credits I watched it a second time.It's an absolute must see for any self respecting drive-in horror nut.9.5/10 on the Drive-in-Freak-O-Meter...required viewingYea I love you..I DO love you...now take your Thorazine and put your clothes back on...please....8)","Take an ensemble cast of good B grade actors, give them a good script, a somewhat original premise, and unobtrusive directing, and you may end up with a film that over-achieves as much as \"Don't Look in the Basement\" did.The film takes place in a large house which is home to several psychotic individuals. Before the plot even begins, the head of the hospital is chopped up by one of the patients with an axe. Then Rosie Holotik enters the hospital looking for the axe victim and finds that the hospital has a new head who is not at first willing to honor her agreement with the deceased Dr. Stephens. Soon, however, Dr. Masters reconsiders and Nurse Beale (Holotik) is hired. The rest of the film builds tension and successfully develops the individual psychoses of the in-mates. After a while it becomes very unclear who is a patient and who is a doctor.In the end, Don't Look in the Basement is a cleverly plotted film which benefits from generally good acting and directing and not-overly-ambitious camera work. A must-see for B horror fans, and an interesting diversion for those interested in psycho-dramas and psychological thrillers. Be warned, however, this film is slightly more gory and sexy than the average horror film of its time.","S.F. Brownrigg is surely one of the most overlooked directors in the slasher genre with Basement being his masterwork. The plot concerns a young nurse (Playboy covergirl Rosie Holotik) who takes a job at a secluded mental hospital. Upon her arrival, it transpires that her employer has been killed by one of the patients and the place is now being run by strict disciplinarian, Dr Masters. Make no mistake, this is a horribly under-staffed operation. The lunatics truly are taking over the asylum and you really have to feel for the young nurse. Tough first gig. The basement figures only very briefly and towards the end of film. It is, in fact, the safest place in the house because the rest of the place is pure madness. I can only assume that Don't Look in the Basement was perhaps an afterthought as a title, possibly forced on the film by the backers to make it sound more scary as the title card appears to have been dropped in arbitrarily and does not match the other titles.  Scenes worth watching for are the Judge attacking the doctor with an axe and a broken rubber knife in the final bloodbath. Forget One Flew Over The Cuckoo's Nest. This is the stuff.","Charlotte Beal arrives at an isolated country mental hospital to become a full-time nurse there. She is confronted with a motley group of crazies and a seemingly crazier supervisor. Is Dr. Masters all she seems to be?DON'T LOOK IN THE BASEMENT is one of the best low-budget movies in the genre and why people always put it down is beyond me. The acting is excellent, my favorite performance being by Betty Chandler as Allyson the nymphomaniac. The chills just jump right off the screen. You probably won't have to say \"It's only a movie, it's only a movie\", it isn't that scary, but it should appeal to any horror fan who respects the low-budget horror genre, which I do. It is very hard to make a creepy film on a low budget and few actually succeed. AXE is another cheap film that is looked down upon. Maybe people are so spoiled by the big budgets of recent films that any movie that doesn't have excellent effects and/or isn't considered a classic doesn't have a chance with an audience. But I think that after people see this movie, they will see how important the low-budget horror genre is and this movie is a classic that stands out among the other rubbish.","You'll either love or hate movies such as this thriller set inside a lonesome asylum in a far off lonesome land. It's not so much of a horror show, but a concoction of frightening imageries and wackozoid mental patients. \"Scream\" is the best term to use in what was obviously a popular drive-in classic noted for some strange and wicked behaviors. Notice the \"judge\", who's about to put on the ax from behind the doctor! Brr-r-r-r!!! Not much else can be described here other than some bloody tasty goodness, but when you get a chance, remember the familiar old saying by the hag lady: \"Get out! Get out! And never ever come back!\". Don't you wish you haven't looked in the basement?","There's not much I can add to the positive reviews of the film, other than I agree completely - this weird little movie has a unique atmosphere all its own.  Brownrigg creates a very effective atmosphere of obsessive madness; the movie breathes down your neck!  It's amazing that a film so well-lit and full of bright colors can be so unsettling.  As someone mentioned, the film looks like a retitle because there's a strange title card inserted, but I have seen a televised version of the film that had the original titles superimposed on-screen - they were orange and read \"Don't Look In The Basement\" - with quote marks around them, just like that.  Why they were taken out and replaced by that garish title card is a mystery to me, but the originals did exist.  Another interesting note:  I read in an old horror magazine that during the climactic massacre, Brownrigg wanted to make things ultra-gory and so he used a lot of slaughterhouse entrails (sheep, I think), and they were kept in a bag with fake blood.  Well, when it came time to film that scene, it was hot in the room, and the entrails had begun to rot, so when the actors tore the bag open, they all nearly vomited at the stench! If you look really closely around the edges of the frame, you can get little glimpses of some entrail... but, to my knowledge, they aren't graphically shown in any prints.  In any case, check this movie out... it proves that a low budget can be made up for with a lot of imagination. There's no other film like this...  I also recommend Brownrigg's other movies.","Like the review before me, people were a little too critical on this film. Delivered very well with a great cast. My friend and I watched it a few days ago and he guessed the plot early in the film, and said \"It would be awesome if this happened\" Which it did, so it was really cool- It has a good story and twists and keeps you guessing. Sometimes it's a bit humorous, but the setting and mood was delivered well. This is a good film to watch with some buddies or a special someone. It will keep you interested until the very end, and will give you that good IL' Horror feeling. If you're looking for a pretty gory, weird movie- Don't look in the Basement is definitely it.","This film kicks off as I thought it would go on, in that a mental patient slays his doctor with the business end of an axe. However, considering that was included on the Video Nasty list in the 80's, it isn't very gory. I fully understand and agree with the idea that buckets of gore does not make a movie great, but when I'm watching a shocking, previously banned Video Nasty; call me old fashioned, but I generally expect to see gore. Still, the film does have other redeeming features.The acting isn't one of them however; when watching a film like this, one doesn't go in expecting to see great performances, but some of the acting in this movie was so unbelievably below standard that at times even I, a fan of shock horror with bad performances, cringed. The old woman that later has her tongue removed is a particular cause for concern on this film's acting resume; I know that the roles of the mental patients are meant to be fairly quirky, but this one was downright insulting. The rest of the bad performances come from unknown actors, most of which would never go on to make another film, or at least another film of note; and that is quite fitting really.Another feature of the film that isn't redeeming is the way it is filmed. If I said that it was unprofessional, I'd be right; and I am right, the movie is unprofessionally filmed. Because of this, the whole piece stinks of amateurs at the bottom of their craft. I know that you cant expect fabulous cinematography from a film such as this, but the fact that it is bad makes sure that the film faces an uphill struggle from the start; it looks bad, and for some that will mean it is bad.However, despite all said so far; this film really does have some redeeming qualities. The characters for one; they're not particularly well done; they certainly aren't deep or fleshed out, but they do make sure that the film creates the right atmosphere for a sanatorium; they're a mixed bag, and although I've never been in a nut house, the one in this film is what I'd expect one to be like. Also of note is the way that it's fairly well plotted; there's always something going on to keep you entertained and it doesn't tie itself up with lots of meaningless plot details, which is definitely to it's credit. The twist towards the end should have been seen coming a mile off by me, but it wasn't, and I think that is to the film's credit also; it catches you by surprise. By the end, it becomes obvious as to exactly what is in the basement, but by then it doesn't matter because the film is nearly over anyway. Overall, Don't Look in the Basement is one of the better Video Nasty's that I've seen, and I've seen a few from that illustrious list. What it lacks in certain areas, it makes up for in others and although it's not very gory, certainly not by today's standards; I'd still recommend this to fans of shock horror cinema.","... but you probably have seen it or else you wouldn't be here. It's so obscure that you probably stumbled onto it like I did because this little known gem receives no word-of-mouth.From the very beginning you know how the storyline will shake out but watching as our innocent redheaded nurse puts the pieces of the puzzle together is high quality entertainment. Most horror films bombard viewers with graphic displays of torture but Don't Look in the Basement plays it subtle, which makes for superior suspense. Note to horror filmmakers: some of us do like subtlety! Lovely and homely nurse Charlotte takes a job at a sanitarium but is dismayed when she learns that the head doctor who hired her had a gruesome accident and she is now the subordinate to a mysterious doctor, who we all know isn't a doctor at all. The suspense is built through Charlotte's unraveling of events with assistance from many of the patients, but which of the patients can Charlotte trust? This is a gem and is my absolute favorite TRUE HORROR movie. I love Re-Animator and Evil Dead but they play more for the HORROR-COMEDY crowd.VIOLENCE: $$$ (Quite tame for horror standards but there is a decent sprinkling of gore throughout the film. The opening scene is classic; no other horror film starts out better, and the end has its fair share of gore as well).NUDITY: $$$$ (Eager to fall in love Allyson (Betty Chandler) spends a good deal of time naked, attempting to seduce half the men at the sanitarium. Betty Chandler is a knockout and I am shocked that this is her only film credit).STORY: $$$$ (The story is well handled despite the premise getting a lot of mileage in Hollywood. The script has a knack for building suspense and never fails to place poor Charlotte in a precarious situation).ACTING: $$$$ (Betty Chandler does the best job here as Allyson, capturing dementia with naiveté in an ethereal form. The Judge was splendid as well, weighing facts before he came to a verdict while Rosie Holotik as Charlotte gives a genuine performance as you will feel for her character.","The Forgotten (AKA: Don't Look In The Basement) is a very cheaply made and very old looking horror movie.The story is very slow and never really reaches anything worth getting excited about.The patients at the asylum are embarrassingly funny especially Sam and the old woman who always quotes an old saying to everyone. (Look out for the bit when she gets close to the camera, tell me you can watch without laughing!).Now the gore is very poor looking, with the blood looking pink in many scenes so it doesn't really deserve its place on the video nasties list!.Overall if you aren't looking for a fantastic horror film and have some time to spare then it's worth a watch.","If anyone ever assembles a compendium on modern American horror that is truly worth it's salt, there will *have* to be an entry for SF Brownrigg's ubiquetous exercize in Asylum Horror. Every time I watch this movie I am impressed by the complete economy of the film, from the compact, totally self-contained plot with a puzzling beginning and an all too horrible ending, the engaging performances by what was essentially a group of non-professional actors, and a prevading sense of dread and claustrophobia that effectively consumes the narrarive with a certain inevitability which is all the more terrifying because the viewers know what is going on long before the hero[es], with the only question being when are they going to wake up & smell the coffee?Shot on a dental floss budget in Brownrigg's native Texas at an old palatial manor that nicely serves as the setting for a private sanitorium, DON'T LOOK IN THE BASEMENT is another intriguing twist on the good old Edgar Allan Poe tome about inmates taking over the asylum just before an otherwise \"normal\" outsider unwittingly joins the ranks without realizing until it is far too late that not all is what it seems, they are totally cut off & beyond any outside help, and inevitably find their own sanity questioned as the madness spins out of control -- The Original STAR TREK TV series had a go at this with their WHOM GODS DESTROY episode from 1968, Juan Moctezuma gave the proceedings a peyote fueled Mexican psychedelic trip in DR. TARR'S TORTURE DUNGEON in 1972, and tangentially related is Fernando Di Leo's ASYLUM EROTICA/SLAUGHTER HOTEL, which injects the elements of an unknown killer and an ending that can only be defined as \"Splatter Cinema\" -- Brownrigg may not have seen or been thinking of SLAUGHTER HOTEL, but he sure came up with some similar ideas.Legaliciuos former Playboy Playmate Rosie Holotik plays Charlotte Beale, RN in Clinical Psychology, who has just left her nice job as a supervisor at a major hospital to travel way out into the middle of some god forsaken waste right out of a Peckinpah movie to work with a Dr. Stevens at his private sanitorium. Dr. Stevens has pioneered a new form of therapy based upon basically encouraging the emotionally & psychologically scarred to face their inner obsessions, bring them to the surface and hopefully rid the patients of whatever has fried their sense of reasoning. Nice idea, but arming a 6ft 250 pound utterly insane man with an axe and telling him to pound out his aggression AND THEN TURNING YOUR BACK ON HIM probably isn't the smartest idea, and Dr. Stevens is dispatched before Ms. Holotik even appears onscreen with a good whack to the lower portion of his skull.This event leaves the sanitorium effectively in the hands of one Geraldine Masters [actress Annabelle Weenick, who also served as the script supervisor & production manager], a woman of startlingly professional demeanor who quickly defuses the situation with the help of Sam, the film's wonderfully unlikely hero, a lobotomized African American boheomouth played by an actor named Bill McGhee who was sadly robbed of a supporting Oscar nomination for his turn as a mass of muscle with the brain of an 8 year old boy. Sam's one wish is to have someone help him put his prized toy boat \"in the water\", and his continual asking of the various female cast members to do so [and his nonstop consumption of chocolate popsicles] as *SOME* kind of underlying theme, though we will avoid such here because the kids might still be up. There is also a quick subplot about a staff member who has decided to leave after being threatened by one of the patients, but I'll leave the details of that to your discovery.Ms. Holotik arrives just as Dr. Stevens has been effectively laid to rest and is quickly won over by the snappy professionalism of Ms. Masters, who reluctantly allows the leggy young nurse to stay on in spite of the tragedy that has just happened, oh, TWENTY MINUTES AGO, which you must admit was rather sporting of her. Holotik's Nurse Beale begins to demonstrate symptoms of not being the sharpest meat cleaver in the drawer, however, when informed that she shares living quarters with a bunch of maniacs and there are no locks on the doors & doesn't trudge off for the nearest Ace Hardware Store to pick up a hasp and padlock to secure herself, and we are treated to a couple of truly creepy scenes where some of the inmates sneak into her room & do stuff like smell her hair, try to kill her with butcher knives and caress her neck with axe heads. But that's all a part of working in such a radical psychiatric health care environment, Ms. Master's informs her, and she goes about her oddly defined \"rounds\" that consist of wearing as leg defining a nurse outfit as you can find in a 42nd Street fetish boutique and getting to know the inmates.Allysson is a obsessive compulsive nymphomaniac with homicidal tendancies who likes to take off her shirt & provide the film with some T & A between fits of histrionics; Harriet is a young former mother who let her child die in a stupid accident and now dotes on a beat-up old doll that she is also homicidally protective of; The Seargant is an actual seargeant [and implied Vietnam vet] who's negligence led to the death of his platoon, and now watches from the window with binoculars for the approach of an unseen enemy; Jennifer is a Phish fan who couldn't score a ticket to the New Year's Eve Show and went insane & likes to scarf down nembutols and other barbituates when nobody is looking, and likewise has hidden homicidal tendancies linked to her inability to find a bra; Judge Cameron is apparently a homicidal pervert who became obsessed with his own sense of power and now likes to chop things up with axes; Ms. Callingham is an aged poet who serves as a sort of soothsaying old hag from MACBETH before the cat gets her tongue; and Danny is an insane idiot who was included in the cast as the random element that the plot cannot control, and who's antics serve as the real catalyst for the series of tragedies & murders that ultimately take place in this dark, old, creepy house in the middle of nowhere.The house itself is a wonderful set, with a threadbare early 1970's decor that is remarkable in it's unremarkableness, with a fantastic use of color achieved by subtle ambient lighting. The house is a series of hallways and rooms with shiny brown wooden floors, twisting, confined stairways, secreted closets and passageways leading to the different larger areas, and of course the basement mentioned in the title -- visited only once, but boy it sure proves to be a doozy! I love the frosted old freezer where Sam keeps his stash of popsicles, the utterly plain exteriors that remind me of a summer home our family used to visit every year & force us to swelter in the heat: Everyone is covered with beads of persperation and looks exhausted, and even the ever cheerful Sam at one point begins to suspect that bad things are happening, though he cannot understand what it all means and Rosie H. is too firm in her belief of her profession to even suspect what has really happened, and while Ms. Holotik's limitations of an actress may have diminished the effectiveness of her Big Revelation scene, she's a great screamer when all Hell starts to break loose, and Brownrigg indulged of some nice camera shots of her in various suggestive poses or stages of undress that show off what a pretty lady she is without exposing anything more than her contract stipulated. Too bad!The real show stealer is Sam, however, and fans of what I have been taught to refer to as Splatter Cinema will not be disappointed by the rather shocking finale, and there is something moving about how Sam runs to the protection of his friend and brutally kills everyone within arms reach in a matter of seconds that either suggests he was one mean motha before his lobotomy, or the film is CUT. In any event you won't be prepared for the ending the first time you see it, even though you as the viewer know what the score is long before anyone else in the film has put it all together.\nExcept for one person: Rhea MacAdams' uproariously stereotyped old coot Mrs. Callingham [who seems to be inspired by the Donald Sutherland Old Woman character from the Michael Reeves' 1964 Christopher Lee film CASTLE OF THE LIVING DEAD, in addition to a rather nasty death by round spike to the eye], who not only predicts the future, but has the film's most laugh out loud amusing bit of dialogue while on a walk in the garden with Ms. Holotik that runs something like this --\"It's really beautiful out here. Do you get out much, Mrs. Callingham?\" asks Holotik, to which the old woman replies\"It's YOU who needs to get out.\"Hilarious, and one of those things you gotta kind of see for yourself to \"get\". DON'T LOOK IN THE BASEMENT is available on at least a half dozen \"bargain bin\" codefree DVD releases by companies like Brentwood Home Video, Diamond Entertainment, VCI and Platinum Disc Corp.'s HORROR CLASSICS series; I kind of like Alpha Video's sexily gorgeously decorated $6 release from 2003:Dig through those bargain bins! But make sure you get one with the 89/90 minute print contained therein; an older 83 minute version is downright confusing due to some of the trims, and you really need to see the ending credits as intended to bring this sick, twisted and surprisingly entertaining yarn to it's end.Masterpiece? Maybe not compared to THE EXORCIST or ROSEMARY'S BABY, but it is a very uniquely American horror film, and a genuine classic of the drive-in age that deserves to be rediscovered by anyone looking for something made with more than just a little bit of brain juice, and not a penny more than they absolutely needed.***1/2 out of ****","I actually had to watch this movie in 5 sittings. Getting through 20 minutes of this garbage without turning it off is a tedious chore that Iassume very few will accomplish! I heard this was supposed to be a thriller. I even read somewhere that it was gory. This isn't the case, as it's obviously some sort of low budget drama more akin to a bad Mexican soap than to an actual horror or thriller flick. The acting isn't bad at all, but those boring, rambling dialogues that just drag on forever will easily put you to sleep. In the end what was supposed to be a gory horror movie turns out to contain about 3 or 4 murders, all taking place during the last 3 minutes of the film, in which some red paint is sprayed onto the wall and the actors' shirts. If you're looking for any sort of horror, gore, murders, etc, just stay away from this crap.","I watched this film because it was on the DPP's original video nasties list, but how it was included on there is a mystery. It doesn't have hardly any nasty scenes, just one at the end. The film is about a group of ludicrous inmates in an asylum who begin to take over it. The inmates include one who thinks he's a judge, one who thinks he's a soldier (and is strangely allowed to dress as one), another who is besotted with a toy boat in a bath, a nymphomaniac, and an old lady who says some unusual things. A nurse is assigned to the place and witnesses all these characters' behaviour and more. But the film is so cheap and lifeless, it doesn't hold your attention. It ends up being risible and absurd, and can't escape the asphyxiation of its low budget.","Nurse Charlotte Beale(the lovely Rosie Holotik)has arrived to Dr. Stephens' clinic for the insane prepared for a new job. What she doesn't expect is to find another supposed doctor in his position after Stephens is attacked by axe-wielding maniacal \"judge\" Oliver W Cameron(..in a running gag, anytime he confronts a situation out of his control, he retreats to repeating his name). That doctor is Geraldine Masters(Annabelle Weenick)who isn't sure about whether Beale is a proper fit for their establishment. After a long discussion about the position(which is quite an awkward scene as the two debate about Beale's being sent a letter by Stephens getting a job at the clinic with Masters often reminding her that he is no longer in charge)Masters agrees to let her work in the nursing position, but the good Doctor may not be who she seems..The assortment of loonies includes Sam(Bill McGee)a simple-minded child-man who was Stephens' last victim of lobotomy, Jennifer(Harryette Warren)a woman who needs an adult to comfort her as she wallows at Masters' heel like a puppy, Danny(Jessie Kirby)a trouble-making annoyance often trying to steal the fake baby of disturbed Harriet(Camilla Carr), Allyson(Betty Chandler)a sexy nympho who just wants to be loved and hops at any man she sees, & \"Sergeant\" Jaffee(Hugh Feagin)your typical case of soldier who hasn't escaped the madness of war.The film shows Masters' unorthodox methods of running the clinic with allowing the patients to roam free with the doors to all rooms without locks calling into question..and, not to mention, the fact that Oliver is still allowed to walk around despite just chopping Dr. Stephens with an axe. And, what exactly happened to Dr. Stephens? Ah ha..Tacky 70's drive-in trash is a lot of fun if you are into a warped brand of cinema. I'm attracted to bizarre flicks about mental rejects because of their unpredictable nature..you just never know what the hell might happen, especially in this case where they are allowed to roam often unattended. Some consider the low budget a liability, but in the case of this film, I think it enhances the experience. With the cheap photography and weak production values(being shot for peanuts in a run down house in some awful location)it seems creepier and I felt like a voyeur peering into insanity through a camera lens on the outside looking in.","Dr Stephens (Micheal Harvey) runs a mental asylum. He has a different approach to the insane. He conducts unorthodox methods of treatment. He treats everyone like family, there are no locks on the patients doors and he lets some of the inmates act out their twisted fantasies. He lets Sergeant Jaffee (Hugh Feagin) dress and act as a soldier and Harriet (Camilla Carr) be a mother to a doll, including letting her put it to bed in a cot. Dr. Stevens is outside letting Judge Oliver W. Cameron (Gene Ross) chop a log up with an axe, it turns out to be a bad move as once Dr. Stevens back is turned the Judge plants the axe in his shoulder. Soon after Nurse Charlotte Beale (Rosie Holotik) arrives at the Sanitarium having arranged an interview with Dr. Stevens about a possible job. She is met by the head Nurse, Geraldine Masters (Annabelle Weenick as Anne McAdams) and is offered a trail position. She gets to know and becomes well liked among the patients. However things eventually start to turn sour, the phone lines are cut, an old lady named Mrs. Callingham (Rhea MacAdams) has her tongue cut out and she starts to get a strange feeling that things just aren't right somehow. Then, one night all the Sanitariums dark secrets are violently revealed. Produced and directed by S.f. Brownrigg this film has a great central idea which builds into a cool twist ending, but ultimately is a bit of a chore to sit through because of it's low budget restrictions and a rather slow script by Tim Pope. There are just too many long boring stretches of dialogue by the inmates, not a lot really happens until the final twenty odd minutes. The film has no real visual quality as it's set entirely in the Sanitarium and it's grounds which is basically just a big bland house in the middle of nowhere. There's no graphic gore in it, a few splashes of blood here and there and thats yer lot. There's a bit of nudity, but like the gore not much. The acting is pretty strong, especially Holotik and Weenick. The photography is flat and unexciting and I can't even remember what the music was like. The twist ending is great, but it just takes far too long to get to it. A film that had a lot of potential that was probably held back by it's budget. OK I guess, but I think it would have worked a lot better if the story had been turned into a half an hour 'Tales form the Crypt' episode.","The tag line is correct - remind yourself it is only a movie. This movie has no excuse for its problems. First of all why did they change the title of the version I was watching from \"the forgotten\" to \"don't look in the basement\"? Come on - spoil the movie right there - it was so slow I kept yelling at the screen - go on look in the basement already - make something happen. It wasted so much film watching Charolette fill up her coffee cup, watching the patients stare off into space, or just wander up and down the stairs, that this is one of the slowest gore/horror movies in existence. They bring in the one non-sanitarium related character in the entire movie and he is a babbling idiot i.e. \"How come you people didn't call about your telephone - It can't be working\". I was sick of the flute and organ music before the opening credits and it got worse from there. The patient/staff interactions were the best part of the movie too bad they couldn't relate them anyway to the plot. And every now and then the director remembered this is a horror movie so they cue Danny in to jump out and scream at random intervals. Never mind the fact that they over-steroetyped every mental illness to the point where I actually feel sorry for anybody with a psych problem watching this ridiculous farce. There was no human in any of these patients only the disease. Don't bother watching this more than once - unless you want to make 90 minutes last all day.","I personally have a soft spot for horror films that are set in hospitals and asylums so I had a good feeling about watching this \"Don't Look in the Basement\", even though its reputation is doubtful. Well, turned out I was right! This is great, trashy entertainment with a couple of efficient shocks and delightfully absurd characters. You have to, of course, look beyond the poor productions values and the completely illogical plot but, if you manage to do that (and if you're a fan of this type of horror, that's an essential quality), you'll be rewarded with an outrageous \"video-nasty\" in which blood and insanity form the main elements. The young and cute nurse Charlotte arrives at a remote sanitarium where she's supposed to start her new job. She finds out that the Doctor who hired her was killed by a patient and the replacement doctor-in-charge Masters seems reluctant to accept the new arrival. The life inside the sanitarium is rather peculiar, with the patients running around free and every door is kept unlocked. After a whole series of bizarre events, Charlotte discovers the horrific secrets that the institution hides.... The opening 10 minutes (pre-credits) are great and so is the completely deranged climax. Everything in between is pretty much without surprise or tension but you patiently wait because you just feel that the finale will be wild fun. The asylum's patients are textbook lunatics, but I love them nevertheless. Some of my favorites include the former judge (who still talks exclusively in legal terms), the suspicious army-Sargeant and the mad-raving old lady. \"Don't Look in the Basement\" is great low-brained fun, especially recommended to fans of 70's trash-cinema, sick puppies and other types of scum. The lunatics have taken over the asylum, yeah!!","Dr. Stephens runs a secluded sanitarium with a small group of mental patients, one of whom uses the ax that was supposed to be for therapeutic wood-chopping to cut down Dr. Stephens. Now, Dr. Masters is running the asylum alone with her brand-new nurse, who does her best to befriend the eclectic group of wackies: the shell-shocked ex-sergeant; the lobotomized Popsicle-sucking child-man; the puritanical former judge; the doom-dealing old woman; the would-be mother to a baby doll; the giggling, clown-haired prankster; the needy nymphomaniac; and the mainly catatonic young woman who occasionally indulges in knife attacks. The pretty young nurse was eager to work with the forward-thinking Dr. Stephens, but finds his successor to be less than welcoming and the hospital to be less than wholesome.An incompetent and uninformed screenplay about a mental hospital and bad actors playing mental patients is a recipe for unintentional hilarity. Is this low-budget horror schlock funny enough for fans of bad movies? Yes, but expect some tedium along with the priceless gems. The movie is especially irritating after its twist ending, which doesn't actually end the movie, but sends it whirling aimlessly along. Luckily, the gruesome climax is hilarious. Other good parts include the goofball telephone man, who provides comedy relief that is funny for the wrong reasons. And then there's the exchange between the nurse trying to make small talk and the old woman who can't get off her ominous-warning kick. \"Do you get out much, Mrs. Callingham?\" \"You're the one who needs to get out!\"","Back in the 70's, a small-time Texas filmmaker named S.F. Brownrigg directed a handful of surprisingly decent low-budget drive-in horror flicks which seem to have developed a small cult following over the years. Before viewing his first film, Don't Look In The Basement, I wasn't too sure what to expect, but I sure as hell didn't expect it to turn out to be the only Texas horror I thought was better than the Chainsaw Massacre. I don't know, this might actually be my all-time favorite horror movie.We begin in an isolated insane asylum. At first, it seems like a rather laid-back place to get mentally healthy, considering all the patients are allowed to roam around freely and whatnot, as if it were their house (I guess it is). none of them seem all that dangerous, only delusional. The residents include a love-nympho, a 700 year-old woman, a man-child, a spaz, a guy who thinks he's in a war, a woman who thinks she has a baby, and a guy who thinks he's a judge. One day, out of nowhere, Judge kills the doctor with an axe, shortly thereafter, the wanna-be baby mama kills the nurse. Ten minutes into the movie, and things are looking really ugly. Perhaps the new nurse will know what to do, then again, perhaps not. Giving away more would do more harm than good. It's best to plunge head first into this one, knowing as little as possible. If you can appreciate honest-to-God, untampered with horror, then you will not be disappointed. If you liked Scream, if you liked Wrong Turn, if you go for that unoriginal, over-produced, over-scored digital Hollywood garbage, then chances are high you just won't see the beauty in this one. Don't Look In The Basement, being a first attempt makes the quality all the more shocking. The atmosphere and the graininess fit into the location and the score like a glove. Unfortunately, good ol' S.F. used up most of his good ideas on his first movie, although, the next entry in his Texas Quadrilogy, is somewhat of a masterpiece, that is, if you're into extra sleazy, mean-spirited, Hixploitation like someone I know. If you fall in love with Brownrigg's first two, and absolutely must find out what else he had to offer, check out Don't Open The Door, and The House Where Hell Froze Over. Don't Look in The Basement has everything that successful horror needs, no stars, no budget, no digital effects, just an original story brought to life in an insane asylum, with a dozen cast members, and a somber, subtle score, and of course, the twist. This is real horror for the real horror fan. 10/10","*******SPOILERS************SPOILERS*********** \"Don't look in the Basement\"  is a great movie.  The acting is very good. Each one of the characters is very well developed and performed by these actors.  Each patient suffers from a different kind of madness;  there's a judge, a mother, a seargent, a nynphomaniac, a murderer, a joker, a big boy and the surprisingly doctor.  I really liked this movie,  the way in which the new nurse starts realizing the strange things happening around her and how slowly she starts loosing her mind.  This is not the scariest movie I've seen, but it is creepy and original, very suspenseful also.  The detail that I most liked about it, was at the end when Sam massacres every patient and then very innocently sits down in the middle of all the bodies to eat his very favorite grape flavored sucker, that was insane the way he portrayed this mad boy, excellent!  Then at the  very end when they show the credits, they show each one of the massacred bodies with the corresponding name of each of the actors.  I had never seen that on any other movie, it all was very original.","This movie was pretty bad.  First of all, I have to say, the title has really nothing to do with the actual movie.  No one ever says, `Don't look in the basement.'  The basement isn't even referred to or gone into until an hour and 20 minutes into the movie.  And even then, the basement segment is only about a minute long.The acting was pretty horrendous.  Although there were a few interesting characters, it was more silly than frightening.  It reminded me of a cross between `Spider Baby' and `Texas Chainsaw Massacre.'  `Spider Baby' because of all the weird characters, `TCM' because of all the screaming.  Both of those flicks beat this one by a mile.The music was kind of weird, but not in a good way.  It sounded as if it was pulled off of re-runs of `The Prisoner.'  And maybe it was just my DVD, but there was an annoying trail coming off of things when they moved that made the movie almost painful to watch.As for the story, like I said, there were some interesting characters but the basic plot seemed to be written by some sort of crazy person that should've been in the film.  Very rarely did it seem to be going in any coherent direction and when the story finally got around to making some sort of sense, it was very predictable.`Don't Look in the Basement' is a painful movie to watch with no real rewards afterwards.  I wouldn't recommend it.","Working at a psych ward can be a very scary thing. Especially, when you get transferred from a big hospital. For one nurse, it's an experience she will forget. Dealing with people with different psychological conditions can be a handful, but one must have a cool head for it. But during the transfer, one of the original nurses is killed by a patient who has a doll and treats it like it was a real baby. There's one who killed his own platoon; a man name Sam who had one lobotomy too many which makes act like a 8 year-old; and there's a former judiciary clerk who axed the doctor who was about to hire the nurse. When the replacement nurse takes over, it's all about to come together. This place has more secrets than you possibly know. The replacement doctor is really a patient in disguise, and she not only have the doctor killed, she also killed the telephone repair man, which one of the patients took a liking to. She also cuts out the tongue of the elderly patient so she wouldn't warn the new nurse. When Sam decided to let the nurse escape, all the other patients turned on the fake doctor, and utter mayhem is what happens after wards. I'll tell you straight, this movie is crazy. Nothing more I can say about it. 3 out of 5 stars.","I found the film Don't Look In The Basement to be very good, with some great characters in it. It is about a young psychiatric nurse called Nurse Charlotte Beale(Rosie Holotik),who is going to start work at a isolated mental asylum. Whilst there, she meets various sorts of different characters including Dr. Geraldine Masters who becomes in charge of the asylum after the the owner of the hospital Dr. Stephens gets killed by one of the patients by hitting him with an axe.My favourite characters in the film are Mrs Challingham(Reah MacAdams), a very funny little old lady, Allison who is a nymphomaniac, and Sam(Bill McGhee) a young black guy who goes around all Day seeming to be in a world of his own all of the time. The film was a very low budget film but was still a really great film. I know that it was on the 'Video Nasties' list back in the 80's but a did not think that it had a lot of gore in it, Alothough it did have some disturbing senses in it GREAT FILM RECOMMENDED!!!."],"review-user":["Krug Stillo","peterc-8","Drive-In-Freak","mstomaso","Repoman-3","Casey-52","emm","zwolf","katarn11","The_Void","BloodTheTelepathicDog","compact-2","Squonkamatic","daniel_berdugo","Afracious","Scarecrow-88","poolandrews","manicgecko","Coventry","J. Spurlin","Tromafreak","Macabro","steelcorpfilms","GOWBTW","MovieGuy01"],"review-date":["1 June 2003","11 June 2003","10 January 2005","11 August 2006","12 January 2004","28 June 1999","18 January 1999","21 December 2000","5 July 2005","4 August 2004","7 September 2007","14 June 2007","24 April 2004","22 February 2007","6 March 2000","27 May 2007","30 November 2004","5 June 2006","8 May 2005","3 October 2009","5 May 2009","20 January 2000","3 September 2001","29 June 2013","24 September 2009"],"review-rating":["9","5","10","7","10","6","6","10","3","9","1","1","7","3","2","7","8","4","7","7"],"review-title":[" Surprisingly Good!\n"," actually pretty good\n"," A real drive-in clasick!\n"," Over-achieving B grade shock-horror tale\n"," Why? It's a nice basement.\n"," A lovely little low-budget chiller\n"," Prepare to scream!!!\n"," Excellent low-budget madness\n"," Smart Script, Pretty good film\n"," Not as bad as you might expect\n"," The Best Horror Film You've Never Seen.../// might be spoilers\n"," Cheap Little Horror Film\n"," \"GET OUT GET OUT AND DON'T EVER COME BACK\" [Spoiler Alert!]\n"," Absolutely horrible snoozefest.\n"," A dull and lifeless exercise in trashy tedium\n"," Don't Look into the Basement\n"," Good idea, average execution.\n"," Insane people everywhere should revolt\n"," The jolliest bunch of lunatics this side of the nuthouse!\n"," Hilarious enough for fans of bad movies, but expect some tedium along the way\n"," The Brownrigg Masterpiece\n"," Creepy and Original\n"," Warning, only watch if mentally disturbed.\n"," Wasn't all that bad, it's pretty descent\n"," Great low budget film...\n"]}