{"review-url":["http://www.imdb.com/title/tt0052934/reviews"],"review-text":["This is a charming little film, which like many of it's kind, derives it's charm from the circumstances involved rather than the actual dialogue.Glenn Ford (as always) shines through in a great comedic performance as the penniless Air Force officer, married after just one day to gold-digging showgirl Debbie Reynolds.After the one initial wedding night of passion and a life changing move to Spain, the two quickly realise that apart from the strong sexual attraction they feel for each other they have nothing at all in common.However when she decides to give their marriage a go, it is on the understanding that it for one month trial period only and sex is most definitely not on the cards.Ford is also falling foul to his new $40,000 Lincoln Futura Concept Car (the future Batmobile) which he wins in a raffle the same night he meets his new wife.The car is bringing him unwanted attention from the Air Force, who see it as a vulgar display of American wealth and is bringing suspicions of corruption and embezzlement etc. It is also putting him in the 80-90% tax bracket and as penniless as he is he now faces a tax bill of over $17,000. Not the kind of money you should be owing when your wife is the kind of person who spends over a $1,000 on one shopping trip.Even when he tries to sell it it brings him misfortune as selling so much as a cigarette or a pair of stockings to the natives is punishable by court martial, so you can imagine that a $17,500 transaction practically has the firing squad polishing their rifles.His potential purchaser is also causing him problems as he is a disgustingly handsome Bull-fighting Spanish nobleman, who's interest in the car has lead to a stronger interest in Ford's wife, made worse by the fact that a rich jet-set lifestyle is being offered and is what she has sought for so long.With Ford's sexual frustration rising and jealousy in his love rival mounting, coupled with Reynolds' materialistic attitude and flirtatious behaviour around the enamoured Spaniard serving to drive the wedge deeper between the two, it seems that their whirlwind relationship is destined to end.But can whatever love and attraction that threw these two love birds together in the first place, shine through and keep them together?Not the best example of this genre of film, but due to the watchable performances by it's principles and the enjoyable plot line, it is certainly a fine one.","Besides being a slightly better-than-average romantic comedy, this movie features several very familiar television supporting stars -- if you're an old coot like me anyway! -- including Eva Gabor (\"Green Acres\"), Edgar Buchanan (\"Petticoat Junction\"), Harry Morgan (\"Dragnet\" and \"M*A*S*H\"), Frances Bavier (\"The Andy Griffith Show\"), Richard Deacon (\"The Dick Van Dyke Show\"), Marion Ross (\"Happy Days\"), and last, but not least, the Batmobile!","I'll admit, the main reason I watched this was for the car. As is mentioned in the Trivia Section, the car in question is a  Lincoln dream car from the mid 1950's. Very rarely do these cars make appearances in the `real world', as most don't really function. They usually have no engine, or are made from some material that would be ruined if actually driven. These cars spend their life on a turntable at an auto show with fashion models in, or on them. After they serve their purpose, they get destroyed, or stored. Few, if any turn up in movies, as this Lincoln did, and then go on to TV stardom, as well! Ford later sold the car to custom car designer George Barris, and it became the basis for the Batmobile in the TV series \"Batman\". And if you were a kid like me at the time, IT was the star of the show. Sorry Batman and Robin!This is what was best described as a `Bedroom Comedy'. Rock Hudson, and Doris Day made movies like this, with a light amount of `sexual tension' sewn into a light comedy movie. You never saw 'anything', it was left to the viewers imagination, what happened.The film itself is decent enough. I like most anything that Glenn Ford did, and Debbie Reynolds turns in another good performance here. The supporting cast is peppered with plenty of folks who, like the car, went on to fame on TV, Eva Gabor, Harry Morgan, Edgar Buchanan, and of course, Francis Bavier.The country side of Spain is beautiful, the acting is competent, so I'll give it a 6 out of 10.","It Started With A Kiss is the first of two successive films that George Marshall directed Glenn Ford and Debbie Reynolds in. The second was The Gazebo which I like much better. Not that this service comedy is without merit.Ford plays an Air Force Sergeant on leave who both buys a raffle ticket from Debbie and then winds up marrying her. The prize is this $40,000.00 car which would now be worth about $200,000.00 in today's money value. When Ford goes back to Spain where he's stationed, Debbie follows him and the car follows Debbie.Debbie's having a few second thoughts about her hasty marriage and has put the brakes on the sex part of her relationship with Ford, trying now to get to know the guy she's married to. Each of them gets some temptation thrown their way, him with Eva Gabor, her with bullfighter Gustavo Rojo. But the biggest problem is that car. They can't drive it around as they are warned against ostentatious displays of American prosperity. Glenn finds he can't sell the thing and on top of that as the prize in a lottery, it's subject to taxation like quiz show earnings. What to do?In Peter Ford's recent biography of his father, he says that this film with Debbie Reynolds and The Gazebo that came after was at a critical time for both. He was ending his marriage to Eleanor Powell and Debbie was the odd girl out in the Elizabeth Taylor-Eddie Fisher-Debbie Reynolds triangle that was front page for months. The two did a lot of commiserating on both sets.Peter Ford also mentions that his father loved working with director George Marshall. I've done some reviews myself of their joint collaboration and have said they are an unfortunately unheralded actor/ director collaboration.Fred Clark has a nice part as a most harried Air Force general who has to deal with Ford and Reynolds marital and motor problems as well as a visiting Congressional delegation. Long time Ford friend Edgar Buchanan does well as an acerbic Representative.It Started With A Kiss is not as good some of the other Ford/Marshall collaborations, but it has a few good laughs and should satisfy fans of Glenn and Debbie.","Half-price showgirl in New York, pining for a millionaire husband, marries lovestruck, underpaid Air Force Sergeant on the eve of his leaving for peacetime duty in Madrid; she follows, bringing misunderstandings, comic embarrassments, and a \"car from the future\" with her. Sex-based shenanigans for stars Glenn Ford and Debbie Reynolds is pleasant enough, particularly for the first forty or so minutes; after that, it deflates. Debbie, thinking she and Ford married for the wrong reason (sex), decides they should be platonic for a month--leaving Glenn to sleep on the sofa (when he's not taking cold showers). Movies based on misconceptions between characters have to be awfully smart to keep our interest (and keep us laughing), but this script by Charles Lederer, based on a Valentine Davies story, seems about ten years out of touch with the times. Ford thinks Debbie means she's pregnant when she writes that she has a big surprise, even though they've only been married for a month. When he meets her at the airport, she tells him the surprise could arrive the next day...and he STILL thinks she's talking about a baby! It's all in good fun, but these actors are much too smart to palmed off as dummies. ** from ****","I missed this one when it was released, being warned away by mostly negative reviews and the objections of the Catholic censorship body of the time. (I believe some facsimile had replaced the dreaded Legion of Decency by 1959, the year of its release.) The prudes objected to the generally \"suggestive\" tone of the proceedings and, after watching it on a Turner Classic Movies broadcast recently, I can see why their knickers got into a twist. Even by today's much more relaxed standards, its situations and its treatment of marriage are pretty sleazy.It's a rather lame \"bedroom farce\" that makes poor use of the talents of nearly everyone involved and its main redeeming assets are the location shots of several Spanish cities and its countryside and the gorgeous Lincoln Futura concept car (which lost its eye-popping fire engine red paint job when it was transformed into the Batmobile for the campy Batman TV series).For some reason M-G-M brass at the time thought that the chemistry between Glenn Ford (dull as dishwater, as usual, and sporting one of the worst and greasiest-looking haircuts on a leading man ever) and a very pert and pretty Debbie Reynolds was worth exploiting. Their second co-starring vehicle, \"The Gazebo,\" was rushed into production and released just four months after this one. Debbie was soon free of her M-G-M contract and went on to appear in somewhat worthier enterprises at virtually all the other major Hollywood studios, with an occasional return to her launching pad at Metro.","\"It Started With a Kiss\" is a movie that has several funny story elements but the overall picture never quite works. Much of it is because the characters (particularly Debbie Reynolds') don't make much sense and were poorly written.When the film begins, an Air Force sergeant tries repeatedly to pick up a model working at a charity event. Joe (Glenn Ford) is boorishly persistent...something considered acceptable in films back in the day, though with changing attitudes he'd DEFINITELY fall into the category of a sexual harasser today! Maggie (Debbie Reynolds) isn't impressed and repeated tells him to get lost. In a last ditch effort to get her, he kisses her...and apparently is such a stud that she falls for him and they immediately marry. Does this make sense? No.Two days later, Joe is flown to duty in Spain and she is to follow a month later. During this time period, she learns that Joe's lone raffle ticket from the charity event was THE winner...and he's the new owner of the Ford Futura--a one-of-a-kind concept car*. She writes Joe that she has a huge surprise for him. He, oddly, assumes that means she's pregnant...but considering they only were apart a couple weeks at this point, you can only assume Joe is a total moron and knows nothing about sex education. Even if she WAS pregnant (which she wasn't), she wouldn't have known for sure for at least a couple months. Does this make sense? Nah.While in Spain, the Air Force personnel are told to not be ostentatious about money and be conservative...and then Maggie shows up with the spectacular car! However, when Joe's commanding officer tries talking with her, she repeatedly treats him like crap...and with open contempt. So, your husband is a sergeant and your wife is mouthy with the Major. Does this make sense? Nope.After Maggie arrives, she has the bright idea that because they really didn't know each other AND because they have little in common other than sexual attraction. Because of this, she insists that they sleep apart. Does this make sense? Not much...and there are a lot of scenes showing a VERY frustrated Joe!Soon, the couple learns that they are in serious trouble with the Internal Revenue Service. Why? Because they won a $40,000 car (probably worth about $200,000-300,000 in today's money)...and they owe $17,000 in taxes on the car...on a sergeant's salary!! They never even thought of this!! Does this couple seem like they have a brain between them? Nah...especially when Maggie doesn't seem to understand that they cannot keep it!Later, the General is upset (and understandably so) because not only has the Sergeant been showing off by driving around with the car but he sells it to a bullfighter for $17,000. So, Joe just eats the $23,000 difference...and the bullfighter was 'willing to pay ANYTHING to get the car'! And, now he's in trouble with the General. So what dumb thing do they do? Maggie begins yelling at the General and threatening him!The film goes on and on like this...with two really incredibly stupid people doing incredibly stupid things. This makes it difficult, if not impossible, for the audience to care about these dodos...especially Maggie. The bottom line is that the film has amusing moments but the overall picture just doesn't make sense or work well. All you know is that Joe and Maggie are stupid...but have great sexual chemistry together. All in all, a very disappointing film with little to recommend it other than the car!*This bright red Futura went on to become very famous. Hollywood paid to have it completely restyled and repainted and it became the Batmobile on the \"Batman\" TV show! I am sure today it's worth considerably more than $40,000. In fact, it recently was sold for $4.62 million!!!","I think that this film is one of the funniest films i have ever seen. I think Debbie Reynolds is hilarious and the chemistry between her and Glenn Ford is perfect. There is not a dull moment in the film and Debbie looks beautiful as always. The story is about a showgirl Maggie(Debbie Reynolds) who meets a penniless soldier Joe (Glenn Ford). She takes an instant dislike to him but after he accidentally tears her dress, he returns it to her on the condition that she goes on one date with him. They end up getting married the night they have their date after just one kiss. Joe and Maggie move to Spain and find they have nothing in common but physical attraction, so Maggie proposes that for one month they live but not as man and wife which means that Joe is not allowed to kiss or sleep with Maggie, much to Joe's frustration.A hilarious plot and a wonderful film. Not to be missed.","Run of the mill romantic comedy with Ford as a harried newlywed with big time financial and spouse woes. The wife expects him to be a celibate and at the same time causes him to be jealous as she gets cozy with a local bullfighter. A few laughs but merely mediocre for the most part.","All in all, a mildly entertaining time capsule of days gone bye, bye; the \"good old days\" when couples married so they could have \"legitimate\" sex. Debbie Reynolds, a chorus line cutie is at her perky peak, and Glenn Ford, an Air Force sergeant, is his usual dull-as-dishwater leading man. This genre of bedroom farce popular with 1950s' audiences is full of contrived complications, titillating juvenile sexual innuendo but is overall wholesome movie fare.If the Catholic arbiters of morality objected to this movie upon its release, I wonder how the fiery red futuristic car passed condemnation? It's the sexiest thing in the movie. What a babe to ride! Ford's commanding officer tells him the State Department deems the car too \"splendiferous.\" This Lincoln concept car certainly had star power; it went on to be cast as the infamous Batmobile. As the backdrop for the film is Spain, how could the cultural trope of the heroic bullfighter not be included? So that's inserted into the high jinks too. Olé!","I saw this film with my parents at a drive-in in 1959, and I was mesmerized by the fabulous Lincoln Futura, the best of the 1950s \"dream cars\".As a devoted sci-fi fan, this car was the very essence of the \"future\". The Futura implied predictions of a future similar to those presented in movies like \"Forbidden Planet\". It was an example of the kind of superior technological design which I eagerly anticipated in the decades to come.Predictions like this were why I loved to watch Disney shows like \"Mars and Beyond\", \"Tomorrow the Moon\", and \"Magic Highway USA\".","The main attraction going for this film is the futuristic car shown in it, which for 1959 looked way ahead of its times. The comedy, as directed by George Marshall tries to be a movie exploiting the sexual tensions between the two stars. The same premise was achieved with better results in other films of the era, notably, \"Pillow Talk\".The mere idea of a young married couple putting such a barrier between their sexual life is risible, at best. The two stars, Debbie Reynolds and Glenn Ford try their best, but are bogged down because of the screen play.As someone has already noted, the film shows in minor roles actors that went to better careers in television. Eva Gabor, Harry Morgan, Edgar Buchanan, Frances Bavier, among them.The basic excuse for watching the film is the car and some views of Spain, as it looked in the late fifties. In fact, a woman in slacks, as we see Ms. Reynolds at the beginning of the film, as she arrived in Madrid, was a big no-no in the Spanish society of the time. Things have changed since then!","This film did well at the box office, and the producers of this mess thought the stars had such good chemistry in this that they cast them in the much darker screwball farce, The Gazebo.  Frankly, I am shocked to see all the positive comments on this ludicrously plotted unfunny comedy.  Both lead characters have the maturity of seven-year-olds and are much less interesting to spend time with.  A veteran supporting cast including Fred Clark, Harry Morgan, and Eva Gabor lend excellent support.  And, the beautiful cinematography certainly makes the rich countryside of Spain seem lush.  And, there are four or five truly funny scenes to go with two wise scenes and a whole bunch of recycled and unfunny clutter.\nI cannot recommend It Started With A Kiss.","Debbie Reynolds is exposed in her undergarments, escorted out by air force sergeant Glenn Ford just as Cary Grant escorted out Katharine Hepburn in \"Bringing Up Baby\". The next thing you know, they're married and he's overseas. She has to follow him overseas when he wins a car that brought them together after the sweepstakes booth that she was working at. But her arrival in Spain isn't met with the joy she hoped for as she gets him into all sorts of trouble. When they become friendly with a dashing bullfighter, more problems ensue as the car and her lavish lifestyle brings them attention that doesn't sit well with the military. If there is an older movie where the word \" pregnant\" is uttered, then I was not paying attention. It's a sign that the 1934 production code was lightening up, but that doesn't make this a good film. There's never any reason to indicate that there's any real attraction between Reynolds and Ford other than the fact that they meet under auspicious circumstances, fight and suddenly wed. Certainly, it's a case of \"Taming of the Shrew\" where the military is behind the taming. There's talk about obvious intentions of sex, which does add some amusement, but the situation seems truly forced.Beautiful location Spanish footage helps make this visually interesting, as do a few of the squabbles between Reynolds and Ford. A fun supporting cast including Fred Clark, Harry Morgan and Eva Gabor (whom Reynolds would amusingly do imitations of in her nightclub act) also brings some class. But the situation is never entirely believable, which lowers the score even though it has many admirable qualities."],"review-user":["Scaramouche2004","Cue-ball","jwrowe3","bkoganbing","moonspinner55","gregcouture","MartinHafer","Partygirl640426","helpless_dancer","rose_lily","Bruce_Cook","jotix100","tomreynolds2004","mark.waltz"],"review-date":["30 October 2008","2 December 2003","24 June 2002","19 August 2011","7 August 2009","29 July 2005","19 March 2016","22 July 2004","28 June 2002","21 July 2013","18 April 2003","15 July 2005","29 March 2004","29 December 2016"],"review-rating":["7","6","5","3","10","5","5","6","2","4"],"review-title":[" A charming 50's sex comedy without the sex\n"," Look for the TV stars\n"," Passable \"Bedroom\" Comedy.\n"," The Car Of The Future\n"," Starts with a bang...quickly fizzles\n"," Stunning concept car outshines the usual dull Hollywood clichés.\n"," These are two awfully stupid and unlikable knuckle-heads.\n"," The funniest film i have ever seen.\n"," And ended with my kissing it off\n"," \"Any marriage is wrong when you take the sex out of it\"\n"," A nice romantic comedy -- and a great car!\n"," The solid red car\n"," No chemistry between the stars\n"," Not only a kiss, but a ripped dress. And a rip-off.\n"]}