{"review-url":["http://www.imdb.com/title/tt0081613/reviews"],"review-text":["I'm amazed that of all the reviews I've looked at nobody seems to have noticed one of the main points of this film, or at least how I saw it. It seems like one big homosexual fantasy, camp clothing, a glorified nude Ferdinand, a definite sexual tension between Ariel and Prospero, and as a final climax, a group of men in tight sailor suits dancing the hornpipe. This whole approach, once you get used to it, provides you with all sorts of fantastic scenes and images. The sight of an innocent Ariel being pulled towards a disgusting nude Sycorax in order to perform \"her earthy and abhorr'd commands\", is one of the darkest I've ever scene in a Shakespeare film. However by the end of the film I'd grown tired of the style and the final hornpipe dance was just too much to take. Still overall its an interesting interpretation of the play.","Into this primordial mix, add some seventeenth century magic, and you have Shakespeare's \"The Tempest\", a play whose themes are: freedom, temperance, repentance, and forgiveness. The main difference between Shakespeare's play and Derek Jarman's film is, of course, the nearly four hundred years of change in theatrics that separate the two artists.Jarman's version tries to adhere to the play, in that the film uses quasi-Elizabethan linguistics, which renders the dialogue difficult to understand. The play's intent is still intact in the film, if a little obscured by the language, and is conveyed mostly through the acting and the cinematography, though \"adapted\" in style to a more contemporary audience. Hence, the film's inventive finale features a vocal rendition of \"Stormy Weather\", a modern metaphor for a message that spans the ages.Even with the updated visuals, this film is going to be a bit much for most viewers. It is just too out of sync with what modern audiences expect. On the other hand, for those few who appreciate Shakespeare, the film can be insightful, with the proviso that it is not \"pure\" (or literal) Shakespeare.","Spoilers herein.Thinking about film can occasionally be dangerous. Some films are designed to trigger this, but once in a while some rather simple film unintentionally leads me into uncharted territory. This IS a simple, unassuming film, but it prompted more rumination than say Branagh's `The Tempest' cleverly masquerading as `Dracula.'I have had only one experience with Jarman, with his `Wittgenstein,' which actually offended me with its lack of nuance. Jarman is that kind of artist who has a single impulse, one thing to say and adapts any material to support it. Like others of this type - Stone, Spike, Campion - that impulse is richer than a mere political view and their expressive talent is similarly rich. But no matter how technically sweet their expression, the fact remains that it is applied to a view of the world that bleaches rather than distills, simplifies rather than clarifies and dulls into stereotype instead of sharpening into archetype.Shakespeare works with ideas; those ideas have agency, engage in being themselves and weave their own tapestry in a spirit-like world, somewhat independent of human action. He expresses that tapestry in words where the manifold ambiguities and multiple threads reinforce each other, idea and meaning. Those words necessitate characters and situations and such, but characters are mere parts in a celestial machine. `The Tempest' is, to my mind, the most perfect and self-referential of his constructions: the one most concerned with its own nature, creation and structure. It is bottomless, worthy of exploration for years.Now, along comes a stage tradition that believes the entire world of drama revolves around characters, the way they are written and played. Unfortunately, when actors hijack Shakespeare, they turn the equation on its head. Suddenly the tapestry of finely spun ideas has to be reduced to a few strong, obvious threads in order to `explain' and support the plot. So `Romeo' becomes a love story, `Hamlet' about indecision, and `Tempest' about revenge. It is a travesty as blunt as TeeVee wrestling. So-called schools conspire with the selfishness of the theater market to perpetuate this.Now here's my dilemma. I liked this production; I really did. Miranda is supposed to be 14, sexually pure, and the `white space' on the conceptual palette. Greenaway's `Prospero's Books' - the best film Tempest by far - understood this. Around this center of discovery, which includes us the audience, swirls all sorts of confabulated issues, cosmic and trivial. At least in the play.Jarman gives us a different type of center: a buxom, sexy punk rocker who has the best understanding in the cast of vocal sculpting and presence. And at the same time, Jarman so simplifies the play and characters (by omission, by making things `clear,' by using unsophisticated language, by giving each character a `role') that he turns the whole construction on is head. Everything else is white space EXCEPT her. She is the magician. This is truly an unsettling notion. All the swishy dancing at the end is mere background noise to this dangerous notion.The photography and staging is a treat unto itself. Of all his plays, this one is the most difficult to stage because Shakespeare himself was struggling with the new technologies of the art. He created all sorts of hooks for effects, and much of the action depends on those effects. Jarman's notion is inspired, using the abbey as he does. It is perfect in its own way. Miranda's costume - the only one that matters - together with Ferdinand's nudity is pretty effective.So where I was expecting Shakespeare's engrossing insights on the superficialities of the world, I instead find myself captivated by that very world. It may take some time to recover.See this and imagine the perfect film Tempest. At the moment, I would include this dual, dangerous notion of passive/aggressive, sexuality in the girl as part of the ambiguity, something Shakespeare couldn't do (but would if he were here today). It would be between Jarman's lines and those of Larry Clark. It would be animated in the manner of `Sprited Away' (itself a version of the Tempest) but all players would be nude. It would have grand political clockworks like `Ran` and simple, imaginative love like Holly Golighty's. It would have the literary layering and emphasis on image-then-language of Greenaway. It would have all the special effects machinery of the most popular current version of `The Tempest,' `The Matrix' (without the guns and glasses), and by this I mean not the effects of the movie but of the world within. And it would be a serial.Ted's Evaluation -- 3 of 4: Worth watching.","The Tempest has been interpreted in many different ways ranging from more or less traditional views as dealing with Art to more post-modern approaches that like to dissect the play along post-colonial, feminist, gender or deconstructionist lines. The reason why Jarman's version left me fairly cold is that I didn't have a clue what he was on about. What is the underlying vision/idea/concept behind this rendering of Shakespeare? The previous reviewers do not get much further than revenge tragedy, punk show, but surely there is more to it, isn't there? This is not to say that there is no vision here, just that I was hard put to discover it. Be that as it may, there are still things to enjoy. The punk flavour is refreshing and funny. Toyah Wilcox as Miranda and Jack Birkett as Caliban are wonderful. I did not much care about Williams as Prospero ... not enough magic I suppose. The switches between the old monastery/castle and the (very English) world outside can be a little unsettling at times, but I guess that is intentional. All in all, interesting but not quite the success I had hoped it might be (particularly after seeing Jarman's Caravaggio).","\"Speak the speech, I pray you, as I pronounc'd it to you, trippingly on the tongue; but if you mouth it, as many of our players do, I had as lief the town-crier spoke my lines.\"Those are the directions that Hamlet gives the players on how to perform the Mousetrap. While the rhythms of Elizabethan English are difficult for Americans, they seems to come naturally for British actors, and those here perform it well enough.The problems with this production arise, as they often do for THE TEMPEST, from the director's efforts to make it visually striking. Because of the magic that lies at the heart of Shakespeare's autumnal work, its gorgeous language has fallen prey to people who think the best way to stage it is to think what Quentin Crisp would sneer at as too camp and turn it up a couple of notches. One Shakespeare in the Park staging required a dozen people to play Ariel, including a Sumo wrestler; and Peter Greenaway's gloss on the play, PROSPERO'S BOOK, is so bad that when I saw it with some friends, I disrupted the occasion by guffawing at the over-the-top images. They show up here, too.What all these geniuses fail to realize is that the play is a boy-meets-girl story, something Shakespeare wrote several dozen times. At its core is a coming-of-age story for Miranda, an adolescent girl who is old enough to leave her father. She is confronted by various male archetypes before settling on the only boy her own age. The Bard of Avon's message is so normal, that like should marry like, that youth calls to youth and that Show Business is the process of taking these ordinary and important stories and making us pay for them by wrapping them in mystery ... well, so normal that people miss the point. The play's real magic is the story of Rapunzel and Snow White and all the other fairy tales which Bruno Bettelheim has shredded to show their symbolic content. That and the language. These should be enough for anyone like me, who cares for these things. It's too bad that the people who produced this version either don't care about Shakespeare or think that no normal person will.","Derek Jarman's take on Shakespeare makes it into something of a punk symphony, without sacrificing the heart of the play.  His cast are mostly very good  especially Heathcote Williams as Prospero, Toyah as Miranda, and Karl Johnson as Ariel  and the bits that are added fit in well, especially Elisabeth Welch's appearance singing Stormy Weather'. \nComedy light relief is provided by Ken Campbell and Christopher Biggins as the shipwrecked drunks finding themselves on Prospero's enchanted island, with Jack Birkett as a creepy Caliban.The film keeps the interest by using the unexpected  it may miss the point of the quieter moments of the play but makes up for this by its sheer inventiveness.  Even the songs are treated well with Johnson's sharp suited sprite showing a mischievous streak which works perfectly.  All this is covered with a queer gloss which informs the play with a new perspective.","The stuff dreams are made of.  A complete retelling of the play as a dream of vengeance: will baffle purists, but will delight the open-minded.  A superb effort: great cinematography, acting, and script. 11-stars...***********","Derek Jarman has shown us time and time again that dialog is not his strong suit. He is a painter, and paint he does. His films are almost always visually splendid, but about as exciting to watch as paint that is already dry. Watch his movies in fast forward, the really fast setting that you can only get on DVD. In The Tempest, Jarman does very little with the script or the characters, using them as simply a lattice to hang a very long and well-constructed cinematographic frame. He even goes so far as to contradict Shakespeare's original script to achieve these excrucriatingly slow and lifeless scenes. There is none of the romance, magic, trickery, or urgency the script calls for, little spontaneity, and the character of Caliban in particular is reduced to a quivering and insane idiot of sorts, similar to Gaveston in Jarman's Edward II. It is too bad that this is just about the only film version of The Tempest available.","For me, the Tempest and its characters (by which I mean the admirable ones) are like old friends. Ever since I first began to experience the play through acting classes (I played Ferdinand) I found myself immediately caught up in the fantastic world that Shakespeare created. I can distinctly remember one student deciding not to play Ferdinand after all, and so I took the stage and had the honor of playing opposite an excellent Miranda.One of the virtues that a great friend has is that you can never fully know them - there is always something you can discover about their character. A film production of the Tempest of quality is thus like a visit to an old friend, dear to one's heart: each visit presents one with new perspective on the memory we had of the work. With Prospero's Books, the ritual and the elegance of the play was emphasized, the exuberant celebration of art within the art. Here, we see a vision as esoteric mysticism, with lovingly crafted interiors full of candles and chalk diagrams on floors, more Aleister Crowley than Naples nobleman. It also made me reconsider - why was it that Prospero was cast out of Naples? His magical power is so palpable in this production that it makes one wonder whether it was just politics that doomed Prospero to exile, but rather the fact of his difference from his peers. So, in the real world, he suffered. Was cast out, powerless to change the wrong to the right. All of the villains in this play, whether they realize it or not, act in accordance to creating a more pain-filled, hell of a world - it is always in the interest of the oppressor to make life on Earth closer to hell. But Prospero manages to bring these terrestrial villains into his island, the realm where he has (absolute) dominion.Shakespeare brings his audience to the theater, the realm where Shakespeare dictates the events, the words, the outcomes. Shakespeare is, of course, Prospero - but what this film adaptation does that really honors the text is to make Prospero so sympathetic such a figure of reason, despite the fact that he is surrounded by what society calls irrational (astrological texts, alchemical symbols, magical diagrams, etc.). Is it more rational to be a man of the cloth and murder, or to be a heretic and work towards the righting of wrongs? Prospero IS a heretic, for the reason he abandons his magic is not because the books will lose their value in Naples, but because they are not necessary anymore - the world itself - has become the magic of the books.In Hamlet, Hamlet presents a play to his peers. The play accuses his fellows of conspiring against others for their own advancement. The reaction of the audience varies: while Ophelia is puzzled, Claudius reacts with stunned shock. This happens within the play, and then Shakespeare has this play performed for the men of his time. Did Shakespeare watch for their reactions? In the tempest, Prospero lives the play he is constructing, and we live it with him. How do we react? Do you react with simple delight at the happy ending? Are you upset and shocked by the strangeness of this production, which is entirely fitting given the source material? Do you feel sad at the fact that this little life, the play, is rounded with a sleep, as transient as it is eternal? The tragedy is that Shakespeare creates a paradise of reason and hope for mankind's life on Earth but man is weak, and unwilling to realize it in favor of petty power struggles. We have Claudiuses.Like a good friend, this film is not without its flaws. I disagree with the choice to paint some scenes entirely in blue. The dance of the mariners is rather tangential. But at the heart this is truly The Tempest, and one of its many faces.","I have read all of Shakespeare's plays, seen productions of a majority of them and even acted in and directed some. I do not necessarily believe that Shakespeare must be done in the \"traditional\" fashion, but I hated this movie.There is nudity that is gratuitous and unnecessary. There is grotesqueness that is far beyond what I believe Shakespeare intended. Some of the dialogue is incomprehensible, and there are those elements, like the singing and dancing that add no meaning to the movie, but replace Shakespeare with the director's self-indulgences.I am sorry to say that I wasted perfectly good money to buy the DVD of this movie.","I thought this was very \"different\" compared to most modern interpretations of Shakespeare and enjoyed it thoroughly. It would not be useful for those studying it at school etc. as it does not show the traditional Shakespeare character interpretations (i.e- Miranda is portrayed quite punky compared to your traditional Shakespeare lady) but for understanding of the play and for the basis of the story it is a very strong piece and fantastic to watch. It does not include also the correct format, as in the layout of acts and scenes as I am currently playing Miranda in a production and most of her lines had been cut and some scenes split and mixed around but it is very useful and I would definitely recommend it as a must-see even if just to say you've seen it! Shakespeare fans would love this!","This film version of Shakespeare's play opens on an island where Prospero and his daughter Miranda have been exiled for many years along with their servant Caliban and a spirit called Ariel. Prospero is rightfully the Duke of Milan and a powerful sorcerer and while he sleeps a storm at sea wrecks a ship near the island. Aboard are the men he blames for his exile; including the King of Naples and his son Ferdinand. Ferdinand is separated from the others and captured by Prospero and accused of being a spy; Miranda vouches for him and gradually falls in love with him. Meanwhile others survivors plot against their king and Caliban plans to kill Prospero, who he claims stole the island from him.This is the only version of 'The Tempest' that I've seen so I can't say how good an adaption it is; I can however say that it won't be for everybody. It is a bit confusing at first then as things are explained things start to make sense and finally as it ends one is left wondering how much of what we've seen was meant to be real and how much was meant to be the creation of a deranged mind! The film sometimes feels more like a TV play than a film; although I don't imagine a TV play made in the '70s would feature as much nudity. The cast do a solid job; I particularly liked Toyah Wilcox's portrayal of a punkish Miranda and Jack Birkett's disturbing performance as Caliban. Overall I'd say viewers some will love it some will hate it give it a go and decide for yourself.","This movie sucked. I was studying \"the tempest' at school recently, and this being the most faithful adaption my teacher could find, we watched it.Prospero looked more like an incarnation of Doctor Who, Miranda was some kind of seventies punk-brat (no change there, then, for toyah wilcox) and derek jarman clearly held the misguided notion that showing the fullfrontal scene of ferdinand clambering ashore in the buff would be enough to save this crap from descending into seat squirmingly, buttock clenchingly arduous cinema.however, unsurprisingly, scenes added more for the titillation of the director than for the enrichment of the production will not (shock horror) help this utter trite.","This was an interesting adaption of William Shakespeare's last known solo play but in my humble opinion, a terrible one. Jarman tries to change the personalities of the characters for a start. He makes Miranda seem insane after being stuck on the island for so long, Prospero is no different - a mix of madness and self-pity on his part. I could not imagine Shakespeare thinking his characters to be anything like the way Jarman portraits them.Caliban's appearance is maybe the only thing he got right, but then again, I was under the impression that Caliban was a tormented, deformed monster but turns out to be an insane rambling, northerner who is constantly cackling, not as I would have imagined him. Ferdinand makes a brief appearance, naked most the time and quiet.In fact, to the point I stopped watching this awful adaption, their had been so many lines cut from the play. If anything, I think Jarman was trying to re-write Shakespeare and include his own scenes most the time. So much text is cut out in the first part it makes it not a Shakespeare play, but a load of 70's melodramatic, preposterous rubbish.An attempt to interpret this play more realistically in the end, but this play was never a realistic one and it was made nothing like the text displays it to be.","No one can say they don't know Shakespeare's most mysterious play, The Tempest. But no one can say they understand it because it is not done to be understood but only interpreted and that's exactly what Derek Jarman does with it. And his interpretation is that a labyrinth if not a maze in which we are supposed to get lost. We sure have an island and two people, father and daughter, Prospero and Miranda, marooned on it. We then have a tempest that brings to the island the brother, Antonio, of this father who unseated him as Duke of Milan with the help of Alonso, the father of Ferdinand, all marooned on the island by the tempest. In fact Alonso was the plotter who managed to get Prospero off the throne of Milan and got him and his daughter marooned. That is called a coup d'état or a putsch. The object of the tempest is thus simple: to bring Ferdinand and Miranda together to get them married, Prospero's vengeance in a way on Alonso.But it is not a play about a vengeance and Derek Jarman puts a lot of other elements forward to amplify other levels of meaning. Everyone is waiting for Caliban, the perverted and twisted \"slave\" who is an inept son of a witch. He is obnoxious as expected. Everyone is waiting for Ariel, the spirit that is used by Prospero to make the tempest happen and he is what we expect, a magical master of ceremonies. He brings Ferdinand and Miranda together. He more or less loses all the others on the island for Prospero to have enough time for his plan. And then he brings them to the castle in due time to be obliged to endorse the wedding.But that still is not the meaning Derek Jarman wants us to see. He uses his camera again as a painter's brush and he is able to bring up all kinds of fantastic events and artificial situations, including a grand ball for the celebration of the wedding. But we know Derek Jarman does not believe in miracles. He is making a film, and telling us a story and he wants us to know that the plot and the vengeance and even the marriage are nothing really interesting. What is interesting is that life is always the same and it all ends with a feast, with some dances and with a song. And there he pushes his imagination to extreme anachronistic and iconoclastic antics. The ball is in fact an all male ballet of modern sailors in their nice uniforms obviously mimicking love in male couples for the wedding of a man and a woman. And Derek Jarman crowns this obvious gay scene with the black singer Elisabeth Welch singing \"Stormy Weather\" surrounded by all these sailors and their love multiple pas-de-deux. And this time it is no longer a hint, it is a direct message of love from Derek Jarman to whoever, to any man he is missing right now:\"Don't know why there's no sun up in the sky Stormy weather Since my man and I ain't together, Keeps rainin' all the time\"And here Derek Jarman turned the Tempest around and it became a song or a prayer about impossible love, about separation, about longing for love that cannot come because of the \"stormy weather\" and Derek Jarman makes it a gay manifesto, and he probably was absolutely conscious of what he was doing. He was hijacking Shakespeare's play from a simple straight meaning to a more complicated gay signification. But he did that too with Shakespeare's sonnets in another film, The Angelic Conversation. Shakespeare is easy at that game because his love sonnets, his love poetry are always so perfect that you could project yourself into the sonnet and be in love with the young man whose beauty Shakespeare is singing. Even the famous sonnet of the pilgrims in Romeo and Juliet can be interpreted in any orientation possible since it is a dialogue between one \"I\" and another \"I\" kissing with their hands and praying with their lips.But we cannot stay on that colorful and slightly sad note. Derek Jarman leaves the play with a last vision of the same palace, the same hall where the wedding feast has just come to an end. But this palace is back to the state of total unkempt abandon that goes along with the emptiness it now has since everyone has left on the ship on the following morning. And Ariel is there totally forlorn since he is no longer needed in the civilized world of Naples or Milan. But Derek Jarman adds one more touch. Prospero is till there too, unable to go because Ariel is his lover, he is in love with Ariel and he cannot go away from him, even in the stormy weather we know. That's the very sad moment of this interpretation of the play: love is for everyone else when you are gay, because then gay love can only be found on a desert island on which you are marooned once and for all, and your gay love will be for a spirit, a phantom. Your love will be nothing but an illusion for an illusionary character that only exists in your mind.That's the sad way of looking at this film. You can always look at it with modern eyes and say that after all that was the past and now gay lovers can kiss on public benches and in parks and commons. Dogs will not bark any more, at least we can hope so.Dr Jacques COULARDEAU","I was loaned this DVD by the director of a film I am working with, in which I play an actor who is playing Prospero. Knowing his own style, I did not expect anything resembling a \"classical\" interpretation of the text.What I have found is sometimes striking, sometimes evocative, but often meandering and tedious. Like most experimental music, I find that in films such as this, the building blocks of powerful film-making are crafted, even if they have not found their most useful form in a more coherent format.Thus we have a Caliban who is more a clown than a threat, and who not even Miranda seems terribly afraid of (which is odd, since we know that he has attempted to rape her at least once). A Stefano and Trinculo who are more annoying than funny. An oddly young Prospero who looks like Amadeus. And a great loss of character development and plot through creative editing and highly stylized posturing.Interestingly enough, I do not have an issue with the way in which Ferdanand or Miranda are portrayed. His stunned rapture and her slightly freaky innocence are actually quite appropriate.I do not say that this is a bad film, but an experimental one. One that takes huge risks, but is meant more for students of art and film and not really for anyone with an interest in the Tempest for its own sake.","Derek Jarman's retelling of Shakespeare's \"The Tempest\". I never read the play or saw any version of it so I was a little confused about what was going on. It's something about a man named Prospero who's exiled to an island with his daughter Miranda, a REAL annoying slave and an angel (I think) named Ariel. His brother and the king did it to him (I'm not sure why) so Ariel fixes it that the king's son Ferdinand is shipwrecked on the island, becomes a slave of Prospero and falls in love with Miranda.This is NOT a faithful retelling of the play. There's plenty of frontal male nudity--actor David Meyer (playing Ferdinand) is introduced completely nude for a lengthy time--and there are strange costumes, noises and settings all mixed with Shakespeare's dialogue! And the wedding has sailors doing a homoerotic dance AND posing afterwards. Then there's a woman all dressed up and lip-syncing (badly) to \"Stormy Weather\"...I honestly can't say I liked it but the acting is good and it's definitely the strangest Shakespeare adaptation I've ever seen. Jarman did another one like this years later--\"Edward II\"--which was better than this. Still this is a one of a kind and not without merit."],"review-user":["c_murphy86","Lechuguilla","tedg","Luuk-2","boblipton","didi-5","lumper","MrWall21","monolith94","jacksteeley","kirst_dramaqueen","Tweekums","Catscanfly","PrivateBits","Dr_Coulardeau","sfstagewalker","preppy-3"],"review-date":["19 June 2005","22 November 2005","23 May 2003","29 February 2004","24 November 2012","9 April 2004","13 December 1998","4 June 2007","26 January 2006","15 March 2003","23 July 2006","27 April 2017","4 May 2004","7 December 2007","4 July 2014","30 June 2007","7 February 2014"],"review-rating":["7","8","4","10","3","9","1","7","7","1","10","4","5"],"review-title":[" Queer Theory in Practice\n"," Earth, Air, Fire, And Water\n"," Simple, and Simply Beautiful\n"," What is it all about?\n"," Shakespeare on a Trip\n"," dreamy bit of queer cinema\n"," Dreams are made\n"," Sadly Unenjoyable and Barely Worth Watching at Best\n"," woman of the dunes\n"," Not much Shakespeare, much crap\n"," A unique interpretation!\n"," A confused but intriguing version of the Shakespeare play\n"," absolute trite\n"," Shakespeare must be turning in his grave!\n"," How gay this play can be in Derek Jarman's hands!\n"," Interesting for some, but not for most\n"," Not quite sure what I saw but it was interesting\n"]}