{"review-url":["http://www.imdb.com/title/tt0070229/reviews"],"review-text":["There have been a number of excellent films about murder and mayhem occurring in small towns. \"They Only Kill Their Masters, \"Sherlock Holmes & The Scarlet Claw\", \"Winter Kills\", and \"Five Card Stud\" come to mind, and this 1973 ABC movie-of-the-week has got to be one of the very best ever made.An increase in the death rate among the older residents of a small New England community is initially labeled as being due to natural causes. But something about it doesn't feel right to Daniel Barnes, the local chief of police. Barnes, (excellently played by Alan Alda) refuses to believe the official findings and begins an investigation to prove there's something rotten going on in his little town. The excellent supporting cast includes Will Geer as a nicotine addicted coroner, Louise Lasser of \"Mary Hartman, Mary Hartman\" fame as the police station's wise-cracking receptionist, and Ruth Gordon cast to type as a dotty old lady who may be in danger of becoming the next senior to sign off. Directed by John Badham of \"WarGames\" fame, the film maintains a superb balance between both the story's darker aspects and the folksy charm of the familial setting and characters. The method of murder alluded to in the movie's title is refreshingly unique and the film's tense climax features some surprising character revelation. There's even an action-packed car chase that, appropriate to the film's setting, takes place in a corn field. Lane Slate's script is as funny as it is intriguing, and he clearly has a great feel for small town characters. The undeclared courtship between Alda and his receptionist, Lasser, is particularly fun to watch as they joke and natter away about bird watching and other mundane things because neither is willing to risk declaring to the other their true feelings. It's as endearing as it is amusing and the chemistry between these two actors is remarkable. David Shire's score effectively captures the feel of the rural setting while injecting the right note of menace to reflect the darker and at times melancholy aspects of the story.ABC Movies Of The Week were quickly shot and a mere 90 minutes in length, but for some reason the 2 hour TV-movies we get today seldom approach the quality of a little classic like this, and that truly is shocking.","This is a great TV movie with a good story and many comic moments thanks to the excellent cast.The only problem this movie has is that it hasn't stood the test of time as well as it might have.Despite this, it's definitely worth viewing, particularly if you are an Alan Alda or Ruth Gordon fan.","I am trying to find somewhere to purchase a DVD/VHS copy of the movie \"Isn't it Shocking?\" I was 7 years old when I saw this movie and I lived in the town where it was filmed. A couple of items from my family were used in the movie as props and a couple of my friend's homes were used in a couple of the scenes. The filming pretty well took place in the town and surrounding community. I have only seen the film once originally and I would like to get a copy so now I can show my family the film. I have done extensive searches online with not luck and I was wondering if anyone would have any ideas on trying to get a copy of this movie?","I am not sure if this is the right movie, so this may or may not be a spoiler-type of question. Is this the one where a body is in a crate of some kind and Ruth Gordon chops off his foot because it is sticking out? I have vague memories from when I was a kid, and if, indeed, that is this particular film, I loved it! Thanks in advance for your help!","This is one of four 1970s movies by TV writer Lane Slate about sensationalistic murders in small towns. They feature likable TV personalities as police chiefs and quirky characters as town regulars, including light-touch love interests. The others are: They Only Kill Their Masters (James Garner, 1972); and The Girl In The Empty Grave and Deadly Game (both Andy Griffith, 1977).Alda's is set near Vermont (\"Mount Angel\" next to \"Horse Creek\"); the others in California, Garner's at seaside (\"Eden Landing\") and Griffith's in the mountains (\"Jasper Lake\"). All try to capture the feel of a small town, to move at a relaxed pace among comfortable characters, and to tell a mystery with at least some complicated twist or turn to it. On that level, they are somewhat entertaining (that they were often re-run itself suggests they have some appeal). But they suffer from overall thin stories and dialogue, slack pacing, bland settings, flat or exaggerated characters, and off-putting, forced attempts (often juvenile or crude) at color or humor.Alda's and Garner's are the most serious about story, characters, pacing, and tone. They have the best supporting casts, though Alda's is put to better use; the Griffith casts pale in comparison. Alda's has the best director.\"Shocking\" has some surprise and drama. The killer's method is inventive. The tone is more even, and the dialogue more natural, than in Griffith's. Alda's film does not suffer like the others from smug big-city transplants to the town or from hokey, exaggerated local characters, both of which come across as figments of a Hollywood scriptwriter, not as genuine (the worst offender is the Griffith movies' pipsqueak, mumbling moron \"Whit,\" who, we are told, tried to hook a jeep up to and make off with a trailer serving as a temporary bank branch, dragged away the dock for the police boat, stole tomatoes from a farmer's truck only to get nothing for them, and filled out $11 on the withdrawal slip of \"Spiro T. Babylis\" only to be discovered by the teller). Mercifully absent is the clunky, heavy-handed repetitive-style dialogue from the Griffith movies (\"You going to lunch?\" \"I'm going to take out the boat.\" \"You going to take the boat to lunch?\" \"I'm not going to lunch.\" \"You're not going to take the boat to lunch?\"; \"There aren't any fish in this lake. Why are you fishing here?\" \"It's illegal in Horse Mountain.\" \"It's posted here too, you're breaking the law.\" \"Some law. There aren't any fish in this lake.\" \"Then why are you fishing here?\" \"I told you, it's illegal in Horse Mountain.\"; \"Please call me Lloyd. My name is Lloyd.\" \"Okay, Lloyd...\" \"Call me Lloyd. That's my name. My name is Lloyd.\")But Alda is too low-key and unimpressive to be taken seriously as even a small-time police chief, certainly not a red-hot lawman in demand by a rival town. Slate has the character admit as much, when he comes late to the scene of a by then obvious clue, as a result of an accidental name recognition. Rather than detect or investigate, Barnes strikes out blindly in emotional denial. His secretary Lasser feeds him a key clue (\"Why didn't I think of that,\" he says!). An embarrassing funeral scene, plus a plot contrivance, leads to another gift clue.Worse, Barnes is more interested in deriding the military-style helmets of the county police sent to help him (Deadly Game also suggests Slate has something against the military) than leading them or his own men effectively. He allows a late murder by incompetently guarding a known target. Barnes allows his car to be repeatedly rammed by the killer fleeing one crime scene, without drawing his gun or trying to take control. Again, he is ineffective, and nearly killed, in the climactic scene, which results from multiple errors on his part that are only partially corrected, by accident. The erratic Northeastern accent that Alda affects does not help believability.There are plot holes. Why would the killer strike after all these years? And committing the first two murders without a trace seems implausible. But they are nothing compared to later ones -- a couple together, a shopkeeper in his store during business hours, a fully clothed deputy seated in his office and, unbelievably, his dog!Alda's movie also suffers from some offensive elements that Slate injects into all the movies. Barnes first appears in a motel clerk's bed. He then treats her rudely at every turn and insults and tries to avoid her kids. This, and talk about the female doctor, smack of a crude, mean-spirited pattern (Garner's film has been described as \"sleazy,\" including a scene where he and a deputy laugh about how a girl in the back seat of a car that hit a bump in the road had part of her anatomy bitten off by a guy in the car with her. Griffith's feature an ersatz Ropers routine, in which the woman embarrassingly tries to coax the man into \"the supply closet\"; a gratuitous locker-room-type exchange with a deputy in discussing a young woman's car accident death (\"Did you take her out?\" \"I took her in once.\"); a reference to bank teller \"Bernice\" as \"swollen-up in places\" and to \"sticking a pin in\" her and to \"hating\" and firing secretary \"Maude\" because she was \"too hairy\"; a description of the female doctor's practice as \"two stirrup tables and a flashlight\"; a humiliating scene in which Fran Ryan propositions Griffith, offering \"some home grown\"; and an insulting subplot in which a woman, pursued by a deputy played as a drippy buffoon, seems to \"sleep around\").Finally, Alda's film has a grim, bleached-out, colorless, lifeless look and feel. Only Louise Lasser adds spark. At least the other films had some spirit, scenery, and pleasant music; Griffith's got out onto the mountainside, onto the lake, and even out into the big city. You feel more like re-watching Masters or Empty Grave than Shocking.","I've found, after seeing a dozen or so of them, that made for TV seventies horror flicks are generally good for seventy minutes of entertainment. This one looked really good considering the comments about it, so I hoped that I'd be in for one of the better ones; however, that wasn't the case. It's not that this is a bad film, but it's not all that good either and certainly isn't one of the better made for TV movies from the seventies that I've seen. The plot is interesting enough, and focuses on a small town where a bunch of old people are dying. There are certain similarities between the deaths, and it leads Sheriff Dan Barnes (Alan Alda) to investigate. The plot plods along at a relaxing pace, and there's not a great deal of suspense or interest, which is a bit of a surprise since director John Badham would go on to make the very suspenseful thriller 'Nick of Time'...though that was twenty two years later. The small town setting provides a good place for the film to take place, but this isn't taken advantage of to any notable extent, and the film simply boils down to a simple ending. Overall, this film isn't terrible; but it's not great either, and I can't really recommend bothering to track it down.","Mount Angel, a small New England community inhabited mostly by seniors, is beset with a serial killer; the bachelor chief of police and his kooky assistant figure out the murderer's motive. \"Isn't it Shocking?\", an ABC movie-of-the-week scripted by mystery writer Lane Slate and directed by John Badham, is full of talent, yet it fizzles out somewhere along the way. The teleplay, the handling and the performances are all offbeat, yet not odd or unusual enough; the scenario is tinged with black comedy, but it isn't funny enough; and, worst of all, there's no guesswork needed in these killings because neither Slate nor Badham is interested in making the film a mystery (the killer is revealed to us right off). Alan Alda has the perfect dryly-eccentric manner for a role like this; if he were comically frazzled, it would add too much weight to the material (he gives the proceedings the cautiously light touch it needs). But there's no sympathy for the elderly victims (the first of whom, a woman, is found stripped), and the succession of funeral services is too gloomy. Badham doesn't provide any sting (or, conversely, any dark humor) to the narrative; he's determined to bend this thing towards the bizarre but, like the pun in the title, he lacks taste and finesse.","\"What's WRONG with him?! He's nuts...that's what wrong with him!\"The acting and much of \"Isn't It Shocking?\" is quite good...it's too bad there is also a HUGE plothole and a particularly goofy murder weapon! You see this murder weapon in the opening scene, as an older man uses a homemade defibrillator to kill his victims! Talk about making this overly complicated!! He could have killed them with a gun...or even a frying pan...but a defibrillator?! What makes it even funnier is that despite this, the cops and coroner chalk these deaths up to heart attacks! Considering the killer didn't use a conductor (like KY Jelly) there would have been burn marks on the dead...but there weren't and I think the writer should done their homework. Plus, even if this possible....the method seemed so bizarrely overly complicated it made me laugh! But again, the film IS very good in places and I really liked Alan Alda in the lead as the sheriff...which is also a bit funny in light of his longtime hatred of guns. Worth seeing...provided you don't think too much as you watch.","\"Isn't it Shocking?\" is a low-keyed and inconspicuous TV-movie that greatly benefices from a terrific ensemble cast, an unusual but nevertheless intriguing premise and a script full of witty jokes and fun dialogues (and this in sheer contrast to the sober subject matter). This was one of the many legendary \"ABC Movies of the Week\" that were especially produced for cable-TV during the early seventies, and I have yet to encounter one of those that isn't worth tracking down. I was born in the wrong decade and the wrong continent in order to enjoy this series on actual television, but thanks to the modern wonders such as You Tube these old TV-movies still find their way to new fans. The story takes place in a small American town called Mount Angel, where in a short period of time three senior citizens – including the deputy Sheriff – die from seemingly ordinary heart failures that nevertheless raise the suspicion of Sheriff Dan. At the beginning of the film we witness how a strange and also elderly man comes to town and kills his first victim with a portable device that induces the heart failure. So the viewer knows the killer's identity immediately, but it's up to Sheriff Dan and his gossipy assistant Blanche to figure out why these gentle old folks are knocked off. They discover that all victims graduated together in the class of '28 so perhaps something sinister happened back then. It always amazes me how those modest ABC movies managed to rely on such acclaimed and respected actors and actresses! \"Isn't it Shocking?\" stars class players like Alan Alda (\"MASH\", \"The Mephisto Waltz\") and Edmond O'Brien (\"The Wild Bunch\", \"Fantastic Voyage\"), but also a splendid supportive cast including Louise Lasser, Will Greer and Ruth Gordon (as a character that may perhaps have inspired the \"Crazy Cat Lady\" from \"The Simpsons\"). This was also one of the first directorial efforts of John Badham, who would later make a handful of action favorites like \"Blue Thunder\", \"Stakeout\" and \"Nick of Time\". There's one remarkably spectacular sequence involving a battle with cars (!) but what I really liked most were the smooth jokes and sly interactions between the lead characters. Fun movie!","I remember \"Isn't It Shocking?\" from way back in the 70's when TV movies were bad. How often are you going to see Ruth Gordon, Louise Lasser, and Alan Alda in the same movie? They are 3 of my favorite actors. Ruth Gordon - amazing in anything and the movie is worth watching just to see her.Louis Lasser flinging birdseed always makes me laugh. It's a dark comedy (not a good drama).Alan Alda - well he's good in everything -right? I'm trying to get a copy but not easy. The 1970's were bad bad bad for movies but the made-for-TV genre had a feel about them (yes, \"They Only Kill Their Masters\" is a perfect example), and every once in a while they are good for bowl of popcorn on a snowy night.If you like this type of movie \"Isn't It Shocking?\" is worth watching just for the few moments of the 3 actors mentioned."],"review-user":["a_l_i_e_n","Loulou-8","jfesch","valeripaxtonsteele","mysteriesfan","The_Void","moonspinner55","MartinHafer","Coventry","madfliesler"],"review-date":["3 February 2006","8 July 1999","11 September 2006","27 September 2017","1 March 2007","29 October 2007","27 July 2015","13 February 2017","3 December 2016","20 November 2010"],"review-rating":["8","8","3","6","6","6","7","5"],"review-title":[" TV Movie That Packs A Jolt\n"," Excellent TV movie\n"," trying to find DVD or VHS copy\n"," Question, anyone?\n"," One of a set of mildly entertaining but badly flawed 1970s \"small town murder\" movies\n"," One of the less notable made for TV seventies horror flicks\n"," \"Why would a man do this? He's nuts, that's why!\"\n"," Murder by Defribillator?!?!\n"," Sharp & clever ABC goodness!\n"," A 1970's Gem if You Like Dark Comedy\n"]}