{"review-url":["http://www.imdb.com/title/tt0091278/reviews"],"review-text":["I'm sorry, but I just can't help it, I love watching Iron Eagle. Now, do not misunderstand me, I am not saying that this is a great movie. No, rather, I would put it that this is an endlessly entertaining movie. For people who cut this movie to pieces for not being realistic are kinda missing the point. Of course Iron Eagle's plot was ridiculous. But I believe its target audience was kids, and I sure remember finding this cool when I was little. Now I just find it amusing as a guilty pleasure, kinda like Road House. This movie is part of the great pantheon of 80's, kids-taking-on-the-stodgy-adult-power-structure movies. You must remember D.A.R.Y.L, Real Genius, E.T., etc. If you ask me, just watching Doug and Knotcher \"Ride the Snake\" in the beginning is worth the cost of the DVD. That whole sequence was so STUPID! But, at the same time, it was hilarious, funny, totally 80's, all that good stuff. So bottom line, Iron Eagle is a great 80's guilty pleasure. The hairstyles, the dancing, the music, the dialogue, its all funny as hell. I have Iron Eagle on DVD and to me it was totally worth $9.99 at Best Buy. If you love laughing at dated, unrealistic action movies, this one is a must-see. Oh yeah, and I think its plot was only marginally stupider than 1986's other fighter pilot action pic, Top Gun.","Okay, here's the deal. There's this American pilot who's flying along, minding his own business, when suddenly he's outnumbered by evil, cowardly non-American fighter planes (they're Middle Eastern types, but suffice to say they don't like apple pie or Elvis Presley), who proceed to shoot him down. Now this American pilot was doing nothing wrong, but those evil non-Americans didn't care and before you know it he's banged up in a foreign jail and sentenced to death!!Now, what would normally happen here is that the US Military would carpet bomb a couple of nearby towns until the pilot was released, but not this time. Those evil peace lovin' types probably got involved and managed to stop any kind of retaliatory massacre. As you can imagine, this doesn't please the pilot's family and the evil foreign dictator has this smug, contented look about him. He'll make those Americans pay, oh yes indeed!But He didn't reckon on Doug Masters, the captured pilots 16-year-old son. You see Doug has been able to fly a plane longer than he can drive a car, (which can't be that long) and decides to fly into that evil, foreign country and get his Dad back. So with the help of his friends, Doug and his wingman, retired pilot Chappy' Sinclair, Doug launches a two man air raid on the foreigners. Now you'd think that this plan would be bound to fail, but you'd be wrong. Sure, those Middle Eastern types might be all veteran pilots, but Doug's got an ace up his sleeve, he listens to rock music when he flies! After shooting down a dozen or so enemy planes and blowing up an oil refinery, Doug lands at an airport and gets his now wounded dad onboard the plane. Understandably, the evil, not quite so smug anymore, dictator gets quite annoyed at these antics and takes to the skies himself, in bid to shoot down Doug. But the young lad listens to some more rock music and blows the villain out of the sky. HURRAH!After Doug and Chappy have shot down 90% of their air force, the foreigners send up their last few planes in a rather poor attempt to shoot Doug down, but in the nick of time, a flight of US F16s turn up and scare them away.\nI cannot recommend this film enough. It was the first ever videocassette movie that I brought, and until I was twenty, I kept hoping that my dad would get shot down over a foreign country so that I could rescue him. But he's doesn't like flying, so it didn't happen.","The film focuses a boy about eighteen-years-old (Jason Gedrick) ; when his father (Tim Thomerson) is taken prisoner by a dictator (David Suchet) from Middle East , he steals a F 16 fighter jet to rescue his daddy . He's helped by the brave Colonel ¨Chappy¨ Sinclair (Louis Gosset Jr. , though Morgan Freeman auditioned for the part) . The movie contains a plethora of action scenes , explosion , blasts , aircraft battles with various jet-planes flying to sound-velocity and blown up . The picture is a blend of typical films from the 80s , as ¨Top Gun¨and ¨Rambo¨ but starred by a teenager .The story provides entertainment and action with no sense but being sometimes a little bit boring and dull . All of the fighter aircraft used (F-16 fighters ; plus , F-21 fighters depicting enemy MiGs) are actually Israeli Air Force aircraft , repainted with the USAF symbol and a fictitious enemy symbol . Jason Gedrick is the valiant he-man , he causes wreck havoc to nasties commanded by the villain David Suchet . Our hero ¨Chappy¨ is well personified by Louis Gosset Jr , usual to all the¨Iron Eagle¨ saga . Spectacular cinematography by Adam Greenberg with excellent sky-shots . However , the score is awful , but is based in disco-music and synthesizer , in spite of being composed by Basil Poledouris (¨Conan¨ music's author) . The motion picture was regularly directed by Sidney J.Furie . It's followed by three sequels, all directed by Furie with exception the second directed by John Glen , thus : ¨Iron Eagle 2¨ (1988) with Mark Humphrey ; ¨Aces : Iron Eagle III¨ (1992) with Rachel McLish and Horst Buchhold ; and ¨Iron Eagle IV¨ with Rachel Blanchard .","I remember seeing this movie in the theater when it first came out. I think I saw it three or four times. It was the best air combat movie I had seen at the time.     I hear this movie compared to Top Gun a lot. In my opinion there is no contest. Iron Eagle is far better than Top Gun. Here's why. Top Gun had very good aerial combat sequences. Some of the best I've still ever seen. However, the plot of Top Gun was AWOL. All I remember of Top Gun is, they practiced, he got the girl, his pal died and he was the hero at the end. Iron Eagle had a good plot. However the aerial combat scenes are pretty fake and tame. Sure it was unbelievable that they could pull it off but there was a plot and a good one.      Iron Eagle's fun lies in it's youthful angst and comedy. Louis Gossett Jr. shows his veteran acting skill in this movie as the veteran pilot. Jason Gedrick was good as the young upstart pilot with too much testosterone. They chemistry between the actors was good. There is one scene where they young pilot asks for Chappy's help and he turns him down and Louis Gossett's acting skills become quite evident. One of the best scenes in the movie is the race between the motorcycle and the Cessna with a pounding rock song in the background. It is one of the best done flight sequences I've seen in a move and is not fake like the combat scenes. Another scene is when the kids use their dupe their parents and other military personnel into getting them what ever they want from the base, including two F-16s. But more than these scenes, it's really the soundtrack that makes the movie. There are songs by Queen(One Vision), Dio(Hide in the Rainbow) and The Spencer Davis Group(Gimmie Some Lovin), what a combo! Not only does the music sound good to our young pilot, it also makes him fly and fight better! While I can't say that Iron Eagle is a masterpiece, it is one of my favorite movies of all time.     Iron Eagle is out on DVD! Now I finally have and excuse to buy a DVD player!\nRayvyn","Most of us remember Top Gun as being the biggest hit of 1986. Iron Eagle, despite the numerous sequels it produced, has been all but forgotten. However it also made its mark in the same year, just not as big of a mark. Iron Eagle is the story of a teenager (Jason Gedrick) who with the help of an experienced jet pilot (Louis Gossett Jr.) \"borrows\" a couple F16 fighters to rescue his father who is being held prisoner in a hostile Arabic country. The film is absolutely ludicrous, but definitely a sign of the times back then.I do not recall if the hostile nation in this film is ever named, but it is obviously based on Lybia who was public enemy #1 for the USA back then. At least as far as non-communist bloc nations were concerned. The main bad guy who seems to be running the show is obviously based on Muammar Gadaffi, too. After a kangaroo court trial, Gedrick's father is sentenced to be hanged for simply being shot down in disputed air space near the enemy coast. (recall Gadaffi's \"line of death\") The US government seems to be planning no action to rescue the dad. It appears Gedrick and Gossett Jr. are his only hope!!!! In a series of ridiculous scenes perhaps even less probable than the actual air combat scenes, Gedrick and his teenage friends are able to steal all the necessary reconnaissance needed to set up the mission. Gedrick is able to gather enough information to convince Gossett to fly in there with him in his own plane. But can two F16s really penetrate the hostile country's air space and pull off the rescue?????? Sure they can! This was the 1980s!!! Ronald Reagan was president!! Americans could accomplish anything back then!!!! Whether or not this kind of plot seems interesting quickly becomes irrelevant once the film gets going. It is technically inept, full of impossible scenes, and lacking in logic from the get-go. This film was obviously rushed; no doubt to get it released before Top Gun which was a much better film in all areas. There are an embarrassing number of continuity goofs involving the weaponry carried on the wings of the planes. In some shots the planes appear fully loaded for battle. Then, the next shot will show only a couple missiles left. Then, the planes will do some kind of loop da loop and there will be no weapons visible at all. The editing department was either out with the flu or just didn't have time to get things right. The acting isn't bad. Gedrick is likable, and Gossett Jr. is terrific as ever. He basically plays the same kind of hard-ass he played in An Officer and a Gentleman. He likes the kid and his father, but he knows the kid will have to be toughened up drastically if they have any chance of pulling it off. Keep a close lookout for Robbie Rist who played Cousin Oliver on The Brady Bunch.On the plus side, the soundtrack is pretty good. One Vision by Queen is a great rock song. There are also good songs by Twisted Sister, King Kobra, and Dio. And also its a joy to behold someone bombing the heck out of this worthless dictator and his stupid country. Blowing up his oil refinery may have been a bad decision, though. Something like that could theoretically hike up the price of gas world wide!! Just ask our current president or his father. When bombing a Middle Eastern country, the LAST thing you want to hit are its oil resources! Prices are high enough as it is these days! 5 of 10 stars. Mostly for the soundtrack.The Hound.","Back in 1986 I was a sixteen year old boy, when I first saw this film, I thought back then that this movie was one of the coolest I've ever seen. Just the other night at a friends house, my friend said \"how about a trip down old memory lane\", he busted out an old dusty VHS tape and I could see it was the original Iron Eagle movie. He slapped it into his VCR and off we went. Now I am a 36 year old man, not the boy I was many years ago. As I watched the film, I could see flaws in detail, flaws in the special effects and a corny script and plot line. Now don't get me wrong, it's still a good film, if you are like stuck in the 80's! The only true thing I could get into with this film was the pretty good soundtrack. I am a big fan of the rock group Queen, they made parts of this film good enough to at least sit tight and watch. Good film back in the days, good film now, just a whole lot of corny! \"Thank you for your time\" Aaron Grace","I loved this movie 10 years ago when I was about 16 years old. My biggest mistake was to watch it again, 10 years later. It's not the worst \"I-wanna-be-a-pilot\" movies ever, but it has so many flaws in it that you can hardly overlook them.Queen's \"One Vision\" (along with the rest of the soundtrack) makes this film better than the average patriotic nonsense you usually get to see ;)[****------]","not too much top's the classic \"top gun\" or \"independence day\" when it comes to fighter jet excitement. Yes, the movie top to bottom is based on a truly fictional example of how anyone can pull off a rescue but it is cool because it breaks all traditional rules. The kid doing what he wants to do in a jet the way he wants to do it.I can't really put my finger on just what I love about this movie but others I know that saw the movie feel the same way about it I do. I think its just basically a lot of fun but maybe a little too unrealistic for some to buy into.Again, regardless, I loved it, people who I know saw it, loved it so its definitely worth seeing to make your own decisions about it. Put it this way, I thought that Top Gun was one of the best fighter pilot movies ever and I like this movie just as much if not more than Top Gun. Don't miss out, do see it, a truly inspirational movie.","I love Iron Eagle. It's heavily slated as a \"Top Gun rip-off\" but in truth it certainly is not that. Sure, Iron Eagle doesn't have the babes or the budget that Top Gun had, but who cares? It's still a fantastic fun movie to watch, no matter how unrealistic it is. Lou Goussett Jr, Jason Gredick and David Suchet all put on blinding performances. The chemistry between Lou and Jason is great, believeable at times.Iron Eagle in my honest opinion is better than Top Gun, many say it isn't but I think it is...it certainly has the better action scenes and a cool thumping soundtrack. More of a \"lads\" movie, probably the pinnacle of an 80's nostalgic film.Legendary, if underrated. Move over Top Gun.8/10","Ahhh, to be twelve years old again. I'm pretty sure if I was still that age, I would have loved this preposterous medley of bad acting, copious amounts of Queen's \"One Vision\" and senseless explosions. Sadly (and I do mean that), I've grown up and can recognize IRON EAGLE for what it is... and while it's not god-awful, it's not all that good, either.IRON EAGLE is the story of new high school grad Doug Masters (Jason Gedrick, whom you'd recognize from CROSSING THE BRIDGE and ONE EYED KING had you ever heard of those movies). His fighter pilot dad has been captured by an evil Middle East country for illegally entering its territory (imagine that!). Now papa's gonna be hung and nobody in the US of A is ready to do anything about... 'cept Doug. So our hero steals military intelligence and an F-16 fighter jet (it's quite easy, really... just get your friends to distract army dudes by 'accidentially' spilling juice on their shirts and stuff). With the help of bright spot Louis Gossett Jr., he soars in to save the day.IRON EAGLE actually starts out promising. You might even be willing to forgive its ludicrousness, but it gradually morphs into a meaningless series of fireballs and clichéd dialog. It seems perfectly content to dish out cheap thrills to violence-obsessed boys, and do nothing more. It's also too long and at times borders on the laughable. The film still has a certain charm, but unless your night is slower than molasses, you'll want to skip it.","This movie is not quite as bad as some of the comments want you to believe. It does have some serious reality flaws.  But that's exactly where it excels.  This is not a story about a kid trying to rescue his dad.  This is a story about the flying fantasies of youth.  I grew up playing quite a few flight simulators on computers, and this added to my fantasy of someday flying a fighter jet.  This is exactly what this movie's about, a kid completely enthralled with flight simulations that he becomes a good pilot.They should have left it at that though.  The kid's fantasy of rescuing his dad (also a pilot) from some mysterious middle eastern base should not have been brought to reality.  Reality should not have extended past his races in his single-engine crop-duster with a motorcycle.  Throughout the movie, the kid does not see the world as a dangerous place.  He still sees it as one big simulation.  This is exactly how you should watch the movie, otherwise, it will seem like a ridiculous plot that's out-of-touch with the real world.","This was a pretty good movie. I love fighter jet movies, and this was the best one I've seen lately. It was made using real planes, so that made it an even better movie. If you like watching U.S. F-16s blow the living daylights out of their enemies, this is a great movie for you.","I wrote spoiler alert, but there's not really much that can be spoiled. It's like spoiling rotten meat. This movie is probably the worst I've ever seen. Not because of the actors or the special effects, but because of the sheer number of mistakes, both factual and physical. First of all, the MIGs aren't actually MIGs at all. They're Mirages, and they're French. And how the heck can Doug's dad withstand the maneuvers his son makes to fight off the \"MIGs\" without a g-suit? And why would Chappy try to board his plane without a g-suit? And how could Doug defeat the enemy pilot ace with such ease? Anyway, I did not like this movie. And the worst part is that it has 3 sequels, the latest one from as late as 1995. Now that's scary.","This movie is the proverbial 80s flick that shows the viewer that as long as he or she tries at something, they can be better than the pros. The main character, Doug, showed off his skills in flying a Cessna aircraft, which somehow equated to being fully capable of flying a jet aircraft and being able to kill people. We all would like to have a few million dollars to play with... maybe make a good investment, donate, buy a few things, but the directors of this movie decided to make Iron Eagle... not once... not twice... not even three times; yes, four times. The thing to look most forward to are the multitude 'hollywood endings' in this movie. Just when you think the movie is going to end after a cheesy end sequence, there's another cheesy end sequence. Then another. Definitely a movie one must watch to believe... and maybe own just to remind oneself of how awesome the 80s must have been.","Hmmm... Depending on how you wish to see it, this film is either going to be a great teen/action/vigilante flick or a really bad war movie.I prefer to see it a great teen/action/vigilante film. Despite their being many flaws (Israeli Aircraft instead of American and Iranian ones, ordnance appearing and then disappearing again and again from under the aircraft, as well as the idea that two Air Force planes can be stolen fully armed so easily and not only flown but landed in hostile territory is I admit - Far Fetched)! OK, so I got the cynical stuff out of the way. So what is so good about this film? It is fun, a teens father is shot down over a Middle Eastern country (Iran?), and will be executed by a given time and date if certain demands are not met. Of course the Government won't play ball and the kid gets frustrated and talks a Senior Officer into helping him organise a 2 plane rescue mission.Great fun if you just go with it all.","It's hard to believe that a movie this bad wasn't produced once, but four times! Most movies require a certain `suspension of reality' to enjoy, but this one takes it just too far. The basic scenario is an Air Force pilot who is shot down over a `Middle Eastern' country. The US government drags its feet in recovering him, leading the Pilot's son (Doug Masters) to attempt a rescue mission.The problem I have with the movie is that it depicts the US Air Force as one colossal joke. In the movie you'll find that Doug and his friends on the air base manage to secure two F-16's, all the munitions, the fuel, the Intel for the mission, and so on. Security on this base seems to be a joke. Nobody seems to have a problem that a sixteen-year-old kid is fully qualified to pilot an F-16!If that wasn't enough, you would think the producers would at least attempt to get the munitions right, since people like to see things `blow up'. Not so! Several times in the movie, Doug fires off AIM-9 Missiles on ground targets. AIM stands for `Air Intercept Missile', meaning a weapon used to strike targets in the AIR. He also fires off 15-20 missiles, where the maximum an F-16 can hold is 6 AIM-9's.  The movie also lacks continuity. You'll see the aircraft configured with one set of munitions, and in the next scene, it has a totally different munitions package. Also, 20MM doesn't just completely destroy anything it touches! An F-16 will hold 500 rounds of 20MM, and it's mostly used for self-defense.I could go on forever with plot holes, flaws, and outright wrong information from the movie, but I won't bore you. If you're in the mood to see a good Air Force movie, your choices are rather slim. Most military movies deal either with the Army, Navy or Marines. Until Hollywood can come up with an Air Force movie on the lines of `Saving Private Ryan' or `A Few Good Men', we'll be forced to watch movies like the `Iron Eagle' series.","I remember watching this for the first time in the 80's as a teen. Man, I've read the reviews on this trash and I find myself astonished by the voting. This movie does not deserve four stars!!! This movie is NOT better than Topgun. Topgun has its own problems; don't get me wrong. This movie should be banned just for its own stupidity. So many stereotypes, so many loop holes, so MUCH poor dialog. I cannot think of one redeeming quality of this vomit. This is not action/adventure. This is a bad joke on film. Kinda like watching Plan 9 with stock F-16 footage. This movie not only defies logic and common sense within the context of a military setting, it sends a disturbing message. The military is not going to save your dad from the imminent evil of the middle east b*****ds. So go out there and hijack a multi-million dollar weapon and blast him out of the sinister clutches of the backwards, Anti-American Arabs. Cuz you can't reason with those animals. This is a Bruckheimer flick without a budget. Bland direction, weak acting, lame music, idiotic plot, equals...Iron Eagle.","A teen-age boy, who is not in the military and has not trained to be a jet pilot, takes off for a foreign country to rescue his dad. If this is not ridiculous enough, he talks a Colonel in the Air Force into helping him get his hands on a jet [wow!]. To make the picture even more absurd, the Colonel risks his career and life by giving the spunky lad some hands on aid. They not only don't make Colonels like this anymore, but they never did. This sappy, corny film should be tossed into the air and blown away by a MIG.","I really hate seeing people rip on this movie.  They rip on the realism. How realistic are half of Arnold Swarzenegger's movies?...or any movie like them.  Iron Eagle has a great soundtrack, cool dog fighting sequences, and a good story line (whether it's realistic or not).  It's a story every young person who likes military fighter jets would love to live.  It draws on the fact that you wish it was you \"going in to knock the s... out of them..\" (As Chappy put it).  You people who rip on the realistic plot.....hey.....go watch a documentary.  Or go glam like Hollywood and watch Top Gun. How many times have US and Russian planes flown inverted and given the other the bird from a few feet away.  Iron Eagle is a great movie.....check it out.","OK, the very idea is ludicrous.1. Kids don't own planes 2. Kids don't race planes with dirtbikes 3. It made the Air Force look like total idiots 4. The kids father would not jeopardize his entire career to allow his boy to joyride with him 5. Neither would a reserve colonelThe sequels, I am sure were worse than this tripe. The soundtrack is about the only redeeming quality of this waste of celluloid. I am sorry but I just don't understand why in the world anyone would write direct and produce such unbelevable junk. The Iranian Air Force is lucky to filtch a couple parts for an ageing F-14, and this kid wrangles not 1 but 2 fully loaded and fueled F-16s? Gimme a break.","After a young man's father is captured by an unidentified Middle Eastern country, the youth must suit up and save his father from a brutal execution.This film fails in almost every possible way. No decent music, a weak and unbelievable plot, and actors you will never see again (although a young Shawnee Smith -- Amanda from \"Saw\" -- appears). Louis Gossett is not a star, regardless of what you think.The unidentified country is an interesting plot device. One would suspect it is Iraq or Iran, but no name is ever given. All we know is that now that the \"peanut farmer\" is out of the White House and the \"Raygun\" is in power, America won't take any crap from anyone. (This is an assertion I strongly deny. The film's pro-Reagan bias is astounding.) I also enjoyed the first third of the film, but only because it reached that \"so bad it's good\" status. We have a very one-dimensional teen villain and an epic race between a plane (Cessna) and a Honda motorcycle. We have black man who is the token black man, playing a 1980s black man with signature dance moves. And we have the commentary on the \"great\" music, which was like something I'd expect to hear on a Pat Benetar album that was too poor to release.I could say the flight scenes were interesting. They were alright. But this film was released in 1986, the same year as \"Top Gun\". So, if you want to watch the Air Force shoot down MiGs you're going to want the better soundtrack and the Cruise, Kilmer, Edwards combo. Do you want Louis Gossett as your wingman? I certainly don't.This film would be great to get really stinking drunk to if you want a few laughs at three in the morning. But don't expect a memorable 80s film or anything remotely resembling quality acting.","as a retired USAF MSG (aircraft maint. spec), this has got to be one of the worst movies i have ever seen. the fact that a teenager could ever get on the flight-line, much less get into an f-16 is ludicrous. the military spends millions on each pilot to make them the best in the world and this movie makes the air force and all its members seem stupid at best. yes, i know it is only a movie but it conveys a message to the younger folks that we are all idiots, and believe me, we are not. the logistics involved in setting up any type of mission are highly involved, even in the eighties, military computers were too secure to hack by any teenager, and the other flaws in this movie make peter pan more believable. sorry, to me, this movie has no entertainment value at all.","This movie came out the same year we moved to Houston, and my son was 13. I remember watching it with him back then, and again presently, now that my son is a Commercial Pilot. It is a cheesy movie, everything is pretty much totally improbable, if not impossible, but it is a good story of father-son affection.Jason Gedrick is Doug Masters, young Cessna pilot, high schooler, whose dad is a military fighter pilot. Doug aspires to attend the Air Force Academy and become a fighter pilot also, and has made friends with some on the base who allow him ample fighter simulator time.The drama begins when Doug's dad is flying a routine training mission over the Mediterranian and is shot down. Captured by an unnamed Arab country, he is quickly tried and sentenced to be hung in three days.Naturally Doug wants the USA to rescue his dad but is not happy with their response. So along with his friends, and retired fighter pilot Louis Gossett Jr. as Col. Charles 'Chappy' Sinclair, they hatch a plan to fly two armed fighter planes to rescue dad, re-fueling over the Atlantic. All highly improbable, but fun to watch.SPOILERS: Doug was denied admission to the Academy because of an F he got as a result of skipping classes for simulator time. On the unauthorized mission he not only saved dad but shot down a few enemy fighters. Back home all news of the mission was suppressed and his \"sentence\" for the crime was admission to the Air Force Academy where he would receive supervision and discipline.","** spoiler alert **This is a truly terrible film. It is the worst kind of saccharine, positive can-do, self-congratulatory, USA, USA improbable nonsense. The basic story is that a kid's father, who is a fighter pilot in the US air force, gets trapped in some generic Middle- Eastern country. His son and few other munch kins join forces with another colonel to steal two F-16 jets to save him. The adults are all trusting imbeciles, the Arab villains are stereotyped caricatures while the child actors are annoying, precocious dorks. I said spoiler alert at the beginning but really, you know that there is only one way this is going to end up. Explosions, villains running around like the Keystone Kops trying to stop them with rockets made from toilet roll tubes, Father's saved = 1 all with no American casualties. Every target is made of planks of balsa wood but explodes in a napalm like fireball all to cheesy rock guitar music.You would probably enjoy this film if you were about five-year's old but for everyone else it is a hopeless cause. Time to eject."],"review-user":["scubergmu","Neonsamurai","ma-cortes","Rayvyn","TOMASBBloodhound","aaronspencergrace","spirou666","smjm1982-1","crossworlds@hotmail.com","ReelCheese","maitreg","WorldWar2Kid54","kulhet","sokolowskichris","rivergum","ScottyK","evilashus","helpless_dancer","AmyB-5","nepreneaux","gavin6942","pyyinstaller","TxMike","hepcj"],"review-date":["6 February 2005","10 October 2002","4 October 2006","25 March 2001","14 May 2007","19 March 2006","8 June 2001","5 December 2005","12 January 2003","2 May 2007","12 April 1999","21 May 2003","8 December 2004","7 August 2009","2 July 2011","12 March 1999","16 June 2001","22 June 1999","22 June 1999","13 January 2008","6 November 2006","21 July 2008","27 October 2010","26 December 2010"],"review-rating":["7","10","5","5","4","10","5","7","1","3","10","3","1","1","1","5","1","1"],"review-title":[" And you have to deal with me, Doug Masters\n"," Spoilers. But you can't spoil this movie!\n"," First episode of the franchise with a magnificent Louis Gosset Jr. as ¨Chappy¨\n"," Very fun movie with a great soundtrack...\n"," 1986: The year of the jet fighter movie!\n"," Iron Eagle\n"," Don't watch it again if you have loved it as a child ;)\n"," one of the most exciting fighter jet action movies i've seen..\n"," One Vision\n"," If Only I Were Twelve\n"," Not as bad as some people make it seem\n"," Pretty good movie\n"," Worst...movie...ever (spoiler alert)\n"," If you know how to fly a Cessna, you know how to fly a Fighter Jet\n"," A teenagers Pilot Father is shot down and taken prisoner in the Middle East, a vigilante rescue mission\n"," The worst Air Force movie ever!!\n"," The Jokes on You\n"," This eagle is made out of silly putty\n"," Cool soundtrack. Excellent Movie.\n"," Total garbage\n"," Two Air Force Films Were Released in 1986: This Was The Bad One\n"," possibly the worst movie i have ever seen\n"," One of our family classics, even if it isn't a very good movie.\n"," Terrible Film but laughable\n"]}