{"review-url":["http://www.imdb.com/title/tt0042255/reviews"],"review-text":["I saw this film when it was released to the minor cinemas in the UK some 50 years ago; and the memory remains of a great musical score, and the tragedy of the storyline. I saw it again on video recently. The sound track was poor and the picture grainy; but it is one of two films that I saw again the next day, the other being Gladiator. The music theme is intensely tragic, and from the outset one knows that it heralds failure or death. Certainly one of George Sanders best performances; as a man working the black market to get pay back for what he lost in the war, but nemesis waits; Patricia Roc plays a refugee from Eastern Europe eaten with despair. He is attracted to her, selflessly wants to help her, and then falls in love with her, but she is too proud and hurt to accept help. Their love destroys him, and inevetably the girl and the doctor (Herbert Marshall), who brought the nemesis. The storyline is of complex intertwining destinies, where subsidiary characters are not who they appear to be. This is as a film, which diappointed the critics and struggled at the box office; but for the adolescent who saw it, and the retired gentleman who saw it again it is one of the greatest films (taking into account its age)whose story is more akin to an opera.","Unfortunately, I've never seen the full version of this movie. I did see the 87-minute version twice, back in the 1950s. Even more floridly directed than is the norm with Julien Duvivier, this is a wonderfully out-of-the-ordinary piece, replete with sweeping tracking shots through, over and into Andrejew's magnificently atmospheric sets. Beautifully lit too by photographer André Thomas, Black Jack is nothing if not a connoisseur's delight. Reinforcing this imaginative visual style, is a script that allows a roster of our favorite actors, including Agnes Moorehead and Marcel Dalio, some brilliantly bizarre, full-blooded characterizations. George Sanders gives a polished performance, whilst an eccentric millionairess (who turns out to be a rival racketeer) is admirably played by Agnes Moorehead. Also realizing the most from her role, Patricia Roc. The film was made, on locations in Spain, in 1949.","An early production effort by the Salkind brothers (Superman) this uneasy mixture of neo-realism and and standard actioner was plagued with production problems. Location filming on Majorca dragged on for an incredible seven months. Rushes had to be sent to the mainland for processing so it was impossible to view progress on a daily basis. Some of the post-synching in outdoors scenes is muffled and doesn't seem to match the actors voices in studio sequences.The photography is also uneven, even though the cinematographer Andre Thomas was married to leading lady Patricia Roc some of her close ups are less than flattering. The climax of the film set on two boats is so badly edited that you have a job working out what is going on. George Sanders is completely miscast in an Errol Flynn role whilst poor Pat Roc struggles with an unevenly written part as a Swedish refugee, seeming constantly on the verge of hysterics for no good reason. The technical shortcomings sink a potentially enjoyable film","This was the first time I have seen this European produced 1950 title starring George Sanders, Patricia Roc, Agnes Moorhead and Herbert Marshall.It has a lot of locational shots set in Mallorca, some spoken Spanish and throughout French sub titles apart from the aforementioned actors speaking English. so it was produced for a European audience in all those countries.This desire to be all things to all people makes it lose focus & definition and I therefore only scored it 6/10.The rather convoluted story concerns George Sanders who plays Mike Alexander who trades in drugs, guns, illegal immigrants and other contraband using his yacht \"BlackJack\".He meets a wartime army pal, Herbert Marshall, who is actually employed as a U.S.narcotics agent using his medical background while under the guise of setting up a tropical medicine & research unit.Agnes Moorhead is well cast playing villainesses, she had plenty of practice in her films.Here she poses as an empty brained millionairess Mrs Burg travelling the world, whereas she is just a crook who is trying to relieve Mike Alexander of his ill gotten booty despite claiming police credentials.Finally we have Pat Roc as innocent Ingrid Dekker who has been befriended by Mrs Burg and who seems to have ambivalent feelings for Mike Alexander.There is some pleasant flamenco dancing and singing in the style of Manitas de Plata and an unscrupulous captain Nicaresco whose ship the \"Chalcis\" contains the illegal immigrants who are soon to be sacrificed and cheated by Nicaresco.The artificial love affair between George Sanders & Pat Roc did not convince neither did his vow to wholly renounce crime.I will not divulge the ending or provide a spoiler but the film ends with the question, will Mike Alexander be able to escape Spanish territorial waters by outrunning the shore patrol authorities in his yacht \"BlackJack\" and therefore be outside Spanish jurisdiction?","Something had to have gone monumentally wrong for the great Duvivier to turn out something as uneven, not to say unintelligible as this. Six writer credits on one Screenplay is never a good sign and I for one never thought I'd live to see the day when the names of John and Michael Pertwee shared a writing credit with Charles Spaak. The film has a disconcerting habit of cutting in the middle of a scene then showing the same characters in an entirely different setting dressed in different clothes and an obvious gap in time, the Patricia Roc character segues from cold indifference to passionate love with no discernible explanation, etc. What finally emerges is a cross between To Have And Have Not - smuggling refugees by boat - and The Third Man - black-market drugs in post-war Europe. I can only assume that on paper it looked good enough to attract Duvivier and Spaak but what gets on the screen wouldn't attract flies. It seems there were almost insurmountable problems in production so I'm prepared to give it the benefit of the doubt on the grounds that Duvivier was incapable of making a bad movie, but it remains a major disappointment.","A Spanish-French-UK production with a cast about ready to fade into either oblivion or television.  Dalio turns in the best performance as the weasel captain of a tramp steamer, but an echo of his earlier work under greats like Jean Renoir.  Moorehead is also deliciously double-crossing.  Saunders is caught out of his element trying to create a character similar to Harry Lime in The 3rd Man--the shady, disillusioned post-war 'businessman'. Bogart might have made this role succeed; however, none could equal the archtypal performance by Welles as Harry Lime.  As it is, Saunders is not credible as a conflicted entrepreneur and completely unbelievable as a wheezing love interest for Patricia Roc, herself well past the ingenue stage.  Herbert Marshall turns in the same performance he will soon do weekly in Times Square Playhouse for American television  yawn. Great moments of outdoor cinematography in the all-natural sound stage of the Spanish Mediterranean by the director who gave us Pepe LeMoko.","Both the plot and the visual appearance of this very unknown film reminds the spectator in some whiles of masterpieces of that time like 'The Third Man', 'Casablanca', 'The Lady of Shangai', 'Beat the Devil', or even 'Mr Arkadin' (an strange and marvelous co production filmed in Spain as well) but it's quality is a sidereal distance far away from them.Plot is a little complicated, characters are not completely credible and Sanders is a little miscast in this story settled in Mallorca about an smuggler and his ethical doubts. As in many co productions you feel that the result is composed of glued parts and so the whole thing doesn't work as properly as it should.Anyway, has moments that deserve the watching: A funny José Nieto telling Agnes Morehead she is as beautiful as a fruit in season (though may be you have to be Spanish to enjoy it). And some other beautiful: the cave sequence, the opening with the mills (with remembrances from Orson Welles), besides some glimmer of magic in the acting of Sanders, Morehead and Roc. All the outdoor footage in black and white at the Mallorca seaside is also remarkable.And of course, the musical sequence (magistrally shot) with Lola Flores and Manolo Caracol making some flamenco sketches at the top of their art is something all spaniards should be proud of","Released at a time when Duvivier was going again from strength to strength .\"Black Jack\" which was sandwiched between the overlooked extraordinary \"Au Royaume des Cieux\" and the dazzling stunning \"Sous Le Ciel de Paris\" , is a jumble,which Duvivier himself hated,which is not surprising.There's almost nothing to write about this dud.We can notice that: 1.Orson Welles used to admire Duvivier .That may explain why Wellesian actors were featured in Duvivier's movies :Joseph Cotten in \"Lydia\" (1941) ,and here a totally wasted Agnes Moorehead .It's the first timeI have not enjoyed Moorehead's performance!On the other hand,Welles borrowed his Desdemona (Suzanne Cloutier) from Duvivier's \"Au Royaume des Cieux\" for his \"Othello\".2.In any Duvivier's movie,there's one or two worthwhile sequences and this one is no exception: the search in the caves where Duvivier's sense of mystery works wonders (for a short while);then the chase when Dalio gets caught up in the fishnets.Duvivier's touch can be felt in the unhappy end too.As for the rest ,as my dear pen pal writer's reign writes,it's a black joke."],"review-user":["niathal","JohnHowardReid","jimsimpson","howardmorley","writers_reign","Gilly-13","echanove","dbdumonteil"],"review-date":["25 October 2005","9 July 2008","10 February 2006","18 April 2015","31 January 2007","20 April 2000","19 October 2015","28 July 2007"],"review-rating":["10","9","5","6","5","6","6","3"],"review-title":[" A tragedy in the after war years, played out on the Mediterranean\n"," A Minor Masterpiece from Duvivier\n"," Production problems sink film\n"," No one is who they seem to be\n"," Black Joke\n"," Brave attempt at a post-war Eurofilm\n"," Smuggling from other movies\n"," Jackstraw\n"]}