{"review-url":["http://www.imdb.com/title/tt0083973/reviews"],"review-text":["One of the biggest ironies of film is that, even though moralist losers would have you believe that everyone involved in horror films is a warped sicko, the truth is that just about every major genre star from Boris Karloff to Robert Englund has been extolled by co-stars as a nice, in some cases, unusually nice person, while 'respectable' stars of light-hearted films or \"A\" dramas like Danny Kaye, Judy Garland, Stan Laurel, Marlon Brando and Joan Crawford are infamous for being less than pleasant to be around off-camera. Sure The Chaney family was eccentric, Bela Lugosi would probably have preferred being Dracula than himself, Christopher Lee is(lovably)arrogant, John Carradine was a less than ideal father and Herbert Lom is less than eager to talk about his horror work, but horror stars are, by and large, often friendly people. My interactions with many of them at conventions(as well as a once in a lifetime encounter I had with Peter Cushing while on vacation in Britain)have confirmed this for me. Even minor actors like Whit Bissel and Paul Ehlers(star of the silly slasher movie 'Madman')have come off as very normal or down-to-earth in person.But wouldn't it be great, however, if for once there WAS a horror film star who truly was just as much a fiend off-camera as on? It may not be very good, but Norman Thaddeus Vane's 'Frightmare' aka. 'The Horror Star' provides you with an opportunity to see such an actor!Ferdy Mayne, who gave what is in my opinion, the greatest portrayal of a vampire of all time as the menacing Count Von Krolock in Roman Polanski's 'The Fearless Vampire Killers' plays Conrad Ragzoff(mispronounced 'Ragoff' and 'Radzoff' several times)an aging horror film star with a homicidal temper who has this hilarious ability to brutally murder people in plain sight and just walk away from it. Still, Ragzoff comes off as the closest thing to a sympathetic character in this. It's clear he loves his wife and fans. Although I eagerly anticipated each coming slasher flick in the era when this film was made and I was young, my true interest lay in the classics of Hammer & Universal, so I felt like a fish out of water back then. I could really relate to Conrad as I too felt like a discarded relic; a fan of Gothic castles, foggy cemeteries and moonlit nights rather than horny teens getting sliced and diced(and now in this era of crappy remakes and lame plot twists I'm nostalgic for those things too!). After dying, Conrad's body(still wearing his vampire costume) is stolen by a gang of the most blandly nondescript teenagers(each of whom pretty much has VICTIM stamped on their heads) imaginable. Seriously, the cast was almost entirely killed off and I still had no clue to who they were!(one of the teens is played by a young Jeffrey Combs; take a guess who gets top-billing on bootlegs of this movie). Conrad's grieving widow contacts him through an obnoxious medium, and he comes to life with demonic powers and goes on a killing spree, But because the teens are so nasty, with them humiliating Ragzoff's body by kissing him and dancing with him, one's sympathy ultimately ends up lying with Ragzoff rather than the teens.It's here where the film starts going to hell. For the first 17 minutes it is a good send up of the horror film industry, with a great performance by Mayne(though nowhere near as good as Krolock)but then it just turns into a typical slasher film with Gothic overtones, Conrad may as well just be Jason wearing a Dracula costume since he has no dialog. The murders are well-handled, but fairly uncreative(though a scene where Conrad levitates a coffin to bash a woman unconscious, and later to levitate a coffin with a live victim inside into a crematorium is so awesome it must be seen to be believed.). The film also has lighting that ranges from very nice, soap opera-like chiaroscuro to so bad you can hardly see what's going on. The plot has lots of holes too, the teens specifically mention that their boarding house is where Ragzoff once lived, and it's apparently the same building that we see him living in just a few days earlier! Did his heirs rent it out THAT fast? It's obvious the teens had been living there for some time. It also seems unrealistic that Ragzoff would be allowed such an elaborate and well-publicized funeral considering that he was working in commercials and it's made clear that he wasn't an \"A\" horror actor like Karloff or Price but a \"B\" lister like George Zucco or Lionel Atwill, one of the characters even says \"His entire life was a B-movie\". Bizarre. Still, there's a nice chase through a cemetery at the end, as well as a consistently creepy atmosphere. The ending is also superbly downbeat. I'd say it ranks with 'House of the Long Shadows' as an interesting attempt to revive classic horror.Ferdy Mayne never got the deserved chance to become a horror star, but at least he got to show what he could have done. Long live Conrad Ragzoff! Let him rank with Paul Toomes('Madhouse\"), Byron Orlock(\"Targets\"), Basil Karlo(Batman villain Clayface), Luis Belski(From Marvel Comics \"Dracula Lives\" magazine) and Paul Henderson(\"The House that dripped Blood\") as the greatest(fictional)horror star who ever lived!","Frightmare is an interesting attempt to combine the old thirties style horror with eighties slasher. Ferdinand Mayne stars as Conrad Ragzoff, an arrogant old ham horror actor who dies of a stroke. Some of his fans steal his body from his tomb(what fans!) and all heck breaks loose. Mayne is lots of fun, appearing on a special monitor in the tomb and taunting his soon to be victims. The opening parts of the movie are wonderful; showing Conrad's old movies, him taking care of an unlikeable director, etc. The scenes in the old house, where Conrad stalks the kids, are a little more basic, but still entertaining.Jeffery Combs is good, but the movie really belongs to Mayne. He seems to enjoy himself and makes the movie lots of fun. So basically, it's not one of the great horror movies or anything like that, but still well worth seeing for fans of eighties horror.","Although I do agree that Frightmare is underrated, it isn't something to put too much work into finding.The storyline is a semi-interesting twist on the life after death theme: A legendary horror actor [Conrad] dies mysteriously in his bedroom.  At the funeral his 'last film' is shown: a short with him stating that there is life after death and that he's watching all of the people that are watching the film.  A little later, a group of horror/drama kiddies decide to steal Conrad's corpse and bring him to the house where some of his movies were filmed.  The kids slowly start to disappear, one by one...The first few death scenes are the only downright amazing thing about this movie.  It was nice to see some regular, down to earth 'mental murder' after watching two gore filled movies beforehand.  But even that can't save it -- the murders start to get bloody in a very cheesy way, and them themselves become as boring as the movie itself.I'd suggest renting this only if you have the money to blow and you aren't expecting a masterpiece.  There's better horror films, but every once in a while you need to see something average to remind you of that.","Conrad, a legendary star of classic horror films, is a narcissistic killer as monstrous in life as he is on the screen. Shortly following his death, a group of young cinemaphiles steal his corpse, prompting his devoted widow to enlist the aid of a soothsayer in retrieving the evil actor's damned soul from the fire-pits of Hell. Once reunited with his body, Conrad proceeds to wreak bloody vengeance against the young graverobbers.FRIGHTMARE is a largely miscarried and routine supernatural slasher with atrocious editing and exanimate characters. To the film's credit, however, it does manage to serve up sporadic atmospheric moments which are effectively punctuated by the contra-distinct, multilayered sound editing of creepy, susurrus echos.A prescriptive and nonessential 80s chiller overall, but might suffice as a tolerable time-filler when nothing better is at hand.4/10","Conrad Radzoff is more or less a combination of Vincent Price and Christopher Lee:two famous Gothic horror icons.He sleeps in his coffin like Bela Lugosi and he considers himself a superstar.Unfortunately the times of his stardom are falling apart as he only gets silly roles in commercials.So Conrdad kills his director and after murder he suddenly dies.His body is kept in creepy Gothic mausoleum.A group of university students decide to steal his coffin and defile his corpse.But Conrad isn't really dead.He rises from his slumber and kills defilers one by one...\"Frightmare\" by Norman Thaddeus Vane is a likable supernatural slasher with few gory deaths including decapitated Jeffrey Combs.The storyline is absurd with standard scare techniques,but if you like supernatural slashers with levitating coffins give this one a chance.7 horror stars out of 10.","1983's \"Frightmare\" is an odd little film. The director seems to be trying to combine the atmosphere of classic '30s/'40s style horror movies with the shock factor of the then-exploding '80s slasher genre. It isn't totally successful (mostly due to very obvious budgetary restraints, and the less-than-professional caliber of its cast of young actors) but it still has its moments, mostly due to the classy performance (classier than the movie deserves) by the late German actor Ferdinand Mayne, who plays an aging old time horror movie star (ala Vincent Price) named \"Conrad Ratzoff.\" At the beginning of the movie we meet the has-been horror star as he's shooting a commercial for dentures and we quickly learn that ol' Conrad is a bit of a hoity-toity, prima donna jerk-off. Just when you think he couldn't be any more un-likable, the commercial director berates Conrad for blowing a take for the umpteenth time and the old goat pushes him off a balcony to his death. Nice, huh? Conrad then visits some fans at a college campus horror movie club, unfortunately he suffers a heart attack in the middle of his speech to them and eventually ends up back at his mansion waiting to die. Still feisty even at Death's door, he manages to do away with a despised business associate by smothering him with a pillow before he finally kicks the bucket himself. Conrad is then laid to rest in true Hollywood style in a high tech neon tomb with video screens above the casket, which will play personal video messages from Conrad himself for visitors who enter to pay their respects.It is at this point that the kids from the college Horror Movie Society decide to pay Conrad's grave an after hours visit, breaking into the tomb and taking his body back home with them for an all night party. (Not exactly my idea of fun, but hey, these are characters in an '80s horror film. Logic has no place here.) The college kids spend the evening having dinner with Conrad's body seated in a place of honor, posing for photos with it and even dancing around the room with it, before parking Conrad and his coffin in the attic, planning to return him to his crypt in the morning. In the meantime, Mrs. Ratzoff, distraught over the theft of her husband's body, has called in a psychic friend to try and \"reach\" Conrad through a seance. You can pretty much figure out the rest from here. Since Conrad wasn't a very nice guy in life, it's not much of a stretch to assume that he won't be any friendlier in death. Psychic Lady makes contact with Conrad and he re-awakens in predictably ticked off fashion, then spends the rest of the movie strolling around the corridors of the students' ridiculously huge house, picking off the young grave robbers one by one. This is where the movie falls apart. Endless scenes of teens wandering around empty hallways saying \"Hello? Is anyone there?\" are intercut with occasional bursts of violence (we do get a pretty gnarly decapitation scene, which is the highlight of the movie) before the last two survivors finally figure out (WAY later than any semi-intelligent people would have figured out the same thing...but again, we're in an '80s horror film!) that the only way to stop the mayhem is to get Conrad's body back to its crypt where it belongs. The sluggish pacing is padded out with a lot of weird lighting and dry ice fog effects backed by a soundtrack made up almost entirely of sound effects rather than music(thunder, moans and groans, howls, etc.) that becomes severely annoying after a while.I can't really recommend \"Frightmare\" to anyone who didn't grow up watching cheap movies like this on late night cable back in the '80s. \"Modern Horror\" fans will doubtlessly find \"Frightmare\" incredibly slow moving and goofy. If you came of age in that magical decade, however, you may get a blast of nostalgia from \"Frightmare.\" Fans of Jeffrey (\"Re-Animator\") Combs may also want to check it out, as the future Dr. West appears in an early role here as one of the unlucky film students.I will advise the reader to avoid the version of this film on the EastWestDVD label (paired with Roy Ward's \"Vault of Horror\" and sold at dollar stores) because the print quality is terrible. I'm told the film has gotten a deluxe release via the fine folks at Troma, which seems appropriate. If you're a Troma kind of person then \"Frightmare\" will be right up your alley.","Frightmare obviously will never win an academy award, but it is something that most low-cost horror movies aren't--scary.  The star, an aging horror film actor, gets posthumous revenge on those who decide to kidnap his corpse.  The sequences of their murders are suspenseful and chilling as they get picked off one by one.  The easiest death is by gas chamber and the worst is by live cremation.  For those who like mindless entertainment, tey may not like this movie.  But for those who like movies about retribution getting served for a bunch of grave robbers, this would be up their alley. Though not the best horror film ever made, but it certainly isn't the worst either.  It's worth the 99 cent rental fee.","Me and my best friend Jim love this movie, It is an underrated little gem. The plot centers around an aging horror star (its original title), who is bent on revenge, when a group of college kids steal his corpse. This movie has it all, scares, laughs, and saint, yes saint, the ring leader of the college kids. He's got the looks, he's got the style, he's got the girl. But what he hasn't got is a prayer of making it out of this movie alive! check it. also, look for Jeffery Combs of re-animator fame.","Legendary hammy and arrogant horror movie star Conrad Radzoff (splendidly played with wicked sardonic aplomb by Ferdy Mayne) dies of a heart attack. A bunch of drama school students steal Radzoff's corpse from its crypt and take it to a rundown mansion so they can party with it. Radzoff comes back to life and picks off the rude youths for desecrating his grave. Writer/director Norman Thaddeus Vane concocts a fresh, original, and even pretty stylish spin on the usual body count premise, offers a neat evocation of the glitzy Hollywood milieu, and does a sturdy job of maintaining a pleasingly misty and spooky ooga-booga atmosphere. The kill set pieces deliver the grisly goods, with a gal being set on fire, a juicy decapitation (the severed head rolls right down the stairs and onto the lawn so a raven can peck away at it!), and another poor lass being crushed with a levitating coffin rating as the definite gruesome highlights. Kudos are also in order for the stellar cast of familiar B-flick faces: Mayne has a deliciously eye-rolling ball with his flashy role, Leon Askin contributes an amusing cameo as bitter washed-up director Wolfgang, Nita Talbot adds some class as flaky psychic medium Mrs. Rohmer, plus there are nice turns by Luca Bercovici as jerky drama student ringleader Saint, Jennifer Starrett as the sweet Meg, Jeffrey Combs as the geeky Stu, and Scott Thomson as the nerdy Bobo. Popping up in cool bits are Chuck \"Porky\" Mitchell as a detective, Patrick Wright in one of his customary policeman parts, and Tallie Cochrane as a corpse. Joel King's polished cinematography gives the film an attractive glossy look. The moody score by Jerry Mosely likewise hits the shuddery spot. A fun little fright flick.","I don't get it! The teenage leads in \"Horror Star\" supposedly all are devoted horror fans, yet when their favorite idol (Conrad Radzoff) passes away, they dig up his corpse and do all sorts of disrespectful stuff with it, like disco-dancing it around the house and throw food leftovers at it. That doesn't sound like something real horror fans would do, now does it? I'm a big horror fan and I immensely idolize departed icons like Vincent Price, Peter Cushing and Boris Karloff, but it would never come to my mind to ridicule their memory. No wonder Conrad comes back from the dead  admittedly, after a séance  to wipe them all off the face of the earth! Mr. Radzoff already wasn't known for his friendliness in life, since he occasionally killed the directors that disagreed with his visions, and even after his death he suffers from a tremendous ego. Even inside his tomb there are video messages to petrify possible visitors and the group of teenagers will vividly experience that he also enjoys the murdering business outside his film sets. \"Horror Star\" (a.k.a. \"Frightmare\" and \"Body Snatchers\") is a pretty lame 80's horror flick, but there are a handful of cheesy & gory highlights to enjoy. The film mainly suffers from its own stupid plot, since no one  not even a film school student  is stupid enough to steal a recently buried corpse and actually think he'll get away with it, and there are too many tedious moments to struggle through. Conrad's video-speeches from beyond the grave are overly talkative and definitely undermine the tension, but on the other hand his killing methods are pleasingly inventive. One teenager enjoys the experience of getting cremated alive and another one (Jeffrey Combs in one of his first roles!) loses his head in a delightful decapitation sequence. In the absolute messiest sequence, a poor girl' head is crushed by a coffin. Writer/director Norman Thaddeus Vane wanted to bring homage to vintage horror cinema and he obviously how to make film look sinister. The locations and scenery are great, but Vane lacked the necessary funds to provide his film with a proper continuity and editing-job. The acting performances are overall decent, with Ferdy Mayne (imitating Christopher Lee) and Jeffrey Combs delivering the most memorable roles. \"Horror Star\" can hardly be called a must-see or even a good film, but it's worth tracking down in case you're an admirer of enthusiastically made B-horror.","One of the last surviving horror screen greats - Conrad Radzoff - dies and has his body placed in a mausoleum with televised-before-death snippets of the great Conrad greeting you as you visit. Unfortunately for him and his captors, Conrad's body is \"borrowed\" by a gang of four boys and three girls and taken to a huge manor where they drink with him, toast him, dance with him, laugh with and at him, and then put him to bed in a casket which just happens to by lying in a room upstairs. News of the missing body reaches Radzoff's widow and her friend(who happens to be proficient in the black arts) and she holds some kind of ceremony that brings Conrad back to life so he can, in his own words, get \"an eye for an eye, a tooth for a tooth.\" Well, Frightmare is an interesting \"bad\" film. Sure, it is cheap. The sets look like they were borrowed(which I am sure they were). The special effects and blood and guts are done liberally and with little credibility. The acting is average to below average with a few exceptions. Jeffrey Combs of Re-Animator fame is in tow, but really he does little in this rather thankless role as a horror obsessed teen that needs to steal a dead man's body for kicks. None of the \"kids\" except the pretty girl playing Meg is any good. Nita Talbot plays the \"friend\" of the Radzoffs with withering interest. Also, look for the big - I mean big - guy that plays the policeman. That is Porky himself of Porkys fame. But thankfully for all of us, one performance does rise above the material. Ferdy Mayne, an oft overlooked actor from Germany who had Christopher Lee features and did star as a vampire in The Fearless Vampire Killers, does a more than commendable job as the aging horror icon in public life and a real demon of a man in private life. Conrad Radzoff in a bad human being in life, living solely for his own pleasures and we see him kill twice before he is even dead(obviously none of the swinging teens at that point). Mayne is able to look very regal, speak very elegantly, and convey menace with ease. If for no other reason, one should see Frightmare for his performance. I do; however, believe that when they showed black and white clips of Radzoff that they used Christopher Lee footage(anyone have any thoughts?). Anyway, one can guess what happens and it does indeed: Radzoff goes out and goes after the kids that disturbed his peace. Again, the formula is trite and overused. The acting for the most part is anemic, and the direction oh so ridiculous. But Mayne gives a good performance in a sea of ineptitude. Definitely worth a little peek. Watching Mayne keep popping up on screens in his mausoleum brought a wry smile to my lips each time.","Aaaaahhh, the classic B-movie horror films of the 70's and 80's... they don't make them like that anymore.I had never heard of this film before my lovely lady bought it for me while she was away. Yesterday I decided to sit down and watch it... I loved it.Now it has everything you can expect from a cheesy B-movie horror: Cheap gore, Lots of murders, Topless women, Bad acting, Terrible effects.But the last 2 are not negative remarks... if the acting and the effects were good, it would not feel right.The film is about an old horror actor, which i believe was an imitation of Christopher Lee, that dies and has his grave made into a crypt where people can go and see his body and see video messages from him. Some teenagers decide to steal his body from the crypt to have a party with it, but little did they know that when they took the body some black magic happened thanks to his widow and he comes back to life to take revenge on his kidnappers...It is a great film... and it even has a young Jeffrey Combs in. He made this 2 years before he made Re-Animator. The only other face I recognised in this film was Scott Thomson. And I mainly know him for playing Chad Copeland in a couple of the Police Academy movies.I will give this film 7 out of 10.A really entertaining film which is comedy gold.For more of my reviews, please like my Facebook page:http://www.facebook.com/pages/Ordinary-Person-Movie- Reviews/456572047728204?ref=hl","Conrad Radzoff(Ferdy Mayne), a hammy cult icon, dies from a heart ailment(not before disposing of an ungrateful assistant and TV commercial director, both of whom disrespected him with showers of insults). His body is removed from his mausoleum by some film students(they wish to \"invite him to dinner\"..they are quite big fans). What these kids(..including a young Jeffrey Combs)don't expect is that Radzoff will be resurrected by a medium to wreak havoc on those who removed him from his place of rest.The list of violent acts include Radzoff pulling one guy's tongue out, setting a woman on fire, elevating a casket which crushes a woman's face, decapitates one fellow, and cremates another guy alive in a coffin. A really weird soundtrack and pesky fog wraps around Radzoff's ghoulish activities.Silly hokum from Troma is limited by a very, very low budget and slowwwwww pace. The film feels a lot longer than it is. The film isn't really that gory and we can hardly see much violence because the film is often too damn dark. At times, Radzoff is an ominous presence, yet at other times he just looks real silly.","I thought maybe... maybe this could be good. An early appearance by the Re-Animator (Jeffery Combs); many homage's to old horror movies; the Troma label on the front this movie could be a gem! I thought wrong.Frightmare is a boring, overplayed, half assed homage to the fright films of yore. The story is an old one, young people breaking into a house, getting drunk, making love, and tampering with things that shouldn't be tampered with. The oft  recycled slasher film formula is used here, this time with a thought to be dead actor named Conrad Radzoff doing the killing. In fact, the performance by the Radzoff's actor Ferdy Mayne is the only redeeming quality of this film. He does the snooty Dracula style character very well. But as for the kids, its not so good, with Combs only having a minimal part.The film lacks entertainment value, and only features one cool character, and one or two scenes that can hold your attention. I do not recommend this film unless you are desperate for something to watch, and this is the only movie left at blockbuster.","This 1983 horror film tells about a horror actor (Ferdy Mayne) who plans to make his final mark when he dies. On the night of his funeral, a group of teens decide to have a party in his honor and steal his body from the mausoleum. Soon, their horror icon returns from the dead and haunts them one by one. This is a good, creepy 80's horror flick that pays tribute to classic films of the genre and is also known as \"Horror Star.\" The late, Mayne was great in it, the score & sound effects are chilling and there's some gory make-up effects. I recommend this to any horror fan.","Not to be confused with the 1974 Pete Walker horror film of the same name, Norman Thaddeus Vane's Frightmare is a goofy little film, the strange plot, weird atmosphere and offbeat performances resulting in a film that, while not particularly effective as a horror (genuine scares are in short supply), almost demands cult status.The silly story sees ageing horror star Conrad Radzoff (Ferdinand Mayne, doing an amusing pastiche of Christopher Lee) bumping off two of his directors, one past and one present, before finally shuffling off this mortal coil himself. Soon after, Conrad's eternal peace is rudely interrupted by members of the local horror film society, who break into the actor's mausoleum and steal his corpse, treating it with a considerable lack of respect. When the horror star's wife is alerted to the fact that Conrad's body has gone missing, she hires a medium to contact her husband's spirit, and instructs him to return from the dead and teach the impudent scallywags a valuable lesson.So what makes this film so batty? Well, for starters, Conrad's mausoleum is a high-tech marble monstrosity that makes bleepy computer sounds and comes complete with a neon sign, a motion activated video screen, and a vent that spews toxic gas. And when the crazy film kids get Conrad back to theirs, what do they do? Well, they invite him to dinner, dance with him and pose for photos with their idol. The death scenes are also a mite strange, the weirdest one seeing Conrad levitating his coffin to bash in a girl's head.Without a doubt, the best thing about the whole film is Mayne's performance: whether it be alive as a hammy horror actor, or stone cold dead and motionless as a cadaver, he is utterly convincing and quite beguiling. Unfortunately, whenever Mayne is off-screen, the film is almost as lifeless as his character's corpse.4.5 out of 10, rounded up to 5 for the brief topless nudity from Donna McDaniel and the nice and bloody decapitation of a young Jeffrey Combs.","Writer and director Norman Thaddeus Vane here creates an interesting little horror film that makes the most of its meagre budget. It comes highly recommended to those horror fans that crave atmosphere, because for Vane the atmosphere takes priority over the gore.It's a nice melding of 60s and 80s styles, and gives a juicy lead role to an actor who definitely deserves to be better known: Ferdinand \"Ferdy\" Mayne. Mayne shows that he had what it took to be a major genre star a la Lee, Price, and Carradine, not that he did too badly for himself, appearing in things like \"The Vampire Lovers\" and \"The Fearless Vampire Killers\". He brings dignity and theatricality to his role as Conrad Ragzoff, an egotistical horror star who passes away. Unfortunately, some dopey, foolish film students get it into their heads to make off with his corpse and have some fun. Unfortunate for them, as Conrad's widow Etta (Barbara Pilavin) uses a medium (Nita Talbot) to allow Conrad to come back to \"life\" to terrorize and brutalize the kids.One thing that really hurts \"Frightmare\" (alternately titled, appropriately enough, \"The Horror Star\") is sluggish pacing, but otherwise Vane does a creditable job at building up some tension and menace. The music score, by Jerry Mosely, is especially effective. The deaths aren't terribly imaginative, but they're still entertaining; highlights are a decapitation and a human torch sequence.In addition to capable veterans like Mayne and Talbot, other familiar faces include Leon Askin, as a bitter film director, Luca Bercovici (director of \"Ghoulies\"), Scott Thomson (a cast member of same), and Chuck \"Porky\" Mitchell as an investigating detective. Jennifer Starrett, daughter of film director Jack Starrett, is appealing as the character of Meg. But \"Frightmare\" will definitely be intriguing to the genre fan for featuring an early film appearance by future \"Re-Animator\" star Jeffrey Combs, who's basically just one of the gang here.This movie is good enough to warrant more attention, and in the end it's hard to resist any film that shows vintage Christopher Lee footage to stand in for the clips from the Conrad Ragzoff filmography. All in all, it offers a fair amount of fun.Seven out of 10.","Frightmare begins with a horror movie icon killing a director and then his servant before he is laid to rest. This icon, who has some Christopher Lee qualities to him, then continues to haunt those around him when a group of horror film society students steal his corpse from the mausoleum he is in.The first ten minutes is well-filmed, good writing and lots of potential for murderous mayhem. But the film drags in the middle (although thankfully not as much as \"House of Death\") and never really gets that initial spurt of energy back.Lots of the deaths are confusing, as they seem to have people just falling over scared when they see a floating coffin or other odd things. Twice we see poisonous gas being used. But the box promises that this horror star will be the embodiment of all the monsters he has played. Boy, is that false advertising, unless he spent his career playing boring old men who take naps and watch \"Matlock\".The general principle of the film is decent: horror society kids stealing a corpse of a dead icon. A modern equivalent (digging up Vincent Price or Peter Cushing) would make a great film. Maybe a remake is in order if that wouldn't be too disrespectful. Sometimes theory doesn't come across as well in application, and this film offers that example.The only redeeming quality of this film (besides the beginning) is the brief appearance of a very young Jeffrey Combs. I saw him and thought \"that's Jeffrey Combs\" but felt I was mistaken as the box never mentioned him. But sure enough, Combs was present. (A note to this movie's film-makers: mention Combs on the cover of the DVD, you'll sell more copies if if you would be deceiving customers.) If you're a Jeffrey Combs die-hard, check out this early role. Otherwise, I cannot offer this as a great selection for a horror movie marathon. Let me suggest \"Intruder\" or \"Popcorn\", as those are both pretty decent and will stand the test of time.","Not really bad this peculiar mix of teen slasher and 30's horror movie, with good direction, creepy atmosphere, Jeffrey Combs in one of his earliest role, and a very good lead in the role of the old horror star returning from the grave to punish his fans (well, they have stolen his body and made fun of his corpse, so they deserve their fate). To search, find and enjoy","~Spoiler~ Frightmare is a cheesy horror romp from my favorite decade: the 80's. It's about an aging horror icon named Conrad Radzoff who is very much modeled after the look of Christopher Lee and the attitude of Bela Lugosi. He dies from a stroke and, in accordance to his wishes, gets a lavish funeral in which he will play his final role (he's even buried in his Dracula costume...like Lugosi). After the funeral some devoted young fans want to pay their respects to their favorite fright star. How do they do this you ask? By breaking into his crypt and stealing his corpse for a farewell party. Talk about having no respect for the dead. Clearly this is not a sympathetic bunch of characters and they get what's coming to them. In this film, you're actually supposed to root for the monster I believe. Conrad is soon revived (with no real explanation) and starts bumping off the teens in formulaic fashion. The pace is a little slow and some of the death scenes are really silly but I expected that. I also expected bad acting but was pleasantly surprised in that regard. 80's horror fans will recognize a few principal cast members. Ferdy Mayne, who plays Conrad, was in such classics as Howling II and Night Train to Terror. Luca Bercovici and Scott Thomson were both in the 3-D vehicle Parasite, not to mention that Bercovici directed Thomson in the epic Ghoulies. And, last but not least, there is a very early appearance by a young Jeffrey Combs. That's actually the reason why I rented this film. Unfortunately he's not the hero of the piece. So unless you're a Combs devotee or just love 80's schlock, you probably won't dig Frightmare.","I suppose I am a bit partial to Frightmare because I first saw it on television late at night about 15 years ago (back when ABC did Fright Night Theatre-anyone remember that?) and it did give me the creeps.  Even though a lot of the film's aspects are a bit amateurish, it's still chilling and fun to watch, and I really loved the scene where the teenagers are dancing with Mayne's dead body around the dinner table.  The film has a very unusual atmosphere and horror buffs should enjoy it, it's got a little bit of everything (i.e. gore, creative deaths, chills, spooky settings and locations).  Mayne really hams it up in the film's opening sequences, and it fits here.  Rent (or buy-I did) this one from your local video store. You'll have a blast.  My rating: 6/10","Not to be confused with Peter Walker's 1974 British shocker of the same title, the early 80s \"Frightmare\" was a cheesy low-budget supernatural slasher made the more interesting for it having Jeffrey Combs taking on his first main role. Other than that it was an unmemorable drawn-out fare, which sadly had a fun macabre premise which had shades of \"Children Shouldn't Play with Dead Things\", \"The House of Seven Corpses\", \"Theatre of Death\" and \"One Dark Night\" but the execution while proficient was stodgily drab with little imagination. Although some atmosphere did find its way in, especially with the fog machine getting a good workout within its shadowy foundation. After the death of a legendary horror actor, a group of film students steal his corpse from the crypt and go about fooling around with it within the house where the actor had made some of his best pictures. However they didn't count on the actor's corpse coming back to life to exact revenge on them. Ferdy Mayne's histrionically high maintenance turns as horror icon Conrad Radzoff is full of Grand Guignol as he comes back as a vengeful corpse reliving his glory horror days. In murderous impulses, he starts getting migraines (well that's what it looks like) actually he's using mind control as he goes knocking off the obnoxiously detestable bunch of characters which featured the likes of Scott Thompson, Luca Bercovici and Nita Talbot as the actor's selfish wife. These were a rowdy bunch you cheered, when they succumb to their grisly fate. Of the lot, Bercovivi and Comb's deaths were the picks. The offbeat script (namely with those live interactive moments) is disjointed and gets a bit repetitive, but it had an amusingly diabolical sense of humour to go along with its cheap jolts and crazy low-rent special effects. A silly, slipshod b-horror movie.\"Let's call it a wrap\".","Watching Frightmare made me ill. All I have to say is the basic premise of the film is: \"The Soul lives after Death...why not the body?\" If you find this brilliant piece of craptacular dialogue intriguing then prepare yourself for the thrill a minute schlock-a-thon which is FRIGHMARE!","Alright, I will be the very first to say that this is not a great film, but then ninety-nine percent of the horror films made are pure garbage. This one rises a little better than that. Ferdy Mayne (of Roman Polanski's \"Dance of th Vampires\") Is well suited to the vainglorious, aging horror star, determined to control things even after death. He manages to get his revenge from beyond the grave, against some college film students who have failed to respect his final remains, stealing his body from his mausoleum to have a party in his honor. Some of the acting is less than memorable, but there are true chills if you set out to watch this one in a dark room, all alone, after midnight. It is at least a middle of the road horror classic.","Strange horror film from the early '80's that is just bleeding with style, freaky imagery, and atmosphere. Lacking in the blood and gore, but full of imagination. It's too bad that many scenes were shot in complete darkness. I enjoyed this film.It looks as if it were trying to be a modernized take on the old Dracula movies of the '30's and'40's. The horror themed music that is filled with snarling growls that plays through the film sounds as if it were meant for a Halloween haunted house, and thats a good thing. Fog is constantly rolling through each shot, and the characters play their roles straight. This movie gave me a very spooked feeling when I viewed it. Story is about movie obsessed teens who steal the corpse of a recently deceased horror star and are soon bumped off in supernatural ways at the hands of said horror star, who wanders around the Gothic mansion looking like Dracula. Features a creepy possession scene, woman set on fire, floating casket, ripped out tongue, Porky from Porky's, Jeffrey Combs and the guy who directed Ghoulies. As I said, low on blood and gore, but just flowing with creepy imagination. Troma re-released it, and the sound is awful. Three stars."],"review-user":["TheFinalAlias","Sanguinaire","b. koski","EyeAskance","HumanoidOfFlesh","MetalGeek","Richard-110","saint-21","Woodyanders","Coventry","BaronBl00d","richieandsam","Scarecrow-88","fulcigore","gwnightscream","BA_Harrison","Hey_Sweden","gavin6942","pumaye","Backlash007","Lunar_Eclipse_Scoping","lost-in-limbo","DNA-10","ozthegreatat42330","drhackenstine"],"review-date":["21 December 2009","15 October 2003","11 October 1999","14 August 2011","11 August 2012","16 October 2009","23 May 1999","8 March 1999","18 December 2008","16 January 2007","29 December 2005","5 January 2013","17 October 2006","29 April 2007","7 May 2018","17 January 2018","1 October 2012","17 September 2006","26 January 2004","1 April 2007","23 December 2001","11 August 2011","5 September 1999","21 February 2007","5 September 2005"],"review-rating":["6","7","3","8","4","4","7","4","4","6","5","7","4","6","4","6"],"review-title":[" Always nice to see an actor making a comeback....Even if he's dead...\n"," Gothic Gore\n"," Only a tiny bit underrated...\n"," Ancillary 80s teenkill froth.\n"," Supernatural slasher with some stylish touches.\n"," Pretty Goofy...\n"," Scarier than I Know What You Did Last Summer\n"," underrated!!!!\n"," An enjoyable early 80's supernatural slasher outing\n"," True horror stars never really die!\n"," This Has to Be Christopher Lee's Worst Nightmare!\n"," Good B-Movie\n"," Frightmare\n"," I thought maybe....\n"," Good, Creepy 80's Horror Flick!\n"," Death by floating coffin!\n"," Do people have no respect for the dead?!?\n"," Thundering Start... Then Nothing But Sputtering\n"," Stylish 80's horror\n"," \"I have never died before and I want to do it right.\"\n"," Creepy and fun horror film\n"," \"The dead are dead\".\n"," Why not the body?\n"," Get past the Shlocky Troma Intro and the film is pretty good.\n"," An Eye For An Eye A Tooth For A Tooth\n"]}