{"review-url":["http://www.imdb.com/title/tt0073271/reviews"],"review-text":["In a way, this is one of the great iceberg crashes of the movie industry, en par with Waterworld in terms of failed hopes. If you're interested not just in movies, but also in the stories behind them, then this is a most worthwhile film. It represents the effort of a Hollywood studio (20.th Century Fox) to cut in on the highly profitable Emmanuelle franchise (which was so profitable that it has been credited with saving the entire French cinema industry). Instead of pulling off another unlicensed \"Emanoellle\" ripoff, they dug into their pockets and put some serious money on the table and hired \"Emmanuelle\" herself to do the writing, acting and directing. What this meant in practice was that the actual author of the Emmanuelle books, Louis-Jacques Rollet-Andriane (!), would write the script and direct, while his wife Marayat, under whose pseudonym \"Emmanuelle Arsan\" the Emmanuelle-books had been published, and who had consequently become an icon of eroticism, would appear extensively in a supporting role. And as a little extra for the American market, none other than porn legend Linda Lovelace would star in the title role.But it all sort of went horribly wrong from there on. First of, a drug-addled Linda Lovelace became a born-again Christian after signing on, and consequently refused to do any nudity. In fact, she even took umbrage against a statue of Venus de Milo on the set because it had exposed breasts. Not a good stance to take if you're going to star in a softcore movie. Poor Linda, this was the chance of her lifetime, her single possibility to finally cash in a bit on her notoriety by doing a nice, harmless movie, and she ill-advisedly threw it out of the window.Instead of Linda, the producers hired French actress Annie Belle, which was clearly a lucky stroke. Annie Belle, in contrast to Lovelace, could act, and despite her young age, had the brain of a seasoned erotica producer trapped inside her pneumatic body.Unfortunately, now it was author and co-director Louis-Jacques Rollet-Andriane who played up. He didn't just want to make a sexy movie (like Emmanuelle, which is exactly what the were expecting of him), but wanted to forge a visual pamphlet of his swinging philosophy (which the backers had no interest in). Eventually he withdrew his name from the project, which is why direction is credited to \"anonymous\", which in turn really impeded its marketing. Since the movie is visually first class, I bet you that consequently a lot of money went down some river in the Philippines.After all this I expected a conker of a movie, but I was pleasantly surprised: Laure is, in large parts, a very sexy movie, and had the potential to be a lot better than Emmanuelle. Annie Belle is absolutely stunning, and she is well matched byAl Cliver (her then real-life boyfriend), who gives the ladies in the audience something to ogle at.Laure's advantage is that unlike Emmanuelle, it does not try to create the image of an extremely libertine woman who is ready for anything once the la-la-music starts. In particular there are practically no scenes of penetrative sex filmed as softcore (i. e. without showing more than nipples and a few pubes) like in Emmanuelle -- which in my opinion always looks a bit silly and tedious, and never really works.The cinematography and settings are absolutely stunning and make Apocalypse Now look like Married With Children. Same for the actors. And some of the music is actually first-rate, which in an erotic movie is rarer than hen's teeth. They obviously spent a lot of money on Laure, this is not just another cheap Emmanuelle ripoff.Unfortunately, like in Emmanuelle, there are some very extended scenes of gibberish philosophy which really drag on and make your brain bleed.There is also one pretty tough scene in which Laure and her boyfriend go to their hotel room. A member of their expedition asks Laure to join him in his room, and before her boyfriend's eyes she agrees. While she's having noisy sex with the interloper, her boyfriend then elaborates that \"her pleasure is my pleasure\". This movie is a lot about swinging and the correspondent mentality, which I guess many viewers will find hard to stomach. I certainly did.And there are admittedly some snags in the movie. There is one very surreal and completely incoherent scene in which a transvestite pilots a helicopter over Manila (Louis-Jacques clearly had a thing for in-the-air-sex). They pick up his girlfriend, and then he suggests to put the \"helicopter on autopilot\" so that she and Laure can get it on. This is Ed Wood stuff. And at the end of the movie they clearly ran out of money and / or ideas, so it ends with a hastily thrown-together dream sequence.So, I hear you beg of me, what's Marayat, the chick who supposedly wrote all the Emmanuelle-books under the pseudonym \"Emmanuelle Arsan\", like? Seeing her is a bit like having the real Superman appear in a Superman movie. She has a pretty extensive role as \"Myrte\", a foxy oriental babe who is in a threesome relationship with a blonde chick (naturally) and a professor. She is a very sexy woman, and it is no surprise that her husband, according to the producer, was besotted with her. She has several erotic scenes which somewhat softer than other scenes in the movie; you can, however, tell that she is less of an actress and more of a, model because her timing and delivery are a bit lackluster.My bottom line is still that Laure is definitely worth checking out. Sorry for being so verbose, but I hope you enjoyed my review. My account of the making of this film is based on the statements included in the extras section of the 2007 DVD release.","I think I watched a highly edited version because it wasn't nearly as graphic as I expected - based on the other reviews that I have heard.Other than 1. being written by the same person who wrote the original \"Emmanuelle\" (1974), Emmanuelle Arsan, 2. the lead character being a sexually free spirit, and 3. being set in the exotic locale of Asia, \"Laure\" doesn't have the same flair as its predecessor.I just found this film way too talky with philosophical topics that I'm really not that interested in, i.e. the voyeuristic, open relationship between Laure and Nick, \"I'm just happy with whatever brings her pleasure\"...something along those lines. I cannot relate to this mentality and the film/characters don't really shed any light.The second half about finding the Mara tribe just seemed as though it were a completely separate film. One that I didn't care for. By that time, I was just hoping that it would turn into a porn so that at least it would keep my interest.Maybe I just didn't get it.I'll leave it at that.","I've been strangely attracted to this film since I saw it on Showtime sometime in the early 80's.  I say strangely because it is rather a ludicrous bit of soft-core fluff, a genre I'm not particularly interested in. The dialogue is pompously and nonsensically philosophical (making sense, no doubt, only to it's Franco-Italian producers)and the plot completely extraneous. What it does achieve is a wonderfully hypnotic and thoroughly pleasant mood.  The scenery (the beautiful Philippines), soft-focus nudity and wonderful score all contribute to a strange and extremely watchable exercise in a sort of film making seldom seen today. It is truly one of my great \"guilty pleasures\".  I was fortunate enough to find it on an old laserdisc and have watched it more times than I think is healthy.  A worthwhile moodpiece.","I finally saw LAURE and I have to say that I equally enjoyed it and was dismayed by it. What's great about it is the atmosphere, the music, the location, the cinematography and the beautiful cast. The story is non-existent for sure but with these movies it doesn't really matter. The pace in languid and the settings are exotic. The film has a lot going for it. Unfortunately, it also has a few things going against it. The first thing is that the gorgeous Annie Belle and the handsome Al Cliver have no chemistry whatsoever. Because the two are playing a couple and are on screen for almost the entire length of the film the lack of chemistry between the two is a definite liability. According to IMDb, Al and Annie were a real couple when they filmed this movie. They sure kept their attraction to each other from showing on screen.The other problem with LAURE is that some sex scenes are just ineffective or even ridiculous. There's one sex scene that stands out as one of the silliest I've ever seen in any soft porn flick: our young blonde couple are picked-up by a helicopter pilot who happens to be a cross-dresser! The pilot flies over the city to pick up his girlfriend (!) and they have an orgy of sorts in the helicopter, in mid-air. And Al Cliver is filming all of this with his 16mm camera! I kid you not. Ridiculous. We later see that 16mm footage being edited on a moviola. While the footage rolls, Al and Annie start making out. This scene is actually good but the footage on the screen behind them was at times too much. Watching the footage of the cross-dresser getting it on with his bimbo while piloting the helicopter almost had me rolling on the floor laughing out loud. Is this supposed to be erotic or believable in any way? The last thing I want to see is a woman pleasuring a man in drag, certainly when the man in drag makes for such an ugly woman, while piloting a helicopter, no less. Al and Annie getting it on was cool as was the music during the entire scene. I just wish the footage on the editing screen wasn't so silly.Speaking of drag, another dull plot point in LAURE which really drags the movie to a crawl are all those moments with the great Orso Maria Guerrini and his two wives. A married threesome is an interesting idea but it hardly registers here as hot or even interesting. The two women are sorta dull and we rarely see the three having sex. In fact, Orso keeps his clothes on for almost the entire film, even when he's with Annie Belle. This is another minor complaint about LAURE: there's nudity but it's not as much as other films of the same era. It just needed more skin to punch it up.Except for those minor complaints and the drag queen moments, LAURE is actually very watchable. I love these kind of softcore films from the 1970s when the attention was set on mood and atmosphere, not the crude stuff we see today.p.s.: make sure to watch Emanuelle in Egypt, which stars Annie & Al but also another famous screen couple, Laura Gemser and Gabriele Tinti. The music in that movie is also great.","Despite some really scenic locations in the orient and some sporadically energetic music by Franco Micalizzi, this film doesn't quite reach the level of Joe D'Amato's similar efforts while staying just about as trashy. The author of the original book \"Emmanuelle: The Joys of a Woman\", Emmanuelle Arsan, directed and had a smallish role in this film, which mostly pornographically showcases a very young Annie Belle as she gets in a variety of oddball sexual situations. Her boyfriend, played by ZOMBIE's Al Cliver actually approves of her sleeping around and even persuades her to continue her practices even after the two of them are married! Orso Maria Guerrini drops by as a professor who is oh so usually married simultaneously to two women, one of whom is played by Arsan herself. Despite beginning promisingly and having a few hilarious lines of dialog like \"can you see me with the naked eye?\" ... \"I can see you better naked!\", the film shambles along plotlessly up until the less-than-spectacular finale. Much like D'Amato's EMANUELLE AND THE LAST CANNIBALS, the main characters are all in search of some lost tribe, but don't get your hopes up, there's no violence at all in this film, and not much sex either for that matter. Just a lot of nudity and silly dialog. I couldn't help but find some appreciation for this little film, if only for the completely cornball logic the film goes by.","Gorgeous Annie Belle in her prime stars in this adventure/sex movie. She wears her hair in a buzz cut that is bleached platinum. She and her boyfriend are visiting some tropical Asian paradise. They have decided to keep an \"open\" sexual relationship, which is played out on their journey to find a secret society/tribe where the people live one year and then are reborn in some kind of ceremony. The scenery is gorgeous, deep vast green gorges and jungles are explored. The imagery is very similar to that of the movie \"Black Emanuelle\". It is rich and colorful. Recommended!","This is a rather bizarre movie in that it was co-directed by the real-life Emanuelle Arsan, who wrote the influential \"autobiographical\" novel \"Emmanuelle\" on which Just Jaeckin's even more influential French film \"Emmanuelle\" was based. The other director, however, is the primo Italian trashmeister Ovidio Assontis, who was responsible for \"The Exorcist\" rip-off \"Beyond the Door\" and the \"Jaws\" rip-off \"Tentacles\". Here he's basically ripping off Jaeckin's \"Emmanuelle\" in collaboration with the original female author. The strange result of all this is a film that is as allegedly arty and laughably pretentious as the \"official\" French \"Emmanuelle\" series, but every bit as low-rent and derivative as the many Italian rip-offs of that same series (although, unfortunately, it's not nearly as entertainingly sleazy as the Joe D'Amato \"Black Emanuelle\" films).The movie concerns a mini-skirt clad, underwear-averse young woman, \"Laure\" (Annie Belle), who is traipsing about the Filipines on some half-ass anthropological expedition to find a lost native tribe. (If this were a d'Amato film the tribe would turn out to be cannibals and eat everybody, but don't get your hopes up here). She is encouraged by her photographer boyfriend (Al Cliver)to have sex with anybody and everybody (older men, women, local natives, and even at point a transvestite helicopter pilot!) usually while he films the encounter.Belle was a very pretty French girl with a fantastic body, who always looked incredibly sexy despite the bleach-blonde, crew-cut Annie Lennox hair-do she always wore. She was starring in, and sometimes even writing, movies like this from the time she was barely 18 years old (She also appeared in Jean Rollin's \"Lips of Blood\", Masimo Dallamano's \"End of Innocence\", Ruggiero Deodato's \"House by by the Edge of the Park\", and with Laura \"Black Emanuelle\" Gemser in \"Velluto Nero\"). Emanuelle Arsan herself also appears in the movie and she too has a plethora of nude sex scenes. (Strangely, she actually looks a lot more like the \"Black Emanuelle\" Laura Gemser than the official \"Emmanuelle\" Sylvia Kristel). The real problem though, as others have said, is the lame-brain plot of this movie which is pretty boring and really adds nothing at all to the eroticism. I guess I'd recommend this to my fellow 1970's \"Emmanuelle\" completists. But while it's not terrible, it's not that great either.","Laure (1976)** (out of 4)Co-director and co-writer Emmanuelle Arsan is the one and only Emmanuelle who would write the \"autobiography\", which would then be turned into a massive hit by Just Jaeckin and be \"reworked\" so many times over the years that most people will forget that the story wasn't originally meant to tackle perverts in rain coats. This \"serious\" tale has the beautiful Annie Belle playing Laure, a young woman who goes around the Philippines on a anthropological expedition to find a lost tribe. Her boyfriend (Al Cliver) wants her to be \"free\" so he recommends she have sex with every man and woman that she can. Also known as FOREVER EMMANUELLE, this is yet another sexploitation film that features non-stop sex and nudity but at the same time after the first few scenes you can't help but get bored. This movie here is a complete bore from pretty much start to finish because there's nothing ever going on that makes any sense nor does anything happen to make you feel as if you're using your time for a good thing. This movie is so incredibly pointless that after the first thirty-minutes or so you begin to wonder why you're wasting so much time with so many movies like this. Joe D'Amato would end up making countless Emanuelle films and the majority of them were bad but at least they had some sort of exploitation going for them. When the group enters the jungle to locate the tribes nothing happens except it gives Laure more people to sleep with. At least D'Amato would have had some people either eaten or killed. There's no question that Belle is a beautiful woman so seeing her naked and in countless sex scenes is going to be the main draw. Cliver is always fun to watch even when he sleepwalks through a part as he does here but that might be unfair to say since whoever is dubbing him does such a poor job. The sex scenes are never very erotic and the dumbest sequence has to come when a transvestite picks Belle and Cliver up in his/her helicopter and an orgy breaks out in the front seat. The film runs 91-minutes and if you want nothing but nudity then this might work for you but if you demand at least a somewhat interesting plot then you're going to be sitting through some pretty boring stuff that never adds up to much. As to who really directed this thing is still up in the air but Arsan gets credit for it and if she was the director then it certainly wasn't her field as she never brings the material to life and things just come off rather cold and bland.","I've been strangely attracted to this film since I saw it on Showtime sometime in the early 80's.  I say strangely because it is rather a ludicrous bit of soft-core fluff, a genre I'm not particularly interested in. The dialogue is pompously and nonsensically philosophical (making sense, no doubt, only to it's Franco-Italian producers)and the plot completely extraneous. What it does achieve is a wonderfully hypnotic and thoroughly pleasant mood.  The scenery (the beautiful Philippines), soft-focus nudity and wonderful score all contribute to a strange and extremely watchable exercise in a sort of film making seldom seen today. It is truly one of my great \"guilty pleasures\".  I was fortunate enough to find it on an old laserdisc and have watched it more times than I think is healthy.  A worthwhile moodpiece."],"review-user":["Karl Self","PWT20","rfrover","Maciste_Brother","Aylmer","Katy-13","lazarillo","Michael_Elliott","rfrover"],"review-date":["5 October 2008","2 February 2006","30 March 2001","10 April 2008","30 December 2000","21 March 1999","1 April 2009","7 March 2011","30 March 2001"],"review-rating":["4","8","8","8","7","8"],"review-title":[" The Making-Of\n"," Shuddap and have sex already!\n"," Strangely compelling\n"," Amazing atmosphere but contains one of the most ridiculous sex scenes ever\n"," Another soft-core lightweight addition to the Emmanuelle saga\n"," Journey to the lost tribe\n"," The real Emmanuelle Arsan does her own Italian \"Emmanuelle\" rip-off\n"," Bland and Boring\n"," Stangely compelling\n"]}