{"review-url":["http://www.imdb.com/title/tt0078924/reviews"],"review-text":["Brian (Wesley Eure) works for a security firm owned by Mr. Norton (Conrad Bain). The Norton firm is in financial trouble for, unknown to the owner, he has an employee who is selling secrets to a rival firm's owner (Jim Bacchus). It's not Brian, as he is a loyal and faithful employee and a good inventor. But, Mr. Norton has no patience with Brian, in part because Norton's beautiful daughter, Casey (Valerie Bertinelli) has a thing for Brian and Norton questions Brian's motives for wooing her. However, Brian does come up with a great security device. It's called CHOMPS, which stands for canine home security system. The device, which looks like a dog, is actually a computer controlled animal with the ability to knock down walls and emit siren sounds to capture burglars. The rival owner sends two bungling spies (one is Red Buttons) to learn the details of the new invention. Will CHOMPS save Norton security? This is a fun family flick from the old school of good, clean entertainment. CHOMPS is, of course, a real dog, played by the adorable and talented Benji. In fact, Benji has a duel role, as Brian has a \"real\" dog named Rascal, too. Just watching this little dog in action is pure joy, as he is able to scale walls, \"pull\" trucks, and operate machine buttons to capture the bad guys. The human cast is also quite nice, with everyone giving upbeat performances that are infectious. Costumes, scenery, and production values are good, too. Although you may have trouble locating the film, it would be well worth the effort to secure a view for your closest loved ones. CHOMPS is a wonderful, wholesome diversion from the world's woes.","C.H.O.M.P.S. isn't the greatest kid-geared film made, but it is a lot of fun to watch. It's especially fun if you're a dog lover. The idea of a robotic home-security dog that follows number-based commands may have been a bit far-fetched in 1979, but it could be an actuality in the near future. Aside from one serious curse word (\"s***\", which is why it's rated PG) spoken in the mind of a neighboring dog, C.H.O.M.P.S. is harmless, less violent, & more imaginative than most \"children\" films nowadays. Yes, it is dopey, but what the heck - it's a cute film for kids & doesn't try to be anything else. Simple, innocent entertainment. The dog is cuddly, the acting is mediocre (several then TV stars are in it - Jim Backus, Conrad Bains, the guy from Land of the Lost, Valerie Bertinelli, Red Buttons, etc.), but it's an enjoyable film if your expectations aren't too high. Give it a chance.","The most enjoyable pet movie since Scooby Doo and Garfield. The story revolves around a 23 year old inventor named Brian Foster whose systems at his boss's company seems to keep failing, Brian is also dating the boss's daughter named Casey. But Brian secretly invented a robotic dog named CHOMPS, modeled after his own dog Rascal. But CHOMPS is no ordinarily dog, he is as fast as a cheetah, he has x-ray vision, can leap about 6 feet, and has a strength of 20 men. The new invention impresses his boss, and makes his business a success. But when the company rivals hear about CHOMPS, they try to find a way to capture him. Can CHOMPS outwit them before its too late. This movie is a classic for all ages.","Eager electronics whiz Brian Foster (a likable performance by Wesley Eure of TV's \"Land of the Lost\") creates a computerized watchdog called C.H.O.M.P.S. (an acronym for Canine Home Protection System) for his boss Mr. Ralph Norton (nicely played by Conrad Baain), whose home security business is floundering. A rival company hires a pair of inept criminals to get their grubby hands on C.H.O.M.P.S.; said task proves to be easier said than done. Director Don Chaffey relates the endearingly dopey story at a constant brisk pace, maintains an amiably silly and lighthearted tone throughout, and stages the goofy slapstick gags with considerable flair. Moreover, the game cast mug it up with infectious aplomb: the adorable Valerie Bertinelli as Brian's sweet fiancé Casey Norton, Chuck McCann as klutzy crook Brooks, Red Buttons as McCann's equally bumbling partner Bracken, Jim Backus as evil CEO Mr. Gibbs, Hermoine Baddeley as nice old biddy Ms. Foster, and 60's AIP exploitation feature regular Larry Bishop as smarmy, duplicitous suit Ken Sharp. Best of all, the titular pooch is a cuddly delight: C.H.O.M.P.S. jumps through fences, walls and windows with amazing agility, performs acts of exceptional strength, runs faster than a deer, and even does a few nifty martial arts moves. A subplot about a hulking neighborhood hound named Monster supplies a few extra belly laughs (Monster is voiced by some uncredited guy with an appropriately deep, growly voice). The groovy animated opening credits sequence, Charles F. Wheeler's glossy cinematography, and Hoyt Curtin's funky, pulsating disco score are all solid as well. A cute little kiddie flick.","This movie is a nice, cute family oriented film.  If you don't like violence, this is the movie to watch.  Only thing annoying about this movie is the tune (but it's a catchy tune) repeats whenever c.h.o.m.p.s. leaps in to action.","I saw Chomps during the - approximately - 2 days of its theatrical release. It is a delightfully cute and funny movie in the spirit of 'Benji' though much improved and focused more on the actors than the dogs. The simple portrayal of life difficulties in a humorous way, followed by the bullies and villains getting their just deserts, is both sympathetic and heartwarming. It is also thought provoking. With deft subtleness this movie affects ones awareness of cruelty, personal behavior, and bullying. Movies have different genera's and different purposes. This movie, which is delightful to all ages, offers an interesting humorous look into our own experiences. Everyone will recognize personality and behaviors types of themselves and others. Everyone will see the humor. The humor makes the move enjoyable and brings understanding of life situations to a new level. For lighthearted laughter and a 'feel good' movie Chomps is an excellent choice. Memorable.","In this spoof of crime fighting gadgetry and corrupt business execs.Wesley Euire(Best rememebed as \"Will Marshall\"on the 1970's version of The Kroft Bros.and NBC TV's\"Land Of The Lost Show!\")creates a bioonic dog.Which he programs to protect property and people from intruders.A large crime wave hits the city and Euire tries to impress his not too understanding boss:\"Mr.Norton\"(played by former \"Maude\"and \"Different Strokes\"actor:Conraid Bain)with his new invention.His efforts are not too well received by \"Mr.Norton\"(Mr.Bain).But it takes some crooked doings by Bain's competitor(played delightfully by the late Mr.Jim Backus)and his two bumbling hencemen(played by the equally delightful Chuck McCann and Red Buttons)and alot of persuation from Bain's Daughter\"Casey\"(Valerie Bertinelli)to get Bain to ultilize Mr.Euire's crime fighting dog device.Bertinelli's performances are sadly limited to a few scenes .Where she fights with her onscreen father(Mr.Bain)to get him to use \"Chomps\"and she bills and coos with Mr.Euire.Other than these minors sequences.The rest of the film centers on Euire's attemps to get his device to work right.And the bumbling capers of Messers:McCann,Backus and Buttons are the real stars of this minor film comedy from Cartoon producers:The Late Mr.William Hanna and Mr.Joesph Barbera.","I've seen this movie several times, when it comes out on DVD it'll be added to my collection. The story is great, there's no bad language and there's just enough comic relief to keep it all light--like a good Disney movie should be. The acting is typical Disney and you see a lot of the same faces as in other Disney movies. The plot revolves around an inventor that develops a robotic dog \"security system\" who looks just like his real small dog. A lot of the comedy comes from watching this tiny little dog beat up the bad guys, bust through brick walls and otherwise perform amazing stunts--really well done. This is a movie for the whole family although the kids will probably cry just like I did in the one really sad part of the movie (and no, I won't blow it for you). This is another Disney classic along the lines of \"The computer that wore tennis shoes\" and \"Flight of the Navigator.\" For it's time, this movie was way ahead and is also just plain good sci fi. Loved it.","C.H.O.M.P.S. is very much like any number of cheesy late 70s Disney family comedys-The Cat from Outer Space or Unidentified Flying Oddball, for instance.  Utterly devoid of anything creative, beating the same cliches to death, yet vaguely entertaining in a mindless sort of way. The actors won't win any awards, nor will the director, writer, or FX crew, but in its inoffensive ness and bland predicatability there is some vague entertainment to be had.  The idea of the robot dog as security system is so full of holes you could use it as a colander.  The incredibly repetative disco soundtrack will stick in your head, so beware.","Nowhere near as good as \"Benji\" or Lassie. It is the sort of movie you would probably watch once or maybe even twice and then you'd donate it to a children's' hospital. There are lots of canine hero movies that are a lot better, such as \"Benji\" and \"Lassie\" but if you are into canine hero movies, you should watch this one for a bit of variety from the standard formula. C.H.O.M.P.S does get a bit blown up, but is successfully repaired, so just steel yourselves and your children for that","C.H.O.M.P.S which starred Wesley Eure and Valerie Bertinelli has Eure as a young inventor working for Bertinelli's father Conrad Bain at a security firm. After the latest of Eure's systems fails, Eure loses his job, but Valerie has faith in him. And its more than justified when Eure comes up with a computer driven super dog named C.H.O.M.P.S. which has far more powers than your average pooch. With a set of number commands the dog which is modeled on Eure's real life terrier can do all kinds of things in keeping a given area safe and apprehending those who break in. I'll let you see the film to see what C.H.O.M.P.S can do.But there's also Larry Bishop who is both putting the moves on Bertinelli and secretly working for Bain's rival Jim Backus. And Backus and Bishop also have a pair of inept crooks played by Red Buttons and Chuck McCann in roles that must have originally been meant for Tim Conway and Don Knotts.This is a light and amusing family entertainment film that still holds up well for today. Nice and unpretentious, I recommend it highly for juvenile audiences.","For a scientifically-engineered super-dog that was supposed to be the answer to petit crime, CHOMPS was a chump.All I ever saw Chomps do was sit, or walk, or run. Or run, then walk, then sit... and then get back up again and stretch, and then walk, and then jog to K-Tel dance hits. And sometimes it had all the answers to the daily Jumbo. But mostly it just sat a lot.All I am saying is:  In a Celebrity Death Match, Chomps couldn't take out Mr. Bigglesworth."],"review-user":["inkblot11","cozmiccharly1","hcalderon1","Woodyanders","jamesmcdone","teraferma","Stanbabe","suemccartin","DrSatan","shelleyegoodman","bkoganbing","JZvezda"],"review-date":["19 September 2007","28 April 2005","23 July 2006","18 September 2008","2 October 2000","21 May 2004","15 June 2003","19 August 2004","13 January 2003","11 May 2017","6 November 2013","30 July 2003"],"review-rating":["7","6","10","8","10","10","3","6","6","2"],"review-title":[" Fun family flick, especially for those who love darling dogs and who does not?\n"," Good fun for kids\n"," it's a bird, it's a plane, no it's CHOMPS\n"," The Bionic Benji, or, the Six Million Dollar Mutt\n"," It's great\n"," Cute Funny Movie - Memorable\n"," Bertinelli has little to do in this crime fighting parody.\n"," This movie is totally cute and classic Disney\n"," Stupid, yet vaguely entertaining\n"," Nowhere near as good as Benji or Lassie, but quite passable\n"," Super Dog\n"," Benji, but with a beat\n"]}