{"review-url":["http://www.imdb.com/title/tt0090102/reviews"],"review-text":["This film is great! Being a fan of \"The Comic Strip Presents...\" I just knew I would love this film. And love it I do. I finally got round to buying a copy of this film early this year. However I was annoyed to find that it had been cut! So I'll keep looking at car boot sales for the original version.Anyway, the film is about Dennis Carter (Adrian Edmondson), who tries to impress his girlfriend (Dawn French) by claiming to be a drug dealer. However, Dennis is overheard bragging one night in the pub and nicked! So Dennis turns supergrass but the trouble is he doesn't know anything and starts to make up lies and dig himself into an even deeper hole! The irony of all this is that there is drug smuggling going on down in Devon.This film is not as funny as I expected but it is still a really good film with some good laughs and a great soundtrack. It also has the best scene ever in a British film (Robbie Coltrane's walk across the pier set to \"Two Tribes\" by Frankie Goes To Hollywood.So if you are a fan of \"The Comic Strip Presents...\", of any of the cast members, or a fan of British comedy see it A.S.A.P!!!","A lot of 'alternative' comedy in Britain in the 1980s was insular, misguided, overly-political, and unfunny, and the worst of the Comic Strip Presents... stuff fell into this category. But this is at the other end - a remarkable film that works on different intellectual levels. Is Dennis a criminal mastermind or is he lying? Is he telling the truth, bluffing, double-bluffing, counter-doubly-bubbly-bluffingwhatever? I've probably watched Supergrass 20 or 30 times, and I still can't decide 100%. That's the wonderful thing. As well as Ade Edmonson, there are big roles for other early Comic Strip mainstays - French & Saunders, Pete Richardson, Alexei Sayle, Keith Allen, Nigel Planer and Robbie Coltrane, though curiously enough not Rik Mayall. All of the Comic Strip cast - however much I disliked the hidden agenda of some of their members - are convincing actors, and turn in superb performances in this big-screen outing, while the Richardson-Richens writing team's work is so often pure genius, with nice little touches of detail throughout. Ultimately this is a study of crime, criminology and human nature, in all it's wondrous complexity. And very funny with it. You will not be disappointed.","This really is a great film, I have always been a fan of the early 80's alternative comedy scene, and the comic strip films were the perfect setting for this genre. Like the Young Ones, and French and Saunders, most of these comedians got tegether for the comic strip, most were made for TV movies, but The Supergrass was a full-length feature film, which if I'm not mistaken even went to the cinema? The main character is Dennis ( Ade Edmonson ) who despite being a moron, still living at home with his mother, thinks he's something he's not. Dennis tells lies in order to impress his wannabe' girlfriend, he is overheard in a pub, boasting about a fictional drugs ring, by a policeman( the ever excellent Micheal Elphick ) But, the so called drug deal by the seaside is not just a lie, the police have been trying to crack this for a long time. Dennis becomes a supergrass and gets dragged deeper and deeper into it, The trouble is he doesn't know anything, or does he.....? The Supergrass is one of those films you are still trying to work out, is Dennis just the goon you think he is, or does he know more than he'll tell? Though the Supergrass has its truly funny moments, it is added to by the terrible 80's fashion and music, which obviously was not supposed to be funny first time around. Dennis buys a horrible red leather jacket (identical to Micheal Jackson's thriller one) was this actually cool in the 80's or was it intended to be funny? The Film is made up of great individual performances, Peter Richardson, Keith Allen, Jennifer Saunders, Daniel Peacock, Nigel Planer, all put in exceptional shows of acting, and who can forget Alexi Sayle's most annoying policeman. The only thing missing is Rik Mayall. If you are a fan of British Comedy, and the likes of the young Ones etc, this is a must own film * * * *","Great 1980s Comic Strip comedy set in the South West of England. It is a tale of sex, drugs, cream teas and murder by the seaside. Adrian Edmondson, French and Saunders, Nigel Planer (hilarious in drag) and Robbie Coltrane play a part. Dennis (Edmondson) tries to impress girlfriend by boasting he is involved in a multi-million pounds drug deal. This leads to complications with hilarious results. I am trying to find out the original picture ratio for this film but it does not appear under 'Technical Aspects' of the IMDb site. I spotted the DVD in the shop and it appears to be in 1.33:1 (full screen) format. Was the film shot in this ratio or was it originally a widescreen film with a pan and scan DVD? It would be useful to know as I hate pan and scan films. So come on IMDb. Could you find out for us?","I just finished watching this (last weekend) and found it absolutely hillarious, some of the scenes I just couldn't stop laughing at! Dennis is soooo amazingly thick sometimes, and just says the stoopidest things...but at the same time he's just being cool to impress his girlfriend (who gets arrested anyway!) The beach scenery is very tranquil...until along comes Robbie Coltrane...! Not the greatest movie ever made but certainly something to think about renting on a Saturday night when you haven't got much else to do (like I did). You might need to hunt around for it though - I was lucky, as my local video store stocks it.","The first feature-length movie by the guys from The Comic Strip,The Supergrass feels like it's just a longer episode. Adrian Edmonson's character tells a girl he's a drug smuggler(which is a lie) and gets busted by the police.They tell him if he becomes a narc(grass in British slang) they will drop the charges,so he tries to help them bust 2 smugglers played by Nigel Planer and Keith Allen. If you like The Comic Strip Presents,you will like this. I would recommend this to all fans of comedy but if you have trouble with English accents or slang, it may be hard to understand some stuff.Not to mention all the dated British pop culture references that even younger Brits would probably not get. If you think you have a good sense of humor,watch it.","By far the most entertaining film I have ever seen. The first time I watched it I was around 16 and found it quite boring, but laughed very loudly at one scene. Used to go pictures most nights back in the day as they had an offer on £1 every night. Nothing else on the next night so watched The Supergrass again, cried laughing second time and went to see it every night for a week. I have probably seen this film over 40 times over the years and still cry laughing, absolute genius KEEP WATCHING it gets funnier every time. This type of comedy only comes around once in a lifetime. My favorite films include: Once Upon A Time In America, Weird Science, Saturday night Fever-Staying alive-Grease, Scarface, Faceoff, Pulp Fiction The Goonies, Batman Returns, The Life of Brian, Superbad, The Kingsmen, Rita Sue and Bob too, Me Myself and I, The Other Guys.","The Comic Strip featured actors from 'The Young One's' - a student based sitcom from the 80's. Comic Strip features included parodies of westerns, 'The  famous 5', and The Professionals - all a lot funnier than this. Having said that  Alexei Sayle puts in a good turn as a traffic cop with ambition and the soundtrack features great music from the era. 5/10","This is a typical British comedy starring Adrian Edmundson, who is well known for playing Vivian in the Young Ones. If you don't know who the Young Ones are, then all I can say is find out. It was a series made in the early eighties about four university students who lived together. This movie has a similar feel to the Young Ones except that Edmundson's character, Denis, is actually much more nerdy.Denis is a mother's boy and wants to impress a girl so he makes up a story about how he is a courier for a major drug ring. Unfortunately some policemen overhear him and arrest him. When they go to charge him the computer tells them that he is a very important criminal and summons a detective from Scotland Yard. He is then made a deal, either go to gaol or help the police bust this heroin ring. He chooses the second option and asks for £3000 and a jaguar and goes to the seaside town of Hope Bay with two detectives, who happen to be ex-lovers.This is a clever movie because we are never too sure what Denis is. He claims to be a courier but once things start getting hot, he confesses that he made everything up, but did he? Namely because there is a lot of evidence found that points to a drug ring operating in the area. The end also leaves a little question because Denis sees some heroin being smuggled out and decides not to reveal it.Supergrass is more of a movie about the relationships between the three main characters, Denis, Harvey, and Harvey's ex-girlfriend. Denis wants to be popular, to have a girlfriend, and to have money, but he is trapped in his mother's house. Thus it seems that he continued his deceit to the police because he saw a way to get what he wanted. Harvey is constantly tortured because his ex-girlfriend is with him and making a lot of moves onto Denis. It seems that she is doing that to torture Harvey.This is quite a funny movie and has both Dawn French and Jennifer Saunders in it as well as Alexi Sayle. I have never seen French and Saunders but I do know what Sayle and Edmundson are like. This movie is funny and for fans of British Comedy, it is a good one to watch.","In which the gang take us down to Devon for a spot of the old drug smuggling. Edmonson, Saunders and Richardson take the leads while various other Strippers pop up along the way. No Rik Mayall if that is a major factor.Richardson and Richens cleverly tell a story which provides a level of interest while letting us concentrate on our favourite comedians. At this point in the game most of us were really looking for our alt comedy faves on the big screen. So, we are served up a series of semi humorous events while the plot gels along the way. Alexei Sayle grabs the limelight as a funny traffic cop but is, ultimately, trumped by Robbie Coltrane's \"walking on water\" act at the end. Both those roles are largely superfluous to the plot but the roles of Nigel Planer and Keith Allen have a bit more relevance than is immediately obvious keep watching!Richardson & Saunders begin to appear as actors rather than comedians. Ade Edmonson gives us his \"nerdy bloke\" routine.You will laugh: if nothing else at the above mentioned Sayle segment. And most people raise at least a chuckle at the pub disco scene. But it is one of those Brit films which leaves you amused rather than clutching your sides in laughter.","The funniest movie from Britain I have ever seen, \"The Supergrass\" is a tale of sex, drugs, cream teas, and murder by the seaside. Dennis Carter (Adrian Edmonson), average moron, is out to impress his so-called girlfriend, Andrea (Dawn French), because she thinks he is too law-abiding. So, to get her to come along with him on a romantic getaway, he comes up with a scheme that perhaps will impress her and entice her to spend some time with him. Trouble is, Dennis' lie is that he's somehow gotten involved in an international drugs ring, and while telling her, a couple of policemen overhear his boasting and nick him. And so begins this witty movie, full of slick comedy and crude jokes. Dennis is banged up in the local nick, and, much to the arresting officers' delight, there seems to be no way out (Andrea's earlier attempts to explain it was all a lie were dismissed by a hilarious melody of \"Stand by Your Man\" by the two officers'). Then comes along Commander Robertson (Ronald Allen), Chief Intelligence, Scotland Yard. He makes a deal with Dennis, that if he helps him catch the drug smugglers, then he will be set free and allowed whatever he pleases. Dennis agrees, and is teamed up with Harvey Duncan (Peter Richardson), and Lesley Reynolds (Jennifer Saunders). The rest is an unforgettable rib-tickling experience, with Robbie Coltrane as Sergeant Troy adding humourous colour to the film. His walk along the dry-dock against \"Frankie Goes To Hollywood's Two Tribes\" is superb, and probably the best scene in motion picture history. The two officers' who nick Dennis are wonderfully played by Michael Elphick and Patrick Durkin, and Alexei Sayle as the motorcycle cop is a laugh! If you want something good to watch on a Saturday night, then I suggest you rent this. You won't forget it!","This is basically a feature length Comic Strip Presents... episode, probably made in an unsuccessful attempt to capitalise on the success and popularity of the Young Ones at the time. Like many of the Comic strip Presents... episodes it was completely unfunny, driven by Richardson and Richens, whose humour had nothing in common with the crown jewels of the Comic Strip scene, the puerile but hilarious Mayall/Edmondson style represented by \"The Young Ones\" and \"Bottom\". Richardson and Richens merely rode on their coat tails.Although the laughs are absent, the Comic Strip style was much more plot-based than Mayall & Edmondson's, so you do at least get a proper story. But who cares about a story in a purported comedy? In short, stay away and don't encourage them.","I struggle to see the point of this movie. It is supposed to be a comedy but I didn't laugh once. The storyline is one that could have been interesting in a well made movie, but since this is acted by comics, the result is totally unbelievable (as comedies should be). The Comic strip series was very hit and miss, even withing the episodes, and it is fair to say all of the people involved have gone on to do greater things. One to avoid. I have also just found out that comments have to be 10 lines long. The whole point of these comments is to give an indication of whether the movie is worth watching: not write an essay gushing about it or taking it apart. If you like: Seinfeld, Larry Sanders, the Young Ones, Alan Partridge, Arrested Development, Curb, Red Dwarf, then you might like to pass on this. On the other hand, if you like lame jokes such as can be found in Friends and Dodgeball, enjoy watching this!","I wasn't expecting much from this movie. To be honest, I just wanted to see Saunders and Edmondson together on screen. I was surprised to see how good this movie turned out to be. The plot is engaging and it leaves the viewer wondering was Dennis telling the truth or not. Saunders, Edmondson and Richardson were very good at portraying the odd trio and it was nice to see Ade and Jennifer in a more serious role than those in their usual repertoire. All three of them were very sweet, especially Ade as a naive \"supergrass\". This comedy is very different (in plot as well as style) from other works of my favorite married couple of comedians, but that is what makes this movie so special and original; at least to me. People who aren't fans maybe won't like this flick. There's nothing groundbreaking about it and it's humor is much more subtle than \"Ab Fab\" or \"Bottom\" but nevertheless, it made me laugh a lot. I'm already looking forward to seeing it again with my sister (who is also a fan of Saunders)."],"review-user":["simon_mulvaney","Champion-3","boffins","TajMahal2000","TheEdge76","OrangieTooDope","kirstywirsty-40271","deputy_vanhalen","david-sarkies","tim-lloyd-723-886555","MrTaft","gut-6","deadlyledley","Audrey_L"],"review-date":["5 September 2000","21 March 2002","4 July 2002","23 May 2006","30 December 1999","25 April 2017","13 April 2015","17 March 2003","11 December 2013","28 March 2013","23 November 2000","23 June 2013","16 January 2006","22 December 2014"],"review-rating":["7","10","8","10","10","4","7","7","10","4","4","10"],"review-title":[" Dennis Carter: Supergrass...or is he?\n"," One of the best high-end comedies ever\n"," The Comic Strip's big movie outing.........\n"," Great film but what about the picture ratio\n"," One of my long time favourites\n"," Another Edmondson classic.\n"," The Supergrass, alternative comedy at its best\n"," Not the best the Comic Strip did\n"," Is he a dealer? I couldn't work it out.\n"," accomplished effort from comic strip team\n"," The best British comedy yet!\n"," Didn't laugh once\n"," Pointless\n"," A pleasant experience\n"]}