{"review-url":["http://www.imdb.com/title/tt0062731/reviews"],"review-text":["Mindless, 'wacky' nonsense involving sorry group of thieves in Italy who hope to rob Old World mobster Vittorio De Sica out of 50 grand...unfortunately, he's broke. Plan B has the team plus De Sica and criminal mastermind Edward G. Robinson joining forces to steal five million in platinum ingots from a train. Inane, overlong caper with mostly obnoxious characters (particularly Robert Wagner's, who keeps barking insults like a tough Sammy Davis, Jr.: \"I've had it, baby, can you dig it?\"). Raquel Welch is bouncy as the one girl in the bunch, and anyone watching will end up just watching her. Ken Annakin directed, without flair, style or humor. *1/2 from ****","Not a truly funny movie, but it is amusing. Watching Robert Wagner acting tough is very amusing. Of course there is Raquel in all her splendor. Watching her go-go with Edward G. Robinson (!) is worth the price of admission alone. The supporting characters do the best they can with the cartoon characters they are given to enact. And you get to watch Godfrey Cambridge play the violin!","I don't go for that many \"heist\" comedies, and I might not care for this one if it weren't for the actors, when it was made, and when I FIRST SAW it (just a few years later). It's almost too similar to \"The Happening\" (even though it's obviously a much less serious comedy than that one) - Mafia figure takes over his own kidnapping, or rather, turns it in a different direction altogether. Of course, Raquel Welch didn't play the kind of sharp character Faye Dunaway did in The Happening, but that doesn't make it a sexist film either - she was practically playing a stock character, almost HER version of a \"moll\"! But, I'm completely biased - it's among the first films I ever saw with her, and at the time I saw it, you couldn't turn around without seeing a poster of her (luckily). I think Robert Wagner was really just right as the neither thoroughly likable nor dis-likable leader of the group, as were Edward G. Robinson (naturally) and Vittoria De Sica. And Godfrey Cambridge, an actor who always managed to be funny.","I've got as much testosterone as the next bloke, and Raquel Welch at her finest is certainly worth a look; but the fact is that a cardboard cut-out could act better, and an hour and half of Ms. W showing off her credentials does not a movie make.Considering the cast, it's surprising that it's as bad as it is. I've never been a big fan of Wagner, and his tough guy Harry is about as convincing as a 9-dollar bill. Godfrey Cambridge and Vittorio de Sica, both of whom I usually enjoy, seem to be sleeping through their lines; and as for Edward G...well, I can only assume he was there for the paycheck.This film is a mess: from non-existent plot, through stop-start action and unfunny script to puerile slapstick and annoying 60's 'caper' music. If it weren't for Miss Welch, I'd have given it a 0.That said, she is a treat to the eyes - even better than her delicious cameo in 'Bedazzled' - and for that reason alone I gave it a 3.","I caught this flick on the trail end of a tape I had used to capture a movie I truly wanted to wanted to see again. When I saw Raquel Welch's name in the opening credits, I decided to watch it. It was actually mildly entertaining, and took me back \"in the wayback machine\" to the farcical movies that Hollywood churned out during the sixties, much in the same genre as the current Austin Powers stuff. Oh the acting was not superb, nor was the plot, but it was worth watching. There was some delightful scenery, although Ms. Welch provided the most pleasant of such. Tape it if you get the chance and watch it when you have absolutely nothing else to do. It is not a snoozer, but it won't have you rolling in the aisles wanting more, either.","This movie is a fun and good enough little movie, that has a weak plot and some poor acting but amuses nevertheless.This is a pretty weak little comedy that never manages to become really funny. The characters were fun in their potential but somehow it doesn't work out on screen. The movie has perhaps too many characters on which it focuses far too little. It makes the characters as well as the story feel pretty empty and distant. Still thank goodness there is Raquel Welch, who still puts some life and spirit into the movie. Even though her character really isn't that significant it still spices up things. And watching her dance in a bikini is also of course never a bad thing.The story is too simple and predictable from start till finish, although the premise itself is certainly amusing. Having a bunch of amateur criminals planning a major heist sounds like pretty good comical material but yet the movie in the end does very little with its fine potential and premise. The movie falls flat as a fun comedy but thanks to its characters, which are obviously not to take very serious and a couple of good sequences, the movie still remains an amusing one that might not entertaining constantly but also certainly does not bore.The acting is really below par, even though the movie has some 'big' names in it. Robert Wagner is terrible as the tough talking guy and wannabe leader of the group. The movie also feature Edward G. Robinson, who was quite a big name in the business in the '40's. He's good enough in his role but his role is too restrained and limited to make a big impression.Sort of only worth watching when you really have nothing else to do- or watch.6/10http://bobafett1138.blogspot.com/","TITLE: THE BIGGEST BUNDLE OF THEM ALL was release in theaters in the United States on July 17 1968. The Biggest Bundle of Them All is a 1968 American crime film set in Napoli, Italy. The story is about a mobster and a novice gang of crooks who team up to steal $5 million worth of platinum ingots from a train. The film stars Robert Wagner and Raquel Welch and was directed by Ken Annakin.SUMMARY: The movie opens with a funeral where Cesare Celli is morning one of his oldest and dearest friends. As Celli is walking away from the funeral, he starts talking about the old days. Ethers Harry who along with four other guys has a car waiting for Celli. Celli gets into the car with Harry and they tell Celli there taking him home. However, Celli realizes that there going the wrong way. Enters Julianna who is Harry's girlfriend. With them all in the car, Harry has them stop at a very usage house. After Harry gets Celli inside the house, he demands money from Celli. Harry has money problems including some bad habits and Julianna expensive taste. Harry tells Celli he wants 50 thousand dollars and he wants it in cash. When Celli tells him, he doesn't have the money Celli tells Harry to call the states. Harry calls the states only to have the person hang up on him. Therefore, Celli makes the phone call only to find out that the person he needs to talk to has passed out on his bed. So when that fails Celli gives harry a list of names to go visit so he can get his 50 thousand dollars. After Harry makes his visit he finds out that Celli his a worthless bum and nobody had good things to say about him and no one wanted to help Celli. Therefore, Celli decides to turn Harry and his friends into his own mob. Harry and Celli agree that whatever job they do that the split will be 60-40. Cell tells the gang not to bother him until after breakfast the next Moring. Harry is very confident that him and Celli can work together. The next day Celli takes his new gang to see an old friend QUESTIONS: What kind of background did the Professor have? Who was the Professor? What did Celli and the Professor have in mind? How did Celli get to know the Professor? What did the Professor pass around? What problem did Harry have with the Professor plan? Who was riding in the boat? Who did Celli walk in on? Who was shooting at Celli and why? MY THOUGHTS: I thought this movie was boring for the simple fact that it was filmed in Italy. There was no action or drama in this movie the kind that kept your interest through the entire movie. That was the bad part of this movie. Now the reason why to watch this movie. Raquel Welch! She was gorgeous in this movie There were four particular scenes in this movie involving Raquel that you can't miss. The first was when she was dancing around the patio in here pink pantsuit. The second scene is when she comes running out of the ocean in her orange bikini. The third scene is when she dancing on the beach in her orange bikini and the fourth is when she shows up to Celli wearing a blue nightgown. Because of the lack of action and drama, I would give this movie 5 weasel stars. However, because of Raquel Welch and her talent and her gorgeous body I give this movie 10 weasel stars. You can get this movie at Amazon.com","Following his role in the fine caper SEVEN THIEVES (1960) – which I’ve watched several years back – Edward G. Robinson seemed to be stuck playing elderly criminal mastermind types (apart from the odd juicy role as in THE CINCINNATI KID [1965]). I’d previously watched the pretty good “Euro-Cult” effort GRAND SLAM (1967) and, apart from this, I’ve yet two more similar titles from Italy to check – one of which was directed by future goremeister Lucio Fulci! Anyway, this is the kind of international production – featuring American and Italian actors and a British director – which was prevalent during the 1960s; it’s harmless and easy-going in itself but hardly memorable and definitely overlong – especially since to procure finance for the heavy-duty equipment required for the heist (such as an army tank and an airplane!), the gang involved have to pull a variety of minor thefts first.The gang, of course, is an incompetent lot led by an American (Robert Wagner) and his bimbo girlfriend (Raquel Welch) – the others are a ‘pacifist’ black man, a perennially hungry Italian and a diminutive Englishman. They try to induce an ex-gangster (Vittorio De Sica) to turn over his fortune to them, except he’s destitute…but, under the auspices of “Professor” Robinson, he proposes instead a caper of 5 million dollars’ worth of platinum! Needless to say, the gang members don’t trust one another (Wagner instructs Welch to seduce De Sica so as to get the name of their fence in Morocco – where they are to retreat after the robbery), or else bungle the job (commissioned to hold up a restaurant, the Italian can’t resist sitting at table and order a multi-course meal for himself!). Amusingly, in the face of similar failures, De Sica tries to show them how they used to do it in the old days – however, ostensibly holding up a petrol station, it transpires that the owner is a nephew of his and he merely asked to borrow some cash! The central heist sequence is typically elaborate: while the gang, including Welch, ‘take’ the train transporting the platinum, Wagner kidnaps pilot Victor Spinetti and his airplane. When the job is done, he fully intends to double-cross De Sica – but neither his partners nor Welch herself are willing to go along with this, so he’s forced to relent. Coming from the time when crime didn’t pay, the gang contrives to lose all their stash in mid-air when the plane’s bomb-bay doors are accidentally opened…","Spoilers herein.Someone already stole whatever might have been worth something in this film. The best comment is in the film itself, when the tired lifeless gangster directs the operation by shouting `one, two, three, four' and the hapless crew laconically walks through their paces. That's just what we have here with this brainless cast.Hollywood should know by now that if they want a sexy girl, they have to get someone who has enough talent to create the effect.The director is precisely like the capo: without control or effect. The film is precisely like the airplane: it lost whatever it could have brought to us."],"review-user":["moonspinner55","Sycotron","Skragg","winstonfg","taruss","Boba_Fett1138","garyldibert","Bunuel1976","tedg"],"review-date":["2 October 2001","14 February 1999","30 June 2007","27 September 2008","16 August 2001","22 September 2006","1 January 2014","10 July 2008","25 June 2002"],"review-rating":["4","5","8","3","7","6","10","4"],"review-title":[" Yet another Great Train Robbery...but Welch in a bikini steals the show\n"," Anything from the 1960's with Raquel Welch is worth watching.\n"," Pretty entertaining \"heist\" comedy\n"," Even Raquel can't save this one\n"," a classic sixties farce\n"," Watching Raquel Welch in a bikini is never a punishment.\n"," Raquel Welch is Gorgeous\n"," The Biggest Bundle Of Them All (Ken Annakin, 1968) **\n"," Already Hit -- the Plane's Empty\n"]}