{"review-url":["http://www.imdb.com/title/tt0070572/reviews"],"review-text":["The Psychopath (1973) A trip down memory lane. I saw this film many years ago on a old black and white t.v. A children's' show host Mr. Rabbey avenges the brutal abuse that parents inflict upon his kiddie fans. Mr. Rabbey (who looks like he's always on the verge of losing it) finally cracks and decides to go on a hunting trip. Watch out bad parents cause Mr. Rabbey is on the prowl! What happens next is priceless. However, trying to find this movie will be quite a chore.What makes this film notable was the fact that Joe \"Maniac\" Spinell made a short promo reel for a film based upon this one. In his unfinished film, he plays Mr. Robbie, a t.v. clown(who looks like a pudgy out of shape Edward James Olmos) who avenges his young fans child abuse by going after their parents. Sadly, Mr. Spinell could never find the funds to complete the project. The film was going to be titled Maniac II: \"Mister Robbie\". Rabbey or Robbie the similarities are all too close for comfort. Pretty violent for a P.G. movie.Recommended.","His name is Mr.Rabbey and he is the host of puppet show.He loves children and murders their parents.But he kills only parents,who are abusing their children.Mr.Rabbey rides a bike and even talks in a childish falsetto.\"The Psychopath\" is a bizarre horror film that inspired Buddy Giovinazzo's \"Maniac 2\".The main performance of Tom Basham is gloriously creepy and convincing.The film lacks gore,but the killings are pretty vicious and mean-spirited.The abusive parents are loathsome and the final twist is supremely bizarre.If you are into 70's horror you can't miss \"The Psychopath\".A different kind of serial killer cinema.7 abusive parents out of 10.","A child-like puppeteer, for a public access children's show, goes over the deep end when he discovers kids he entertains at a hospital were victims of horrible abuse. This movie has some of the worst indescribably monstrous parents you could ever come across. Not an exploitation film as much as an afterschool special on the dangers of child abuse. Seemingly harmless, Mr. Rabby takes matters into his own hands when it seems the police are neutered by lack of evidence to convict loathsome parents of their terrible abuse towards their children. The children are emotionless and zombie-like(..due to the amount of abuse inflicted upon them), the parents loud, inconceivably harsh, contemptible, and belligerent. The mothers, in particular, are so obscene, you'll root for their execution. They are essentially miserable people taking out their frustrations on the kids. Our detectives are a tired lot, frustrated with the whole judicial process, how police procedure is often unable to prosecute those who beat their kids into submission. While the crimes themselves are heinous, the film doesn't explicitly elaborate the grisly activity on screen. I'd say the reason to see this is for Tom Basham's performance as the unbalanced man-child who slips into psychosis. There's quite a weird dinner table sequence between Basham's Mr. Rabbey and his guardian shortly after he murdered the parents responsible for the death of their child, regarding how he lives in a fantasy and how what he had just done has left an indelible mark(..notice the changes in behavior, pretty impressive work, going from innocent to creepy). Peter Renaday is Lt. Hayes, the detective in charge of the homicides cases, expressing on his face the strain that is taking it's toll on him. There's an early performance by John Ashton as detective Matthews, always raising the ire of Hayes because of his inability to follow directions, not to mention how opinionated he is regarding the parents abusing their kids. Awkward laid-back bluesy score that seems improper for a film such as this. Controversial conclusion establishing that even kids can only tolerate so much. A bit too slow moving for my tastes, but there's an effective use, I felt, of Basham's eyes before he takes care of business, waiting patiently as he prepares to strike.","Tom Basham's over the top performance as a looney children's television show host is frighteningly realistic. When he discovers that some of his viewers are being abused by their parents he flips and takes matters into his own hands. Death by baseball bat, lawnmower, and strangulation are just a few of the things he has in store for the abusive parents. This seldom seen slasher is also highlighted by Basham's odd relationship with his puppets, as well as his blanket which he calls Mr.Rabbey. Psychopath also features weird music and endless close-ups of Basham's wild eyes. A must for fans of weird horror.","This is a gritty, low-budget oddity from the early 1970's that actually tried half-heartedly to tackle a serious social issue, child abuse, with less-than-sucessful results. While the abusive parents who are offed by the titular protagonist (the deranged host of a kiddie show) are definitely deserving, their gory deaths are so ridiculously over-the-top that it's hard to take the whole thing very seriously. There's nothing wrong with a horror movie having a serious social message,on one hand,  or entertaining the audience with absurd, cartoon-style violence,on the other, but it just doesn't work to do both things in the same movie. Still this movie is worth seeing if you can find it. One of the only existing video prints has burned-in Spanish subtitles that will have you in stiches if you're at all bilingual--they're often NOT EVEN CLOSE to the actual English dialogue.","Pretty amazing movie directed by a guy who primarily directed gay porn (and produced by Jackson Bostwick...TV's Shazam (?!?))It was released in the South under the title \"An Eye for An Eye\" with the gimmick that you voted whether the little girl at the end was guilty or innocent (by dropping a ballot in a box on the way out of the theater, so obviously it was a pretty lame gimmick).My father called it \"utter trash\" (I begged him to take me to see it) and I credit it for nurturing (creating?) my love of exploitation movies. Someone should do a nice DVD release on this film.","This was a weird movie on obviously a low budget. It features a children's show host who takes matters into his own hands when he realizes some kids are being abused by their parents-by killing the parents. It was kind of lame, and the only \"great\" parts were the close-ups of the title character's wild eyes. All in all, just another slasher movie.** out of ****","Weird movie, child abuse and revenge by a nerd. A television clown has knowledge of parents abusing their children. Himself not having a mother and being not accepted takes it out for the children. He starts killing the parents. The storyline is okay, but the subject is child abuse, but done in a special way, not done today. Like the child being shot in Assault on Precinct 13 this is an item that today wouldn't be done in a movie. The movie has a strange feeling. The main actor also has some queer feelings. Unfindable also this one, but you should see this movie, due the fact that there isn't any blood or gore in it. It will leave you with a strange feeling.","laughable flick is downright lame and badly made badly acted bad plot stupid premise and it is sleep inducing all the way i did not give a damn about this movie i wanted it to end just like that please avoid BOMB out of 5"],"review-user":["Captain_Couth","HumanoidOfFlesh","Scarecrow-88","Smokey-13","lazarillo","Brother George","mattkratz","trashgang","callanvass"],"review-date":["3 December 2003","17 July 2010","13 February 2010","14 February 1999","14 March 2004","23 May 2000","23 April 2002","25 October 2008","18 December 2003"],"review-rating":["8","7","4","5"],"review-title":[" Childhood film No. 2, Mr. Rabbey, the Psychopath.\n"," Mr. Rabbey's revenge.\n"," The Psychopath\n"," Bizarre and rare low-budgeter\n"," low-budget oddity from the 70's\n"," Krusty the Clown Out for Revenge\n"," weird\n"," an eye for a special subject\n"," laughable\n"]}