{"review-url":["http://www.imdb.com/title/tt0071358/reviews"],"review-text":["Martin Ritt seems to be a director who was always interested in social issues (as the son of immigrants, he had every incentive to be so, especially since he was blacklisted in the '50s). \"Conrack\" is based on Pat Conroy's novel \"The Water is Wide\", about his own experience in 1969 teaching a school of impoverished black children about the outside world, much to the chagrin of the right-wing superintendent (Hume Cronyn). What added to the movie's strength was the cultural and historical context: Conroy (Jon Voight) frustratedly tells another teacher how many of the children don't know about Paul Newman, Sidney Poitier, the Vietnam War, or even where Vietnam is. He proceeds to enlighten them about all these factors.Somewhere, I read a complaint that when Conroy played music for the children, he only played white music. The truth is, you can't blame the movie for that; it was based on Conroy's real experience. Either way, the movie's a real gem.","Pat Conroy is one of our most elegant writers, and his first book, a memoir of his adventure teaching a group of heart-breakingly neglected and ignorant black children on an island off the coast of South Carolina should be required upper-class reading for kids who have To Kill a Mockingbird under their belts. Now, the movie: If you read the book, the movie will seem so Hollywoodized that you'll wonder who \"cuted-up\" Conrack (the kids' pronunciation for Conroy). Jon Voight is earnest and sweaty, and pulls off Conroy's youthful self-righteousness to a T, but Hume Cronyn is miscast as the evil, bigoted superintendent. The kids are strangely ignored here, although they are complex and fascinating in their own right in the book. Voight's teaching is the best part of this film, but Conroy's explanation to the white citizenry of why he should be retained--after annoying the county school administration for the last time--is destroyed by the ridiculous scene with Voight driving the streets of Buford, using a P.A. system on his hippiemobile to bludgeon bewildered suburbanites.Hell, watch it anyway.","I first saw this film when I was in the 8th grade and I remember that it had a profound affect on me then.  I saw in again about a year ago (I am now 29) and it still moved me in similar ways.  This is a great movie that personifies the struggle of \"principle vs. pragmistism\".  Voight's character is the idealist teacher that won't give in to any psuedo-racist leanings of the Superintendent, Mr. Skeffington.  That story also personifies the struggle of how older people often resist change, and more specifically, cultural change.  Often at the expense of children.  When these battles finally come to a boil, Pat Conroy loses and pragmatism reigns triumphant. Or does it?  The children that he has to leave are better off for knowing him, more exposed to the \"real\" world and to classical music.  The other teacher at the school gained respect for him and he learned much about himself.  A great film with a heart-breaking ending.  I recomend that anyone who enjoyed the film to read the book, \"The Water is Wide\", by Pat Conroy. It will stay with you!","I have also watched \"Conrack\" several times in the past few years and I believe it is the best movie out there about actual classroom teaching.  We have \"To Sir, With Love\", \"Blackboard Jungle\" and \"Mr Holland's Opus\", but this film spends most of its time in class with the students. \nWe get to see Conroy struggle with the system, the absence of facilities and resources as well as the initial lack of desire among his charges.  How he brings his \"babies\" out of their shells and creates a learning environment is simply magical.  The awkwardness of those first lessons is all too real. This movie is pure teaching!Another realistic education film that comes to mind is \"Stand and Deliver.\"Check out first few minutes of \"Conrack\" and you'll be hooked.  Watch for it on Fox Movie Channel as they often show the letterbox version.","This film launched my theory about films based on books: Instead of following the cliche \"You've read the book; now see the film,\" if you are looking for a good book to read, try one upon which a movie you like was based, because it'll be 10 times better.I saw this film on its initial release at the National Theater in downtown Eugene and liked it so much that I stayed to see it again. It's a perfect merger of the inspiring talents of one of my favorite actors, Jon Voight, with what became my favorite book, \"The Water Is Wide,\" by Pat Conroy.I can think of no better movie about the nobility of teaching and the ironic challenges of life. Two tiny caveats:(1) The video suffers severely from pan-and-scan and deserves a letterbox version. (2) The title should be restored to the name of the book, a reference to one of the most touching, enigmatic songs ever written","This film had me spellbound this evening. Thanks to Fox Movie Classics for showing it uninterrupted. John Voight, this cast of little known black actresses and most of all, the children, made this a worthy way to spend a Sunday evening. How wonderful to see the early work of this seasoned actor, as well as Paul Winfield's excellent portrayal of Mad Billy. I can't see why anyone would say that Hume Cronyn is miscast in the role as superintendent. Who would they have chosen? The shrill character actor, Charles Lane? Although his career is laudable, an actor such as Lane would have cheapened the role. Cronyn was an excellent choice for the part. I will count this film as a true treasure to hold in memory.","all i can say is that each time i see CONRACK, dir. Martin Ritt, DP. John Alonzo, i feel an utmost sense of inspiration and enlightment in what the power of cinema is possible in such a simple film.the motion picture Conrack is set in 1969. It is based on a true story. It is a story about a white man (Jon Voight) who teaches a group of young black children how incredible the world is outside of their little South Carolina island.The story places the job of a teacher as noble cause in changing children's lives.I highly recommend it.","In my last year of University, a friend said she was going to see a film showing on campus. Since that day, and, indeed, until my retirement from Teaching, I showed this film to ALL of my classes under the pretext that this film would give the viewer a closer contact with the Reality of Teaching AND creation of Curriculium. Notwithstanding the merit of the value of fighting for one's beliefs, as Pat Conway did, this man gave from his Heart to these children of Yamacraw Island. I believe that this is a vital portrait of Humanness to be shown people, whether 14 or 94.\"... may the River be good to you in the Crossing ...\"","Pat Conroy's autobiographical book \"The Water Is Wide\" proves to be something of a Southern \"Up The Down Staircase\", yet despite the teacher-going-against-the-odds formula, \"Conrack\" really does move the audience with each little breakthrough and creative flash. These students (uneducated black kids on an island off South Carolina) are actually shown learning, and their collective wide-eyed innocence is remarkably sweet. The one actual actress in the bunch (Tina Andrews, an amazing performer) plays the \"tough nut\" Conrack has to crack, and once she falls under his charms, it all seems a breeze. But the story is not ready-made for a happy ending, and I wasn't prepared for the quiet simplicity of the finale. It's beautifully done. The script veers off course every now and then, but director Martin Ritt is very smart to always fall back on Jon Voight's solid presence. Scenes such as the one where he drives around in his van venting his frustrations over a loudspeaker don't add up to much, but the whole film is filled with episodes which spark emotion, and the actual ending is their payoff. **1/2 out of ****","I saw this movie for the first time a little over a year ago.  I've seen it 4 more times since.  I had never heard of it before and I consider myself knowledgeable of classic cinema.  A true, polished, diamond in the rough.This gem of a movie revolves around Jon Voight (lead character \"Conrack\") as a young schoolteacher assigned to Yamacraw Island to teach the islands' children, all in one school.  At first, the students reveal they know very little of the world beyond their island home.  The heart of the movie is Conrack finding inspiration to awaken their young minds to the world around them.  The students quickly reward their teacher with an eagerness to learn and a remarkable ability to grasp concepts that, only a short time before, had been foreign to them.  Conrack uses unconventional and clever teaching techniques that happen to be, oh a little fun!  God forbid.  Learning AND fun?  Together?  Can't be, or so says the ones in charge.  To avoid a spoiler, I shall just say that Conrack finds resistance with the boss man....and the ending is truly bittersweet.I am a 35 year old white male with some teaching experience, so I should identify with the lead character, Pat Conroy (aka, Conrack, Mr. Petroy). But I don't, I identify with the black kids.  As a kid, I was bussed to the school on the other side of town from the 4th to the 6th grade, circa 1979. These kids in the movie remind me of my classmates then.  Luckily, in 4th grade as a 8 or 9 year old, one doesn't understand racism.  I just remember we were all being kids, playing 4-square, kickball, hide-and-seek, and running relays.This movie is very moving.  There are delightful and poignant moments from beginning to end, non-stop.  I found myself many times with tears in my eyes, then suddenly laughing out loud.  It's a funny movie.\"Git away from that winda!!\".... \"Sir, if you're prepared to accept crap, I should tell you that rabbit just did it in your lap.\"..... \"So, you the white schoolteacher, Mr. Conrack.  My grands LOVE Mr. Conrack. You a good looking teacher, you a good looking white man.\"..... \"wind 15 mph from the east.  Small boat warning.  Small boats beware. Big boats OK, don't gotta worry 'bout nothing.\".... \"not a fry cook, but Eleanor Roosevelt, not a share-cropper, but (something Latin)...that's Latin..hey wait!\".... \"Conrack sing like a frog....I sing good, whatcha talkin' 'bout?!\".It still mystifies me that I still hear nothing about this movie or that it has very little reputation or following.  I intend to seek out more reviews, comments, background, and \"making of\" tidbits, if they are out there. What amazes me is the acting given from the untrained kids.  One of the kids, Mary, I understand was an actress, and you can tell.  However, the other kids have plenty of lines and genuine reactions.  I wonder how they did it! I'm guessing that Conrack and Mary had precise dialogue to work with while some of the scenes unfold naturally or ad-libbed.Conrack is a special movie.  In my opinion, it is one of the very few movies that are so good AND so unknown.  Others in that category are King Rat ('65), Dark Passage ('47 with Bogie and Bacall), Gods Must Be Crazy ('80), and Bad Day at Black Rock ('55).  I recommend them all.  But first, take a seat in the class of Mr. Conrack.","I not only consider this to be the best film that Jon Voight (Midnight Cowboy, Coming Home) has ever done, but a real tribute to teachers.Despite incredible odds, Pat Conroy (Voight) managed to reach a group of students and bring them from nowhere to a basic literacy and awareness of the world. His methods made be criticized by bureaucratic dinosaurs like Mr. Skeffington (Hume Cronyn), but teachers like Conroy will always be winners. Voight really showed that he had a love for teaching and that it was a natural high for him. He didn't overplay the role, and I found him to be totally believable. Voight is Conrack. Besides a love of teaching, we also see another important point in this film. No matter how good you are at your job, if you rock the boat, the bureaucrats will get you.","Pat Conroy must be an interesting guy.  It's easy to be progressive in, say, Milwaukee.  (In fact, you had BETTER be.)  But he evidently grew up in the South, military family, attended the Citadel, and then finally found his head different from most of the others in his community.  Social friction in the South is nothing to mess with.  No, sir.  He's writing good novels and letters to the editor.  I admire him tremendously.  The movie reminds me of a lesson in an introductory philosophy class, about the fallacy of arguing by analogy.  Time is like a river, you see, and you can travel back in time because you can paddle upstream in a river.  Conrack gives us a little trip into the past, when things were even worse than they are now.  The African-American kids he's teaching don't know what country they live in, or the name of the ocean lapping at the shores of their little island. (Perhaps now overgrown with expensive condos.)  He paints himself as an inspiring teacher.  He can't help it.  He was callow, and anyway autobiographies don't have much choice -- they're either hagiographic or honest, and in the second case the author always comes out looking like a Schmuck.  Anyhow, in the end he admits failure, though through no fault of his own.  John Voight, known for his involvement in sociopolitical issues, is the perfect choice for Conroy's surrogate, and Martin Ritt perhaps the best possible director, given his having lived in the South and coped with it, though his hand slips from time to time and we get black kids answering Conrack's questions in plainsong.  The musical score sucks, so when the kids are out on a Halloween spree we have music that belongs in Robin Hood.  The photography is good. The film hit a nerve.  I was subbing as a teacher in elementary school in the South at one point.  My wife at the time was a professor at UNC, Wilmington, and told me matter of factly how she was having lunch with her colleagues and some guy's daughter met him in the cafeteria and told him so enthusiastically about the new substitute teacher they had that day, and it was only after several minutes of conversation that she realized the girl was talking about me.  I can't remember many moments in my life when I felt more pleased.  Nothing is as exalting as seeing somebody's face light up when they learn something new and extraordinary.  I've seen it in kindergarten kids and in Marines at Camp Lejeune, people wincing with pleasure at the dawning of a new realization. As Mel Brooks might say, \"It's good to be da teacher.\"  Conrack gets that idea across most effectively.","Superb story of a dedicated young teacher who sets out teaching minority children in an area off South Carolina.Jon Voight is just tremendous as the headstrong, dedicated, idealistic teacher who faces this challenge despite a principal, who believes in stern discipline and has little regard for modern educational techniques as well as a crusty old school superintendent, played with relish by the late Hume Cronyn. Madge Sinclair is the principal who loves her babies.As I'm a retired teacher, I could in some ways relate to this excellent film. The ignorance shown here as well as the lack of cooperation with officials is also quite apparent in urban areas.Voight realizes that these children need far more than the traditional teachings of a classroom. He has them go out and experience life by themselves by learning outdoors.The end is a definite downer but so true to life.Amazing that such backward students had a zest for learning and were well disciplined. I guess that answers my question. The behavior was there and they were motivated to succeed despite their environment.The ending will just tug at your heart. It was memorable and so well poignant.","Not a lot of people have seen this one. It's like a lot of other films about teachers in an uphill struggle against apathetic or difficult students. They all seem to be set in inner-city environments, but \"Conrack\" has a different approach - it takes you down south, out to an isolated island just off the coast of South Carolina. It helps that this is a true story (or as true as a film adapted from a book adapted from real life can be).Martin Ritt was a very good director, known mainly for \"Hud\", which he did about ten years prior. Jon Voight has never been more charismatic than this, he's like a shining beacon of inspiration throughout the film. You really believe that he believes every word he is saying, and that adds a ton of weight to his character. I really enjoyed Hume Cronyn here, he's somehow mischievous without being friendly, serious and a little bit mean. It's a great characterization.The passion in Voight's sparkling eyes seems to be more than what carries the film. It's a great story, and a fantastic reflection of Pat Conroy's writing. The story is powerful, convincing, and exceptionally inspiring.","I saw this film on TV in the UK some 25 years ago and it has resonated with me ever since. My interest has recently been rekindled by visiting Hilton Head - the next island over from \"Yamacraw\" (Daufuskie actually), and reading Pat Conroy's excellent \"The Water is Wide\". With the benefit of knowledge I have reappraised Conrack and consider it a masterpiece. Jon Voight captures the spirit of Conroy and the atmosphere of the film brings the book to life with some accuracy - a Hollywood rarity. Three things still strike me about this tale: 1. The issues of educating the poor and disenfranchised and being inclusive remain the same. 2. Education is about more than reading and writing. 3.. These kids were my peers, I was 6 in 1969 when Pat Conroy spent his year on Daufuskie.Why this has not made it on to DVD yet?","John Voight plays the title character in this movie based on author Pat Conroy's (Prince of Tides) autobiography.  A fine teacher film, it tells the story of a naive Pat Conroy, a young English teacher whose first assignment is in an elementary school on a rural island.  The only white man on the island, he must battle internal and external pressures as he attempts to instill education and values in children who for generations have been systematically denied such things.  A solid performance that really makes you think.","COMING on the heels of that 1970's \"Blackploitation\" Era, CONRACK (20th Century-Fox, 1974) offered audiences a low-key, sincere and everyday people sort of a drama. Offering a far different fair to its audience (which was far more general than those \"Gansta\" flicks); being a down to earth dose of realism that offered a lonely counterbalance to those shoot-'em-ups'.REPLACING lead characters that were bad-ass detectives, super-flies and megs/macks/pimps (Take your pick in terminology), was a lone, humble and meek teacher. The academian we speak of is the main character, Pat Conroy; who is the one and only lone teacher hired to take on the responsibility of a sort of old time one room school house on an island off the coast of South Carolina.\"CONRACK\" (Jon Voight), the name that the youngsters dub him finds conditions in the school terribly backward. In addition to the physical properties of this \"Little Red Schoolhouse\", any systematic and progressively graduated educational system was totally absent.OH yeah, by the way, did we mention that further complications to any successful educational venture were manifested in two incontrovertible facts. Those were that Pat Conroy was both an outsider and he was white; with almost the entire population of this off-shore cay was black and very poor.PERPETUATING these unacceptable and deplorable conditions were the agents of the local board of education; being the school's Principal, Mrs. Scott (Madge Sinclair) and the Superintendent, Mr. Skeffington (Mr. Hume Cronyn). Between the two, we are made to understand that the teacher, being the low man on the totem pole, is powerless in most respects to affect any sort of meaningful, long-lasting improvements.BUT don't you tell a 'Young Turk', such as Pat Conroy, that he can't. (Can't anything, that is). \"Conrack\" spends a year of unorthodox classroom performances and is making real progress; but alas, the strong-headed teacher won't give in and recognize the authority of his superiors. While he is, by law and unbeknownst to him, serving at thee super's pleasure; he disobeys Mr. Skeffington's specific order and prohibition to take his class kids to the mainland of South Carolina on Halloween for some Trick-or-Treating; even going to the brazen act of stopping with them at the Skeffington residence.NEXT we see a Western Union Telegram messenger happily singing as he crosses from the Carolina mainland to the island; where he delivers the telegram to Conroy that bore the news of his dismissal from his position with that school and district.NOT BEING one to take his being fired lying down, Pat files suit against Mr. Skeffington, Principal Mrs. Scott and the Board of Education protesting his dismissal as being unlawful. Impartially reviewing both the \"offense\" and the law, the Judge asks Skeffington if there are any lesser punishments that could be substituted for Conroy's being separated from the school system; to which he receives a negative response. Fittingly, the Judge dismisses the suit with his gavel pounding down while saying, \"It's very simple!\" THE story is brought to a bittersweet conclusion as the 'Conrack'students see him off to the mainland bound launch, while a phonograph record provides us with BEETHOVEN'S 5th SYMPHONY; which had played an important part in the Conroy educational agenda, as well as our story.IN THE HUMBLE opinion of this writer, the story (which we believe was at least semi-autobiographical, even giving the main character the name of its author), was much more than a tale of a localized happening. To both me pal Schultz and meself; this is a sort of depiction of a microcosm that represents the overall deplorable conditions that permeate the Government Schools throughout the entire nation. (Just an opinion) AS FOR THIS film, it was just one of many movies portraying the stores of common folk; leading their lives of \"quiet desperation\" in the great hinterlands of the country, which lie outside the D.C. Beltway and the urban centers of enterprise and communications situated on either the Atlantic or Pacific Coasts.IN ITS OWN small way, this is a fine film, which would soon be joined in the film vaults of 20th Century-Fox by such great works as NORMA RAE and BREAKING AWAY. (both being from TCF in 1979).SEE it if you ain't yet. Recommended by both Schulz and his buddy.*NOTE: * Why, that's me, of course! POODLE SCHNITZ!!","Just watched Conrack for the first time. Although the last third of the movie leaves something to be desired, it is a very touching and heartwarming study of a man's evolution to overcome his youth and upbringing in a prejudiced south and a teacher's creativity in connecting with students despite different backgrounds and difficult circumstances. As an educator, seeing a teacher adapt to his students and prepare them for all of the challenges life has to offer, not just the lessons found in textbooks, is a valuable concept of which we all need to be reminded. The thread concerning the Vietnam war rings true even today. Well worth a look.","I not only consider this to be the best film that Jon Voight (Midnight Cowboy, Coming Home) has ever done, but a real tribute to teachers.Despite incredible odds, Pat Conroy (Voight) managed to reach a group of students and bring them from nowhere to a basic literacy and awareness of the world. His methods made be criticized by bureaucratic dinosaurs like Mr. Skeffington (Hume Cronyn), but teachers like Conroy will always be winners.Voight really showed that he had a love for teaching and that it was a natural high for him. he didn't overplay the role, and I found him to be totally believable. Voight is Conrack.Besides a love of teaching, we also see another important point in this film. No matter how good you are at your job, if you rock the boat, the bureaucrats will get you.","This movie is a piece of the time in which it was made..... Realistic. Movies were not candy coated during the late 60s and early 70s. The producers did not try to create some happy ending that didn't exist. The lack of a happy ending would create agitation in the audience that, hopefully would spur them on to action. At least that's how it seemed at the time. In today's movie world this movie would probably not be done. There would, definitely, not be this ending, however realistic. The sad fact is that the movie depicted a situation which could not be improved upon without action from the improvement of the relationship between the white southern traditional thinking and the progressive movements of that time.","Our America is multi-cultural, with so many sub-cultures. This movie simply tells a story of a snapshot in time within one of these sub-cultures. It is basically an objective look at a group of forgotten people, living their lives oblivious to the rest of the world. Generally, a good movie. It entertained, provoked thought, and showed lives that would not be seen otherwise, right in our own back yard. Should be seen by all. Having lived in the U.S. all my life, I had no idea that there were citizens here that didn't know they were citizens. This movie helps illustrate the diversity of our country by showing this small part of a southern state. The obvious conclusion: If this is really for real, then what else is out there that we know nothing of?","I have very mixed feelings about this film.As a retired teacher and school administrator, I'm appalled at the scatter-shot \"curriculum\" that \"Conrack\" is teaching the children in the film. He seems like a very appealing teaching, and yet it's been my experience that some of the most appealing teachers actually teach the least to their students. I kept thinking ahead 5, 10, 20 years. How would his \"curriculum\" help those children? We'll never know. How nice it would be to somehow be able to follow some them into adulthood.On the other hand, there are performances here that are almost stunning, starting with Jon Voight. I first saw Voight in \"Midnight Cowboy\", a film I hated (although I can admire his performance). Then in \"Deliverance\", I film I rather enjoyed (and recently re-watched), and I thought his performance was quite good. I enjoyed him very much in \"The Odessa File\", \"Coming Home\", \"The Champ\", and \"Table For Five\". And then, for me, he sort of fell off my radar. But it was actually this film I most enjoyed for his performance. It just felt free and easy and, thinking back to my younger years as a teacher, I could identify with him as the character (if not his methods, which seemed to be well meaning). And, appropriately for the film, he had to be about the whitest-skinned actor in Hollywood; get some tan man! This was the first film in which I saw Madge Sinclair, here as the principal. Excellent performance.But most of all I remember the performance of Hume Cronyn as the school superintendent. With such a long and distinguished career, I know I must have seen Cronyn previously, but it was this film where I really noticed him. He was a favorite character actor of mine ever after. Here, though his character is unlikable, his performance shines.So I guess what I'm saying is that I'm not impressed how the film portrays teaching, but I'm impressed with the film as a story.","This film, which contrary to another reviewer's remarks, is set in South Carolina, not Louisiana, is an autobiographical account of Pat Conroy's youthful experience as a teacher of impoverished African American children on a barrier island.The same reviewer who erred in placing the movie in Louisiana also erred in stating that Conroy (aka Conrak and PatRoy) was the only white person on the island. In fact, in an opening scene we see that the merchant on the island is also white, a reference to the share-cropping, plantation store system in place off the coast of Beaufort, SC.The movie is only ostensibly about teaching, it is in fact about love and commitment and it aptly captures the interesting textures of Conroy's early novel, \"The River is Wide.\"Worthy.","I'm going to make this short and sweet. It's not surprising that you had no use for this film. This is a story about the power, beauty and possibilities inherent in a meaningful education. Based on your pathetically composed comments I can see that your own education has been woefully neglected... or worse... completely wasted. Your comments are those of a truly ignorant person. I would advise you to do something about this condition... but in your case I feel it's probably too late. My hope is that you yourself don't intend to go into the teaching profession ( especially in Film Studies) because you could only do damage. Oh... one last bit of advice. In the future, if you intend to write more opinion pieces, you should really proofread your work. It will make people take you more seriously.","Early morning channel surfing on TV can uncover little known works that really are worth seeing. I stumbled across this film and will try and find it to view the whole film. I was very impressed with Jon Voights work in this very difficuly topical film. The story was touching and is still very pertenant in 2001. We still need to break down these race barriers and join the human condition and climb out of our very little boxes.  Happy viewing"],"review-user":["lee_eisenberg","inspectors71","myklrichter","TSMChicago","ceals","sawznhamrs-1","lalinde77","michaelcovey","moonspinner55","chairnazi","lastliberal-853-253708","rmax304823","edwagreen","BERSERKERpoetry","kenbarkway","jayron32","redryan64","ferguson_mike","lastliberal","dbjanssen","joedoncook","vincentlynch-moonoi","thumper-19","tbran1960","dorisfbrad"],"review-date":["2 July 2005","25 March 2005","7 July 2000","31 July 2003","30 September 2001","30 October 2005","12 June 2005","30 November 2004","17 June 2001","24 July 2003","28 April 2014","15 October 2001","12 March 2009","26 March 2012","12 September 2006","14 April 1999","16 March 2009","21 August 2008","2 April 2008","19 January 2007","5 March 2006","28 October 2014","27 May 1999","4 April 2007","15 August 2001"],"review-rating":["8","9","10","9","10","7","10","8","10","8","10","9","10","8","8","8","8","7","10"],"review-title":[" Martin Ritt and social issues\n"," Hooray for Hollywoodized!\n"," Jon Voight's BEST performance\n"," Pure teaching\n"," A tribute to nobility\n"," Never knew I needed this film\n"," A Great Movie Forgotten?\n"," Instrumental in my joining the Teaching profession\n"," Despite formula, quite moving\n"," As diamonds in the rough go, this one shines brightest.\n"," I felt much beauty in my time with them.\n"," Trip Up The River\n"," Concrack Truly In A Class By Itself ****\n"," the sound of death knocking\n"," Underrated Classic\n"," A teacher out of his element\n"," Tale of Youthful Energy, Enthusiasm and Innovation's being swatted like a fly by the Machinery of Bureaucracy! (So, what's new, Schultz?)\n"," Really good teacher film\n"," A real teacher\n"," Realistic\n"," Show this movie in civics class!\n"," Mixed feelings about this one\n"," Interesting textures\n"," Responding to \" One of the Worst...\"\n"," Thought provoking race film.\n"]}