{"review-url":["http://www.imdb.com/title/tt0044154/reviews"],"review-text":["This is one of those Tweety and Sylvester cartoons that made this legendary pair second only to Bugs Bunny in terms of Looney Tunes popularity.Besides having all of the stock situations for this duo (Sylvester feeding out of garbage cans, the \"I tawt I taw a putty tat\" line, etc.), Tweety's S.O.S also stars Granny, who is one of those types of supporting characters that these Warner Bros. classics had in abundance to enrich the color and flavor of them.  This time out the cat and bird are aboard an ocean liner and the gags that are extracted from this situation are creative and lively.What a day that was in cartoon history when Friz Freleng decided to pair his Sylvester with the departed Robert Clampett's little yellow bird.","Before I forget, let me say the artwork in here is outstanding. From garbage cans to the huge cruise ship, the drawings are beautifully done. If this wasn't animated, critics would be lauding the \"direction\" in here, because it's really good.To the story: Sylvester is picking through the garbage at the shipyards but the pickins' are slim. While brooding at the dock next to a big ship, in a porthole he spots Tweety in his cage. Tweety spots him, too, and you know his first comment - the same one he always makes when he spots the cat. Anyway, Sylvester runs over, opens the porthole and says, \"Hello, breakfast!\" Tweety slams the porthole window on his face and says, \"You bad old peeping tomcat!\" The cat falls into the water.The undaunted Sylvester quickly sneaks back aboard ship, tiptoes into Tweety's cabin, grabs him and is ready to leave when - wham! - there's \"Granny\" at the door with her umbrella. Sylvester takes a beating as the old lady protects her pet bird once again. But, \"flippety gibbet,\" says Granny, \"I've dropped my glasses. I can't see a thing without 'em. Heavens to Betsey, where are those cheaters.\"Now Sylvester has the upper hand....and the normal cat-trying-to-catch-bird shenanigans are on again, like Granny's glasses. Sylvester's most clever act was to take her glasses and paint a picture of Tweety on them, so when she woke up and put them on, she'd see the bird and think it was okay.Overall, a very entertaining animated short that was a lot of fun to watch. As you can tell by the quotes, I love the dialog in some of these old cartoons.","Tweety's SOS isn't what I consider Sylvester and Tweety's best, like Hyde and Go Tweet and Red Riding Hoodwinked but I still liked it. I agree the cartoon has moments that are somewhat hit-and-miss moments, I personally didn't care for the seasickness joke myself, but it has enough enjoyable moments I feel.The animation is pretty excellent particularly in the colours, while the music has just the right amount of quirkiness. The dialogue is funny and clever, Granny gets the best of them especially the lines about her glasses and the sight gags are good. Sylvester is fun to watch as always, like Wile E.Coyote he is a cunning sort of character whose traps constantly backfire, and Tweety and Granny are good as well, Tweety especially is more active than he usually is. And as always, Mel Blanc does a stellar job with the voice work. In conclusion, flawed but enjoyable. 8/10 Bethany Cox","Cast: \"Tweety\", \"Sylvester\", \"Granny\". Director: I. FRELENG. Story: Warren Foster. Animation: Arthur Davis, Manuel Perez, Ken Champin, Virgil Ross. Lay-outs: Hawley Pratt. Backgrounds: Paul Julian. Voice characterizations: Mel Blanc. Music director: Carl W. Stalling. Sound effects editor: Treg Brown. Color by Technicolor. Producer: Edward Selzer.Copyright 21 April 1952 (in notice: 1950) by The Vitaphone Corp. A Warner Bros. \"Merrie Melodies\" Cartoon. U.S. release: 22 September 1951. 7 minutes. COMMENT: One of our favorite canary versus cat encounters, this one starts off in a lively fashion with the dejected Sylvester (wonderful background here by Paul Julian) sitting dockside, brightening when \"breakfast\" bobs up and down in the ship beside him. The jokes build frantically to a really crazy climax when Sylvester drinks nitro in mistake for a seasick remedy. Indeed, all the sequences here are so diverting, every one of them has been used time and again in various Warner cartoon anthologies.","Wonderful Sylvester and Tweety short directed by Friz Freleng. This one's pretty much a textbook example of the series and would probably serve well as a great introduction to these characters for anyone who hasn't seen them before. The plot is simple - Sylvester is starving so he tries to get at Tweety on a cruise ship, only to be repeatedly (and painfully) thwarted by Granny. The animation is very nice with great colors. There are many fun gags and lines with the funniest bit for me being Sylvester's seasickness. Solid voice work from Mel Blanc and Bea Benaderet. Really a great cartoon all around. The ending is a hoot, too.","Directed by Friz Freleng, \"Tweety's S.O.S.\" is a wonderful Tweety/Sylvester/Granny cartoon. Granny and Tweety take a voyage on board an ocean liner, and Sylvester decides that he must stow away on the ship if he wants a delicious canary breakfast.Highlights from \"Tweety's S.O.S.\" include the following. Tweety helps to intensify Sylvester's seasickness by showing him a juicy piece of salt pork. In order to distract Granny into believing that Tweety is within her sight, Sylvester paints a rather crude picture of Tweety onto Granny's eyeglasses. Sylvester keeps opening and closing doors on the ship while chasing Tweety, and once he gets used to that, he opens the door of a furnace and rushes in; his reaction to getting seared is hilarious.In closing, there are a few musical snippets that I recognize in \"Tweety's S.O.S.\", thanks to the brilliance of composer/orchestrator Carl W. Stalling. \"A Cup of Coffee, a Sandwich, and You\" can be heard in the opening shot of Sylvester rummaging through some garbage cans for food. And \"Listen to the Mockingbird\" can be heard when Sylvester first traces Tweety toward Granny's stateroom before the ship sets sail.","In Tweety's S.O.S, Sylvester goes from picking garbage cans to being a stowaway on a cruise ship that happens to carry a certain canary bird-and Granny, his owner. Uh-Oh! Once again, Tweety and Granny provide many obstacles to the cat's attempts to get the bird. Sylvester also gets seasick quite a few times, too. And the second time the red-nosed feline goes to the place on the ship that has something that cures his ailments, Tweety replaces it with nitroglycerin. So now Sylvester can blow fire! I'll stop here and say this is another excellent cartoon directed by Friz Freling starring the popular cat-and-bird duo. Tweety's S.O.S is most highly recommended.","Tweety's SOS (1951) *** (out of 4) Sylvester is out looking for dinner when he spots Tweety on a ship. The rest of the cartoon as the cat trying to work his way around Granny so that he can eat the little bird. I'm sure I'm not alone but I find Tweety to be cute but incredibly annoying. I watch all of these shorts just hoping Sylvester will eat him even though I know it's not going to happen. The actual chase is what makes this worth viewing as it remains fun seeing the poor cat try and try again no matter how many times he fails. There are some pretty good jokes in this short with the best being the sea sickness stuff. Sylvester turning green leads to some great jokes including the one at the end.","Opening with some blatantly reused footage from 'Kit for Cat', 'Tweety's S.O.S' fails to live up to that classic cartoon. Instead, we get an example of Friz Freleng's Tweety and Sylvester series at its most generic. Unlike Chuck Jones's Road Runner series, which strived to introduce new jokes to the same setting, Freleng's series seemed happy enough to recycle jokes as long as the characters were in a different place. 'Tweety's S.O.S', then, basically amounts to \"this time let's put 'em on a boat\". It's not an entirely weak cartoon. There are a few good jokes, mostly involving Granny's glasses, but they are outweighed by gags you can see coming a mile off (the seasickness routine) and it all builds to another of those endings where someone else other than Tweety says \"I tawt I taw a putty tat\", a joke that worked well once but has diminishing returns. 'Tweety's S.O.S' will probably please children who enjoy virtually any cartoon but for big kids like me who are looking for more than the same tired gags it's definitely one to avoid.","People who say that some of what the Looney Tunes cartoons show is inappropriate for children have apparently forgotten something: they weren't originally intended for children. They were produced for the cinema, to be shown before feature films, and so they could show anything that they wanted. \"Tweety's S.O.S.\" has that bad puddy tat Sylvester finding Tweety aboard an ocean liner and boarding the ship to try and get him. But two things work against Sylvester: Granny is vehemently protecting the canary, and Sylvester easily gets seasick (we don't see him throwing up, but with his green face, they make it perfectly clear that he was doing just that!). And then of course, the seemingly cute Tweety has a bad-ass streak.It's just great to see how these cartoons weren't afraid to go all out; whatever they thought about showing, they showed. We need to understand that cartoons weren't always supposed to be cute entertainment for children. Really funny.","Sylvester is hanging around the dock trying to scavenge for food from the bins when he spots Tweety Pie in a cabin on a cruise ship.  Sylvester boards the ship to try and catch himself some breakfast but finds getting the bird isn't as easy as he hoped - especially with granny on the case.Most Tweety Pie cartoons leave me sort of unsure of why they were so big. Tweety himself is always a bit bland and Sylvester quite often just ends up outwitting himself and Tweety just observes at times.  Here however Tweety is actually pretty active in terms of moving and running around.  The action is all pretty funny and flows well with Tweety having some good actions and delivering gags as opposed to the usual observing.Sylvester is funny and he does give himself more trouble than he gets from Tweety.  Tweety does have a better presence here than he often does, but Granny is a little bit poorly animated but has a better presence as well.Overall this is a fun cartoon with gags that go beyond just purely physical laughs and has some witty little bits.  For once both Tweety and Sylvester are both good characters to the degree that even Granny has a bigger part than normal!","As I have said before, I am NOT a fan of Tweety. He's just so aggravating I wish Sylvester would just eat him and get it over with.In this cartoon Sly is homeless once again and is back to feeding out of garbage cans. He spots a cruise ship leaving port nearby and decides to hop aboard when he spys Tweety is one of the passengers. The ship provides an adequate stage for the following hijinks and Sly desperately tries to catch the annoying bird and avoid seasickness. If only for once he's succeed by chewing and swallowing, thus finishing of the irritating Canary forever. But, as cartoons starring Tweety go, this one is quite good, but it's ALL thanks to that brilliant cat.",". . . plots to take control of an ocean liner (which preceded today's jumbo jets as the primary means of Trans-Oceanic travel during the early 1900s). Baader-Meinhof had nothing on this Granny-Canary outfit. TWEETY'S S.O.S. documents how the seemingly innocuous pair exploit their guise of being ordinary to proliferate explosives shipboard until this liner's captain is incapacitated, allowing these pirate thugs to seize command of the vessel and all souls aboard as this animated short ends (with the purloined ship no doubt headed for the Canary Islands where the hostage passengers and crew will be sold into slavery, a fate worse than death for many). Fighting a one-feline battle, Sylvester cleverly infiltrates the liner as a stowaway. Battling the ill effects of salt pork, this Super Cat nonetheless initially is able to eat one of Granny's cloned Tweety flock (at the 3:39 mark) after deftly painting a likeness of the Evil Bird on a lens of the Witch's glasses. As always, another Tweety instantly takes the place of the one which went down Sylvester's hatch, and things go downhill from there. TWEETY'S S.O.S. is enough to make one ponder anew that age-old question: When the Titanic went down, which did it take more of--cats or canaries?","Sylvester the cat stowaway upon a ship that Tweety bird happens to be on with his owner Granny. Oh I don't even have enough words to convey how much I disdain both the Tweety and Granny characters. They simply are not funny to me and made this short quite the chore to sit through indeed. Sylvester is a great character on his own, but there's only so much he can do when confronted by the sheer awfulness of that accursed bid and senile old witch of a Granny. This animated short can be found on disc 4 of the Looney Tunes Golden Collection Volume 1 and features an optional commentary by Micheal Barrier.My Grade: D+","Funny, yes. A Freleng classic! To watch Sylvester turn green is always a treat, and it brings us back to the days when cartoon slapstick was brave and geared for the adult mind.Loved it!"],"review-user":["Rikichi","ccthemovieman-1","TheLittleSongbird","JohnHowardReid","utgard14","slymusic","tavm","Michael_Elliott","phantom_tollbooth","lee_eisenberg","bob the moo","CuriosityKilledShawn","oscaralbert","movieman_kev","nealklein"],"review-date":["8 February 2004","7 February 2007","4 August 2010","14 March 2018","6 September 2016","11 January 2008","9 January 2008","19 April 2009","18 August 2008","15 January 2007","25 December 2003","7 December 2004","12 November 2015","2 November 2005","25 October 2000"],"review-rating":["9","10","8","10","8","10","3","10","7","7","4","8"],"review-title":[" A Match Made in Cartoon Heaven\n"," Excellent Artwork and Fun Cartoon\n"," There may be some hit-and-miss moments, but I enjoyed Tweety's SOS\n"," Don;t miss this one!\n"," \"You bad ol' peepin' tom tat!\"\n"," \"Hello, breakfast.\"\n"," Tweety's S.O.S is another hilarious Tweety and Sylvester cartoon\n"," Nice Short\n"," Tweety and Sylvester at their most blandly repetitive\n"," Let's go sailing!\n"," Pretty funny short with a good Tweety\n"," Tweety MUST be eaten.\n"," In this episode of Sylvester, Super Cat, a terrorist gang . . .\n"," there's only so much Sylvester can do to keep this boat from sinking\n"," Want some sawt pawk, Mr. Puddytat?\n"]}