{"review-url":["http://www.imdb.com/title/tt0089489/reviews"],"review-text":["Did director Tobe Hooper, writers Dan O'Bannon (\"Alien\", \"Return of the Living Dead\") and Don Jakoby (\"Blue Thunder\"), in addition to some uncredited writers who presumably did rewrites of the original script, or any of the cast actually think they were making a good movie during the production of \"Lifeforce\"? The movie gets progressively wackier, more disturbingly bizarre, hilarious, over-the-top, and greater by the minute. When you think that the movie couldn't possibly become more demented, that it was already as nutty as anything could possibly be it outdoes itself. I really don't know if this was at any point supposed to be tongue-in-cheek, if anybody involved thought it was genuinely creepy or effective, or if they were just too distracted by Mathilda May's exquisite breasts and rear end to care, but the end result is quite simply one of the greatest films ever made.Here are some reasons why \"Lifeforce\" is perhaps humankind's greatest achievement to date (and probably impossible to surpass): Mathilda May is nude for the entirety of the film, and she is \"the most overwhelmingly feminine presence\" you will ever see. Yes, that is a quote from the film. Steve Railsback gives one of the most gloriously, hilariously over-the-top performances in the history of film.It is, to quote a fellow IMDb member, 'the greatest naked space vampire zombies from Halley's Comet running amok in London end-of-the-world movie ever made'. Yes, that is actually the plot. Frank Finlay, Peter Firth, and Patrick Stewart embarrass themselves.Special effects and design that are actually good, adding to the suggestion that someone somewhere actually took this thing seriously, which is quite a disturbing thought.Unbelievably stilted delivery of some of the finest dialogue known to man, examples of which include:\"She looks perfect. I've been in space six months and she looks perfect to me.\"\"\"Don't worry, a naked woman is not going to get out of this complex.\"\"Despite appearances this woman is a masochist, an extreme masochist.\"\"He too needs feeding.\"\"She's totally alien to this planet and our life form... and totally dangerous.\"\"I'm Colonel Cane.\" \"From the SAS?\"\"It was two hours ago that the guard was attacked. I wouldn't be at all surprised if we're seeing a pattern here.\"\"Colonel, take it from the beginning. Assume we know nothing... which is understating the matter.\"Colonel Cane looks at a shriveled corpse, then asks: \"and this was murder, you say? \"\"Lifeforce\" is not merely another 'so bad it's good' movie. It is not an example of a film made by individuals with ambition far beyond their reach. No, it is quite simply THE most audacious, spectacular, hilarious, absurd, insane, riotous, crazy, deliriously demented science fiction film of all time. I cannot fully articulate why it is deserving of being one spot ahead of Samuel Fuller's \"Pickup on South Street\" on my list of favorite films, but I do know that it is. \"Lifeforce\" elevates craziness to an art form. Quite possibly the most entertaining film known to man, and perhaps our greatest achievement as a species.","** and 1/2 stars out of **** Lifeforce is one of the strangest films I've ever seen, so ridiculous, yet at the time it's strangely compelling and never the least bit dull.  Whether it's due to the nonstop nudity, the large amount of violence and action, it all comes together to make an entertaining 2 hours of cinema.The spaceshuttle Churchill has been sent to investigate Halley's Comet when they detect something hiding inside the coma of the giant rock.  A small team, led by Colonel Carlsen (Steve Railsback), has been sent to search the area.  What they discover includes hundreds of frozen bat-like creatures and three nude and seemingly unconscious humanoid beings inside strange crystalline containers, two male and one female (Mathilda May).  They decide to take all three back with them, which results in a catastrophe.When London receives no response from the crew, another crew is sent to find out what's going on.  When they dock with the Churchill, they find the remains of the crew, all dessicated beyond recognition.  The humanoids are still in perfect condition, and they take them back to London.After various tests, the scientists still don't know what these beings really are.  Then, late one night, a security guard in the compound feels compelled to enter the room the female is being held.  He touches her shoulder, and she awakens, stands up, and smiles at him in a seductive and wicked manner.  She approaches him, and begins to kiss him, when it becomes clear that she's actually taking his lifeforce, sucking him of all of his energy (the effect is slightly cheesy).She escapes from the compound and begins to leave a trail behind.  Another man, Colonel Caine (Peter Firth), is brought in to track her down.  Then the men discover that there is a pattern to the lifeforce process.  The corpse of the security guard awakens in 2 hours, and takes the lifeforce of a doctor.  It seems in every 2 hours, this process is repeated by a victim. With the help of the Churchill's sole survivor, Carlsen, they attempt to track the girl down before it's too late.Lifeforce is pretty good late night entertainment.  It has all the elements one could look for in such a movie, loads of nudity, blood/gore, and plenty of special effects.  This is certainly better than a similarly plotted film, Species, thanks in large part to a more riveting finale.The performances range from decent to terrible.  Faring the worst is easily Steve Railsback, who overacts to no end.  Much better are Peter Firth, who comes through and convincingly, and the gorgeous Mathilda May (she's as beautiful as French actresses Sophie Marceau and Emmanuelle Seigner).  May does go through virtually the whole role without wearing clothing, and there were reports that it was hard on her while filming, so the fact that she is able to go through every scene without fidgeting and looking uncomfortable is impressive.  There are times when she can be quite creepy, being simply seductive.  Most of the film manages to work because of her.","The Cannon Group has always seemed like the movie studio equivalent of the engine that tried and tried to climb that mountain, but unlike it's children's book counterpart, never seemed to reach the top.\"Lifeforce\" is the exception.In fact as space-vampire-movies go, this is the best, which of course on the subject of space-vampires... isn't saying much. But \"Lifeforce\" really is a memorable ride.From the director of \"The Texas Chainsaw Massacre\" and \"Poltergeist\" comes this massive apocalyptic science-fiction and horror epic. It's \"2001\" and \"Dawn of the Dead\" all rolled into one juicy little egg-roll of a movie, spiced with the beautiful naked body of Mathilda May (if she's smart she would start mathildamay.com and sell signed \"Lifeforce\"-pictures, and make a fortune of perverts like me). It's scripted by none other than Dan O'Bannon (Alien, Return of the Living Dead, Total Recall) and the cast is great. Frank Finlay looks like Peter Cushing's second cousin just escaped from a Hammer Horror movie, and it's always nice to see Michael Gothard (God rest his soul) who played creepy Emile Locque in \"For Your Eyes Only\". Steve Railsback is good as always, and Peter Firth perfectly fits the part of the SAS-colonel who must save the day (he always reminds me of the 1980's 'Doctor Who' Colin Baker :)The 25 million dollar budget looks like 50 million dollars, the f/x are first-rate but best of all: a rousing score by Henry Mancini! His \"Lifeforce\"-theme should deservedly rank with the all-time great sci-fi-themes. It's almost hard to fathom that the composer of \"Breakfast at Tiffany's\" and \"The Pink Panther\"-movies, so known for his romantic music, should actually be able to produce such a bombastic score. It's like he kept it all in for 30 years and then suddenly decided to blow it all off on the soundtrack of this movie, and nobody needs to clean up after him - it's that brilliant!When history is to be counted, this is one of the movies the Cannon Group will be remembered for, together with \"Bloodsport\", \"52 Pick-Up\", \"Hanoi Hilton\" and \"Missing in Action\" (come on, Chuck ruled as Braddock). And it only took 60 or so movies to create five good ones :)","Holy mackerel! From the comments I've read so far,you would think Tobe Hooper and Cannon were trying to remake \"The Magnificent Ambersons\"or some other \"classic of the cinema\"!I personally believe they set out to provide an entertaining picture for public consumption,and as far as I'm concerned ,that's exactly what they accomplished.After wearing out my VHS copy,I had to buy the DVD,which is even better in WIDESCREEN....plus I can hit the ZOOM and see Mathilda May much better! Exciting story,great cast(Railsback always one of my faves,PLUS Firth,Stewart,Gothard,etc.).Someone commented about \"cheesy effects\"...are you kiddin'?The special effects in this picture are much better than the overdone computer junk you see nowadays.Of course,this is an 80's picture...no one has enough imagination to make a movie like this today!","Though it hardly compares to other sci-fi film giants like 2001: A SPACE ODYSSEY or CLOSE ENCOUNTERS OF THE THIRD KIND, LIFEFORCE does work as a totally berserk and bizarre melding of science fiction and horror elements. Somehow, despite dialogue that approaches the ridiculous and acting that does the same, it manages to work because of a few highly different elements.Loosely based on Colin Wilson's 1976 novel \"The Space Vampires\", this film from director Tobe Hooper (POLTERGEIST; THE TEXAS CHAINSAW MASSACRE) focuses on a joint US-British mission aboard the British space shuttle Churchill to study Halley's Comet.  Led by an American commander (Steve Railsback), they discover an alien spacecraft in the comet's coma.  And when they investigate the interior of the spacecraft, they find alien occupants that look like giant bats.  Later on, the Churchill reaches Earth's orbit, but no response is given from radio calls issued from the mission's home base, the Space Research Center in London.  Columbia is launched to rendezvous with Churchill, but they find the entire ship gutted by fire--all except for the alien beings encased in glass who, far from being untouched by the fire, look absolutely perfect.  The aliens are bought back to Earth...and that's where the incredible happens.These space vampires escape from the Space Research Center and, instead of draining their victims of blood via bite wounds, suck their victims' lifeforce totally out of them.  One of them is the Space Girl, a thoroughly nude vampiress played by Mathilda May.  Railsback, the only actual survivor from Churchill, is bought in by the SRC's chief (Frank Finlay) and a British special agent (Peter Firth) to track May, who is in telepathic contact with him.  Pretty soon, however, the vampires have turned London into a scene of pure holocaust; people are either being dessicated or turning into zombies, and the threat by NATO to sterilize the city with thermonuclear radiation looms large.  Railsback finally catches up with May, and sacrifices himself by impaling her with a large metal sabre.Undoubtedly disjointed, unquestionably uneven, but nevertheless worth watching, LIFEFORCE, despite the frequent incoherency of its script and its acting, benefits from some drop-dead excellent special effects work by John Dykstra (STAR WARS), some of the best ever seen.  The other working element, and a surprise one it is, is the incredible orchestral score by Henry Mancini, almost Wagnerian in the same way John Williams' score for STAR WARS was--and Mancini, like Williams before him, uses the London Symphony Orchestra, to boot!Largely forgotten these days, and a critical and box office disaster in 1985, LIFEFORCE, if for no other reason, should still be seen for anyone with a taste for the bizarre.  There had never been a film quite like it before, and there will certainly not be anything like it again.","Like several other reviewers here, I'm surprised to see many negative reviews on this film. Dan O'Bannon's previous effort was the groundbreaking 'Alien' of 1979. Because it and 'Star Wars' introduced the stylistic approach of 'Used' or 'Dirty Space' in art-direction for these kinds of features doesn't mean that this was the only way to produce them.\nRather than dismiss 'Lifeforce' out-of-hand as a sort of schlock and primitive exploitation feature, it's important to recognize that the film draws upon the 'esteemed' traditions of British horror and science-fiction - specifically Hammer and American International features like Quatermass (specifically 'Quatermass and the Pit', 1967), Doctor Who and 'The Day of the Triffids' (1963), if not the works of Gerry Anderson ('UFO', 'Space:1999' and 'Thunderbirds'). But none of these influences would be a surprise if other reviewers recognized writer O'Bannon's genre-scholarly appreciation for 'Queen of Blood'(1966) and 'It! The Terror from Beyond Space'(1958) - the immediate sources for 'Alien' (1979).Granted this film has some 'legacy' elements, but perhaps it's worth comparing this film to its more immediate peers - 1981's 'An American Werewolf in London' and 'The Company of Wolves' (1984) - other 80's films that share a 'looking-back' while they adapt those stories to the 80's zeitgeist. All three films drew on earlier incarnations of the same, but substantially sexed-up their themes (because they could), and, at the same time they recognized the tongue-in-cheek, humorous aspects of their projects.Neil Jordan's 'Wolves' played to many of the psychoanalytic memes floating around at the during the '80's, while 'American Werewolf' curdled its theme as a 'coming-of-age' film. It's called artistic license, and the adaptations of these three films are no less valid than the latter-day dramedy inherent in the 'Scream' franchise, 'I Know What You Did Last Summer' and 'Final Destination'. But these teen-targeted, films seem to be part of a box-office trend, whereas the 80's films like 'Lifeforce' belong a canon of British sci-fi - even if this one was written by an American.In many ways this film holds up much better than latter-day disaster and alien-invasion flicks ('Independence Day', 'Armageddon', 'Deep Impact') in that the 'solutions' don't reside in gun-battles, weaponized payloads and testosterone. At the opposite end of the pole, it is unfortunate that Steven Soderbergh and James Cameron didn't examine Tarkowski and Lem more closely before they remade 'Solaris'...The goal of this film was fun, not ponderousness or stupidity.7/10","Rating: *** out of ****I think Lifeforce makes a very strong case for being the best \"bad\" movie ever made. The film is, after all, ludicrously plotted, but that actually adds to the unique charms this movie has, which actually entertains for all the right reasons. Lifeforce is exciting, thrilling, suspenseful, and always a lot of fun, thanks to the intriguing story, the first-rate special effects, the competent action sequences, and of course, the gorgeous Mathilda May wandering around in the buff.A joint British/American crew aboard the shuttle Churchill are studying Halley's Comet when they discover a giant contraption hidden within the coma's comet. Knowing this will be their only chance to board this enigma, they suit up and enter this contraption. Inside, they discover thousands of frozen, giant bat-like creatures, and just as interesting, three humanoids (one female, the other two male) encased in crystal-like containers. They decide to take the humanoids and one bat back to the ship with them.Thirty days go by and London has lost complete contact with the crew. So another shuttle is sent, and they discover the dessicated remains of the Churchill crew, but all three humanoids are still intact. Bringing them back to London for examination, the female one awakens, displaying the ability to drain the lifeforce out of a human being, and escapes out of the compound. Enter Steve Railsback and Peter Firth, who star, respectively, as the sole survivor of the Churchill and an agent out to stop this space vampiress from taking over the planet.If you've read the plot summary above and find this story interesting, then Lifeforce is most certainly the film for you. The first hour is probably the most engrossing, plot-wise. When you discover that whoever the vampiress kills will also rise to drain someone else's lifeforce, that's when the stakes grow much higher, as an epidemic becomes a possibility.The first half of the film resembles Species quite a bit, since you've got a team that's searching for a nubile alien that's on the loose (though, without a doubt, Ms. May is so much hotter than Natasha Henstridge). This same part of the plot adds another interesting aspect that makes the team's job more difficult; the vampiress has the ability to enter another person's body. Thus, they're no longer searching for a young, dark-haired beauty. She could be in anyone, which further raises the stakes.The engrossing story-telling sort of gives away to loads of special effects and action, but I found it a good transition. The effects are often terrific and the action is really quite exciting, surprising considering that director Tobe Hooper is usually incompetent at creating thrills and suspense. Judging from the all-out chaos that occurs in the last half-hour (burning buildings, thousands of zombie-like creatures stumbling around searching for nourishment), I'd say the film had a pretty big budget to work with (I've heard figures as high as 28M, which would be higher than Aliens' 18M a year later).Acting's probably what you would expect, with Peter Firth delivering a pretty good performance as Agent Caine. I like the guy's straightforward, calm attitude toward the situation and how he handles it. Steve Railsback as his partner who's being seduced by the vampiress in his dreams is much less impressive, sweating and overacting to amusing extents, but never coming across as very convincing. Patrick Stewart of Star Trek fame is here, too, in a role that he's probably a bit embarrassed by these days.But the most impressive of the cast is none other than Mathilda May. Watching May stand around calmly as she seduces a victim is an interesting transition from titillation to all-out horror. She's actually frightening, and that's impressive for a nude woman. Speaking of nudity, most people must have noticed that's often the most mentioned aspect of the film. Indeed, Mathilda May is one of the most gorgeous women I've ever seen. It's really perfect casting when you think about it. There's something exotic and \"alien\" about her looks (maybe the fact she's a foreigner helps) that adds a brilliant touch, and her perfect body helps, too, of course. Because of that exotic, \"alien\" look, I can't see any other drop-dead gorgeous actress who could pull this off quite as well (and this includes superhotties like Chasey Lain, Carmella DeCesare, and Tracy Ryan).Henry Mancini's score is a pretty enjoyable listen, though hardly as good as so many have claimed it to be. Even at 116 minutes, Lifeforce actually feels rushed. Some material could have explored a little further, but that's not too big a complaint. This is one wildly entertaining film I highly recommend.","I first saw Lifeforce back in 1985. I thought it was a decent sci-fi/horror concept of alien vampires. I agree with many of the other reviewers who said the ideas or concept of the film was good. Other than that it was entertaining, not great, but entertaining. There are really two good reasons to see this movie. And they are Mathilda May's boobs. Hell, her whole naked body for that matter. Man is she hot. She has to be the best looking vampire/alien that has ever graced the screen. Like another reviewer said, she plays evil, seductive, vulnerable and serious very well and all while being naked. To say the least it couldn't have been easy for her to play the role naked throughout the whole film. Needless to say,I'm glad she did. I agree Railsback was miscast in this. Otherwise, the film is alright. If you need to see major boobage,then rent this and watch it with the guys.","The space shuttle Churchill is assigned to observe the Halley's Comet under the command of Col. Tom Carlsen (Steve Railsback). They see a strange form attached to the comet and Carlsen goes with a team to investigate. They find three humanoid life forms in caskets and they bring them to the Churchill. However, Earth loses contact with the shuttle and the Space Research Center sends another spacecraft to search the Churchill. They find the crew dead and the shuttle burnt and one rescue pod missing. They bring the humanoids to Earth and soon Dr. Hans Fallada (Frank Finlay) and his team discover that the Space Girl (Mathilda May) is a sort of vampire and drains the life force from people transforming them into zombies. When the authorities find that Col. Tom Carlsen has survived, they summon him to explain what happened in the Churchill. Carlsen tells an incredible story about the three aliens and he teams up with Col. Colin Caine (Peter Firth) trying to save mankind from the evil vampires from the space.\"Lifeforce\" is a great sci-fi movie, with a story that uses the storyline of Alien entwined with zombie apocalypse movies. The most curious is that the gorgeous and sexy actress Mathilda May works naked all the times. I had seen this movie on 23 January 2001 and 21 Dec 2001 and I liked most than today. The plot has flaws but it worth to see this movie, not only because of Mathilda May, but because it is a good story. My vote is seven.Title (Brazil): \"Força Sinistra\" (\"Sinister Force\")","LIFEFORCE was one of Cannon Films' biggest flops. It received mostly bad reviews and did nothing to help director Tobe Hooper's career in the wake of the Spielberg/POLTERGEIST controversy. All of this is unfortunate, because LIFEFORCE is actually a really great movie. It is supremely entertaining, moves along at a fast pace and features some of the most outrageously over-the-top direction, production, performances and special effects ever to explode across the screen! It must have looked bizarre on paper: the producers of THE DELTA FORCE, the screenwriter of ALIEN, the director of THE Texas CHAINSAW MASSACRE, the composer of BREAKFAST AT TIFFANY'S, the special effects wizards of STAR WARS... Audiences were not ready for this demented exercise in weirdness.What more do you want??? We got an alien spaceship full of giant bats! We got a sexy, naked space vampiress sucking out people's souls! We got exploding bodies! We got zombies! We got possession! We got an S&M interrogation! We got the entire city of London on fire! It's Dracula meets NIGHT OF THE LIVING DEAD meets QUARTERMASS AND THE PIT meets EARTHQUAKE. It's quite possibly the single most outrageous horror/sci-fi/comedy/action/disaster/erotic/apocalyptic epic ever unleashed, that is, if there are any other ones out there.Try watching this movie while chemically altered. Perhaps then you'll understand. A genuinely f***ed up experience, and one of director Tobe Hooper's most underrated movies. Maybe one day, it will find its audience.","This is the classic Zombie film it has, the one true element of it. That's to have you sitting on the edge of your seats waiting for them to find out how to kill it. So the movie starts off with them finding this perfect c-cup thick-tailed female vampire in a suspended state (she remains naked for throughout the movie. Then the mystery begins the ships is destroyed. The bodies are brought to earth and slowly you see the zombie uprising start as one turns two who then turn four then sixteen are turned to Zombies by the Vampire. Commandos our brought in to hunt her down. Thats a ruse just to get the heroes out of the city. When they return the city quarantined rage zombies are everywhere. And the two have to fight there way through the road-block nd then fight their way through the Zombie hordes to save the planet. It was awesome Slow-paced but awesome just the same.","A lot of people say the end did not make sense, but it did. With the female vampire dead the link to earth was broken and the ship took off, having picked up a lot of Lifeforce from hundreds of thousands of souls. Enough to re-energize those hexagon cells and create new bat creatures. It seems they do not have carnal sex, like vampires of legend. vampire bats from outer space may be ludicrous, but killing them with with a shot to qui force center below the heart is consistent. All you can ask for is consistency. The viewer has to suspend disbelief, even for scifi. The only problem is having to be a sword or stake, not bullets. That puts in a supernatural twist that does not fit with sci-fi. So that is a problem. The only major inconsistency I found is killing the male vampires with the sword, but the soul of the girl and Carlsen go up to the ship. I assume the males souls also went up the ship, but not shown. What about all the humans killed? Do their qui forces (\"souls\") go up to the ship as discrete entities, are does all the lifeforce get merged into one, for use as ship sees fit? In other words, all the human souls that went to the ship could be re-incarnated as bat creatures. The basic concept is no more ridiculous than Star Wars \"Force\" or even re-incarnation. This movie was over the top, kitchen sink (Dawn of the Dead meets Alien meets Dracula), but in many ways profound. It was also a beautiful love story. The beginning and end were ethereal. It both began (\"what is happening to me\") and ended as a love story. Most of the criticism of the movie is about its being bizarre.So what? Bizarre is an art form. As far as being ludicrous, it all fits. The plague concept is much more interesting and subtle than the Aliens just killing people. Maybe they didn't need Patrick Steward's blood to form an image of the girl, but it was a very far out, surreal, scene. Another reason the movie is hated is because of the end. But the end fits perfectly with the beginning. People are so wrapped up in the nude girl that they miss the movie's core. Its a lover story,from start to finish. It starts with Carlsen and the girl on the alien spaceship and finished same way. So it fits perfectly. Most people are fixated on the hero killing the monster, and this movie did not end that way, which is precisely why I love it. Instead, it has a happy ending, with the 2 of them going back to ship, to be reborn. Way cooler than the hero kills monster end, but that is exactly why it bombed. It was not a straight-up horror or even scifi/horror at all, but a love story, with a beautiful beginning and end. All those souls twinkling on the ship. And the crystal room pulsating with new life. Most people can't deal with a love story that is also Alien meets Dawn of the Dead meets Dracula.","Tobe Hooper (fresh off mainstream success with 'Poltergeist') aims for the skies this time around. 'Lifeforce' is an adaptation of Colin Wilson's 'The Space Vampires'. The script by 'Alien's Dan O' Bannon and Don Jakoby) varies a bit I was told: the futuristic storyline was made contemporary and Hailey's Comet was added to coincide with its actual passage by Earth a few weeks after the films release (so I've read).The story concerns a shuttle mission (commander by Steve Railsback) sent to investigate Hailey's Comet as it passes by Earth. All goes off without a hitch but upon reaching the comet it is discovered that an alien ship is hidden in the coma of the comet. The team investigates the massive structure and discovers desiccated bat-like creatures. Looking deeper into the ship a chamber is found that contains three humanoids (two naked males and one rather fetching nude lady too) in odd stasis coffins. The crew returns to the ship with the humanoids and a bat creature in tow.A bit later the ship returns to Earth but no contact can be made by NASA and another shuttle is launched to ascertain the status of the mission. Upon docking with the Churchill it is discovered that a massive fire has seemingly killed the crew and all data concerning the flight. But the three humanoids remain. However it is learned that an escape pod had been launched but whose whereabouts are unknown.Soon they make the discovery of the alien's origin when the very attractive space vampire queen arises from her slumber to easily seduce the lifeforce from the men around her. If you suck face with her she makes you like them and if you don't feed after two hours you will dry out and become dust. The goal of the three is to drain enough of the population's essence to power and sustain them and their ship for the trip to the next planet to lay waste to them as well.Thankfully the Commander survives re-entry in the pod (crash lands in Texas no less) and now has a psychic link to her royal hotness, the queen and is able to use it to find the hidden queen as she and the surviving male attempt to bleed London dry of their souls.Tobe Hooper (of 'The Texas Chain Saw Massacre' (1974)) does an admirable job in what has to be his largest production to date. The production assembled many fine technicians from all over the movie industry. Production Designer John Graysmark (fresh off 'The Bounty (1984)') uses every bit of four stages at Elsree Studios to create the spacious interiors of the ship and such. Cinematographer Alan Hume returns to science fiction after a stint on 'Star Wars VI: Return of the Jedi' (1983) and three consecutive James Bond episodes. Hume uses every bit of the widescreen frame with the great effects. Oscar winner John Dykstra innovator of the groundbreaking effects of the original 'Star Wars' (1977) manages to push the envelope once again a creating some highly creative and spectacular effects using lasers. Heck even maestro Henry Mancini drops in to give the film a very memorable title theme that gives this sci-fi / horror hybrid a touch of an adventurous feel. In the acting department it pretty much falls onto the shoulders of Steve Railsback and newcomer Mathilda May (vampire queen). Railsback always brings an edge to the characters he plays and can play nuts like nobody's business. That comes in hand as his mind deteriorates when the queen's grip tightens on his soul. Gorgeous French actress May doesn't have a heck of a lot of lines (were there more than ten?) but her frequently nude presence never gets old and you gotta give her kudos to having the jingle bells to pull it of. Pretty much all the queen is there to do is feed and to do so she needs to seduce you with her sexual presence. Job accomplished and where do I sign up to be victim? I really enjoyed how they tweaked the old vampire clichés and still managed to make it seem fresh but still easily recognizable. Almost everything is accounted for here: bats (their true form resembles a large bat), coffins {the stasis fields resemble these), transformations (they scan your mind and can be anything), massive sexual appeal (Miss May.duh) not to mention they even include the old standby stake-through-the-heart (this time a bit of a lead dagger to the energy center slightly below the heart). The only thing they didn't touch on was religion but I think that the vampires using the cathedral at the end as home base might just be a bit of a wink and a nod.In short (yeah right 800 words later) 'Lifeforce' is an excellent science fiction and horror combination that pays homage to the vampire theme while adding some neat different wrinkles. The effects and scale of the production are enough to keep summer movie types engaged (at least at the time) and horror and sci-fi fans engaged. 4 of 5.","I hate to admit it, but I really love this movie, although on every level it really is horrible!  The moments of incredibly bad acting (does Steve Railsback HAVE to scream like a maniac in every part he plays?  Is it a part of his contract?), cheesy effects (oh, yeah, gotta love those animated corpses...), completely senseless \"scientific\" explanations and gratuitous nudity... Okay, so the last point is a plus rather than a minus, because Mathilda May has to have been the most beautiful-looking woman on the planet when this film was made, but it's just a little bit obvious that she's serving as a distraction from the rest of the movie rather than an enhancement to it.You know what?  I really don't care.  I've watched this movie repeatedly, especially when I've had a few, and I never fail to enjoy it thoroughly, although not perhaps in the way its creators intended.  I mean, where else can you see Frank Finlay pontificate in such a wonderful take-off of the original mad scientist?  And for screaming, Patrick Stewart sure gives Steve Railsback a run for his money.  (That's saying a great deal, believe me!) Let us not forget some other fantastically talented actors whose facial expressions seem to indicate that they can't believe they've been trapped in this low-budget purgatory--Aubrey Morris, Michael Gothard, Jerome Willis, and, of course, the incredible Peter Firth.  Oh, Lord, how I love it!If you're after a movie that doesn't make you think at all but has wonderful eye-candy value (if you appreciate female beauty, anyway), this is the one for you.  Slightly better now that all of the original scenes have been re-instated--so many more opportunities for howling with laughter.  It just screams \"B movie!\" but somehow it is so much more fun.  Oh, dear, now I have to go and watch it again!","Two-plus decades after I saw LIFEFORCE at the drive-in, I sat down and watched it on DVD. What a revelation. The restoration of just 15 minutes of missing footage makes all the difference in the world: harking back, in tone, to many of the '50s classics of the genre, LIFEFORCE RESTORED is well worth revisiting. Mathilda May still holds up (if you'll pardon the pun) and the '50s feel director Tobe Hooper manages to evoke fits the film like a glove. Had THIS version been released in this country back in '85, the retro approach would've been more readily apparent and would no doubt have been more greatly appreciated. I remember Hooper conveying his dissatisfaction with the U.$. theatrical version in at least one interview at the time of this movie's release; having now seen the complete film, I can understand why.","This film has a very special place in my heart. To sit back and read all the reviews from people who really love it is heart warming. To read the ones that rip it to shreds, I like them too. I just love the heated debate this film inspires even to this day. I must admit I would like to remake this story but more to the original Colin Wilson novel.To watch the film and remember the awesome time I had working at Elstree Studios with people people who had worked on the original 'Star Wars' trilogy makes me realise how lucky I was to spend several months on this playing a Walking Shrival. My first acting job. A dream come true playing in a twenty five million dollar playground.https://www.facebook.com/lifeforcewalkingshrival/","I tend to revisit this one every half-dozen or so years, and in the words of The Beatles' Sgt. Pepper's Lonely Hearts Club Band its always \"guaranteed to raise a smile\". I think the first time I saw it was on TV when I was very young, and with my parents. Although we only caught the last half hour of it, so the nude walkabouts and the middle section where they are roughing up the woman at the asylum had already passed us by (I don't think my parents would have allowed me to keep watching it if they hadn't), and so my parents were spared any awkward child to parent questions like \"whats an extreme masochist\" and \"what did that man mean when he called himself as a natural voyeur\".Watching it again, I did pick up on there being an overlap in terms of content between it and Return of the Living Dead, what with both films featuring fast moving zombies and sharing a scene where a skeletal female corpse returns to life on an operating table. Obviously the direct link there is Dan O'Bannon having been the screenwriter of both movies, and Hooper having been pencilled in to direct Return of the Living Dead at one point. So I guess a couple of ideas they came up with for Return of the Living Dead also found their way into the Lifeforce script as well, especially in light of the fact that there is no zombie apocalypse in the 'Space Vampires' source novel. Ironically Lifeforce puts you in mind of so many films that came before it (Alien, Night of the Living Dead, Hammer's Quatermass films and variants like X- The Unknown) and yet one of the few significant horror films it isn't reminiscent of is The Texas Chainsaw Massacre. Not for a second does Lifeforce feel like a film from the director of The Texas Chainsaw Massacre, whereas you do get a TCM vibe from Hooper's Death Trap and to a lesser extent Salem's Lot. I find it interesting that the film's trailer and original advertising hypes it as being \"from the director of Poltergeist\" rather than TCM, and do suspect that had Lifeforce equalled the success of Poltergeist it would have led to a second stage in Tobe Hooper's career as a bankable director of big budget, special effects driven blockbusters, as would later happen with Sam Raimi and Peter Jackson. Whereas the box-office failure of the film and Hooper's retreat back to low-budget horror soon after, means that Lifeforce and especially Poltergeist now feel like career abnormalities, as Hooper is still strongly defined by The Texas Chainsaw Massacre in a way that Raimi and Jackson no longer are by The Evil Dead or Bad Taste. I think time is being kind of Hooper's career though, there seems to be allot more people fighting the corner for Lifeforce and TCM2 these days than back when those films first came out. It was once quite fashionable to knock Hooper, I remember there was an especially damning career overview published in 'Deep Red' magazine in the late 1980s that portrayed him as being a talent that had gone astray and sold out to Hollywood. There is a tendency to look more generously on his films these days though, if only because so many of his contemporaries have similarly suffered from career declines and fallen from grace with their fan-bases. Latter day Hooper films like Spontaneous Combustion and Crocodile might never measure up to his earlier work, but then again they're no worse than what Romero and Argento come up with these days.I was watching it recently mindful of there being growing rumours that a Lifeforce remake is in the works, and whether or not remaking the film is really justified. So I was a little surprised as to how much the special effects in the film hold up. Admittedly, the fake Patrick Stewart head and the burning model village doubling for London do cause you to wince, but the early scenes on-board the spaceship and Halley's Comet –which are the scenes I'd expected to date badly- wouldn't look out of place on the big screen these days. For a Cannon film there is also a real absence of period trappings, which you certainly can't say about the The Exterminator 2 or Ninja 3: The Domination with their aerobics and break dancing scenes. I do know that the original Space Vampires novel is set in the future, and while the film drops that angle, I suspect the fact that it is based on a futuristic source novel lends it a timeless feel. Of course the film does also manage to dodge the fashions of its day by virtue of the fact that the first twenty minutes or so features the majority of the cast in spacesuits and one cast member wearing nothing at all. I don't have a big downer on remakes though, and am curious as to what they'll come up with should this Lifeforce remake come to fruition, but to me there is nothing in the original that really cries out to be remade in order to bring it in line with the tastes of modern audiences. Whereas with say, An American Werewolf In London, you can imagine some Hollywood exec looking at that film nowadays and insisting it is in need of an update on account that there are aspects to it that aren't really relevant to the world of today, no one for instance goes to a cinema to watch porn anymore and the gag about there only being three television channels in Britain is meaningless today. I can't see a great deal in Lifeforce though that overly ties it to the 1980s, although it would have been hilarious if Golan-Globus has insisted that the zombies had to do a bit of break dancing at one point.","Re: Awesome, insane film by jim6263 A different time frame here, growing up with the B&Ws, back when \"This Island Earth\" was \"Zowie!\"... but I agree. Railsback is excellent (the 116-minute WS/LBX version *only*, as of now anyway!); he's into every moment (unlike the likely relative or in-law of some producer or director, who 'played' the hapless crewmate being interviewed about the onbaord mishap, who was just plain bad -- the only one, thankfully). I didn't care for/wouldn't have cast Firth (esp. as a military guy; his acting was not bad); most all were very good. It's *not* easy for actors to make/regurgitate banal corn and cheese dialogue and be believable! Add Mathida May's lovely presence, A-list F/X (cutting edge *for its time*), an A-list composer, a quality Director, + darkened ham = a Classic! Most unfortunately (as too usual), the idiot (apparently) Prodco didn't know that (and/or the censor board -- and yes, it is! -- did them in!??), as the theater release was too disjointed and *much* less pleasurable a view than is the DVD. (And what a view... I'd have loved a bit more light on the subject.) It still looks primo (vs. today's lot); I thought sure it must have been remastered!? But, apparently not. I doubt the F/X could do as well today, exc'g the transformations totally w/o cut-aways.Excellent fun! Right up there with (or over) \"Return of the Living Dead.\" A great Double-bill for some venue with foresight, f.t.m.... say like 10 p.m.","I disagree with a previous review that wishes the film were release as the version played in the U.S. in the 80s and put on video. This version was chopped up so much it was confusing and very disappointing. Of course, one does not know this until one views the DVD release. In the U.S. version, Hooper must have bowed to pressure that the movie was not \"scary\" enough so he had composer Henry Mancini change much of his music, go back to London, rerecord, and even then the producers or Hooper wasn't happy. Mancini said \"enough!\" and Hooper used other composers. Then he cut the film to pieces and moved bits around. Once I viewed the DVD, I realized the original release was a MESS. I much appreciated the campiness of the movie and do not see it as some sci-fi horror flick. Much of the acting is over the top (I think the leads were miscast - I like Railsback but why he was chosen as the obsessive and tormented character, I don't know and Firth was the campiest of all.) The story goes from a space sci-fi movie, to a vampire movie, then concludes as a zombie movie. Way too much but fascinating all the same. I don't think all movies have to be Golden Palm winners at Cannes and should sometimes be silly but really fun. I think the original intention was to craft a film that was more adventure than horror. But after production, they decided to go horror (for whatever reason, perhaps audience reaction to previews, which always mucks things up) and that actually made the film worse because of the last-minute amendments. I prefer the adventure version on DVD. My favorite aspect is, of course, Henry Mancini's score, which played in full, demonstrates the original intent of adventure. I also like that they restored the dialog and the original opening credits, which actually is still not complete. I remember the U.S. video and when I saw the DVD, I could not understand why they removed so much. The dumbest lines are the best! One of the grand things about DVDs, especially for us film buffs, is that they give us the opportunity to see the original vision -- as if we were denied this in the theaters. Unlike other reviewers, I would like to see even more footage added (I have a CD of all the music and listening to so many cues, it's evident that much was still cut, even on the DVD.) If I won the lottery, I'd restore everything myself... the original space sequence was supposed to be free of most dialog with the astronauts taking a look at the alien ship. Zombies don't have to be running around and bombs don't have to be going off to make a film interesting. Be patient, don't rush things.Another crappy thing about the U.S. video version is the horrid sound effects which I suppose were added to try to frighten the audience. The added miserable sound effects become quickly annoying, such as when the blood-lady forms in the helicopter and the dead bodies are screeching. Thankfully, this is toned down a lot in the DVD. When I watched the video a long time ago with some friends, their only comment was \"God, this movie is loud.\"So here's an idea. Put the completely restored version AND the U.S. released version on the DVD with commentary, behind the scenes stuff, etc. and that would satisfy all of us! Comparisons can be fun for us film buffs.","Is it a perfect movie? No. It is a weird adaptation from a sci-fi book and it features vampires from space, naked beauties and the British army efficiency.When I first saw this movie I was rather young and all I can remember is the feeling of awe for the movie and Mathilda May. Actually, if it weren't for this gorgeous lady being naked the whole movie, I probably wouldn't have rated it so high, but given her sheer magnificence, I am now actually considering voting it up!Lucky for me I got reminded of the movie and watched it again now. Imagine Raiders of the Lost Ark or Poltergeist special effects splattered unto a rather decent sci-fi story, but with completely over the top performances. I still enjoyed the movie tremendously (as well as Mathilda May), but it was a mixture of nostalgia, comparing with the crap movies they make today and actually wanting more when it ended.Bottom line: if you are a sci-fi fan you are not allowed to miss this movie. Oh, and did I mention Mathilda May is young, beautiful and naked?","LIFEFORCE is an extremely schizophrenic movie, based on Colin Wilson`s novel The Space Vampires the script ignores most of the novel`s concepts and structure ( Indeed it owes more to the QUATERMASS serials than the novel ) but the scenes it does leave in from the novel are nearly identical to those in the film . And talking of the script it must be one of the most uneven in cinema history , it`s though it was written in chapters by several different people. Take for instance Carlson , he disappears after the early shuttle scenes which led me to believe he was dead then he turns up again halfway through the film in order to explain the plot to the beleaguered Brits and it`s this lack of attention by the screenwriters that spoils the film . And there`s plenty of other clumsy scripting such as the heroes returning to London in a helicopter and not realising it has been over run by zombies untill they`re flying over it .I could go on at great length about these plot holes but LIFEFORCE is actually enjoyable to watch as long as you don`t use your brain . It`s good to see a sci-fi horror film from an era when aliens were portrayed as being cute creatures that children hid in their bedrooms so that nasty human adults wouldn`t get their hands on them . The special effects and pyrotechnics are very very good , there`s lots of action and stunts and LIFEFORCE features one of the most memorable aliens in the form of the space girl . When mentioning LIFEFORCE in conversation with males it`s always a race to say \" Seen the alien in LIFEFORCE? She can suck the lifeforce out of me anytime \" Hardly surprising looking at the demographics of the votes that this film is more popular with males than females\" Don`t worry . A naked girl can`t escape from here \" Can`t she ? Pity","I first watched this film as part of my big \"zombie kick\" started by DAWN OF THE DEAD when I was a teenager maybe 12 years ago and didn't much care for it. As a zombie film I found LIFEFORCE to be immensely disappointing with very little of what I considered real zombie action. Don't get me wrong, there's lots of mayhem and chaos in the final reel, but the zombies run around fast and are in the gray area where they're almost more vampires than zombies. It's just too bizarre and sloppy if you go in expecting a Romero-style straight-forward action horror romp.Seeing the film as an adult, I can find a lot of new things to appreciate. For one, the cast is fantastic with Steve Railsback in full-on goofball mode only hinted at in his earlier starring roles in STUNT MAN and TURKEY SHOOT. Solid British performers Patrick Stewart, Peter Firth, Frank Finlay, and John Hallam all pop by in strong supporting roles, with relative unknown Firth pretty much replacing Railsback as hero slowly but surely as the film progresses. The special effects are excellent beyond their years and should be in bold font on John Dykstra's CV. Add to that it's got a lot of imagination and energy which you just don't see in too many scifi/horror movies... and there's just the right balance with gore and unpleasantness to keep it shocking yet not grating.LIFEFORCE is not necessarily a good film, but at least it stays entertaining. What it fails to do is really present a narrative in a way that feels like it makes proper sense. For one thing, the movie makes the odd decision about halfway through to send the two protagonists to an insane asylum where they inexplicably spend the next 20 minutes of movie. Suddenly out of nowhere we're plunged back into our main plot with London being overrun with zombies. It's like the movie just took a time-out to up the weirdness factor rather than sticking to its guns.Of the Cannon Group's many offerings this really sticks out like a sore thumb - a film of such ambition never to be attempted by them again.On a final note - LIFEFORCE is well worth watching if nothing else for the excellent use of late 70's / early 80's British \"Lightning Strike\" sound effects as heard in the pilot for \"Space: 1999\" and FLASH GORDON. ZZZ-ZZZ-Zakorr!!","Wow! I can't really imagine this kind of movie. What is it?? A space vampire?? Whoever ever think about this kind of movie?? Based on the novel \"space vampire\",Lifeforce made out as a success movie in the 80's. I was tend to watch this movie when i found out at the IMDb which was given an average rating of 5.8. This is actually an unknown movie for there are only about 5000 people who votes on Lifeforce, so, i'm giving it a chance. The main reason i watched this movie is likely because my friend want to watch a sci-fi movie. Then i search all around in IMDb and found this one. Tobe Hooper have created good movies recently especially Texas chainsaw massacre, funhouse and some others..so i think i should try out Lifeforce.At first, the movie is full of suspense, not because of its special effect (which i think quiet cool for the 80's), but the acting, the music and how the story lines goes. Actually, it makes feel very confusing.. but i kept on watching till i found out what the hell is it all about. At the end, i still not fully understand the whole matter of Lifeforce, but it is already enough for me and my friend to conclude that this is a good movie. The only thing that i hate about this movie is the sex scene,huhu...overall, the plot line is interesting, the acting is not incredibly brilliant, but still there are good performances from the actors, surely not an Oscar material, but still a good one.I think that this movie deserves a second chance, find it and watch it. I'll rate this movie 10 out of 10..not because it was perfect, but just giving it a chance. Honestly, i don't think Lifeforce should be given rating of 5.8 out of 10. It should have been higher.","There is a certain sort of person who gets a great deal from the following in a movie: 1. Science fiction - spaceships, special effects, aliens etc.; 2. Horror - zombies, animated corpses, vampires, gouts of blood etc.; 3. Sex - naked people, especially attractive young ladies; 4. Silliness - humour deriving from daftness, whether intentional or unintentional.I am that person. And that's why I like Lifeforce.Imagine describing the story to a 3rd person. \"There's these vampires on a spaceship, see. And one of them hijacks her way back down to earth. And she just happens to be this amazingly hot young woman who walks around stark naked all the time. And she sucks the life essence out of people until everyone turns into vampire zombies. And it turns out that what they want to do is fire this stolen life essence into space to refuel their spaceship.\" Sublime. Presposterous. An utter hoot.","I'll make this brief. Director of Texas CHAINSAW MASSACRE, writer of ALIEN and RETURN OF THE LIVING DEAD, combing forces and make a movie about SPACE VAMPIRES, this must be a classic right? Wrong.The best thing about this about this film is watching Mathilda May walking around naked for a few scenes at the beginning. By this comment I'm not trying to come off as exploitive or macho, just stating a fact, it really is the best thing about this movie. For some reason Tobe Hooper thought it would be cooler to not watch events happen but instead watch a bunch of prim British men sit in a room and talk about the events that are happening, for . two  hours. Seriously, this movie will bore you to tears. When you finally trudge through a film containing people talking about stuff and a few poorly made scene where you actually get the treat of seeing things happen (most of which feel like they are clips from bad British television shows), you are rewarded with an extremely underwhelming finale, that at least has some brief footage of space zombies savaging London. Tobe Hooper spells space vampires, B-O-R-I-N-G. Just stay away."],"review-user":["ametaphysicalshark","jiangliqings","Renaldo Matlin","bob dove","virek213","vhsiv","Li-1","sawyertom","claudio_carvalho","squeezebox","nathan-yeo","mka-24","suspiria10","keenan-1","poe426","sicollins","gavcrimson","jim6263","poweruserx123","siderite","Theo Robertson","Aylmer","Majid-Hamid","neil-476","uselesswarrior"],"review-date":["9 December 2008","14 November 2000","3 December 2002","12 March 2003","19 December 2001","3 February 2004","5 May 2003","31 July 2002","2 November 2013","25 October 2005","9 September 2009","13 April 2009","4 December 2007","20 March 2004","15 November 2009","25 January 2016","26 August 2015","11 December 2009","25 August 2005","26 December 2009","16 June 2002","10 February 2010","23 October 2009","3 March 2010","29 July 2006"],"review-rating":["8","9","7","7","8","8","10","9","8","5","10","10","9","9","8","7","7","10","8","1"],"review-title":[" Glorious, demented, insane, has to be seen to be believed. Humankind's greatest achievement?\n"," A movie that truly does have to be seen to be believed.\n"," A force to be reckoned with\n"," Calm down,people!\n"," Totally Berserk Melding Of Sci-Fi And Horror That Somehow Works\n"," ***an underrated gem\n"," An entertaining, thrilling sci-fi horror flick with a fabulously gorgeous and nude space vampiress at the center of it all.\n"," Mathilda May Makes My Day!\n"," Vampires and Zombies in London\n"," Brilliantly demented\n"," Boobs, Vampires, Zombies, Commandos, and CPTN PICARD\n"," this movie is incredibly far out\n"," S10 Reviews: Lifeforce (1985)\n"," So bad that it almost becomes great.\n"," Classics revisited...\n"," I Love The Space Vampires\n"," Cannonized\n"," Awesome, insane film\n"," I very much prefer the DVD release and still wish they had included even more footage from the space sequence, which was cut down tremendously.\n"," A great movie from my childhood\n"," Great Fun Without Being A Great Film\n"," Actually gets better on subsequent viewings (and when you know what to expect)\n"," One odd...& brilliant movie from Tobe Hooper !\n"," Gloriously daft\n"," GASP at the sigh of old British men in rooms! THRILL as they talk about things!\n"]}