{"review-url":["http://www.imdb.com/title/tt0041255/reviews"],"review-text":["I was surprised, \"Once More, My Darling\", had not generated enough votes (at this writing) for a \"user rating\".  It's a \"screwy\" comedy I have enjoyed many times over the years.  Robert Montgomery's mission places him in some very improbable situations, and he's just the man for the job.  He maintains his trademark \"befuddled\" look throughout the film and hysterically, too. Ann Blyth plays his precocious/eccentric pursuer, who assumes a relationship that does not exist.  Her character is kooky enough to warrant the unearned nickname \"Killer\", but remains cute and cuddly.Among the glut of \"B\" movies from the late 1940's and 1950's, \"Once More, My Darling\" is a standout.  This one is worth looking for....","Engaging comedy with a rather nutty premise but the skillful playing of the cast make it work. Ann Blyth embraces her inner ditz as the bubbly, forward teen who is instantly smitten with Montgomery on sight. Montgomery, one of the best light comedians of Golden Age Hollywood, carries the film right along with an air of deer in the headlights helplessness at the onslaught of ardor that Ann's character unleashes his way. Theatre great Jane Cowl is also highly amusing in one of only four film appearance's as Bob's mother. One small drawback. Montgomery is a perfect choice for the breeziness necessary to make his character work but he was 45 at the time this was made and looks it, whereas Ann Blyth was 24 playing 19 and is convincing as such making their pairing a bit off. They would have been better paired as a father and daughter at this point. Be that as it may this is still a pleasant little known film.","Ann Blyth showcases her fine comedic sense in this warm, often zany film. Nicknamed \"Killer,\" her character is fond of \"Passionelle,\" a perfume which she practically bathes in, and Robert Montgomery, in the role of \"Collie,\" whose mission is to bust her estranged boyfriend for jewel smuggling.  One highlight is when Montgomery, a momma's boy, introduces Killer to his mother and friends.  Blyth masterfully mines this scene for its full comic worth. \"Once More, My Darling\" is one gem of a movie with a great slapstick ending.","After the turning point of NIGHT MUST FALL, Robert Montgomery (for the most time) came into his finest films and performances: HERE COMES MR. JORDAN, THEY WERE EXPENDABLE, THE LADY IN THE LAKE, RIDE THE PINK HORSE, THE SAXON CHARM, JUNE BRIDE. Even some of the failures he was in were interesting enough to be still watchable (RAGE IN HEAVEN, MR. AND MRS. SMITH). But Montgomery wanted to do more and more production and directing work. In 1949 he made what would be his last movie performance - he played Collier Lang, an egotistical movie star, who is dragged into helping the authorities do an investigation about a young girl's boyfriend.Apparently my view of this film is a minority view. Most of the views given are favorable about it. I thought it was a dull, witless script, with Ann Blyth's groupie heroine not very appealing as a character. She admires Montgomery as a star, and this \"helps\" when he is called in to assist the authorities, but after awhile I found there was no chemistry between them. The script was also devoid of much fun, although Montgomery and Roland Winters did try. The only thing I recall to this day as a joke point was that Taylor Holmes is the wealthy father of Blyth, and he is an admirer of Winston Churchill. So he always dresses up as Churchill, and we see him wearing a floppy broad brimmed hat, smoking a large cigar, and painting (Holmes' bald head helps in the disguise). That was the most memorable joke from this film - not much of a real memory.Montgomery went into early television, and finally won the attention and respect he always had deserved in motion pictures. His last contact with the movies was his direction of THE GALLANT HOURS about Admiral William \"Bull\" Halsey, starring his friend Jimmy Cagney. It is a far better film than this. For his overall film and television career, I will give this mediocre film a \"4\". That strikes me as generous.","The plot of \"Once More, My Darling\" is one of the goofiest of any movie I've ever seen. It has a cleverly disguised role reversal subtly woven into the script. I didn't realize it fully until a second viewing. And then, I discovered even more wit and humor in third and fourth viewings. This film contains some marvelously subtle pokes and jabs at various aspects of life, and things and people. And above all, its a wonderfully clever social satire that packs much humor in the reversal of roles of male and female, pursuer and pursued. The very plot makes it hard to catch everything. The situations are so outlandish and funny, that it's easy for one to miss some of the many sidesteps in the dialog. Thus, more viewings mean more laughter. To some extent this film is dated. A few of the references may not register with younger viewers today, unless they know history very well. But for the most part, the humor in this film should delight audiences of the 21st century, just as it did those in the mid-20th century. It's a wonderful zany comedy and subtle satire of many things from the Army to culture and custom, and from the legal profession to the stage.The stars of this film seemed to be having a ball. In more than a couple of places it looked as though they were about to break out with laughter. I can imagine that happened and that it took a number of takes for some scenes. The cast of characters is a riot in itself. All the players do superb jobs in their roles. Robert Montgomery is attorney playboy Collie Laing, an actor wannabe and World War II Army MP officer. Ann Blyth is Marita Connell, daughter of a reclusive and strict tycoon. She overpowers people with her overdose of perfume and with her non-stop zany talking. She goes by the nickname on her T-shirt, \"Killer.\" Jane Cowl is Collie's very witty attorney mother, Mrs. Laing. Taylor Holmes is Jed Connell, the crabby father of Killer. His hobby is painting, because he \"admires Winston Churchill.\" Charles McGraw is Herman Schmelz, chauffeur to the Connells and self-appointed protector of Killer. He was seven times a contender for the Middleweight title (boxing). Roland Winters is Colonel Head, Collie's active Army CO. John Ridgely is Burke, a G-man who's hot on the trail of a WW II jewel thief from Europe. Only by the wildest stretch of one's imagination could all these characters and more be brought together. But Robert Carson's screenplay does just that. And, this plot with its smaller interwoven plots, makes for one zany, hilarious movie. Here are some of the riotous lines. Mrs. Laing, \"Don't you ever long for the patter of little feet?\" Collie, \"Patter of little feet? You mean mice?\" Mrs. Laing, \"Children also have little feet.\" Collie, \"Madam, don't tell me that at your age you're thinking of marriage again?\" Mrs. Laing, \"Yes, I am. Not for myself, for you.\" Collie, \"The War Department is obviously plotting my ruin. They won't be satisfied until they blow Taps over me.\"Receptionist, \"Captain Laing is here, colonel.\" Colonel, \"Have him come in.\" Receptionist, \"You may go in.\" Collie, \"I will not go in without my mother.\" Receptionist, \"He won't come in without his mother.\" Colonel Head, \"Uhh  send them in.\"Mrs. Laing, \"The truth of the matter is, Colonel, my client thinks you have a perfectly splendid Army; but just this once he'd like to be excused.\"Mr. Burke, \"We certainly know how to pick 'em. He's the prettiest military policeman I ever saw.\"Colonel Head, \"Captain Laing, there's an old German family in Upper Bavaria called Margradeyshillingsfosthengschweiller.\" Collie, \"Oh, I'm not surprised.\"Colonel Head, \"He's an extremely violent personality I tell you there is nothing to worry about. By the way, do you have a gun?\"Killer, \"Herman, are you with me or against me?\" Herman, \"I'm with you, Killer. No funny stuff.\" Collie, \"You can depend on me, Herman.\" Herman, \"Oh, I'm not worried about you.\"Collie, \"I may appear a little priggish, but if I gave in too easily to you, I might do the same thing for some other girl, and you wouldn't like that, would you?\" Killer, \"Gosh no, you're a nice boy, Collier. I honor you for it. But look out for me tonight.\"Killer, \"Mrs. Laing, did you know that Collie was a romantic dreamer? Emotional, impulsive, quick to embrace life?\" Mrs. Laing, \"Well, that side of his nature has been hidden from me.\"Killer, \"Why, the moment we met, we threw caution to the wind.\"Killer, \"I hope you'll all forgive me for going on like this, but when a girl is facing the natural fulfillment of her aspirations  when she finds herself a part of a scheme of boy meets girl and the inevitable happens\" Collie, \"Uh, good night.\"Mamie, \"Mr. Collie, you've never had a girl like that before.\" Collie, \"I take no credit for it personally. It could've happened to anyone.\"Killer, \"Collie, do you think your mother was impressed?\" Collie, \"There must be a stronger word.\"Killer, \"Darling, I suppose you've always dreamed of a big church wedding with your mother and all your friends there?\" Collie, \"Well, yes. It is the most important day in a man's life. He gets to wear a cutaway, and striped trousers, and then there are the presents.\"Killer, \"There's nothing to be afraid of, dear. I'll be awfully gentle and tender.\"Mrs. Laing, \"I'm not going to let you be the victim of a deranged siren in night wear I'll have you declared mentally incompetent. Say you were drugged by that perfume.\"Collie, \"Good night, man's best friend.\" Mrs. Laing, \"Boy's best friend. Man's best friend is his dog.\"","Poor second-string feature from Universal Pictures about a mama's boy movie actor doing criminal investigation work for the military, fending off the advances of the brash young woman he's been assigned to romance. Robert Montgomery directed and stars in this adaptation of the short story \"Come Be My Love\", and his acting performances of this era are unrelievedly lazy. The plot is sappy, predictable stuff, and writer Robert Carson has given all the really funny lines (as usual for films of this period) to the feisty black maid. It's always nice to see Ann Blyth and Jane Cowl in support, but they can't do much with this hokey material. * from ****","This movie had a plot of having a good screwball comedy. The selection of the stars was a I felt a bit wanting. Robert was (he was about 45 and looked so too) looked to be a bit too old for Ann. She was only 21, and on screen 19, and her personality suited the role, of a scatter-brained teenager (she did quite a few roles of this type, and successfully too). But probbaly he wanted it to be his vehicle (he was the director to this movie too), though not on the screenplay team for this movie, I wonder, why didn't Joan Harrison interfere ?The movie was quite good, and without much hiccups for about one hour (which is two third of the movie), but the moment the two eloped, it (the movie) simply went to pieces and even till the end, they couldn't or may be didn't want to, gather them back.To her credit, Ann did try to keep the things to some order, and was quite convincing as the scatter-brained teenager. I would rather say she lived in the imaginary world of pulp-romantic-novels, which in real life too some do, and with her personality, she could very successfully live it, without being an eyesore, and I said, while the scene was her, she did it. But who disappointed (after the hour mark), was Robert, both as actor, but more so as director. One who had been put in sleuth job, can't be that idiot. In fact the movie had simply degenerated into a pulp from there. Whether the sequence of forcing a clearly uninterested stranger, into a police agent, the police party, clearly looking for them, missing the parked car in broad day light, and that too three times ? Or they having put only one 'Police Marker' for the 300 miles journey? What if they had been ambushed on the way? Which would have been the intelligent thing to do. Or the cycle overtaking the car (lifted from Katharina, Die Letzte , there it was necessary, and was justified by situation) ? Why didn't the heist-man shoot the prone and perfect target, hero in the first place? How the police, who were supposed to be on hot trail, and that too the MP, reach the site after not only everything is over, but also two other parties have traced to rescue/ save the girl from the lecherous hero, \nand many such sequences. \nAll these were in fact not necessary, and with minor thought, movie would have reached the same conclusion, without becoming an eyesore.Only for the sake of Ann Blyth, one can watch it, she looked quite charming as the almost-child \"Killer\" role, else,...","I like Montgomery in several movies, especially \"The Night Has Eyes\" with Rosalind Russell. However, this movie is clearly not one of his best. The plot does not make sense. No one would believe for a moment that Ann Blythe would fall in love with Robert Montgomery, at least not in this movie. For this movie to be a comedy, the only time I found myself laughing was when the older woman (at his mother's shindig)asks Blythe's character if she is the one who is wearing the perfume shortly before she coughs. Charles McGraw (I know I keep talking about him, but you know he's my favorite actor)could have seen his role beefed up since it is obvious his character is a comedic foil for Collie's character. Definitely not a good day for Montgomery and company. I do not think the people responsible for this movie really thought it through before making it. I'm glad Montgomery rebounded later with \"They Were Expendable\". He went on to become a speech adviser for President Eisenhower. Mercedyz","It's Ann Blyth you'll remember from the romantic pairing here, not the aging Robert Montgomery in one of his last films. He's a lawyer turned movie star turned informant for the army, hired to romance Blyth, a suspected thief. That element of the story is never really pursued, the bulk of the action revolving Montgomery's overbearing mother (Jane Cowl) and Blyth's free-spirited and even more free-thinking nature. After \"Mildred Pierce's\" Veda and \"Another Part of the Forest's\" Regina, this is one of Blyth's best non-musical appearances, and she is winning every minute that she is on screen.Montgomery seems to be trying to recapture his youth from all of those MGM romantic comedies of the 1930's and is definitely outclassed by his co-star and on-screen mother. Cowl (\"Stop thinking of me as your mother. I'm talking as your attorney.\") is a very handsome older actress; In fact, here, she resembles William Powell in drag in \"Love Crazy\". The party sequence which introduces Blyth to Cowl's society friends (which includes a very butch \"glamazon\") resembles the \"at home\" gathering in George Bernard Shaw's \"Pygmallion\" and its \"Ascot Gavotte\" revisal in \"My Fair Lady\", with Blyth shocking and delighting guests at the same time. The unbelievability of the romantic pairing is greatly aided by some really witty lines (Cowl asking \"Haven't you ever longed for the patter of little feet\", to which Montgomery responds, \"You mean mice?\") which along with Blyth and Cowl raise the film from a \"C\" to a \"B\".","Although young actresses teaming with older leading men was far from unusual in Hollywood, there was something very strange about 21 year old Ann Blyth mooning after 45 year old Robert Montgomery. The only thing more ridiculous was Montgomery himself being recalled to active duty in the army in order to woo Blyth. I mean really, I should that in the vast array of army personnel they could have found someone within Blyth's age group who would have been better for the assignment.Once More My Darling finds Montgomery flung back into the army for an assignment to flush out Blyth's former boyfriend. He's a crook and a jealous crook at that. The boy friend is Ben Hicks who doing World War II stole a fortune jewels from a German family. One of them has been spotted on Blyth's neck at her débutante coming out. Montgomery woos Blyth to make Hicks jealous and come out in the open.In order to perform he has to put on a whirlwind courtship and overcome the opposition of her father Taylor Holmes and the family chauffeur and bodyguard Charles McGraw. How Montgomery makes out is for you to see the film.Although this film actually got an Oscar nomination for Best Sound Recording, it's a flimsy mediocre comedy with some laughs, but mostly it's just embarrassing for all involved.No wonder Bob Montgomery quit acting and went into the production end of things."],"review-user":["renfield54","jjnxn-1","tfambro","theowinthrop","SimonJack","moonspinner55","sbasu-47-608737","charlesstewart1","mark.waltz","bkoganbing"],"review-date":["2 May 1999","6 August 2016","2 February 2001","15 November 2005","27 January 2016","30 July 2006","21 May 2018","17 October 2006","4 June 2013","25 March 2014"],"review-rating":["9","8","4","9","2","5","6","4"],"review-title":[" DON'T PASS THIS ONE BY...IT'S GOOD\n"," Appealing comedy even if the leads are mismatched\n"," Wonderful, breezy comedy.\n"," Montgomery's Farewell to the Movies\n"," One of the subtlest zany comedies of all time\n"," Another dud from Robert Montgomery...\n"," Lost the track\n"," Montgomery has done better.\n"," Another unbelievable May/December romance saved by May, not December...\n"," Recalled to active service to woo\n"]}