{"review-url":["http://www.imdb.com/title/tt0067118/reviews"],"review-text":["First of all - I'm not one to go all sappy over movies. I saw Friends in the 70's when it was first released. I was about 17 years old at the time. Even now, at age 50, I still can remember some of the scenes. The movie is sweet and sad and may actually be too tame for teenagers today but I loved it. The story is about innocence, the purity of young love and the determination of 2 young people to make a better life for themselves then they had at home. At the time it was pretty risky to have a movie about a couple of young runaways who successfully setup house and have a baby on their own. I'm not surprised the movie and Elton John's soundtrack are almost unknown today. The music is beautiful. It was unforgettable.","When I first saw this film on video in a department store... it intrigued me.  Considering the fact that I thought I was in love and I was the same age as the youths in this film at the time (although I realize they are now old enough to be my parents), plus the soundtrack being written by Elton John & Bernie Taupin just before they \"made it big\" here in North America... I figured I had nothing to lose in buying it.  I was not disappointed.So far, I have shown it to many guys I have dated since, and to my current boyfriend... obviously, they didn't find it as lovely as I do... preferring to call it a \"chick\" movie... but I still laugh and cry.  This film was vastly overlooked.  It's good to see it's available to rent at one of the local video stores around here so that other people can share the magic. \nSo maybe it's a bit far fetched... but it gives you a lighthearted sense of innocence... and a renewed faith in love.","I first saw this movie my freshman year in college. I still consider those times quite magical, and this movie fits into that profile. The young female lead was exquisite, growing quickly from an innocent-looking child intoto a young beauty. A host of movies from that era blended music, cinematography, and dialogue in a way that has become basically a lost art. Friends uses a near-classical score from Elton John with scenes of the French countryside that display like a series of paintings. Even the somewhat-sappy dialogue fits into the culture of that era, spoken poetically by the 2 leads. The movie is truly eye-and-ear candy to be enjoyed. The subject is almost heart-breaking, as 2 youngsters try to capture happiness with methods they don't quite understand. This kind of romance has disappeared from the screen, substituted by a sort of head-banging cinematic relationship with sex and love.I recently listened to cuts from the soundtrack on Elton John's \"Rare Masters\" CD. It brought back all the reasons I really cherished this movie. Hearing the voices of the leads within one cut let me once again relive the sights and sounds of an era that embraced life, love, and romance.","Well what do you know, I was painting my house today and an Elton john song came on the radio, which immediately took me back to this movie which i saw in 1971. So long ago and so far away. Ten years later i hitched hiked through the country side of France, and i sure would have been keen to see Michelle. The film is probably not very sophisticated by todays standards, more's the pity, but it seemed rather racy back then. A few years later a sequel was made with Michelle living in a high rise in Paris and Paul coming back to meet her, just like life they had moved on, the film was very downbeat. Still the original was fab, and if you can get a copy go rent it, just remember to give it its' due and treat it gently. I note Americans can be rather prudish, so take note, contains scenes and themes possibly upsetting to middle America.","I loved this movie! OH MY GOSH! This movie rocked so hard! I found it amongst some old tapes and didn't know what it was and after having read the back of the cover to see what the summer had to say about it (Which btw, mentioned the fact that Elton John covered the soundtrack for the film more times than it mentioned what the film was actually about.), I thought it sounded interesting, and I was even more interested in seeing it because it was an older film.\"What controversy?\" I thought to myself as I put the tape in the player, I was curious I get. And my expectations were certainly met. I loved it! I guess it is a really girly kind of movie, but it was so sweet and adorable! It was a beautiful romance, although at times the directing reminded me of the camera work in 'The Graduate', which I thought at the time of seeing it the director must have been on acid with some of the close ups they did.OK, so it wasn't entirely conceivable for these two kids to run off and live on their own...but it could happen...in a fantasy...But, the ending just sincerely ticked me off! I was so mad with how they ended it...it sort of leaves you hanging, and I suppose they may address what actually happens to them in the sequel...but at the same time, I'm almost hesitant to see that, since sequels are almost never as good as the first.I totally recommend this movie to anyone sixteen and over! It's an awesome movie...Awesome!","First love.  Teenage love.  We all have experienced it even if it was not as sweet as the one the protagonists share. \"Friends\" could be considered an adaptation of the classic \"The Blue Lagoon\", originally from 1949, and its remakes from 1980 (the most popular one, with Brooke Shields) and 1999 (with a young Milla Jovovich). While \"The Blue Lagoon\" puts the two young lovers in a desert island, with no contact with civilization, \"Friends\" goes the opposite route and it is sure to ring much more true and be a more difficult movie with contemporary audiences. Paul and Michelle who, for different reasons, turn their backs on family and the adult world to end up living together in a small cottage in Southern France.  Having only each other and their childhood innocence, their friendship slowly develops into much more as they struggle to sustain themselves, in this sweet coming of age story. This film even to this day is controversial since the actors are teenagers and they certainly look the ages that are stated in the movie (15 and 14 1/2).  The movie does contains a hint of child molesting, nudity, depictions of teenage sex and teenage pregnancy.  But the real controversy is not the subject matter but the fact that Paul and Michelle's love is presented as a natural and healthy relationship.  While this worked fine for stranded lovers in another time and in a desert island, having them in a modern setting presents some very difficult moral issues.  Laws prohibiting consenting sex between minors are in effect in almost all countries and lack of sexual education in teenagers is seen as one of the causes for the rise in unwanted teenage pregnancies and abortions. Is a movie like this one just child pornography or a slap in the face to make us face our own hypocrisy, regarding a modern society that does not cater to teenage parents and laws that clearly go against human nature and hormonal development but that are needed to prevent child abuse?  Is hormonal development parallel to emotional growth?  These are not easy questions and most of us will feel uncomfortable with them. As an artistic piece, this movie is really a forgotten and rough gem.  The script progresses with extreme simplicity, albeit some sappiness, but never pulling any punches to state its message, although by today standards, it is somewhat slow.  The photography is beautiful and it has scenes of great beauty.  The acting of the two protagonists varies from really awful in some scenes to marvelously innocent and credible in others.  Pop music, unlike most productions nowadays, is used tastefully and sometimes the lyrics speak the thoughts of the protagonists.  Overall, this is a delightful piece, even if the moral values are not in concordance with your own.","Perhaps the most concerning thing about this film is the way many reviewers only see it as controversial, because it deals with young love. Also the ideals it sets out are how we would like to see the world, but are often prevented from doing so.Get past all this and you have a simple story of a boy and girl, who become friends and develop into lovers; but mostly outside of society's rules. While they pay lip service to certain conventions, they don't allow the rules to control their daily lives. The need for money requires the boy to get a job, but beyond this they live an idealistic existence in the beautiful surroundings of the Camargue.If you don't get a warm feeling while watching this film, then you have a cynicism that will spoil any innocent storyline. This may not be the Hollywood blockbuster that makes a lot of money, but it's one of those films whose story is very relevant at any time.","Well.....I wouldn't want to lecture anybody but I do feel the urge to say some things I consider important about this BEAUTIFUL film. I saw it for the first time in 1976 (I was 14) and then one more time a year later. That was it. The rest of it was the pink LP of Elton John's soundtrack getting the music and the story deeper and deeper inside my heart. How deep? A week ago my cousin gave me a VHS copy as a present. (No DVD's yet). Boy....was I surprised!! Poets have always sustained that deep childhood and adolescent experiences of beauty, love, God, idealist pursuits, stay with you forever. Since they occur mostly at the heart's level (no intellect yet!), they define your soul's contours like a sculptor would do with a stone. If sometimes we didn't tend to forget how right they are perhaps we would do better in understanding the meaning of every minute, of every decision, of every turning point of our lives. So, I confess I feel nostalgia. But the fascinating part of this is watching the film again, and through this trip back in time, enriching that understanding of why we, people from the 60's, grew up as we did. The spirit of those times is all here: a Genesis created far from the official world of consuming and economic success, make love not war, the beautiful pop ballads, the poetry of the lyrics, a totally romantic view of adolescent rebellion with the awakening of sexuality carefully wrapped in tender and chaste love, these two lonely spirits still full of childhood innocence growing together as they learn mutual commitment and turning into \"adults\". I showed the film to a group of school youngsters and they abounded with such simplistic and cynical comments regarding it as naïve and foolish. Guys, be serious!! Cinema is an art and as art it reflects not only human emotions but historical moments. And this is exactly what \"Friends\" does in a masterly way. It reflects an idyllic idea of rebellion and new beginning we all dreamt about when we were 15. I'm now a musician and I feel some of us, artists for that matter, still dream about it!! How else could we live? That's \"Friends\", that's \"Brother Sun Sister Moon\", that's \"Hair\". Those were the times, still alien to AIDS, alien to explicit and vulgar texts in pop songs with no melody, to pornography presented as \"sexuality\", to this barbaric new \"world order\" growing after September 11th. What a heart warming experience to see Paul and Michelle again, timidly and tenderly exploring the new fantasies of their romantic world. What a trip back to the very core of our hearts: to Paris, to Elton John at his best, to that urban scenario surrounded by 2 CV Citroëns and the VW Beetles. What a fresh air from the peaceful cottage in Camargue, surrounded by fishing ponds and wild horses. They made us who we are, as did Serrat in Spain, Brel in France, Peter Paul and Mary, Joan Baez, Luther King, the Beatles, the early Bee Gees, Belafonte's Spirituals, Gandhi, the Gospel of Elvis. People still hoping: get this picture. Start with innocence and grow from there. You'll find out what it's all about. And from there you'll have a solid and more truthful foundation; some ideals to look for in life, a way to handle personal and world affairs. We need so much of this today! Give yourselves the chance and maybe someday the time of cynics will end. (I have an extra VHS copy)Santiago Zuleta. Bogotá, Colombia.","This is a love story of chance and simple purity.  There is nothing shocking about this film for love can blossom completely between two teenagers of 14 and 15, and while the law might state otherwise, emotions develop naturally. Two listless teenagers unhappy with their home lives, meet by chance in Paris and develop a casual friendship.  One is an English boy (Sean Bury) studying in France and from a rich family.  The other is a young girl (Anicée Alvina) whose parents are both dead and has been taken in by her cousin.  On a sudden impulse the boy and girl run off to Arles where the girl's father owned a small house nearby.  With just each other, the beautiful scenery of the Carmargue, and a growing love between them, they make a new life for themselves.  Their simulated marriage ceremony, achieved by following an actual wedding in the local church, shows their acceptance of some of the rules of society.  It is just the unencumbered innocence of youth that puts them apart from the adults.  Soon a baby is born to them, with the boy acting as midwife without any outside help.  Everything is idyllic until the police finally locate the boy's whereabouts.....","I'm rather astonished that this film is still available in the United States, where by decree of our Congress individuals under eighteen are not allowed to be shown having sex.  Or for that matter,  even permitted to have sexual thoughts.That being said, you'll like this film, if you can ignore the highly sappy plot and just enjoy the two young stars and the travelogue-like images of South of France.   If you had a first love as sweet as Paul or Michelle (I know, 'sweet' is a rare breed these days)you'll particularly smile.","With all the dreck out there, this is a gentle movie about young love. Yes, it's true that young love often makes more out of something than it deserves, but why aren't people down on \"Romeo and Juliet\"? Paul and Michelle are models of good behave compared to them.Yes, they run away, and set up an ideal life, but this is a movie, not real life. Paul is more sexually interested than Michelle, who has been come onto in a bad way. Eventually, they have sex, but no one is forced into it. The movie does let kids know that sex can cause babies.One thing, there is nudity in the movies. The camera does not focus on it, but it is there.The ending of the movie has Paul in good chance of being found out. In \"Paul and Michelle\", they separate for a time. If you don't like the ending of a movie, think one up yourself. Alternative endings are not just for DVDs.","Michelle, Anicée Alvina, was so nice, and I really fall in love with her. She died a few months ago! Friends? Really the best movie of my youth. The \"seasons reprise\" of Elton and his arranger Paul Buckmaster sings in my head forever... Please, if you know where i could find a VHS of the film, mail me!! My husband of 26 years & I saw this as Juniors in HS. Yes, he was my boyfriend then and still continues to be. I think we both cried our eyes out. I think possibly we were drawn to the movie by the Elton John music in it, but were then swept away by the teenage angst of it all. Paul and Michelle were just about our ages when we saw the movie- so very easy to identify with!! It is wonderful to hear that Sean is doing well, I am also in the \"helping professions\" (an RN). I thought his performance was good and very believable. \"Michelle\" came across as very sweet, fragile and vulnerable. I think the main theme is that if they didn't have to deal with the \"real world\" then they could be happy and continue to be in love. How many times have all of us wanted to just have a \"Calgon moment\". If we all had no outside worries and could just deal with our \"basic needs\" it could be somewhat easier. I have a 15 yr old daughter and wouldn't have a problem with her seeing this movie.. Kids see so much worse these days that this is very tame. For those of you who are trying to locate the CD my husband (a huge Elton John fan) was able to get a 2-CD set which came out in 1992. It is called, \"Elton John-rare masters\" Polygram studios. This has all the friends songs as well as many others. As far as we know this is the only CD with the \"Friends\" music. We also had the LP years ago and were thrilled to find the CD. Good luck. I recommend this movie for anyone who loves the \"young love\" theme. I only wish it was on DVD now!!","My girlfriend and I saw this movie when it was originally released. The controversy that surrounded the original release (teen nudity, physical intimacy and unwed pregnancy) were subjects that never touched our view of the film. We were close to the same age as Paul and Michelle and were experiencing many of the same intense and confusing emotions. We were too young to get caught up in the simplistic (at times) acting and the corny (at times) emotional twists. This movie spoke to us in a way that an adult love story never could have. I still remember sitting in the movie theater with my girlfriend and holding her hand while she cried during the tragic (albiet syrupy) final scenes.","I haven't seen this movie since it came out at a drive in theater, and I have been searching for it since. At the time I was 12 and the story excited me; and NOW, the ending eludes me. It was young love that engrossed me the most, not to mention John's vocals and Taupin's lyrics. The story (at the time) hit home to my psyche. I am a lover of sentimental movies and this still hangs in my head after 35 years- it is that good. Place yourself at adolescent age and let your fantasies run. If this movie didn't excite your curiosity, then you were just too old. I look forward to seeing it again (even at my age)! If nostalgia is in your venue, I'm sure this is an interesting movie to see. It's innocence is simply astounding and it's simplicity is so easy and enjoyable.","I saw the movie in 1972, and like other people who have commented on it here ... I went back many more times to see it over and over ... I think 9 times in all. Just great is how I would describe it ... I was taken by the sound track, the beautiful panoramas of the south of France, the life style the kids began on their own. An ideal way to live is what they had set up ... of course the powers that be have to intercede, but when I forget that part I find myself wanting to be in the movie and live like that! So good that it is available on DVD now ... it was not around for years! TLW","I was drawn to \"Friends\" by the soundtrack scored by a very young and yet to be famous Elton John whom I had see in a club in nearby Houston. I had no idea of the emotions and impact the movie would make. Recently I was brought back to the movie by a song that Heart did called \"Seasons\", then I found the Elton John song \"Friends\" thinking it was the same song...it's been 35 years of so. Anyway, the flood of the emotions of \"Friends\" came back like seeing an old photograph of your first real love. I have more recall of the way the movie hit me than I do of the actual details of the production, plot, etc. so forgive me for a rather poor review. I remember taking a couple of special friends on a date to see the movie and them being as moved and teary-eyed at the end as I was. I'm both anxious and nervous to find a copy and see it now. So many movies which seemed so important to me back then (i.e. \"The Graduate\" \"Easy Rider\") now just seem silly and I don't want this to fall into the same category. But, I will find it and if it turns out silly, then at least I'll be able to turn my wife onto a great...no..outstanding soundtrack. When we met, we went through this with \"Last Tango in Paris\". The youngsters I work with (I'm 56) respect my opinions but it's hard to explain the feelings of the sixties and the movies and songs that reflect such strong feelings but seem a little \"aged\" now. I just can't figure out if the the aging process is the movies... or me. \"Friends\" is a very special, sensitive and wonderful movie. It will bring back a lot of special feelings I'm sure. By all means, rent or buy a copy... Indies were not near the strong genre then that they are today.","I can barely even remember what DECADE I saw this film.  It was when I was a teenager, I think (I'm 37 now). I started watching it as a late night movie sometime in the mid to early 80s, and so much of it has stayed with me ever since.  Seeing other comments, I had NO idea it was shown at theatres, or that anyone else even new it existed.  I don't think I've even mentioned the movie to anyone else.But half a lifetime later, I still remember much of the movie that I watched late at night so long ago. I think the innocence of the charactors, their situation, their mutual affection over a long period of time, left a long term imprint for reasons I don't quite understand.  Maybe it is because I was a teenager at the time I saw it, and it touched me somehow..... I really don't know! I also REALLY wanted to know what was going to happen when the after the end of the film happened.  Oh, the agony!!I've not seen it before, or since, but I would love to. I keep a casual look out for it, but I now doubt it will been shown and it seems to have faded into oblivion.  But I'd proberbly miss it in the TV guide even if it DID show up. Pssttt!!!Reading the reviews here has renewed my interest.  If anyone knows of its availability in Australia, by all means email me and let me know.Oh, and Sean Bury... nice to see you make an appearance on the comments here.  I've had a look at your movie history and noticed your last appearance in a James Bond film.  What are you up to these day?  Oh, and do YOU have a copy of the film?   CHEERS!!!","This movie is more than a coming of age film, it is a study of two teenagers and their realization that they really know little about life, but struggle through it to nearly find happiness. I say more than a coming of age film because it looks at the entire subject without apology.  Paul, played by Sean Bury plays a mischievous youth fed up with his fathers wealth and his complete lack of attention to him.  He steals cars, and tries in every way possible to have his father notice him.  This fails, and he meets up with Michelle (Anicee Alvina) who plays a sweet and naive young girl who is sent to her Aunt's home after her parents die.  At her Aunt's home, the Aunt's boyfriend tries to molests her, and she flees.Both teenagers head out to a summer cottage that Michelle's Mom owned and set-up house.  Paul braves the world trying to find a job to feed them while Michelle plays house.  Reality bites as they make their way through many troubles and finally realize they are very on-their-own.This unlikely pair become friends and lovers eventually.  They grow-up on-screen and probably fair better than most out of necessity.A film like friends with a rich backdrop of the French countryside, and sound track supplied by Elton John could not be made today.  Sean (Paul) is 15 and Anicee(Michelle) is 6 months younger, and they make love resulting in her getting pregnant.  This is not kiddie porn, but a serious look at the reality of teen sexuality and what really happens.  The subject is treated tenderly and factually.  Instead of the movie focusing on sex - sex becomes a natural extension of their friendship.  Both are shy and cautious of 'making a mistake,' but their mutual support sees them through. SPOILER ALERT The child is born and Paul finally has a fairly good job, and these two teens are taking life as it comes, and enjoying each others support, friendship and tenderness.While several other endings would have been preferred, the movie ends with Paul's father finding them and taking them both back to the City.The film is not choppy and the actors have great and lousy scenes, but the message is in the context of the movie.  When looked upon in total, it touches your soul.  You feel and root for these two, and wish them the very best.","I saw this movie when it just came out in 1971 ... went to local TCU the college theater that has since been torn down....was with first girlfriend...she 14 , me 16.... same ages as the kids in the movie. Saw Elton John that year in Fort Worth. for some reason yesterday I woke up with this movie stuck in my mind....today Aug. 29, 2014...43 years after....was sad to see Avicee had passed away...the girl I was with, both our first time...we were as naive as the kids in the movie...I last saw her in 1972.....the movie, Elton John, Anacee,and Dee the girl I was with all left memories I will never forget. The actors, the music, the young love plot all hit the nail on the head for 1971..obtimissim Man had just walked on the moon, Woodstock, we in love and with love were going to change the world.","Rating this flick 10 out 10 makes me a person that grew up in the sixties.A flower child,and someone like Paul and Michelle just knew that the real importance in life,was to live and to live was to love. I was 18 years old back then,and although I'm from a big city(São Paulo/Brazil)I watched Friends when I was living in Manaus(north Brazil-the jungle place)and my heart just pounded and almost stopped when I rediscovered this film(I couldn't remember the name either in English or Portuguese),but was throughout Elton Jonh's biog that I came across it and a gentle soul has posted it on youtube.I watched.Ít is still a grand movie. Paul,a British boy living in Paris,meets Michelle,a girl that has just became orphaned.Their social-economical level are as distant as the Earth and the Moon,but it didn't bother them a bit.Young,under age,and they just follow their only option to live.Michelle after trying to live with a stupid cousin,sees that the only thing she has left in this world is a small cottage,owned by her late father,in an idyllic small place,Camargue,in Southern France.It is like there was nothing else,nobody else in that world.Just two of them,starting as friends,companions,but then as lovers.A child is born from that love. The director could express the sixties with vivid colors and it is funny because there are neither riots nor anti war displays,but he superbly shows HOW we felt back then.We were pure and innocent and believed in social justice and love, above all.Make love,not war. The scenery is beautiful:the wild horses,the sea,the whole environment,and the youngsters that portrayed Paul and Michelle did a good job!The scene when Michelle is at the cemetery putting flowers to her father(I believe!)is somewhat strong.SHE,really made me believe,in that moment,how alone,how the solitude was present in her life. The Brazilian culture is over sensual,(probably because we are in the tropics)so their nudity didn't matter,and them being under age,is part of the concept THEN,when we didn't talk(or knew,or mattered about children'molestation,that by the way,DOES NOT OCCUR !) \"Paul!\" \"Michelle!\"(they calling each other was printed in my soul!) This film is NOT intended for greedy souls. NOT FOR THE GREEDY!","I'm not a huge Elton fan but in this case, the soundtrack really helped transport me in time to this sweet love story set in the Camargue, France in the early 1970's. It's hard to imagine now that this would have been a hugely controversial movie when it was released about two underage runaways who set up house in a remote area and learn about love and life. It just shows that love and a strong bond between two people can conquer all. Or at least it could back then before tax and electricity bills blah blah. So if you're prepared to suspend reality for a few hours and just feel hopeful for these two young lovers then you will enjoy this sweet, simple and beautiful film as much as I did. Incidentally, I went to the Camargue about 5 years ago and it remains unchanged in it's charm so for me this was a nice reminder too that there are places that exist on this earth which are unruined and rustic.","i really love this movie , i saw it for the first time when i was working a video store. when i went to buy it they told me it was out of print and i couldn't order it so i just today thought i would look. and then i found it they put it out in Spain on DVD under the name \"Algo Mas Que Amigos\" and you can buy there it is in English and Spanish on the DVD....hope this helps ..... i know how hard it is to find movies that we love that they haven't Released to The U.S Market. best of luck..oh For more info here is one place to look.... HTTP://www.zonadvd.com i think it going for 10 dollars usd on eBay as well.","I saw the movie \"Friends\" in the spring of 1971 in Indianapolis. A local radio station gave away free tickets ( I think) and thought what the hell. The early seventies in Indy were kind of like the late sixties on the west coast so we were kind of going thru our hippie/love stage which was more a state of mind than anything else. Anyway the movie was appropriate for the times and I was pleasantly surprised how it just seemed to feel right at the time. Have not seen it since but can remember it like it was yesterday...that was more than 41 years ago!! Hopefully it will show up on the tube on some oldies station late a night and make me feel young again. A great low-budget movie that was right for the time. The title song and soundtrack was Elton John at his best!!!","Great Movie! The sound track is awesome! Very relaxing sound. Elton was ahead of his own time even back in 1971. Lewis Gilbert did a magnificent job producing and directing this film! The movie was romantic and a breath of fresh air. The sound tracks written by Sir Elton complimented the movie to a T. Rex Morris does a great job with the tenor sax on the song \"Honey Roll\" and poem \"I Meant To Do My Work Today\" by Richard Le Gallienne was incredible! Kudos to everyone involved with this fantastic film! It was no surprise that a lot of the people involved with this movie went on to become the best in their field.","This film grabbed me right from its start, where a sweet-looking teen-aged girl is shown visiting a grave alone, then Elton John's powerful song \"Friends\" starts playing while she's shown walking alone through the streets of Paris, carrying a suitcase, naively unaware of the car theft and prostitution going on around her. The entire film is a beautiful, dreamy, romantic collection of scenes of young love, holding hands, living in the country, wild horses running around freely, fields of wildflowers, sunsets, toasts of wine, evenings by the fireside, having fun, and general innocence, all set to romantic music by Elton John. It's magical.Somehow I missed seeing this film when I was growing up. I'm sure it would have left a strong impression on me if I had seen it then. I remember the radio advertisement for the movie in 1971, talking about how it was a special movie with music by Elton John, and with the chorus of the theme song \"Friends\" playing in the ad (\"Makin' friends for the world to see...\"), but I never heard anything else about it in those days, and never got to see it until I rented it 35 years later from a video store. By then it had been edited, censored, and all kinds of unhappy people with angry political agendas were using all kinds of ugly words to describe the film. What can I say? The world has gone insane since then.The story is that a 14-year-old girl is forced to move in with her cousin in Paris after both her parents die. (It was their grave she was visiting in the opening scene.) One day while visiting the zoo alone she meets a 15-year-old boy, they hit it off, and agree to meet the next day. The next day while riding together the boy accidentally drives his car into a lake in a freakish solo car accident. It was his father's car, he can't bear to go back home to face his father's wrath, so the two teenagers begin living in the French countryside together, with the mutual background that they both hated their lives at home. They settle into an unoccupied cottage, the boy takes odd jobs to support themselves, their supposed friendship turns into romance, the girl becomes pregnant, and they successfully have a baby at home. All the while the boy's father has the police attempting to locate his missing son. On the 1-year anniversary of the couple's flight together, the police finally locate the boy's employer by an in-person inquiry, and are told they can see the boy the next morning when he comes to work. The next morning the boy is shown leaving his cottage to go to work, saying a sweet farewell to his girlfriend/wife, and happily doing cartwheels as the scene freezes on his girlfriend waving goodbye. At least that's how the video version I saw ends. It's an unexpected though well-timed ending, presumably depicting the last moments of bliss before the boy is taken back to his parents' home and his happy life with his wife and baby is shattered.As beautiful as the story and images are, the plot is awfully unrealistic and highly contrived. I think it's better just to enjoy the movie as a young person's dream-come-true fantasy and to go no further in analysis, because all logic and believability quickly fall apart when the story is examined in more depth. Why would a fully furnished and stocked cottage be left unattended with the door unlocked and unvisited for a full year? What did they plan to do when the owners returned? Why would a girl trust a car thief enough to get pregnant from him? Didn't they think it was unethical to use other people's homes and food? How could they ever hope to get needed dental care or other emergency medical attention while living outside of society? How could the boy have a car accident on a country road with no collision and no other cars around? Where are there places anywhere near civilization where wild horses run free? How is it that a teenage male would not have sex as the primary thing on his mind when he picks up a girl at a zoo? (The Elton John song lyrics just don't fit.) Why would they take off clothes when sleeping outside at night when it's about to get cold? And so on. The scenes of wild horses are contrived to appeal to girls, as is the unrealistic theme of \"friendship before romance,\" and all the back-washing and tickling scenes with their predictable outcomes, the running through flower fields towards each other, the haze filters, the scenes shot through wildflowers in the foreground, the baby ducks, and so on. It works, but it's definitely contrived.Still, this is a movie about youth and freedom, and that ideal hasn't changed since the 1970s. Young people today are still treated as belongings or as lost pets to be recovered by the police instead of treated as mature human beings who have the same needs of romantic love and freedom as does the adult world, and the ability to be responsible when given that freedom. Therefore the message is universal. It's clear why a sequel wouldn't work: this story is about a magical, year-long reprieve from the real world. Such a situation could never have been extended indefinitely, assuming that it could even happen in the first place, and a story about real life afterward would lack the magical appeal of such an unreal state of existence. I really hope that no teenagers took the film seriously enough to try such a foolish stunt. But I hope equally well that teenagers who were impressed by this film in the '70s learned something from it, and have since then made attempts to make such a magical world a more attainable reality for others, instead of perpetuating society's various hatreds and repressions, especially on their own children."],"review-user":["mbarton-5","Jigglypoof","desertheat60","jeffandsarah-1","Pookyiscute","gga","pauls-room","santiagoz27","PaulMichael","heckles","harrytrue","axprodmaster","vegasohvegas","patgauldin","tlweschler","Randyo2","mybah","pmh-3","twill9898","english-express","hjt15","celtic_rose_rk-1","richielouispaulm","mike-peterson-2","simnia-1"],"review-date":["18 March 2005","17 September 1999","20 May 2004","23 March 2005","13 February 2005","29 March 2000","27 May 2005","27 April 2007","11 December 2003","6 July 1999","9 October 2005","30 December 2006","29 September 2006","27 July 2006","28 April 2006","25 January 2006","10 July 2003","12 November 2000","29 August 2014","24 February 2011","2 February 2017","15 May 2008","30 June 2012","28 May 2006","18 May 2006"],"review-rating":["10","9","10","10","8","10","8","10","8","7","10","10","8","10","10","7","10","10","9","8"],"review-title":[" It will break your heart\n"," The controversial love story\n"," An Unforgettable Movie....for some reason\n"," memories\n"," Awesome!\n"," \"The blue lagoon\" in modern times\n"," a story of simple innocence\n"," A beautiful summary of romantic love from the 60's\n"," Two teenagers run away to live in the Carmargue and become parents.\n"," Could almost be watched with the sound off\n"," Why Did People Dump on this Movie\n"," friends, the movie\n"," It spoke to us\n"," It has been a while...\n"," A great movie, a great soundtrack.\n"," after so many years........\n"," Still remember this film from 20 years ago\n"," A look at two misplaced teens who survive and thrive because of each others strengths.\n"," great memories from when I was 16, 1971.\n"," When We All Learned to Love\n"," Moving and nostalgic love story\n"," it on DVD not in the u.s.\n"," Great movie for the times\n"," Friend's movie 1971\n"," Beautiful though contrived.\n"]}