{"review-url":["http://www.imdb.com/title/tt0018294/reviews"],"review-text":["Stan Laurel regarded PUTTING PANTS ON PHILIP as the first true' L&H film. THE SECOND HUNDRED YEARS was the first 'official' L&H film, but this was the one where Stan completely resigned himself not only to performing (he had signed on with the Hal Roach Studios as a director and 'gag-man', before certain situations - among them Oliver Hardy's accident with a leg of lamb leading to Stan having to replace him; and the extra money that performing would provide for himself and his new wife, Lois - brought about his historic return to performing, as well as writing, directing, editing and involvement in other areas of production), but also realised the fact that he was part of a team that worked well together. This, therefore, is an historic and very important film in the history of comedy.It is also a surprisingly funny little silent film; rather different from what Laurel & Hardy would become known for and from what they are more immediately associated with today. The characters of 'Stan & Ollie do not appear - Scottish Stan Laurel plays the nephew of Oliver Hardy, a respectable man about town who is reluctant to be seen with this strange-looking fellow with a kilt and the habit of chasing pretty girls. There are some very funny moments in this well-made, charming little movie, and the performances of these two Kings of Comedy are spot-on - watch Stan's little 'scissor-kick' and smile that says, \"Well waddaya know?\" when he sees girls, or the hair-ruffling scene at the airport, for instance. Hilarious.Watch this film if you can, with backing music from The Beau Hunks Orchestra (available on the VVL video releases) which enhances the 1920s feel and is very, very pleasant to listen to. It's a brilliant and underrated little film, which is why I said it was 'surprisingly' funny.","This is a pretty funny entry in the silent canon of Laurel and Hardy films. This movie is particularly noteworthy for having perhaps the most risqué of all L&H gags. Stan, a Scotsman, wearing a kilt, loses his underwear. A blast of air from a grated vent raises his kilt. It is clear from the reaction of the crowd, including fainting women, that Stan's manhood has been exposed! One of the oddest moments in all of silent comedy has to be the scene in which a tailor attempts to measure Stan's inseam, so that he, Stan, can be provided with a pair of pants. The virginal Stan is terrified as the tailor repeatedly attempts to place the tape measure up near Stan's, er, manhood, but fails, because Stan, in his infinite shyness, keeps jumping away. Finally, Ollie takes over, and after chasing Stan into the dressing room, presumably succeeds in taking the measurement off-camera; Ollie then emerges from the dressing room, disheveled but successful.Now the truly bizarre part: Stan slowly emerges next from the dressing room, and it is completely clear that his reaction to the ordeal is meant to be that of one who has been raped; the horror on his face is unmistakable. Within 15 seconds he goes through the several stages of survival: devastation, followed by anger and resentment, and finally uncontrollable grief.Perhaps the funniest thing about this movie is a repeated gag, in which every time Stan escapes Ollie's presence, he apparently causes such a scene that 100's of people immediately flock from all directions to see what has happened. That such an immense number of people would repeatedly fly from everywhere to converge on a single point when they could not possibly have any idea what has happened is quite funny.A very entertaining 19 minutes of Laurel and Hardy, made in the days before they were officially teamed up as the pals we remember them to be.","Although the slight premise limits what it can do, this earlier Laurel and Hardy comedy has some very funny moments. The whole feature depends on just a couple of very simple comedy ideas, but Stan and Ollie are able to get good laughs out of lesser material than that. The goofy nature of the material would probably have led to a flop with most other performers, so this feature really depends on its stars to make it work.Laurel plays a young Scot coming to the USA, wearing a kilt and bringing an overly enthusiastic eye for women, while Hardy plays his unfortunate uncle who has to keep an eye on him. Laurel successfully fits his style in with the premise, blending his familiar screen persona with that of a red-blooded Scot. Hardy has to play the straight man for much of the movie, but his expressions in the part work well, and he also gets a couple of chances to take the spotlight for himself.The comedy writing in this one is, honestly, not that great. After a while, it just keeps coming back to the same couple of gags, and only the lively presence and fine comic timing of the two stars makes it work. But it still offers some good laughs that make it worth seeing.","The first \"official\" Laurel and Hardy movie is not like the ones with which we're more familiar. In this case, Laurel is a man from Scotland and Hardy is his uncle greeting him in the US. To be certain, Stan wears a kilt and tam, while Hardy wears a porkpie hat (like Buster Keaton wore). A couple of the scenes in \"Putting Pants on Philip\" were probably risqué for the time (a couple of them predict Marilyn Monroe's most famous stunt).Basically, Stan and Ollie were just beginning as a team, so they hadn't yet figured out a style. Nevertheless, the end gag is funny enough. Mostly worth seeing as a historical note.","\"Putting Pants on Philip\" is a 19-minute black-and-white short film from almost 90 years ago. This silent film is from the earlier days of Laurel and Hardy's collaboration as a comedy duo. It is not too often that they play relatives, but here Hardy is the one who takes care of his nephew Stan's weak taste in clothing. Yeah, overall i must say this one did not feel really that clever or interesting and I have seen many funnier works from the duo, also from the same year already. I do not recommend checking this one out and I am actually glad it was that short as I did not find it memorable at all. If you plan on taking a dive into the duo's filmography I encourage you, but do not start with this one here. Thumbs down.","Stan Laurel and Oliver Hardy were comedic geniuses, individually and together, and their partnership was deservedly iconic and one of the best there was. They left behind a large body of work, a vast majority of it being entertaining to classic comedy, at their best they were hilarious and their best efforts were great examples of how to do comedy without being juvenile or distasteful.'Putting Pants on Phillip' is nowhere near classic Laurel and Hardy, later films, short and feature, had stronger chemistry when fully formed and used their considerable talents better. At this point, Laurel was much funnier and more interesting while Hardy in most of the previous outings had too little to do. 'Putting Pants on Phillip' is still worth watching and is an improvement on some of their previous short films, to me it's easily one of their best at this point of their careers and one of the first to feel like a Laurel and Hardy short rather than a short featuring them.Personally would have liked more sly wit that made their later entries better, though the slapstick does entertain and is timed well if a bit too far on the simplicity.The story is a bit busy at times and both slight and formulaic. Laurel however is very funny, and sometimes hilarious. Hardy is at least not wasted, and he does give one of his funniest and most interesting appearances of his pairings with Laurel up to this point and has much more to do in comparison to their previous outings. The chemistry is certainly much more here than in previous outings of theirs, namely because there's more of them together, if still evolving. Support is nice.A good deal of the humour is well timed, hugely energetic and very funny, with everything going at a lively pace, and there is a lot of charm and good nature to keep one going, as well as a surprising bizarre one that doesn't feel too much. 'Putting Pants on Phillip' looks quite good still.To conclude, decent and far from pants. 7/10 Bethany Cox","So the first thing I thought of watching the picture - did Billy Wilder get the idea for the skirt gimmick in \"The Seven Year Itch\" from watching this Laurel and Hardy film short? I wouldn't be surprised, but fortunately he didn't carry it as far as the director did here, can you imagine? I thought that was a pretty risqué idea to offer movie viewers of the day - Stan, or in this case Philip, with nothing on underneath his kilt! No wonder all those women fainted dead away.The opening title card states that this is a story of a Scotch lad who came to America for a Columbian half dollar that his grandfather lost in 1893. Once things got going though, we never heard another word about it. It doesn't matter, the boys make it entertaining enough in this early team up of theirs, although a couple of the bits seemed over done, like Philip's argument with the ship's doctor (Sam Lufkin) and the extended measuring tape scene. I guess once they had an idea back in the day they milked it as much as they could.Getting back to Stan/Philip's underwear, did you notice this? When he set down the kilt for the young lady to cross the street, the shorts he was wearing were longer than the ones he started out with! I also noticed that the Hal Roach crew liked to recycle their story ideas from picture to picture. This is the third time I've seen Ollie (as J. Piedmont Mumblethunder) fall into a water filled hole stepping off a street curb. The other two times were in \"Habeas Corpus\" (1928) and \"Angora Love\" (1929). If it got a laugh once, why not do it again.I caught this on Turner Classics the other day, and host Ben Mankiewicz mentioned that the Culver Hotel, noticeable in the story, is still there today. It's located in a section of central Los Angeles called Culver City, which at the time of filming wasn't very far from both the Hal Roach Studios and MGM.","Stan (Philip) arrives from Scotland wearing his kilt. After much circumstance Ollie (J. Piedmont Mumblethunder) gets him to a Taylor. On the way there the two of them take some minor detours. This one does not have all usual Hal Roach staff and is actually done by MGM. Even though Hal Roach is producing it, the studio is different which gives it a different feel than other L&H short subjects.While this is okay, the plot is rather simplistic. Still, it is great to see one of movies great comedy teams go through the paces. The Taylor has one heck of a time with Philip getting his suit made. It has plenty of physical comedy.","I'll not question the authoritative voice of Stan Laurel who says he considers this the first official Laurel and Hardy film. They were both separate players signed to Hal Roach contracts when Roach decided to team them. The idea was genius, but the separate contracts would cause some problems for the team and for Roach about a dozen years later.But for now Putting The Pants On Philip has a bit of an unusual situation for the guys. Hardy is an older middle aged man and Laurel his nephew come over from Scotland. Being a true Scot Stan wears proudly the tartan kilts of his clan and he has a libido in this that Harpo Marx would envy. Keep him away chasing girls says his mother to her brother Ollie.But a Scot in kilts is catnip to those flapper girls of the 20s and Ollie sees his duty, he has to get the nephew into pants so he won't be so conspicuous.Most of the humor revolves around the mystery of whether the Scot wears undergarments with his kilt. In Laurel's case he does and he doesn't.The last bit was something I think Stan might have heard about involving that famous story of Sir Walter Raleigh and his cape. Ollie climaxes the film with an unexpected surprise there. One of the great sight gags that so typified Stan and Ollie's work.","This is a very well-crafted short, but I've always been mystified as to why anyone, much less Stan Laurel, would consider this to be the first true Laurel & Hardy film. The first film they appeared in was a comedy starring Laurel with Hardy in support, \"The Lucky Dog\" from 1921. The second film they made together at the Hal Roach studio, \"Duck Soup\" (not to be confused with the Marx Brothers film of the same name, nor the Edgar Kennedy short), actually has humor more typical of their mature work. If you can get past the unusual characterizations in \"Philip\" (Stan is a kilted, woman-crazy Scot and Hardy is his American uncle, fearful of being embarrassed lest someone find out he's related to this eccentric young man), the film offers some solid laughs. It's beautifully paced and edited; do try to see this in a theater with an audience, where it really comes to life. The credited director is Clyde Bruckman, known best as a gag writer for Buster Keaton (and later Harold Lloyd, and still later, The Three Stooges). He only made 20 films as a director, but they include Keaton's \"The General,\" Laurel & Hardy's \"The Battle of the Century,\" Harold Lloyd's \"Movie Crazy\" and W.C. Fields' \"The Man on the Flying Trapeze,\" each of these titles being among the best films their respective stars ever made. Producer Hal Roach was particularly fond of \"Putting Pants on Philip,\" incidentally.","I really can't fault this movie too much for being a rather sub-par Laurel and Hardy short. After all, the team still wasn't exactly a team. Despite starring in quite a few films together in 1927, they were still a brand new pairing and the chemistry we all have come to expect still hadn't developed completely. In light of this, it's not surprising then that Ollie and Stan are playing such unusual roles.In this case, they are NOT friends nor do they know each other when the film begins--a highly unusual situation for any of their films. Plus, Ollie appears to be a successful man--a big departure from his usual role and Stanley a nephew visiting from Scotland. Talk about a different Laurel and Hardy plot!! The rest of the film concerns the hilarity (?) that occurs when Ollie takes his kilted nephew through the city. Again and again, huge crowds gather to laugh at the sight of a guy in a kilt. While as an American I do find the idea of a man in essentially a skirt funny, it certainly was not as funny as the film tried to make it seem and was certainly not enough to sustain an entire comedy short! Now there were some funny moments here and there, but laughing at a kilt and laughing as Stanley chased women (much like Harpo Marx in later films) just isn't that thrilling. As a result of this and the bizarre chemistry, I think this one earns a 6. For devoted fans of the team like myself, it's a must--for most others its a film best not seen until you see their better films, as this one might give you the mistaken impression that their films weren't that funny.","Why is this one loved so much? IMDb has an overall rating of 6.9? The whole joke is based on an ethnic stereotype that Scottish men wear no pants ever, and it's really lame and repetitive. Not only that but Americans are not aware of this and treat Stanley as a drag queen, in the 1920's, without Stanley either getting punched out by the men hovering around or arrested by the cops? This is my least favorite L&H and that includes the ones before where they just appeared together (not as a \"team\") which are mostly very funny. I give it a 4, tops. I guess people are being generous since it's supposedly their first official teaming but that doesn't cut it for me, I'm actually bumping it up one star because of that, my actual feeling is it's a 3 based on their other work up until the end. For L&H completists only.","This is a Laurel & Hardy comedy short with some great and funny moments but overall the movie relies a bit too much on just one comical premise.The comical premise this movie mostly relies on is very simple; Stan Laurel not wearing any pants. Laurel plays a Scottish naive young person who arrives in America in full kilt. For some reason he gets the center of attention because of this and his uncle played by Oliver Hardy thinks because of this that its time to put some pants on Philip.Its humor is well executed but the main premise also gets a bit tiresome after a while. Although the movie definitely still has its comical great moments, it at the same time is also far from the best of the many Laurel & Hardy comedy shorts that are still around. The movie is simply too simple to be considered one of the greatest, although it definitely is most fine executed all, for most part.Great good clean fun, just nothing too remarkable or memorable all.7/10http://bobafett1138.blogspot.com/","Stan Laurel and Oliver Hardy are the most famous comedy duo in history, and deservedly so, so I am happy to see any of their films. It is 1893, and J. Piedmont Mumblethunder (Hardy) is meeting his Scottish nephew Philip (Laurel), wearing a kilt, at the port, with a note from someone, saying to make him feel welcome, and guard him well. After having a physical examination (mouth, heart-rate, temperature, coughing, head lice), which Piedmont watches laughing, he only stops when he realises he is Philip. They sit down for a moment, and Piedmont asks Philip what he's interested, he answers \"wimmen\", jumping, kicking and chasing at the sight of them. They start walking, Piedmont wants to Philip to be behind at a distant, and a confused crowd follow and stop when Piedmont instructs. They stop and have the crowd, plus a police officer (Charles A. Bachman), laughing at Philip, as he jumps and kicks following the woman (Dorothy Coburn), and having that same crowd gather round him, with Piedmont having to pull him out. They keep walking, and Philip has his kilt blown up by the subway grating, and when he sneezes making his pants fall down, women faint at the sight of what;s underneath. After getting out of another crowd, Piedmont takes Philip to go and get measured for some pants/trousers, and obviously this isn't happening quickly with Philip fidgeting. When he eventually gets his size, Philip escapes from the curtained fitting room out the window, seeing that woman again, and Piedmont gets him out of another crowd outside. They then get onto an open top bus, and when Philip jumps and kicks to chase after the woman again, another man in the same Scottus clothes delays Piedmont from going after him again. Eventually Piedmont says he will help Philip meet the woman, only to get a flick on the nose from her, so Philip tries his luck. He helps her walk (well, jump) across a puddle placing his kilt over it, she walks away, jumping and kicking like him, and Piedmont walks over the kilt covered puddle, plunging in and soaked. Filled with good slapstick and all classic comedy you want from a black and white film, it is an enjoyable silent film. Stan Laurel and Oliver Hardy were number 7 on The Comedians' Comedian. Worth watching!","This is one of L&H's shorts most frequently cited as the first \"real\" L&H teaming and perhaps one of their best silent features. J. Piedmont Mumblethunder (Ollie) is a millionaire who has come to the docks to greet his nephew Philip, whom he's never seen. At first Ollie is laughing it up with everyone when this strange little man unboards and draws a great deal of attention to himself by the way he's behaving during his medical exam, but is quite humiliated when it turns out that this is the fellow he's supposed to be greeting. He has been told that Philip is a good boy, but he has one weakness--women. Mumblethunder and Philip set off to go home, but their journey there is continually interrupted by Philip breaking into a little dance every time he sees a woman, then chasing after the woman. Huge crowds gather each time this happens, not so much because he's chasing skirts, but because Philip himself is also wearing a skirt (a kilt). Finally Mumblethunder manages to drag Philip into a tailor's shop to be measured for a proper pair of pants, but Philip escapes from there as well to chase more skirts. There are lots of laughs all around. It's also nice to see a short like this because the boys aren't exactly the characters we know and love. Ollie is pretty much his usual character, but it's such a joy to see Stan acting so differently from his usual man-child character. It shows he wasn't a one-trick pony and excelled in other types of roles when he got the chance. With a run time of 19 minutes its short and sweet, providing classic one liners which still have me in stitches.","Putting Pants on Philip (1927) *** (out of 4) This silent film was the second teaming of Laurel and Hardy and according to Laurel this was the film that let him know that the duo was born and would be able to make magic together. In the film Hardy plays an American who is highly respected and dignified in his town. He receive a letter telling him to pick up his nephew (Laurel) at the dock and when he gets there he's shocked to see him dressed in a kilt. Not only is he dressed in a kilt but he also doesn't know how to act when he sees pretty women. This is a pretty good short and certainly a lot better than the duo's first movie. The movie has plenty of funny scenes but the highlight has to be Laurel's silly jump whenever he spots someone he's attracted to. He does this jump at least ten times in the film and I laughed at each and every one of them. The two's comic timing together is also worth noting as it's obvious the two are learning to work next to one another. Other funny moments include a pre-Marylin Monroe sequence where Laurel walks over some vents, which raises his kilt up for everyone to see what's underneath."],"review-user":["andy stew","audiemurph","Snow Leopard","lee_eisenberg","Horst_In_Translation","TheLittleSongbird","classicsoncall","DKosty123","bkoganbing","forwardintothepast","MartinHafer","verbusen","Boba_Fett1138","jboothmillard","HollyJ87","Michael_Elliott"],"review-date":["21 July 2001","9 November 2011","28 February 2006","10 April 2017","24 March 2016","9 August 2018","17 March 2016","14 March 2016","13 March 2016","22 September 2011","4 May 2008","19 April 2015","6 September 2006","21 September 2009","13 February 2009","10 August 2008"],"review-rating":["9","6","4","7","6","6","7","6","4","7","5","7"],"review-title":[" A very funny little film\n"," A funny silent, with a couple of extremely bizarre gags\n"," Has Some Very Funny Moments\n"," Stan and Ollie become a team\n"," Utterly forgettable\n"," The tailor's new pants\n"," \"I never wore a set of pants in my life\".\n"," Stan Gets Taylored\n"," The clan tartan shall not be besmirched\n"," Very entertaining but highly unusual for L&H\n"," Watchable, but so atypical of later Laurel and Hardy films\n"," My Least Favorite L&H Short\n"," Has some great moments but overall is a bit too simple movie.\n"," Putting Pants on Philip\n"," Fun For All\n"," Good Film\n"]}