{"review-url":["http://www.imdb.com/title/tt0073906/reviews"],"review-text":["'The Wind and the Lion' is, simply put, one of the greatest adventure films ever made, a classic that helped break the 'James Bond' stereotype for Sean Connery, solidified Brian Keith's reputation as one of America's finest character actors, and gave action-oriented director John Milius his most 'audience-friendly' success. It is a sweeping epic in the tradition of 'Lawrence of Arabia', without the earlier film's subtexts of megalomania and sexual ambiguity. Here, the personalities are clearly defined; they start off on opposing sides, but through the nobility of their characters, their unspoken codes of honor, and a sense of old-fashioned chivalry in a modern world of betrayal and greed, by the film's climax, they become allies against a greater evil. \nSome critics attempted to link Theodore Roosevelt's world view in the film to the eventual U.S. debacle in Vietnam. That is unfair to both the film, and to Milius, who, if anything, admires and respects the 'big stick' idealism and machismo of our only true 'cowboy' President. (This respect led the director to film the excellent 'The Rough Riders', twenty-four years later, for TNT). Rest assured, 'The Wind and the Lion' is NOT a boring political treatise!\nThe setting is Morocco in 1904, where an American woman (Candice Bergen, in perhaps her best screen performance), and her two children are kidnapped by 'the last of the Barbary Pirates' Sean Connery and his large band of followers, who are seeking restitution for a long political imprisonment by his family. In Washington, dynamic young President Teddy Roosevelt (brilliantly portrayed by Brian Keith) uses the incident to send in American marines, both to rescue the family, and influence the country's politics (much to the chagrin of Secretary of State John Huston!) Privately, Roosevelt admires the Arab's courage and honor, and wishes the two could face off in a duel to resolve matters.\nAs her captivity continues, Bergen learns that the real villain is not Connery, who is truly the 'Chosen' leader of his people, but those who imprisoned him. The Americans discover this, too, as they see alliances being forged between the usurpers and greedy European powers, particularly Germany. Ultimately, this leads to a rip-roaring battle between the two forces, full of unforgettable images (Connery on horseback, at full gallop, snatching up a rifle offered by Bergen's son, is one of the great moments in film history!), as the film reaches a VERY satisfying conclusion.\nThere are many wonderful aspects to this film, and Jerry Goldsmith's rousing score must be singled out; it is one of the finest of his long career, ranking with his soundtracks for 'Star Trek: The Motion Picture', and 'Patton'.\n'The Wind and the Lion' is the kind of epic adventure \"they don't make anymore\". Happily, John Milius has proven that cliche wrong. This film is ABSOLUTELY essential in any Connery or action film collection. I HIGHLY recommend it!","After reviewing others' comments I have to say that I agree with most of them, even to some degree with some of the seemingly disparaging ones. In that regard, however, I would have to say to those disappointed with the film because of the considerable liberties it takes with the historical facts that they should bear in mind that this film is clearly intended as a pure adventure story with only enough depth to get the audience emotionally involved (which may explain its undercurrent of political satire so suggestive of the immediate post-Vietnam era in which it was made and released), and could never have been intended as a theatrical representation of historical fact. I'm inclined to doubt you can do both successfully in the same film, at least not without losing a lot of the breezy, lighthearted simplicity that makes the adventure movie what it is in the first place. I think adventure movies deliberately ignore deeper issues raised by the events they treat that could be expected to lead to emotional conflict in the minds of the audience.  Thus, in the typical adventure movie there are well-defined good guys and bad guys and motivations and justifications are crystal-clear. On the other hand, real history is full of ambiguities and complexities which raise deeper issues and conflicting feelings in the audience's consciousness, leading to an essentially heavier, more deeply dramatic treatment. Thus, if the producer had tried to make the plot of this film completely accurate he would have wound up with more of a drama than an adventure film, and you would have had a completely different kind of movie all together. Consequently, criticizing this film for not dealing with the deeper issues behind the Morocco crisis of 1904 is like criticizing *Raiders of the Lost Ark* for not treating the evils of Nazism more seriously than it did.  *The Wind & the Lion* is like *Raiders*, not *Schindler's List*.\nMoreover, even apart from the numerous variances from actual history found in the plot (they even moved the date of the event several months to bring it closer to the presidential election), I have to wonder how accurately it portrays Berber culture or even Theodore Roosevelt (whose portrait hangs on the wall directly above my computer monitor while I write this and about and even by whom I have many books including a complete set of his papers, as edited), however entertaining and appealing they may appear in the film. Nevertheless, because of their interesting and sympathetic treatment, this remains one of my favorite movies.  So, if these matters still trouble you when you watch the movie, do what I find comes more or less automatically to me and try thinking of it as basically pure fiction and you should like it just fine.Having said that, though, one of the best things about this film is that irrespective of what the writers or director did with it to make a lighthearted adventure story, other departments seemingly spared no pains in making it every bit as believable, if not actually accurate, as possible. First, I would bet money that the extras in the scene where the Marines land and storm the palace were real Unites States Marines specifically recruited for the part - note the haircuts, the prolonged double-timing in heavy uniforms, the fact that everybody stays in step, the shouted close-order drill commands, and just their general bearing or attitude (if you've ever spent time with Marines or seen one of their little public relations demonstrations at a Marine Corps base you'll know what I mean). Second, Steve Kanally got into his part in a serious way, portraying a practically flawless Marine Corps \"recruiting poster\" company commander - this is exactly the way the Marine Corps wants its people to come across when they are showing off for the public. Third, in the scene in the U.S. consul's office Steve Kanally historically accurately relates that he has \"two 'reinforced' rifle companies\" with which to seize the palace, and his statement is realized in deed when the Marines land on the wharf, as well as when they finally reach the palace, because you will see that not only are Marines present but also U.S. Navy sailors backing them up - i.e., two rifle companies reinforced with sailors from whatever ships that landed them.\nSuch leads me to the detail that is my favorite because it is so subtle that it is hard to imagine much more than literally a handful of viewers among the thousands who would see this film ever being likely to appreciate it. In the book *American Naval History - An Illustrated Chronology* (published some years after the film was made) naval historian Jack Sweetman relates that in the actual event the Marines were landed from the cruiser USS BROOKLYN.  When you see the Marines landing in the film you will note a very antique-looking steamship looming prominently in the background. This is obviously a matte painting inserted using special effects techniques because probably the only ship still existing in the world that looks anything like that is a stationary floating museum, the cruiser USS OLYMPIA of Spanish-American War fame, and it would not be available unless the producer was willing to shoot that scene in downtown Philadelphia. More to the point, consideration of the depiction by anyone with a relevant photograph or two and basic sensitization to ship identification issues reveals that the ship pictured isn't the OLYMPIA. There are not many books easy to find these days that would help you identify the ship (I know of only two), but if you were to make the effort you would be rewarded with an unmistakable solution. The raised fo'c's'l', three very tall stacks, turret locations, and sweep of the stern unambiguously identify this vessel as just one ship and one ship only, and by now I shouldn't have to tell you its name, but of course it is the BROOKLYN. My hat's still off to the Art Department for taking that much trouble to get something so easy to disregard so right.Anyway, this film which has just about everything this writer could want in an adventure movie: not only Theodore Roosevelt and a lot of Marines at their most virile kick-butt best, but expansive Americanism at its optimistic best (\"we have men who can do anything - we have men who can FLY\"), Sean Connery as a highly appealing charismatic leader (who at one point very plausibly takes out about ten scum-bucket thug types with aplomb John Wayne could envy), a long cavalry sequence with seemingly hundreds of riders culminating in a good old-fashioned saber charge, a \"kid\" angle (which reminds you how to look at this thing, if you ask me), a certain amount of witty repartee, healthy doses of chivalry throughout, a romantic aspect that is not wholly gratuitous, and not the least, a very feminine and attractive heroine with enough Yankee grit and determination to satisfy Katharine Hepburn.  Rent it, buy it, watch it!","A glorious adventure film, from the time when men were real men, women were real women, and American presidents were still hunting bears in Alaska instead of the oval office.John Milius makes here the kind of macho film he really likes: we have bravado, honour, and charisma aplenty.  The performances are excellent, as are the cinematography and the music.  No deep messages here, but excellent entertainment all around.  Film academies tend to ignore pictures like this in their award ceremonies but it is the kind of film that will stand the test of time.","A movie I've seen and enjoyed possibly more than any other movie. I first saw it as a kid and loved the drama and the great climactic battle. As I got older, I enjoyed it as much or more than before, but now due to all of the components that work together to make a true classic. The acting is great (especially Keith as T. Roosevelt), the cinematography spectacular, the script is full of gems, and the directing pulls it all together wonderfully. It's loosely based on an actual event, and it shows rush of Europe and a newly emergent America to carve up the 'Sick old Man' (the Ottoman Empire) as it collapses in a fashion unlike any other 'historical' movie I've seen. Humor, drama, action, love...it's got it all and deserves far more acclaim (much like 'The Great Waldo Pepper').","We usually think of the British as the experts at rendering great adventure from the Imperial age, with the likes of The Four Feathers (1939) and Zulu, simply because the Imperial age was, for the most part, British.  Here, in The Wind and the Lion, we see a wonderful rendering of America's own Imperial age.America's projection of power under Teddy Roosevelt is the backdrop for this conventional tale of the kidnapped damsel who, despite her gentility, is smitten by the rough, manly nobility of her captor, who in turn is disarmed by her beauty and scorn. (Politically correct prigs eager to see some slight of \"native\" peoples or cultures can rest assured, that the way Arabs and Muslims are depicted here is far more flattering than the way their modern counterparts depict themselves on the current world stage.)  What makes this story different are the terrific production values - faultless photography, composition and editing - the terrific casting - the underappreciated Brian Keith playing a bully Teddy - and vivid history.Though The Wind and the Lion is told largely through the eyes of the son, every member of the family can identify with one of the characters, whether it be Sean Connery's noble brigand, Candace Bergen's feisty heroine, John Huston's wily John Hay or Steve Kanaly's spiffy, radiant, ruthless can-do lieutenant, Roosevelt's \"Big Stick\".  There is a transcendent scene at the end, when the little boy is symbolically swept away by the dashing Moor on his white steed.  This is high adventure at its best.","Lovely Candace Bergen as the widow Perdicaris are kidnapped and held for ransom by the Sheik Raisuli played by one dashing Sean Connery. The incident comes during 1904 as Theodore Roosevelt runs for election to the presidency in his own right. Needing a good example to show off the muscular foreign policy of the United States, Brian Keith as Roosevelt issues a stunning declaration to the Sultan of Morocco, \"Perdicaris alive or Raisuli dead.\"But in this adaptation of that incident the famous declaration is the only true thing about this story. The Perdicaris in question was in reality one Ion Perdicaris who was a Greek immigrant and dilettante playboy. In fact Perdicaris gave up his American citizenship years ago and was back as a Greek national. Never mind that though, his predicament was serviceable enough at the time.The damsel in distress makes better screen material though so it's a widow woman and her two kids that are in harm's way here. Of course as presented here the incident is also used by some of our European powers to get their foothold into Morocco. The intrigues get far beyond one brigand's demand for ransom.The Wind and the Lion is hardly history. But it is an enjoyable film and Sean Connery is always fun to watch. Brian Keith also fits my conception of Theodore Roosevelt and the scenes in the Roosevelt White House do ring true to all the stories told. John Huston plays the ever patient Secretary of State John Hay who Roosevelt had inherited from his predecessor William McKinley.But kids don't use this film to skip reading a history assignment on the Theodore Roosevelt era.","Sean Connery is very good as the Great Raisuli, Lord of the Rif and Defender of the Faithful. This is an adventure movie with Arabs, Germans and the USMC all coming to grips at one point or another. There is also a lot of humor in the interplay among the main and supporting characters. The story is based on the true incident in which a wealthy Greek-American businessman was kidnapped by the Raisuli in the early 1900s. Milius has substituted Candace Bergen and her two children as the victims of the kidnapping, and this opens the story to a lot of literary license.On the other hand, the movie gives Milius the opportunity to remind the viewer of two of the most famous (though mostly forgotten) political quotations of the TR era. Brian Keith (very good as TR) says, \"Pedecaris alive or the Raisuli dead!\"; and John Huston (also good as Sec of State John Hay)asks the Japanese Ambassador at a White House dinner, \"You likee knifee, you likee forkee?\"","... Except that the Eden Pedecaris character was in reality a man who didn't have any children with him and that the battle at the end with the United States Marine Corp defeating a German force never happened . So in truth it's not actually a true story plot wise It's very arrogant of Hollywood in general and John Milius in particular to re-write history in this manner because the film is rather accurate in some other ways namely the portrayal of Theodore Roosevelt . Want to know about how the teddy bear came into being ? Watch this film . Roosevelt was a great lover of nature , he was both a hunter and an ecologist and decided that if America wanted to be a major world power then the nation would have to carry a big stick while speaking in a soft voice Roosevelt more than any president in history made America the superpower it is today and it's a very topical film to watch in 2004 . America's resentment of Germany and France ! Arabs slaughtering infidels on the battlefield but taking a moral high ground about women and children being held as hostage ! American military leaders and diplomats not really caring if they start a bloody war ! The more things change the more they stay the same It is interesting to see that Milius has painted the Arabs with very human faces . Mulay might be a brigand but he's a most likable anti hero and a cinema audience has the rare opportunity of seeing what Sean Connery is capable of when he's given a good role . I wonder though how this film would have the Arabs if it'd have been made a few years later after the Iranian revolution ? I've got a feeling it would never have been made at all in todays current climate As it stands THE WIND AND THE LION is very poor history in most parts , fairly good history in some parts and stands as a sort of timepiece when Hollywood was far less xenophobic than it is today","One of the best 'guy' movies I've ever seen has to be the Wind and the Lion. Gad, the scenes...Raisouli's bandits swarm over the wall...  A staid British gentleman calmly gets up from tea with Candice Bergen and drops three of them with a Webley revolver in his coat.  A whisper from the ghost of Empire...  Lest we forget!  Lest we forget!U.S. Marines coming ashore from the long, long gone _Brooklyn_.  They were carrying Krags, it should have been Lees, but, oh wow.  And the Winchester 97 blowing large holes in obstreperous natives and even more obstreperous and faithless Europeans...  Raisouli --Sean Connery, o, Wow!--wondering 'What kind of gun does Roosevelt use?\"Teddy Roosevelt--Brian Keith, o, Wow!--wondering \"What kind of gun does Raisouli use?' and writing yet another angry letter to Winchester about the stock on his Winchester 95.Raisouli, armed with but a sword... A Prussian cavalry officer, HOLSTERING his pistol and drawing HIS sword... Honor.  That's something long dead, from a world long gone, but Raisouli would never have flown a plane full of children into a building...Milious at Milious's magnificent best, and now out on DVD.","The Wind and the Lion starts in Tangier in Morocco on October 15 1904 where an American woman named Eden Pedecaris (Candice Bergen) & her two young children Jennifer (Polly Gottesman) & William (Simon Harrison) are kidnapped by the gang of men lead by Moroccan rebel Mulay Hamid El Raisuli (Sean Connery) the Lord of the Rif, Sultan to the Berbers & the last of the Barbary Pirates. Word of the kidnapping gets back to President Theodore Roosevelt (Brain Keith) who decides to use the situation as a show of strength & issues the ultimatum 'Pedecaris alive or Raisuli dead'. As the struggle for power in the Middle East & Morocco wages between the Europeans, the Americans & the Moroccan people Raisuli & Pedercaris become pawns, they become symbols of war & what to fight for or against as the Middle East sees in the beginning of the 20th Century in turbulent fashion...Written & directed by John Milius this historical adventure is loosely based on real events but in essence is a fictional work, whether you like The Wind and the Lion will probably depend on how much you enjoy period adventure films. Of course the fact that the film is partly about an American war against Middle Eastern extremist's who kidnap people & demand a ransom has parallels to what's happening right now in the real world, doesn't it? The character's are well written & likable, it's odd to see Sean Connery play an Arab Sultan but he has great charisma & screen presence although it's rather inevitable that Pedecaris will fall for his roguish behaviour, sense of honour & conviction in his beliefs while it's also just as inevitable that Raisuli will fall for her strength, independence & good looks in the obligatory romance subplot. The film has an uneven pace & tone, it flips between Raisuli, Roosevelt in America, lots of political wrangling & some good old fashioned fighting without a totally clear direction. It's a good film but I just wish it didn't last quite as long & it didn't come to a grinding halt every five minutes for a speech of some sort, whether it's Roosevelt in America talking about Grizzly Bears or Raisuli in Morocco spouting another cryptic proverb. I mean I just think it might have flowed a bit better had it not been so bogged down in politics & philosophising. The Wind and the Lion is good film but I did get bored by it by the end, it is a little predictable & the story could have been a little bit more focused.Director Milius does a fine job here, the film looks wonderful from start to finish with exemplary production design, costumes & locations. A lot of time is spent during The Wind and the Lion setting the scene & really making the viewer feel they are watching something that did indeed take place at the start of the last century. The film can also be quite violent at times, there's plenty of death, shootings, a severed tongue, a couple of executions & some nicely choreographed action scenes. Some people seem to think the horse were abused during the making of The Wind of the Lion, the film has never been released on any home video format here in the UK because the BBFC demanded cuts to several horse falls to which director Milius reacted angrily to & stopped the planned release since all who were involved with the making of it say no animals were hurt at all. To be honest I didn't see anything that concerned me at all.With a supposed budget of about $4,000,000 The Wind and the Lion looks great throughout with top class production values & meticulous attention to detail. Set in Morocco but filmed largely in Spain. The acting is good especially Sean Connery.The Wind and the Lion is a visual treat for anyone who likes their films set in the past, it looks great throughout & there are some nice action scenes but the story doesn't hold up that well & it's far too long for my liking. Good but not great & I doubt I would want to see it again anytime soon.","This is one of my all time favourites. All the actors do a great job. Comparing this movie to \"Lawrence of Arabia\" does no justice to both movies. \"The Wind and the Lion\" levels a much lower budget with fantastic actors portraying heartwarming characters in a heartwarming atmosphere. Action and beautiful pictures are provided as well, which all together guarantees a favourite movie to me.","Average adventure movie that took a serious story and \"Holywoodised\" it.The watering down effect done particularly towards the average script snatched away this movie's place as a would be solid classic. Why water down such a great storyline?Probably because it deals with \"sensitive\" colonial subject matters and the producers do not want to create political heat,just quick profits thank you.The directing,cinematography and soundtrack and acting  was good.The screenplay was average.The charm of Connery made up for his wrong Arabic accent and all the scenes with President T. Roosevelt were masterpiece takes.The costumes/sets here was very good.Too bad we did not get more of a serious historical drama since this is what the story demands.Only for big fans of the lead actors or fans of exotic Romance/Adventure Holywood movies.....","Luscious Candace Bergen as a prim Victorian beauty, kidnapped by Sean Connery as a devilish desert Sheikh! How can you go wrong? How? Oh, let me count the ways!!! Earthy, primitive Sean Connery, exactly the right man to tame a brittle, classy beauty like Candace, is . . . well, underwhelming in the role. That's because, instead of having dialog about the real issues (\"you are a woman . . . I am a man!\") he has to babble nonsense about \"the will of Allah\" and \"the wind blows destiny across the desert sands.\" John Milius, a director known more for the worship of naked male bodies and brute military force than any insight (or interest) in conventional human relationships, has a maddening way of cutting away from his desert lovers every time it looks like Candace might get kissed. Instead of watching nature take its course with two fabulously attractive people in a picturesque landscape, we are treated to endless, (and I do mean ENDLESS) shots of Brian Keith flashing his walrus sized choppers and delivering gritty sermons on the joys of being Teddy Roosevelt. I have nothing against Teddy Roosevelt, but watching him test out his new rifle or make speeches about the heroic death of a big bear just doesn't excite me the way the love story between Candace Bergen and Sean Connery would have . . . if it had ever actually gotten underway! The weird thing is, Milius spends most of his time building up characters and story lines that have no resolution. Candace's two little children in the story both get more screen time than she does. There's no humor, no chemistry, no sizzle, in any of the things that happen to her in the desert. Unless you think it's funny that after weeks of galloping around on horseback her hair is still perfect.The only \"real\" moment in the story is when, late at night, Candace Bergen shakes her little daughter out of a sound sleep on soft cushions and says, \"we must escape.\" The little girl turns over and, without missing a beat, replies, \"but mother, I was sleeping!\" That one line sums up what's really missing from the story. No danger, suspense, or sizzle in the basic story line, of a cultivated lady in captivity. She (and her children) are both so snug and well cared for that it's hard to believe anyone is worked up about their fate.Mind you, if Candace herself had said the line it might have worked better. If the tension came from her enjoyment of her captivity, (or her delight at being in the arms of Sean Connery) and her guilt about all the trouble being caused by her abduction, then the story would have had some tension. But Milius makes the odd assumption that the audience is just as worked up as he is over whether Teddy Roosevelt will get the chance to prove his manhood three thousand miles away. In the end the pretty lady and her children don't seem to matter worth a damn to him . . . and since they're at the center of the story the whole thing seems rather dry and endless . . . like the burning desert sands.","This was my late wife's favorite film.  I'm sorry she did not live long enough to have the video as I'm sure she would have worn it out.  What can we say?  A great romantic story and the push off of two great men, the Raisuli and Teddy Rex.  Sean Connery and Brian Keith are great in these roles.  But while Connery is his usual sexy sex, it's the late Brian Keith who gives us a solid performance as the mercurial Teddy Roosevelt.  Back up is provided with Candy Bergen, gorgeous in her early 30s, as the kidnapped American widow.  Great back-up also comes from the great John Huston as Teddy's beleaguered SecState, John Hay; Geoffrey Lewis, from the Clint Eastwood films is great as the hesitant US Ambassador, Gummere; the late Vladek Sheybal with his demonically evil stare is great as the Beshaw and more is given by Steve Kanaly and Roy Jensen whose faces we have seen in several backgrounds.  All in all, this is a film filled with wonderful romance, mindful of an era long gone.  Mindless story?  Not at all.  The issue of big nations pushing around smaller ones for their own hegemonical interests is as true today as it was then.  Overly romantic?  Not really-- certainly not maudlin in any sense.  Fun to watch?  You bet.  I own the video and will watch it again and again.  I suggest you do the same.","In 1904 Tangier, a wealthy American woman and her two children are kidnapped by Berbers, murderous desert pirates who scorn the Moroccan government and, by doing so, kidnap \"American pestilence\", which attracts the attention of U.S. President Theodore Roosevelt. Fictionalized real-life history, less a grand adventure than it is a peculiar, somewhat exhaustive throwback to the desert-sheik films of the 1940s (with a bit of \"The King and I\" interjected, besides). Portraying the cloaked, mustachioed, bloodthirsty leader and his snippy, haughty captive, Sean Connery and Candice Bergen could be acting in two entirely different movies (neither one seems to know how far to carry the camp-elements of their characters and dialogue, and both seem singularly without proper direction). The various (and anonymous) slashings and beheadings which occur are arbitrary: we don't know any of these victims, and the big action scenes become blurry, noisy montages of sand-swept violence on horseback. The pluses: a much-lauded music score by Jerry Goldsmith (Oscar-nominated, but a loser to John Williams' \"Jaws\"), fine location shooting and cinematography. *1/2 from ****","It is inevitable that this film will be compared with the other blockbuster about conflict between Western civilization and the culture of the middle East, i.e. Lawrence of Arabia, though no film maker in his right mind would knowingly put himself up against David Lean. In any case, The Wind and the Lion comes up short, though what film wouldn't?  I feel its chief shortcoming is its lack of specificity in dealing with the political motivations of the Raisuli's actions, which cry out for more detailed explanation here. The movie spends far too much on the relationship between him and Mrs. Pericardis, a subject certainly more conducive to drawing in the crowds. Until I find some actual historical research to confirm it, I must remain skeptical of the growing affection of Mrs. Pericardis toward her captor portrayed here. Stockholm syndrome or no, I simply find it difficult to believe an American woman at the turn of the century would develop a quasi-Romantic attraction toward the man who kidnapped her and her two children.We have also the cynical view of U.S. foreign policy and the projection of American strength portrayed here, which is perhaps not unexpected what with the memory of the U.S.'s recently ended Vietnam experience fresh in the national memory at the time of the picture's making. Doubtless the scenes of American troops marching in mideast capitals might elicit a different reaction in post-9/11 America than when this movie was first shown.\nBut the centerpiece of the movie, and the feature that makes the whole thing worthwhile is Brian Keith's altogether stunning and captivating performance as Teddy Roosevelt, one of the cinema's great performances, in my view. He absolutely monopolizes the screen in his scenes, which make the whole movie worth watching. The top-notch production values and gorgeous cinematography don't hurt, either.In short, a mixed bag but worth watching just for the scenery and Keith as Teddy.","Just watched The Wind And The Lion last night...decent adventure yarn, but I was annoyed by the huge unexplained holes in the plot that didn't make any sense, and while some actors did a great job, there were others who were terrible! At times the dialogue was kinda cheesy as well. I thought Connery was ok in the role, but it certainly wasn't his best performance...his Scottish/Arabic hybrid accent was laughable. The visuals were nice, and the music score had some great parts. All in all an ok movie, but I was disappointed that its full potential was not realized.\n*SPOILER ALERT*Maybe part of my problem is that I'm a history major and I have to say that they took rather large liberalities with the plot...the movie is definitely fiction based on real events, rather than an accurate historical portrayal. There's nothing really wrong with that, but when they put certain scenes in the movie that make no political sense in context of the time and setting, then I get kind of annoyed, but bah, maybe I'm reading too much into it...it is just entertainment after all. I guess I'm referring to the tactless way the Americans invaded Morocco, despite the presence of all the great European powers (which is ridiculous), or the scene near the end where an all out battle occurs between the American and German factions over the prisoner, which is silly and never explained, and just what did the Germans want with Connery's Raisouli? To me it just looks like they were added into the plot at the very end just as a cheap excuse to stage action scenes with the usual stereotypical Hollywood villains (Germans).I also feel that there was too much inappropriate humour, such as scenes where Connery's character helplessly sulks and complains when laughed at by the kidnapped children and by his own men over his lack of control over Candice Bergen...believe me, a truly ruthless, brutal leader would not act in such a manner. I think the film would have worked much better had the tone been much more serious, rather than trying to work subtle elements of romantic comedy into the story. The smirks you see on Connery's face and his men really sap the necessary feeling of danger and suspense that the film should have...I never felt like any of the characters were particularly dangerous, especially whenever Connery would spout off so-called \"deep-meaning\" proverbs that came across as completely cheesy, and had my friend and I rolling our eyes and laughing when we weren't supposed to.\nAt least Connery and Bergen never got it on, because that would have been unrealistic and painful to watch...I was quite relieved that they left that cliche out, but Bergen's sudden Stockholm Syndrome turn at the end and the Americans' unflinching willingness to go along with her plan was pretty dumb I have to say.That having been said, it isn't a downright *bad* film, it just could have been much better.","The wind and the lion is a marvelous sweeping motion picture.  It is a monument to what filmmaking once was but is no more.Connery, despite the thick scottish brogue, plays the Raisulu very well. He inspires the viewer in a way many lead characters cannot. Candice Bergen, in one of her early roles, is marvelous as the kidnapped socialite Mrs. Pedacaris, showing courage in the face of adversity (and plenty of humour as well).  A marvelous film, rent or buy it and you won't be disappointed.","There was something unnerving about watching \"The Wind and the Lion\". I'm not just speaking of the exceeding suspension of disbelief that had to be cast in its direction, but current events in regard to the film. I must assume that the film, though focussed around the year 1904, must have been written allegorically, because (much like present world events) Sean Connery plays a shiek, speaking frequently of a jihad, and Brian Keith plays Teddy Rosevelt as an embellishment of a power hungry politician. Candice Bergen's character sits in the middle as the occasional \"something of value\" that the two sort of toy over. It's really an interesting movie, even if a bit full of itself. The weird thing is that when it's not playing out like an adventure or romance (which really seemed contrived), it seems rather humorous in an exaggerated manner, so my guess is that buried underneath all of the thrills is a biting satire of ... well, something. It's an above average film, but still a damn unique one.","I like The Wind and the Lion very much. It was a good movie. I thought that since I'm young and it was made so long ago I wouldn't like it all that good, but after I saw it, i was amazed of how good it was. My family liked it, my friends liked it, everyone I showed it to liked it. I liked it because it showed how Arabs and people in Morroco was treated during the Early 1900's, by the Germans, French, and even the Americans. If I was a High School History teacher, I would definitely show it to my student's, From a High Schooler's point of view. I give this movie a good 10 out of 10. My grandparents liked it so much they bought it for themselves. My little 3 year old cousins even sit down and watched it.Systemoffell","This is one great, sweeping, movie you will remember for a long time. It is about history, America, the change of times, Teddy Roosevelt, Morocco, a kidnapped American and her children, and the leader of the Berbers, with the blood of the Prophet in his veins.This movie is based on a true story--like Jesse James was a banker. An American WAS kidnapped in Morocco and the Marines went part-way to the shores of Tripoli to rescue him. So much for that. You know Hollywood. Sean Connery is the Berber chieftain and Muslim leader. Candice Bergan is the guy who was kidnapped, along with her two kids; the son is Rex Harrison's grandson, Simon, no less. John Huston is Secretary of State, with a great John-Huston-style straight line at a State Dinner, watch out for it. Brian Kieth IS Teddy Roosevelt, all-American, all-male, a character that is an interesting commentary as modern as today.The sweep and beauty of the desert and Morocco are shown beautifully in the cinematography in this film, which will stay with you, a haunting and compelling memory. The score is as sweeping and exotic as the images.This is a story about two cultures, both with grand ideas and historic pasts, struggling for the future without an idea at all about one another. In any event, the struggle comes down to might versus ingenuity.Then at the last, there is the little boy--remember the little boy? What do you think HE thinks?","I just cannot emphasize enough what a lovely movie this is.  Justthe memory of this movie right now enchants me.  If you want tosee a sweeping epic of a movie, with wonderful actors in vividscenery, with great dialogue, reminding you of what early Americacould have been like [what the world could have been like backthen]...well...I highly recommend this movie.  Especially during atime of war and conflict in Iraq...when our American image is not atall what it used to be...this movie takes you back to a time when wewere just starting out.  When being an American meant reallypicking yourself up by your bootstraps and getting going.  Whenthe world was such an untamed and unknown place.  Well, thismovie has that...and more.  Enjoy.","The Wind and the Lion is well written and superbly acted. It is a tale that exemplifies the American spirit and the American character. This movie is a story from the early 20th century  that is strangely relevant to the political landscape of the world in the beginning of the 21st century. It is a true classic.","I found the film to be typical of sixties and seventies \"epics\" that I've seen. Stilted dialog, unnecessary scenes in the name of \"character development,\" and bad acting from the supporting cast and leading lady.Sean Connery did well with what he was given, but most of his dialog is along the lines of \"no laughs at me,\" and \"you are a lot of trouble.\" I love Connery as an actor, but I think this is a black mark on his filmography.While Brian Keith did a great job as Teddy Roosevelt, the way Roosevelt was written in to the struck me as a devil-may-care cowboy. Personally, I feel Teddy was too good a leader to be portrayed as such, in the film all that he did was shoot rifles, talk about a bear, and rattle about how much he wanted to blow a hole in the overseas leaders who annoyed him.But what got me the most was their unrealistic portrayal of this weird socialite woman who goes from drinking tea under a gazebo to holding off ten bandits by poking at them with a spear. In this post-Lord of the Rings era, I just can't accept such unrealistic combat.All in all, this is one film I would very much like to forget.","Writer/director John Milius takes a little-known incident from American history and extrapolates wildly in all the right ways. The result is a grand adventure tale that showcases two of its stars in memorable, larger-than-life roles: Sean Connery as the wily Arab sheik with an inexplicable Scottish brogue, and Brian Keith as President Theodore Roosevelt, itching for the chance to put that \"big stick\" to good use.Aided immeasurably by Billy Williams' glorious widescreen cinematography and a magnificent score by the always reliable Jerry Goldsmith, this early effort seemed the harbinger of a talent to rank with contemporaries Lucas, Coppola and Spielberg. Although Milius served up tantalizing glimpses of his ability in scripts for JEREMIAH JOHNSON and APOCALYPSE NOW, his career seemed to take a downward turn not long after he started directing, ultimately foundering on dreck like CONAN THE BARBARIAN and RED DAWN. Here's hoping that he will again find his way."],"review-user":["cariart","Gatorman9","SMK-4","sushifreak-1","jacksflicks","bkoganbing","kent-johnson","Theo Robertson","msinabottle","poolandrews","lasswegas","kenandraf","Dan1863Sickles","artzau","moonspinner55","rupie","discogoth","JohnQpublic","postmanwhoalwaysringstwice","systemoffell","Carrie_the_Oracle","mary-262","RickLarkin","malletkat_gomer","jckruize"],"review-date":["9 August 2003","14 September 2003","23 September 1998","16 August 2004","24 June 2003","30 December 2006","30 March 2004","25 October 2004","14 January 2004","2 June 2008","26 April 2003","17 June 2002","14 April 2007","2 June 2002","27 February 2007","23 April 2003","5 December 2001","7 February 2004","15 February 2003","1 January 2006","20 April 2005","21 May 2004","23 February 2004","26 September 2006","3 December 2001"],"review-rating":["9","10","10","7","10","6","10","6","10","8","3","9","4","6","6","9","10","10","9","10","5","8"],"review-title":[" Connery Magnificent in Milius Masterpiece!\n"," Another film where I almost can't seem to find enough nice things to say about it\n"," Bravado, Honour, and Charisma aplenty\n"," brilliant\n"," For the Whole Family - A Wonderful \"American\" Adventure Yarn\n"," Waving the Big Stick\n"," Milius has a strong interest in TR, and this is an enjoyable adventure based loosely on a true incident during TR's presidency.\n"," This Is A True Story ...\n"," A Guy's Movie about What's Good About Guys\n"," Handsomely mounted adventure film.\n"," that's how a movie should be\n"," Great Teddy Roosevelt scenes!\n"," Action -- Adventure -- An Epic Romance As Dry And Endless As the Desert Sands!!!\n"," Connery, Bergen and Keith at their best!\n"," \"The King & I\" with desert bandits...\n"," Brian Keith makes the movie\n"," Could have been great...\n"," fabulous sweeping epic...\n"," in a way ... ahead of its time\n"," The movie was great\n"," The Wind and The Lion--And A Little Boy\n"," Oh My\n"," A story well told story, oddly relevant to the 21st century to\n"," In my opinion, a waste of a Netflix rental...\n"," Sweeping adventure epic in the old style.\n"]}