{"review-url":["http://www.imdb.com/title/tt0067227/reviews"],"review-text":["The Merchant of Four Seasons is a film about a lack of love. The film starts off with the main character; Hans Epp, returning from a spell in the foreign legion. He returns to his mother, not to be told how much she loves him, or how much she's missed him; but to be told that he is worthless and, even worse, that she would have preferred the man he went with to have come back instead. It is the character's relation to women that makes this film so hateful; the fact that his wife is taller than him is symbolic of his relation to the other gender; he is consistently humiliated by them, and it is through his relations with them that his life isn't as great as it could have been. This is also shown clearly by the way he treats his wife after a drink. He lost his job as a policeman through lust for a woman, and even his wife; a woman that is supposed to love him, never really shows any affection for him. Even at the end, his wife is more bothered about what her and her daughter will do than the state of her husband.The Merchant of Four Seasons is a thoroughly unpleasant film. There isn't a scene in the movie where someone is happy, and not only that; but the movie seems deliriously blissful to wallow in the misery of it's central characters. The movie is certainly not recommended to anyone who is currently having a hard time, that's for sure. Despite all the misery, the film never steps out the bounds of reality; every event in this movie can - and most probably has - happened, and that only serves in making the movie more shocking. The film is, of course, helmed by Rainer Werner Fassbinder; the cult German director that committed suicide in 1982. This is only my second taste of the man's work, but through just two films, it is easy to get an idea of the type of art that he creates. Both films are downtrodden and gritty - yet realistic pieces of art. His characterization in this movie is subtle; we only ever get to know the characters through their plight's and not through their character. This is a very clever way of showing the audience that it is their surroundings that define the people in the film, not the people themselves - and as nearly everyone that sees the film knows what living in an urban society is like, it wont difficult for the majority of people to relate to. The Merchant of Four Seasons is not a film that is easily forgettable; the movie is high on substance and low on style, and that makes for a very memorable picture, and one that everyone who considers themselves to be a fan of cinema should experience. It is with that in my mind that I give this film my highest recommendations; it's not sweet and it's not pleasant, but you will not see a more realistic portrayal of depression, and this is most certainly a movie that will stay with you.","THE MERCHANT OF FOUR SEASONS was Rainer Werner Fassbinder's first shot at mainstream acceptance. In a turbulent career of just fifteen years, he managed to create an astounding body of work in film and theater, both as a performer and a creative producer, actor, and director. Although this movie might not appeal to many viewers, the film has much to offer. The storyline is fairly straightforward. A man is ostracized from his upper middle class family due to emotional and economic problems, and proves unable to control his downward spiral. THE MERCHANT OF FOUR SEASONS is shot with a slavish devotion to elegant detail, and each set is very carefully designed and constructed. Every object on set seems painstakingly arranged so as to provoke layers of emotional texture. Many religious paintings and icons decorate the walls of the various rooms and seem to speak to Hans's desperate quest for spiritual meaning or direction in his life. Much thought was given to how lighting and color were employed to contrast and enhance the drama. Several times during the film, I froze the frame to marvel at the beauty of the shot's composition. I streamed this film, and the print was nearly flawless and second to none. Fassbinder employs his actors in an almost vehement \"Anti-Natural' style. He does everything possible to prevent the actors from reacting in a normal or colloquial manner, and this creates a rather stilted effect. However, by doing so, he injects an almost 'hyper-reality' to the narrative. Rather than the presentation of a mundane melodrama, the actors almost militant lack of affectation forces the viewer to confront the film in a different manner. Fassbinder's film intentionally prevents the viewer from easily connecting with the characters' trials and tribulations. You are constantly on the outside, looking in. This will be a disconcerting experience for many, but I found it to be a unique and satisfying artistic adventure.","The Merchant of Four Seasons established a number of trademarks, both visual and thematic, that would become further refined and much more expressive in the Fassbinder films to follow. Here, for example, we see the action unfold through the eyes of a tortured anti-hero and his literally abused wife, as they strive to put aside petty differences, the ghosts of the past and the animosity of friends, family and neighbours, in an attempt to overcome the monotonous misery of everyday life. However, as with most Fassbinder films, the daily grind often ends up being too severe - and generally things never go to plan - leaving most of the characters feeling damaged, depressed, worthless or worse. With that in mind, it would be easy to dismiss Fassbinder's work as nothing more than misanthropic self-pity, yet to do so would require us to disregard the three-dimensional characters, the meaningful dialog and the heart that seems to beat at the centre of all of his films.Unlike many other director's who have mined the social-realist path, Fassbinder never looks down on his characters to gloat or heap scorn, and instead, seems to have a genuine warmth and love for then. That said, he respects the fact that such real-life archetypes can often fall foul of the system, ending up as nothing more than damaged shells forced to enter into a downward spiral that takes time, faith and self-belief to truly escape from. The central notion of The Merchant of Four Seasons then, involves a character that has fallen into one such spiral that has crushed his very will to escape. So, like the characters in later works like Fox and his Friends, Mother Küsters Goes to Heaven and In A Year With 13 Moons, Hans Epp becomes a character that has, through circumstance and upbringing, been led towards an ultimate downfall that he both accepts and embraces. As you can imagine from such a bare-bones description, The Merchant of Four Seasons is bleak stuff, offering an honest and at times rather ugly depiction of failure, despair, contempt and alienation.Fassbinder attempts a purposely fractured narrative with The Merchant of Four Seasons, beginning the film with a scene in which Hans returns from a stint in the Foreign Legion. He expects a heroes welcome, but instead, is chastised by his mother for waking her up at such an ungodly hour, before lamenting the fact that the young man dragged along by Hans to fight by his side has been killed, whilst her errant son has returned (\"the good die young, and people like you come back\" she says, before closing the door in his face). The scene establishes the relationship between Hans and his mother perfectly, and will go some lengths towards explaining Hans's often quite violent relationship with his own wife Irmgard. Later scenes, presented in similarly fragmented flashbacks, inform us of Hans's past as a promising scholar before he dropped out to join the Legion, his dismissal from the police force after accepting sexual favours from a prostitute, the humiliation in the eyes of his family and friends of having to become a common fruit vendor, and his inability to woo the great love of his life.Like many of Fassbinder's key characters, Hans remains a tragic anti-hero. On the one hand we feel pity (and to some extent empathy) for this short, overweight character, so unfortunate in life that he's even ended up married to a tall slender woman who's very appearance can only exaggerate his physical shortcomings, but at the same time he comes across as quite vile and detestable. The scene in which the drunken Hans viciously beats his wife - whilst his young daughter tries desperately to protect her mother - is captured in a static medium shot that goes on for so long that the actions run from the heartbreaking, to the comedic, to the tragic and beyond!! Even when Hans seems to be getting his life back together, finally winning the respect of his family and even establishing a successful working relationship with his old Legion pal Harry, there's still something missing. Fassbinder's point seems to be that the failures of our early life can only dictate the direction of our adult life, whilst one scene in particular, in which Hans's daughter Renate asks her aunt Anna if her father is going to die, seems to sum up the soul of the film perfectly, with Anna replying \"he will live as long as he wants to live\".Ultimately, The Merchant of Four Seasons is a film about a character resigned to a life from which there is no escape... a life in which his very presence is enough to poison the lives of those around him!! Hans Hirschmüller's performance as the tragic Hans is exceptional stuff, managing to elicit a degree of sympathy for this dark and complicated character. As great as Hirschmüller is, he is far eclipsed by Fassbinder regular Irm Hermann, who offers a touching and sympathetic performance as Hans's loveless and equally complex wife. Further support is offered by Hanna Schygulla, Klaus Löwitsch, Ingrid Caven and Kurt Raab... though the film belongs to Fassbinder, who here begins to develop the style that would later lead to masterworks like The Bitter Tears of Petra von Kant, Fear Eats the Soul, Fox and His Friends, The Marriage of Maria Braun and In A Year With 13 Moons. Though perhaps too morose and continually bleak for some viewers, The Merchant of Four Seasons remains an intelligent, honest and subtly affecting look at failure, alienation and despair.","Ostensibly, Hans ' isolation and despair are caused by a stereotypically frigid bourgeois mother, a nagging wife, and a lover's rejection. And despite the complex portrayal--Hans himself doesn't precisely make these claims--the above must be a substantial part of Fassbinder's thinking as well (his use of Freud and Marx). But the viewer may look no further than Hans' gender and sexism to locate the truer cause of his crushed spirit.First, it's highly unlikely that his mother's lack of love pushed him into signing up with the Foreign Legion. It was far more likely, and is in part indicated, that it was a quest for adventure, male camaraderie (escape from the female world of mother and sister) and male identity itself-- which both the Legion and war offered.Second, Hans loses his successful job as a policeman because of his own sexism. By falling for a prostitute's wiles at work, he not only rubber stamps prostitution as an oppressive institution, but shows that he cannot even control his sexuality in a professional arena--and is even willing to jeopardize a desirable career.Third, he commits serious verbal abuse against his wife in front of his sheep-like male buddies, making no distinction at all between her absence or--when she shows up looking for him--presence. In fact, he is more brutal in her presence.A few hours later, in a violent and drunken state, he beats his wife in front of their daughter, who intervenes on her mother's behalf. The terror he instills in her and his daughter are palpable. But both he--and the audience--move on with nary a whimper of conscience or protest. Why? Because his wife is cruelly characterized as both nagging and sexually promiscuous (yes, this this may be Fassbinder's view of what capitalism does to women--owned, insecure, and a commodity--but this hardly absolves Hans' brutality nor Fassbinder's exploitation of her in the battery scene).And then there is this male role pressure, which Hans could choose to reject and protest, but instead accepts. He's too short for a male and too un-heroic to achieve the worldly success the male role recommends. But how can these be causes of despair when he not only gains his lost love as a mistress but marries a tall woman who is considerably more attractive than himself., Finally, Hans allows Harry, his war comrade, to remain, over his wife's convincing plea to the contrary, on in their house. By this decision, he not only makes it clear that he is more tied to Harry than to his wife, but that male bonding supersedes his love of women. And supersedes, in the end, his own life, because it is Harry's superior competence and spirit around the house that causes Hans' star to fall. Hans, the merchant, may be to a degree, the victim of capitalism, but more to the point, he is the victim of his own allegiance to his own male identity. His inability to let it go, is the ultimate cause for his isolation and despair.This is something that is lost, I think, not only on Fassbinder, but also on Han's sister, Anna--although, only to a degree lost. For Anna's (and Fassbinder's) support of her brother--over her mother, only goes so far. She is quite insistent that only he can save himself--that her support and love cannot it itself end his self-loathing. Unfortunately, she does not offer any of this same support and love for his wife who must be much more embittered than Hans but, who in the end, is able to pick up the pieces, and save herself and daughter, and present a marked contrast to Han's fall.","The Merchant of Four Seasons isn't what I would call a happy movie, at all, or even one that impressed me to the point of praising it to the sky (there are other Fassbinder flicks for that, like Veronika Voss and the underrated Satan's Brew). But it's certainly no less than a fascinating experiment in taking a look at those in a society that you and me and others we know might possibly know, or not really want to know. I imagine in the early 70s in Germany a generation, coming out of WW2, had a stigma to live with but tried their best just to get by. This is a stigma that floats all over this film, and in many instances in Fassbinder's work in general, but especially because with Four Seasons he takes his eye on the middle class, and a particular married couple- the distanced, depressed, angry Hans the fruit seller and his long-suffered wife- that is nothing short than trying for realism in the guise of melodrama. If Cassavetes were a crazy German he might make this film, maybe even as just a lark.The story sounds simple enough, where Hans' drinking gets out of control, he beats his wife (this scene is one of the toughest to take, maybe in just any movie, the way Fassbinder's camera lingers without a cut as his wife is left helpless and their daughter trying to stop him in his frenzy) and then she's ready to leave him. As he stands in the room, her family holding him back, she makes the call for divorce and he gets a heart attack right there. He recovers, his business suddenly starts booming again with some help from some good (or not so good) employees - and yet this only continues his longing, for another woman, and his despair in general.And yet it's in this simplicity that Fassbinder tries, and succeeds for the most part, in attaining a mood of dread, of a tense vibe in a kitchen or in the bedroom or out on the street that you can cut with a knife and bleed out. The weakest part of this all may be the acting... at least that was my initial impression. Hans, played by Hirschmuller, can be a stilted presence, with only the slightest movements in his face and eyes, and for a while it doesn't look like he's much of a good actor. The actress playing his wife, Irm Hermann, and her sister (Fassbinder Hanna Schygulla) fare better, but only cause they're given more to do conventionally, like cry or look concerned. It takes some time to adjust to what is, essentially, a void in his guy Hans, of something from his own psychological self-torment or self-pity that pervades himself and those around him who just want to get on with some sense of normalcy, especially once Hans gets successful.Not everything clicks together in The Merchant of Four Seasons, but enough did to make me recommend it to those looking for a different slice-of-life than you might be used to with more modern American movies. Fassbinder's world here is a combat between the melodrama he loves in cinema and the harsh, crushing sense of humanism that he feels personally and puts into characters that, for better or worse, we somehow identify with. Are the Epps a family you know of? Or could you even be them? Who's to say. It's a methodical study of tragic emptiness in the human spirit, and its goals are all attained.","I didn't find this film as accessible as 'Fox & his Friends' but it was a moving portrayal of a typical Fassbinder victim figure, the eponymous barrow-boy, Hans Epp, whose hopes and dreams are eventually crushed by stultifying conformity (family & society). Some of the scenes are exaggerated (the family confrontations) but I particularly liked the sequence where Hans is desperately searching for meaning & comfort; he tries to find some peace in natural surroundings, goes back to his first lost love in order to recapture past feelings (she's only interested in a quick fling before her husband returns) and visits his sister, perhaps the only person who has any degree of sympathy for him, only to find she's too busy with work.A poignant story of a vulnerable inarticulate man crushed by his mundane surroundings and  bourgeoise, middle-class German values obsessed with economic success and a upward mobility that conveniently papers over the cracks of its more disturbing past.","In Fassbinder's earlier films, his ideas sometimes surpased his ability to execute them.  He was always a great writer, but it took him some time to get his style of camera work and storytelling down pat.\nThe Merchant of Four Seasons is one of Fassbinder's first movie to make great use of color, from the bright green pears in the merchant's cart to the bright red roses at the funeral (a funeral in a Fassbinder movie? who'd have thought).His camera work was getting there too, but it was still fairly minimalist. The occasional zooms seem a bit uncomfortable at times and unnatural, but then again, Fassbinder was still coming out of his purely avant garde phase. This might be because Michael Ballhaus isn't behind the camera, but instead the slightly inferior Dietrich Lohmann.Still, this is Fassbinder, and you get your fix here.  Broken dreams shown so vividly and unflinchingly as to alienate audience and drive them into a depressed stupor.  Just what the doctor ordered.  An early classic that shows remarkable progression when compared to his first films released only 2 years prior.","The Merchant of Four Seasons received all major W German film awards for 1971 but it took a couple of more years for Fassbinder to break through internationally. TM4S is a fairly simple story but it can be difficult or painful to watch due to the subject matter: class prejudices, domestic violence, infidelity, family discord, depression and self-destructive behavior. In other words it presents a bleak view of the world and its human inhabitants. I believe there's an undercurrent of cutting humor throughout although it's interesting that no examples spring to mind and it's not campy. I saw TM4S in the mid-70s and in 2015 didn't remember much at all (other than not liking it), which suggests I repressed a lot that first time. I now think it's the first of a few masterpieces by a director whose importance will certainly endure.","I read about this film before watching it, so I knew what would happen before I saw it. Nonetheless, this film had an effect on me.First, the lead character Hans amazingly looked so much like soccer great Diego Maradona. I was trying to place his face and then Maradona's face came to mind. Anyway, the protagonist seemed really down on life because of little or no support from either his wife or family, with the exception of his sister, who seemed just a little caring.Hans makes a modest living selling fruit on a cart and going from apartment complex to apartment complex to do so. Neither his wife nor mother approve of his job, and he was fired from his job as a cop after getting serviced by a prostitute who was under arrest. The story seems a real downer as just about everything that can go wrong does for this guy.I will say the acting is rather rigid but perhaps that is characteristic of German society, esp. back then. I was surprised at the moments of emotion, like when the wife suggests getting someone to help them sell the fruit. As for the ending, this is my take on this. Hans knows that he is a burden on his family, so after seeing that his war buddy is good with his wife and daughter as well as the busy, Hans drinks knowing full well that he will die. He figures he will get out of the picture to allow his wife and buddy to be together and such. So perhaps his act of suicide stemmed not just from his desire to live no longer, but also to leave his family in a better position, not to mention the woman he was cheating with. Others might disagree, but perhaps that is his one final act of good for the world before he leaves it.Overall, I'd say this film will stay with me (and help me to stay off booze).","Like Margot in \"Fear of Fear\" falls victim of her ambitious husband, like Fox in \"Fox and his friends\" is driven into suicide by his boyfriend who took all his money away, like Xaverl Bolwieser in \"The Stationsmaster's Wife\" who goes to prison in order to give his cheating wife a chance to get rid of him, like Hermann Hermann who seeks refuge in insanity in order to flee his stupid wife and bankrupt company, so also Hans Epp is a victim of the German \"Wirtschaftswunder\"-Society after World War II in R.W. Fassbinder's \"The Merchant of the Four Seasons\". Simply from the fact that Fassbinder played through social abuse between men and women as well as between hetero- and homosexual couples, it should be clear that he does not favorize any sex.In Hans Epp's case there are the women who drive him into despair, illness and finally death. When he comes back from the Foreign Legion where he flew because he could not stand anymore the pressure of his mother, she complains that he is still alive while the good boy from her neighbor had been killed. Then Hans gets a job as a policeman, but is surprised by his foreman while he is seduced by a prostitute. After having lost his job, he works as a fruit-merchant with little income, going from backyard to backyard \"crying out\" his produce. His mother, one of his sisters and her husband are ashamed to have such a \"street-worker\" in their family. \"The love of his life\" (she has no name in the movie) refuses to marry him because his job does not fit together with her social status and origin. So he marries Irmgard whom he does not love and who does not love him. From her constant pressure on him he flees into drinking. One evening, after his wife was stalking him, he explodes and hits her. She flees to her family for which this event was just what they have been waiting for. When Irmgard is calling a lawyer for divorce, Hans suffers a heart attack. Imrgard decides to stay with him, but from now on, he is not allowed anymore to do heavy work and to drink alcohol. So he starts to feel more and more superfluous, gets quieter and quieter and more and more depressive. When he finds out that Irmgard cheats him, he chooses to end his life, but not like Hermann Hermann by having a trip into the light of madness, but he drinks himself to death in front of Imrgard, their little daughter and his boozing buddies. Fassbinder said in an interview that Hans knew what he was doing. The question, however is: Did Hans just kill himself because he could not stand anymore his miserable environment, or did he make self-justice?","I'd be hard pressed to say what is it that makes this film so important to me.  While a very good movie, this is definitely not the most outstanding Fassbinder's film.  Still along with the American Soldier it keeps making it into my personal list of favorites whenever I get to thinking about it.","I have to say in general I may not be the very biggest fan of German filmmaker Rainer Werner Fassbinder, but here I kinda liked his work I guess. There are some films of his I really like (\"Angst essen Seele auf\", \"Martha\"), but also a large part of his body of work did little to nothing for me. \"Händler der vier Jahreszeiten\" or \"The Merchant of Four Seasons\" is among his earlier, but not first works and looking at how he was only in his mid-20s when he made this film, it is an impressive achievement taking that into account. A wild new generation of cinema we have here, even if it is not so obvious by today's standards as the film is of course 45 years old now already. And Fassbinder's work was also honored on several occasions here, for example by winning the grand prize at the German Film Awards that year. The two lead actors were honored too and three of the supporting cast received nominations. The only one who is absolutely deserving of all the attention is Hans Hirschmüller in my opinion. His lead performance is the heart and soul of this work here. And it helps that he is in so many scenes as he carries the action nicely and even when he isn't, every scene probably still has an impact on his character. A bit sad that he has not really been that prolific in the last 30 years or just appeared in minor projects and roles. As for the action in this one here, it is okay and interesting, but not among Fassbinder's very finest. I think a lot of the film's success is due to Hirschmüller's great performance. But this film is also once again about people talking about other people, usually in derogatory ways as it was so common back then and still is today. The costume design and sets reminds strongly of Mad Men. Those were the days that the series is portraying and Germany did not look entirely different compared to the United States. All in all, this relatively short Fassbinder film (stays easily under 90 minutes) is worth checking out. I give it a thumbs up.","This 1971 film would be the turning point in Rainer Werner Fassbinder's career. A scathing portrait of a man crushed by societal pressures. The film purposely mixes 1970's with 1950's Germany in which the story takes place. Fassbinder also applies his staged and often stilted style which actually works in the film's favor. His two leading actors are outstanding, Hans Hirschmüller and Irm Hermann manage to push beyond the artifice to something very real. It has been said that much of this film's success is owed to Fassbinder's inspiration ultimate meeting with Douglas Sirk. While this may be the case, this film is astoundingly unique. The director would go on to make even more potent films, but this was the first fully-formed vision. A film not to be missed.","How can anyone even begin to like this film is really beyond me.The idea? It has none. \"A guy fell apart\". That's the idea. Wow. An environment was slowly killing him... now THAT's original and worth watching.This is the first Fasbinder's film I've seen... I've heard that he's a genius of mise-en-scene, but I've seen student films with more attention, inspiration, idea, and craft than this... this.... this nothing. It has nothing!Each and every shot is too long. There's so much emptiness in them... The acting's horrible. You can see the actors had no preparation at all, no understanding of their roles, not even an attempt at showing emotions... it's so... superficial... The lines are so explicative that you could removed 90% of them and still have the same crappy film. Tempo? Who cares about it. Atmosphere, dynamics, that's for pussies! One shot per scene, 80% of the time people staring unrealistically, having no idea how to represent emotions and importance of the moment besides hollow staring at the camera or one another... EDiting? All rules of editing have been disregarded with no pa pay-off of any kind... Photography? Half of the shots have reflection in them, and crappy lighting with no stylization of any kind. Shadows, play of shadows... who needs that? We need a guy pissing, drinking, hitting his wife like he's... like he's acting. We need a bunch of close ups of a not-so-beautiful woman... we need an amateurish climax of his capture by an unconvincing arabian torturer... This film has so much wrongs that it isn't worth the no-budget it had.Frankly, I haven't seen a film this bad since American Pie 5. Yup. That bad.I've just started watching his \"Veronica Foss\" movie, which seems much better, based on the first 15 minutes (since it does have a hint of directing and artistic idea, unlike this crap), so I won't argue that Fasbinder's clueless.... but this.... this film SUCKS!","I have always found Fassbinder fascinating, but this film drags.First, Hans Hirschmuller is a strikingly unattractive protagonist. Sometimes that kind of casting can be interesting, but in this case the camera dislikes him. I recoiled from closeups of Hans's pimpled, pockmarked, dumpy body.In many cases, a guy who receives unsolicited oral sex from a sexy stranger would be viewed as lucky. Not in Fassbinder's universe. This come-on, in the police headquarters where Hans worked as a cop, was the beginning of the end for woebegone Hans. He squanders his wife's trust, hates and beats her for despising him back, and rejects floozies who inexplicably proposition him -- all the while descending into a morass of clinical depression.Hans's wife Irmgard, played by the mesmerizing Irm Hermann (a non-actress whom Fassbinder discovered while she was working as a secretary) is way more compelling. However, she too is reptilian in this film in which no one can be trusted and the world is a viper's nest of people chasing fleeting desires. (Irmgard's dowdy housewife nevertheless displays suntan lines -- very incongruous!) Some of the ins and outs of the plot are needlessly tedious. Who really wanted to watch interviews with five or six wannabe fruit hawkers? Though I'm glad I saw this film -- part of a double feature at a trendy Tribeca venue -- it so tired me out at end of a long workday here in NYC that I passed on Fassbinder's made-for-TV \"Fear of Fear.\"","Hans (Hans Hirschmüller) is a street fruit peddler and born-loser. His choice of career upsets his bourgeois family, causing him to turn to drinking and violence. After recovering from a debilitating heart attack, his business finally begins to take off. However the more he becomes a credit to his family, the more depressed he becomes.\"The Merchant of Four Seasons\" was a turning point in Fassbinder's career, marking his entry into the international film arena. It is considered by film critics to be one of Fassbinder's best films. For me, it was alright but not what I would consider among his best. Number one would have to be \"Ali\", and it is hard to dismiss \"World on a Wire\".Granted, I have not perused the Criterion DVD, and maybe I just do not understand the complete context of this film. Another time?","What kind I say about this movie. well for starters, I thought that this film was okay, not the greatest not worst.  I said this cause I thought that the script was great and original, really different and refreshing.  Now I wouldn't say that it's the greatest film that I've seeing cause of the acting.  The actors that played each role, seems that they played them without emotions, as if they took the life out of them.  When the wife laughed or cried, this didn't look real to me for some reason, that's just an example, but sincerely all the characters didn't act real at all.  I wish I could say more positive things about this film so you guys can see it at least once but how can I do that since I know that I'm not going to see this movie again.  I rented this film from the library of my school, without hearing anything about the film itself or the director.  I took a chance because the story that was describe on the back sounded really interesting and it really was.","I rented the movie at the local library, since I had years earlier seen Angst Essen Die Seele Auf, and liked it. It started very interesting with Hans Epp returning from a spell with the Foreign Legion, but the first thing his mother told him was how he was a failure and always would be. \"Was ist traurig VorMittag ist noch traurig NachMittag\" But I found the actors in this movie to be like zombies. It might be that they just depicted a dreary every day life, but I felt midways into the film that I don`t need to have these pictures inside my head, so I pressed the stop button and in stead put on the other film I had rented at the library, an episode of Star Trek Voyager.Not that this is a bad movie, it was just tragic to watch at the time."],"review-user":["The_Void","valis1949","ThreeSadTigers","jcappy","MisterWhiplash","nqure","Itchload","jcnsoflorida","peter07","hasosch","levb","Horst_In_Translation","glittercrush","NikolaAvramov","evening1","gavin6942","apollo231","the_oak"],"review-date":["22 September 2004","27 October 2009","29 December 2007","5 June 2008","17 June 2009","25 January 2002","7 December 2002","7 July 2015","14 January 2012","18 February 2009","15 October 2001","4 May 2016","9 January 2016","16 May 2008","29 June 2012","23 April 2015","2 March 2003","22 May 2004"],"review-rating":["8","9","8","8","7","9","9","8","10","10","6","9","1","5","6","7"],"review-title":[" Realistic and hateful; an excellent portrayal of depression\n"," Mr. Self Destruct\n"," Fassbinder's first real melodrama.\n"," Male Despair\n"," stay with the film and it may engross you, somehow\n"," The human spirit crushed\n"," Fassbinder evolving\n"," All Pigs\n"," Haunting film, though flawed\n"," Psychogram of the Four Seasons\n"," One of my 10 favorite movies of all times\n"," I like this Fassbinder film\n"," Fassbinder Takes Form\n"," There's nothing to like here!\n"," \"Nothing done can be undone\"\n"," Fassbinder\n"," An Okay Film\n"," It put me in a bad mood\n"]}