{"review-url":["http://www.imdb.com/title/tt0051016/reviews"],"review-text":["Irwin Allen's production of 'The Story of Mankind' has been called one of the worst films ever made, a film so bad that it has NEVER been released on video, and barely ever appears on television (and only then in a VERY abbreviated form.) This is UNFAIR! While the film is intentionally (and sometimes unintentionally) campy, it has many milestones that make it worthy of respect. First, it is Ronald Colman's final film (he died a year after the release), and he still shows the urbanity, the kindness, and the 'voice' that made him unique. Second, it is the last theatrical appearance of the Marx Brothers (although they appear separately), and Harpo plays the harp one last time, a bittersweet experience. Third, Vincent Price plays the Devil, and certainly no actor is more perfect for the role! Fourth, the film foreshadows Irwin Allen's later work, on television ('Voyage to the Bottom of the Sea', 'Time Tunnel') and in film ('The Poseidon Adventure', 'The Towering Inferno'). There are other milestones to this film, as well, but I think you can see my point!The story is VERY loosely based on Henrik Van Loon's wonderful, witty history of the human race (which is a fabulous read, if you ever get the chance!) The 'basic' framework of the story has been changed into an 'End of the World' tale, set in the heavens. High Judge Cedric Hardwicke must decide whether or not Earth should be allowed to blow itself up, after the creation of a 'super' bomb. Two counsels are selected; for the Prosecution is the Devil (Vincent Price), sly and sarcastic, and pleased that God's ultimate creation has fallen on it's face; for the Defense is the Spirit of Mankind (Ronald Colman), an entity that carries the essence of all of Man's achievements, both good and bad.As both sides present their cases, the 'history' of the world is played out, using Warner Brothers' stock footage and guest star cameos. Among the most memorable of these cameos are Virginia Mayo as a vampy Cleopatra, Peter Lorre, a lazily derranged Nero, Hedy Lamarr as a pious Joan of Arc, Harpo Marx miming Sir Issac Newton, Groucho Marx leering and wisecracking as Peter Minuit, buying Manhattan Island, and Dennis Hopper as a WAY over-the-top young Napoleon!Throughout the proceedings, Price and Colman (who had appeared together seven years earlier, in 'Champagne for Caesar') trade barbs over Man's worthiness, in exchanges both funny and sadly true, at times!'The Story of Mankind' is NOT classic cinema, but it is fun, and has a kind of charm uniquely it's own. It should NOT be forgotten!","THE STORY OF MANKIND (1957) is a very elusive all-star misfire about a heavenly debate over should earth survive or be wiped out.  For the defense, you have the Spirit of Man (Ronald Colman), for the prosecution, you have Satan (Vincent Price having a ball!)  They each call examples of humanity by showing famous good and evil people.  We see little skits involving Nero (Peter Lorre making googly-eyes at members of an orgy!) Napoleon (22 year old Dennis Hopper playing the part like a naughty frat boy!) Christopher Columbus (miscast Chico Marx), Issac Newton (even more miscast Harpo Marx!) The cast gets stranger and stranger.  Aging Hedy Lamarr as Joan of Arc? Where was everybodies agent?  The end result looks like the biggest celebrities in Hollywood are doing a 5th graders' play!  An amazing film, a tape I treasure!","Irwin Allen's first venture into all star spectacle was one all star disaster. The Story of Mankind contains some of the most incredible casting decisions of all time. Virginia Mayo as the blond Cleopatra, Dennis Hopper chewing the scenery with Napoleon, Peter Lorre dining on the scenery for weeks as Nero, Marie Wilson as Marie Antoinette as a roadshow Marilyn Monroe, that's just some of them.The film also is known for being the last film which featured all three of the Marx Brothers though they all have different roles. Chico plays a monk who is Christopher Columbus's confidante, Groucho euchres the Indians out of Manhattan island as Peter Minuit, and most astonishing of all, Harpo Marx as Sir Isaac Newton who discovers gravity when an apple conks him on the bean. Holding all these portrayals together is a story where mankind itself is being judged. A super H Bomb is about to be discovered and let loose will do in the world's population. It's Judgement Day a coming.But mankind has its advocates and detractors. Speaking for the prosecution is Old Scratch who's been bringing the worst out in man for centuries in the form of Vincent Price. But man has his good side as well and who better than Ronald Colman to demonstrate man at his most civilized best. Colman and Price plead their case before The Judge played by Cedric Hardwicke. In those three individuals you have some of the finest speaking voices the English language ever knew. When the film is on them as they each bring out the exhibits for their case it's a pleasure to listen to. Then when the focus is on the individual stories, you want to scream in agony.What was Irwin Allen driving at, I'm still trying to figure it out. Was he deliberately camping it up with some of these casting decisions? If it was satire, it just doesn't get off the ground.This was Ronald Colman's farewell film and while it's hardly something I'd like to go out on, I can't think of any man who could have stated the case for civilization any better. So when you see The Story of Mankind, fast forward through some of the exhibits and treasure every moment the advocates are before the judge.","Unlike most people, I really enjoyed this film.  Not only was it unintentionally funny, but it had all the elements that would later be associated with many of Irwin Allen's latter works (stock footage and an all-star cast).  Vincent Price is at his sinister best playing Mr. Scratch, the devil, and Ronald Colman is wonderful as the spirit of mankind.  Too bad this film isn't on video or DVD because it truly is a cult classic that is an acquired taste.","THE STORY OF MANKIND (1957) is not a good movie, but it's a fascinating one on several levels. I'm most intrigued by the central event of the film, a debate over the fate of mankind undertaken, in a heavenly tribunal, between the \"Spirit of Man,\" played by stately English actor Ronald Colman (in his final film), and a rather more sinuous type, Mr. Scratch (aka the Devil), played by Vincent Price on the cusp of his emergence as a major horror star. Colman speaks in defense of mankind, while Price argues for allowing the species' impending self-engineered demise. (This was the Atomic Age, after all.) Price offers concrete examples of man's inhumanity to man (and nature) and the various atrocities the race has committed, establishing a whole pattern of misconduct—theft, exploitation, slavery, mass murder, rape, pillage, plunder, perversion--that extends from Ancient Egypt right up to the present day. Colman glosses over these things, preferring to expound rather vaguely on man's lofty ideals and dreams of progress, exploration, and artistic achievement. When Colman brings up Leonardo da Vinci, for instance, Price points to da Vinci's detailed plans for highly destructive weapons of war. Price seems much more outraged by the crimes of mankind than Colman is, which marks his character as the true moralist in the film.(In real life, Colman and Price were good friends and one exchange of dialogue in the da Vinci scene, where Colman insists that Price \"knows nothing about painting,\" while Price responds that he \"never pretended to be an art expert,\" is an in-joke reference to Price's already considerable reputation by that point as a connoisseur, collector and historian of art.) On a more mundane note of cinephilic appreciation, I tried tallying up all the footage taken from earlier movies with historical themes. (Any time you see a shot with multiple extras and lavish sets, you know it's from a different movie.) Early on, for instance, we see John Carradine as the pharaoh, Khufu, sharing a scene with Price and Cedric Hardwicke (as the celestial judge). All three were in Cecil B. DeMille's spectacle from the previous year, THE TEN COMMANDMENTS (1956), which took place in Ancient Egypt. Yet when this scene transitions to shots of pyramid building, they don't use clips from DeMille's film, but instead rely on clips from another film set in that period—LAND OF THE PHARAOHS (1955). Why? Because THE STORY OF MANKIND is a Warner Bros. production and the only color film clips they could use without having to pay exorbitant fees would have to come from Warner Bros. films. So when they go to the Trojan War, we see clips from HELEN OF TROY (1955). And when they go to the Crusades and other scenes from the Middle Ages, we see clips from KING RICHARD AND THE CRUSADERS (1954). Piracy and ship battles between England and Spain for supremacy of the seas? CAPTAIN HORATIO HORNBLOWER (1951). Elizabethan England? THE PRIVATE LIVES OF ELIZABETH AND ESSEX (1939). Western scenes? DODGE CITY (1939). There were some clips I didn't recognize, though, such as the shot of Rome burning. (QUO VADIS?, 1951, was an MGM production.) Producer-director Irwin Allen would expand on this practice of mixing cheaply shot studio scenes with more lavishly filmed clips in his TV series, \"Time Tunnel,\" some nine years later. (By then, of course, Allen would be at a different studio and have to rely on clips solely from 20th Century Fox.) The recent cablecast of this film on Turner Classic Movies (on March 14, 2011) was beset by technical problems. The film often froze up and went black. This happened most egregiously during two sequences, one with Cleopatra (Virginia Mayo) and one with Peter Minuit (Groucho Marx), so I missed several seconds from each. I must say I didn't recognize Ms. Mayo in the dark wig. In another sequence, 45-year-old Hedy Lamarr turns up as the teenaged Joan of Arc(!). Marie Windsor plays a much taller and older Josephine to Dennis Hopper's Napoleon. (Josephine actually WAS taller and older than Napoleon, but not by that much.) Shakespeare is described by Queen Elizabeth (Agnes Moorehead) as a \"young actor-poet,\" but is played by veteran character actor Reginald Gardiner, who'd been in films for 25 years at this point. Why couldn't they recruit bigger names to play Shakespeare and such other key historical figures as Columbus (Anthony Dexter) and Lincoln (Austin Green)? Silent star Francis X. Bushman (Messala in the silent BEN-HUR) plays da Vinci—and has no dialogue. Cathy O'Donnell plays an early Christian in Rome some two years before appearing in a vaguely similar role in the BEN-HUR remake. In one piece of gimmick casting, Jim Ameche appears as Alexander Graham Bell, a role closely identified with his more famous brother, Don Ameche. (I'm guessing they tried to get Don to recreate it, but were turned down.) Seven actors in this cast went on to guest star on TV's \"Batman\": Vincent Price, Cesar Romero, Reginald Gardiner, Edward Everett Horton, Francis X. Bushman, Marie Windsor and Ziva Rodann.For years I only knew this film as the last to feature all three Marx Brothers. On that basis, I'd always thought it was a comedy. It isn't. Still, it struck me as pretty funny to see an opening credits sequence where Francis X. Bushman, Franklin Pangborn and Dennis Hopper are among the many listed together ABOVE the title.","The opening titles of this historical epic  one of the most notoriously misjudged films in Hollywood history  boast no fewer than 25 stars but, having personally gone through it, I have to say that its reputation is entirely justified! I'd always been interested in it, of course, yet I'd practically given up hope of ever catching the filmand, eventually, I only managed to come across a soft-looking, panned-and-scanned VHS copy with forced Spanish subtitles (which will more than suffice under the circumstances).Actually, the central premise isn't half-bad  a tribunal in outer space(!), presided over by Sir Cedric Hardwicke, convenes to determine whether mankind should be allowed to go on living or else let it obliterate itself via the misuse of nuclear weapons! In fact, the opening half-hour or so is fairly decent but, as soon as one realizes that the film will be a constant parade of Hollywood stars stolidly appearing (portraying is hardly the correct term to use here) as famous historical figures  who are subsequently given little of consequence to do  it becomes a depressing, repetitive and altogether rather dull charade! At least, the main roles of The Spirit Of Man (a suave and gracefully aged Ronald Colman in his last film) and Mr. Scratch aka The Devil (a typically genial turn by Vincent Price) are ideally filled  something which, alas, can't be said of most of their colleagues: Hardwicke himself merely gets in a few inane phrases between Colman and Price's rebuttals, but, for good measure, we also have to contend with John Carradine (as a campily-dressed Pharaoh), Peter Lorre (as a thoroughly miserable Nero, which is ironic given that the role had often inspired actors towards hamminess!), Virginia Mayo (unrecognizable as Cleopatra), Hedy Lamarr (an embarrassingly miscast Joan of Arc), Dennis Hopper (as a wimpy Napoleon Bonaparte!) and, surely the weirdest casting choice of all, the Marx Brothers (appearing in their final team effort, albeit separately: Chico barely registers as a monk in the Christopher Columbus episode, Groucho incongruously appearing fully in character, with glasses and wisecracks intact[!], as obscure American Pilgrim Peter Minuit, and Harpo, ditto, as a mute and harp-playing Sir Isaac Newton)!! The various re-enactments (amidst which Colman and Price are free to roam) display a rampant use of stock footage  thus making the film seem more expensive than it actually is  and naturally end with the present i.e. 1957 crisis; in hindsight, the script's constant reference to the \"Super H-bomb\" is amusing and dates the show more than anything else! At a mere 100 minutes, such an ambitious enterprise was doomed from the start and, indeed, it feels too much like a crash-course in World History (intercut with elementary bits of Philosophy). Perhaps, the kindest thing that can be said about THE STORY OF MANKIND is that, for better or worse, it did pave the way for Irwin Allen's heyday as a producer of star-studded Hollywood blockbusters.","I can't understand why many seem to hate this.This movie ties together many of the overlapping settings of the historical and Biblical epics of the fifties, using set pieces, props, and costumes similar to those seen in other movies. Here, however, the story attempts to run through all of human history, with a frame story about the human race being on trial, with a guilty verdict meaning h-bombs will go off all over the world. The prosecutor is the devil, played with fiendish glee by Vincent Price. OK, so it's a little hokey calling the defender \"The Spirit of All Men,\" but I think that's one of the things that gives this movie a sense of period charm. The Spririt of Man is incidentally played quite well by Ronald Coleman, in his last film. It is also the last movie in which Groucho, Harpo, and Chico Marx all appear, but not together. Groucho plays Peiter Minuet buying Manhattan from the Indians, in a scene played purely for campy humor. Chico isn't funny at all as a monk who thinks the world is flat, and Harpo, we are told, is meant to be Isaac Newton, discovering gravity. Most of the other performances are well done, though.Other hokey things are that the trial is supposedly taking place in outer space, which is depicted as a region of clouds and blueness. There is something called \"The Great Clock of Outer Space,\" which, when striking midnight, may signal the end of the world.But at its heart, the movie addresses the problems of WMDs and the eternal question of whether Man is basically good, or basically evil; and poses it in what I think is an interesting way. Also, anyone who likes the look of costume epics of the fifties should like the look of this movie.","Mankind is on the verge of discovering the secret of the Super H-bomb so a special tribunal meets in outer space to discuss what to do. Arguing on behalf of mankind is the Spirit of Man (Ronald Colman). Arguing that humanity must be destroyed is Mr. Scratch (Vincent Price). They both use examples from history to make their cases.Here are some of the historical reenactments. Cavemen discover fire in the middle of an attempted murder and rape. Cleopatra (Virginia Mayo) kills her brother and seduces Caesar and Marc Anthony (Helmut Dantine). Peter Lorre plays a drunken Nero laughing while Rome burns. The most embarrassing episode belongs to Hedy Lamarr as Joan of Arc. Her Joan wears bright red lipstick and a terrible wig. Her trial is presided over by Henry Daniell dressed as Santa Claus. Agnes Moorehead hams it up as Queen Elizabeth I, who receives military counsel from William Shakespeare! Groucho Marx plays Peter Minuit in a painfully unfunny comedy segment where he rips off Indians for Manhattan island. Marie Wilson is a bimbofied Marie Antoinette. 21 year-old Dennis Hopper is a soft-spoken Napoleon with 37 year-old Marie Windsor as his Josephine. Among the other stars we see in this are Cedric Hardwicke as the celestial tribunal's judge, John Carradine as Pharaoh Khufu, Charles Coburn as Hippocrates, Chico Marx as a monk offering advice to Columbus, Edward Everett Horton as Sir Walter Raleigh, Harpo Marx as Isaac Newton, and Don Ameche's younger brother Jim as Alexander Graham Bell.Today Irwin Allen is best remembered for his contributions to television like Lost in Space or his '70s disaster flicks like The Poseidon Adventure. The Story of Mankind wasn't Allen's first film but it was his first notable one. This movie came about during the heyday of Atomic Scare movies. The decade was full of them, usually in a sci-fi setting. There were some great classics like The Day the Earth Stood Still made during this era rife with paranoia. This film has the reputation of being one of classic Hollywood's biggest stinkers. Personally, I like it! But part of why I like it is because it's so flawed. It's got an all-star cast, most of whom are laughably misused. The script is terrible with some of the corniest dialogue you'll ever hear and some truly cringeworthy speeches. The history is inaccurate and blends myth with fact. It's all filmed in lush Technicolor but on cheap sets with tons of stock footage. Still, I can't help but enjoy it. It's a movie that falls squarely into the \"so bad it's good\" camp for me. Taken seriously, it's ridiculous and offensive to your intelligence. Taken lightly it's quite a bit of cheesy fun.It has the distinction of being both Ronald Colman's final film and the final film to feature the main three Marx Bros. together (although they bafflingly share no scenes). By the way, listening to the Devil's point of view, it struck me how that is the more likely view we'd see advocated today, not only in films but in real-life discourse as well. Kind of depressing. Worth seeing for a variety of film fans but especially for fans of Price and Colman, who have two of the most pleasant voices the movies ever knew.","Just saw this for the first time on Turner Classic Movies. This was quite a good movie, in fact, I would say, it was a bold and courageous move by Irwin Allen considering the time period.Today the history as touted by Mr. Snatch (a great performance by Vincent Price) would not appear anything radical or new. However, we're talking about over a half-century ago when bluntly pointing out how Native American Nations were massacred trying to defend their land and homes instead of them being portrayed as savages attacking poor and noble pioneers who sought no gain other than leading a great country westward - that was sac-religious back then in the days of John Wayne- type history (sorry about that, Duke). Or bringing out (and not being denied by Man, played equally as great by Ronald Coleman) the manipulation and exploitation associated with events otherwise looked upon as noble in an age that fostered the Committee on Un-American Activities, conformity, repression of free speech, blacklisting and the ruining of so many people's lives - it was just about unheard of back then. Of course, most of the supporting cast performances were more campy than dramatic (the expression on Heddy Lamar's face playing Joan when first hearing her calling had me in stitches and reminded me of Bill Cosby's early-career Noah routine, when, as the Lord called upon him to build an arch, Noah replied \"yeah, right.... who is this really? Am I on Candid Camera or something?\"Again, if that film came out today it wouldn't be much, but for it to come out back then, I found that amazing.","The technological development of the H-Bomb has caused the court of heaven to put mankind on trial.Should man not be-allowed to proceed with his new invention or should he be allowed to blow himself to eternity? Somewhere in outer space (for it could hardly be held in heaven) the trial of the centuries takes place. Arguing for allowing man to blow himself up is Scratch (Vincent Price). Arguing for the goodness of mankind is The Spirit of Mankind (Ronald Coleman).Scratch and Mankind then take the court (and the audience) on a tour throughout history showcasing some of the most interesting and important events and people that have shaped the world in which we live. The premise of the film is similar to a Star Trek: The Next Generation episode where Picard and the Enterprise crew have to defend the obliteration of mankind from a high powerful being known as Q who has put mankind on trial.It is a film that touches on philosophical and theological issues but is more interested in highlighting historical events so it doesn't become a deep spiritual film filled with profound thought and insight. It starts out with an interesting premise, but as it travels along through history, although still interesting, seems somewhat respective and begins to be a tad bit tedious and thus maybe a little bit boring.Of the more interesting moments includes Groucho Marx as Peter Minuit who swindled Manhattan Island from the Indians and Harpo Marx as Isaac Newton. Chico Marx plays a monk advising Christopher Columbus about why sailing across the world would be a bad idea. How can you go wrong with the Marx Brothers.Overall 'The Story of Mankind' is interesting enough to watch especially if it is in a history class. It could have kept the hosts and perhaps could have had more engaging portraits of history. It has a fun premise and some good dialogue between Scratch and Mankind. But as an intriguing and gripping film about history it would be better to go with 'Bill and Ted's Excellent Adventure'.What does the court decide in the end? At the very least they decide to end the film.","The Story of Mankind when I saw it was a movie I initially found difficult to rate. Mainly because it is a big mess. Having said that somewhat, it is a mess that is worth seeing.The production values are hardly high art, but they are decent. The sets are okay, the costumes are interesting and the cinematography is not exceptional but not exactly cheap either. I liked the premise as well, and it started off decently with Sir Cedric Hardwicke presiding over things nicely. There is also some good performances. Ronald Colman gives far from his best performance, but he is very suave and convincing, Marie Antoinette is nicely coquettish and Agnes Moorhead chews the scenery with glee. It was also nice to see the Marx Brothers, Harpo and Chico aren't really that funny but Groucho is though there was the odd moment not to do with Groucho more to do with the writing and the way the characters were written that came across as more offensive than amusing. Best is Vincent Price, with his powerful voice and magnetic presence, he is gleefully wicked.However, the direction falls flat as if it is unsure of which direction to go whether it wanted to be a history lesson or an exercise in camp. The dialogue is mostly absolutely abysmal, but it is so hard not to laugh at how bad it is. The film goes at an uneven pace with some segments faster than others or better acted and written. The characters are little more than stereotypes and caricatures and badly explored ones at that, and there are some unintentionally hilarious ideas incorporated into the story especially with Joan of Arc. I liked the leads and Moorhead and Groucho, but the rest of the cast are just bizarre. Peter Lorre though isn't too bad, perhaps too young and somewhat too effeminate too but there are some moments of unexpected poignancy, but Hedy Lamarr is woefully miscast as Joan of Arc and a very over-the-top Dennis Hopper does nothing with the role of Napolean.Overall, The Story of Mankind is a mess, but it was worth watching and I personally wouldn't put it on my worst movies ever list. 4/10 Bethany Cox","I saw this film on a late, late show on television a long time ago (pre-cable, if you van believe that!) It was impossible to follow the plot. Was there one? The fun is in spotting the famous actors doing bits. Groucho, Chico, Harpo. The best reason to watch any movie. Together, they would have been more of a hoot!Irwin Allen loves these all-star studded set pieces but believe me, The Towering Inferno was \"toweringly\" better!Most didn't make sense and most seem disjointed, but if it comes on late night again, I'll be there! Can't take my eyes off it!","The Story of Mankind is a noble attempt to argue the case of humanity, whether he is inherently good or evil, as he has just developed the \"super H bomb.\" Vincent Price is at his best as the Devil arguing against humanity. It was a poor choice in general to reconstruct so many scenes of human history, especially since the screenwriter(s) changed the events so much as to make them unrecognizable. The casting is very odd and distracting in these sequences, too. The film is chock full of once-brilliant character actors like Agnes Moorhead, who embarrasses herself as Queen Elizabeth, and especially the Marx Brothers. I guess one of the biggest reasons you might want to see this is to see what Groucho, Harpo, and Chico looked like in technicolor (which, if you remember Groucho in The Big Store, was too expensive for their earlier vehicles). They among the numerous actors retain their vaudville characters in this film. Groucho plays Peter Minuit, the man who fleeced Indians out of Manhattan island. He makes suggestive comments towards the chief's daughter, but none of them are funny. Chico is on screen for 30 seconds as a priest arguing about the shape of the world with Columbus (he is the only one to retain his dignity in this movie; at least his character was Italian). Harpo plays Isaac Newton in a particularly pathetic sequence. He starts to play his harp, and apples drop onto his head. Then he mugs for the camera. No Brother fell further from grace than Harpo.Basically, The Story of Mankind forgets its purpose, worrying too much about the elaborate recreations than the philosophical argument. This plot could have made a good film, I think. Its ending is one of ambiguity, which is where it should be. It tells us that the filmmakers did intend to make a serious film. I say that this is worth ignoring. For a better film with the same message, we all have and still love to watch The Day the Earth Stood Still. 5/10.","What a waist of time! Well... almost! This is your only chance to see the Marx Brothers in color. Chico had a very bid part, Harpo seems so old... But Groucho is wonderful as Peter Minuit. And he's so... Groucho!  The only one good thing is Vincent Price. What a voice that man had! The rest is simply awful, with clichés, stock shots from other cheap movies, loose interpratation of history of the world, miscast (like Peter Lorre as Nero. Don't you know that Nero was young?). This is perhaps one of the first attemps from Hollywood to bring back people to the cinema houses, while everyone's watching television. There will be a lot of these film in the early sixties (How the west was won, Mad mad world, Yellow Rolls Royce) when producers cast a lot of stars, to attract people to the movie theatre. This one is the cheapist of all. But we have the Marx brothers in color!","The major draw of THE STORY OF MANKIND is the incredible roster of stars and familiar faces. It seems anybody who was anybody in Hollywood signed on to this movie. Just watch the opening titles. In truth, though, the actors and actresses are mostly a decade or two past their primes and many of the familiar cast members are second-stringers from yesteryear. The biggest names are probably Hedy Lamarr and Ronald Colman, in a cast that also includes Vincent Price, Cedric Hardwicke, John Carradine, Charles Coburn, Franklin Pangborn, Edward Everett Horton, Peter Lorre, Agnes Moorehead, Virginia Mayo, Cathy O'Donnell, Henry Daniell, Melville Cooper, Cesar Romero, a young Dennis Hopper, and the aging Marx Brothers.The only \"stars\" of the film are Ronald Colman and Vincent Price, who serve as opposing sides to the argument on the worth of humankind. The movie is set at a celestial trial to determine whether to save mankind or let it destroy itself with its nuclear weapons. (This is an Atomic Age fable.) Colman represents mankind and defends its goodness throughout history. Price is the devil (Mr. Scratch) and reminds the court of the evil in human history.The well-known actors and actresses only appear on-screen in cameos that last about a minute. They play famous historical figures whose stories serve to prove some point at the trial. Some stars are barely recognizable and some roles have no dialogue. The big names don't have screen time together, except for Price and Colman. (The Marx Bros. are even separated.)The movie itself is really kind of a letdown. It seems obvious that the historical crowd scenes and action scenes are borrowed from other films, and the new scenes with the cast members are sometimes laughably under-produced. (Watch for the scene showing Joan of Arc's capture.) The mixing and matching is distracting and emphasizes the cheapness of the new footage. And, despite an impressive cast of accomplished Hollywood talent, the cameo performances are mostly terrible. (The highlight is Groucho Marx, putting his spin on the sale of Manhattan.)As a history lesson, this film won't do. And as an entertainment, it falls pretty far short. The movie is still of interest for the cameos, and it's fun to play \"Guess Who That Is\" with other movie buffs in the room. But it's disappointing that all of these names couldn't have come together in a better movie. The premise could have been executed better, and I'd be interested in seeing a new attempt at such a star- studded history lesson.","Oddball movie, where major events in history are looked at from above.Well it might be the campiest movie ever made (so bad it is good) but this is NOT the worst movie ever made as many have said. But my IMDb review history/bio history reveals a love of Irwin Allen so perhaps I just dish up anything this guy makes?The Story Of Mankind takes us on a Vincent Price (Egghead in Batman) tour of history and many of the events showcased also turned up in Allen's 30 episode TV series The Time Tunnel (1966-67). But Tunnel took itself all so very seriously...unlike this movie!Vincent Price, Peter Lorre and Grouch Marx turn out brilliant performances!The general look of the film is grand and colourful.I would call the film good fun rather than a classic, but not anywhere near as bad as many have said over the years.","Leave Ed Wood alone. To call \"Plan 9 from Outer Space\" the worst film ever made would be to deny this abysmally vulgar heap of Hollywood guano its rightful title. This pretentious fusion of witless whimsy and bathetic sociopolitical \"commentary\" actually does seem to be formed along the lines of \"Plan 9,\" with badly-staged scenes of down-on-their-luck actors on cheap sets interspersed with what appears to be footage of battle and crowd scenes cribbed from higher-budget epics. But whereas \"Plan 9\" occasionally manages to be funny when it means to be and reasonably entertaining overall, this tacky pageant is appallingly lacking in basic showmanship, with scenes ranging from offensively unfunny (the disgusting burlesque of Groucho Marx stealing Manhattan from the Indians) to low camp (Hedy Lamarr attempting to impersonate Joan of Arc hearing her \"voices\") to tedious (Dennis Hopper doing absolutely nothing with the role of Napoleon) to the unexpectedly poignant performance of Peter Lorre as the psychotic Nero. Give the worst director trophy to Irwin Allen, for turning so much into so little.","What a joy! What a perversely perfect two hours of \"entertainment\"!!! It happened that I requested this cinematic phantasmagoria when visiting a friend the other evening, and now it's going to be broadcast. Because it was rarely on TV when I was a kid, it became a semi-holy grail for me as a Marx Brothers fan, since it was cited again and again in properly desultory fashion in books about the team as an unsatisfactory end. It was the last feature film the Marxes did together,and given the blithering idiocy and boneheaded pseudo-dramatics of the picture overall, it's a wonder any one of the cast members' careers survived. It was also the final movie of Ronald Colman, who comes off suave, sympathetic and dignified, if incredibly boring. The same can be said of Vinnie Price, except that his arguments make more sense than Colman's. Price is the Devil, \"Mr. Scratch\" (a name lifted from DEVIL & DANIEL WEBSTER), arguing that Mankind is a write-off and should be allowed to destroy itself by the \"Super-H-bomb\" (presumably a cousin to the Q-Bomb in MOUSE THAT ROARED). Colman is the voice of \"Yes, but--\" -- pointing out the nicey-nice things an occasional human being has done for the species.In his third feature, Irwin Allen completes his magnificent \"trilogy\" of the History of Everything. A P.R. hack whose great talent was promotion rather than production, Allen began his career with THE SEA AROUND US, which bizarrely won an Oscar and so appalled author Rachel Carson so much she never allowed any other book to be adapted by Hollywood. Allen followed this by the equally dumb THE ANIMAL WORLD, a substandard and witless�riff on the Disney sort of documentaries whose only redeeming sequence was the Harryhausen/O'Brian dinosaur segment.The misbegotten set-up is a swipe from the marvelous fantasy A QUESTION OF LIFE & DEATH from the Archers, with its stylized, fog-bound \"Heaven,\" where Cedric Hardwicke presides from an over-sized judge's bench which appears to be a leftover from a William Cameron Menzies nightmare. A motley crowd of heavenly extras-- which apparently includes Fu Manchu-- sit on a semi-circle trying not to choke from the overwhelming dry-ice fog, listening to Price and Colman talk-- and talk--- and talk some more. Charles Bennett's \"adaptation\" of Henrik van Loon's chatty and long-forgotten history book is so verbose, it's akin to the nonsensical soliloquies given to John Carradine in WIZARD OF MARS or HALF-HUMAN. I'd forgotten just how much like a soporific college lecture this extravaganza was. Okay, if you HAVE to listen to someone talk, it's wonderful that those voices are the mellifluous Colman and Price. But man, they just never shut up.As jaw-droppingly pedantic as their verbal tennis match is, the multiple historical vignettes are even more delicious. The \"comedic\" bits are utterly drained of humor and pacing; the \"dramatic\" bits are so potted and abbreviated, they offer all the emotional depth of a ten-second bit from a coming attractions trailer, and are often more perversely funny than the intentional humor: Virginia Mayo's Cleopatra scenes, for instance, where she plays the Queen of the Nile as a simpering Valley Girl.Then there's the stock footage, a feast for the eyes: bits from ELIZABETH AND ESSEX, CRIMSON PIRATE, LAND OF THE PHARAOHS, and any other Warners picture Allen could lay his paws upon, as long as it was Technicolor. Rather than add production value, this material shows how crummy and cheap the rest of the movie is in comparison, with its cramped sets, painted \"stone\" walls straight out of BRIDE OF THE MONSTER, and a dearth of extras.Screenwriter Charles Bennett knew full well Allen was a tasteless and untalented schmuck, and apparently continued his professional relationship with him for several years simply for the money. The result here, one can only hope, represents more Allen than Bennett, who certainly has some good scripts in his resume. Given the crappy screenplay and Allen as \"director,\" it's no wonder the performance levels vary so wildly. Agnes Moorhead's turn as Queen Elizabeth is the epitome of camp: a shrieking, over-the-top barnstorming declamation, bouncing off the underplayed Cesar Romero (as a suave representative of the King of Spain) and a subdued Reginald Gardner as a middle-aged Shakespeare. The Napoleon vignette, with Dennis Hopper (reportedly wearing Brando's hand-me-down costume from DESIREE) opposite Marie Windsor's Josephine is interesting because the two performers actually appear to be acting in the same movie. Likewise Hedy Lamarr as Joan of Arc, who I happen to adore. Yes, she's too old for the role of the teen aged Maid of Orleans, but she's taking it seriously, and is given a role unique in her oeuvre. Her interaction with inquisitor Henry Daniell actually manages some brief moments of drama. Daniell, with only about four lines of dialog, manages to wrest both sympathy and sternness from the script.My friend Kathryn pointed out rightly that the attitude of the back-and-forth fate-of-mankind arguments is very, very 1950s. It's amazing how many ways Bennett (and Irwin Allen, let's not forget the talented Master of Disaster) can say exactly the same thing in so many ways. Over, and over. And over.It is fascinating for its collection of genre-related performers: Price, certainly, but also Lorre, Carradine, Hardwicke, Daniell, Rossitto (who waddles through Lorre's Nero/orgy segment). It's also fascinating as a cinematic train wreck not topped until the likes of CASINO ROYALE and SKIDDO, where every directorial and artistic choice is mind-bogglingly cheap, wrong and astounding. As for the three Marx Brothers-- god, what a waste. You actually get all three of these guys, one last time for posterity, and you put them in separate segments? Damn you, Irwin Allen.Highly recommended!","For years, I read about The Story of Mankind as one of the worst movies ever as cited in the book \"The Fifty Worst Films of All Time\". I also had a copy of Henrik Van Loon's book of the same name it was based on which I just read. It was updated to the '80s, the copy I had. So having read the book, I went to the Dailymotion site and watched the movie. It has an interesting wraparound segment with Ronald Colman representing the good side of Mankind and Vincent Price representing the bad side in court before Judge Cedric Hardwicke. Then we visit the various historical segments. Virginia Mayo as Cleopatra is perhaps one of the most inane of those though I got a hoot out of Agnes Moorehead as Queen Elizabeth I. My main interest was seeing The Marx Brothers in one last film together. Only they're not together here: Chico is an adviser to Christopher Columbus, Harpo is Sir Isaac Newton who plays his harp for the last time on film, and Groucho is the guy who swindled the Indians out of Manhattan! Appearing with him in that segment was his then-wife Eden Hartford as the Indian daughter Laughing Water. His daughter Melinda also appeared in a separate segment as a little girl. Both Groucho and Harpo are pretty funny while it's amusing just recognizing Chico when he's on. Producer-director was Irwin Allen doing his first of his all-star productions though this wasn't as epic-laden as his subsequent disaster movies of the '70s as the frequent use of stock footage here exhibits. In summary, The Story of Mankind is not even a good movie, but it's certainly interesting to watch for the way certain attitudes were presented at the time concerning the way history was viewed at the time. P.S. For anyone who thought Harpo wore a blond wig, it must have been quite a surprise to see him wearing a red one in this-his only color film appearance!","\"The Story Of Mankind\" is a film with a poor reputation, which may at first strike you as odd considering its incredibly star-filled cast, but it will become less odd if you actually see the movie: a lot of those stars have insignificant, blink-and-you'll-miss-them cameos, and most of them are totally miscast and unconvincing. The beginning is promisingly strange and surreal, but soon you realize what a chintzy production this really is: much of it consists of Ronald Colman and Vincent Price reacting to stock footage of other films; the new scenes shot specifically for this film look much cheaper. But Vincent Price is excellent through it all (his arguments are more convincing than Colman's!), Colman and Judge Cedric Hardwicke are good too, and Groucho Marx's funny, deliberately anachronistic sequence is also worth seeing. **1/2 out of 4.","Before Irwin Allen was nicknamed \"Master of Disaster\" in the 1970's, he produced and directed this history lesson, based on Hendrik Van Loon's book.The plot is that man has discovered the \"Super H Bomb\" sixty years ahead of schedule. A court convenes in Outer Space as The Spirit of Man (Ronald Colman), Mr. Scratch (Vincent Price) and his apprentice (Nick Cravat) argue whether man should be saved or allowed to blow themselves up. A parade of characters from history, good and evil, appear to make various points. With the exception of Bobby Watson, who plays Hitler and brings a note of unwelcome reality to the movie after ninety minutes of comic book history, the \"bad\" characters get most of the good lines and laughs. The \"good\" characters, with two exceptions, get the dreary lines and slow down an entertaining show; in some cases, they bring the movie to a screeching halt.Vincent Price was inspired casting, and he carries off the role with admirable sarcasm, irony, and the occasional sneer. Nick Cravat acts with his eyebrows, and adds to the fun. Groucho Marx is a funny Peter Minuit, and Harpo Marx has maybe the best bit in the movie, as a harp playing Isaac Newton. Virginia Mayo's Cleopatra is amusing for the wrong reasons; she sounds like she came to Egypt by way of Atlanta. Agnes Moorehead, as Elizabeth I, roars and overacts her way through a badly written scene. Peter Lorre is a memorable Nero. In the three minutes allotted her scene, Marie Wilson sketches a brainless Marie Antoinette. John Carradine, as the pharaoh Khufu, cannot keep a straight face and grins at the camera in his first scene.In his last film, Ronald Colman as The Spirit of Man gets the dreary lines and seems to think he's in a Serious Film. Hedy Lamarr is a Viennese sounding Joan of Arc. Charles Coburn as Hippocrates lectures the camera. Cathy O'Donnell stops the film as an early martyr. Chico Marx got star billing, but I couldn't spot him in the film.This is a moderately fun watch if you are into \"so bad it's good\".","MEGA-CAST PICTURES have been a phenomenon that has periodically surfaced throughout the history of the motion picture. One only has to look at such as the super-spectacular T'S A MAD, MAD, MAD, MAD WORLD to see what we mean. To a lesser degree, there's A GUIDE FOR THED MARRIED MAN and even Mel Brooks' SLENT MOVIE; which also fit the mold.AS FOR TODAY'S honored feature, THE STORY OF MANKND takes the idea perhaps a step further by making this multi-faceted cast thing the central tenet of the film; rather than having its being a mere single, featured novelty. Hence, what would have been played as a series of comical bars is transformed into the thing that we focus on.WHY THIS STORY was ever considered for adaptation to the screen, silver or otherwise, remains a puzzle to us to this very day. This is a question which has plagued us for the over forty years that has transpired since we viewed it on the CBS Late Night movie.FIRST OF ALL the film has an unstable and shaky foundation; being based on the novel THE STORY OF MANKIND. Dutch-born American writer and road show Einstein, Henrik Van Loon. Mr. Van Loon must have been an incurable egomaniac and a Deity-wannabe to even undertake such a project.WHAT EMERGED WAS a strange mixture of the Almighty-friendly fantasy in the mold of HERE COMES MR. JORDON or IT'S A WONDERFUL LIFE being blended in with a PERRY MASON EPISODE-type courtroom drama. Mankind, itself, is being put on trial; with all of its rose petals and thorns being weighed by the Judge. In this case, it's Sir Cedric Hardwicke.BEING THAT THIS is an American film from an equally American novel, both sides are allowed the benefit of counsel. The Devil (Vincent Price) prosecutes and 'The Spirit of Man' (Ronald Coleman acts as the defense. (Schultz says that was really some \"modest little name!\") WHAT FOLLOWS IS seemingly dead, serious drama interspersed with short vignettes of stories throughout history. Present to give life to the chosen historical figures are the likes of: Hedy Lamarr (Joan of Arc), Groucho, Chico & Harpo Marx (as Peter Minuit, a Monk and Sir Isaac Newton respectively), Viorginia Mayo (Cleopatra), Agnes Morehead (Queen Elizabeth I), Peter Lorre (Nero).OTHERS ROUNDING OUT the players include, in some equally miscast roles are: Caesar Romero, John Carradine, Charles Coburn, Dennis Hopper, Marie Wilson, Helmut Dantine, Edward Everett Horton, Reginald Gardinier, Henry Daniell, Marie Windsor, Franklin Pangborn, Cathy O'Donnell, Melville Cooper, Francis X. Bushman an d Jim Ameche.* THE RESULTING PRODUCT would be acceptable if it were done in the spirit of a movie such as Mel Brooks' A HISTORY OF THE WORLD: PART ONE**; but it was not a farce. It was, I fact, dead serious.WRITING SOMETHING LIKE \"THE CONCISE GUIDE TO CREATION\" would be a great companion piece. Why didn't Mr. Irwin Allen try that? NOTE: * Interesting that actor Jim Ameche was cast as Alexander Graham Bell as his better known brother, Don Ameche had done this title role in THE STORY OF Alexander GRAHAM BELL.NOTE ** This has got us wondering if this THE STORY OF MANKIND wasn't the inspiration for Mr. Brooks' HISTORY OF THE WORLD?","In heavenly outer space, two Angelic beings observe people on Earth have developed a \"super H-bomb\" which can destroy all human life on the planet. To see if Mankind is worth saving, a \"High Tribunal\" is convened. Defending the human race is \"The Spirit of Man\" (Ronald Colman) while devil's advocate \"Mr. Scratch\" (Vincent Price) prosecutes the case. This doesn't sound like a bad idea for a movie at all, but it is executed poorly. Participants are amateurish, bemused, and/or embarrassed. Producer/director Irwin Allen used the idea more effectively when commissioning the script for \"The Prisoners of Space\" (1966), wherein the Tribunal visited his \"Lost in Space\" TV characters.** The Story of Mankind (11/8/57) Irwin Allen ~ Ronald Colman, Vincent Price, Cedric Hardwicke, Groucho Marx","O yes. And Bless this wonderful mess indeed. As sometimes I say even today before I sit down to a meal. This movie is a meal for the historical mind. A jaunt through the pages of the history of man. Yes, man is tainted with what the Christians , myself among them , call sin. If he were not, there would be no need for a Saviour. Even before Christianity , To the earliest of the Pharohs, he was defiles, And then Moses came along, as mortal as even he was. There has been competition since the dawn and the fall of man, which is referenced by Adam and the Apple. Fortunately Isaac newton knew what to do with the apple. Such goes on today...It is merely more pronounced even in 2013 more so than even 1957...It is the constant and immortal struggle between good and evil. Mr Price, perhaps not the role for which he will be best remembered, but he was CERTAINLY well suited for this one. Old Scratch. Bless This Mess.. Amen.","Movie about some High Tribunal that realizes men on Earth have discovered the super H-Bomb 60 years ahead of schedule. (No--it makes no sense to me either). They debate whether to let man destroy the Earth or intervene. The Spirit of Man (Ronald Colman) argues that men are good and should be saved. The Devil (Vincent Price--who else?) says they are evil and should just let them kill themselves. They go through history pointing out the good and evil people and deeds. Unfortunately these are enacted for the audience.You really have to wonder WHAT these people were thinking. This has some of the dumbest casting I have ever seen in a motion picture. Virginia Mayo as Cleopatra! Peter Lorre as Nero! Hedy Lamarr as Joan of Arc! The worst has to be Dennis Hopper as Napoleon!!! Ronald Colman, looking lost, gives one of his worst performances in what was, sadly his last role. Seriously, where were their agents when they agreed to this? These are all talented actors giving their worst performances. This turns into little more than a boring history lesson with lousy acting, dialogue and cheap sets. To make matters worse there's plenty of stock footage (obviously from other movies) of wars thrown in this in a vain attempt to keep the audience awake.The only actors that don't embarrass themselves are Price (having a whale of a time), Agnes Moorehead (REALLY chewing the scenery as Queen Elizabeth), Marie Wilson as Marie Antoinette and the Marx Brothers (who--for some reason-don't share a single scene together). This was (understandably) torn apart by critics and bombed at the box office. It is kind of fun to tune in to see all these actors portraying (badly) historical figures but it wears thin pretty quick. As I said before this is little more than a boring history lesson with a lousy script and bad acting. Avoid."],"review-user":["cariart","boris-26","bkoganbing","Sargebri","BrianDanaCamp","Bunuel1976","medievalmike","utgard14","joe d","fom4life","TheLittleSongbird","gleetroy","zetes","MarioB","jimjo1216","StuOz","Anne_Sharp","tednewsom","tavm","gridoon2018","calvinnme","redryan64","wes-connors","lewisfindleygcpbc-129-937520","preppy-3"],"review-date":["29 November 2000","22 November 2001","17 November 2007","16 April 2003","17 June 2011","17 December 2008","17 April 2006","26 November 2014","16 March 2011","7 August 2011","27 March 2011","17 September 2006","21 December 2001","6 January 2001","10 August 2011","11 January 2017","30 October 2001","15 November 2011","30 May 2017","31 December 2016","10 October 2016","14 August 2015","6 August 2011","23 April 2013","16 March 2011"],"review-rating":["6","4","5","3","6","8","4","5","5","5","1","5","6","6","6","2","6","1"],"review-title":[" Campy Classic 'Judgment Day' Tale!\n"," A proud mantlepiece of my video collection!\n"," Treasure Every Moment The Advocates Are Before The Judge\n"," A Classic Turkey\n"," Misguided \"epic\" perked up by subversive ideas, stock footage and gimmick casting\n"," THE STORY OF MANKIND (Irwin Allen, 1957) **\n"," Despite some goofiness, this movie is cool! I want it on DVD!\n"," \"I direct your attention...to the Great Clock of Outer Space.\"\n"," A Bold Film For It's Time\n"," The Story of Mankind in under 2 hours\n"," A mess, but it is a mess worth seeing\n"," A comedy? A Drama? It's a dog, But it's like car wreck. You can't take your eyes off it!\n"," Ambitious but wrongheaded film philosophizing man's worth in the universe\n"," Deeply bad\n"," Human history as told by Hollywood history\n"," Time Tunnel Meets Adam West Batman\n"," What a piece of work is \"Mankind\"\n"," Delightfully dreadful\n"," The Story of Mankind is certainly fascinating to watch if not always very entertaining depending on what you get out of it...\n"," Stock Footage: The Movie. But Vincent Price is excellent.\n"," Ronald Colman makes his last film appearance\n"," Close to being a Lampoon, MAD MAGAZINE Style\n"," Irwin Allen Drops a Bomb\n"," A Mess? Who said THAT?\n"," Stupid and boring\n"]}