{"review-url":["http://www.imdb.com/title/tt0064990/reviews"],"review-text":["This is one of the best films I've seen in the last years.Belmonndo and Deneuve shine in their respective roles, he as a naive plantation owner and she as an enigmatic trickster.Words won't do this masterpiece justice,suffice it to say that this is a movie that explores the darker side of love and the pain,humiliation and capacity for self-delusion that go with it, although it's dressed as a film noir. Forget that feeble remake with Jolie and Banderas, see the genuine artticle instead and treat yourselves to some moments of great cinematic beauty.","I've slowly been collecting the films available on DVD of both Catherine Deneuve and Francois Truffaut. Both actress and director have done some stinkers in their time - fortunately Mississipi Mermaid is not one of them.Next to \"The Soft Skin\", coincidentally staring Deneuve's sister (the late Francoise Dorleac), this would have to be my favourite Truffaut film.As well as directing, Truffaut also wrote the screenplay. Something that always strikes me about Truffaut is his almost childlike innocence when presenting a story -- one could almost call it naivety.There's a scene towards the end of the film where Belmondo returns to the apartment in Lyon with the remains of the loot. He rings the doorbell and Deneuve answers wearing a negligee. In the time it takes Belmondo to reach their room from the street, Deneuve changes into her dress, puts on her best pair of stockings and shoes, then lies on the bed and pretends she is asleep. It's a scene that could almost come from the mind of a child - but that's Truffaut for you.Watching Catherine Deneuve in her films of the late 60's is indeed a sensory pleasure. She is so extraordinarily beautiful it is almost painful for us to watch. Incidentally, for those fans, there are a couple of topless scenes of her in this film - indeed a sinful pleasure.I disagree with previous posters. I see nothing 'Hitchcockian' about the film at all. As for the 'look' of it - i love the look of the older film stock used in the 60's. It certainly gives films of this period a unique look.Highly recommended for both Deneuve and Truffaut fans......","Welcome to the story of a single but very rich man who finally is going to marry a woman that he never saw in an arranged marriage, and it will turned out to be an astonishing surprise, after he discovers how beautiful this woman is, and then it will be a living nightmare when she reveals through strange actions that she's not the one he would marry. This story is more familiar to new audiences who might have watched the horrendous \"Original Sin\" (2001) with Angelina Jolie and Antonio Banderas in the main roles. The only vantage that the remake has over Truffaut's film is the awesome sex scenes which makes voyeuristic viewers go crazy over the bold moments of a poor film.The French version has Catherine Deneuve and Jean-Paul Belmondo in a more romantic story that breaks into a good thriller. It has some weak moments but still a good film that is directed by one of the most incredible and hard working directors of all time. The performers are elegant, and the way both actors portray their roles, in a mysterious and complex style makes of \"Mississippi Mermaid\" a very intriguing film where the next moment is the most interesting, the most awaited, it's full of surprises (by the way the ending is different than the one unbelievably made in the remake).Watch it without creating too much expectations and you'll enjoy it. 9/10","In Reunion Island in the Indian Ocean, the owner of a cigarette factory Louis Mahé (Jean-Paul Belmondo) is engaged through correspondence with Julie Roussel and he does not know her. When Julie arrives in the island to get married with Louis, he waits for her in the docks but Louis does not recognize Julie in the passenger vessel and finds that she is totally different from the picture she had sent to Louis. They get married and Louis shares his bank accounts with her. When Julie's sister writes a letter to Louis asking her sister to write to her, Louis discovers that the woman is not Julie that is missing. Further, he finds that the woman has cleared his bank accounts and left the island. Louis and Julie's sister hire an efficient private detective Comolli (Michel Bouquet) and Louis travels to France seeking the woman, but he has a nervous breakdown in Nice and is submitted to an intense sleeping therapy in a clinic. He recovers and finds that the woman, actually Marion Vergano (Catherine Deneuve), works in the Phoenix Club Privé in Antibes and lives in the low-budget Monorail Hotel. Louis breaks in her room and when she arrives from the club, she tells that she was happy with him but her former dangerous lover Richard had blackmailed her. Louis is still in love with Marion and escapes with her to the countryside. But Comolli is chasing Marion in France accused of murdering Julie.\"La Sirène du Mississipi\" is a film-noir by the great director/writer François Truffaut, with an unconventional love story of passion, murder and love that hurts. The femme fatale Catherine Deneuve is astonishing, probably in the top of her beauty and is delightful to see her face and the topless scenes on the road and in the room. Jean-Paul Belmondo is very athletic, and the sequence when he escalates the wall of the hotel is impressive. Catherine Deneuve makes this film worth and gives credibility to the passion and lust of Louis. My vote is eight.Title (Brazil): \"A Sereia do Mississipi\" (\"The Mississippi Mermaid\")","I am surprised that nobody has yet pointed out that the ending in the snow is an homage to Jean Renoir's \"Grand Illusion.\" The film is dedicated at the beginning to Renoir.Jean Renoir was the great humanist director. For him, all that matters is how we treat human beings. The same here for Truffaut. The film tells us that it does not matter if you're rich or poor, male or female, upholding the law or fighting it, the only thing that matters is love. This is a romantic film that has occasional touches of a good mystery/detective/noir film. The Hitchcock film that it most reminded me of was \"Marnie\". There, like here, it is hard to know if crime or patient love will win out in the end.I did not care much for the New Wave style editing, which seemed out of sync with the dramatic story at times. The many shots of Belmondo driving kept reminding me of the beginning of \"Breathless.\" The color seemed a bit dull and washed out.The locations are lovely, but Truffaut seems to have only one thing on his mind, the relationship between the lead characters, Louis and Juli/Marion. The characters and the audience think they know each other, but the film keeps fooling them and us. We are constantly getting new information that makes us re-evaluate who they are and they are constantly surprising each other. For example, Louis has been telling Juli/Marion how much he loves her and how beautiful she is and then suddenly he gets upset and tells her how there are many of her kind - she is not really a woman or a girl, but a \"chick\". The term \"chick\" is far more demeaning here then the term \"bitch\" or \"slut\" could ever have been. He tells her that her cold attitude actually makes her ugly. Watching the scene, one thinks about how easily and naturally men can degrade women, even women they love.The film is a bit long and occasionally meanders, but it is emotionally intense at many points along the way. It seems that nothing is happening and then suddenly there's a surprise that makes you think, \"Oh my goodness, I didn't expect that.\" It may not be one of Truffaut's best films, but second-rate Truffaut is still better than 90% of other directors' best stuff.","\"Julie, you are adorable,\" says Louis Mahe (Jean-Paul Belmondo) to his beautiful new mail- order bride, Julie Rousel (Catherine Deneuve). \"Do you know what that means? 'Adorable'. It means worthy of adoration.\" Louis is a wealthy tobacco grower and cigarette manufacturer on the French island of Reunion in the Indian Ocean. When Julie arrived on the island, she didn't look like the photograph she had sent him when she agreed to be his wife. She says she was timid and decided to send the photograph of her sister. Louis is enchanted by her beauty and understands her caution. They marry, and Louis becomes a husband deeply happy. He tells her she is worthy of adoration just a day or two after he arranges to change his personal and business accounts into joint accounts. That evening, Julie has disappeared, cleaning out both accounts. Louis goes to France, has a breakdown, and then by chance sees Julie in a newscast about a new nightclub and the women there who are hostesses. Louis learns she is really a woman named Marion Vergano. Marion's history would lead only the most obsessed of men to think a happy ending could be in the cards. Most of the movie places us in France after Louis has found her and accepted her as Marion Vergano Mississippi Mermaid, written and directed by Francois Truffaut, is a movie of Louis' obsession, of sexual psychosis, of parasitic selfishness, of stolen identity and of rat poison, with a lot of self-revealing (some of it even true) dialog thrown in. As much as I think comparing one director to another is usually pointless, in this case Truffaut may have watched Vertigo, Psycho and Marnie once too often. Still, murder at the top of the stairs, the star power of Deneuve and Belmondo and some eccentric passing opinions (Louis thinks Johnny Guitar is \"a love story, with lots of feeling in it.\"), all handled with Truffaut's characteristic confidence isn't something to pass by. The downside is that Mississippi Mermaid, despite all of its advantages, at times veers too close to melodramatic parody. \"You mustn't cry, my dear. It's your happiness I want, not your tears.\" \"I'm learning what love is, Louis. It's painful. It hurts me.\" It sounds better in French, but the meaning is just as soppy. Truffaut adapted his movie from the pulp mystery novel, Waltz into Darkness, by Cornell Woolrich writing as William Irish. The movie didn't do too well the first time out, but then underwent a rediscovery of sorts. Unfortunately, that meant articles by people who teach film studies at universities. One such person wrote, Mississippi Mermaid \"remains a fascinating exploration of the major themes essayed by movie melodramas of betrayal - a sort of distillation of the amoral nucleus of Double Indemnity and the wilder settings of Key Largo.\" Distillation of the amoral nucleus? I don't even know what an amoral nucleus is. The salient point, for me, is that films such as Double Indemnity and Key Largo are above all else tightly told stories. I think Truffaut with Mississippi Mermaid started with a nice, nasty, obsessional pulp tale, but then tried to do too much with it.","This agreeable French movie deals about a millionaire owner of a tobacco factory on an African island nearly to Madagascar named Louis(Jean Paul Belmondo). He's a single man looking wife, then he advertises a bride and gets a gorgeous woman named Julia(Catherine Deneuve). When she spontaneously appears turns out to be much more attractive than expected. He marries to Julia but she suddenly disappears.A French eye private(Michael Bouquet) is hired by Julia's sister and soon he's on the trail of his previous spouse. Later Louis encounters her in a dancing-hall under another name. In spite of the romantic delusion and everything, Louis goes on enamored with his enigmatic wife.This film is a splendid drama plenty of betrayal,deception, killing, theft and Hitchcockian suspense. Good performances by Jean Paul Belmondo as young proprietary of a cigarette company who seems determined to fall under the spell of a femme fatale and a wonderful Catherine Deneuve as suspect heroine. The film gets several references to the American cinema, but Truffaut(400 blows) was a fervent moviegoer, such as : Johnny Guitar, Colorado Jim, Bogart, and Hitchcock.The USA version was cut numerous minutes and deserves an urgent restoring and remastering. Loosely based on the novel titled'Waltz into darkness' by Cornell Woolrich (Rear window and screenwriter of Alfred Hitchcock hour) who also was adapted in 'Truffaut's The bride wore black'.Colorful cinematography by Denys Clerval(Stolen kisses) and atmospheric musical score by Antoine Duhamel, Truffaut's usual musician.This is one of the best of his suspense movies along with ¨Farenheit 451 and Shoot the piano player¨. Remade by an inferior version by Michael Christofer(2001) with Antonio Banderas, Angelina Jolie and Jack Thompson, full of erotic and lust scenes.","The film is a joy to watch, not just for the plot, which is gripping, but also for the superb performances of the actors, Deneuve and Belmondo. Though considered a 'flop' on its first release it has become a critical success, and it is clear to see why. Deneuve's acting style suited the film brilliantly. she constantly gives the impression that she is holding back or hiding something, and her character in this film is. I will not spoil it with saying what, though it is divulged fairly early on. Belmondo is lovable as the fairly naiive but in love tobacconist. I would recommend this film to all Truffaut or Deneuve fans. It is a brilliant Hitchcockian style thriller with exciting twists and interesting relationships and characters that develop as the film does. The film is approx 2 hrs, so you feel that you have not been sold short. Deneuve steals the show in this film, and it is clear that at the time of making the film Truffaut was very much smitten with her. A definite must see for any cineaste or moviefan. 10/10","This movie begins at the languorous tropics,in the tropical,colonial languor,and it ends in snow,winter and cold winds.The music contributes a lot to the film's pace.La Sirène Du Mississipi is dedicated to Renoir,yes,but it constitutes an implicit tribute to Hitchcock,and there are many Hitchcockian elements that can be listed here:the score (notice that Truffaut did not like it:\"the score of Mississippi Mermaid isn't very good\",in a '70 interview); the photography;a certain sense of the movie as an object,as a thing of art;the irony (a bed scene is juxtaposed to the image of the money greedily caressed by Mrs. Deneuve);the fevered dream-sequence;the suspense;Mrs. Deneuve's beauty;a certain weirdness;the foreboding music.Yes,La Sirène Du Mississipi looks,indeed,very Hitchcockian,but in a meritorious and creative way.I think Truffaut saw in the Hitchcockian thrillers a genre on its own.His film is not a pastiche,but a creation in this genre.The gentleness,the ardor,the smoothness,the gentlemanly comic,the smooth-tempered frankness,the contemplation in such a dynamic show,are all Truffaut's.Mrs. Deneuve looks jaunty,fetching and fervid,and La Sirène has some fetishist notes:Belmondo burns Mrs. Deneuve 's lingerie,as if to punish his missing wife;playing the fool with Mrs. Deneuve,he hides her underwear.This is building Mrs. Deneuve's sexual myth,in a low-brow,fetishist key.Belmondo knows how to look dispassionate, credulous,agile, scatter-brained,delusion-ed, puzzled,scathing,pushing, resigned, feverish:a businessman from the Tropics,a believer in some values,educated,somehow naive and trusting ;he wears his white pullovers.As a character,\"Louis Mahé\" changes,evolves,multiform and malleable,and becomes more and more interesting as a man.I see Truffaut put heart in La Sirène:as I said,he dedicated it to Renoir,followed in Hitchcock's footsteps,and used an Hitchockian aesthetics,and made \"Louis Mahé\" read eagerly Balzac (\"I love books and films equally, but how I love them! When I first saw Citizen Kane, I was certain that never in my life had I loved a person the way I loved that film. My feeling is expressed in that scene in The 400 Blows where Antoine lights a candle before the picture of Balzac.\",Truffaut in '70) .But Truffaut later disowned,repudiated his fine show.The critics also treated bad \"La Sirène ...\".(Truffaut said:\"The critics didn't like it, nor did the public--perhaps because Deneuve and Belmondo didn't appear in their usual sort of roles.\")Maybe,maybe it didn't live up to its author's expectations ,he wanted to make more than an amusing and thrilling show;Truffaut wanted to make,I guess,a Vertigo or a North by Northwest of his own-that is,an ultimate masterpiece,something very poetic,etc..Well,maybe it's not all that. (\"Whatever is wrong with that film is my fault and not the fault of my stars.\")Though,despite the critics' coolness and even Truffaut's own disappointment,\"La Sirène ...\" is a movie I admire.It may not be the masterpiece wished for,it may not have lived up to Truffauts ambitions,yet it is a thrilling show and it offers much delight;it certainly has its own beauty,its picturesque,its poetry,its suspense.He wanted a masterpiece;he got a very good movie instead.It is better than \"Such a Gorgeous Kid Like Me\".I must say I am as excited as Truffaut was with Belmondo climbing Mrs. Deneuve's balcony.Truffaut said his \"Mermaid\" was \"a smash\" in Japan;it is obvious he did not considered it as a bad movie,but as one that could have been better.","On the surface, Francois Truffaut's Mississippi Mermaid is a taut, well- made Hitchcockian thriller that features good looking actors (including the alluring, icy blonde), exciting chases and bizarre circumstances. However, Truffaut gives the story his own twist by focusing on the characteristic of obsession and how it claws at the protagonist and affects his judgment. Jean-Paul Belmondo puts aside his typical suave and cool demeanor to play a wealthy but lonely and somewhat naive tobacco plantation owner who puts in a request for a mail-order bride, only to discover that she looks like Catherine Deneuve. Naturally, he is taken under her spell and soon discovers she is much more duplicitous than he expected. Many film lovers may know this story better as it was remade in 2001 with Antonio Banderas and Angelina Jolie as Original Sin. Despite having not seen that film, I am confident it cannot be better than this version for two reasons. First of all, Truffaut is a much better director, able to seemingly tie all these various strings together into a coherent and plausible story. Second, there is no way Banderas and Jolie could match the sizzling chemistry between Belmondo and Deneuve. They are capable of being remarkably sexy and sultry without resorting to complete nakedness. This is a sign of true thespian abilities. While not one of Truffaut's stronger works such as his Antoine Doinel series or Jules and Jim, it is still an entertaining romantic thriller that manages to be both romantic and thrilling. Given the status of many of these types of films recently, there is plenty of reason to revisit this New Wave example.","I'm trying to find something of value here. The best I can muster is that Truffaut wanted to make a movie as tedious, painful, puerile, annoying, illogical, and brainless as the experience of being in love. If that was his goal, then he succeeded, but the solution to his exercise is really a drag to watch.There is one scene that screams for a spoof: Belmondo compares the features of Deneuve's face to the features in a landscape . All I could think the whole time was \"glacier,\" \"ice floe,\" \"two lonely fishermen wearing Army surplus on a frozen lake in Minnesota.\"The only other point of interest was the resurrection of Buffoon's theory of climatic determinism. The tropics are presented as paradise, and things get progressively worse as they get colder, hell being Calvinist French Switzerland. That was kind of funny.","The first 1/3 of this movie I loved and thought it was going to be one of Truffaut's best films. I loved the plot where a pen pal marries a man from half way around the world--sight unseen. Especially when this woman turns out to be a fraud and was responsible for the death of the REAL pen pal so she could take her place! She then cleaned out the husband's huge bank account and disappeared! I was really hooked and wanted to see more,...And then, the movie fell apart and became just plain dumb! Despite her coming from New Caladonia (an island in the Pacific) and he from Reunion (an island in the Indian Ocean), when he goes on a trip to the South of France, he stumbles upon her almost immediately. Hmm,....odds are 187,000,000 to 1 but he finds her. Then, instead of either killing her or turning her over to the police, he forgives her--even when she acknowledges what she has done. Okay--this is tough to believe, but okay,...but then he helps to hide her from a private detective by murdering him!!!! No one is that stupid! Yes, the character Catherine Deneuve plays is quite beautiful but come on folks--this is just silly. Plus, if he only wanted her as a sex object, then why would he do this for a woman who is often frigid and completely selfish and evil.This movie, due to it's very ridiculous plot, does not deserve such high ratings! Unless you are a die-hard Truffaut fan, try another film--even one of Truffaut's--just NOT this one.","There's not an awful lot that's credible in Truffaut's re-writing of William Irish's plotty thriller. The attractive leads, the mise-en-scene and the location carry interest for about half of the film, by which time it just becomes silly. I'm not sure what Truffaut intended, because from the start Monsieur Belmondo does not convince that he's a man who's spent his life on Reunion Isalnd, running a cigarette factory. Even less convincing is Mlle Deneuve as an ex-reform school adventuress - perfectly groomed with Yves St Laurent outfits, her delicate skin and unemotional expressions. Much of the potentially intriguing plot is told instead of shown; there are ludicrous coincidences and character transformations, and a central relationship that's uninteresting. Nevertheless there are sequences which have that good old Truffaut oomph; and sequences which have that bad old Truffaut pfft. Camera work and music are splendid.","Usually, when we hear about a Truffaut movie, we think of \"The 400 Blows\", \"The Wild Child\", or something similar. \"Mississippi Mermaid\" is a shocker in that respect. It wasn't a bad movie, but I didn't derive that it was actually trying to say anything. In some sense, it almost seemed like the sort of movie that they just made for fun (Truffaut wouldn't have done that, would he?). It focuses on Reunion resident Louis Mahe (Jean-Paul Belmondo) marrying Julie Roussel (Catherine Deneuve), who may or may not be what she seems.Anyway, it's okay just to watch, but I wouldn't make it my first choice. It's still surprising that Francois Truffaut did this.","this is one of the more poorly made movies I've ever seen. One has to take anything by Truffaut seriously; it's not just some B-movie cranked out by hacks.evidently Truffaut couldn't decide whether he was making a noir or a sentimental chick flick. and neither could Deneuve, whose dozen (?) character flip-flops are simply unbelievable -- not even badly acted; just not acted at all. Among other things, how a woman as beautiful as Deneuve could be a person such as Julie/Marion is simply beyond anyone's ability to suspend disbelief; the role absolutely demands someone not so beautiful. Belmondo's acting also suffers although imho his character is not quite as unbelievable as Deneuve's. The cliché ending (which I won't describe) is unfortunately all too appropriate for this complete mistake.","François Traffaut's \"Mississippi Siren\" had an unconvincing plot. The screenplay required too much elasticity in suspension of disbelief. The plot went at a glacial pace. It started off in an interesting setting but soon drifted onto the shoals of melodrama that lacked logic or intelligence. What were the critics thinking? This one is overrated even to be described as a loser. Even Catherine Deneuvue, who charmed in \"The Umbrellas of Cherbourg\" and \"Belle Doe Jour,\" managed to be simply annoying. We rented this movie at the same time as we rented another Traffaut film. We watched this one first, and found it to be so bad that we sent the other one back unseen at the same time.","If I had to choose one word to describe this movie, the word would have to be \"pointless\". Part Hitchcock homage and part romantic melodrama, the film takes so many turns that the characters' behavior becomes totally inconsistent and you can never get a handle on them. The film's attempts to say \"something meaningful\" about blind passion and devotion are hampered by Denevue's cold performance. And on top of all that, it doesn't even LOOK very good. (**)","This must be one of the most horribly titled films of all time. The kind of title that ruins a film because it neither evokes the plot nor the characters. A title like this makes a film flop, even the French title is not much better. Too bad - Truffaut & Deneuve must have been enough to sell it..This is a long film, but largely worth it. Clearly influenced by Hitchcock, we have an intercontinental story about a personal ad bride, her rich husband, a theft, an identity switch, and obsessive love. The plot here is actually very good, and takes us on an unexpected trip.The thing that works both for and against the movie is the focus on the relationship. It is an interesting study in how these plot developments are played out in \"real life relationship\" with these two people. Unfortunately, this is what bogs the film down, and makes it ultimately dissatisfying. We do like films to have a real sense of finality, and that is missing here.It was the case in many of her films that Deneuve became a canvas for Directors to play their fantasies out on, and this time it doesn't work as well. Messy here, is the fact that the Director clearly just wanted to have Deneuve take her top off a few times. Deneuve is an actress who always seems very deliberate and thoughtful, so these attempts to make her seem spontaneous fall flat. Basically, the script needed to be worked out better before shooting began, to make this film tighter and shorter and to snap. But Truffaut didn't snap, did he? So - it wanders a bit, but remains interesting.","Every major director has experienced inevitably laborious phases of making really bad films.This happens as there are times when all creative people tend to hibernate.French new wave wonder kid Truffaut is also no exception to dreadfully malevolent rule of bad film making. There have been some phases in his cinematographic career wherein he has made some really atrocious films.One can quote films like \"The Bride wore black\"/La Mariée était en noir, \"The Man who loved women\"/L'Homme Qui Aimait Les Femmes and \"Mississippi Mermaid\"/La Sirène Du Mississipi as some of the bland films which have been directed by Truffaut. Mississippi Mermaid is a colossal failure as its star studded caste is largely wasted.One of French cinema's most vibrant pairs actors Jean Paul Belmondo and Catherine Deneuve look interesting but hardly offer any proofs of good acting.This film about a mail order bride is a good example of foregone conclusion as there is neither proper suspense nor any kind of well developed mystery.Truffaut has attempted to make a good film about love but ended creating a farce about a woman who gets the better of a stupid man.","MISSISSIPPI MERMAID is a disturbing and unsettling examination of what it means to be in love with the \"wrong\" person.Truffaut's directing is his usual outstanding work.  Although this is far from his best.  Deneuve is very, very beautiful.  Despite the character she portrays.","You know - I seriously think that this 1969 \"WTF!?\" French film should be promptly re-titled - \"The Bad, the Beautiful, and the Boring.\" - 'Cause, in my eyes, that's all that this wretched \"Francois Truffaut\" production amounted to.Filled-to-overflowing with one laughably preposterous situation after another - This, to me, was one of those ludicrous romance stories that literally cried, begged, and demanded to be spoofed, big-time.Starring Catherine Deneuve (one of the most vacantly frigid actresses that French cinema has ever produced) - This film's scenes of sexual intimacy were (thanks to Deneuve) some of the most flaccid and non-arousing ever recorded on celluloid.Put plain and simple - I rank Mississippi Mermaid as being just pure adulterated excrement - Nothing more. Nothing less.","With a poll taking place on ICM for the best films of 1969,I took a look at what the major auteurs of the French New Wave (FNW) had been up to that year. Finding The Bride Wore Black to be one of my favourite films him,I travelled to Mississippi to witness François Truffaut's second Cornell Woolrich adaptation.View on the film:For his second Woolrich adaptation, writer/ director François Truffaut keeps the FNW styling pressed on Agnès Guillemot's editing, swiped with multi-layered dissolves,spilt screens and brash black screen cuts. Reuniting with cinematographer Denys Clerval after Stolen Kisses, Truffaut continues to open up on his Hitchcock inspiration via graceful tracking shots capturing the boiling heat on the Reunion island, back-screen projected car scenes creating a lovers on the run thriller atmosphere, and a return to the Switzerland safe house from Truffaut's first Noir Shoot The Piano Player,snowing in the romance between Mahé and Vergano on a doomed poetic note.Whilst his other Noir's of the era had a firm foundation for their playing around with time, (the extended flashbacks of Piano,the kill list of Bride,and the 4th wall breaking of A Gorgeous Girl Like Me) the time-frame Truffaut springs here feels incredibly disjointed,as the passage of time between Mahé and Vergano (played with an alluring Femme Fatale edge by Catherine Deneuve) romance stutters between feeling like it has taken place over years-from her appearance and Mahé (a restless Noir loner Jean-Paul Belmondo) being in a mental hospital, to a chance encounter with a detective stating that it has only been a matter of weeks. Basking in the heat of the island, Truffaut does well at establishing doubt over Mahé and Vergano marriage being too perfect. Leaving behind Mahé almost penniless, Truffaut aims for Hitchcock-style twists that miss due to the revelation that Vergano is not who she claims,(who has sent piles of letters to Mahé)making Mahé's passionate love for a total stranger feel rather random,as Mahé searches for the Mississippi mermaid.","This film was originally received as a flop in the U.S. - one of Truffaut's lesser works.  A recent restoration of 13 minutes of footage had garnered some accolades from critics on the film festival circuit, but after just having seen the film on video I was disappointed.  I felt as if i had been watching a spoof of Hitchcock and American Film Noir at best.  It was from this perspective that I tried to enjoy this foreign film as an American, but found little enchantment.  The only two reasons I hung on until the end: Catherine Deneuve and to possibly see if something utterly surprising would happen.  I was too patient.  Some have said that this film poignantly explored the heart ache of love between two people who are wrong for each other but I can't help but wonder if Truffaut was trying to be funny.","I didn't like this much because I couldn't respect the protagonist.Jean-Paul Belmondo has an incredible mug, somewhat of a hybrid of early Brando and Sylvester Stallone. However, his character seems to suffer from either profound mental retardation or suicidal denial.First Marion (Catherine Deneuve) rips him off for 28 million francs. Then he kills a PI to protect her from the cops and must go on the lam. Then his lady love tries to poison him with strychnine. Yet he still finds her adorable. And he doesn't question this because true amour is \"difficult.\"Oh, give me a friggin' break! I'm surprised so exalted a director as Truffaut took this claptrap seriously.I read on Wikipedia that this is one of only three films ever shot in Reunion, a French overseas department off the eastern coast of Africa. I did enjoy some of the tropical scenes. But the characterizations in this film are insulting to anyone of normal intelligence. (Why, why, why would a gumshoe have been so trusting as to confront a shady customer in so confined a space? What WAS he thinking?) Given all the talent in this film, I'm surprised it was so dumb.","I like this movie despite its many flaws and would cautiously recommend it. Possibly because Deneuve and Belmondo are such an attractive couple it doesn't matter what they do. The first half of the film is a Hitchcockian thriller about deceit, greed, and obsession set against the exotic backdrop of Reunion Island. But the mystery is cleared up quickly and it becomes a rather unconvincing lovers-on-the-run drama, not unlike Belmondo's \"Breathless.\" I found the ending to be a colossal letdown in light of everything leading up to it. This was Truffaut's second attempt at a \"Hitchcock\" movie, and I think \"The Bride Wore Black\" succeeds better than this one because Truffaut maintains the suspense throughout. It's also got the edge thanks to the Bernard Herrmann score. Had \"Mississippi Mermaid\" stuck to its roots as typically offbeat Cornell Woolrich pulp fiction it could have been great."],"review-user":["anemoni","snoozer1","Rodrigo_Amaro","claudio_carvalho","jayraskin1","Terrell-4","ma-cortes","mooning_out_the_window","Cristi_Ciopron","bobsgrock","gabridl","MartinHafer","adam-703-808689","lee_eisenberg","joel-280","ed6438","gridoon","DAHLRUSSELL","FilmCriticLalitRao","fideist","strong-122-478885","morrison-dylan-fan","eljonny","evening1","ags123"],"review-date":["5 December 2001","19 October 2004","7 February 2011","19 June 2008","13 July 2010","20 August 2008","27 January 2009","23 December 2006","19 October 2006","7 July 2011","10 May 2009","1 August 2005","18 September 2013","30 September 2005","12 December 2009","21 January 2006","23 March 2004","19 November 2006","31 March 2010","7 March 1999","14 November 2017","15 June 2018","5 November 2000","22 August 2013","9 June 2016"],"review-rating":["10","8","9","8","9","6","7","10","8","2","3","4","5","3","1","5","7","4","9","2","6","3","7"],"review-title":[" criminally underrated gem\n"," Cant get enough of Deneuve....\n"," Way better than the remake\n"," Passion, Murder and Love That Hurts\n"," Love is An Illusion, But a Grand Illusion\n"," The bones are here for a nice, nasty tale of self-destructive obsession, but then there's all that stuff about finding true love\n"," Romantic and suspenseful drama well realized by Truffaut in his own directorial style\n"," brilliant\n"," Mrs. Deneuve & Belmondo at the tropics\n"," Something of an anomaly in romantic thrillers.\n"," Beyond irritating\n"," fundamentally flawed script borders on being very dumb\n"," Beautiful looking Truffaut meander which runs out of steam half way through\n"," Umm, Truffaut did this?\n"," depressingly bad movie\n"," Tedious and Unconvincing; No, God-Awful!\n"," Overlong and pointless.\n"," Horrible Title, wanders a bit, remains interesting.\n"," Mississippi Mermaid : A supreme example of bad film making by French new wave pundit Monsieur Truffaut.\n"," What Price - Love?\n"," And To Think It All Started With A Mail-Order Bride\n"," Mermaid Mississippi.\n"," You can't explain love. Or is it just a spoof?\n"," A few good sequences but definitely sub-par\n"," Half Thriller, Half Love Story, Half Baked\n"]}