{"review-url":["http://www.imdb.com/title/tt0044778/reviews"],"review-text":["The Jungle is more of an adventure than a science fiction movie. The only sci-fi part is the Woolly Mammoths living in the present day.Elephants are attacking villages in a part of India and these attacks are also killing people. An expedition is sent to investigate and one of the members of this, an American hunter blames these elephants are being frightened by Woolly Mammoths, which are suppose to be extinct. Nobody believes him at first, but they do when the Mammoths appear at the end. An earthquake finishes them off.The Jungle was shot on location in India and has a lot of nice scenery and some good Indian music, including some songs which keep the movie moving along nicely. The Mammoths are actually real elephants with fur coats and long tusks stuck on.The cast includes Rod Cameron, Cesar Romero (The Lost Continent) and Marie Windsor (Cat-Women of the Moon).The Jungle is worth seeing, just for the scenery and music. Very enjoyable.Rating: 3 stars out of 5.","Interesting tale of giant mammoth elephants running amok in modern India. Features transparent special effects-elephants dressed in shaggy coats sporting tusk extensions. All this said, we do have a good story and a fine cast at work, and an exciting climax. It's been said that the running time on this one was doubled when it showed in India-courtesy of Robert Lippert, a master at 'padding.' Given a choice, opt for the shorter version.","I can't really criticize this film. It is literally the first film I ever remember seeing and lead to a lifelong love of science fiction and horror films and prehistoric animals. Fortunately, seeing it again years later, it held up fairly well. Rod Cameron plays a big game hunter whose last safari was wiped out by mammoths. No one believes him, including his best friend, played by Cesar Romero, whose brother was among those killed. And Rod Cameron was the only survivor. The film was shot in India and has some good scenery. The acting is on a high level. I don't believe Rod Cameron, Cesar Romero and Marie Winsor ever turned in a bad performance. The mammoths, when they finally arrive are fairly effective. The ending also has an unusual twist, particularly for a 1950's science fiction film. Definitely worth seeing.","Most films about prehistoric animals almost always feature dinosaurs. This is one of the few films I know of that deals with prehistoric mammals. In this film the menace is woolly mammoths that are driving elephants out of the countryside and into villages wrecking havoc and death. While the basic idea is interesting, the film itself is slow going. The American version which is only a little more than an hour long is padded with lots material designed to use up footage. Its seems it takes the party almost forever to encounter the mammoths. The final confrontation is exciting but it takes too long. The only other point of interest is that this is the earliest American/Indian co-production that I am aware of.","Rugged great white hunter Steve Bentley (well played with appropriately manly resolve by Rod Cameron) and feisty Indian princess Mari (a sturdy performance by the sultry Marie Windsor) embark on an expedition into the India jungle in order to find out the source of wild animal stampedes that have left many people dead.Director William Berke relates the engrossing story at a steady pace and maintains a likable sincere tone throughout. Cameron and Windsor make for personable leads; they receive fine support from Cesar Romero as Mari's loyal and protective husband Rama Singh. Carroll Young's tight script draws the characters with some depth and presents plenty of thrilling obstacles for the protagonists to contend with. The exotic locations add an extra tangy flavor. The stampede sequences with scared elephants trampling everything in their path are genuinely harrowing; ditto several moments depicting animals fighting each other to the death. A dance sequence with various lovely harem girls rates as another definite highlight. Clyde DeVinna's crisp black and white cinematography basks everything in a gorgeous sepia tone. Worth a watch.","Elephants run amuck in India where tensions grow between an American visitor and a tempestuous native over a sultry princess. Rod Cameron, a handsome but ineffective actor, headlines as the American hunter while Cesar Romero is the Indian nobleman complete with turban. A dark skinned Marie Windsor is the princess in one of the most unintentionally funny bits of casting ever. The basic plot has the three stars out to eliminate the elephants attacking villages and killing its residents while Romero tries to discover the truth about how his brother died.As an adventure film, it is quite enjoyable with shots of many wild animals of all types. Encounters with bears and ferocious cats, sudden appearances with various types of snakes and deadly insects add to the thrills. The confrontation with the elephants is followed by a n impressively staged earthquake.Bizarre tinting gives this delightfully camp adventure a moody look. Toss in some of the most bizarre casting in Hollywood history and you've got a confection of the most bizarre elements in the world of the cinema.","With her father out of the country receiving medical treatments, the daughter of a rajah returns home to handle a crisis in he country. It seems that some form of wild animals are destroying villages. Hooking up with a great white hunter who was the only survivor of a hunting party sent to end the menace, the princess and a large group of soldiers head into the jungle to put a stop to the attacks. Add to the mix political intrigue, revenge and romance you have the makings for a perilous journey.This is an okay little scifi adventure film that suffers from a leisurely pacing. Shot in India much of the film is the journey into the jungle, which means that their is a great deal of travelogue footage. We see the landscape of India as well as several animal on animal attacks, not to mention a troop of traveling performers. Its interesting viewing because its not the sort of thing we've seen before, but at the same time it slows everything down.On the plus side this film doesn't really look and feel like most other movies. Its a weird mix of Western and Indian films, the result of much of the crew being natives to India. I especially like the non Western music which includes several songs naturally integrated into the film as either entertainment numbers or sung by the soldiers traveling through the jungle.Worth a look for those who want to see a run of the mill story told with a different sort of style.","The opening of \"The Jungle\" promises us a safari adventure with a science fiction element, but mostly what we get is a travelogue with lots of stock footage and padding (and the odd leopard attack). The movie is leisurely when you want it to be gripping, and tries to inject interest into the proceedings with badly staged matches between various wild animals (I had no idea that lions and wild boars were natural enemies in the wild, did you? I thought the big cats stuck to hunting herbivores, but apparently the producers knew better). As for the actors: Cesar does his usual great job of rocking the mustache, and Marie Windsor is reasonably believable as the progressively thinking rajah's daughter (nice eyebrows, btw!). However, Rod Cameron is barely watchable as the hunter returning as the sole survivor of his expedition. I'm sure he was in demand in his day, but here he comes off as a Rent-A-Center Bogart : rough looking, but with none of Bogey's range or timing. He spends the movie going back and forth from stoic anger to angry stoicism, and any time the screenplay attempts to crank up some romantic sparks between himself and Windsor, you just have to laugh. That crabbed, knobby face isn't a good vehicle for tenderness. The screenplay is not entirely without merit, although it does make some odd choices. Early in the first act, the screenplay makes a point of spending several moments where the heroes decide to bring along the obligatory clever young boy and monkey mascot, but then basically ignore them until ***SPOILER*** the monkey somehow gets hold of a live hand grenade during the mammoth scene and accidentally tosses near Windsor. This is so Cameron can prove his bravery by diving on it and saving her life at the cost of his own.***END SPOILER. It's possible that the Indian version of this movie (which I understand ran better than 2 1/2 hours), might have given the kid and the monkey more to do. Another thing that makes the film show its age **SPOILER**is the issue of the woolly mammoths (the plot device that sets the safari into motion in the first place). When they finally appear, the way the scene is filmed, it's obvious that the \"mammoths\" (obviously elephants draped in shag carpeting) aren't really \"attacking\" anyone, or even moving all that fast, and yet Cameron immediately sets to trying to wipe them out with hand grenades. These days, the idea of destroying the last known specimens of a species thought to be extinct would be unthinkable, especially when all they seem to do is roll through the jungle at a nice walking pace.***END OF SPOILER***So IMO, four stars, which is pretty good for a Robert Lippert production (normally Lippert hack jobs rate two or three stars at best). It's not a train wreck of a film, or anything; plus, it seems to mean well,with the rajah's daughter arguing for amelioration of the most repressive aspect of the \"traditional ways\" and the elements of \"mixed race\" romance that was pretty progressive in 1952. And there's some nice scenery and exotic spectacle. See it if someone offers to show it to you for free, but don't expect much except an interesting historical chapter of early fantasy cinema.","Moderately enjoyable jungle adventure is set (and filmed) in the wilds of India, with American stars in the leads. Rod Cameron is macho great white hunter Steve Bentley, who was hired by the government to do something about the animal stampedes that have decimated various villages. Claiming that the animals in question looked like mammoths, he is soon venturing back into the jungle, in the company of a headstrong princess named Mari (lovely and appealing Marie Windsor) and her loyal associate Rama Singh (Cesar Romero).Led by director / producer William Berke, the filmmakers do seem determined to make this movie, to a large degree, a travelogue as well. This results in a fair bit of padding as we see the sights & sounds and a tiny bit of the culture of this exotic location. We also are witness to a few fights among the animal kingdom: a leopard vs. a boar, a cobra vs. a mongoose, and a bear vs. a tiger. Filmed in an aesthetically pleasing Sepia tone, the movie certainly looks good, but the slow pace might cause some viewers to fidget in their seats and/or check their watches. There is also a love triangle among our trio of main characters that adds a bit to the running time.Still, Cameron, Windsor, and Romero are all fine, and the viewer is ultimately rewarded with a passable action climax where we finally get to see our hairy, massive antagonists on the move.Decent, light entertainment.Six out of 10.","Jungle, The (1952) * 1/2 (out of 4) Low-budget nonsense about Princess Mari (Marie Windsor) who moves back to India where hunter Steve Bentley (Rod Cameron) and Rama Singh (Cesar Romero) fight over her. While all of this is going on villagers are being killed by stampeding elephants so the three love birds go into the jungle and discover woolly mammoths. The jungle film had been around since the silent days and when you hear jungle and low-budget you typically expect all sorts of stock footage mixed in with the actors on a sound stage. It's shocking but that's actually not the case here because this film gets the added benefit of having actually been shot in India and these locations are certainly a major plus. Sadly, the rest of the film is a major chore to sit through because the 73-minute running time is pretty much all start and very little end. We know we're going into the film to see the \"monsters\" but they don't show up until around three-minutes left to go in the film so we have to sit through countless dialogue scenes that just go no where and it's clear the only reason they're in the film is to fatten up the running time. We get quite a bit of footage of local animals including several elephants as well as lions, tigers and boars. We even get a pretty violent fight between a boar and a tiger that might be the highlight to many even though it never gets too graphic. Being able to see all this stuff was a bonus but the rest of the footage is pretty lame. The sight of the woolly mammoths are a real treat because they're just elephants with some sort of rug thrown over them. I will give the producers credit because they don't look too horribly bad but at the same time it's still very obvious at the trick they did. The three leads are decent in their parts but none of them are worthy of awards. I'd say it's a safe bet that all three were happy with their trip to India so we're lucky we got anything from them. Director Berke was a veteran of this type of film has he was behind the camera on several of the Jungle Jim movies but I can't say I'm impressed with his work as he brings no energy to anything we see.","Let's cut to the chase...the plot here in \"The Jungle\" is ridiculous. It's set in India and elephants have apparently been stampeding the countryside and killing many people. However, the great American hunter called in to take care of it, Steve Bentley (Rod Cameron) has just reported that everyone in his party but him got killed...and they were NOT elephants but Woolly Mammoths!! So, the determined Princess (Marie Windsor) heads into the jungle with her trusted Rama Singh (Cesar Romero) to see for herself...and Steve accompanies their party. In addition to Woolly Mammoths, the film also features something common in the era...white folks playing the leading roles even though they are supposed to be Indians. Romero can kinda pull it off but Marie Windsor looks about as Indian as Lassie! I think the film was sepia tinted to try to hide this but it doesn't work well. Nowadays, such casting is seen as culturally insensitive and insulting. At least everyone else in the film appears to be Indian and the film DOES get the look and feel of India right and the animals seem to be more accurate than most B-movies (where you'd see rhinos and kangaroos and more in the Indian jungle!). Considering it's a low-budget film, I was also surprised that some of the film was actually filmed in that country. So, culturally it's a mixed bag.So is it any good? Of course not! It really can't be! It's a product of its times but really isn't all that great...at best a slow-paced and very silly time passer. But, when it comes to giant monster films, it's better than most (not that this is high praise!).By the way, if you suffer from Ophidiophobia (the fear of snakes) skip this film. Trust me on this. Also, animal lovers might also want to avoid it as there's a scene where a tiger and Sloth Bear fight and it honestly looks like they just tossed 'em together and let them fight! Fortunately it APPEARS neither animal was seriously injured. Later, they toss a boar at a leopard! Great animal lovers they were NOT!","I remember this film fondly from seeing it in the theatre. I recently found a copy on VHS & it held up to my memory of it. While obviously not a \"big budget\" film, the acting is quite credible & the scenery, locales, & costumes are very well done. I only wish the Mammoths had been in more of the picture, but when you see them, they are also well done (remember, SFX was done in those days without benefit of computers, some poor devil had to actually put all that hair & fake tusks on real elephants!)...the same effect was used on the elephants in \"Quest for Fire\". A better than average adventure film & a chance for the star, Rod Cameron to play something besides a cowboy, which he also did very well over the years.","This is one strange film from Lippert Pictures. They spent a lot of time and trouble to take a film crew over to India with three Occidental players in Marie Windsor, Cesar Romero, and Rod Cameron. A lot of very nice background footage of India is sadly wasted on a rather unbelievable story.Today's computer graphics might have been able to come up with more convincing Ice Age type mammoths who are terrorizing contemporary elephants who are in turn running for their lives and trampling a lot of humans in the process in Marie Windsor's kingdom. The mammoths we see here look like today's pachyderms dressed up in raccoon coats.In any event Marie who has been learning western ways is summoned hastily back to her Indian kingdom after her father died. She has enemies herself who are opposed to any modernization and want to kill her which forms a subplot to this film.Ruling in her place until she got home was prime minister Cesar Romero who hired white hunter Rod Cameron to solve a problem of raiding elephants. Cameron was the lone survivor of an expedition where Romero's brother was killed and Cameron comes back with this tall tale about prehistoric mammoths.One thing is for certain. Mammoths were Ice Age creatures who died off when the earth's general climate warmed up. No way would they be living even in a remote area of the Indian jungle. But I guess no one thought of that in making The Jungle."],"review-user":["chris_gaskin123","bux","mvescovi","youroldpaljim","Woodyanders","mark.waltz","dbborroughs","lemon_magic","Hey_Sweden","Michael_Elliott","MartinHafer","azcowboysingr","bkoganbing"],"review-date":["21 March 2005","12 November 1998","9 February 2006","17 February 2001","13 October 2016","9 January 2016","29 April 2007","8 December 2007","2 November 2016","11 May 2011","17 February 2018","11 March 2007","14 June 2014"],"review-rating":["7","7","7","8","3","5","4","6","3","7","3"],"review-title":[" So, Woolly Mammoths are not extinct\n"," Interesting, but over-long sci-fi/adventure fare\n"," Prehistoric Mammoths in a well made film\n"," Prehistoric monster flick made in India is slow going.\n"," The Indian jungle is rife with peril\n"," Take a stride along this elephant walk.\n"," Slow pacing is the draw back to this journey to stop wild animal attacks in the Indian jungle\n"," I'll bet \"The Jungle\" was hot stuff in its time, but it doesn't hold up too well\n"," There's some fun to be had with this one.\n"," A Different Kind of B Film\n"," Woolly Mammoths in modern India....now that certain is special!\n"," A better film than you might think.\n"," They've got a mammoth problem right here in India\n"]}