{"review-url":["http://www.imdb.com/title/tt0094933/reviews"],"review-text":["Someone poisoned named Dexter Cornell (Dennis Quaid as an unsettling college professor) and he's got to find out who . He's got to find out why . He's got to find out now . In 24 hours, he'll be Dead On Arrival. He along with a friend student (Meg Ryan) frantically seek who is responsible and why he was targeted for death . His search for the suspect is further complicated by the fact that he is being sought by the police on phony charges of killing .Mediocre remake of the 1949 Noir film that contains thrills , suspense , a complex intrigue and plot twists . The starring , Dennis Quaid , relates his own lethal murder become himself in detective and spend his ending moments trying to uncover his hit men . As his time runs out,he has only hours to identify , he desperately seeks to discover who is responsible his death . The search for the suspect is further complicated by the facts of numerous turns , deceits and a twisted intrigue . Passable acting by Dennis Quaid as a teacher becomes embroiled in a series of murders involving people around him and supported by Meg Ryan as a likable but reluctant student , both of whom married after shooting , though nowadays are separated themselves. Supporting cast in frankly enjoyable , such as Charlotte Rampling , Daniel Stern , Jane Kaczmarek , Christopher Neame , Robert Knepper , Jay Patterson and the deceased Brion James . Colorful cinematography throughout the story , the color in the film begins to drain to monochrome, thus representing the central character's deteriorating health as the poison steadily takes it's toll until it is in black and white as in the opening - presumably showing the flashback catching up to the current time-line of the story . Screeching and inappropriate musical score composed by means of synthesizer .The motion picture was middlingly directed by Rocky Morton ans Annabel Jenkel , the same people who brought ¨Max Headrom¨to TV series . This story results to be a remake from ¨DOA¨ (1969) a dark B-thriller directed by Rudolph Mate with Edmond O'Brien , Luther Adler and Pamela Britton . It was also followed by a inferior remake as ¨Color me dead¨(1969) by Eddie Davis with Tom Tryon , Carolyn Jones and Rick Jason","This remake of the 1950 classic film noir of the same name cleverly utilises a combination of old and new elements to create an entertaining thriller which, although designed for 1980s moviegoers, still has a strong appeal to contemporary audiences.Fans of the original will particularly appreciate the fact that the basic premise of the story has been retained and will also enjoy the black and white sequences at the beginning and end of the movie which provide a stylish homage to Rudolph Mate's film. Those not familiar with the original will also find it an enjoyable mystery which involves murder, jealousy, campus politics and a very unusual motive for murder.University professor Dexter (Dex) Cornell (Dennis Quaid) goes into a police station to report his own murder and as his story is recorded on video tape, it becomes clear that he's been poisoned with a slow acting substance which left him with less than 48 hours to track down his killer and to find out why anyone would want to murder him.Dex had written some successful novels but when writer's block set in, he'd become disillusioned and progressively lost interest in what he was doing. His despair became even greater when one of his most talented students, Nick Lang (Robert Knepper) died after falling from a high building and his wife Gail (Jane Kaczmarek) pressed him to go ahead with action to speed up their divorce. Dexter then reacted by seeking consolation in the local bars where he met Sydney Fuller (Meg Ryan) who was one of his students who had a crush on him. The couple then got drunk together and went back to Sydney's place.Next morning when Dex woke up feeling ill, he knew he was suffering from something more serious than a hangover and checks at a local clinic confirmed that he'd been poisoned. There was no antidote which could help his condition and so, knowing that he didn't have long to live, he decided to visit Gail who had been involved in an affair with Nick. When Dex found her dead body, the police immediately suspected him of murdering both her and Nick. Dex took an opportunity to escape from the police and then decided to force Sydney to go with him to the places they'd visited the previous night, to try to discover who'd murdered him.During Dex's frantic race against time he learned more about Nick's complicated family background and together with Sydney escaped the attentions of a vicious assailant who pursued them with a nail gun. The identity of the murderer surprises Dex but the motive proves to be even more shocking.Directors Rocky Morton and Annabel Jankel employ an interesting combination of stylistic influences which work together very effectively. The use of high and low angle shots, close-ups and tilted camera angles are also especially successful as they reflect the sense of chaos and confusion which prevails through certain passages of the action.This is a film which features good performances from Dennis Quaid, Meg Ryan and Charlotte Rampling and has a premise which gives its story a natural sense of pace and urgency. Add to this a number of twists and numerous moments of suspense and humour and the final result is an intriguing mystery which is great fun to watch.","\"D.O.A\" is an involving and entertaining little picture from start to finish.  Dennis Quaid is at his caustic best; and Quaid is sadly one of the most underused talents in Hollywood.  His then beau Meg Ryan also appears with him, but as is usually the case, doesn't really make much of an impact.   The film is stylishly directed throughout, drawing on a number of influences to capture its 'seamy' feel.  Would you credit that it's actually directed by two people? The answer is no.  The whole thing is superbly slick, from its innovative camerawork to its unabashed use of black and white photography.  All these elements help to keep proceedings fresh.   Really the greatest thrill here is to be had with the dialogue, it's snappy yet intricate, doesn't waste a word and yet still manages to be entertaining.  The screenplay for this is like a pocket work of art.   This went unnoticed by me for ages before I finally caught it late at night.  If this is the first you've heard about it, don't leave it like I did!  Catch it soon, it really is top-notch... !   If you're in the mood for a solid genre flick that manages to surprise at every turn, this really fits the bill.","D.O.A. (1988) *** Dennis Quaid, Meg Ryan, Charlotte Rampling, Daniel Stern. Fast-paced and nifty remake of the 1949 classic about a man being poisoned with time his factor as he tries to solve his own murder.  Quaid is top-notch as a college English professor trying to figure out just who his enemies are and Ryan is plucky student aiding him.  Cool camera movements and some fine direction from the creators of tv's \"Max Headroom\", Rocky Morton and Annabel Jankel.","Those wishing to see film noir remakes, should not see this as as a remake, you will always be disappointed. Instead, enjoy a gripping performance from Dennis Quaid and visual imagery to commend. The colour drains from the film (literally, not metaphorically!)) as the plot gathers pace, and the dialogue is crisp and gritty. The opening dialogue is clever, and the viewer is carried along by a sharp screenplay and a real, original film noir feel,","D.O.A has a good premise, borrowed from a 1950 film of the same name and a 1969 film entitled Color Me Dead. But beyond the premise it fails to develop into anything worthwhile. The script mistakes ludicrousness for cleverness; the directors peculiarly seem to think they're making a pop video rather than a film; and Dennis Quaid puts on a weird grin and raises his eyebrows maniacally as if he's auditioning as a Jack Nicholson impersonator. It's good for a laugh but, since that wasn't the original intention, it's hard to rate this as a worthwhile film.English lecturer Dexter Cornell (Quaid) is a bitter, bored shell of a man. Formerly a great author, he never recovered from the critical failure of his fourth and final novel and vowed never to write again. Without the drive of writing to fill his life, he gave up on everything else too, including his marriage and his dedication to the job. When pupil Nick Lang (Rob Knepper) apparently commits suicide after handing in an assignment, Cornell hits the booze to get over the shock. But soon thereafter, he learns that he has drunk a slow-acting poison, and that within 48 hours he will be dead. So close to death, he finally finds a renewed purpose in being alive.... as, aided by student Sydney Fuller (Meg Ryan), he desperately attempts to solve his own \"murder\".It's such a good idea that one can hardly imagine how it could fail. But it does. It really, really does fail in a big way. All the pointlessly fancy camera angles, all the inappropriate musical scoring, and especially the jaw-droppingly stupid solution to the mystery, conspire to ruin the film. D.O.A stands for \"Dead On Arrival\", and that's the perfect adjectival phrase for the entire film. Some day, this wonderful idea for a film might be used once again to better effect, but for now you'd be best advised to stick with the 1950 version.","For all those people who believe the dialog is worth something, and who appreciate a farce that is clever enough for you to take it seriously, this movie will surprise you. It is not a 'whodunit' for people who can't aren't able to follow the verbal exchange of our hero, Professor Dexter Cornell (Dennis Quaid).Cornell teaches in Southern California, near the tar pits. He has not published a novel in four years, his wife is divorcing him, he drinks a bit much, and is blessed or cursed with caustic wit, which he freely dispenses to his students. He has recommended a friend for advancement, and one bright young student has submitted a manuscript to him as an independent project. Cornell doesn't even want to read it, so gives it an \"A\", and pushes it to the side. Leaning back with a drink in his office he stares out the window, when the bright young student falls past his window on the way to meeting the sidewalk in a splat encounter.Hal comes to talk, and they chat, drinking some more. The Cornell realizes that he HAS to read the manuscript, now. When he goes home, his wife is waiting with divorce papers. He drinks some more. She leaves, and he goes to a faculty affair, only to find her there. He drinks even more. And when his wife learns that the student is dead, she swoons, and he learns that she had been having an affair with the student. This of course prompts him to do some more serious drinking. The next morning he wakes up to find himself in the dorm room of one of his students, a freshman named Syd (Meg Ryan).He feels worse than a  hangover, goes to the doctor and learns that he has been poisoned, it is irreversible, and he has 24-48 hours to live. He doesn't have much time to find out who killed him, and there are sub-plots, motives, relationships and surprises at every turn, although everything makes sense at the end. All his discoveries and exchanges are adorned with sarcasm, dry wit and keen observations. Let's just say that this movie will give new meaning to the adage \"publish or perish\".\nThere are no bad performances in this movie. There are recurrent images, and symbolism used at careful intervals. Watch for the cracked glass, and images distorted through glass. Some of the camera shots are revolutionary for 1988, and some of the violent action is carefully and skillfully choreographed. The music is unobtrusive and appropriate, although occasionally it makes it's own statement, in song lyrics. The visuals in this flick are impressive.If there are any failures, it is that the opening 20 minutes move a little slow, and nearly puts you to sleep. But the pacing picks up quickly, with just the right amount of exposition in between action segments.There are no explicit sexual encounters, although there is violence and some bad language.This is a writer's movie, and is best appreciated by those who have a sense of humor about their own success or failure. I do think if you take it seriously, you're already in big trouble.","OK, so this film may not have won any Oscars, but it is not a bad film. The original \"D.O.A.\" is undoubtedly a better film, but that does not mean this film is bad.The film stars Dennis Quaid in one of his early roles, when he was first becoming really famous, after \"The Right Stuff\" made him a star, and a very lovely looking Meg Ryan, when she was still now quite famous.This is more of an \"update\" of the 1950 film, rather than a remake, since the setting is different and the characters too, are different. The plot is pretty much the same. A man (this time an English professor at the University of Texas at Austin) is poisoned and he has only 24 hours to find out who poisoned him and why. Meg Ryan plays a young college student who tries to help him. Jane Kaczmarek plays Quaid's estranged wife, in a low key, but intense performance; she steals every scene she is in. Daniel Stern (also in an early role, before \"Home Alone\" made him famous) plays Quaid's colleague. Charlotte Rampling is fine too in a supporting role.The entire cast is top notch; The film is stylish, with a quick pace that keeps you guessing until the end. I think this is a film that is certainly worth watching as a thriller, and as a modern version of a classic film.","This is a whodunnit in the Hitchcock tradition. You are kept in the dark as suspects come and go. Dennis Quaid is supurb as Dexter, a man doomed to die and Meg Ryan excellent as his babe. There is not much not to like in this little suspense and all the pieces fit neatly together the way they should. You won't be sorry you watched this one if you like suspense.","Books and movies really are different and nowhere is this more apparent than with the mystery. The genre is among the most popular in literature and least popular in film. The closest one usually comes is a `thriller,' where plot details are revealed piecemeal just to keep your attention. Sometimes we are tweaked with a twist at the end (Sixth Sense, Usual Suspects), but it is localized and gimmicky.Why this mismatch? Why are filmed mysteries (mostly on Public TV) mere character pieces? Because the nature of the mystery has to do with the notion of internal narrative in a novel; in `normal' fiction, the separation between reader and writer is straightforward. In a detective story, in the original form, the reader is co-writer, with reader and writer each inventing what happens next. (Assuming the story plays `fair' with facts and logic as was originally the rule.)Each tries to trick the other, in a mental contest that adds life to the story in a peculiar and intense way no other genre or medium can match. The device is seldom quoted well in film, so in DOA (a remake), we have reason for celebration.Caution: Spoilers ahead.Here we have an old-style mystery which is deeply self-referential. The writer of this story wrote about: what else? A writer of mystery stories. The device of bringing life to the story by engaging the reader is applied to the story of: guess what? That writer having `lost life' in his work and thence in his `real' life. It is a terrifically well crafted self-reference in both the mystery form and the mystery story and concerns killing over yet a third story (which `has life' because that student writer's life and death is the driving mystery of the film's story). Here, the director does not shy from making the viewer co-director. Thrilling!This device is aided by two parallel effects: One planned, one not. The planned effect is overtly cinematic: The film starts with full color, normal lighting and `straight' staging. The viewer is not reminded that this is a film. As the story progresses, the film becomes more and more aware of itself: the color is replaced with high contrast black and white, with the lighting and framing very `arty.' The director wants to emphasize that as the viewer becomes a collaborator, the film gains inner life becoming more introspective.The second effect is biographical. Quaid was deeply into drugs at this time. His real life savior and to be wife (no fooling) is the young student here. Adds another reflexive dimension.You can enjoy this intelligent film both directly and indirectly. So cool.","This movie is an awesome remake of the original by the same title. The movie was cool,despite the fact, I hate new ones! All of the cast was awesome . It has great cast and an awesome plot!! The main plot is a man is poisoned and he has to solve his own murder , neat eh?!Dennis Quaid is the man who is \"D.O.A\"(in other words Dead On Arrival).He finds help with his friends, but everyone is now a suspect!!Dennis's character has several hours to find out who poisoned him. The movie is quite fast and full of action. You can see two other big stars in Meg Ryan(City Of Angels,Courage Under Fire) and Daniel Stern(Home Alone, Very Bad Things,Bushwhacked) in supporting roles in this awesome ,cool remake of a classic movie!!","This film takes a lean, mean original and attacks it from the standpoint of the 80s/90s block-buster/Splurge Culture aesthetic, piling set pieces high as if more is more, and way too much is never quite enough.\nThe first D.O.A., which was once some pretty over-the-top stuff, seems positively spare, Bergmanesque, compared to this late 80s Hollywood Baroque Garage Sale. Upholstered over the simple frame of the original film: a bloody, violent wife murder sub-plot; a nail gun attack in the dark; a car wreck into a nasty, burbling, all-engulfing slime pit with everyone scrambling to escape; a new motive for the protagonists murder, something or other about professional jealousy among writers (talk about your self-referring script); and a diffuse, wha-happen new arty ending.\nAs watch-able as the film is, it is a little overdone. I guess when you aren't sure whether you can do one or two things really well, the best thing to do is crank out two dozen things, and hope at least a few of them will stick in the audience's mind. And why treat a movie like a short story -- everything toward one effect -- when you can make it like one of those sprawling 1200 page literary developments, the kind the drugstore sells?The music, again, irritates here, seeming jarring and incongruous in several places. And long, slow, lazy Tangerine Dream style synthesizer blares and wails, while evocative of a certain mood are also, perhaps even more, evocative of the early-mid 80s. 7 stars. I like this Quaid; he works in the role. After seeing it, I would say it is hard to imagine anyone else in Hollywood at the time playing this character with the right mix of vulnerability and near toughness.","Fast-paced remake of the exclellent 1949 film-noir. With Dennis Quaid and Meg Ryan on fine, romantic form Quaid is the English professor who walks into a police station and reports a murder: his own. He has 24 hours to live after having been given poison, and is determined to use the remainder of his life to find his killer.\nThis film is fast-paced and littered with corpses and more red herrings than Brixton market, but the direction and script never gel. Despite a competent and charming performance by Quaid, paired with his real-life wife-to-briefly-be Ryan (a romance necessarily also conducted at top speed), D.O.A. is let down by a cop-out ending.","Always enjoyed \"DOA\",1950,which starred Edmond O'Brien and was very curious about this film.  Dennis Quaid,(Dexter Cornell), was a professor who loved his wife and finally found out she was having an affair with one of his students. Dexter gets involved with Meg Ryan(Sydney Fuller), who was a student in his college class and at the same time  had a big crush on him and wound up having a one night stand and in some ways loved him deeply. Dexter learns that he received a drink which had bad contents and would cause him a great deal of health problems!  If you like Dennis Quaid and love Meg Ryan you will enjoy viewing this film, Meg gave an outstanding performance and kept this picture worth watching!","Rudolph Maté's film from 1950 is given a revamp for the 80's, Dexter Cornell(Dennis Quaid) is a university lecturer who used to have a successful writing career, but thats now gone down the tubes along with his marriage. The initial exposition plants the notion in the viewers mind that everybody has something against him, so when the revelation comes that he has been poisoned, we are not that surprised, unless of course you are familiar with the original. Dexter after being told he has less than 48hrs to live, decides to trace back his steps with the help of one of his students Sydney Fuller(Meg Ryan), but they find they have many obstacles in their way.The film begins promisingly in black and white, as Dexter staggers in the rain towards the local police station where he wishes to report a murder...his own, but the Huey lewis style 80's beat that accompanies this scene only serves to remove any sense of tension and tells the viewer that this is going to be pretty bad, its only a question of how bad? Sure enough we are soon using the old flashback medium, but now the film resorts to full Technicolor. There are some brief homages to Noir, as the embracing couple stand in front of a venetian blind, but there's really nothing here to recommend it, the performances are awful, Ryan in particular doing her usual dizzy blonde with a cutesy pie smile routine. The film is a lazy attempt to put some unneeded ooomph into an already fine movie premise, obviously trying to cash in one the Body Heat audience, the seeming results are undoubtedly aimed at a teen audience and to be sure, they are welcome to it. 4/10","D.O.A. is directed by Annabel Jankel and Rocky Morton and adapted to screenplay by Charles Edward Pogue from a story by Russell Rouse and Clarence Greene. It stars Dennis Quaid, Meg Ryan, Daniel Stern, Charlotte Rampling, Jane Kaczmarek and Christopher Neame. Music is by Chaz Jankel and cinematography by Yuri Neyman.A loose remake of the 1950 film noir of the same name, the story finds Professor Dexter Cornell (Quaid) staggering into a police station proclaiming that he is dying because someone has poisoned him. Told in flashback by Cornell, we see the events that led up to the point he was poisoned, but not who did it, and then track the frantic Professor as he tries to solve the who done it mystery before he keels over and dies.Not as bad as the poor box office returns suggest it is, D.O.A. is still very much a frustratingly shaky experience. Lifting only the basic idea of the 1950 movie, the makers stamp their own mark on the premise but add too many red herrings to the already fishy stew. Some plot developments are daft, as is the casting of Meg Ryan in the key femme role - seriously she is just too cookie cute and homely for this material – while the motive reveal is a bit much to swallow. Yet there's still a lot to enjoy and sample here for the neo-noir faithful.Visually the picture is stylish and appreciative to its noir roots. Opening in black and white to set the story in motion, Jankel and Morton then infuse the film with angled shots and frame distortions. Shadows often come into play, with Venetian blinds and roof rafters impacting, while the addition of a spiral staircase late in the day is most pleasing. Quaid is ever watchable in what is a tricky role that calls for him to garner sympathy whilst not being likable! While elsewhere Stern and Rampling provide good characterisations, even if as written the roles are too small given the importance the characters have to the plot shenanigans.A bit over cooked on the page, and basically a race against time thriller dressed up in neo-noir clothing, D.O.A. is still none the less worthy of a viewing. 6.5/10","The similarity between this DOA and the original is that a man has taken poison with no known cure, and with a limited time left to live, he seeks to learn why he was poisoned. Other similarities turn out to be that if you let the film take you where it takes you, it is a fast-pace and highly enjoyable thriller with very clever dialog, interesting and menacing characters, and unusual situations. This one mixes in a bit more dark humor than the 1950 version but the stories are different and the inclusion of Ryan adds zest. The direction is crisp. The supporting work by Charlotte Rampling, Daniel Stern, Jane Kaczmarek, and others is at times, amazing. I highly recommend seeing the 1988 DOA.","CAUTION -- MAY CONTAIN SPOILERS --In just the 13 years since this film was released, film-making has improved so much it is hard to rate older films accurately, but I give it \"7\" of 10, mainly because of the Quaid/Ryan interaction. Or maybe only 6, we'll see! She was only 26, a mere kid, and he a ripe old 33 when filming was done. This was their 2nd film together, they married in 1991.\n\"D.O.A.\" gets its title from the opening sequence, in B&W, when Dex (Quaid) gets himself to the police station, saying he is already dead. The whole movie is then told in \"flashback\" form, in color, and then goes back to B&W in the last scene.The mystery is unfolded gradually. Dex is an English professor, Syd (Ryan) is one of his students \"just wanting to spend one night\" with him, but gets caught up in his \"chase\" when he uses superglue on his hand, then wrapped around her wrist, so they become inseparable. Another student is Nick Lang, a budding author who is being put through college by the woman whose husband was killed by Nick's father. One day Nick falls to his death right past Dex's office window, onto the street below.Nick's fall turns out to be murder, meanwhile Dex starts to feel very sick and a blood test shows he has a poison in his system which will kill him in a few days. Then his wife, Gail, filing for divorce, turns out to be Nick's lover, and she is then murdered too because a copy of Nick's book ends up at her house. Turns out Dex's fellow English professor (Daniel Stern), jealous of Nick's book, decides to steal it for his own, but must kill everyone, including his friend Dex, so that he will not be exposed.In another twist, Nick turns out to be the real son of the lady putting him through school, and they had to stop him from dating his little sister. The plot keeps the viewer guessing, and the film has a sort of \"Hitchcock\" quality to it. But some of the dialog, and much of the action, are kinda \"cheesy\".  Dex's last line, to the policemen ready to tape his story, \"Just somebody's homework. That was all.\"I'm going to change my mind, and only give it \"6\" of 10, it's just a little too ragged.","This so-called remake of the 1950 movie by the same name is probably less similar to said movie than Avatar is to Dances With Wolves... It shares the premise of a man learning he has a limited time to live, and tries to find out who poisoned him in that time. The settings, characters and execution is very different, though, and personally I much prefer this \"remake\" to the 1950 movie.I was especially caught by the cinematography and color effects, which I found quite unique. The main character is properly fleshed out, and likable, and his story is fascinating and told in an effective and well paced manner. I found the resolution rather predictable, but it didn't really take away from my enjoyment of the movie.","D.O.A. is a remake of the 1949 film of the same title that shares the same premise but otherwise have a different story and characters. It stars Dennis Quaid, Meg Ryan, and Charlotte Rampling. It was directed by Annabel Jankel and Rocky Morton and scripted by Charles Edward Pogue. The writers of the original film, Russell Rouse and Clarence Greene, share story credit with Pogue. \"They didn't kill me; I was dead already,\" is the statement uttered by Dexter Cornell, an English professor at the University of Texas at Austin who has been poisoned by a slow-acting toxin and who has twenty- four hours to track down his killers before he ceases to exist. Cornell is a burned-out novelist trying to hold on to tenure at the university while seeing his marriage collapse around him. As if that weren't enough, he is receiving amorous come-ons from smart, young student Sydney Fuller and being badgered by another student, Nick Lang, to read his brilliant first novel. Not long after Dex demurs to Nick to read his novel, Nick is killed in a fall. Only then does Dex find out that Nick has been having an affair with his wife. Things keep going from bad to worse when, after an all-night drinking binge, Dex discovers that he has been slipped a poison that will kill him within 24 hours. Teaming up with the adoring Sydney, Dex tries to track down the person who poisoned him while dodging the cops, since he happens to be a prime murder suspect.It's not on the same level as the original, but this updated version still manages a few enjoyable twists, as it is a witty and literate thriller, with a lot of irony to cut the violence. The ending shouldn't be given away, but it hangs on a laughable motivation for murder that says more about the plagiarist Zen of Hollywood and screenwriters than anything else. Quaid is convincing as the chain-smoking English professor, Ryan is true blue as the stalwart coed and Rampling looks capable of keeping her victims alive just to toy with them.In summary, \"film noir on campus\" idea works surprisingly well as it has enough inventive moments to make it interesting.","When I found out the two credited directors were responsible for MAX HEADROOM I was expecting some MTV over directed nightmare but the artistic style was nowhere as bad as I was expecting . Okay it is a somewhat 1980s type film with an intrusive pop soundtrack in places but a great many ( Too many ) films from that period suffered the same way , it`s by know means as bad or as shallow as something like THE FAST AND FURIOUS from years later \nThe problem I had was with the script that lacks narritive drive for the first twenty minutes . It picks up in the middle but what really destroys the film is when the murderer is revealed at the end and he explains his motivations . \" What ? \" I cried almost falling out off my seat \" You done that because .... \" . Ridiculous doesn`t even begin to do it justice\nStick to the original film noir classic","Great suspense drama - truly edge-of-the-seat stuff.  I keep watching this one, it's so well acted, such great dialogue, intriguing and unexpected turns in the plot.  If you guess whodunit - and, more importantly, why - then you are one smartypants.  Like all really great dramas, you will discover as the film progresses that your original assumptions about good and bad are not quite the way things work out exactly","College English professor Dexter Cornell (Dennis Quaid) stumbles out of the rain into a police station claiming that he has been murdered. Once upon a time, he was a promising writer. His friend Hal Petersham (Daniel Stern) is desperate to publish in the tough Publish or Perish environment. Nick Lang (Robert Knepper) is one of his best students. He is divorcing his wife Gail (Jane Kaczmarek). Lang crashes into his office window falling to his death in an apparent suicide. At a bar, he runs into adoring student Sydney Fuller (Meg Ryan). He wakes up the next morning in her dorm room with a hangover. He goes to the clinic where he's told that he's been poisoned with a maximum of 48 hours to live.The original has perhaps the best noir opening ever. The fact that this movie opens with a black and white redux shows respect for that iconic scene. At least, we do not have a Psycho situation here. It's a completely different story and it's better for it. Even the original's story isn't top notch. This one has intriguing characters. It has bits of neo-noir style. It does suffer in the shadows of the original. It can never exceed it no matter how great it could be and I wouldn't call this great. At most, it's a good homage to the original.","I watched this about two weeks ago, and being a fan of the original, I always like to watch the remake and talk smack about the terrible changes they made. With that being said....This wasn't terrible. I really liked that even though the premise was the same (man gets poisoned, man goes to police to tell the story, movie unfolds in a flashback), I did not feel like I was watching the original movie after about the first 10 minutes of the film. Now the original is a noir classic, This movie though I would not say is a classic in the NEO NOIR category, it definitely is worth a watch.Quaid gives a slightly manacle performance that is fun to watch, and he does a pretty good job of holding the movie together. Some of the other cast members, well they work but their motives to me do not lead up to the results that are laid out, but this is a movie, so who cares? The production is spot on. The lighting is what I always imagine a noir picture to be. Fan shadows, lights through blinds, lit cig smoke. All the stereotypes that make a Noir a Noir are here. It does work and looks spectacular. This movie would be a great movie if you were to be studying lighting techniques.The end, I did see coming but it felt underwhelming. Noir is known for having some twist, or cool plot device that is set up without even knowing was set up, and then BOOM last ten seconds changes everything....not so much here.Is it as solid as the original? Well the original is a classic, but to me is a different movie, and other than the set up and the title, are different and should be judged on their own.I enjoyed it and will watch it again.","In case you are wondering, I *did* see the original 1950 \"D.O.A.\" movie years ago, and I remember that I enjoyed it. Much more so than this unnecessary remake. While it's not the worst remake I have seen, it is burdened by flaws that will be noticeable to even those who haven't seen the original version. For one thing, there is the portrayal of the central protagonist. He comes across as a kind of a jerk both before he is poisoned as well as when he knows he is dying and is trying to figure out who the culprit is. Another problem with the movie is that it is pretty easy to figure out who the culprit is as well as that person's motives - all you have to do is look at who is near the top of the cast billing and realize that that certain person seems to have no other purpose in the movie. The direction is stylish and effective at times, but more often than not it is loud and garish, and ends up being very distracting. Even if you dislike black and white movies (unlike myself), this is definitely one time where you'd be more satisfied with the original movie rather than this remake."],"review-user":["ma-cortes","seymourblack-1","Howlin Wolf","george.schmidt","RadicalTintin","barnabyrudge","artbyjude","dsadajr","honesty","tedg","Doc_Who","tostinati","ginger_sonny","whpratt1","Prof-Hieronymos-Grost","Spikeopath","herbqedi","TxMike","cartman_1337","Desertman84","Theo Robertson","georgethetee","SnoopyStyle","mungosmungo8694","Wizard-8"],"review-date":["14 January 2013","27 May 2011","5 April 2002","6 March 2003","30 January 2003","2 October 2004","4 December 2001","8 January 2006","20 December 1998","13 May 2000","29 September 1999","27 April 2003","31 August 2004","8 April 2004","15 July 2008","18 May 2013","8 December 2012","12 March 2001","14 August 2013","28 March 2013","29 July 2003","3 August 2002","28 October 2018","14 January 2017","11 September 2016"],"review-rating":["5","7","9","7","8","8","8","7","10","4","6","9","8","9","5","6","7"],"review-title":[" A man is given a deadly , slow-action poison and has only 24 hours to identify his murderous\n"," Dex's Frantic Race Against Time\n"," Fantastic Sleeper Film.\n"," VASTLY UNDERRATED; QUAID IS EXCELLENT\n"," A promising 'noir' remake\n"," Remake of a classic which just doesn't even come close to the required standard.\n"," Another One slipped by\n"," Pretty good update of the original film, with good performances.\n"," Stylish, slick and suspenseful, a compelling whodunnit\n"," New Life in the Genre on Presentation!\n"," awesome remake !cool ,awesome stars, great cast!!\n"," Watch-able but overdone --Spoilers\n"," flawed remake of excellent 1950s classic\n"," Meg Ryan was Fantastic!\n"," The title says it all\n"," Who was murdered? He was!\n"," Not really a remake - more like a clever homage with a gripping story in its own right\n"," Dennis Quaid/Meg Ryan film 3 years before they married, good suspense film I rate 6 or 7 of 10.\n"," Stylish, modern film noir\n"," Interesting Remake Of The 1949 Film Noir\n"," Sunk By The Script\n"," Truly edge-of-the-seat stuff\n"," homage to the original\n"," Interesting\n"," Yet another remake that wasn't needed\n"]}