{"review-url":["http://www.imdb.com/title/tt0040781/reviews"],"review-text":["The tone is set early on. Cy Schindell, as a cop: \"Who's in that can?\" Voice from within (unmistakably Shemp's): \"Just garbage!\" Can't three guys enjoy their Saturday night out stuffed in a garbage can without being hassled by The Man? Thus the poor Stooges become the prime suspects for an armed robbery. Actually, that's a good thing, otherwise we wouldn't see the Stooges trip up police captain Vernon Dent on his own polygraph! Lodge meeting, huh? Yeah, sure, Vernon! Makes you wonder what debauchery he was really up to. The best delivery of a line in this short has to be Shemp's \"Boy, you got a lotta crust!\" when Larry is discovered to have run up a huge tab at the Elite Cafe. Thankfully, Christine McIntyre is in this short, too, as Gladys, the proprietor of the café. It's also good to see Kenneth MacDonald. The scene where he says, \"Angel . . . Strangers in the house\" is priceless. I may have said too much already, so get out there and see this short!","The Three Stooges has always been some of the many actors that I have loved. I love just about every one of the shorts that they have made. I love all six of the Stooges (Curly, Shemp, Moe, Larry, Joe, and Curly Joe)! All of the shorts are hilarious and also star many other great actors and actresses which a lot of them was in many of the shorts! In My opinion The Three Stooges is some of the greatest actors ever and is the all time funniest comedy team! This is a good Three Stooges short! The Stooges are very good in it so is Christine McIntyre, Kenneth MacDonald, Frank Lackteen, Vernon Dent, Duke York, Stanley Blystone, and Cy Schindell. Its quite good to watch around Halloween time! There is another similar like this Three Stooges short with alternate scenes called Of Cash and Hash.","This is not one of the better Stooges efforts, with more a re-hash of comedy bits they had done in the past with Curly. Routines such as the cracker-swallowing clam in the soup was performed by Moe, who literally imitated Curly with the noises and facial gestures. Of course, Moe is no Curly so it's not funny. Been there, done that - and much better.Christine McIntyre who, along with Vernon Dent, played in a million of these Stooges movies, plays a restaurant owner who is broke but is befriends by the boys after she bails them out of a jam with the police. The cops had accused the Stooges of being crooks on the lam. Obviously, it wasn't them, but they are dragged down to the station and given lie detector tests, which is probably the best part of the film. Anyway, \"Gladys\" (McIntryre) vouches for the boys and they, in turn, help her out at the café and then later go to a country house she is interested in buying or selling (I forget, to be honest). That's when we get the wild finale with the real crooks and a cleaver-wielding ghoul named \"Angel\" chasing our boys. Those chase scenes with the Stooges and scary characters are always funny. It's too bad the rest of the film wasn't as entertaining as the last three or four minutes.","This short was director Del Lord's last and only Shemp short. The problem: It was quite weak and the cafe scene was pretty much a carbon copy of a Curly short \"Busy Buddies\" (1944). The interrogation scene was pretty funny, and the beginning part of the cafe part. But there are a lot of plotholes in this short. For example, why are the stooges hiding in the garbage can when the police come? In the remake, \"Of Cash And Hash\"(1955), director Jules White fixes this and the reason for the stooges hiding in the garbage can is because there is a gunfight between the police and the armored car robbers. The scene in which Moe is having trouble with the oyster was done before with Curly in \"Dutiful But Dumb\" (1941). The spooky house part wasn't all that great except for the hilarious scene on the outside of the spooky house. To top it off, the ending had no sting to it. Rating: C-","\"Shivering Sherlocks\" marks the final Three Stooges directing assignment for Del Lord, the man who really helped to shape the screen personalities of the Stooges. In this film, the boys get picked up by the police and fib that they have a job as restauranteurs. This eventually leads them to the hideout of the real crooks.Highlights: The police captain (Vernon Dent) uses a screwy lie detector device on the Stooges, but he ends up breaking the machine when he tells a lie himself! Shemp dupes the villains (Kenneth MacDonald, Frank Lackteen, and Duke York) by dropping flour barrels on top of them; he accidentally crowns Moe and Larry, too. Shemp makes \"cackle soup\" by pouring hot water over a raw chicken, then sliding the bowl of soup down the counter and onto Moe's back. As the Stooges try to break into a haunted house, Larry finds a crowbar; when Moe asks him where he got it, Larry replies, \"In the house.\" It's interesting to note in \"Shivering Sherlocks\" that Moe recreates his brother Curly's classic oyster soup gag from \"Dutiful but Dumb\" (1941), and he even imitates Curly at one point, but regrettably with not quite the same finesse as Curly had."],"review-user":["angus_dei","Movie Nuttball","ccthemovieman-1","holme-1","slymusic"],"review-date":["10 March 2006","17 June 2004","8 February 2007","10 June 2001","7 October 2009"],"review-rating":["5","4"],"review-title":[" Angel . . . Strangers in the house!\n"," Good Stooges short!\n"," Only The Ending Saves This Weak Re-Hash Of Routines\n"," A weak short, but some good one-liners\n"," Stool pigeons\n"]}