{"review-url":["http://www.imdb.com/title/tt0020081/reviews"],"review-text":["A comedy of manners, requiring close concentration to catch the liveliness of the dialogue. Basil Rathbone is magnificent as a dapper wolf; his performance is perhaps the best I've seen in a role like this, of course aided by the snappy discourse between himself and the slower-but-sweeter Norma Shearer. No classic but very entertaining. Anyone amused by witty pick-up lines from the 30's should find this quite funny.","This 1929 version has all the tight pacing and wit that the 1937 film lacks. It also doesn't have the tacked-on moralizing ending that so blights the 1937 version. Basil Rathbone (so young!) is charming and funny with that hint of edge that he could do so well. The two-part scene in which he invites Norma Shearer for a little supper at his apartment and is then verbally rebuffed by the \"butler,\" only to return to kiss the hem of Norma's garment is priceless. I watched it four times. Basil Rathbone is believable as an English lord in ways that Robert Montgomery in the 1937 version is so painfully not believable. George Barraud as Charles effaces himself effectively in the beginning scenes as the butler, and his scenes with Rathbone are not marred by the hint of effeminacy Montgomery brings to his fraternization scenes with the butler when that is not called for in the script. As much as I love William Powell, and I think he's the only reason to see the 1937 version, he can't manage to efface himself effectively in the beginning scenes as the butler. He's always William Powell. As enjoyable as Powell is, when you see George Barraud move from effacement to boldness, you really see how it should be done.","Historically speaking, this is a rather important film. For MGM, it was their first talking picture that featured the sound being recorded optically on the film strip--as opposed to their previous practice of recording the sound on a separate record. The previous method was a mess, as synchronizing the film and music throughout the showing was difficult and the phonograph tended to wear out after only a few uses (literally, a half dozen or less!). So whether or not this is a great film or as good as the 1937 remake, at least it should be remembered for ushering a new era at the studio.Unfortunately, while the sound technology was a breakthrough the film's sound was still very antiquated. First, with all the early talkies the studio hadn't figured out how to add sound to the finished product. Instead, they literally had an orchestra just off camera performing music LIVE as the actors acted! So, incidental music is mostly absent from these early films. Second, the style and delivery of the dialog in this film is VERY, VERY old fashioned. The actors often over-annunciated and seldom sounded real. Instead, they sounded like stage actors--and very bad ones at that. Third, microphones and recording equipment still were very poor--and at times (particularly when people are talking in the background) it's hard to hear what people are saying. Too bad this one isn't closed captioned (at least this goes for the version shown on Turner Classic Movies)--it would have made enjoying the film a bit easier.As for the plot, well, it is also VERY old fashioned. The story is pretty much the same as the 1937 remake--and I hated the plot of the remake as well. Too much talking and some amazingly unbelievable plots make this a hard film to enjoy today. After all, who would believe that when society people find out one among them is a lying thief that they decide to forgive the person and actually help them financially?!? So, this combined with the antiquated sound make for tough viewing. Of interest to film historians and die-hard cinemaniacs like me!","Antiquated, early talkie curio from Frederick Lonsdale's hit play of chic American jewel thief (Shearer) residing among the gullible rich London aristocrats, and taking interest in dashing Rathbone.  Like the 1937 version, it is dated now, but is quite interesting to watch thanks to the star chemistry","I realize that this is a minority view, but I find the later version from the late Thirties of The Last Of Mrs. Cheyney superior to this one. I'm sure brickbats will follow.This is not choosing Joan Crawford over Norma Shearer's performance here. It's a question of the technical advancements made over a decade to a film that was one of MGM's first all talkie productions. This version quite frankly is a photographed stage play. The Last Of Mrs. Cheyney is a play not often revived I'm sure as it belongs to an era of fluff. Shearer is a con woman with a small entourage who pretends to be a wealthy widow from Australia. Actually she gets herself invited to the best homes in London, the better to scope them out for robberies which butler George Barraud does.However when at one party Shearer arouses the interest of Lord Basil Rathbone it's on several levels. He's smitten with her, but he knows something's afoot since he recognizes Barraud as a thief previously arrested. After that it's a game of cat and mouse.For reasons I can't explain The Last Of Mrs. Cheyney got a nomination for 'writing achievement' as it was phrased then. As this was just a photographed version of Frederick Lonsdale's play, then what was the achievement?The film is the second sound film for Norma Shearer and it was Basil Rathbone's debut in talkies. It has some witty dialog, but in the end it's entertaining fluff.","I found this early talkie difficult to watch and I'm a Norma Shearer fan! It's not her fault, but the primitive production values of this film would cause any viewer to become bored.  90% of the movie is filmed with \"medium shots,\" and it's very similar to watching a dull play.","Posing as a wealthy Australian widow, con woman Norma Shearer (as Fay Cheyney) encroaches herself in Monte Carlo society. Her nefarious plans are complicated by an attraction for Lord Basil Rathbone (as Arthur Dilling). This version of Frederick Lonsdale's hit play is in good hands with director Sidney Franklin, who had a lack of flash that was perfect for early talking films; he manages the new technology competently. Ms. Shearer is charming and theatrical. In his sound debut, Mr. Rathbone makes a good impression despite raccoon eye make-up. Handsome rival George Barraud (as Charles) is impressively natural and Herbert Bunston (as Elton) chews into the script. MGM tried a re-make in 1937 with Joan Crawford , but it failed to move \"The Last of Mrs. Cheyney\" off the stage. The plot has appeared in dozens of other stories.****** The Last of Mrs. Cheyney (7/6/29) Sidney Franklin ~ Norma Shearer, Basil Rathbone, George Barraud, Herbert Bunston","I hate to do this, but I would nominate Rathbone's as the worst performance I've ever seen by a major actor in a major movie. From first to last, he acts as if were emoting on a theater stage rather than a movie sound stage. Of course, director Sidney Franklin is also to blame. He should have taken Rathbone aside and told him to tone himself down and there was no need to raise his voice to reach the last row in the dress circle. Fortunately, the other actors are not half as bad and all the women are actually very competent. The play itself, however, is also partly to blame. It's so old hat that we really don't care a hoot whether Norma Shearer is playing Mrs, Cheyney as a sneak thief who wants to get away with the loot or as a con artist who has decided to reform. Sidney Franklin's bland, uninspired, but decidedly stagey direction doesn't help either. Available on an excellent Warner DVD.","Talky, uncinematic and slow-as-molasses, \"The Last of Mrs. Cheyney\" (1929) is really for film historians only (the second half is SLIGHTLY more tolerable than the first). Norma Shearer is OK but not yet in full bloom, Basil Rathbone comes off best, while Herbert Bunston is particularly awful. Gotta love the \"good woman\" = \"virgin\" coded speak, though. ** out of 4.","Last of Mrs. Cheyney, The (1929) * 1/2 (out of 4) The rich British society welcomes Mrs. Cheyney (Norma Shearer) as one of their own but what they don't realize is that she's actually connected to a group of jewels thieves. THE LAST OF MRS. CHEYNEY was a hit on the stage so it's easy to see why MGM would want to produce it for the screen. It must have done well as the studio would go on and remake it twice including once in 1937 with Joan Crawford. Early film buffs will be interested to know that this was MGM's first talking picture that had the sound actually recorded onto the film instead of the Warner method of recording the sound on a separate disc. That is certainly a historically important thing but it's doubtful very few outside of major film buffs are going to care about that. The finished product is what's going to really make one interested and sadly this is a pretty poor movie all around. You can start with the fact that this is obviously an early-talkie and we get non-stop dialogue scenes that just go on and on and on to the point where you really do forget what they're talking about. It's as if you're watching the start of the scene and listening to what the characters are saying but within a minute or two you're completely zoned out and this happens quite often. There are some plot points that pop up ever so often but not a single thing is believable and more often than not you just sit there wishing everything would be over with. The performances are all rather bad and that includes Shearer. I haven't seen too many of her pictures but it's clear she had talent but it's also clear that this is perhaps the worst I've seen from her. Her line delivery is extremely bad but I'm giving her the benefit of the doubt that she was just working with a new system and doing what she could. Often times it seems as if her and the other actors are leaning towards where the mic is just so that the dialogue can get picked up. Basil Rathbone is fair in his part but at the same time his line delivery is quite poor. The supporting players include Hedda Hopper, Herbert Bunston and George Barraud but none of them add much. The sound quality isn't the worst that I've heard but at the same time it's easy to tell that this was very early in the game. For the most part the voices are heard just fine but the added sound effects really come off poor and the constant hiss in the track becomes annoying after a while. All of this is just a part of its time but sadly the film itself is just hard to sit through.","This version is very painful to watch.  All of the acting is very stilted but especially that of Norma Shearer who is still acting as though she were in a silent movie instead of a talkie.  Check out the 1937 version with Joan Crawford, Robert Montgomery and William Powell which is much more entertaining."],"review-user":["Sleepy-17","holdencopywriting","MartinHafer","nickandrew","bkoganbing","Pat-54","wes-connors","JohnHowardReid","gridoon2018","Michael_Elliott","dlduncan1"],"review-date":["14 September 1999","14 June 2011","15 June 2011","3 September 2000","5 February 2012","23 September 1998","20 June 2011","25 July 2015","3 September 2018","24 June 2011","27 May 2002"],"review-rating":["9","3","6","3","6","6","5","4"],"review-title":[" Stagey but clever, full of zingers and innuendo.\n"," Much better than the 1937 version! Basil Rathbone and Norma Shearer are excellent\n"," Despite its historical significance, it's a slow and difficult movie to enjoy.\n"," Early talkie with MGM queen Norma Shearer\n"," A Minority view\n"," Norma Shearer in her second talkie!\n"," To Catch a Thief in Monte Carlo's Grand Hotel\n"," Norma Shearer saves the night!\n"," Filmed theater, and hard-to-get-through\n"," Important Film but Deadly Dull\n"," Dated\n"]}