{"review-url":["http://www.imdb.com/title/tt0072930/reviews"],"review-text":["The first of the Italian rip-offs of the French soft porn blockbuster (though it might be interesting to note that the boot-shaped country actually got their first with Cesare Canevari's 1968 IO, EMMANUELLE starring Erika Blanc) is a very different kettle of fish than the sleazy sequels provided by the late, questionably great Joe D'Amato. It is much closer in spirit to the now very dated Just Jaeckin film from 1973, taking a pokerfaced look at male/female relationships, questioning such then hot topics as fidelity and jealousy, all in luxurious exotic surroundings. Unlike D'Amato, director Albert Thomas (aka Adalberto Albertini, who also made the hard to find YELLOW EMANUELLE, actually a sexed-up version of MADAME BUTTERFLY !) does not present us with predatory drug lords, snuff movie makers or rampaging cannibals, making for an admittedly less sensational yet far more erotic viewing experience.Photo journalist Mae Jordan aka 'Emanuelle' (lovely Java-born Laura Gemser in her first lead role following bit parts as a Thai masseuse in EMMANUELLE 2 and an 'unspoilt native' in Just Jaeckin's portion of the rarely seen COLLECTIONS PRIVEES) flies down to Nairobi where she's to shoot the stills accompanying an article by noted British writer Anne, played by the very Teutonic Karin Schubert with a butch haircut that takes some getting used to. Anne shares an 'open relationship' (remember when this was made) with her Italian husband Gianni (Angelo Infanti), meaning that both pretty much jump anything with a pulse. Contrary to her subsequent reputation, Emanuelle appears positively reticent compared to her heavy breathing hosts, smoldering seductively at Gianni by way of foreplay until the exquisitely tantalizing pay-off. Okay, so she does make up for this lack of wantonness at the end when she does an entire male hockey team on the train. I kid you not.Production on this sexploitation classic is quite impressive, especially the superb cinematography. And Nico Fidenco's musical theme is a solid favorite of anyone with more than a passing interest in the genre, a hilarious Eurotrash pop ditty (try to make out those totally nonsensical lyrics and have a full evening's worth of fun with the family !) that turns up throughout the entire film in every conceivable type of rendition from slow 'n' sexy to hip-gyrating disco.This is entirely Laura Gemser's show though. Billed simply as 'Emanuelle' (as was another actress on the same director's elusive EMANUELLE NERA 2), she lights up the screen from start to finish. Not yet submitted to endless rape scenarios (as she would be once D'Amato took over), she seems much more relaxed than in later films, even smiling from time to time, a rare occasion as anyone who has seen some of the lady's work surely knows. A flawless Eurasian rather than as the title suggests black beauty (she hails from Dutch India now Indonesia and is actually quite close in physical appearance to the supposed author of the novel Emmanuelle Arsan), she projects a slightly passive, even submissive sensuality which somehow detaches her from the 'depravity' her morally corrupted cohorts indulge in. Unlike the French film, cheapskate moralizing is kept to a bare minimum, almost thrown in as an afterthought near film's end when Emanuelle tells Gianni that he hasn't lost her as he never possessed her to begin with. I swear you could hear audiences of the Just Jaeckin version groan whenever Alain Cuny's supremely irritating Mario showed up on screen as it meant we were in for too many minutes of halfbacks libertine philosophizing as an alibi for getting the divine Sylvia Kristel (now living in the Belgian capital of Brussels by the way...) to disrobe, the real reasons theaters were packed for years on end. Gemser's later husband, Gabriele Tinti (now deceased, she has remarried), appears on the sidelines as the constantly drunk 'Scottish' (huh ?) writer who forces himself briefly on Emanuelle amid the African ruins at some point, but no real sex scene though.","The main reason to check this one out is to watch Laura Gemser in all her glory.That's reason enough for me.She heads to Africa as guests of another rich guy that seems to be all over these films. Huge mansion near the jungle. Hunters staying around for parties when they aren't out hunting zebras. And said parties becoming drunken orgies.All the high society types in the Emanuelle films seem to have out of control fetishes. And Emanuelle beds most of them.Joe D'Amato did NOT direct this one. He just ripped it off and used the same cast(s). And did anyone notice the 'subliminal' sexual images at the gas station? And why did most of the men stay dressed during the sex scenes? Coherence? Hardly any. BUT GODDESS GEMSER IS BEAUTIFUL.","This \"Black Emmanuelle\" is a typical Italian cinema product of the 70's. Whenever there was a new & popular trend at the movies, whether it was in horror, Sci-Fi or drama, Italian cinema would immediately cash in on it by rapidly creating their own equivalent. The story basics would be pretty much identical to the original product, but the Italian version would distinguish itself with either more gore, more violence or (much) more sleaze. Following the immense success of the French film \"Emmanuelle\" starring Sylvia Kristel (bearing in mind that, for once, that film already is a rip-off itself), Italy came up with its own insatiable sex nymph who ends every line she says by taking her top of. The gorgeously stunning Laura Gemser plays a photographer called Emanuelle (notice how there's only one \"m\" in her name to avoid legal difficulties) who travels to Africa for...no particular reason, actually! No reason other than to have random sex with a bunch of rich males and females that do nothing all day but throw parties and lay down by the pool. The film itself is quite dull, with the exception of several beautiful shots of the African wildlife, but Gemser is pure candy to look at and the original music by Nico Fidenco is among the best I've ever heard. This first film in a series of 8 starring Gemser strangely also is the least eccentric and most common one! The directing would later be taken over by the infamous Joe D'Amato who transformed Black Emanuelle into a trashy sex-guru that shows her sexual skills in all the corners of the world, from Asia to America and even among cannibal tribes and inside female prisons! In this first film, Emanuelle still is a sensitive and emotional girl whereas she's be a dominating shrew in the later films. No extreme sleaze-stuff happening here, like horse-masturbating for example (check \"Emanuelle in America\") which is probably why my national TV-station programmed it on Saturday night. However, if you happen to have an original copy, you should treasure it, as this is an extremely rare and hard to find movie!","Laura Gemser plays a magazine photographer who is sent to Africa for a photo shoot. There she is met by a couple and other swinging couples. They all stay at this huge, very touristy hotel with a gigantic swimming pool. One night they have a pool party complete with \"real live\" native dancers. It's very un-politically correct and very kitschy. Later, Emanuelle finally has her photo shoot, which turns out to be in one of those drive-through, stay-in-your-car safaris (albeit the photography is gorgeous). Throughout the film, Emanuelle is going after every man she meets. The photography is very well done in this film. There are scenes with cascading waterfalls, galloping giraffes and ancient ruins. The film is worth seeing for the soundtrack by Nico Fidenco alone.","Some folks say this is the best Emmanuelle movie while others say it sucks. Well, I think they're both right. All the Emmanuelle (French)and Emanuelle (Italian) movies have laughable dubbed dialogue, idiotic libertine philosophizing, a heavy dose of European art houses pretensions, and of course mildly erotic if increasingly tedious omni sexual sex scenes. The Italian movies added a borderline-racist fascination with interracial coupling, and Joe D'Amato took the series into some irredeemably sleazy territory involving cannibals and snuff films. Still all these movies were shot on film, they all had some breath-takingly beautiful natural scenery (and I don't just mean the women), and they were, if only by default, interesting exotic travelogues. \"Black Emanuelle\" typifies both the best and worst aspects of the series.Unfortunately, after once talented director Walerian Borozyx for some reason cast America b-Movie bimbo Monique Gabrielle (who makes Laura Gemser look like Meryl Streep)in \"Emmanuelle 5\", and \"Emmanuelle 6\" with Natalie Uher (actually the best of the legitimate French movies) and a French TV series hosted by original Emmanuelle, Sylvia Kristel, didn't take, Emmanuelle would go Hollywood. Film became porno-gloss video. Exotic African and Asian locations became left over \"Star Trek\" sets. And the most beautiful naked women God could create (Laura Gemser, Natalie Uher, Nieves Navarro) were replaced by the most beautiful naked women Beverly Hills plastic surgeons could create (Krista Allen, Holly Sampson). Stupid but exotic became stupid and boring. There is only one reason to watch a modern Emmanuelle movie, but that only takes your average dateless wonder about ten minutes. The original \"Black Emanuelle\" is awful, but it will at least hold your interest until the end, making it--by default--the best of the bunch. (However, when I can get a cheap copy or learn to speak Italian, I'd like to see the very first Emmanuelle--\"Io, Emmanuelle\" with Erika Blanc)","I loved this movie. Laura Gemser is simply gorgeous and all movies she bares her perfect body in are worth watching, but what I loved about this one in particular were the lesbian scenes with Karin Schubert. It's a very nice contrast between Laura's exotic beauty and Karin's extremely slutty looks. My favorite scene is when Laura waits in the car while Karin goes inside the gas-station and has wild and nasty sex with the black owner...It's great!","The first of many Emanuelle (spelt with only one 'm') films, this Italian rip-off of the famous French sex classic Emmanuelle (two 'm's) sees its sultry star Laura Gemser as journalist/photographer Mae Jordan (known professionally as—you guessed it—Emanuelle), who is in Africa for her latest assignment. Her employers are married couple Ann and Gianni Danieli (Karin Schubert and Angelo Infanti), who supposedly want our sexy snapper to capture shots of African ruins, but seem more interested in getting her into bed (and who can really blame them? The lovely lens-woman is gorgeous and gagging for it!).What follows is a string of silly soft-core couplings with Gemser and her free-loving associates getting busy with each other at every available opportunity; these are interspersed by some really dull exposition about Ann and Gianni's marital troubles (which serves as the basis for the weak plot), some non-sexual nudity including a hilarious photographic session with Ann going back to nature (pretending to be a gazelle!), plus a little bit of 'padding' in the form of National Geographic style wild-life footage.Director Bitto Albertini's handling of his material is, for the most part, fairly routine, although he does excel when it comes to delivering very unsubtle suggestive imagery: in particular, Ann's sex scene with a garage mechanic is made all the more entertaining by the juxtaposition of shots of a petrol nozzle filling up a car, whilst Emanuelle's naughty encounter with a hockey team whilst on a train is inter-cut with the locomotive's piston pumping rapidly in and out. Hardly a stroke of genius, but very funny!Later entries in the series, helmed by sleaze-king Joe D'amato, combined Genser's soft-core romping with other exploitation sub-genres, making for more satisfying films as a whole. This one, however, is content to simply show as much naked flesh as possible without ever crossing the line into hard-core territory. It's just about worth catching if you're a big fan of Ms. Gemser and/or very trashy films in general, but probably of little interest to anyone else.","If it was popular in America, you can bet that there will be an Italian rip-off of it, and obviously 'Black Emanuelle' is a rip-off of the successful French porn classic 'Emmanuelle'. Black Emanuelle would go on to become a very popular franchise in Italy, with the insatiable Laura Gemser getting up to allsorts, including an outing into the jungle with cannibals, escaping from a women's prison and going to Bangkok under the direction of such trash film luminaries as Joe D'Amato and Bruno Mattei. This first outing is tamer than some of the later stuff, but still should satisfy fans of this series. Naturally, the plot focuses on Emanuelle, a young journalist who travels to Africa on an assignment (to have sex with as many people as possible, I think). She gets herself involved with a couple named Ann and Gianni Danieli who are having marriage trouble and both turn to the young journalist for a bit of 'comfort'. Naturally, things go a bit awry and Emanuelle is forced to flee Africa, but with Gianni on her tail...In terms of plot, this film is not all that exciting and clearly it's all just an excuse to show as much sex as possible. This actually isn't all that much of a bad thing as Laura Gemser obviously relishes this role and seeing her with her clothes off is what most people will be tuning in for anyway. The music is superb and the title track is absolutely pure seventies trash flick gold and is sure to delight fans of this stuff. Director Bitto Albertini is not a well known cult name but he has a background in cinematography and as such the film looks very nice, which compliments the central theme nicely. While Emanuelle would go on to become something much less than innocent in all of the later series efforts, this film focuses more on her losing her innocence than the actual sex and that works fairly well as that is basically what the original French film was about. Overall, I cant say that this is one of my favourite films and I do prefer some of the later efforts in this series, and the original French film, but Black Emanuelle is certainly worth a look if only to see the start of one of cult cinema's most popular series'.","Would it be splitting hairs to point out that the Emanuelle in question is not \"black\" but Indonesian?  I suppose it's no more silly or abstract than LL Cool J being Robin Williams' full-blood brother (\"Toys\"). Sumptuous cinematography, creative carnality, and the gorgeous (Laura) Gemser, pre-empt all political incorrectness.  Pedophiliac permutations \"pop up\" (when a 12-year-old native boy eagerly presents Emanuelle with a phallic \"good luck\" icon and says \"I give it to you!\") and are \"purged\" and pacified when, a short time later, she drinks a strange potion at a ceremony, copulates on the ground with an anonymous, young tribal dancer (in full view of villagers and friends), and realizes she has had meaningless sex (well, duh!).  Whatever happened to Laura Gemser's brief foray into straight cinema when she starred with Michael Landon in a 1983 made-for-tv movie?  I give this sex-seared safari seven sharp spears, six shrunken skulls, five fat ferrets, and a porn queen in a pear tree!","Laura Gemser is one of the best actresses in the Emmanuelle movies.  She has a sure, sexy, friendly, erotic, girl that you could meet & not be snubbed by attitude that puts her over the line in my opinion. She gets in these situations with ease & is not only good to look at, but makes her role believable.  Her sex scenes are enough to melt the heart of a statue.  The story line is ok, the soundtrack is good, the acting is fair, but Laura makes the movie what it is, kind of like how Jack Nicholson can steal the movies he acts in.","Laura Gemser is breathtaking! She is beautiful beyond words. Even now in her senior years she is still stunning. She is a natural beauty in every way. This fact must be understood when watching Black Emanuelle.Whether it intended to be or not, This movie is at it's core, a love letter to both Laura Gemser and South Africa as a whole. The cinematography is breathtaking, as is the sight of Laura Gemser. And we get plenty of both in spades.The plot is little more than a vehicle to transition from one sex scene to the other. Which is fine, as all of the scenes have Gemser either participating or present. So no complaints here.Well actually, I only have two complaints. The two male leads in the movie, Look almost identical, And sadly if you are following the story it makes figuring out who's who a nightmare. My second complaint is the Gang-bang scene on the train, It was shoe horned in and feels like it, as it makes no sense at all even be porn standards.In the end, It's worth checking out. If nothing else but for the amazing view of Laura Gemser","The incomparable Laura Gemser appeared briefly in an erotic scene from the French \"Emmanuelle 2.\" This amazing woman did not go unnoticed, and was soon cast as the lead in this all new Italian series, where she is the centerpiece; a beautiful photojournalist who travels the world experiencing all the mysterious eroticism that the world had to offer. In this first installment, Mae Jordan/Emanuelle is sent to Africa to photograph the people as well as the stunning landscape and wild exotic animals. Much like Sylvia Kristels character, Emanuelle has not come into her own when it comes to being open and comfortable with her own sexuality. This first film is basically about how she becomes the \"Emanuelle\" that most exploitation cinema fans are familiar with. Filled with gorgeous cinematography, beautiful people, and an intoxicating 70's score from the legendary Nico Fidenco, this one is sure to please. Those who enjoy the more story-driven style of the original french \"Emmanuelle\" should definitely like this as well. The main story here being an interesting cat and mouse tale of a womanizing playboy who comes to the realization that he has fallen in love with a woman who is the female version of him! Sexy, fun and totally entertaining throughout; a soap opera to be sure, but one with enough skin and general eye candy to keep the male viewers entertained. For some reason this is the hardest one in the series to find on DVD. there has never been a legitimate DVD for this, which is very strange. The bootlegs that sometimes appear online will have to do until someone gives this diamond of a film a proper release.","This is not my favourite movie of Laura Gemser's \"Emanuelle\" series-I still think that D'Amato's \"Emanuelle in America\" is much better film.Of course there is plenty of sleaze,lots of lesbian action-some of the sex scenes like the hot intercourse between Karin Schubert and the black man at the gas station are suitably titillating.The soundtrack by Nico Fidenco is simply amazing!Overall I give it 7 out of 10-not bad little flick,if you like Italian exploitation!Still I'd love to see a hard core version!","You know you're watching softcore with the wrong attitude when the poor dubbing bothers you. I'm okay with the crappy lip syncing but the sound mix is really of too. Every time someone says anything it sounds like there's a narrator. Either way, this is pretty much the purgatory between boring French professionalism and the heavenly campy Joe D'Amato flicks involving cannibalism and whatnot. Don't get me wrong, there's a fair dose of exploitation in this one, but there's always room for more. Laura Gemser stars, and that's good because she's hot. It's a bit freaky how at times you can see her bone structure, but she still rules over her white counterpart. You can also make a cool drinking game of how often she takes her kit of. Often. Every reason is good. Every person is good. Every location is good. One scene even involves an entire hockey team, whatever they are doing in Africa. Sometimes the plot gets in the way, and the supporting cast consists of some really vile looking people, but there's enough Laura Gemser for all.","Her bit-part as a masseuse, in the lurid sequel to the original 'Emmannuelle', evidently gave someone the bright idea of putting a spanner in the works of the French soft-core series' gambit by inverting the Caucasian carnality and casting Javan stunner Gemser in a leading role in this, the rather tame first of a series of sexploiters that became increasingly depraved as sleazier directors took on in-name-only sequels.Someone (and surely not the English-language over-haulers Warner?) was also anticipating an 'A Star Is Born' type meteoric rise out the results, judging by the way the actress is credited merely with the eponymous moniker of the on-screen heroine, albeit with a couple of consonants sacrificed as insurance against litigation.Gemser's tenure in the series saw her as an 'intrepid' photographer, allowing of course for all manner of subsequent globe-trotting adventures. But, whilst she may well have been one the very most beautiful actresses on the screen at that time, any thespian talent that may have been there to discern becomes mired in the same sort of unfeasibly facile cogitation (\"I have to confess that since I've been in Africa, I find white skin less appealing...\") that was to be found in the French films.And in this particular entry, much to the consternation of the raincoat brigade the essence of on-screen carnality is as much to be found in puerile symbolism (pumping engine pistons!) as it is in prosaic couplings - although naturally these include generous dollops of 'exploratory' lesbianism. Connoiseurs of kitsch are however guaranteed a continuous stream of aural delights, what with such epithets of ethnographic wisdom as \"I do nothing to be a perfect black, she does everything to be a perfect white\".","The success of the original French \"Emmanuelle\" series (I've only watched the first, which wasn't too bad considering) led to a spate of imitations; the Italian counterpart, which even changed the race of its heroine, was clearly less polished and more exploitative - descending more and more into vulgarity as the series went along. Incredibly, there were 16 \"Black Emanuelle\" films in total, with the heroine even having the spelling of her name changed to avoid copyright issues!! Still, Laura Gemser - the titular object of desire - became almost as much of an icon as the original Emmanuelle, Sylvia Kristel (although, personally, she's too skinny for my tastes)! Here she's even billed as \"Emanuelle\" rather than with her real name - with the director, likewise, becoming \"Albert Thomas\"! In itself, the film offers little of interest: as a matter of fact, one would do best to approach it as a travelogue with some decent footage of the African wildlife. With respect to the sex scenes, I don't know how complete the version I watched was but, while there was a lot of nudity, none of it was very explicit - or even titillating (the scene that came closest, perhaps, was when Gemser - who works as a photographer - and her companion Karin Schubert turn the camera on each other, naturally sans clothes, in the middle of the jungle)! The film also features an artist made up to look like Salvador Dali but, mercifully perhaps, his scenes do not take much of the running time. The score by Nico Fidenco is typically bland 70s pop and, really, nothing to write home about."],"review-user":["Nodriesrespect","haildevilman","Coventry","Katy-13","lazarillo","DimpleMi","BA_Harrison","The_Void","dvox","franco-28","zambonilord","Falconeer","HumanoidOfFlesh","Sandcooler","Waiting2BShocked","Bunuel1976"],"review-date":["16 July 2004","28 June 2006","22 January 2006","21 March 1999","29 October 2004","13 April 1999","6 March 2010","5 April 2008","11 May 1999","12 October 1999","6 November 2013","15 August 2008","18 August 2002","12 October 2008","9 September 2007","8 September 2006"],"review-rating":["9","8","6","8","5","6","6","8","7","1","2"],"review-title":[" Once You Go Black...\n"," The Goddess' first\n"," Move over, boring White Emmanuelle!\n"," A sexy photographer in Africa\n"," The Best of the Worst\n"," I liked this one!!!\n"," Introducing Emanuelle (with only one 'm').\n"," The start of one of the most popular cult series'\n"," Sex on the Serengeti as amorous Asian actress arouses Africa!\n"," One of the best Emmanuelles to be made\n"," A flawed classic\n"," The first in an amazing erotic series...\n"," Typical piece of Italian sleaze.\n"," Uhm, a friend was watching it\n"," Sex on Safari\n"," BLACK EMANUELLE (Bitto Albertini, 1975) *1/2\n"]}