{"review-url":["http://www.imdb.com/title/tt0043581/reviews"],"review-text":["This is a witty and delightful adaptation of the Dr Seuss book, brilliantly animated by UPA's finest and thoroughly deserving of its Academy Award. Special mention should be made of the superb music score and sound effects, which are an integral element in helping to make this such a memorable and enjoyable cartoon. Later episodes in the series (of which there were four in total) were not actually based on original Dr Seuss material, although all but the last continued to use his familiar rhyming style. The three sequels were: Gerald McBoing Boing's Symphony (1953); How Now Boing Boing (1954); Gerald McBoing Boing On Planet Moo (1956) - although he also appeared in a later episode of Mr Magoo.","If there's one cartoon that helped to put UPA on the map more than any other, It's Gerald McBoing-Boing. This tale of a little boy who only speaks in sound effects has kept its charm for the last 57 years. Besides the effects, loved the music, the abstract animation and backgrounds, the narration by Marvin Miller, pretty much everything. And it won the Oscar for Best Animated Short of 1950. Glad to have seen it on YouTube after reading about this Dr. Seuss story for so many years. And Rocky and Bullwinkle creator Bill Scott also contributed, how awesome! Hope to see the subsequent shorts made in the series, if not on YouTube, then maybe in a DVD collection. Now I guess I'll watch another UPA short there...","This short, which won an Oscar, spawned two sequels and a TV cartoon show, has minimal animation but adelightful script (by Theodore Geisel aka Dr. Seuss) and aneven more memorable and enchanting main character.  UPA pioneered a style of animation that even influenced Disney during the mid-1950s and produced some of the best animated shorts done in the late 1940s and the 1950s.  This is on of their finest.  God to have it in print. Highly recommended.","My dad had this movie as an 8mm reel. I loved it when he would pull out the projector, tape a sheet to the wall, and play Gerald McBoing Boing. The thought of a child who communicated through sounds fascinated me.Nine years ago, my son was diagnosised as autistic. The doctors would ask me questions about my son such as \"How does he communicate with you?\" I would respond, \"Have you ever seen the cartoon, Gerald McBoing Boing?\" I would love to have a copy of this cartoon to show my son and his educators, this is how my son see he's world.Recently, I spoke with a digital transfer specialist who indicated most personal 8mm films did not contain sound until the mid 1970's. I guess I was pretty lucky to have experienced the sights and sounds of Gerald McBoing Boing in 1972.","In my opinion, this is the best cartoon ever made. It has terrific animation and a charming story, it is witty and lively, and of course has a \"moral\" in that you don't have to be the same as everybody else to succeed as the title character ends up in a wonderful job, despite his \"disability.\"","I have remembered this cartoon for over 50 years - what staying power it has! It was funny and creative; I wish my children and grandchildren could have seen it. It ranks right up there with Winky Dink - another favorite. I was pleased to find out that one of the creators later worked on Rocky and Bullwinkle. These early shows had a lot going for them that todays cartoons for kids don't have. Today's cartoons seem to push the idea that one needs something special, some magic formula or talent to be able to succeed against evil or dangerous circumstances. While the early cartoons didn't address evil very much - it WAS a much gentler and safer time - they allowed us to develop our own talents and character.","MCBOING BOING is one of the cartoons that have stuck in my head over the years and finally decided to look into it as was pleasantly surprised and was also surprised on the people involved with the production. If I remember correctly we had to watch it on a UHF station and this meant using a converter in those days UHF not part of regular TV to tune in the local station to watch the cartoon a big deal in those days which made the show even more mysterious. I remember all the sound effects that Gerald used to talk. A great memory from 50+ years ago. I'll have to see what other memories might be hiding on the web. By the way I try to do computer animation thats where the johnl3d comes into the picture","This Oscar-winning adaptation of a Dr. Seuss book focuses on a boy whose speech consists entirely of sound effects. It initially looks as if the tyke is going to spend his whole life as an outcast, but there's something else in store. \"Gerald McBoing-Boing\" hilariously reminds us that we don't all have to be the same; even a person who \"talks funny\" still has value as an individual. I will say that the UPA cartoons (known for limited animation) aren't as impressive as, say, the Bugs Bunny cartoons, but on its own, this one is a fine piece of art. I wouldn't expect anything less from a Dr. Seuss book. I just hope that they don't try to butcher it with a feature adaptation like they did with \"How the Grinch Stole Christmas\" and \"The Cat in the Hat\".","I've begun watching some of the marvelous animation that I remember from my youth. This one made me so sad. Gerald had both a curse and a gift. He could not speak but rather made amazing sound effects. He was an outcast. Even his parents turned on him. This is an early work by Dr. Seuss and one is made aware of that in the interesting rhyme schemes of the narration. Gerald is sent to a doctor, to first grade, to play with friends, but is rejected summarily at every turn. There is a place for us all. That sad thing is that there is an element of injustice in this story. Gerald, in modern times, may be seen as the product of abuse, as he runs away, hopeless and betrayed. This is so clever and groundbreaking. See it if you never have.","This is a 7-minute animated short film which won a BAFTA and also the Oscar back in 1951 against competition from Mr. Magoo and Tom&Jerry. In the center of it is a little boy who does not speak, but makes artificially created noises instead, such as the sound of a locomotive. His parents are obviously very worried, but no doctor can help, no teacher can help and the contact with children of his age goes all kinds of wrong too. Until he finally finds his spot where his unique disability is appreciated. The film's director is Robert Cannon and he made a couple more short films with the character, but it gets old pretty quickly and the charm is gone then. Some more famous people from animated movies contributed to this film in different positions, such as Dr. Seuss, Bill Melendez and John Hubley. Worth a watch in my opinion, good short film and I also liked the animation style and colors.","I've mixed views about this Oscar winning cartoon.On the script side, it's still worth while to watch, and so much more so, 50 years and as many big wars since WW2, as humankind is less human, less kind, and less able to understand the deep self of the people across the Ocean, or the street.Gerald is a mute boy, only able to pronounce boing-boing. When extraterrestrials from the planet Moo descend on his backyard, and take him in their flying-saucer, as a human specimen for study, they got the impression that all earthlings spoke like that. Being very clever, the extraterrestrials develop a language based on boing-boing intonations, and are still sending messages to Earth with the only sentence, \"boing-boing\".On the drawing, colors, and repetitiveness, and also stridency, of the \"language\" signs, I'm afraid I'm not with the majority here. Even when I saw this title in 1965, I found it too simplistic, and still do. I grant you that I was not the child this cartoon aims at, and today's manga and similar comics are 300% worse than this, but I would not accord this title an Oscar...(First posted September 19, 2003; re-posted after clarifying with IMDb that it belongs here, not with the 1956 longer version of this cartoon, similarly titled.)","During the brief Golden Age of the Super 8 Magnetic Sound Home Movies, we purchased a GAF Projector for $148.00 on close-out at a Downtown Chicago Camera Store. It seemed that GAF was getting out of the Camera & Projector Business; although they would continue with their other enterprises, such as the former Sawyer's Vue-Master 3 Dimensional color slide viewers.Little did we know nor anticipate the rapid approach of the Video Camera, the Betamax, the VHS and the eventual DVD revolutions. With the Super 8 Magnetic Sound Camera that we also purchased, we took some sound film records as our Daughter, Jenn's First Holy Communion and her younger Sister, Michelle's Graduation from Pre-School. This was all circa 1979-82.During this time we also purchased a few Daddy Toys to go with it; like some Super 8 Magnetic Sound LAUREL & HARDY Films and W.C. FIELDS' Shorts from Blackhawk Films, Davenport, Iowa. We also picked up a Columbia Pictures Home Movies Sound Film of a then sort of forgotten Classic Cartoon, UPA's GERALD McBOING-BOING (United Productions of America/Columbia, 1951). It was THE hit of our Home Movies Time! Being members of that Baby Boomer Generation, the Wife (Deanna) and meself had recollection of the Character of Gerald McBoing-Boing; for Gerald had a Network TV Show on CBS, early Sunday Evenings, ca. 1955. Bill Goodwin was the Announcer/Host. But we had never seen this original UPA Theatrical Cartoon; nor was it known to us that the young Master McBoing-Boing was a creation of Dr. Seuss of \"Grinch\", \"Horton\" and \"Mulberry Street\" fame.THE staff assembled was very talent rich and deep. The outstanding production values are apparent. Director Robert Cannon and Supervisoring Director John Hubley were veterans at the top of their craft. Writers were Theodore Geisel (Dr. Seuss, Himself), Phil Eastman and Bill Scott.Mr. Scott is remembered not so much for his writing contributions to UPA, but for being partners with Jay Ward in such Television Properties as ROCKY & BULLWINKLE, MR. PEABODY, FRACTURED FLICKERS, GEORGE OF THE JUNGLE, HOPPITY HOOPER and FRACTURED FLICKERS. With the Jay Ward Productions he was a writer, voice man and Kibitzer-General of the whole company.The cartoon receives its only \"voice\" from the Narrator, Radio/Movie/TV Actor Marvin Miller. Remember him? He was Michael Anthony on the TV Ssries THE MILLIONAIRE (Don Fedderson Productions/CBS Television Network, 1955-60).Bold color schematic and imaginative design went into giving the UPA animations a special feelings of loneliness, fear apprehension and eventual triumph. And, we might add, the animation is definitely of the \"Limited\" Variety.AS with so many great stories, ours starts out with a simple premise; one's being born different. In this case it is young boy Gerald McCloy, who has been born to make sound effects in communicating rather than talking. Kids can be cruel and soon he is dubbed with his not so flattering nick name by a group of youthful taunters chanting: \"Nya, nya, your name's not McCloy; it's Gerald McBoing-Boing, the Noise Making Boy!\" AT this point, the Animation Team does an outstanding job in shifting the emotional gears in the young outcast from happy & carefree to isolated & lonely and finally to depression & despair in not being able to turn to anyone for help and understanding; not even to his Mother and Father.A frighteningly fashioned dark scene involving a highly UPA stylized run away scene involving a Train and an equally stylized Snowfall brings Gerald right to the brink of absolute despair. But then, he is interrupted by a gentleman announcing that young Gerald is wanted by the producer of some Radio Program to provide the sounds for the show down at the Studio.ONCE the premiere show is done with Gerald starring in the Sound Department, he rides off in a huge Limousine (which seems to have anticipated those S-t-r-e-t-c-h Limos of our day) to the cheers and admiration of his Classmates and the World.IT has been said that there are only so many plots and, in that case this story is most likely a variation on The Ugly Duckling; for after all, a sad and lonely boy finds his place in the world and true happiness.NOTE: United Productions of America, or UPA for short, was an outstanding center of creativity in the field of the Animated Cartoon. They were responsible not only for GERALD McBOING-BOING and several sequels and a TV Series, but also the highly popular MR. MAGOO Theatrical Cartoons and subsequent TV Show (with voice talent of Jim Backus), the Classic Original TV Cartoon of FROSTY THE SNOWMAN and the rather bizarre DICK TRACY Cartoon Show (with Tracy's voice rendered by Mr. Everett Sloane!).","The story of a little boy who would only talk in sound effects. With story by Dr. Seuss (and Bill Scott of Rocky and Bullwinkle fame) this cartoon won the Oscar for best short subject (animated) for 1950.Some people seem to give this short a hard time. And I suppose the animation is not that incredibly amazing. But keep in mind this is 1950, making it one of the earliest (if not the first) Dr. Suess cartoon. And there is no denying the rhyme and story are quite original and clever.This is no Pixar or anything too deep. But worth checking out if you area fan of Dr. Suess, because this story gets overlooked compared to the Grinch or Cat in the Hat.","This is a film that really makes me cringe. In 1951, MGM and Looney Toons were making some of their very best cartoons--with amazing animation, exceptional backgrounds and great stories. Then, in the late 40s, a new style of animation began to appear (such as the \"Crusader Rabbit\" series on TV)--animation with extremely simplistic artwork in order to save money. Unfortunately, Columbia Picture's cynical ploy worked!! Instead of the public hating the toons (as they should have), many accepted them and the Oscar people (AMPAS) actually gave this film the award for Best Animated Short--giving legitimacy for an inferior product. Unfortunately, in the dollars and sense world of Hollywood, this soon began to creep into the products of legitimate studios--resulting in rather crappy cartoons. Later, it got even worse as in addition to lousy animation and backgrounds, the stories themselves became almost unbearable for adults to watch. The cleverness and style of the classic cartoons were gone. And for this tragedy, I blame, in part, GERALD MCBOING-BOING--one of the granddaddies of cheap cartoons. The story isn't that bad but the animation is a horror and listening to the kid saying \"boing-boing\" incessantly is a pain.","Gerald McBoing-Boing (1951) *** (out of 4) Oscar-winning, animated short has a story by Dr. Seuss so you know it's going to be something special. The film tells the story of Bobby McBoing who never learns to speak and instead just makes various noises including \"boing\" over and over. His parents slowly begin to get upset because he can't speak normal words and after a while it's hard for them to know what to do when nothing but sounds come out of his mouth. This is a pretty interesting little short as it's clear they didn't spend too much money on the thing but at the same time there's a strong touch of imagination that makes it worth watching. The animation style is I guess what you'd call \"simple\" as there aren't any grand backgrounds, beautiful images or rich colors. Instead the drawings are pretty simple and not particularly ground breaking but they are unique in their own way. I think the real key to this thing are the sound effects and how they use them to tell the story. The constant \"boing\" is charming in its own way but what's really funny are the train noises and various other ones that scare Gerald's father when he's shaving."],"review-user":["pauldbevan","tavm","llltdesq","endkaos","imimslim","cabless","johnl3d","lee_eisenberg","Hitchcoc","Horst_In_Translation","Artemis-9","redryan64","gavin6942","MartinHafer","Michael_Elliott"],"review-date":["4 February 2005","13 June 2007","23 May 2001","19 July 2006","10 February 2000","24 April 2006","13 July 2004","29 January 2016","26 December 2015","26 June 2015","5 September 2012","4 June 2008","22 January 2016","2 September 2008","27 July 2010"],"review-rating":["10","10","10","10","10","10","10","10","6","7","10","7","3"],"review-title":[" A beautiful cartoon\n"," Gerald McBoing-Boing deserved its 1950 Oscar win\n"," Minimal animation, even for UPA, but delightful characters and script\n"," 35 years later, I still remember it well.\n"," Adventures of a little boy who can say nothing but \"Boing!\"\n"," Great memory show from my early childhood\n"," great show of my early years\n"," sound of speech\n"," Another Victory for Dr. Seuss and Some Amazing Animators\n"," The kid with the sound effects\n"," Recommended for post-graduates on International Relations. SPOILER!\n"," The Pain and Personal Agony of Being Born Different is Dramatized in this Great Oscar Winning UPA Cartoon Short. It's kind of like being born a Red Head!\n"," Classic Suess\n"," The beginnings of a very bad trend in animation--and it was rewarded for this?!\n"," Award Winning Short\n"]}