{"review-url":["http://www.imdb.com/title/tt0070672/reviews"],"review-text":["It is now clear that the true golden age of American film was from the mid-60s until just before the release of Star Wars. Before then, there was too much Hays Code-constricted pap. With Star Wars, the green light was lit for most films to be directed at children and morons, a practice which continues to this day. THE SEVEN-UPS, truth be told, contains a couple hackneyed lines of dialogue -- \"We can do this the easy way, or we can do it the hard way\" is one -- but I'm damned if I can find anything else wrong with it. (In fact, that line may not even have been stale when this film was made.) THE SEVEN-UPS demonstrates all that was right with the best films of the golden age: sparse dialogue, realistic acting, real locations (winter in a dirty New York has never looked better/worse), propulsive stories, and, yes, the best car chase ever filmed. Bill Hickman is the driver Scheider is chasing (you will recognize him from Bullitt), and the structure of the chase is fairly similar to the McQueen one, but I prefer Scheider's facial intensity here, the pacing, the terrific close-ups of the schoolchildren, and the shattering conclusion. (That VW bug going about 2 mph always bothers me in the Bullitt chase.) A stringy, screechy score by Don Ellis sets the perfect mood. THE SEVEN UPS: bleak, grim, action-oriented, grown-up. This is a film that couldn't be made today; there's no \"gimmick\" for the kiddies or preposterous ending. Thank you, Philip D'Antoni, Roy Scheider and Tony Lo Bianco: for as long as cop films are watched, THE SEVEN-UPS and its 1970s brethren (e.g., THE FRENCH CONNECTION), will set the standard.","One of my favorites. As a child, growing up in the NY Metro area in the late 60s and early 70s, I was often afforded the opportunity to visit NYC with my grandfather or father, as they conducted business there. The gritty, bustling, human, reality of that city, particularly in winter, have stayed with me. This film very aptly captures the stark, cold, matter-of-fact feel of the NYC winter season, while keenly exposing the underbelly of the region's infamous underworld of crime and policing. A great snapshot of a place and a time and a culture. And the car chase is simply amazing. At least on par with the one in \"Bullitt\", and surpassing the chase in \"The French Connection\". I can watch, time and again, as the suspension comes unstuck on that Plymouth Fury police cruiser barreling toward the GW Bridge in pursuit, as it lurches into that sharp right curve, bouncing and scraping into oncoming traffic. The stunt driving coordinator for that scene did \"Bullitt\" and \"The French Connection\" as well as many other noatable movie chases. Good acting, too, and a decent plot line. The musical score is edgy and compelling, and the cinematography and direction are top notch. A great, if underrated 1970s cop drama. A keeper. Not out on DVD yet, though.Comparable in style and content to: The French Connection and Super Fly. Early 1970's cop dramas set in the bleak NYC winter months.","I love the other reviews of this movie. They mirror my attitude. I am a 70's sort of guy, minus disco and \"Star Wars\" childishness. There was nothing great about this movie, except for a chase scene. That is why it was good, because it was tough, basic and economical. Roy Scheider carried the movie, which was based on the crew, the 7 Ups, that backed up Gene Hackman in the \"French Connection\". The people in it were believable and average, who burned themselves pouring coffee, showed fear in chase scene and almost lost it after a close call crash.Maybe it would be easier to tell you what it lacked. There was no fancy weapons, just basic revolvers and crude sawed off shotguns. There was no tough guy philosophizing, ala Tarantino. There was no kung fu or samurai nonsense and no fancy trick shooting either. There was no clever guy who carries out some complicated scheme based on hundreds of things going just the way he planned including everyone else's reactions. The criminals were bad guys but they didn't shoot people for the hell of it. As a matter of fact, there was a body count of just three. something that the average movie these days would pass in the opening credits. It could be a G movie today! No bus load of orphan school children were kidnapped nor were terrorists threatening to kill half of the city. There were no high tech hijinks, nor were the crimes themselves very moving or ingenious, the highest tech thing I saw was a touch tone ATT wall phone. It had no subplots or amusing character developments. Also, no sex or women, except for one mobster's wife who did some screaming as the Buddy our hero had her menaced.It was some little undertaker who exploited his connections with the local mob and the police to kidnap local mobsters for some easy payoffs. The undertakers. Vito, was played by Tony Lo Bianco who did a great job, as good as Roy Schneider, Buddy the head of 7 Ups cop, whom he informed and exploited. What ever happened to Tony Lo Bianco, he seemed like a Pacino shoe in, good looking and talented? What it did have was a great NYC backdrop to a simple crime story. Locations that were bleak and dehumanizing without being a sociological study. It had a simple plot that involved this kidnapping scheme where one of Buddy's cop got accidentally involved, literally accidentally dragged in then accidentally shot dead. Since Buddy and his 7 ups are a hot dogs unit, both the NYPD Brass and mobsters thought he was involved, since the kidnappers masqueraded as plain clothes cops to lure the mobsters into compliance. Obviously the mobsters figured they had lawyers and rights to protect them from normal police. Even the mobsters were plain, old and ugly, no Godfather royalty or Soprano hipness here.It is a good basic movie with a standout chase scene between two 70's d Pontiacs. Even the cars were plain and economical, not even a GTO or a Trans Am, like the acting and the story. In the days of Batman uber-hype or \"24\" levels of intensity doomsday scenarios, this movie reminds us that less is better. It should be shown to movie screen writers and directors as a caveat not to dazzle, amuse then ultimately insult us with stunts, gadgets and clown psychotic behavior galore.","What an underrated flick. Great action.Great tension.The only thing (you could ask for) would have been Friedkin directing it. I know, I know. Same year as Exorcist. Still... One comment which was made referred to the plot being confusing which I slightly agree with. Friedkin might have cracked the whip on that part. I always thought you could do a lot of different things in a car wash. And Moon!!! Thank God for Richard Lynch. What an actor.And the driver. He should have acted more. Great menace.With those little glasses. Also underrated is Roy. He never got his due. He should have won for All That Jazz. FC II is great, but this is too overlooked. p.s. AVOID THE NEW EXORCIST. Wait for Schraeder DVD.","I think the filmographic lineage may run like this. Pay attention, please, because I had to look this up. In 1967 Peter Yates, an ex auto racer, directs the English caper movie \"Robbery,\" the most thrilling part of which is a car chase through the streets of London, down alleys where there are crowds of children playing and all that. It's a success.A year later, Yates directs \"Bullet\", starring Steve McCool, I mean McQueen, featuring another even more spectacular car chase up and down the San Francisco Hills, with dumbfoundingly authentic engine sounds that seem to include double clutching, full race cams, no mufflers, twelve-cylinder engines under forty-foot hoods, supercharged, superdupercharged, and all five-thousand horsepower running at full tilt. Lots of shots of McQueen's gum-chewing visage scowling with concentration as he tries to bump another car off the highway, though a passenger in the other vehicle totes a shotgun. The chase is staged by Philip D'Antoni. Bill Hopkins drives the criminal vehicle.A year or two later, sensing a good thing, Bill Friedkin directs \"The French Connection,\" featuring a chase between a commandeered cop car(Gene Hackman) and an elevated train in New York City. Lots of shots of Hackman's cursing face as he wrestles the battered car through the streets. The chase is staged by Philip D'Antoni. Academy Awards follow.Sensing a good thing, a year or two more brings us \"The Seven Ups,\" featuring a chase between a car driven by Roy Scheider, with lots of shots of Scheider's cursing face as he tries to bump the other car, which is driven by Bill Hopkins, off the road, although the criminal car, to be sure, carries a shotgun-toting passenger. No hills in New York City, just bumps, but they are still sharp enough to elevate the cars a few feet. The pursued car screeches around a corner and dashes down a street on which a dozen children are playing. Shots of the screaming kids as they scatter off the pavement and allows the car to zoom through. But once is not enough. The children immediately run back into the street and must repeat the retreat for the pursuing cop car carrying Scheider.I once witnessed a pursuit at high speed on the streets of Philadelphia. Both the criminal and the cops drove through the streets at about 25 miles an hour, coming to rolling stops at each Stop sign and red light -- very dull stuff compared to this movie.Speaking of this movie, it's pretty good. \"Robbery\" and \"Bullet\" were cool. Everyone dressed neatly. But the New York movies are filthy. There's garbage all over the place and the subway cars are covered with graffiti. Shoot outs and beat ups take place in vacant lots surrounded by crumbling brick buildings, or in disposal dumps for industrial-sized freezers.The acting is pretty good too. Roy Scheider seems whippet sleek. The other actors have faces made for the camera, especially Richard Welsh. And the story is engaging, if not entirely unfamiliar. What's best about the film is the way it captures New York City in its almost total indifference to human depravity and nobility. At a funeral, the limo drivers stand around with their collars up, butts hanging out of their mouths, kicking their cold feet together, utterly bored at the ritual goings on. The film wants us to believe that The Seven Ups are an elite group of untouchable cops who stop at nothing to get the job done, and here it's a bit of a sell out. They always seems to be threatening to do something unethical and illegal -- beat hell out of a suspect or physically damage a hospitalized and helpless hood -- but they always manage to avoid doing it. (If they actually did it, their characters would become lifelike and ambiguous and we'd rather have our heroes and villains of a more Biblical nature.) Very enjoyable, even if you've seen it before, and you very well may have in one or another of its previous incarnations.","The Seven Ups from a reality standpoint is by far the best produced police drama ever to hit the screen. The story encompasses all the pitfalls and dangers of police undercover work and the alliances between partners as well as the relationships and betrayals of informers. The cast is superb and what made it real and gritty is none of the actors at the time were big stars. The best scene undoubtedly is the ending when Tony Lobianco is pleading with Roy Schieder The music steadily increases and Roy Schieder keeps walking away. The story line is timeless and can be translated every 20 to 25 years in modern remake form. I have been waiting for this movie to be produced on DVD","This is not a great movie, but it evokes a time and a place, and a style that goes along with it. A gritty 70's police drama, it takes place in a New York winter of gray skies, bare trees, wet gutters, litter and graffiti, when the crooks had no cell phones, cars smelled of vinyl and exhaust fumes, and the computer was the noisy thing that printed the suspect's rap sheet on a roll of yellow paper. The acting, it must be admitted, is routine, but Roy Scheider and the rest portray an undercover squad of calm professionals to whom danger has become routine. The story manages to be interesting, punctuated by one exciting Popeye Doyle style car chase through the Sunday streets (judging by the light traffic) and up the Taconic State Parkway, and two nerve-wracking scenes in the belly of an automatic car wash. But for all the occasional bursts of violence, it's also a quiet story of a friendship that can't withstand the temptations of crime.","I saw 'Jaws' for the first time aged 7 but a good chunk of why i LOVED that film was Roy Scheider's Brody, I honestly can't imagine that film without him and his \"SMILE YOU SON of a B...H\" Back to \"The Seven-Up's\"I'd read a little about this film in movie magazines and books over the years but had never ever seen it until yesterday (thanks I have to say to YouTube), had wanted to see it for over 30 years and finally I have done so.I'm with the majority of reviewers here...it's gritty, well made with some good performances especially Schnider who with his brown leather jacket makes it his 'Bullitt' there is even a scene in which he removes the cool jacket to reveal a black turtle-neck and holster (a knowing nod to McQueen's classic film perhaps?) I have to admit that the first 40 minutes or so are kinda slow as with many of the 1970's cop thriller's/drama's of the time but stick with it as the pace builds and it gets better and better from this point.The CAR CHASE is a stand-out as many here have stated (and might be worth the watch for this wonderfully filmed sequence alone) it starts out as a fairly ordinary affair but turns into a terrific pursuit.Richard Lynch always had the look of a good villain and he is again here.One of the reasons I'd wanted to see it (apart from Scheider) was I had read it almost played out like an unofficial \"French Connection\" sequel and it kinda does.Tony Lo Bianco is terrific as Buddy's (Scheider) friend and he was also in Connection, it could be argued that this is a far better film than that films sequel and I would subscribe to this as the French Connection II was to me very disappointing.Fans of 1970's Cop Thrillers will find much to enjoy in the second half of this film...the ending is terrific with shades of Blue Thunder's ending, speaking of which that is another terrific Roy Scheider film along with '2010', 'Jaws', 'Jaws II\" (yes really, Scheider makes it thanks to Brody and that \"I know what a shark looks like up close and I don't intend on going through that hell Again\" speech) and \"Marathon Man.Roy was a terrific actor and has left us with some wonderful performances in some wonderful films...God Bless.Now to track down \"Sorcerer\" (aka Wages of Fear) another I've never managed to see.","\"The Seven-Ups\" is a follow-up of sorts to \"The French Connection\", based on a story by the legendary detective Sonny Grosso, and uses some of the same talents from that other movie. Philip D'Antoni, who'd produced \"The French Connection\", makes his first (and to date only) directorial effort, creating an engrossing NYC tale that keeps its grip thanks to a very matter- of-fact presentation. Unlike a lot of slick Hollywood productions, this never gets bogged down in spectacle (save for one major set piece which I'll get to in a moment) or unnecessary melodrama.Grossos' gritty tale tells of tough undercover detective Buddy (Roy Scheider), part of an elite unit that goes after organized crime and resorts to some pretty unorthodox methods. What causes problems for Buddy and his men - played by Victor Arnold, Jerry Leon, and Ken Kercheval - is the interesting situation of a pair of rogue cops (Bill Hickman and the great screen villain Richard Lynch, in one of his earliest roles) going around abducting underworld figures for ransom.The movie is highlighted by one absolutely incredible car chase, occurring just past the halfway point and cranking up the films' energy level to a high degree. This is old school stunt driving and editing at its finest. As for the rest of the film, it's done in a very low key, gritty, and realistic style. Some viewers may grow impatient and wish that most of the movie were like its car chase, but others will appreciate the restraint that D'Antoni shows. He gets superb performances out of his cast, with Scheider projecting a quiet authority in the lead role. Tony Lo Bianco, also from \"The French Connection\", scores as amiable informant Vito. Larry Haines co-stars as mobster Max Kalish and familiar faces Joe Spinell (\"Maniac\") and Rex Everhart (\"Friday the 13th\") can be seen as well. About the only thing in \"The Seven-Ups\" that isn't too subtle is the intense music score by Don Ellis.Overall this is genuinely good stuff and well worth watching for any fan of crime pictures, especially the great NYC films of the 1970s.Eight out of 10.","The Seven-Ups is well-acted and has an authentic flavour thanks to the location photography, but it is by no means an exceptional film. In fact, its main drawback is that it is far too workmanlike.... it often resembles a not very interesting documentary, shot in grimy and grainy colour.The plot is about a secret undercover police unit in New York. They uncover a plot hatched by criminals to kidnap mobsters and hold them for ransom. Effectively, what is happening is that criminals from one side of the pasture are abducting criminals from the other side of the pasture and keeping them until a hefty fee has been paid for their release.Quite often, the police dialogue and the deliberately grimy photography echo the feel created in The French Connection, but this is a tame retread of that film. The one thing that might pull in viewers is the film's ten minute car chase sequence, which is not only the best bit of the film but one of the very best car chase scenes from any film ever made. For that alone, The Seven Ups is worth watching at least once.","Roy Scheider returns as Buddy Russo(it would seem), though no Gene Hackman as Popeye Doyle, instead Buddy is part of a group of elite policemen dedicated to apprehending any criminals whose crime would warrant a jail-sentence of 7+ years. They become even more determined in their cause after one of their own is killed, and Buddy discovers that the man partly responsible is someone he may know...Curious film does seem to continue the adventures of \"French Connection\" cop Buddy Russo, though the link is not played up much. This does have another exciting car chase sequence, and is also filmed on location by one-time director Philip D'Antoni, but the story never amounts to much, and certainly does not captivate the audience the way its predecessor did. Result is only so-so.","From the man who brought cinema-goers 1968 \"Bullit\" and 1971 \"The French Connection\", Philip D'Antoni goes on to produce, but also make his directorial debut with the realistic, tough-as-nails crime thriller \"The Seven-Ups\" starring an unwavering Roy Scheider as the leader of a secret squad of the New York police who got their name from the minimum sentence of their targeted gangsters. Things go pear shape when their own is killed in action and the men seek their own justice. While this urban cop formula might be overworked, it's rather well-done for its type with exciting passages like the scorchingly intense high- speed car chase. It's masterful in its execution and camera positional work. D'Antoni resourcefully keeps a fast pace, where tension is sustained through good writing, elaborate plotting (where it does show its cards early), vivid performances and well-timed thrills and spills with smooth editing. Really it's quite minimal on the action leaning towards the investigative digging, but when it occurs it's explosive and raw. Just the way the 70s loved it. One thing that did catch my attention was Don Ellis' dangerously impulsive music score. Very unhinged, but it did suit the film's dark, relentless tone. The story is very much character based and the performances are assured across the board. Victor Arnold, Jerry Leon and Ken Kercheval make-up the rest of \"The Seven-ups\". Tony Lo Bianco magnificently holds up alongside Scheider as his go-to-man for information. Then there's Larry Haines as one the head mobsters. However in the bad guy roles it was Bill Hickman and especially the striking Richard Lynch who stood out. Lynch was terrifically menacing. Also in a minor part is genre actor Joe Spinell. Compelling, lean and mean 70's cop drama.","When you put this film and the French Connection together you'll see that the French Connection is just too good to compared to The Seven Ups. That doesn't mean this film isn't worth seeing. It just means don't expect the French Connection when you see this...cause you won't get it.The Seven Ups has all the earmarks of a 70's Cop film. Corruption, Rogue cops and the mafia all rolled up into one. It has that stark landscape feel from the 70's. How gritty and grimy that decade was and you feel it throughout the entire film.What this film has is the absolute best car chase in film IMO. Sure you can throw Bullitt and The French Connection in there...heck even Ronin had a wicked good car chase but when you want a real white knuckle car chase you just have to see the one in this film. You feel like your right in the middle of it. And the end of it...if you've never seen this film then you'll jump at the end of the chase. Wow what a great end to a chase.Take this film with other great films of the 70's like Serpico or Dog Day afternoon and even the French Connection and see why the 70's was the greatest decade for cop films. Real stories real stunts = a solid decade.","I was born in '68 with not much parental guidance as far as what I watched on TV (as a kid in the 70's). I always loved this movie (and the French Connection) and would always try to catch it whenever it was on (checking the Sunday TV guide ahead of time). I bought it on DVD a few years ago and have watched it twice since then and I must say, I STILL LOVE IT!!!! Roy S. was a great actor from the 70's (Jaws is one of my all-time favs, Marathon Man etc) and although the 7-ups is not an Oscar-worthy film, it puts you precisely in a time a place (NY, early 70's, as did French Connection) and gives you some tough characters and a glimpse of life as a cop at that time. And yes, the car chase is one of the all-time best.","Having grown up in New Jersey and having spent many a day and night on the gritty streets of New York in the 1970's, watching a film like \"The Seven-Ups\", or its kindred spirit, \"The French Connection\", always evokes fond memories of a time and place which, for some, might have been NYC's darkest hour, but which for me, in my early twenties, was always one fun-filled adventure after another. I truly miss those times. As one reviewer remarked, \"This film very aptly captures the stark, cold, matter-of-fact feel of the NYC winter season, while keenly exposing the underbelly of the region's infamous underworld of crime and policing. A great snapshot of a place and a time and a culture.\". A spot-on characterization of both the film and the city. The stellar attributes of this film -- the plot, the cast, the characters, and of course, the car chase -- are amply described in many of the reviews here, so I won't go into that except to say that one of my favorite moments occurs during the car chase, when the camera focuses on Richard Lynch riding shotgun to the maniacal Bill Hickman. The look of horror on Richard Lynch's face, along with the defensive gestures, are so out-of-character for an actor much better known as a source of terror rather than an object of it, that it is actually comical to watch. I get a chuckle out of it every time.","****SPOILERS**** Buried under a mountain of medical bills and his funeral business not being able to dig him out from under them undertaker Vito Lucia, Tony Lo Bianco, came up with a plan to make a load of cash with the help of his two crooked pals Moon & Bo, Richard Lynch & Bill Hickman. Vito getting close with his boyhood friend Buddy Manucci, Roy Scheider, as a mob informer to win over Buddy's trust and have him tell Vito what's coming down on the streets of New York in regard to mob activities. Buddy is a cop who works in a sub rosa unite of the NYPD, the Seven Ups, that does things \"their way\" to clean up the streets of New York of criminals. Vito gets information from Buddy and makes it look to Buddy that he's really giving him tips about the mob and what it's up too and uses that information to tip off his hoodlum associates, Moon & Bo, to rip the mobsters off of their weekly take as well as kidnap top mob loan sharks and hold them for ransom.Everything is going well for Vito & Co. until the mob decides to retaliate and mistakenly grabs beats and kidnaps a member of the Seven Ups Ansel, Ken Kercheval,who was working undercover thinking he was one of the hoods who was kidnapping and ripping them off. Later Ansel was accidentally killed by Moon when he blasted out the trunk of the car that Ansel was locked in thinking that there was a suitcase full or cash, ransom, in it.Fast pace and exciting movie with that gritty and grimy photography of New York City that was so effective in the movie \"The French Connection\" which also stars both Roy Scheider & Tony Lo Bianco who are in this movie too. Incredible car chase that started in downtown Brooklyn and ended up in the wilds of New Jersey some 15 to 20 miles away with Buddy almost ending up decapitated for his heroic efforts. Roy Scheider who is not a big man is as tough and effective as any big action actor I can think off like Clint Eastwood would have been in the same movie. Scheider reminds me a lot of, he even looks a bit like him, former welterweight and middleweight champion Gene Fullmer who beat the great Sugar Ray Robinson for the middleweight championship back in 1957 and acts like him too in the movie : tough durable and destructive. Tony Lo Bianco is very good as Vito the undertaker the lowlife heel who plays off Buddy and the mob to the point that leads to Buddy's partner Ansel getting killed. Even though he's trash you can't in a way not help feeling sorry for Vito since he only wants the money he gets from the ripped offed mobsters to pay his sick wife's Rose's hospital and medical bills. Even the fact that Ansel was killed due to his actions Vito never wanted anybody to get hurt but like they say when you play with fire you end up getting burned. In the end Vito have a lot of explaining to do to the not so sympathetic and caring mobsters. The movie \"The Seven Ups\" has the late Bill Hickman doing the dangerous stunts with the car chases as well as act in the film. Hickman was also the stunt man in both great movies that had him doing the driving on the roads streets and highways of New York City and San Francisco \"The French Connection\" and \"Bullitt\".","Sure, there are a few great set pieces - the opening sting, the car wash scenes, the chase. But for the rest this was a literal yawner; watching it in late evening I could barely stay awake. The problem, I think, is that producer Philip D'Antoni decided to direct the movie himself. He should have fired himself and hired an experienced director. Apart from the set pieces, there is no energy or pacing in the film, just long dialog scenes that never seem to move. Compare this to \"French Connection,\" produced by D'Antoni but directed by William Friedkin. That one had hardly a dull moment; you always felt that it was moving somewhere. With a little script work and a director of Friedkin's ability, I think this could have been a classic. As is, it's basically a curiosity.","This 70s police movie by the same director as the French Connection is worth a watch...Some clever kidnappers go after gang related targets...crooked bondsmen in this case. They pretend to be under cover cops when they nab their victims---. An undercover cop group is ultimately investigated by the police force who think this group (the seven ups) might be involved in this. The action comes when the seven ups clear up their name.Good standard entertainment and a good car chase...as one reviewer put it no subplots no sex the only female in the entire movie an old gangsters wife who is threatened while the undercover cops seek to prove their innocence and catch the real kidnappers. No PC garbage no gimmicky weapons...just a good solid police action story.Great car chase with Pontiacs including a Ventura II a Nova name tag clone.This movie probably deserves about an 8. I give a 7 to decent entertaining movies nothing exceptionally good or bad... a 6 and below to formula stuff. A 1 to PC garbage pseudo intellectual art films and so forth.RECOMMEND","Very much a spin off from the highly acclaimed film \"The French Connection,\" which Roy Scheider had done a few years earlier, but \"The Seven Ups\" falls short of the same level of intensity. Even some of the same background music is reused. But Scheider is more wooden and unappealing in this film. Thankfully the film explores new areas of New York in its scenes. Bill Hickman is great once again in his stunt driving, this time along 10th Avenue and one of the parkways. Richard Lynch is his suitably scary accomplice, Moon, who gets his justice in the end. Tony LoBianco returns from the French Connection, this time as Roy's longtime friend, who pretends to be an informer for the police, but is actually working against the police. Police procedures in the film are once again highly questionable at best, and more often illegal, but the results are all that matter, apparently. Women are mostly missing in this film.","I watched this movie in memory of Roy Scheider after his recent passing. I'm sure I've seen most of it on TV before, but I'm considering it a new experience seeing it straight through here. Scheider is one of a small group of NYC cops with unusual methods, called The Seven-Ups. One of his partners is murdered and he sets out to find and kill the thugs who were responsible, while at the same time discovering that they're involved in a plan to kidnap mobsters to extort ransom money. The way the plot plays out has always struck me as a little disjointed, and while Scheider is good in his part as hard-nosed detective, something sketchy just barely keeps me from awarding this three out of four stars. The film is most noteworthy for an excellent balls-to-the-wall car chase with Scheider in vengeful pursuit of the bad guys (one of them played by Richard Lynch who in real life set himself on fire several years earlier after taking LSD). It's the highlight of the movie and worth the price of admission all on its own. **1/2 out of ****","In this spin-off from the French Connection Roy Scheider is the leader of an elite team of cops (the titular soft drinks) who target high-profile crooks. New York's gangsters are being held to ransom by extortionists posing as the Seven-Ups and strike back against the cops.Set against the bleak, imposing backdrop of early 70s New York, a time in which almost every building was decaying and all new architecture was a brutalist, concrete nightmare, the Seven-Ups is every bit as old school as it could possibly be. If you like the cold, paranoid atmosphere of movies like Ronin or the retro-style of Bullitt you'll definitely get a kick out of this.Aesthetically, the film is horrific, with ugly people and bad fashion all over the place. It's an abomination of bad taste and degradation. But as a simple cop thriller it's got all the right moves. The stand-out car chase at the half-way point is quite impressive and it's a shame that it seems to have been forgotten among the ubiquitous \"Best Car Chase\" countdowns on TV and on the Internet.Fans of the French Connection, cop thrillers or overlooked 70s movies that represent an attitude to filmmaking and life long since gone should definitely check it out.","I like this one-always have enjoyed this 'Bullitt'/'French Connection' style genre. You know-early '70's, big boat cars, big flashy car-chase, grainy washed out film-stock look, on-site filming, kinda slow, guys like Roy Scheider and Tony Lo Bionca turn up, heavy on the police procedure stuff, etc. Kojak prob. was the nearest TV got to pulling it off in other words.This isn't anything special by itself, sure-slowish, confusing at times first half-hour, and you feel like you've seen it before if you've watched 'FR' or 'Bullitt'. This is one of those 'fine for it's era/good for what it is' movies, and if you are a fan, you will like it.I enjoy the car-chase a lot, the ending w/ Roy's car doing the Jayne Mansefield is abrupt and jarring, the shoot-out in that junky railyard(?) def. something you don't see in today's CGI/greenscreen environment. There's just something about the authenticity of these 35 year old movies that you miss-today's are more graphic but this rings more true because you know what you are seeing is 'real'. Richard Lynch really Did run thru that puddle behind the tracks, etc. for example.Look out for a familiar face from 'Dallas' by the way-Ken Kercheval. Never knew he was in this one....*** outta **** or so, pretty good.","While both this movie and the signature car chase have been shown a lack of respect by many critics, both are way above average. Roy Scheider does an excellent job playing his best type; a tough, courageous cop who works hard to get the job done in spite of the desk drivers and politicians who should be supporting him rather than hindering. (He played a suburbanized version of this same role as the tourist town police chief in Jaws. Not nearly as gritty, but the same \"get the job done despite the politicians\" and gutsy approach. If a man who can't swim and is terrified of everything in the water going out on an old boat with an Ahab wannabee and a nerd, to confront a huge killer shark, isn't gutsy, then tell me what is...).Tony Lo Bianco is good as a surprisingly complex villain; most of the villains, in fact, have some depth and complexity. This is one of those movies that gets better with repeated viewings. Overall, it captures the atmosphere of parts of NY City: gritty, unglamorous, often dangerous, but filled with energy. The story is spare, tight, and subtle; it gets the job done without extraneous elements. It may not be one of the all time greats, but it is an exceptionally good movie.Everyone has an opinion about car chases. Mine is that this one is right up there with the Mustang vs Dodge Charger chase in Bullitt. The Pontiac Ventura/Chevy Nova was similar to the Mustang in being a compact car chassis with beefed up suspension and a powerful small block V8 stuffed into an engine bay meant for an insipid 6. The Ventura/Novas got little respect off the drag strip, but with the proper suspension mods, they made affordable performance cars that could handle on both the road and the track. The bawling of those GM V8's as they wind up is music to the enthusiast's ear. I've heard this chase criticized for \"imitating\" the Bullitt chase. The truth is that they are two works by the same master, Bill Hickman, who also choreographed and drove for the French Connection chase. Besides driving most of the car chase scenes, he created a brooding, malevolent presence and a good match with Richard Lynch as a pair of coldly evil killers.Yes, the chase has \"realism errors\" often noted, like the use of 3 different NY roads to represent the Palisades Parkway, the ending of the chase in a crash with an 18 wheeler on a roadway for passenger vehicles only, and the miraculous timing that allows all pedestrians to escape harm. That's beside the point. Let's face it: movie car chases are \"unreal\" by nature. In Bullitt, The French Connection, and The Seven Ups, however, Bill Hickman and Phillip D'Antoni crafted chases far more realistic, and therefore more exciting, than the flying, rolling, exploding vehicle fantasy chases so common in recent films.","This movie is not about the soda nor is it quite the French Connection.The Seven Ups are a group of elite policemen that use tactics not in accordance with protocol of the NYPD. Scheider heads the group with his posse or regular looking joes. They are running surveillance on a local costra nostra cartel and things go awry when a cop's wire is found out.Meanwhile, Richard Lynch, the most evil looking man in film (Invasion:America, Little Nikita) and his partner end up killing the cop by accident and escape from Scheider in the coolest chase scene I've seen, Bullitt and French Connection are not as good as they one up the West Side to the George Washington and onto the Palisades Parkway in New Jersey. The stunt drivers are terrific and Lynch makes it away free though he looks scared witless from the dangerous trip. Roy Scheider is nearly killed when his car slams into the abutted rear of Mack truck ripping the roof of his vehicle off. Things come to a head and one has to keep watching to follow up on such a sequence. Quick moving and intense, fresh for a thirty years.","He plays straight but with a quiet intensity that makes him one of the top cops in movie history.  Roy Scheider stars in a poor man's French Connection that has a little of the same gritty appeal.  FC is a better movie, but I prefer watching this one because 1) I think Scheider is great and this is his best movie, and 2) this has the best car chase EVER, one that makes Bullitt look like a cable production (thanks again to Bill Hickman, who actually plays the driver).  It doesn't hurt that Tony LoBianco stops by (again) to play a baddie.  Please enjoy."],"review-user":["stpetebeach","thomaswatchesfilms","Jakealope","jetjag","rmax304823","ss89q","pderocco","RocketeerFlyer","Hey_Sweden","barnabyrudge","AaronCapenBanner","lost-in-limbo","nomoons11","ruthlessroddy","rusher-7","sol1218","wvmcl","filmalamosa","rshs2012","JoeKarlosi","CuriosityKilledShawn","gazzo-2","charmcguy","grafspee2","RNMorton"],"review-date":["29 July 2005","10 July 2004","11 January 2009","22 August 2004","6 June 2007","2 December 2004","21 January 2003","22 September 2015","6 June 2013","22 January 2003","30 August 2013","24 March 2013","18 February 2012","9 November 2009","15 February 2009","2 October 2004","8 June 2010","19 October 2012","11 March 2011","26 February 2008","29 September 2010","17 February 2007","23 May 2005","16 August 2003","10 January 2003"],"review-rating":["9","8","8","7","6","8","5","8","7","8","10","7","5","8","8","6","7","6","9","7","9"],"review-title":[" Best car chase, period.\n"," Tough, gritty and taut\n"," Good Basic Cop Movie that we need more of\n"," Very underrated + Moon!!!\n"," Exciting NY Cops vs. Mob Thriller.\n"," One of the best police stories\n"," Crime in the 70's\n"," Gritty 70's 'CULT' Cop Thriller you MAY HAVE MISSED?\n"," Solid, under-rated crime picture.\n"," OK thriller filmed on authentic locations\n"," Semi-Sequel To French Connection.\n"," \"We don't make mistakes.\"\n"," Not in the same league as the French Connection but it has the same feel..oh and it has an even better car chase\n"," A Classic\n"," 1970's New York Crime Drama At Its Best\n"," No the movie is not about that popular soft drink\n"," Tepid direction sinks what could have been a classic\n"," Entertaining 70s cop flic\n"," More Buddy Russo\n"," The Seven-Ups (1973) **1/2\n"," Tastes just like Sprite\n"," Pretty good 'French Connection' type of the era.\n"," Good performances by Scheider & Lo Bianco; terrific car chase\n"," Richard Lynch!\n"," Another good Scheider flick\n"]}