{"review-url":["http://www.imdb.com/title/tt0066564/reviews"],"review-text":["Warner Brothers botched the distribution of this movie.Lewis made a movie that was more adult and topical in light of the times.The movie was more plot driven then many of his other directorial efforts.Lewis makes great use of the art of verbal humor,the scene of Byers trying to learn German from a phonograph record.He fractures and mocks the instructor and the sound of the German language.The scene of Byers/Kesselring's meeting with Hitler is one of Lewis's great masterworks of verbal comedy.Byers in disguise at a German checkpoint double talks the guard,then Byers/Kesselring gets the guard to hand him the password and then gives him the password back.Byers great line at the beginning of the movie that \"every man has a right to be killed fighting for his country\" is pure gold in the light of Vietnam.The comedy gems in the second half of this movie are fast and furious.I think it is the most verbal driven and more adult in it's comic pacing than most lewis vehicles.I think Lewis was going in new directions.WB killed any such future which we can only guess at seeing it all but derailed his career.","I think this movie is the most misunderstood film in Jerry Lewis career. It's little slow starting, but after it gets going is very funny & Jerry's use of irony like never before in his earlier films..., ie, Who's Minding the Store, The Nutty Professor, etc., the idea, is clear, it's a mock of the Dirty Dozen, instead of getting soldiers on death row to do a suicide mission as in that film, you have 4, 4-f's & 2 tag alongs. Including the Former L.A. Dodgers all-star Centerfielder, Willie Davis as Linc! HILARIOUS! Love that Movie!","A very different Jerry Lewis film, not like all those more famous films that everybody knows. Lewis deals with the difficult task of WW II and National Socialism in Germany in a rather unconventional way. But even more interesting and important, he does it in a very un-American way. And as with so many things in the world and especially in the film industry un-American means more sophisticated, more subtle, more intelligent or simply better. That is the reason why the film was no success in the US but a very great success in Europe.All in all, Jerry Lewis has proven by this movie, that he is able to do much more than simple slapstick comedy.","For some inexplicable reason, Jerry's movies often seemed to come in for diatribes from certain quarters although they were rarely box office disappointments. It's one of life's great mysteries to me because his films have always had a 'feel good' factor about them for me. But this film is not only not bad: it's an exceedingly good and clever comedy. To those who may be tickled by 'modern' crude or cruel humour, don't see this film: There's nothing in it like that and you'll be wasting your time.I've only seen this film once on the television. I've waited ever since to see it again and that's been quite a few years. You'd think the idea of an arrogant millionaire businessman heading off to win the war against the Nazis with his own small private army of subservient employees would be boring wouldn't you? Well only Jerry Lewis would dare try such a plot for an out and out comedy and it works, I have to say, brilliantly.I think that, as with 'The Nutty Professor' and most of his other films, this movie is testimony to his comic genius, both in concept and execution. I think Buddy Love might have said, \"You know, true comedy can not only make a six year old hysterical, it'll do that for his Dad too.\" Maybe a few nutty Nazis generals with monocles and a limp would dislike this movie, honestly. If you only see one more comedy in your life, see this one. Be careful though, you might die laughing. And I'm not joking!","I had watched this as a kid but, not being much of a Jerry Lewis fan, I had completely forgotten it (not that it's in any way memorable). The film revolves around impersonation (which seems to be in the curriculum of every comic star!) - in this case a German officer - and, while not as bad as Leonard Maltin claims (awarding it a BOMB rating), it's not exactly classic stuff either - certainly leagues behind Chaplin's THE GREAT DICTATOR (1940), even if comparably narcissistic! Ironically, the scenes prior to the appearance of the would-be wacky General offer more felicities than the rather forced humor at Nazi expense! The film was really Lewis' last gasp during his heyday; in fact, this proved to be his last vehicle to be released for 10 years (it's painfully apparent here that his particular brand of foolishness wouldn't pass muster in the age of Mel Brooks and Woody Allen)!","After Which Way To The Front was released Jerry Lewis ceased making films as a star attraction. With a few funny moments involved, there were more eggs laid at this film than a chicken farm on a slow day. It's not a horrible film but it's definitely not among Lewis's best and in the lower tier of his work.Jerry plays one of the richest men in the world who for some reason I can't fathom wants to serve in the ranks. So it rankles him that he's declared a 4-F something around the time that this film came out many young men would have sold their souls for. As he and three fellow 4-Fs Jan Murray, Steven Franken, and Dack Rambo sit and commiserate about their fate Lewis has a brainstorm. He's rich enough, he'll form his own army and equip it. I will say he designs some snazzy uniforms for his troops which also include his butler John Wood and his chauffeur Willie Davis of the Los Angeles Dodgers.Those flashback sequences involving Murray, Rambo, and Franken are the best part of the film. Even for an audience in the middle of the Vietnam War, those guys all have excellent reasons for wanting to leave their current situations. Unfortunately the rest of the film isn't as good. The guys train on Lewis's palatial estates, get the best chow any army ever had and then decide on their own mission which is based on Jerry Lewis's resemblance to Field Marshal Kesselring. If you believe their account they actually break the stalemate on the Italian front and later participate in the bomb plot against Hitler.Hitler was played by Sidney Miller and his scenes with Lewis as Kesselring are taken straight from The Great Dictator. I'm not sure Charlie Chaplin really liked this particular homage.A lot of World War II film clichés are dealt with here. The coda to this film with Lewis impersonating one of those bucktooth Japanese that were popular at the time I'm not sure was really needed. Nor was it all that funny. Jerry came up short with this film.","\"Which Way to the Front?\" is a hugely disappointing films...even for die-hard Jerry Lewis fans. I personally WANTED to like the movie, as ever since I got to see Lewis in person a few years ago, I have really come to respect and enjoy his films. But no matter what I think of the guy, I cannot in good conscience give this film a positive review because it makes the biggest mistake of any comedy...it's simply not funny. Additionally, the film is set in WWII and looks as if Lewis didn't even bother trying to make the film look as if it was set in the 1940s. The hair, clothing and sets look straight from 1970!The film COULD have been funny. It seems that the richest man in the world, Brendan Byers (Lewis) wants to fight in WWII but has been declared 4-F. So, he decides to create his own tiny commando unit and he and his men plan on kidnapping a German Field Marshall who looks exactly like Byers. Each member of the team seem about as manly and menacing as a cannoli and one guy (played by baseball star Willie Davis) is black...and they go behind enemy lines dressed as German soldiers. I mention that it COULD have been funny. The biggest supposed laughs are when Jerry pretends to be the German Field Marshall---and this mostly just consists of him screaming. It looks like a 7 year-old's idea of what a German SHOULD sound like. As for the Japanese, late in the film Jerry dons big teeth and does an impression that is not only racially offensive but cheap and unfunny. But with no real laughs and the men dressed in what look like 1970 Armani uniforms of orange and bright blue, it just comes off as bizarre and ill-conceived. Even Lewis' worst comedy, \"Cracking Up\" has ONE hilarious scene (aboard the discount airline)...\"Which Way to the Front\" has nothing...absolutely nothing that will elicit a laugh in anyone. I truly think that if the audience had no idea who Lewis was, they'd think this movie wasn't even supposed to be a comedy! A film best skipped...especially by Lewis fans. It's so unfunny I can understand why Jerry didn't make another starring vehicle for a decade following this one (aside from the never released and reportedly god-awful, \"The Day the Clown Cried\").","I clearly remember being bereft at the age of about 10 when I read that Dean Martin and Jerry Lewis were splitting up. I think it was my first lesson in the world being cruel, I was truly shocked at that age as these were my comedy heroes. They'd had a string of hits finishing with Pardners and Hollywood or Bust and I just couldn't conceive of a world without Martin & Lewis. Jerry went on to make many comedies which got great acceptance as I remember in Europe, but not so much in the USA. He was regarded as a kind of modern day Chaplin and an acquired taste, mainly due to his obstinance in doing his own thing. This fortunately came to a head with the original Nutty Professor, a truly great comedy. I wish he'd left it there as Which Way To The Front, which I've just viewed is dreadful. An awful script, let down by amateur acting from the so called comedic actors supporting him, a ghastly performance by Jerry himself, screaming for most of it, and in this day and age, politically incorrect to the extreme. I smiled in two or three places and that was it. Best to avoid unless like me, you're a Jerry Lewis completist and just had to watch to the end. It seemed about as long as the second world war in which it was set.","Written by brilliant Monkees' TV writers Gerald Gardner and Dee Caruso,WHICH WAY TO THE FRONT was the last of the \"Jerry Lewis\" movies until \"Hardly Working\" almost a decade later. Jerry's comedy is evidently an acquired taste, and admittedly he can occasionally be his own worst enemy when he helms as producer/director--but even in the dreariest of his films, there are always moments of brilliance.WHICH WAY manages to be amusing,entertaining and yes,quite funny. It is somewhat unlike any of the typical Lewis films.The pace is very upbeat and ther are lots of excellent supporting players--a kind of JERRY DOES HOGANS HEROES.The whole thing looks kind of like an unsold TV pilot and you will either love it or hate it---but hopefully YOU VILL LAUGH","Jerry Lewis was marginally funny when he didn't write his own material  and had a good director like Frank Tashlin. When he started writing and  directing his own films what little talent he possessed was  overshadowed by his egomania. Whenever his films would fail (and  deservedly so) in the American market (they made money in France) Lewis always  blamed everyone and everything but himself; for example, he blamed the  failure of this film on the fact that it was, according to Lewis,  released on a double-bill with the porno feature \"Deep Throat\". If  anyone should have complained about that situation, it should have been  the producers of \"Deep Throat.\" This is an absolutely idiotic \"comedy\"  about the world's richest man (Lewis) who is rejected for military  service during WW2 and decides to outfit a special \"squad\" to go to  Germany and capture Hitler himself. Besides the many faults this film  has (the script is mind-numbingly unfunny, Lewis' \"direction\" is  nonexistent, the film has the look of a cheap home movie), Lewis  apparently thought that surrounding himself with no-talent,  over-the-hill Borscht Belt comics like Jan Murray and Sidney Miller was  a good idea; he must have figured that they would be so bad, they would  make him look good. He was half-right; they are embarrassingly bad, but  he comes out even worse than they do. For a \"comedy\", Lewis' character  is sullen, angry and pushy; the way he heaps abuse on his underlings  makes you wonder why they would ever follow a bullying jerk like this  on a dangerous mission like trying to capture Hitler.  The fact that this movie took in any money at all is astounding. It is  by far the worst Jerry Lewis movie I have ever seen--I've heard that  \"Slapstick\" is even more pathetic, but I can't bring myself to see if  that's true or not--and is to be avoided at all possible costs.","As Ben Elton once observed, nothing goes quicker out of style than comedy. Steve Martin's latest offering - 'The Pink Panther 2' - recently opened to bad reviews and dismal box-office grosses, while Mike Myers' 'The Love Guru' seems to have won few admirers.In 1970, it was Jerry Lewis' turn to feel the pain of rejection ( ironically, his character in this film experiences a funny turn whenever anyone uses that word in his presence ) when 'Which Way To The Front?' effectively drove him off the big screen for almost a decade.In this World War Two comedy, he plays 'Brendan Byers 111', the richest man in the world, who wants to join the army to do his patriotic duty ( and also because he is bored with being successful ) but is rejected as he is medically unfit. He then decides to start his own privately funded army, recruiting other 4-F's.Decked out with ludicrous uniforms that look like those worn by 'International Rescue' in 'Thunderbirds', they go into training. Some good visual gags here. When they fire rocket launchers, they look pleased with themselves, until they learn they have just destroyed a Texaco oil station! Wishing to learn German, Brendan plays a long-playing record called 'Songs To Mein Kampf By'. When this army sits down to eat, instead of being in a draughty mess hall, they are in an opulent room decked out with a chandelier.John Wood is very funny as 'Finkel', Byers' ever-so English butler. His best scene is when he blackmails a Mafia-type gangster into teaching Byers' brigade to kill.The script was not by Jerry himself, but by Gerald Gardiner and Dee Caruso, author of a number of episodes of 'The Monkees'. 'Front' often has the look and feel of a television sitcom, indeed at times you almost expect to hear a laugh-track.Where it goes badly wrong is in the last thirty minutes when Byers replaces a top Nazi commander and, after ordering the Germans to withdraw from the front, gets involved in the plot to kill Hitler ( and Tom Cruise is nowhere in sight! ). As the commander, Jerry delivers a performance of such mind-numbing ineptitude as to defy description. He gives Brian Blessed a run for his money in the 'loudest man alive' stakes. It comes as a relief when the end credits appear.Perhaps the timing was just wrong - bringing out a war comedy when the Vietnam conflict was raging was not a good idea. Or the public simply had had enough of Jerry ( that beard probably did not help! ). What he needed here was a good producer, someone to take him in hand and say: \"That gag stinks. Throw it out!\". 'Don't Raise The Bridge, Lower The River' is a masterpiece by comparison with this picture.As the '70's got underway, the new comedy icons would be Woody Allen, Mel Brooks, and Monty Python - fresher, more biting and in Allen's case, more human styles of comedy replaced Jerry's brand of slapstick. It would not be until 1982 that he would make anything like a successful comeback - as the conceited talk-show host 'Jerry Langford' in Martin Scorcese's brilliant 'The King Of Comedy'.","The idea behind \"Which Way to the Front\" - a millionaire rejected for military service during World War II deciding to form his own army platoon and fight the war his way - is definitely one that is original and has a lot of potential for humor. Unfortunately, the execution here is lacking, to put it kindly. Watching it, I often got the feeling that star and director Jerry Lewis was not trying very hard. For example, while the movie is set in 1943, the movie has a very 1970s feel to it from the costumes to the sets. A bigger problem is that the movie is simply not that funny, especially in the first half. The movie starts off very slowly, taking both forever to set the situation up and then to get Lewis and his team into the field. And while this is going on, one attempted gag after the other lands with a thud.The second half of the movie is a bit more successful. There is an injection of serious energy by both Lewis the star and Lewis the director. And this energy does end up generating a few (mild) giggles. (But I certainly didn't laugh at the offensive last scene; you'll see for yourself when you watch the movie.) While there are worse comedies out there (both with or without Lewis), it's easy to see why Warner Brothers only gave the movie a limited release in North America. Though the movie did extremely well in a number of foreign countries, suggesting there's an audience for just about any movie.","Just seen Which Way to the Front? on TCM (UK) it is a truly awful film. If I'd paid at the pictures I'd have walked out.A terrible mess of a film. Byers (Lewis) and his mates prance around in cast off uniforms from an Italian sci-fi movie of 1960's. Were the CND/Peace symbol badges on the uniforms meant to be Ironic? The sets were pure 1970, I'm sure a Hollywood TV back-lot could have provided a more realistic set.The film is riddled with racism. The film takes the mickey out of veterans. Not funny how Lewis every got to make another film is beyond me.","Which Way to the Front? (1970) BOMB (out of 4) Insanely awful film has Jerry Lewis playing Brendan Byers III, the richest man in the world. He gets drafted to join WWII but he fails his physical and becomes a 4-F. When he can't get into the war he decides to start his own Army with various other 4-F's and soon they are going after Hitler.WHICH WAY TO THE FRONT? would turn out to be the last Jerry Lewis film to see a theater for a decade. This here is without question the worst film I've seen from Lewis and it even managed to be worse than his comeback films HARDLY WORKING and CRACKING UP. With three incredibly awful movies, it makes me wonder how bad THE DAY THE CLOWN CRIED if Lewis was willing to keep that movie on the shelf yet release these three.Why did WHICH WAY TO THE FRONT? deserve a BOMB rating? I will admit that it's actually better made than many Lewis movies but this film was completely worthless to me because I didn't laugh a single time. Usually Lewis is very forceful in regards to his comedy style but that's not the case here. The comedy is much more laid back but that doesn't mean it's any funnier. The entire film is just very poorly paced and lacks any laughs. In fact, there really wasn't a single scene where it seemed like they were even going for laughs.I'm really not sure what Lewis and company were thinking when they made this turkey. There's really not a single funny moment throughout the incredibly long 96 minute running time. Just check out the scene where Lewis is messing around with Hitler to see how bad the comedy fails. WHICH WAY TO THE FRONT? is without question one of the worst comedies ever made but it does succeed at many many other bad Lewis films appear better than they actually are.","This movie is almost unwatchable. I'm not sure why it was made. The only motive that comes to mind is revenge, but against whom? Casting is a big issue. Jan Murray is a stand up comic who is about as funny as an influenza epidemic. The rest of the cast follows his suit. There is none of the Jerry Lewis comic genius in this film. Even when he's mugging and freaking out, there isn't the skilled comic reactions from the other actors. Kathleen Freeman could've done it, but she's wasted in this film.There's a real feeling of laziness. The main characters are wearing clothes from the sixties in a film about the forties. And ASCOT??? In 1943??? I know Lewis has forbidden the viewing of his holocaust movie, The Day the Clown Cried. I think this one belongs in that vault as well.","s a lifelong Jerry Lewis fan I felt a review was necessary for this film which is so commonly maligned by people and I'll never understand why they detest it so. 1st of all after Dean and Jerry split in 1956 Jerry Lewis spawned some excellent comedies on his own from 1957-1970 - Which Way to the Front being the final one in his 14 year run after the split. Non Lewis fans and critics only seem to notice Nutty Professor as being any good --- They are so wrong it disgusts me. Everyone of Jerry's Paramount movies from 57-65 were financial successes not just in Europe but in the USA - some reviewer claimed Jerry had failures at the box office during this period in the USA but again they are very wrong. There were only 2 Lewis films that didn't make bank from this era and none of them were Paramount they were Don't Raise the Bridge and This film - not that they weren't good films but Columbia and Warners never distributed them correctly but out of 30 films only 2 is a pretty good run in his home country the USA.Now to this film, yes the first 20 minutes or so are very slow and tedious with all the little stories Jan Murray and the other 2 4Fs shpill --- but as soon as the credits are done (20 minutes in) it is as funny as any WW2 comedy made during that period.Jerry's impersonation of the German Field Marshal with the high pitched accented voice is funny as all get out - it makes for true genius in sound and film --- his presentation of awards to 3 Nazi soldiers is truly slapstick at its very best ---His getting through the checkpoint with a Black German soldier driver (played by Dodgers star Willie Davis) is hilarious ---Echoes of Mel Brooks The Producers Dick Shawn are brought to mind and Hogans Heroes ---Truly a time capsule classic --- NO you don't have to be a Jerry only fan to like this film but you must have patience as the 20 minute lead in is quite tedious...I say 10 out of 10 because the foolish reviews giving it 1 out of 10 are truly misguided and just wrong. A MUST SEE yes --- watch it and pay attention and you'll agree a Classic --- If you don't like Jerry Lewis loud voice then why are you watching any Jerry Lewis movie to begin with ???The supporting cast is superb - Jan Murray leads it --- Appearances by great comedians Kaye Ballard, Fritz Feld and Benny Rubin are just some of the highlights of this one of my favorite Jerry Lewis movies ever ...","The idea of a rich man, rejected by the army as 4F, then creating his own military experience, has possibilities. It could be a funny movie.This wasn't. Lewis' vision of the comic bits has no sense of timing. It moves along at a snail's pace, and includes myriad supporting scenes that just aren't funny. Each scene has a punch line, but most of them were a waste of film. Evidently, firing a mortar and then blandly declaring \"We just blew up a Texaco station\" just doesn't pack the comedic punch it used to.Jerry stammering gibberish was barely tolerable in his early days. In this film, it just looks tired.While the film is set in 1943, hair styles, colloquial expressions, mores, costuming, and just about everything else are firmly rooted in the late 60s.To get picky, the freeze frame method of ending scenes, as used in this film, is just odd.I actually got pained looks from my wife when I held on past the first twenty minutes hoping that it would eventually get to the \"good part\". Twenty-two minutes after that I finally gave in and stopped watching this mess."],"review-user":["yesfan2012","Robbo62","Joschi","atenxm1","Bunuel1976","bkoganbing","MartinHafer","a.lampert","therascalsarchives","BrianG","ShadeGrenade","Wizard-8","alftupper","Michael_Elliott","masercot","BobbyWaggs","vranger"],"review-date":["9 May 2013","20 July 2001","6 February 2001","19 August 2006","18 August 2006","24 March 2015","17 March 2016","23 November 2014","18 January 2009","31 May 2000","25 February 2009","20 March 2016","23 August 2009","21 March 2016","18 March 2016","17 March 2016","21 March 2016"],"review-rating":["9","10","10","10","4","4","1","2","7","1","4","1","3","10","3"],"review-title":[" WB torpedo's a fine movie and a Great Director and Comedian\n"," The Not So Dirty Half Dozen...\n"," Not the worst, but one of the very best Jerry Lewis films\n"," Comedy genius\n"," WHICH WAY TO THE FRONT? (Jerry Lewis, 1970) **\n"," Jerry comes up short\n"," Completely unfunny....\n"," Nein Nein Jerry\n"," Last original \"Jerry Lewis\" film is overlooked gem\n"," Quite possibly the worst Jerry Lewis movie (and that's saying a lot)\n"," Jerry Gets His Marching Orders\n"," A few giggles here and there, but mostly unfunny stuff\n"," Awful Film Avoid\n"," One of the Worst Comedies Ever Made\n"," Ick, Yuck and Blech\n"," One of the best WW2 Comedies Ever\n"," Great concept, badly realized\n"]}