{"review-url":["http://www.imdb.com/title/tt0029662/reviews"],"review-text":["A bland title disguises this solidly-carpentered example of old-fashioned Hollywood entertainment, this film proves a largely successful hodgepodge of several disparate elements: a period piece, a romantic drama, a crime movie and a political thriller. Interestingly, though made by Fox, its protagonists  Robert Taylor and Barbara Stanwyck  were both usually associated with other studios; their on screen chemistry here is palpable and eventually led to marriage in a couple of years' time. While a bit too young, Taylor is a dashing hero (a Marine personally appointed by President McKinley to uncover the culprits behind an organized clean-up of numerous banks); unsurprisingly, no sooner has he tracked them down (led by smooth Brian Donlevy and thuggish Victor McLaglen) that he falls for a chanteuse (naturally, Stanwyck) who has thrown her lot with the gang  although, truth be told, singing is far from being the actress' forte! Similarly, apart from having to prove his worth to make it into their fold, he has to vie with McLaglen for Stanwyck's attentions; by the way, the practical joker persona of the former reminded me a lot of Charley Chase in SONS OF THE DESERT (1933) which, incidentally, was likewise directed by William A. Seiter. Later on, Taylor is in two minds about involving Stanwyck in the impending bait and tries to offer his resignation to the President while eloping with the girl  but the jealous rival disrupts his plans. The robbery gone awry, we find Donlevy dead and the other two in jail; Taylor's hopes for McKinley's intervention  having meanwhile learned the identity of the elusive and obviously prominent 'inside man'  are seemingly dashed when the President winds up assassinated himself (a great plot twist, though the resulting eleventh-hour suspense feels contrived)! To get back to the film's jumble of styles, even if the vaudeville sequences are a matter of taste, the romantic triangle slows things up and it skimps somewhat on the thriller aspect, this emerges a handsome production indeed  with the actors already mentioned ably supported by the likes of John Carradine (who unaccountably disappears after just one scene!), Douglas Fowley, Sig Rumann and, as two American Presidents, Sidney Blackmer (the bubbly Theodore Roosevelt) and Frank Conroy (McKinley).","In 1937 Darryl Zanuck, who had recently moved from head of production at Warner Brothers, was trying to get his newly created company, 20th Century Fox off the ground and on a level playing field with his old bosses at Warners and the glitter palace at MGM. \"This Is My Affair\" was an attempt to cash in on the current success of historical films set around the turn of the century (\"San Francisco\" \"In Old Chicago\")and in retrospect he succeeded quite mightily. The plot is fascinating. A trouble maker but heroic naval officer (Robert Taylor) is given a secret assignment by President McKinley to uncover a ring of bank robbers that are paralyzing American finance. He finds the gang but falls in love with their female mascot (Barbara Stanwyck) and must decide between love and duty.Not everything about this vintage film works well, but overall it is a good slice of studio film-making. The plot gimmick would be borrowed by Kurt Vonnegut for \"Mother Night\" (the lead role of that film of the book was played brilliantly by Nick Nolte) and seems quite believable, at least within the confides of studio make believe. As a fan of old movies I am always thrilled when I stumble upon one that I have never seen and \"This is my Affair\" was no exception.","This is an unusual film because although it was made by Twentieth-Century Fox because it's one of the few pairings of Barbara Stanwyck and her future husband, Robert Taylor. Barbara Stanwyck had been making films for many different studios (RKO, Paramount and Selznick) at about the time she made THIS IS MY AFFAIR, but Taylor was an MGM contract player so he only appeared in this film because he was loaned to Fox--something studios occasionally did during this era.The film is interesting because many real-life people have roles in the film, though the piece is otherwise pure fiction. You'll see actors playing William McKinley, Teddy Roosevelt and Admiral Dewey. I can't recall any film with McKinley or Dewey in it as a character, though I do remember Roosevelt from THE WIND AND THE LION and a couple other films. Three cheers for seeing a \"lesser President\" in a film as a major character! The film begins with McKinley taking a young lieutenant (Robert Taylor) aside and asking him to be a special agent for him--and telling no one--not even the Secret Service. That's because the President fears that someone within the agency is tipping off a gang that has been making a long string of robberies--all based on inside information. So it's up to Taylor (who is NOT known for his manly roles--especially at this stage of his career) to pose as a thug and find the gang responsible AND the inside man.However, there are two serious complications. First, while he is able to find the gang members, one of the gang member's step-sister is Stanwyck. Taylor finds that he's fallen in love with her but he must also do his duty and turn them in to the authorities. Second, because McKinley is the only other person who knows the truth, SERIOUS problems develop when McKinley is assassinated and Taylor is on death row for the crimes!!! The film did a nice job of creating a story and placing it within a historical context. While today most people don't remember McKinley nor remember that he was assassinated, the film is set in this interesting time period. The acting is pretty decent, as the stars are supported by Victor McLaglen and Brian Donlevy, though I must admit that Donlevy's role was pretty tame and ordinary compared to many of his other film roles. Overall, it's very interesting, well written and not too sappy in the romance department. A good outing for all.","How many pictures do you know have something to do with assassinated President William McKinley?This 1937 film does and it's a pretty good one at that. The McKinley character recruits Robert Taylor to go after bank robbers who have been throughout the west. The problem is that Taylor goes undercover and no one knows about this situation other than the president and Perry. (Taylor) From your history, you know that Sept. 1901 is coming and that McKinley will ultimately succumb to an assassin's bullet. You just know that Taylor will be accused when he successfully infiltrates the Brian Donlevy-Victor McLaglen gang.As dance hall queen, Barbara Stanwyck shines here. Naturally, we have the excitement of the stay of the execution for the Taylor character.The scene where President Roosevelt utters his famous Speak Softly statement is ridiculous at best.","Did anyone watching this movie wonder if President McKinley got assassinated, because of his secret attempt to unmask one of his confidantes as the kingpin of a crime syndicate?  It's a question that was left unexplored here, because, I take it, Americans of the thirties never saw the event as anything but the act of a lone fanatic instead of as a conspiracy. After all, audiences were still recovering from the aftermath of a Depression, and the movies of the time were more concerned with stamping out the Little Caesars and Duke Santees of the day than uncovering political corruption.  Allan Rivkin (\"The Farmer's Daughter\") wrote an interesting story about a naval officer (Robert Taylor) who, in secret correspondence with McKinley, uncovers the linchpin behind a wave of bank robberies in the upper Midwest centered in, of all places, St. Paul, Minnesota.  The screenplay gets sanctimonious in the hands of Lamar Trotti, and the script did not inspire William Seiter to more imaginative heights.  Brian Donlevy plays the crime boss with his usual menace, while Barbara Stanwyck (of all people) as his half-sister is made to sing (She's barely on-key, like Marlene Dietrich in \"The Blue Angel.\") and wear big, floppy hats--even in her stage act.  The only one I've ever seen on screen who could pull off wearing headgear like these is Mae West, and she was at least in on the joke.  Stanwyck, on the other hand, is forced to be unswervingly sincere throughout.  Her character Lil and the officer idle on Lake Como and get serious about each other, much to the dismay of Victor MacLaglen who's Donlevy's sidekick, prone to playing practical jokes, and thinks he has it in with her.  The acting is uniformly bad; I guess Stanwyck and Taylor were too much in love at the time to care.  The story deserved better than this. A secret only you and the President share you would think should take precedence over run-of-the mill movie romance.  Unless it involves a cigar and a stained dress...","A pair of nuns escort a group of schoolgirls through Arlington National Cemetery, where they stop at the grave of Richard L. Perry, a lieutenant in the U.S. Navy. When the nuns are unable to answer a girl's query as to why Perry is buried therein, the film flashes back to 1901. The young Perry, played by Robert Taylor, is at a White House reception, where he is called into conference with President William McKinley. The President asks Perry to pursue a gang of bank robbers, who evidently have inside information from a high government source. Fearful that information sensitive to national security may also be at risk, the President tells Perry to drop out of the Navy without giving any reason, change his identity and break contact with friends, and only report by secretly coded letter to the President personally. This far-fetched premise sends Perry, without any apparent funds, to St. Paul, for no given reason, where he begins his quest for the robbers and the government leaker. Viewers who can swallow the credibility-stretching plot conceived by Allen Rivkin and Lamar Trotti may find a few nuggets of silver among the gravel that constitutes \"This is My Affair.\" Even the generic title, which offers no clue about the film's subject matter, is forgettable. Directed by William A. Seiter and filmed in black and white by Robert Planck, the movie is barely passable entertainment largely for fans of the stars. Robert Taylor in his youth was always too pretty for tough-guy roles, and he plays Perry without the necessary grit to convincingly stand up to his tough co-stars. Always a fascinating actress even in undemanding roles such as this, Barbara Stanwyck is Lil, a club singer and unwilling gangster moll. Lil performs, clumsily at times, in a club operated by Jock. Splendidly played by Victor McLaglen, Jock is a boorish childish jokester in love with Lil. When Taylor pursues an initially reluctant Stanwyck, the expected conflict with McLaglen arises, which, like everything else in this tired script, is a clichéd retread from dozens of other movies. Brian Donlevy as Batiste, the brains behind McLaglen, and John Carradine offer convincing support. However, Sydney Blackmer's corny impersonation of President Theodore Roosevelt is embarrassing; listening to him say \"Speak softly and carry a big stick\" over and over will make audiences cringe. Although \"This is My Affair\" is somewhat vague as to what \"affair\" the title refers, the flimsy contrived plot offers little beyond a gangster story wrapped up in early 20th-century period costumes. Like the unnecessary prolog in Arlington Cemetery, the intrusive musical numbers that regularly interrupt the film only serve to extend the running time. Stanwyck was not noted for her singing or her dancing, and even her skill as an actress fails to convince that she is a great stage presence. While Taylor is handsome and Stanwyck is worth watching, McLaglen gives the film's best performance as Jock, the big overgrown kid, who always has a new joke or trick to play. However, other than McLaglen, Stanwyck, and Donlevy, \"This is My Affair\" could be re-titled \"This is a Dull Affair.\"","A clever usage of history is the glue that holds this costume gangster movie together. Robert Taylor is a federal agent utilized by President McKinley in 1901 to infiltrate a gang of bank robbers. This leads to the capture and sentencing to hanging, no witnesses in his favor as the president is assassinated. Barbara Stanwyck plays the Lillian Russell like singer (ironically named Lily) whom Taylor falls for and is the only person who can possibly save him.This enjoyable period drama with a few nice musical sequences is a delightful pairing of the real-life couple who married several years later. Stanwyck's husky voice isn't Merman or Garland, but is pleasant and perfect for the period. She looks wonderful in the period costumes and her acting excellent, particularly when she goes to see President Theodore Roosevelt for help. She hit her stride this year with her first Oscar Nomination for \"Stella Dallas\" and Taylor rose above romantic leads where he was overshadowed by the leading ladies he was being cast opposite at MGM.Victor McLaglen and Brian Donlevy also stand out as members of the gang, McLaglen giving a memorable breakdown scene where he fights against his imminent hanging while in prison. There's a hint of the Alice Faye musicals of the time that 20th Century Fox was making, especially the soon to be released \"In Old Chicago\".","Years before Robert Taylor and Barbara Stanwyck were married, they made a couple of films together: His Brother's Wife and This Is My Affair. If you're looking for cute chemistry, rent the 1937 movie, because the first film they made together isn't particularly romantic.In this one, Robert Taylor gets sent on a secret undercover mission by President McKinley to help catch bank robbers. It sounds like an extremely lame plot, and while no one would ever accuse this movie of turning into a classic, if you want to see an acting couple who eventually got married, you can rent it. Bob goes undercover, with only a secret symbol to write on his letters as proof that the president is on his side, and along the way falls in love with nightclub singer Barbara Stanwyck.One of the fun parts of the movie, besides seeing the lovebirds together, is Sidney Blackmer's Theodore Roosevelt impression. He's very entertaining, and the script includes several of the President's famous quotes to make audiences chuckle.","1937's \"This is My Affair\" could have been better but as it is, barely gets by. Robert Taylor stars as a Navy lieutenant who is asked by President McKinley to get the name of the men robbing banks all over the country, and his mission is to be kept secret between the two of them. Taylor infiltrates the gang by becoming a criminal himself. He meets the dumb, big practical joker (Victor McLaglen) and the brains (Brian Donlevy) - but there's a head name, whose name he can't get. McLaglen has it bad for Donlevy's half-sister, a saloon singer (Stanwyck) with whom Taylor falls in love. The premise isn't bad if you can suspend your imagination, and the end is fairly tense, but \"This is My Affair\" just isn't a well-made or well-thought out film. First of all, Stanwyck was one of the most versatile and multi-talented actresses in Hollywood, but singing wasn't her greatest talent. In fact, she couldn't sing, with the exception of \"Take it Off the E String (Play it on the G String) in \"Lady of Burlesque\" and a little number in \"Banjo on my Knee\" that can't count as singing. Her outfits were from the Mae West School of Design and overpowered her tiny frame.Then there is the awful scene with Theodore Roosevelt where he invents the phrase, \"Speak softly but carry a big stick\" - embarrassing. Taylor slugs through it professionally, but why did makeup people always slather so much pancake and eye shadow on him? This is a 20th Century Fox film, by the way, not MGM, Taylor's usual studio, but MGM did it too. Fox never made Tyrone Power up like that with the exception of \"Lloyds of London.\" Taylor was a handsome, rugged man. I guess they couldn't leave his face alone. Victor McLaglen isn't very good, but Donlevy, in a usual-type role for him, does a good job.It is a chance to see the two married stars work together.","In a recent biography of Barbara Stanwyck, I learned that Darryl Zanuck was keen on teaming Stanwyck with her soon to be husband Robert Taylor. Stanwyck freelanced and was currently owing 20th Century Fox a picture, so Zanuck must have worked something out with Louis B. Mayer at MGM to get his favorite star over to Fox.The year before the Taylor/Stanwyck team starred in His Brother's Wife which I'm sure did good business, but wasn't exactly memorable. Neither would This Is My Affair if it hadn't been for the fact that it starred a couple that were a hot gossip column item.What Zanuck did was give Bob and Barbara a vehicle that must have at some time been intended for Tyrone Power and Alice Faye. It's a period piece set at the turn of the last century. Barbara is even given a couple of songs by Alice's own songwriting team of Harry Revel and Mack Gordon to do as well as some period public domain music. Apparently she does them herself because I see no credit for voice dubbing. They would have been better had Alice Faye done them however.Taylor is a Navy Lieutenant on detached assignment to work a job for President William McKinley personally. McKinley is worried about a successful gang of bank-robbers operating in the Midwest who seem to have inside information about vault combinations and even have keys to let themselves in at night so no break-in is required. He has Taylor go under deep cover and report only to him if needed.It takes months, but Taylor does find the gang which is headed by Brian Donlevy and Victor McLaglen. He also finds Donlevy's stepsister Barbara Stanwyck with whom he falls for. But still his duty is clear.The notion that a President of the United States is taking such a personal interest in apprehending a gang of robbers is interesting. William McKinley's administration was one that had a lot foreign and domestic concerns. I can't believe that particular president could have involved himself in this crime investigation. But also the banking system was not so tightly regulated that one man could have had all that inside information. It's not even that tightly regulated now, even with the creation of the Federal Reserve which was a dozen or so years in the future.In fact McKinley's own assassination nearly cooks Taylor's goose. Frank Conroy looked very much like William McKinley and his character portrayal was accurate right down to the cigars McKinley enjoyed, the only vice this most Christian of presidents was known to have. Sidney Blackmer played Theodore Roosevelt many times on screen and really does make you think you're watching TR himself. He was much better at it than John Alexander from Arsenic And Old Lace.The two stars who soon married never did another project together while they were husband and wife. Taylor and Stanwyck did do The Night Walker after their divorce almost thirty years later. None of the three films is at the top drawer of credits for either star.","I am a huge Robert Taylor fan and I have been trying to find all of his films.  This is one I did not have, but I watched it recently on Fox Movie Channel, and was very disappointed.  I know he was a contract player with little control over his scripts, but the acting was as bad as the script. Victor McLaglen was even bad, and Brian DonLevy was almost unrecognizable. Considering the relations off screen between Taylor and Stanwyck, it was surprising how little chemistry there was on screen between the two of them. But the premise of the film was so ridiculous:  that the President of the U.S. would order a Navy Lt to leave the service secretly to hunt down bank robbers, and report only to the President, that it made it hard to appreciate anything else about the film.  The death row scenes were entirely unmoving.  The only thing worse than Taylor's acting was Stanwyck's singing. She got better later in Ball of Fire-thank heavens."],"review-user":["Bunuel1976","bob_gilmore1","MartinHafer","edwagreen","shrine-2","dglink","mark.waltz","HotToastyRag","blanche-2","bkoganbing","patriciaparke"],"review-date":["25 March 2009","7 January 2009","19 January 2009","6 December 2012","26 November 2000","11 November 2017","23 March 2013","28 October 2018","22 February 2008","25 February 2009","8 May 2001"],"review-rating":["7","8","8","9","5","6","7","5","6","6","1"],"review-title":[" THIS IS MY AFFAIR (William A. Seiter, 1937) ***\n"," Overlooked Historical Drama\n"," Nice historical fiction\n"," This is My Affair ***1/2\n"," An Affair with the President\n"," Colorful McLaglen in Far-Fetched Affair\n"," Romantic historical drama with two stars at their romantic height.\n"," Stanwyck and Taylor flick\n"," disappointing\n"," A Hot Gossip Column Item\n"," Ridiculous premise, bad execution\n"]}