{"review-url":["http://www.imdb.com/title/tt0086071/reviews"],"review-text":["...and I'm so disappointed because I can't seem to buy the DVD or VHS of it anywhere.Its a kind of mix of, Uncle Buck and The Great Outdoors and Molly Ringwald is fabulous as the spoilt teenager. This was made when Molly was still a brunette, just before she hit the big time with Pretty In Pink.I'd definitely recommend it to anyone who likes a good clean family comedy, with an edge! If anyone has a copy of this, or knows where I can get one...please leave a message for me - it'll be much appreciated.","I found it on sale at a video store for a buck, so I checked it out.It's not too bad. Kind of funny, really.This movie is a little like Prisoners of Second Avenue or at least a 1980s made-for-tv version of Walden. It's good old get back to nature. Living in Los Angeles is hell for one family. The husband gets laid off after 17 years of working at his job, the teachers burn down the school, the daughter is dating a punker named Johnny Crud, the eleven year old son is taking up smoking, and there is toxic waste bubbling up from the bathtub.\nSo, when his neighbor decides that he has had enough of living in the city and packs up his family to live at a place called WoodCrest, this guy decides to do the same with his family.But the country life is no blessing, and is also no easy adjustment. It doesn't help either when your neighbors are a bunch of wackos, specially the 'survivalist' family that lives in a bunker and hoards supplies, waiting for the day that an economic depression or a natural disaster or something will come and destroy everything.But the family really wants to know if the city sucks and the country does too, then where is a great place to live?Molly Ringwald is in it as the Valley Girl kind of kid. Sort of funny how she puts on the Valley Girl talk in her pre-country scenes.\nIt's really a like it or don't like movie, I guess.","This has to be one of the funniest movies I've ever seen. The idea of a typical family leaving everything behind to live in the wilderness. When mom and dad both lose there jobs, not to mention they have green slime in their bathtub. They decide it's in their families best interest to move to Oregon. Once there everything goes wrong. An interesting cast of characters compliment this movie. Including a young Molly Ringwald,this a movie I would definetly recommend.","I first watched this movie back in the mid/late 80's, when I was a kid. We couldn't even get all the way through it. The dialog, the acting, everything about it was just beyond lame.Here are a few examples... imagine these spoken real dramatically, way over-acted: \"Oreegon? You're going to Oreegon? Why would anyone want to go to Oreegon?\"\"Survivalists? Nobody ever told us about any survivalists!\"This movie was SO bad, my sister and I rented it again for her 16th birthday party, just so our friends could sit around and laugh at how awful it was. I don't think we were able to finish it then either!","i first saw this movie back in the early 90's,and instantly fell in love with it.richard benjamin and his wife paula made the 1981 movie \"saturday the 14th\"in 1981 prior to making this movie in 1983.i think they work quite well together.this movie made me laugh on several occasions.it also has a young molly ringwald,who would later go on in the late 1980's to do movies such as pretty in pink and sixteen candles.it is fun watching her a little younger.although not seen by many people..i don't even think the average movie fan has ever heard of this movie.but when i first came acrossed it i was glad i did.i gave this movie 10 out of 10 stars as i think it is a fun movie the whole family can enjoy.lastly i would like to say its not available on DVD,so i picked up a VHS copy on ebay,so if your interested,you probably can find one on there.it might be in the $20-$30 dollar range but i got mind for $12 bucks.i wish they would eventually release this on DVD."],"review-user":["fee_tambo","vertigo_14","Jade-20","zanriel","bobbyfar74"],"review-date":["14 February 2006","12 November 2002","26 March 2001","29 January 2006","9 March 2010"],"review-rating":["7","10","3","10"],"review-title":[" I loved this film\n"," Green acres?\n"," One Funny Movie!\n"," So bad it's almost funny, just because it's SO BAD!\n"," very enjoyable movie!!!\n"]}