{"review-url":["http://www.imdb.com/title/tt0081366/reviews"],"review-text":["The 80s low-cost independent horror \"The Power\" is an atmospherically inventive and dark with its fascinating concept involving an ancient Aztec idol that's harbouring a powerful force which infatuates those in possession of it, bringing out their dark side. It's starts off really steady and talkative but still remaining effectively compelling within its moody and fearful superstitious framework, but then it goes off the rocker becoming a ghastly, if typical little shocker with some very well executed, icky make-up FX for such a cheap budget. The deaths are few, but they bestow imagination and atmosphere --- however it's the underlining surreal creepiness that's held throughout, which makes up for it.Dual director's Steven Carpenter and Jeffrey Obrow's (who brought us the hokey slasher \"The Dorm that Dripped blood\" and monster carnage of \"The Kindred\") minimalist set-up is tidy, even with its gritty look but they do a decent enough job with their touches of brooding suspense and jarring visuals. Limited resources and amateurish acting (although Lisa Erickson was fair) don't distract too heavily as the creative and unusual story is well thought out in its context of forbidden power and the temptation of it that simply attracts evil. There's just a sense of doom that just won't waver, but while it might be a mystery to the characters it's not so for the viewer. Sometimes slightly muddled and random, as there much to gather but it comes together in an ending that's nothing more than a final cheap, but lasting shock. The eerie score accompanying only adds more to the mystical edge, demonstrating an intense, ripple-like grip. Susan Stokey's clueless character is somewhat grating in her self-absorbed attitude and Warren Lincoln gives the film much needed energy as his erratically idealistic character investigating the idol, to only fall under its corrupt spell.It would actually make a good, interesting double viewing with \"The Returning (1983)\". Trivia note; One thing I found somewhat unnerving is a scene in the film, which I don't know if it was purposely staged or not. In the sequence we catch a reflection (less than a second) in a mirror of a bearded man dressed in black just standing there watching Stokey. I never saw this character before, nor does he even reappear in the film. Nothing is mentioned. If it was one of the crew accidentally getting in the shot, it was a strange place to be standing and boy did he look scary. Just look at the face!","Sandwiched in between their slasher \"The Dorm That Dripped Blood\" (a.k.a. \"Pranks\") and their monster movie \"The Kindred\" is the supernatural shocker \"The Power\" by the filmmaking team of Jeffrey Obrow and Stephen Carpenter. The acting by the no-name cast is sincere and not as incompetent as would usually be the case for such a low budget genre piece. Obrow and Carpenter don't go about making sure that their little movie makes a whole lot of sense but do give it a respectable level of atmosphere and some decent horror scenes. Of course, the viewer does have to sit through less interesting parts to get to the good stuff.The tale involves a miniature Aztec idol made to honour a god named Destacatyl. This idol often brings death and destruction to those in its vicinity, and makes its way into the possession of some high school students with an interest in the occult. A young man named Jerry (played by the big-haired Warren Lincoln) is *really* intrigued by their story and becomes determined to get his hands on this idol, which leaves him vulnerable to getting possessed by this Destacatyl. This leads to nightmares for Jerry's ex-girlfriend Sandy (Susan Stokey), a journalist, and various otherworldly occurrences.Noteworthy components include the moody lighting by Carpenter, the excellent music by Christopher Young, enjoyable visuals (arms shooting out of a mattress), and pretty good makeup effects by Matthew W. Mungle. Standing out (relatively speaking) among the cast is the attractive and appealing Lisa Erickson as Julie. Overall, the movie is watchable if nothing special, but the last second twist ending comes off as just too predictable.If you're a genre completist who would like to see just about everything from the 1980s, then by all means give \"The Power\" a try; just don't expect too much.Six out of 10.","A man named Jerry comes into possession of an ancient Aztec doll.However this creepy little figure is possessed by an evil spirit,which takes over Jerry's body and pushes him to spill the blood...I have seen two other horror movies \"The Dorm that Dripped Blood\" and \"The Kindred\" made by Stephen Carpenter and Jeffrey Obrow and I must say that \"The Power\" doesn't disappoint either.The plot is slow-moving,but there are some effective human goo effects and a little bit of gore.The scene of a female tabloid reporter being attacked by arms that come ripping out of a mattress is a hoot.I liked this low-budget horror movie and you should too,if you are into 80's horror genre.8 out of 10.","I wasn't expecting much from this film, but was eager to try something which I initially thought would primarily be an early 80s teen horror. Although three teens are somewhat critical plot, it is by no means a teen horror film.'The Power' is about a little Aztec idol that exchanges many hands as its possessor (who must be adult and thus, 'corrupted') becomes the vessel for unleashing all of the idol's evil, and often with deadly implications for not only the victims of the possessor, but of the possessor himself. After making several exchanges in vying over control of this thing, three teenagers wind up finding it and can't figure out what it is, except that since they found it, strange and dangerous things are afoot. They offer to explain the situation to a news reporter who doesn't buy into the spiritual bologna. Although, it is her producer who wants to investigate further, especially if it means he can get control of the idol (I presume the teens are even not yet corrupted enough to feel the dangerous desires encouraged by the idol). It is a story told a thousand times, particularly in 1950s and 60s horror and science fiction fare.This one was at least, for me, able to sustain some interest. Though low budget, it was not done so obviously cheaply or loaded with bad acting as many of the low-budget, come-and-go horror fare of the earlier decades had (nowadays, they have the same cheesy qualities, but bigger budgets). We are spare enough of it to at least allow ourselves an opportunity to become at least a little bit absorbed with the eerie atmosphere and so forth, despite a story of clichés. And, though not terribly gory, the special effects were done nicely.Again, it is routine horror tale, especially with the ending (which by modern standards has become a device that is annoyingly overused), but one that is not so embarrassingly bad. It might be worth checking out, even if just for laughs.","Look, this is a low budget horror film that suffers from all of the problems that go with low budget movies. But you must see this just to watch Lisa Erickson as Julie. She is SMOKIN' hot and a great little actress to boot! These types of horror movies often unearth a rare gem and The Power gave us Lisa Erickson! Nothing I enjoy more than sitting down in my studio apartment with a Coke and putting in this film. My friends Bob, Bill and Dennis agree.. Lisa is not only brilliant, she is a hottie. The movie itself often plods along and the rest of the actors are not very helpful in that regard. But as soon as Lisa hits the screen, things really start hopping. The others are clearly not in her league. This is not the Exorcist but as I said, if you want to see a fun little movie with a hot little actress, this is the one to see!","If you remember liking the \"Friday the 13th\" TV series, with its basic concept of inanimate objects possessing the souls of their unsuspecting owners and eventually causing death and destruction, then this movie - about a creepy small Aztec idol - may be enjoyable for you. The special effects are not bad, considering the budgetary constraints, and there is also a pretty good shock ending. The problem is that you get to see the idol's power in the first few minutes, so you have to wait for the characters to find out (and argue about) what you already know. And some of the acting is pretty amateurish, too.    (**)","I like this film. During the early 80's these type of genre films were cropping up every other week, but this one i still remember to this day, so i watched it recently. The film has dated quite badly (like most straight to video movies of this era) although it's quite well made and acted and the gore scenes and special effects are carried out competently, considering the small budget it would have had. The story is not bad as well ; ancient Aztec charm possesses all who come in contact, with inevitable results. The ending also has a nice sting in the tail. Overall as far as eighties video fodder goes this could be called an exception !!","The directors duo Stephen Carpenter and Jeffrey Obrow released three divergent low-budget horror movies during the 1980's before their paths separated. Perhaps they really ought to have stuck together for a little while longer, as the quality level of their work improved with each film. Their first feature \"The Dorm that Dripped Blood\" is a horrendous and suspense-free slasher that is better left forgotten. This one – \"Evil Power\" - is a nonsensical but fun thriller about psychic possession and their last collaboration, entitled \"The Kindred\" and dealing with a genetic monster, even is a slick but heavily underrated mixture between horror and Sci-Fi. Maybe if they had stayed together, they would have fabricated some hidden gem of horror during the 1990's, who knows? \"Evil Power\" knows a promising and very exciting start, but sadly suffers from an overlong and dreadfully boring middle section. Pivot element of all the horror is a small statue made of clay, representing an ancient Aztec deity with a hardly pronounceable name. The statue provides tremendous amounts of power to whoever possess it. The only problem, however, is that the power isn't a very useful one The statue brings out your darkest side and eventually causes its owners to transform into horribly deformed maniacs. The little Aztec bastard comes into the hands of three high-school students that learn about its powers during a séance held at an old abandoned graveyard. They wisely decide to give the statue to a newspaper reporter for further research, but she's a firm non-believer of the supernatural. Her boyfriend Jerry, on the other hand, quickly becomes obsessed with the thing. \"Evil Power\" is well worth checking out in case you're a sucker for 80's horror nostalgia. The special effects, especially during the first ten and last fifteen minutes, are delightfully cheesy and gruesome. They're fairly well-handled for being a low-budgeted flick and include some gooey melting parts and impalement. The atmosphere is relatively sinister as well, with two memorable sequences in particular. One in the graveyard and the other in the remote Mexican desert. There are some massive holes in the plot and, quite honestly, it's a bunch of senseless nonsense, but I definitely don't regret watching this little-seen oddity of the early 80's.","I saw this film once somewhere around the year 2002, during a period in which I wasn't really in touch with the horror genre anymore -- Now hey, don't give me that look, a man's entitled to have other interests in life and explore a wider range of cinematic wonders, right? I'll admit I was much more into art-films/author-films and 'critically acclaimed masterpieces' at the time, so when I stumbled upon a copy of \"The Power\", I was amazed at how utterly bad this film was. Annoyed by all the ineptness is perhaps a better description of my initial reaction. But during the last five years, I've had myself regularly wallowing in horror obscurity again and have seen my fair share of irredeemable low budget rubbish. So I guess it was kind of inevitable that I would give \"The Power\" another watch at some point, to try and re-evaluate things. A friend of mine (also an avid obscure movie hunter in his free time) had not seen it yet. Reason enough for both of us to sit ourselves down and watch it over the weekend.For an early/mid 80's horror film, \"The Power\" has a mildly intriguing and not too unoriginal setup: Destacatl is believed to be an ancient Aztec demon able to control the dark sides of the human soul. According to pagan believes, his powers are locked in an Aztec idol, a little statue that looks like \"a Mexican salt shaker\" (a student at a lecture 'wittily' remarks). The best parts of this film, are actually the beginning and the ending. The first 15 minutes contain the awesome death scene of a professor who has been meddling with the evil powers of Destacatl, some native mumbo-jumbo in the desert and another cool killing of a graveyard caretaker. The whole middle hour has the statue coming into the hands of some students and nothing significant happens during that hour, aside from a lot of talking, attempts at investigating the history of the statue, things flying around in a student's dorm room and one guy concluding he'll be able to handle the powers contained within the idol. Of course he will be proved wrong, because this is a horror film. But all these goings-on are snooze material, really. Then, during the last 15 minutes of the film, the guy who thinks he can handle it inherits the Evil Power -- I never really figured out if it's the power that transforms you or if it's actually the demon Destacatl that possesses you -- and we're treated to a short but amusing stalk & slash routine in some house, featuring our two leading ladies vs. evil powered-up deformed guy. Plus, an amusing & typical horror-twist at the end.So you get the idea here, I'm sure. Cut out the middle section, and you end up with an amusing 30-minutes low budget short horror deformity. The low rent special make-up effects are bound to amuse any die-hard fan of the genre. But in the end, I don't even have to re-visit my initial conclusion from 8 years ago. It's still a bit of a task to sit through this B-movie, with the painfully uneventful mid-section, the inferior acting, the clumsy & rather pointless plot, etc. So I guess I still retain my sanity after 5 years of shooting up 'quality' B-horror drivel on a regular basis, since I'm not going to yell \"Awesome movie!\" and rate it like your average Stanley Kubrik film. The suffering may have gotten a bit painful at moments, but there were actually some benefits to this experience. For one thing, I learned about this interesting duo of genre filmmakers from the 80's, called Stephen Carpenter and Jeffrey Obrow. From the looks of it, these guys are really spirited genre lovers that started their careers by making films together. And their efforts got consistently better. Just watch their third film as a directing-duo, \"The Kindred\" (1987), and then compare it to this, \"The Power\", and you'll see what I mean.In the years following \"The Kindred\", Obrow & Carpenter both expanded their horizons individually, though still occasionally working together on genre outings. They collaborated on the pretty decent Dean R. Koontz adaptation \"Servants of Twilight\" (1991), with Carpenter scripting & Obrow directing. Jeffrey Obrow wrote and directed \"They Are Among Us\" (2004), which is a pretty cool little 'alien invasion' film. Reminiscent of the classics from the 50's & done in the spirit of the 80's (with regards to most of the special effects). \"They Are Among Us\" is actually a better film than most people seem willing to admit. Or maybe the wrong people have been renting it so far (or since it was made for TV, maybe it has been caught by too many people who normally don't watch this kind of stuff). Either way, worth a watch if you're into this particular sci-fi/horror blend. As a director, Stephen Carpenter re-visited the horror genre in 2001 with \"Soul Survivors\". Again a film not too many people seem to like, but regardless it had an interesting concept (recycled from the right movies, I might add) and was a modest hit on rental VHS/DVD at the time and it features an interesting cast of young talents too, such as Wes Bentley, Casey Affleck & Eliza Dushku. I wonder what Obrow & Carpenter might be up to these days... If they'd ever re-visit the horror genre in a collaborative effort again, I for one would sure be very interested to see what they would come up with.And then there's the whole notion of Aztec myths and their use in horror movies. It's basically another obscure sub-genre, but when you look into it, you'll be surprised how many films you can find revolving around such topics. Mostly sinister hard-to-find titles, so this opens up another path leading to yet another nether-region of horror history. A path I'll be most willing to try out some day.","Man comes in contact with an ancient Aztec figurane that is cursed by an evil spirit. The spirit takes over the man's body and begins a massive killing spree. Swift, fast paced horror film with it's fair share of shocks. This is one film where the low budget actually helps the move and gives it a more realistic feel. The special effects are even pretty good for this kind of movie. Rated R; Violence and Profanity.","The Power started off looking promising but soon became boring and tedious to watch. The plot is about an ancient Aztec doll that takes possession of those who own it. The idea is \"decent enough\" and this film would have been fairly entertaining had it been done better. However after the first ten minutes or so it soon becomes boring; we don't get any good death scenes and have to listen to loads of talking. At the end one of the possessed men meets his death by melting away in front of two girls, but it's not very interesting and definitely not gory.I wouldn't recommend The Power to any horror or slasher fan as there's little to be gained from it.","Low budget horror about an evil force.  Hard to believe in this day and age, but way back when this stuff actually used to get theatrical release!  These days this sort of thing would either go direct-to-video or straight to cable.  Shouldn't be too hard to avoid this one; who's ever heard of it?","Through a confusing series of events, a trio of high school teens end up with a figurine of Destacatyl, an Aztec god of something bad. They turn it over to tabloid reporter Sandy (Susan Stokey). Soon her friend Jerry (Warren Lincoln) is seduced by its power, turning into a misshapen monster of rage that, naturally, is angry she won't go out with him. This was the second feature from directors Stephen Carpenter and Jeffrey Obrow, after the slasher THE DORM THAT DRIPPED BLOOD (1982). Props to them for not delivering another slasher, but this is pretty so-so stuff. The set up is unfocused (four writers are credited) and you don't really get too emotionally involved in the characters. There are some nice FX by Matthew Mungle, also a DORM alumni, towards the end though. And Christopher Young contributes a score that is way too classy sounding for the material. After this they would go on to co-direct THE KINDRED (1987) and the Koontz adaptation SERVANTS OF TWILIGHT (1991) before breaking up as a team.","Yep, you guessed it, another deservedly obscure no-budget cheesy American horror movie which is almost totally worthless as a film. I usually don't mind watching these kind of films but I found myself unusually intolerant of this one, maybe because it's so tiresome. I don't really know how someone can make a film about a man being possessed by an evil Aztec doll uninteresting but the makers of this movie manage to. It's not that the film is lacking in action or that it's totally worthless, it's just so similar to a hundred others and the merit to be gained from watching is hardly worth the ninety minutes.The film does have a good beginning, I'll grant it that. It starts off with the usual stuffy college professor being heckled by his brain-dead class, but the twist here is that HE is possessed by the doll and causes one of them to have a major nosebleed. Soon afterwards he is levitated into the air by the presence and is gorily impaled on a flag pole jutting from a nearby wall. After lots more messing around in the dark and confusing plot points we are introduced to what look like the main characters, a trilogy of nerdy teenagers who decide to hold a séance in a deserted warehouse at night. This of course ends in death, with a security guard being crushed by a huge crate. It's all very unimpressive.The film's main characters (as if there weren't enough all ready - damn) are now ready to be introduced. First of all we have an irritating female reporter who is sceptical of the whole thing and also happens to be a really bad actress to boot. Her geeky boyfriend, however, takes an interest in the idol. Cue a possession which takes an age to actually get anywhere, lots of dialogue, and people wandering around in the dark so you can't see what's happening. It goes without saying that the amateur-style acting is bad, pretty much from the whole cast. There isn't a single character to care about either. The plot is clichéd and trivial and the film as a whole forgettable and worthless. The only thing good about it is the music, which at least manages to be spooky. The only reason horror fans would bother watching this is, I guess, the special effects and I'm sorry to say that they disappoint also.Most of the gore is saved for the finale in which a girl has her hand chewed by a waste disposal unit (ouch!) and a man turns into an ugly demon and pulses and disintegrates in what looks like a scene ripped off from the end of AMITYVILLE II: THE POSSESSION. Probably my favourite special effect in the whole film is when a boy sees all manner of objects on his desk being attracted to his Aztec doll as if by a magnetic force. A simple effect yes, but the simpleness and unexpected nature of it is what impressed me most and it's much more interesting than the tiresome yucky blood scenes. In any case give this no-hoper a miss or risk wasting ninety minutes of your life.","Three high school students obtain an ancient and dangerous Aztec idol. Pretty soon an evil spirit gets unleashed and possesses the body of a young man who steals it for his own nefarious purposes. Writers/directors Jeffrey Obrow and Stephen Carpenter relate the compelling story at a steady pace, do an able job of crafting a strong gloom-doom atmosphere, maintain a grimly serious tone throughout, deliver a few nice bits of gore, firmly ground the fantastic premise in a credible everyday reality, make nice use of funky practical effects, and pull out all the exciting stops at the lively climax. Moreover, Obrow and Carpenter warrant extra points not only for presenting believable characters who actually look like real people, but also for covering some inspired and interesting largely uncharted territory with the novel Aztec religion hook. The decent acting from a competent non-star cast rates as another major asset, with especially praiseworthy contributions from Susan Stokey as spunky newspaper writer Sandy, Warren Lincoln as the amiable Jerry, Lisa Erikson as the perky Julie, and J. Dinan Myrtetus as the obsessed Francis Lott. Carpenter's proficient cinematography provides a fairly polished look. Christopher Young's spirited shivery score hits the stirring spine-tingling spot. A cool little fright flick."],"review-user":["lost-in-limbo","Hey_Sweden","HumanoidOfFlesh","vertigo_14","greendevilrc","gridoon","max-renn-1","Coventry","Vomitron_G","brandonsites1981","Tikkin","MarshallStax","udar55","Leofwine_draca","Woodyanders"],"review-date":["20 August 2010","1 February 2014","11 January 2010","17 October 2005","4 March 2008","9 November 2002","16 February 2005","5 September 2010","6 September 2010","15 August 2002","16 April 2006","17 December 1998","10 September 2013","12 October 2016","17 June 2014"],"review-rating":["6","6","8","4","10","5","6","5","4","2","1","5","2","8"],"review-title":[" \"I have the power now\"\n"," Horror junkies might find it worth their time.\n"," Overlooked 80's low-budget horror.\n"," Mundane plot, but lacks most low-budget cheesiness...(spoilers)\n"," Lisa Erickson is brilliant!\n"," Acceptable horror film.\n"," Decent 80's horror video !!\n"," Aztec Power: it's useless & dangerous, but still you crave for it!\n"," Aztec Horror: An obscure sub-genre\n"," * * out of 4.\n"," Not worth your time\n"," Forgettable horror schlock.\n"," Interesting to watch the growth of Carpenter and Obrow\n"," A disappointing and derivative low budget US horror\n"," Nifty supernatural horror chiller\n"]}