{"review-url":["http://www.imdb.com/title/tt0053121/reviews"],"review-text":["This is undoubtedly the most harrowing black-and-white war film that I've watched; as a matter of fact, the only Western director during this time to remotely approach its level of intensity and sheer visceral power in his work was Samuel Fuller. By the way, I had attended a Kon Ichikawa retrospective at London's National Film Theatre in September 2002, but only managed to catch some of his work made between 1960 and 1973.The film is certainly as depressing as it's reputed to be; however, it also displays welcome touches of black humor throughout - the 'dead' man who wakes up to answer a querying soldier and promptly 'dies' again, the deliciously ironic shoe exchange sequence, a moribund eccentric telling the famished hero which part of the body he should eat, etc. Incidentally, the script was written by a woman - Natto Wada, the director's own wife!Ichikawa is a versatile and prolific film-maker whose reputation may not be as high as it was during his peak years (1956-65), but his direction here is often striking - the startling pre-credits sequence (the hero is violently rebuked by his superior officer for being discharged from hospital earlier than expected!), the death of a surrendering Japanese at the hands of a gun-toting Philippine woman, the bombing of a hospital (with the medical staff running away to save themselves, leaving the wounded soldiers behind to crawl out of the shack at their own limited pace), the automated march in the rain of the disillusioned soldiers (which also involves the afore-mentioned business with the shoes that, actually, recalls a similar scene in ALL QUIET ON THE WESTERN FRONT [1930]), a hill littered with the bodies of soldiers attempting to climb it, the finale, etc. Surely one of the film's major assets is the stunning cinematography of the unforgiving and desolate muddy landscape.The film is notorious for treating the taboo subject of cannibalism (almost 10 years before it became a staple of horror movies) but Ichikawa's approach is not only subtle but highly effective: the flesh is actually referred to as \"monkey meat\", while the hero is seen partaking only once (and promptly spits out the piece along with most of his decaying teeth!); conversely, when the weak underling soldier (played by Mickey Curtis who, despite his name, was a Japanese pop idol of the time!) rabidly indulges, the ground nearby is splashed with blood.In the supplements, Ichikawa remembers that Method-practicing lead actor Eiji Funakoshi (whose portrayal is unforgettable, by the way) arrived on the set at starvation point - with the result that production was forced to shut down for two weeks until he recuperated! Donald Richie's perceptive interview favors the nihilism of the film over the underlying patriotism behind such gut-wrenching recent Hollywood fare as SAVING PRIVATE RYAN (1998).FIRES ON THE PLAIN is universally considered to be one of its director's top efforts and, out of the several films of Ichikawa I've watched, the closest to it in spirit are THE BURMESE HARP (1956; another character-driven war film but with a spiritual tone, and which is also available on DVD from Criterion) and ENJO aka CONFLAGRATION (1958; which was actually given a limited theatrical showing locally, as part of a foreign-film week, a couple of years ago). Personally, I also have a particular soft spot for the director's stunningly stylized color extravaganza, AN ACTOR'S REVENGE (1963), which I've actually caught twice at the NFT in 1999 and the afore-mentioned 2002 retrospective.","This is probably one of the best examples of that film genre known as the anti-war movie. It is a story about a group a Japanese soldiers in the last days of the second world war,weakened,demoralized,and starving. The situation deteriorates even further when one of them resorts to cannibalism in an attempt to ward off hunger. As they shuffle their way through the jungle one notices their shabby appearance with their feet sticking out of their boots and a sense of resignation or futility about them. It has even an element of the absurd about it in one of the scenes when one of the soldiers pleads to a comrade to eat him. This portrayal of them appeals to one's sense of pity or sympathy regardless of what cause or nation they're fighting for. For their situation could be anyone's unfortunate fate if circumstances were unfavorable. If there is one thing this film can show or get across is that our sense of humanity or what makes us feel civilized, is but a thin veneer or facade that in the right or wrong situation can vanish. The stark truth as depicted in this movie is that we are only always a few steps away from returning to the jungle if given the chance. This reminds me of another movie\"Lord Of The Flies\" which was about a group of English schoolboys stranded on an island after a plane crash. After awhile they descend or regress into a bunch of jungle savages or barbarians losing whatever decorum or civilization they possessed.","In Ichikawa Kon's film _The Harp of Burma_ the company of soldiers led by Captain Inoue, although a bit travel worn and homesick, looked at least to be in decent health and well fed in the foreign environs of Burma. However, in his film _Fires on the Plain_ the Japanese soldiers stationed on the Island of Leyte in the Phillipines are malnourished, desperate men who are willing to do anything to survive The first scene in the film depicts Pvt. Tamura being slapped viciously by his superior. The superior is angry because Tamura returned to their regiment. a sufferer of tuberculosis, Tamura is unable to support himself and relies on the other soldiers, who can barely forage enough food for themselves, to gather food for him. Not wanting a dependent in their midst, Tamura superior sends him back to the hospital along with a few potatoes. Tamura does, however, have one more key item in his possession: a hand grenade. If he tires of living or is unable to, Tamura is to kill himself with the grenade. The grenade appears several times in the film. One can almost see the gears turning in his head, an inner struggle whether he wants to live or die. However, each times he decides to keep trudging along.Tamura does in fact arrive back at the hospital, but of course he is refused. The doctors will only let men who are very near death to stay in the hospital. Tamura, unwanted in his own camp, decides to stat with a group of stragglers who have also been cast out of their respective companies. Tamura is able to make friends with these individuals at least until the Americans begin bombing the area. The doctors leave the patients, first taking all the food, to be blown up in the bombing, and Tamura and friend are separated to the four winds. Tamura continues his travels and eventually arrives in a small village where he kills a Fillpino girl who would not stop screaming. He also tries to kill her boyfriend, but he runs away successfully. Tamura begins to care for the wounded girl, but pushes her out of the way when he discovers a hidden cache of salt. He soon continues his journey to no real destination. _Fires on the Plain_ is a brutal film which depicts the remnants of the once powerful Japanese army struggling to survive, but without any hope of ever being truly rescued. These soldiers just want to live for a few hours longer, their primal instincts to survive much stronger than dieing in service of the Emperor. A will to survive that will even make some of them eat \"Monkey Meat.\" However, even in this bleak film there are some signs of humanity. Tamura although tubercular and emancipated willingly shares his few rations and his precious salt even when he has little. There are moments of semi friendship between Tamura and the stragglers, and also between Tamura and another soldier named Nagamatsu, however, the outlook is bleak for our pleasant spoken Tamura. Based on a novel written by Ooka Shohei.","This is one of the most anti-traditional war movies about was I have seen. Instead of the typical films that stress glory and perhaps super-human characters (like John Wayne), this film is the exact opposite--stressing the de-humanization that ALSO happens in war. The story concerns the Japanese who are stranded in the Phillipines after the US returned in late 1944-early 1945. By the time the movie begins, the Japanese have clearly been beaten but because of the insane logic of Bushido, they cannot allow themselves to consider surrender. At one of many poignant moments, the lead character is told at the beginning of the film to report to the hospital since he isn't capable of fighting due to his TB. The problem is that the hospital won't accept him, so his commander tells him to once again go to the hospital--and if they won't accept him he should blow himself up with a grenade! Well, this happens just in the first five minutes of the movie--a lot worse things befall this soldier and the few stragglers because they won't surrender yet they are starving. Plus, there is a case in the movie where a soldier DOES try to surrender but is gunned down. This happened a lot later in the war because so often the surrendering Japanese soldiers booby-trapped themselves to blow up when they came near. In addition, the film shows the most vivid depiction of starvation and the accompanying madness of any film I have seen. In addition, cannibalism, cowardice and betrayal all accompany this very gritty, realistic and depressingly realistic film. You simply couldn't have made a better film of this type. Horrible but great because it IS war--not a sanitized Hollywood version of war.","Every American who thinks he or she understands World War Two should see this movie. Few Hollywood films about the war have defied the stereotype of Japanese soldiers as emotionless brutes obeying orders without thinking. We like to think that every Japanese man was ready and able to fight to the death, right up to the day we bombed Nagasaki. \"Fires on the Plain\" shows a different reality: troops pathetically undersupplied, demoralized and starved to the point of cannibalism. They euphemistically refer to human flesh as \"monkey meat.\" The movie and novel on which it was based also put to death the myth that Japanese soldiers all preferred death to surrender: They had good reason to believe that their enemies were in no mood to take prisoners. To me it raises a question most Americans would rather avoid: If the Japanese military was so beaten down at this point in the war, why was it necessary to nuke Hiroshima?","\"Nobi\" or \"Fires On the Plain\" is a film that is so excellent on so many levels, that not enough good things can be said about it. My only regret is that I was not able to see this 1959 film sooner.Being something of a film purist, I tend to look at films for their artistic merits based upon dialog, acting, photography and even the efforts to remain true to the period in terms of costume. Ultimately, I want to know if the film is \"truthful\" enough in revealing the human condition to make me think without oppressing me with what the director wants me to think.\"Fires on the Plain\" is a great film because it crafts a portrait filled with realistic human reactions to the dying fires of a great historical catastrophe.Ichikawa's film is a condemnation of war on all levels -- as any good war film should be. War is horrifying, bloody, destructive. It is also murderous on the psyche. However, what is fundamental about \"Fires on the Plain\" is its unapologetic look at the Japanese soldiers. It shows them slowly collapsing under the weight of superior American firepower and their nation's inability to wage a war of its own making. A fatalistic code encouraging death before surrender is at the heart of this madness.I was astonished to see such an honest and brutally close look at the bitter fruits of Japan's military misadventure made just 14 years after the end of what the Japanese call the \"Great Pacific War.\" Ichikawa, reveals what the Germans called the \"war life,\" the plight of the common soldier.Ichikawa's film is interesting, since even today Japan is having a hard time fully coming to terms with its wartime fanaticism, its subjugation of conquered peoples, the racism of its war against the Chinese and war crimes which included cannibalism by soldiers and officers practiced not only against one another, but against Allied prisoners of war.Ichikawa produces a stark representation of the victimization of soldiers by a confluence of bad political decisions and cultural pressures.This stark examination is skillfully done by portraying the doomed soldiers as human beings who exhibit, at various times, fear, brilliantly laconic humor, dialog enriched by its sparseness, and a plot whose complexity is belied by the grim, wilderness setting.Ichikawa's portrait is a ragged and painful tapestry of defeated men. The tubercular Tamura, played as a woebegone and gentle soul by Eiji Funakoshi, is a good soldier who can't abandon his humanity, though he is as frightened and lost as his comrades. Before he departs for a hospital that will reject him as too healthy, Tamura is given a hand grenade by a superior who, recognizing the hopelessness of their situation, advises Tamura to kill himself.Why Tamura's hopelessly ill-supplied and militarily incapable unit was not ordered to surrender at the start of the film is telling. Ichikawa makes it plain that the war is over and everyone is merely waiting to die. As Tamura leaves his unit for his hopeless search for physical and spiritual salvation, he sees his comrades pointlessly digging an air raid shelter. They appear like corpses looking up from their own mass grave.We later watch as the overworked hospital's medical staff abandons the dying patients to an all-consuming American artillery barrage. The pathetic patients, who crawl from their huts in a vain attempt to survive, appear like pathetic, serpentine creatures dragging themselves from an omnipotent force. You know they won't survive.Ichikawa makes it plain that the only thing worse than a defeated army is one that has lost its honor by abandoning its humanity and its comrades. As Tamura staggers through the jungles of Leyte we encounter the noble, the dying and the exploitive. Cannibalism rears its ugly head as soldiers begin to eat one another rather than surrender to American \"corned beef.\"When the men do talk of surrender, the propaganda of how Americans kills prisoners is countered by a worldly-wise soldier who reveals that the approaching Americans feed and care for prisoners of war because they, unlike the Japanese, respect brave soldiers who are forced to give up.It is the Japanese who intend to die fighting for the Emperor long after resistance has lost all meaning. Those willing to fight to the death will be killed. It is the calculus of war.After shooting a murderous and cannibalistic comrade, whom he earlier offered his own body to as food, the fatalistic Tamura's careless surrender also seems to be an intentional form of suicide. His death is a lonely image. Was Ichikawa trying to tell us of the internal conflict of the ordinary soldier who wants to live, but who is still trapped by his nation's suicidal cultural codes?If someone watches this film carefully, he or she will see that absolutism and fanaticism is the enemy. The Americans are portrayed as a technologically advanced people willing to employ that technology in the form of inexorable military power -- a lesson that transformed Japanese postwar society. Ichikawa's film isn't so shallow that it indicts America. Ichikawa indicts the sedimentary layers of Japan's destructive policies that created the war and then to continue it when all was lost.Ichikawa does not mention the nuclear weapons dropped upon Nagasaki and Hiroshima. He doesn't have to. The slow-motion destruction of the Imperial Japanese Army in the Philippines reveals the seeds of Japan's immolation.","The main achievement of this film is that though racially unipolar, the film still manages to carve out a tableaux of war portrayals that leave a lasting identification with whoever may view it, and whoever was present at this time. Though good films may have the ability of universalizing their subjects, which is often a hard thing to do; great films have the ability of universalizing their unipolar subjects, which is what this film does.Instead of carving a context of unity, the film depicts the Japanese in the sick finality of the Phillipines war-front in February, 1945, making signs for pacifism or war, but rather making signs of the feelings, death, destruction, victory and sickness of war with the bloody hands of the defeated.Far different, and superior, to films such as Apocalypse Now and Full Metal Jacket, both which needed a satirical methodology of trivializing and depersonalizing the American troupes, and using all races as one struggle, which is fine, yet not as grand as a film that uses one race and view, which would look fascist if created in America, to convey the horror of war and show what it is really like.The only way the main character makes it through this movie to the end, is by being sick, thence inedible; hence through this character, through his sickness, his saving face, we see the end of WWII in the Phillipines in February of 1945, and the way in which the Americans, Japanese and Phillipinians came together in bloody acts of warfare where you live to die.The film is patently influenced by a neorealist way of filmic portrayal, which is original and beneficial to a viewer, whether then or now, for the neorealist techniques it employs conveys all the horrors of war in pictorial form, whether a showcase for pacifism or 'militaristic responsibility'. Like Germania Anno Zero, by Roberto Rossellini, a story emerges from the environment and the conditions associated with it.The film's opening, with the two-way discussion between the two Japanese soldiers, prefigures and reechoes the events. Through this opening we feel that the struggle is human against human, and human with human; it shows that they relied on each other to face the enemy in the past battles, but now, in this opening, or 'pivot' of the experiences of the Japanese in the Phillipines, new information is relayed to the main character Tamura, giving a presentiment of a cannibal reliance on one another if they wish to survive.The jungle is gritty, wet and thick, and the sky is not infrequently cloudy and pouring. We wade with the stragglers though puddles and marshes, as sick as the land around them. Nameless cadavers are strewn everywhere. Every now and then one can not tell if they are bodies, rocks or corn. Apparently there is no difference here, all is dead and sick. All is dying. All they have lest to feed upon are rare monkeys and dead bodies of fallen comrades and/or nameless enemies.Often Tamura meets a fallen other near death. Though crushed in spirit, and crushing his, some offer up their bodies for him to eat, but he refuses; he still, like Hiroshi Kawaguchi as Nishi in Giants and Toys, will not droop into the death of dignity and Japanese morals; for this is all he really has to hold up for his survival, a dignity of self. Hence, when Nagamatsu is dissecting a soldier for consumption, he shoots him because of it. Tamura may be used to the killing, but to the sickness of killing and pillaging he can't decipher. He is neither a good man or a bad man. He wishes to survive, but will not go the extra mile beyond simple straight-war-killing. His self belonged dead on the battlefield, he isn't happy here to wade and wipe the weak for his survival.The sickness he carrys he sees everywhere, in everyone; and sadly he lacks the ethical rationale of thinking either thinking entirely about others, since he can't give up his body for them since of his contagious malady, or thinking entirely about himself, since he sees the sickness in everyone, though still killing them even if they do no harm. Seen in his attack on the two Philippians's in the hut. He can't see anyone. No one can see anyone. The only see an aversion from malady and an adversion to health, the heart of survival instincts.Often, an arm appears pointing to the left of the screen, towards what must be hope, for there, in that far Thule lies their freedom. Yet it is blocked by American soldiers, leaving the Japanese stragglers to slowly die in this disconsolate dirt. Even a church tower appears, reflecting the light off an unseen sun. But on closer inspection crows flutter wildly about it; religion too is an air of poison.Nobi, the Japanese title of the film, gives more evidence to the themes, or feelings of the film: the servitude to fate, the heaviness of existence under leaders and lives controlled by others. Its proper Anglophone translation has a subject of heavy debate among historians, as non-Koreans translate it as \"slave\" and \"slavery\", while many Koreans argue that nobi was not a slave system, but a servant class system that does not meet the criteria for slavery. A way to typically to escape wrenching poverty. This improves upon the war theme, and symbolism of soldiery.Isn't it important at the time period to ask ourselves what the purpose is of what will become our won history? Should we be comfortable of letting it unroll without conscious effort for change? Is it not who we are fighting, that age old history question, but rather why are we fighting? Fires on the Plain is with Eiji Funakoshi, Osamu Takizawa, and Mickey Curtis; based on a novel by Shohei Ooka. In Japanese with subtitles.","I recently saw \"Nobi\" (\"Fires On the Plain\"), for the second time. Of all Ichikawa's films, and most of his films - (the ones I've seen), even \"Tokyo Olympiad\", has a strong thread of despair running through them. This is one of the few films (especially as its from the Japanese perspective), that deals, uncompromisingly, with how ordinary soldiers deal with, and are prepared to go, to survive a war where no prisoners were taken. It's a depressing film, but it should be seen by all the people, especially the Generals and Politicians, who think war is an heroic endeavour.","A harrowing masterpiece on the sheer madness and despair of war, Fires on the Plain (Nobi) is not going to be to everybody's taste: this is a war movie in the truest possible sense of the term, one that resorts neither to flag-waving patriotism nor saccharine sentimentality. Nobi cuts deep, it's ugly, tenebrous and bleak as few things ever committed on celluloid will ever be. This is war behind the cannons, with no triumphs or heroes, no moral victories or defeats to be had, just a handful of gaunt and terrible-looking men strewn across a land ravaged by war like penitents fleeing a great disaster. The characters defy moral judgment because they are creatures beset by a great woe, a woe that does not permit questions of a moral nature. War and survival. Pitting one's will against the other's in a battlefield arena. The loser is simply removed from existence.Tamura, soldier in the Japanese Imperial army, is discharged from his platoon and ordered to report in a nearby hospital on account of him coughing blood and being disliked by the rest of the platoon. He's told to never come back and instead commit suicide by hand grenade in case the hospital rejects him. Which it does. The hospital is nothing but a shack made of wooden planks and the hospital surgeon simply tells him that if he's capable of walking he's just fine. It is in that shabby excuse of a hospital that one of the most harrowing scenes of the film takes place. As the area is carpet bombed by American planes the doctors and those who can walk and sustain themselves flee from the hospital and into the woods. Moments before the hospital is blown to pieces, the gaunt and crippled figures of the sick and injured crawl out of it in every manner of posture, dressed in their sickly white robes, as if the building is some kind of beast spewing viscera and filth out upon the earth.That is Nobi's greatest success; the stark and brooding depiction of the suffering of war in simple but evocative images, without melodrama or pseudo-heroism. Soldiers cross a marsh, wading knee-deep in mud, move across the opposite bank and into a field only to discover enemy tanks hiding in the woods, their lights shining like malignant eyes as they scan the dark. A procession of injured soldiers, dirty and half-mad, crossing a road, dropping to the ground on the sound of enemy planes. Buzzards feasting on a pile of dead bodies. An abandoned village. A mad soldier that believes himself to be Buddha sitting under a tree, covered with flies and his own excrement, offering his arm to be eaten by Tamura when he's dead. These are the images Kon Ichikawa conjures for our eyes, merciless and unflinching in their poignancy but honest and raw.Nobi doesn't rush to get somewhere. It is content to follow Tamura's travels through the war-torn land as he tries to reach the regrouping center of Palompa, and observe the madness and obscenities of war. The movie wades through the sludge of the horror of war, slow and brooding, just like the characters it follows. The final thirty minutes with Tamura taking refuge with two deserters who feed on 'monkey meat' are the closest Nobi comes to adhering to conventional narratives and they're no less powerful for that matter. Strikingly photographed in black and white, with great performances from the cast, and Ichikawa's assured direction, Nobi is not only among the best war movies to be made but also among the finest of Japanese cinema.","I got this movie out a week after the death of Ichikawa Kon - I suppose if there is one way to mark the passing of a great director, its to raise a glass of wine to him while watching one of his greatest movies. Ichikawa had one of the finest careers in Japanese film, but as he never had a distinctive style or theme he often seems to be overlooked compared to his near contemporaries such as Ozu and Kurosawa (he was a little younger than them, but not by much). He is one of those directors who defies auteur theories - its likely that his wife (who wrote the screenplay for this and many other of his movies) was as much responsible for the quality of the movies as he was. But at his best, he was as good as any Japanese film maker at the time. In particular, he had great technical skills, allowing him to tell complex stories in an accessible manner. But in terms of theme, this movie could hardly be simpler - war is hell. No really, its seriously hell.Fire on the Plain doesn't follow the normal war genre rules. There is no real beginning - we start as the wretched Tamura, who is a regular private (although it is implied he is more thoughtful and educated than most of the others - at one stage it is shown he understands English, but he clams up when the others ask him how he knows it) is ordered to hospital, as his unit is already in an appalling state. The soldiers are defeated and starving to death. They are no longer an army, just a rag bag group of refugees - hunted by the locals, and pretty much ignored by the Americans, who have bigger fish to fry. Hunger and despair is driving the soldiers to the edge and beyond of madness.In typical Ichikawa style, its not all just grim - its oddly funny in parts (a very black humour of course).The high points of this movie to me are the outstanding performances from the leads and the vivid photography. The characters, in all their humanity, but also their complete loss of humanity, are all too believable. This is that rare film - one which will refuse to erase itself from your head, even if you want to forget it.","Fires on The Plain (1959) ****You don't see films like this anymore. 'Fires on the Plain' is an incredible depiction of the lives of the soldiers of the Japanese Imperial Army. Kon Ichikawa's masterpiece follows Tamura, a soldier with Tuberculosis as he wanders around the Philippine landscape in the last year of the war. He is sent away to the hospital by his commanding officer only to be refused treatment and so he is sent back. His CO tells him to go back and if they refuse him again then his last order is to kill himself with his grenade. He is refused again, but meets up with a band of squatters sitting outside the hospital. The next day they are shelled by American troops and Tamura flees, choosing not to kill himself, and from there he wanders from place to place trying to get to Palompon. He discovers that some men have been eating human flesh in order to survive, while others trade as much tobacco as they can for whatever they can get back.The film is filled with a quiet sense of desperation and desolation, with a hint of insanity. Everyone we see is skin and bones, covered in dirt wearing torn and tattered rags. Ichikawa uses his camera to catch some beautiful shots of the destructed landscape and the Japanese soldiers who walk it. Kon Ichikawa was famous in Japan for making many comedies and satires, and there are moments in Fires on the Plain that are bitingly hilarious. Take for example a shot of what appears to be a dead man lying face down in a pool of water; a soldier walks but and asks himself aloud if that is how they will all end up, to which the man lifts his head out of the water and replies \"what was that?\" and then drops his face even deeper into the puddle than before. Another hilarious sequence involves one man finding a pair of boots along the trail. He takes the boots, replacing them with his old ones. Another man walks by and sees that pair of boots and switches up for his old boots. The scene continues until finally Tamura finds the exchange spot and examines the boots left without hardly any sole. He looks carefully at his own and at ones on the ground, and deciding that they're both kaput he removes his own and goes barefoot. The film is filled with incredible scenes, one after another. Like Mizoguchi and Kurosawa, Ichikawa knew how to use his camera to paint beautiful and stunning pictures. There are many stunning shots of men in barren empty plains surrounded by nothing but smoke in the air and dead or dying bodies on the broken earth. There is another incredible scene where dozens of Japanese soldiers attempt to cross a road guarded by Yanks in the middle of the night, all crawling on their hands and knees as the camera watches on from above. The film gets its name from the columns of smoke rising up from fires on the plains seen throughout the film. They represent to the soldiers life a little more ordinary; the lives of Japanese farmers back home burning husks of corn. Their beacons of hope for the normal life however are in hostile hands.The film caused a stir in its day with its graphic content. Much emphasis is placed on the horror of war, not just with the enemy but within your ranks and yourself. Kon Ichikawa's Fires on the Plains is an incredibly authentic and moving, and somewhat disturbing, portrait of the horror suffered by the men making up the lower ranks of the Imperial Army. Clint Eastwood's Letters From Iwo Jima, while it is a very good film, comes nowhere close to realizing the horror of war depicted in Fires on the Plain. (Eastwood was no doubt influenced by the film, seeing as he claims to be such a classic Japanese film buff.) Many war films show that war is hell through the eyes of the winners. In Fires on the Plain, we're shown that war is even more hellish when you're on the losing end 4/4","Kon Ichikawa had lived through world war two, and saw what its effects it had on his people in Japan. But so did novelist Shohei Ooka, whose book was the inspiration for Ichikawa's film, Fires on the Plain. It's a film about the men in this war, or perhaps more universally in wars in general, who lose their humanity. The soldiers trudging along through these fields and jungles of the Philippenes in this story are almost completely without hope, if not already just that. It makes Stone's Platoon look like a picnic: at least they had certain things, like food, after all.They have little to no reserves or supplies or ammunition, no back-up, no sense of anything going their way in this combat that they've been thrust into. They can't even get some proper hospital care, unless if they can no longer walk at all or have lost limbs (for example, say, if you have TB, you're on your way). But its really through the prism of one soldier, a private Tamura, that we get a full sense of the futility of war, both in its bleak scenes of nothingness and boredom and decay, and those flashes of intense and brutal violence.In the film Tamura just wants to get some medical care. This is right at the start, and his told by his superior officer- already he is with eyes that stare off and an expression that has been drained by years of battle- that he will die if he doesn't find a hospital. He doesn't, really, but does end up in with some soldiers: at first with a platoon that seems to sort of have their act together, but is really led on by a power-hungry brute who just wants Tamura's stash of salt, and then later with two other stray soldiers who are part of a group that had previously been ambushed while crossing a road at night.The story isn't entirely a straight line, but it doesn't need to be. Tamura's path in Fires on the Plain is told in vignettes, little stories like when he comes upon a seemingly deserted enemy village. Two of the populous comes back to get some supplies, and Tamura sneaks up on them. It's an excruciating scene, since so far with Tamura we haven't seen him do anything outright *wrong*, but he does so in this scene, not even so much out of evil but out of fear and desperation (this is also, without spoiling it, how he gets a stash of salt). Little scenes build up so brilliantly and with devastation, like a simple task of finding a pair of walkable shoes, which there seem to be none. Or when Tamura, later in the film, discovers his teeth are becoming torn apart and falling out from lack of total hygiene. So much for food, so it goes.It should also be mentioned that this is a hauntingly realized film from Ichikawa, shot in a stark black and white view of the fields and woods, the cinematography filling everything we see in black-blacks and white-hot white. Ichikawa also makes sure to get everything authentic from his actors, not simply emotionally but with their own emaciated look and looks of desperation right on them. It's as if Ichikawa has to have them all surviving the film as well as characters surviving out in the wild; by wild, by the way, I mean also cannibalism. The shock of this is two-fold; first is the way that a soldier says half-jokingly early on about eating other soldiers to Tamaura, who asks if it was true and only in response getting a \"don't ask\" word of caution, and the second with the depiction of cannibalism itself, from the crazy starving man on the hill who pulls out guts out of his lap and says with a straight face to our hero that \"You can eat me when I die.\" This makes thing especially more brutal when it comes to the director filming the brief 'action' scenes. These are, I would argue, more brutal than 'Private Ryan' in their depictions of violence in battle, the carnage that is completely random. A scene I would point to, and that contains just a shot that is excruciating to watch, is when from a high angle we see a group of about twenty soldiers walking slowly along, a hail of gunfire comes that kills only four or five, but it just happens so fast, and the soldiers just keep walking along at the same crawl. This isn't the only shot of horrible carnage that's shown - when needing to be bloody its there, but splashed across the screen like something completely of the macabre - but it drives the point completely.All of the acting is staggering (Funakoshi especially, who looks to be both most at peace and most horrified by what he sees in the subtlest of looks most of the time), all of the major set-pieces provide something else to the gruesome experience, and it all amounts to the ultimate question with an anti-war film: how can, or why, do people fight in wars like these? It's almost too depressing to put into words, and so Ichikawa pushes our noses right up into the muck and filth and blood and demands for us to take it in, so maybe, some day, it will never happen again. Or one can hope this, by the end of such a bleak and great film as this.","One person wrote: \"To me it raises a question most Americans would rather avoid: If the Japanese military was so beaten down at this point in the war, why was it necessary to nuke Hiroshima?\" This question is really a comment which reflects a certain pre-disposition. One answer is: because Japan had not yet surrendered and stopped fighting.However, if the Japanese military was so beaten down at this point in the war why didn't the Japanese leaders stop the fighting and stop the suffering by stopping the war? This criticism of the atomic bomb fails to recognize that no one knew in August 1945 when Japan would stop fighting. Also this approach seems not to recognize that even without an atomic bomb the fighting and dying would continue as long as the war continued, not only in Japan but in China and elsewhere. Even another two months of war (and conventional bombing and blockade) would have killed more people than died at Hiroshima AND Nagasaki combined.a friend of DF NY","When people think post-war Japanese cinema, they automatically think of Akira Kurosawa. His exported samurai epics have done a good job creating a sense of history, nobility and grace among the art cinema crowd. Yet arguably more important to Japan's unique cinematic history during that era, are the humanistic war stories brought to life by the likes of Masaki Kobayashi, Nagisa Oshima and Kon Ichikawa. Comprising a portion of the Japanese New Wave, these war dramas challenged their viewers head-on, illustrating the ugliness of war in all it's absurdity and horror. These movies were noble in their own way by angrily confronting the attitudes tolerated by Japan during it's peak nationalist period. Fires on the Plain is just as incendiary as it's title would suggest and serves as a prime example of such a film. It may also just be the most engaging and accessible war tale Japan has ever produced.Set during the closing days of Japan's dominance in the Philippines, our sick, fatigued and jaded hero, Private Tamura attempts to survive the on-coming slaughter. Tamura is forced out of his unit due to tuberculosis; if he's not well enough to dig trenches than he's useless according to his superiors. He treks to the hospital just past the hills only to be rebuffed by the hospital who tells him if he can walk, he's not sick. Before he can return and presumably commit suicide via grenade, Tamura's unit is wiped out in a fierce battle with allied forces. He then wonders aimlessly through the countryside staving starvation, fatigue, death and worse still, fellow brothers in arms.If Kurosawa is considered the Spielberg of Japan than director Kon Ichikawa is it's Martin Scorsese. Known less for an all-permeating thesis that seeps into his oeuvre, Ichikawa gives his work an idiosyncratic style and a visceral veneer. Throughout his career Ichikawa was known for taking on all popular genres, all of which balanced his knack for realism and expressionism. His worlds always have a beautiful wholeness and lets the pathos from each situation dig into the audiences cranium through all sides. Sometimes he accomplishes this with shock, other times with a mischievous sense of humor. One such iconic moment happens in Fires on the Plain when a platoon of soldiers march upon a pair of jungle boots. One soldier swiftly puts them on and discards his own, the next soldier takes the previous soldier's boots, and so on and so forth until Tamura looks down on the tattered remains of the last guy's boots, takes his off and keeps walking barefooted.There are many more scenes of contradicting sentiments occupying the same earnest frame. We as the audience must decide whether we should laugh or cry or both yet we never feel the need to look away. There's a dark sense of realism that makes Fires on the Plain stand out from other contemporary works such as The Human Condition Trilogy (1959-1961). The realism, tinged with an expressionistic flare keeps us engrossed; pensively hoping Tamura and his fellow soldiers don't do the unthinkable.As things become more desperate and deprived on the island of Leyte, the true intentions of the film start to soar with devastating economy. The film was adapted from Shohei Ooka's novel of the same name. Much ado was made at the time about Ichikawa's radical ending change which is surprisingly antithetical to the traditional Hollywood ending we're all so drearily used to. With Ichikawa's ending however there is no absolution, no completion, no sigh of relief. Much like All Quiet on the Western Front (1930) the film's resolution comes with a simple message about the inhumanity of war.Fires on the Plain is a frightfully good film that tells it's story through imagery both stark, maddening and sublime. Powerful in every sober sense, Ichikawa should be on everyone's short list of most important Japanese filmmakers. He's got a style full of contradiction yet permeating with an excess of feeling. I promise that once you've seen this provocative, bleak, heart-wrenching picture, you won't soon forget it.","My first Ichikawa in many years, and the first of his war films that I've seen, this was gripping and brutal from the very get-go. In the very first scene, nominal hero Tamura is told that he can't continue on with his unit, to which he has returned from the hospital. He apparently has TB  but he is not sick enough for the hospital to take him given the quantity of war-wounded they have. But his old unit won't take him back either; his CO gives him a grenade, and tells him that if he feels truly hopeless to blow himself upit's the honorable thing to do.The Phillipines, 1945, and the situation really does seem hopeless, for PFC Tamura and everyone else. Nobi is an odyssey through hell, or rather hells  denuded forests, dead rocky plains, and the dead and dying Japanese soldiers hoping just for an end, through peace or death. Ichikawa's film is photographed in stunning B&W scope which serves to highlight both the desolation felt by Tamura and those he meets on his journey towards his doom, and to show how truly small and naked they all are amidst the immensity of the mountains and the forests.this small affair of humans will end soon, the earth seems to be saying, but I will survive and barely notice it.Tamura travels back towards the hospital, but is (not surprisingly) rejected there, and spends the rest of the film trying to stay alive, stay human, and get out of danger. He doesn't manage to do very well on any account, slowly starving and eventually committing some fairly repellent acts. Eventually he hooks up with two other desperate men who have lost, or survived their units, and have resorted to cannibalismand in his weakened state facing other armed men, finds that the only way to live is to break with everything that he believes in.Ichikawa's film is as brutal, uncompromising and intense as any war film I've seen. There are moments of humor and tenderness, but they are fleeting and don't stick in the memory such as the scene with the man on the mountaintop who practically begs Tamura to eat his fleshthe recurring black-comic bit with Tamura exchanging his ragged shoes for the better leathers of a fallen comrade.the degradations that humans will endure to survive.the truth that this is any war, all wars, all mankind as long as we continue thus. A masterpiece that I probably won't watch again for a long, long time. Watched via the beautiful Criterion Collection DVD.","This is probably the greatest war film and certainly one of the greatest films. There's no sentimentality, no patriotic agenda, not even a hopeful message of universal brotherhood in this bleak glimpse of what we can only call hell. It's this quiet rigor and lack of manipulation that give the film its astounding power. There aren't any attempts to make a hero out of Ichikawa's protagonist Tamura either. He's just a poor doomed sap trying to stay alive in a world of horror who hopes, but isn't sure, he can hang on to his humanity in the process. Ichikawa's fierce lack of cant and illusion make Fires on the Plain stand alone. Ichikawa died February 2008.","This film is a knockout, Fires on the plain referred to is, (the burning off at the end of harvest time) A happy memory for Tamura, He relives this in his mind many time's,and at the end of this bleak film, Like a man dying of thirst, he believe's he is home and this last illusion is all he has left. Billy Wilder's The Big Carnival (Ace in the hole) is the only film (that comes to mind)that is as bleak as this little masterpiece by Kon Ichikawa. While I think the whole film is brilliant Two scenes that come to mind are when a platoon of Japanese soldiers trying to escape (Crawling on there belly's)are ambushed by Americans and massacred,True Horror, And as an American soldier and a pretty Philippine Girl soldier are having a cigarette on the side on the road, she smiles as she flits with the yank,then her face Changes to rage as she see's two Japanese soldiers trying to surrrender, she grabs a gun and kills them with joy, The American soldier attempts to stop her but has no chance , to me this speaks volumes at the atrocity's committed by the Japanese in the Philippines, all in all a great film if you have the stomach for it.","I saw this in 1993 on a VHS tape but have been unable to find it at any source since. This is a very bleak and uncompromising look at the last days of the Japanese Army in the Phillipines. Anyone with an interest in the Pacific war would do well to view this film and see what conditions the other side fought under.From what I can tell, this is historically accurate, and depicts how easily men can descend into complete barbarism. I understand the Japanese Army was completely cut off from any re-supply in the Phillipines by 1945, so there is no doubt many of the horrific incidents depicted here happened. I might not have been able to identify with the film's characters, but I appreciate their humanity and struggle to survive. If I had to compile a list of the ten greatest war films, this film would be on it. See it if you can get it.","This depiction of forlorn Japanese forces in the Philipines is a tour de force in the utter meaninglessness of war. It is an effective representation of Japanese pacifist views after WW II. In the movie, Japanese soldiers have been left to fend for themselves in the jungles of the Philipines. Faced with impending starvation they resort to cannibalism and gradually lose what little humanity they have left. To call this film depressing would be something of an understatement. The viewer is left with an utterly despairing sense of life's lost value in modern combat. The final scene is almost too nihilistic but the film is a worthy statement none-the-less. Highly recommended.","Viewed on Streaming. Restoration = ten (10) stars; cinematography = nine (9) stars; subtitles = eight (8) stars; score = seven (7) stars. Director Kon Ichikawa provides a grisly series of scenes depicting the hell of modern warfare for the abandoned, losing side as WWII is ending. The story, as such, is set in the Philippines (but exteriors are filmed in Southern Japan) and depicts three soldiers whose paths often cross while each is left to his own devices desperately trying to survive (moment-to-moment) and escape starvation. These protagonists are defeated and sick/injured infantrymen no longer (if ever) heroic or patriotic, but simply draftees looking for a way out of hell be it via: surrender (depicted by the Director as not an option offered by the Americans); suicide (often shown); or POW camp if found wounded, but still alive by American medics (suggested by the Director). There is another option: indefinably hiding and surviving on \"monkey meat\" in a jungle where there are no monkeys. The photo play is not so much a story as a strung-together collection of statements on the horrors of war in a semi-documentary format (see below). Here and there a bit of black humor emerges. Even in this hell hole, some culturally inculcated Japanese traditions survive, as depicted by Ichikawa, such as a semblance of politeness between those of the same (or unknown) rank. The three leading actors deliver excellent performances. Actor Eiji Funakoshi is a standout with \"unusual\" facial expressions that add greatly to the feeling of expect-the-unexpected as events unfold. The Director occasionally resorts to voice over for scene \"clarification,\" but this low-cost expository crutch seems to diminish rather than enhance. The movie could benefit from some judicial re-editing. It is a bit too long, and drags now and then. Re-editing might also allow the impact of the film's war horrors to progressively build rather than continuously run flat out. (Viewers can become desensitized to subsequent war horrors having been exposed to so many packed into what has already occurred.) The fires (actually near-perfect vertical columns of smoke) are never fully explained (but some seem to be caused by farmers burning post-harvest waste). Also never fully explained is the film's ending. (Since two principal characters have already died, is the death of the third protagonist now required for symmetrical, loop-closing story reasons?) Cinematography (wide screen, black and white) and lighting are excellent. Ichikawa confidently and fully fills the wide screen providing an epoch, panoramic feel. Black and white photography lends a documentary polish and seems appropriate for the subject matter. The score initially adds to this epoch approach, but, unfortunately, is progressively diminished on the sound track as the film proceeds. Subtitles lengths and time-on-screen are excellent; text font seems to have been carefully selected to be especially easy to read (which is usually not the case in Japanese-language movies)! Highly recommended, but disturbing to watch. WILLIAM FLANIGAN, PhD.","1853. US Navyman Commodore Matthew Perry makes his way into Japan and forcibly opens the country up to international trade. After two and a half centuries of self-imposed, peaceful isolation, Japan henceforth begins emulating Western powers. After the Meiji Restorations of 1868, Japan not only conclusively shifts from a feudal society to a market economy, but embarks on an endeavour to assimilate Western ideas, technological advances and customs. To the chagrin of the Western Empires, it also spends the next few years aggressively expanding into neighbouring territories, encroaching upon Korea, Taiwan, China, Vietnam, Burma and the Philippines, all countries which had themselves been taken over by Europeans and Americans. The apple in Japan's eye is China, though, which Russia, France, Germany, England and the US are busy dividing between themselves via \"Open Door Policies\". These policies grant multiple international powers access to China, all to the detriment of China itself.Ticked off that the big Imperialists aren't letting Japan get down to some sweet Imperialism of its own, Japan launches the First Sino-Japanese War (1894) and the Russo-Japanese War (1904). Ironically, these expansions are funded by British and American bankers (Jacob Schiff famously provided 200 million in loans), to such an extent that Japan's outstanding foreign loan indebtedness grows from near zero in 1896 to 421 million yen in 1904 and then 2600 million yen in 1913. After about two decades of further pressure cooking, a complex cocktail of forces and/or contradictions eventually lead to all the world's major nations getting their collective grooves on. In Japan's case, a mixture of nationalism, exceptionalism, racism, stupidity, economic competition, mounting debts, the need to open up foreign markets to prevent local markets from collapsing (historial J.A Hobson would famously call capitalist oligarchy, rather than national pride, the \"taproot of imperialism\"), blockades, Western bullying and sheer confusion leads to a state of Total War. The end result of WW2? The two Imperialist upstarts – Japan and Germany – get bombed back to the stone age, whilst the old Imperialist Empires go broke and are forced to scale back their domains. The United States emerges as top dog.Two of the major war films in Japanese post-war cinema were \"Fires on the Plain\" and \"The Burmese Harp\", both by director Kon Ichikawa. Released in 1956, \"Harp\" follows Private Mizushima, a lowly member of Inouye Company. Mizushima plays a lute, whose music becomes Ichikawa's metaphor for a humanity which is suffocated during war time. The film's awash with bleak landscapes, craggy, war-torn and steeped in death, a canvas which the lute attempts to hold back with an aesthetic of its own. But it's no use. \"Soil is blood-red,\" a title-card reads, \"so are rocks.\"\"Harp\" finds Ichikawa drawing parallels between Japanese and British soldiers, the fighting class on either side identical in their humanity. Its climax points to Japanese concentration camps, the scientific barbarism of the atomic bombs and finally to monastic Buddhism, Mizushima's newfound path. It's a path which divides Mizushima from both his comrades and an increasingly secular Japan. If warfare remains the music of the gun, Mizushima's Buddhism embodies the music of the lute, an aural flame which he dedicates his life to fanning.\"Harp's\" overriding tone is one of sadness. \"Fires on the Plain\" (1959), however, is suffused with blunt cruelty. It begins with a slap to the face and then the introduction of Private Tamura, a young man stationed in the Philippines. Tamura, we learn, has been ordered to kill himself with a grenade if he fails to admit himself to a hospital for healing, an absurd situation which informs the rest of Ichikawa's film. Whilst Tamura's countrymen prefer death to the dishonour of capture, Tamura rejects the nationalism and indomitable Yamato-damashii spirit of the army. He sees no dishonour in staying alive, and will do anything to survive. \"Fire\" thus offers the reverse of the spirituality and positive affirmation of Ichikawa's \"Harp\". It stresses the corporeal, the physical, its tone is nihilistic, and Tamura will cross any barrier in the name of self preservation, unlike Mizushima, who challenges himself and others to live humanely even within evil circumstances. Lost in a nightmarish odyssey, Tamura stumbles upon burning hospitals, corpses and vampire-like soldiers who cannibalise flesh, his narrative serving to undermine any measure of value or nobility wrongly ascribed to warfare. The film climaxes, in a scene evocative of Sam Fuller's \"Big Red One\", with Tamura shot whilst trying to surrender to an American soldier. His life's been lost for nought.Aesthetically, \"Harp\" and \"Fire\" are similar. Both are melancholic, at times shocking, and carefully juggle impressive wide screen photography with blunt close-ups of haggard faces. Both also feature dated scores, dip into excessive sentimentality and feature soldiers who are more dirty, dispirited and exhausted than was typical of Western war films of the era. This is not surprising. Before the revisionist and/or counterculture movements of the 1960s, British and American war films tended to be upbeat. Even Lewis Milestone (\"All Quiet On the Western Front\"), would get roped into directing gun-ho flicks (\"Pork Chop Hill\", \"Halls of Montezuma\"). Italian, Polish, French and Japanese war films, meanwhile, most of which fell under the umbrella of neorealism, operated under a completely different sensibility. Indeed, directors like Masaki Kobayashi, Andrzej Wajda and Rossellini were directing whole anti-war trilogies. 8/10 – Worth one viewing. See \"Paths of Glory\", Suleiman's \"The Time that Remains\" and Kobayashi's \"The Human Condition\".","Despite its flaws, Fires On The Plain is one of the most harrowing and powerful films I've ever seen. With its incredible stark black and white photography, we're taken on an emotionally exhausting journey through how far a man will go to survive. It takes it to the bleak extremes and pushes the limits. It's incredible and fascinating to watch the \"everyman\" main character on his episodic adventure and has great points about the devastating effects of war on the human condition. This could've easily been a favourite if not for some points that hold it back. Although the journey later blossoms, the music is definitely far too overdramatic and it opens with far too on-the-nose exposition that could've easily been summed up in a few more simple visuals. Unfortunately for the excellent cinematography, the editing isn't as good and perhaps its suffers due to the amateur performances who struggle to keep up continuity in different angles. However, these flaws don't distract from its power, as depressing as it is.8/10","So few films deserve the designation of \"Masterpiece\" For me, this finely-honed, abrasive immersion in war is one of the few. It is brutal and unrelenting, it is bluntly sincere in intent, and brilliantly depicts the depths of degradation the human condition can reach when immersed in the killing fields.Fires On The Plain is, in no way, a pleasant film, and if you're one who desires a \"good guys versus bad guys\" with a triumphant ending, look elsewhere. Director Ichikawa has seen first-hand the results of mass killing, and his bleak black-and-white composition stands as a persuasive caution to those who still believe in the brutality of battle to solve man's continuing hostility to his own kind--that the acting is consistently compelling and the photography stunning does not detract from the ultimate message. Not recommended as entertainment of a light kind, but as a compelling vision of a holocaust.","When we think of the John Wayne type of World War II film, we think of a group of autonomous soldiers, driven to achieve their missions. They lose men along the way; the ways of battle take their toll. But they are usually clean, well fed, and healthy. I know from watching documentaries about this war that both American and enemy soldiers did not always have this luxury. Sometimes the cost of war was infection, starvation, and injury. There wasn't always a clean, decisive end to these maladies. This is a film which is from the Japanese perspective. The army is already in disarray, starving, full of disease, but still forced to continue its mission in Leyte. They have been defeated, but their adversaries don't know that and continue to shell them and attack them from superior positions. These soldiers are, once again, pawns of a government, lustful for power, making them expendable. This is the film equivalent of a man hanging on a cliff, hoping for one more hour of life. Around him are similar people who have turned to pillaging, killing their comrades, and, yes, even cannibalism. They are stick men, barely casting shadows in the sewage they inhabit. They share salt or kill for it. This is a hard film to watch, but anyone who does should be aware of the costs of war. Brilliantly filmed and produced.","An unflinching descent into psychological and physical oblivion that will undoubtedly burn images of the truthful brutality and suffering of war into your cerebral cortex in a way not many other films will. In fact, there is simply no other war film like it.Director Kon Ichikawa witnessed the unthinkable horror of Hiroshima first hand only 10 days after the bomb was dropped. He has said that from that day it would always be his mission to express the pointless, empty violence humans inflict on each other and themselves. Mr. Ichikawa shows us that there are no winners in war... for the paths to victory and defeat are paved with the same soldiers soullessly marching down roads which only have death and destruction at their end.Mr. Ichikawa succeeds in bringing his message to the world thru this haunting piece of cinema."],"review-user":["Bunuel1976","zorbathegeek","Meganeguard","MartinHafer","mrreindeer","stepjohn54","Leonardo_poppes","insomnia","chaos-rampant","GyatsoLa","MacAindrais","MisterWhiplash","danfeit","bkrauser-81-311064","OldAle1","salg4","sonnythefat","ewarn-1","dmuel","net_orders","tieman64","Sergeant_Tibbs","museumofdave","Hitchcoc","Cinemadharma"],"review-date":["9 May 2007","22 April 2003","14 October 2004","25 March 2006","29 January 2000","3 December 2006","30 September 2006","28 September 1999","12 November 2008","23 February 2008","13 April 2007","18 October 2009","6 March 2006","29 June 2016","8 April 2008","18 March 2008","12 December 2005","17 March 2006","12 July 2000","3 October 2016","1 March 2014","10 July 2013","30 March 2013","23 January 2013","22 December 2009"],"review-rating":["8","10","10","10","10","9","10","10","6","8","10","10","10","7","9","8","8","10","9","9"],"review-title":[" FIRES ON THE PLAIN (Kon Ichikawa, 1959) ***1/2\n"," A good description of a good movie\n"," salt of the earth\n"," thoroughly unpleasant--just like war really is!\n"," Sympathy for the Devils\n"," A Wise and Provocative Film\n"," The Dead Sun\n"," A bleak outlook\n"," A harrowing masterpiece on the sheer madness and despair of war\n"," Monkey Business\n"," War is hell, and we lost.\n"," that \"War, what is it good for\" song is putting this lightly\n"," Question or comment?\n"," Darn Good Movie\n"," A view of war as bleak and uncompromising as any\n"," Fires on the Plain\n"," Twilight Zone, Film Noir ,or Horror ? Not just a war movie.\n"," Hard To See, But Great Film\n"," powerful anti-war movie\n"," Antiwar And (Surprisingly) Apolitical.\n"," Covenants of the Crown\n"," One of the most harrowing and powerful films I've ever seen.\n"," Compelling Vision of A Wartime Holocaust Unrelieved By False Heroics\n"," Walking Death of the Soul\n"," An unflinching descent into psychological and physical oblivion.\n"]}