{"review-url":["http://www.imdb.com/title/tt0086525/reviews"],"review-text":["This gem captures early 80's life brilliantly. As a grad '83 boymyself, I must say that Valley Girl (along with Fast Times atRidgemont High )stands out as the class of the teen sex filmgenre. The characters are accurate representatives of the era; thevapid mall chicks, pseudo punk rebels, preppy jocks are allrepresented here.I have seen this over ten times now. The music in the film was topnotch. Unfortunately, these tunes could were never as popular intheir era as those by arena cockrockers like Journey, Styx orLoverboy. Before the soundtrack existed, I searched out recordsand tapes (it was the 80's after all !) of Josie Cotton, Sparks,Plimsouls and Modern English.This movie deserves respect. It isn't just a good 80's teen flick. It isa great film. Period.","It was 1983 and I was 13. I watched Valley Girl on HBO one night when my parents were working. After it ended I wanted to talk with someone about it immediately. Turns out my best friend watched it too and it became our favorite movie. Every weekend after that we watched it until we could recite it. We woke her parents up late at night laughing hysterically. We began to worship the main character, Julie, played by the beautiful Deborah Foreman. I am not saying this is a great classic. Although it is for me personally. And I understand that the whole Valley Girl talk becomes annoying but that was the 80's. But deep down at the heart of the movie-it is a love story, and a familiar but good one. Girl meets boy and there are sparks from both sides, an instant connection. Julie's friends don't like him-he doesn't fit in, doesn't go to their school, doesn't have money. They like her better with her ex-boyfriend the football player even though he is a jerk. She makes the ultimate sacrifice-her own happiness for her friends' happiness. And she has these really cool supportive hippie parents. It is one of Nicholas Cage's first movies and his first starring role. One minute he is absolutely hilarious and the next incredibly touching and romantic. His friend Fred is pretty funny too. If you were a teenager in the 80's you will love this movie or at the very least it will bring back memories. It is no longer my favorite movie but it is still one of my favorites, probably in my top 10. I am eagerly awaiting it's release on DVD if they ever release it. You can go to Deborah Foreman's website to sign a petition to get it released on DVD and there are 2 soundtracks from the movie that are must haves if you like 80's music.","This movie is one of my all time favorite movies and is what made me a lifelong Nicolas Cage fan.  Back in the mid-80's I taped this movie (when VCR's were impossible to do this with!!) and would watch it over and over. Nicolas Cage is just brilliant here.  And, he looks wonderful and has no affecting \"acting-isms\" (see \"Peggy Sue Got Married\" to know what I mean about that!!).  I measure all his performances against this one.  He was so perfectly cast as the cool punk guy with the edgy friends.  The music was GREAT.  The Plimsouls!  The Psychodelic Furs!  Modern English!  Men At Work! Whenever I hear \"Melt With You\" I am taken back to the finale of this movie.  What ever happened to his cute costar, Deborah Foreman?  And his hysterical friend, Cameron Dye?  Certainly took a different turn than Nicolas! Interestingly, the slutty friend (Elizabeth Daily) ended up being the voice of Tommy from the Rugrats (she is billed as E.G. Daily for that horrid show)!  Bizarre!IF you want to take a great trip back to the 80's, watch this movie.  It is definitely a classic.  Like Totally!","Valley Girl will always hold a special place in my heart:  I would say this is certainly the best of the 80's teen-sex-comedies, but that is a back-handed compliment.  This is a good movie, period.  It is very specific in time and place--nearly twenty years later this is a marvelous snapshot--yet its story remains timeless.  (This is just Romeo and Juliet, minus the death, after all!)  Nicolas Cage is wonderful, showing all the early promise that, it turns out, he has squandered on overblown action crapola.  Deborah Foreman is the revelation of this movie, and I can't believe she didn't go on to have a bigger career; someone rediscover her QUICK.  This is sweeter and gentler than most films of the genre--the requisite nudity seems thrown in by contractual obligation--and, while not groundbreaking, it certainly is nice to see this kind of movie that respects its characters and doesn't crucify its shallow young girls for having fun--even Foreman's crew of best friends, misguided by peer pressure, are never presented as villains.  (Indeed, her friend Stacy, forced to doubledate w/ Cage's friend Fred, has a good time despite her protests, and makes out w/ Fred in the backseat.)  This will take you back to the early 80's if you were there, but it holds up quite well today.  Warning to those unfamiliar with the movie:  do NOT watch one of VH1's seemingly continual showings of it--go rent it in its unedited glory.  Otherwise, you are missing some of the movies' most potent, time-specific dialogue.  And one can't write about Valley Girl and not mention the fabu soundtrack of great 80's tunes--most of them by one-hit wonders, which are not only integral to the sense of time and place in this movie, but thematically well-chosen. See it--awesome little flick!  Fer shur!!","First off, I LOVE this movie. I love the relationship between the characters played by Nick Cage and Deborah Foreman. I love that they come from completely different backgrounds. But concerning some of the comments regarding the music of the era....There were two scenes at the time: New Wave and Punk. Punk was considered FAR more radical and a lot less mainstream than New Wave (like The Plimsouls, for example). While bands like The Ramones and Sex Pistols seem pretty sedate today, they weren't so back then, which is why I think that this movie went in the direction that it did music-wise. The clothes are spot on, obviously! This is one of my favorite movies because of the love story, and I never get tired of watching it.","In the tradition of \"Romeo and Juliet,\" a punker named Randy (Nicholas Cage) begins a relationship with shallow teenage girl named Julie (Deborah Foreman), but peer pressure from her equally shallow friends forces her to break up and go back to her ex-boyfriend (Michael Bowen). Randy refuses to take this lying down and tries to get Julie back. Will he succeed?Fine performances by Cage, Foreman, Frederick Forrest and Colleen Camp (as Julie's hippie parents), sensitive directing by Martha Coolidge, and totally tubular soundtrack by Modern English, The Plimsouls, and Men at Work (to name a few) makes this fun sleeper one of the best 80's teen comedies (fer shure). My evaluation: *** out of ****","Everyone has a great list of cinematic guilty pleasures, and \"Valley Girl\" has been on mine from the first time I saw it.  It was clear from the first \"valley view\" of the San Fernando that it was several cuts above your average teen-aimed movie.  Obviously, Nicolas Cage was pretty impressive, even if I had no idea of his heritage or his future.  I liked Deborah Foreman, too, and the supporting cast was well-chosen.  If the plot was trifling, it was at least clever and certainly not pretentious. And the music, from the opening by Foremen and her friends to the closing shot of the limo ride to Modern English's \"I Melt With You,\" is a big plus. Overall, an very entertaining take on love across the valley of cultural differences from Martha Coolidge, who is one of our most underrated directors.","The first time I saw Valley Girl, I was bedridden and as sick as a dog, out of junior high school for two weeks with a nasty illness.  I watched it on a tiny black and white set with the volume turned down to a whisper so my parents wouldn't hear and make me shut it off.  I was mesmerized.  It was a revelation.  Martha Coolidge's milking of the Romeo and Juliet premise (with Nicolas Cage and Deborah Foreman filling in as star-crossed lovers in the San Fernando Valley) was smart and convincing.  I was amazed by the hot \"Val\" chicks.  I was thrilled by the interesting vocabulary words.  I wanted to be like Cage's tough Randy and fall in love with a beautiful girl like Foreman's Julie to the sounds of Eddie Grant, Modern English, and The Plimsouls.","But perhaps you have to have grown up in the 80's to truly appreciate this movie.  If you love the early 80's this is definitely a must see.  Also, one of the best soundtracks ever!","I've seen this movie quite a few times and each time I watch it, the quirkier and funnier it becomes. Perhaps its the lack of research that went into Nicolas Cage's character's 'punk' persona or just the cheesiness factor because it was such a typical eighties film...nonetheless it's a cute love story with extremely funny, unique characters. I think it's right up there with \"Fast Times\" and \"Weird Science\" (quintessential eighties flicks!)","One word:PlasticsValley girl, Julie(Deborah Foreman) finds herself attracted to Punker Randy(Nicholas Cage) in this simple \"opposites attract\" tale about what happens when social circles are tainted and friendships are tested. Foreman's friends wonder why she'd even think about dating someone from Hollywood High when she could have Tommy(Michael Bowen, most might know him as the orderly who allows men to screw a comatose Uma Thurman in KILL BILL, while also being the owner of the notorious PUSSY WAGON), the popular, although smug, stud of Valley High. Yet, she finds Randy to be so much fun. Love is there, but can she choose Randy over her best friends. The film embraces..and pokes fun at..the artificial, manicured lives of the wealthy while also being non-judgmental towards the opposite Hollywood side where the undesirables hang.The film's ultimate success, besides the truly marvelous casting of Frederic Forrest and Colleen Camp as Foreman's hippie parents, is the great chemistry between the two leads. Startling enough, the film is quite adult on one side while also lovingly portraying what it's like to be a teenager in love while also facing the pressure of remaining part of your collective group when the choice of who your partner is may not be accepted by the friends you spend time with. Profanity and nudity does appear in increments so the film tries to be as accurate about high school life as possible. The highlights for me, as many who watch this flick, are the songs, styles, and dialogue of these characters. And, Foreman, who I just fell right in love with..she has that smile which really melts you. If you don't fall head-over-heels for Foreman then your heart is encased in steel. It's also cool seeing a young Cage as a punk with the wavy colored hair. Perhaps, one thing going against it, the flick doesn't have much of a story other than the conflict presented to Foreman. This flick depends heavily on the leads for it's charm.","I remember seeing this movie back when it was released and I still remember the 'buzz' I felt when I left the cinema. Everything about this movie is magnificent! The music is top notch and I still play the soundtrack after all these years.I have seen this movie so many times and yet I still get yearnings to watch it again and again. Nicholas Cage was great and whenever I see Cameron Dye in anything nowadays, I always associate him with this movie. It is too bad the rest of the cast didn't go on to greater things but maybe that is part of this film's charm.I won't do a film school critique as I am sure all the analysts out there can find fault if they wanted to, but what I will say is that this movie defined my teenage years and still continues to influence my life over 20 years later. The movie 'feels' great and stirs up emotions when you watch it (well...it did for me) and I cannot recommend it highly enough for anybody who has not yet seen it.You either 'get' the movie or you don't! Those of you who 'get it' will be rewarded with a unique movie experience.","Happy 25th Birthday to Valley Girl! Great soundtrack, plausible story, wonderful performances...captures the spirit of the 80's; the slang of the mainstreams and the outcasts. A wonderful rendition of high school life and \"gritty downtown\" from a suburban perspective.The soundtrack contains songs by Modern English, Felony, Josie Cotton, Sparks, Payola$, Josie Cotton, The Plimsouls, The Psychedelic Furs, Men At Work, The Flirts and Bananarama.This movie truly is Romeo and Juliet (minus the double suicide) set in 1980's Los Angeles. Julie's dad, played by Frederic Forrest (Sonny Bono, anyone?) is hysterical as a hippie idealistic dad who wonders how he sprung such a materialistic offspring. Yet, he doesn't judge, ya dig??","I really liked this movie, it totally reminds me of my high school days. The soundtrack is awesome.  I am a huge nic cage fan and this is my favorite movie that he is in.  I love the storyline, it is a total love story, against the odds kind of thing.  I think anyone who graduated in the early eighties (1980-1984) should see the movie. It totally brought back memories of high school for me.","Unlike most teen movies of the era, \"Valley Girl\" has a sweet nature to it, despite the presence of material like foul language, nudity, and sex. You feel a good deal of warmth towards these characters (at least those that deserve it). The romance itself is tender, and focuses more on genuine love than lust. There's also a great '80s soundtrack, and the movie looks very good for what was a $350,000 budget.Though I feel pretty amiable towards the movie, I must admit that it was far from perfect. The movie never made clear just what attracted these two people together in the first place, nor did it make clear what they found in common that was keeping them together in the relationship. Also, the solution the protagonists use in the final minutes to resolve the crisis that came up is terribly lazy and unimaginative. Then there are some scenes (such as the subplot involving another teen attracted to an older woman) that seem to serve no real purpose. But considering the screenplay was written in just 10 days, I guess I shouldn't be surprised by these weaknesses. If they had spent the time to beef up the screenplay, this may very well have deserved the \"classic\" label it currently has.","People who see this movie as juvenile, with weak acting, and unnecessary subplots just aren't in the same \"zone\" with the 80s genre as the people who call this movie a classic. Valley Girl, to those who love it, is THE classic 80s movie. It's not the best movie ever made, by any means. But it is a great love story, and to a teenage girl who was going in to high school when the movie came out, the dialog, clothes and music were just the COOLEST thing ever. I rented it so many times that I knew every word by heart--and was amused to find that I still know just about every line after seeing it again on some channel on TV the other night. It is so great, and brings up nostalgic feeling of 80s youth like no other movie. Pretty in Pink, Some Kind of Wonderful, Breakfast Club, St. Elmos Fire and others are all great, too...but nothing beats Valley Girl. If you haven't seen it and you love all things 80s, you will love this movie.Oh...and the subplot with Stacy's mom is not unnecessary as some have said...there is plenty in the movie about the other girl's love interests to justify those scenes. Every girl has some sort of liaison going on, and they're all shallow or unrequited relationships--which is the movie's way of showing how ironic it is that Julie's friends can't accept her true love with a \"townie\". And, btw, Stacy's Mom by Fountains of Wayne is about those scenes with Kip and Stacy's mom, in case you didn't catch it. They must be fans of the movie too.And, as if I haven't raved enough, it has the all time best soundtrack of the 80s. If you're a 20-something who loves 80s music get the soundtrack, too. You haven't heard half of the songs on the radio or on Napster, etc. They're only in the movie and on the record. I mean....Johnny are you Queer, and Eaten by the Monster of Love?? Awesome, awesome, awesome. Totally.","The teen movie of my generation is *not* \"Valley Girl\"-- it's \"Clueless\". I can hardly recall Bush's presidency much less Reagan's.  My earliest recollection of fashion magazines does not include sun-tanned celebrities with feathered hair but rather pale, flannel-wrapped grunge girls. However, I do know enough about the valley girl phenomenon: the talk, the style of dress, the malls and gallerias, the hippy parentage, the wholesomeness, the pastels..you know what I mean. So I wasn't completely detached when I saw the movie.So now to what I thought of it: I really really liked this movie. I even bought the video.I think growing up surrounded by the GenX mumbo jumbo made me appreciate this light-hearted flick.  It's a nice love story, kind of like a watered down Romeo and Juliet. The acting may not have been good enough for Shakespeare, but it's a movie, so it's perfectly fine that these people are \"actors\" and not melodramatic \"thespians\". Also the script was just right; it wasn't too phony, it had a sense of humor.. Examples would be Randy and his friend's visit to the valley party.  The bathroom scene was ticklish.Randy's depression and Julie's frustration and heart-to-heart with her dad were parts of the movie that didn't disappoint. In other movies of this kind the actors are often unable to carry their characters from one emotional situation to the next, and they end up making themselves unpleasantly flat. Randy and Julie have appropriate sincerity--remember, they're playing two young kids in love. The dreamy, whimsical quality of the movie fits just right.In conclusion, this is a wonderful, timeless movie. Though the time in which it is set plays a major role in the movie, the essential love story is timeless. The great thing about this movie is that it uses a *very* common theme but still comes out fresh and affective.  Even for younger viewers like me, who didn't grow up in the 80s, the movie can be just as endearing as it was to its first audiences.","For starters, Nochols Cage proves that he can not only act but carry a film. Valley Girl is still known to many as the film that made Nicholas Cage an actor. Although it helps being related to Francis Ford Coppola, it also helps if you can act. Cage proves himself in this blast from the past movie about growing up in the Valley during the awesome 80's. A good soundtrack if this is your kind of thing, the wardrobe and the attitude is true 80's. At moments, you want to laugh at some of the clothes that the \"teens\" are dressed in. Although Cage is great as a high school kid from Hollywood, Deborah Foreman looks more like a woman in her late 20's than someone in high school. Looking back, the Valley Girls have all moved to Malibu or the Glendale area, the Valley today is what downtown Hollywood was back in 1983. Still, a fun movie to watch and to recall how things use to be before the 1990's.","I was born a year after this movie came out, so I couldn't relate to it right when it came out.I just recently saw Valley Girl a few days ago on the WE channel. I thought it was an interesting movie... Many people say the slang is outdated, but I don't know how many times I've heard someone say that something was \"rad\" or \"awesome\" or if someone was \"getting laid.\"Sure, the characters are vapid and shallow. They're like, from the valley, like, you know? I loved the characters of Fred and Randy, especially. I know many boys that have the attitude Fred has.Nicholas Cage was SUPERB as Randy. I just wish there were more guys like that character: a rough-and-tumble punk with a dopey grin.\nI've got to say, any movie that makes me giggle from the style and makes even Nicholas Cage adorable (Keep in mind that I come from his \"action movie only era\") rocks.","I was not expecting too much from the 1983 teen comedy/drama Valley Girl'. But to my surprise, I got a very intelligent movie that does many things that are not in your usual teen movie. Sure we have seen some big teen films, like American Graffiti, Ferris Bueller's Day Off , Mischief, Girls just wanna have fun and in recent times The American Pie' Series, but Valley Girl is right up there as a very good teen film, with a cool soundtrack and a cast that really amazed me.  The strangest people fall in love and when these two opposites met, the fun just started when they tried to break down the barriers! This movie combines Hollywood punk with Valley conservative, ageing hippies with high school proms and generally shows that being a teenager CAN be outrageous fun! The direction of Valley Girl' is an area that I find to be very good indeed. It was directed in a way where you got the feeling no-one, on or off set had to be rushed, which I believe made the movie a very easy to follow. The other great aspect of the direction is that it was done extremely well by Martha Coolidge, a woman who knew exactly what she wanted to show onscreen and show it is what she did. If more directors, male and female could capture what Coolidge did with this film, more films would be much better. The screenwriters for Valley Girl' were Wayne Crawford and Andrew Lane, who did a great job in bringing out the teenage issues in the film, but did not make the mistake of basing the film totally around sex, which is what most teen films think they need to be. Instead we get a better insight into who these young people actually are. The other interesting aspect of Valley Girl is the way that the movie seems to allow itself to contain very intelligent and interesting dialogue, which for me is another highlight. I also enjoyed the characters created for the film. We get to see the hot shots of LA, the young impressionable chicks and the cool guys, who are not sleazy, but very very likeable. All in all, this story is going to stay with me for along time to come. This leads me to the cast of the film, which was very good. Randy (A very young Nicholas Cage), by looking at him, seems just like another teenage smartass. However looks can be deceiving and Randy shows himself to be a really nice guy. The other part I like about Randy is the confident manner he has, with him stating at one stage of the movie, I like the girl and she likes me, I am gunna have her'. Now that might sound like arrogance, but that is not the case, it just the cool, confident kind of guy Randy is. Nicholas Cage sure showed in this movie that he was a star of the future. Randy also has a very good friend in Fred (Cameron Dye), who stands by him many times.The girl Randy is after is the beautiful Julie Richman (Deborah Foreman), someone who has just broken up with a real creep, Tommy (Michael Bowen), who unfortunately has not accepted it yet. Then when Julie and Randy meet at a party there is an instant attraction. Julie is a very naïve young girl, but you feel for her plight in the movie, as I know I certainly wanted her to be happy. There are many good supporting cast members in Valley Girl. Julie's friends include Loryn (Elizabeth Daily), Stacey (Heidi Holicker), Suzie (Michelle Meyrink) and Samantha (Tina Theberge). In fact there are many moments with these girls that are great highlights of the film, including a scene that shows Julie going for her license, while three of these girls totally distracting her in the backseat, more interested in Julie's relationships status then getting her license.\t The other highlight of the cast has to Julie's parents, Sarah Richman (Colleen Camp) and Steve Richman (Frederic Forrest). Of course they are like any teenage parents, concerned for their daughter's well-being and life. But the real highlight here is Julie's dad, Steve, who gives his daughter some good advice, when it comes to Julie choosing who she really wants to be with. Steve states to her It's what you are that counts, what's inside you, what you stand for. Not what other people wanna make you'. Both Colleen and Frederic were a part of the brilliant 1979 war film Apocalypse Now'.\nThe music of Valley Girl was a true delight to hear, as it made the film very fun and exuberant. The composers for the film were Scott Wilk and Marc Levinthal, who certainly did their bit to help make this movie seem all the more memorable'. The songs I like from the soundtrack include Melt with you (Modern English), Who can it be now (Men At work) and Girls Like me (Bonnie Hayes with the wild combo).If there were more teen movies like Valley Girl, than I would certainly be a very happy movie watcher of this genre. Valley Girl is a movie that has the courage to show how difficult life is for teenagers in general, and is not just interested in showing the issues concerning the bedroom. Although the conclusion of the film has some enjoyable aspects, it was a bit of let down for me, as I would have preferred it finish on a different and better moment. Finally, I have never seen a cover to a video quite like the one for this movie, showing a Glossary of Valley Girl talk'. But I am not going to tell you any of it, you can learn about that for yourself.CMRS give Valley Girl': 4 (Very Good Film)","I remember seeing this film when I was 13 years old and I fell in love with it and I was a big fan of the film and the characters I adored. My favorite character was Stacey (Heidi Holicker), because she made me laugh when she showed no interest in Fred (Cameron Dye) who really liked her and I was hoping that in the end that they would get together then her boring boyfriend, Ralphie (Christopher Murray)because he ignored her and hung out with his friends. I love the cast and the story. I always love the part when Fred try to get together with Stacey, and I always remember when he chased her around the car. But it was so good. I'll always remember cherish that in my teen years. Now that I am 33 years old and I picked up my copy on DVD and will look forward seeing it.","This is the essence of the early eighties!  The malls, the credit card machines, the food, the punk hair color, the soundtrack... I am in love with this movie.  This sweet, intelligent Romeo & Juliet teen flick is instantly addictive.Martha Coolidge is one of my favorite directors.  She really employs her actors, like John Hughes and Steven Soderberg, so check out  -Joy of Sex- and -Real Genius-. The soundtracks for -Valley Girl- are great.  If you can find a copy of the film, buy it!  It's out of print and very hard to come by.","OK, so it piggy-backed on Frank/Moon Zappa's hit song. Doesn't change the fact that it is very well done and very funny. Teen angst has seldom been done so well.Nicholas Cage -- in one of his first roles -- is outstanding. Deborah Foreman is scintillating... don't really know why her career didn't go anywhere after this.The plot is formulaic -- kid from the \"wrong side of the tracks\" meets stuck up person and sparks fly... boy meets girl, boy loses girl, boy gets girl. And yet it's how any moviemaker works that formula that is important. Here it works brilliantly.For you 80s music fans, the live scenes of the Plimsouls and Josie Cotton are priceless. \"A millllllllion miles....away\".","This is good movie that is flawed in many ways with low production. Martha Coolidge herself said she only had 350,000 dollars to work with.  This is a movie that I loved growing up in the midwest.  I remember friends and I having the nostalgia trip on this movie 10 years ago.  Great things about this movie....Great cast with hungry actors and a hungry director.  Bad points of this movie....To small of a budget calling for way too much improvisation.  If Martha Coolidge had been given more money and time on this movie then the results would of been even better.  They should have taken the story from an early 20's prospective and not from a 15-17 year old high school stand point.  Most of the actors/actresses were in their early to mid 20's trying to play 15-17 year olds....(come on)  The music is extremely memorable and the two soundtracks get played all the time in my car. The best scenes in this film take place in seedy Hollywood clubs by Nicolas Cage's character.  I gave this film a high rating of 9/10 for five reasons.. Nicholas Cage's improvisational on the spot acting; The camera work and angles are excellent given the budget they had and only being able to have one take of each scene; The sytles, music and lingo are captured perfectly and forever; Again the music is incredible and carries the story along from scene to scene;  And finally...Martha Coolidge could turn a weak script, unknown actors and a very very low budget and 20 days of shooting the entire movie into such a good and memorable movie is astounding!","After reading in the \"Cool Today\" email letter the other day where the Sherman Oakes Galleria was torn down in LA got me to thinking that I should watch either Valley Girl or Fast Times in Ridgmont High and decided on Valley Girls.Having gone through High school between 1980-1983 (I'm from the class of '83), I am very familiar w/ the style, mannerism, and music of that era. I even remember listening to some of the music used in the film.However, I felt it to be a nice film depicting a culture only to be found in the San Fernando Valley, however, it's language made it into pupular culture w/ phrases like \"barf me out, gag me w/ a spoon!!!\" and the Frank Zappa tune that followed but it kinda falls down in one critical area-the charactors.The charactors depicted within the film come across rather shallow, unfortunately, much like the adolescent girls who proclaimed themselves to be Valley Girls in real life (and unfortunately like so many others too became shallow). Even the male charactors were shallow, with the exception of Nicolas Cage's charactor. He seemed to have more emotion and depth compared to the other main charactors though he needed to be fleshed out even more. And by shallow I mean, less cliqued and stereotypical.Remember, that was a hedonistic and shallow time in our lives where wealth (or the appearence of it), big hair and flashy clothes reigned supreme. Now, I do agree with one reviewer that Frank Zappa's daughter Moon Unit would've been much better in the main role then played by Foreman. Moon Unit did an outstanding job of talking Val Speak in the Zappa 1983 classic, \"Valley Girl\".Over all, I thought the film to be good for an occasional rental but not necessarily to own. If I were to own it, I'd find a better video distributor-one that used the fast SP (standard play) speed and also recorded the Hi-Fi track instead of LP (long play) speed and only the monophonic linear audio track as was the copy I rented.Otherwise, a good teen flick that miracously depicts the early 80's fairly accuratly. Just remember, any current teen that wants to see this film should put it in it's historical context before casting dispersions on it."],"review-user":["ddn32","rhondashane","phils_phan","vivalarsx","misce_mail","Michael_Pilkington","TomAldred","pooch-8","culwin","defleppardcath","Scarecrow-88","csacorn","cristag","sweetp11","Wizard-8","sweetbabydesigns","Rosa9999","caspian1978","starredmeriadoc","Old Joe","Totallyrad80","lizabee83","cgaray","dlazarus1","moviebuf-24"],"review-date":["9 September 2001","5 July 2002","16 March 2003","1 September 2001","3 January 2011","3 January 2004","1 May 2000","21 January 1999","1 June 1999","31 December 1999","8 May 2007","30 March 2008","13 April 2008","18 June 2000","2 November 2003","11 January 2006","28 July 1999","8 January 2005","1 September 2001","7 January 2004","17 September 2003","10 January 2002","14 November 2006","3 September 2003","6 August 1999"],"review-rating":["10","7","8","10","10","9","7","6","10","10","8","10","6","10","10","9","9"],"review-title":[" Top of the heap of eighties teen films\n"," Was my favorite movie for years\n"," Nicolas Cage's best role\n"," Specific time--yet timeless\n"," I think some people don't understand....\n"," Totally tubular 80's teen comedy (fer shure)\n"," One of my favorite guilty pleasures\n"," Like, totally awesome\n"," Another under-rated 80's flick\n"," A sweet yet corny 80's romance.\n"," Valley Girl\n"," Movies just don't get any better than this!\n"," Best Movie Ever!\n"," cool movie, awesome soundtrack!!!\n"," Watchable, but could have been better\n"," best movie of the 80s by far\n"," I didn't grow up in the 80s, but I still loved it..\n"," Holy 80's Batman!\n"," Not too bad\n"," She's cool. He's hot. She's from the Valley. He's not. So when punk meets prom the fun begins.\n"," One of my favorite teen movies of the 80s\n"," One of my all-time favorites!\n"," brilliant on many levels\n"," Good Movie / Low production (Too Low)\n"," An accurate, if a bit shallow portrait of the early 80's\n"]}