{"review-url":["http://www.imdb.com/title/tt0094668/reviews"],"review-text":["Pretty decent for his early work and no Kokaku Kidotai without it, and gets an 2 points extra for the easter eggs. For Shirow definitely a rung in the ladder. I am biased as a Shirow fan but this was a big step from Dirty Pair which was what I knew of him. Violent fun with a porno soundtrack! You cannot help but notice that. I know people appreciate him for Ghost in the Shell..but all of the deep spiritual overtones were dealt with in Appleseed. ESWAT killing terrorists, the struggle for humans to stay viable as bioroids phase them out, and Deunan staying thin despite her intake of junk food. Definitely like the characters even the traitor..and I do not know why.","Masamune Shirow's best-selling manga is packed with political, ecological, technical, and literary references and subtexts, but it's also an enjoyable science-fiction adventure. Although this version was made on a limited budget, and is showing its age, it's still worth its shelf space. Gainax, whose artistic success with Royal Space Force: The Wings Of Honneamise (1987) the year before had established their reputation for excellence, made the video adaptation, although the quirky design touches they brought to their own film are absent in Appleseed. Olympus is 1980s Japan with robots, which nicely highlights many of the concerns Shirow is expressing. References to US shows and the classic science-fiction film Blade Runner (1982) are easy to spot.","Based on the manga (comic) of well-known artist Masamune Shirow, this animated feature was a slight disappointment to me.The story is good, but the animation is merely \"OK\" while it could/should have been mindblowing. The movie is IMO adequate, but seems somehow flat & uninspired, if you know what I mean. A wasted opportunity, if you consider that another work by Shirow, \"Ghost In The Shell\", is considered a classic in many respects. It set new standards for Japanese animation, and spawned, among other things, a brilliant series called \"GiTS: Stand Alone Complex\".I consider this worth a rental, unless you're a fan of Shirow and want it all. Do check out the original manga, which comes highly recommended.","Being an avid reader of manga and very interested in the fascinating genre that is animé, I have always enjoyed the work of the masterful Shirow Masamune. The original manga behind this movie is far more complex and a lot of the suspense has been left out during its transition to animation, but a lot of the character interaction and stylish action remains.Very accessible for all viewers with really great backgrounds and scenery throughout the movie, not as spectacular as e.g. 'Ghost in the Shell', but definately pleasing to the eye.","Appleseed is an anime based on Masamune Shirows manga of the same name before he became famous with Ghost in the Shell in the mid nineties. Being released just before Akira it got unfavorably compared with the latter and could never hope to reach the bar that was set so high by Katsuhiro Otomo's creation.This is in fact the first installment of the Appleseed franchise although there is a gap of 16 years between this OVA and the 2004 movie.Although this 1 hour OVA never covers the entire manga, in terms of plot and story it still does a good job albeit the story being kept rather simple. Nevertheless the philosophical and political tropes of Shirow are well dealt with albeit not so deep as in Ghost in the Shell or in the two later Appleseed-installments.Animation-wise it is clearly a product of an era before Akira gave anime that huge boost.If you like cyberpunk anime from the 1980s and early nineties and if you enjoyed Shirows earlier work from the same era, like Black Magic M-66 (1987) or Dominion Tank Police (1988), then you will surely like Appleseed the OVA.","Before you watch this film, I suggest you read the manga first, or at least get a good idea what it's about, otherwise you'll probably be lost. Though the plot between the original comics and this adaptation differs, the characters and setting stay the same and it's a good start to get an idea of what it's about.Also, another recommendation: watch it in Japanese with the subtitles on if possible. In my time I've heard some pretty bad dubs, but 'Appleseed''s English dub is just appalling.At least in my point of view, this was a very enjoyable film. During action sequences and chatter between characters I laughed and smiled constantly. I don't think there was a point in it where I felt bored, it's pretty entertaining the whole way through.But the main thing I loved was the music and animation style. It really reminds you of old 80s cartoons, and I loved the nostalgia. The music, a kind of synthy, jazzy-type score, was constantly engaging and enlightening. I really loved that too.The story, too, may seem a bit silly, but it had a few interesting twists, and was often engaging too.A lot of other reviews have compared 'Appleseed' to \"watching from a weird CCTV camera\". I have not got a clue where that criticism has come from, other than a poor quality VHS release. But the DVD version I have looks brilliant, the animation was way above the standard for the time it was made.Fans of the manga will love it like I did, and for anime fans it's a must, but it probably isn't for everyone.Overall: 9.7/10","The animation quality here is decidedly below par IMO, regardless of the age of the OAV. The plot itself makes sense, but the characters don't.This might sound picky, but considering that the city of Olympus is almost exclusively populated by living machines, would YOU feel comfortable there as a human? Would any machine ever emulate human arrogance, short-sightedness and greed quite so effectively? I doubt it. There are some pointers towards this in the movie, but only when the team can be bothered to put them in, by and large the 'bioroids' (or whatever they are) are interchangeable with human characters. Seems sloppy to me.The main characters seem to have some kind of emotional entanglement, though no light is shed on this. Little light is shed on the backstory at all, a great pity. The short length of the film coupled with the focus on mecha and the crime means that we don't see any character depth. The groundwork's all down, yet we're left with no finished product. A cropped version of this OAV would have made a great TV episode, once some character sub-plots had been established.The highlights of this short film are the mecha designs and the action/espionage.The flaws really start to show through once you've had a chance to digest all the goings-on, so I couldn't recommend this for owning, but it's certainly worth a watch or two! Whilst this review is mostly negative, I really do think it's worth your time to watch this, but it's not something to rush out and buy. In a nutshell: A watchable wasted opportunity.","***SPOILERS***SPOILERS***SPOILERS***Appurushido is based on a Manga in which I have'nt read yet. The animation in this Anime is beautiful it is a great story with great action and has its fair share of humour my favourite scene is definitely when the cops bust into the apartment to bust some thugs its great stuff. The only downside to this anime is that it didn't run any longer, it should've lasted at least 90 minutes but aside from that its a great piece of film and anime buffs will love it. Sadly though I saw it on video and didn't get to experience the new special edition DVD of it. But I've been meaning to buy itAdam's Rating - 8/10","A good anime and faithful (loyal, adequate) to the manga.This animate movie, from the manga of Masamume Shirow \"Appleseed\", remains faithful. It includes the design, the characters and theirs characters, the tone and his comic, and one of the major story lines of the world of \"Appleseed\" are developed . Namely, through the city Olympus, the new world created for humans after the major global conflicts and their management by broods race created to manage and keep safe the humans. This \"golden cage\", as it's call in the animate movie, poses ethical problems through governance for the human world by non-human entities.We can be a little unfortunate (disappointed) that the introduction out of the Olympus from the manga, is deliberately set aside to penetrate directly into the film's plot and probably to be consistent with the desired duration. But this shelving (lack) is recovered by a sequence in the film where the role (part) of Hitomi is explained about it.The action, intrigue and pace (rhythm) of the film is very consistent. It's a very satisfactory achievement for this time and probably his budget.The soundtrack is unobtrusive (discrete) but perfectly accompanies the action. A good and faithful manga.The film is short (a little bit more than 1H) with a very good \"rythm\".","This anime is unique on the grounds that it explores more 'science-fact' rather than 'science fiction,' and makes the viewer believe much of what is being viewed is a factual prediction of the future earth.Appleseed, which is based on the 1985 manga of the same name, is set in the post-apocalyptic aftermath of WWIII. A new breed of governemnet and scraped what remains of the world's government to put together an experimental utopia, 'Olypus' suposidly free of the past-world's troubles and strives. Deunan Natt, and Buliareous Heckatonickles are two of the best in the Police Force, and just when they thought they couldn't get more bullets coming their way, they're asigned to takeout a camatose terroist, AJ Sebastian, who's goal it is to destory Olympus. on the gorunds of it 'enslaving' human destiny.Firstly, anyone who watches this can see how cheesy it is, but despite this, theres is alot more to consider about it than meets the eye. For stance, your confussed into believing who is the real bad guy-- the terrorist's moral values outway those of the Police & Government, yet what they're doing is rightly good also.The animation goes from strength to strength, and isn't anything like AKIRA, but it's moderate for 80's B movie OVAs. The mecha design is seemingly bizzare, but factual and controversial. There are also references to make us aware of the physics side of the technolodgy used. One thing which puzzled me about this anime were that there were contious references towards greek mytholodgy, especiallin the characters names.The analogue quality of the film though, doggs the whole thing from start to finish, with poor lighting, and fuzzy AV-recording.All around, it's a highly enjoyable watch, with some laughable scnes in place, if your into anime of cause. ***8/10***","I can't really badmouth the film, since it is made in 1988, I mean, My Neighbor Totoro and Dragon Ball Z come to mind from that time. But the animation is in the old school Japanese drawing style that looked so much like bad Disney, the sci-fi concepts are outdated and the story itself is nothing more than a cop story set in the future. It is not easy to find anything good that stands out, even if in itself is not a bad movie. It is just so boringly average that it becomes instantly forgettable.It does explore some aspects of humanity, as the story revolves around a fictional future city in which people are happy, but without choice. However it is difficult to buy into the story when terrorists and average people have guns and often turn to a life of crime. I mean, you have no choice, but you can buy a military robot suit and start killing people with high powered guns?The more recent reinventions of Appleseed are more watchable than this, I have to say. Perhaps there is a reason why the 1988 version is so difficult to find.","I saw this OAV in the early 90's, mainly because I was such a fan of the original Appleseed manga. Fortunately for me, I decided to rent the video as opposed to buying it. These days, I don't remember a great deal from the OAV, which is probably understandable, since there really isn't much that IS memorable. The things that had attracted me to the manga are simply missing in the OAV. Gone was the manga's overall grittiness, graphic violence, and occasional tinges of humor to keep the story from being too dark and nihilistic. When I watched the OAV, I felt as though I were watching some sort of weird animated security tape The pacing of the story was too slow for my taste, and the characters themselves lacked detail, as they were often were far away from the camera and placed neatly in the center of the frame. And then there's Olympus itself, it just seemed too antiseptic, I didn't get much sense of the city's dark underbelly as I did with the manga.I haven't seen the recent Appleseed movie yet, I can only hope it did the manga justice, this OAV sure didn't.","Nothing special to see here, the animation has being outdated and the plot is a typical futuristic era.  This film has an original story, but if it doesn't have an original plot or characters, so in my opinion it's not worth seeing.  I'm not saying that the movie was bad, it was just a typical anime story and I thought I watched this movie like a thousand times.  So if you are looking for something original see another thing.","This movie is (unintentionally) hilarious.There is more swearing than any other genre of movie I know (including Tarantino and Sam Kinnison concerts.)The 80's genre is crippling in its obviousness. It's all here: shoulder pads, jazzercize, and women with really big hair.Think of it as a cyberpunk NC-17 version of the original 80's Transformers TV show. The archetypes are ham-fisted and the character relationships are nebulous at best, farcical at worst. And the dialogue is on the nose the way a really angry 14 yo would write it. Appleseed (1988) So bad...it's good. May want to watch under the influence of something, however...In closing I leave you with this pearl excerpted from the scene where the villain is slain:BAD GUY: \"What the f.ing hell?! Christ...The f.ing c..cksucker!\" (move over Shakespeare... move the f.ck over!)"],"review-user":["calon929","toqtaqiya2","Sentinel-15","Nitefly","wataru-7","jackstarr777","SteveRaccoon","MARVELMANIAC69","Jeliosjelios","framer94","siderite","akira625","apollo231","drpark"],"review-date":["15 June 2007","19 October 2010","7 September 2003","10 April 1999","24 January 2014","28 February 2012","21 February 2004","16 May 2004","18 October 2013","5 September 2002","7 August 2014","17 August 2006","19 November 2002","19 December 2007"],"review-rating":["9","8","7","8","10","7","8","7","2","4"],"review-title":[" Not as good as the manga..no Snake Pliskin..COUGH!\n"," In this futuristic Japanse anime film, the experimental metropolis of Olympus is plagued by an elusive terrorist organization.\n"," Adequate adaptation of a manga classic\n"," Fine CP action\n"," Simpel but good cyberpunk anime\n"," A very enjoyable film\n"," Tired but watchable, one to borrow rather than buy\n"," Great Fun and Loveable Characters\n"," A good and enjoyable anime and faithful (loyal, adequate) to the manga.\n"," HiGH-TeCH HYJiNX FRoM THe CReaToR oF 'GHoST iN THe SHeLL'***8/10***\n"," Old drawing technique, old cyberpunk concepts, but decent anime\n"," Appleseed video can't hold a torch to the manga\n"," Good but Outdated\n"," LOL funny\n"]}