{"review-url":["http://www.imdb.com/title/tt0050646/reviews"],"review-text":["A fun filled romp, full of silly if not sometimes cruel jokes.  Not the best of movies, but definitely well worth watching.  David Niven and Stewart Granger are their usual charming selves with Granger as an especially delightful and ingenious gentleman.  Ava Gardner as wonderful as always, with such a delightful character that is absolutely iresistable.  The story line is typical, but full of jocular surprises, especially concerning the unconventional relationships between Granger, Gardner and Niven.","Discovered this great comedy from 1957 on TCM and enjoyed the great acting and pretty looks of Ava Gardner, (Lady Susan Ashlow) who was married to Sir Philip Ashlow, (Stewart Granger) and a great supporting actor David Niven, (Henry Brittingham-Brett). Lady Susan Ashlow is neglected by her husband, Sir Philip Ashlow and Susan seeks the constant companionship of Henry Brett who is a bachelor. Susan tries to make her husband jealous by always going out with Henry and eventually Susan convinces her husband to take a cruise on their yacht as a sort of honeymoon. However, Philip decides to invite Henry on the cruise and things happen on the cruise that causes everyone to become shipwrecked on an island and things begin to get rather crazy. Eventually Henry asks Philip if he can share Susan in bed every once in awhile and the story gets really funny and out of control. Good entertaining 1957 film, enjoy.","If The Little Hut had been done as originally written by Andre Roussin had been done this might have been a far better film. In the original version the Ava Gardner character actually does have sex with all concerned on the island she's stranded on. But Hollywood is still in 1957 a prisoner of the Code so that kind of infidelity could never be shown on the big screen. If there is a French language version of The Little Hut I'll bet it's far better.The French characters are changed to British here and even stranded on a tropical island they all behave quite civilized even in adultery. Stewart Granger and Ava Gardner are married and are on a yachting tour with a party of friends including Granger's best friend David Niven. The ship goes down and the three of them are stranded on the island where they build two huts, a big one for the married couple and The Little Hut for Niven. But with not a whole lot to do on the island they engage in a lot of frank dialog and Niven opens up that he's been Gardner's lover for about six years. Granger who does kind of take things for granted with Gardner is affronted, but as captain of the former ship decides that if his powers include marriage they also include divorce. He divorces Gardner and Granger and Niven exchange huts. Later on a really hunky looking native that Gardner looks lasciviously on enters the picture and things really get complicated.That lascivious look was not acting on Ava's part because she was involved with Italian actor Walter Chiari at that time. If the script had called for them to do the deed she would have no doubt been even better.The Little Hut with all the sex taken out plays like a combination of The Admirable Crichton, Three's Company, and Gilligan's Island. I'm sure Sherwood Schwartz who produced Gilligan's Island saw how the cast lived on that island, how they showed such ingenuity in creating some creature comforts, that he probably incorporated much of it in his show. It's the best part of The Little Hut.The play on which this was based was a big hit on the West End of London, but when it came to Broadway in 1953 it flopped terribly with only 29 performances. Playing the Granger, Niven, and Gardner roles on Broadway were Roland Culver, Colin Gordon, and Anne Vernon.If the film were done 20 years later as originally conceived by Andre Roussin the results would have been better. But the stars especially Niven are three of the most charming folks around and they put it over as best they could.","Two men and a woman are stranded on a desert island. If they are English, there is no problem: They haven't been introduced. If they are Spanish, there is no problem: One of the men will kill the other. If they are Italian, there is no problem: The woman will kill one of the men. If they are American, there is no problem: They will be too busy talking about business. If they are French, there is no problem. Alas for this story, the two men are English, and the woman is American, and they already knew one another well -- perhaps too well. The story, from a French play more risqué, or even downright explicit, is reasonably plausible, by Hollywood standards, rather well acted, but so badly edited it is a crime. There are way too many scenes that do not match: For example, from one angle, a character has his arms crossed, then the next shot shows him with his arms at his side. \"The Little Hut\" is full of such bad continuity or bad editing or bad directing ... or combination thereof. Still Ava Gardner, an enchanting and under-rated actress, in her various abbreviated costumes almost makes this worthwhile all by herself. Almost.","i saw this film\"way back when\" in '57 and my date & i were helpless laughing at it.  i know it was panned even back then, both as a b'way show and later as a flick.  stewart granger plays a totally naive tennis nut with a beautiful wife, ava gardner.  he is totally oblivious to his pal, david niven's overt courting of gardner.  one scene has niven & gardner playing a game and, at the game's end, they engage in a passionate kiss.  the naive granger passes it off as \"good, clean fun\".  he just can't see pal niven for what he's up to.  another scene has the three at a table on the island they were stranded on, with granger again in total oblivion to gardner & niven playing tangle toes and trading double entendres at each other.  granger finally wakes up and tries to win wife's attentions back.  this picture is really worth seeing, in my book.","André Roussin was a specialist of what the French call \"Theatre de Boulevard\" : plays where you find the eternal triangle:man/wife/(male or female)lover .Many of his plays gave Elvire Popesco some of her best parts on stage....and the great actress was the main reason to watch them,for Roussin is not Sacha Guitry ,by a long shot.The French audience remembers \"Au Theatre Ce Soir' .Still with me? Roussin's plays were not made to be filmed.And this one is pretty mediocre material ,even if the screenwriters call Lewis Carroll to their rescue .I like Stewart Granger and David Niven ,and Ava Gardner is eye candy .But this might be their worst film ,being crude, predictable -even the native's (Bola -Bola )intervention is ludicrous- a knockabout farce around a Menage à Trois on a desert island where Granger would be some kind of Robinson,Niven ,his Friday and Gardner his girl Friday.","Barely three and a half years after just scraping out a month's run (7-31 Oct. 1953) at Broadway's Coronet Theatre (on west 49th Street; since renamed the O'Neill), MGM relied on the earlier solid London success of the play to lavish a wonderful cast and - for the most part - carefully \"opened up\" production on a sadly trimmed down screenplay of this slyly subversive boulevard comedy and were rewarded with a modest hit.Ava Gardner is the increasingly frustrated wife of Stewart Granger, an internationally successful and entirely complacent \"workaholic\" (before the term had been coined) using the perpetually frustrated David Niven to attempt to rekindle passion in her spouse. When the \"second honeymoon\" cruise Gardner inveigles Granger into leaves the trio (and Granger's dog) marooned on a south sea island (were there other survivors? That's for later plot developments), Granger continues right on managing the world around him - building a big hut for himself and his wife and a little one of the title for Niven - or the unattached male.The core of the actual plot of the play only gets going about half way through the film when Niven proposes that Granger and he alternate as tenants of the Little Hut - sharing the only female on the island as Granger has been willing to share the only pair of shoes (his).Reason (which Granger considers his strong point) reigns and frustration reigns supreme - for a while.David Niven and Ava Gardner are superb in their appointed roles of suave would-be seducer and seductress, and Stuart Granger - usually called upon merely to be handsome and virile in action roles and the odd miscast specialty (a crowing pretty-boy as Apollodorus in Shaw's CAESAR AND CLEOPATRA in 1945) - gives one of the better acting performances of his film career as the husband who may actually be as smart as he thinks he is. 33 years later he would again show this suave urbanity opposite Rex Harrison in Granger's first (and BOTH their last) Broadway engagements in a hit revival of Somerset Maugham's THE CIRCLE which only ended with Harrison's death. We'd be far richer if Granger had used these skills more often.As promising as the menage is, this is, after all, a very British Boulevard Comedy AND Hollywood in the 1950's which is to say that (unlike the source play) very little sex actually goes on. To be frank, if you don't give yourself over to the ideas driving the contrivances it does get a bit silly. The same basic plot is far more satisfyingly developed three years later in the Cary Grant/Deborah Kerr/Robert Mitchum/Jean Simmons (Stewart Granger's actual wife) THE GRASS IS GREENER, based on an even less successful play, 'though for some reason that superior trifle failed at the box office, and much earlier in J.M. Barrie's superb THE ADMIRABLE CRICHTON.As lavishly as MGM set the piece, there were unfortunate lapses - the silliness which ends the stay on the island is cartoonishly presaged in what should have been a moment of genuine excitement - the sinking of the yacht that PUTS them on the island. Ultimately we only get about three quarters of an hour of the real Little Hut, but ninety good minutes of David Niven, Ava Gardner and Stewart Granger that make the film a fun diversion. Not high culture, but a worthy guilty pleasure.We even get some very nice garnish in Walter Chiari (reputed to be Ava's actual lover at the time). As one of his better speeches goes: \"Boola, boola!\"","Not everyone who sees \"The Little Hut\" will understand the humor displayed.  It is a more worldly comedy from another time--fifty years ago. What made us laugh then or 100 years ago or even now, is different, because we are products of the time period and location in which we live.Ava Gardner portrays Lady Susan Ashlow, a play on a previous character from \"The Sun Also Rises\", Lady Brett Ashley (also released 1957).  Stuart Grainger, who co-starred with her in \"Bhowani Junction\" the previous year and David Niven, who co-stared with her  later in \"55 Days At Peking\" also star.  It's tongue-in-cheek repartee are over the heads of most of the \"X\" generation that only can read enough to access information on the internet. If you've never read a book, don't bother seeing this movie--you won't get it. But if you remember: Kennedy, cocktail hour, the bomb, etc.  you will understand and enjoy this movie.","With a deliciously naughty premise for the genre, Little Hut carefully walks the line between teasing and tempting, with witty dialogue and an excellent cast. David Niven gives a superb performance opposite the stunning Ava Gardner, as the neurotic Englishman Henry Brittingham-Brett. The pair attempts to navigate the dangerous and sultry waters of unrequited love, while remaining firmly within the bounds of high society. The dialogue is witty, the situation drole, and the chemistry between the two leads superb - an excellent start.Unfortunately, Stewart Granger's character never really becomes convincing, and acts more as a prop to back-up the action between the two leads. It's a pity, since when the script gives him a chance, he is easily their comedic equal. However, the script never really does - and, once the central premise is revealed, it quickly loses its way, becoming plodding and tiresome with only the two leads to rely on. The film is partially saved at the last minute, with Walter Chiari's highly amusing - and savage - performance. The dynamic he adds re-invigorates the play's sense of wit and naughtiness, just in time for the curtain to fall.","The script of \"The little hut\" was written by the French writer André Roussin (1911-1987), based on his play \"La petite hutte\"(1947). Both play and script are, in fact, a plagiarism of another play in Catalan, written by the novelist and play writer Carles Soldevila (1892-1967), \"Civilitzats tanmateix\" (\"Nevertheless civilized\")(1921). This play was known in France much before the robbery of Roussin, through a translation by Adolphe de Faigairolle and Francesc Presas, published in 1927 in the magazine \"Candide\". Recently \"Civilitzats tanmateix\" has become a musical by Albert Guinovart, with the title of \"Paradís\" (Paradise).","Ava Gardner, Stewart Granger and David Nivens headline this atrocious film from the 1950's. They are three unfortunate souls washed ashore a deserted island after a terrible shipwreck. Much like 'GILLIGAN'S ISLAND' and 'SWISS FAMILY ROBISON', these three survivors have no trouble in adapting to the 'jungle' life while finding just about anything to eat without poisoning themselves or getting terribly sick.But this also makes room for the three survivors (one woman and two men) to get tied up in a nasty love triangle. Never before have I seen such a tawdry and weak script that was terribly acted out by three screen veterans who were forced to star in this schlock. The only other laughable plot I could compare to this atrocity to would be the love triangle acted out in 1978's 'THE SWARM' where Olivia De Havilland found herself caught between Ben Johnson and Fred MacMurray whilst being attacked by a swarm of bees.For these three people, you would think taking survival on a day by day basis until the possibility of rescue would be their top priority. Instead, the first things that come to their minds is who will get to have sex with who first. The film tries to deliver this situation with a dusting of light comedy and charm, but you can't for a second take this seriously. It's almost as if the three actors just gave up halfway through the film and said \"To HELL with the acting, let's just hurry up and get this done so we can go home!\"The island itself is basic 50's-style. Potted plants and silk screens painted with volcanos are the backdrop, while the cawing of Australian kookaburras and the chirring of crickets sing in the background. Most likely, this was filmed in some small Californian MGM studio backlot.There really isn't much else to say about the plot. The predictable happens and everyone goes home a happy camper. For Ava Gardner, this was only the beginning of a string of duds she released in the 50's, including 'THE SUN ALSO RISES' and 'THE NAKED MAJA', but she would undoubtedly clean up her act in the 60's by starring in lavish productions such as '55 DAYS AT PEKING' and 'THE NIGHT OF THE IGUANA'.This movie was quite a disappointment. Fans of Granger should stick with classics such as 'SCARAMOUCHE' and 'BLANCHE FURY', and fans of Niven won't find him in anything suitable after this film until the 1961 release of the war classic 'THE GUNS OF NAVARONE'.Renowned channels such as Turner Classic Movies and American Movie Classics should be ashamed to show this movie which is a complete mockery of the three actors involved. Anyone who hadn't seen any of the three actors in anything else before seeing this film would most likely get a prejudiced impression of their acting abilities. Fans of Granger, Niven and Gardner should stay away.My Grade: 1/10","\"The Little Hut\" comes from a period in time when the almighty Production Code had began to loosen up. So a rather provocative menage-a-trois comedy (with two of the participants married to each other) was actually permissible. Despite the desert island setting, the film betrays its stage origins. But the hot (and frequently wet) Ava Gardner is the perfect woman to be shipwrecked on an island with, and Stewart Granger & David Niven, while maintaining their gentlemanly exterior, prove adept at slapstick comedy. **1/2 out of 4."],"review-user":["cimorene_fantasy","whpratt1","bkoganbing","morrisonhimself","jolter41","dbdumonteil","eschetic-2","evelynruthragan","jlgraves-1","vilaalbert","Aussie Stud","gridoon2018"],"review-date":["29 September 2001","4 June 2008","12 November 2010","29 July 2009","31 May 2002","22 July 2008","28 July 2009","10 August 2002","26 August 2006","11 November 2006","11 August 2001","6 May 2018"],"review-rating":["10","6","6","6","4","7","6","1","6"],"review-title":[" A delightful and enjoyable film\n"," Very Funny Comedy\n"," Civilized Even In Adultery\n"," Ava Gardner in a grass skirt still not enough to save this\n"," a laugh riot\n"," Nothing in sight\n"," Terribly proper, and properly fun\n"," It takes a witty person to understand the comedy in \"The Little Hut\"\n"," An amusing and naughty romantic comedy\n"," The unknown story of a script\n"," Only one word can sum up this movie: DREADFUL!\n"," Enjoyable comedy, and quite racy for its time\n"]}