{"review-url":["http://www.imdb.com/title/tt0025227/reviews"],"review-text":["At the tender young age of 19, we shouldn't judge Orson Welles too harshly. Afterall, this is the first film of one of cinema's greatest directors, and the precursor to undeniably one of the greatest movies of all time ('Citizen Kane' would be released 7 years later to extraordinary critical acclaim). 'The Hearts of Age,' an eight minute short, was co-directed by Welles with William Vance (whose only other film credit is a 1932 adaptation of 'Dr. Jekyll and Mr. Hyde), and also stars Welles' first wife, Virginia Nicholson.This silent film, essentially a string of images loosely tied together, was almost certainly inspired by surrealistic classics such as Luis Buñuel's 'Un chien andalou (An Andalusian Dog, 1929)' and 'L' Âge d'or (The Golden Age, 1930),' and Jean Cocteau's 'Le Sang d'un poète (The Blood of a Poet, 1930).' Whether Welles and Vance where attempting to imitate this surrealism, or merely to satirize it, I was unable to deduce, though the final effect is adequately frightening and disconcerting.For such a film, comprised of split-second flashes of seemingly random objects, it is difficult to judge performances. However, I can safely assert that Welles' is the standout, even if his performance is far from spectacular. Despite his face being obscured by his \"Death\" mask, Welles unquestionably radiates at least a small portion of the charisma that would lead him to stardom later in life; his confident  almost arrogant  swagger is unmistakable.If somebody other than Orson Welles had created this film, would we be taking any notice of it? Probably not. However, the very fact that that it is the debut directorial effort of one of the twentieth century's most respected entertainers makes it a fascinating historical curiosity, and, therefore, must-see viewing. Would I declare that 'The Hearts of Age' so poignantly predicts greater things for this young Mr. Welles? Maybe... but probably not.","In 1938, a young actor and theater director named Orson Welles earned notoriety and recognition when his radio play version of H. G. Wells' \"The War of the Worlds\" was broad-casted, shocking the nation and prompting many studios to notice Welles' talent. This success would take Welles to Hollywood where in 1941, he would direct what is now considered by many critics as the best movie ever made, the influential classic \"Citizen Kane\". At the age of 26, Welles had already made the movie of his lifetime, and was about to begin a career that despite the many troubles he found (mainly studio interference), managed to produce excellent results. However, \"Citizen Kane\" wasn't the first time this prodigy had made a movie, as before \"Kane\" the young Welles made 2 short films that helped him to experiment with the medium. The first one was \"The Hearts of Age\", a film he did when he was only 19.\"The Hearts of Age\" is a surrealist film based on ideas about old age, decrepitude and death. Virginia Nicholson plays an Old Woman, sitting on a bell on the top of a house while a black servant (Paul Edgerton) rings the bell. She seems to enjoy the feeling of the bell moving with her on top as she watches people coming by, and gets angered whenever her servant stops to rest a bit. Soon, a sinister man (Orson Welles) appears, acting exaggeratedly polite to her, and becoming interested in her servant. Soon she discovers that the sinister man is Death, as he begins to do his job with some of the people she has seen. The Lady doesn't seem to care much until he decides to go after her servant, whose death would mean that the bell would stop moving. As she watches how his servant dies, she discovers that she is also on Death's list.Cryptic and strange, this 8 minutes short film was written by Welles in an apparent attempt to satirize the surrealist movies of Jean Cocteau, or at least that's what he said about it many years later. It certainly follows the style and structure (or lack of one) of the works of surrealists (like Buñuel for example), as the plot is developed in a dreamlike fashion, often illogical and filled with metaphors about the main theme. In this case, theme is mortality, the nature of death and how people reacts to it. The movie also touches the subject of the hypocrisy of the attitudes towards black people that people of his time used to have. While this may sound like a honest attempt to satirize what Welles sees as the pretentiousness of surrealist artists, it never truly achieves that purpose and in the end it feels more pretentious and over-the-top as the movies is attempting to parody.While of course nowhere near the movies he would make later in his career, \"The Hearts of Age\" does show two interesting traits that would later become trademarks of Welles' style. First, a highly creative camera-work, which even in this experimental stage already shows that Welles understands the limitless possibilities of cinema and its value to tell stories visually. The second of those traits is his stylish use of editing (sadly something he wouldn't be able to show in many of his movies), which in this films still shows a lot of influence from Soviet montage theory, but that later would evolve into the perfect complement for his cinematography. Something that can also be seen in this short film is that even at the age of 19, Welles already knew what to get from his actors, and had the skill to direct them properly into delivering what he wanted.Considering the style of the short, this last thing may sound insignificant, but one can't deny that while certainly the movie is nothing more than a mere amateurish experiment, it shows that Welles truly had a prodigious talent despite the lack of a properly written script. The cast is good in their roles, although as written above, the main weakness in in the script. It's not that it's bad (it actually handles symbolism in a remarkable way), it's just that it seems to take itself too seriously for its own sake that it ends up making the film a but boring despite the short runtime. Welles himself considered the movie more an experiment on film-making than an actual film, and watching the results, it's hard to disagree with him, as the technical aspects are far more interesting than the artistic merit of \"The Hearts of Age\".Wheter he truly intended to make fun of surrealism or actually failed in an attempt of making surreal art, it is truly an impossible thing to know for sure; but what we do know is that this first movie marked the beginning of Welles' interest in film-making as an extension for his work at the theater. An interest that would transform into an obsession that would become the force behind some of the most significant films in the history of cinema. \"The Hearts of Age\" is not exactly something amazing, but given its historical importance, it is a required viewing for anyone remotely interested in the career of one of the most important men in film-making: Orson Welles. Weak, confusing and a tad pretentious, \"The Hearts of Age\" is the proof that even giants started small. 6/10","Watching Orson Welles' first film is like listening to one of the early (emphasis on early, like pre-pubescent) compositions by Mozart- you know things can only go up from here. What Welles' decided to do before he reached the heights of fame as a theater actor/director and with his Mercury company, he tried his hand at making a film. According to the commentary on the DVD, it's an intentional spoof of Cocteau's Blood of a Poet, and Bunuel's first surreal efforts. In that sense it's actually very interesting, as it doesn't make sense plot-wise, but is evocative and spooky when just soaking in the images. There's Welles' himself with a mask of Death. There's a friend of Welles' as some odd character. Then a piano plays. Symbols seem to come and go as they please. Simply put, The Hearts of Age succeeds best at being an test of skills and technics/visual ideas more than a concise film with a carefully structured story as with Citizen Kane or The Trial. However, if you took it out of the context that it's directed by the future 'wunderkind bad-boy' behind some of America's most cherished and truncated artistic works, as just a short film by a college-aged chap it's not that bad (to put it another way, I've seen worse).","If you like surrealistic films, like Cocteau's or Salvador Dali's, THE HEARTS OF AGE may appeal to you. It certainly throws symbols around, but it is the work of two teenagers at a prep school, not of a major French 20th Century poet and film maker and a major Spanish artist. When the latter two put in symbols, and repeated them, there was a rhythm and sense in their use - especially as their films were meant to shock or to attack the Church.Here two preppies, William Vance and George O. Welles, are trying to make a surreal movie. It has some nice touches. A hand reaches out of the crypt of a cemetery (or seemingly so) to grab a stone marker cross. But it's \"dollar book\" symbolism. In high school I was involved in making a film, and it involved a rare tablet that unlocked hideous power secrets. I suggested, in a scene supposedly shot at a religious altar, that the tablet be placed in a skeletal hand. Disembodied or fossilized hands scare people, and are useful in keeping an audience's attention. That was why I suggested it.From my above reduction of one of the two creators of this film, calling Orson Welles by his first name, I am sort of hinting at the problem at watching THE HEARTS OF AGE. If it's creators were a pair of non-entities we would not care to even consider the film. But it was co-directed by Welles, some three years before \"THE CRADLE WILL ROCK\", some four years before \"THE WAR OF THE WORLD\" broadcast, and some seven years before CITIZEN KANE. Welles' creative ascendancy was about to blossom, so we look at this early stunt as full of suggestions of greatness. That's stretching it.It shows potential. Mr. Vance, Virginia Nicholson, and Paul Edgarton do as well with their acting parts as the normal teenagers who are in a school production. It's when Welles shows up that we see more spice in the acting. This is not based on a blind Wellesian hero worship. He shows a subtlety in his playing the part of the mysterious male figure that is lacking in the other three performances. Ms Nicholson seems bad tempered and suspicious at times (mostly at Mr. Welles) but she fails to gain our interest or sympathy. Mr. Edgarton as a doomed bell ringer/slave (he's in black face) gets some sympathy as he is forced to constantly labor, and eventually he dies by hanging. But the lack of any rational or symbolic reason for this kills the effect of his demise! Welles obviously was given the best part because he can act. He first appears as a jaunty figure, in top hat and tales. His thin body (he could not have played this part forty years later) seems to be springing down various ladders and walks as in a dance. With his pale, bald features he may represent death dancing (and later playing the piano). But is he? Or is he simply an old man, who is happy to survive his wife (Ms Nicholson?) and buries her quickly when he finds her corpse? When Pauline Kael did her hatchet job on Welles' contribution to CITIZEN KANE, she pointed out that his make-up in THE HEARTS OF AGE mirrored the elderly Kane. There is a resemblance, but then keep in mind that in both films we are seeing the frame of Welles' face covered by a bald wig. So there would be a resemblance anyway. Moreover, Kael was so determined to rob Welles' Kane performance of any originality that she also found he looked like Peter Lorre as Dr. Gogol in MAD LOVE, a 1935 thriller where Lorre is an insane surgeon terrorizing a crippled pianist (Colin Clive). When Welles was asked about this, he said he never even heard of Lorre's movie before. He probably hadn't. My guess is that any resemblance between Welles' performance in THE HEARTS OF AGE and CITIZEN KANE are solely due to both characters he played having to age or be old. Certainly when he played the old Charles Foster Kane, he moved slowly like the elderly, slightly obese, Kane would have moved - not like the jaunty death's head he played in THE HEARTS OF AGE.","Spoilers herein.Sometimes a student film is just an exercise. Sometime it is a meaningless exercise made important because that student went on to become someone important. In that case, maybe you can in retrospect find some indication of adventure or style in the callow artifact. But sometimes the early project is worthwhile on its own merits.Nearly everyone thinks this is of the second type. I think it is the third. Yes, the production values stink. Yes, the recent editor added in some stuff that Welles omitted. Yes it is too brief to easily read. But there is some heady stuff here: just the one image of his sexual partner on the bell is pretty rich. Just the notion of making one character the `barker' for the film is impressive, making him surrogate for the filmmaker. Balancing him with someone intent on destroying the project is clever too.\nThese three notions characterize Welles' films:Film as a noisy essentially genital experience; the filmmaker as a character whose onscreen presence makes the visions; the explicit representation of all the destructive/ obstructive forces that would prevent the artist from his orgasmic vision.All of Orson's films were about himself. All of them were essentially consumptive -- he ravishing the material and the environment consuming him. It starts here.Ted's Evaluation -- 3 of 4: Worth watching.","although I couldn't come up w/ as piquant a one-line summary as \"vaginal bells,\" \"worth seeing\" is a fair appraisal.Welles himself said this film was nothing more than a student movie, a lampooning of surrealist cinema; so take the short for what it is: interesting, and maybe hinting at cinematic things to come.however, investing it w/ impenetrable, pseudo-freudian psychosexual crappola---as one reviewer does---is absurd.  that kind of drivel simply gives film criticism a bad name.\"the explicit representation of all the destructive/ obstructive forces that would prevent the artist from his orgasmic vision.\"?too bad there's no email icon for rolling your eyes.","Orson Welles' first film, codirected with a one William Vance, is pretty much only known to purveyors of avant garde movies and cinema historians. It's an iconoclastic and satirical look at Americana--especially Southern Americana--and is mostly a product of Welles' getting used to the camera and figuring out where to point it.The print I saw was very faded, and I think Welles actually meant for it to be foggy and slightly-out-of-focus, so the result was hard to see. Still, Welles did some pretty daring things with this film... not cinematically, but symbolically. The woman riding the bell while the slave (a man in black face) rang it seems like the type of thing that would immediately have had the censors gathering arms.The bell, which can stand in for liberty, religion, or sex, really, is a pointed attack on American manners and racism, and Welles' Death/Judge/White power persona reacts accordingly. The controversy that was Citizen Kane is somewhat foreshadowed in Orson Welles' willingness to directly attack the system, something that eventually ruined his career... and probably helped keep this film underground for a while.--PolarisDiB","Hearts of Age, The (1936) ** 1/2 (out of 4) Orson Welles acts and co-directs this, his first film, which is a take off on surrealist filmmaker Luis Bunuel. It's interesting watching this film knowing what Welles would go onto do but overall this isn't overly good. The visual technique is nice as is Welles plus we get to see him act with his first wife Virginia Nicholson.You can find this short on Image's Unseen Cinema Collection, which features several rare and important films, which will be very interesting to fans of early cinema.","When a friend once lambasted me for my first movie (a pretty bad videotaped affair), I argued that I could grow; Orson Welles' first movie, indeed, was even worse.  He challenged me that it couldn't be, so I pulled out the Criterion laserdisc of (I think) CITIZEN KANE and played HEARTS OF AGE. My friend lasted just a few minutes before conceding the point.There is a little humor in this short, but it's basically as pretentious as (and perhaps a collegiate answer to) BLOOD OF A POET and other avant garde films of the time.  It is what it is: a succession of images with a vague theme, and unless you really enjoy any footage of Welles (in heavy makeup, to boot), this isn't really even worth tracking down.","This film really was NOT intended for general release. Instead, it's a recording of a production by a small theater group and it made it to the \"Unseen Cinema: 1884-1941\" set of DVDs. However, it is interesting because it features a very young unknown actor--Orson Welles.The film looks very amateurish and at times is pretty bad (such as the guy in black-face) and is quite grainy. But, as I said, it was not intended to be a release to the public--just a record for the theatrical group. The costumes are also pretty bad--and the cheap prosthetics on the actors' faces are garish. But, as a historical record of the growth of Welles as an actor, it's invaluable. Well worth seeing if you are a lover of everything Welles--otherwise stay clear, as there's little to keep you interested here.","Just watched on UbuWeb this early experimental short film directed by William Vance and Orson Welles. Yes, you read that right, Orson Welles! Years before he gained fame for radio's \"The War of the Worlds\" and his feature debut Citizen Kane, Welles was a 19-year-old just finding his muse. Besides Vance and Welles, another player here was one Virginia Nicholson, who would become Orson's first wife. She plays a woman who keeps sitting on something that rocks back and forth courtesy of an African-American servant (Paul Edgerton in blackface). During this time a man (Welles) keeps passing her by (courtesy of the scene constantly repeating). I won't reveal any more except to say how interesting the silent images were as they jump-cut constantly. That's not to say this was any good but it was fascinating to watch even with the guitar score (by Larry Morotta) added in the 2005 print I watched. Worth a look for Welles enthusiasts and anyone with a taste of the avant-garde.","\"The Hearts of Age\" is an 8-minute short film that had its 80th anniversary last year and it was written and directed by Orson Welles, who would have become 100 this year. Welles also acts in here just like his co-director William Vance. It is black-and-white and a silent film and I must say in terms of contents, it looks worse than many films that were made in the 1910s and 1920s. If this one is worth the watch, it is for how bizarre it is. The story is absolutely impossible to understand, if there even is one. An old lady is played by a very young lady actually. I cannot say this got me interested in Welles' works at all. Then again, this was his first effort as a filmmaker and he wasn't even 20 at this point, so we may forgive him I guess. Nobody's perfect. Just don't watch it.","I would normally put a plot here, but I do not know what the plot is... there is a man in blackface, an old woman, some creepy looking old men, and Orson Welles as Death.This is Orson Welles' first film. What do we say about that? I mean, can we draw a parallel to his other work? I have no idea... I do not see a germ of \"Citizen Kane\" in this one, but at only eight minutes it is hard to find much of anything in here. Especially in a film that is so blurry and grainy.Not sure what is going on with the creepy men descending the staircase or with the old woman sexually gyrating on the liberty bell. And the film's silence makes it even more of a mystery... how do you interpret this, and what does it have to do with \"hearts of age\"?"],"review-user":["ackstasis","jluis1984","MisterWhiplash","theowinthrop","tedg","mmrabin","Polaris_DiB","Michael_Elliott","Doogie D","MartinHafer","tavm","Horst_In_Translation","gavin6942"],"review-date":["3 April 2007","13 July 2007","18 October 2004","23 February 2007","28 July 2002","15 March 2004","6 May 2007","28 February 2008","12 May 1999","4 November 2011","26 August 2009","4 December 2015","19 July 2011"],"review-rating":["6","6","6","6","3","4","2"],"review-title":[" We've all got to start somewhere!\n"," Even giants started small..\n"," Practicing Images\n"," Has some potential...but little more\n"," Vaginal Bells\n"," Worth Seeing\n"," Iconoclastic and satiric\n"," Early Welles\n"," a curiosity; not much more\n"," For Welles lovers only...\n"," The Hearts of Age was a fascinating early look at Orson Welles' technique\n"," Disappointing, even for its era\n"," Some Dirty Little Film\n"]}