{"review-url":["http://www.imdb.com/title/tt0089003/reviews"],"review-text":["Death Wish 3 is the year of Rambo one of my all time favorite classic action films from Charles Bronson and it is really underrated. I love good action movies and I love the third sequel way better than the original! Charles Bronson is the best in this movie! I watched this movie more as a kid than the first two movies. I love this movie to death I have it on Blu-ray and I have a VHS tape still. There are a lot of people who hate this movie like actor Alex Winter mentioned it is one of the worst movies made in the 80's from Cannon I disagree. Charles Bronson was disappointed with the film, I wasn't. This movie it is not for everyone it is more for action junkies like my self it is for fun and entertaining.To you, this is underrated misunderstood prototypical \"good\" action movie -- intense, violent gang war on a streets perfectly executed, original action, shown to the tune of a forgettable and occasionally insulting story.This movie was filmed the same year as Rambo: First Blood Part II and honestly Charles Bronson is Rambo in the urban jungle defending innocents on the street and fight evil in New York City. New York a city pushed to edge, people pushed to the limit and no one's got the guts to stop them. But there is one way, one man who want be pushed \"Charles Bronson\" and now he is in the middle of a war. In a world gone mad there is only one law is Charles Bronson Death wish 3! Bronson is back in New York bringing justice to the streets... Death Wish 3.1985 sequel, Paul Kersey, aka \"The Vigilante\", finds himself battling street punks in order to bring peace back to a once quiet New York neighborhood. Despite the New York setting, the film was actually made in England.It's blisteringly fast paced, brutally violent, the characters from the cops to the punks to the citizens do over-the-top, unrealistically illegal things that they would all be arrested for in real life but go unnoticed in the world of the film, and the whole movie has a go-for-broke feel.I love The character development Paul Kersey is a hero in this movie helps, defends old people and week people who can't defend them self's.Kersey buys an ice cream to a kid, he shots and fights off the rapists twice in this movie. He supports and stands by Rodriguez site when his wife is raped and murdered.There is a war on the streets with punks and gang territories. I wish they would make movies like this today I really do wish that.The acting decent from everyone but a lot of the fashion is hilariously 80's. There's nothing too disturbing in this movie so the tone is lighter than the first two films. It's also well paced and moves along quickly; no need for character development, just shoot the baddies! Charles Bronson does amazing job playing his character I really do miss him. Deborah Raffin did a great job and she was really cute and likable in this movie. Martin Balsam as Bennett was beautiful at acting. Gavan O'Herlihy is really perfectly bad guy I really get to hate him and you wish he will be die already. Ed Lauter as Richard Shriker is a good cop who becomes Charles Bronson's alley.The script and the plot is alright and there is plenty action we have a lot of guns and automatic weapons and they are been used well.Paul Kersey and his neighbor Rodriguez use a Browning M1919 machine gun to kill several gang members before it runs out of ammo. Paul looks with the machine gun like Rambo in the 80's the jungle streets. Both the Browning 1919 and MG42 belonged to Kersey's late Korean War buddy Charley, who apparently acquired the weapons during his stint in the Military.Paul Kersey's (Charles Bronson) uses Wildey Hunter with an 8\" barrel in the movie (in real life, the gun was Bronson's personal pistol).I love the music score by Jimmy Page and I really love all the characters in here.10. years ago I wrote Murphy's Law is Charles Bronson best movie but my personal favorite Charles Bronson movie will always be Death Wish 3.Michael Winner did really good job directing his third and final Death Wish movie.Paul Kersey uses a rocket launcher M72 LAW and blows Fraker in to pieces and bringing justice to the streets once again.Death Wish 3 is a 1985 American action film starring Charles Bronson as vigilante killer Paul Kersey and is the third film in the Death Wish film series. It was written by Don Jakoby (under the pseudonym Michael Edmonds). This is the last Death Wish film to be directed by Michael Winner.R.I.P. Charles Bronson, Michael Winner, Deborah Raffin, Ed Lauter, Martin Balsam, Ron Hayes, John Gabriel, Mildred Shay, Menahem Golan rest in peace I really miss you all and I enjoy Death Wish 3 to death. 10/10 my favorite childhood classic action film I love it more than the original.","There are few movies out there that can honestly be called classics, Deathwish 3 is one. I must have watched this movie dozens of times, yet each time it is just as ridiculously funny. From the outset the movie explodes with laughs. Kersey's trip to jail, where he is threatened by some thug, who apparently high on goof balls, decides to attack the most giant guy in the jail for no reason and is bloodily beaten down. At this point he turns back to Kersey and curses him like it is his fault! Make no sense? Don't let that stop you, there is more where that came from. Next the police inspector beating Kersey up, then abruptly out of nowhere saying, `you see, I'm a big fan of yours'! . There are so many other hilarious plot inconsistencies. Mr.Kaprov saying `Mr.Kersey, it's 90 degrees outside!' as he is wearing a full shirt and thick sweater! Or Kersey's friend Charlie, who somehow managed to smuggle back two massive machine guns from Korea. Did he take that in his carryon luggage on the trip back? Add to all this lame romance that Kersey and the public defender have and you have the making of a masterpiece. For whatever reason, the desperate woman wants a date with Kersey. The romance that ensues is epic, until unfortunately, like all women that Kersey dates, she is horribly killed.  The final piece of the puzzle is some of the best one liners in any movie. Some include, `it's your wife, she is sick or... something' Fraker, `bulletproof just like yours asshole' Fraker, `they call him the giggler, he laughs when he runs' Bennet, \"I'll kill a little old lady for you. Catch it on the 6 o'clock news!\" Fraker. I could go on and on. You owe it to yourself to rent this extraordinary film. Truly one of the greatest ever made!","I think it definitely is. The writing is of such a quality that beginner students of the English language should model their conversations after its dialogue. For example, the exchange between Paul Kersey(Bronson) and Ms. Kathryn Davis(Deborah Raffin) (more about this character later) is extremely clear and to the point: Ms. Davis says, \"I hope you like chicken. It's the only thing I know how to make,\" to which Kersey deftly responds, \"Chicken's good. I like chicken.\" If that's not English Grammar 101, I don't know what is.Another thing about this Ms. Davis character: Kersey sleeps with her on the second date after she practically throws herself at him and tells him she wants to see him \"one last time\"(this being only the fourth time they've ever met) before she moves to her sister's house in Binghamton,NY to get away from the creeps; then he really doesn't even bat an eye while her corpse is burning in the street only minutes later. Kersey never even says her first name through the entirety of the film. Not once. Never a \"Get over here, Katy,\" or a \"That's a nice dress you wearing, Kathryn\" or a \"Be careful, Katie, or the creeps'll get ya!\"And while this 'love' is developing between the two, Fraker(Gavan O'Herlihy) keeps his ever-watchful eyes on them. It's almost as if Kersey is using her as bait to get to Fraker, much as he uses the camera or the car. Sure enough, when Fraker bites, Kersey bites back hard...in the most incredible sequence of events ever caught on film! The final fifteen or so minutes are possibly rivaled only by the final thirty minutes of Delta Force in their brilliance. And that's giving Delta Force a lot of credit. In what other film can you see Ed Lauter take out Alex Winter in order to get Charles Bronson's back, a troubled gang leader seemingly calling a hotline to summon neo-nazi bikers to come to his aid, and nimble Broadway dancers wearing mesh halter-tops posing as street punks, all laid down to a soundtrack written by none other than Jimmy Page. If that's not the highest of high comedy, then nothing is funny.Truthfully speaking, there are a thousand ways to state the unintentional comedy of Death Wish 3, but the only way to truly understand it is to watch it and judge for yourself.","This is how subtle Death Wish 3 is: there's a bit where the stupid chief stamps on a cockroach. That kind of says it all really. Why bother with laws, why bother with a constitution and why bother with a police force  they only get in the way. What you really need to keep the streets safe is a big gunand lots of bulletsand maybe a machine gun and perhaps a rocket launcher too. Because, hey, if those liberal pinkos have their way there will only be anarchy.Paul Kersey's day starts off really badly. Not only do synthesisers, weeping saxophones, twangy guitars and a smarmy piano accompany his trip to New York, but by the time he gets there his best mate has been killed. How unlucky can you get? Well, to make matters worse, one of the people that kills his best mate is Bill S. Preston, Esq. Oh, and when he gets there, just as his friend is dying in his arms, he gets arrested for his murder. Damn. But then, after getting beaten up by the police, ramming a fat porker's bulbous head through prison bars and enraging the head of a local gang, he gets unofficial approval from the stupid chief to go on a one man killing rampagewhich is nice.Death Wish 3 is a guilty pleasure. After all, it's dumb, it's fascistic and it's badly filmed, but a number of people greater than the population of San Marino get brutally killed, so it rules. I mean, how can you not dig a film where people are set on fire, thrown off buildings and shot at point blank range with a rocket launcher? Anyone with a penis should enjoy this. So if you don't like it, you're probably either a woman or Dale Winton.Where do I start when it comes to the best death in Death Wish 3? The rocket launcher killing is a classic, but the firebombing is probably even better  the punks firebomb the flat of an elderly couple and they come running out, in flames, and then get mowed down with Uzis. But then there's death by broom and all the machine gun slayings. However, I also dig the bit when a bunch of bikers, in leather daddy gear, get blasted to pieces by a bunch of disgruntled neighbourhood residents. An armed society is a polite society.But this praise for other characters takes away from the Bronsoninator's contribution. Never before has one man killed so many people. He mows down punks with his mate's Browning and then he blows them away with his unfeasibly huge Magnum  normally I'd suggest that Bronson was making up for certain shortcomings, but there's no way the man wasn't hung. And it's his Magnum technique that impresses most. He can dodge a hail of bullets simply by slowly crouching down on one knee. Genius! And then there are the people he kills. One man, who's trying to rape a black woman, is the spitting image of Freddie Mercury. Another, who he throws off a roof, is Frost out of Aliens. And he even kills The Giggler! \"They killed The Giggler, man! They killed The Giggler!\" But perhaps the best Bronson killing is the one where he coolly kills a couple of punks who are trying to nick his car. At the time he's having dinner with a Jewish couple, but he politely excuses himself, shoots the punks and finishes his grub. What a gentleman.But it's not all fun and games. Bronson's lady gets killed. But the woman should have known better. Any woman that gets close to the Bronsoninator is immediately doomed. It's the James Bond rule. I mean, we can't have our bloodthirsty heroes suddenly become happy and content, can we? So she has to die. And at least she goes out in style. She gets a headbutt for her troubles and then succumbs in a car crash. Of course, just in case she might survive, the car spontaneously blows up. You've got to make sure.Not that any of this seems to bother Bronson. He merely goes along with his bloodthirsty rampage, squinting at the targets he's going to blow into bloody pieces. And what of his targets? Well, the gang he takes on is isn't especially formidable. In fact, they're rather camp. They wear bandanas, headbands, string vests, fingerless gloves, sleeveless shirts, leather jackets, chain belts, lots of studs and one even wears a cute little cut off vest so that he can show off his rock hard abs. Actually, now that I think about it, they dress and prance like a bunch of failed Fame auditionees. Perhaps that's why they're so mad. They just want to be in a chorus line but they can't get a gig. Maybe that's why they kidnap, rape and kill the Mexican lady. They want to get their own back on any tang they can get their hands on. The way they emerge from their hiding place  the bushes, of course  certainly suggests this. They leap out like coked-up ballerinas. But they all get brutally killed, so their Broadway ambitions go unfulfilled.But hey, who cares about the punks? Not I. Indeed, Death Wish 3 has made me see the light. All we need to keep the streets safe are viscous vigilantes, dispensing their wonderful brand of arbitrary justice. Only then will we be free from the tyranny of punks, hoods and lowlifes. I never knew that a Jewish food critic could be so delightfully fascist.","Oh my word!! I have never seen a film so lacking in any kind of moral judgement or consideration for anything other than the death of the scum! Michael Winner here makes a valid observation of human desires in displaying a gung-ho troth world of deep and damaged execution. Not only does he spoon feed us with utter hell on earth seen through the face of the moustached Bronson, but he also shows us the spoon he's feeding us with and says \"look at what your watching now look at your self and ask the question: Are you enjoying this?\" And even though you'll tell yourself NO IT CAN'T BE!!!! You'll know that deep down inside you'll know...it's a masterpiece","Most critics seem to have dismissed this film, like so many other Charles Bronson vehicles, as just another patchwork of mindless violence. And while there is a fair amount of mayhem, DEATH WISH 3 is not that awful of an effort, particularly for fans of the series and its star.This time out, aging Charlie's Paul Kersey is let loose by a police chief desperate to clean up a rough part of New York City. The trigger-happy vigilante moves into the heart of gang territory, where he once again becomes a one-man army in an urban war of good versus evil. Bronson, at least the \"older\" version, is truly at his best.I'm not saying DEATH WISH 3 is a classic. Indeed to the discriminating eye it has a plethora of imperfections. The characters are generally made of cardboard. The violence is over the top. A man well into his 60s outruns and outspooks dozens of young punks. But in the tradition of the original DEATH WISH and later films such as FALLING DOWN with Michael Douglas, it has a definite crowd-pleasing charm. Who doesn't want to see gangbangers get their due? There are also some great cheesy moments and one-liners so common in 1980s films. When a tenant of his apartment building sees Kersey setting up a booby trap, for instance, the vigilante lightheartedly says he's \"thinning the herd.\" A line only Bronson can truly make work.So you see, the key to enjoying DEATH WISH 3 is to accept it for what it is. It ain't Spielberg and it ain't art. So throw the popcorn in the microwave and have fun with it.","I'm having a lot of trouble trying to figure out how to rate this movie. As an actual film, it can't honestly score more than one star out of five. As pure cheese however, you'd have to give this movie a straight up five out of five.This is probably one of the worst movies I have ever seen. The catch is, it's so bad that it's actually good. Make sense? The movie is infinitely rewatchable and you can always find something new to laugh at every time you pop this sucker in the player. There is very little to tell you about this movie other than if you haven't seen it, you need to. It's unbelievably violent and Ol' Chuck mows down at least a hundred gang members throughout the film's ninety minutes.I can write an entire dissertation on this film but I've already seen it done on the Web on quite a few sites so I'm not going to bother. Just to remind you, the movie is so bad and unintentionally funny (watching the film again, it'd make sense if the filmmakers were going for laughs) that if you haven't seen it, you need to.I'll leave you to ponder this one scene and decide for yourselves whether or not this movie is for you or not: Gang bikers come down the street. Angry civilians wait with a chain stretched across the road. Bikers come and are clotheslined off of their bikes when the chain is yanked upwards. While the bikers are on the floor, the civilians come out and shoot all of them, point blank while they lay writhing on the floor. Men, women and oh yes, children come out and join in the festivities, dancing around the dead bodies of the bikers.Sigh. Instant classic.RATING: * out of *****. SHLOCK-O-CHEESE RATING: ***** out of *****.","What a romp this is. The great Kersey (Charles Bronson), ignoring advice to lay low for a while (like ten years!), relocates his trigger finger and bad attitude to New York City.A long sequence where Kersey runs the streets shooting at everything in sight redefines this as a crazy modern Western. All sense goes out the window and the angry vigilante's original reasons for revenge fade slowly into the bullet-ridden background.You get exploded thugs, burning cars, bodies through glass, dozens of bullet-riddled corpses and a lurid directing style that is perfect for the material.Not as fine as DEATH WISH 2, but fine, nevertheless.","Paul Kersey(Charles Bronson) turns into a one man army when Fraker terrorizes the old people who can't afford to move out, seems these punks need a lesson in manners and Bronson is there to deliver it. Whether it's by using a board to smash anyone who opens the window, putting a bed of nails by the window to prevent someone from setting foot in his house or using big game pistol gunfire to keep giggling thieves at bay, Bronson is determined to give these punks a lesson in etiquette. Back in the 80's no film was half as cool as a movie with an action star and a giant body count. Death Wish 3 was no exception and while I loved the movie as a teenager, it's only fitting that I bought the DVD and love it even more today. Cannon films were awesome back in the day, they made terrible movies, sure, but more often then not it was campy bad movie fun, not unlike this one. Indeed where as you can only watch a good movie once, you can watch this one ten times and never grow tired of it. I could watch this over and over again and I may just pick up another DVD just in case I ware it out. I think that speaks for itself.* *1/2 out of 4-(Pretty good)","This movie is truly a classic 80s movie! A must have in any '80s' movie collection! Guns, Bad Guys, CREEPS, Gangs, CHARLES BRONSON and more CREEPS!!!! In my opinion, this is the best Death Wish movie. Tons of non-stop action! And keeping with the classic 80's \"bad guy vs good guy\" movie - this movie is about anything but the norm and all about guns and CREEPS! We see Bronson mowing down thugs and CREEPS with a 30 caliber Korean War heavy machine gun! A HEAVY MACHINE GUN FOR CRYING OUT LOUD! When Charlie runs out of ammo for the Heavy Machine gun, he runs back to his crib and takes up arms with his long range high caliber pistol! This pistol can stop a freakin ELEPHANT and Charlie is putting holes the size of hub caps into bad guys with it! And if that is not enough, Charlie is also packing an anti tank grenade launcher, which by the way, is only good if he can get the CREEPS clumped together.The acting in this movie is \"ha ha\" great and a lot of off the wall actors (mainly playing CREEPS) appear throughout the movie! The film is loaded with memorable one liners and scenes! Heck, my favorite scene/line is where the CREEP leader confronts Broson in Jail and calmly explains to him: \"Tell you what I am going to do ...I'm gonna kill a little old lady ...just for you! ...catch it on the six o'clock news\".Is this film violent? Heck yes! But, you'll laugh and cringe all the way through!!!!","The third film of the Death Wish series is probably the worst of them, but it's a guilty pleasure of mine. I do so love the violence when the East New York neighborhood awakes and throws off the rule of punks.After roaming the streets of New York in the first film and going back to Los Angeles in the second, Charles Bronson as the legendary urban vigilante Paul Kersey returns to New York to visit an old friend who is found murdered. He's questioned, but let go, but the police captain of the beleaguered 75th precinct which in real life does include the East New York area of Brooklyn, Ed Lauter, let's him go with a promise to unofficially do his vigilante thing in that neighborhood. It's getting so that the punks are seriously challenging the citizens in population growth.Back in the day the East New York area was this middle class neighborhood of homes and churches that so typified Brooklyn. It became a prime example of urban decay. I well recall a local Assemblyman Vito P. Battista who also ran for Mayor of New York several times, declaring that it looked like London after the Blitz. Vito wasn't far wrong. And that is the real East New York you are seeing, lots of blocks of abandoned buildings and empty lots.As in all Death Wish 3 films Bronson gets himself a woman and it's her death that galvanizes him into action. In this case it's Deborah Raffin who the punks set up in a fiery car crash. That last half hour of Death Wish 3 is an urban fantasy when the whole neighborhood becomes a battleground as Bronson leads an aroused populace to clean up the neighborhood. Can't describe it, you've got to see it to believe it. More urban slime gets eradicated here than in all the other Death Wish films put together.You have to see Death Wish 3, it's trashy, it's one of the most politically incorrect films ever made and great fun.","By the time the third Death Wish movie came out in 1985, a basic formula was in place which varied little from the second Death Wish movie onward. First, Charles Bronson's character, Paul Kersey, would have a relative or close friend murdered by street scum. Further mayhem would befall ancillary characters so as to goad Kersey into a righteous killing frenzy. One significant variation that this formula allowed is that in each succeeding movie the weaponry Kersey will use to blow away assorted miscreants will get more and more elaborate. From the hand pistol Kersey used in the first Death Wish movie, we now get enormous elephantine hand guns that could actually kill a real elephant as well WWII Browning machine guns as well as grenade launchers by the third film. Also, the criminals Kersey is up against aren't just assorted street punks as in the first Death Wish film but now a criminal army with enough firepower to take on the Iraqi insurgents in Baghdad.What is truly striking in the last 30 minutes of the movie is that with the mayhem going on, the government didn't force the issue and send in the US Army to restore order as the Union Army did do in New York during the Draft Riots of 1863 while the Civil War was going on. Another priceless moment in the film is the ease with which Kersey is able to receive serious ordinance through the US mail. If it really was as easy as shown in the film, Al Qaeda and other terrorist organizations really missed an opportunity in arming themselves in the US.Like I said, the film defines improbable to extremely unlikely. It's a revenge fantasy of truly baroque extremes and frankly enjoyable on that level. In the Death Wish world, there is no moral ambiguity. There are good decent people and then there are street scum. Here, the street scum harass, maim and kill the decent and the police are oddly helpless. Even though the criminals are dressed so garishly and distinctively from the characters who are good and decent, no one seems able to obtain any evidence against them. So, the only solution is just to shoot them dead. It's nice that the criminals in these films are all unredeemable psychopaths who dress quite distinctively so even a child could kill them with a clear conscience(as a few do in one of the many disturbing scenes at the end during the big shoot-out). In sum, not total trash, not really good, fascistic in a really simple-minded way (for a more complex pro-fascistic perspective, I recommend viewing the Depression political fantasy film, Gabriel over the White House, from 1933) that doesn't go beyond offering shooting street scum like turkeys as a way to solve crime but undeniably exciting.","This classic has so many great one-liners and unintentionally hilarious scenes that I don't even know where to start. If you want advice on dating, its here. Just totally ignore the person you want, and then spout out classic lines like \"Chicken's good...I like Chicken\", and before you know it you will be having a one-nighter in a basement (it's a NICE basement) with a woman who is 35 years younger than you. Bronson does it all in this film. He buys a car for no good reason just so he can murder two gang members...paying with \"CASH\"......chunnng.... He buys an ice cream, simply because \"this is America, isn't it\", and ends up wasting someone named \"the giggler - he laughs when he runs\" just because he stole his camera. By the way, this \"giggler\" is so fast that Bronson's regular pistol can't even catch up to him, he needs to order a special one just to get this elusive creep. He gets cleaned up just so he can eat a REALLY smelly meal (stuffed cabbage) in a rat trap with a couple of old people who like to wear heavy clothing in 90 degree weather. He goes into the dentistry business. He always seems to find a crow bar when he needs one (and its the same one!). And last, but not least, he always seems to have a rocket launcher at his disposal just in case he needs to blow away Richie Cunningham's older brother Chuck who is now strung out and in dire need of a makeover. Anyway, this will all make sense once you have seen this classic...all I can say is enjoy! \"I owed you that one DUDE\"","One of the most magnificent movies ever made. The acting of Charles Buchinski (later known as Bronson) is simply outstanding. This is the crown on the career of director Winner, who himself was often quoted saying this was his masterpiece. The plot has been copied many times, but it's never been topped. Wildey J. Moore, the gun manufacturer, many times claimed his brand's growth since the mid 80s can be fully credited to DW3, and rightly so. This is not just a movie, this is art that many generations will admire and appreciate. Although this movie has never been fully appreciated in the USA, it has found a huge following in Europe and Asia, where the movie is regularly shown at film schools and it is still a popular hit in student cinemas all across Europe. All in all, a true classic.","Charles Bronson is back in his most famous role.  In my opinion, this is by far the best film of the series and my favorite movie ever.  This movie doesn't take itself seriously, because the filmmakers knew that all the social commentary that was necessary was put across in the first film. Golan and Globus made this film for Bronson fans, not for the critics, and it works.  DW3 has been unfairly criticized as \"trash\" and \"a weary entry in a worn out series.\"  These statements would be true if the film was made to be taken seriously or to spread a statement, but it wasn't.  If you take it as what it is, DW3 is just a fun, action packed romp, with Charlie doing to street punks what we all wish we could do.  The action is non stop, the atmosphere is great, and the movie is just out and out the best Bronson flick ever made.  You can tell that the penny pinching Cannon group spent a lot of money on this one.  It is believed that Bronson thought this film was too violent, and that was the reason why Winner didn't direct any of the following entries.  I can understand his concern, but as is always the case of sequels, you have to push the envelope even further to pass a previous entry.  In any case, this movie was no more violent than any other movie made during this time.  What makes DW3 the best of the series and my favorite film ever (not the best, just my favorite), is the action, Charlie's presence, memorable villains, and it's ability to get the viewers to jump on the bandwagon.  The first film may be the most technically well made, but this one is the most fun.  For once, Charlie actually has some clever lines (although he doesn't say much)and a halfway interesting story, photography, action, and direction to back him up.  Charlie has never been more intense or super cool than in this one.  Yes, it's exploitive, maybe it does promote stereotypes, and maybe it is the same story as before, but Bronson's films always have and always will stand for defending the common man and giving his audience what they want to see.  Many argue that the DW series manipulates its' audience, my reply is that the movies don't manipulate us, the fans are the ones in charge.  We demand that Bronson blow away deserving scum, and in turn Winner and Co. deliver the goods.  And for those of you who still want to put it down, remember a few things.  DW3 was the #1 movie in America when it came out and was among the viewing favorites of millions of people on video and television because they realize that not all films have to be epics, they just have to be fun. **********/10 You can't get any better. John Batchelor","Wow! What a movie! I can't get over how much I enjoy it! I watch this movie time and time again and enjoy it more and more. This is by far and way the best of the Death Wish series.The directing is superb, (particularly the scene with Charles and Ed Lauter patrolling the streets shooting punks to a funky 70's soundtrack.)Winner builds up just the right amount of tension, action, humour and emotion at exactly the right moments. There is a high standard of acting on display here. Apart from Charles's flawless performance, there is a career best from Ed Lauter here as the vigilante cop. The plot is superbly written, the only drawback is, it was too short! (I hope they bring out a DVD version with extra scenes soon) Best Bit:- Hard to choose, there are so many classic scenes. Lookin for trouble ma'an? (You'll know what I mean when you see the film) Best Line:- Tell you what I'm gonna do. I'll kill a little old lady, just for you. Catch it on the 6 o'clock news!","This simply wondrous work of pure celluloid art deserves much better than the usual synopsis and critique format. So instead I'm just going to list reasons why this picture rules. 1) Charles Bronson as the ever-unflappable Paul Kersey is the very epitome of stoic, laconic and unflappable vigilante cool; this guy not only kills countless low-life criminal scum with a winning mix of style and ingenuity, but also sports one hell of a snazzy mustache to boot. 2) The street gang featured in this flick is a pretty mean and colorful bunch: Gavan O'Herlithy as vicious leader Fraker (you just have to love his gnarly reverse Mohawk haircut), a pre-\"Bill and Ted\" Alex Winter as the sleazy Hermosa, Ricco Ross as speed-snorting psycho Cuban, and, best of all, the incredible Kirk Taylor as swift, maniacal, chortling klepto the Giggler. Moreover, the gang is multi-racial, which enables the filmmakers to treat us to the touching and inspiring sight of various whites, blacks and Hispanics gleefully engaging in rape, murder, robbery, extortion, destruction of private property, and other such no-count nasty antics. 3) The dialogue is sheer cut-to-the-bone terse and eloquent poetry. Martin Balsam as tough World War II veteran Bennett Cross bellows the following heart-shattering lines as he watches his beloved place of business go down in flames: \"My shop! My shop! That's my shop!\" 4) Deborah Raffin as feisty public defender Kathryn Davis supplies some mighty fetching eye candy. Alas, after Raffin becomes romantically involved with Bronson the poor gal gets bumped off by the bad guys. Boy, now isn't that a shocking and unexpected plot development? 5) This no-holds-barred fierce and unflinching flick declares open season on everyone: pretty young women are raped (including foxy future \"Star Trek: The Next Generation\" TV series regular Marina Sirtis), little old ladies are brutally butchered, countless evil street slime are blown away, folks are set on fire, and Fraker even gets blasted into the next dimension with a rocket launcher. If raw, savage and over-the-top violence is your thing, then this movie is your crack, baby! 6) The acting is truly Oscar-worthy. Special kudos here to Joseph Gonzalez as Rodriguez; the scene with Gonzalez punching a table with tremendous angst and fury after he's told that his wife has just died is positively gut-wrenching in its stark poignancy. 7) Bronson packs plenty of heavy artillery. Besides the aforementioned rocket launcher, Charlie also uses a Wildey automatic and a vintage Browning machine gun to waste the villains left and right. 8) Legendary rock musician Jimmy Page whips up an exceptionally funky-jammin' jazz-rock fusion score. 8) Director Michael Winner treats the laughably ludicrous material with deliriously misguided seriousness, thereby ensuring that the cartoonish carnage rates as often sidesplitting and always entertaining high camp at its all-time most gloriously absurd and wildly implausible. The last third with the already cruddy urban cesspool neighborhood degenerating into an all-out war zone is the hilarious stuff total kitsch is made of. A true 80's action masterpiece.","Paul Kersey has returned to New York to visit an old war buddy, but finds his mate lying dead in his rundown apartment. Who did a gang of thugs who rule the area beat to death. Kersey gets accused of the murder when the police arrive and he sits in the cell for a while. Although the chief of police realises who he is and decides to let Kersey bring justice to this untamed part of town that they can't seem to control. So Kersey takes up residence in his late friend's apartment, befriends those living there, starts seeing the public defence attorney and goes to work to finally rid this neighbour of their out-of-control mugs.Talk about over-the-top! The first two films were searing thrillers that realistically exploited its leering material with scathing pot shots or gritty intensity. Instead this addition (which would be director Michael Winner's final outing in the series) goes for an all-out action romp that's excessively cheesy and outrageously delirious. With that on mind. Most of the fun is to be had with this particular item of the franchise. The seriously dour nature of the earlier films don't really evolve within this one, because Winner favoured more of a tongue-in-cheek style of mayhem that basically parodies (don't know if it was intentional, though) what he done before. Suspenseful thrills are replaced by bigot action looking for nothing more than a large body count. This really does let loose in the film's cracking climax, where no one is safe from the colourfully cartoonish onslaught. What can one say? It's an urban jungle out there for some but Kersey sees it as a shooting parlour. And his well equipped (carrying a Wilbur Mangum and holding onto a rocket launcher) this time to take out the trash! Sadly though, Charles Bronson is looking terribly downtrodden in the role. He might be sleepwalking it, but what he brings to the table a resourceful character that you can't help but cheer on. Even though the feeble script doesn't emotionally pull you into his compassionate plight like the previous two. The contrived story is pretty much bare bones and very stereotypically (like the multi-race living in the apartment building who finally stand up for their rights as citizens) plotted. The police really do get a touch up in their incompetence of how they do things and their lack of actions. It really does leave a sour taste in your mouth, which I'm sure that's what it was aiming to do.While, the obligatory romance sub-plot is beyond forced and only there to give Kersey more motivation when needed. An adorable Deborah Raffin plays Bronson's love interested, but with her talent she's wasted in a throwaway part. Ed Lauter trumps in with a quality performance of the cutting, hard-nosed NY detective. Gavan O'Herlihy perfectly cooks up a storm in his nasty role as Fraker the gang leader. With features like his striking hairdo and cold-stare, he managed to reek of brute fear and be sufficient in leading the chaos. Making an appearance as one of the wild punks is a young Alex Winter (who'll be best known for \"Bill and Ted's Excellent Adventure\"). The rest of the supporting cast are reasonable. Winner's direction is durably crafted and tautly laid out in its no-bars framework to shove it in your face. Again for such a lesser sequel, Winner makes it look reasonably up to par despite it being a flawed technical production. Although it is being set in NY, it was basically shot in London. Its stays on a few locations and at times they come across as purely sets. An impressive array of camera-work is on the ball by John Stainer. Attached to the music score was Jimmy Page again. Instead of the sickening riffs presented in number 2. It's oozing with a more sweepingly funky and overpoweringly scorching rhythm.A different breed that might be considerably toned down in its rough exploitative nature, but the gung-ho violence does run freely and you got Bronson walking the walk of death. For a quick fix, you can't go wrong with ultra-chaotic and downright brainless \"Death Wish 3\".","Classic Bronson, one of the best of the Death Wish films. In the original Death Wish, Bronson used a snub-nosed pea shooter to take out the trash. But in this one, he used a variety of military grade weapons, including the .475 Wildey Magnum, surely one of the most iconic handguns ever, which he made famous with this movie (to this day, he is featured very prominently on Wildey's website). He also used a belt-fed Korean War era heavy machine gun and mail order rocket launcher, among others!! Pure '80s take-back-the-streets fantasy, but it's oh so fun. New York was a virtual war zone in the '80s, so the desire to simply blast the creeps and clean up the neighborhood was very attractive to many. Since you can't really do that, just let Paul Kersey do it!! By all conventional means, a terrible film, but I love it! Between the comically stereotyped characters such as the cartoon gangsters, the elderly Jewish couple, etc and numerous cheesy lines, there is no way to justify liking this other than pure BRONSON. Bronson's unflinching delivery is so simple and direct, and he has no moral objection whatsoever for example to baiting two punks that were trying to steal his car into a deadly showdown, which he wins of course.Highly recommended for Bronson fans!","Thus continues Paul Kersey's journey through lands densely populated with criminals...In this installment, yet another of Paul's friends dies at the hands of thugs. But Paul's not going to stand for it-- he'll take the law into his own hands! Again! Naturally, the dark spectre of crime follows him like a bad penny. In a single afternoon he witnesses more felonies than most of us will see in a lifetime.Paul's new neighborhood is a checkerboard of cinder-blocked windows, bodegas, flophouses and piles of rubble. His slum is populated by various law-abiding ethnic types being tormented by a motley gang of knuckleheads who aren't willing to let Paul take control of their turf. Some of the ne'er do wells have a funny logo painted on their foreheads. By day and night they rape, pillage, murder and invade the homes of innocents.Yet -- paradoxically -- the area remains bustling with civilized activity. In the face of danger, its citizens brazenly (or ignorantly) go about their lives. But there is a stiff penalty to pay for such defiance and only the swift arm of Paul Kersey can put it right, all the while inventing new ways to extract teeth from would-be burglars.Classic formulaic film-making from Cannon films! 6/10","I have to agree with with many other commentators on this site that this is one one those \"so bad that it's good\" movies. Wooden acting, unbelievable dialog, unbelievable amounts of violence, two pairs of bare titties (by my account), all presented by Golan and Globus, the B-movie schlockmeisters behind the Cannon Films Group of the 1980s.The tone for this film is set just a few minutes in, when NYC cop Ed Lauter punches a seated and handcuffed Bronson in the the face because Bronson asked a question about his Constitutional rights. \"I'm the law! That means I get to violate your Constitutional rights!\" Lauter exclaims. From his position on the floor, Bronson kicks Lauter in the nuts.This doesn't suit Lauter well, so he tosses Bronson into a cell, without formally arresting or changing him with a crime. In the cell, Bronson is challenged by a small, break dancing black prisoner, who asks if he is \"looking for trouble?\" Bronson passes him by, so the small black man punches a much larger, muscular black man in the stomach for no apparent reason. The larger black man punches back, decking the smaller guy. As the smaller guy lays screaming on the floor, he shouts \"you f*cker!\" at Bronson. You might want to pause the film at this point for a laugh break. I know I did.Another few personal favorites:  the buff gay black guy in the cut-off tank top who got killed once or twice, but still kept coming back  first exposition of the Wildey handgun, basically the most powerful handgun on Earth. NRA porn. Even I wanted one, and I don't like guns.  the uniform cops who, in a neighborhood exploding with gang violence, bully an elderly Jewish couple into surrendering their handgun  the pretty pro bono attorney Bronson f*cks and then apparently has no emotional attachment to when she dies in a fiery vehicle crash (are there any other kind in Hollywood movies) minutes later  Riot police or National Guard not appearing as an urban neighborhood descends into chaos  Ed Lauter joining Bronson towards the end in a final all-laws-are-suspended fight at the OK corral kind of confrontation with the bad guys","Now, here's the thing, the Death Wish series started out with a pretty good crime drama, that didn't really have too much action, and took itself pretty seriously. Charles Bronson was excellent, and it was altogether a pretty decent movie. Then the 80s happened. This movie is nothing like that movie was, for it has simply become a brainless 80s one-man army action B-Movie. But that is just why I love this film so much. It's just plain awesome. Ridiculous and cheesy? Hell yeah. Completely over the top? Definitely. But a blast to watch? Oh yeah! It starts out with good ol' Paul Kersey visiting a friend in New York City, only to arrive and find him dead, with the police arriving and arresting him as a suspect. He is allowed to go free, in exchange for one thing, he must return to his old vigilante ways and clean out a neighborhood gang before they tear the city apart. After that, the plot doesn't matter much, it's the same as the rest of the Death Wish movies. But none of that matters. He moves into the neighborhood, makes some allies, gets some guns and from then on it's just senseless, ridiculous violence. The film has a crazy high body count, mercilessly killing easily over a hundred people, (He even kills the Giggler! He killed the Giggler!) and the film just keeps getting steadily more violent until the ridiculously over-the-top ending, with the practically invincible Pail shredding his way through any and every member of the gang with weapons he bought by mail (Where exactly do you order a military-class rocket launcher from anyway?). This movie is completely ridiculous and over-the-to, but I would recommend it to any action movie fan. Even if you can't enjoy it like I did, you can always find ways to laugh at it's overall ridiculousness.","I'm very tempted to give this movie a 10. In some ways it might have been genius, but that would be giving the film makers far too much credit. It's absolutely godawful, but it's incredibly hardcore. Every few minutes there's another unbelievably brutal moment where Chucky B. whips out a giant weapon, utterly brutally beats the life out of someone, or sets up a contraption of massive pain. But trust me, aside from it's Chuck B. style insanity, it's amazingly bad. It's filled with bad humor, horrible lighting, and by far the worst dialogue you'll ever find.But I suppose I'd recommend it. If you have to see one really bad movie, make it Death Wish 3.","This movie is so over the top that it's brilliant! It's hard to believe that Bronson is supposed to be the same character that he played 10 years earlier in the original classic, Death Wish. In that movie he realistically became physically sick after murder, while here he casually kills everyone with a heavy machine gun from the Korean war, and a rocket launcher that he receives through the US mail! The total absurdity of the plot is absolutely incredible and the dialog is so bad that its hilarious, 'Chicken's good. I like chicken.' But in what other movie could a man in his sixties successfully fight a war against a huge gang of Fame rejects and Nazi bikers, without suffering any injury whatsoever? A woman half his age also desperately throws herself at him for some unknown reason, and is promptly killed by spontaneously exploding cars. The movie also features Richie Cunningham's older brother as the evil nemesis, a naked Lt. Troi from Star Trek, and Bill taking some time away from his excellent adventure. All of this and a finale that's so outrageous that it has to be seen. A truly memorable masterpiece of a movie!","LOL.The mere fact that I start off my review with 'lol' says it all. I used to watch this movie all the time as a kid; and even then I sensed the silliness of it all. The low budget, horrible acting and lame script was ever apparent back then. I watched it again yesterday and just couldn't stop laughing. It's so bad it's actually good lol. Like another reviewer said, it doesn't take itself seriously. There's no way one could look at this movie and say that the makers did so. The soundtrack is so funny, I laugh every time I hear it. The 'climax' is just a laugh riot. It's an all out war zone in New York, full of explosions and total chaos...so ridiculous you can't help but chuckle at the sight of it. Other hilarious moments: The scene with Kersey and the cop running side by side like 2 cowboys against the whole Wild West was so cheesy it was funny.-It killed me how the bad guys could be shooting at Kersey and he could even drop down on one knee taking ever-so-careful (and slow) aim and not get hit LMAO. Of course, with him it was one shot-one kill with his elephant handgun LOL.Another hilarious scene was the end when he finally killed the leader of the gang....with a ROCKET LAUNCHER lol...destroying the whole side of the apartment building with it.It's apparent that Kersey is all but used to losing loved ones...when his new girlfriend is quickly disposed of after only a few dates. The acting is so bad that you can't blame anyone that could only think that Kersey is mad at the destruction of the car lol....he runs down, looks at the carnage and just walks away.Again, so bad, it's good.*** out of **** stars."],"review-user":["ivo-cobra8","captainky","jerk1","Ricky_Roma__","coldshitaction","ReelCheese","Mr Parker","fertilecelluloid","fmarkland32","tgs333","bkoganbing","Tobias_R","cny_cd","johnvandrunen","chelle-3","Tramps","Woodyanders","lost-in-limbo","Enforcer686","huboon","larrylunts","swfan94","diversitycommittee","sometimehere","lotus_chief"],"review-date":["4 April 2017","4 July 2002","27 July 2004","14 August 2005","19 July 2001","25 August 2006","5 December 2005","14 January 2004","12 June 2006","15 December 2004","3 February 2008","2 September 2006","21 February 2007","19 September 2005","2 January 1999","12 July 2000","16 October 2008","25 January 2007","2 February 2010","20 January 2005","9 April 2014","11 January 2009","2 February 2005","26 October 2008","2 May 2005"],"review-rating":["10","10","8","7","5","6","10","5","4","10","10","10","10","7","9","6","1","8","1","10","7"],"review-title":[" An underrated decent Action flick from the 80's the year of Rambo my all time favorite\n"," Truly a movie for the ages\n"," Death Wish 3: Unintentionally the Funniest Movie Ever?\n"," Comedy gold (spoilers throughout)\n"," Soul Grinding Fun!!!\n"," Bronson At His Best\n"," Order your rocket launcher today!\n"," Ridiculously enjoyable urban romp\n"," Could it be possible that his wish is their command?\n"," \"it's my car\"\n"," Urban War Zone\n"," This Movie is a good definition of \"over the top\"\n"," Stuffed cabbage............Smells WONDERFUL........!\n"," Top notch. A true undervalued masterpiece\n"," The Best Of The Series\n"," The Greatest Film Ever Made\n"," Reasons why this movie rules\n"," Move over Death, here's Paul Kersey.\n"," \"I sent them a message\"\n"," Oddly compelling Cannon fodder\n"," Death Wish 3 a Laugh Fest\n"," Just plain awesome\n"," I have absolutely no idea...\n"," A masterpiece\n"," A classic in it's own way....\n"]}