{"review-url":["http://www.imdb.com/title/tt0080419/reviews"],"review-text":["In the 1980's this film arrived at theaters in Stockholm and soon garnered surprising praise and accolades. This is not uncommon as Swedish directors are not as hung up or uptight about life as Americans who are easily offended. This imaginative, stirring, unabashed and wonderful film, originally called 'Children's island' became \" Barnens O \" for the Cinema. With a refreshing sense of originality, it tell the story of Reine Larsson (Tomas Fryk) an eleven-year-old Swedish boy on the verge of puberty. Noticeably disturbed by the onset of his twelfth birthday, he displays a deep seated fear he will become as corrupt as every other adult. Living with his single mother, Harriet (Anita Hirdwall) and her abusive boyfriend Stig (Ingvar Hirdwall) in a less fashionable part of the city, he is informed he will be going to Camp for the summer. Realizing this is not his choice, he decides to forgo Camp and instead spend his vacation wondering throughout the city. Once he tricks his mother, he soon discovers each day must be recorded in his journal as he is certain each brings him closer to maturity and death, something which he dreads with impending doom. The movie becomes one long segment of Home Alone (Swedish Style). Traveling about, he encounters the lessons of life with stark brutality. Seeking the 'Purity' of first love, he is threatened with many dangers, and somehow discovers each has cost him a bit of innocence. The film is long on story and punctuated with brief nudity and stark images which only the Swedes could offer an audience. The main star, Tomas Fryk personifies the true talent of an emerging Thespian. Recommeded to anyone longing for an honest portrayal of youthful adolescence. ****","The very few reviews I could find online of Barnens ö really do not do it justice. I read them all before ordering the DVD, but for some reason I ordered it anyway. I regretted it almost immediately, but the order had already gone through so I couldn't cancel it. I'm very glad now that I couldn't. It's an extraordinary movie.I won't give a synopsis of the plot, because other reviewers have already done that. But I will say that I don't understand comments that it's bleak, shocking, weird, clinical, depressing or pornographic. It is certainly very unusual, which I suppose could make it seem weird to some people, but the other criticisms must reflect the reviewers' own issues, because I didn't see any of that in the movie I just watched. I'm not attracted to boys, so the nudity didn't seem pornographic at all to me--it's just a kid trying to figure out who he is with no help at all from the irresponsible adults in his life. And it's Sweden, not Utah, so topless women are no big deal.But what surprised me most is how positive the movie is in its depiction of this gutsy lost kid who goes on a sort of Odyssey through all sorts of strange experiences, looking for--and ultimately finding--himself. It's fascinating, thoroughly original, and deeply satisfying.I'm not at all surprised that Barnens ö won three major Guldbagge awards, for best film, direction, and actor, but I'm absolutely astounded that the actor who won was not Tomas Fryk, the kid whose fearless performance as Reine must be one of the most remarkable ever filmed, but Ingvar Hirdwall in the relatively insignificant role of Stig, Reine's mother's sleazy boyfriend. I don't understand that at all, but it doesn't alter the fact that this is a great movie.","10 year old Renee lives in a Stockholm suburb alone with his mother. She has only limited time and heart for her boy. Her lover Stig is a scary and frustrated loser. When Renee's mother leaves home for a summer job in  another town, Renee is \"deported\" to a summer camp. But he chose to stay home alone, living one last summer of innocent childhood in the city. He soon meets and befriends some of the lower existences and gradually slides towards criminal activities. The boy has a very special live-philosophy: Lust is what makes grownups crazy - and only children are sane. And his experience of miserable and selfish adults only supports this view. But the boy knows, that he himself will come into puberty - where everything ends! Therefore he makes a daily inspection of his genitals in search of pubic hair. He thinks that hair is the sign of corruption, and he befriends an adult young woman with no hair at all. He thinks she is \"pure\", but the bald woman turns out to be just as lustfull and selfish as everyone else. There are a lot of dirty words, sexual references and nudity in this movie, which might offend some. It could even be considered (child)-pornographic. But it is a highly artistic and very conscious film, and it has been shown several times on Swedish and Danish TV, public channel prime time. The film gives a very remarkable and outstanding, but also depressing, view of childhood.","Telling the story wouldn't be the point at all, would it? Barnens ö, spelled almost like \"booné aww\" is the title for that brilliant novel of the late seventies that shocked a lot of people, including myself.Children's Island is the title, and what an island. In the book, Raine, the main character has The Guiness World Record Book as his own Bible. And he's keen on breaking new records himself. In particular the youngest person under water for three minutes.The story is, as most Swedish films and books of the time, deep, consciously provocative and awe inspiring. Bergman was beginning his final film and Cries and Whispers was barely out. expectations for any Swedish film were pretty high. They taught us then that great theatre, great actors, superb writers and gifted directors made a veritable team of perfection in cinema.All this said, Barnens Ö is a story of discovery. It is, too, a story of alienation: cities are alienating and living in one of them make us aliens to most of its residents. It is a story of revelations and sudden encounters with our own destiny. It is a film of overwhelming hope and desperation. Of feelings buried under layers and layers of isolation and insulation from a world that couldn't care less...This approach, in itself, is a pretty difficult way to weave a convincing narrative. Here, the masterful guidance of Kay Pollak on Ola Olsson's script of P C Jersilds novel, turns it not only in a possibility, but in one of those master pieces of cinema.I may disagree a bit with someone who said that this work was all but forgotten. It is not. Even as I write this in 2009, discussions on P C Jersild's story are conducted all over the world, and the film shown at many film schools and small theatres.Why? Waxing philosophical on all of it would be difficult and many have already done it scholarly through writing and lectures. The reason why Barnens Ö was and IS a special story is the cosy feeling you get from the start when you discover that everything is told through the eyes of a small child. And that's where it ends, too. Maybe it's a clinical view, as someone else pointed out. But deeply disturbing, moving and satisfying. The concept is deep: as long as we have no pubic hair, we still can live one more day as an angel. Afterwards, we'll become what Raine reflects as the colophon of his experiences: \"Men are Pigs\". He finds his fears when he's fearless. He finds love when the world is crumbling around him. He discovers a reason not to behave like the grown-ups because he refrains from committing crimes. He let go his inner purity and confidence in others without reservation, just to learn how rotten the soul of a man can be.Where love is expected, he finds hatred. Where compassion is needed, he finds suspicion and cold hearts. It's a film of metaphors. A film to think and to raise questions that are hard to ask but harder to answer.In the end, the satisfaction of witnessing such a superb work (that really upped the ante for any other Swedish film after) is a ride of joy and hope. Be aware that it is a film full with the dark side of our nature. But, alas!, a film of hope and deep joy. Reine will still be an Island in Stockholm, but there is the big hope of living today in full, even when we found our first signs of sexual maturity show.","The decades which have passed since the premiere of this movie, have not treated it lovingly. In 1980 it became an immediate classic of Swedish cinema, based on a highly praised, bestseller book. Now, it's all but forgotten.Tomas Fryk, playing the boy about to enter puberty and hating it, makes a formidable performance, and went on to do a number of other films, usually with equal brilliance. But the boy he has to portray is not altogether flesh and blood - more of an intellectual construction of slightly clinical nature.P. C. Jersild, the writer of the book on which the film is based and sticks to quite obediently, is an MD, so to him the perspective might have made sense, but I would have found the character Reine easier to believe if he had not been so single-minded in his attitude to growing up.The human psyche is mysterious, for sure, and often defies understanding. Therefore, so are human actions. But one thing the mind never is, is singular. Everyone contains pro and con to just about anything. Reine lacks the pro, the longing to grow up - and a convincing explanation to why he would lack it.","I did not quite get Barnens O  it is one of the weirdest ones I have watched. The soundtrack was quite unusual as well  written and performed by Jean Michel Jarre - it makes the movie weirder than it was. I have to admit that I was almost going to change it and watch another one instead at times the movie seemed plain dumb to me, or boring  or confusing. There are quite a few sexual references in that movie  trough they too are kind of messed up . Probably the only phrase that I will remember out of it is going to be \"When you are alone, you can control things \" and \"I will show them \"- or something like that .The boy in that movie was obsessed with the idea of not growing up  \"the last summer as a child \"he thought once  and he sure lived it to the max. So if you have few hours to spare you can watch this movie  but you won't miss much if you don't.","This is one of those movies ,where nothing special is happening and then theres that one scene where your jaws drop lol.. and you're like WOW did i really saw what i just saw?\nAmazing how in those days people were more free and less judging then now , its almost like we are going backwards rather then forward with being more free.\nThat special part of the movie ,in my eyes in that one little thing people always seem to somehow forget, that no matter how cute and adorable or innocent your or whos ever child may look , when they come to thay age, they arent really much different then you (the adult). Its hard to accept that fact ,but thats the way it is.\nYes, one could say ,well they could have made that part be less obvious, we'd still get it, .. yes true, they could have, but as then and specially now, there are soo many disgusting murders and whatnot in todays movies, but somehow that is accepted and normal ,even when your 8yo is watching it, you dont mind it? Just think about it.. what is more normal to see or know about , that movie part or butchering movies.\nI loved the JMJ soundtracks in it ,and alos that airal part where you can see Stockholm from the choppa together with JMJ's music is a perfect fit! \nAs far as acting goes, well.. i've seen better but its a pass.\nAs far as the plot goes, i'd do it differently some parts of the movie were too fast , and needed to be more slow, while others that were slow, could have been more faster.","Being Swedish and roughly of the same age as the protagonist of this movie I must say that I found the story quite far-fetched when I saw it on television during the mid-80s. It was just that kind of pseudo-realism that made the cultural elite of Sweden go in trance back then. As the author of the novel, P.C. Jersild, was highly reputable, I read the novel that the script was based on, and found it overall better, perhaps a bit ethereal.Kay Pollak became, however, before long known as the 'enfant terrible' of Swedish cinema as he more or less tried to bleed the Swedish Film Institute for more and more financial support of yet another pathetic picture project of his, \"Love Me!\" (also starring Tomas Fryk), released in 1986, and an immediate flop.Pollak later on released a video show, \"To Choose Happiness\", a sort of stand up, where he discussed the subject of managing conflicts. A narcissistic female boss of mine had the staff watching it in order to manipulate us into believing that instead of reacting at her mistreatment of us, we should think as Pollak suggests: \"So she hates me? Wonder what bad things I've done? Better walk the line onwards, otherwise I'll start feeling unhappy...\" As for \"Kids' Island\", I do suspect the enthusiasts of this film of merely being fascinated by the infamous profanity in it that was staggering even by Swedish standards. One has to feel sorry for the young actor. Did he regret being there? (After all, he wasn't as bad an actor as Pollak was a bad director: check out one of his better roles in \"The 9th Company\" (1987) about a military service unit where the inductees begin a large scale operation of selling out the army supply.) It might be of interest to know that, in Sweden, documentaries or movies dealing with people exposed to various hardships frequently are referred to as \"Social Porn\"..."],"review-user":["thinker1691","jm10701","jpjensen","carlesmiquel","stefan-144","ninoguapo","aci-4","merrywater"],"review-date":["16 April 2010","10 September 2009","15 August 1998","6 January 2010","8 January 2003","9 January 2007","18 February 2018","28 December 2014"],"review-rating":["9","9","6","3","10","1"],"review-title":[" \" Being in Charge of things when you are alone, means being in control \"\n"," Wonderful movie. Much better than I expected.\n"," A boys view of lust and life\n"," Sweden at its peak film production\n"," Slightly clinical view on transit to puberty\n"," Weird movie\n"," well\n"," A Good Example of the Pretentiousness of Swedish Cinema\n"]}