{"review-url":["http://www.imdb.com/title/tt0066863/reviews"],"review-text":["Every great once in a while, you stumble upon a movie that exceeds even your wildest expectations. Given the IMDb rating of 4.0, I wasn't really expecting much with The Brotherhood of Satan. I hoped that at a minimum it might be cheesy fun like The Devil's Rain or any of the other early 70s similarly themed Satanic horror films. I couldn't' have been more wrong. What I got instead was an ambitious and intelligent film with a cast I really enjoyed. Speaking in broad terms to avoid giving anything away, the film's style and structure are much more experimental than the straightforward storytelling so prominent in the early 70s. The Brotherhood of Satan doesn't beat you over the head with plot points and explanations. A lot is left to the viewer to fill in the blanks. As a viewer, you know something is amiss, but for the longest period you're just not sure what it is. The unknown helps make for a far creepier atmosphere than most similar films. The ending is effective with its surreal imagery. I sat in amazement as the final credits began to roll. Those wanting a big slam-bang finale will be disappointed with the ending's simplicity. A lesser film would have tried to pull out all the stops and would, most likely, have failed miserably.There are moments in the film where it's easy to forget the director, Bernard McEveety, had primarily worked in television before The Brotherhood of Satan. There are a few scenes that are so well set-up, lit, and shot that even the most accomplished of directors could learn a thing or two. For example, I've seen enough films over the years to realize that directors can sometimes seem to have trouble shooting widescreen shots indoors. Not here. The scene where the men are discussing their plan of action in the sheriff's office is amazing. We see all five men at once - each doing their own thing as in real life. In a lesser film, we might see all the men at once, but each would be motionless, quietly waiting their turn to deliver their dialogue. It's a small scene, but it looks so natural and is so beautifully shot that it's one of my favorite moments of The Brotherhood of Satan.Finally, I mentioned the acting in my opening, so without going into a long-winded speech, I'll just say that The Brotherhood of Satan features Strother Martin and L.Q. Jones. Any film with these two guys is almost an automatic winner with me.","\"Brotherhood of Satan\" is one of the most underrated horror films of all times.Why it hasn't achieved a cult status is beyond me.This is a chilling tale of terror and witchcraft which contains one of the most powerful and disturbing climaxes in the annals of screen horror.In the small American town some children have disappeared and their parents been violently murdered.What is the cause of hysteria?The film is really eerie,some scenes are genuinely unnerving and definitely not easily forgotten.The suspense never lets up,the acting is really good,and the climax is bizarre and disturbing.Check out this forgotten gem of satanic horror.Absolutely recommended.","'Brotherhood Of Satan' is a very interesting and overlooked Seventies Satanic thriller. Initially you might lump it in with silly-but-fun schlock like 'The Devil's Rain' and 'Race With The Devil' but it's actually a much more complex and ambitious movie with a much more serious and less sensationalistic approach. T.V. veteran Charles Bateman and Ahna Capri ('Enter The Dragon') play a couple on a road trip with their young daughter (Geri Reischl - 'I Dismember Mama') who find themselves in a mysterious and hostile small town gripped with hysteria. Townsfolk have been brutally murdered and children kidnapped and nobody is quite sure why. Glance at the title of the movie and take three guesses! 'The Wild Bunch's L.Q. Jones (who also co-wrote and co-produced) and Strother Martin (the latter probably best known for his role in 'Cool Hand Luke' - \"What we have here is a failure to communicate!\") star as the town sheriff and doctor respectively. This is one of a half a dozen movies they made together and it is always a joy to see them sharing screen time. They made a great team which was unfortunately cut short with Martin's death in 1980.  The supporting cast also includes Hank Kimball from 'Green Acres' (!) Alvy Moore, a real kick for buffs. 'Brotherhood Of Satan' is a surprisingly creepy and effective horror movie with a sometimes fascinating approach to narrative. A movie that is ripe for rediscovery!","I had no idea what I was going to see when I decided to view this film and to my surprise its just an extremely well made horror film that is easily one of the best of the 1970's. Film is of course low budget and this is an excellent example of how the story and style of a film creates chills, not special effects! Strother Martin is one of the great character actors of all time and he has a rare starring role here and the film also stars Martins good friend L.Q. Jones and \"Green Acres\" Alvy Moore. Jones and Moore helped produce this film as well. TV veteran Charles Bateman is the star and \"Enter the Dragon\" beauty Ahna Capri is his girlfriend. Capri is in a bikini at the beginning of the film and she's just gorgeous to look at! Film does a terrific job of staying with the story and not adding a phony feel good ending and I really liked the way the film ends. Great atmosphere, interesting story and well directed by Bernard McEveety. Martins performance is top notch also as he doesn't hold back at all and really throws himself into the role of Doc. Good and underrated film!","This is one creepy underrated Gem with chilling performances and a fantastic finale!. All the characters are great, and the story was awesome, plus i thought the ending was really cool!. The plot was great, and it never bored me, plus while the child actors were bad, they gave me the creeps!. This happened to be on the space channel a while ago, so i decided to check it out and tape it, i read some good reviews from fellow horror fans, i must say i agree with them, it's very creepy, and suspenseful, plus Strother Martin, was fantastic in his role, as the Satan worshiper. It has tons of creepy atmosphere, and it keeps you guessing throughout, plus all the characters were very likable, and you really start to root for Ben and his family!. It has plenty of disturbing moments, and the film really shocked me at times, plus, it's extremely well made on a low budget!. This is one creepy underrated gem, with chilling performances and a fantastic finale!, i highly recommend this one!. The Direction is very good!. Bernard McEveety does a very good job here, with great camera work, creating a lot of creepy atmosphere, and keeping the film at a very fast pace!. Ther is a little bit of blood and gore. We get a severed leg,lots of bloody corpses,bloody slit throat, slicing and dicing,decapitation, and an impaling. The Acting is excellent!. Strother Martin is fantastic here! as the Satan worshiper, he is extremely creepy, very convincing, was quite chilling, was extremely intense, seemed to be enjoying himself, and just did a fantastic job overall!. Charles Bateman is great as the Dad, he was very caring, very likable, and gave a good show!, i liked him lots. L.Q. Jones is awesome as the Sheriff, he was funny, on top of things, looked very young, had a cool character, and just did an awesome job overall!. Ahna Capri is good as the girlfriend and did what she had to do pretty well. Charles Robinson overacted to the extreme as the Priest and didn't convince me one bit!, and that laugh of his was especially bad. Geri Reischl is actually decent as the daughter, she was somewhat likable, and only got on my nerves a couple times, i rather liked her. Alvy Moore was goofy, but very likable in his role as Tobey i dug him!. Rest of the cast do good. Overall i highly recommend it!. ***1/2 out of 5","I was 10 or eleven years old when this movie came out, and it has stayed with me for 35 years since. When the movie came out, all of the theaters in the St. Louis area distributed, as a 'lure', a pack of flower seeds that had the movie name, etc. on the front. On the back of the pack it read, in so many words....plant these seeds at midnight. If a white flower grows, you are saved.....but if a red flower grows, you are doomed!!! Suffice it to say, that for an eleven year old kid, I did not plant the seeds for fear of what may pop up. Here is the spoiler: As the movie starts out, you see a small toy tank moving about in the dirt. On a small road a family is leaving town, and suddenly the camera turns to the tank again, and it is full size. It rolls over the car, and you see bloody limbs protruding from the wreckage, then, just as sudden, the tank is small again.The reason this movie stuck with me for that long, was because I had a exact toy tank as the one in the movie!!!! Unfortunately I don't know what happened to it, but I did keep a wary eye on that thing ever since!!!Turn out the lights, put in the DVD, make a sandwich, and watch this movie. It is very good!!!","When I first saw this movie, I hated it as it made little sense. Watching it a second time was good because I discovered that it did have some intelligence to it. However, it's probably too intelligent for the audience it intended to attract. The plot conecrens the inhabitants of a small town who are into witchcraft, attempting to kidnap children for evil purposes and the efforts of a family passing through the town to unravel the mystery. Though not particularly scary, it does have some moments which really stand out and are not easily forgotten. It's also nice to see Strother Martin (an underrated actor) getting to play a lead role.","One of the best lesser known occult oriented horror movies of the seventies. It's gritty, exciting, scary, surrealistic here and there and at moments even very smart, which can't be said about many of the movies this kind. I can't help seeing some stinging symbolic and metaphoric points at the seventies society and generation stuff of the time this movie was done. The scriptwriter has obviously been cooking while delivering also some good old \"from the crypt\" kind of scenes. With a job well done from a creative director the result is entertaining and thought provoking. The simple, yet effective ending specially shows how these things are treated right by those who can.The excellent cast were mostly unknown to me, except L. Q. Jones as the moody but funny sheriff and Strother Martin as the town doctor. Martin, not surprisingly, always ends up stealing the movie. With that voice and skill he is one of the greatest loonies in movies, for me anyway. What an actor!So, it is a little bit of mystery to me why this movie has not gathered far greater recognition. I think it would deserve almost equal place in the occult horror canon alongside Rosemary's Baby and The Exorcist. One helluva movie!","I had been interested in this film for a long time, especially after reading a couple of online reviews of the DVD edition; however, I kept postponing its purchase because of the excessive price-tag and utter lack of relevant supplements. When it went out-of-print earlier this year, I finally gave in - but the entire order (which included a number of other highly-desirable titles) got lost in transit!; luckily, the DVD has been re-issued at bargain-price - and I'm sure glad I picked it up! Anyway, this is one strange film, and a genuine sleeper: initially confusing but striking occult tale which manages to hit bullseye with respect to both its forbidding small-town atmosphere and the inherent eeriness of the sinister goings-on. A small cast responds perfectly to a terse, absorbing and intelligent script: lead Strother Martin, in particular, makes the dialogue sound better than it actually is with his nuanced performance as the town doctor/head of the witch's coven; L.Q. Jones and Alvy Moore (both of whom also produced the film!) offer solid support as the no-nonsense sheriff and his comic-strip aficionado assistant.The plot merges elements of various earlier films dealing with witchcraft and the supernatural, and not only the obvious titles: the fact that the town is held under a spell which can't at first be identified, for instance, brings instantly to mind the similar affliction of one specific bourgeois household in Luis Bunuel's sublimely surreal THE EXTERMINATING ANGEL (1962)!; the 'possessed children' angle was borrowed, perhaps, from VILLAGE OF THE DAMNED (1960); there have been many films - especially of a recent vintage - where the satanic rites of a witches' coven are shown: from THE CITY OF THE DEAD (1960) to THE DEVIL RIDES OUT (1968) but, since the proceedings take place in modern-day America (albeit in remote surroundings) and revolve around elderly witches (seeking a 'renaissance'), the film they recall most of all is ROSEMARY'S BABY (1968).The occult scenes (accentuated as much by foggy exteriors as by the shadowy lighting of the garishly-decorated house where the diabolical events take place) are presented in a completely matter-of-fact way as to make them unsettling and extremely effective - particularly the opening sequence involving an army tank crushing a car(!), the rampage of a devil-doll (a concept which has been done to death over the years but, here, it raises an undeniable frisson), a surreal dream sequence (set inside the ice chamber where all the victims are kept, since they can't be buried!), a sequence where the witches attack a doubting member of the coven, a beheading committed by a horse-riding medieval knight(!) and the lengthy 'black mass' finale (with the witches, accompanied by the respective child they will be 'taking over', all dressed in red - except for a black-clad Martin presiding over the ceremony) which culminates in ritual mass suicide! The film also has the guts to deliver a downbeat 'curtain'; it's so refreshing to come across a title (albeit a low-budget production) from a major Hollywood studio, Columbia, that contrives to go so completely against the grain (like, I said, the film is quite weird - extending also to the editing and the score)! It's odd, too, that such a classy - and cinematic - horror offering {sic} should come from a TV director most often associated with Westerns and other family fare! By the way, the same theme was dealt with almost contemporaneously in the nth Christopher Lee/Peter Cushing collaboration NOTHING BUT THE NIGHT (1972; which Lee produced himself!) - a film I foolishly missed out on some 20 years back when it was shown on local TV, and which has been M.I.A. ever since!! P.S. This review of THE BROTHERHOOD OF Satan will certainly contain spoilers but, then, the synopsis and artwork featured on the DVD cover manage to give everything away anyway!","This totally odd-ball feature is a typical and prime example of satanically shocking 70's horror. The events are thoroughly confusing and it takes up quite a while before you figure out what the hell is going on, but the brooding atmosphere sucks you in immediately. Right from the indescribably bizarre intro, showing a couple of eerie children turning toys into real-life war machinery, you just know this become an uncompromising and gritty shocker. \"Brotherhood of Satan\" soon appears to be another installment in the alleged & unofficial \"creepy little town hiding a dark secret\" sub genre. A young widower, traveling with his new yummy girlfriend and 8-year-old daughter, stops in a remote little town to report a car accident they witnessed on a nearby highway. The villagers behave very hostile and insist the visitors on leaving right away. The town clearly bathes in an ambiance of fear and panic, as local children vanish inexplicably vanished and unnatural forces maintain everyone within the boundaries of town. Hillsboro is in the grip of a satanic cult, apparently ruled by the elderly members of the community. I really liked \"Brotherhood of Satan\" a lot. The story reminded me of a novel written by John Saul, but I can't remember the title. It also dealt with a cult of elderly people abusing youthful villagers for their own greedy merits. The film mainly relies on creepy scenery (like dolls and witchcraft relics) but a slightly more involving and coherent screenplay would have been nice. The subject matter often raises a lot of issues and questions, and director Bernard McEveety can't always provide us with answers. The climax is terrific, very seventies (meaning shocking) and unforgettable. Beautifully shot film, too.","For some reason in the 1970's it seemed to be a requirement for every former cast member of \"The Wild Bunch\" to appear in a low-budget satanic-themed horror movie. You had Ernest Borgnine in the ridiculous \"Devil's Rain\", Warren Oates in the underrated \"Race with the Devil\", and of course William Holden in the the overblown sequel \"Damien: Omen II\". The weirdest one though was probably this one which features both Strother Martin and L.Q. Jones (Jones, who would later write and direct the cult classic \"A Boy and his Dog\", also contributed to the screen play).It starts out promisingly enough with an entire family somehow being compacted in their car, all except for the young son who wanders off and runs into a strange group of other children. For awhile it is unclear whether this movie is ripping off \"Village of the Damned\" or \"Rosemary's Baby\", as you have this group of orphaned and kidnapped children wandering around after their parents have been done by a bizarre murder spree, AND you have a coven of decrepit oldsters led by Strother \"What we have here is failure to commun'cate\" Martin. The main protagonists are a good-looking but bland couple and their young daughter who are only passing through town, but become involved in the weird goings after they discover the remains of the compacted family. Jones plays the good guy sheriff, and Martin has a second role as the seemingly kindly town doctor. The satanic scenes are very weird with a lot of freaky shots of children's dolls, and people violently convulsing and dropping dead. The pretty blonde wife also has a \"Rosemary's Baby\" style hallucinatory dream that is like \"Coffin Joe\" on particularly bad acid. The end finally ties everything together sort of, but this remains one of those 70's movies that is a lot longer on style than on logic. Still I guess I'd recommend it if you go for these sort of films at all.","If it's not already considered something of a cult classic, then \"The Brotherhood of Satan\" certainly should be. It's one of a few interesting genre items produced by actors L. Q. Jones and Alvy Moore; the others are \"The Witchmaker\" and the justly famous \"A Boy and His Dog\". Joined by director Bernard McEveety (a veteran of mostly TV), cinematographer John Arthur Morrill (\"Kingdom of the Spiders\") and other talents, they're wise to concentrate mainly on an escalating sense of danger. In fact, the whole film has a memorable atmosphere of weirdness, not to mention some effective imagery.Its opening is one of the most memorable things about it, as the filmmakers switch between shots of a toy tank and a real one as it crushes a car beneath it. This leads us into a story (written by William Welch, with story credit given to Sean MacGregor (director of \"Devil Times Five\")) about vacationers Ben (Charles Bateman), his girlfriend Nicky (luscious Ahna Capri), and K. T. (Geri Reischl), Bens' daughter from a previous marriage. They come upon a small town whose citizens are scared silly. It seems that no one can enter (save for Ben & company) and no one can leave. Adults are dying, and kids are disappearing. The frustrated sheriff (Jones) doesn't understand what's going on and it's driving him crazy.This is creepy from the start, and gets under the skin due to a deliberate pace and some deeply committed performances, from bit players as well as main cast members. Jones and Moore are great value, as always, and Charles Robinson (not to be confused with the actor from 'Night Court') is good as the priest who comes to figure things out. Strother Martin is wonderful as the cheerful Doc Duncan who's hiding a LOT from some of his fellow citizens. There's also a very fine music score by the under rated Jaime Mendoza-Nava (\"The Town That Dreaded Sundown\" '77). The nightmare sequence in the latter half of the picture is stylishly done. And there's one noteworthy scene where a member of the coven (Helene Winston) is confronted for going against the ways of their Dark Lord.Horror buffs should give this one a try, if they're not already aware of it. It just makes this viewer more impressed with Jones and Moore that they gave genre fare a go during this period.Eight out of 10.","\"The Brotherhood of Satan\" is a singularly creepy movie. I'm surprised I haven't heard more about it. The opening sets the tone. A toy tank clicks and spins. A car is crushed flat by a very real tank, the family inside screaming. The two are cut together, no explanation provided. After the car is reduced to burning wreckage, a little boy in a cowboy hat calmly walks away, soon joined by a group of other quiet children. There is no music and the whole sequence is shot in either extreme close-ups or wide long shots. The effect is deeply creepy.\"Brotherhood of Satan\" is actually packed with spooky imagery like that. A little girl is awoken by her baby doll. Downstairs, her father reads solemnly from the Bible, unaware that his wife is having silent seizure-like spasm right next to him. On its own accord, the doll enters the room. It doesn't spring to life and attack the man. Instead, the toy simply stares him down, shaking with glee, the man bleeding from the mouth. After the parents are dead, the little girl joins a group of other children, walking off into the foggy night. The doll cries a murky tear.The movie is disinterested in plot. There is a story. A stout-chinned man, his girlfriend, and eight year old daughter are on a road trip. While stopping through the town of Hillsboro, California, they are attacked by crazed locals. After escaping, their car breaks down outside the town, forcing the three to return. Over a nightmarish pace, we are made privy to a plot by the town's devil-worshipping elderly to kidnap children, sell their souls to Satan, and take up residence in the now lifeless young bodies. The dad and town priest realize this slowly, unaware that the kindly old doctor is the ringleader of the cult. The story is purely functionary and the film outright ignores it at times, focusing instead on eerie imagery. Like a man decapitated in shadow by the sudden a black-clad rider. A child's birthday party cut together with pictures of dismembered bodies. The red face of a painted devil appearing slowly over a man reading a book. So on and so forth.The satanic lodge reminds me of \"Suspiria,\" with its checkered floors, and \"The Masque of the Red Death,\" with the way the camera glides through the '70s puke-green painted walls. The movie is largely without music. Actually, there might not be any music before the fifty-five minute mark. The direction is frequently intentionally askew, creating an otherworldly feeling. There's even a sick sense of humor, when an elderly couple enter the lodge, pledge allegiance to Satan, and then chit-chat and tell jokes like this is an after-church bingo party.Like many of the Satanic cult films that followed, and \"Rosemary's Baby\" before it, \"The Brotherhood of Satan\" has a downbeat ending. Character actor Strother Martin screams madly about the devil while his cultists are stabbed to death by black-robed men with flaming swords. Evil triumphs and good arrives too late to stop it. It's hard to decide if the loose plotting was intentional. Either way, the film sustains a freaky atmosphere of seventies dread and packs a visual wallop.","This is a very original production in all its surrealistic absurdity for its fantastic imagination and imagery - there is a tremendous dream sequence in the middle of the film, a nightmare, of course, but very efficient, credible and well done - exactly like that real nightmares tend to haunt you. The horror is not ridiculously exaggerated, like in most later horror films, but actually creeps into you with some efficiency and manages to present a spectacle that gets more fascinating all the time, until the grand finale, which offers some additional surprises. The actors are all unknown, its a budget film with no pretensions, but it certainly deserves some attention, together with other odd films of some uniqueness, for instance \"Wild in the Streets\" from 1968 about a stipulated flower power world revolution. This belongs in almost the same category for making the absurd credible enough to catch your interest, which is the element of cinematic magic: the art of making the impossible credible and surrealism as a visually acceptable reality. Of course, it's a B-feature and not on par with professional standards, but it certainly is better than most B-features and well worth seeing at least for once. The idea in itself is timeless: the problem of old age to renew itself, its longing for the lost youth, and the wishful thinking of the possibility of renewing it, a theme which also dominates a later and much more refined horror thriller, \"The Skeleton Key\" from 2005. Here the question is left open - did they succeed, or did they not? The door is left open for any possibility and impossibility.","The '70s were a great time for horror movies. The Brotherhood of Satan is yet another overlooked gem. It's full to the brim with great surreal, unsettling scenes. It's also great to see Stother Martin and L.Q. Jones (who also produced) in decent roles.Some of it is a little dated and cheesy, but The Brotherhood of Satan kicks butt over Race the Devil and many other '70s Satanism flicks.","An ambiguous and confusing beginning leads to a very creepy, effectual, and disturbing Horror Movie that despite its very low budget manages to maintain an aura of surrealism and tension. The most disturbing element is probably the Children in Peril aspect as these Devil Worshipers use the Souls of the Innocent to reincarnate.After the confounding first few scenes that in retrospect make more sense as things get going, it is one menacing and maniacal happening after another. There is a Post-Sixties Drug hangover that lingers here and it is quite unsettling.The ending is shocking as is some of the hallucinatory, dream-like imagery and the indoor ritual Scenes have a setting of plastic-ism and play as a Children's demented Clubhouse. This is an underrated, undiscovered, and ultimately quite the quirk that helped issue in the Screen's Satanic Seventies.","The Brotherhood of Satan is viewed by some as a great film and by others as much less than mediocre. The difference lies in the mind of the beholder. Literal-minded folk will definitely not appreciate it and will find it slow-moving and boring. Even those who think of it as a classic will agree that it takes a long time for anything significant to happen. However, for those with a metaphysical bent, once the film gets moving, it resonates at a very deep level of the psyche.Someone raised in a mystical or semi-mystical religion, taught doctrines of transubstantiation, resurrection of the body, the power of prayer, the importance of surrender to the almighty, and the necessity of worship will find striking parallels here though the object of adoration is the Powerful Evil One. God needs the Devil, good needs evil, life needs death, the old need the young in a dualistic world. When attraction is balanced by repulsion in the mind of the viewer, the effect is powerful. Strother Martin in the role of doctor and devil's surrogate is superb.The use of toys and dolls to symbolize elements that exist on different levels of size or importance is ingenious. This multidimensionality suggests to our subconscious mind that nothing is just what it appears to be. In science fiction and horror, this powerful tool stimulates the imagination. In science it suggests multiple realities, multiple universes.","Diabolic forces wreak havoc in a small New Mexico town. A young widower and his pretty new bride and eight year old daughter travel through and unwittingly get drawn into this convoluted world of fear. They cannot escape it's lair and all the towns people are equally weird and possessed by some dark spirit. This is definitely budget horror from the early 1970's. Characters are from a rural background and are played with backward and vapid mentalities. Weird things happen in these small towns and Hollywood understood that long before it became common knowledge. I grew up near the Mojave Desert where there have been numerous accounts of Satanic worshippers practicing their rituals in the Lucerne valley. Oh yes, these things are not always fiction, they exist.This is a good, creepy little gem that will scare you into submission.Watch and enjoy.","A young couple -- father Ben (solid Charles Bateman), wife Nicky (the lovely Ahna Capri) and their daughter KT (the cute Geri Reischl of \"I Dismember Mama\" fame) -- find themselves trapped in a small California desert town populated by hysterical lunatics. Worse yet, there's a pernicious Satanic cult that's been abducting little children for their own diabolical purposes. Director Bernard McEveety, working from an offbeat and inspired script by William Welch and L.Q. Jones (\"Devil Times Five\" director Sean MacGregor came up with the bizarre story), relates the compellingly oddball plot at a slow, yet steady pace and ably creates a creepy, edgy, mysterious ooga-booga atmosphere. Strother Martin delivers a wonderfully wicked and robust performance as Doc Duncan, who's the gleefully sinister leader of the evil sect. The top-rate cast of excellent character actors qualifies as a substantial asset: Jones as gruff, no-nonsense Sheriff Hillsboro, Alvy Moore as friendly local Toby, and Charles Robinson as a shrewd, fiercely devout priest Jack. John Arthur Morrill's bright, polished widescreen cinematography, Jamie Mendoza-Nava's spooky score, and the wild, rousing climactic black mass ritual are all likewise up to speed. The idea of having toys come to murderous life is simply ingenious (the opening scene with a toy tank coming real and crushing a family in their car is truly jolting). Nice eerily ambiguous ending, too. A pleasingly idiosyncratic and under-appreciated winner.","Not everyone likes this movie. It is still one of the best \"you have to be thinking\" movies about Satanism ever made. The fact that it doesn't have MTV-era jump cuts or gore every seven minutes is irrelevant. Also, speaking as someone who actually KNOWS Satanists, the (spoiler warning!) portion of the film where the Brotherhood exchange their old bodies for those of pre-adolescent children is authoritatively correct, and it has some genuinely scary scenes. The section where (second spoiler alert) Strother Martin orchestrates the changeover is almost hyper-real in that it uses very few special effects, a hallmark of this film. McEveety was seldom given a big budget but was often effective. It worked in this case, too.In the words of The Man, Satan! HONOR THY COVENANT!","A family is traveling through the mid West. There's widower Ben (Charles Bateman), his girlfriend Nicky (Ahna Capri) and Ben's little daughter K.T. (Geri Reischl). Then hit a town named Hillsboro where everyone acts more than a little strangely. Their car breaks down and they're forced to stay. They soon find out a witches coven has a spell over the town and is up to incredible evil.The story is not that good. People just figure things out of nothing and they just happen to find out where the witches are at the end. Also there are a lot of loopholes left dangling at the end. The acting is pretty poor too. Bateman and Capri are bland and everybody else is about the same. Only old pros Strother Martin and L.Q. Jones give good performances. Still this movie does work. It forgoes blood and gore (there's some but this is PG) and manges to work with some very creepy visuals and atmosphere. The acting hampers a lot of it but it still works. Martin especially chews the scenery in his role. I can't explain exactly why I (sort of) like this movie but it did work on me. It's a quiet kind of horror that isn't made anymore. Hardly a masterwork but this deserves to be rediscovered. A 7.","The first time I saw Brotherhood of Satan I was 12 yrs old I saw it in a little town in central Washington state it played before Tales from the crypt which we left early because my sisters were already scared from the Brotherhood of Satan. All in all I thought it was a pretty good movie. The beginning was good we had just sat down and that tank did a number on that station wagon.What struck me about the movie was the scenery around the town in which it was filmed it looked almost like the area around Chelan WA where I saw the movie especially when they were driving towards the town of Hillsboro which is the location of the movie a small town in SW New Mexico. I have always liked LQ Jones and Strother Martin and also Charles Bateman who was on Get Smart another show I like. I gave the movie a 7 and later on when I did get to see Tales from the crypt I thought Brotherhood of Satan was better.","A family outing is shattered when they find themselves trapped in a remote desert town, where supernatural forces are murdering townspeople, and an evil cult of elderly Satanists are planning to kidnap the children(including the family's daughter) for a sinister purpose. The parents, a priest, and some others try to stop them before its too late...Though directed with some style, this dispiriting, dreary, and very unappealing film makes little sense, and is vastly inferior to \"Rosemary's Baby\", which it clearly is inspired by. Strother Martin as a doctor/cult leader is wasted.","If there's one thing that the middling horror movie \"The Brotherhood of Satan\" (1971) demonstrates, it is that Old Scratch must have been pretty desperate for worshipping disciples in the early 1970s. In this film, Charles Bateman, his 8-year-old daughter and his hotty gal pal (the yummy Ahna Capri) get stuck in a small town out West that is in the midst of being terrorized by a coven of elderly Satanists. The town's children have been disappearing, families have been butchered wholesale, and in the blink of an eye, Bateman's daughter vanishes, too... Although the Maltin book claims that this is a \"horrifying little terror tale,\" I didn't find it overly chilling. This is the kind of film that almost demands a second viewing; during the first, you won't know what the, uh, hell is going on for the first 2/3 of the picture. Scenes seem to peter out without making their point. While a repeat viewing does clear up some of the confusion, many questions remain unanswered. (Can anyone explain to me, for example, that little dolly that suddenly begins to cry?) Strother Martin, as the coven leader, overacts shamelessly, and it works somehow. But as geriatric covens go, while the one here IS a tad creepier than the one shown in the Joan Fontaine film \"The Witches\" (1966), it cannot top the one led by Sidney Blackmer in the shuddery \"Rosemary's Baby\" (1968), and most viewers, I think, will be left with the feeling that this film could have been so much more. There WERE two things about the movie that I really did enjoy, however; Ahna looks absolutely smashing in her white minidress. Whotta pair of gams!","I have to admit, I'm not a big fan of Satanic horror movies and, in fact, I seem to like them less and less every time I see a new one, and that isn't really surprising when I end up watching films like Brotherhood of Satan! Despite its low rating on IMDb, I was surprised to hear some good things about this film and my expectations went up. This turned out to be a big mistake as this is exactly the film that its rating suggests it is: namely, a very bad one! The plot is your basic bunch of Satanists causing trouble, and we focus on a small town where people have been murdered and kidnapped and it's not really clear why. Naturally, Satanists are behind it and this is bad news for a mother, father and daughter on a road trip who become trapped in the mysterious town. I had a feeling that this film might be along the same lines as the crappy Satanist flick 'The Devil's Rain', and while it's not quite as silly as Robert Fuest's later film, it's not much better either. The plot seems to be fairly down to Earth, but it's also rather boring and I can't say that I enjoyed myself at all during this movie. Brotherhood of Satan obviously has its fans, but I'm not one of them; this is a film that I see no reason to recommend..."],"review-user":["bensonmum2","HumanoidOfFlesh","Infofreak","rosscinema","callanvass","Ricky-50","cfc_can","bygard","Bunuel1976","Coventry","lazarillo","Hey_Sweden","Bonehead-XL","clanciai","pearceduncan","LeonLouisRicci","ahairyrice","imbluzclooby","Woodyanders","spiritof67","preppy-3","eeree3","AaronCapenBanner","ferbs54","The_Void"],"review-date":["25 April 2006","10 December 2001","3 December 2002","28 February 2003","12 September 2005","6 March 2007","18 November 2000","11 April 2007","8 September 2006","22 October 2007","17 December 2007","23 January 2016","5 November 2013","26 April 2015","3 February 2001","10 July 2013","4 August 2006","1 February 2008","12 June 2007","12 January 2007","4 April 2008","26 December 2007","2 September 2013","13 November 2007","23 September 2007"],"review-rating":["8","10","7","8","6","6","9","7","7","8","8","8","9","8","6","8","10","7","7","2","5","4"],"review-title":[" Criminally Underrated\n"," Surreal and creepy!\n"," Interesting and creepy Satanic thriller ripe for rediscovery!\n"," Well made and effective!\n"," One Creepy Underrated Gem , With Chilling Performances And A Fantastic Finale!\n"," Very Disconcerting!!\n"," Too smart for it's own good!\n"," O Satan, where art thou?\n"," THE BROTHERHOOD OF Satan (Bernard McEveety, 1971) ***\n"," Satan Loves All The Little Children\n"," Another 1970's Satan movie featuring \"Wild Bunch\" alumni\n"," Hear and judge!\n"," A Freaky Atmosphere of Seventies Dread\n"," A family gets mixed up with a satanic coven that needs children.\n"," Imaginative and scary\n"," Neglected and Needs Rediscovery\n"," A film that Bores or Resonates Depending on the Viewer\n"," Good demonic horror\n"," A creepy, quirky and effective early 70's devil worship horror flick\n"," Atmospheric, Low Budget, and Effective\n"," Effective in a creepy way\n"," Good horror flick\n"," Dispiriting Horror.\n"," I DID Enjoy Two Things About It...\n"," Dull Satanic horror\n"]}