{"review-url":["http://www.imdb.com/title/tt0067977/reviews"],"review-text":["Elizabeth Ashley is receiving phone calls from her nephew Michael--he's crying, screaming and asking for help. The problem is Michael died 15 years ago. This film scared me silly back in 1972 when it aired on ABC. Seeing it again, years later, it STILL works.The movie is a little slow and predictable, the deaths are very tame, it's never explained why it takes Michael 15 years to call and there's a tacked-on happy ending, but this IS a TV movie so you have to give it room. Elizabeth Ashley is excellent, Ben Gazzara is OK and it's fun to see Michael Douglas so young. And those telephone calls still scare the living daylights out of me. I actually had to turn a light on during one of them!A creepy little TV movie. Worth seeing.","As several others here have stated, I too watched this movie when it originally aired on TV back in 1972 when I was 11 years old and it was very scary then and is pretty creepy today, now that I am in my 40's. Helen (Elizabeth Ashley) lives alone with her young daughter and she starts receiving creepy, threatening phone calls from \"Michael\", her nephew who supposedly died in a blizzard after running away from home 15 years earlier. The acting is good, especially a young Michael Douglas, but there were several things left unanswered, why did Michael run away, why after all these years do the phone calls start up, etc? But overall the movie is a good little flick to watch with the lights off. Enjoy!!!","I remember being scared to death when this film first aired on TV in 1971. Of course, I was all of nine years old at the time. When Michael Calls was recently shown on Fox Movies, and I had a chance to relive my memories of terror. Surprisingly, the film holds up remarkably well, even with the tacked on and predictable happy ending that ties up all the loose ends. I even had to turn a light on while I watched!","***CONTAINS SPOILERS***Ben Gazzara, Michael Douglas in the same movie. What more do you need to know!?This is a movie about Helen (Elizabeth Ashley), a single mother going through a difficult divorce. She lives on a small new england farm with her daughter and grandparent.  Her generally peaceful life becomes filled with terror, when some one claiming to be her dead son Michael who had run away fifteen years ago and was believed to be killed in a blizzard.This movie starts out a little slow, until the phone calls start. It then builds into a frantic conclusion with Michael Douglas giving an all-star performance as a psychiatrist who should be a patient.I give this movie a 6.5 out of 10.  Yes I have seen better, but for goodness sake I have seen a lot worse.","When Michael Calls or Shattered Silence is a fine film especially for a TV film. Michael Douglas, Ben Gazzara, and Elizabeth Ashley are in this movie. All three veteran actors all performed well. I was amazed by Gazzara and his character interaction with his daughter. The music was good and fits the film good. The movie has good direction by Philip Leacock. There are some cool scenes in the picture. The movie is unusual and will have you guessing through out so if you like thrilling mystery movies and like to see Michael Douglas, Ben Gazzara, and Elizabeth Ashley in a film then see if you can catch this movie on television, rent, or even buy it because its a good movie.","\"When Michael Calls\" was made in 1972 and stars Elizabeth Ashely as Helen Connelly, a woman going through a divorce from her high powered attorney husband (Ben Gazzara) and has moved to a small New England town with her young daughter Peggy (Karen Pearson). Her nephew Craig (portrayed by a young Michael Douglas)is a psychiatrist at the Greenleaf School for Boys, an institution in the same town for troubled young men.Things begin to get scary when Helen starts receiving eerie calls from a young boy who claims to be Michael, her nephew (and Craig's brother) who died 15 years earlier after he ran away from home in a snowstorm. You have to remember this movie was made long before there were cell phones or caller id, and the calls are genuinely creepy.My only complaint about this movie is that I wish that the makers of this film would have spent more time answering some basic questions such as why would the calls start suddenly after 15 years? Who is the voice of the young boy on the other end of the line? These questions are never explained and I think it would have been nice to have the answers to these basic questions. There are a couple of not real scary murders until the killer is revealed at the end. Despite some minor flaws, I love this movie and remember watching it when I was a kid when it came out in 1972. I recently got to see it again when it aired on the Fox Movie Channel. It was also fun to see Michael Douglas in the picture as he is very young and basically at the beginning of his long and storied career. Fans of 1970's Movie of the Week will definitely have to see this one!","When Michael Calls (1972) ** 1/2 (out of 4)Mildly effective made-for-TV flick about a woman (Elizabeth Ashley) who begins receiving phone calls from her nephew Michael but the only problem is that he died fifteen years earlier. Soon her ex-husband (Ben Gazzara) and other nephew (Michael Douglas) begin to investigate is Michael could actually be alive or if someone else is just trying to do her harm. These TV flicks from the 70s always have that certain atmosphere that can only be found in movies like this, BAD RONALD and DON'T BE AFRAID OF THE DARK. This here certainly isn't as good as those two examples but we still get that eerie atmosphere and that alone makes this worth sitting through even if in the end this isn't a classic. I think the best thing going for the film are the performances by the three leads. Gazzara plays a lawyer who doesn't mind throwing his weight around to get what he wants and I thought he was pretty good in the role. That tough rawness he brings to all his roles is always fun to watch and he certainly helps keep this thing moving along. Ashley is also very good in the film, although it's hard to believe her as the aunt to Douglas especially when in real life she was only five years older than him. With that said, she certainly displayed a certain vulnerability that made the movie a bit more effective. Douglas is billed as a \"Special Guest Star\" but he actually has a pretty big role here and appears throughout the movie. The screenplay tries very hard to be like something you'd expect to see from Hitchcock as it tries to keep the suspense up by having you constantly guessing what's going on. I think it's pretty simple to figure out what's up after about the forty-minute mark but I'm sure some might be kept in the dark up until the ending. While I didn't fall for all the twists and turns this still turned out to be fairly fun thanks in large part to the cast and whoever it was that voiced the kid on the phone. Another good thing about these films from the 70s that dealt with phones is that they were always able to find someone creepy for the voice work.","ABC Movie of the Week involves Elizabeth Ashley as a divorced single parent who mysteriously begins receiving a series of spooky phone calls from a child who says he's her nephew, a boy who allegedly died in a snowstorm years prior; ex-husband Ben Gazzara and brother Michael Douglas (who heads up a home for emotionally disturbed youngsters) investigate on their own after a bee-keeper and a sheriff both turn up dead. Spotty teleplay from James Bridges, adapting a novel by John Farris, inexplicably drops a thread about a young burglar caught red-handed, and also a farmhouse which the killer sets on fire. However, the phone calls here are certainly creepy (even better than the ones from Doris Day's \"Midnight Lace\") and the performances by Ashley and Gazzara are solid. Bridges and Michael Douglas later reunited on \"The China Syndrome\".","I am a big fan of The ABC Movies of the Week genre. I am only 27, meaning I wasn't even born until after the series ended, but I am trying to collect as many of them on DVD as possible. I have about a dozen or so. I had read such wonderful things about this film, both on here and elsewhere, that I was really excited to see it. I just received my DVD in the mail today and watched it anxiously. I'll admit that the first one or two phone calls did give me the creeps - that boy's voice would give anyone the creeps! But it began to ware off fast and the entire divorce subplot was stupid. I also figured out that Michael Douglas was the antagonist about a half an hour before the movie ended. As soon as that story was told about how Elizabeth Ashley's character had locked up his mother, I knew something was fishy. Plus, didn't anyone ever think to ask him why he happened to suddenly appear that night when the fire occurred in the barn? I'll admit that I thought he was coaching a boy at the school to make the phone calls. I didn't guess the mute boy part or the pre-recorded tapes (did they ever say whose voice that actually was? I doubt Douglas could ever get his voice that high?).I am only giving this movie a four out of ten because I actually liked most of the acting in it. Ashley especially is great.It's a shame, because this movie has such a great premise, but oh well, thats what happens sometimes when one gets his or her hopes up for a movie too much.","Michael is -- or was -- the brother of Elizabeth Ashley and Michael Douglas. Thirteen years earlier, he ran away into a Vermont blizzard at twelve and his body was found months later and identified because of his coat. Ashley is now the mother of a young girl and is estranged from her husband, Ben Gazzara, a \"high-powered lawyer.\" Gazarra comes to visit his wife and child and he seems like a nice, loving guy. Michael Douglas has become a bland psychologist who works with exceptional children at the nearby Greenleaf School.That's the set up. Then suddenly Ashley and the rest begin receiving phone calls from what sounds like the voice of a terrified young boy who claims to be Michael. The calls say things like, \"Help me!\" and \"I'm dead, aren't I?\" So where are the calls coming from? Are we into the supernatural? Or is there something more mundane going on? Everyone is puzzled. The local doc is puzzled too, but he's murdered -- stung to death by his own bees. (His death has absolutely nada to do with the plot.) A sheriff is murdered too. And, well, there's a reason for the sheriff's death, though it too has nothing to do with the plot. The sheriff must be murdered so that his dead body can plop unexpectedly into the middle of a Halloween display and cause the audience to erupt in shrieks.After half an hour or so, I was fairly convinced of two things: (1) Ashley and Gazarra would get back together again at the end, and (2) Michael Douglas was the murderer. I figured Douglas was the killer not because he acted strange in any way, and not because he had a motive, but because of The Law of Excess Characters. He had too prominent a part and too little to do.After the New England setting was established I was hoping the film would convey a strong sense of place. Not picture-postcard pretty, of course. We don't necessarily want maples aflame because this is early winter, after all, and anyway autumn foliage in Vermont would be trite. Not to worry. The dismal chill of Toronto defeated any effort in that regard. The whole movie in fact seemed to be made for TV. I swear, there are even mini-climaxes before what appear to be breaks for commercials.Ashley is attractive, sexy, and competent. She has the eyes of a calf and her long nose slopes down and out in a fascinating French curve. Gazarra is competent too, and a bit more light hearted than his usual persona. Michael Douglas is here in an early role. He's vaguely handsome. How does he do at this stage of his career? Not too bad, actually. He plays the character as wispy and at times almost feminine, but that's what the role calls for. Only once, at the climax, does he flood out in a spasm of excruciating insight. His old man handled that kind of scene even better -- in \"The Juggler\" and \"Champion.\"","Spoilers:If I ever received a phone call such as the one portrayed in this movie, I can tell you for certain that I would never again answer the phone. And if you're looking for scary phone calls then this movie's for you. So long as you don't pay attention to anything else about the movie. In short, this movie lacks characterization and a foundation story line that you can \"buy into\". The ending was't predictable but was a \"cop out\" nonetheless. The movie needs information about Michael's death; this would have answered the question of \"why, after 15 years is michael suddenly calling people.\" It would have also made the story line, that you find out about in the end, more believable. Since no character development was done, we have no feeling for any of the characters and this is really needed for the ending to be less dissapointing.Not a total waste of time but I'm glad I didn't spend money just to hear a few wierd phone calls.","This 1972 TV movie is one of those few TV films from those days that is still broadcast today. Well, I taped it back in 1991, but anyway, the film is so corny, with a very \"Okay, sure\" plot, but it still has good suspenseful moments (in a strange way, you never know where the caller is or if he's watching the answerers---spooky), and Douglas is quite unique in an early role. Well worth a watch, or a few watches.","Michael has apparently been dead for 15 years. So how could he possibly start phoning his sister, Helen (Elizabeth Ashley), after all this time? Plus, the voice sounds just like the young Michael--not some adult. It's weird and hard to explain. What's weirder and harder to explain is that after these calls, folks start to die--with each call, a new dead person! On hand to help her are her ex-husband (Ben Gazzara) and other brother (Michael Douglas). In many ways, this is like the \"Twilight Zone\" episode \"Night Call\" and this show surely must have influenced the writer of this film. However, fortunately, it is different enough and enjoyable on its own. A silly and fun little horror film--just the sort of thing at which the \"ABC Movie of the Week\" excelled at making. Well worth seeing.","***SPOILERS*** As if from the grave Helen Connelly, Elizabeth Ashley,gets these weird calls from what seems like her long dead nephew Michael who perished in a snowstorm some 12 years ago.What really shocked Helen was that the caller addressed her as \"Auntie my Helen\"! A phrase that only Michael called her when he was alive!Pretty good made for TV psychological thriller with a 27 year old Michael Douglas as both Michael's brother Craig as well as the administrated of the local Greenleaf School for Boys and its in house psychiatrist. It's Craig who was left all alone when his mother was institutionalized for mental illness and his brother Michael got himself lost in the woods, where he was found badly decomposed four months later! Thats when Michael flipped out when both his and Craig's mom killed herself a week after she was locked up into an asylum!***SPOILERS****It was up to Craig to find out who was making those strange phone calls to his Aunt Helen in that if it indeed was his dead brother \"Michael\", who may in fact have survived, he'll have a lot to answer to him for! Besides making life a living hell for Helen \"Michael\" also went to work in offing those responsible for his mother's both incarceration and later suicide. It's in fact Helen's estranged husband Doremus, Ben Gazzara, who finally figured out who was both behind the eerie phone calls and murders of both Dr.Brittin and Sheriff Washbank, Larry Reynolds & Al Waxman, the two most responsible for Michael and Craig's moms being committed and later suicide. It was only by Doremus surviving being burned alive by \"Michael\" in a deserted barn that \"Michael\" directed, by phone, him to that the cat was let out of the bag in what was Michaels true identity! By then his crazy phone call act was about to be exposed! That's if \"Michael\" didn't get another chance to off Doremus before he got word to the police as well as his wife Helen in just who this \"Michael\" really is!","Doremus and Helen Connelly (Ben Gazzara and Elizabeth Ashley) have been divorced for some time, and Doremus takes it upon himself to simply show up at Helen's home. He says he's come to see their daughter, Peggy, which is a violation of their divorce agreement. Soon after his arrival, Helen begins receiving phone calls from someone claiming to be the title character. Helen doesn't believe it, since her nephew Michael died fifteen years prior. Of course, the calls continue, becoming more urgent, eerie, and unhinged. Has Michael somehow returned from the grave, or is Helen losing her mind? Or, is something else going on? Helen is suspicious, and there are plenty of potential suspects for her to choose from. A school of red herrings, so to speak! Then, Michael begins forecasting death and doom, and everything changes. WHEN MICHAEL CALLS is another made-for-TV horror movie from the early 1970's. This was a time when such quality films as this were being made for network television. All these years later, it's still effective, though I do admit to finding Michael's whiny voice a bit annoying! Co-stars Michael Douglas as Craig, and Marian Waldman (BLACK CHRISTMAS, DERANGED) as Elsa Britton...","The Robert Drasnin theme music from Daughter of the mind (1969) is a perfect suited theme song for this psychological thriller. It actually hints the fact that its not a ghost story but a deep rooted thriller within the hood of supernatural ambiance. \nI still have horrors just remembering the words from other side of the phone - \"Auntie my Helen... \"\nI loved Ben Gazzara's persona in the movie. However, its the young Michael Douglas (28 years old) playing a much mature psychologist with tainted emotional setup is almost uncaught up until the climax. Loved the movie and its twists - would have been great if remade with selective cast for the big screen!","An enjoyable atmospheric, psychological thriller; better than you might expect. A little odd and even humorous at times, but that's part of the charm. Pretty good for a TV movie.","'Shattered Silence' AKA 'When Michael Calls' (1972) Craig (M. Douglas) has lost his brother Michael 15 years prior to the beginning of the story. Michael begins to call Helen (E. Ashley) on the phone, seemingly in distress every call. Doremus (B. Gazzara) is Helen's ex-husband or soon to be ex - but he is there to help Helen through this terrible nightmare and to solve the mystery of Michael.Micheal calls Helen \"Auntie\" which is odd. Craig and Michael are brothers and if Michael is Helen's nephew then Craig would be Helen's other nephew. *In reality Helen and Craig are just close to one another, friends - according to the Wiki article.* Why we are lead to believe that Helen and Michael are related/family and not Craig is strange in itself. Most every source says Michael is Helen's nephew or A woman (Helen) receives phone calls from a relative. - when he is not.A good thriller - bizarre. Worth watching if you get a chance to see it. Those phone calls from Micheal will have you shivering. :) 8.5/10","'Shattered Silence', a suspense movie with Gazzara and M. Douglas, gives a strong sense of the unconscious' power over our consciousness, over what we acknowledge and what we deny, also like the everyday struggle between acknowledgment and denial.I liked the girl, and the carved pumpkin, and believe we deserved to see those pumpkins at the harvest festival; I also enjoyed the '70s casualness, if one likes thinking in terms of decades, and perhaps most of all I enjoyed M. Douglas' glamor, his father had been, 25 yrs earlier, also into torn youth, yet the two have very different styles, with the son able to delve into neurosis and hysterical behavior.M. Douglas gives a good role, and he upstages Gazzara; 'Shattered Silence' is an enjoyable '70s horror for the TV. The movie is a scary whodunit, and atmospheric, with the masks and the suggestions of impersonation, even visual gags (the fatso copper: a pumpkin; the shattered pumpkins, as these were only the '70s, when pumpkins were still shattered, not smashed); there are a few nice views of the setting, the mentioned pumpkins, and the daughter is very funny. Less good seems the quirk of the hypnosis and remote control, a plunge into '30 silliness that makes the denouement look explained away. Both murders, with the bee venom that prompts the swarming, and at the harvest festival, are unlikely, laborious and too staged. After a couple of such nerdy murders, the psychotic arrives at his aunt's home with a bat .After having exported so many players and people in the showbiz, Canada rented these two actors, and a likable TV movie has been made. M. Douglas improves very much upon the script, and looks almost too urbane for the modest setting; on the other hand, Gazzara is too convincing as a ne'er do well cur (or marten ).In the early '90s, I remember being very keen on M. Douglas, '90-'93.","@ tamstrat \"The acting is good, especially a young Michael Douglas, but there were several things left unanswered, why did Michael run away,\"If I can recall correctly, (I'm not positive because I haven't watched it in over a decade) either he didn't actually run away or he did, but only because of something that Craig (Michael Douglas' Character) had done to him. But either way his death was because of something Craig said or did to him. \" why after all these years do the phone calls start up, etc?\"Again, it happened because of Craig. Something set him off and he had a mental break down which caused him to seek revenge for Michael's death. First, he pretended to be him and then he enlisted a young boy who was around the same age as Michael at the time of his death to play the part for him. I say \"enlisted\" but I'm pretty sure what he had actually done is kidnap the boy.Ironically enough, it was his guilt over what happened to Michael that caused his final mental breakdown which is why the calls didn't start right away. It must have taken years for him to come to grips with what he did but in the end he just couldn't handle the guilt anymore ergo he lost his mind and assumed Michaels identity and the subsequently had another child assume Michael's identity as well. His guilt over what happened was obvious, I think things happened the way they happened because part of him wanted to be caught and punished for his role in the death. The other part to that equation of getting rid of his guilt was to attempt to convince himself and everyone else that Michael wasn't actually dead. Which would be why he fixated on another little boy the same age and wanted to make him become Michael.","This film is the type that truly scares you, because of the unknown factor. Who's the mysterious caller? Is it a prank, a ghost, or something even darker? Of course, having pillars of the community die in ugly ways adds tension. Plus the child's voice is chillingly desperate and surreal, like an angry ghost out for revenge. While there may be darker or more violent movies, few rival this in atmosphere and emotional claustrophobia. Who can our main character trust? Who wants her to suffer? The answer will shock you. Also watch for a excellent performance from a young Michael Douglas. A word to the wise: Watch this with friends, it's too creepy for solo viewing.","This made for TV film is based on a novel by John Farris and it's a dreary and uneventful domestic drama, not a thriller, and though only 73 minutes long, it feels endless. The film has no atmosphere or style, and Phillip Leacock's low key direction brings the movie to a halt. The title refers to phone calls from Michael a supposedly dead boy who ought to stay that way. His phone calls are more bothersome than creepy, and the characters' react with so little concern that there is absolutely no sense of urgency or suspense, and the characters are the dullest group of would be suspects ever assembled, and the actors seemed to have phoned in their performances. My advice, If Michael calls, hang up! If you like films featuring menacing phone calls, try Talk Radio, Who Killed Teddy Bear?, Black Christmas, or When a Stranger Calls instead. Even Sorry, Wrong Nuumber or I Saw What You Did! have more substance. Besides being awful, When Michael Calls is outdated. Thank God for caller ID!","One of those TV films you saw in the seventies that scared the hell out of you when you were a kid but still gives you an eerie feeling.  No great actors or expensive production but everytime that phone rings......"],"review-user":["preppy-3","tamstrat","JohnSeal","Sirsharp","Movie Nuttball","babeth_jr","Michael_Elliott","moonspinner55","Karadago","rmax304823","thehauntedchamber","jonpd","MartinHafer","sol1218","azathothpwiggins","raja_sarkar","Bec_son99","Rainey-Dawn","Cristi_Ciopron","honeypuppiesluv","mtckoch","brefane","hubcap45"],"review-date":["29 October 2003","17 May 2005","10 November 2000","12 August 2003","8 September 2004","22 September 2010","9 October 2010","12 July 2010","29 August 2007","18 July 2010","5 January 2003","20 September 2002","16 October 2016","18 September 2010","7 August 2018","3 February 2018","19 January 2018","21 May 2016","2 February 2016","6 October 2014","28 March 2014","12 July 2010","22 October 2002"],"review-rating":["8","6","6","5","4","5","8","7","8","8","8","8","6","9","1","9"],"review-title":[" Still works\n"," Creepy\n"," Above average movie of the week\n"," Also know as \"Shattered Silence\"\n"," Good film!\n"," Creepy 1970's Made for T.V. Movie\n"," Cast Makes It Worth Watching\n"," Not-bad TV-made guessing game with a teleplay from future filmmaker James Bridges...\n"," Bad TV-Movie\n"," Formulaic Thriller About Psychotic Killer.\n"," Could have been really good...but\n"," Suspenseful in a Funny Way\n"," Creepy and exciting.\n"," Message from Michael\n"," \"Oh, He's Been Deader Than A Door Nail For Fifteen Years!\"...\n"," \"Auntie My Helen ... \" shocks me up .. even now\n"," Better than you might expect\n"," A Good Thriller - Bizarre\n"," the lovely glamor of M. Douglas\n"," Spoiler To clear up Previous Comments\n"," Creepy early seventies horror at it's best\n"," Don't answer the phone!\n"," Great atmosphere tv film from the seventies\n"]}