{"review-url":["http://www.imdb.com/title/tt0082507/reviews"],"review-text":["And that's saying a lot. Rent this if you want to be staggered by oddness, blown away by one of the most bizarre scripts, direction, and casting in the history of films. I'm staggered. I can't believe I watched it. I'm a big Bernadette Peters fan, normally- but this tested my resolve. Don't read any more reviews here, it's best if you know nothing about the plot. Just rent it. You won't believe what you're seeing.......","If you have witnessed Andy Kaufman's slant on comedy, you may understand why I avoided this movie of his for years. Actually, for most of that time, I couldn't see it even if I wanted to - video stores in my area didn't stock it, and it never appeared on TV. I had to rent it online when recently I finally got the courage to give it a try.My heart sank during the first few seconds of the movie. The comedy in this opening is both very familiar and unfunny, and the movie manages to sink further and further as it goes on. There's barely a story here, with the bulk of the movie consisting of the robots wandering around... and around... and around until you want to scream. It doesn't help that the robot characters are a turn-off. They don't have much of a personality (they seem very stupid - why should we care about stupid characters?), and their voices are very annoying to the ear.The makeup is good, I'll admit. But it seems odd that they spent time for the makeup when not bothering to present the rest of this world as a futuristic world (the vehicles of this world, for one thing, are present-day gas-powered vehicles.) It's even more odd to consider that no one involved with this movie realized along the way that this project was a train wreck.","Andy Kaufman went on David Letterman and apologized for this movie.  He said he wanted to give everyone their money back if they had seen the movie. I'm not sure he was entirely joking.  It's bad enough that you might want your money back, but it's stupid enough to keep you interested in watching it.I tortured my friends by showing them this movie.  They enjoyed the psycho malfunctioning cop robot.  Years later they still bring it up.I would put this movie on the same level as SuperFuzz.","Before \"Bicentenial Man\"... there was a group of robots... I watched this movie one time, 20 years ago, but I still remember it fondly. I have always thought of it as an allegory, centered around two robots who \"grow up\" through their wild, teenage years, have a child and face crises together. They finally discover the meaning of love, in a way that is deeper than just being fond of each other, as they sacrifice for each other. I was so impressed with this movie that I can still recall much of the dialog. I remember the jokes and plot twists. The movie is light-hearted, funny and insightful and is even poignant at times.","The film had NO help at all, promotion-wise: if there was an advertising promo on TV or radio, I didn't see/hear it. The only newspaper ad I saw was on it's opening weekend: a dingy, sludgy B & W head-shot photo of Andy as Val-Com, behind jail bars, with headline: \"WANTED! Runaway Robot!\" ( which was also the poster in front of the 3 movie theaters I saw it at --NOT the nice little color poster on this site, with headshots of all the cast, and cartoon of Crimebuster --which really wasn't THAT good--they OUGHT to have used an action scene from the film itself--didn't they have an onset photographer? A poster is supposed to HELP a prospective audience decide if they want to SEE the movie--there were SO many people who couldn't get into their sold-out choice, and wanted to know WHAT Heartbeeps was about--and that poster didn't help! That dingy pic, and the only other photos supplied to papers were so indistinguishable in B & W that they were worthless. ) There was NO trailer for the film: only a slide at one theater, consisting of the word \"Heartbeeps\" inside a heart-shape, with a Cupid's arrow through it, and one that was a totally black picture: just Andy and Bernadette's voices saying \"Val-Com! My pleasure center is malfunctioning!\" \"So is mine; do you think we ought to tell our owners?\" THAT is no help to people who hadn't been aware of the movie.During the filming, Andy told reporters that he couldn't eat, once his plastic lips were applied, so he would \"load up on breakfast, and fast\" during the day's shoot. I don't know WHAT Bernadette did: but at the time, I'd wondered why they didn't just sip protein drinks through long straws, or eat astronaut-style puréed food via tubes? Phil-Co, the baby robot, seemed to have been the pre-curser to Short Circuit's Johnny-Five, with the same eyes, similar face. I've been trying to find if they had the same designer, but no help. I have vintage magazine articles about the film, and the design team was immensely proud of their work, and were going for a special award for their innovative device to create stenchless \"smoke\" for Catskill's cigars. Just shortly thereafter, LucasFilm did NOT use that device, though they OUGHT to have, for Return of the Jedi's scenes with Jabba the Hut: a man created \"steam\" around Jabba, by blowing cigar smoke into a tube, joking that all he needed was a glass of brandy, and he'd be a happy man. I thought that LucasFilm's using of real tobacco products was insensitive to people who were upset by smoke. John Williams, who had then recently succeeded the late, great Arthur Fielder as the maestro of the Boston Pops ( which was THEN a ratings hit--but it never recovered from Fielder's death, and is now a shadow of it's former glory ), was using the show to promote films with which he supplied the music. He'd premiered \"The Empire Strikes Back\" score there; and you would think he'd have helped Heartbeeps along, by playing a few numbers there? The one thing that critics had liked of this film was Williams' score--yet it was NOT available for purchase! I saw one vinyl album, in 1982, with half Heartbeeps, half another film--but it disappeared. I only just tonight saw the CD listed on THIS site, and have ordered it. If I can ever get a scanner, and time to type out the articles, I'd like to create a Heartbeeps tribute site. I liked the movie, and don't care what dissenters say! The only trouble with the film, was, that near the end, it was messed up, logic-wise: the robots ran away from the factory to have the freedom to decide their own fate, make their own choices; yet, when the junkyard owners tell them that Phil needs to go TO the factory, to have a \"purpose\" programmed into him, they don't even question it; they just glance meaningfully at each other, and they go. Along the way, each of the adults lose battery power, and \"die.\" They aren't REALLY dead, as they are robots, and only need new batteries, yet it is treated as \"death,\" with little Phil crying over them, and rolling away. So, what was the POINT of this? Phil never gets back to the factory, and gets \"a purpose!\" AND of course, the junkyard owners COULD'VE driven them, or given them all battery recharges, with back-up batteries; but the real point was to have this poignant scene, where the robots all wore down, and Phil is left to cry. At the end, Val-Com is a golf instructor, and Aqua-Com is --I'm not sure what. Catskill is an ENTERTAINER--what ELSE is HE supposed to be? I'm not sure that they made it clear. The junkyard owners seem to be taking it easy, lying on chaise lounges, drinking lemonade from Phil, their \"bartender.\" Val's and Aqua's new \"daughter,\" Philsia--I think the name is--maybe it's Sylvania--doesn't seem to be much more than a table lamp. There is missing footage, which is sad--from photos I surmise that the stuff missing includes a sweet scene, where Phil is having a Christmas, with Val gifting him with a car's steering wheel; Aqua is supplying a horn; Catskill has taken the firefighter helmet to give to Phil, as we saw; and they have Christmas trees. I don't know if any missing footage supplies better logic, or if the writers just couldn't think of a better crisis/resolution. The film was trimmed to 72-75 minutes, to pair it with other failing films. No other reason than that. For a DVD, I would LOVE to be in on creating, as I want to see interviews with the cast/crew and John Williams, and the Merv Griffin interview. The making-of footage; and reediting and restoring the missing footage to make it better.","HEARTBEEPS is a movie about a pair of malfunctioning companion androids returned to the factory for repairs. A simple conversation about mutual shared functions progresses to a trip to the woods with a 'Catskill' comedy unit (that has a vocal patterned after Rodney Dangerfield). They determine that stealing a UPS P-600 type truck. They assemble another small child-minded robot 'child' to tote spare parts and begin to slowly treat it as their son. Meanwhile the inventory staff notice the robots were missing and begin a search, however, the overheard conversation with the factory boss unknowingly gives a malfunctioning 'Crimebuster Deluxe' robot the purpose to hunt down and return the 3 missing robots. The factory inventory employees are also now tasked with locating and retrieving the missing androids, but their paths do not cross with the overactive Crimebuster unit. During the story, both androids slowly discover their love for each other and the desire to make the best life possible for the child they built together. When the android duo deduce that their child will need to have some sort of purpose or it will be discarded or destroyed by the humans, the kindly scrapyard owners note that they should take their child to the factory to give the child a purpose. The android family now begins slow walk back to the robot factory, but their power packs are now running very low.The plot itself is fairly charming if you are not too impatient about the slow pace or the overly redundant dialog. This isn't an action movie or even a sexy romance flick, but just a simple lightly romantic science-fiction movie with rather good makeup and nice special effects (but the effects are not plot-mover item for the story as is common with the movies these days). It aims for a charming fanciful mindset and achieves it, but the pacing is too slow and the story dialog so thin that it really does not have enough \"oomph\" to give an emotional investment from the audience. HEARTBEEPS is a slow yet charming movie with sadly not enough script or philosophy to fill out the movie runtime. I find I rather like it for what it wanted to be, but many people will not appreciate that and be disappointed. I think this could be remade today (now that audiences are more accepting of science fiction in general) with a similar budget and a complex conceptually expanded script and succeed as a charming sci-fi family movie.","If you like bad movies, this one's a real treat. Kaufman & Peters stagger around in robot costumes, escape slavery only to wander aimlessly, and find true robot love. I believe this is the first movie that ever made me consider walking out. I should note I was 12, and could be entertained by shiny objects.","Best Robot Romantic Comedy Ever, using the robots as the romantic characters, which leaves Short Circuit out of this category.  This was Andy Kaufman's best effort.  Bernadette Peters shows her versatility here with an amazing performance.  While not a great movie in many areas, I'll award it a 9 on guts and quirkiness.","I really wanted to like this movie, but the pacing was just way too slow.It was a nice story, but it was really like watching a slug race.The movie would have been better served, if it had some more action. I don't mean anything grand, but at least something in the background.It could have also been helped by songs that set the tone/mood of the more lengthy periods that were absent of dialogue.It's been about 10 years since I've seen it, so I may have to give it another chance.3/10 or *1/2(out of four)","My wife and I saw this in the theater when it first came out.There were only 3 couples there and we all walked out about the same time.This is the only movie I have ever walked out on.It was just painful to sit through.The theater actually stopped us on the way out and asked if we wanted a refund.Never had that happen before or since Pleae do not rent this You will really regret it I am really sureprised by the vote summary Perhaps personal tast has something to do with it","Andy Kaufman and Bernadette Peters as robots who fall in love.  Sounds like it might be campy, eh?  It's not.  This movie is a pure endurance test. Even the voices of Jerry Garcia & \"funnyman\" Jack Carter can't begin to save this.What were these people thinking?","\"I presume you are here for damage to your mental circuitry.\" - VALMike Nelson made me watch this...he mentioned it in his book, \"Movie Megacheese.\" I asked myself, \"Why would Mike Nelson steer me wrong?\" I now know why the bots never trusted Mike Nelson.The music is by John Williams, which is probably part of his payment to the Devil. In fact, I'm sure anyone who worked on this movie is probably in league with ol' Slewfoot, or is now cursed, from the Executive Director down to the guy who ran the catering truck outside the studio. Don't watch...for the love of God...don't watch!!! Not even making a copy and showing someone else will un-curse you...I'm doomed now, I understand this. I accept this. But save yourself...","Little did I know that when I signed up the the \"all pay channel\" package with Direct TV that I would face a movie like this. It came on right after another movie we had been watching... and I was a teenager in 1981 so am not sure where I was at the time... but I missed this movie.I also can't believe we left it on. It is kind-of funny as it takes you back in the time machine to the early 80s... but I think even then this would have been a painful movie. It was just... well... \"too cute\"! ET was \"cute\" in a way... but not obnoxiously cute... and stupid.When I see a movie like this... I come on onto IMDb to see what others say. I am blown away that this thing was nominated! Wow... the movie industry has come a long way since the 80s! Oh well... it did show some old actors... btw that is the other thing I was surprised about... the lineup... not a bunch of no-names... but some real actors/actresses. Must have been in their drug days! Anyways... odd, interesting, bizarre, and makes one happy they grew up!","First of all, consider that this was the only motion picture Andy Kaufman made before he died. He was quite sick when he made it and he never defined himself as a comedian; he always defined himself as a \"song and dance man.\" It was the rest of the world who kept trying to shove him into the comedy can. Andy was perhaps the most misunderstood performer of all time and undoubtedly a genius. At the time this movie was made, Kaufman's break-out TV series, Taxi, had just been cancelled and he had just been diagnosed with a rare large cell carcinoma in his lungs. He wanted to get away from the disastrous \"Inter-Gender Wrestling\" gig he started that caused his popularity to fall flat and got him banned from Saturday Night Live. Bernadette Peters had just come off playing a cupie-doll airhead against Steve Martin's moron in \"The Jerk\" and Heartbeeps seemed like a good follow-up role. It's nuances you need to watch for in this film. The unlikely allies of the robots, Val, Aqua and the Catskill Performer, while being pursued by a crazed police robot, makes for a simplistic, yet classic tale of good vs. evil and good wins (spoiler alert!). Much of Kaufman's performance reminds me of the innocent, yet poignant Latka from Taxi. Thank you very much!","I absolutely loved this movie. Let me explain: I was 6 at the time ('81), and much of the production technology we have today didn't exist. Therefore my willingness to suspend disbelief was far greater. I was also not yet wise to such formulaic Hollywood devices as pointless chase scenes and badly scripted romances. I guess I would recommend watching this movie high on enough drugs to reduce you to the mindset of a 6 year old, and then you should be fine.","I saw this movie at the drive-in and on hbo in the early 80's and i still remember it! It is a kids movie but lets look at the wizard of oz it's the same sort of fantasy movie that everyone can enjoy!!!! I just wish it would come out on dvd in widescreen! So if there is anyone out there that works for a dvd company that can get the rights to this film or who works for the studio that made heartbeeps, really needs to release it in widescreen or special edition, it's a real good movie, i mean if anyone liked the movie Bicentennial Man  with robin williams where he plays a robot trying to find himself you will love this movie, if you need a reference, i think its Bicentennial Man meets a love story!","OK, first, to all the haters: Get a life! I don't see why you even bother to post on these boards, when obviously you know nothing about cinema, robots, or people. This movie has an important lessons for all of us to learn about gender, stereotypes, relationships, and DESTINY. Really, we are all robots, programmed to respond certain ways to certain stimuli without thinking. How many times have we seen a sunset and made some trite comment without even thinking about it? I say, THANK YOU Aqua (brilliantly played by Bernadette Peters) for making me stop and think about the awesome power of mother nature. It's only when Val and Aqua begin to reject their programming that they begin to understand their true desire--to find love, and to flee the factory in search of a creative life. This movie should be mandatory viewing in prisons--just think of the dreams and hopes it could inspire in the inmates. maybe even they could overcome their \"bad\" programming and join the rest of us in a crime-free world.We can all learn a lot from these robots. I am a better person for Heartbeeps.","I thought of this movie when i watched pluto nash...why..because both movies have randy quaid playing a retarded robot, this movie made years earlier but probably written by a screenplay writer that drank the same biotoxic coffee or something like that...Whoa...AVOID AT ALL COSTS even to pay tribute to the late great Andy Kaufman is hard to do here...find another film or just watch taxi reruns on latenight tv...his latka gravas character is so much more loveable...TANK YOU BERRY MUCH","I haven't seen this movie in years. I couldn't remember the title of the movie. Now I can't wait to see it again, and hoping it is as cute as I remember. I read some of the comments and a lot of the viewers didn't care for the movie. It doesn't have to be rocket science to be a cute movie. But it had one important factor (LOVE)","When we entered the theater, there was only one other person. He left about 15 minutes into it, and we left about 30 minutes or so.What a monumental waste of time. The theater actually refunded our ticket price.When we bought the tickets, the person selling them looked at us strangely. That should have been a huge tip-off.I always thought that Andy Kaufman intentionally tried to make the worst movie ever, as that type of thing was his bag (think him as a wrestler)If you spend money to rent this, you would be better to just flush the money down a toiletIt is not even campy - it is just terrible","Andy Kaufman and Bernadette Peters star in this slightly futuristic romantic comedy, playing Val and Aqua. They're robots who meet while put into storage, and make a connection. They also make a break for it, escaping from a factory on a \"data finding\" mission. They are hunted down not only by factory employees Charlie (Randy Quaid) & Max (Kenneth McMillan), but also by an out of control police robot called The Crimebuster. Val & Aqua are joined by a comedian robot named \"Catskil\" (voice of Jack Carter) and a cute little thing dubbed \"Phil\".It might be just me, but personally I found this dopey movie rather endearing. It's not the debacle one might assume it to be (Kaufman DID apologize for it during an appearance on David Lettermans' late night show), although it clearly won't be for all tastes. Some viewers find it too slow, but I thought the pacing was adequate enough; the harmless little movie only runs an hour and 18 minutes anyway. It's not particularly witty, although the dialogue is good for some chuckles. Catskils' dialogue largely consists of one-liners concocted by Henny Youngman, although Carter did come up with some of his own material. Lovely widescreen photography is an asset, as is the appealing soundtrack composed by John Williams. The undeniable standout is the makeup created by Stan Winston.The cast is all likable enough. The only thing this viewer didn't like was the fact that Christopher Guest and Melanie Mayron were wasted in minor roles. It's nice to see a variety of familiar faces in supporting parts and bits: Richard B. Shull, Dick Miller, Kathleen Freeman, Mary Woronov, and Paul Bartel. The great trailer announcer Ron Gans is a hoot as the voice of the Crimebuster. Director Allan Arkush is one of many filmmakers who came out of the Roger Corman school, and his other credits include things like \"Rock 'n' Roll High School\" and \"Get Crazy\".\"Heartbeeps\" doesn't add up to much when it's all over, but it's still a pleasant enough diversion.Six out of 10.","This is an expensive comedy that forgot to be funny and proved to be a huge flop upon release. Andy Kaufman and Bernadette Peters star as robots in a future time when domestic robotic servants are commonplace. They run away from a repair warehouse and wander the countryside, falling in love along the way. The cast includes Randy Quaid, Kenneth McMillan, Christopher Guest, Melanie Mayron, Dick Miller, Mary Woronov, Paul Bartel, and the voice of Jack Carter. The elaborate robots, a mix of costume and makeup, were made by Stan Winston. The partially electronic score is by John Williams. Despite all of that talent, it's pretty awful, with no real story, and the attempted jokes just land flatly, partially because I was expecting Kaufman's usual brand of humor and got something completely different. The failure of this ended whatever big screen chances controversial comedian Kaufman had.","I'm not sure what I just saw here, & how I've never even heard of this before. It is easily the most unintentionally bizarre thing ever conceived on film, & though it's a genuine failure on multiple levels (So much so that Kaufman apologized & offered people their money back on a Letterman appearance) it's not without its charms.It's got some interesting cinematography, makeup effects by the acclaimed master of 80's FX Stan Winston & a wonderfully unprecedented synthesizer & orchestral fused score, composed by none other than the great John Williams, which lends the film some heart...beeps.Though I'm really surprised that Carol Kane didn't end up as the female lead, Peters & Kaufman bring to the film exactly what you'd expect, as well as they likely could, & there is a root of a story in there with some actual heart. I streamed it on Amazon. Don't watch it to see a good movie, as it may be 1 of the movie industry's biggest train wrecks. Watch it like a time capsule revealing something historical about a people who lived nearly half a century years ago & their vision of a future. 1981 was a strange time.I swear, Andy Kaufman had the absolute strangest career in entertainment of anyone who ever breathed. It's like he lived in the cracks between where the entertainment industry reality stopped & fantasy began. If anyone else had made this movie, I'd think they had gone mental, but if you said to me Andy Kaufman made it, I'd be like \"Oh... That makes sense\".","Val (Andy Kaufman) is a high class robot damaged in an industrial accident. He's put in storage next to Aqua (Bernadette Peters). He's a business robot and she's given more charm. They are joined by comedian robot Catskill. They leave the warehouse to gather input and are pursued by the Crimebuster robot. Robot mechanics Charlie (Randy Quaid) and Max (Kenneth McMillan) are sent to retrieve the robots. Val and Aqua build Phil out of spare parts.It's not cute enough to be adorable. The robotic acting forced on Andy and Bernadette leaves out the humor. Catskill's bad jokes only deaden the comedy. There is 1 or 2 touching moments if the audience can stay awake.","'Heartbeeps' belongs on a short list of strange bad movies of which you have never seen their like and are likely to never see again. It is easy to dismiss a movie that is a total waste of time but even through it falls on its face you have to give this one points for trying.Somewhere in the future two robots named Val (Andy Kaufman) and Aqua (Bernadette Peters) wonder what else might be out there in the world besides a droll existence playing butler and hostess to their owners. So they break out of their slave state and go exploring.Along the way they meet an odd-looking comedian robot named Catskill and a boxy little robot named Phil who acts more or less as a surrogate son. Unbeknownst to all of them they are wanted. To prove it, hot on their tin tails is a mean robocop named Crimebuster.There really isn't much to say about 'Heartbeeps' except that Stan Winston's Oscar nominated make up effects are really very good. Other then that the movie wanders about searching for a laugh or two and comes off as a bad novelty item rather than a movie. This is the kind of bad movie that you can call terrible but not forgettable."],"review-user":["suzy q123","Wizard-8","vanloons","Pooua","danarose_crystal","matrix29","stonem","Chazzzzz","robot-cat","FredI-7","Movie-Robot","alias_fate","mark-4401","editor-187-980918","josh-98819","xxxhull","crystalfan","mackdaddyspliffs","jclhats","fbingram","Hey_Sweden","calvinnme","Mojochi","SnoopyStyle","The_Film_Cricket"],"review-date":["15 May 2001","24 October 2009","23 December 1999","19 April 2004","30 December 2004","27 March 2011","30 April 1999","15 February 2000","17 February 2004","15 April 2006","13 March 2002","3 March 2006","5 December 2008","4 January 2014","26 February 2017","28 March 2004","15 February 2005","27 December 2003","28 May 2002","23 February 2011","23 September 2017","11 February 2017","31 August 2015","2 August 2015","6 November 2014"],"review-rating":["10","10","6","2","9","3","1","3","1","6","3","10","1","6","1","6","4","4"],"review-title":[" One of the oddest movies ever made.\n"," Obscure for good reasons\n"," Wonderfully Bad Movie\n"," A Charming Allegory\n"," Well, I LOVED Andy, and Heartbeeps; it was given short shrift, PR-wise, and editing/writing, too\n"," Slow but charming in a way\n"," Worst robot romantic comedy ever\n"," Best Robot Romantic Comedy Ever\n"," As an Andy Kaufman fan...\n"," God this was horrible\n"," The title of this film alone makes me groan.\n"," Damn you, Mike Nelson!!! *shakes fist at sky*\n"," HBO Family\n"," Vastly under rated\n"," Fails by today's standards\n"," One of the greatest cult movies ever!!!\n"," heartbeeps rulzzzzz !!!\n"," Pluto nash the prequel\n"," I thought this was a cute Movie.\n"," Only movie I ever walked out off\n"," Highly offbeat, amusing love story with a twist.\n"," A high priced failure\n"," An Derailed Journey Into Complete Heterodoxy\n"," not funny and tired\n"," Heart Bore\n"]}