{"review-url":["http://www.imdb.com/title/tt0073078/reviews"],"review-text":["I'm Mike Sedlak. I co-wrote the score for this movie. And proud of it. And I love all of the comments. Some have not gone far enough.The movie premiered in San Francisco in the summer of 1973. The theater was packed with friends and family. We all clapped.Five days latter, it was pulled from all of the screens in the Bay Area.If anyone is interested hearing some of scene by scene details, which might make the movie even more enjoyable, please let me know.We could start with the shot where Gideon Blake throws the toilet plunger to distract one of the evil henchmen guarding the radio transmitter on the deck of Bud's house. Or how Gideon diffused the bomb in the original version.Didn't help. It still bombed.Bring it on.","I watched portions of this bizarre film with my jaw hanging open in disbelief.  For a start, the premise is that a criminal ,trying to get two of his associates released from jail, threatens to detonate an atomic bomb in San Francisco. Yes, that's right, an atomic bomb.  Isn't he over-reacting a little?  Where did he get hold of it?But don't worry, a member of the President's security team is investigating. In real life, I doubt if they would let this nutball within 100 miles of the President.  Sporting a strange mullet haircut, carrying a cane and wearing a poloneck white sweater, Ron Casteel is the most conspicuous undercover agent I've seen.  In moments of tension, he is prone to make philosophical speeches (\"From the moment I was born, I started dying\" one begins) and recite poetry.He and a colleague investigate VERY SLOWLY.  Even though the film has an extremely short running time, it seems very long, mainly because every scene is extended to at least twice its natural life, accompanied by irritating and often completely inappropriate music (no less than five composers worked on the film!)There is some impressive location work on the Golden Gate Bridge at the film's climax and I guess that is where most of the money went.  Absurdly, even though our heroes have discovered the location of the bomb, apparently they don't inform anybody else.  San Francisco is about to be nuked and yet there aren't squads of police, atomic scientists and bomb disposal experts milling around, just our two heroes shooting it out with the baddy as the countdown continues.  This lunatic farrago comes to a climax that is - well, let's just say it's highly unusual and very much in keeping with the rest of the film!","One of the worst films I have seen outside of the horror genre, this snoozer-loser dulls the mind and spirit like a morphine drip, but does nothing to ease the pain. Unlikely story which concerns a nuclear device ticking away on the Golden Gate bridge, and the back-and-forth bickering of political figures as to what should be done about it, is a showcase for unmotivated performances which is teeming with uproarious dialog and paced with the all the steadiness of a three-legged race. GROUND ZERO suffers from a lackluster and unalluring visual quality distinct to old, cut-rate film, and it somehow manages to flatten the appeal of its picturesque San Francisco environs(making this look more like a film lensed in Baltimore). The door was wide-open for gratuitous violence and cheap thrills for this project, an opportunity left essentially untapped(although the scenes taking place on The Golden Gate Bridge clearly *were* filmed there, marking the one-and-only point of distinction in this movie). By no means recommended, even to foaming-at-the-mouth fans of bad movies. Chances are this won't even cross your path, but in the event that it does, don't dignify its meager existence with so much as a sideways glance.2/10","This is absolutely beyond question the worst movie I have ever seen. It is so bad in fact that I plan on renting it again as soon as I can find it. This movie makes 'Plan 9 From Outer Space' look like an Oscar contender. Just LOOKING at the actors makes me want to laugh out loud. I cannot say enough bad things about this movie. It's awfulness aproaches perfection.The plot is based on a terrorist attack with a nuclear weapon in San Francisco (I think). That's as far as I can go ... I am laughing too hard. I know it shouldn't be funny but ..... *LOLOLOLOLOLOLOLOL*MOVE OVER ED WOOD !!!Regard's *DATo*","What a strange atmosphere is being created in the streets and on the Golden Gate Bridge of San Francisco in this exciting action picture. Although the characters and the story are in fact bad, it still has a certain cult-flair.","This movie was a real surprise. It's not everyday that you find a movie that manages to fail in nearly every possible way. \"Ground Zero\" could almost be a cult film for its amazing level of weird dated badness.The plot concern some gangsters being on trial and a man holding the city hostage with an atomic bomb in the golden gate bridge to blackmail the gangsters release. Our heroes are a ugly secret service guy who talks like he's in a bad radio show from the 30s and his wuss of a partner who hates violence but at least acts better than most of the cast. They shoot people, drive around San Francisco, fight, and exchange terrible dialogue.The only real strength \"Ground Zero\" displays is wide angle shots from the top of the Golden Gate bridge. It is neat to see those dizzying angles from way up there. All the bridge location stuff looks pretty good. The atomic bomb that's there waiting to go off looks terrible and the script is useless, but that bridge still looks fine.Also, this thing is slow. It's only about 80 minutes, but they drag so badly. While we were watching it my friend and I just found ourselves talking about way better movies like \"It's A Mad Mad Mad Mad World\" and such. So, yes, please don't watch this unless you're drunk or something."],"review-user":["mgsedlak","heedarmy","EyeAskance","DATo-2","vinnienh","sexytail"],"review-date":["1 August 2008","3 May 2002","6 April 2004","25 June 2000","6 January 2001","12 May 2010"],"review-rating":["1","1","8","1"],"review-title":[" Ground Zero - The Inside Story\n"," Spectacularly bad\n"," This zero belongs in the ground.\n"," Sublimely Awful\n"," Extraordinary picture!\n"," It Nearly \"Slew\" Me\n"]}