{"review-url":["http://www.imdb.com/title/tt0091594/reviews"],"review-text":["A unique blend of musical, film-noir and comedy - with a few sex scenes thrown in for good measure. The only other film I can think of with a fairly similarly wild and madcap mixture of themes and clichés is the French movie Billy Ze Kick - but that has a more surreal and quirky approach.Not that this film would not be surreal or quirky. The humour is at times quite subtle, at other times blatantly in your face - and often crossing the border to offensiveness. To give an example: in the post-coital chit-chat with a prostitute our hero Max Müller encourages her to reveal who was responsible for a recent murder, using the words \"Schiess los!\". Literally, this phrase means \"Shoot!\" in German, and that is exactly what a hidden assassin does in response. In other words - this beautiful lady was sacrificed for a pun.Müllers Büro is also one of the very rare examples of films with funny sex scenes. Larry's romance is accompanied by the song \"Ich will mehr\" (I want more) - while the song perfectly underpins the action, the meaning of its words changes a couple of times, hinting at the end at Larry's inability of providing any further service. The film's main love scene between Max Müller and Bettina Kant lacks such subtlety - this is jaw-dropping stuff, especially when Bettina's singing slowly transgresses into moaning, of course all in the rhythm of the music.Unmissable, unless you are one of the easily offended.","If you haven't seen this film, do it. Its a genremix as i've never seen another. Some very surreal scenes, some hilarious funny stuff, a film noir felling, musical numbers with a swing, sex scenes (The 2nd best played orgasm on Film, bested only by Sally), a pitch of Orson Welles blended together into a work of art. As an work of art it hasn't to be logical at the end, at least not logical for everybody ;-). I owned an tv copy on VHS but loaned it to an ex-girlfriend and now i can't get it back. But the film should be out on DVD in Austria on 10.06.03 and be sure, I will buy it.","\"Müllers Büro\" or \"Müller's Office\" is an Austrian German-language movie from 1986, which means it has its 30th anniversary this year. The writer and one of the directors is the late Niki List, who also plays a supporting role in this one. There is no denying that this film is a pretty creative work. But I must still say that the longer the film goes the less I liked it. The suspense and music and story as a whole only works for so long. and everything over an hour, especially 105 minutes, may have been far too long for this one to be a success. List was at the age of 30 here (approximately) and it was still early in his career, but he wasn't a rookie either. The cast includes actors Schmidt and Vitasek who are still known today, in Austria in particular, and the central female character (still only supporting) is played by the late Barbara Rudnik. Her presence adds a nice touch of film noir to the film and this is definitely one of many genres and areas that this film is about and even sometimes pays tribute too. So yeah, there is a whole lot in this film and you will probably recognize something new every time you check it out, but this doesn't mean it is a good movies. Laack of focus has destroyed many films and this is one of them. It's perfectly fine how absurd and surreal the movie is on many occasions, even if it goes so strongly against realism more and more the longer it goes.But the characters and eventually also the story become pretty stupid eventually and all the good premise from early on is sacrificed for this over-the-top approach. I also think the music gets a lot worse during the film. Early on, it is pretty great. The acting is mediocre maybe, but this film never was about performances anyway. I myself wish I could give this one a thumbs-up, but there is just no way. However, I can see why it is still famous because it is such a different film and nothing you'd expect in an Austrian film from the mid-1980s. Different is not good though in this very case. Watch something else instead.","This thing is SO much fun ! It takes on all film noir clichés and does so very well  ... I needed to use my old PAL vhs and burn my own DVD of it ... for american minds in is incredible that this was on prime time TV (public, not cable) in germany .. it has quite an explicit love scene where the main star goes down on the leading lady (while she keeps singing .. this scene is hillarious) One of the few movies that will never see DVD exposure .. but really should ..  and yes .. the 3rd act is a bit sucky !","Do you liked \"Dead Man don't wear Plaid\"? What about \"Top Secret\" and \"A Chorus Line\"? Well Müllers Büro is a fantastic Melange of all three of them, as unlikely it may seem. Very Funny \"tongue in Cheek\" Movie Noir hommage with stunning Songs and great Dancing. You have to have a little odd humor for this movie, but it is very well worth seeing it. I've voted it a nine, If the end would be a bit more logic it would have gotten a ten. Thats how Good that Movie is.","Seeing this film for the first time twenty years after its release I don't quite get it. Why has this been such a huge hit in 1986? Its amateurishness drips from every scene. The jokes are lame and predictable. The sex scenes are exploitative and over the top (that is not to say that Miss Rudnik does not have nice boobs!). The singing is \"schrecklich\". The only genuinely funny scene is the big shoot out when the gangsters die break dancing, a trait that dates the movie firmly to the mid-eighties. It's really quite puzzling to me how incapable I am to grasp what evoked the enthusiasm of the cheering audiences in 1986 (and apparently still today, reading my fellow IMDBers comments).","\"Müllers Büro\" is a movie which many will watch and enjoy until the end, while others will stop watching it within five minutes. It is a parody of detective movies with all the twists and turns; the action takes place only at night in the dark corners of a city which resembles Batman's Gotham City (look carefully at the streets, buildings, the police car chasing the criminals, etc.). It is also a parody of musicals with its really funny characters such as Müller's secretary and Vitasek's (the actor playing Müller's assistant) lover who do their best to sing, albeit not very successfully.The spaces occupied by the characters have their own presence in the film such as the decadent Blue Box (there is a real club with this name in Vienna) where one can see a sailor hitting on a girl in the background, Müller's apartment with the black paint smeared on the walls and the dirty kitchen, Müller's bureau with the sweet picture of his assistant, etc.The humorous moments in the movie are many and include \"flat in the face\" type of humor such as Müller farting in his assistant's face, the prostitute charging Müller extra for orgasm, the ridiculous outfits of the female thugs of Montana, etc.A legendary film from the 80's especially for those interested in Austrian or German-speaking cinema."],"review-user":["SMK-4","Kongstew","Horst_In_Translation","caipirina7","Freya-6","rigi","borisnenchev"],"review-date":["21 August 2002","17 January 2003","30 December 2016","3 April 2002","31 July 2001","28 July 2007","31 August 2009"],"review-rating":["10","9","4","9","4","10"],"review-title":[" Funny sex scenes\n"," Praising this film as cult.\n"," An interesting idea, but ultimately tries to be too much\n"," German Language Rocky Horror Show ??\n"," Mad, Mad, Mad but funny and great\n"," Humor of Times Long Gone\n"," You will either hate it or love it.\n"]}