{"review-url":["http://www.imdb.com/title/tt0063611/reviews"],"review-text":["I don't recall a film which so deftly shows the emotional destruction of war, as mirrored in one single marital relationship. The focus of the film is the union between Ullman and Von Sydow--the two are in every scene. Through the course of the film, they experience a role reversal--one has the strength of survival and the other is reduced to emotional escapism through dreams. Both will lose a measure of humanity, but one to a greater degree than the other. The characters and the viewer go through periods of fluctuation in regards to closeness--the camera pulls out and away, sound disappears, words are lost, only for the camera to return to painterly closeups of its facially expressive stars. The confusion and fluctuation may make this film hard for some viewers, but this is all purposeful under the master hand of Bergman. I think the use of a \"fake\" war makes the film timeless, as relevant today as ever before, and by focusing on the human relationship through war, makes the film relevant to everyone. The pair could be anyone. The film is not grounded in place or time, but rather in emotion. A unique and effective war film, unlike any other. Bergman's films are virtuosic in presenting human relationships--that he would bring this to a war film is masterful.","\"Shame\" (\"Skammen\") (Swedish, 1968): Definitely one of Ingmar Bergman's masterworks, with cinematography by Sven Nyquist (who did most of Bergman's, and some of Woody Allen's films). \"Shame\" is less symbolic than some of Bergman's works, and, an intense, psychological study of a married couple, Jan and Eva, (Max von Sydow & Liv Ullmann) who have their personal problems like anyone else, but suddenly find their otherwise quiet Swedish island life completely upset by a civil war. Faced with increasing losses and degradations, we watch them struggle not only against circumstances, but their own psyches. The number of \"shames\" depicted is huge. This story may have influenced Lina Wertmuller's film \"Swept Away\". Just a guess. \"Shame\" is an ULTIMATE in gorgeous b/w photography, and ugly psychological horror.","When Liv Ullman's character says, \"I feel like I'm in someone else's dream and they're going to be ashamed when they wake up,\" she is referring not only to being an  unwilling player in society's war games, she is referring to being an ignorant participant in life itself. At the film's end, when she says that she had a dream that she had a child and she was trying to take care of it, but she forgot something else, the implication is that she has forgotten what she has learned in the war she's just survived, that like her own mother before her, she will be unable to pass on any vital lessons to her own child. And, therefore, the cycle of the shame of ignorance will continue...ad infinitum...","A gruelling watch, but one of Bergman's finest films. Interesting to compare this with The Hour of the Wolf, as both feature the same lead actors as artists (or an artist and his wife) who have taken sanctuary on an island. In the earlier film it's largely inner demons that lead to von Sydows disintegrating personality (at least that's how I read it) whereas here it's very much circumstances beyond his control.Much has been written about the unsympathetic central characters, particularly von Sydow's. For me there are flashes of a good (if flawed) man early in the film, but one who copes badly with adversity. The flaws become all that is left as his humanity is gradually eroded by one horror after another.I watched A Passion (Ullmann and von Sydow on their island again) soon after this, and was amazed to recognise many of the same locations. And then there's a dream sequence...","Bergman's Skammen is one of the most realistic depictions of war ever set to film.  This is not an action film by any means, though the pacing is faster and there is most action than in most any other Bergman movie.  Nor is this a romanticisation of war or patriotism, unlike most war movies.  In fact, the gritty realism and the deliberate ambiguity of the character's loyalties has a very contemporary feel.Skammen is a darkly lit movie, that should be watched at night, so as to let it work it's magic.  Many of the effects are conveyed indirectly, but so effectively that some scenes compete in intensity to a contemporary, insanely huge budget film like Saving Private Ryan.  Of course, the action in Skammen is on a much smaller scale but it is impressive none-the-less.While the film-making style feels contemporary, the setting of the film feels timeless and placeless.  The war-torn countryside, and even the yet intact provincial hamlet could be anywhere, any time.  And this film is not so much about specific historical events, with specific names and dates, but about universal human reactions to adversity and chaos.The acting in Skammen, though typically impressive from Ullman and Sydow, is not of primary importance in this film, unlike most other Bergman movies. Through much of the film they are spectators, much as we are.  Bergman has the war imposed on them, and through them on the audience, and their reaction is perhaps what any of our reactions might be.Highly recommended.  10/10","It's difficult to choose a representative film from the entire Ingmar Bergman's filmography. Each film deserves a comment because it's like a piece of art in its own.I chose \"Skammen\" because I saw it recently and because I think the message -although being a 1968 film- is still valid. The subject is quite simple: a couple is surprised by war, which changes forever the existence of the two people. We can discover their real feelings and their real values.We can find shame in more levels.First, husband's shame for not being able of giving a child to his woman. He's also an extremely coward man in the first half of the movie, he feels shame also for that.Second, wife's shame for not being a mother -she feels frustrated. She's shameful also because she has betrayed her man with an important man of their country's army.Third. They both feel shame because they pretend being friends of this man, who saves them from tortures and jail. (They're actually accused of being traitors, in expressing other political opinions.) As a compensation, that man come to their home whenever he wants and take advantage of his position for becoming a woman's lover. The husband lets things going like this, it's the price he pays for a kind of freedom...Fourth. Shameful is of course war and life during it.Bergman makes a flawless movie, he studies people as they are. Without big budgets and huge sets. A simple film, deep, superbly photographed in black and white.","Shame is rather unique as a war film (or rather quite the anti-war film) in that it not only doesn't focus on the soldiers or politics involved (there is politics but not how you'd think it'd be shown), it deals with its two main subjects as the only two beings that can possibly be cared about at all in this brutal, decaying society they inhabit. Ingmar Bergman, in the midst of his prime, and following two other heavily psychological films, Persona and Hour of the Wolf, is far more interested in seeing what the effect of war has on usually civilized beings, that it brings out the worst in them, and also in a cathartic way is a reminder of what is truly crucial in living. His two key actors are frequent collaborators and friends Max von Sydow and Liv Ullman (as the Rosenbergs oddly enough), who are musicians living on a farm on an island (not too dissimilar from 'Wolf' when one thinks about it).They see the tanks roll by, and a couple of old friends already getting worn down, but they try not to put it too much to heart; there's a sweet scene where the couple just talk, rather frankly but with heart (all one shot, as is repeated through the film is to perhaps create a sense of being provoked)...Then comes the trouble, including a fake film of propaganda made at gunpoint with the Rosenbergs, the psychological turmoil in being prisoners of war, and the terror involved with a 'friend' in the military (one of Gunnar Bjornstrand's most subtle works with Bergman). Needless to say this is not one of the easier films to go through in terms of Bergman's filmography, however for some it may be one of his more accessible works. His religious themes this time is kept very low key, even as the idea of keeping a sort of faith pervades the film's atmosphere. When there is war action it's shot in unconventional, quick ways (via great amigo Sven Nykvist).And the deconstruction of the relationship between Jan and Eva is corresponded successfully with the backdrop of a chaotic kind of war-ground where the lines are never too surely drawn. In a way this film, shot right at the height of the worst times in Vietnam, is even more relevant for today; I couldn't help but see chilling, uncompromising coincidences between Iraq and elsewhere with some of Jan and Eva's scenes with the fighters, or those 'in charge'. The very last scene, by the way, is one of Bergman's very best, all around (acting, directing, lighting). It's not the kind of war picture (or, again, anti-war, I find little of the John Wayne spirit in this Svensk production) that I would recommend right off the bat to my friends all into Saving Private Ryan- it has a little more in kinship with Paths of Glory, looking at the effects of the hypocrisy of war. But in reality, like any of Bergman's \"genre\" films, it stands alone, however one that packs a wallop for the art-house crowd.","An interesting and always gripping film, Bergman's \"Shame\" is completely devoid of any humor. From frame one, it's an unrelentingly downbeat and depressing film, albeit one that lingers in the mind due to it's haunting images. Liv Ullmann and Max Von Sydow are brilliant as the politically uninvolved couple who suffer the terrifying consequences of being caught up in the midst of a civil war. The issues behind the war are never defined and the two opposing sides are virtually indistinguishable in that they both practice indiscriminate torture and murder. The shame of the title applies on numerous levels throughout the film. The couple find themselves capable of acts that would have ordinarily been inconceivable, as they struggle to survive the onslaught of catastrophes. They betray their souls, their friends and even each other in a desperate attempt to simply survive another day.If there's a lesson to any of this, it may be that no one can afford to be ignorant of the issues and the world around them or else they will be ill-equipped to deal with them when they inevitably intrude on even the most isolated of lives. The black and white cinematography is stunning and the suspense is often unbearable, especially when the couple finds themselves at the mercy of renegade soldiers who cannot be reasoned with. The downbeat and confusing ending, however, does not satisfy...it seems a bit pretentious and leaves the viewer feeling a bit cheated. Nevertheless, a worthwhile and engrossing film from a master director.","The apolitical musicians Eva (Liv Ullmann) and Jan Rosenberg (Max von Sydow) have been married for seven years and live in a small farm in a remote island to escape from a civil war in the continent. They provide lingenberry to a couple of costumers to raise some money and buy some supplies. They love each other and Eva is twenty years old and wants to have a baby but the reluctant Jan, who is a weak and sensitive man, does not want to have children. When the rebels arrive in the island, their peaceful and calm lives turn to hell, and they get in the middle of accusations from both sides. When Colonel Jacobi (Gunnar Björnstrand) stalks Eva, Jan changes his behavior and becomes a brutal man, and the love and affection they feel for each other change to hatred and indifference.\"Shame\" is an antiwar movie by the master Ingmar Bergman focused by the eyes of a couple of artists that are apolitical and does not listen to the news, but when the war arrives to their lands, they have their love, friendship and affection destroyed by the senseless soldiers. Liv Ullmann and Max von Sydow have top-notch performances as usual and I do not recall seeing the breast of Liv Ullmann in any other movie. The process of brutalization of the pacific and sensitive Jan Rosenberg by the war is impressive and the bleak open conclusion is pessimist and adequate to the dramatic story. My vote is nine.Title (Brazil): \"Vergonha\" (\"Shame\")","I watched this movie on a big screen a few months ago. I didn't know what to expect precisely, and for the first ten minutes I feared I might not enjoy this film. It was beginning very slowly, in silence and almost banality, which was all the less exciting as the sound was quite bad and the subtitles sometimes impossible to read.But I definitely do not regret to have gone on watching it. It is one of the most beautiful Bergman movies I've ever seen, at the same time human, ruthless and psychologically so convincing.Seldom have I seen actors play so wonderfully, with such an intensity on their faces : Liv Ullman's interpretation is unforgettable and Sydow is excellent too.There is always psychological violence in Bergman movies, and this one may be the most physically violent of them all. The strained relationships between the man and the woman evolve in parallel with the physical violence that is surrounding them...Finally, this sober, violent and powerful film contains a surprisingly striking human depth. An excellent Bergman.","This grim and dark story of war not only portrayed the effects of war one's country but also on one's self and soul. The film contained few characters which made the viewer focus and become only involved in the couple struggling through a time of war and devastation. At the beginning, the man is filled with remorse and grief when signs of the war appear in his town. The woman battles his anguish and takes control. Towards the end, one can see the effects war takes upon one's self as the husband has become brutally desperate to take charge and save himself. This fictitious war in Sweden is a fine example of the drive and determination a person needs to fight for their life.","Ingmar Bergman's moderate attempts of displaying the psychological effects of war are depicted in Shame. Although he presents emotional and deep characters, Bergman's unique film is a bit hard to follow at times. The beginning moves slowly, which takes away from the intentional dramatic impact. However, I enjoyed the complex personalities of Jan and Eva, and anticipated how they would deal with the war and each other. Bergman's ending leaves the viewer uncertain and confused, but is also extremely symbolic of the couples' sentiments and intimacy.I specifically noticed the remarkable camera angles Bergman used to illustrate his points. He often shows the back of Jan's head which suggests that his wife is the more dominant of the two. There are also intense close-ups and effective over the shoulder shots. Shame is an impressive film overall.","That is what a windbag documentary of this film \"Shame\" should be called. I am afraid that I didn't quite get the message that I was supposed to from this film. Rather, I got those messages but another one came through more strongly.I did not feel that what we were being told about the characters was what we were being shown about the characters. We are supposed, so I believe, to feel that they are balanced: that he's a coward and she's a shrew. But despite that I was not convinced that von Sydow's character was a coward. Ullman's character married a musician who takes medication for a heart condition. As the film progressed I found myself disliking the Ullman character more and more. She henpecks him for this and that and emasculates him and cheats on him with Bjornstrand because he's in charge and thus more potent and only is repentant when he is ready to give up, it's nuts: she turns a gentle solicitous man into a madman who at the end when he puts on a scarf I was expecting him to tie on a headband.Yes, the dehumanization of man is an overall theme as well: at the beginning they stop their car to see if people are okay but by the end they are poling their way over dead soldiers (not checking them for supplies, by the way), but it isn't really the war that does that to them, it seems to be each other. And finally she cares if they ever speak to one another again when she has pushed him until he has snapped and shot her lover; that finally gets him some respect. Who knows, maybe that is the point: that it is this alpha mindset that sets the stage for war to begin with.I understand that I \"missed the point.\" But everyone that speaks about this film speaks about the human race, when instead we watch a terrible wife character drive her poor husband insane: that's the thing that actually is on the screen throughout the film.","This is one of the bleakest, the most harrowing of Bergman's films I've seen. I also think this is one of the most powerful films about the ugliness of war and what it does to the human souls.The couple of musicians, who left a big city for a remote island and make a living as farmers, find themselves capable of unspeakable and shameful acts that would have ordinarily been impossible for them even imagine, as they struggle to survive horrible reality of war. They betray their souls, their friends and even each other in a desperate attempt to simply survive another day. Liv Ullmann and Max Von Sydow are brilliant as usual as lost, confused, and terrified couple that got caught in the midst of a civil war.9.5/10","This film offers one of the greatest experiences available to movie-goers. It is by no means a pleasant film, but offers realities and emotions the human mind may never have meant to touch upon. It opens pathways in how an individual thinks, and afterwards will change the person forever. The first time I saw this film was in class, and immediately after seeing it I had to skip my next class and walk around campus in order to reset my body and mind. I felt devastated and, somehow unreal, as if I didn't exist. It was only a few months later that I was telling one of my friends about SHAME, and she asked, \"Oh, is that when you were messed up after seeing it, and ran into me talking all strange about it?\" I didn't even remember running into or talking to anyone at all while outside that day, I was astonished. In plot terms it is the simple tale of a couple torn apart by war. There suffering is greater than that of the dead and by the end...there are no words to complete the image that Bergman creates. Its like a horrible dream which causes you to wake, altering your own reality forever. This film must be seen.","Shame represents a high point in the career of a master. Ingmar Bergman penetrating, existential study of a couple on the island of Gotland dealing with surviving a long war. Liv Ullman and Max Von Sydow give painfully detailed performances in this spare, stark drama. The films intensity rests in Bergman's keeping our focus on the minute, intimate relations of his two characters - both accomplished musicians - trapped in a landscape they have ceased to understand. We see the way the external pressures of the war complicate and corrode their relationship. Both characters are forced by the material circumstances of the war to betray their own sense of ethics. In one of the most powerful episodes Bergman forces us to reflect on the manipulative power of the cinematic medium by showing us a filmed interview with Ullman's character that has been re-edited and distorted for political effect by one side of the conflict and is used by the other side as evidence of war crimes in a brutal interrogation scene.","What Bergman has got here is \"What if all that bad stuff happened here in Sweden, to nice people like us?\" And what he gives us, in the Swedish language, with Swedish actors, on Swedish locations (and using what appear to be genuine Swedish military vehicles) is what was familiar from war films set in almost every other country in Europe-- all the confusing invasions and counter-invasions, political lies, internment camps, faked confessions, summary executions, torture, turncoats, \"collaborators\", and so on. As in a modern short story, it's done in the abstract, with no real names, cities, or countries used. But the stronger faction are \"Nazis\": they strut about self-importantly, and some wear shiny knee boots. One even whips things with a riding crop (ok, it's actually a cane). The victimized couple are named Rosenberg. Apart from the shame they feel at finding dirtier ways to survive-- and who would not do what they did?-- what all of the above suggests is that the title is clearly meant to refer to Stockholm's de facto complicity with the Nazis. Indeed, what we are shown is what Sweden might have looked like if Germany had asked for a bit more than mining concessions.The first half plays like a black comedy. We see the \"fog of war\" from the point of view of a comically passive couple who ignore the troops all around, the long convoys, the bombed-out buildings, the news reports, &c. They do not even bother to find a working radio. They are the ultimate in \"Not in my backyard\". They talk of wine and lingonberries; meanwhile friends are mysteriously conscripted and growing numbers of troops show up in the town. They show no curiosity about the war that has been going on around them for many years.The man (Von Sydow) is cultured, sulky, and a navel-gazer; the woman (Ullman) is somewhat more impulsive, passionate, and outward-looking. There's a beautiful scene in which the man talks about his violin: the manufacturer, he says offhandedly, fought in the Napoleonic wars, but his own interest stops with the cultural artifact in his hand-- or, more precisely, which his own warm feelings about owning it, and the security that that ownership assumes. Not in my backyard! But when war finally breaks into their bucolic idyll, the man's timidity, an irritation in good times, turns into a liability, one he ends up overcompensating for-- as is often the case-- as Bergman demonstrates subtly and beautifully. Definitely worth seeing.","'Shame' as it is best known world wide, is probably most underrated Bergman movie at the moment. Or perhaps little seen is more correct term, as most people who have seen it consider 'Shame' to be among the Bergman's bests. And the film is too great for such unnoticed film.Liv Ullmann and Max von Sydow star as wife and husband getting caught in the horrors of war. Although the war is shown mostly without epic battle scenes, rather shown just by soldiers marching by and fighter jets flying over, the sound of imminent doom is in every frame. 'Shame' is wonderful character study and what war does to a peoples' psychology. Max von Sydow's Jan is intelligent, but somewhat cowardly man. Some can even call him weak, while Liv Ullmann's Eva is strong and independent woman, who really cares about her husband. The character descriptions seem simple at first - strong wife, weak husband - but there's much more hidden in these people. Although Jan is not your typical macho guy, his intelligence compensate lot of his cowardice. And Eva, although strong woman, is still in need of some support from her husband. While the war comes closer and closer we see their relationship starting to fall apart, and then getting stronger again, until they get right into the middle of war horrors, with both sides riding over their farm. They both grow cold and stay together just for habit. Jan becomes cruel and violent, while Eva becomes not exactly submissive, but rather distant.Bergman has stated his dissatisfaction with the film in several occasions, and never considered it his best work, but 'Shame' is must see film.","A dark and grim tale about the effects of war even on those not fighting, the film manages to achieve a high level of realism in a number of different ways. The most obvious method is the frantic camera-work and editing, plus the use of close-ups to make it more intense, and excellent sound mixing to add impact. Everything is also quite unclear throughout. The film gives very little background information about the setting, time period or characters, and this ambiguity is like what it is like to live in the middle of a war. It is also about the central characters themselves - a couple who cannot have children, a husband who is unable but willing to fight - but having a bit more insight into these characters would have made them easier to relate to. The film itself is frustrating to watch with the lack of background detail, and having unrelenting bleakness makes it difficult to appreciate. Hopelessness is not easy to convey, and Bergman does not manage to fully succeed in making it tangible, but he does succeeds in many other areas, with a screenplay full of interesting ideas. The acting is also superb with Liv Ullmann and Max von Sydow both in top form. If not a very likable film, it is a well-made film - and the beginning credits are great.","A very credible and unsettling movie portraying the effects of war on the general public, Shame gives us a chilling understanding oh Ingmar Bergman's beliefs. The absence of color and sound (as in a soundtrack) helps to give the film a more realistic feeling. There is no soft or hard lighting or a variety of camera angles to give the story a charming or dramatic effect. Everything is very simply portrayed as it would be in reality. At times the storyline was confusing, but perhaps in order to give a sense of the characters' frame of mind  how they too do now know what is happening or why. The simplicity of the film made it somewhat boring, but I could understand how the director is trying not to glamorize the story and points. He depicted the harsh and unsettling events and effects of war. In the beginning the characters were introduced and shown as content with the lighter settings and very long, drawn-out shots. When all of a sudden the war struck upon them, they were much darker and quiet with less intimate shots. Bergman did a good job on allowing us to be consumed by the war ourselves and presenting an image of it the so adequately corresponded to war. Although the storyline itself was not too impressive, the content of the film was.","Ingmar Bergman is really a great director,however wasn't the best one for me, there's fine movies in his career as Jungfrukallan just to quote my favorit a near masterpiece,Skammen has something weird to start,all is based on a fictional civil war which was set place in somewhere at Scandinavia,whereupon there's no civil war at this place in that time which the picture may implied,forgetting all this the picture make sense,a overlooked at point of view over such damages for those people whose most of them don't have no idea why it should be happen,such atrocities,such pain and worst how the persons changes over for instance two leading roles,a anti-war picture but sounds a unreal for to be raised under a virtual war....therefore and just for that 7 out 10!!!Resume:\nFirst watch: 2018 / How many: 1 / Source: DVD / Rating: 7.5","While deciding whether or not to make a film covering the Algerian War, Francois Truffaut, the French master of cinema, eventually decided not to take on the task because he felt as though \"to show something is to ennoble it\". Truffaut further claims in a publication in 1960, that an anti-war film is a contradiction in terms, a sentiment which I tend to agree with. Shame, directed by Ingmar Bergman in 1968, challenges that idea. Depicting a couple who attempt to shield themselves from the war being waged around them, Shame is a powerful statement proving there is no winning on either side of a war. As a civil war has engulfed the area in which they live, Jan Rosenberg (Max von Sydow) and Eva Rosenberg (Liv Ullmann) an apolitical couple who used to earn their living as musicians, grasp at the remnants of what used to be their lives. The war has encroached upon their relationship, as well as their livelihood. Jan is weepy and constantly dealing with the emotional disturbance over the chaos and killing the war has caused. Meanwhile, Eva desperately wants to have children, but her husband can't imagine bringing a child into the anxiety-ridden life they now share. When the war reaches their town, rebels attack killing many of Jan and Eva's neighbors. The couple is continuously harassed and their home eventually destroyed when the two are arrested as collaborators. No matter how far they run, there is no escaping the conflict that has taken over their lives.Shame shows two people who purposefully don't take either side in a war, yet that very silence and unwillingness to take sides results in their being assumed collaborators. Bergman seems to go to great lengths through this film to not only show the necessity of remaining neutral in times of military conflict but also to expose how dangerous it is to hold such a position. Shame is powerful because it exposes the difficulty in actually living a situation where people are not shielded by the side they chose in a battle because they didn't choose a side at all. The couple only has each other and with a host of marital problems to deal with on their own, their lives are further complicated when life or death problems penetrate their existence. We get a glimpse of the security the two used to share before the horrors of war tore them apart outwardly. Inwardly, however, the two were experiencing difficulties which left their own marriage clouded in as much uncertainty as the world around them. In my viewing of Shame, the neutrality was the most interesting aspect as the audience is able to see clearly that the two had not chosen a dominant side for the future of their marriage, just as they hadn't shown a side to adhere to in the war. Using his trademark humanism, Bergman delves deep into a marriage and reveals that no matter how far we delve into the lives of others, we may still be none the wiser to what will happen to them.","Ingmar Bergman's psychological study of how humans react in a situation of war. The film takes place on Gotland, where invasion forces arrive.Pauline Kael reviewed the film in December 1968, writing, \"Shame is a masterpiece, – a vision of the effect of war on two people, – but – it has many characters and incidents – in many ways, (it is) Bergman's equivalent of Godard's Week End – also an account of what people do to survive – Liv Ullmann is superb in the demanding central role, – Gunnar Björnstrand is beautifully restrained as an aging man clinging to the wreckage of his life. The subject is our responses to death, but a work of art is a true sign of life.\" Bergman is always great, at least in the black and white era. I'm less a fan of his color films. But when you have that crisp, bleak back and white cinematography and Max von Sydow, you can do no wrong.","In the first twenty minutes we grow to adjust to the rich normality of these lives, and then the bombs start falling. War changes everything. Beautifully photographed, acted and written obviously. This film is a triumph.The proper aspect ratio, unlisted on IMDb at time of writing, is 1.33.1, and it is correct on DVD from Distinction Series from Region 4, though I can't speak for any other releases. The transfer is nice too for DVD. This ranks as one of the best Bergman films I've seen and one of the best war films I've seen. Can't recommend it highly enough. 10/10"],"review-user":["purban","futures-1","Norwegianheretic","neil-313","sgoldgaber","michelerealini","MisterWhiplash","Auric2003","claudio_carvalho","tonio_r2","smh19","TootlesT","mockturtle","G_a_l_i_n_a","cbalogh","Rigor","n_r_koch","hrkepler","sol-","hms4-1","elo-equipamentos","oOoBarracuda","gavin6942","Ben_Cheshire"],"review-date":["28 June 2005","17 July 2005","7 December 2002","18 July 2005","28 January 2003","6 February 2004","19 February 2006","18 August 2004","27 June 2009","28 January 2002","14 February 2005","14 February 2005","28 March 2005","7 January 2007","29 July 2006","20 June 1999","10 March 2007","12 June 2018","29 November 2005","15 February 2005","13 August 2018","6 September 2017","20 April 2016","13 May 2015"],"review-rating":["10","9","10","10","10","9","9","6","6","6","9","10","10","8","9","8","7","10","7","10"],"review-title":[" A Relevance Unmatched\n"," Beautiful and ugly\n"," PASSING ON IGNORANCE\n"," Bleak but essential\n"," Incredible\n"," A flawless simple film\n"," one of the great war films (for the art-house)\n"," A Gripping but unrelentingly depressing film\n"," The Process of Brutalization of a War\n"," Impressive\n"," Skammen\n"," shame\n"," Scenes from a War/Marriage: Emasculation and Misogyny in the Face of Death\n"," An unforgettable film\n"," Astonishing! Vanquishing!\n"," Bergman at his best.\n"," The fog of war\n"," Bergman's only \"sci-fi\"\n"," My brief review of the film\n"," Shame was a very practical and well depicted film of the effects of war on the general public\n"," Fictional war unfortunately!!\n"," Shame\n"," Black and White Bergman Never Fails\n"," Forget \"horror\" films, this is truly terrifying.\n"]}