{"review-url":["http://www.imdb.com/title/tt0097648/reviews"],"review-text":["There is a clever little scene in The Karen Carpenter Story, where both Carpenters are in a recording studio, and Richard makes an impromptu decision to have Karen sing for the owner of the studio.Richard picks the wrong key for Karen to sing in, so Karen is singing above her natural range. You can see a look of bemusement on the owner's face; he figures she really can't sing. Richard quickly realizes his mistake and tries again in a different key. The next thing you hear is Karen's amazing, beautiful voice, and the owner does a priceless double take. Nicely done! For some reason, I have never forgotten that scene.The Karen Carpenter Story chronicles the meteoric rise of the Carpenters, and Karen's struggle to overcome anorexia. A lot of things are glossed over. This isn't a documentary, and the movie left me with a lot of questions. Very little is mentioned of Karen's solo venture (the CD was released only a few years ago. If you buy it, you will wonder why they waited. It's some of Karen's best work. The songs aren't as timeless as her work with brother Richard, but it was a great recording, in my opinion).I have heard it said that, you can be listening to a cheap, time-worn little radio in the middle of the Third World, that would seem to produce more static than anything else. But when a Carpenter song comes on the radio, you would think you were listening to a $1000 Hi-Fidelity unit.Watch this movie!","There have been a lot of opinions expressed as to the crux of Karen's problems. Certainly the eating disorder was a result and not a cause of the talented singer's anxiety.The \"controlling mother,\" need for romantic love, and career stresses all undoubtedly played a part. However, my feeling is that the act of moving Karen from her drums to the center stage mike was the real trigger.The young musician felt comfortable and natural behind the drums. It was where she really belonged, despite professional dictates. A drummer's always a drummer at heart, sitting behind those traps and wielding those sticks. Her singing emanated from and was intertwined with the drumming, and not an isolated entity.The move to center stage and abandoning her trap set was the beginning of Karen's downfall. The move robbed her of her base, grounding and natural habitat. It threw off her balance, and began her downward spiral to a rash of personal problems.Seems like a small thing, yet my feeling is that had Karen remained behind those drums singing her songs, she might still be with us today.The TV movie includes lots of great Carpenter hits, and includes the contribution of her protégé brother, Richard, who currently (in 2006) is alive and doing well in California.","I didn't personally know Karen Carpenter, nor, Richard for that matter, so I must go by how the movie portrayed her. I think a better person to ask about it's accuracy would be her brother Richard. However, from what I did see and learn of Karen, I felt her pain, share her sadness, and she was a very special person to me growing up. I know that I wasn't born until 1965 so I didn't get to know her as much as some of you older fans but I definitely grew up listening to her music and I have fond memories of her music. I remember the song about the \"Radio\" (every sha la la la every whoa...so fine,) etc and I remember \"We've only just begun! As a matter of fact, I memorized many, many of her songs and some people (quite a few) tell me that my voice sounds almost identical to her!!! ( I am not joking on this). I also used to be anorexic during high school and part of college (1978-1987) to be exact and weighed anywhere from 82 pounds to eventually 120 pounds in 1987. I developed some pretty serious health problems from that which helped me to identify with the actress portraying Karen in the movie. The mother (Agnes) was very MUCH like my mother in many ways and I could also feel the pain that Karen must have experienced. For, my mother was often unfeeling, critical, and disapproving as Agnes was (if this was true to accuracy). The movie was helpful in identifying and getting to know Karen on a more personal note by not just hearing her music but by seeing what she was going through. It is quite difficult to portray a person's entire life in 2-3 hours and recount every single detail perfectly so I would have to say that there is probably no biography that is that accurate. I will give this story an 8 though! I wish I did know Karen personally! I would have DIED to meet her!! I would have loved to have shook her hand, given her a hug, or talked to her. I feel her warmth and love every time I hear one of her songs and she is greatly missed.","I've never usually been emotional at movies, but this one requires a box of Kleenex standing by. It is not hard to be carried back to the time when the Carpenters' were at the top of their profession, cranking out hit after hit like a music factory. They had a perfect combination, Richard's tremendous musical genius and Karen's angelic voice. As I watched the story unfold, I found myself remembering this wonderful time and the thought crossed my mind, how many people fell in love listening to the Carpenters' music. How many prom-nights was \"close to you\" danced to cheek to cheek, and how many wedding ceremonies used \"We've only Just Begun\" as the wedding dance? That was a special time, even at a time when hard rock and heavy metal were beginning to make a big splash on the music scene, The Carpenters' did not suffer for there share of the music market in the 70's was nothing less than staggering. Anyway, the movie touches on all the technical plus gives you their personal side of the lives of these two icons, and the demons they dealt with, Richard successfully, Karen, tragically. At least, Karen will always be immortal through the legacy of music left behind, and as I've seen it written at her graveside, \"A star on earth, A star in heaven.\"","This movie could have been fantastic if it was on the big screen and cuts and changes weren't made for network television airings. I too would have cast a different actress to play Karen, and the movie changed many events in the Carpenters' lives that were real or left out certain events altogether. As a huge Carpenters' fan, I expected much more and was disappointed.","Every time I hear Karen Carpenter's voice, there is that old familiar feeling of 70's blues. What an overwhelmingly beautiful and mature voice she had. Cynthia Gibb cast in the title role does a good job, however, I thought Karen Allen would have been a better choice. This is a tearjerker movie that does a fine job of presenting the professional careers of Karen and Richard but also the personal struggles that Karen dealt with and her disease. The recording sessions in Herp Albert's studio are very nicely done. However Karen Carpenter turned out, there was a time when she was very special and brought a great deal joy to her fans and music lovers. Even if you weren't a Carpenter's fan this is a nice story that depicts how a great talent can fall victim to the pressures of society.","This film is a must for every fan of great music. It shows the real story behind the so-called \"perfect\"brother- sister entertainment duo.From the early days in Connecticut to their promising career start in California in the late 60`s. The super-duo of the the 70`s with their brilliant sound. Richard and Karen`s long struggle with drugs and anorexia problems, that finally led to her death in early 1983. One of most popular films of the year 1989.","One of the better made for TV biopics, I just wish it had told us more. I have read many biographies and seen other things about the Carpenters, and this movie did what it could, based on the constraints placed on it by the family. Cynthis Gibb did a wonderful job trying to bring Karen to life. One of my disappointments is that there was not more insight into Karen's anorexia. In the reading I have done about the disease (especially Cherry Boone O'Neill's wonderful book, Starving for Attention) anorexia appears to be a disease of control. Karen saw her weight as one thing in her life that she could control. She felt that she was being controlled in every other aspect of her life. Don't get me wrong, I believed she truly loved the music, but she felt she had little control over her career. She truly loved her family, but they did not express it well, and she didn't know how to make her family understand her. The film could have touched so much more on that. I treasure the music I have of the Carpenters and wish she was still alive to contribute more to music today.","Yes, this is one of the better done television movies and I wouldn't expect less from Joe Sargent. One thing for this reviewer is that I was also a great fan of The Carpenters, I got to sing all of their material in elementary school and middle school choir and I got to do much of the solo material of which Karen sang lead. I thought she was one of the most wonderful pop singers of the 70's - and being a child/teen singing these songs and learning music - the one thing I was looking forward to was meeting this woman. I never got to, she died three weeks before that was to happen. And yes, that did effect me for I knew nothing of anorexia - and could not understand completely what happened.When this TV movie got produced, I got quite an understanding. Maybe not everything in Karen and Richard's life is open to the television audience, but in opening the parts that were shown, I got to understand much from the music industry of that time. What upsets me is that I am writing \"of that time\" and seeing \"now\". No one has learned a darned thing, even though this was a very informative and heartfelt look into a family's problems in the music industry.These films aren't done for fun, they're done to open a door and show us something. Here was a wonderful woman who got caught up in the whole idea that her talent was based on weight. She was fine. Didn't know it. She got mixed messages about her weight from the brother she loved, the parents she loved and the music industry that cared more about her looks/weight than the talent within. With the onset of MTV, it got worse. With 'American Idol' it's like a puss festering in an English accent.A wonderful TV film, I am sure later someone may give it an HBO treatment but either way, many lessons to be learned and the absence of another wonderful talent.","I think that the \"Karen Carpenter Story\" succeeded because it stayed close enough to the truth and played-up the \"good stuff\" so well that we the viewer simply has to respect Karen's privacy and give this TV bio the benefit of the doubt!Unfortunately we leave this movie without any real understanding of the facts behind the Carpenters rise to success and Karen's harrowing decline into anorexia nervosa and ultimate death in 1983!This is disturbing because eating disorders and body image delusions were finally made known and treatable largely due to Karen Carpenter!This film SHOULD have devulged the problem much more specifically and brought out what Karen Carpenter was actually doing to herself and how she decieved others around her!Major obstacles in her life such as her marriage,her long illness,her attempt to get well,her overbearing and perfectionistic personality,her many failed attempts at a relationship,her solo attempt-All have been glossed over in the attempt to make a 2-hour TV movie!Worth watching-but not very insightful!","The same fate which befell Brian Wilson and the Beach Boys was bestowed upon Karen Carpenter and her brother Richard.How to negotiate and balance super-successful careers with normal, healthy lives?  Although this pattern's been repeated time and again, it's still tough when it happens to young, \"green,\" people coping with \"pro\" pressures.Had Karen remained \"hidden\" behind that trap set, instead of being \"exposed\" out front (where everyone could see how \"pudgy and plump\" she was) things might have gone better. It was no accident that she protested leaving those drums (\"That's where I belong . . .\") for that may well have been her true place.As soon as she stepped to the front mike and solo spot, things began to change--for the worst.  However, neither management nor peers realized the great price she'd have to pay, until too late.This biopic has good casting, and a sumptuously beautiful soundtrack, with Karen's (and Richard's) vocal and instrumental ringing out with their greatest hits (including the ravishing \"The Masquerade\").The film does omit their college period (c. '66-'70) at California State University at Long Beach, and the subsequent inclusion of their vocal director from CSULB, Frank Pooler, who greatly enhanced their tour work.It also avoided dramatizing the death of Karen, making the mood less sorrowful, and ending on a more optimistic note with her mother's expressing her love for Karen. So, another story of the high price of fame, and a touching memorial to the life and times of The Carpenters.","I have been a fan of the Carpenters for a long time, read the biography, watched the specials, and saw the Karen Carpenter Story. This movie really didn't show the real Karen Carpenter. In the movie she seems to be a shy and a pretty much of loner (except for one girl friend). The real Karen Carpenter was much different. She was outgoing and friendly. She had lots of friends, especially Olive Newton-John. The movie doesn't even show Karen's attempts for a solo album and her meeting Phil Ramone and his wife Itchy \"Karen\". Itchy knew the real Karen Carpenter in New York. When Karen was in New York, she did see a psychologist, but it was voluntary and once a day and then she would leave to go to her hotel room. Also, Karen was taking pills to increase her thyroid, so she could loss weight, but stop taking them because the psychologist recommended her not too. Also, the Karen's husband in the movie is named Bob Knight, but in real life was named Tom Burris. Also, Karen wasn't divorced from Tom, but only separated. Karen was to sign the divorce papers on the day she died. Also, Agnes found Karen naked in the closet unciousness, unlike in the movie where she was dressed in white. The music was very good. That was the only thing I would recommend on seeing it.","I think this was an excellent movie which tells the life story of one of the Popular music greats of our time.Love or loath their music [ i love it ] you can't ignore their impact on the genre. With songs that even now are a staple of most Weddings.This movie starring, a very underrated in my opinion actress, Cynthia Gibb was excellent. The scene that stands out for me was the original try out in the studio where she tries to sing at the [ excuse the probably wrong phrase here, i am the only living Welshman with no musical talent what so ever ] key her brother starts on then he realises his mistake and changes to the key she should sing in.  Makes my hair stand on end every time i see it.If you've seen this movie you know what i mean if not GO SEE IT you won't be disappointed.","The Karen Carpenter Story shows a little more about singer Karen Carpenter's complex life. Though it fails in giving accurate facts, and details.\nCynthia Gibb (portrays Karen) was not a fine election. She is a good actress , but plays a very naive and sort of dumb Karen Carpenter. I think that the role needed a stronger character. Someone with a stronger personality.Louise Fletcher role as Agnes Carpenter is terrific, she does a great job as Karen's mother.It has great songs, which could have been included in a soundtrack album. Unfortunately they weren't, though this movie was on the top of the ratings in USA and other several countries","I've become a big fan of the Carpenters, and I didn't really enjoy this movie.I feel it focused far too much on her anorexia and didn't let her true personality shine through. I wasn't overly fond of Cynthia Gibb's portrayal; especially knowing she decided Karen's anorexia was suicide, which it clearly wasn't. Although her family was not big on hugs and kisses, I thought the movie portrayed Agnes (their mother) as being terrible.I did find a few scenes to be harrowing in a way, such as where she sees herself in a mirror that seems to distort her and make her look heavier; I thought the metaphor (so-to-speak) there was rather effective. When the family is playing pool and discussing her divorce and she breaks down and Richard is shocked when he comforts her and feels her frail body was pretty moving (which is probably the wrong word) as well.Overall, I feel they needed to bring out her more bubbly, quirky side--her genuine personality. Even as the focus of the film, there really wasn't a point that caused one to understand what would lead her to anorexia (though of course no one can really know), and almost made it seem baseless. The film was more poor-singer-with-anorexia than Karen Carpenter's story, in my opinion.I would assume that they changed her husband's name/profession and all because they couldn't get his permission to actually include him (there were some bad terms there), but that whole aspect was inaccurate with the changes. On this note, I can't recall the movie bringing out her longing for a family and kids, which greatly prevailed in her life and explains her whirlwind romance and quick marriage to her husband.On the whole, it ends up as a low-budget made-for-TV movie that just isn't very high quality and can be disappointing if you're a hardcore fan who is hoping to see beyond Karen's disease. I feel that such a legend deserves/deserved a better film as a tribute to an amazing person and an awesome voice.","Sadly, I didn't appreciate the Carprenters until after Karen's death--young, stupid, inexperienced in romantic relationships, I guess, so lacking in taste! Also, hadn't had the classical vocal training I've since accrued, so couldn't have remarked earlier on what an exquisite voice we had the privilege to know. As a blind viewer, I can't, obviously, comment on the visuals, but Gibb was, in terms of speaking voice, remarkably similar to Karen (check out YouTube interviews)--this from someone who has \"made a career\" out of discerning between voices--Cynthia was only slightly higher, and had a very similar timbre. I would love to either read the screen play, or find an audio-described version that would catch me up on the visual aspects. I will say that a director/producer is only as good as the material provided--the family kept a lot of details hidden (typical of eating-disorder families not in recovery, especially then), and so, we don't have a chance for an accurate picture, and ironically, the fact that it skims over much or the inward aspects of anorexia is similar to how it is experienced until recovery: only the surface aspects are evident, until the person gets into therapy and uncovers what the illness is saying. And, back then, we knew so little about anorexia, so I don't find much fault in how it was presented here--we only had two hours (less, accounting for the time used up by commercials). If you go online, you can find some DVDs of the movie. I do hope that a more thorough and lengthier biopic will emerge after Richard has passed (preferably, before--if he can come to acknowledge that what their family has gone through is not shameful or terribly unique and deserves to be told truthfully, to assist others so they won't meet the same fate as his sister).","Karen Carpenter had a singing voice that only comes along in the world every few decades. It was instantly recognizable. She had a full three octaves of range, with the lower two of those possessing a rich timbre and an uncanny ability for a very soothing slow-vibrato (my term). Karen's problems were partly caused by her desire to be accepted and were intensely driven by her stage-demon of a mother, Agnes Carpenter. The problems perpetuated because her family lived in denial that a problem existed. They refused outside help until the damage to Karen's heart from her abuse of ipecac (which she eventually discontinued because she feared that it would damage her vocal cords) was irreversible. The acting in the movie is good, and the songs are well-mixed, but it takes unreasonable liberties with reality. Over half of the scenes that Barry Morrow wrote were rejected by the family (mainly by Agnes Carpenter), who didn't want any negativity. It drove Morrow to the point where he refused to work on the movie any longer. His replacement had the same problem, and a third writer was brought in to finish. The whole thing is contrived, and to anybody who knew the actual situation, the movie has very little to do with how things really were.Anybody who wants a realistic view of how things were should read the book \"Little Girl Blue\" by Randy Schmidt, which offers an objective view.","I never saw the movie before - the bland TV acting, direction, and production aside, I found the movie well-researched, in that it captured most of the key career moments in their music and performances. I wasn't interested in all the details of their personal lives, and I see critics complained about skimping there, I was more interested in the psychological aspects - the faulty mindsets people had back then, and the issues they faced as a result - self-image being among them, and at the core of the main issue here - anorexia.Matching an extraordinarily beautiful face with an extraordinarily beautiful voice was intriguing, as it gave new insight into the voice - how extraordinary it really was.","I've just watched this movie again - for about the 4/5th time and now understand Richard Carpenter's comments. The project could have been so much better. Historically incorrect (using the Made in America sleeve in the early stage of their career footage and the exclusion of Karen's solo project)which, I suppose is expected when you have to cram an entire life into 120 minutes. Yes, Cynthia Gibb is at time uncannily like Karen but boy, Ms Gibb really should have been given some serious lip-syncing lessons and whoever was in charge of the wigs should have taken up a different career! The guy who played Richard did a decent enough job, but you can't help feeling that this really could have/should have been a much better movie. I guess the budget was low and thank God we got the original Karen vocals - I shudder to think how it could have been without her vocals!This is a story worth telling properly. Like 'Ray' (Ray Charles biopic) with a big budget and maybe some extra soundtrack from Richard. What's he doing these days? The soundtrack alone would sell millions. No-one loves The Carpenters more than me. I have everything they've ever released on CD (and vinyl!) and regularly visit YouTube to check if any more gems have been uploaded that I haven't seen before. Like Nat King Cole, Karen's voice is beyond any words of praise. Thank God for all the recordings that will be around long, long after we've all gone. Steve Weaver, UK 9 Oct 2013.","I have seen this film a number of times now and although it has major faults, it really is the music and the unique beauty of Karen's voice that steals this film. The soundtrack, as you would expect, is breathtaking. I loved The Carpenter music and both Karen and Richard were so far ahead of their time that to lose her at such a young age was such a tragedy.It begins with Karen's death. Bringing the harsh reality and reminder that this doesn't end well. It then moves into Karen at 13 and Ruchard 16, i believe. It tells the story of how Richard was supposedly the family favourite and he will become a star with Karen seemingly brushed aside by the family. The family plays a part in both of their future illnesses of both, i believe. By Richard's Mum giving him the sleeping pills that he became addicted to throughout the film and the old fashioned way that it is portrayed that the Mother just never said \"I love you\". Yuu really have to see this film to see how profound this possibly or even must've affected Karen.It is interesting, in hindsight, to read that Richard Carpenter, who had major involvement in the this, and the music side of the film, says he hates it now. He is quoted in the notes of the 35th anniversary CD that most of the dialogue is fictitious. He also states a number of inaccuracies. Apparently both Karen and Richard never collapsed in real life. Equally, the scene at the end when Karen's Mother finally says \"I Love you\" never happened. It was put in to give the film a happy ending, despite was death following. Putting these things aside though, it is a film worth watching.Cynthia Gibb plays Karen well. She comes across as a sweet, naive yet troubled girl who seems to be innocent through out the film. Of course her anorexia comes from peer pressure, being in the public eye and the fact that Karen never believed she was good enough for her parents. Though once again, i always thought the \"chubby little sister\" quote was true. However after research is was actually Richard that was quoted as chubby.I must say that it really is a lovely film, if you can call it that considering how it ends up. Their story is so wonderful from early talent show wins through to songs at the top of the charts. So many of the original songs are here. When Cynthia sings the opening line of \"All of my life\" but out of key and then Richard changes it, i defy you to not have your breath taken away by Karen's stunning vocals kicking in.The film also tells the story of their demons. As already mentioned, Richard's addiction to sleeping pills and of course Karens battle with anorexia and bulimia. It is tough to watch at times as we all know this all, albeit with the unreal buts put in, really happened. It is quite a short film and it does skirt over things very quickly at times. For instance Karen's marriage and subsequent divorce is played out within five minutes. Though once again i urge you to find a better use of a song when \"Masquarade\" is used over these moments.Remembering that this is based upon what really happened and taking into consideration, as stated, how Richard feels about this film, it still is a good watch. Cynthia Gib is so wonderful that at times it is hard to picture her not being Karen, she really does play it that well. The already mentioned end scene with her Mother telling her she loves her is really beautiful, even if again, it didn't happen.The film also gives the impression that Karen did not record any solo material. She recorded a solo album in 1979, though it was not released until 1996.I am by no means slating the film for the inaccuracies. I adored The Carpenters and still listen to then to this day. It is a shame that so called biopics have to change the facts so readily and thus making those facts go into the public domain.Having said that, this is a wonderful film to watch. At this stage it has never been released on DVD or VHS. if you see it listed in your television guides, catch it. Enjoy the beautiful vocal tones of Richard and Karen, maybe even add some of their albums to your collection.","This film was made soon enough after Karen's passing that perhaps Richard Carpenter and the people closest to Karen were feeling a little guilty as to how they may have contributed to her health problems. As the years have passed (almost 25 to be exact) it must have gotten easier to deny any complicity. Richard has spent the years after Karen's death endlessly remixing and recompiling the recordings he made with her. He married his cousin, Mary, and from what I have read, it looks like he may be planning a next generation Carpenters with his children. He seems to have regretted making this film,and that may very well be why it is unavailable in any form. It seemed to me to be a fairly honest assessment of the tragically short life and incredible talent that was Karen Carpenter.","The movie is squeaky clean, probably because of its made-for-TV roots, which seem to restrict Karen Carpenter's story.  I've read articles about events in her life--professional and personal--that this movie either ignores (like her anger at A&M Records in the late '70s for \"abandoning\" the sound that made the most money for the label in favor of new wave acts like The Police), or just skirts over (her marriage, which you would've missed in the movie if you blinked). Constraints because of TV (i.e. making room for commercials) were a factor, I guess, and the producers were probably not interested in making a three hour bio.  Richard Carpenter's involvement in this may have also been a factor in what we see--how much of his family's personal life did he really want shown on film?  All of this said, there is probably another non made-for-TV movie waiting to be made about The Carpenters, who really defied their era (the early '70s) with their wholesome sounds but were caught up in the topsy-turvy world of rock (as seen in this movie) anyway.  And their relationship with their parents was a little unusual.  Karen's death was tragic and the movie tastefully recreates it.  As for the actors, Cynthia Gibb was wonderful and really made the movie.  Louise Fletcher just can't seem to get Nurse Ratched out of her system; even though she played the all-American adoring mother, she was icy at times, especially in her inability to communicate. For a made-for-TV movie, this wasn't too bad.  But let's wait and see if another bio is in the wings.  Katie Holmes would be a perfect Karen Carpenter, if any casting director is reading this.","I first saw this movie back in 1994 or '95 during my freshman year in high school when it was on Lifetime. After I first saw it, I thought it was wonderful. Sure, it may not have run longer, but it is as accurate as can be in my own opinion (regardless of what anyone else may think). Cynthia Gibb was great at portraying Karen, and Mitchell Anderson was okay as Richard. Louise Fletcher (Yes, who played Nurse Ratched in 1975's \"One Flew Over the Cuckoo's Nest\") was fine as well, but I found her version of Agnes (Karen and Richard's mother) to be a little bit of a control freak. I am an EXTREMELY HUGE fan of the Carpenters, and I believe that Karen's voice was and still is so wonderful. It really saddens me about the fact that she is gone and had left this earth too soon, but thanks to the never ending popularity of her music and her angelic voice, the music will live on. Anyway, back on track to this movie, it really is a mystery to me and possibly other people (fans and non-fans of the Carpenters) as to what caused Karen to end up getting this problem with her health. Was it the media that was responsible or was it just Karen's decision? I would not believe that it was her decision. It could have been the media from one article that was printed out about her somewhere in '70, when their hit \"Close to You\" came out (from what was shown in the film). There are some other moments in the movie as well. Richard's struggle with drugs, and Karen's brief marriage. I did not hear about her loss in February of 1983, as I was not yet into watching the news; I had found out years later. I don't know if there will be another movie about the Carpenters or Karen made in the future, but until then, this movie will do fine. I will say this though: If Karen had disregarded the false details of that article or any future articles that might have been published with similar content calling her \"chubby\" (which must have been quite an insult), she would still be here on this earth today. I know that she is in Heaven and probably entertaining everyone with her beautiful voice. God bless you, Karen!!","Unlike some of the former commentators, I was (and am) an avid fan of the Carpenters.  Face it, Christmas would never be Christmas without The Carpenters.  That said, I believe the movie did a good, not excellent, job at depicting Karen's life. The movie was enjoyable to see on primetime TV, but the content fell a little short. I suggest that you all look into getting some of the Carpenters specials that were shown in the 70's. You cannot believe how awesome a drummer Karen was. Cynthia did not capture the extent of Karen's talent. Also, Karen was beautiful but had a bad hairdresser. My choice for playing Karen is Hilary Swank. I would love to see a more substantive story, because there was more to Karen than meets the eyes when listening to We've Only Just Begun. I have tons of unreleased Carpenters' music, and it is absolutely excellent. (Her singing of California Dreamin is to die for)."],"review-user":["pachl","haridam0","Guitarmanswife","WJurgens","Monika-5","imbluzclooby","Atle-4","giffey-1","lambiepie-2","bfjrnski","harry-76","jennifer319_1977","ROK","Jorge-8","buschgardenschik","sandrastreeter","colagada","wbiro","ivyfield","lynchfilmlover","nowvoyager","drosse67","matt_tawesson-1","phlipps12"],"review-date":["20 July 2005","21 July 2006","15 December 2005","12 June 2004","31 July 1999","27 November 2005","3 February 1999","23 August 2006","15 March 2006","7 July 2003","24 August 2004","10 December 2005","27 June 1999","13 September 1998","19 February 2006","2 September 2016","19 August 2015","24 January 2014","9 October 2013","27 August 2013","13 January 2008","27 November 2002","21 April 2006","29 April 2004"],"review-rating":["8","8","7","7","7","3","8","4","7","8","8","4","7","10","9"],"review-title":[" My Favorte Made For TV Movie\n"," Little Drummer Girl\n"," Karen Carpenter Story (TV ) 1989\n"," A wonderful look back at a great talent\n"," Could have been much better\n"," A Good tearjerker\n"," This film is a must-see for every music lover\n"," The timeless magic of a voice of an angel\n"," A Good Tribute for TV\n"," A dissappointing bio...but nicely done!\n"," Same Old Story\n"," The Karen Carpenter Story\n"," A Brilliant Movie\n"," A TV portrait of a singer's life\n"," I honestly found it shameful. (Unsure of spoilers)\n"," cursory sketch of the Carpenters' career\n"," Heavily censored and modified fluff\n"," Well Researched and Put Together\n"," Hasn't stood the test of time - except for the music.\n"," Rainy Days And Mondays\n"," Probably as close to the truth as we will ever know\n"," wholesome bio\n"," OK TV movie about Karen Carpenter's life\n"," One of the better made for TV movies.\n"]}