{"review-url":["http://www.imdb.com/title/tt0000653/reviews"],"review-text":["After many failed attempts to become a writer for the rising American film industry, 34 years old playwright D.W. Griffith ended up being hired only as an actor, as nobody really had faith in his work as a writer. However, in 1908 Griffith was offered a position as a director at the American Mutoscope & Biograph company, an opportunity he took without hesitation as his entrance to the industry's area that really interested him. At Biograph, Griffith was slated to direct dozens of short films, where he began to develop the many techniques that years later would be considered as cinema's true language. Since his first movie, \"The Adventures of Dollie\", Griffith began to experiment with editing, cinematography and other narrative devices that would result in his 1915 epic, \"The Birth of a Nation\". But while those early films weren't exactly on par with other filmmakers' movies in terms of quality, they always showed Griffith's inventive spirit.\"A Calamitous Elopement\", Griffith's seventh film (or eight, depending to sources), is just another example of this, a movie that while not exactly successful, shows Griffith's innovative mind at work and forecasts elements from his future works. A short comedy, \"A Calamitous Elopement\" is the story of a thief named Bill (George Gebhart), and how he became comically involved in a couple's elopement. Frank (Harry Solter) and Jennie (Linda Arvidson) are a young couple in love, but Jennie's Father (Charles Inslee) hates Frank and disapproves their union, so the couple plans to run away and get married. Exactly at the same moment when Jennie plans to escape, Bill the thief plans to get inside her family's house, and discovering what the couple is trying to do, Bill plans to use the situation to his advantage. However, Bill is not exactly a skillful thief, and everything is set up to end in hilarious calamity.Working at Biograph, Griffith not only had the chance to become a director, he also finally made his dream of writing movies a reality. \"A Calamitous Elopement\" was one of the first movies where he had full control, doing the writing of the story as well as the directing of the film.The short film consists of several fun situations where Bill gets in trouble because of the couple's elopement escape, making his robbery a lot more difficult than he expected. The jokes work nicely most of the times, but the story is written in a very convoluted way, with a lot happening too fast and without many explanations. It is clear that Griffith was still learning about the possibilities of cinema, as it seems like he wanted to put as much as he could in 12 minutes, making the film look a bit too complex for its own sake.As usual, it's in his directing where Griffith shows his talent, and even in this simple short he manages to put a lot of creativity in the making of this movie. Playing with editing, he makes a highly dynamic film for its time, keeping up with the frantic pace the story has and making great use of the inherent slapstick of silent cinema. Obviously, the film is not a masterpiece, and nowadays it may not produce more than a chuckle, however, Griffith makes some of the jokes work very well despite its narrative flaws. A lot of this depends in his handling of the cast, and even when this time he moves away from his realistic style and opts for over-the-top performances, Griffith makes it work within the film's context, creating fun scenes of slapstick that look really good given the budget thanks to his care at editing.The cast is mostly effective, considering the limitations of the story. As Bill the thief, George Gebhardt showcases a natural talent and astounding comedic presence. As the film's protagonist, he manages to convey a sympathetic character despite the fact that he is a thief, and one wonders if his performance here had any influence in posterior similar performances by other comedians. The rest of the cast is less important in the film, although everyone gave at least competent performances. While Harry Solter doesn't give a good performance, Griffith's wife, Linda Arvidson makes her character pretty believable and helps both actors to deliver a nice job. Finally, Charles Inslee's over-the-top performance as Jennie's father is effective, although a bit too typical. Still, it's good for the limited screen time he had.\"A Calamitous Elopement\" isn't really a great film, but it serves to show Griffith's developing his talents with creativity and an eagerness to learn that would take him to discover and develop some of cinema's techniques that are still used today. \"A Calamitous Elopement\" is definitely not one of Griffith's best, as even for its time it was kind of outdated, however, it's interesting to see Griffith making a comedy, as most of his early short masterpieces would be either powerful melodramas or thrilling adventure films. It's highly possible that this little movie will be of interest only to those interested in D.W. Griffith's life and times, as other than being a significant chapter in the development of his skills, there isn't a lot to see in this little short. 5/10","This short feature is just too contrived to work particularly well. It does have a some good moments, but it's hard to tell whether they were all intentional or not. It's only mildly interesting in general, and perhaps the most unexpected aspect is how morally neutral it is. Most of Griffith's films took clear moral stances, and indeed if there was a problem, it was that they went too far in their moralizing. This time, he seems to have been more interested in telling what he apparently thought was an entertaining story, and he seems to show no real concern at all for any of the characters.The story is relatively involved for such a short feature. It starts with a young couple deciding to elope, while an opportunistic thief looks to take advantage of the situation. Almost the whole plot is contrived and implausible - in any movie you can accept one or two instances of this, but when almost every scene contains unlikely coincidences, bizarre decisions by the characters, improbable developments, and the like, it's just too much to overlook.As a result, this is just not very good. It has a number of humorous moments, but it's not always clear whether all of them were intentionally funny or not. A more careful comedic touch could have smoothed out some of the apparent gags that don't quite come off. There is some skill in the way that the film was edited together, but nothing outstanding enough to make up for the rather weak nature of the material itself.","Linda Arvidson (as Jennie) and Harry Solter (as Frank) are enjoying a romantic tryst, when in walks her father Charles Inslee; furious, he chases Mr. Solter out of the house. Undaunted, he goes to her balcony and begs her to elope. Ms. Arvidson is agreeable, and goes to pack. Then, burglar George Gebhardt arrives to rob the place. Though he doesn't get much in the way of booty, thieving Gebhardt manages to use Arvidson's trunk to escape from the police A Contrived Comedy. Note, during the balcony scene, Solter goes off-camera, so burglar Gebhardt can enter the house undetected. And, Arvidson travels very light, since there appears to be nothing in her heavy trunk; perhaps she just wanted to buff up beau Solter? Director D.W. Griffith, Robert Harron, and Florence Lawrence are illustrious extras. ** A Calamitous Elopement (8/7/08) D.W. Griffith ~ George Gebhardt, Linda Arvidson, Harry Solter","D. W. Griffith not only wrote and directed this comedy but also makes a cameo appearance as a cop, while his wife Linda Arvidsen takes the leading lady role. It clips along at quite a frantic pace, which is probably one of the reasons why it isn't really successful. While the film runs at normal speed it looks like the action is speeded up: hands are thrown into the air, arms flung wide apart, passionate embraces over in seconds - it's all a little exhausting really.The film follows the attempts of a couple to elope from the woman's house because of the disapproval of her stern father. In true romantic fashion, our hero (played by Harry Solter) meets his beloved beneath the balcony to her bedroom to spirit her away but, unknown to them both, a wily thief (George Gebhardt) has got wind of their plan and sees a way to profit from their planned elopement.The film isn't bad for its era but it certainly isn't vintage Griffith. He was still at the beginning of his directorial career when he made this, and it shows in the rather pedestrian use of the camera. For a comedy it isn't particularly funny, and although Griffith gets a writer's credit it's clear that many of the scenes are largely improvised. Of interest to Griffith buffs only, I think.","Calamitous Elopement, A (1908) *** (out of 4) D.W. Griffith film has a boyfriend proposing to his girl only to get caught by her father and thrown out of the house. The two decide to run off and get married, which is overheard by a thief who plans to take advantage of their decision. This comedy from Griffith works pretty good, although it's a tad bit hard to follow at the start. When the thief enters things pick up because the film doesn't play out (or go for the laughs) the way you'd expect. You can spot the director playing one of the cops in the film.Balked At the Altar (1908) ** (out of 4) D.W. Griffith film about a woman who will stop at nothing to get a man to marry her and that includes help from her father and his shotgun. Like many \"wedding\" pictures of its time, we get a long chase scene, which really isn't too funny.","It seems that we have the 33 year old Griffith to thank for the close-up shot in cinema. In this film he exploited it by having a close-up of a character and then cutting to another shot of the character being thought of in close-up. That alone is worth watching the film for."],"review-user":["jluis1984","Snow Leopard","wes-connors","JoeytheBrit","Michael_Elliott","Single-Black-Male"],"review-date":["2 August 2007","19 November 2004","6 November 2007","20 November 2009","28 February 2008","19 November 2003"],"review-rating":["5","2"],"review-title":[" One of D.W. Griffith's first first attempts at comedy...\n"," Too Contrived to Work Very Well\n"," Linda Arvidson Travels Light\n"," Pedestrian\n"," 2 From Griffith\n"," D.W. Griffith and the Close Up\n"]}