{"review-url":["http://www.imdb.com/title/tt0020701/reviews"],"review-text":["Yes, and odd and confusing and a dozen other adjectives that make you think just what kind of movie this is!This is not a movie for most people. It's more like an experience, an ahead-of-its-time extended music video. Most of the action is stifled, static and repressed. The images seem like set-pieces, paintings in time, feelings encased in poses. All which remind me of famous Greek director, Theo Angelopoulos and his static images - which were not static at all - since they housed emotions and a participation of audience in conjecturing what they were seeing by a process of mental elimination of causes and possible actions. BORDERLINE - instead of being images of things, gazes at people and we are challenged to discover just what it is they are thinking. Mostly because the number of intertitles is scant and far between.All this is to say -- this is not an easy film to watch. I enjoyed immersing myself in the images, however. The story is rather odd in itself - perhaps it was risqué for its time. In fact, I am sure that a biracial relationship was off-center for those times. As were its sexual undertones.Indeed, I think the film's title is about the BORDERLINE type of lifestyle that these people wanted to live. And in turn, the consequences, emotional and social, which affected their decisions surrounding this.This sort of \"experimental\" film has been done and redone thousands of times by professionals and film students during the 20th century. Perhaps never as compelling as in this film - which is a landmark of sorts for film buffs.Yet, I repeat, not for everyone.The film is really about the myriad psychological states that we go through during a relationship -- and racial prejudice is the juice that runs this study. But there are sometimes subtle and sometimes obvious moments of homosexual metaphor scattered throughout.Don't watch this movie if you are in a hurry. The film won't go faster just because you want it to.Intriguing but not altogether successful - but highly recommended for film buffs and Gothic types. Both in which I've dabbled through the years.","I saw Borderline several years ago on AMC. I've been looking for it ever since. It was haunting: visual, textural, sensual. This movie took me somewhere like a dream and I didn't care where. I will never forget the curtain blowing in the breeze. I still remember the way it made me tilt my head. I remember my facial expression when I saw it. I didn't know what had happened when the movie was over, but I find life is that way. It didn't bother me. The unfairness of the ultimate rejection of an innocent character strikes me as sadly real. I loved the faces, the way the camera dwelt upon them. The camera gazed at the set with the unfocused eyes of a daydreamer. Borderline was real to me in a way movies aren't. It was exactly the lack of explanation, color, sharpness that made it enter my consciousness like a thief in the night. I love this movie. Someday I will own it.","In the fall of 1927, a British film magazine appeared titled \"Close Up.\" Of its purposes, it was trying to elevate film to the status of \"art\", it was trying to promote the educational qualities of film, it was trying to kick the British film industry into high gear (indeed, all the articles lamenting the poor British film industry grow wearisome), etc., etc. Of these purposes, it was also championing the minorities, blacks in film being one of the main focuses of this purpose.The brainchild behind this \"Close Up\" was a man named Kenneth MacPherson, whose name you'll also notice under the Writing and Directing credits of \"Borderline\", the film in question of this review.I watched \"Borderline\" because I'm a fan of this old magazine. Back in these days, the writers had a much clearer sense of film and its potentials, and their writing has a pop and vigor, the type that would transform into the raging \"wit\" that today's writers pass off. With MacPherson, two others edited and contributed to \"Close Up\". The first of these is Winifred Ellerman, pen-name Bryher. The second is Hilda Doolittle, pen-name H.D., American poet, actor in \"Borderline.\" Other personalities, of course, frequently appear in the publication, but it is these three whom I'm quite fond of, especially the two women. Quite naturally, I had to see these personalities materialize on film, their only film.It's amazing how well this film corresponds to these personalities I've loved. The rhythm, the technique, the good-humor of \"Borderline\" is so apparently theirs. Of course, I say this from bias, but I still say it is uniquely the product of MacPherson, of his person and people. And the jazz score on the Criterion disc compliments this personality well, I feel. It compliments the film. It compliments the rhythm, the technique, and the good-humor. Oh, I should probably define these. Hmm... The rhythm is difficult to describe. The cutting is strange and... jazz-like (undoubtedly, the jazz score again biases me). The story is more rhythmic than coherent, and apparently this throws people off (as evidenced by the few uninformed narrative junkies who have submitted embarrassingly bad reviews to this humble IMDb page). The technique is often impressionistic. \"Borderline\" is beautifully photographed, if I may say so, and the Criterion quality is the standard of excellence. The thoughtful angles, the focus and lighting, the good-humor... all shines through on the DVD. Oh, the good-humor! Well, that's something you have to experience.I'm thankful MacPherson made a film. He should have made more. Well, anyone who's interested has some writings they can turn to. In fact, more than \"Borderline\" I'd like to recommend \"Close Up\" to the intelligent film-scholar. You'd be surprised how finely clear these writers' thoughts are and you'll get a very good look at the industry of the time (and the people who drove it). Worthwhile.P.S. Robeson is really good, too.","This little-seen experimental film definitely won't be to everyone's taste, but I was impressed by how modern it looked (apart from the lack of sound, it wouldn't have looked out of place in the late-1950s, early 1960s) and the bohemian atmosphere it created. The film makes very little use of intertitles, and so the story can be a little tricky to follow at times, but it isn't all that complicated and an attentive viewer should be easily able to fill in any gaps along the way.Paul Robeson stars as the husband of a half-caste woman who has had an affair with a white man in a small village in Switzerland. She has ended the affair, but too late to save the marriage, and her lover – who is also married – is having trouble coming to terms with the split. The racial tolerance subject matter and message is fairly rare for the time, and is handled with a surprising amount of maturity. For the peripheral figures caught up in the fallout from the affair, life eventually continues unchanging, and the entire film is pervaded with an air of melancholia.Although the story does drag a little at times, and the director's choice of shot is sometimes open to question, the look and feel of the film, and the way it brims with innovative ideas (for its time) make this worth watching.","This experimental silent film, made in Switzerland by an independent British film company, is chiefly remembered as Paul Robeson's first film.  It's very artistic, with shots often seeming meaningless to the story, which is difficult to understand anyway because of the lack of enough inter-titles. From what I gathered, Robeson's wife, Adah, is in an inter-racial love affair with a white man called Thorne.  It doesn't bother the cigar-chomping owner of the bar/hotel where Thorne lives (and she seems to be having a lesbian relationship with a barmaid), but an old lady expresses the town's point of view in an inter-title: \"If I had my way, we wouldn't allow negroes in here.\" Thorne is also called \"nigger lover\" by someone in the bar.  Adah tries a reconciliation with Pete (Robeson), but eventually leaves him.  Thorne's wife, Astrid, goes off the deep end, brandishes a knife, cuts Thorne's arm and cheek, and somehow dies.  Thorne must have been accused of murder because we learn he was acquitted.  As for Pete, he gets a letter from the mayor telling him it is best for everyone that he leave town.  So the film is more about racism than anything, but in an up note, the owner tells Pete \"The sad thing is, they think they're right.  That's the way we are.\"  The meaning of the title is a mystery.  It may refer to Adah being light-skinned (a borderline negro) or to the borderline behavior of of the main characters.","It is very difficult to write a review of this experimental silent film. The people involved in making it (in Switzerland) are very interesting people for numerous reasons. Of some of them, no other moving film images exist. And then there is the strange presence of Paul Robeson in a film without sound, so that he has no chance to sing with that magnificent voice, as his rendition of 'Ole Man River' in SHOW BOAT (1936, see my review) has made so famous to those who might not otherwise have heard of him. During his lifetime he was very famous, but memories fade and people are soon forgotten, even people as tall, forceful and charismatic as he was. Here he appears in numerous shots shooting up at his face shown against clouds in the sky, as if he were a god. The director must have had a crush on him. Robeson's wife Eslanda Robeson also appears in the film opposite him, which was her only credited appearance in a film (she appeared in two later ones uncredited). Apart from the Robesons, none of the actors in this film ever appeared in another film. Despite their complete lack of training or experience, they all do a really good job. Moral: is drama school really necessary? Before describing the largely incomprehensible film itself, we need to consider the personalities involved, apart from the Robesons whom I have already mentioned. The key figures were the lesbian couple consisting of Hilda Doolittle, who wrote under the pseudonym H. D., and Winifred Ellerman, who wrote under the pseudonym of Bryher (the name of her favourite Scilly Isle). Although Bryher's work is largely forgotten today, the poetry of the famous imagist poetess H. D. is very much still in print and continues to be highly regarded, not least by myself, I must say. I have some of her early publications including one or two signed by her. She and Ezra Pound had a fling when they were young together in Philadelphia. She later moved to London to join Ezra and Dorothy Pound. Dorothy told me that in those days her two closest friends were Hilda Doolittle and Gaudier-Brzeska, and she truly adored them both. (Gaudier was at that time having his affair with Nina Hamnett.) Hilda lived in the same building with the Pounds for a while in Kensington, but she did not follow them to Paris and Rapallo later. Bryher married Robert McAlmon in order to hide from her parents the fact that she was gay. McAlmon was gay himself, so the marriage was for show. For an account of all this one should read McAlmon's wonderful memoir BEING GENIUSES TOGETHER. (It is very much better to read the original than the heavily edited and hacked-about version by Kay Boyle.) In 1927, Bryher tired of McAlmon and divorced him, marrying instead Kenneth MacPherson, who directed this film and also had been having an affair with H.D., who unlike Bryher was vaguely bisexual. They all lived together. All three of them were film-mad and they founded an arty film magazine called CLOSE UP in 1927, which lasted for a few years. I do not have a complete set of it, alas, but I do have a bound volume of numerous issues. They also founded an entity of some kind called Pool to make some experimental films, of which this is apparently the only survival. They had meanwhile introduced Sergei Eisenstein's films to the Western world. This film has countless examples of jump shots and rapid editing in imitation of Eisenstein's style, without the ability to make it work effectively, however. But at least MacPherson was trying. They had all seen and been influenced by the earlier silent experimental films of Man Ray, and this film is much better than anything he ever achieved on cinema. They were also heavily influenced by the German expressionists, as the angles and shots and atmosphere show clearly. To go into all their theories about the cinema would be out of place here, as taking too long. This film therefore has historical significance both for the history of experimental filmmaking and for those interested in the people appearing in it, and many of those will perhaps have little or no knowledge of or concern for the cinema per se. Lovers of poetry will get a shock when they see Hilda Doolittle, because her photos tend to be idealised and serene, but when you see her in this you can see how scary and weird she really was. She wrote a lot about ancient Greece, which was her chief obsession, but if one were to class her as a character at that time, one would have to place her amongst the maenads. One wonders whether one would really have wanted to know them. Both they and the film itself, and much that they wrote as well, concern extremes of passion. I don't have much interest in extreme passions myself, being too cerebral perhaps. And anyway, extreme passions do take up a lot of time and require a great expenditure of energy which could more profitably be put to use in studying something far more interesting. But this film is nothing but extreme passion, shown disjointedly and with insufficient continuity to make out who is really doing what to whom or why. Hilda Doolittle ends up dead, which is pretty shocking. It all goes to show that quarrelling lovers should never play with knives. The protracted knife scene in this film is very harrowing. The film also strenuously promotes the cause of black people, and as an example of racial prejudice, has a little old lady saying that all 'negroes' should be removed from Switzerland immediately (another n word is used also which I do not repeat). In the story it seems that Hilda's husband has had an affair with Robeson's wife and it drives them all mad. Most of the film consists of them being overwrought.","I recently got a DVD collection of selected Paul Robeson movies from my local library to borrow and I picked this one to view first since it's Black History Month and I wanted to maintain the chronological order (for the most part) of reviewing such films during that month. Anyway, this one was a bit unusual not only because of the subject matter but also because it employs what was considered Avant Garde at the time with lots of close-ups not only of faces but also objects which may (or not) aid in the plot structure. Also appearing is Paul's wife, Eslanda, whose role seems important here. I said seems because if I didn't read the synopsis on this site, I wouldn't have known what the movie was about! The images-not to mention the lack of intertitles-confused me much of the time though I admit they're quite beautiful and intriguing. And the modern jazz score by Courtney Pine adds a modern sensibility that was awesome. Still, this wasn't a very coherent narrative. But on that note, I do recommend Borderline just so you could experience something different if you'd like...","I'm usually a fan of \"art\" and \"foreign\" films, but when I saw this one my reaction was \"it must be called experimental because it makes no sense.\" The \"action\" is static, while at the same time it bounces from one location to another.  There aren't enough titles to make it clear who is who and what their relationships are.  Apparently the main point was to show that in the face of murder, adultery and generally weird and dissolute behavior, the cure offered by the powers that be is to banish a totally innocent black man.","\"Borderline\" is a bit late for a silent film, but as the British were a bit slower in converting to sound AND this appeared to be made by folks who didn't have the slightest idea how to make a film, it's not surprising it lacks sound.Had it not been for Paul Robeson being in this film, I really don't think any one would care about this experimental film today (even with its interesting plot idea about interracial sex). It's just a badly made art film--very badly made. And, because there is no sound, you don't get to hear Robeson's gorgeous voice--making me wonder if there is any reason to see the movie? For me, the answer is an emphatic NO! Here are some of the MANY problems I had in watching the film. First, as the film lacked a real narrative and had very few captions, it was often hard to tell what was happening. And, in some cases, it looked as if the actors were in the same boat! Several times, they moved about--as if aimlessly wandering in front of a camera with no instruction from the director (if there even was one). This was intensified by bad editing. Second, the acting was bad--and it's obvious the folks didn't know the first thing about acting. While Robeson had already appeared in a couple silents, he wasn't terribly experienced and lacked his later screen presence. Third, the soundtrack provided by Criterion is god-awful. It's a cacophonous jazz track that is intense and quite loud--and dominates the film. It would be better to see this one with the sound turned all the way down--it's that bad.The bottom line is that I love Paul Robeson films but this one is among the 'not read for prime time' films he made. It's definitely a film for the cinemaniac and those who adore his movies and don't mind seeing a terrible film--and this is a terrible movie.FYI--That's Robeson's wife in the film!","Saw this silent film for the first time on early morning AMC.  Found it intriguing, but very confusing.  The pace was glacial, and it was impossible to tell what was going on because there were few inter-titles.  I was reminded simultaneously of the complexity of German opera and of some of Leni Riefenstahl's more self-indulgent moments in her earlier films. The camera would linger interminably over a face or arm or tree, with no clue as to what it all meant. Paul Robson was in his prime, but even he could not salvage the incoherent plot and slow pace."],"review-user":["Enrique-Sanchez-56","nonalaurie","mangoloid","JoeytheBrit","Art-22","robert-temple-1","tavm","patlange-4","MartinHafer","Marya"],"review-date":["13 July 2004","9 December 2005","20 November 2007","18 December 2009","23 October 1998","4 September 2017","18 February 2014","5 April 2000","26 August 2011","17 November 1998"],"review-rating":["9","4","5","6","4"],"review-title":[" Absorbing, Jarring, Atmospheric...Not for Everyone\n"," I felt this movie like emotional braille\n"," Borderline\n"," Modern film for its time\n"," Lack of adequate inter-titles make this silent film about inter-racial love and racism hard to appreciate, but Paul Robeson is always a pleasure to watch.\n"," What can one say?\n"," Seeing Paul Robeson and his wife, Eslanda, in Borderline was an interesting Avant Garde exercise\n"," This film makes no sense.\n"," I love Robeson but hated this amateurish film.\n"," First Paul Robson film marred by self-indulgent camera work and glacial pace.\n"]}