{"review-url":["http://www.imdb.com/title/tt0065611/reviews"],"review-text":["Blake Edwards' \"Darling Lili\" is not a great film, but it is better than most people give it credit for. One of the most maligned productions in history (the aerial sequences took 2 years to film, the budget swelled to 3 times the original budget, various cuts of the film only add to the muddle), my final analysis is this: an underrated film whose reputation should soar once it's more widely seen.This film exists in three versions: the original roadshow version (190 minutes)which Edwards disowned, the general release version (136 minutes)and Edwards' personal director's cut (113 minutes). Tones shift between versions. The roadshow version had more talky sequences and was a numbing bore. The general release version deleted these sequences and was an improvement, but was still missing something. Edwards' cut was a great improvement. It is more serious in tone than the previous cuts, but the story concucted by Edwards and William Peter Blatty benefits from that approach. Julie Andrews is simply great as Lili, the singer/spy and her singing is at an all time high. Rock Hudson is excellent as her American pilot lover. Only after his inclination was exposed, did people take him seriously as an actor. But he was great all along. The songs by Henry Mancini and Johnny Mercer are strong as is the cinematography (by Russell Harlan, in Panavision)Sadly, \"Darling Lili\" is not available on tape or DVD. But luckily for us, AMC shows this very often. Roadshow version: 1/2* General Release: ** 1/2 Director's Cut: ***1/2","It was 1970. Julie Andrews had hit her highs onscreen, and her star was starting to fade, at least in the public's eye. \"Lili\" represented another opportunity for Julie to change her image, coming right after the megamusical \"STAR!\" which didn't deserve the drubbing *it* received either.Audiences didn't seem to care for this WWI musical drama. In fact, they were staying away in droves from ANY musical--drama or not.The shame of it all is that this film, with its many classic moments, was stigmatized by the press who were gunning for Our Fair Julie and her new beau, writer/director/producer Blake Edwards.But \"Lili\" really *is* worth seeking out. Julie sings beautifully, especially the haunting \"Whistling Away the Dark,\" a lovely Henri Mancini tune that opens and closes the film. Her performance is nuanced and quite affecting--just watch her as a fat tear silently slides down her cheek after a tumultuous argument with Major Larabee.Edwards has staged some stunning flight sequences, but the suffer somewhat, in 1990s sensibilities, from the blue-screen process shots needed to get Rock \"into\" midair. Edwards also can't seem to help himself from sliding into formulaic comedy bits (he apparently thinks a bumbling Frenchman with an umbrella on a roof in a rainstorm is hilarious--it shows up in film after film of his).The reason to watch \"Lili\" is for its interesting spin on the Mata Hari legend and the performance of Miss Andrews, who certainly didn't deserve the brickbats that came her way following its release.","I suppose I like this film as well as any I know; it is not perfect, but under the title \"The Americanization of Lily\" this charming and memorable semi-musical satire might I suggest have been appreciated more, and still loved by those who recognized its special Blake Edwards'-produced spirit of gentleness, clever humor and solid narrative. The improbably but delightful story-line follows Lili Smith, a fringe-type spy for the Germans in a much simpler and less black-and-white war; Lili Schmidt passing as Smith is helping her Uncle who is patriotic too, for Germany but neither cruel nor political, merely opportunistic. Lili's target is William Larrabee, a charismatic U.S. squadron leader who can supply her valuable information. The plot thickens comes when Lili falls in love with Larrabee, has her eyes opened to the consequences of her playing spy, and sees the effects of combat on wounded men at a hospital and realizes what it might mean to his men whom she has met and likes. She gets jealous of a rival for Larrabee's affections, then realizes she can no longer do what she has been doing and gives up the spy business. The logical end of the film comes when after the terrible WWI has ended, as she sings the theme song of the film, \"Wishing\" in a darkened theater, one by one the members of Larrabee's squadron appear, including her lover himself, indicating they have forgiven her and their former opponents; and even Uncle Kurt enthusiastically joins in the singing of \"It's a Long To Tipperraree\", to indicate all is well with the world again. This is an audacious and sometime brilliant story idea, written by director Blake Edwards and William Peter Blatty of \"John Goldfarb\" fame; and it is a delightful narrative. Larrabee's squadron, including an inebriate who keeps crashing and other lovable types populate this lively film; and the feel of this stylish and glowing film is almost epic, both in its scope and realization. Credit must go to Jack Bear and Donald Brooks for their costume creations, Reg Allen and Jack Stevens for sets, Fernando Carrere for another beautiful production design, Henry Mancini for his sensitive and appropriate musical score, and to Russell Harlan for his shining cinematography. In the beautiful footage, the principal actors are Julie Andrews as Lili, Rock Hudson as Larrabee, Keremy Kemp outstanding as Lili's Uncle Kurt, Michael Witney, Lance Percival as the inebriate pilot, gorgeous Gloria Paul as Lili's stripteasing rival, and many other fine actors in smaller parts. It is hard to say enough nice things about the pace, or the cleverness of the just-this-side-of broad comedy; this element is introduced by Edwards to leaven the horrors of actual warfare, to example the almost comic-opera approach with which men made war back in a more innocent-minded era of human civilization.. This comedy also helps prepare the way for Lili's conversion from uncritical acceptance of a duty to the German state to acceptance of the reality of what she is doing and potentially what she may be causing. This is a rare \"sense-of-life\" film about Lili's \"Americanization\", her assertion of herself in the real world and then among others before tragedy can happen. It is haunting, I find, and beautiful in many ways. I consider it to be Blake Edwards'masterpiece of directing; and under the title \"The Americanization of Lili\" I believe with hardly any changes it might have been recognized as the polished sapphire of a film it is by every standard I know.","Except for \"Star!\", (Which another reviewer understandably considers a \"companion piece\" to this film), Julie Andrews never starred in a film that was more ideally structured specifically for her many talents than \"Darling Lilli.\"  She gets to sing, act, look lovely, even let her hair down and do a striptease in her continuing efforts to get away from her Mary Poppins/Maria Von Trapp image, and much more.  Lilli is certainly one of the most interesting characters she ever played; you're never quite sure whether you're supposed to root for or despise this half-English, half-German who is a London music-hall entertainer but also acting as a spy for the Fatherland in World War I and is sent to, um, extract military secrets from American Major William Larabee but falls in love with him and tries to clear both their names for the suspicious French government.And like \"Star!\", \"Darling Lilli\" was released at the wrong time.  It had enough \"performance numbers\" to count as a movie musical, even though it also had elements of drama, comedy, and spy intrigue, and both movie musicals and Julie Andrews were not what critics and audiences were anxious to see in the late 1960s and early 70s, when both films were released.  So both bombed at the box office.  \"Darling Lilli\" in particular, judging by the \"director's cut\" that director Blake Edwards prepared several years later, did not really deserve this fate.  While flawed, it is still highly entertaining, and Miss Andrews is utterly radiant, whether acting, stripping, or singing some vintage WW I tunes or some lovely songs written for the film by Henry Mancini and Johnny Mercer.  The film should be seen if for no other reason than for the hauntingly beautiful \"Whistling Away the Dark\" and Julie's tender, achingly vulnerable performance of it.But as I said, the film itself is not too great.  The description of Lilli's character alone is confusing enough, and often it's hard to figure out what is going on.  (Perhaps some footage that could've cleared up this confusion is in the original version of the film?)  In addition to the rather muddled string of events, Rock Hudson is pretty stiff as Larabee, and the various German, French, and English accents of the supporting characters come and go.  The authentic WW I aircraft is cool, but the air sequences, appaarently the ones that took the longest time out of the film's very long shooting period, are the least interesting in the film.  And another reviewer also noted the film's uneasy yo-yoing between genres: the \"director's cut\" is probably the most serious film Edwards (Who happened to have just married Miss Andrews before they started filming this) ever directed, but he can't resist putting in some of his trademark cheap laughs, although several of them are admittenly funny.  And all in all, the film is very entertaining, whether as a drama, comedy, musical, or spy thriller, and whenever Julie Andrews is onscreen, all the film's faults seem like quibbles.  Obviously, Mr. Edwards is in love with his wife; can you blame him?","After 35 years, I've seen this film again; the 136 minute version at the Anthology Film Archives in New York City's East Village. They also showed the 114 minute version which, according to their production notes, is darker in tone, since it's missing some of the comedy of the piece. Certainly some of the cutesy comedy, which Blake Edwards, the director/producer/writer, also seems to be enamored of in his Pink Panther movies, could be cut.The film is an attempt to make a mature, romantic musical and was a big flop at the time. Edwards was married to Julie Andrews, the female star of the movie. Andrews had a great success with \"Mary Poppins\" a few years earlier, and a phenomenal success with \"The Sound of Music.\" She tried repeating the success with the awful (but, perhaps, commercially successful) \"Thoroughly Modern Millie,\" and had a stinker with \"Star!\", the Gertrude Lawrence story. \"Star!\" was an adult musical, but it didn't take, so \"Darling Lili\" was another try at breaking Andrews' goody-two-shoes image. She says \"ass\" in the movie twice and \"bastard\" once! The scenes I remember most from the first screening in 1970 are the striptease by Suzette (Gloria Paul) and the aerial sequences, which are pretty dazzling (except for the obvious process shots). In fact, the whole movie is quite lavish and Andrews is gowned and bejeweled beautifully. Edwards seems to have studied the films of Vincente Minnelli and is better at creating some of the Minnellian tone than George Cukor was with the dull \"My Fair Lady.\" In fact, Minnelli was making a movie - \"On A Clear Day...\" - at Paramount the same time \"Darling Lili\" was being produced. \"...Lili\" went into major cost overruns, which could account for \"...Clear Day...\" being so lackluster in its modern scenes, since major money was being pumped into the Andrews/Edwards film.The movie isn't terrible. In fact, it's quite charming, if a little long. But the movie-going public is fickle, and Julie Andrews musicals fell quickly out of favor. Rock Hudson is enormously likable as always, but has little to do. The production design is delightful, and it's fun to see Andrews do her striptease (which may not be in the shorter version, and I'm thinking that must have been the version I saw in 1970, because I think I would have remembered it).Maybe the movie will come out on DVD now that they are showing two versions in NYC. The print was beautiful, by the way. It even included the overture. The audience was a poignant collection of solitary film nerds, not excluding myself!","I remember seeing DARLING LILI when it ran it's short original theatrical release.  I also remember being the only person in the theatre during the particular showing I attended.  It saddens me now as it did then that this beautifully crafted and delightful film was so sneered at and snubbed by critics and audiences alike. Movie musicals made a brief comeback in the early sixties and peaked with THE SOUND OF MUSIC in 1965.  Hollywood continued to make them and even though two of them, OLIVER! and FUNNY GIRL, were mildly successful, the genre was again on the decline.  The movie musicals of the late 60s all died at the box office including DOCTOR DOLITTLE, CAMELOT, FINIAN'S RAINBOW, GOODBYE MR. CHIPS, CHITTY CHITTY BANG BANG, PAINT YOUR WAGON, HALF A SIXPENCE, SWEET CHARITY, HELLO DOLLY! as well as Andrews' other underrated drama with music, STAR! which I consider a companion piece to both DARLING LILI and Andrews' comeback film, VICTOR,VICTORIA.  But even in 1970 the movie musical struggled to survive with not only DARLING LILI but two other large scale musical extravaganzas, ie: ON A CLEAR DAY YOU CAN SEE FOREVER and SCROOGE.  Much salt was added to the wound when not only 'LILI' but also 'CLEAR DAY' and SCROOGE tanked at the box office.  These films failed not because they were bad films but because audiences had grown cynical and no film was any good unless it was \"realistic\".  It seemed that going to the movies was no longer an excercise in temporarily putting one's troubles aside for a few hours of nurturing the spirit and soul with beautiful singing and dancing.  Critics and audiences seemed to have taken themselves so seriously that even their entertainment had to be a reflection of their harsh day to day realities.  One was labeled old fashioned and unhip to enjoy movie musicals.  As for DARLING LILI, I found this delightful comedy farce with music to be truly charming and funny.  Julie Andrews is in top form both musically and dramatically.  Not only that but her comic talents are equally displayed.  She looks gorgeous in this film and like STAR! she dazzles us in her canny ability to retain her girl next door demeanor and be damn sexy at the same time.  Of course her success in keeping the balance of wholesomeness and sexy seductiveness is in part due to the excellent directing of her director/husband Blake Edwards.  Again, the movie's failure at the box office is due the audiences' inability to appreciate what Edwards was trying to do.  They just plain didn't get it.  Nor did the critics have a clue either.  Edward's clever variation on the Mata Hari story mixing musical numbers and intrigue and farce and romance with World War 1 the backdrop should have been embraced by the public during the Vietnam years as a bit of reprieve and relief from all the turmoil of the times; not as a way to forget the harsh realities but to make them easier to cope with.  But this was not to be.  I sometimes wonder if this movie would be better received if it was being released now for the first time.Besides the highly entertaining adventure comedy, the music is gorgeous. Ms. Andrews sings one of the finest songs of the period, the haunting \"Whistling Away the Dark\" which was tragically robbed of the Best Song Oscar for 1970. But all the songs are great written by Henry Mancini.  The sumptuous sets, art direction and costumes frame the movie with grand artistic opulence.  Rock Hudson is great as an American fighter pilot and he revives his suave, debonair dash reminiscent of his farcical bedroom comedies with Doris Day.For several years now I have longed for Mr. Edwards to release a widescreen letterbox video release on DVD.  To my knowledge there has never been home video version.  I'm willing to bet that the DVD would do well in sales.  Edwards could even do a Julie Andrews commemorative box set of DARLING LILI and VICTOR VICTORIA in gorgeous letterboxed DVD transfers with all the fancy extra features.  Well, one can dream.  If I knew how to contact Mr. Edwards and Ms. Andrews I'd write them a letter begging them to make DARLING LILI available.  Heck, I'd grovel if necessary. I'd love to tell everyone to go out and rent this wonderful movie but I can't since it's not available.  The only way one can see this film is when it's broadcast on cable - which I don't have.  And even then it's not always shown in it's widescreen splendor.  Often one is subjected to cable broadcasts of the film in the horrific pan and scan format which sadly upstages and obstructs the artistic integrity of the film.  If I were Julie Andrews or Blake Edwards, I would want to share this lovely work of art on film in the very best venue possible: DVD home video in widescreen.  So far, all we are allowed is an occasional glimpse of this little gem often crippled by pan and scan butchery via cable, a source slowly dying off with the emergence of Direct TV and the growing popularity of DVDs and DVD players.","Julie Andrews plays a German spy who falls in love with an American pilot Rock Hudson, while on an assignment for Germany.The songs are beautiful. The two are well-paired. Julie demonstrates a more temperamental side in this film than the nice girl she normally plays. A half-German, half-English girl who sings beautiful and entertains the troops in WW I, Julie sings some endearing Mancini songs. I loved the film. Some will say it's a \"chick-flick,\" but so what. It's wonderful. Supporting characters are somewhat stereotyped. It may not be up to Rock's performance in Pillow Talk, Magnificent Obsession, or Giant.Blake Edwards shot the film in Ireland and authentic WW I -type planes were used in the film. Scenery for England and France is absolutely gorgeous.","Yes, I am a romantic of sorts who likes musicals and comedy and this fit the bill! Julie Andrews gives a mesmerizing performance at the beginning and end of this film with the \"Whistling in the Dark\" production number. The sedate-to-outrageous number that she performs in the middle of the story when she believes that Rock Hudson has been seeing a dancing/call girl is eye-popping and will certainly make you giggle.I only wish that this film could be found in video or DVD as I would surely purchase it in a heartbeat for my home library!","Julie Andrews and Rock Hudson were great in this movie / musical.  The opening song by Ms. Andrews, \"Whistling Away the Dark,\" will always be in the back roads of my mind.  The plot line during World War I, is great and suspenseful one.  If you are a romantic, you will love this movie.  This is a movie that I always enjoy to see again and again.","Blake Edwards and Julie Andrews' timing couldn't have been worse when thisfilm was released in 1970.  Musicals were dead as a doornail, and onlyStreisand was given the benefit of the doubt.  Julie Andrews, a monstrouslytalented, uniquely beautiful singing actress was finding that she was out of step with Hollywood who wanted grittier stories with nudity and violence. Thirty- some years later, we find this is a terrifically entertaining piece of film-making, which brings out all of Blake Edwards trade-mark gifts and lapses.\nFirst of all, it's way too long.  Secondly, the screenplay doesn't give you a real clue whether we're talking about a musical comedy or a war drama with Lilyconfusing you about her secret life as a spy.  Okay, deal with it.  The movie is a wonderful brew of entertainment, nostalgia, sweet sentiment, and first-ratemusicality.  Like Doris Day a decade before her, Julie Andrews has one of the great screen figures.  She's simply beautiful with her oddly spaced eyes and her slightlycomic nose.  But those limbs are gorgeous, her skin is also a thing of wonder. Nobody does frosty British authority better than Julie, and her crystaline voice is a warm, pliant instrument with the clearest diction you'll ever encounter. She sings in a very modern way, but with plenty of old-fashioned vocal refinements such as portamento and legato.  She's always been a game comedienne, andshe is a huge screen presence.  She's first-rate here and would seldom beallowed to shine as superbly again (Victor/Victoria aside). \nRock Hudson is clearly her equal.  Still handsome, dashing, and convincing as Lily's American flying ace lover, Hudson exudes charisma and comic panache. Again, he would never quite come up to this level in films again, and we would only be able to glimpse his excellent light comic skills on TV in the well-done mystery series, McMillan and Wife.  I love Mancini's score, and the supporting cast is everything you could wish for, especially Jeremy Kemp's lovable spy aid to Lily.  Edward's displays his gift for wonderfully comic set pieces.  It's a bit forced at times, but these are first-rate craftsmen working at the top of their game.Why it has never appeared on VHS, laserdisc or DVD thus far is beyond me.  Iknow the failure of the movie at the box office soured Edwards and perhaps he is locked into a battle of wills with Universal determined to teach them a lesson by withholding his permission.  Wishful thinking on my part perhaps, but it is odd that its never been been available in a home entertainment format.  TVshowings don't help either because they have cut it to smithereens to fit various formats.  The first time I saw it, I was totally confused.  A few years later, I had warmed to it considerably and I think it was due to a more coherent cut.","This movie is certainly well-constructed, beginning and ending in the dark, with focus on Lili Smith /Schmidt, Julie Andrews,initially the singing 'angel' later the notorious spy.It's beautiful!  I saw the movie about 15 years ago and watched it again recently. While it was dismissed by critics in the 70's as overblown, 'cinema vulgaris', and lacking in structure (among others) time has proven them wrong. Blake Edwards certainly has produced a film that is almost of lyrical quality.The film soars and swirls (aerial photography; Julie Andrews in motion) and captivates. One must just buy into the premise that Julie Andrews is a spy whose mission has gone wrong. Overlooking the tepid chemistry between Julie Andrews and Rock Hudson, one must believe that these are lovers - who in all innocence fall for each other. And in the end, love is far more important than winning wars. And so is maintaining innocence.There is a lot of understated acting, and the film certainly reaches emotional depths often not seen in comedies.\nThere are wonderful comedic elements (foreshadowing the French goons in Victor/Victoria), interesting diplomatic asides (reminding me of The Tamarind Seed, seen about 18 years ago) and a general sense of good-will.Suspend all disbelief and this movie will carry you away. Julie Andrews' belting out of war songs and the haunting 'Whistling Away the Dark' are reason enough to turn the TV on, just for the soundtrack. And the striptease number, like the 'Jenny' number in Star! works. This film has, like a good champagne, aged well.  Paramount should bring it to DVD as soon as possible.  The same applies to transferring the laser disk of Star! to DVD. These are both interesting pieces of Julie Andrews' meticulous and then underrated works.","Warning, this may contain spoilers.DARLING LILI, writer/director Blake Edwards' megamillion dollar epic production valentine to his superstar wife Julie Andrews has gone down in Hollywood history as one of its biggest flops. (History would repeat itself a quarter-century later when director Renny Harlin did the same thing for his wife Geena Davis in the multimillion dollar dud CUTTHROAT ISLAND).\nIts not difficult to understand LILI's initial box office failure. It's difficult to classify what genre DARLING LILI belongs in. Most often it gets labeled a musical but the songs take place in the context of someone(mostly Miss Andrews) performing. Never do they just \"happen\" with the background music coming from nowhere as in THE SOUND OF MUSIC. Not helping matters is the fact that the script by Edwards and Wm. Peter Blatty(A SHOT IN THE DARK) seems to keep changing its focus on exactly which film genre LILI belongs in. In fact, LILI often seems like a pastiche of other Edwards films. As with THE GREAT RACE, LILI is a big-budget lengthy, epic period piece set early in the 20th Century. It starts out as a very serious spy drama(like THE TAMARIND SEED). When Rock Hudson shows up, the film then turns into a gooey romance like BREAKFAST AT TIFFANY'S with the song \"Whistling in the Dark\" becoming LILI's \"Moon River\" equivalent. Then two bumbling French detectives appear a la Inspector Clouseau from THE PINK PANTHER series bringing in a dose of slapstick. Then with the arrival of the \"Operation Crepe Suzette\" issue, LILI becomes a bedroom farce in the VICTOR/VICTORIA mode. It all finishes with an exciting chase involving period cars, a train and WWI era airplanes making for the most entertaining sequence in the film.\nDespite the rather odd jumbling of elements and moods(which reminds me of Leo McCarey's underrated 1942 WWII romantic comedy drama spy adventure film ONCE UPON A HONEYMOON), LILI has its redeeming features. The music score which features WWI favorites as well as an original score by Henry Mancini and Johnny Mercer is quite pleasant and humable. Russell Harlan's Panavision/Technicolor photography beautifully captures picture postcard views of France, Belgium and Ireland. Mr. Hudson and Miss Andrews both perform as well as the script allows them to although the chemistry that he shared with previous leading ladies Doris Day and Gina Lollobrigida and that she shared with previous leading men Dick Van Dyke and James Garner is conspicuously absent between the two leads. Jeremy Kemp(as he did in THE BLUE MAX and would again in THE WINDS OF WAR) embodies the old Hollywood adage that British actors make the best World War movie Germans.\nIn 1991, Edwards made a \"director's cut\" of DARLING LILI and that's the version broadcasted on television today. As of this date, the film has yet to be released on home video. I saw the original, longer version of LILI on television back in 1984 and I have to say this is one case where the director's cut(which is tighter, moves faster and has a shorter running time that suits its slight story better) is undoubtedly an improvement.Rating: For the original version, ** out of ****.For the director's cut, **1/2 out of ****.Bottom line: Uneven but pleasant and worth seeing if one is a Julie Andrews fan. Just don't expect anything remotely reaching the quality of THE SOUND OF MUSIC or even THOROUGHLY MODERN MILLIE.","This often maligned movie is a must for fans of Blake Edwards, Julie Andrews, Henry Mancini, or Hollywood musicals.  Other writers have commented on the shifts in tone, the confusion of plot, etc., but the film has many things to recommend it.  The score is one of Henry Mancini's best (and he has written many wonderful ones), several songs are sung to perfection by Andrews, Julie's performance is nuanced and she is decked out in some beautiful clothes, (she is at her absolutely loveliest here), the on-location shots are breath-taking, and there are some funny Inspector Clouseau-type sight gags to boot.  Rock Hudson basically phoned in his performance, but he is passably good.  A real curiosity item in that it was the last major film Julie did for about 10 years and, in many ways, is a precursor to Victor/Victoria.  It is lovely to look at and listen to. When will it be available on DVD???  When it is, I for one would like both versions--the longer and shorter, director's cut.  Since it was lampooned in S.O.B., they would make a great two-pack!","Years ago, when DARLING LILI played on TV, it was always the pan and scan version, which I hated and decided to wait and see the film in its proper widescreen format. So when I saw an inexpensive DVD of this Julie Andrews/Blake Edwards opus, I decided to purchase and watch it once and for all.Boy, what a terrible film. It's so bad and on so many levels that I really do not know where to start in describing where and when it goes so horribly wrong. Looking at it now, it's obvious to any fans of movies that Blake Edwards created this star vehicle for his wife simply because so many other directors had struck gold with Andrews in musicals (MARY POPPINS, SOUND OF MUSIC, THOROUGHLY MODERN MILLIE, etc) but also because Andrews was snubbed from starring in projects made famous on stage by Julie herself (CAMELOT, MY FAIR LADY, etc) because Hollywood thought she wasn't sexy or glamorous enough. So Blake created this stillborn effort, to showcase his wife in a bizarre concoction of spy story/war movie/romance/slapstick comedy/musical. DARLING LILI suffers from multiple personalities, never knowing who or what it is. Some specific scenes are good or effective but as a whole, it just doesn't work at all to a point of it being very embarrassing.Mind you, the version on the DVD is the \"director's cut\", or in this case, \"let's salvage whatever we can\" from this notorious box office flop. In releasing the DVD, Edwards cut 19 scenes (19!!!!!!!!) from the original bloated theatrical version into this more streamlined and yet remarkably ineffective version. The film moves along with no idea of what it is. We are 25 minutes into it and we still don't know what's going on or why we're watching what's going. What kind of spy is Lili? How powerful is she? Was she ever responsible for someone's death? Instead we watch a thoroughly bored looking Rock Hudson trying to woo a thoroughly bored looking Julie Andrews. Things aren't helped much with the inexplicable reason why the two fall in love. Why does Julie fall for Hudson? Why him and not other men she got involved with? There should have been one of her ex hanging around, trying to win her back or trying to decipher her secret. This would have given us some much needed contrast to the muddled action. It would also have given us some impetuous to the sluggish proceedings. There's no catalyst in this story.One only has to look at the cut scenes to clearly see that Edwards and the writer just came up with ideas inspired by Andrews' (and Edwards') previous successes. The best (or worst) example is the scene when Andrews and Hudson follow a group of children who sing in the middle of a forest. Edwards channeling SOUND OF MUSIC. It's no wonder he removed it from the DVD. Back in 1970, that scene might have worked on a certain level but today, that moment reeks of desperation. There are other plot elements directly inspired by Andrews/Edwards other films. The endless scenes of dogfights is inspired by the much better MODERN MILLIE. The musical moment \"I'll give you three guesses\" was created just to make fun of Julie's MARY POPPINS persona, which is turned \"raunchy\" with Julie doing a striptease in the act. The ending, bird's eye view of Julie running towards Hudson's plane, is another \"wink\" at SOUND OF MUSIC.The whole thing is confusing. Julie plays a singer, born from a German father and British mother, who lives in England but sings her (English) songs in Paris. You never know exactly where the story takes place. Some moments are just badly edited. Like when Julie and her \"uncle\" are on horseback. They talk and talk and then Julie suddenly sprints off in mid-sentence. I'm like \"what happened here?\"The comedy bits are unfunny and cringe-worthy. Every scene with the French police are pathetic. Where's Peter Sellers when you really need him. The action is badly thought-up. When Julie and her \"uncle\" are on their way to Germany on that train, Hudson's squadron and the German squadron reach the train (in daytime) at the same time even thought the train has been moving for hours and they left the night before. The French/German border is not that far. Anyway, that's one slow moving train there. The 'climax' is an entirely poorly executed moment.The musical moments. The beginning is the best part of the entire film (and the reason I gave this film 3 stars) but its effect is diminished considerably because it's repeated at the end. Speaking of redundant, did we really need to see a can-can dance, Crepe Suzette stripping scene and Julie stripping too? The \"Girl in no man's land\" is OK even if it's bleeding obvious, but that moment just doesn't make any sense whatsoever because Lili sings it to a group of injured soldiers at a French hospital, making me wonder: how many soldiers there were injured indirectly by the result of her spying?The whole project is listless and without energy. The romance is 100% unbelievable. Rock Hudson is way too old and tired looking (check out the museum scene). Julie looks dazed, like she's on Valium. But what really kills this ill-conceived project is Julie playing a German spy. Edwards desperately wanted to dispel the Mary Poppins syndrome afflicting his wife and believed that playing a traitor was a good career decision. As much as I like Julie, she's no Greta Garbo, who pulled it off so beautifully in MATA HARI. Funny enough, even if Julie plays a German spy, she still comes across as cloying and cute.How bad is DARLING LILI? Even after 37 years since its release, Blake Edwards felt he still needed to work on it for its DVD release.","Blake Edwards tried very hard to change Julie Andrews image in this film. He tried to make her sexy not realizing she already was. I think they were both still a bit irked that Julie had not been chosen to film her Broadway success of Camelot and was passed over as not being sexy enough. Unfortunately, they chose this vehicle to try and assuage this belief. It gets to the point where it is almost funny seeing Rock Hudson, who we all know now was gay, kissing Julie every 2 minutes throughout this movie. It seems now that they were not only trying to make you believe that Julie was a femme fatale but that Rock was straight. Sadly, they have absolutely no chemistry together and the unending kissing scenes start grossing one out. The other error they made with this picture was not knowing what kind of movie they were making. It is almost three separate movies. There is the drama of Julie as the German spy trying to get military secrets from Rock. There is an air war movie with lots of footage of WWI vintage planes swooping about and there is the stupid attempts at humor that Blake Edwards seems to think he has to insert in every one of his pictures whether it is appropriate or not, In this case, it was not. The only truly redeeming qualities in this film are looking at the always lovely Dame Julie and hearing her sing in that crystal clear bell-like soprano. Of course if you love her, you may overlook the weaknesses of this film just because of her. You can always tell yourself, afterward, that it was a hell of a lot better than sitting through STAR!","An obvious vanity press for Julie in her first movie with Blake.  Let's see. Where do we begin.  She is a traitor during a world war; she redeems that by falling in love; her friends (who are presumably patriots because they are German citizens) are expendable and must die; and she winds up as a heroine.  OK. The scenes with the drunken pilot and the buffoons who work for French intelligence can't even be described, and we won't even mention Rock's romantic scenes with a female.  (By the way, when they visit a museum, look at his gaze - I reran it on video and it's priceless).  Is it a farce or is it a romantic classic or is it a war movie? I don't know and you won't either.","Julie and Blake deliver a real bomb {no pun intended}of a World War 1 musical with this sloppily made mega budget mess. Julie's voice is always a joy, but the music here is of the \"in one ear, out the other\" variety. Hudson shows all the romantic magnetism of a buttered scone and his scenes with Julie hold about as much spark as my 1987 Yugo. The comic relief is painfully unfunny, the flying scenes ho hum {with most of the aircraft and even one of the stars, Jeremy Kemp, rehashed from \"The Blue Max\"}and the whole experience just makes me glad that I saw this on free TV. Its a long way to Tipperary alright, this movie is closer to Verdun....","Darling Lili may have been a major flop at the time, but to me it is not a bad film. Not great, uneven is a good way to describe it, but it is much better than its reputation. It is overlong, the comedy/slapstick scenes at times feel out of place and compared to the other themes that make up the film at odds with the rest of the film, the film can get muddled, the film can drag and Rock Hudson while likable is rather stiff- compared to his usual performances- and doesn't have the strongest of chemistrys with Julie Andrews(though not without its moments). Julie Andrews though is great though, her acting and presence are charming and she as ever sings like an angel. Lance Percival shines also in possibly his best film role and one of his best performances. The film looks gorgeous, the highlights being the marvellously shot aerial dogfight sequences and the visuals that accompany the song Whistling Away the Dark. The music is distinctive Henry Mancini, it fits the film adeptly and is a very memorable score and one you can re-visit more than once. Much has been said about the hauntingly beautiful Whistling Away the Dark, how Andrews sings it(like an angel and with so much nuance and emotion) and how it's staged and for good reason, simply put it's a beautiful song that is beautifully sung and beautifully staged. The script and the story aren't great but they're not disastrous either. The script is intelligent with some snappy moments, it didn't feel that talky, and the story at least has some entertainment value despite moments being muddled and the spy thriller, drama and musical themes being far more convincing than the comedy and romance ones. Overall, uneven but Darling Lili a decent film and is much better than it's made out to be, though it's somewhat easy to see why it was a flop. 6/10 Bethany Cox","Colorful musical that is deficient in the script department, exactly why Julie is a spy is never really apparent and it really hurts the film. That being said the production design is beautiful as are some of Julie's costumes, it all seems overproduced and under-directed though. While the design is good a problem the film suffers from, and it was one many 60's musicals share, is that nothing looks lived in or used so it feels false from the beginning. Rock has been better elsewhere although that also is probably the fault of the script. What makes this worth sitting through is Julie and her voice which is exquisite and put to use on some lovely songs. \"Whistling Away the Dark\" in particular is haunting and beautifully staged if only the rest of the film was up to its brilliance this would have been something indeed.","Julie Andrews satirically prods her own goody-two-shoes image in this overproduced, uneven musical comedy-drama; but, if Andrews approaches her role with aplomb, she's nearly alone in doing so. Blake Edwards' film about a woman who is both music-hall entertainer and German spy during WWI doesn't know what tone to aim for, and Rock Hudson has the thankless task of playing romantic second-fiddle. Musicals had grown out of favor by 1970, and elephantine productions like \"Star!\" and this film really tarnished Andrews' reputation, leaving a lot of dead space in her catalogue until \"The Tamarind Seed\" came along. I've always thought Julie Andrews would've made a great villain or shady lady; her strong voice could really command attention, and she hits some low notes that can either be imposing or seductive. Husband/director Edwards seems to realize this, but neither he nor Julie can work up much energy within this scenario. Screenwriter William Peter Blatty isn't a good partner for Edwards, and neither man has his heart in this material. Beatty's script offers Andrews just one fabulous sequence: a raucous striptease--though this is done in nudging satire, so we in the audience will understand it's all a put-on. A cop-out is more like it. ** from ****","David Bryce's comments nearby are exceptionally well written and informative as almost say everything I feel about DARLING LILI. This massive musical is so peculiar and over blown, over produced and must have caused ruptures at Paramount in 1970. It cost 22 million dollars! That is simply irresponsible. DARLING LILI must have been greenlit from a board meeting that said \"hey we got that Pink Panther guy and that Sound Of Music gal... lets get this too\" and handed over a blank cheque. The result is a hybrid of GIGI, ZEPPELIN, HALF A SIXPENCE, some MGM 40s song and dance numbers of a style (daisies and boaters!) so hopelessly old fashioned as to be like musical porridge, and MATA HARI dramatics. The production is colossal, lush, breathtaking to view, but the rest: the ridiculous romance, Julie looking befuddled, Hudson already dead, the mistimed comedy, and the astoundingly boring songs deaden this spectacular film into being irritating. LILI is like a twee 1940s mega musical with some vulgar bits to spice it up. STAR! released the year before sadly crashed and now is being finally appreciated for the excellent film is genuinely is... and Andrews looks sublime, mature, especially in the last half hour......but LILI is POPPINS and DOLLY frilly and I believe really killed off the mega musical binge of the 60s..... and made Andrews look like Poppins again... which I believe was not Edwards intention. Paramount must have collectively fainted when they saw this: and with another $20 million festering in CATCH 22, and $12 million in ON A CLEAR DAY and $25 million in PAINT YOUR WAGON....they had a financial abyss of CLEOPATRA proportions with $77 million tied into 4 films with very uncertain futures. Maybe they should have asked seer Daisy Gamble from ON A CLEAR DAY ......LILI was very popular on immediate first release in Australia and ran in 70mm cinemas for months but it failed once out in the subs and the sticks and only ever surfaced after that on one night stands with ON A CLEAR DAY as a Sunday night double. Thank god Paramount had their simple $1million (yes, ONE MILLION DOLLAR) film LOVE STORY and that $4 million dollar gangster pic THE GODFATHER also ready to recover all the $77 million in just the next two years....for just $5m.... incredible!","Recognized with three Oscar nominations Darling Lili was a big flop at the time and helped seal the fate of big budget musicals and Julie Andrews's career in them. They were getting just too expensive to make with all the talent that used to be under contract to a studio now charging full market value for services. Whatever else Darling Lili is it's a full market value musical film.Set in the era of World War I, Darling Lili's best asset is its music. Two of the three nominations were in the music field for best overall score and to Henry Mancini and Johnny Mercer for the song Whistling In The Dark. That one is an incredibly beautiful number that Julie Andrews sings perfectly. The original songs are integrated so well into the film that they fit perfectly in the era. More traditional World War I era songs are also used, no doubt all in the public domain by 1970.Would that the score was attached to a better story. Wholesome Julie Andrews is a popular entertainer of the era, singing for the troops on the western front. She also doubles as a German spy. Her assignment which she accepts with gusto is to get involved with American air ace Rock Hudson and learn some military secrets. I think you can guess the rest.Darling Lili lurches back and forth from cloak and dagger espionage to slapstick comedy in the extreme and it's an uncomfortable ride in the process. One of the characters is Lance Percival playing a drunken pilot in the Royal Flying Corps. I mean really, this guy should never have been in the RFC, the comedy which is good is severely out of place.Film buffs will recognize some similarity to The Firefly and the British classic Dark Journey so if you know those films you know how this one ends. Fans of Rock Hudson and of Julie Andrews will like this and her singing is divine. The rest of Darling Lili is on a lesser plain.","I am an avid Julie Andrews fan and I just watched this for the first time on DVD -- the Director's Cut version. I was very surprised that it was rated G. How did they get bedroom scenes, a seduction story line, two strip tease acts, and war/shooting/blood into a G rating? Weird. I would rate it PG-13.Other than that I thoroughly enjoyed the movie. It was a beautiful showcase of Andrew's voice and talent. The acting was great. The storyline was a little weak, leaving gaps that could have been filled with some good dialogue. There were too many \"no talking, just walking\" scenes for me... I would have liked to see the the relationship between Julie and Rock blossom, so that the intense love would be more believable.","I first viewed this movie when it first came out and also bought an LP recording of the soundtrack. I liked it so well, I went back to see it several times..cannot understand why it was considered a flop. Julie Andrews was lovely in this film, her voice was in top form and the costuming was beautiful!The film contains a little bit of everything and even though some of the scenes were a bit heavy-handed, they were still fun. I recently found I could get a copy in DVD form and ordered it......I was disappointed that a couple of songs and sequences in the movie were not included in the version of the DVD I ordered.","For a change, Rock Hudson does not dominate a picture.Yes, it's hard to imagine that Julie Andrews is a German World War 1 spy in this wonderful film, especially since she sings so beautifully here. From the opening number of Whistling in the Dark, which was Oscar nominated, for best song, we know we're in for a treat in this film.The film is a special one because circumstances dictate that Lily and her uncle come around by picture's end. It also again shows that her love for the man (Hudson) she is spying on shall eventually circumvent politics, even in war-time.The patriotic songs are wonderfully delivered and you sure get a feel of the period. There were certain times that I felt that Andrews was Mary Poppins or the novice Maria of \"The Sound of Music.\""],"review-user":["Katmiss","dweck","silverscreen888","Tommy-92","jgepperson","jeff.haas","mnnoonan","margaret-gallagher","thguru","gregorybnyc","philip-ct","s007davis","nlester","Maciste_Brother","kminsf","tmh1918","Falco-8","TheLittleSongbird","jjnxn-1","moonspinner55","ptb-8","bkoganbing","laurenat-1","cubanwahine","edwagreen"],"review-date":["16 May 2001","12 January 1999","7 July 2005","20 May 2001","29 May 2005","26 December 2000","28 August 2005","2 January 2003","6 October 2001","8 May 2004","1 May 2003","24 November 2001","23 May 2003","26 March 2007","20 November 2005","20 March 1999","11 April 1999","24 October 2013","13 May 2013","5 August 2007","5 August 2007","20 June 2012","26 April 2007","24 August 2004","22 March 2015"],"review-rating":["8","6","10","10","9","8","7","10","3","4","1","6","6","5","4","6","7","10","10"],"review-title":[" A FAIRLY GOOD FILM IN THE DIRECTOR'S CUT\n"," Not the Flop It Was Made Out to Be\n"," Stylish, Lovely and Moving; Satire With Comedy, Infectious Sense-of-Life\n"," Great showcase for Julie Andrews. Not a great film.\n"," Surprised this isn't on tape or DVD\n"," Sadly under-appreciated, Darling Lili is a charming spy operetta\n"," delightful pairing of Julie Andrews and Rock Hudson\n"," One of the best opening scenes EVER!!!!\n"," A great romantic move.\n"," Put it out on DVD, fer Chrissakes!\n"," Playful on all levels ... certainly SHINING in the dark\n"," Blake Edwards' multimillion dollar WWI-era romantic musical comedy drama spy adventure opus is uneven but pleasant\n"," One of Julie's best\n"," The Three Faces of Darling Lilli\n"," A failed experiment\n"," Pathetic farce\n"," Who wrote the checks for this dud?\n"," Uneven but much better than its reputation\n"," Clunky and overblown but that voice!\n"," Old-fashioned wartime star-vehicle with wan results...\n"," Darling Silly\n"," Full Market Value Musical\n"," Don't Get the G Rating\n"," Truly love this movie\n"," Darling Lili is Just That ****\n"]}