{"review-url":["http://www.imdb.com/title/tt0050347/reviews"],"review-text":["Although this small film kind of got lost in the wake of On The Waterfront, Edge Of The City can certainly hold its own with that star studded classic. It's another story about the docks and the code of silence that rules it.Next to the corrupt union that Lee J. Cobb ran in On The Waterfront, Jack Warden is really small time corruption. But he's real enough as the gang boss on one of the docks who intimidates the other workers by being handy with his fists and the bailing hook and he gets the rest to kickback part of their hard earned money. And it's all hard earned money in that job.One guy Warden can't intimidate is Sidney Poitier another gang boss and when he tries to intimidate newcomer John Cassavetes, Poitier takes him under his wing. The two develop quite the friendship and Poitier and his wife Ruby Dee even fix Cassavetes up with Kathleen Maguire.Warden is truly one loathsome creature and it's sad how by sheer force of personality and physical prowess he cows almost everyone else into submission. In that sense he's tougher than Lee J. Cobb who did have to rely on an impression collection of goons to enforce his will in On The Waterfront.Edge Of The City marked the big screen directorial debut of Martin Ritt who did a great job with a good cast of New York based players and spot on location cinematography. The film's low budget does show, but you're so impressed with the ensemble cast you don't really care.Cassavetes as the loner with a past and the hip and tough Poitier are both fine, but my personal favorite in this film is Ruby Dee. She should have gotten some award for her performance, her final scene with Cassavetes is outstanding.Catch this one if ever possible. I wish it were out on DVD or VHS.","A skillfully directed film by Martin Ritt where a drifter and anti-hero, John Cassevetes lands in N.Y. to escape a tragic incident in his life, where he killed his brother in an automobile accident as well as going AWOL from the army.Cassavetes, always an intense actor, shows grit in his portrayal of a film. Am surprised that Montgomery Clift didn't get this part.Ruth White is his mother and does remarkably well in two scenes on the telephone.Once in New York, he befriends Sidney Poitier as the two work on the docks. Immediately, Jack Warden, a bully and villain in this film,takes a dislike to him and tragedy ensues when Poitier tries to defend his friend.Ruby Dee, plays Poitier's wife in this film, and is brilliant in a scene where she urges Cassavetes to reveal the killer of her husband.This is definitely an interesting film of moral values and the loner in society. With the backdrop of tenements, the right mood is depicted in the film.","In this rarely seen black-and-white film, blacklisted director Martin Ritt (Nuts, Norma Rae) explores the complexities of racial brotherhood and tensions through the characters brilliantly played by Sidney Poitier and John Cassavetes. This emotionally charged drama follows the story of Axel (Cassavetes), a drifter newly arrived in New York City, who goes to work in the West Side Terminal as a porter and immediately makes the acquaintance of Tommy (Poitier), an experienced and cordial porter who is as generous with his friends as he is with his customers. Scenes such as the first meeting between Axel and Tommy's family, as well as the confrontations between Axel and his surly boss (Jack Warden), convey the confidence and compassion that steadily grows between the two men. As the two men confront societal prejudices, Axel is forced to examine himself and his community. In a film often compared to On the Waterfront, director Ritt displays an intuitive insight, simultaneously subtle and sharp.","Martin Ritt's first film offers an exceptional existentialist answer (three years later) to Elia Kazan's more conservative \"On The Waterfront.\" While \"Waterfront\" benefited immensely from an electrifying Marlon Brando, who inadvertently disguised Kazan's offensive theme of trying to justify naming names (as Kazan did eagerly before the House Un-American Activities Committee), \"Edge of the City\" boasts a young John Cassavetes and an upstart Sidney Poitier daring to confront issues that \"Waterfront\" failed to acknowledge, namely, workers' rights and race relations.\"Edge of the City\" boldly dives into this (then) unknown territory, and although the quite appealing black protagonist (Poitier) may seem a bit Hollywood simplistic, the courageous struggle against thinly-veiled bigotry and violence has hardly aged at all. One wonders how shocked initial 1957 moviegoers were at such a bold presentation of white-black relations (if some of the bigoted didn't leave the theater early, they must of left dumbfounded, if not offended). The last reel of the film will still surprise audiences, as it refuses to sink into expected clichés, including those that tainted \"Waterfront.\" While both films climax with a fight in front of stunned workers, director Ritt avoids the tiddy simplicity of Kazan's ratonalizied ending. Only the most jaded viewers will not realize \"Edge\" remains such a radical and entertaining film.What's most disturbing about this lost classic: how it sadly stayed unavailable on any format, for reasons that remain quite cloudy until it surfaced in a Sidney Poitier compilation in late 2008. This film should be required viewing in high school or college history classes across the country, yet one can only find it on obscure late-night TV, if ever at all.","Alex North (John Cassavetes) has problems in relationship with his father and flees home to join the army, from where he very soon deserts and comes to New York intending to start a new life, using as an advantage the fact that nobody knows about his past. He finds a job at the Waterfront, where he meets Tommy Tyler (Sydney Poitier) a lively young man, who is happily married and is a living contrast to Cassavetes' sad and unhappy character. They very quickly become good friends and Tommy does his best to help his friend. The only problem is that their superior at work, a tough worker Charles Malik (Jack Warden) is sort of envious of their friendship as well as Tommy's constant happy disposition and success in personal life. He really manages to make their life difficult when he comes to know the truth about Alex's past.   A good drama skillfully directed by Academy Award nominated director-producer Martin Ritt (The Hud) and featuring wonderful performances from Sydney Poitier and Jack Warden. 7/10","1957's Edge of the City, directed by Martin Ritt, stars John Cassavetes, Sidney Poitier, Jack Warden and Ruby Dee. It's the story of a troubled man, Axel, who has a mysterious past that gradually comes out during the film. He has a connection that gets him a job on a loading dock working for Charlie (Jack Warden), a real meanie who takes kickbacks from his workers and rides them hard. Charlie has an intense dislike for a black man, T.T. (Poitier) who holds the same position. T.T. invites Axel to work on his team; Axel defies Charlie and does so. Axel finds a place to live and socializes with T.T., his his wife (Dee) and their son's white schoolteacher (Kathleen McGuire). When tragedy strikes, none of the men on the loading dock will talk to the police, and Axel has to come to grips with his values, what he stands for, and the meaning of friendship.This is a really excellent black and white film that curiously isn't really about being black or white! It's really about the limits one puts on oneself and knowing who you are. Charlie is a bigot and hates that a black man has a good position on the dock. T.T. teases Charlie and gives as good as he gets. There's no discussion of T.T. and Axel spending time together or of T.T.'s son having a white teacher with whom the family also socializes. What Axel, a loner, finds difficult is accepting any friendship or confiding in anyone - these things he learns through T.T.Poitier absolutely shines in \"Edge of the City\" - he's warm, energetic, loving and smart, a man with a real enthusiasm for life, afraid of nothing. Cassavetes is excellent and plays a character totally opposite - hiding in the shadows, chronically depressed and always nervous.The film leaves open what happens to Axel. Whatever does, he's a different man now.Strangely underrated and unknown film, possibly in the shadow of a lot of the angry young men films that came out in that era.","\"Edge of the City\" is another movie that owes a lot of credit to \"On the Waterfront\".  From it's NYC locations, to its score, to the belief that whatever trouble you may be in, you can somehow right your wrongs.\"Edge\" also deals with ideas like loyalty and racism.  In my opinion, that is where the movie does not succeed like \"Waterfront\".  At 85 minutes the movie rushes through the establishment of relationships, and ties everything up so quickly that much of it seems forced and unbelievable.Possible Spoilers****The relationship between Sidney Poitier and John Cassavettes could have been further developed in the beginning. I don't believe that these two characters, from two very different places would have built such a strong relationship so quickly. I think that the whole love sub-plot with Cassavettes could have been eliminated. He is so awkward with a woman that it becomes painful to watch. The only reason why it is in the movie is so that she can motivate him to do the right thing at the end. There are other ways that they could have shown this.  I would have also liked to see some scenes of Axel in the army to illustrate why he is the way he is.The acting is excellent. Poitier is terrific in a role that is beautifully written. His role as Tyler is interesting and multi-layered, and (especially for 1957), a man who is confident, respected, and intelligent. Cassavettes, as Axel North, while very good, does not seem quite right for the part. Warden is terrific as the boss who knows Axel's secret (although his fight scene with Cassavettes at the end is staged horribly. Too many break-away boxes).  I thought Ruby Dee was wonderful in role of Poitier's wife.On the whole, \"Edge of the City\" is a smart, movie with a very good cast that tries too hard to be an interesting noir style picture, without taking the time to let the drama build.7 out of 10","John Cassavetes is on the run from the law. He is at the bottom of the heap. He sees Negro Sidney Poitier as his equal and they quickly become friends, forming a sort of alliance against a bully of a foreman played by Jack Warden.As someone who has worked in a warehouse myself when I was younger, I can tell you that the warehouse fights, complete with tumbling packing cases and flailing grappling hooks are as realistic as it gets. I've been in fights like these myself, although no one got killed.The introduction of Sidney Poitier's widow is a variation on Shakespeare's Shylock \"Do I not bleed?\" This is an anti racist film, which, at the time, was much needed.All the three principle characters - Warden, Cassavetes and Poitier - are superb, with Warden the most outstanding of the three.","I cry at a lot of movies. Call me sentimental. Call me one of those viewers who always likes to see a happy ending. This movie, though it has a sad ending, was great! Of all of the actors that I would love to have lunch with, it would be Sidney Poitier. His acting, along with John Cassavetes and Jack Warden (of 12 Angry Men fame)is stellar. His character, who befriends a man on the run (Cassavetes) and helps him out in every way possible is incredible.This is another one of those forgotten noirs made during the end of the noirish era. It is well done, has a superb cast, extremely talented acting, and great cinematography. It is a film worth watching over and over again. I highly recommend this one! This is just another truly great film done by Mr. Poitier and should be sold on DVD. Even though I cried, kudos to such great art!","This is an excellent movie that tackles the issue of racism in a delicate and balanced way. Great performances all round but absolutely outstanding acting by Sidney Poitier.He makes this movie breathe and alive. His portrayal of a guy who struggles against discrimination and violence is simply mind blowing. His acting is forceful and delicate and subtle at the same time. Truly worthy of an Oscar, Poitier had to wait (because of his skin colour) for many more years before the sheer brilliance of his acting was recognised by the Academy.Cassavetes turns in a great performance too, withdrawn, troubled and realistic as it has become his hallmark. He and Poitier contrast inimitably the forces of cowardice, courage and human transformation through friendship.The movie is enjoyable and at the same time deeply haunting in its portrayal of racism in the US. The irony is that it somehow mirrors the realities under which Poitier had to work.","This is one of Cassavetes' best performances.  The entire cast is outstanding, as is Martin Ritt's sublimely understated direction. The anger, angst, and desparation of urban labor battles is magnificently told in a fashion that is neither obtrusive nor patronizing.  In a way it is dated with its era, but in many ways, it is gloriously timeless.","I really liked this film--mostly because the acting and dialog was so good. So, while much of the film is very quiet and the plot somewhat normal by movie standards, it's a wonderful example of a film that is a showcase for the actors.John Cassavetes plays a disaffected young man. He's failed many times in the past and expects to keep failing when he comes looking for a job as a longshoreman. At first, he's taken under the wings of a cruel jerk (Jack Warden)--who exploits him and is a bully. But, a particularly kind man at the job (Sidney Poitier) takes him on in his work crew--and the two become fast friends. But there still is the bully to deal with--as well as Cassavetes' dark secret. See this film.I really liked the relationship between Poitier and Cassavetes because it was NOT played as an interracial relationship but just as two friends. There was no obvious or overt message about racial brotherhood--but simply by the casting it made a great point. Well done all around, though I was a bit disappointed by the exciting ending, as, if you think about it, it doesn't make a lot of sense (Cassavetes could have just gone to the police--and that would have been a lot more logical). Still, it's got a heck of a punch.","John Cassavetes plays Axel Nordmann who, AWOL from the U.S. Army, gets a job as a New York City dockworker. In short order he becomes friends with Tommy Tyler (Sidney Poitier), a foreman on the dock. Tommy is happily married to Lucy (Ruby Dee) and they have a cute young boy. Into this mix is put Charles Malik (Jack Warden), a corrupt and vindictive foreman, who has a contentious relationship with both Tommy and Axel.I liked the black and white photography, but I found the characterizations to be too black and white. For a foreman having to deal with the frictions at the dock Tommy has an unrealistically sunny and cheerful disposition - life just couldn't be better for him. Sidney Poitier turns in a fine performance, but Tommy's character was just too irreproachably good for me. I found Cassavetes to be wooden in his portrayal of the confused Axel who has a problem with authority, stemming from his relationship with his father. Warden is fine as the consistently mean-spirited Malik and Dee shines in her few appearances.I was bothered by many inconsistencies. In a phone conversation with his parents at the beginning of the movie Axel's father is so irritated with his son that he doesn't even want to talk with him and encourages his wife not to take the call. Then toward the end, his father falls all over himself begging his son to come home, telling him that he is all that he and his wife have. Tommy's wife tells Axel that she is so happy that he and Tommy are friends, since Tommy didn't have any friends. But if Tommy, as portrayed, was such an outgoing friendly guy, it is hard to imagine that he did not have any friends. The whole racism issue, central to the plot, comes out of nowhere toward the end. In his relationship with his love interest Ellen, Axel behaves like an awkward teenager - could he really be that naive? The scenes between him and Ellen are embarrassing. For the life of me I could not figure out what it was about Axel that Tommy and Ellen felt so immediately drawn to? The fight scene between Tommy and Malik was intense and riveting, but then the final fight scene I found to be staged and difficult to believe.The music is overly dramatic.One cannot see this movie without comparing it with \"On the Waterfront,\" and judging it to be a derivative work. Credit must be given to \"Edge of the City\" for taking on the issue of racism in an era when that was being swept under the rug, and it does not shy from an ending that probably would not have played well with focus groups had such existed then. But \"Waterfront\" deals with corruption in more detail and is all round a vastly superior movie in my opinion.","This is a powerful film which seems to have never re-arisen after the Joe McCarthy censorship period. It influenced me as a Jewish teen-ager who had friends of various colors and whose father's family had suffered under the Fascist regimes in Europe during the second quarter of the Twentieth Century. Unlike the later rip-off, \"On The Waterfront\" which seemed to take some of the same themes and twist them to fit the enforced Hollywood political correctness of the time, it told its story direct and with respect for the characters and for the reality it fictionally reflected. It was an antidote to \"Gone With the Wind\", \"Birth of a Nation\", \"Triumph of the Will\" and so many other glorifiers of hatred and violence. I would place it alongside the recent German film (also virtually hidden in the US), \"Rosenstrasse.\"I remember that the TV version, also black and white in format as well as story, was blacked out by some stations because the black hero's wife appeared white. As a young civil rights worker, it produced a conflict for me because on the one hand I was opposed to smoking cigarettes and on the other opposed the boycott in Georgia of a sponsor of the TV show, a major tobacco company (I no longer remember which one -- does anyone else?).I would love to find a CD of either the film or the TV show to let my sons see something that informed my opposition to racism universally (as opposed to only fighting racism against Jews) and recognition of the inherent connection between racism and militarism.","This is a great movie. a real classic Poiter movie. I just saw it for the first time on TCM. I loved it from the start to end. One of the best movies made in the 1950's USA. Same league as The Blackboard Jungle,King Creole,Giant. Sidney poiter and John Cassavetes are just great as good friends and they have some trouble with Jack Warden. Later on Jack Warden kills off Poiter and people think he will get away with it. The end of the movie is just perfect and unespected. If you get the chance,SEE IT!!!! Sidney Poiter is as good here as he was in In The Heat Of The Night and Guess Who Comes To Dinner. This is a real classic. More movies like this on tv please.","Back in 1957, I was 21 at the time, and working in a similar enviorment, with trucks in front for loading and unloading, and freight cars in rear also. All that seemed right on. Yes, some guys/bosses can be nasty. Plus I also had a good buddy who was a driver/laborer. He also was black. I'm white. One of the best friends I ever had. We got along the same way as Poitier/Cassavetes.","For years, I had wanted to see this movie but I didn't find it in any video stores nor see any listings on TV schedules in whatever local paper I was reading. So when I found it was available on DVD from Netflix, I made an order. I just watched it with my mom, who hadn't seen it before, and we both were enthralled by the drama about John Cassavetes, a loner with a troubled past, who gets a job on the docks. He meets a couple of coworkers there: Jack Warden who doesn't seem to like him and Sidney Poitier, who does. Warden also doesn't seem to like Poitier and it doesn't take long figure out why but it's a while before things come to a head. Anyway, this was quite a compelling drama as directed by Martin Ritt with fine supporting turns by Kathleen Maguire, Estelle Hemsley, and Ruby Dee as Poitier's wife especially when she confronts Cassavetes near the end. So on that note, I highly recommend Edge of the City.","I first saw this film on cable in the 80's and it rocked me to the core. It showed up again on TV about six months ago.Filmed on location, the black and white cinematography graphically portrays 1950's New York as the gritty \"urban jungle\" at a time when there was far more industry and port activity in the city, particularly in Manhattan.John Cassavetes always brought a special intensity to his acting, and is magnificent in the role of the army dodger. His brief 1959 TV series \"Johnny Staccato\" is also a joy to watch.Sidney Poitier and (later in the film) Ruby Dee bring freshness and vitality to their roles. But it is Jack Warden's superb acting as the vicious, brutal shift boss that grabbed my attention. To get an idea of Warden's versatility, watch this film, then check out a 1962 episode of the TV series \"Naked City\" entitled \"Specter of the Rose Street Gang (available on video).\" If you are a fan of film noir, this is a must see. Enjoy!","This first movie by Martin Ritt can be seen as a work against racism.In several respects ,it is,but it's much more: it's the story of a loser (Cassavetes) ,who is through with his family (his father could not forgive him the accidental death of his brother) ,with the establishment (he is a deserter) and with the men in general.He places his trust in Tommy Tyler (Toto;Sidney Poitier),a black man,whose life is not rosy though .The price to pay to regain self-confidence will be very high.Filmed in black and white ,\"edge of the city\" takes place in a working-class milieu,which is rare in the world of cinema.Martin Ritt was a director whose social concerns continued on many of the works of his career: unions in \"Norma Rae\" ,education in \"Conrack\" ,illiteracy in \"Stanley and Iris\" ,racism in \"Paris Blues \" -but in this latter movie, Ritt was very naive when he thought that France was a country where racism did not exist-,all these subjects are hinted at in \"edge of the city\".","This is clearly a dramatic film representative of the stylistic period films being made in the 1950's. This was director Martin Ritt's first attempt at delivering a feature film for Hollywood after first tinkering with a few television episodes for various TV series such as Somerset Maugham TV Theatre, and Starlight Theatre. Obviously director Martin Ritt was fortunate that his feature film debut starred two (2) great lead actors such as John Cassavetes, and Sidney Poitier. Subsequent to the mainstream success of this film shot in Harlem New York, Martin Ritt went on to a four (4) decade career directing many other acclaimed films starring a long list of Academy Award winner actors and actresses. I enjoy a good black and white film and I truly wish other producers would consider this style format. If you recall it worked well back in 2011 for Academy Award Best Picture \"The Artist\". Edge of the City was filmed in Harlem New York and evolves around the new found friendship between the happy go lucky African American Tommy Tyler played by Sidney Poitier, whose friends simply called him TT or T. Tommy is a crew leader on the docks where he is in a constant battle with another racist dock crew leader named Charlie Malick, played by Jack Warden. When the desperate newcomer Axel Nordmann (played by John Cassavettes) naively joins the con man Charlie Malick's crew, Axel realizes rather quickly how racist and selfish his crew leader is, as well as being the biggest bully on the docks.The film evolves into the push and pull friendship between Tommy and Axel, as Tommy continues to push Axel into sharing Axel's obvious fears and deepest secrets with Tommy. Axel pushes Tommy away as he feels the only one he could ever trust was his deceased older brother, who Axel feels responsible for his brothers unexpected death. The demons that Axel eventually shares with his new best friend Tommy are issues that many other men (and women) can relate to as they revolve around Axel's estranged relationship with his parents and how his current circumstances and potential future prosecution relate to Axel attempting to make his father proud.The films ending is not as heroic, nor as vindicating and uplifting as lets say the 1976 Academy Award winning Rocky films ending was but Edge of the City is filled with superior acting by the film stars John Cassavetes, and Sidney Poitier, as well as supporting performances by Jack Warden, Kathleen Maguire, and a young Ruby Dee.I enjoyed this dramatic 1957 film and I felt both the acting and directing were superb and why this film is so relevant for the time and yet still timeless messages for today's youth.I give the film a 7/10 rating","\"Edge of the City\" casts Sidney Poitier as a warehouse worker who befriends John Cassavetes' troubled loner. His ready laugh and casual manner belie a character of depth and fortitude. As Tommy Tyler, Poitier exudes kindness and grace, even as Jack Warden's Charlie tries to bully and intimidate him. Cassavetes was skeptical of Lee Strasberg's Method by 1957, and he plays it fast and loose as Axel, an Army deserter who cannot find his place in the world. \"Edge\" spends a considerable amount of time showing these two characters at work in a warehouse, and the incidents of harassment and horseplay ring equally true to anyone who has done time in the world of unskilled blue-collar labor. This is the first feature film directed by Martin Ritt, and the themes of male bonding (Hud) and workplace injustice (Norma Rae) are ones he would revisit during his illustrious career. Exemplary cinematography by Joseph C. Brun, and observant writing by Robert Alan Aurthur add to the verisimilitude of this examination of the everyday existence of men who toil anonymously in the background of urban life.\"You go with the lower forms, and you are down in the slime.\"","A gritty look at New York City and dock workers. This is a classic film, realistic, brutal at times, always believable. It was originally shown LIVE on tv,also starring Sidney Poitier. John Cassavetes was a fantastic director and actor.","In the book 'Cassavetes on Cassavetes' (or as close to an autobiography we have of him, which is an interview with film professor Ray Carney), Cassavetes mentions that before Faces the only two films he had anything to do with that he was proud of were Shadows- which, naturally, was his first feature and one of the few cinematic examples of something like jazz (true improv)- and this film, Edge of the City.Maybe it was due to the subject matter, being about something simple (two guys from different backgrounds working as longshoreman who become friends just based on getting along and mutual trust and respect) with the more 'topical' stuff (racism, class) being secondary. Or it was because it's a film much like On the Waterfront that gives its characters room to have realism unlike melodramas of the past? Or it's just cause he's that damn good in the film, and knew it while making it.A scene early on with Axel North (real name Axel Nordman), who seems adrift in the night in New York City and calls up his parents who are in Indiana (though we don't know what at the time), seems to indicate what Cassavetes might have found in the project so worthwhile. Here he gets to behave moreso than traditionally \"act\", which is like being himself.In this scene with the phone call he covers the phone receiver and speaks, but no one on the other end can hear him, and it's a very sad and tense exchange of words as the son can hear but the parents cannot. It's a scene like this that shows Cassavetes in a sensitive moment, vulnerable, which helps a great deal once he's set against the man he works for, the brutish and unsubtle racist Charles (Jack Warden). Luckily at the job he meets an upstanding guy, Tommy, played by Sidney Poitier, and the two become close friends almost by chance (Tommy trying to get closer and closer to the sorta sky Axel).Seeing these two actors together, and how well they're able to work with the natural dialog by Robert Alan Arthur that allows them to speak more like regular people from the period than like movie characters, is what really makes this movie. Some of the story gets a little far-fetched in the third act (how simply a key character is laid to waste in a fight), but director Martin Ritt never loses sight of how Poitier and Cassavetes behave around each other.One is more reserved (and for good reason, being a war deserter and with a bad secret from his past with his younger brother, \"the only person I ever loved\"), and one more outgoing in his friendliness (Tommy being a guy who likes to hang out, talk, romance with the ladies). And for the time period it set an example that other films needed to try and steer towards: not being overtly anti-racism, though the film has some of that, but just showing clearly how people can get along, as people. Poitier would a year later try a little more for this in The Defiant Ones.Watching Cassavetes is also a key to the film's success; when he tells Poitier the story about his brother, suddenly the film slows down from the pace it has when Tommy is in charge of the conversation as a warmhearted (if sometimes pushy) kind of guy. It's a story that allows Cassavetes room as an actor, the kind which would probably influence him with his own actors. Also another scene that displays how generous he could be and how spot-on (or just effortless) his timing was is when he talks with the girl Tommy tries to set Axel up with, played by Kathleen Maguire. He seems so out of the loop of it, but as a genuine and nice guy he's able to connect with her. As an actor he also lets us know how messed up Axel really is, sometimes without having to say anything - just a look would do, though Tommy sometimes asks for more. And in the last act, it gets to a point that has some of the finest work Cassavetes ever did.Ritt understands how this world works, how people can either get along together, or not as the case with Jack Warden. He seems to be such a SOB, kind of like Lee J. Cobb in Waterfront only less of a higher-up kind of guy. Even he as a cartoonish villain comes off genuine in how he reacts to things. It says a lot when a director can get a one 1/2 dimensional character to seem convincing. Edge of the City has that, as a kind of character-driven noir film.","In Edge of the City, John Cassavetes is a drifter and clearly on the run. He telephones his parents at the start of the film, but as his mother Ruth White begs her son to speak to her or tell her where he is, he puts his hand over the receiver and gives her silence. It's a very heartbreaking scene because he does talk to her, but she isn't able to hear him through the muted mouthpiece. He gets a job on the docks, but his boss Jack Warden is mean and unfair. All the fellow workers have learned to look the other way, even when he race-baits Sidney Poitier, the only man who befriends John.Sidney Poitier is extremely nice, tolerant, and forgiving of his new friend, and he and his wife Ruby Dee go out of their way to help John fit in. They even set him up with their classy friend Kathleen Maguire, who is clearly out of his league. As I watched the first half of the film, I felt a little frustrated. John Cassavetes wasn't nearly as likable as Sidney Poitier, yet he was the protagonist. Why wasn't the entire movie about Sidney? I didn't care what happened to John at all! Then I realized that Robert Alan Arthur had written his script that way on purpose, and I watched the second half of the film in full enjoyment.Arthur wrote and directed a very powerful film, one that evokes a range of emotion from its viewers. Once you realize and accept that John isn't likable and Sidney is, you'll get swept away in the plot and growth of the characters. Even though you don't really care about John, since Sidney cares so much about him, he convinces you to slowly start rooting for him. The shift is slight and steady, but it's a very rare and fantastic quality. Usually, when watching a film, you're aware of the beginning, middle, and end, but in Edge of the City, the beginning drags, the middle is immersive, and the end comes too soon. Depending on how drained you feel you might want to watch it again, but there are some heavy and emotional elements to the story.Kiddy Warning: Obviously, you have control over your own children. However, due to some violence I wouldn't let my kids watch it.","a real hoot, unintentionally. sidney portier's character is so sweet and lovable you want to smack him. nothing about this movie rings true. and it's boring to boot."],"review-user":["bkoganbing","edwagreen","soundslike","reyobllib","IlyaMauter","blanche-2","alfiefamily","loza-1","grasshopper54","kaehnea","the_old_roman","MartinHafer","bandw","ZAelonyRep","c.andersson","ringo-37","tavm","JAtheDJ","dbdumonteil","Ed-Shullivan","raymond_chandler","moggy-4","MisterWhiplash","HotToastyRag","yrral-3"],"review-date":["16 May 2008","15 December 2006","26 January 2005","25 December 2005","7 May 2003","3 August 2008","6 August 2004","1 July 2005","21 January 2008","28 January 2006","26 August 2001","27 March 2011","18 September 2006","9 October 2005","10 February 2003","4 August 2002","17 March 2014","20 July 2006","9 August 2008","30 November 2017","4 September 2015","12 August 2001","12 November 2014","12 November 2017","16 July 1999"],"review-rating":["8","8","8","7","8","7","7","10","9","10","8","6","10","8","10","7","8","9","9","7","1"],"review-title":[" The Code Of The Docks\n"," Edge of the City Keeps You on Edge ***\n"," better review\n"," A Lost Classic: Edge of the City\n"," Sydney Poitier steals the show\n"," Excellent film, shades of On the Waterfront\n"," Interesting story, good performances\n"," Terrific Warehouse Fights\n"," Wow!\n"," excellent movie with formidable performances\n"," Underrated powerhouse of a movie\n"," Exceptional but the ending was a tad weak.\n"," Marred by inconsistencies\n"," Influenced as a teen-ager by this film & TV version \"Ten Feet Tall\"\n"," A classic 1950's movie with the great Sidney Poiter.\n"," Brings back old times\n"," John Cassavetes and Sidney Poitier lead a fine cast in the drama Edge of the City\n"," A brilliant film noir\n"," A branded man\n"," Great acting by Sidney Poitier and John Cassavetes\n"," The Warehouse of Broken Dreams Stands on the Edge of the City\n"," another great , real drama from Cassavetes\n"," one of Casssavetes' triumphs as an actor\n"," Well-paced, well-written drama\n"," it's hard to believe this is considered a good movie\n"]}