{"review-url":["http://www.imdb.com/title/tt0070337/reviews"],"review-text":["While the songs and dance numbers, in general, aren't as strong as many would have them be, the film's storyline and message are still there and ring out loudly above the simple 70s-style musical numbers. \nKeeping in mind that this film was made after the Hollywood Musical had nearly died out (with few exceptions being rock musicals), the audiences that went to see it new didn't appreciate the fact that it was a brave attempt at something that hadn't been done to date.  Audiences that see it today will tend to judge it against the films and musicals of today and, perhaps, the huge all-star casts of musicals gone past.  But to do that to this film, or any for that matter, is an injustice to the film itself.\nThere are some good musical moments in the film.  The first is that of Bobby Van.  Mr. Van took his role of Harry Lovett just after closing a 2 year Tony nominated (for best actor) run of the Broadway revival, \"No, No, Nanette.\" He is a song-and-dance-man from way back and, honestly, the only one in the cast that was truly talented and experienced for musicals.  He never misses a step in his \"Question Me An Answer\" and rightly so ... he was totally at home as Harry.  Other pleasant numbers are done by Olivia Hussey when she welcomes the new visitors and while the lyrics are weak, James Shigeta shows his strong voice in the \"Family\" song, as well as a nicely done staging of the full piece.View the film for what it is ... a fantasy about a place where you never grow old, hidden in the ice and snow covered mountains of Tibet, found by a group of unsuspecting modern-day people wrapped up in the strife of any modern culture.  Take this and compare it to reality and you get a film that falls short of a goal.  But ... take this film for the message of love and peace and tranquility and brotherly love and you get a warm and refreshing message and a positive one at that.To some this film may seem corny to others a welcomed release from the hectic pace of reality.  To the first, try to not judge and just enjoy the message.  To the second, you have discovered the secret of Shangri-La!","I have a confession to make.....in August 1974 I re-opened an old cinema and this was the premiere attraction. The sound gargled away from behind the flabby screen and the invited audience sat on the lumpy seats. I looked like Top Cat in a tuxedo, and this film unfolded across the joins on our cinemascope presentation. What a night! Unforgettable in its mangy charm and an intro into the glamorous world of second rate showbiz to which I am still magnetized today. As a result I have a special place in my heart for this gloriously awful musical. All I can say was that the opening night crowd fled into the darkness after the last reel flapped off the projector. Some even promised to return and asked what was on next week: \"MAME ...with Lucy\" I grinned as I locked the door. Somehow the business survived and I even got to showcase AT LONG LAST LOVE the next year. LOST HORIZON was quite successful in Australia and was first released in Sydney as presented in 70mm for 13 weeks.... families liked it and for a while it was considered the sort of Brady Bunch family sort of musical. I just wanted to open my crummy seaside cinema with something nice. So I did and thank Neptune the locals forgave me. I deliciously look forward to the DVD release with the infamous deleted scenes, especially the legendary diaper dance with the guys swinging teapots and extended versions of Bobby Van leaping about with Liv Ullman. Am I correct in believing this was Ross Hunter's last production?","Much better than it is generally given credit for, this version of \"Lost Horizon\" not only had great music and beautiful scenery, but also some stunning mountain photography. A special edition laser disc was released some years ago which added more than 30 minutes of previously deleted material, extra music, and lots of bonus material. So why isn't this on DVD?! Hard to figure the studios out sometimes. Certainly the roles could have been given to people who could sing better than Peter Finch, Liv Ullman, George Kennedy and Sally Kellerman, but what do you want in a movie, good acting or melodious pipes? Song and dance man Bobby Van is great fun, Michael York is a suitably tragic villain, and seeing Sir John Gielgud decked out as Chang may sound silly but actually works very well on screen. Trust me, you need to check this movie out - if you can find it!","This movie is one on the forgotten musicals. The Burt Bacharach-Hal David music alone is worth the price of the film. Almost all reviewers say it is a bomb, but after seeing it three times it grows on you. The music is TERIFFIC!","I was 19 or 20, years old at the time and living in Salt Lake City, Utah and I still remember the new dome theater, called the century 21. Layback chairs that rocked and a new sound system, large screen and huge open space between the screen and the packed theater. We felt all the excitement of a new preview screening of a film. Ta da da daa da ta da dada dada... I can still hear the opening music ringing trumpet and the crash of cymbals. I loved the interplay of characters and the filmed vistas. I know Peter Finch and Luv and Sally had some trouble with the lip-sink but hey, this was a feel good, go feel better about things film! What I regret is the way they cut the meaningful heart out of it, showed the cut version and then called it a flop. I saw the cut version and I can see it lost its view of the vision it had in the preview edition. Yes I wince a bit at Peter's effort to make love through music but, you know I didn't see it that way when I left the theater. when they surveyed us as we left I regret any comment I made that may have altered the original. I liked it then and still see it while I listen to the music on my LP. Most of my family has heard me sing much of the sound track and I can use the films monologues in our games of \"what movie is this\". I wish a director's cut on DVD was available. It is available on VHS but its not quite the same. I would particularly like a full serious lord of the rings style commentary about its origins, struggles and triumphs. Picky people should leave things well enough alone. Bring it back!!!!","A huge cast gathered for this remake which sadly was a box office failure notwithstanding a great sound track. I can't say it was riveting entertainment, nor a cure for insomnia. Nevertheless I enjoyed the film - it provided the escape I was after one afternoon. A good look for those of us looking for the ideal life, albeit a fantasy. Expect some corny moments, few thrills, and an occasional laugh.","As Bette Midler used to say, \"I never miss a Liv Ullman musical\". Here is a film which attempts to inspire and uplift, and I guess it succeeds, if for reasons quite different from those intended.Unless they attempt a musical version of \"Schindler's List\" this will probably be the all time champion in the \"Play it straight\" stakes. James Hilton's novella, heaven knows, was a piece of fluff which tantalised rather than explored its themes. The 1937 film was a winner because, hey, what Frank Capra film in the '30s wasn't?But if we had to have a musical version, wouldn't it have been a good idea to hire a couple of musical stars?! Okay, at a push Bobby Van passes muster, and thank God that he's meant to be that annoying, because after five minutes the idea of him being lost in a snowdrift seemed eminently satisfying. But as for the rest - George Kennedy, Peter Finch, Sally Kellermann, John Gielgud, Olivia Hussey - well we aren't going to see them in a revival of \"42nd Street\" now are we? My favourite definitely has to be Kellermann and Hussey thumping around a library, the former looking bored, the latter very pregnant, singing what seems to be a 70s New Age version of the \"Green Acres\" theme.But its Liv who suffers most. Swinging those bovine limbs of hers, singing some nonsense about the world being a circle which never ends - an apt description of the song - she seems light years away from Bergman. Actually she bears a striking resemblance to Bill Clinton in some of her long shots.Only Michael York emerges with any credibilty. And that's mainly because his character keeps nagging everybody to run away. And who could blame him?","Usually when a film is hailed as the above description, it has to be considered watchable enough to enjoy the film's ineptitude. Some films like this are bad, but to watch them would be asking a whole lot of the viewer. LOST HORIZON certainly does not fit that last description because while CITIZEN KANE it is not, it certainly does not deserve to be trashed.By the time LOST HORIZON came along, the movie musical was already considered a dead genre, save for the occasional import from Broadway that actually turned out well (OLIVER! & CABARET come immediately to mind). However, the age of the musical where songs were written especially for the movie had long been buried. That did not matter to producer Ross Hunter, who always was a safeguard of Old Hollywood even after the advent of the MPAA allowed for movies to be made of subjects that the studios would not have touched with a ten-foot pole. Hunter may have succeeded in bringing back old-fashioned soap operas with the Douglas Sirk movies, but as THOROUGHLY MODERN MILLIE showed with its original songs that paled in comparison to the classics it stood alongside (well, almost), the musical was perhaps not a genre in need of a revival.You certainly could have fooled Hunter, who went full-steam ahead with his musicalization of a property that should have been left alone to begin with. Casting actors with little to no musical training & badly dubbing them was bad enough, but choosing a project that worked best in its original format was double trouble. That is certainly not to fault Burt Bacharach & Hal David's music, which is fine enough, though certainly not up to par with their Dionne Warwick spectaculars. But you get the idea that maybe even they were doubtful of this project's bankability. Supposedly the film led to the break-up of their previously infallible partnership, as well as Hunter's film career (he mostly worked for TV afterwards).Apparently, Hollywood likes to keep its megaflops very secret because LOST HORIZON has not been seen much since its theatrical debut, and has not even made it onto VHS, let alone DVD in the U.S. (I found my copy courtesy of eBay). But if even Ed Wood's hilariously bad movies can be released & enjoyed by people even for all the wrong reasons, then certainly LOST HORIZON can. So I hope that Columbia Pictures can find it in their hearts to bring this movie back into circulation so we can enjoy it (even genuinely because it appears some people actually did). Heck, if only for the camp value, it would be a surefire hit. With CHICAGO & MOULIN ROUGE having indicated the musical is making a comeback, then it would be good to have LOST HORIZON out on the market again to educate people in how not to make one. But it sure is hell of a lot of fun along the way.","I watched this film when I was a young girl in Taipei, Taiwan.  I loved the film!  From the wonderful cast, to the scenery and the musical scores!  It has stuck with me throughout the years as being one of my favorites.  My sister and I had the sound track and played it all the time during our teenage years.  If I had it today, I would still play it.","Ross Hunter's musical remake of the 1937 fantasy, based on James Hilton's enduring bestseller, was written off by critics and audiences almost immediately in 1973, sounding off a backlash against musicals in general that gave the genre a bad reputation in Hollywood for decades. Group of disparate British and American individuals end up on an emergency flight out of a war-torn Asian country, but their plane is hijacked and crashes in a snowy mountain terrain; a rescue party arrives and leads the group to an isolated community called Shangri-La, where the sun is always shining and most of the residents are youthful and blissfully content. Some of the performances by the classy cast aren't so classy (the effervescent mood of the piece, the lilting Burt Bacharach-Hal David tunes, as well as the lightweight direction all conspire to make the performers look just a bit silly). Peter Finch is the international peace keeper who becomes involved in a somewhat constipated romance with resident Liv Ullmann; Sally Kellerman is a malcontent photographer who spits out lines like, \"I got tired of taking pictures of people with their heads blown off, so that people with their heads STILL ON--and usually under hairdryers--could get one last kick before turning to the nearest recipe\"; John Gieguld, \"as Chang\", is curiously cast as an Asian factotum for the High Lama who learned to speak English while attending Oxford (but why no songs for Chang?); while Bobby Van, as a USO entertainer, soft-shoes his way into the hearts of the Shangri-La schoolchildren. Hal David's nonsensical lyrics are sometimes jaw-dropping, and the pacing gets bogged down with all that talk about the outside world and how nothing is more pitiful today. However, the production is lush and the general handling strangely affecting. The two-dimensional characters are so overly serious they actually become endearing, and the movie's silliness is infectious. It ends up being a lot of fun. *** from ****","I don't see that much wrong with this movie.  Granted, the principal singers might not be Luciano Pavarotti and Maria Callas, but they can certainly carry a tune.  Burt Bacharach and Hal David are talented songwriters and I happen to love their songs, especially \"The World Is A Circle\", \"The Things That I Will Not Miss\", and \"Question Me An Answer\".  Some people claim that Hermes Pan's choreography is ghastly and that the snowy mountain sets look as if they were made of plastic; I disagree on both counts.  I've seen powdered snow before and the snow in those mountain scenes looked realistic to me.  And most of all, in this film's defense, it is appropriate for a family audience (at least I remember it being that way when I saw it on Christmas Day a few years ago.)  With all the outcry over sex and violence in the cinema these days, I find it refreshing to note that this film deserves its G-rating.  And they don't say that naughty \"F\" word every ten minutes like some films I've seen.  Thank God.  So although this film may not be everyone's cup of tea, it does have some redeeming value and I give it ten points out of a possible ten.  That's my story and I'm sticking to it.","I came across this moldy on AMC and was riveted!  Suddenly I was taken back to my grade school years where I was forced to sing an ever so cheesy \"The World is a Circle\"!  For the first time in years I'm seeing and hearing where these rediculous tunes from my youth have come from - and loved it. John Geilgud's perpetual grin and his pointy-head costumes had me in stitches.  Not to mention some truly silly dance numbers AND a cast including actor extraordinaire George Kennedy!  What's not to love? View it for what it is - guilty pleasured silliness.","There are two groups of people in the world: those who love this 1973 remake of \"Lost Horizon\" and those who are lucky to escape with their lives if caught in a theater with a majority from the first group. There is no in between. Either you accept polar bears rumbling about the Himalayas and designer caps propped jauntily aside the head during treks at the Roof of the World, or you don't. The classic \"Lost Horizon\" asked the viewer to suspend belief in the hope of something better. This \"Lost Horizon\" makes the viewer appreciate what he's already got... no clubfooted school teachers snaking about with obnoxious children; no litter-lugging sherpas chanting \"living together, loving together\" to a couple undoubtedly more anxious to get on with the latter than the former; and no English lords moonlighting as high lamas.\nDo not let anyone persuade you not to see this movie. Like wearing purple and eating more ice cream than beans, it is a required rite of passage before leaving this veil of tears. Which, I guarantee you will have in abundance, no matter into which of the two groups you fall.","What makes a musical, is the music. The music in this is excellent. Burt Bacharach and Hal David seldom miss and here they hit on every song. Reflections, The World is a Circle and I Might Frighten Her Away being great songs and routines. I recall, this movie bombed, was panned, by fan and critic alike, when it came out. At the time, the 70's, musicals were not a hot topic. Unless you were making a gritty, realistic, musical, like Cabaret, you were going against the grain. Dancing and prancing people seemed strange in this time of Easy Rider, Midnight Cowboy and grittier films of the era. The movie was mistimed to be sure, because there isn't anything more ridiculous in this, than any of the great musicals of years past, be it prancing, knife wielding, gang members, to store clerks, to lions, to scare crows.I am sure the great actors, known so much more so for drama, than a musical, threw off the public. Seeing Ullmann, Finch, Kellerman, York, and Kennedy especially, so often playing the heavy, in lighter roles was different. But guess what? They are all great actors and pull it off completely.If you have read any of my reviews you know I review lesser known or disparaged movies that I feel deserve a lot better fate. Why review, for the one millionth time, Casablanca, Spartacus, Network, or Gone With the Wind? Guess what? They are great and considered so for a very real reason.Lost Horizon, on it's own is one of the best musicals made and a great telling of the classic story. The B & W, Ronald Coleman version , as good as it is , is flawed due to the lost footage and the scars the film has due to it's repair. This musical version, is the best version of Lost Horizon, I recommend giving it a try . I guarantee you will be whistling the songs soon after.","To remake \"Lost Horizon\", as a musical, the need for a Rodgers & Hammerstein or Lerner & Lowe type musical composition was needed.  Burt Bacharach and Hal David were the wrong choice.  Having said that, my favorite thing about \"Lost Horizon\", is its score.  It's just that the score doesn't fit the piece.  The cast, is made-up of mostly non-musical talents (Ullman, Finch and Hussey, were all dubbed, and still don't sound all that great).Frankly, the novella, on which this, and the earlier non-musical film versions were based, is mediocre, at best.  While the possibilities for a truly good, cinematic musical version exist, they are not realized here. The film succeeds at being a good, rainy-day vehicle, to pass the time. Otherwise, you are better off, buying the CD of its soundtrack.  Only recommended as a curiosity piece, due to the film's awful reputation.  I've seen much better; but I've seen MUCH worse.","The musical remake of 'Lost Horizon' has been almost uniformly panned over the years and has long been unavailable on home video. So is it really that bad? Comparisons with the 1937 Ronald Colman classic aside, this Bacharach-David musical starts as an adventure story and only moves into song and dance fantasy about 45 minutes into the film, when the mixed bag of plane crash survivors (Peter Finch, Michael York, Sally Kellerman, George Kennedy, Bobby Van) discover Shangri-La, led by Oxford graduate Chang (John Gielgud) and the High Lama (Charles Boyer).So the cast looks strong - and in Shangri-La is boosted by wimpy Olivia Hussey and pouty Liv Ullmann. But aside from Van there's no one with experience of musicals. More of that later.The songs are not that memorable, aside from the melody which first introduces the fantasy village up in the mountains. The staging of musical numbers, by Fred Astaire's associate Hermes Pan, aren't that fascinating. However, there is still enough here to keep you watching: but whether it is from the impulse to watch a real turkey unfolding or from a need to watch the story to the end, I'm not sure.I wouldn't really class this as a musical; there are too few songs. And Finch in particular is wasted in this although he plays his part dead straight.The remake of Lost Horizon is a misfire, but not completely awful. Some criticisms of this film are justified, but by no means all. Give it a go and make up your own mind.","As a film buff, I obviously had read all the excruciating reviews and funny, sarcastic comments about this film (my favourite being Woody Allen's quip \"If I had my life to live over again I wouldn't change anything ... except for seeing the musical remake of Lost Horizon\"). Therefore I've never been able to watch it without smirking at the choreography/set/songs etc. Just recently I came across a widescreen DVD and watched it for the first time in years, along with a friend who had never heard of the film's reputation. HE really enjoyed it, and - after trying to block out all the negative prejudices I obviously had about the film - so did I. There is nothing especially bad about Lost Horizon, and it is far more enjoyable and watchable than many other early 1970's movies. It isn't even especially camp. The lyrics to some of the songs are rather repetitive and simplistic, but this isn't really apparent when hearing them for the first time or having the flaws pointed out in advance so you are ready to scoff at them. As for all the reviewers who claimed the cast cannot sing in tune, this criticism falls apart since Liv Ullmann, Olivia Hussey and Peter Finch were dubbed (brilliantly too, as the vocals match their speaking voices perfectly), and Sally Kellerman has a really lovely and totally unique singing style. Vocally, Kellerman's duet with Olivia Hussey on \"The Things I Will Not Miss\" is excellent. Special mention should be made of the legendary Hollywood star Charles Boyer's brilliant performance as the High Lama - and his comments about mankind destroying itself are chillingly apt to today's fractured world. I wouldn't claim for a second that Lost Horizon is a masterpiece (The things I wouldn't miss about it are the uninspired choreography, and Bobby Van's \"Question Me An Answer\" number, which could easily have been cut), but if you haven't ever seen Lost Horizon, or haven't seen it for some time, try watching without that \"Oh boy, let's have a laugh at this pile of junk\" attitude, and you will be surprised at how enjoyable it actually is.","The cast is admirably chosen and well-balanced. This cinematography is excellent. The music is delightful as all of Burt Bacharach's music is, and is appropriate to the plot line. Making a musical version of Hilton's tale is a welcome change from a plodding re-make. We see seasoned actors who add real depth to the emotional content and significance of each scene. I cannot agree with the critics who overlooked this scintillating gem of a film. It is a treasure of the silver screen! Find it if you can - and let its magic carry you beyond the drudgery of daily worries, inspiring you to find your own \"Lost Horizon\".","(Warning, there are spoilers sprinkled throughout, but I wouldn't worry)\nThere is only one movie I have seen that is worse than this one. \"Howling: New Moon Rising\". This film is an utter waste of celluloid. How such a large cast of decent actors could be so totally wasted is incredible. The really amazing thing is that some of the cast still managed to keep their careers going. Michael York is the only cast member who adds any credibility to his role. In his final BIG scene, after Olivia Hussey's character ages before his eyes he begins to cry (Or he has a severe stomach cramp, I haven't decided which) and then he runs screaming off a cliff. I'm not sure if it was from the agony over losing the love of his life, or if he suddenly realized how far down the crapper this movie was going to send his career and decided to cease the humiliation. George Kennedy plays the same role he does in every movie, which is O.K., but he is dragged down by the terrible script. Sally Kellerman shows she has no shame, Bobby Van and Olivia Hussey more than likely needed the money, and John Geilgud and Liv Ullman look like they'd rather be somewhere else.What really bothers me is that we are supposed to view York's character as the *sshole because he wants to leave. Now let's think this over. His character is supposed to cut off all ties to the outside world for what? So he can live for hundreds of years and be forced to listen to Kennedy and Kellerman duet and Bobby Van tapdance and sing? Who could blame him for wanting to leave?The movie starts out with promise, It's a fairly strong cast, and a fairly good plot. then the filmmakers decided that it needed to be a musical. That alone is terrible, but they hired BURT BACHARACH to write the music. THAT is an abomination. Not only do the songs pop up in the least likely of places (Well, except for Hussey's song during dinner. I can suspend my disbelief for that one) But the songs are so swinging 70's that the movie became dated almost before it reached the theaters (And it bombed at the box office. It cost 6 million to make and only got 3 million from U.S. Moviegoers, and probably 99% of them wanted their money back.)Trust me, avoid this movie like the plague. It honestly is awful. I just can't believe I wasted two and a half hours of my time watching this when I could have done something constructive, like organize my sock drawer.0/10","Spoiler Alert The first half of this movie will fool you. You have been warned. It starts out with the attempts of a peace ambassador to evacuate refugees from an airport, which is actually fairly interesting. The attempt fails, and the only people to escape are the ambassador, two journalists, a contractor, and a freakin' stand up comic. The plane is hijacked, and they crash in the mountains. A fur-clad rescue party shows up and escorts the survivors back to Shangri-La, and that's when the movie slips you a hit of acid. Everyone there sings and breaks into pathetically choreographed dance numbers at the drop of a hat. The music is (how should I put this?) instantly forgettable -- except \"The World Is a Circle\", the chorus of which may stick in your brain like a tumor if you aren't careful. Poor Sally Kellerman. She looked miserable whenever she had to sing, and terrified when she had to dance. The Twist she did while singing to George Kennedy was truly cringe-worthy. (I told you the songs were forgettable-- I've seen this 50 times and still can't remember what she was singing.) George Kennedy was spared the indignity of singing or dancing. Lucky him. Liv Ullman seemed just as uncomfortable trying to dance, so they let her off the hook by allowing her to sway around awkwardly while trying to keep a serene smile plastered to her face. I think they should have made her dance like Sally -- it's no fair for the director to play favorites in a film like this. And Bobby Van! Words cannot describe the prancing about this man does; you have to see it to believe it. Maybe I'm giving away too much here (no I'm not), but I was glad when Michael York died at the end. I was tired of his incessant whining about wanting to go home. Why the fuss? I'd be willing to put up with the singing and the goofy clothes to spend the rest of my life in a place with no traffic, pesky jobs or the IRS. Thoroughly misguided and miscast, it is a wonderful example of how not to make a musical, which is why I love it so. So take some prescription painkillers (they'll help!), grab a pillow to prevent a laughter hernia, and watch this disaster unfold.","I went to the cinema in 1973 when the film was released, I was 11 at the time. I remember how much I enjoyed it and wanted to live in Shangri-la, that's how naive and young I was. I recently came across a video of the film I had recorded off television some years ago. I watched it again and am not ashamed to admit I still enjoy it as much now as I did 29 years ago. I also enjoy listening to the words of the songs, because it makes me think that one day we could live in a place where the sound of guns don't pound in our ears and if we look at our reflection - we should be happy with what we see. This is what I call a \"feel good\" film because I feel happy after watching it. Maybe I am still naive but it makes me happy and I'm sure it will make you happy if you watch it with an open mind and enjoy it for what it is - a good, family film. I must be one of the few people who has this film on VHS PAL video - and DVD (self-made). I recorded it on DVD as the videotape recording from TV was starting to wear thin. I still watch it from time to time.","I was an extra on this film, in the part shot at the airport in the first 15 minutes or so; I was one of the fleeing (mostly Mexican) Bangladeshi refugees running across the runways at Ryan Field in Tucson. At one point, standing around in our turbans as we waited for another shot, one of my fellow extras turned to me asked me what the move was going to be about. I told him it was going to be a remake of Lost Horizons, only as a musical. There was a long pause, then he replied: \"Man, this movie is gonna suck\". Pretty perceptive of him, I thought. I had a good time and made a bit of money, but even with some interesting personal memories attached to this movie I can't sit through the whole thing. If you ever saw the movie \"The Swarm\", you can pretty much get the idea. You get to see a lot of famous and talented people wasted on an an idea that on the face of it is just BAD. The idea seemed to be that if you throw enough money at a movie and hire enough big names, then a good story and good writing aren't necessary. Just turn the big crank, and out comes the product. It's just not worth watching.","This was one of my favorites as a child.  My family had the 8-track tape soundtrack!!  It took us years (until I was in my 20s) for us to get a video of the movie (my dad taped it from HBO or something).  Every summer when we go to the beach (my mom, brother, sister and I) we lay on the beach and sing all the songs from this movie!!! LOVED IT!!!","This musical has a deep meaning which is appreciated by only a few.  The wise can see the wisdom contained in what most call folly.This music may well regain popularity as world consciousness rises.  It is about a land \"far away from it all\" where \"living things have room to grow.\" Its people are \"living and growing together\" mentally and spiritually faster than in biological age.The lyrics help us recognize the relativity of this \"world that is spinning around\" and to \"look inside yourself; that is where the Truth always lies.\" The absolute level of consciousness is more real than the ever changing world of the senses.I have been searching for the video for years . When I find it, or it comes out in DVD, it will help \"share the joy\" of being in \"Shangri-la\" again. Burt Bacharach's music and Hal David's lyrics made a masterpiece in turbulent times that is just now ready to be fully appreciated.\nMay this CD inspire you to find your own \"Lost Horizon\" or recognize it when \"peace of mind\" has found you. - LostHorizon.org","I'm a 45 year old female who has seen more movies then I could ever list.I was 16 years old when this film was released and me and my friends, lived it !!! We watched and sang along with it, like it was a new religion. Of all the movies I've seen I'd have to say, that \"Lost Horizon\" (1973) was and still is the most memorable. Yes, some of the actors performing their musical numbers was \"cheesy\", ie. Sally Kellerman, George Kennedy, but the music score was and is, still phenomenal. The soundtrack is a must have for anyone who is capable of stepping out of today's mindset, of the dark and dismal, and yearns for a feel good experience, even if it only lasts as long as the soundtrack does. The film and the soundtrack will continue to be number one on my list of movie's that, won't let go of me. This film is up there with \"The Goodbye Girl\"(original with Marsha Mason) and \"Steel Magnolia's\". Just my opinion..."],"review-user":["jbdean","ptb-8","perrybw-3","skip_184","robertm-12","SmiteDaddy","Jamie-58","laszlo-11","jms-8","moonspinner55","Tim-177","niknak99","annmason1","gmonger","johnm_001","didi-5","milliefan","springgarden2004","Gunnery Sergeant Hartman","jerizda","stevecarter62","ormewood","scbp","rshaddock","jontuefouche2004"],"review-date":["4 August 2004","21 March 2005","8 December 2004","16 January 2001","6 July 2005","11 October 1999","3 March 2000","15 July 2005","4 July 1999","29 July 2006","21 July 1999","13 March 2000","26 January 2001","11 January 2016","26 March 2002","2 September 2009","17 October 2008","26 November 2006","8 August 2001","1 June 2004","26 October 2002","21 May 2005","9 January 1999","27 May 2003","22 September 2004"],"review-rating":["8","8","8","7","5","7","10","10","4","5","8","10","9","1","8","10"],"review-title":[" Not Lost on the Right Audience\n"," Least Horizon\n"," Why isn't this movie on DVD?!\n"," Great Music\n"," The \"director's\" version was better, but ...\n"," A much maligned film\n"," Those Dancing Fools\n"," What \"so bad it's good\" really means!\n"," Can't get it out of my head!!!\n"," Deadly-earnest camp musical; often deliriously enjoyable...\n"," What's everyone complaining about?\n"," Shlocky, cornball 70's musical at it's finest!\n"," A Himalayan \"Springtime for Hitler\"\n"," Lost Horizon -skip the unfair, reviews, see this movie\n"," Lost Possibilities\n"," not a great, but it's watchable - kind of\n"," Take another look\n"," a marvellous journey\n"," Two words. GOD AWFUL\n"," I Love This Train Wreck of a Movie\n"," Entertaining\n"," True high-budget schlock\n"," one of my all-time favorites!\n"," Music for the new Age of Enlightenment\n"," Slightly Cheesy, but very memorable !!!\n"]}