{"review-url":["http://www.imdb.com/title/tt0077280/reviews"],"review-text":["I always liked listening to Buddy Holly and felt a real loss when he was killed at a young age in an airplane crash. He wasn't in the old rock 'n roll class of , let's say, Chuck Berry or Jerry Lee Lewis, but he wasn't far behind. Who knows how big his legacy would have been had he sang for decades. Almost every single he put out was a hit.So, I was very pleasantly surprised how good a job Gary Busey did at playing him and at imitating his singing voice. He did Buddy proud, as were the actors (Don Stroud and Charles Martin Smith) who played Holly's backup group, \"The Crickets.\"Music-wise, there are some of Holly's better-known songs in the beginning of the film and its really good with a strong finish at the end as Holly and the boys are shown in Iowa in their last concert ever. Busey not only sings like Holly, he's a dead ringer for him in the looks department. Some thing was the actor''s best performance ever, and you get no argument from me.I'm also glad they ended the film on an upbeat note with that Iowa concert, instead of dwelling on his tragic accident. The ending could have been a real downer, but they didn't let it be.","The Buddy Holly Story opens on a shot of a yellow neon moon on the roof of a roller rink in 1956 Lubbock, Texas. As the credits start, the camera moves down from the moon to the parking lot, into the roller rink, past the concessions and across the rink to a small bandstand where a small band is doing their sound check. It's a tracking shot Welles and Scorcese would both appreciate. It cuts to Buddy Holly's bespectacled face peering down in rapt concentration as he grips the headphones and talks to a man putting this band on the radio. A young Gary Busey plays Buddy Holly and his performance is key. He has to somehow show the passion that Holly had for his music to make the film work. This is a rock and roll story without lines of coke chased with shots of heroin and a fifth of whiskey. This isn't about a man with several women to choose between in a sex scandalized, brood abandoned lusty tragedy. This is a film about a nice Texas boy who respected his parents and went to church and had the same girlfriend for 5 years and fell in love with rock and roll. Busey finds that spark and ignites it, his passion is clear and infectious. He really plays the guitar in the film and sings, its not overdubbed with Holly's recordings. Busey was a young guy in Hollywood in the seventies, a struggling actor and as much or more so a struggling rock musician as well. Thus, he gives a great performance, because although he isn't Buddy Holly, he's in a similar situation. His first song is the old Les Paul classic, \"Mockingbird Hill\" and he has the country twang to nail it. Next a kid calls out for some bop, and against his two band mates (in reality the Crickets were 3 guys, but the down-sizing works fine for the film's limited narrative)he leads them wailing into \"Rocking with Ollie Vee\". The kids love it and the parents hate it. The DJ at the rolling rink tapes it and it is later released in New York without Buddy Holly even knowing it was ever recorded. This leads to the funniest scene in a film filled with humorous moments. An amped-up disc jockey from Buffalo calls up Buddy at home. The DJ has been playing \"That'll be the Day\" for 12 hours and is going for 24. The cops are banging on the station's barricaded door. Holly is confused, but when the dust settles, he is quite thrilled. He tells the boys, and their meteoric rise begins. Dan Stroud as the drummer and Charles Martin Smith as the bassist round out the band nicely and have good chemistry with each other. There are problems but not overblown drama thats found in most rock (all?) biopics. The movie doesn't manipulate you either. Your emotions soar, but they're not manipulated. When the Crickets step onto the Apollo stage in Harlem, the first white group ever to play there, then rip into an electrically charged performance of \"Oh Boy\" and win the audience over, my rock and roll loving ass got choked up and cried. Next, Busey and the boys make \"It's so Easy\" sound funkier and more soulful than I would have believed possible. Anyone with even a cursory knowledge of Buddy Holly's story will know where this movie will end. Holly died in a plane crash with Richie Valens and the Big Bopper way too young. We, as the audience know that, yet the movie is so well written, directed and lovingly acted that we forget it almost immediately. The movie isn't about his death, it's about his life and his place in rock and roll history. The film ends with his last performance and it's a good fifteen minutes of Busey rocking out possessed by the ghost of Buddy Holly. I was happy to hear him end it on \"Not Fade Away\", my favorite of his songs. The film freezes before the end credits with the information about the plane crash, but I hardly noticed it. I was still thinking about how good that last song was.","What a great film! I never knew much about Buddy Holly, but was familiar with his lively and fun music. This is a wonderful biography of someone who helped change the music in the 1950's. Although I never cared for Gary Bussey, he was fabulous as Buddy Holly! I don't know how accurate the movie is, but assume at least for the most part it is accurate, which makes the movie all the more interesting. The music throughout the movie just adds the pizazz to this biography. I don't think I would change a thing in this film, it was all good! What a difference in the stars from the 50's to todays music stars. How can you compare someone like Buddy Holly to Justin Timberlake? or any of the other popular singers of this generation?","At times, you forget that you are watching Gary Busey play Buddy Holly and start to think that you are really watching Buddy Holly! Besides the terrific acting, Busey is really singing and playing the guitar when on stage. The movie is made as real as a documentary. Like snap shots from his life, the Buddy Holly Story is just that, Buddy Holly's story.","I was fortunate enough to be an extra in this movie when I was about 13 during the roller rink scenes. My junior high school drama class was invited to participate. It was a fantastic experience.Gary Busey, Charles Martin Smith and Don Stroud played the music live, all day! As a musician, I can appreciate the tireless work and dedication these guys put in to their roles. They must have played those songs 20 times. It's very difficult to maintain consistency and energy under those conditions. This is visible during a cut to a close-up on \"That'll Be the Day,\" but fortunately the unsuspecting public probably wouldn't have picked it up.Skating around all day, getting the day off from school and being transported back in time was a incredible thrill. I also had my first \"date\" on film. I had to walk a girl up to the ticket booth. Woo hoo! Even with an out-of-date haircut and hot lights melting the vaseline in my hair, it was still worth it. Fun stuff.The movie is top notch and is highly satisfying as a whole. Busey delivers his best role ever and the supporting cast is superb. I'm glad to have participated in a great film of the day. To think I could have been in Corvette Summer or something. Not.A funny ironic ending to this is that years later I was in a video store in Malibu looking at the movie the week it was released on video. Gary Busey walked in and stood right next to me. I showed him the cover and babbled on how great he was and how I was an extra and whatnot. Pretty weird, but very cool, for what it's worth.","This film set the standard for all rock biopics to follow. It accomplished this through the energetic performances of the leads, the steadiness of the camera-work (avoiding 'rock-video' clichés that were actually invented for the Beatles in their first two films), tight editing, and a non-judgmental presentation of the star as human being rather than symbol or god (or demon). Yes, there are minor holes in the plot, and incidental details that are a little unnecessary, and there will always be debate between families of those personally involved as to specifics. But the issue here, as in the much more recent \"I walk the Line\" or Carpenter's famed TV Elvis biopic of the same era, is whether the meaning of the performer's life, in its time and place, as a catalyst for fans' ideals and appreciation, is made manifest in the performance, and this is clearly the case here. We come away from this movie understanding not only how Buddy Holly became a star, but why. I don't see what else one could want from the film.","When Gary Busey got nominated for an Oscar for his performance in \"The Buddy Holly Story,\" alongside Robert DeNiro, Warren Beatty, Laurence Olivier, and winner Jon Voight, it turned a lot of heads and made people pay more attention when the film came out on video and cable. Seeing it then for the first time years ago, I was amazed by Busey's powerful dynamism, the way he lives through each moment of the film so authentically. The rest of the film was enjoyable, funny, perceptive, and made me feel like I really understood something about Buddy Holly.Watching it again years later, I still think Busey is terrific. But the rest of the film feels like a 1970s TV movie, with broad characterizations by the likes of Conrad Janis as a record exec. The Crickets are woefully portrayed, or perhaps a better word might be betrayed, given this shows them to be racist mediocrities who hold their buddy Buddy down. Even when the history isn't wrong, it feels wrong, like the scene of the Buffalo DJ who locks himself in his studio and plays \"That'll Be The Day\" non-stop until the police break down the door, helping launch the band.\"How'd get that dynamite sound?\" the actor playing the DJ asks, hamming it up.\"Well, there's a guitar, drums, a stand-up bass and a cricket,\" Buddy replies, meaning an insect got in the middle of the recording session and made some background noise.\"Wow, Buddy Holly and the Crickets! What a super name!\"There's some truth behind the anecdote, a cricket apparently did find its way into the studio and inspired the band's name, but it just feels too contrived. Same with Buddy's problems back home in Lubbock, Texas, where his girl wants him to shape up and go to college. The actress playing the girlfriend is cute and winsome, but she pouts like a sitcom actress and says her lines like she's auditioning to play Marsha Brady.But when the camera is on Busey as Holly, something takes over. He throws himself into every song with utter abandon, losing himself in Buddy's big glasses and pompadoured curls. It's not a note-perfect Buddy, but it encapsulates his spirit in a defining way. The only other actor who so dominated a film was George C. Scott in \"Patton.\"The fictionalized Crickets, only two instead of three, Don Stroud and Charles Martin Smith, are pretty terrific as backing musicians. I especially liked Stroud as Jesse the drummer, the way he cracks the skins and hammers the high hats with door-slamming authority. All the numbers are performed live, an unusual and brave choice by director Steve Rash that pays off brilliantly, capturing the raw vibrancy of straight-ahead rock 'n' roll.There's a great opening sequence, done with a swooping camera shot inside a roller rink to where Buddy and his band play some bop for the kiddies and scandalize the community. Just the way the band switches from the soporific \"Mockingbird Hill\" to the thumping \"Rock Around With Ollie Vee,\" with the audience reacting in comically but believably different ways (kids rushing the stage clapping their hands, adults rushing the exits clapping their ears) is a thrilling capsule commentary on what rock overcame to take over American culture. Also good are the period touches at the rink, like the malt bar, the roller skates, the sad fellow with the combover who plays rinkydink piano until someone taps him on the shoulders in mid-note.Also good is the Apollo Theater scene, where Buddy and the Crickets become the first white band to play in that Harlem venue, getting a hilariously cold reaction when the curtain goes up, then winning the crowd over. I sort of doubt it happened like that, but there's some funny exchanges with the theater manager, and it's nice seeing Stymie from \"Our Gang\" in an adult role, complete with his trademark derby.Basically, any scene where Buddy is performing is good, though his final performance at the Winter Dance Party in Clear Lake, Iowa, by which point he has become a solo act, is a little overdone, what with the over-the-top violins on \"True Love Ways\" and Ritchie Valens joining him on stage at the end with maracas.Meanwhile back home, the Crickets come over to Buddy's apartment, and after talking to Buddy's pregnant wife Maria Elena, decide to surprise Buddy at his next tour stop in Moorhead, Minnesota. Yeah, right. Of course Buddy won't be there, he and Ritchie and the Big Bopper having picked the wrong night to fly. All that's left is a freeze frame of Buddy and some sad music over the credits.We only had Buddy for 18 months, and this film, along with Don McLean's 1972 hit \"American Pie,\" gave him back to us in a small but tangible way. For that, and for Busey's breakout moment, it is worth treasuring, and there are some nice scenes here and there. But playing with the facts is no way to tell a legend's story, especially when it serves sitcom-caliber punch lines. It's a good movie, but the real story behind it is better.","If there is one reason to watch this movie, it's not for an accurate depiction of Buddy Holly's life and career; it's for Gary Busey's incredible portrayal of the lead character. Busey received a well deserved Best Actor Oscar nomination for his tour de force. The film is a \"docudrama\" that overstates and over-glorifies Holly's contribution to and achievements in the early Rock and Roll era. I guess John Lennon was joking when he said \"Before Elvis, there was nothing\" because anyone who watched this movie understands that nobody knew what they were doing before Good Ole Buddy emerged on the scene a few years later. And he did it all without a producer or even a band who believed in and supported him! But when you're in the same league as Motzart, anything's possible! That's what makes Busey's performance so remarkable; he is so convincing and compelling that you actually believe this is who Buddy Holly was. Busey succeeds in creating this charismatic and dynamic performer,leader and visionary who never existed to that extent. The final scene is case in point when Holly is bombastically leading Richie Valens and the Big Bopper on stage during the final concert; in reality it could have been the 4th co-headliner, Dion and Belmonts closing that show and Holly playing drums for them which he had to do often on that tour. But this movie is not about presentation of the hard facts, but a celebration of a man and his music, which Busey's performance along with all of Holly's best songs easily accomplishes.","Gary Busey's best performance in a nicely-flowing biography. Since had a musical background, he was able to do his own songs and it really works. It's always good to see that fine actor, Don Stroud (one of the crickets) and Charlie Martin Smith as well.An 8 out of 10. Best performance = Gary Busey. Thankfully, Mr. Busey was Oscar-nominated for this, losing to Jon Voight in COMING HOME. A fairly low-budget flick that doesn't disappoint, with GREAT SONGS by Mr. Holly. I hope this made plenty of dough. Busey was never this popular again for varying reasons, but thankfully he has this one great one on his resume.","Fate sometimes acts like a bitch, it takes one's life at the commencement of a promising career, making an immediate legend out of him. You pay the biggest price to become a star who'll never die  This is the fate of legends who can't afford to become old, to get civilized, to host TV shows or do concerts in Las Vegas, or simply remember the good old days  You die early to become immortal. Indeed, life is a bitch! \"The Buddy Holly Story\" is a movie about one of these legends that prematurely deserted our world, but whose style of music never ceased to appeal and influence coming generations : Buddy Holly, one of the most influential Rock and Roll pioneers. His career didn't last more than one year and half, yet he would change the face of music forever, inspiring many generation of singers, among them, The Beatles and Bob Dylan  he would even inspire one of the most touching and beautiful songs ever, Don McLean's famous eulogy about that tragic February day where \"the Music died\"  And I started mentioning the tragedy; because I'm sure everyone who watches the film has the accident in mind, anxiously waiting for it. The apprehension becomes sadness as we're absorbed by the character's charisma, his good-hearted nature and enthusiastic attitude. We're sad because we develop an obvious fondness for Buddy Holly, this tall nerdy guy whose physical appearance would fit more for an astrophysics student. He's fun and gentle, but undeniably talented and perfectly aware of this talent. Buddy has the little something sparkling behind his legendary horn-rimmed glasses, that outshines the band. And after his buddies left the group, I understood why the movie wasn't titled \"The Buddy Holly and the Crickets Story\". HE is the legend.And this is the story of the legend. From his beginning in the ice skating station, to his confrontation with the racist Nashville music manager and the New York producer, we respect Buddy Holly, both the artist who knows his value and the man of principles who means business. This respect is stimulated by his incredible show in the iconic Apollo theater, where he handles a skeptical black audience with a nervousness repressed by humor, \"we didn't expect you either\" before giving a virtuoso performance that would launch his stardom. His whole life is lead by a dedication to his work, and an extraordinarily frenetic energy communicated during his concerts, while singing \"That'll be the Day\" or \"Rock Around with Ollie Vee\". I don't think there was any moment my feet stopped following the rhythm, and while watching him swaying his hips and walking on his toes, I couldn't help but think that Elvis Presley's status owes something to Buddy's precocious death. And if his life is dedicated to music, his heart is for Maria Elena. The film is not just a chronicle on Rock and Roll music or a 50's time capsule, it's about a man whose convictions don't only affect his approach to music, but to love, too. \"The Buddy Holly Story\" is a poignant love story with a nice little humorous touch as in the scene where Buddy asks Maria's aunt if he can date her niece. Maria will inspire Buddy Holly's famous love songs including \"True Love Ways\", \"Words of Love\", becoming the heart of his music, before being forever known as the \"widowed bride\". A sad destiny for a woman we wish she could have prevented Buddy from going on this doomed winter part tour, if she wasn't pregnant. Ironically, Buddy's commitment indirectly killed him, while he could have become an established and sedentary artist comfortably seated in a TV driven stardom. In a flash of realization, Buddy understood that his life was on stage.And all our admiration to Buddy relies on Gary Busey's extraordinary performance. I never thought the man I remembered as Mr. Joshua from \"Lethal Weapon\" and countless forgettable villainous roles, could blow me away like he did. But after watching Steve Rash's film, my respect for Busey increased, so did my sorrow to learn that his career may have been more successful if it wasn't for an accident the actor had in the 80's. When you pull such an authentic performance, I'm sure you can handle anything. A very well deserved Oscar nomination for a performance harder than Jamie Foxx in \"Ray\" because, there are many mimics, speech mannerisms or attitudes immediately indicative of Ray Charles while Busey had to resurrect Buddy giving him an unknown aura, a personality, likable and complex, and last but not least, he did the whole singing and dancing. It's a perfect example of a great performance carrying a whole film with a solid supporting cast. Though I wish, the movie gave more screen time to Ritchie Valens who deserved, like the Big Bopper, more than two seconds of him dancing with the maracas in the climactic singing scene.And what a climax, what a thrilling moment that conveys so many opposite feelings, a joyful and exhilarating sensation of freedom and an anticipated sadness, because we know these guys are living the last moments of their life. I was waiting for the scene in the plane but unconsciously I didn't want to see it, as it would have ended the movie in an extreme negative mood. So I was surprisingly satisfied with the ending of the film. Buddy shouts \"See you next year\" the image freezes and  the rest is Rock and Roll. An abrupt ending indeed, but conveying extremely well the brutality and the shock that was Buddy Holly and his companions' death.I kept staring at the image a long time contemplating that face that revolutionized music and incarnated an era of insouciance,  my eyes were meditating, and my heart was crying, as if something really touched me deep inside ","It would be unwise to judge that that either narrative or documentary to be more authentic than the other. Both formats have an underlying form of fiction and are never a true reflection of reality as producers seek to reconstruct and narrate stories in their perspectives. As both formats usually leaves some issues undiscussed due to 'complexities of subplots' and screen time, it denies viewers the opportunity to open up debates and to further investigate and construct the real truth. Adding to the viewer's inability to evaluate sources (eg comparisons with written history) and the logics behind arguments, history may be open to distortion through narrative and documentary.To most people, documentary may be seen more truthful as it usually involves actual participants' testimonies and real-life footages. However, these visuals are selected and edited, to be arranged in a way that allows producers to present their version of realism to the viewers. In The Real Buddy Holly Story, Paul McCartney seeks to establish the Buddy Holly as remembered by family and friends and how Buddy had influence the rest of the music world. The testimonies may have been distorted as memories may not be accurate and emotions have evolved to make a legend out of Buddy. The documentary did make corrections to the film version and cover other events, such as there were 3 members of Crickets and that Buddy's music was actually heard outside of USA at that time (he had to embark on a world tour!). However, it did not go into deep discussion about what happened to Buddy's wife after his death. Criticism and/or negative discussions may have been left out of the documentary as the producers seek to present a Buddy that the world should have remembered. Eventually, we don't manage to construct the whole truth as we only restrict ourselves to the past 'realties' that the documentary tells us.Personally, I prefer a narrative film because it provides rich visual imageries, which helps us to reconnect with the collective memory of that era. It gives the audiences a more constructive structure of the story, and this leads to better memory retention for the audiences when they retell the story. There is also an element of flexibility which allows film-makers to express their thoughts and views on certain issues. In The Buddy Holly Story, racial issues were highlighted and viewers can certainly relate to these issues with respect to current situations.Movie-goers consistently seek to revisit certain emotions when watching a film, and using these emotions, audiences can choose to make personal connections with the applied meanings that a film-maker wants to deliver. In most stories, people are more likely to selectively remember the struggles, the inspirations and the way the story ends. Through The Buddy Holly Story, we do remember the struggles Buddy and the Crickets had, how Maria had been a source of encouragement, and that Buddy Holly was a great performer until the day he dies.","A fine film about the late great Buddy Holly. Watch it for no other reason than to see the scene where Buddy sings \"True Love Weighs.\"  Gary Busey did his own singing and that particular scene is fantastic. Overlook the various minor inaccuracies in this picture.","I've got to say it.  Gary Busey saved this film.  If it were not for his fine acting talents this film would have been sub par.  I recommend the film but just barely.The biggest difficulty with the film is its broad disregard for historical, geographical and physical accuracy.  For example, why is Lubbock green and hilly?  How come Buddy's producer Petty ignored?  Where are the daily trips to the Clovis, New Mexico studio?  Why is Nashville treated as a racist hate camp out to destroy the Holly sound?  Why was Buddy's two week courtship to Maria treated as a complex, taboo, race mixing stereotype?  Why are Buddy's tile boxes as light as feathers?  Finally, why are the Crickets portrayed as trouble making roadblocks to Holly's talent?Taken on their face these inaccuracies should spell doom for any film proclaiming itself, \"The Buddy Holly Story.\"  However, Busey does deliver a stirring portrayal as the man whose death eventually led to the day the music died.","I turned 13 when Elvis hit the big times in 1956 with his first RCA hit. A year later Buddy Holly stepped in to give the King some competition. One of Buddy's major talents, besides his unique singing style and his songwriting ability, is often downplayed. Buddy was also a skilled lead guitar player, developing a unique rockabilly style all his own on his Fender Strat. Gary Busey attempts to capture this aspect of Buddy's persona. There were other contemporary master guitar rockers of equal caliber, such as Chuck Berry, Carl Perkins, and Eddie Cochran, but Buddy's talent is often overlooked.As noted by others, Busey is the driving force behind the success of \"The Buddy Holly Story.\" Not only does the script play with the facts of Buddy's life, but it even interjects several anachronisms for the two years of Buddy's popularity, basically 1957-1959. One that comes to mind is the scene where Buddy and Maria are watching a 3-D movie. Buddy is disenchanted with it all and tells Maria that it'll never last. It's just a fad. In reality there were no 3-D movies in circulation at the time. The heyday for 3-D was in the early 1950's. By 1955 the fad had already faded. Yet another example where just a little research would have sufficed to make the story more believable.At times it is difficult to separate what really happened from urban legends surrounding Buddy's career. The story about how the Crickets got their name may or may not be apocryphal, but it certainly did not take place the way it is presented in the movie. Another problem with the film is how Buddy's parents are depicted. Certainly Buddy's parents were supportive of his musical career. \"Maybe Baby\" is credited to Buddy's mother and she did have input into the writing of the song.It's good that Buddy's biggest hits were used in the movie, but I miss hearing one of my favorites, \"I'm Looking For Someone to Love.\" I'm proud that as a result of this movie, Buddy's music was reissued for a new generation to hear. His legacy is one of the very best from the early days of rock 'n' roll. Rave on, Buddy, rave on.","I first saw The Buddy Holly Story when I was about seven years old.  I had no idea who Buddy Holly was, nor can I remember what it was that made me sit down in front of the television, tuned in to HBO, and watch this engaging biopic.  What I remember was realizing that it was a (somewhat) true story, about someone who actually lived.  I recall the music, great songs that I still love today (I can't believe Gary Busey sang his own songs and so well - What a stud!) Then, came the end.  He died.  He freaking died.  I couldn't believe it.  I had no warning, no prior knowledge like most coming into this film.  It taught me a harsh lesson about life and how it doesn't follow the rules that most movies teach us. I just watched the film again tonight and was engaged all over again... and a little saddened.8 out of 10, but I'll admit to a little bias.","I've always been a Gary Busey fan since I saw him playing crazed villains in the likes of UNDER SIEGE and LETHAL WEAPON. The guy screams entertainment value, and it's tough to resist his manic charms. So I decided to go back to the beginning, and catch up with a role that helped make his name: as Buddy Holly in THE BUDDY HOLLY STORY, a biopic exploring the tragic rock 'n roll star's rise to fame.It's a thoroughly engaging little movie with a definite 1970s vibe to it, in that actors are given the opportunity to act without flashy direction or editing or special effects getting in the way. Busey dyes his hair black, dons the horn-rimmed glasses and is good to go. Nothing more is needed than that.The story that plays out is never less than interesting and usually more besides. Of course, there are musical numbers popping up throughout and Busey makes these his own; it feels like it's the kind of role an actor was born to play. That alone would make THE BUDDY HOLLY STORY a decent film, but the strength of the supporting players (mainly Charles Martin Smith and Don Stroud) and the involving storyline are the icing on the cake.","The Buddy Holly Story. Is one of the best Rock N Roll bio pictures out there. That said there really is a lot of Hollywood nonsense in there. The film makers skipped important things and left a lot of people out such as Norman Petty. Petty Helped the Crickets get started out and he became their manager when That'll be the Day became a gold plated hit.But what this movie does capture is the feel of the era. Gary Busey is at his best playing Buddy Holly with a intensity that comes through quite naturally. A lot of People who Knew Holly swore Busey was channelling Holly's spirit.The music was well done and the acting is pretty good.But we all know how the story ends. This Movie gives us all clues into How the story began. And afterwards we all wonder what might've been.","I was a teenager when Buddy Holly became popular, leading the charge into Rock 'N Roll. But I don't remember much about him, because I had not yet gotten into that type of music. I was mostly listening to Ray Charles, Bobby Vinton, and Dion.What I especially liked about this movie is that Gary Busey, who played Buddy Holly, did his own singing. In fact, what we see are the live recordings during filming. I don't recall how Buddy Holly really sounded, but I suspect Busey did a pretty good imitation.SPOILERS. The story is pretty well known. Holly and his friends, the Crickets, began making music in their garage in Lubbock, Texas. A tape gets into the hands of a NYC record executive and he presses a 45 rpm disk, that immediately becomes a hit. Holley only signs a contract if he is given full control to produce his own records. He gets taken with the pretty secretary Maria Elena from Puerto Rico, and marries her. Forced to go on tour during the winter, to promote his records, their bus breaks down, and the next day must charter a private plane. It crashed, Buddy Holly died, along with the Big Bopper and Richie Valens. Being a low budget movie, we don't see anything of the crash or the wreckage, the music and image of Holly just stops during a stage performance, and we read what happened. I think that is even a better way to end it.","Gary Busey did a splendid job playing the rock-n-roll legend Buddy Holly(1936-59). He does have a spitting image to the man. Being a garage band in the 50's is sure different from today's. Having a group of three is usually simple back in those days. I bet that Buddy Holly(Busey) was a much better musician than most of what I heard. Since he lived in Lubbock, Texas, it was only a quiet country town back then. His parents were Christians, though his mother was a strong supporter of her son's work. That's one of the reasons he didn't act like Elvis. He stuck to his kinder ways. That really makes him good! When he went to Tennessee, he saw how bad the producers were. They hated rock-n-roll, that turned Holly off big time. Getting used to the different atmosphere was a challenge to Holly and his friends. He got to tour with Sam Cooke, went to the famous Apollo, which the all-Afro-American audience quickly accepted them, I liked that! And Sam Cooke made sure Holly and his band got some service. That's what I call tolerance. It's sad that he, Ritchie Valens, and J.P. \"The Big Bopper\" Richardson had their music careers cut short by a plane crash in 1959, at least their memories will live on in our hearts. I don't what inaccuracies were in the movie, all I care is that Buddy Holly overcame the obstacles of music and politics in that time, and the music is nearly-perfect. For Gary Busey, he was perfect in the role, and making the music as well. GOD BLESS YOU GARY BUSEY! 5 STARS!","The movie has taken a little flack for playing fast and loose with the facts. But it will put you close to being in a time and place that no longer exist by getting to the *feeling*.As Keith Richards remarks in Paul McCartney's movie about Holly, there's some Buddy Holly in almost all rock made since his day. The tragedy that took him is dealt with gently, and the rest of the movie recreates the joy of a great music career and a joyful body of music.Gary Busey does a remarkable, energetic portrayal of Holly, and his performances hint that he really gets into the music. As a long-time Holly fan and rocker, so do I.","The Buddy Holly Story is a great biography with a super performance from Gary Busey. Busey did his own singing for this film and he does a great job.","One of the joys of The Buddy Holly Story is that it makes do with almost no budget and still delivers a delightful, music-filled two hours of entertainment. Forget the fact that the only historical accuracy in TBHS is that Holly was a musician and he died in a plane crash. From what I've read, the movie takes titanic liberties in an effort to portray Holly as a groundbreaking renegade rocker.But, who is really going to pitch much of a fit when you get to see Gary Busey give the performance of his career . . . and absolutely nail the part? Busey is so good, your perception of Buddy Holly will be of him and not the real guy from Lubbock, Texas (sort of the way most folks think of George C. Scott when they hear the name Patton).I watched this film for the umpteenth time a few weeks ago with my wife and daughter; I had tried unsuccessfully for two years to get them to try it. My daughter was entertained (although she seemed uncomfortable with the language) and my wife laughed out loud at the comedic aspects. They liked it because it was simple entertainment. I didn't weigh them down with the historical inaccuracies.And for me, it was two hours of rock 'n' roll.Enough said.","For millennials like myself, it is shocking to see Gary Busey, whom for most of my lifetime has been known more for peculiar behavior, transform himself in Buddy Holly.This movie doesn't get the respect it deserves, mainly because of Busey's performance of Holly ranks up their with Jamie Foxx as Ray Charles or Joaquin Phoenix as Johnny Cash. I would even venture to say Busey's achievement in this film is superior to both.The Buddy Holly Story sets the standard for Biopics with it's amazing portrayal of Buddy Holly and 5-10 minute uninterrupted performances as Buddy Holly which steal the show. This is as close as you and I will ever get to seeing the real thing and understanding what America was like in the mid-to-late 50's.Where it lacks is in supporting cast. The supporting cast isn't extremely memorable, but maybe that is by design. This is Busey's vehicle as he explores the music, romance, and short music career of one Buddy Holly. The movie shows both small town American life (Lubbuck, TX and Iowa) as well as New York City life. It was surprising to see NYC play such a pivotal role in Buddy Holly's brief life and career.Of course, there are things I about Buddy Holly and the Crickets I would like to explore further to see about their accuracy. Was a Buddy Holly and the Crickets reunion on the verge of happening? Where was Buddy Holly's career going? Was he going to be a crooner, or was rock'n roll still in his future? In the final and best scene, we are introduced to the Big Bopper and Ritchie Valens on that fateful night. These are again flawless performances and that night could be a movie in of itself. The most brilliant aspect of the film is the brave decision to not show the plane crash, nor the aftermath. It may have been too much to bare. Instead, we are treated to a 10-minute performance of Buddy Holly bringing life to Iowa in middle of winter. By focusing on the haunting and brilliant final performance, the storyteller reminds us of the fragility of life, instead of the tragedy of the day music died.","The Buddy Holly Story is a Hollywood Biopic . fiction based on fact. But still heads and tails above anything else Hollywood produced in the way of Hollywood bio pics on Rock and Roll stars in the 70's and 80's. But the movie omits so many people and omits so much that actually should have been told that in the end while it serves as a great reminder of Buddy Holly. It also stands as a dis service to him as well. What did they omit ? 1) Buddy at one point in time was a budding Country singer who toured with Marty Robbins and became friends with him. It was actually Robbins advice to Buddy to pursue the music he actually wanted to play and Robbins helped him get set up for his first ever recording session2) Buddy's parents supported him and his music. While they might not have personally liked rock and roll they Supported Buddy .3) his cousin Nikki Sullivan who played supporting guitar for the Crickets on their first hits. His stories of the rickets paint a different picture of Buddy.4)Norman Petty. The Cricket's first manager who ultimately took writing credit for the songs and took money from them he should not have. and in the end caused the Crickets break up and Holly's financial problems that led to the winter dance party of 1959 and the tragic events of Feb 3 1959but this being a movie you can't fit every thing in some things are omitted Simply for lack of time. But the Buddy Holly Story serves as a great time capsule of how movies where once done. They didn't film the Buddy Holly story they filmed the Legend of Buddy Holly. And it still holds up well.Almost as well as the man and his music that inspired it .","Buddy Holly was a pioneer and victim of the early days of rock 'n' roll. The young singer/songwriter from Lubbock, Texas left his mark on the template of modern music. Inspired by Elvis Presley, Holly would spend a lot of time fighting the system in order to get his rock-a-billy sound recorded. Before his untimely death, he was mixing lush strings with be-bop rhythms. Holly would take his place with Presley, Chuck Berry, Jerry Lee Lewis and Ricky Nelson as the voices of teenage angst.This easy to watch bio is not without flaws. Some situations, events, places and even names were not correct for various reasons. What makes this movie so believable is that Gary Busey did his own singing in the part of Holly. A well produced soundtrack became a multi-million seller.Busey was nominated for an Oscar. Other stars of note are Don Stroud, Conrad Janis, Charles Martin Smith and Maria Richwine."],"review-user":["ccthemovieman-1","slumlordian","lpersons-2","caspian1978","mrbiscuit","winner55","slokes","cgvegas","shepardjessica-1","ElMaruecan82","GuitarJedi83","yenlo","sbox","krorie","Flinx-2","Leofwine_draca","bluesman-20","TxMike","GOWBTW","Lucky-63","Peach-2","inspectors71","jeffreygwilliams","feakes","michaelRokeefe"],"review-date":["26 November 2005","11 October 2006","20 January 2007","10 December 2003","4 December 2004","13 December 2008","7 April 2004","5 February 2007","3 November 2004","1 June 2011","15 January 2007","31 January 2001","18 March 1999","28 February 2006","2 October 1999","24 November 2012","10 September 2012","3 December 2006","1 March 2006","1 November 1999","18 November 1998","19 September 2006","9 September 2018","23 August 2016","21 March 2000"],"review-rating":["8","10","9","7","9","9","6","6","8","9","7","7","7","8","7","10","10","8","8","8","10","8"],"review-title":[" Busey Delivers Big Time\n"," If this isn't the best rock and roll biopic ever made, it's at least the best one I've ever seen.\n"," So this is Buddy Holly!\n"," Busey's Best\n"," I was there!\n"," set the standard\n"," Great Busey Performance, Weak Everything Else\n"," Gary Busey Creates a Larger than Real Life Buddy Holly\n"," WELL-MADE BIOPIC WITH GREAT TURN BY GARY BUSEY!\n"," Something touched me deep inside ...\n"," A good introduction to Buddy Holly\n"," The \"True Love Weighs\" scene is fantastic.\n"," Buddy Deserved Better\n"," Not very factual, but the music rocks and so does Gary Busey\n"," A good movie that I recall vividly.\n"," An amazing transformation occurs...\n"," Not Fade Away.\n"," A really good, low budget Buddy Holly story.\n"," Rock On!\n"," Rave On\n"," A great biopic.\n"," Rock 'N' Roll Fable\n"," Great watch and takes you back to a different place and time\n"," the Legend of Buddy Holly.\n"," A refreshing look at a rock 'n' roll pioneer.\n"]}