{"review-url":["http://www.imdb.com/title/tt0046949/reviews"],"review-text":["One of the most pleasurable aspects of movie viewing is to get lost in a film. To have it totally wash over you, so that you absorb it as it is, and thus, experience it to the fullest. Every time I see it, 'The Egyptian' is such a film. Over the years it is a picture critics have loved to hate. Many have thrown darts at its vulnerabilities. But perhaps it is because of the very tone the film brings with it rather than its most obvious characteristics. It is at once forbidding, remote, possibly dangerous; beware of what lies within! The haunting chords of the music, seen over the 20th-Fox logo, usher us into titles of other-worldly turquoise lettering.Strange! Archaeological! Decadent! It is as if we are descending into some vault of antiquity, wherein might be great treasures, mixed with uncertain hazards. (One might imagine Darryl Zanuck commanding: 'Make it ancient!') Then, what a darkly dramatic story unfolds, all within the same tone set at the start.Of Hollywood's mid-50s 'Egyptian Trilogy', 'The Ten Commandments' portrayed the civilization's sternness, the phenomenal 'Land of the Pharaohs' its nuts and bolts, while 'The Egyptian' shows it all, from glamour to tragedy, for us to wonder at.No need to say much about the players here, but I think that, with the passage of time, Bella Darvi is being redeemed. What a perfect face for the role, right out of a Symbolist painting. If her acting does not please some, it might be argued that, in her role as a 'courtesan', she is obviously better in bed than yakking to some poor helpless admirer. I think that Curtiz captured the kinkiness of her sado-masochistic relationship with Edmund Purdom's character with aplomb, censorship being what it was at the time. Sir Peter Ustinov, in his memoirs, was pretty kind to 'The Egyptian', writing that it was 'like being lost in a huge set for 'Aida'. His pronunciation of the word 'beer' I have adopted myself ever after.(One of the film's historically accurate references: the Egyptian's invented beer!) Henry Daniell, egads, what a perfect performance. Gene Tierney, what a screen treasure. Bless DFZ for giving her this 'late' role. C'mon folks, don't be so hard on Victor Mature! He's a cheesemaker's son! Who rose to be pharaoh! Sounds like a peculiarly American opportunity. One of the best moments: John Carradine's existential observations on the sands of time. And Purdom's utterance about dwelling beyond the sunset of the world. If that isn't Grade 'A' epicness, what is?Of course, along with everything else, the music is sublime. It is frequently noted that Alfred Newman and Bernard Herrmann created one of the screen's most compelling scores, perfectly harmonious, yet each theme is well developed, with a life of its own. Newman, pressed for time by DFZ, called in Herrmann, someone he could trust implicitly, to take up half the burden.Benny, not the easiest guy to work with, obviously respected Newman enough to really deliver inspiring music. They alternated cues, an ingenious approach. No spoilers as to who did what here, but Benny brings an edge with him, mysterious, awesome sounds. Alfred brings fulsomeness, longing, poignancy. Both are consummately epic. Even when seen on a squeezed TV print, the effect of seeing the two composers' names side by side in the main credits, which the ultra-wide anamorphic screen could comfortably accommodate, is spine-tingling.Leon Shamroy, the Dean of CinemaScope, does not let us down here. The lurid greens and moody shadows (probably distortions in all the terrible TV prints I've seen through the years) perfectly accompany the multi-dimensional script (by the great Philip Dunne and WB vet Casey Robinson, whom Curtiz must've brought with him to 20th). How remarkable it is that Shamroy, who was as much of an institution of cinematography at Fox as Newman was with music, would lens 'Cleopatra' a few years later, but in the brighter, sharper images of '60s Todd A-O. These old studio guys are really heroes of mine.To me, who wants to fret about all the imperfections and criticism opportunities in a picture like this? I'd rather yield entirely to its spell, and dive off into its sea of lavishness, to emerge after the inspiring climax of 'The End' refreshed, moved, and hungry for more.And yes, we should cry out to 20th-Fox for a DVD release worthy of DFZ's legacy.","Few people realize it, but there was world literature in the ancient world before the Greeks came on the scene. Besides the literary remains that are in the \"Old Testament\" of the Jews, there were considerable works from Mesopotamia and Egypt. The summit of the former were the religious poetry and \"The Epic Of Gilgamesh\". The Egyptians produced many poems, but there main addition was a tale of adventure of a traveler and physician called \"The Story Of Sinuhe\". It is from this work (actually a fragment, that we don't know the ending of) that the novel \"The Egyptian\" came from.The story is unique (as is the movie). \"The Egyptian\" was a best seller in the early 1950s, and Darryl Zanuck decided to take a chance making it: yes he wanted a showcase for his girlfriend Bella Darvi as Nefer, as well as the rest of the cast (Victor Mature, Edmund Purdom, Peter Ustinov, Michael Wilding, and Gene Tierney), but he was aware that these films rarely made large box office. One can chalk up this as an example of Zanuck trying something different.The number of movies that deal with ancient Egypt are very small. \"Land Of The Pharoahs\", \"The Egyptian\", \"The Ten Commandments\" (both De Mille versions), \"Moses\", \"Holy Moses!\", \"Cleopatra\", \"The Mummy\" (all versions), \"The Scorpion King\". If there are 20 films about ancient Egypt it's is tremendous. But \"The Egyptian\" is unique. While the second \"Ten Commandments\" discusses Ramses the Great (Pharoah Ramses II - Yul Brynner) and his father Seti I (Cedric Hardwicke), and the films on Cleopatra deal with her, few other names of ancient Egypt crop up in film. Egypt's greatest Pharoah was Thutmose III, who conquered most of the known middle east of the era of 1470 B.C.E. or so. No film about him has appeared, nor of his usurping predecessor, history's first great female ruler Hatschepsut. But the only known Pharoah who attempted a religious revolution that approached what the Jews (and later the Christians) attempted - a type of monotheism - is the subject of \"The Egyptian\". This is Pharoah Akhnaton.In reality Akhnaton was practicing a personal form of monotheism that was not meant for public consumption. But it angered the priestly class who worshiped Amon, rather than Aton. Due to our uncertain historic records (although Akhnaton's official records - the \"Tel-el-Amana\" letters - are quite complete as far as they survive), we do not know if the Pharoah was killed in a palace coup or not. However he died, he was succeeded by a young brother or son of his whose name is better recalled than any other Pharoah except Ramses: Tutankhamon.This film is actually quite good as far as it goes. Wilding makes a good natured Akhnaton, who is too weak to be as effective as a religious reformer is supposed to be. Mature is good as the ambitious (and - outside the film - ultimately successful future Pharoah) Horemheb. Tierney and Purdom do well in their lead parts and Ustinov is good as Purdom's friend. Also good is Ms Darvi, in a large supporting part. In a wonderful cameo is John Carridine, as a philosophical grave robber. The film is certainly worthy of viewing, as one of the few attempts to show part of the history and culture of Ancient Egypt.","The picture narrates upon Sinuhe the Egyptian (Edmund Purdom) who works as a medic for paupers and hapless . He meets a good woman (a gorgeous Jean Simmons) and a bad woman called Nefer (a femme fatale Bella Darvi ; Marilyn Monroe lobbied hard to play her , but Darryl F. Zanuck had earmarked the role for his then-mistress Darvi) and an one-eyed , rascally servant (Peter Ustinov). After this , the physician saves and heals pharaoh Amenophis IV (Michael Wilding) from a lion and is appointed as a royal healer . In the palace court from Thebas happens various intrigues with the Pharaoh's sister (Gene Tierney) and the general Horemheb (Victor Mature)and the priest (Henry Daniel) , follower of ¨Amon Ra¨. As Akhenaten tried to bring about a departure from traditional religion, yet in the end it would not be accepted . After his death, traditional religious practice was gradually restored . The film is partially based on historic deeds and loosely based on Mika Waltari's novel . It's a slice of ancient history set in 1300 B.C and the 18th dynasty : Amenophis IV (son of great pharaoh AmenophisIII) is known as Akenaton , he was proclaimed maximum priest imposing a sole and only God , Aton (the sun God) pitting to priests worshipping Amon-Ra . Amenophis created a new city (called Ajetaton or Amarna). He was married to Nefertiti and would born Tutankhamon but Horemheb rules over and is proclaimed pharaoh . There is an Italian version about similar events titled ¨Nefertiti queen of Nilo , 1961¨ (by director Fernando Cerchio with Jeanne Crain and Vincent Price) but with lack luster and lesser budget . This adaptation by Michael Curtiz is much better with an impressive control of the crowd and scenarios . The musical score from Alfred Newman and Bernard Herrmann , two greatest cinema musicians is extraordinary with romantic and spiritual chores score . Leon Shamroy's spellbound color cinematography ensure the glimmer spectacle . The casting is of first range , they are mightier than the movie . At a cost of $5 million, the film took two years to research , the designers ultimately cataloging five million items of clothing and properties . As set design , gowns , and production are breathtaking . After shooting was completed, Fox made back some of the film's immense cost by selling many of the set pieces, props and costumes to Paramount, which then employed them in an even bigger epic, Cecil B. DeMille's Ten Commandments . The motion picture will appeal to historical epics buffs. Rating : Good . Well worth watching .","Film historians have said much about ancient epics that have been the interest of many directors from the beginning of cinema. The pioneers of such epics, particularly biblical ones, were D.W Griffith with his \"mother of all epics\" INTOLERANCE (1916), and Cecil B DeMille with his flair for magnificent spectacles, costumes and lavish scenes. Who can forget his TEN COMMANDMENTS (1923, 1956) or THE SIGN OF THE CROSS (1932)? Nevertheless, here comes another epic, made in the 1950s, directed by Michael Curtiz, and based on the novel by Mika Waltari, \"The Egyptian.\" Michael Curtiz, already famous for his great classic CASABLANCA (1941) wonderfully manages to adjust his film to the audiences of that time, to entail the most important ideas and facts from the thick novel, and to recreate the lifestyle of the Egyptians who lived in one of the most amazing periods, in the reign of Akhnaton.The first and most important fact for me in this movie is the psychological development of the main character that Edmund Purdom plays. Sinuhe, having been brought up in a simple family by his step parents, becomes a physician. All his life, he never stops asking a question \"why?\" and searching for the answer. Alluring love that he finds in a courtesan Nefer (Bella Darvi) leads him to financial and spiritual disaster. He has to repair the mistakes by hard work in the House of Death and starting to build up his reputation from nothing. First, he thinks that the only cure is revenge. However, in the long run, he realizes that \"eye for eye\" is no solution. Finally, what stands before him in very strange circumstances is the temptation to be a pharaoh. Nevertheless, there is one moment he finds the answer for his questions that touched him throughout his life... The story of the main character, though based on the book, is so interesting psychologically that every open minded person should consider this aspect in the film. The main character's psychological struggle is intensified by the times he lived in, the times when, probably for the first time to that extend, the power of sword clashed with the power of thought.Curtiz's movie also retains one rule that all films of his era kept to: great cast and lavish sets. There are mostly British actors and actresses who give very nice performances. How is it possible not to mention the mainstay of ancient epic, Victor Mature. This time, he is not Demetrius, Hannibal or Samson but Horemheb - a fighter, a lover, at last a pharaoh. Jean Simmons appears in a very delicate role of Merit, a woman who loved Sinuhe all her life but it was too late when he realized that. Peter Ustinov, probably most famous for his gorgeous performance as Nero in QUO VADIS? three years earlier, does a great job as Kaptah, Sinuhe's friend. The royalty of the film is also played by two great cast, Gene Tierney and Michael Wilding. Tierney is excellent as cold, desirous of power Baketamon, the sister of pharaoh. Wilding gives a marvelous performance as \"insane\" Akhnaton. When I was in Louvre in Paris and saw Akhnaton's original face carved in stone, he looked very much the same as the actor in the film. Bella Darvi, an actress born in Poland, is quite memorable as a wicked courtesan Nefer. And there is one more actress who appears only in one scene but whom it is hard to forget, Judith Evelyn as Taia, pharaoh's mother. This voice, these eyes!The sets are magnificent. The director recreated the most probable image of the outdoor temple of Aaton, the god that the Egyptians worshiped to in the reign of Amenhotep IV. I also loved the scene of pharaoh's first entrance. What a glorious picture that forever lasts in one's memory!!! However, there is also one aspect that I would like to draw the attention of all people interested to see the film. The Egyptian is similar to other epics in many respects, but it also stands out as a unique film. There are very few films which make such a wonderful use of different curiosities as for ancient times. There is a mention of iron used first by the Hetites. It's also the only film about ancient Egypt which talks openly of Egyptians' magnificent curing abilities. It memorably shows the contrasts of lifestyles, particularly the moment of a slave's death for whom no one cares followed by the announcement and consequently the widespread mourning after the death of pharaoh. Finally, \"The Egyptian\" shows one historical fact: there were other nations except for Jews (before Christ) where the spirit of God shone in some human hearts. Yet, the only difference was that it did not survive that long as at Jews' because it did not have a strong fundament. The scene of Akhnaton's death supplies you with so many biblical and Christian values that you may think you watch a religious movie.All things considered, I highly recommend Michael Curtiz' film. It is a great production at multiple levels: an entertainment for epic fans, an admiration of marvelous performances for cinema fans, a soul feast for spiritual people. Finally, it is a beautiful story of extraordinary things which happened thirteen centuries before the birth of Jesus Christ.","Maybe it's just a personal affection for this screen version of the  Mika Waltari novel, or a fondness for things Egyptian (I grew up loving  to visit the mummies in Boston's Museum of Fine Arts) but I think  Maltin is a tad tough on this rather good film. The production values  are great regarding color and cinematography, and it appears some  effort went into historical authenticity (much of it from the novel,  I'm sure). Purdom is admittedly a bit stiff in the lead role, but one  can accept this as part of Sinuhe's character. Victor Mature is, well,  Victor Mature. Peter Ustinov is a delight to watch in this type of  role, which he always did so well and so wittily. Bella Darvi's  performance as Nefer is classically camp, and I find even Michael  Wilding's rather dry portrayal of Akenaten to have its own appeal.  The historical oddity of Akenaten's monotheism, a brief detour in  ancient Egypt's theological history, is interesting, as is Akenaten  himself, and well worth reading about; the religious wars portrayed  here have a basis in fact.  An interesting footnote regarding Darvi, whose birth name was Bayla  Wegier: she was a Polish émigré who producer Darryl Zanuck and his wife  Virginia took under their wing (I believe they may even have adopted  her). Her screen name Darvi is formed from Zannuck's and his wife's  first names. She continued her acting career in France, but never  achieved great success and, after a rather unhappy life, died at her  own hand in 1971.  Altogether this is an interesting film and enjoyable to watch for the  visual values alone. American Movie Classics shows this occasionally in  letterbox, which is essential to capturing the scope and sweep of the  story.","It happens often, while growing up, a Hollywood movie impresses a youth. It not only lasts a lifetime, but inspire him to study ancient cultures as a career. Such was the case, with the 1954 film entitled \"The Egyptian.\" Audience were awed with the sets, costumes and great acting of this film, so much so, other films soon followed in like vain. This is the story of a young Egyptian boy who was left parent less soon after he was born. With such a dubious beginning, it is not hard to wonder why he will spend his life, asking questions. The boy Sinuhe, (Sin-oh-way) which means, 'He that is alone'(Edmund Purdom) grows to manhood and continues asking why, even as he graduates from The School Of Life to become a physician. During his formative years he acquires a lifelong friend named Kaptah brilliantly played by (Peter Ustinov), and Horemheb (Victor Mature) who raises from a simple officer of the guard to Commander of the Armies. His life offers everything from a quick rise in social status to condemned criminal, to outcast, a wondering healer, and eventually to a station in life he never expected. Fine acting goes to Jean Simmons as Merit, Michael Wilding as Akhnaton, Bella Darvi as the temptress, Nefer, and John Carradine as a memorable Grave robber. Tommy Rettig, plays Thoth, the son of the Egyptian. In his final years, 'He that is alone,' finally discovers the answer he had been seeking all his life, which he bequeathes to his son, now in the care of his lifelong friend. Excellent Film! ****","As a dedicated lover of all things Egyptian this is a classic piece from the 50's, along with my other favourite, Land of the Pharaohs\".  The sets and colours are just wonderful and everything seems so \"neat\" in the production quality.  I thought Victor Mature was well cast and Peter Ustinov a real gem!    The whole look of the movie (along with others made in this era) has an appeal that you just don't get with modern movies with all their digitized effects (I have yet to see the 1999 movie \"The Mummy but am sure I will love it!).Top stuff!","Zanuck had high hopes for this extravagant production, including a major casting coup when Brando signed on for the lead.  Alas, Brando dropped out of the project and was replaced by Edmund Purdom, whose acting is the antithesis of \"the method\".  The completed production is more a tribute to the state-of-the-art in mid-century production values and presentation than a high-quality example of epic filmmaking.  The script quality ranges from the sublime (the bordello sequences) to the ridiculous (the royal palace scenes); while the performances, even the best of them (Ustinov, Darvi, Tierney), are mundane at best.  That's not to say this picture, like most epics of it's kind, isn't a worthy indulgence.  It is, if only for the overbearing production design, magnificently intrusive music score (co-written by two legendary screen composers), and sheer extravagance of it all.  It's all relative though, since only the largest TV screens and loudest high-end sound systems can provide anything close to the experience of the 2:55-to-1 CinemaScope ratio employed, featuring dialogue-panning, multi-track stereo.  An expensive Fox laserdisc is currently the only available option for viewing this picture as closely as originally intended. It must have been quite a big deal when the movie palace curtains opened on this one in 1956!","I first saw this movie around 1968 and if I don't see it once or twice a year, I'm surprised.  I've always found it engrossing, well acted, and, for Hollywood, surprisingly accurate historically. I heartily give it 10 stars and recommend it highly!","\"The Egyptian\" has several pluses that make up for a rather slow pace. There is plenty to the story, which involves a lot of action as well as some interesting themes, and there is a lot of good scenery and cinematography. Most of the cast is pretty good, and there is an assortment of interesting characters.The setting in ancient Egypt works well and is used to good effect.  It makes for many interesting sights, which are filmed nicely and used well in the story.  The plot does a good job of weaving the reign of Pharaoh Akhenaten, who tried to bring monotheism to Egypt, into the lives of the main characters.  As the central character, Edmund Purdom is all right, but some of the other characters often command more attention.  Victor Mature is particularly convincing as the no-nonsense Horemheb, and Peter Ustinov steals more than one scene as Purdom's assistant.The only real flaw is the length.  While there is plenty to the story, there are times when it moves quite slowly, and it doesn't seem as if it would have been all that hard to shorten some of the scenes.  In particular, some of the speeches that summarize the conflict of ideas among the characters would have been more effective if they had not been quite so wordy.But overall, this is a good movie, and it works pretty well both as a period piece and as a story.","I had the pleasure to view this film when I was 10 years old,(having an existing interest in Egyptology). I know that there are subtle mistakes to the art direction and costuming, but over all this is the best film, to date with the look of the 18th dynasty.The film only approximates Mika Walteri's \"The Egyptian\", in plot. A good portion of the text never made it to film, as we have to consider the running length.The music score by B. Hermann and Alfred Newman is beautiful!!! Performances as follows. The late Edmond Purdom gave an excellent performance as an orphaned child adopted by parents past their child bearing years. He states that he keeps to himself,has the best education available and lets' face it is a rather emotionally distant person, given his upbringing and high intellect.Jean Simmons is fine as a humble tavern maid; honest loving and sincere. Bella Darvi, people complained about her accent, well she is a Babylonian. It is not that apparent in the film as to why Sinhue is so insanely obsessed with Nefer Nefer Nefer. Her correct name. In the book Sinhue is enjoying her carnal fruits and gets his revenge early in the plot by leaving Nefer Nefer Nefer's drugged body with the \"House of the Dead's \" workers.Gene Tierney as Baketaten, is brilliant! When she tells Sinhue that he is pharoah, she looks like she could devour him (in his weakness). She is intense, brilliant and coldly beautiful.Michael Wilding is heartbreakingly tragic in his mission to bring all people to know his one God. I believe that we are viewing Ankhnaten thru the lens of Egyptologist A. Weigall. A view at the time that had a pre-messiah feeling about Ankhnaten's vocation. Did his monotheism influence the Jewish people? Note Psalm 104. and other Egyption imagery in the psalms?Mr. Peter Ustinov provided the alter ego to Sinhue. He is street wise and cunning a survivor. Excellent acting as always.Mature never thought much of his acting personally, His Horemheb is fine as an ambitious \"super patriot\" who ultimately has Sinhue murder more than one person in his quest for power, (Walteri's book).I felt that the ending to The Egyptian was confusing as Sinhue's personality changes too easily. He has a living son (Toth dies in the novel), power is handed to him through is half sister Baketaten, he world savvy now and has a grip on international affairs. So he became enlightened? He could have modified the Amon Priesthood as he was capable.But NO! Sinhue gives everything up, everything including his son's future to become a ragged beggar preaching monotheistic love?This change was too immediate and the major flaw in the script!Again the look of the film,colour, most of the costumes(Nefer Nefer Nefer's gold dress was too over the top as she is more richly dressed than the royal family), music is beautiful.I will watch this film again easily.P.S. I know that you porbably know that Horemheb did not directly succceed Ankhnaten, but I could not resist stating this fact.","I'll start off right at the beginning by saying \"I like this movie.\" It's sweeping, it's grand, it's gripping and it's fun. Sinhue the physician,sits in front of his small stone hut writing his memoirs. And what a story it is! Taken from a river and reared by an elderly couple who doted on him, he becomes a physician to the poor. He befriends Horemheb who sees glory while Sinhue sees healing. And both run into the future pharaoh Anknaten (forgive my spellings), who endures an epileptic fit.And this pharaoh has another \"flaw\": He believes in one god instead of a pantheon of gods. Back then, this was totally revolutionary. Sinhue and Horemheb grow up. One night, Sinhue sees a woman who makes him lose his senses. He gives up his practice, sells his parents' home and even their tombs just to spend a night with her. Does he? I won't tell. Meanwhile, Merit, a tavern maid played with sweet simplicity belying strength by Jean Simmons, falls in love with Sinhue. She falls under his spell and under the spell of the belief in one god.Victor Mature overacts perfectly as Horemheb. Edmond Purdom is sincere as Sinhue the lost physician (does he find redemption? Stay tuned). Even Bela Darvi, the woman who steals Sinhue's heart isn't as bad as everyone has said. The fact that she was Daryl F. Zanuck's mistress had nothing to do with the casting - right? Yeah, right...still, she wasn't that bad _ I've seen worse. I think she did better in \"The Egyptian\" than many of today's young actresses have done in anything. I said it before and I'll say it again -- I like this movie. I recommend it. It makes you think despite some hammy acting. Have fun with this movie; it's worth it.","This movie tries to depict itself as a historical movie based on ancient Egyptian literature. The props are quite bad, they use Roman style dresses (late ones) but it was typical for 50ies. They also depict history in a completely wrong way, it is so bad on so many levels! Basically it is Biblical story based on pure fantasy very vaguely based on ancient Egypt. In fact it is hardcore rape of both ancient Egyptian history and the ancient Egyptian literature.First, story of Sinuhet is from The Old Kingdom. The movie takes place in The New Kingdom during the ruling of Achnaton, who was kinda crazy man who almost destroyed the country because of his forced approach to introduce new religion and abolishing of the old one. In the reality he did not care about the consequences and used terror to achieve his ends. In the movie, however, he is pictured almost as Moses, he is very wise, mild and kind. On the other hand, the general Haremheb who in reality managed to salvage the country from the ruins of the Achnaton's experiment is depicted as murderer and cruel dictator.The country was not invaded by Hittites at the time of Achnaton as the movie depicts. The decay was based solely on the new religion that is not only admired because it was the first monotheist religion, but at the very end of the movie the reality is even more twisted to the incredible conclusion that the Amon was actually the God of the Christians! This is actually very wrong even by Biblical standards, because Aton was the face of the Sun. The ankh is compared to the cross which is completely wrong, because ankh is very ancient symbol of life whereas the cross is the symbol of death / sacrifice. The fact the pharaoh decides to sacrifice himself for some reason is displayed almost like Christ-style. It is blatant and deliberate lie. It is twist of reality comparable to making movie where Hitler is depicted as nice animal loving extrovert who is forced to fight the world in attempt to defend the freedom of people of Europe. It is THAT huge bunch of lies, really! The pictures are nice. The message is sick. I really do not know what is worse there: The incredible preaching style lies or the fact the movie completely abused and destroyed interesting book of ancient literature. There is almost no similarity to the Story of Sinuhet including the ending that is absolutely wrong even in the style of the ending - the ending of original story is positive, Sinuhet is pardoned by pharaoh and he is even given a tomb which was very high honor. In this pseudo evangelic movie it ends \"positively\" also: Sinuhet is pushed into the exile, dies poor and alone yet almost screams the Christian preachings from his lips. There is zero respect to the Egyptian history. It is completely twisted just to create another pseudo Christian movie. This is so so wrong. So wrong!","Having been interested in Akhenaton for many years I was surprised to learn about this film via E-bay and bought a copy on DVD for 99p. I enjoyed the film, the twists and turns in the plot and that the file was mainly about the main character Sinuhe makes it more of a \"family saga\" rather than an action film. The costumes and attention to detail was remarkable for its time (1955). The back projection during the chariot ride now looks clumsy. My main interest was in the character of Akhenaton and his monotheistic religion. In this film he was portrayed as being \"Jesus\" like in his refusal to go to war with the Hittites even through they were invading Egypt and in his closing speech about the futility of materiality and political power. Initially one makes a connection between Sinuhe, who was cast adrift in the river Nile in a reed basket, and the Old Testament Moses. But this connection is not carried no doubt this will be fully explored in a new film wherein a Moses like character carries Akhenaton's monotheistic religion out to the wider world, if such a film will ever be politically possible to make. It is universally accepted that were women are concerned we man are stupid creatures but the relationship or lack of one between Sinuhe and Merit, the character played by Jean Simmons is hard to accept. And that Sinuhe, an educated physician, would be so smitten by Nefer the Babylonian \"femme fatal\" to the extent of giving her his adopted parents house and Tomb is not really believable, neither that his parents would even have a tomb. In real life Nefer (Nefertitti) was the wife of Akhenaton. And although Horemheb did become Pharaoh it was after a few others including Tutankhamen , who was the son of Akhenaton.But of course this is just nit picking and the film is enjoyable to watch and that it is about Akhenaton and his monotheistic religion is a big bonus. Maybe following \"The De Vinci Code\" book and film this film be re-made with the central secret being the foundation of our current monotheism! I wait in great anticipation of such a film, there are already numerous books on the subject.","It came before \"the ten commandments\" \"land of the Pharaohs\" \"Ben Hur\" and it's overlooked today.How unfair!Based on Mika Waltari's mammoth novel ,it doesn't cheapen it!Waltari's novel was so huge only a miniseries could have done it justice (I hope it will be done some day).Waltari,whose message is essentially Christian remains intact(another of his books \"the secret of the kingdom\" (first part) takes place after Christ's death in the Holy Land).\"The Egyptian\" is the rising of a monotheism close to Christianism long before Christ:the Pharaoh(Wilding) is some kind of Messiah who sacrifices his life because he knows that the true kingdom is not in the material world:he asks to return good for evil!And he has disciples ,who will eventually turn into martyrs (the scene when Simmons and the other worshippers of the Sun God are slain is visually stunning,looking like some pagan ballet).For the priests ,on the other hand,this new religion would mean the end of their influence on the populace,and that's why they look for a strong man (Mature)who can lead the army against the Hittites as well as against their dangerous compatriots.Another religion,or non-religion should we say, is Sinouhé's (Purdom)who during two hours believes in nothing (the sequence of the grain of sands is absolutely sensational and rises the whole movie well above the average peplum !!)There's another fascinating side:the movie looks like a flamboyant melodrama.Not only for the screenplay (notably pharoah's sister's (Tierney)final revelation which predates \"the ten commandments\" by two years),but also the splendor of the cinematography:Viviani ,in his book about Curtiz,talks about a Baudelairian atmosphere ,blue and gold,notably in the scenes which involve the prostitute (Darvi)who contemplates her reflection in the water of her bath,supreme narcissism. Around the hero,all the characters appear,disappear,appear again,but when they reappear ,they have followed their way and all the subplots come together with consummate skill.Besides,as such is often the case in \"modern \" melodramas ,the story is a long flashback,framed by two short sequences showing Sinouhé an old man who's remembering.This is a wonderful sword and sandals,that had a strong influence,not only in America but also in Europa,notably in Poland where Jerzy Kawalerowicz directed a spellbinding \"faraon\" (1966) which owed a lot to Curtiz.","Based on Mika Waltari's Book,This Second CinemaScope movie ever made is full of rich color,beautiful music and panoramic spectacle.The Plot sometimes gets muddled in contrite wording,But all in all it has a strong social content:Man is ruled by his emotions,and that every action has an equal consequence.But to truly enjoy this film,First see the movie,then read the book.Although different,it sheds light on a whole lot of things that were not seen on the screen,and gives breath to some more of the depth of Sinuhe.","Waltari's impressive historical fictional work,\"The Egyptian\",is a long,well-thought out,well-researched,throughly planned piece of good writing.It covers a period of about 60 years in the life of Sinhue,the narrator,and describes his life,adventures,travels,and spiritual and emotional growth in careful detail.This film adaptation covers about 20% of the original,and as a consequence,looses a lot in the telling.The technical aspects are so impressive as to warrant a Ph.D. for their efforts.And,as for acting,Tierney,Ustinov,Wilding,Simmons,Daniell,and Carradine lead a strong supporting cast.(I especially enjoyed Carradine's cameo as the philosophical grave robber,with his Nitzschean interpretation on the futility of life.He told it the way it was.)Costumes,sets,props,etc. were superb.They should have been-they spent 5 years doing the research.And Purdom was a worthy replacement for Brando in the title part.Let's face it-the film was bound to disappoint anyone who wanted the original story.I don't feel qualified to comment on Darvi's portrayal.And Could anyone else BUT Mature have carried off Horemheb?My biggest criticism comes to the pacing.It does drag.But watch it for a well-done,thoughtful epic.","The behind-the-scenes story here is that Bela Darvi - atrocious and wooden in a key role - was in fact the main squeeze of 20th Century's Daryl F. Zanuck who liked to arm-wrestler men half his age. Purdom was almost as wooden, and the rest of the cast didn't jell either, although Michael Ansara as a Hittite commander and Victor Mature as his Egyptian counterpart stood out. However, the Egyptian atmosphere and costumes and sets are well worth a look; this production did not skimp on money. Give it a try.","If you ever have read the book I'm sure you will hate this movie as I do. This movie is spoiled in it's Hollywood directing-style and for real, taking off the best parts of the book. The whole idea of the book is that Sinuhe's life in unhappy and everything goes wrong and in this movie it's not like that. This movie, in it's Hollywood glory sucks. Chraracters doesn't look like they're described in the book and they left half of the event off. I do understand that though as it's movie and it has to be under 3 hours long but still, why drop the most important ones off? I can't honestly say anything good about this movie to anyone. It has nothing same than the characters as the book. Read the book and don't just watch this because it gives really wrong image of it.","Having read all of the comments on this film I am still amazed at Fox's reluctance to release a full screen restored version in DVD. Yes, the history may be a bit inaccurate and it is certainly not as powerful as the book, BUT it was the 2nd film by Fox made in Real Cinemascope and the production values alone merit a restoration and distribution. I saw this film in second grade and it triggered my lifelong interest in all things Egyptian, culminating in my visiting Egypt 4 years ago! Amazing the power of film on a child's imagination, eh? In high school I read the book and made a promise to myself to one day take that dream trip. Now, true this film was made in the \"old school\" style, meaning that Egyptians were portrayed by pink skinned and blue-eyed Brits. However, has anyone seen the current HBO series \"ROME\"? Everything old is olde again. One can't imagine why in this day and age we are still casting actors mincing around as Mayfair aristocrats in Roman drag. Not one actor on ROME could pass for an ancient Italian. That being said, the AMARNA period in Egypt is still one of the most fascinating events in human history. This film is immensely appealing ( to borrow a word from NEFER) for its historical information (BEER! BRAIN SURGERY! IRON!) and its gorgeous cinematography and score. I have a dreadful Taiwan DVD version which I watch over and over again praying that one day a true restored widescreen version will be available. For anyone else interested in this subject I highly recommend the historical novel \"A God Against The Gods\" by the author of Advise and Consent. If anyone of you film buffs out there knows how to contact Fox to urge them on, please let me know!","I am surprised that so many comments about this film are positive. Having read the book several times (and all the other historical novels by Mika Waltari) there is no way to say much good in this film. If I forget the origins of the story I might consider it a reasonably good epic. Of course to bring such a brick of a book to the big screen is a task not to be envied, but it could be done with class. I can't understand why even the name of Nefernefernefer had to be shortened to just Nefer. I love Peter Ustinov as Kaptah and Marlon Brando probably would have made a better Sinuhe but the overall attitude is too Hollywood to ever make justice to the book. Mind you Mika Waltari left the Premier of this film in the middle of the showing. That's how much he liked it.","In comparison to other \"sand and sandal\" fare, The Egyptian leaves much to be desired. The film is very LOOSELY based upon Mika Waltari's well researched novel, which centers around the Egyptian physician Sinhue's adventures at the court of Akhnaton as well as his travels throughout Canaan, Minoan Crete and Africa. Unfortunately, due to the moral strictures of the time, much of Sinhue's story (which is rife with romantic and sexual exploits) remains on the cutting room floor and instead, the audience is treated to reels and reels of Victor Mature's wooden acting. Even Gene Tierney  a leading lady \"staple\" of the time  can not manage to look nor act her best in this flick and gives a rather somnambulistic performance which can only be justified by the fact that the actress was having some serious psychiatric problems at the time. There is a great deal of rhetoric and theological machinations over the idea of monotheism vs. polytheism, but Michael Wilding is so tiring as the revolutionary Akhnaton, that one is surely cheering for someone to off him and restore the old religion before the second reel. My advice: buy the book from E-Bay, rent something more entertaining like Solomon and Sheba and then call it a night!","This Fox spectacle was a big hit when released in 1954. Sumptiously produced, with great music and sets, intriguing cast, it moves slowly, but interestingly. Edmund Purdom is very handsome as an Egyptian (vaguely resembling Rock Hudson, but thinner, with poor posture), who becomes a renowned doctor, juggling three stunning women: a handmaiden Jean Simmons who passively adores him, temptress Bella Darvi who eludes him, and a pharaoh's sister Gene Tieney who wants him as HER pharaoh. The movie's popularity has not waned, since being re-shown on AMC (preferably in widescreen). Purdom is particularly great, his character apparently striking out with the women, and ending up never married and a \"thinker.\" Darvi is amazing and tantalizing in her femme fatale role. Victor Mature, Michael Wilding, Peter Ustinov co-star. Check it out.","Personally, I regard \"The Egyptian\" in an extremely favourable light.It was introduced to me by a well-known Australian movie commenter & critic named Bill who was renowned for his insight & broad vision of people & places & particularly of films. This movie fitted the Bill perfectly & I came to appreciate his commentary & enthusiasm for this movie that emerged all the more as I watched it, as I was literally drawn into it, minute by minute, beyond his introductory comments, on my initial viewing many years ago.To me, it was propelled, layer upon layer, within half an hour, into an intriguing & fascinating production! Yes, I am aware of its flaws! But it was so enticing  the young man of idealism learning from & inspired by his father  the peasant treated like rubbish in his suffering  the opportunistic friend however flawed but nonetheless loved by his friend, the central character Sinute  and to be sure, a flawed hero too, like so many across humanity of all societies & across all timebut lovable & worthy of love too! Yes, I believe in a Christian God, but too, I acknowledge the rights & respect that should be due ANY human being of good heart, who would not or will not disrespect the rights of his fellowman without just cause. As such, I endorse this film & its presentation of a man of good heart & conviction in his belief in the sun-god he was devoted to. Such people will always be welcome in my world vision, and hopefully, in many more beyond.So too, the drama in the ensuing movie I have watched often as surely as it has touched my heart & soul, as surely as it seems to have infuriated critics in its era. It is captivating, watching the struggles & grief & loves of Sinute, the physician! When I watch it again, I am always reminded of my friend in heart Bill, the film critic, who dared to oppose ALL the critics long ago who rubbished it. He added criticism of too many critics  that they make statues to honour stars, on the screen or in history, but they do not make statues to honour critics! And beyond all this, I am reminded with each viewing of a SUPERB & TOUCHING spectacle, of a beautiful & well-presented drama, that was not just relevant to the 1950s or some bygone era. It was meant for YOU & ME, across time & place, to every man & woman & child & to their personal aspirations for love & freedom & overcoming obstacles to misunderstanding & gross injustice & tragedy appealing to those of simple faith of many religions, that it seems too many regard as cause for war! Take a night off from invitations or unjust violence, from bigotry & judgemental attacks on others injustly executed & consider the merits of this offering. Not to the sun god, or to power that proves time & again to be so transcient .. let this OUTSTANDING movie wash over you, like waves onto a beach, like the passing hands of time  like life was meant to be. And maybe, you will find yourself carried into its world of possibilities! Lost offerings no more! 9.9 out of 10!"],"review-user":["Gooper","theowinthrop","ma-cortes","marcin_kukuczka","rupie","thinker1691","Amadeuss","TheVid","Mr Skoooooter","Snow Leopard","oldfamilydentist","MISSMOOHERSELF","the_wolf_imdb","bo_tsang-1","dbdumonteil","Dan Briggs","hans101067","Kirasjeri","lomelindi-1","tommyscan-1","CattyA","quidditchqueens","twanurit","spj-4"],"review-date":["23 August 2004","22 May 2006","7 July 2005","13 November 2005","2 July 1999","18 June 2007","23 June 1999","15 May 2003","2 March 2000","15 March 2002","29 June 2009","16 January 2007","1 October 2013","22 May 2006","30 May 2003","14 December 1998","10 December 2000","17 August 1999","7 April 2005","28 April 2006","31 December 2006","30 March 2005","26 April 2001","12 December 2005"],"review-rating":["10","8","6","8","7","9","10","10","7","7","2","9","8","10","6","1","9","3","3","8","10"],"review-title":[" An Ancient Saga as Wide as the CinemaScope Screen!\n"," And starring Bella Darvi!\n"," Spectacular movie about ancient Egypt history based on historic events\n"," When the power of sword clashed with the power of thought...\n"," Maltin's too hard....\n"," \"Imortality? I hold it in My Hand.\"\n"," Classic 50's movie\n"," This splendidly lavish film of Mika Waltari's tediously philosophic potboiler set in ancient Egypt, was ripe pickings for Darryl F. Zanuck's CinemaScope agenda.\n"," A Superb, interesting, and well acted Movie.\n"," Several Strengths Make Up For A Slow Pace\n"," Egyptophiles will \"dig\" this pix.\n"," Swords and Sandals Saga\n"," Perverse rape of Egyptian history\n"," An enjoyable film and interesting sub-plot\n"," The great lost epic.\n"," Beautiful Picture, Strong Social Comment\n"," Well-Researched,Overly Talky Epic\n"," See It For The Art Direction!\n"," This is ruining of the great book!\n"," THE Egyptian , A forgotten gem\n"," What a disappointment compared to the book\n"," A dull treatment of an outstanding novel\n"," The Thinking Person's Spectacle\n"," Critically condemned - UNJUSTLY!\n"]}