{"review-url":["http://www.imdb.com/title/tt0069089/reviews"],"review-text":["I first saw Pink Flamingos in the mid 70's, back before VCRs.  A college dorm had rented a print, and in a drunken state I've not achieved again this past quarter-century, I went to see it.  Having finally seen it again only recently, this time sober, I'm here to tell you... it looks a hell of a lot better when you're drunk.  Those who call it \"great\" or a \"masterpiece\" are plain wrong, they don't recognize what they are seeing. The camera work is a hair's breadth above home movies; the acting and story are... well, they are better than in porn flicks and even some straight-to-video movies, but, jeez, not by much.  And then there is the primary purpose behind Pink Flamingos -- to make the most disgusting, revolting movie possible, perhaps even conceivable.       But... BUT... Pink Flamingos is distinctive.  Even if you - yes YOU out there - the reader, wanted to make the most disgusting movie in the world and even if you had the money and the skills that John Waters lacked in 1972, you couldn't make a film as good as he did.  Yes, GOOD!  You couldn't because, first of all, I doubt you have the same quality of acquaintances that Waters had and put into into his early movies.  And it's not just a matter of WHAT they will do, but HOW they do it.  Waters' actors had a style, no matter how bizarre, that is rarer than most depravities.  Could YOU recognize the virtues of, let alone even find, someone like Edith Massey?  I doubt it.  Which leads to the second point.     Pink Flamingos has panache!  It has a free-wheeling sense of daring-do that borders on innocent fun. So, although the movie is so disgusting that I wish it had never been made, it is not a squalid film.  And I don't think YOU, the reader, or anyone other than Waters could have pulled that off.  It doesn't make Pink Flamingos a masterpiece.  It does make it unlike any other film.","\"Pink Flamingos\" is a cult classic.The plot of this film revolves around the throwdown challenge to Divine's supremacy as the filthiest person alive.\"Pink Flamingos\" contains some memorably repulsive scenes like a sex scene with a chicken and the scene where Divine eats fresh dog feces.Yes,the movie is shocking and funny at the same time,but the biggest laughs come from the actors' lines.Check out especially this line from Divine:\"Kill everyone now!Condone first degree murder!Advocate cannibalism!Eat s***!Filth is my politics!Filth is my life!\".On the whole,I really enjoyed this film.Still its tagline \"An Exercise in Bad Taste\" should be taken to heart and even those used to the gross out movies today may find this gem hard to stomach.Highly recommended.","On the surface \"Pink Flamingos\" could easily be dismissed as a nostalgic piece of shock cinema. With an unparalleled level of notoriety -- based almost entirely on the final scene, the film has become a curiosity of sorts and a right of passage for those testing their own boundaries of decency. Beneath this seedy exterior however, lies a brilliant and biting satire of society's obsession with fame and the lengths one will go to in order to achieve it. This theme is relevant even more so today than it ever was. Just consider the over abundance of reality TV shows, for example 'Fear Factor'  a show boasting contestants eager and willing to outdo one another by performing a variety of dangerous stunts and eating unimaginable specimens  how is this any different than the characters in 'Pink Flamingos' attempting to outdo one another in an effort to claim the dubious title of the filthiest people alive? Society is (and has always been) captivated with sensationalism; from the Roman era and the coliseum packed with bloodthirsty audiences, to modern day and the likes of the 'Jerry Springer Show' (of which Babs Johnson and the Marbles would make excellent guests!!). The purpose of \"Pink Flamingos\" is to not only put a hilariously depraved spin on the fascination with celebrity but to also provide a cautionary tone to the dissolution of society itself. The performances are all top-notch; especially the ever-dependable and over-the-top Mink Stole, as heartless Connie Marble; and scene stealing Edith Massey, as Edie 'The Egg Lady'. It's amazing that the film is over thirty-years old because the message is just as fresh today as it was back in 1972.","Like those who listened to radio reports about the attack on Pearl Harbor, every one who has ever seen PINK FLAMINGOS can tell you exactly where they were when they first saw it--and some thirty years later the movie is still one of the most unspeakably vile, obnoxious, repulsive, and hilariously funny films ever put to celluloid, guaranteed to test the strongest stomachs and the toughest funny bones.Filmed with a close-to-zero budget and some of the shakiest cinematography around, PINK FLAMINGOS tells the story of two families that compete for the tabloid title of \"The Filthiest People Alive.\" Just how filthy can they be? Plenty: the film includes everything from sex with chickens to what I can only describe as a remarkable display of rectal control to a heaping helping of doggie doo, and I guarantee that you won't want to eat an egg for at least several weeks after seeing it.The cast is either wonderful, atrocious, or atrociously wonderful, depending on how you look at it. The star, of course, is Divine... and to describe Divine as the BIGGEST drag queen on the planet would the understatement of the year. She is a mammoth creature given to BIG eye makeup, BIG orange hair, and BIG expressions--she is the Charleton Heston of drag, and whether she is almost running down a jogger, pausing to use the bathroom on some one's front lawn, or startling real-life shoppers by taking a stroll along a Baltimore sidewalk she is both unspeakable and unspeakably funny. Others in the cast include Mary Vivian Pearce, Danny Mills, and the ever-appalling Edith Massey as members of Divine's family; and Mink Stole and David Lochary as the white-slaving, baby-selling couple who challenge Divine's status.It should be pretty obvious that PINK FLAMINGOS is not exactly a movie that will appeal to just every one, and viewers who know director John Waters only through such later films as HAIRSPRAY and CRYBABY will be in for a major jolt. But if you want to see something so completely different that even Monty Python couldn't imagine it, this is the movie for you. Just make sure you eat before you see it, because you probably won't want to eat afterward--and you might want to keep a barf bag handy just in case.Gary F. Taylor, aka GFT, Amazon Reviewer","Babs Johnson (Divine) lives in a trailer with her son Crackers, her daughter Cotton and her mother Edie (Edie Massey). She's in competition with a couple named Connie and Raymond Marbles (Mink Stole, David Lochary) to be named the filthiest person alive. The film shows their attempts to outdo each other.This film is very much NOT for everyone. It's a in your face no holds barred assault in bad taste. Crackers has sex with a woman with a live chicken between them while his sister watches; the Marbles pick up female hitchhikers, impregnate them, keep them chained in the basement and sell the babies to lesbian couples; Divine and family have a party which includes cannibalism etc etc. It's disgusting but, in a way, not unwatchable. It's SO over the top and is so unapologetic about it that it's kind of fascinating. As director John Waters might say, it's bad taste done well. Also it's kind of amusing to watch--the acting is so wretched (especially by Massey) that you just watch it in disbelief. A friend laughed out loud at how bad Massey was (she improved in later pictures).This is NOT for people who are easily offended. Even though it's over 30 years old it's STILL shocking. However if you have an open mind and can take a lot of extreme behaviour this is a must-see. The only part that really was too much is what Divine does at the very end.","There is no film to put beside Pink Flamingos by way of comparison. It is a film genre of it's own. I read and hear reviews of this movie that express disgust and horror and I picture John Waters chuckling. This was the intent, it was meant to upset the status quo and in \"politically correct\" times that we live in, isn't it a small surprise to see this film come to the forefront again? This is a movie that will freak out the uptight for as long as it exists in any media. It was meant to. As much as \"Clockwork Orange\" talked about \"ultraviolence\" this movie is all about ultra-bad taste. We can numb ourselves to sex and violence but Pink Flamingos is a movie you just will never get used to. There will be something in this movie that will get to you. As a last resort to make sure everyone is offended before you leave the theatre, John includes the always discussed poodle scene. No reason for this scene, except to make sure he gets you and also to make sure you leave talking about it. Obviously filmed on a budget, and using Water's stock cast, this is a movie simply about a contest to see who are the filthiest people alive. All the characters are bizarre in one way or another. This movie reminds me of \"Rocky Horror Picture Show\" in that everyone in the film has something odd about them and both movies joyfully celebrate these uniquenesses. Not a movie to buy for Mom on Mother's Day... but worth seeing just to say you did.","My 10/10 rating of course applies only if you're willing to get completely and utterly grossed out*. Because you know that only John Waters can do that. In \"Pink Flamingos\" (his directorial debut), he portrays two families locked in combat to see who can be the filthiest person alive. What Divine famously does at the end pretty much answers the question. But even aside from that, the movie is basically an excuse to shock people beyond what anyone would usually imagine. You had better have a very strong stomach to watch this movie. Even some of the lines are rather mind-blowing.*Otherwise, avoid this movie like you would the ebola virus!","The filthiest person alive, Divine, is using the codename Babs Johnson and living in a trailer in the woods with her retarded mother Eddie (Edith Massey), who loves eggs; her mad hippie son Crackers (Danny Mills); and her mate Cotton (Mary Vivian Pearce). The envious couple Connie (Mink Stole) and Raymond Marble (David Lochary), who abduct and impregnate female hitchhikers to sell their babies to gay and lesbian couples, using the money to invest in heroin and sell in schools, hire Cookie (Cookie Mueller) to have sex with Crackers and spy Divine to compete for the title of \"the filthiest people alive\". When the competition begins, Connie and Raymond Marble learn why Divine has this title.The underground \"Pink Flamingos\" is outrageously sick, disgusting and grotesque but also funny. John Waters' intention is certainly to shock the audiences and is certainly very well succeeded. The bizarre characters present some of the most scatological and gross scenes I have ever seen, like Divine chewing excrement of dog, or Crackers \"singing\" with his anus, and there is no limit for the sick mind of John Waters. The viewer has to have empty stomach to see the whole movie. In the Extras of the DVD, John Waters presents deleted scenes, inclusive with the fate of Cookie. The trailer used to promote the film in 1972 is hilarious, since it does not show any scene, but people being interviewed about the movie. My vote is five.Title (Brazil): \"Pink Flamingos\"","A very strange, disturbing but intriguing film.  I don't think I ever needed to see what a human being can do with his butt, and I doubt if I'll ever want to see it again.  That said, there is much to be amused by, like Divine's take on Jayne Mansfield's classic walk in \"The Girl Can't Help It\" and putting slabs of meat between her legs in a grocery store.  A gritty feel very much like a Russ Meyer film.  Generally poor acting, with the notable exception of Divine.","What's there to say about \"Pink Flamingos\"? It is beyond criticism or even explanation because it doesn't really aspire to be like any other movie you've seen. You will either get it, or you won't, laugh at it or roll your eyes in disgust (or both). John Waters is an odd filmmaker (putting that mildly), mixing both innocent, childlike humor with shockingly offensive moments intended to...well, who knows what his intentions were. It is like a form of assault, albeit a funny one.The thing that makes Waters's humor so infectious and effective is that his characters inhabit a world that can seem both alien and completely familiar to the viewer, like the petty rivalries that form the plot of \"Pink Flamingos\". Surely everyone has experienced this kind of thing at some point, but almost certainly the matter at stake was not the title of \"The Filthiest Person Alive.\" What makes the movie compelling viewing for me is the way that Waters creates giddy, self-contained environments and doesn't let you in on the joke right away. The people in his films are completely in tune with one another. For instance, when Cotton tells Babs that she doesn't want to accompany her into town because Crackers is bringing his \"lady friend\" out to the trailer, Babs reacts with a knowing smirk and says to her, in a conspiratorial aside, \"That little shed's just PERFECT...\" At this point, we do not know yet that Crackers plans to take his \"lady friend\" out to the shed to thrust live chickens at her naked body while Cotton watches orgasmically through a window, but this weirdness is totally commonplace and understood by the characters in the fictitiously degenerate world that Waters creates.Another example would be the conversations between the girls in the basement and Channing, the Marbles' deviant butler. The first time we see them, Waters cuts jarringly from a scene in Connie's cozy office to Channing descending into the basement, where we see that there are two women down there, one dead and one very much alive and p***ed off. Susan is not a cowering victim, but is enraged and abusive to Channing, leaping up to launch a full-scale verbal attack on her jailer. They both have a weird understanding of the bizarre situation, and she is not so much intimidated by her kidnapping as she is violently insulted and righteously furious. She does not let up for one second while Channing is in her sight, and the two scenes that feature their delirious banter are two of the comic highlights of the film. Later in the film, when Divine and Crackers break into the Marbles's home and discover their crimes of keeping abducted women in their basement, it represents the total lack of support that Divine and her family have for the brand of depravity that the Marbles are pandering--here is something Divine is unfamiliar with, a corruption devised by her newfound rivals, and she despises it. Furthermore, while kidnapping does not seem like something Divine would think twice about, she is indignant that the girls are being held down there and happily sets them free, relishing the revenge that they take on Channing.At the other end of the filth spectrum, Waters occasionally reminds us of the line between his twisted fantasy world and the \"real\" world. The first time we see Connie, she is belittling a minor character named Sandy Sandstone, who has never heard of Divine. Cookie, on the other hand, reacts with a hilariously matter-of-fact evaluation of Divine's title as the \"filthiest person alive\", revealing that she inhabits this world of unspoken and understood lunacy as well.Something also must be said for the way the players are in touch with their respective roles, especially Divine, who doesn't miss a note. Not once does he falter in the ridiculous garb and character he's been given, and it takes \"Pink Flamingos\" to a new level or weirdness. People actually believed Divine was like this in real life, and it's easy to understand why, because while watching the movie, you're not really thinking about the movie, you're thinking about these people who made it. Since they're really doing the outrageous things in the script, you start to think that maybe this is not a story but a bizarre documentary.But even more so, \"Pink Flamingos\" is not so much a movie as it is an event, or something that happens to you. Even though its shock value is mostly gone for me now (I say mostly because the a**hole scene and the chicken scene still make me wince), I still find this film to be hilarious and habit-forming.","This movie has absolutely no cinematic value. Orgasmo would win an Oscar compared to this piece of trash. I don't see anything entertaining about screwing a chicken. John Waters stated that they got the chicken from a slaughterhouse and it was set to be killed anyways. WHO CARES?! Waters is going to die someday, too. Maybe we should just shove a watermelon up his butt and see how much he's willing to do for the sake of a movie. At least he would have a choice. The chicken was raped and killed. It doesn't matter if you like chickens or not, or what worth you think they have. They are a living creature that does feel pain. And anyone who is okay with that is a morally desensitized individual. I pity them.","\"Pink Flamingos\" will always be known as the film with \"that doggie-poop scene\". Starring the divine Divine, the film explores the outer limits of sick humor. Divine and her brewd compete with another family to see who is \"the filthiest person alive\". Have a guess at who'll win that one!?John Waters' early \"camp\" films are not for the average viewer. You must appreciate this man's form of art, but it definitely IS art! Later films like \"Hairspray\", \"Cry Baby\" are geared at a main stream audience, for which the filmmaker had to \"tone it down\" considerably. For the College Camp Scene though, there is no substitute for the original 70's camp mastrpieces.For anyone who is a John Waters virgin and would like a recommendation for the next \"project\", I suggest \"Female Trouble\" . There's so much more to John Waters' vision, realized through his muse Divine. The visually stunning, grotesquely overweight transvestite is quite credible as \"Dawn Davenport\", the high schooler who burned her small-town bridges when she didn't get her \"cha-cha heels\" for Christmas in \"Female Trouble\". There are many scenes that are definitely not for the squeamish, highlighted by the moment where Dawn gives birth (alone) and bites the ambilical cord (like primates would do), then, without losing a beat, gets up to confront the newborn's father via a pay phone.If \"Pink Flamingos\" entertained you without giving your stomach a turn-over, then you can handle anything delivered by the creative genius John Waters. As all directors, Waters has had a few duds, even if they were box office successes. Avoid the made-up-as-they-go \"Pecker\", a total waste of time. The musically sparcling \"Cry Baby\" was trashed by critics, but the sound track makes up plenty for a lousy script. The one to beat is the 1988 \"Hairspray\", Divine's swan song. \"Pink Flamingos\" is the ONE that started it all and put Waters on the cult-city map of the world! Just to be safe, have the movie first -- then the dinner!","if i could rate it a zero i would , coming from someone who likes shock/exploitation films of the time and Waters overall i must say this is useless.It does nothing , serves nothing , an idiot with a camera and a urge to prove his cleverness by rebeling against social standards is all this comes off as.Its entirely amateur , both in principle and execution , it doesn't have a point , its digusting for the sake of disgusting ,obscene with the wit of a neanderthal , its useless.Someone said Waters was probably \"chuckling\" over all the bad press and disgust others gave with this film , but why? If i made a short film depicting a man in a bathroom taking a sh*t for ten minutes straight surely it would receive the same accomidations but why would i be proud or \"chuckle\" at that? Would it be because i am so unintelligent that i have to resort to this so i can say \"HA! Take that censors and mainstream! Im so rebellious ill do whatever i want and film it!\" No.Waters shouldn't be proud of this mess , fans of waters shouldn't watch it , its useless , that is , without any use.Its doesn't even fit under the criteria of art for arts sake.To like or defend this movie is to defend something that was designed purposely as being anti-culture to be pushed for the mainstream audience , in modern terms this film is the Hot Topic of films.Useless and Obsolete. A Poser film that demands it be acknowledged as rebellion .","I've heard so much about this movie for so long, I finally rented it out of curiosity.  For the record, I *LOVE* off-beat, unusual, irreverent and offensive movies.  This film, however, just plain STINKS.  It looks like every scene was shot with a hand-held camera by someone who just drank twenty cups of coffee (tripods aren't that expensive).  I was going to mention how terrible the acting is, but it isn't really fair to call it 'acting' - it's just a bunch of talentless shmucks shouting their lines. And the dialogue - pathetic and unbearable.  I actually had to force myself to sit through the whole thing just so I could say that I had actually seen the entire movie.  I honestly think that a group of twelve-year olds could make a better film.  It's not even bad enough to be good, like 'Plan Nine from Outer Space'.  One out of ten.","Trying to not \"overanalyze\" itthe film seemed to be trying to \"shock\" the audience, but in today's \"Two Girls, One Cup\" world it was anything but shocking. I guess in 1972 (pre-internet days) we were not as de- sensitized. Anyway if you take away the shock value, I'm not sure what is left. The one really funny bit (to me) was the second flashing incident where the \"girl\" flashed him back and the flasher fled in panic. I don't know why but that was just plain funny to me. The BJ scene was pretty good but was edited out during the theatrical run. Also, I'm trying to remember when Deep Throat came out. It seems like around that time people were trying to push the borders of what a \"legitimate\" theater might show (remember \"Fritz the Cat?\"). I'm glad they pushed, but even so, have we made progress in showing nudity in mainstream theaters? I don't think so. Even today, I don't think the DVD BJ scene could be shown in a legit theater. Again, thank god for the internet. Nowadays anyone with a cell phone and a computer can be a filmmaker as good as this film (and they frequently are).","Someone told me that Pink Flamingos was, in a word, \"insane\". Now I'm doubting whether this guy actually ever saw it, because that isn't the way I would summarize it in one word. Disgusting, absurd, um, more disgusting...would do it. Every time you think it can't get any more filthy, it does. One of my particular \"favorites\" was when Divine had her birthday party and when the cops came to bust it up, they were butchered and eaten by the guests. I admit that it's one of those movies where it's so grotesque you simply can't look away, but this is by no means a creative work of art. It's pure shock value.On the upside, it makes the Jackass guys look like a bunch of pussies.","Pink Flamingos is a vile movie.  Not only does it deserve a deffinate X rating... But it shimmies it around with pride!  What comes over someone's mind to make such a movie is beyond me.  The only thing good this movie shows anyone is what this world is coming too... or rather where it (saddly) has already been.  I have find it hard to say I like something that is a little over the line in the past.. but have I have... but this takes the cake (so to speak).  I can't say that eveyone won't dislike it nor can I say that everyone will like it... but what I can say is that I would honestly question my humanity after watching this movie.. if I liked it.  Sure... 'it is' just a movie.. but there is a place and time in life when we must take a stand... and if this movie 'does' do anything it shows us that.  How is having sex with a chicken, eating people alive, incest, and pornography entertaining?  That I don't know...  Saddly I honestly can't say that this movie doesn't strike some curiosity.. but I asure you that that is all that it does.  Pink Flamingos has a deffinate unforgettable ending... that you wish you could forget... which you probably have already heard about. Pink Flamingos is not well made or will it ever be a 'true' classic... I acually sit down wondered what would come out when writing this review.. its a good thing I did, so I too can understand why I couldn't or rather shouldn't like this film.....","A fat transvestite eats dog s**t. Wow, legendary. You can see that kind of thing on a daily basis in any lunatic asylum in any country in the world. Or on MTV's \"Jackass\".The only difference between Divine and countless thousands of nuthouse inmates who ate poo or smeared urine into their ears is that Divine had someone film him do it.If you're into people eating kaka, I suggest you try it yourself. Perhaps there is a latent desire for it, you never know. You might discover a hobby you never knew you wanted.As for me, I feel as though I'd eaten a turd myself, just by having watched this mostly dull garbage. I had to wash my mouth and face, just to be on the safe side. I also had to slap myself on the cheeks a few times, so I wouldn't doze off - but that was during the movie.I have mixed feelings about people who enjoyed this movie. I am torn between pitying them for their cluelessness on one hand, and envying them for their lunacy on the other. I often entertained the thought of becoming a happy loon; they seem to have so much fun, seems like such a blissful happy-go-lucky existence... Alas, becoming a loon is extremely difficult if one isn't genetically programmed for it. You can't force these things.PF isn't a bad movie because it's perverse or disgusting. It's bad simply because it was made by rank amateurs. I've seen plays in schools for the mentally challenged with more emotion, dedication, and preparation. Ask yourself just one thing: is it difficult to make something that is base, with the sole purpose to be disgusting and shocking? Making a piece of crap like PF is the easiest kind of movie-making there is. The only easier thing than filming PF would be to not make a movie at all: a road John Waters unfortunately never took.And that's why Waters made this kind of film. He had no choice, the poor sap, that's all he CAN do...","Amazing to see that people actually like a movie that intentionally was meant to be a bad one. Bad script, bad acting and bad filming. From the top of my head, the three main elements to make a bad movie. Quite clearly, Waters made a huge effort trying to make this movie suck. He sure did succeed. So sad to see the sheep flock that tries to make arguments for why Pink Flamingos is a good movie. It's worthless sh*t, and it was supposed to be. Try to imagine music, literature or art that is made bad by intention, which probably have been done a lot of times, and it will probably give you some perspective on why a bad movie isn't a good one, in ANY context.","I like weird, I like obscure, I like camp. I HATED this movie.I have liked some of Waters' later movies, and in interviews, I like the man himself.But this movie turned my stomach from the get go.  I think I only lasted 20 minutes top.If you are determined to see this movie, I would suggest watching it at home with soda, crackers, and the stop button on your VCR remote handy. Perhaps in small doses it would be more bearable.","I understand that this movie is supposed to be disgusting, but I really didn't think that the animal cruelty (raping a woman while throwing chickens around and squishing them between their naked bodies) was very cool. I was completely disturbed. There is no reason to harm innocent animals for the sake of entertainment. They could have used fake chickens, but these were obviously real chickens and I found it completely barbaric and crude. Anyone who is an animal rights activist, or just loves and respects all animals (and all of God's creatures), would not find this very funny or entertaining. The writer should be ashamed of himself. The film could have been made without the abuse of helpless little animals of any kind.","After 38 years, \"Pink Flamingos\" is still one of the most brilliantly distasteful films ever brought to screen. John Waters is widely known for very crude humor and grotesque perversions as a main theme of his films, and this is doubtlessly his most extreme, and most memorable film. The obese transvestite Divine plays Babs Johnson/Divine, matriarch of a demented family, who has been justly crowned the filthiest person alive. Divine's family members are a granny obsessed with eggs, her son Crackers (Danny Mills) who has slightly unorthodox coital preferences, and a Miss Cotton (Mary Vivian Price), their trailer-mate who has a somewhat unorthodox relationship with Crackers. An equally bizarre married couple, the malicious Connie (Mink Stole) and Raymond Marble (David Lochary), who abduct women and have them impregnated by their house servant in order to sell the babies to lesbian couples, are obsessed with stealing the title as the filthiest people alive from Divine and her illustrious family...This small summary will hardly prepare anyone for the outrageously filthy and magnificently offensive scenes in \"Pink Flamingos\". Even today, this film includes some of the grossest sequences ever captured on screen, and one is often not sure whether one is about to puke out of disgust or laughter. Some disgusting highlights include Crackers having a date that includes sex acts with chickens, a man with a 'singing' anus, Divine performing oral sex on her film son, and Divine eating actual dog-crap (for real!). This truly isn't for the easily offended, and even I, an avid fan of controversial cinema, find it hard to look at at times. However, it is a positive disgust, as the gross stuff on screen is simultaneously insanely funny. I first saw the film several years ago, and, in spite of knowing about its reputation, I wasn't prepared for it to be such a magnificent exercise in epitomizing bad taste. I have since seen it several times, showing it to other people, who were usually about as surprised as I was when first seeing it.\"Pink Flamingos\" is a film that is absolutely gross and should probably be avoided by squeamish, easily offended pansies. However, it is also an incredibly hilarious gem that must not be missed by anybody interested in crude black humor and cult-cinema. This film truly is one of its kind, and simply has to be seen to be believed. I cannot even imagine what controversy it must have caused in 1972, when it still stands proudly as the ultimate highlight of grossness and filthy hilarity. See it!","''Pink Flamingos '' is...disgusting! I don't know a better ''adjective'' to give to this movie right now. It is bizarre,politically wrong and has a lot of unexpected things, such as the final scene, where Divine eats a dog's feces.(And this is only ONE of the shocking scenes,since I am not including the sex scene involving a chicken,Divine performing oral sex on her son, a musical scene with a fully exposed gesticulating anus, and so on!)The plot: Divine lives under the pseudonym \"Babs Johnson\" with her mentally challenged mother, Mama Edie, her son Crackers, and Cotton, a travel companion. They reside in a mobile home on a road, far away from any people who could annoy them.After finding that Divine had been named \"the filthiest person in the world\", a rival family, the Marbles, set out to destroy the tight-knit family but come unstuck in the process. By the way: The Marbles own an \"adoption clinic,\" which is actually a black market of babies. They kidnap young women, artificially inseminate them with sperm from their manservant and sell their babies to lesbian couples. The proceeds are used to finance a network of dealers selling heroin in inner-city elementary schools.Ps: This movie is not for everybody, so, if you are the type of person politically correct, don't watch this movie. I personally think it is funny, but I know this movie is not to be taken in a serious way.","A friend showed me this movie yesterday and I viewed it with no expectations or knowledge of what it was. It reminded me of a movie that middle year high school kids would make, there are no funny jokes, the plot line is lame, the acting is unashamedly bad - for very large stretches it is boring, but that boredom is interspersed revolting elements - like a guy showing his naked rear end on screen for a long period, someone torturing a chicken to death during a sex scene, divine eating a piece of fresh dog feces. I don't understand what anyone could get out of it, and I don't like seeing animal cruelty. What offended me was not that the chicken was killed, but that it was tortured.","******************* CONTAINS SPOILERS ************************ If you're here like me because you're into weird movies, I am warning you, you're going to have a terrible time. This movie was a waste of my time and I still think of what a bad time I had while watching it. If you're in doubt whether to watch it or not, follow my advice and go see another disturbing movie, but not this one. I have seen some perturbed movies like \"964 Pinocchio\" & \"Enter the Void\" and none made me feel the way I felt after watching \"Pink Flamingos\". If you decide to ignore me and watch it anyway, I'll just list some of the most disturbing scenes of the movie. Don't worry I wont spoil the storyline because there is no plot at all, just bizarre and revolting scenes. 1. A man completely naked opening and closing his anus 2. Divine eating dog feces (which sadly, are real) 3. The emasculation of a man 4. Two persons having sex while crushing a live chicken to deathIf you agree and think that any of the things listed above are acceptable and worth watching, then go ahead. I'm not saying that I don't enjoy movies that make you feel sick by the end, however I prefer ones where the actors are remotely good and where the plot is more interesting than 'who is the filthiest person alive'.\"Pink Flamingos\" is not a movie where you contemplate life at the end and makes you think about a deeper meaning. John Waters just wanted to shock the audience with disgusting scenes. It will gross you out, but that was Waters intention. Overall the acting is crap, the editing was horrible and I could write a better plot than this. I would rate this 0/10 but the lowest is 1/10."],"review-user":["roarshock","HumanoidOfFlesh","Vancity_Film_Fanatic","gftbiloxi","preppy-3","Schlockmeister","lee_eisenberg","claudio_carvalho","funkyfry","GroovyDoom","deosil1977","mdm-11","jtspitz","Ron L","nwsts","leylacoleman","Vertigo-27","fedor8","coalesce","100watts","laceysmurf","Witchfinder-General-666","Lady_Targaryen","rabbitunleashed","oscar-egb-93"],"review-date":["3 July 2000","20 October 2003","10 December 2004","21 May 2005","18 April 2006","1 November 2000","18 October 2005","11 September 2006","29 October 2002","14 January 2005","20 February 2006","12 October 2004","22 March 2008","7 December 1998","19 September 2010","2 February 2005","3 April 2000","12 July 2009","5 March 2006","24 September 1999","28 July 2005","26 July 2010","8 October 2006","5 August 2014","27 June 2013"],"review-rating":["9","8","8","7","10","5","7","9","1","1","1","1","3","1","1","1","10","5","1","1"],"review-title":[" It may be cheap and revolting, but it's got style.\n"," Wonderfully filthy classic.\n"," They just don't make 'em like they used to.\n"," The Original Trailer-Tacky Barf-O-Rama\n"," A must-see----kind of\n"," Y'all Ain't Ready For This...\n"," Yep, it's real!\n"," Outrageously Sick, Disgusting and Grotesque But Also Funny\n"," Fascinating\n"," That little SHED's just PERFECT!\n"," Pink Flamingos Sucks\n"," Who's the filthiest woman alive?\n"," Don't defend this useless piece of film.\n"," Ed Wood could have made a better movie.\n"," Poor in 1972 AWFUL in 2010\n"," if you are going to waste ninety minutes of your life, watch this movie\n"," Pink Flamingos Is Too Much...\n"," The only difference between Ed Wood and Waters is that the latter wears a mustache.\n"," Maybe the worst movie ever made.\n"," One of the few movies that I've walked out on\n"," Absolutely horrible!\n"," Fabulously Filthy, Gloriously Gross\n"," An exercise in poor taste..\n"," Boring, disgusting\n"," Not even a little entertaining...\n"]}