{"review-url":["http://www.imdb.com/title/tt0023153/reviews"],"review-text":["... in this rather muddled tale involving a love quadrangle. The four corners of this quadrangle (in order) are engineer Jim Leonard (Humphrey Bogart) who is the protective brother of chorus girl Linda, who is the secret mistress of Bruce Hardy, who is the financial adviser and suitor of poor little rich girl Carol Owen (Dorothy McKaill) who falls for Jim Leonard. As Jim Leonard says to Carol, \"Can you read blueprints?\". If you can, you might have a chance of following this busy little precode film. Add in one more important character - a sleazy guy who wants to star Linda in a revue financed by Hardy's money. What really hurts this movie is that the subplots don't really gel that well into one well integrated plot of a movie. Also there are some lines that you wait to hear that you never do. For example, when Carol brings Jim over to her mansion for a party the serious upright young man is obviously disgusted by Carol pretending to auction off her servant Kibbee like he was a piece of furniture to her drunken guests to offset her losses in the stock market. Jim walks out without saying goodbye. However, the next time the two meet Jim soft soaps the entire affair. I really wanted him to tell her off. What saves the film are the fine performances and the fact that the subplots are interesting enough even given the lack of motivation for the players' actions. It's truly interesting to see Bogart playing a rather shy very scrupulous engineer - what a great smile he has! Dorothy McKaill is quite good as bored rich girl Carol who is trying desperately to fill up her day with fun things to do when her real problem is that she's lonely in spite of her busy social life. She really had a great voice and did good work here. It's a puzzle to me why she didn't really do that well in talkies. I'd recommend it to fans of McKaill and/or Bogart and to anyone interested in films of the early 30's.Best precode moment - Jim has spent the night with Carol and is standing at the base of the stairs wearing the clothes he had on when he got there last night - a tuxedo. He's surprised by Carol's butler Kibbee. Jim then tries to stutter through an explanation of why he is there at 8AM in formal attire. Kibbee plays the part of the father figure that pretends to be convinced of his grown daughter's chastity when he knows otherwise and this is one of the few times you'll ever see Bogart behaving like a tongue tied teenager on film.","Humphrey Bogart in his first starring role looks very young, acts well, but has a pronounced lisp only hinted at later in his career. Still, he's very good and very appealing as the idealistic young inventor of a new airplane motor.Dorothy Mackaill is the real star here, playing a once-rich woman who's torn between her real love for Bogart (he's broke too) and the comfort and security of marrying an older man (Hale Hamilton).Along for the ride are Astrid Allwyn as Bogart's trampy sister, Bradley Page as her would-be producer, Barbara Leonard as the cosmetologist, Jack Kennedy as Gilligan, and Halliwell Hobbes as the faithful (and wise) butler).Both Mackaill (whi had been a star in silent films) and Bogart were trying to gain a toehold in talkies in 1932. Bogart was a slow-rising actor from the Broadway stage; Mackaill was slipping and would soon appear in skid-row production like PICTURE BRIDES. Yet they are both very good here. Mackaill wasn't even 30 when she appeared in this film!","\"You were on your way up and you tripped on a skirt !\" Gilligan says to Jim Leonard. That sums up the plot of this story of up and coming Leonard (a YOUNG Humphrey Bogart) when his dream gets sidetracked by the bombshell heiress Carol, played by Dorothy Mackaill. Leonard has been working on a new and improved motor, but now his love life and motor company both have their ups and downs in this 68 minute shortie. Bogart hadn't developed the quiet, brooding style yet. Good performances by most of the supporting characters - her butler, his co-workers, a sister, interlopers along the way. Some adult themes, since it was done just before they really enforced the film code, but it's still tame compared to what is on TV today. Directed by Thornton Freeland, a year before Freeland directed the incredible \"Flying Down to Rio\".","In 1932, Humphrey Bogart was a relative unknown--an unproven actor who was starring in one of his first films. And, because he was an unknown, the movie they gave him was clearly a B-movie--a quick film with relatively low expectations. After seeing it, I could see why it would still take Bogart many more years AND another film studio before he became a household name. While the film isn't terrible, it certainly isn't good--making it more of a curiosity than anything else when seen today.Bogart is a pilot who has dreams of building his own aircraft engine company. However, when a vacuous rich playgirl comes his way, his dreams all seem to go on hold. As one of the characters in the film said, the combination of the two is like oil and water--they just don't mix.While Bogart is throwing away his promising career, his sister is going full speed on the Road to Skankville--having met a sleazy guy who convinces her to sleep with rich guys so they can shake them down for tons of cash! Bogey has no idea his sister ISN'T the actress she claims to be and doesn't realize later that the rich woman he loves leaves him for the same guy whose mistress is....Bogart's SISTER!!! All this leads up to a finale that is reasonably enjoyable. However, what follows is one of the dumbest scenes I have watched in a very long time! By now, the rich lady is not going to marry the guy sleeping with Bogey's sister (whew!) but because she's now poor and no good for Bogart, she's about to fly away and kill herself. Bogey finds out, chases the plane on foot, jumps on the plane as it's taking off and crawls up the fuselage to take control of the plane and save her!!! This is so utterly silly and ridiculous, I found myself laughing out loud. Up until then, I might have scored it a 4 or 5--this sunk the movie to a 3 (how one reviewer gave this an 8 is beyond me).The bottom line is that this was a talking and silly film. On top of that, it's all wrong for Bogart, as the action hero at the end and the simpering lover are horrible matches for his persona that was so wonderfully created in the early 40s. Manly and solid better suits the man--one of America's great actors but clearly out of his element here.By the way, those who love Pre-Code films and their very adult sensibilities may want to see this one. Practically everyone in the film believes in and practices pre-marital sex and Bogey curses in the film--things you never would have seen after the toughened and more moralistic Production Code was adopted in 1934.","Filmed in 1932, \"Love Affair\" has traces of the silent film era coming to a close, particularly in the wide eyed and innocent faces of the two female leads, Dorothy Mackaill as free wheeling socialite Carol Owen, and Astrid Allwyn as struggling actress Linda Lee. Linda is the sister of Humphrey Bogart's character Jim Leonard, a former flight instructor with bigger things on his mind, as he seeks financial backing for his new airplane motor that he touts as the \"greatest motor in the world\".The only trouble is, wealthy businessman Bruce Hardy (Hale Hamilton), who's willing to back Leonard, is also backing the penniless Carol Owen, who is completely in the dark about her financial situation. Hardy wants to marry Owen, even as he entertains an occasional dalliance with actress Lee, all without the knowledge of any of the other players. When Jim Leonard meets Carol, he is immediately smitten with her looks and charm, and begins spending time with her at the expense of the new company he's just formed. But there's a nagging feeling in the back of his mind that he's just not worthy of big spender and girl about town Carol.There's a well done counterpoint at the beginning of the film when Carol first meets Jim. She requests him for her first flying lesson, and he obliges by performing some daring flight stunts, chock full of rolls and dives. As Carol turns green (you can tell, even though the film is black and white), she returns the favor once on the ground by giving Jim a harrowing ride into town in her roadster.At sixty eight minutes, the film is probably just a bit too short to effectively tell it's tale. There are a number of quick cuts and fades that create a somewhat choppy feel, though they are coherently done and maintain the flow of the story.In what could have been a disastrous ending, Carol, unwilling to marry Hardy for his money, and too embarrassed to come crawling to Jim, leaves a suicide note for airport manager Gilligan. As can be guessed, Jim races after Carol who's about to take off for a one way solo flight, and manages to create some tension as he hangs on for dear life of his own before scrambling into the cockpit of the airborne plane. The movie closes on the two lovebirds as they head off into the skies, Bogey thumbs up to indicate everything will be A-OK.Humphrey Bogart had five films under his belt by the time \"Love Affair\" was released. This would actually be his first leading role, and though capably done, it would be a few more years before he got to portray real meaty characters like Duke Mantee in \"The Petrified Forest\" (1936), and \"Bugs\" Fenner in the gangster drama \"Bullets or Ballots\" (1936). As a Bogey fan, I recommend them all, even if you're not.","a film with Bogart could not be bad. that is the start point to discover Love Affair , a nice movie who has only the sin to present too much pieces in a short time ignoring, in many scenes, the links between them. without be memorable, it is a decent film. interesting not exactly for the story itself - many movies from the same period are result of same clichés/solutions - but for the old flavor and for the actors. Jim Leonard is a special role by Humphrey Bogart, clear, innocent, precise, vulnerable and that is a great virtue of film. Dorothy Mackaill has a beautiful role as the poor rich/poor girl who represents, in fact, the portrait of a world. a story who has inspired solutions for the complicated plot . and that represents the real important thing in its case.","On Humphrey Bogart's first trip to Hollywood, he got his first leading man role in this B picture Love Affair. The first thing you ought to realize is that this film has absolutely nothing to do with the classic Love Affair later in the decade with Charles Boyer and Irene Dunne or the two remakes that followed. It's not half as good any of those films.In fact Bogey is second billed to Dorothy Mackaill as a spoiled heiress who finds out she's been living her extravagant lifestyle courtesy of her late father's best friend and financial adviser Hale Hamilton. It comes as quite a shock to Mackaill. She considers a show business career as a way for an income.Bogart is a test pilot who is also an aeronautical engineer and he's designing an ultimate airplane motor and is looking for investors. Mackaill is willing to do it, besides she likes what she sees in Bogey.Considering the cynical roles that Bogart later made a specialty, it's a bit disconcerting to see him as this highly moral and self righteous character in Love Affair. The part doesn't wear well on him.Love Affair is your average B program second feature, nothing terribly special about it.","Socialite (Dorothy Mackaill) takes flying lessons from a pilot (Humphrey Bogart) who has invented a new kind of plane motor. The two begin a romance but, despite caring for him, she proves to be a bad influence and his career suffers. When she suddenly finds herself broke, she decides to marry a man with more money so she can help Bogie with his dreams. Lackluster pre-Code drama of interest only for an early starring role for a fresh-faced Bogart. He does a decent job here but doesn't give any indication of his future superstardom. There are some scenes where he plays awkward and a little shy. That's not something you saw much of later in his career. Dorothy Mackaill is lively and less stagy than the normal style of the time. The supporting cast is adequate with no standouts. Best parts of the movie are the flying scenes and one scene where Mackaill is speeding in a car. Also some pre-Code elements some viewers might get a kick out of, such as suggested premarital sex. The story and romance are flat, even by 1932 standards. For Bogie completists and airplane enthusiasts only.","Love Affair (1932) ** (out of 4) Predictable and rather boring love story about a rich social girl (Dorothy Mackaill) and a hard working man (Humphrey Bogart) who hopes to build airplane engines. The two of them start up an affair but he slowly begins to lose sight of his dream while falling in love with her. She also has other things on her plate including a rich man (Hale Hamilton) who has his own plans for her. I was really looking forward to this small drama mainly because it was the first major role for the young Bogart. I must admit that I found a little entertainment in watching him play the clean-cut good guy but the screenplay is so predictable that one will quickly lose interest in the film. To make matters worse, the films runs a brief 68-minutes but it feels double that. The screenplay really doesn't do a thing right as it's never really romantic, it features no laughs and in the end it seems as if you've really not even watched anything at all. I'm really not sure what the purpose of the movie was as the screenplay is so confused in what it wants to say that we never really know if we should care about Mackaill's character or if we should see her as some sort of villain. Even worse is the ending that really comes out of nowhere and amounts to nothing more than silly melodrama. What keeps the film watchable is Bogart who actually manages to turn in a nice performance even if it is a tad bit strange seeing him act without that Bogart persona, voice and attitude that we'd see even in his smaller Warner roles. Bogart plays the happy-go-lucky role pretty well and he doesn't seem to have a problem with the smiling and charming. I must admit that he has one of the strangest ways of standing around (with his arms behind his back) but this too is rather funny. Mackaill isn't bad in the film but she's not all that good either. I think she has a little charm but the role of the rich spoiled girl has been played so much better by so many people. It does seem she has a rather bad timing as there's one scene where it appears she accidentally hits Bogart in the face (the driving sequence) and then another where she walks straight into a chair (when their going to get her a cup of coffee). In the end, this isn't a horrible movie but it's not a good one either and without Bogart it would have been totally forgettable. I think even Bogart fans will find themselves bored so this is certainly only recommended to those who want to see everything he's done.","***SPOILERS*** A young and boyish looking 32 year old Humphrey Bogart doubles as both flight instructor and inventor Jim Leonard a man with an idea-the perfect motor- who's time has yet to come. It's Jim who loses his interest in inventing the ultimate automobile motor when he falls heads over heels in love with \"Gold Digger\" with a heart of gold Carol Owens,Dorothy Mackaill, whom he took for a ride flying loops & circles and figure 8's at the beginning of the film. So smitten was Jim by the rich and classy Carol that he lost his interest in both flying as well as inventing and spent all his time trying to get her to tie the knot and settle down with him. We soon find out that Carol is not the poor little rich girl that she wants Jim to believe that she is . Carol-who doesn't known it- is in fact poor but not rich at all without even as much as a pot to pi** in with her family financial adviser as well as no so secret secret lover- who's always trying to get into her pants- Bruce Hardy \"Harr Harr\" Hardy,Hale Hamilton, having lost her family's money in the devastating 1929 stock market crash.There's also Jim's kid sister Linda Lee-obviously a made up name- played by Astrid Allwyn who involved with con artist boyfriend Georgie Keller, Bradley Page, who's using her to get very friendly with Hardy. That's to get him to finance a play with the money-$10,000.00-that he gave Jim at Carol's insistence to start up his motor producing company in far off-from NYC-Detroit. That plan on Jim's part ends as soon as it starts with him paying all his attention on Carol then on his job that like the stock market soon goes bust.***SPOILERS*** All this confusion comes to and end when Jim finds out that both Carol whom he was made to think was rolling in dough is dead broke and that his sweet and innocent as the morning snow little sister Astrid was as big if not a bigger gold digger then even Carol is. And is involved with the sleazy Georgie who's taking her , by promising her the world, for every dime that she has. It's then that Jim put an end to all this by cold cocking Georgie-with a solid straight right- and knocking some sense into his kid sister's head. As for himself he goes back to flying planes this time around with Carol doing the driving or flying. That almost has him drop from the plane that she's flying without a parachute and end up breaking his neck. That's until Jim took control of the aircraft and landed it safely.","This is a typical romantic drama that audiences were used to seeing in the early days of the talkies. But this one shows a very young Humphrey Bogart in a early leading role as Jim Leonard, an aeronautical engineer working on a new airplane motor invention. He needs some investors. In the meantime he gives flying lessons to a heiress named Carol Owen ( Dorothy Mackail ) who's father has died & turned all his affairs over to her financial adviser & lover Bruce Hardy ( Hale Hamilton ) who is secretly courting Jim's sister who believes she's an actress & doesn't know. Carol & Jim fall in love & Carol wants to help Jim further his career financially so he can get a patent for his new airplane engine. But Carol learns from Hardy that he's been supporting her all these years & that she's broke & penniless & can't help Jim & feels she's not good enough for him & so she wants to end her life by going on her first solo flight. When Jim hears about all this he makes a dashing effort to chase her down at the hanger to stop her from flying & grabs hold of the plane as it is taking off & climbs into the cockpit to take over the controls.The movie has some great scenes of some daredevil flying stunts which is kind of entertaining. This is a very different Bogart very early in his film career & one we're not used to seeing. But to audiences of the early 1930's it was not a surprise to see him in this type of role as a romantic lead. Bogart often played romantic Juveniles on the Broadway stage in the 20's & 30's. He shows no signs of what he would later become except for one scene when he discovers that Carol's suitor Hardy is also courting his sister. Enraged Jim confronts Hardy & punches him out. A sneak preview of his \"tough guy\" image established 3 years later on stage & screen as Duke Mantee in \"The Petrified Forest\" & later refined as Roy Earle in \"High Sierra\" leading to his stardom. Bogart was quite handsome as a young man & he looks like a matinée idol. This was at a time when movie stars had to be good looking & it's ironic that Bogart achieved stardom later when his features turned rather grim & rugged but as a handsome young man he didn't get noticed. Bogart's pre-star film career is interesting & fascinating because these movies show a different kind of Bogart unlike what he later became & what he's most remembered for. It looks like in this early stage the studio was trying to turn Bogart & George Raft & other \"good looking\" young men into Rudolph Valentino's, it didn't work. Fans of pre-code cinema & Bogart fans should watch this at least once for it is an interesting curiosity & a revelation into Bogart's earlier acting career.",". . . for the money-grubbing miserly weasels that they are in this Depression Era LOVE AFFAIR. By the close of this story, Bogart's \"Jim Leonard\" character is told that the same Two-Timing Rich Dude has knocked up his little sister, filched his invention, and stolen his fiancée. Since Mr. Moneybags only cares about his Mountain of Gold, he rides off into the LOVE AFFAIR sunset with 100% ownership of Jim's Brain Child, leaving little sis Linda ruined in a Fate Worse Than Death (if she's even still alive), and Jim settling for sloppy seconds from the Big Shot's Beauty School Drop-Out. LOVE AFFAIR is just one example of many movies from this era urging Everyman from Anytown, USA, to grab his pitchfork and skedaddle on over to the next C of C meeting to straighten out America. Now with the Citizen's United Decision and the Rich Party's declaration that they'll never again vote on Supreme Court nominees save their own, it's too late for pitchforks to do any good. As the ending of LOVE AFFAIR suggests, One-Way Missions will be required of most every normal American to reclaim our Homeland for our children from the Vacuous Villain Class, represented here by \"Bruce Hardy.\""],"review-user":["calvinnme","drednm","ksf-2","MartinHafer","classicsoncall","Vincentiu","bkoganbing","utgard14","Michael_Elliott","kapelusznik18","gullwing592003","oscaralbert"],"review-date":["2 January 2011","9 February 2008","2 December 2009","7 December 2009","29 June 2005","1 May 2015","2 December 2009","27 June 2017","7 January 2010","8 September 2017","21 August 2011","16 February 2016"],"review-rating":["6","8","7","3","6","4","5","5","5","6"],"review-title":[" Bogart is a bookish Beechhurst flyer...\n"," Cute Film\n"," One of Bogart's early roles\n"," A muddled plot and a silly ending explain why this was not Bogart's breakout film.\n"," \"If we go out some evening, you'll see more of my shoulders than I see of yours.\"\n"," decent work. and little more\n"," Engineering A Romance\n"," \"You know you're a pompous old ass, Gilligan.\"\n"," A Different Looking and Sounding Bogart\n"," A man and his motor\n"," A dashing handsome Bogart as a matinée idol !\n"," Humphrey Bogart exposes the Fat Cat One Per Centers . . .\n"]}