{"review-url":["http://www.imdb.com/title/tt0099512/reviews"],"review-text":["\"Ernest Goes To Jail\" is probably the BEST \"Ernest\" film ever made out of all of the films. Jim Varney once again gives us more laughs as he plays the idiotic Ernest P. Worrel. In the movie Ernest is assigned jury duty for a murder trial. Nash (who wants out of prison badly) the man who is on trial looks exactly like Ernest, and switches places with Ernest to escape from prison. So in the process, our rubber faced nit wit gets to spend some time in the slammer. Jim Varney once again does an excellent job as the bumbling fool Ernest P. Worrell as well as escaped criminal look a like Nash. I thought it was cool how Varney switched continuosly throughout the movie with the 2 characters. Overall this movie rules!!","Some may say that people will get tired of Ernest. It's hard to believe. He's been gone for 11 years and there's still no sign of people forgetting Ernest. If people were tired of him much earlier on, why, I ask you, did Varney make 4,000 commercials? Yes, 4,000. I didn't add an extra 0 here. That's unheard of with any one else. Varney was the only one to reach cult status with 30 second ads. I don't even like commercials and I found his thoroughly entertaining. I loved them so much,I bought them on DVD. With that said, \"Ernest Goes to Jail\" is hilarious. And, we get to see him play bad-guy, Mr. Felix Nash-quite a difference from Ernest's goofball slap stick. Nash is far from Ernest, being organized, clever and mean. In this installment from the Ernest line, Varney shows off his God given rare talents. Looking in the mirror in jail, he tries to come off as Nash by using different voices and facial contortions. It never fails to make me laugh. The ink pen scene is classic. It's so funny watching him try to clean off the ink only to smear it worse all over his face. Plus, he gets electrocuted 4 times in this movie. \"Hey,Vern! No one gets electrocuted like Varney, KnoWhutImean?\" The beginning of the movie has Ernest trying to start the floor polisher only to have it take on a mind of its own by dragging Ernest all over the floor and up the wall. Ernest's screams are just adorable. Especially 4 minutes and 34 seconds into the movie. Any other jail movie would be loaded with violence and bad language and the fact is, I wouldn't care to watch them. This is probably the only jail movie that was free of vulgarity and was still a treat to watch. Varney made his Ernest movies kid friendly-for all ages to enjoy. C'mon, we all know that Ernest was Jim's true calling because mostly everyone refers to him as Ernest. And no one will ever be able to replace him. I know that Vern missed Ernest. He even left a note for Ernest at www.vernssuicidenote.blogspot.com. I've read it. It's quite humorous as well. When I first saw \"Ernest Goes to Jail\" at 14 when it first came out, I wanted a house like Ernest's, right down to that cool washer and dryer. The 'electric toothbrushes' would be pretty nice to have, too. Brush all your teeth at the same time in half the time. We all know that Jim paved the way for people like Jim Carrey and Larry the Cable Guy, but Varney kept it clean. Though, Jim Varney is still my number 1. Of course, with any Ernest movie, it will receive the highest rating possible.","This \"Ernest film\" is a typically silly, stupid-at-times one but still wholesome in its humor and sometimes very funny.The best moments in here, at least the ones that made me laugh hardest, were in the bank with Jim Varney (\"Ernest\") and a runaway vacuum cleaner. Yes, there is a lot of juvenile humor in here, but the totally-innocent lightweight humor is fun.Varney also does some imitations in here, and he's quite good at it. He's done this in several of his movies and it is always entertaining.For those wondering about their young kids watching this, there is absolutely no offensive language in this movie, too. Now that's a rarity for a 1990 film.","Ernest Goes To Jail is the 3rd installment in the popular series, and in my humble opinion, the best. Jim Varney brings so much humor and character to the table in whatever he is in. So many jokes in the Ernest movies I did not get as a child, however, after viewing them as adults, I find them even more funny. Ernest was actually quoting Shakespeare and his arrogant soliloquies were classic. Varney shines in this movie:doing all the different voices, faces, and characters we have grown to love. What I really like about this film is his portrayal of Mr. Nash,the villain. Jim Varney does a complete 180 turn from his bumbling, idiotic Ernest P. Worrell. The look, the voice, and the attitude are very different from the other character, which is a what a good actor should do if playing 2 roles. Varney pulls them both off remarkably well. Also Chuck and Bobby provide great slapstick humor as always, and this film is a comedy classic that can be viewed by all ages. Jim Varney left this old world way too fast, but he also left us comic treasures in film such as this movie.","If I had to decide which was the best Ernest movie, and don't act like that sort of thing doesn't happen all time, it would be this one.All of the Ernest movies are entertaining, but the best ones are the ones that have Jim Varney doing a number of different characters. Additionally, I am known to enjoy the comedy stylings of Bill Byrge and Gailard Sartain as brothers Chuck and Bobby Tulip. \"Ernest Goes to Jail\" contains all of those elements as well as a funny script and a supporting cast that features several beloved character actors.And that is why I have chosen \"Ernest Goes to Jail\" as the king of all Ernest movies. Disagree with me if you must, but deep down you know I am right.","Jim Varney, Gailard Sartain, Barbara Tyson and Randall 'Tex' Cobb star in this 1990 comedy sequel. the late, Varney returns as bumbling, nice guy, Ernest who works as a custodian at a Bank. Soon, he's assigned jury duty and finds himself in jail when switched with a dangerous, look-alike criminal, Nash (Also played by Varney). Ernest tries to act like Nash to avoid suspicion with help from felon, Lyle (Cobb) and eventually escapes after gaining an electromagnetic ability. He tries to stop Nash from robbing the Bank and taking over his life. Tyson plays Charlotte, a bank secretary who likes Ernest and Sartain plays Ernest's pal, Chuck who works as the bank's security guard. This is my favorite of the Ernest films and Varney was great in both roles. I recommend this.","This time, the lovable dimwit gets summoned for jury duty, where a corrupt attorney notices that he looks like a jailbird who wants to break out, so the two get switched. Of course, most of the movie is a series of gags; in \"Ernest Goes to Jail\", most of the gags relate to electricity. I really liked the whole vacuum cleaner sequence early on. Overall, the point of the movie is just to have fun, and I'm sure that you will. This is possibly the ultimate movie that you watch with a bud. It's quite safe to say that Jim Varney will truly be missed. Knowwhaddamean? FYI: the only other cast member whom I recognized was Randall \"Tex\" Cobb, who played Lyle. You've surely seen him somewhere.","The last good Ernest movie, and the best at that. How can you not laugh at least once at this movie. The last line is a classic, as is Ernest's gangster impressions, his best moment on film. This has his best lines and is a crowning achievement among the brainless screwball comedies.","As you probably know I commented on Ernest Goes to Camp back in November. Ernest is a custodian in a bank and to his boss Mr. Peddlesmith he is a screw up who can't get anything right. So his assistant Charlotte helps Ernest and tells him about being a clerk and what it takes. Ernest and his dog take a bath to get ready to go to dinner with Charlotte. Ernest gets called to jury duty but he won't be at jury duty for long soon his enemy Mr. Nash gets Ernest arrested. All the staff at the bank think Mr. Nash  is Ernest. Mr. Nash wanted Charlotte as his girl toy. And Charlotte thinks he's gone whacko. But when thing the staff don't know is that Mr. Nash planned to rob the bank. Ernest gets zapped at jail but he escapes and burns the whole jailhouse down. Then the police find out who the real Mr. Nash is and tell him he'll never get away with what he did.","**May contain Spoilers** Okay, I just finished watching Ernest goes to Jail. I had seen it before when i was a kid, so a lot of it came back to me as i was watching it tonight. Basically, it's an alright film. I wouldn't go as far as to recommend it, but i will way the pros and cons for you to decide. The movie is not really funny, it's humorous. Nothing you would laugh out loud at, except for maybe the infamous \"Ink Pen\" scene in the courtroom. Personally, I love Jim Varney, and I enjoy the Ernest character enough that i can sympathize out of a certain nostalgia. Varney is surprisingly convincing as the \"Nash\" character of a mean-streaked jail bird. But thats as far as i'll go with the critique`. Here are the main elements that make this film watchable and even enjoyable. Because of the recent death of Jim Varney, and the speculation i've heard that he was actually a pretty cool and very intelligent guy in real life, there is some sort of fascination you can have with him. If you watch this movie not as a comedy, but as a b-movie, it works pretty well, for the following reasons: 1. a small role for Charles Napier, of Russ Meyer fame. 2. the inclusion of \"Tex\" Cobb of various b-movie fame, also that killer performance in Raising Arizona. 3. Cobb has some sort of a reverse-afro-mullet going on. 4. Ernest shares the screen with his other self \"Nash\" and they ensue in an on screen fight, which is of course varney vs. varney, sort of like ash vs. evil ash. 5. Ernest's house is wildly eccentric. 6. Ernest gets electrocuted about 6 or 7 times 7. Prison guards that wear bright pink uniforms 8. And lastly, a bit of dark humor particularly in one scene in the last 20 mins of the movie where Ernest is taken to the electric chair to be executed. A guard asks Ernest if he would like a cigarette before he goes, and Ernest replys with something to the note of \"No thank you, cigarettes will kill you.\" Now you may be wondering how that is funny, aside from the obvious paradox. Well here's why, Jim Varney died at the fairly young age of 50. He died from lung cancer. He was a heavy smoker. So cigarettes did kill Ernest. When I heard him riddle off that line about cigarettes killing you, it turned my stomach in a morbid way. So theres your dark humor.","Bank janitor Ernest unwillingly switches place with lookalike convict Felix Nash. Now Ernest is stuck in prison and has to figure out a way to survive until he can set things right. Jim Varney plays both parts, of course. Oh, and I forgot to mention Ernest gets super powers in this one. Yeah. Let's face it, Ernest movies are about as low-brow as it gets. But they also can be entertaining. This one's no \"Ernest Goes to Camp\" but it's better than the rest of the dreadful Ernest movies from the '90s. It's admittedly pretty dumb stuff but if you shut your brain off for awhile and let your inner kid out, you might find some laughs here.","Handyman Ernest is called up for jury duty where the crook on trial realizes that he's a doppleganger for his incarcerated boss. After a convoluted switch Ernest if behind bars while his evil counterpart Nash is working night security at the bank, planning to rob it and make moves on Ernest's girl.It's a familiar plot, and the production values are not that great (what's with all the pink lighting in jail?) but Jim Varney's mugging and the story's eccentric imagination make it a fun watch. It's a tighter movie than Camp though, which I felt was a bit of a false start to his big screen adventures.It's hard to believe Varney was only 40 at the time of filming, and that he'd only live another 10 years. As crass as the Ernest movies might be they are a constant reminder of an actor who's abilities were wide, but never got the recognition he deserved.","Best Ernest movie of the series but have more to watch yet. mediocre comedy but still the best yet i have seen short and sweet review","I have to be in a special mood to watch this, but it's one of those movies that I watch with my dad, and we end up holding our sides from laughter.'Ernest goes to jail' is the only one of the Ernests that I can watch on a tolerating level. Although the more I've watched it with my dad, the more I've come to enjoy it. The movie is filled with quotable lines and memorable moments that just get funnier by the moment. Hats of to Jim Varney. Even though this movie really doesn't take itself seriously, he puts on an incredible performance playing two difficult roles on opposite extremes. He nails both roles to perfection. Maybe it's the family tradition that has made me warm up to this movie. Maybe it's the over-the-top drama or the quotable lines, but one thing is certain, it's never fails to make me laugh.","With the 'Ernest' film series, there are people who get much entertainment out of them and finds a lot of appeal in Ernest. There are also people who dislike, or even outright hate, the films and find the character annoying.For me, while they are not great films, the 'Ernest' films are mostly silly harmless fun that don't try to be any more than they need to be. They're mostly uneven but entertaining in a guilty pleasure sort of way, and Ernest is the sort of the character one can relate to easily. The sort of character that is a well-intended serial bungler with a strong heart but always finding himself messing up. 'Ernest Goes to Jail' is the third of the series, after 'Goes to Camp' and 'Saves Christmas' (both uneven but fun too), and is one of the better ones too.'Ernest Goes to Jail' may not be great. It does look cheap and does betray low-budget. Some of the slapstick once again gets a bit childish and overdone. It's not hard to figure what goes on next in the story, such is its predictability. Lastly, the ending is overblown and insultingly dumb, Ernest films are not known for their logic but this ending throws it out the window and urinates on it.Varney however is immensely likable and a lot of fun as Ernest, while also excelling surprisingly well on villain duty and as Auntie Nelda. The supporting cast are much better than the one in 'Ernest Goes to Camp' (though not on the same page as Douglas Seale in 'Saves Christmas'), with a scene stealing Gailard Sartain and Randall \"Tex\" Cobb charming in a good guy role.The music is an energetic nostalgic delight, and most of the gags and dialogue while admittedly silly are a range of making one amused to having one in hysterics, all done harmlessly and with no signs of distaste. Good too that the sentimentality was quite a bit less here. Despite being predictable, the story in 'Goes to Jail' feels like there actually is one at least and it goes at a zippy pace, the best paced of the series so far at this point.In summary, guilty pleasure fun. 7/10 Bethany Cox","No matter what the situation, Ernest always brings the laughs and this one is no exception. John Cherry keeps the laughs flowing nonstop from scene to scene. I even like his Rube Goldberg-like contraptions at his house since I'm a fan of this stuff. If I were to single out the funniest scene it would have to be the one where he's the old lady. Hilarious! RIP Ernest P Worrell","Ernest Goes to Jail (1990): Dir: John R. Cherry III / Cast: Jim Varney, Gailard Sartain, Barbara Bush, Randall \"Tex\" Cobb, Bill Byrge: Average comedy that treats its prison theme with contempt. The next film should be called Ernest Goes to Therapy, which he should seek if he finds the slightest joy in jury duty. Ernest is a janitor at a bank where a jury duty opportunity has him knocked unconscious and replaced by a criminal look-alike who happens to be on death row. Formula follows his many escape attempts as well as the criminal's inability to fill his shoes. In Escape From Alcatrez Clint Eastwood doesn't have quite as much fun in the pen. The ending is a complete free-for-all where all logic goes out the window. Director John R. Cherry's third Ernest film with fine special effects but not quite up to Ernest Saves Christmas. Jim Varney should be given credit for playing off two very different roles successfully. Gailard Sartain steals moments as a buffoon security guard whose security ideas are a constant bust, and Bill Byrge plays his silence yet agreeable sidekick. Barbara Bush plays the standard damsel whom Ernest is smitten by. Randall \"Tex\" Cobb plays a prison inmate who is to teach Ernest how to be his look-a-like while becoming fond of his good natured qualities. While not the worst of its kind, its reality of prison is treated like fun fair instead of the dread it is. Score: 3 ½ / 10","Okay, this is another Ernest movie and a lot of people just don't like them because they think they are dumb. I like them because they are dumb. There is no pressure to follow a complex, involved plot, the gags are juvenile yet funny, and the end is always predictable with Ernest inadvertently winning the day. In this movie he actually gets to stretch himself by playing not only playing the insipid, bumbling character of Ernest but also the hard case gangster who he is the twin of. Jim Varney made a career (until his untimely death) out of playing Ernest and he did it well, after all look at how many Ernest movies are out there.","You would think after two installments this series would be worn out. Somehow though Jim Varney and entertaining story lines makes this series continue to be successful and fun to watch. This time Bank Janitor Ernest goes to jail, swapping places with a look a like bank robber on death row named Nash. He must break out and stop Nash from robbing the bank he works at. Varney does a terrific job with the Nash character. I am waiting for this series to hit rock bottom, it sure hasn't happened yet.Rating: B-","If you only see one Ernest movie in your life, make it this one!  This is by far the best in the series, with its nonstop laughs and clever humor that is suitable for all ages.  The other \"Ernest\" flicks were good too, but most people tend to get tired of him quickly (not ME, however.).In this movie, Ernest P. Whorrel is assigned jury duty for a murder case. The murderer, Nash, just happens to look EXACTLY like our bumbling hero Ernest.  Mr. Nash finds this a good opportunity to escape from jail by knocking him out switching identities with him, and so we get to see how Ernest reacts in the slammer.A great flick!  If you haven't already seen it, watch it!","Though long believed to be Jim Varney's creation, the character Ernest is steeped in literary lore. This stock character was created by the expatriates in Paris during the early twenties. Several scholars have attributed it to Gertrude Stein herself, citing evidence that \"Earnst\" -- the name taken from Dadist Max Ernst -- was her nickname for specific ubiquitous prostitutes she more frequently solicited. This is debatable, though, since there are three specific short stories by expatriate writers using the stock Earnst character: Fitzgerald's \"Earnst Isn't Rich,\" Joyce's \"Day in the Life of the Janitor,\" and Hemingway's \"Dead Whore on a Mountain.\" All of these stories, and an accumulated history on this character that was passed by some of the great writers of the twentieth century, can be found in the forthcoming \"The Importance of Being Earnst,\" edited by Joyce Carol Oates.It was this literary tradition that led director, former ad executive, and \"co-creator\" John Cherry to take the dare and approach one of the days finest writers, Philip Roth, to tackle a tale of Ernest. Roth was apparently a fan of the early stories, and he took the opportunity to graft Ernest into a tale he was already writing as an expose on prisons -- a muckraking masterpiece he was concocting in the tradition of Upton Sinclair. But when Roth turned in his first draft, Cherry was surprised to find an all-prose script that involved Ernest being trapped in an Israeli prison with an sadomasochistic literary fan and Roth himself. Cherry rejected the script, citing a lack of \"Knowhatimean's,\" though Roth would later tell confidants that Cherry was simply anti-Semitic.Cherry then gave the script to his pet arragutang to re-write. The simean grafted the script onto the other Ernest movies, including a several references to the ever-present anti-holiday-consumerism themes of \"Ernest Saves Christmas.\" Unfortunately the arragutang, Benny, died before he could finish, and his trainer Charlie Cohen ending up getting final credit.But the tale doesn't end there. Roth and Cherry later reconciled, and this led to Roth contributing to the unfinished \"Ernest the Pirate\"; supposedly these scenes involve the rescue of a nubile great-granddaughter of a Holocaust survivor who was attending Columbia University before being trapped on the high seas. He also worked in thinly veiled criticisms of the Ernest movies in between \"Goes to Jail\" and \"Pirate,\" including a line that went, \"I've been scared stupid, I've rode again, I've slam dunked, I've even been in the army, but I've never been a pirate before. Now, suck my **** while I read Dosteyeksky.\"","\"Ernest Goes to Jail\" is one of the best films in the Ernest series, mainly because of the story and the actors. Of course, Jim Varney as Ernest P. Worrell, but Charles Napier as the Warden and Gailard Sartan as Ernest's neighbor Chuck (a security guard) all make for good laughs.The story goes that Ernest works for a bank, and he aspires to be a bank teller. However, when on jury duty for a homicide, the defendant, Lyle, sees a resemblance to his prison buddy Felix Nash (played by Jim Varney).When the jury takes a trip to the prison, Nash and Ernest switch places and no one can tell the difference. The comedy ensues from there, as Ernest tries endlessly to prove his innocence to the Warden.Everything ends well for Ernest, as does in all his films.","This movie brings back so many memories for me! I was very young when it came out but I remember the first time I saw it! My dad and I would always watch the \"Ernest Movies\" together. We hadn't seen any of them in several years and I found a couple of them really cheap. We watched them and could not stop laughing. I love all of the \"Ernest Movies,\" but this one is my favorite.Spoiler part! The part I remember most is the \"magnet\" part. My dad still does the electric chair scene! End Spoiler!This is a very cheesy movie...but a great one! It's perfect for families (it isn't like a lot of the trash out there) but at the same time adults can laugh too! If you like physical humor (like facial expressions and the way people move) then this is the movie for you!","this is the best ernest movie. it's funny,and entertaining. the plot is pretty good also,but a lot of the situations are totally unreal. but it's still good fun. they should've stopped after this one,because the ernest movies got too unfunny,and dumb. i give ernest goes to jail *** out of ****","While saying this is the best Ernest movie is NOT a glowing endorsement, this is a decent film and you could certainly do worse. It's a time-passer, certainly--not a film you run out to rent or buy for full retail! What makes this movie more tolerable is that the movie is not aimed solely at stupid people and small children. No, adults might also be mildly amused by the antics. It certainly isn't high art but for what it is, it works well. So, if your kids are nagging you to see it, give it a chance. It's not bad--really! PS--if you tolerate or actually love this film, also try watching Ernest Saves Christmas. Then, STOP. You'll have seen all the Ernest movies worth watching."],"review-user":["dootuss","bug76","ccthemovieman-1","teenwolf97","melloyellobiafra","gwnightscream","lee_eisenberg","wgviper13","CmHowell99","Edible Fetus","utgard14","CuriosityKilledShawn","ilovemovies2016","goldfussmikey","TheLittleSongbird","reddragonhero17","anaconda-40658","SanteeFats","sfriend1","Cowman","SweeptheLegJohnny2","Hollywood_Yoda","ek2005-1","jaws!","MartinHafer"],"review-date":["4 October 2002","25 March 2011","6 January 2007","25 May 2000","24 March 2006","14 March 2015","29 May 2006","19 September 2001","23 December 2002","13 July 2002","11 April 2014","31 July 2014","20 June 2018","14 May 2018","8 July 2017","4 June 2017","2 June 2015","3 August 2013","21 May 2003","14 August 2000","19 September 2004","15 July 2013","31 October 2006","7 October 1999","19 December 2005"],"review-rating":["10","6","10","6","7","7","5","6","6","9","7","9","3","6","7","10","6"],"review-title":[" Jim Varney at his finest!!!\n"," Gotta love Varney\n"," Funny, Harmless, Silly, Stupid, Safe, etc.\n"," Jim Varney's Best Ever!!!\n"," All Hail Varney!\n"," \"Favorite Of The Ernest Films!\"\n"," The importance of being Ernest...\n"," The best of Jim Varney\n"," Another Ernest great!\n"," 2nd best of the ernest series, great as a b-movie\n"," \"Is everyone who works here a moron?\"\n"," Jail is more fun than camp, Who knew?\n"," best Ernest movie of the series but have more to watch yet\n"," So stupid yet so funny\n"," Ernest the jail bird\n"," The Jailhouse of laughs\n"," Ernest Should be Locked Up for This.\n"," Funny\n"," Fun to Watch\n"," Ernest is better than you are.\n"," The Unseen Ernest\n"," Ernest Fans Will Love This\n"," I remember this movie from when I was a little kid!\n"," ernest goes to jail is the best of all the ernest movies\n"," the best of the Ernest movies\n"]}