{"review-url":["http://www.imdb.com/title/tt0072895/reviews"],"review-text":["\"Dolemite\" is the touching story of Dolemite (Gotta love blaxploitation film titles), an ex-con who probably should still be in jail.  He gets in trouble with cops, friends, drug dealers, women, prostitutes, and society in general.  He's just not that likable a guy.  Neither is the movie, though it's still hilarious and worth watching.The flimsy premise is that Dolemite (played with as much enthusiasm as star Rudy Ray Moore can muster) is in jail for a crime he claims he didn't commit.  When a drug hit or a drug bust or drug something is about to go down, the warden releases him to stop it, or help it, or just watch it.  Not very clear.  All I know is that I was unaware that the justice system frees convicts in order to allow them to prove their own innocence.  My ignorance, I guess.The plot is convoluted and unimportant, basically Dolemite goes around killing people (Usually with very poorly choreographed karate), having sex, and cursing out people, sometimes even rhyming too.  The joys of the movie are its total incompetence, and its total indifference in the matter.I stopped counting the number of times I saw the boom mike after it was in one scene for the entire duration (about two minutes of film).  I stopped questioning why the warden was looking down at where Dolemite was sitting, even after he stood up and walked around, when they cut back to the establishing shot and Dolemite was inexplicably sitting down again.  I stopped wondering why Dolemite dressed like that when he got naked on the street to change, because he didn't want to get in his car with the ugly (read: normal) clothes the jail gave him.  And I stopped wondering where he learned karate when he jiggles his hand on a guy's stomach and somehow cuts him open.  The only time I was ever remotely nervous and tense was when the disgusting, flabby white mayor is walking around totally naked with nothing but a towel hanging around his neck which just barely covers him up.  You keep saying \"Cut away...cut away...cut away\" but by the time they do, you are already emotionally scarred.The movie is ridiculous in every way imaginable.  Moore as Dolemite, is either funny, cool, or both.  If you're on the lookout for a bad movie, you have found it with \"Dolemite.\"","The blaxploitation genre certainly produced some bizarre oddities that's for sure. Dolemite is firmly in this category. On a technical level its appalling, with bad camera work, acting, action and story. The boom mic is visible so often that it really deserves a mention in the credits. But these considerations are ultimately irrelevant. In fact, the sheer scale of the cinematic incompetence is certainly one of the actual joys of the movie. The film-makers just didn't care and seemingly knocked this one out with little concern for such matters.The rough and ready style of Dolemite kind of seems appropriate though, given the nature of the central character, who is a super-shady bad mutha in a pimp suit. This character, Dolemite, spends most of the film swearing in creative ways. His routines are like proto-rap and seem to have influenced hip-hop culture. The movie is really a superb time-capsule flick. The insane fashions and jive talk are all almost alien in their bizarreness now. While the movie sports various other strange characters such as Reverend Gibbs, the mayor and the Hamburger Pimp. The latter of which actually appears to be out of his head on something or other – I don't think this bloke was really acting! There's also an extended scene near the end in a nightclub that really has to be seen to be believed. It has a priceless performance from a soul act and a crazy dance routine with some guy battering hell out of a drum-kit, it then climaxes with Dolemite's swearing rap thing. It's strange, like the movie in general. This may be super-trashy but it's highly original. It's yet another example of why the 70's ruled when it came to movies.","Stand up comedian Rudy Ray Moore stars as the hip, badass, styling m.f.er pimp hero of the title. He's set up by conniving hoodlum Willie Green (D'Urville Martin, who doubles as director) for possession of drugs and stolen furs. Dolemite is subsequently released from prison so he can dig up the dirt on Willie and his associates. Fortunately for Dolemite, he has people like the formidable Queen Bee (Lady Reed) and his stable of karate chopping hookers at his disposal.\"Dolemite\" wins no awards for quality filmmaking. For one thing, a lot of its action is pretty inept, even if the production supposedly had the services of Chuck Norris' karate school. But it IS quality entertainment. It's often hilariously crude and dumb, with some priceless dialogue. It's also pretty damn violent, and there's occasional flashes of female skin to attract viewer interest. The main attraction, though, is Mr. Moore himself, who's given two opportunities on screen to launch into two of his routines, one about a black named Shine who was on board the Titanic, and another about a monkey who attempts revenge on a bullying lion. The script by co-star Jerry Jones (who plays the lawman Blakeley) is deliciously profane.The performances by all are unceasingly amusing. Moore is much more of a personality than an actor, but he does have a certain charisma about him. Martin is fun as his nemesis. Be on the lookout for hambone thespian Hy Pyke as the corrupt mayor Daley; as can be expected, he tears into the scenery in his typical fashion.Definitely a blaxploitation classic, even if it's not for all the \"right\" reasons.Seven out of 10.","Dolelemite (1975) is a cult classic. Starring Rudy Ray Moore as the pimp superhero out to wrong rights whilst challenging the MAN along the way. He has two enemies, that no good Willie Green and the sleazy mayor. Watch Dolemite kick, punch, slap and pimp his way across the screen. What's the man's name? DOLEMITE!Interesting film that paved the way for a generation of rappers and performers. To sell more of his party albums, Rudy Ray Moore made several on the cheap films during the seventies. Self produced and marketed he catered towards a specific audience. Some people call it blacksploitation others call it trash, I call it entertaining. Dolemite was followed by the semi-sequel The Human Tornado and a direct to video Return of Dolemite 25 years later.Highly recommended, a definite cult classic! Footnotes, if the film was properly matted on video you wouldn't see the boom mikes. Dolemite was cut to receive an R-rating.","The King of all Black Action films, Dolemite is the story of Dolemite, the most bad ass brother in LA. Go with Dolemite from the jail house to the mean streets of LA in search for the man who killed his fellow brother. Get the Unrated version to get the whole gut punching scenes with all the great moments. Need more? This film has a sequel...enjoy.","As a time capsule from a particular social, cultural and economic era, Dolemite is remarkable. As a movie, it sucks very, very, very, very hard.This is one of those so-called \"blaxsploitation\" films from the 1970s and before you watch Dolemite or any of these films, you'd probably be well served to at least check out the Wikipedia entry on \"blaxspoitation\". If you don't, you could suffer a severe case of brain cramp trying to figure these things out.Dolemite (Rudy Ray Moore) is pimp/spoken word artist/night club owner/street avenger who starts out the movie in jail, where he may or may not have been framed by the cops for dealing in drugs and stolen furs. Yeah, I don't understand the stolen furs either. It must have been a 70s thing. Anyway, Dolemite is offered the chance to get out of jail if he'll go back to his old neighborhood and put a stop to the out of control crime and violence that's taken it over. Accepting the offer, Dolemite is picked up by a carful of his \"ladies\" and exchanges his prison-issued suit for his first of many pimptacular outfits. Returning to his neighborhood, Dolemite discovers that Willie Green (D'Urville Martin) has taken over his old night club. As Dolemite basically wanders from scenes of sex to scenes of violence and back again, we learn that Willie is connected to the mayor of the city and essentially runs Dolemite's old neighborhood to suit the mayor's agenda. Essentially, it's the story of the white power structure co-opting elements of the black community to \"keep the black man down\", with Dolemite being the returning hero spoiling that plan. It's a brutally primitive rendition of that story, but subtlety's not exactly a strong point of this movie. A couple of racist cops hassle Dolemite, a black FBI agent gets involved and Dolemite and his \"ladies\" use some amazingly bad 70s karate to defeat the forces of evil. I mean, seriously, there are 10 year olds in karate dojos all across America who could more convincingly kick people's butts.From almost every technical aspect, this is a laughably bad movie. It's poorly shot, poorly written, it looks cheap and the acting is almost uniformly terrible. Jerry Jones as the black FBI agent and D'Urville Martin are passable, I suppose, but Rudy Ray Moore's alleged acting consists of a \"Can you dig it, baby?\" nonchalance interspersed with overemphasis of the word \"motherf****r\"and he still gives the third best performance of the film.For all of it's flaws, there are two things for which I can recommend this movie.1. This is a film made by 1970s urban black people, for 1970s urban black people, about the world of 1970s urban black people. I'm not saying this is some sort of documentary about the way the 70s actually were for African-Americans, but it does give you a theatrical view of how they looked at and felt about their world. I don't say that as some kind of excuse for how crappy this movie is, but this was the era when African-American filmmakers were getting their first meaningful chance to tell their stories their way. In a country where history is what happened last month and everything before that has vanished into the mists of time, this is a movie that slaps you in the face with how different things are today from how there were just a generation or so ago.2. For all the bad acting, bad camera-work, bad dialog and bad fight scenes, there's an infectious energy to Dolemite. Everything about this movie is raw and unpolished and unpretentious. If you ever got together and made movies with your friends when you were kids, the same honest joy that you can still see in those stories is the same thing you can see in Dolemite. These filmmakers and these performers are all so clearly caught up in what they're doing that they're extremely likable, no matter how awful they are. A great example of that is the clothing in this film. It is hilariously bizarre, but the performers AND the characters they play are so utterly at ease in these fashion disasters, so convinced that these fabricated atrocities are the greatest thing since sliced bread, that you'll end up wishing you could wear those sorts of outfits to work.If you want to watch a good movie, I really can't recommend Dolemite. There are just so many ways that it's truly terrible. But this is a fun movie, I enjoyed it and it's a reminder of how weird the 1970s actually were. So, if you ever are in the mood to watch a awful film about a pimp/spoken word artist/night club owner/street avenger and his army of karate chopping prostitutes, you now know where to look.","Certainly far, far from the quality end of the Blaxploitation genre, this nonetheless shares some of the staple ingredients which make many of its more illustrious brethren so charming. The plot concerns the titular hero (the term applied in the loosest possible manner as our man is a bit of a scumbag) who does a deal with the warden in the prison he is being held in (after he was framed by bent cops) to clean up his old hood. This our man sets about with great gusto, partially fuelled by the need to avenge the senseless murder of his nephew. It turns out that the crime in the area is far more deep rooted than a few mere drug dealers and gun runners however, indeed a whole conspiracy is afoot involving bent law enforcement officers and a dirty mayer.With multiple attempts on our heroes life and the pressure on, will our man be able to save the day? Well, if Dolemite's inimitable way with obscenities is anything to go by, then the answer is 'hell yes'!!! Indeed, Rudy Ray Moore's fast and foul outbursts are probably the real highlight here and are sure to raise much mirth. Unfortunately, matters do tend to drag when our man isn't busy berating someone which is a real shame but don't switch off just yet, for the finale in this is an absolute hoot! Yes, the final fight or perhaps more appropriately, small riot which breaks out in a night club is absolutely hilarious and showcases a plethora of poorly choreographed karate fights, our hero literally punching through a guys chest(!) and all this backed up by a cool and thumping seventies soundtrack! Damn! - What more could one wish for in a film I ask?Fellow fans of the genre will probably derive at least some enjoyment here, not least of all the aforementioned sequences but just be warned - as if to act as a reflection of just how low rent this entry is, if one were to base a drinking game on the number of times the boom mike is visible throughout the film, then you'll probably be comatose by the end credits!","Dolemite is, for me, an object of my deepest affection.  It's got everything: a gang of karate-fighting prostitutes, Dolemite punching his fist through Willie Green's (director Martin) stomach, high pumps and 100 gallon dalmation-print hats.  Moore's unique comedy raps, actually toasts, are close to the roots of hip hop.  No wonder Dr. Dre mentioned \"Dolemite\" 3 times on his classic album \"The Chronic.\"   Add the best list of characters to ever grace a movie, like the horny preacher, the hamburger pimp and, of course, \"the one who no one knows until it's time.\"  Credit should be given for style to director D'Urville Martin, a fella who probly doesn't get as much attention as he should around film fan circles (I've been looking for a copy of his and Fred Williamsons' movies from the early 70s for years and can't find them).A lot of people are really down on this movie and say it's really bad, and it is true that you can see boom mikes appearing everywhere (look to DP Nicholas Josef Von Sternberg, for whom I think this was a very early effort), there are a lot of things going for this movie.  Number one, there is no other movie like it.  Number two, you get to see Rudy Ray Moore do a (highly sanitized; everyone who HASN'T seen Moore's outrageous live act will have to use their imaginations) cinematic version of his toasts, plus him living the life of his comic book character superpimp come to life.  The action scenes are pretty poor, but the characters' dialogue when they're talking trash more than makes up for it.  It's full of strange little details (like the fact that the Hamburger Pimp is wearing a Dolemite T-shirt inside out -- was this intentional or did the guy just pick up whatever shirt was lying on the set and put it on?) that keep you coming back to watch it again and again.At least I have.","1975... before Rudy Ray Moore was hailed as the \"Father Of Rap Music\" he was touring Black clubs around the nation doing routines from his brisk selling \"Party Records\". In his spare time and when finances allowed, he would make the opccasional movie on a shoestring budget. This was his first. A classic blaxploitation action movie. The flubs are legendary and have been detailed elsewhere, this looks like a backyard movie, very similar to movies kids would make in their yards with the advent of home Video cameras.Great flick from a strictly guilty pleasure standpoint. You ignore the errors and weak plot, you see Rudy's obvious pleasure over acting in front of a camera for the first time. I imagine this was a dream come trur for Rudy, he could finally bring his nightclub character Dolemite to the big screen. Of course, Dolemite is an almost mythological character, much bigger than real life, sort of like a Black Paul Bunyan, but Rudy gives an admirable attempt in bringing Dolemite to the screen. This movie had a revival of sorts when Arsenio Hall's TV talk show would feature clips from this movie and also when Arsenio had Rudy Ray on his show. Worth seeing if not taken seriously.","What a trip down memory lane.Do not look for great acting, believable plot lines, or anything resembling a quality movie.This is pure blaxploitation at it's finest. Outrageous outfits, unrepeatable dialog, objectification of women, and the sleaziest cops you can imagine.This vanity piece by the \"Godfather of Rap,\" Rudy Ray Moore, who left us for good last week is the standard by which all blaxploitation is measured.You not only see blaxploitation at it's finest, but get glimpses of his comedy genius, and see why his records were kept under the counter.","Blaxploitation \"classic\" that introduced the movie-going public to Rudy Ray Moore. The plot, such as it is, has pimp Dolemite (Moore) being framed and sent to prison. A friendly warden believes Dolemite is innocent, so he lets him out of prison to prove it (!). Dolemite sets out to take back control of his pimp business and get revenge against the man who set him up: Willie Greene (D'Urville Martin, also the director).If you're unfamiliar with Rudy Ray Moore, this is as good a place to start as any. Dolemite features the standards of every Moore film: inept direction, unintentionally hilarious fight scenes, and the worst excuse for acting you'll ever see. Not to mention more colorful ways to fit the word 'mothereffer' into a sentence than I ever thought possible. A fun game to play while watching this cheapie is \"spot the boom mic.\"","I like bad movies. In fact, I'm still trying to get AFI to show Eckes vs Sever in their next film festival. I own Aztec Mummy vs the Robot Monster. What you call \"hell\", I call \"entertainment\"...Dolemite is a very very bad movie. I've narrowed down its problems to the acting, directing, writing and cinematography.Most of the cast in this movie are non-actors and it shows. Most of the cast members mumble their lines as if on a Thorazine binge. Some of the lines were meant to be spoken with great feeling which makes it all the more hilarious when they are said with the same flat mien as one would have ordering a MacDonald's breakfast. The few competent actors in this movie just make the rest of the cast look even worse. Who do I blame? The director, of course! You can tell this movie had a director or the actors would've just wandered off the lot during filming and gone about their lives; however, none of the acting seems to be directed. Maybe the director just gave up after seeing the......writing. Odd when the drugged monotone of a narrated flashback matches the exact dialog after the flashback. And, a warden letting a man out of prison to find who framed him is essentially a plot built from Ad Libs during a car ride. Bad bad writing. But, at least you have the...Cinematography... Oh forget it...This is a jaw-droppingly bad movie. I'm not saying that anyone should avoid it. Historically, it is worth watching because the seventies were an interesting time for grind-house movies...","I love the so-called \"blaxploitation\" films and have seen dozens. Some, such as COTTON COMES TO HARLEM, SHAFT and HAMMER have excellent production values and are very entertaining, while many others are very cheap and silly, but still entertaining, such as BROTHERHOOD OF DEATH or COFFEY. However, DOLEMITE manages something rare for the genre--it's just cheap and silly and not the least bit entertaining! It's like blaxploitation made for very, very stupid people.Years ago, I saw a takeoff on the Dolemite films on \"Mad TV\" and unfortunately, the real DOLEMITE isn't any better. Like the parody, the acting is just atrocious. Rudy Ray Moore has all the charm and charisma of a piece of balsa wood. He can barely read his lines and his \"karate\" is a joke--with his kicks obviously missing the target again and again. As for the rest of the actors, many might be even worse. My favorite was the FBI guy who couldn't even remember his lines and really struggled to get them out--yet they didn't even bother to re-film these scenes! In fact, so much of it was inept that I had a hard time figuring out whether the film was intended as a joke.If you think that despite horrible acting and action that there is something worth seeing about this film, you're wrong. Even for the perverts out there hoping to see some skin, will be disappointed. The naked women in the film really do look like hard-luck prostitutes and there's nothing remotely sexy about their sagging bodies. I think looking at old people naked--REEEAALLY old people naked--is no worse than looking at these \"ladies\". And as for Rudy Ray, he has \"man boobs\". No Black super-hero or anti-hero should look that bad naked!! For goodness sakes, put on your clothes people and come up with a script that doesn't look like it was written by winos!!!FYI--Apparently, there are actually sequels to this film!! I can't imagine watching them, so you'll just have to find someone else to review them. I have watched PLAN 9 FROM OUTER SPACE, TEENAGERS FROM OUTER SPACE and ROBOT MONSTER, but I just don't think I can bring myself to see another Dolemite film--they are that bad!","Citizen Kane....The Godfather Part II....D'Urville Martin's Dolemite. This is the single greatest piece of celluloid ever created and unleashed upon humanity. Rudy Ray Moore, in a role that transcends Academy Awards stars as Dolemite, the baddest cat in the universe. He clearly does not take any jive from no turkey (I myself am unfortunately a turkey) and proves it with his powers of rapping, pimping, and karate chopping. This is blaxploitation at its absolute finest, a shining example of the genre with its low budget, continuity errors, and hatred for rat-soup eating honkey expletive expletive. The true Godfather of Rap (not this new Ali nonsense) Moore is something of a juxtaposition of acting technique; somehow managing to be the most charismatic awful actor of the 1970's, and thats saying something. This one is HIGHLY recommended folks, if not for the one-liners alone.","Yeah...I read David Lee Roth's autobiography, \"Crazy From the Heat,\" (which by the way is an amazing read), and DLR says this was his favorite blacksploitation movie as a kid.  In fact, he says he always imagined himself as a black guy in Southern Cal.  Mr Roth is quoted as saying:\"We saw every Blacksploitation picture, and those movies were a HUGE influence on me. Trouble Man, Superfly, Foxy Brown, Shaft, Cleopatra Jones, Blacula, Rudy Ray Moore doin' his Dolemite vibe-I saw all of those...\"He goes on to say:\"Dolemite - Rudy Ray Moore - was one of the originals.  He was a blue comic, doing blue humor.  Like Redd Foxx did on early party records.  So he was the most perfect to play a new secret agent.  His answer was not \"Bonds. James Bond.\"  His answer was \"Dolemite, motherf*****!\"  We would wait for that line in all of his movies.  \"Get Whitey\" would show up in every single movie at least once, and we would wait for that, too.  They had the cars.  They had the shoes.  They had the guns. The Haircuts.  The Slang.  And the scams. And we all knew that all those beatific resolves at the end of the movie were white bull****.  He's trying to feed hungry children but he's actually a pimp...bull****.  That was designed to make it palatable to our moms and dads so they'd let us go see the picture.\"Spoken like a true genius.  So upon reading about Dolemite in Mr. Roth's book I immediately bought in on DVD and I really like it.  Yeah, it's super low-budget, and yeah...I hate rap...but as a fan of Tarantino movies, I can see many similarities, especially some of the 70's fusion/funk ala-jaco pastorius music throughout the film.  I also love the scene where the two cops 'bust' him for coke and then one of them snorts a whole bunch of it like he'd done it a thousand times before, and says something like, \"Aww yeah....that's the real mccoy!\"...and then he continues to talk and has a little bit of coke still on his lip.  CLASSIC!  Some of the violence is a little over the edge, but shocking, which I would consider to be a positive quality.  Not as predictable as I assumed it would be.  Definitely going to pick up \"The Human Tornado\" very soon.  10 out of 10.","Being a bit of a connoisseur of garbage, I have stumbled across this little treasure. Action, romance, crooked cops, violence. Its all here and not a single one has been pulled of right. I was in love immediately. Then, a funny thing happened about the second time around. I became addicted. I thought it was going to be a one rent and chuckle kind-of-movie.Rudy Ray Moore knew what he wanted to see in a movie. He didn't have the money to make it look good, but he did it anyway. That's very commendable. It also shows he was making the movie for his self. I don't know how many of you have heard Rudy Ray's music, but if you haven't he has a whole slew of albums reaching into the fifties.","Sure glad Detroit stopped making them land yachts, bigger than aircraft carriers. Hood was big enough to play a game of NFL football and park a couple hundred Pinto cars.","One might think that if you've seen one blaxploitation flick you've seen 'em all, but you still gotta see \"Dolemite\". This story of a pimp taking revenge on those who wronged him has everything that a person could love about these movies. In a couple of scenes, the protagonist even spouts out some proto-rap!It's one movie that they must've had a lot of fun filming (as a lot of these movies are). This genre is one of a kind, and it must've been a great pleasure to get to see these flicks when they first got released. \"Dolemite\" is one movie that you're sure to love.","Dolemite (Rudy Ray Moore) is let out of prison in order to find the bad guys who we already know who they are. Our middle aged pot bellied karate fighter, battles bad rhymes, a bad script, bad acting while having a microphone in the scene.The film series is part of a so bad it is good, but in the realm of things, I found this film to be less entertaining the others.Guide: F-bomb, sex, nudity","Dolemite is one of my all time favorites and was one of the first blaxsploitation movies that I have seen. While the movie is super low budget and has a ton of flaws, Dolemite is one of the coolest films out there and I always have a great time watching this classic. Yes, the production value is terrible and the acting is really bad and Rudy Ray Moore could not fight his way out of a bathroom. But, Rudy has a unique persona and presence that demands attention and respect. Our hero and main man Dolemite was set up by a rival and imprisoned. He gets out of prison and with his stable of karate chopping call girls, he is on his path to revenge and street justice. Hustler, pimp, club owner and all around bad ass, Dolemite kicks ass and scores with the ladies. Lots of great lines from The Godfather Of Rap and the film went on to inspire generations of fans, film makers and musicians to come. Rudy Ray Moore was one of the coolest cats to ever live and Dolemite is one of his finest work. After watching Dolemite, I rented all the blaxsploitation movies that I could get my hands on, some of them were also great, others, not so great. But, Dolemite holds up and is essential viewing for the genre and one of the coolest movies ever made.","OK So I Have Never Seen This Movie But I Read Up On It ... Dolemite Is The Worse Blaxpoitation Movie Ever Made And That's What Makes It So Good ... Every Stereotype Is Stepped On In This Movie And Dolemite (Rudy Ray Moore) Is The Worse Looking Pimp Ever ... The Action Scenes Are A Joke But They Are Pretty (In One Scene Dolemite Knocks Out A Cop With Two Punches And A Kick Even Though None Of Them Landed ... The Man Does Have The Soul Of A Poetic Judging By His Two Rhymes In The Movie (\"Shine & The Great Titanic\" and \"The Signifying Monkey\" See Comments For Both Rhymes) Both Very Funny But Their Message Was Not Lost On These Ears ... From What I Read Rudy Ray Moore Hand Picked People Off The Street To Fill In Roles In The Movie, Many Of Them Not Knowing Till The Last Possible Moment What Their Roles Would Be ... In All This Madness And Chaos Rudy Ray Managed To Make A Movie (And Apparently 3 Sequels) That Have So Far Stood The Test Of Time ... Cult Classics Or Guilty Pleasure My Recommendation Is That You Check It Out ... Believe It Or Not As Bad As This Movie Is I Think I Will Watch The Next One (Guilty Pleasure) ...","\"Dolemite\" was definitely not made for a \"rat-soup-eatin', insecure honky MF\" like me but I liked it anyway. The movie is a 'Blaxploitation classic' (which some people may consider an oxymoron) – it's hard to say what's worse: the acting or the karate fights, but it's also hard to say what's better: the pimp suits or the funk. I find it amusing that these extremely crude, subversive, counterculture movies now show up, unedited, on TV Turner Classic Movies – it's like seeing poisonous snakes in a display case at a petting zoo. Times have certainly changed. Worth watching for its own sake as well as from a cultural history perspective, as a lot of modern comedy and rap culture are rooted in movies like this.","Dolemite (1975) ** 1/2 (out of 4) Dolemite (Rudy Ray Moore) is a hard-hitting pimp who is serving twenty-years in prison after being framed by some dirty cops. The warden tells him that evidence shows he might have been set-up so he allows Dolemite out of prison if he agrees to help track down someone passing guns and drugs in the streets. Soon Dolemite is going up against gangster Willie Green (D'Urville Martin).DOLEMITE was a late entry in the blaxploitation boom of the 1970s when people like Richard Roundtree and Pam Grier became stars. Rudy Ray Moore made his debut in this film and he would make a handful of other films but there's no question that he'll always be remembered for this role. For the most part this is a mildly entertaining film, although I doubt you'll find anyone that will try to say that this is some sort of classic or even a good picture.What makes this film work is the performance from the lead star. Yes, it's not Oscar-worthy material but it wasn't meant to be. The point of a film like this is to have fun and I must say that I thought Rudy Ray Moore was a lot of fun and especially early on when he's screaming out countless one-liners and many of them are quite funny. He's certainly very believable in the role of this pimp and he keeps the film moving at a nice pace.For the most part the film is entertaining but there's no question that the first half is much better than the second. For some reason the movie just runs out of gas around the fifty-minute mark and it never picks up. There are some really long and boring stretches including some bits inside Dolemite's club. These scenes towards the end of the movie just drag on and go nowhere so they could have easily been cut.DOLEMITE isn't a classic blaxploitation movie but if you're a fan of the genre then the star makes this worth watching.","Dolemite is awesome. Rudy Ray Moore's rhymin kung fu pimp with horrible choreographed action sequences is about as close as you can get to becoming a spoof of a genre without actually being spoof. Citizen Kane this may not be nor Les Infant Au Revoir, but this is undoubtedly genius in it's own right. The production values in this movie are so bad they could qualify as existential special effects. The plot drags a little in the middle but the power of such a cheap premise as kung fu hookers is enough to bring all but the snootiest film lovers through. The infamous ever present boom mike evokes shades of the gloriously incompetent Ed Wood and never grows unfunny. I sometimes wonder if the boom mike was left in on purpose as commentary on the ridiculous aspects of movies in general but i usually get distracted by erotic scenes that lack eroticism to the point of high art mundanacity. Everything is this movie is alive and breathing, dripping with desperate longing to be simultaneously loved and reviled. It works.9 out of 10"],"review-user":["Mr. Pulse","Red-Barracuda","Hey_Sweden","Captain_Couth","caspian1978","MBunge","HaemovoreRex","funkyfry","Schlockmeister","lastliberal","utgard14","masercot","MartinHafer","TheBodyHammer","ytseryche2112","GWWilder","godfreecharlie","lee_eisenberg","nogodnomasters","dworldeater","Richard_Dominguez","jamesrupert2014","Michael_Elliott","PIST-OFF"],"review-date":["22 April 2000","3 March 2012","14 May 2016","8 March 2004","1 April 2001","13 September 2010","2 March 2009","9 October 2002","5 October 2000","28 October 2008","14 August 2014","17 October 2016","1 September 2008","30 May 2007","18 April 2004","6 April 2005","16 September 2018","21 June 2018","19 June 2018","16 January 2018","11 July 2017","25 April 2017","4 February 2017","30 October 2006"],"review-rating":["2","6","7","8","6","5","5","10","8","5","2","1","10","10","8","5","10","6","10","7","7","9"],"review-title":[" No Disco Godfather, but still a winner\n"," A genuinely crazy blaxploitation film\n"," Get yourself some \"rat soup\" before watching this 70s classic.\n"," Rudy Ray Moore movies: He's bad! The man is out of sight...\n"," BLACK ACTION\n"," Warning! Looking too closely at the fashions worn in this film might result in hysterical blindness!\n"," Cheap but cheerful\n"," You better hear my message, you honky rat-soup eatin muthf@@\n"," Ultimate Backyard Blaxploitation Movie\n"," I got your \"boy\" hangin,' you no-business, born insecure, jock-jawed, motha fuckas!\n"," \"Tell him I want him out of here in 24 hours...and 23 of um's already gone.\"\n"," Bad to the Bone\n"," Among the worst of the Blaxploitation films--and not especially entertaining\n"," Film was never the same.....\n"," David Lee Roth recommended it to me...\n"," the man is outta sight\n"," To the Top\n"," Fun!\n"," OUT-A-SIGHT\n"," Rudy Ray Moore was the man, Dolemite rules!\n"," So Bad It's Wonderful\n"," Classic Blaxploitation, plus great hats\n"," Rudy Ray Moore Makes The Movie\n"," honky\n"]}