{"review-url":["http://www.imdb.com/title/tt0084969/reviews"],"review-text":["I'm one of many who tuned in,in Sept. of 1983 to watch this series sequel and help it at least get to #15 in the '83-84 ratings. It wasn't a horrible idea but it wasn't the best of ideas either. I will not blast AfterMASH for it's failure to live up to \"M*A*S*H but what I will say is that when a TV series,or movie series or a music act is popular for a long time,it has it's own time and place and when it's over it literally is the end of an era. M*A*S*H debuted in the midst of Vietnam,soon to be Watergate and just a time in America when things were upside down. At the end in 1983,all of that was over (supposedly). AfterMASH is among the many failed sequel shows like: \"Golden Palace\"(Golden Girls), \"The Sanford Arms\"/\"Sanford\"(Sanford & Son), \"Three's A Crowd\" (Three's Company) and \"Joey\"(Friends). Simply,enough is enough the first go 'round.The plot lines and writing were very much like the old show and the drama was first rate but AfterMASH lacked a very important ingredient a \"star\" name. Morgan,Farr & Christoher were famous \"yes\" but they are and always will be \"character\" actors. They were great on M*A*S*H but they didn't have enough name or \"pull\" to attract the numbers M*A*S*H racked up. What also never helps is network tampering. I could be wrong about the show,maybe being successful... and maybe it would have been if not for stupidly placing it against \"The A-Team\" (if Happy Days couldn't win,what chance would a new show have?). Then,dumping actors (especially a different Mildred in Season 2!) and the old ploy of \"special guest star from the original series.\" I did like the show with Radar and was glad to see him no longer a virgin and dealing with a real issue. In the end,the plot with Klinger on the run from the police for belting a guy was just like,\"What's the big deal about punching a guy who deserved it?\" I also got tired of Sunn Lee saying ..\"but Max,our baby doesn't have a name!\" I thought,well just name the kid already!As for the results next season,some good shows...especially the final appearance of Col. Flagg at Klinger's court trial,but the damage was done. It may have hurt the actors when it was pulled but for me,well,I simply moved on to the 80s sitcoms I was already watching. Not as deep or poignant but heck,the 70s were long gone. Five stars,it was painless to watch but better for all after the curtain finally fell. (END)","I, for one, am tired of \"AfterMASH\" being the TV industry joke; the joke being that a spin off of a popular series can't survive without major cast members. AfterMASH was a fine series, with Potter, Klinger, and Mulcahy dealing with issues which occur when the bullets stop flying. (Potter fighting the VA to provide disability for a cancer patient who was stationed at A-bomb tests, is just one example.) Viewers finally met Mildred Potter, and were introduced to Bob Scannell, who served with Potter in WWI. Jay O. Sanders (now a semi-big name in movies) played Gene Peiffer, a likable surgical resident whom Potter took under his wing. Mike D'Angelo (John Chappell) was the bumbling administrator, with his aide, Alma Cox (Brendis Kemp), who always locked horns with Klinger. AfterMASH ended it's 1st season ranked #15 in the ratings.So why did this series fail? Two reasons in my opinion, for what it's worth. First, some genius at CBS decided to move the sitcom from MASH's old time slot of Mondays at 9:00, to Tuesdays at 8:00, where it went up against NBC's \"The A-Team\". AfterMASH didn't stand a chance. Second, the character of Gene Peiffer was written out (with no explanation), to be replaced by Dr. Boyer (played by David Ackroyd). Boyer, who didn't even have a first name, was handicapped, having lost his leg in the Korean War, and lashed out at everyone who thought less of him because of it, at least in his mind. Most viewer, I believe, want characters they can identify with or understand, and a brawling, self-pitying loner with a chip on his shoulder doesn't cut it. In reality, such a person couldn't remain employed in any hospital.AfterMASH will never be a lost classic; rather, it's a what-might-have-been, and television's loaded with them. Still, the show comes up in any TV Guide fall preview that includes a spin-off, with the usual line, \"Does anybody remember AfterMASH?\"Finally, if there's any spin-off that merits being the industry joke, it's \"The Sanford Arms\", NBC's ill-fated attempt in 1977 to continue \"Sanford and Son\" without Fred and Lamont. It ran for 4 episodes. At least AfterMASH made it to 30 before being axed in December, 1984. Eventually, AfterMASH will be released on DVD. After all, shows with fewer episodes are. Glad I won't be trampled in the stampede to buy it.","If I remember this program, the first season was acceptable, though kind of boring, but it did improve as it went along.  However, what bothered me, as a writer, is that it took the two truly interesting endings from the two hour final episode of MASH and basically trashed them.For the most part, all of the characters on MASH were leaving Korea on the last episode, and would assume the lives that they left behind, without much deviation.  The two exceptions were Klinger, who shocked everyone by remaining in Korea, and Father Mulchachy, who was rapidly losing his hearing after standing on top of an explosion.  These were intriguing plot twists, and when MASH ended, the audience was left with the questions of whether or not Klinger would ever leave Korea, and whether Mulchachy would regain his hearing or go completely deaf.The first episode of After MASH quickly resolved both of these cliffhangers in a schmaltzy, unsatisfying way.  Klinger was home, and Mulchacy had an operation that immediately restored his hearing.  Two cheap cop outs for strong plotlines.  The quality of After MASH was not good enough to justify ruining the ending of one of the best television programs in history.","M.A.S.H. dealt with the horrors of war. AFTERMASH dealt with the facts of life about coming home from a war. I always liked Colonel Sherman Potter and wanted to see more of him. but I also wanted Hawkeye and BJ and the others . Considering that Harry Morgan loved playing Sherman Potter so much he wanted to continue playing the role and the same went for Jamie Farr and William Christopher as well. The Stories were puff pieces but they also dealt with real issues as well. Klinger dealing with a crooked Real estate agent who was racist against his wife. Potter and the hospital dealing with the effects of Atomic radiation Among other story lines . I loved it. To me the show made sense after all these people didn't just vanish they had lives before and after M.A.S.H. pretty much like Trapper John Did. But the real sad point is the show suffered from bad timing. Being put up against a Juggernaut like The A-Team did not fare too well for the show. I wish the show would have had years but we are lucky we got what we did. they Say this show was one of the 50 worst ideas in TV history well let me say this . They were wrong. The Show just might be one of the most under rated TV shows in history.","To be fair, I didn't see a lot of this show. Probably because it wasn't as good as the original M*A*S*H, but I seem to recall them moving it around on the weekly schedule. Some shows just aren't worth the trouble of following around every week. But I really did try at first, so it wasn't all bad. Maybe I just kept expecting it to improve, but I can't give this show a 1. In all honesty, I can't give it any more than a 2 either.It wasn't MASH (I'm not going to type those stupid *'s every time). And it was trying to be MASH without putting forth any effort, like it would just magically happen. Well guess what? No magic. The best I can do here is to compare it to other shows.Trapper John, M.D. was a much better show by far. However, they should have called it B.J. Hunnicut, M.D. because Pernell Roberts looked exactly like an older BJ, but nothing at all like Trapper John. Keep everything else the same, just change his name and the name of the show. Presto! After MASH wasn't the only sequel to completely bomb and dishonor the original. Archie Bunker's Place was a lame follow-up to All In The Family. It had no heart, no conflict, no depth  all of the things that made All In the Family so memorable. Likewise, MASH was funny because the doctors were reacting to the impossible absurdity of war. Remove the war and you remove the drive for 99% of the humor. Potter can't yell at Klinger for wearing a dress, because Klinger isn't wearing a dress, because he's not trying to get kicked out of the Army, because he's already out of the Army, because the war is over. (breathe) All of the jokes became forced because there was no motivation for anything. The least motivated was the viewer, to stay around and watch the show.And from what I remember, the whole show seemed to be Potter, Klinger, and Mulcahy just standing there unnaturally, facing the audience like a trio of Vaudeville performers. It was reminiscent of Good Times, where they spent 90% of the show standing behind that couch and talking to the audience, trying to make it look like they were having natural conversation. They weren't. And it felt even less natural on After MASH.Another random tidbit I recall is that the people who made MASH never got any royalties from the spin-off. The studio used the absurd excuse that After MASH was really a spin-off of the movie MASH (which they owned) and not the TV series. Nice try, but Mulcahy was the only one of the three in the movie, and he was never deaf. I guess studio execs will do anything for a buck. Anything other than make a worthwhile sequel, that is.","More than half of the original M.A.S.H. cast was doing other projects when this sequel aired.  As previous commenters have mentioned the jokes were stale, and the antics appeared staged. The episode I remember was that Klinger was back in the U.S. and married to his Korean wife. Klinger got in some scuffle and the ending scene showed him in jail with the overprinted statement \"Stay tuned will return in 6 months.\"  I thought at the time, \"why the h@** should I wait 6 months to see how Klinger gets out jail\". If the producers thought they could bulid the public suspense by waiting  6 months, they lost!","OK,choose your three favorite characters from MASH. Now scratch them from your memory as you watch After MASH,one of the biggest disappointments as well as one of the worst TV shows of all time. I saw this recently on FX,and I'm surprised that they showed it,but you get a sinking feeling you got upon realizing that a new episode of MASH would focus on either Klinger,Radar or Father Mulcahy? Well,with After MASH you had a two-out-of-three chance of being let down and this follow up to one of the most successful series of all time,which spawned from it could be so disastrous by all means,and it shows here. Klinger(Jamie Farr),Radar(Gary Burghoff),and Father Mulcahy(William Christopher)joined Colonel Potter(Harry Morgan) in a Missouri hospital after the Korean War to heal the sick,annoy the bureaucrats,give longwinded speeches and actually make Larry Linville glad he left the 4077th as early as he did. To make matters worst,several episodes were directed by Harry Morgan as well as fellow MASH alumnus Mike Ferrell,and Alan Alda.The producers were trying to hold on to it but it was time for the series to die since in my opinion after the huge success of the first one,why try to hold on to something that won't last.....Let it go guys. That is what CBS did when they pull the plug on the series when the network axed it in December of 1984. The series did however survived its entire one season run at 30 episodes where some TV executive at CBS had the not-so-bright-idea of taking the show from its Monday night time slot(where the old M*A*S*H series was)and moving it to Tuesday nights opposite NBC's \"The A-Team\" which clobbered it in the ratings. However,the show that replaced it on that powerhouse Monday night timeslot was \"Newhart\".","I don't think the series 'After M*A*S*H' was made to 'cling onto M*A*S*H's former glory'  thats just bull.  I think that people wanted a continuing story. They wanted to know what did happen when they returned. We know nothing compares to the original M*A*S*H but sometimes people just want an ending.  And not just an ending of the 'war'.","MASH was one of the most popular TV shows of all time, and the members of the 4077th became well known and beloved characters to the entire country.After more than a decade, people did want to know what happened to all of them after the war. Did Klinger find Soon-Lee's family? How did Radar fare back on the farm? Did Mulcahy get his hearing back? It would have made a fine TV movie, or maybe even a miniseries to have a big reunion of the 4077th stateside after the war (like they talked about doing a few times during the series). See that Klinger found his wife's family and they moved back to the US, only to face racism and discrimination, and is down on his luck as a petty crook trying to make ends meet. Show that Radar's farm had failed and and moved away to join the police in St. Louis. Show that Col. Potter now runs a Veteran's Hospital, and that Hawkeye went home to Maine and a small-town practice. Show that Mulcahy's hearing has been largely restored through surgery. It could have been a huge hit just to see them all later, as a epilogue to the whole story of MASH.Instead, we got AfterMASH, which took the basic idea of \"what happened next\" and ran it into the ground. We got three familiar characters: Potter, Klinger and Mulcahy, a brief introduction on how they got there, and then try to replicate MASH stateside. Create a whole new set of young mischievous doctors for Potter to keep an eye on, a whole new bossy administrator to yell at Klinger, and then find thin reasons for constant guest appearances by former MASH cast. It kept trying to be essentially a stateside remake of MASH, with some of the same characters, but the chemistry wasn't there. If not for the MASH name I doubt it would have even lasted as long as it did.","My memory of this is that is simply didn't work that well. I wanted it to be better than it was-Potter, Father M and Klinger were all great characters, and they tossed in Radar too after a while. But ya can't go home again, as they like to say-and on TV, it is true.Perhaps better writing woulda given this a better chance.","In 1983, the Korean-war comedy/drama series M*A*S*H, which many still consider to be one of the best television shows of all time, ended its phenomenal 11-year run.  The following season, After M*A*S*H debuted.  The series featured Colonel Potter, Klinger, and Father Mulcahy improbably reunited in a Midwest hospital.  (Presumably the series' creators tried and failed to sign other M*A*S*H stars to the lineup.) After M*A*S*H played on the screen exactly as its title suggested -- as a desperate attempt to keep some of the former series' glory alive.  Without M*A*S*H's writers, principal stars, dramatic setting -- or ratings -- it died a quick and merciful  death","Harry Morgan, William Christopher, and Jamie Farr were the only ones willing to take their characters past 1983. Here's the result.A few good lines and puns. We finally meet Mildred Potter. Those are the only things worth mentioning.The main problem here was all the new characters. They were obviously clones of the originals. A wise cracking doctor. Another doctor with a bad attitude. A rather uptight nurse. Sound familiar? The civilian setting gave it a little more to work with. And the never resolved cliffhanger (Klinger in jail, Soon-Lee about to give birth) was an infuriating way to end it.And hearing about Alan Alda and others scheduled to make guest appearances, and Radar and Col. Flagg making said appearances, makes me wonder how much longer it would have been before it became \"M*A*S*H, The Civilian Years.\" They should have just let it go.","I WAS JUST WONDERING WHY THEY NEVER PUT THE SHOW IN A DVD BOX SET. ANY GUESSES?","When watching this, if you are able (as it hasn't really been repeated or given any release), people often make huge mistakes. They compare it to the wrong things. Is this M.A.S.H? no. can't be. A lot of people will tell you that M.A.S.H. wasn't even M.A.S.H. and that the Potter episodes are much worse then the Blake episodes or whatever. the Show changed over time to make something which was good as a whole.After M.A.S.H. kinda has the same issues. set a few months after they got home, the show reunites Col. Sherman T. Potter, Maxwell Q. Klinger and Father Francis Mulcahy, well as Soon-Lee Klinger and keeps them completely well in character while changing the setting from the middle of a war, where there job was to patch and ship them out, to a Veterans hospital where sometimes the ones they saved, still have a long way to go.Starting off, Potter finds retired life too dull and after having problems back in private practice, found a good place and winds up Chief of Staff in the Veterans hospital, where he finds an old War Buddy from his Unit back when he was a Sgt (Bob Scannell, played by Patrick Cranshaw). After Klinger found trouble set himself up home after finding Soon-lee's parents, and his family not accepting a Korean daughter-in-law, He ends up helping out Potter and becomes his Sectary, but has to learn you can't just pull some of the same tricks as in the Army. Then Father Mulcahy joins after having a major depression when it was found out he was deaf. After a minor operation, part of his hearing is restored and he works at the Hospital.New Characters include the Hospital Administrator Micheal D'Angelo (John Chappell) who is more interesting in his public image then the patients, Alma Cox (Brandis Kemp), his Sectary and in charge Admin who hates everyone bar her love, D'Angelo, while wanting everything to go via the book and has a grudge against the loose altitude of Klinger.When the show starts, it also features Alma's Assistant Bonnie Hornback (Wendy Schaal) who fancys Klinger, and Dr Gene Pfeiffer (Jay o. Sanders), the local resident who is always over tired and with a lack of money leading him to try to get food wherever he can. over time, these characters disappear into the background before being completely removed, with Pfeiffer being replaced with Dr Boyer (Davie Ackroyd) a former frontline medico in Korea who lost his leg and has a big chip on his shoulder.While the show was good, it didn't quite get the crowds they wanted and they tried to push it closer to Mash.. but sadly, they didn't seam to know how to do that and after Klinger had a few run ins while trying to get money to support his wife and soon to be born child, he ends up back in court where he decides to pretend to be insane. Some say this means he is 'Back in a dress', but doesn't wear a dress much, but wares a range of outfits where he has to prove to them he was insane, but got better. The Hospital Admin is changed and some characters come and go. Season two was very much NOT helped by the Network deciding to put the show opposite the A-team, believing (falsely) it could beat it in a war. Leaving a batch of episodes unaired and even some unfilmed.It's easy to see why people compare it to Mash, as a Spin-off, it's trying to take some of the love for the show and bring it to a new one, but this show successfully takes old characters and puts them into a new setting.. However the new characters weren't always used to the best and the settings weren't always the best and people didn't get it as much of a chance as it needed and it would be a shame it see it never released to the public.Some notable episodes often feel, like M.A.S.H. before it, don't quite go as far as they could do when they have to deal with after combat issues like Downwinders, left behind shrapnel, missing limbs and more.","Originally I was going to title this review as \"Beating a Dead Horse\", but thought that was way too cruel.If you've read my review on M.A.S.H. itself, you'll know that I got tired of the series after the first couple of seasons. And that's key, because I think most shows actually lose their \"freshness\" after all of the unique themes are used up, and that's usually within the first season or two. After that the show becomes like a worn piece of furniture; comfortable, familiar, but not all that attractive, yet accepted.After MASH was a fine looking production from what I remember, but it seemed like the cast had created a familial unit from which they could not escape, and unless they were a marquis player like Harry Morgan, the on screen talent's career would not be TV nor feature film oriented.When I saw it I felt this tired feeling come over me, like I did when I saw a lot of TV. But After MASH in particular because as I stated in my MASH review, the actual Korean war only lasted a few years, and yet the show just went on forever, ignoring a lot of history of the actual conflict itself, and then taking this very \"high and mighty\" attitude about how ridiculous the war was, forgetting the fact that it was the Soviets trying to establish a communist Korea in direct opposition to the Korea we had liberated from the Japanese.But none of that history is mentioned in either TV series. It's just more introspection on the human self, and how violence from doctors is bad, and how army doctors would never take a life. Fortunately real US Army doctors and medics have a much different attitude and training regime; i.e. they shoot and kill the enemy when needed. But you'd never get that from watching either series.What was good about this show were the production values. Excellent sets, costumes and even some exteriors. You really got a sense of post Korea America in the 1950s transitioning into the early 1960s. But the implausibility of the characters remaining together after being discharged and standing down, was, even from a Hollywood standpoint, just way too implausible for me to swallow.An interesting effort, but to me it's just another reminder of why I really disliked most of the TV offerings coming from Los Angeles, and a reminder that what the nation needed at the time, and thankfully has now, are actual documentaries about various military engagements, including the Korean War, that the US has been involved with.Again, not a series I would recommend, but it actually is a handsome looking production.Give it a shot and see what you think.","It would have a perfect ending to M*A*S*H all the characters in civilian lives B.J. and wife Peg and daughter in suburban San Francisco Hawkeye crab~backed in his practice in Crabapple cove Maine Iron nurse Margaret Hoolehan in the big city hospital and severe but gentle Col.Potter and of course Maxwell Klinger! a fine 2 night special it would have made but hollywood turned it into a series after the war Klinger wanted to leave Toledo due to the constant prejudgice to his mixed marriage to his Korean beloved Soon~Lee and the economic decline of Toledo he got a stop~gap job as a bookie to raise funds to move to California he was however, arrested and was on his way to jail for six months he talked the judge into letting him go free because of his troubles and the promise of a job in Long Beach, California far far away from Toledo a letter from his job connection Colonel Potter with train fare enclosed convinces a rather reluctant and prejudiced judge to allow Klinger 24 hours to get of town so he and Soon ~lee hightail it to California mostly the show lacked that certain something to make it interesting and sustainable it was a wearying and tension filled show the only interesting dramatic was the relationship between clerk Klinger and office manager Alma Cox it was a replication of the subordinate Klinger to female authority figure Houlihan role Alma Cox had none of Margaret Houlihan's competence, intelligence, or kindliness but she did have Houlihan's overbearing bossiness and her own innate bigotry, pettiness, and viciousness the show also had Father Mulcahy as the chaplain at Veteran Hospital where they all worked I don't recall if he recovered his hearing though","i grew up with mash 4077. i have seen every episode & have collected all but the very last one.i have laughed & cried with them. the writers, producers, & all the actors all did an excellent job in making it as as real as possible.it had to be hard for them to do their parts when reading their scripts without getting somewhat teary eyed.i know i couldn't do their job without breaking down.i have to give them credit for all their effort,heart & soul they have put into making the movie. i realize some parts aren't like that in real life but,most of it is & its sad. some shows can be so realistic, you find yourself really getting wrapped up & involved in it.really makes you think how it really is in real life over seas & how our troops are dealing & coping with it. one can only imagine.i would like to see more of mash & others like it to be aired again.","I never watched this show until just recently on You Tube. I wanted to be fair and give it a real chance before jumping on the band wagon of denouncing this series as one of the worst spin-offs in TV history. After watching a number of episodes with an open mind i am ready to conclude that this series was not one of the worst spin-offs in TV history, it was THE worst spin-off in TV history. Set shortly after the end of the Korean Conflict. Potter, Klinger and Mulcahy are back in the states working at a VA hospital. After some preliminary introductions to Mrs. Potter and the new cast, the show desperately tries every bell and whistle it can to engage the audience but leaves you missing the good old 4077 in the original series all the more. I don't blame the cast. Morgan, Farr, and Christoper did the best they could but i am convinced that nobody had a clue how to develop this series properly. The scripts were vague and contrived and rarely held your attention. The reason I think it is so horrible is because of the height it fell from. Fair or not, to bear any resemblance, let alone half a title, of a legendary TV show and to come up this short is nothing short of insulting. What were the producers thinking?"],"review-user":["happipuppi13","longcleona","zacdawac","feakes","aschachte","Baldach","raysond","meija1","wingsandsword","gazzo-2","BRWombat","haildevilman","marypeterpuffer","Manicman8","Blueghost","zog-3","jasminesierra2","Jetset971"],"review-date":["27 January 2008","21 March 2007","4 August 2003","20 December 2015","23 June 2006","23 February 2003","6 August 2002","30 August 2000","31 March 2006","30 December 2000","21 July 1999","14 September 2006","18 August 2018","2 June 2018","9 December 2015","31 December 2000","24 March 2006","11 November 2012"],"review-rating":["5","10","2","5","7","7","2"],"review-title":[" \"Spin Off Ride Was Painless\"\n"," This show has one fan\n"," The thing that bothered me about this program-\n"," A Logical follow up.\n"," Bland left-overs\n"," Klinger in jail.\n"," After the success of the first one,what happened?\n"," re: Let it go guys\n"," MASH could have really used a follow-up, this wasn't it.\n"," Hmmmmmm\n"," Let it go, guys.\n"," Wasn't worth it\n"," WHY NO DVD BOX SET OF THIS SHOW?\n"," Better then people claim, just not what they expected\n"," A nice looking series, but tiring.\n"," I'm glad I saw this show\n"," mash 4077\n"," You could see the desperation from the very start\n"]}