{"review-url":["http://www.imdb.com/title/tt0025169/reviews"],"review-text":["This is a surprisingly entertaining comic mystery, given that it is mostly low-budget and has a low-profile cast.  \"The Ghost Walks\" is an old-fashioned gloomy house mystery story.  Although a lot of the plot elements are old standbys of the genre, there are some nice twists, and the low-key humor usually works fairly well, too.The film begins with a playwright, a theatrical producer, and the producer's assistant getting stranded in the country and seeking refuge in a large, gloomy old house.  The playwright happens to know the occupants, and it turns out that the house had been the scene of a still-unsolved murder some years previously.  At dinner, the producer and his assistant listen uncomfortably as everyone else discusses the old murder.  Suddenly the lights go out, and then - then comes a pretty nice twist, which most viewers should find surprising and satisfying.  It sets the stage for the rest of the action, and is quickly followed by some other twists.The story that follows is routine in parts, but it is entertaining and has just enough unpredictability to keep the viewer's attention until the end. There is a lot of light humor, most of which is handled pretty well by the cast.If you like old-fashioned mystery stories that do not take themselves too seriously, you will probably find \"The Ghost Walks\" worth watching.","The Ghost Walks is a nifty little mystery with a great twist, snappy dialog, and best of all a pansy played to the twittery hilt by character actor Johnny Arthur which never demeans or denigrates his character. Mr. Arthur is great in his role of Homer Erskine bringing great comic relief as the secretary of the Broadway producer Herman Wood, played by another great character actor Richard Carle.They play off of each other superbly.Although the acceptable words of the time sissy and cream puff are used to describe the character of Homer, it is never mean spirited or meant as denigration, and are not spoken by the manly males of the film but by his employer, who fires and rehires him every other scene and who displays an almost exasperated affection for his devoted employee.There is a great scene where Homer tells his boss that he has devoted the best years of his life to him and has been everything but a mother to him.The mystery angle of the film is very entertaining, and the twist at the end might just leave you in stitches.For a low budget poverty row picture, this film has superb set decoration and great costuming.Director Frank Strayer ably handles his cast and this film holds together much better than some of his other low budget mystery attempts, but he had a great script to work with and some wonderful actors to carry it through.This film is a must see for devotees of poverty row films, old dark house mysteries (they actually managed to work in the lines \"It was a dark and stormy night)and it has the added bonus of being an early representation of a gay character in film where nothing bad happens to them in the end.This movie is available for download in the public domain film section of the Internet Archive at archive.org.","One of the genres that flourished during the decade of the 30s was the variation of crime fiction known as \"the murder mystery\", as the addition of sound to films helped to make a more faithful translation to film of what the audiences experienced in the original plays. And since horror films were very popular in those years, by enhancing the horror elements of the plots the murder mystery films experienced a popularity almost equal to what it enjoyed in the previous decade (in which the first movies of the genre were produced). Aspiring playwright Charles Belden saw in this renewed interest in murder mysteries a chance to make a name for himself, after Warner Bros. picked his three-act play, \"The Wax Works\", to create the 1933 horror film, \"Mystery of the Wax Museum\". Belden joined independent filmmaker Frank R. Strayer to keep making films, and \"The Ghost Walks\" was one of his best.In \"The Ghost Walks\", John Miljan plays Prescott Ames, a young playwright who wants to impress a famous Broadway producer named Herman Wood (Richard Carle) with his new play. Ames takes Wood and his assistant Homer (Johnny Arthur) to his country house for a reading of his play, but his car ends up stuck in the mud during a terrible storm. The three men ask for refugee in an old Mansion which happens to be property of one of Ames' old acquaintances. Inside the house, Wood and Homer witnesses the strange relationship between Ames and the house owners, however, this is all a plan conceived to impress Wood: everyone in the house is an actor playing a role in his murder mystery. Unfortunately, the murder committed is done for real, and while Wood and Homer think it's all fake (after discovering Ames' original plan), the cast knows that someone inside the house is a real murderer.As expected, Charles Belden's screenplay for \"The Ghost Walks\" features the classic elements of the murder mystery stories of its time, as we have the stormy night at an old dark house as setting, the obligatory group of suspects, and the touch of comedy. However, what's interesting here is how Belden makes the film a real spoof on the genre with the many twists he puts in his story to play with the clichés of murder mystery plays. The dialogs are excellent, full of wit and lighthearted charm, and while the plot certainly loses a lot of steam by the end (it follows the murder mystery routine anyways), it never fails to be interesting and entertaining thanks to its smart twists and specially its quirky characters. Interestingly, there's an obvious gay subtext that while stereotypical, it's never denigrating and it's genuinely funny at times.By 1934 director Frank R. Strayer was already an experienced craftsman in the Poverty row side of the film industry, but his partnership with writer Charles Belden would give him a couple of his most interesting movies, and \"The Ghost Walks\" was one of them. While obviously done on a shoestring budget and the typical production values of independent films of its time, Strayer manages to take advantage of his set and makes an atmospheric movie that fits nicely the mood and tone of the story. The pacing is a little too slow at times, but Strayer knew that the power of his film was on Belden's script and makes the most of it, letting his cast to make the most of their characters with excellent results. Certainly the execution is a bit typical and unoriginal, but Strayer makes an effective albeit restrained work in this film.As written above, the screenplay is filled with great lines that make the quirky characters shine, and fortunately, most of the cast play with this to their advantage. Veteran character actor Richard Carle is remarkably funny as cranky producer Herman Wood, adding a lot of charm to his character, specially in his scenes with Johnny Arthur, who plays the flamboyant secretary Homer. Arthur is the one who gets the most best scenes, and he gives and hilarious performance as the cowardly yet witty assistant. John Miljan is just effective as Presocott Ames, nothing amazing, but nothing really bad, and the same could be said about June Collyer as Gloria Shaw (the obligatory love interest), whom is just fine. However, Donald Kirke is really enjoyable as the malicious Terry Shaw, and it's a shame he didn't get more screen time.As usual with Frank R. Strayer films, the low budget hurts the film badly, as while Strayer makes the best he can, the film still feels kind of plain at times. However, the main problem is problem the very slow pace it has, as even when the film is filled with sparkly moments of witty dialogs, it moves at a pace so slow that can become boring and tedious for moments. It also must be said that while effective in their roles, Miljan and Collyer are pretty dull and average when compared to Arthur and Carle, and one wishes the movie had been more focused on the comedic pair they make than on the main couple. Finally, as written above the ending is kind of weak and not up to the high standard of the first and middle parts, although credit must go to Belden for keeping creative plot twists appearing until the very end.One could say that Charles Belden is an unsung hero of the murder mystery genre, as among the many horror and mystery films that came out the B movie studios nicknamed as \"the Poverty Row\", \"The Ghost Walks\" is easily among the best (alongisde Strayer's previous film, \"The Vmapire Bat\") despite its shortcomings. And even when it's definitely not a masterpiece of the genre, it's a nice way to spend a night enjoying the way it pokes fun at its own origin as a murder mystery play. A very recommended film if you like the genre. 7/10","I have this movie on a collection of inexpensive B-movies. It's not restored, in fact, the audio was difficult to discern for the first few minutes.At first, it seemed like a typical haunted house film, and feels very much like the forerunner of Clue, Murder by Death, House on Haunted Hill, etc.About a half hour into the film, the storyline takes a really interesting twist--and it goes from being a cliché melodrama to something entirely different, and far more entertaining than I had initially thought.Check it out, it's a great deal of fun, even if the long clips and wider shots (and near lack of music score) make it feel a bit creaky by today's standards.","On their way to a country house to hear a new play being read a theatrical producer, his secretary, and the playwright end up stuck in the mud. They make their way to a nearby house, only to end up at the home of the playwright's fiance. If you can't guess that murder and mayhem are about to take place then you haven't been paying attention.This is a a good entry in the old dark house genre. Not only does it have a good mystery, you also have some very funny one liners wandering through it. The cast is across the board excellent and they're more than willing to have a good time with what is good material.I would love to say that this is one of the best of the genre, it should have been, but for me something happened on the way that made me down grade the rating to only seven out of ten. I can't tell you what it is, not for certain anyway. Perhaps its the sense that I knew where it was going almost from the outset, or perhaps its something else, I'm not sure what, but there was something that I couldn't shake that made me like this film despite wanting to love it. It just missed being great and somehow fell short.That said I DO SUGGEST YOU SEE IT. It is after all a very witty film, that entertains fully, despite just missing being great.","Now, this movie, made in the middle of the great wave of 30s' mysteries, certainly has got ALL the 'necessary' ingredients: the isolated old house, the thunderstorm outside, psychic ongoings, turning bookshelves, eyes staring out of portraits, secret passages... But at the same time it's also one of the very first, and best, spoofs on the genre - and the scary moments are really masterfully mixed with the comic ones! It all starts (once again) with a car being stuck in the mud in the middle of nowhere, with only an old mansion for the three travelers to seek shelter from the rain: a theatrical producer, his secretary, and a playwright. But the scenery changes as soon as the inhabitants of the house greet the playwright: they're old acquaintances, although not all of them seem to be on very friendly terms with him. And then a strange woman makes her appearance: dressed all in black and staring in an absent-minded way, she steps down the stairs - and scares the travelers with her strange talk about danger and murders in this very house... The host explains that she's his sister, and she's been mentally disturbed ever since her husband was murdered right there in the dining room three years ago - and as soon as they sit down to dinner, she starts talking to her invisible dead husband, a chair starts to move all by itself, the lights turn out, a frightening death mask is seen; and when the lights are on again, the mysterious woman has disappeared...But as soon as the producer and the secretary, both scared to death, have disappeared into their room, the atmosphere changes: the playwright and his friends, who turn out to be actors, are very much amused and pleased by their 'rehearsal' of his new play, which he hopes the producer will accept this way! Meanwhile, the producer finds a copy of the script in his room, and so he also thinks he knows what's going on, and decides to join in with the 'fun' - only that a short while later, the 'play' is ended suddenly when they find the actress who had impersonated the disturbed woman is found dead behind a door...From this point on, the movie keeps confusing us so much that sometimes we really don't know where the 'plot within the plot' stops and the 'real' horror begins... But the balance between mystery and comedy is being held really perfectly throughout the whole movie, so it should provide unforgettable entertainment for ALL classic movie fans with a sense of humor - a much underestimated little B movie gem that should certainly get more attention by film historians, so that a wider audience will be able to get to know and enjoy it!","Some nice plot twists keep the viewer sitting up through this old dark house mystery featuring John Miljan as a playwright with a new play to read—a thriller, this time! Among a supporting cast of vaguely familiar faces, Richard Carle and Johnny Arthur lend comic relief as a Broadway producer and assistant accompanying Miljan. Producer Carle is constantly firing and un-firing assistant Arthur, which is cute but predictable; on another level entirely is their merry insistence for a good chunk of the film that the entire \"mystery\" taking place is part of Miljan's presentation of his new play, put on for their benefit!Nothing particularly unusual here, otherwise, but those of us who enjoy being trapped in a dark house on a stormy night with an escaped lunatic in the neighborhood will find an hour of fun. As a bonus, the final few minutes feature a couple of bursts of really ripe maniacal laughter.","A fierce storm forces playwright Prescott Ames (John Miljan) and his friends, Broadway producer Herman Wood (Richard Carle) and secretary Homer Erskine (Johnny Arthur) to seek shelter at a country house. It seems they walk right into the middle of some weird happenings - Dr. Kent (Henry Kolker) has mental patients in various rooms and every so often blood curdling screams are heard. Beatrice (Eve Southern) is convinced her late husband was murdered and goes into trances when she communicates with him. There is a showdown at dinner with accusations flying thick and fast - the lights go out and Beatrice disappears. It is all too much for Wood and Erskine, who go to their room intending to leave. But things are not as they appear - Ames has masterminded the whole evening - it is the first act from his new play and everyone at the house is an actor, rounded up by Gloria (June Collyer) Ames' fiancée. Woods and Erskine cotton on when they find the play, \"The Ghost Walks\" in their room, but meanwhile someone is taking things seriously because Beatrice is found murdered.A knock at the door is heard and a keeper from the local sanitarium is enquiring about an escaped patient. \"At the sanitarium we call him Case 202 - I guess you'd call him a homicidal maniac\"!!!! Of course while everyone is now in a panic, Woods and co still think it is part of the play and are constantly making jokes!! Ames then tells how he came by the house - it was once owned by a mad doctor who had 9 patients that mysteriously disappeared. It then got the reputation as a haunted house. When a portrait \"winks\" at Erskine, he finally gets the message that this is not a game - meanwhile half the guests have mysteriously disappeared.....While the \"play within a play\" was ho hum to Broadway audiences, it was still a novel idea to film patrons of the mid thirties. This is a quite enjoyable film that is very easy to watch and even though Johnny Arthur is one of the leads, he is quite funny and the laughs don't get in the way. It is just so nice to see John Miljan as a likable hero (with no nasty secrets to hide) and June Collyer is just as beautiful as ever as the love interest. Johnny Arthur specialised in whiny, effeminate types - typical was his role as Homer Erskine.","The film begins with a cranky old Broadway producer (exceptionally well-played by veteran character actor Richard Carle) being driven by a man hoping to sell him a story for an upcoming play. However, there is a bad storm and their car becomes stuck in the mud and so they are forced to look for some place to spend the night. Fortunately, there's a mansion nearby though it seems pretty odd that the people inside know the writer and he says he didn't realize this was the home of a man he knew (and despised). However, while this seems like bad and contrived writing, it is not....as this is all part of an elaborate ruse by the writer to have a group of actors in the home act out his plot. However, part-way through the ruse, the producer and his browbeaten assistant figure out that the murder mystery taking place in the home is fake and think the whole affair is pretty funny. What no one realizes, though, is that an escaped maniac is loose and he is about to enter this contrived little plot--making for some wonderful twists and turns. So when it seems that there is a real murder, the actors are truly terrified while Carle and his sidekick are convinced it's all a hoax. While I have explained some of the plot, there are many more aspects of the film you'll just have to figure out yourself--and it's surely to keep you entertained and guessing.Considering that this is a B-movie in the public domain, I certainly did NOT have very high hopes for this little film. However, I was thrilled when the film turned out to be a much better than average flick--with a very interesting and novel twist on the old clichéd plot about a dark and stormy night spent in a mansion. Plus, while the plotting of the film was very good, the dialog was even better--with lots of sparkling wit and a nice light-hearted pace. Full of pleasant surprises and well worth your time.","Your average story of people being stranded in the road on a dark and stormy night and they seek nearby shelter with a stranger who happens to have a very large mansion. Then strange and spooky things happen. I actually enjoy this clichéd scenario with horror films.This one is cute. It's sometimes funny, sometimes interesting, sometimes with neat imagery. The story of course is nothing special but it's a fun movie to watch. Although it's not a film to seek out but it is one that is pretty good to watch from a film pack or a free copy to view online if you happen upon the film and like older cute \"dark and stormy night\" films.I would describe this film as a comedy-mystery horror - and if you like that kind of movie then you might like this one.6/10","When a group of strangers are gathered together at an abandoned mansion and accused of murder, it soon becomes apparent that it is all a hoax, but murder follows involving the party's hostess and efforts for the remaining guests to sleep becomes more difficult thanks to the strange events that recur throughout the evening. Even the presence of beat cop Spencer Charters can't calm the guests, especially after one of them (Johnny Arthur) finds himself victim to a canopy bed that appears to descend down on him. Arthur, the constantly fired assistant to Broadway producer Richard Carle, is an odd suspect, because the only violent act he could be capable of committing would be forcibly re-doing somebody's hair. John Miljan and June Collyer are the typical young lovers caught in the middle of this situation, although for much of the film, Collyer is off screen, having just fainted, leaving only the men onscreen to try to solve the murder of hostess Eve Southern. It's an amusing, but still very inconsequential \"D\" grade thriller, mixed with comedy, a few macabre touches, and some interesting, if cliched, characterizations.","The Ghost Walks, starring a bunch of people we've never heard of. The usual story... car breaks down in a storm, ends up in the house where weird stuff starts happening, kind of like in Rocky Horror Picture Show. Directed by Frank Strayer, who had also started in the silents..this was a Maury Cohen production, so keep those expectations low! sound is terrible, picture and editing are miserable. badly in need of restoration. The hostess starts to see things that aren't there, and may be communicating with them. Séances and the occult were big in the 1930s, and this is a \"horror\" film in that genre. The acting is cardboard, and the script is just terrible. kind of fun to watch, in spite of the poor quality. It's pretty terrible. Showing on Moonlight Movies. Skip it... ain't no thang. Baaaaaaaaaddddddd.","Mr Ames was taking two men on a trip to his house during a storm. It was to show his passengers Mr Woods and his secretary Mr Erskine a play he had written. The car he was driving has problems and they have to get out and walk. Nearby there is a big house.They make their way to the house and Mr Ames knows the people that own the house and some of the guest. One lady is the daughter of the owner of the house. She is Ames girlfriend. Throughout this movie the secretary Mr Erskine is funny, he is afraid of everything Many unexplained things happen in the house. A woman named Bernice talks to spirits. Supposedly Dr Kent is the lady's doctor. Bernice has mental problems. Later she comes out again has dinner and talks to a spirit.Mr Woods finds and reads pages of the play in a manuscript in a bedroom. He realizes this was all a gimmick and this was the play Ames wrote. Woods starts to laugh and thinks it is a good play. Mr Ames admits that he hired these actors to act out his play in front of Woods but now Beatrice the one who talks to spirits is dead and then her body disappears.Scary, funny and stupid. It turns out there are secret passages in the house. There is also a picture on the wall that has eyes that move. A guard comes to the house and tells the guest that a mental patient escaped nearby and he will stay in the house just in case the person goes there.The villain captures 4 people who he intends to operate on in the house where the secret passages and rooms are. He intends to change their, nose, face, chin etc.This movie is full of things that may or may not be part of Ames play but you get a few laughs out of it.","It's occasionally amusing -- a story about seven people in a \"haunted house\" on a stormy night. One by one, four of them disappear, evidently one of them murdered.There's a lot of shouting and carrying on. One of the characters -- the secretary of a Broadway producer -- is gay, and I'm glad because he gets most of the funny lines and bits of business. I suppose some people today would argue that the character's flamboyance is politically incorrect but I'm sure that if this were shown in the Castro Theater it would get belly laughs and applause.The plot is hardly worth going on about. I always enjoy the notion of a handful of people stuck in a country mansion during a fierce electrical storm but the writers have to DO something with the proposition. After all, it's not funny in itself. Neil Simon did an exceptional job with it in \"Murder By Death,\" using some of the same hoary tactics. (Two living eyes stare out of a painting.) All of the acting is overdone. The lines are loud and the gestures theatrical, but the viewer will have to go easy on such weaknesses. It's 1934, and many of the actors of the period came from the stage. They had to shout to reach the balcony. On top of that, the huge, noisy cameras had to be enclosed in soundproof \"blimps\", as they were called, and the microphones hidden in vases, buttonholes, garter belts, and whatnot.It's worth a look, perhaps, but not two looks.","\"People stranded in a country house during a storm discover that the home was the sight of an unsolved murder years before. During a dinner discussion of the incident, the lights go out and, when they come back on, they discover that one of the guests has been killed. Fearing for their lives, the guests attempt to find out the secrets behind the death before others can occur,\" according to the DVD sleeve's synopsis.There are a couple of clever twists in this murder at the \"Old Dark House\" story, with the \"Play within a Play\" being its most interesting feature. However, the direction is rather ordinary, which serves to highlight a certain cheapness of production. Like most movies of this type, there is (or, should be) an ensemble of intriguing characters. Herein, only old-time Broadway producer Richard Carle (as Herman Wood) and his fey secretary Johnny Arthur (as Homer Erskine) maintain interest.**** The Ghost Walks (12/1/34) Frank R. Strayer ~ Richard Carle, Johnny Arthur, John Miljan","I'm really interested in these early clever narrative folds. Here's the fold in this one: the movie we see is  we discover at the end  written by a character in the story, produced by another and presumably featuring actors we see in this movie as actors playing characters playing actors playing actors.Here's the story: a playwright wants to get a producer to produce his play. So he tricks him into a strange house where actors are assembled to perform the thing as if it were a real spooky murder. The pretend victim ends up dead in reality, and from then on the players leave the play and enter reality. The producer discovers the ruse at this point so he shifts from believing it real to believing the \"real\" thing is a play.Overlain on all this is another drama. A madman has escaped from the local loony bin. It turns out that he also is a consummate actor, and he has his own fantasy to enact. It also draws from spooky movies but in his case it is the mad scientist genre rather than the spooky detective story. These two fictions compete for dominance in the spooky house.The actual production is plain with values typical of the period, which means that you will likely find it boring. But the idea is remarkable.One folded joke: the producer is coughing. His assistant says are you okay? Producer: \"Sure, why?\" Assistant; \"Because you were coughing horribly.\" Producer; \"You think you can do better?\"Charles Belden, the writer, was a sort of genius at these sorts of folded things. He did \"House of Wax.\"Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.","The Ghost Walks starts late on stormy night as theatrical producer Herman Wood (Richard Carle) & his secretary Homer Erskine (Johnny Arthur) are being driven from New York to Cragdale by playwright Prescott Ames (John Miljan) who is going to read Wood his latest play. However a fallen tree on the road prevents that as their car becomes stranded, the three decide to head to the nearest house for help & shelter. They arrive at a large mansion where Dr. Kent (Henry Kolker) lives, he is treating a patient named Beatrice (Eve Southern) who has psychological problems after the murder of her husband three years ago in that very mansion. With other assorted guests Ames, Woods & Erskine decide to stay the night but strange things begin to happen & when Beatrice is found dead it seems that there is a killer amongst them...Directed by Frank R. Strayer this obscure hard to find old dark haunted house type horror mystery from the 30's is alright but nothing overly special. The script by Charles Belden shoots it's load far too early for my liking, the main plot twist is revealed about 20 minutes in & isn't a bad twist at all but afterwards the films becomes a rather bog standard mystery with an extremely predictable & routine ending which I was surprised the makers went for purely because it is so obvious & because they tried to inject some mystery & suspense in the film which the ending is totally at odds with. Maybe back in the mid 30's audiences hadn't seen too many films like this but then again you would have to be pretty dumb not to figure this one out even back in the 30's. The character's are alright but the comedy relief Woods & his secretary Erskine become extremely annoying, the running gag about being stuck in a play is frankly irritating. On the bright side it only lasts for 63 minutes so at least it's short & sweet, it's watchable I suppose & will pass an hour harmlessly enough but it's not something that I think is anything special or would want to watch again anytime soon.Director Strayer does OK but of course you need to take into account the fact it was made back in the early 30's, just think about that for a moment because that's over 75 years ago. It was released on December 1st 1934 & that's literally a lifetime ago. The scenes set outside at night during a thunderstorm are quite atmospheric but the interior scenes are dull & bland. Unfortunately I think The Ghost Walks is a public domain film & therefore the print is not going to get cleaned up anytime soon, the print quality is atrocious with a huge whacking great white line running down the right hand side of the picture for the first 15 minutes & plenty of scratches, pops, crackles & damage for the rest of it. Even if a big Hollywood company decided to release it would they bother to remaster it? Would they really spend time, effort & money cleaning the prints up? I seriously doubt it'll ever happen & therefore The Ghost Walks will probably alway look terrible. Being shot in the 30's this is squeaky clean without any death's, violence or profanity so it's family friendly stuff all the way.Technically the film is fine considering it was made over 75 years ago, the black and white photography is alright although as I've mentioned the quality of the prints make it sometimes hard to sit through. The acting is OK but there are a few wooden performances here, actually now I think about it there's lots of wooden performances.The Ghost Walks is an OK time waster, it passes an hour but I doubt the twists will surprise anyone these days & I doubt it'll live that long in anyone's memory either. If you can actually find a copy & can live with the bad picture quality then it's just about worth a watch.","A delightful, eminently watchable comedy, masterly paced, you may find it endearing, with its expert timing, and despite the gracelessness of its male cast, anyway the movie spells its genre so as not to disappoint the gullible; a playwright rented the mansion once owned by an insane physician, whose legacy of fright still carries on, and the playwright gathers there several people to stage his play, with one of the main results being that they all are really guests and none knows indeed the house. I believe that the device of 'the audience on stage', or 'the audience in the movie', as represented by the old-timer and his degenerate secretary intended to have fun no matter what, worked wonderfully; that's how exciting they felt to be the cinema, and they were right. Miljan plays the controversial playwright, June Collyer plays the starlet, while Kolker and Kirke are the usual creeps from such movies; save for the two girls (June and Eve), it's an ugly cast, one player uglier than the other, at least four mugs (the playwright, the supposed Amphytrio the psychiatrist, the heady Terry, the butler).Eve Southern was intriguing, she's the one playing the insane widow.The guards' uniform looked eerie. The patient's discourse was an early impersonation of the German Leader.Nice pace, sharp one-liners, two likable actresses, ugly male cast; as said, it's a farce, kindred to music hall, revue, etc., but the plot was neat anyway, and the experience is refreshing.Strayer directed 'The Ghost ' in '34, and 'The Monster ' in '32.","This is the usual plot where people are forced, by the weather, to stay in a rich man's house. The house has secret passages and dark corners and lights that turn off at inopportune times. The plot is basically twofold. At first, a young playwright is scripting events so he can impress a big time movie producer. Unfortunately, people begin to disappear, and one woman seemingly dies. There is wacky comedy and romance and events involving kidnapping. Some are able to keep their cool, but generally there is a frantic moving in and out of rooms. There is also the classic of the hand opening the door but not exposing its owner. Pretty ordinary in my estimation. Some of the characters are really quite charming.","A stageplay producer and his assistant are invited to an old house during a rainstorm with unexpected results.The movie's played more for laughs than for shivers. Erskine (Arthur) and Wood (Carle) are played very broadly, and in Erskine's case with a fey undercurrent. In fact the rather clever screenplay appears to be having a good time with innuendo. There are two good twists to the story, but I kept waiting for the ghost who never seemed to arrive. In fact, the little programmer is more a light-hearted mystery than anything scary. And who is Eve Sothern (Beatrice). I've never seen her before, but with her gorgeously angular features, she furnishes the movie's one riveting moment when she first appears, zombie-like. Anyway, this could have been a good little mystery-fright film had those in charge decided to drop the awkward comedic overlay.","Ghost Walks, The (1934) ** (out of 4) A screenwriter invites his producer's to an old dark house. He's paid a bunch of actors to act out his play so that the producer will put up the money but soon a real killer starts to stalk them. The premise is rather interesting but like most of these types of films of the era it really never gets too interesting due to the lackluster direction. Perhaps I've just seen way too many of these films but they all appear the same. Just a different cast.Living Ghost, The (1942) ** (out of 4) A detective is hired to find out who killed a man but once he's on the scene another victim falls into some sort of zombie-like state. Here's another \"old dark house\" film that has a rather boring mystery plot and lifeless direction from the usually reliable William Beaudine."],"review-user":["Snow Leopard","ricmarc2001","jluis1984","greggbray","dbborroughs","binapiraeus","csteidler","kidboots","MartinHafer","Rainey-Dawn","mark.waltz","ksf-2","ctyankee1","rmax304823","wes-connors","tedg","poolandrews","Cristi_Ciopron","Hitchcoc","dougdoepke","Michael_Elliott"],"review-date":["4 June 2001","24 March 2005","14 November 2007","4 March 2006","16 May 2004","21 February 2014","15 August 2011","22 June 2010","20 July 2007","31 October 2016","10 October 2018","25 July 2018","17 January 2017","11 June 2014","21 February 2009","28 December 2005","7 December 2007","7 January 2016","31 May 2015","18 January 2013","12 March 2008"],"review-rating":["10","7","7","7","8","6","7","6","3","4","5","4","5","6","4"],"review-title":[" An Entertaining Comic Mystery\n"," One of Frank Strayers Best and gay subtext too\n"," A nice surprise!\n"," Pleasantly surprised\n"," Another Dark and Stormy Night\n"," A plot within a plot...\n"," Playwright as detective after killer on the loose in old dark house\n"," Old Dark House With a Twist!!!\n"," A dandy variation on the old dark house plot\n"," It's Cute But Average\n"," Another old dark stormy night where strangers gather together and a murder takes place.\n"," crappy ghost story...\n"," Story is scary, funny and stupid\n"," Old-Fashioned Comic Mystery.\n"," Richard Carle and Johnny Arthur Hold Sway\n"," Ghostwriter\n"," Average but short 30's mystery film.\n"," the guards' early Star Wars uniforms\n"," Another Rainy Night\n"," Awkward Mystery-Comedy\n"," DVD Double Feature\n"]}