{"review-url":["http://www.imdb.com/title/tt0065948/reviews"],"review-text":["\"Landscape after a battle\" opens with escaping prisoners over a snowy field full of fences - in rather funny movements accompanied by Vivaldis Four Seasons. A touching opening. But we soon enough learn to know these prisoners as a mob, and when they (also treated humouristic) burry a man alive, the protagonist stops for a moment, but is soon more engaged in finding books from the turndowned camp than caring about his neighbour.The rest of the film is set in an American camp from where the prisoners are not released, in some kind of semi freedom, semi camp. A perfect set for a study of war criminality, American camps, Polish nationalism, Catholisism, grief and human misery in general.Film makes an important turn. In comes women, and with them film changes light, colour and temper. At the same time it turns out that these prisoners were slaves in Holocaust. I think a main underlying political theme of the film must mankind's treatments of Jews under and after the world war, and not only the Nazi exterminations, but mankind letting it happen - and even forcing them out of Europe after the war. On an emotional level the film is about grief and the problem with letting grief come, how environment makes grief difficult, and how difficult it can be to share grief for people with different experiences. But the film is a carpet of underlying contradictions,humour, irony and sudden beauty. A couple of times during the film a gypsy prisoner plays on an harp, an emotional tune brutally rejected (filmatically speaking) by the protagonist. That example picks up an important essence of the film's style and theme. When it comes to humour its very comic how the protagonist constantly looses and finds back his glasses, in crowds, in hay stacks etc.Its not hard to understand Spielberg's respect of Wajda when you see this film. The great treatment of light can be compared with Spielberg on his best. The Grunwald intermezzo speaks for itself. Narrativly it only brings the film out of the camp, but filmatically it brings the film to dream and eternity with profound beauty. Anyhow, there is also another scene I can't let go without comment. Its the Christian Supper. Undoubtly ironical, but simultaneously deeply religious we see the transsubstantiation moment, everybody falling on their knees, while the protagonist is saved from isolation by the priest to serve as a comic altar boy. His bells are mocking the scene, but also gives it emotion and love. When Nina gets her bread, sun light falls upon her and bells ring spheric, its the peak moment of the film.Main actors are excellent in their roles. Olbrychski as the perfect Wajda protagonist - the doubting reflecting mind, unable to put all the aspects of his mind and emotion into life. Beautiful Celinska is with great body acting debuting in a character unable to express all her inner in her proud movements.Those who try to describe everything, often are unable to take nothing in consideration. This is what Wajda manages. His films are either very moving, deep or beautifully shot, but pays attention to life's and society's particularity. A moment of joy for one, is the moment of irony for a second, the moment of grief for the third, a moment of nothing for the fourth.There is at least two reasons to pay attention to Wajdas films of this period. First is the remarkable free expression of deep political impact. This country was the first to overthrow communism twenty years later. Second is the development of a filmatic and narrative language that Kusturica has rose to grandeur.","It's far from perfect, but then the greatest films are rarely perfect. Technically, it's sometimes jarring. The freed camp prisoners don't look starved or weak. Their vengeance on a guard seems limited to trying to drown him in a mud puddle (even though it's obviously supposed to be freezing). The American soldiers are very poorly dubbed and not very well played. The film is talky, and overly intellectualized. It takes a long time to get going. Well, perhaps this last is intentional, since the story is about a liberated Polish prisoner of war in a refugee camp who withdraws from the world and seeks solace in books and poetry. Eventually he meets a Jewish girl who tries to engage him in the world again. As he is beginning to emerge from his shell and respond to her, she is senselessly killed. Visiting her body in the morgue, he allows himself to feel the pain of her death. It is these latter scenes and the extraordinary quality of Celinska's acting that make this film powerful and ultimately a great film. Seldom, if ever, have I felt a person's death on the screen so personally and deeply as with this film.","The opening scenes are pure cinematic ballet as the War prisoners celebrate their freedom from the German camps with the arrival of the Americans. The story then bogs down as we follow one of the prisoners, Taeusz, (Olbrychski), a poet who has emotionally cut himself off from the mayhem around him by dwelling into books and food. The Americans decide to keep the Polish prisoners caged until they know what to do with them. Nina enters the camp and edges Taeusz on to open his eyes but he refuses to take any risks. Only later does he become aware but by this stage it is too late. There are important topics brought up here via Taeusz but never in any cinematic brilliance. Instead we get a lot of talk and the occasional visual brilliance but not enough to keep the viewer interested.","Aside from the fact that the women in the film are stunningly beautiful and all the camp prisoners are too fat, this film rings true on the chaos of the post-war.Beautiful photography, and a powerful national expression of the Polish national character.It's very slow at points, but its entire pacing is so different from American and Western European films that it's quite refreshing.Both lead actors do a very good job. On the DVD version, you can see interviews with the principal actors and crew, and the lead actress Stanislawa Celinska has gained about 50 lbs and lost all of her beauty. But in 1970, she was a stunner.","Krajobraz po bitwie like many films of Wajda is, perhaps, not understandable for the \"rest of the world\". Story based on the few short stories of Tadeusz Borowski, who during WWII was the prisoner of Oswiecim, Dachau and Dautmergen camps. Borowski in his books describes inhuman life in the Nazi camps from the point of view vorarbeiter Tadek - porte parole of author who also was on the privileged position among the prisoners. Borowski was merciless for the humanity and merciless for himself. He describes the human history as the endless chain of exploitation and humiliation. Ironically, after the returning to Poland he stopped writing artistic prose and became communistic propagandist, producing stream of anti-imperialistic and anti-american press publications. After few years he committed suicide. In the movie Wajda changes point of view. Vorarbeiter Tadek - character created by the Tadeusz Janczar - plays only supporting role. Story is focused on the poet, destroyed, burned out  by the war and imprisonement and his one-day love affair with Nina, Jewish girl who escaped from communistic Poland although she actually hates jewish life and mentality. As the background we can observe sad grotesque of so-called \"dipis\" (displaced persons) life, who after the liberation are settled by the Americans in SS barracks. Marches, patriotic kitsch mixed with hunting for the extra dose of food and/or prostituting German girls.","In Landscape after the Battle, Andrzej Wajda in the second era of his filmmaking career, depicts emotional and psychological confusion in a former Nazi-prison in Poland, freed immediately after the WWII.A hand-held camera explores a lot of extreme close-ups and vivid colors. The end credit as graffiti on flanks of freight train cars symbolically concludes the film. The soundtrack is great, except Vivaldi, which sounds tacky in pop-art fashion, in the opening sequence.","I think I would probably not hate this movie if I spoke Polish. I selected the English version at the first menu, but it gave me Polish dialogue with English subtitles, just as the Polish version did. Maybe the dialogue was so disjointed because the person that did the subtitles could not translate it into English very well. To exacerbate the issue, some of the dialogue had no subtitles at all. The acting was pretty bad, especially the female lead, who was melodramatic about everything! One scene that bothered me was when a German woman was caught stealing and as the mob was jostling her around, her shirt opened and the director showed close-ups of her naked breast for the next 15-20 seconds. I couldn't see how her breast added to the drama of the scene or the film. Maybe the director was trying to increase the numbers of teenage boys in the audience. Much of the film takes place in an extermination camp liberated by the Americans. First, the \"American\" uniforms did not look anything like U.S. Army uniforms. Second, none of the extermination camps in Poland were liberated by the Americans. I would think that a Polish film director who turned 19 in 1945 would know better than an American born in 1966 that all six extermination camps were liberated by the Russians. All in all, it's just not a very good film if you don't speak Polish.","there is one of the best movies directed by andrzej wajda,that story told about young writer who is seekin' his place after a second war(he's survive german camp).excellent true atmosphere(action goes in camp for displaced placed),main hero(played by one of the best polish actor daniel olbrychski) finally fall in love ,but unfortunately his lady has been killed .there was beautiful scene,when he is talking with american soldier and says (about death his girl)\"nothing is happen,simply you're shootin' to us now... he's condition of soul has been destroyed. 10/10","A story of love between two people at the end of WWII. Beautifully filmed, very romantic and yet rather fatalistic fable of budding love and war that would not end. If you want happy endings don't watch Wajda movies, sweety."],"review-user":["vtverb","bensonj","mifunesamurai","settdigger","jerzym","jazzest","ETO_Buff","lszyposzynski@yahoo.com","grendel-28"],"review-date":["4 December 2007","22 January 2006","6 August 1999","5 February 2006","21 February 2004","20 January 2004","10 July 2007","3 September 2003","17 April 1999"],"review-rating":["7","6","7","10","7","2","10","9"],"review-title":[" Carneval of depression\n"," In its core scenes, this is a great, powerful film.\n"," Wajda's hit and miss masterpiece?!\n"," Folk Sensibility, Religious Posturing, and Sex\n"," For Polish people only???\n"," Chaotically Colorful\n"," Probably Better If You Speak Polish\n"," end of myth\n"," Great movie, don't miss it\n"]}