{"review-url":["http://www.imdb.com/title/tt0042372/reviews"],"review-text":["A throwback to the \"old fashioned\" Westerns of the 30s and 40s (such as DODGE CITY), DALLAS has a number of things going for it: Gary Cooper at his coolest, blazing Technicolor photography by Ernest Haller (GONE WITH THE WIND) and a pulse-pounding Max Steiner (KING KONG, GWTW, DODGE CITY et al.) score.  In addition, there is a masquerade, mistaken identity, a faked death and more hair-breath escapes than a Republic serial. As always, Cooper defines what it is to be a man under pressure. Forget the 50s angst Western... this is pure entertainment!","Gary Cooper is a cool headed guy. Always liked his easy going level headed characters. As some others have commented, there are some oddities in the script, such as a US Marshall who got his job and can't even hit a barn with a pistol. A rancher with about thirty hands but can't seem to keep his cattle from being run off.But there is plenty of the quick thinking, straight shooting Cooper to keep you entertained.This movie was made in 1950. People in their 20's and 30's have trouble understanding those movies were made for entertainment not Oscars. To expect Oscar material does this film injustice. It is about the good guys finding a way to round up the bad guys.So rent, borrow, or buy this movie, pop some corn and enjoy the Coop one more time.","Dallas stars Gary Cooper, Ruth Roman, Steve Cochran, Barbara Payton & Raymond Massey. It's directed by Stuart Heisler, photography is from Ernest Haller & pen duties fell to John Twist. Produced out of Warner Brothers, Dallas is vividly filmed in Technicolor out of the Iverson & Warner ranches in California. Very much a film with its tongue firmly in cheek, the film is a throwback to the Westerns of yore that exist without pretensions or deep penetrative meanings.The plot sees Cooper's Civil War renegade, Blayde \"Reb\" Hollister, fake his own death so as to kill off his reputation and to free himself for the pursuit into Dallas of the brothers who massacred his family. In essence a routine plot, Twist's story is perked up along the way by many a fun and exciting diversion. There's role reversals, dandy fashions, horseback pursuits, shoot outs, a love triangle, vigorous dialogue and deft little twists to keep the piece purely from painting it by numbers.Cooper seems to be enjoying himself too, which further enhances the feel good factor on offer. It's true he isn't really asked to do anything more than be a laconic dude on a mission. But when called on for action duties, he delivers the goods that his fans have come to expect during his successful career. The villains entertain (particularly Steve Cochran's vile and dopey Bryant Marlow) because each have their own little peccadilloes to keep them from over familiar blandness. The two ladies of the piece look gorgeous and hold up well in amongst the machismo, while the high production value allows Haller to really treat the eyes with the lush Technicolor and involving camera work around the locations.It has ideals to being an \"A\" list Oater does Dallas, something it just can't quite attain. But it's not for lack of trying and the end result is one of pure entertainment, that, in truth, should be enjoyed on a cold winters day when the viewer needs a pick me up. 7/10","There is something feline - almost feminine - in the way Mr G.Cooper walks to his first - reel showdown with Wild Bill Hickock(a piece of theatre put on in order to get the law off his back) that bodes well for those who like slightly anarchic Westerns. When Mr Cooper is killed everybody in the cinema knows exactly what has gone on but it seems to fool those whom it was intended to fool,in direct contradiction to Barnum's proposition. In \"Dallas\" it seems that not everybody knows they are appearing in a slightly camp send - up of the big Technicolor horse operas that were Hollywood's early riposte to the television age. Miss R.Roman seems to take her role seriously,that's for certain. Mr L. Ericson plays his part as a dime store Liberace. This is the sort of film Mr A.Dwan would have delighted in. The dialogue is brilliantly anachronistic,confirming that a few tongues were in cheeks at the production office. Entertaining and amusing,\"Dallas\" would have been well worth my one and nine in 1950.","Saying it all. Nothing like this western before or since, it being the vehicle for two western standbys, Cooper and John Twist, their near apotheosis. Neither were ever better, funnier, or more ...well Bob Hope and Bing Crosby. Twist had many many westerns under his belt by this time, his dialog always outrageous, and Cooper more than once played comedy always to the hilt, about as over the top and with as little concern for anything but taking his shy grin to the near unbearable limit, and line after line of Twist gives every lanky bone in him a chance to strut his stuff...that's right boys, he cut the map of Kansas right through the old buffaloes hairrrrrrrr...or thats for you two love doves, the space of a lifetime, not for me, for me time's running out.......or you were the turpentine, but at least tha settles one thing, they were all in it in Georgia, dogs that ain't eat sheep don't run...... and on and on and on with such outrageous stuff. There was never a writer quite like Twist for the western, his name on anything in Hollywood guaranteed the stretching of the western tongue to heights all his own, and by the late forties and early fifties Cooper had carved out his own indelible persona...and this was their ultimate showcase. As for the plot, forget it, it's entirely lunatic, might have been borrowed from one of the Road pictures...but the lingo....ahhh.... just keep going blue-belly or Ill fry you for breakfast.","Gary Cooper and a marshal change identities, since they both agree Cooper would be more efficient facing the outlaws. What is remarkable in this film are the costumes, both the marshal´s and Steve Cochran´s who is the bad guy. Cochran wears his guns backwards, probably to be able to crossdraw. The film starts quite excitingly with a showdown with Wild Bill Hickok. Ruth Roman, looking very pretty is the marshal´s fiancee. There is plenty of action, never a dull moment, but you have to concentrate, because the story is a bit complicated. Good entertainment.","Gary Cooper masquerades as a lanky, fish-out-of-water, U.S. Marshal dressed in a stove-pipe hat and a fancy frock coat in \"Along Came Jones\" director Stuart Heisler's tongue-in-cheek western \"Dallas\" that depicts our protagonist's efforts to track down the filthy, low-down, varmints that torched his Georgia plantation and killed his wife and son. Raymond Massey, Steve Cochran, and Zon Murray are suitably cast as the dastards that destroy our leading man's life and turned him into a hunted man with a price on his head. Warner Brothers released this post-Civil War oater in December 1950 before \"High Noon\" came out in 1952. Although this Technicolor horse opera lacks the brooding gravity of \"High Noon,\" \"Dallas\" qualifies as respectable, lightweight, horse opera that offers enough thrills and frills to keep Cooper fans and western fanatics occupied during its brisk 94 minutes. An interracial romance between our former Confederate officer and a beautiful Mexican senorita highlights the narrative about the lawless days that followed the end of the Civil War in Texas.\"Colorado Territory\" scenarist John Twist enlivens this routine shoot'em up with some flavorful dialogue. The scene in the stagecoach when a former unreconstructed Confederate trades places with a woman who champions the cause of the carpetbaggers benefits from the spicy dialogue. Massey makes a good, conniving villain but his plans unravel because he cannot control his trigger-happy siblings. Moreover, Cooper outsmarts him at every turn. Most of what transpires in this western is thoroughly unbelievable. The famous frontier lawman Wild Bill Hickok puts in an appearance during the first quarter-hour. The romance between Gary Cooper and Ruth Roman generates only minimal sparks. The funniest scene occurs before a gunfight when Cooper spooks one of the villains by stepping on a cat's tail. Of course, Heisler doesn't show Cooper squashing the cat's tail. Anyway, the feline cuts loose with an eldritch screech that flushes the villain step out in the open to blast away at our hero. Predictably, Cooper drops the bad guy in his tracks. \"King Kong\"composer Max Steiner's score incorporates a great deal of traditional Warner Brothers' soundtracks.\"Dallas\" opens with the villainous Marlow family rustling the cattle of Mexican rancher Don Felipe Robles(Antonio Moreno of \"Seven Sinners\")but Bryant Marlow (Steve Cochran of \"White Heat\")doesn't understand how stealing Robles' steers will help his older brother, Will Marlow (Raymond Massey of \"Desperate Journey\"), get the money back that he has loaned Don Felipe. \"I don't buy mortgages to get paid back. I buy them to foreclose.\" Will assures Bryant and Cullen (Zon Murray of \"Hurricane Island\") that \"the black soil of Dallas County\" will make them wealthy. Will reminds them that they have to restrain their use of violence so his evil plans can succeed. \"There'll be no killing here,\" Will dictates. \"Things won't be like they were in Georgia.\" Bryant and Cullen out as Don Felipe and his son Luis (Gil Donaldson of \"Treasure of the Golden Condor\") ride up. Don Felipe openly accuses Will and his family of rustling their cattle. \"You're blaming me for all the war-bred scum in Texas?\" Will is appalled by Don Felipe's implication. \"It isn't my fault that Texas isn't back in the Union.\" Luis sees through Will's double-talk. Bryant and Cullen rein up nearby and Cullen shoots Luis in the thigh against Will's orders. Don Felipe spews venom. \"Brave, strong, . . . just like lizards in dark corners.\" The Mexican warns Will that his lawless day are numbered because a U.S. Marshal is in route.Boston-bred dude Martin Weatherby (Leif Ericson of \"Carbine Williams\")is the new marshal. His primary reason for heading to Dallas is to impress his fiancée Tonia Robles. He is hopelessly out of place in the West. He is dressed outrageously like the tin-horn and doesn't even tote a six-gun. The U.S. Marshal's badge that he pins on isn't even a star but a name tag. When he arrives in Springfield, Missouri, Weatherby finds himself caught in the middle of a shoot-out between Blayde Hollister (Gary Cooper of \"Sergeant York\") and the legendary Wild Bill Hickox (Reed Hadley of \"Now, Voyager\")that leaves Blayde in the dust. As it turns out, Blayde and Wild Bill staged the duel so Blayde doesn't have to worry about bounty hunters. Blayde accompanies Weatherby to Dallas, but he swaps clothes with him and impersonates him. Blayde is after Will and wants to lull him into a false sense of security. No sooner than he rides into Dallas, Blayde blows holes in Cullen and takes up with Weatherby's girl, Tonia Robles (Ruth Roman of \"Champion\"), who doesn't quite understand his motives. Meanwhile, a sympathetic Weatherby secures a pardon for Blayde, but jealousy prompts him to withhold it until his conscience bothers him.Predictably, Blayde exacts his revenge on Will Marlow. Martin acquires a pardon but he hesitates to hand it to our hero since he is stealing his girl. Inevitably, Blayde's real identity slips out when a former member of his Georgia regiment hits Dallas. Marlow light out on horseback for Forth Worth and Blayde pursues him. Marlow reaches Forth Worth first and convinces the authorities to incarcerate Blayde. Blayde starts fire to get out of jail and chase Marlow. The John Twist screenplay is about as far-fetched as a western can be. The characters here make well-nigh impossible shots, blasting the six-guns out of the hands of their opponents. Cooper seems to be having fun impersonating a dude and making a fool out of the chief villain. This is the earliest western where the hero uses the outlaw's horse to lead him to the villain's secret hideout. \"Dallas\" is nowhere as good as either \"High Noon\" or \"Vera Cruz,\" but it is still an above-average opera with a sense of humor.","I fail to comprehend these other mediocre reviews. If you like Gary Cooper, this is one of his best roles. His gentle intensity to right a wrong is what made his career. \"Blayde Hollister\" comes to Dallas to take revenge against Will and Brian Malowe, who burned his Georgia farm and killed his family. An inept Marshall arriving from Boston gets in Hollister's way, attempting to arrest him when interrupted by a street shootout between Hollister and Wild Bill Hickock. The shootout is staged to get the law off Hollister, & he takes the \"back East\" Marshall under his wing to keep him alive in Texas, as they switch identity. That was a great beginning, and the picture holds up all the way through. Will Marlowe has positioned himself in Dallas to run for mayor, while his men steal cattle to force foreclosure on the Robles ranch. Brian Marlow, the younger brother, is a loose cannon that keeps getting in the way. Hollister consistently makes a fool out of him, and eventually tosses a black cat across his path, which was truly bad luck.Action may be a little \"slow\" by today's standards, but it is one of my top 10 favorite movies.\"That's your last bullet, Will.\"","Just about every noted western city shows up sooner or later as the title to a western. This certainly isn't about the early days of Dallas which was founded right after Texas came into the union and was named for the current Vice President George Mifflin Dallas. Dallas was from Philadelphia, was once the Mayor there, and never visited the city named after him.What this is is a nice Gary Cooper shoot 'em up with a nice post Civil War plot. Hollywood abounds in those, carpetbagger rule in Texas and the men who do something about it. Red River is the best example.Gary Cooper is outlaw and former rebel Blayde Hollister who is \"gunned down\" by Wild Bill Hickok so he can operate undercover and get a particularly loathsome family named Marlow who burned his former plantation in Georgia. Aiding him is Leif Erickson who plays a tenderfoot marshal from the East (hey they weren't all Hickoks and Earps). Cooper takes Erickson's identity and Erickson goes along as his own brother.Up and coming starlet Ruth Roman plays the love interest. She's Erickson's fiancé, but Cooper has caught her eye.Two of the Marlows are Raymond Massey and Steve Cochran. Massey's villains are always shrewd and are usually done in by circumstances beyond their control. Steve Cochran fresh from his stint as Big Ed in White Heat is the vicious, but stupid underling brother.It's a good plot and a lot's been edited out badly. For instance at one point you see Gary Cooper in hot pursuit of Massey to Fort Worth. Then it cuts straightaway to the Fort Worth jail and no explanation of how Cooper got in there.Leif Erickson never made it to the top. He usually was the second lead who never got the girl. Television gave him the stardom that eluded him on the silver screen with High Chapparal.Steve Cochran usually played villains with a kind of snake-oil charm, like Big Ed in White Heat or as Doris Day's KKK husband in Storm Warning. Same here although the twist is he's not the sharpest knife in the Marlow drawer.Today's generation thinks of Dallas and they think of the Ewing family of the 80s. This is NOT the story of their early days, but its nice Saturday matinée fare.","The only reason I watched this film was because of Gary Cooper. While maybe not the nicest person in the world in real life, he was a wonderful actor and I'd watch even one of his weaker films just to see him act. And, as usual, he was very good (though a bit old to win the girl at the end of the film).The problem, then, is that despite all of Cooper's talent, the film is just a very ordinary and run-of-the-mill cowboy film. I could EASILY have imagined almost any other actor being able to do Cooper's role and the film would STILL have been mediocre. It's because so many elements of the plot just seem too familiar and too clichéd.About the only thing that stood out was the interesting character played by Leif Erickson---who oddly received such low billing in the film even though he was one of the main characters! The idea of an Eastern \"dude\" coming West to impress his girl was kind of funny and he did provide a few cute moments and an interesting sidekick, of sorts, for Cooper.Aside from that, the film is imminently skipable. It's a film that only Cooper addicts or B-quality Western addicts should watch--there are frankly too many better films out there worth your time.","Long before J.R. Ewing and some football cheerleaders made this Texas city popular, there was this colorful Warner Brothers western starring one of the greatest action heroes of Hollywood's golden age. Cooper plays a man wanted for arson who disguises himself as a marshal to unleash the real culprit. He convinces the actual marshal (Steve Cochran) to let him take over his identity and in the process, wins the love of Cochran's Mexican sweetheart (Ruth Roman). In going after the bad guys, he comes up against Dallas's most powerful citizen (Raymond Massey in a masterful performance) and taunts the bad guys in an explosive climax.If the idea of Ruth Roman playing a Mexican doesn't make you laugh (it seems that any dark haired beauty could be cast in Hispanic parts in this era) how about platinum blonde cult actress Barbara Payton as the wife of one of the bad guys and a group of actors who are supposed to play Texans but sound nothing like them? Two years before his Oscar Winning role in \"High Noon\", Cooper played a variation of the same role, and in studying the two films, you really can see the difference as to what makes a film tense (\"High Noon's\" clock is as much of a character as the human beings in the film, while \"Dallas\" has little or no tension at all) and what makes it simply routine. If it wasn't for the color photography or the presence of its cast (Cooper, Massey and Reed Hadley as Wild Bill Hickock), this could have drifted into the hundreds of \"B\" westerns of the time, entertaining in their own right but basically forgettable.","This stylized and well financed Western looks good but is light and flimsy for the genre. It can not hold a candle to other Gary Cooper vehicles like High Noon, however it is worth a view if you catch it like I did on a lazy afternoon on the Encore Western channel.The film's setup seems contrived and the dialogue is uneven and sometimes even clumsy but it does include enough star power such as Raymond Massey, Ruth Roman, and Leif Erickson (who lend their considerable talents) to make it worthwhile.Cooper is always a force to be seen and this is no less so in this forgettable Western but even his presence can not totally save this movie.Watch if there is nothing else compelling on, but don't expect great Western fare like High Noon, Gunfight at the OK Corral or The Lawman. This just isn't it.I understand why some might rate this rather mediocre film highly as it is difficult to downgrade any film in this (nowadays) under appreciated genre. But there are such amazing Western films out there that great ratings should only be reserved for the true crème de la crème so that those just dipping their toe into this wonderful pool of cinema are not mislead or unduly disappointed and consequently disenchanted with the whole Western genre.","This is one of the most ridiculous westerns that Hollywood ever made. Gary Cooper plays 'Reb Hollister', a former confederate officer wanted by the law.  He meets up with a moron named Weatherby, played by Leif Erickson, who is a U.S. Marshal with no knowledge of firearms. Weatherby is on his way to Dallas to see his fiancee, Tonia Robles, played by Ruth Roman.  Senor Robles, Tonia's father, has plenty of men, but they can't seem to be able to keep an eye on his cattle, which are regularly rustled by the Marlow brothers.  Will Marlow, played by Raymond Massey, has financed the loan on the Robles estate, making things completely absurd.  He even has the power to call for mortgage payments before they're due, simply because he feels like it.Since Weatherby is a Boston boy who can't fight, since he only became a Marshal so he could visit his fiancee, Tonia, (Just another instance of more plot nonsense.  Are we to assume that you only have to pass a written test to get this job?  Wait a minute, this guy couldn't pass the written test either.) he switches identities with Reb  Hollister, who of course is an expert gunman.  Reb takes the liberty of greeting Weatherby's girl with a passionate kiss, while Weatherby looks on like an idiot.  Gary Cooper, Hollywood's number one stud, is in fine form here as Reb.  Before the movie's done, not only does he take Weatherby's job, he steals his fiancee also, and Ruth Roman as Tonia, falls for him so hard and so fast that she gives chump Leif Erickson the brush-off before the films little more than half over.There isn't a shred of plot credibility in the whole film, so despite the good cast and lush photography, the film is a dud.  And Cooper's character is a complete heel to boot.  The film also stars Barbara Payton as Brant Marlow's girl, a beautiful and talented actress who squandered away her chances, unfortunately, by making too many headlines for the wrong reasons.  I strongly suggest you pass this one up.","Former Confederate Colonel Blayde 'Reb' Hollister is a wanted man as he kept on fighting after the war ended; he kept fighting because his home in Georgia had been burnt along with members of his family. The person he is after is Bryant Marlow; and he has gone to Texas where his brother Will is now a respected Dallas businessman. In order to avoid trouble he fakes his own death... only to end up travelling with the new US Marshal Martin Weatherby. Weatherby isn't cut out for the job and the two of them end up switching places; when they get to Dallas Reb claims to be the marshal and introduces Martin as his brother Daniel; the only person to know the truth is Martin's fiancée Tonia. It isn't long before he crosses paths with Bryant but it turns out he is after the wrong brother and when Will learns the new marshal is Hollister things get more dangerous! Of course it isn't all gunfights and chases on horseback; the film also finds time for some romantic jealousy when Reb gets close to Tonia and Martin isn't too happy about it.This might not be 'High Noon' but it is an entertaining western with some good action sequences, a couple of nasty villains and even a few laughs... just seeing Weatherby's original get-up is enough to raise a chuckle. The story of revenge is fairly standard but there is nothing with that. Gary Cooper is very much the star of the film in the role of Reb Hollister but he is ably supported by Leif Erickson as Weatherby and Raymond Massey and Steve Cochran as Will and Bryant Marlow. Ruth Roman does a good enough job as love interest Tonia Robles although her role is nowhere near as big as her second billing would suggest. The action was well directed; especially the jail break scene where Reb flees a burning jail and the final shoot out. Overall this isn't a classic western but it passes the time nicely if you are a fan of the genre.","Interesting the wide range (no pun intended) of reviews here. As for me, I think it's a better-than-average Western (a genre that I rarely watch anymore), though clearly not one of the great Westerns. There are parts of the film, particularly early on, where there is a bit of tongue-in-cheek humor that is enjoyable.The story line is that after the Civil War, a rebel (Gary Cooper) is looking for revenge against a group of carpetbaggers who burned his family to death when they destroyed their Georgia plantation. Cooper meets up with Leif Erickson, an Eastern dandy who has somehow been appointed a federal marshal...even though he can't even shoot a gun. Cooper assumes the role of federal marshal, and Erickson becomes his deputy. Erickson is in love with a Mexican woman beautifully played by a lovely Ruth Roman...who of course then falls for Cooper. Nevertheless, Erickson comes to admire Cooper and gets him a pardon while they work together to bring an end to the carpetbaggers, headed by Raymond Massey. Gary Cooper is at the top of his form here playing the sort of anti-hero. Raymond Massey is nicely evil...as he often was in films. Leif Erickson -- never a favorite of mine -- is very good here, subtly playing a spurned lover who remains a mostly good guy.As I mentioned earlier, this is not one of the great Westerns, but it is darned good.","NOT THAT STAR Gary Cooper couldn't handle a film of the Western genre, we can't help but wonder if this entry into Warners' considerable inventory of \"oaters\" wasn't perhaps an older, unused project that may well have been intended for Errol Flynn. Coop was certainly up to the occasion and did keep us interested.COMPLEMENTIG THE MAIN character in fine, true support are some of the guys who are synonymous with Warner Brothers. Although cast somewhat against type and somewhat hidden behind some extensive facial hair, we find no less than: Raymond Massey, Jerome Cowan and Steve Cochran. Added to this group, we find one of our favourites, Reed Hadley as Wild Bill Hickok, no less.THE STORY IS an amalgam of types as far as mood goes; an element that s common in many WB pictures. Looking back and in retrospect, it must have been successful and served the studio well.PLENTY OF WHIMSY and a total disregard for any historical accuracy are hallmarks that somewhat echo events portrayed in THE OKLAHOMA KID (\"Sooners\" settling the former Indian territory), DODGE CITY (Railroad coming West), THE SANTA FE TRAIL (\"Bleeding Kansas\" & John Brown), THEY DIED WITH THEIR BOOTS ON (George Armstrong Custer). It also added DALLAS to the lit of pictures named after particular cities; e.g., CASABLANCA, DODGE CITY, VIRGINIA CITY.WE WERE WONDERING if Jack Warner & Company ever did one called \"BAKERSFIELD?\"","The cast is perfectly chosen, and Warners' Technicolor production values are top-notch. It's one of Gary Cooper's best westerns of the 1950s, and that's saying a lot, because he made several good ones during this particular decade. What works so well is the interplay between Cooper and Leif Erickson who play men on opposites sides of the law that switch places. The story isn't as contrived as it sounds, and there is some excellent humor in the situations the performers mine like gold, without overplaying. Ruth Roman was never photographed more beautifully than she is in this picture, and it's easy to see why two strong-willed men would be vying for her attention. Raymond Massey is on hand as the villain, and this time he enacts wicked schemes with an equally villainous younger brother (Steve Cochran). Cochran's role is written with less comedy than the others, but even he manages to bring out the more humorous aspects of his character's situation without being too gimmicky. There are several brilliant sequences, but perhaps the best one involves Cooper, Cochran and a black cat on a nighttime street that leads to a killing.","See it – Although this may not be considered one of Gary Cooper's best movies, it is certainly an entertaining western. He plays a wrongfully accused outlaw who trades places with the incompetent marshal, impersonating him in order to bring his arch enemy to justice. This is by no means a comedy, but it has that light-hearted, \"Errol Flynnish\" feel to it that characterized so many films in the old days. For instance, there are certain things that you just wouldn't do in real life; such as throwing a bullet into the fire to distract someone, or stepping on a cat's tail so that the yelp will cause your enemy to show himself. But it's all in good fun. The down side is that a large quantity of action scenes doesn't always mean they are quality scenes. There aren't any cool, memorable gunfights or explosions in this one. But it's a good way to spend an hour and a half. 3 out of 5 action rating.","Stylized Hollywood Westerns, full of familiar conventions, seem to have eternal life and this is an avatar. Everything in it seems to have been scraped out of the back of a drawer from 1939, a larger budget applied, and this production its issue.Gary Cooper has played this sort of role dozens of times -- the displaced Southerner, fast on the draw and firm with honor, though kinda easy going whenever possible. He plays Blayde Hollister who travels to Texas looking for the gang who destroyed his cotton plantation. He wears a buckskin-fringed shirt and packs two ivory-handled six shooters. He speaks with a countrified accent -- \"A feller could get hurt doin' this.\" (Cf., \"Sergeant York.\") The gang is led by sneering Raymond Massey, who buys and sells land, usually by underhanded means whenever possible. The gang includes Steve Cochran, who cannot play a Westerner though he's very good at scum bags in general. The requisite woman is Ruth Roman, daughter of the Mexican plantation owner, who looks and speaks about as Mexican as a Boston brown betty.I don't think I'll bother too much with the plot. No doubt someone has gone into it in some detail and it's not worth much more mention. As in any 1939 Western, it's labyrinthine. Everyone except Cooper and his friends are underhanded and there are multiple double crosses and switched identities and hidden secrets.Everything is retro. The plot, the dialog, the wardrobe, even the music. The score is by Warner's stalwart Max Steiner. He's the guy that scored \"King Kong.\" That was 1932. This movie was released in 1950.Cooper's name, by the way -- \"Blayde Hollister\" -- prompted me to look through the records of the RACA -- the Real American Cowboy Associaton -- to see if that name cropped up in their archives, which date from the beginning of time to February 4th, 1911, when the last Real Cowboy passed away due to an unfortunate encounter with a deranged peccary. There has never been a Real Cowboy with the name Blayde. Hollister, yes, but not Blayde. As a matter of fact, there is no record of any Real Cowboy named Wade, Luke, Cole, or Matt either. The most popular names for genuine cowboys, in descending order of frequency, were Clarence, Mortimer, Noble, Nebukadnezzar, Plautus, Pinchbeck, and Hortense.If this movie had been released in 1939, it would have been routine. In 1950, it is a calamitous monument in the history of human recycling.","Directed by Stuart Heisler, and written by John Twist, this needlessly complex and talky Western with a B movie feel that includes some comedy (intentional or otherwise) might please only fans of its lead actor Gary Cooper, who plays a familiar role as a wronged man waging a solo battle of revenge.Coop plays Blayde 'Red' Hollister, a Confederate army officer who'd headed west after the Civil War to find and kill those responsible for torching his home and killing his family in Georgia. He's pretty sure it was the Marlow brothers, but he needs proof to satisfy his personal code before he can exact his revenge. Steve Cochran and Raymond Massey play Brant and Will Marlow, respectively (Zon Murray appears uncredited as the third).The Marlows have setup shop in and around the growing, relatively new titled Texas city. Will has established himself as the town's banker while his brothers and their henchman rustle cattle to prevent Will's clients from being able to pay their mortgages, so that Will can then seize their lands. One such family that's falling prey to Marlow's land grab scheme is the Robles: patriarch Don Felipe (Antonio Moreno), his lovely daughter Tonia (Ruth Roman), and son Luis (Gil Donaldson), who'd been shot and injured by Brant, the brother that 'respectable' Will can barely keep under 'control'.The story actually begins in retiring Marshal Wild Bill Hickok's (Reed Hadley) town, where the lawman come actor stages a shootout with his 'friend' Hollister in which he pretends to kill him, enabling the rebel to assume another identity in order to freely pursue those that killed his kin. Lucky for Hollister, an eastern dandy named Martin Weatherby (Leif Erickson) had just arrived on the stagecoach from Boston to become Dallas's U.S. Marshal. Since the real Weatherby is hardly qualified for the job at hand, he allows Hollister to pretend to be him for a time, which causes complications when it inadvertently begins a love triangle with his fiancée Tonia.Several chase sequences on horseback and requisite shootouts are included in the action, but there's no real drama nor question as to whether Cooper's character will get his man/men and the girl. The showdown between Hollister and Brant is ludicrous enough - he uses a cat to force the killer to reveal himself - but the final showdown is exceedingly tedious: in a darkened fireplace lit room, Hollister throws objects, taunts and counts bullets while Will fires wildly until he's out whereupon he rushes the pre-locked door so the two can wrestle until (guess who) prevails.Barbara Payton plays Brant's girlfriend Flo, who's not only frustrated with having to live in a dusty remote hideout with a bunch of bandits but also with the lack of brain power her man exhibits when he enables the captured Cooper-Weatherby character to talk his way into an escape. Jerome Cowan plays a townsman Matt Coulter and Will Wright appears uncredited as Dallas Judge Harper.","I guess the major disconnect for me with this film was the one street town called Dallas that hasn't the slightest resemblance to one of Texas' largest cities today. I kept thinking about that as the story progressed and it was a major source of distraction. But I tell you what, I'm going to use my summary line from the flick more than once when I hook up with friends looking for a watering hole.You know what else was distracting? How about that get-up Weatherby (Leif Erickson) was wearing when he first came on the scene. And he was a U.S. Marshal?!?! Gee, he couldn't hit the broad side of a barn with a broom the first time he handled a six gun. I wonder how he passed the U.S. Marshal exam.But Cooper is Cooper and he does his best with a story line that takes the odd twist here and there. The whole dynamic between the Marlow brothers was a bit sketchy to me, it seemed like they deliberately went out of their way to confound each other. Then there was the dynamic between Ruth Roman's character Tonia Robles and the way she threw over her fiancé Weatherby once Blayde Hollister (Cooper) came on the scene.I must have seen this a dozen times or more in Westerns and I still find it not very believable. Consider the time Hollister is up in a tree and lassos Bryant Marlow (Steve Cochran) off his horse. I mean, how is that possible when all you have to do is throw the rope off before it tightens. Shouldn't be that tough, but then again I've never tried it.The other thing I got a kick out of was when the look-out on the rock yelled down to Pete at the Bryant Marlow hideout when he saw Hollister sneaking around, so then the guys in the camp began whispering. Wouldn't it have been too late by then? Well I guess even as late as 1950 these Western flicks didn't have to rely much on believability, made for a simpler audience during a simpler time. Though I'm surprised that the principals wouldn't bring stuff like this to the attention of the director. I mean, if I thought of it, why wouldn't Gary Cooper think of it too?","The Bland and Take No Chances Decade of the 1950's Announced itself with Things like this. It was Things like this that Inspired Anthony Mann and Budd Boetticher to Reconsider the Western. This Movie is an Elite Effeminate Opposite of the Down and Dirty Wild West with its Dandy Costumes and Villains out of Central \"Cliched\" Casting from all of those B-Westerns.Just because it has an A-List Production and Gary Cooper in the Lead, don't expect anything Exceptional. In Fact, this is Unexceptional in just about every way. OK, there's the Color, Let's Give it that. But the Script is pure Corn Fritters, with Dialog that can Raise Howls, and Cowpoke Behavior Only Overlooked by the Kiddies.How about the Scene with the Cat? Or Perhaps, the \"Exciting\", Final Shootout that takes Place, wait for it, in a Living Room. In said Parlor, \"Coop\" carries on One of those Finale Contrived Conversations as He Belittles the Villain and Counts Down the Number of Bullets.\"Whadda ya want me to do, count three like in the Movies?\"- Canino from \"The Big Sleep\" (1947).Silly, but Entertaining bit of Nonsense, but if You Like Your Westerns with some True Grit, Look Elsewhere.","I don't think I've ever watched a good cast work harder to make a bad script work. Which means the directing had to be good too. And, for the period, the production values are pretty high too. But the real candidate for lynching was the writer, not the bad guy in the movie.I would have scored it lower but for the laughs I got out of the woefully bad dialog and virtually every cast member's heroic efforts to keep a straight face while delivering their bits. If you're a Gary Cooper fan, or just like to listen to Ruth Roman's sexy husky voice, the rest is worth a watch for just how funnily bad it is. Funnier than many an intentional western parody."],"review-user":["mbking","headhunter46","Spikeopath","ianlouisiana","loydmooney-1","tmwest","zardoz-13","ArtChee","bkoganbing","MartinHafer","mark.waltz","MyAvatar","Ted-101","Tweekums","vincentlynch-moonoi","redryan64","jarrodmcdonald-1","scheelj1","rmax304823","jacobs-greenwood","classicsoncall","LeonLouisRicci","gus-186-777813"],"review-date":["19 November 2000","11 May 2009","24 February 2010","12 December 2014","10 December 2006","4 January 2003","27 July 2010","27 May 2004","16 August 2004","18 October 2006","7 December 2012","24 March 2012","25 March 2001","29 May 2012","15 November 2016","13 November 2016","12 August 2016","16 April 2012","15 February 2009","14 October 2016","5 July 2014","2 March 2015","11 August 2017"],"review-rating":["8","7","7","7","6","7","7","9","6","5","5","5","1","6","7","8","6","4","5","6","5","7"],"review-title":[" It moves like a serial... in Technicolor!\n"," Great fun if you aren't expecting \"High Noon\"\n"," The Reb and the Blue Belly come to town.\n"," Gary does Dallas....\n"," lunatic greatness\n"," Wanted by the law, seeking revenge, and cleaning up Dallas.\n"," Okay Cooper Western\n"," On my top 10 List\n"," The Big \"D\" before the Ewing family got there.\n"," Apart from Cooper's acting, it's a pretty ordinary little Western\n"," Gary Cooper faces a potential High Noon in a future oil town.\n"," Watchable, enjoyable, but not a great Western\n"," A muddled, unrealistic western.\n"," From Georgia to Texas seeking vengeance!\n"," Above average Western; Cooper shines\n"," Great Fun, Good Action & \"Yup!\"\n"," One of Cooper's best westerns\n"," Light-hearted romp\n"," The Soul of History.\n"," Pretty weak western starring Gary Cooper\n"," \"The best place to reconnoiter is where the barleycorn flows\".\n"," A \"Dandy\" of a Western with Cow-Hunk Gary Cooper\n"," If only ...\n"]}