{"review-url":["http://www.imdb.com/title/tt0022788/reviews"],"review-text":["The \"old dark house\" sub-genre that dominated the early talkies rarely fails to disappoint when we re-view the oldies to-day. Here is one that provides so very many suspicious characters you have to wonder how they will be able to tie up all the loose ends in the 6 reel running time.The Crooked Circle is a gang of counterfeiters and thieves who have decided to take revenge on Col. Walters (Berton Churchill) who has sent one of their ranks to prison. They decide he must die that very night. Meanwhile the Colonel's own group, The Sphinx Club, is determined to protect him at all costs. This does not sit well with Thelma (Irene Purcell) fiancée of club member Brand Osborne (Ben Lyon, late of the mega-budgeted HELL'S ANGELS (1930)) who wants him to quit the club and stop endangering his own life. Brand promises to resign after saving the colonel's life. Everyone heads off to Walters newly purchased mansion on Long Island to await the assassin.The Colonel might be the new owner of Melody Manor but it's an old dark house complete with eccentric neighbours (like Raymond Hatton as a local hermit) and maybe even a ghost. Top billed Zasu Pitts is Nora, the housekeeper who expects to see a spirit around every corner. Throw in a cop (James Gleason) who is certain Brand is a criminal and we have a picture which is packed with action and surprises.You will notice right away that the script writer was at a loss to come up with too much dialog because a lot of characters repeat the same lines over and over. Yoganda (C. Henry Gordon) a Hindu mystic (which movies of that time were loaded with) says \"Evil is on the way.\" many times and I lost count of how often Ms. Pitts says \"Something always happens to somebody!\". There are many suspects and two characters (Mr. Gleason as the stereotype dumb cop and Roscoe Karns as Mr. Lyon's pal) who serve as comedy relief. The house itself is appropriately spooky looking (in fact I think the same set was used in THE PHANTOM (1931)) with lots of secret passages and violin music coming out of empty rooms but somehow you never really get a feeling of danger. Maybe it's because no one in the movie, and I do mean no one!, is entirely what they seem to be. It all comes out right in the end though; but to go into any more detail would spoil it for you.Watch carefully for Robert Frazer (from WHITE ZOMBIE) and Frank Reicher (best remembered as Capt. Engelhorn from KING KONG) to pop up among the suspects.THE CROOKED CIRCLE is a fun film. Some aspects of the plot are predictable and then again several others are not. I suspect you will enjoy it.","Bruce `Lucky' Humberstone's THE CROOKED CIRCLE begins with that eponymous quintet of `counterfeiters and thieves deluxe' pledging their dark allegiance (`To do for each other, to avenge any brother, a fight to the knife and a knife to the hilt!'), drawing lots from a hinged skull for the honor of bringing to ground Colonel Wolters, leader of an affluent band of amateur criminologists known as The Sphinx Club.  In its second half, the film adheres faithfully to the established spookhouse syllabus (sliding panels, trap doors, and an attic stuffed with skeletons, sarcophaguses and Oriental objets d'art), with director Humberstone maximizing the felonious, comic and preternatural possibilities, all nicely complemented by the amusing dialogue of playwright Ralph Spence (THE GORILLA) and Tim Whelan. Rounding out the roster of red herrings, henchmen and gawkers are WHITE ZOMBIE's Robert Frazer, the ever-quivery Zasu Pitts (`There's a ghost in this house and when he plays the violin, something always happens to somebody!'), James Gleason as a malaprop-prone New Yawk flatfoot, KING KONG's Frank Reicher, and `queer-acting hunchback' Raymond Hatton (later the sour Farmer Larkin of INVASION OF THE SAUCER MEN).  It's corny and creaky and good old fashioned fun for those hip to the charms of Poverty Row whodunits.  See for yourself!","1930's comedy mystery about \"The Crooked Circle\" a band of hooded crooks who set about plotting the murder of some one who swore to oppose them. Enjoyable but really unremarkable little film, the movie works simply because the cast headed by Zazu Pitts and James Gleason (both of whom would later appear together in a couple of Hildegarde Withers films after Edna Mae Oliver dropped out of that series) and supported by a great cast of actors and actresses you know but may not know the name of (I don't hence the lack naming). A breezy hour long romp, the movie doesn't make a great deal of sense with mistaken identity, secret passages, ghostly music and people not being who they seem. Its the perfect thing for a dark and stormy night or a late night viewing when one is nostalgic for the late late show.","If you've never experienced the thing that is Zasu Pitts, here is a Zasu zinger! In 1933 Mae Questel caricatured Pitt's voice for the character Olive Oyl for the Fleischer Studios animated cartoon version of the comic strip Popeye. Zasu (pronounced Zay-Sue) does her best \"Olive Oyl\" impersonation walking around whining and ringing her hands or attaching herself to the policeman's laynard. I kept waiting for her to say \"ohhh myyyy\", but instead it's \"something always happens to somebody.\" The first time I saw this film I loved Zasu and found her character really funny. I've since seen her in other films where she does this same whining, uptight, fragile-flower routine. So, upon watching this film again I started getting a little annoyed with the constant whining and near hysteria over a piece of dust. But, there are some funny comedy bits here, and it's also a mystery movie as well. It's an interesting mix of mystery and comedy that actually works. The mystery plot holds together well through the camp of Zasu Pitts and James Gleason who plays Arthur Crimmer the policeman. The haunted House is fun with many a secret passage and even a skeleton in the attic! Well worth the watch. Read more public domain movie reviews at: http://pdmoviereview.blogspot.com/","By 1930, film was already a living, breathing organism that was manipulating artists and audiences in its quest to survive and grow. From 1932 to 1938, that organism tried a number of potential branches of evolution before settling on one main one. But during that period, many experiments can be viewed, experiments that did not blossom and quickly became extinct.Sadly, this exemplifies one of them and it is such a perfect example, such a pure specimen, it really must be seen if only for history. I'm increasingly convinced that we cannot be fully in the film experience until we have shared in some of its failed attempts.What characterizes this is extreme abstraction. The basis is the detective story, a basis that is so strong in narrative appeal it survives today as the root of most film. But this experiment abstracts it extremely.The bad guys are not just bad, but have a club. The good guys are not just good and smart, but they have a club too. The two clubs are at war, mostly it seems because that's what two groups do: define the other as the enemy and adopt roles accordingly.The setting is abstract too: a \"haunted\" mansion with trap doors, secret passages, resident hunchback, disembodied music, skeletons (that predictably catch on the girl's dress) and blackouts. There's a very, very clever twist in the story too, one you know is there but you just can't pin down until it happens.Zazu Pitts does a spooked housekeeper whose voice would be appropriated for Olive Oyl who would make her first appearance the following year.Ted's Evaluation -- 3 of 3: Worth watching.","The Crooked Circle is a crime organization that meets in a dark room. All the members wear hoods. The group has one female member. They do not like the Sphinx Club, which is a local amateur crime fighting organization that is adding one new member because of the retirement of another. --Okay, if that makes sense so far then the rest of the film will, too.Over in the old dark house, Zasu Pitts is spooked from the first moment we see her, and that's before the real action of The Crooked Circle has even started. Soon police officer James Gleason arrives, and Zasu spends the remainder of the picture clinging to various pieces of his uniform, much to his annoyance. They make a cute couple.Other club members—who all end up assembled at the house, of course—include Berton Churchill as a jovial host who thinks it's amusing that the Circle has vowed to kill him; Rosco Karns, who manages a few wisecracks; and C. Henry Gordon as \"Yoganda,\" a mystic of sorts who has just joined the group, claims to have insight to future events, and may or may not be an infiltrator from the other side. Ben Lyon and Irene Purcell are the obligatory handsome young couple who are both—in different ways—deeply involved in the case.It's totally silly, but plenty of fun.","James Gleason and Zasu Pitts, first introduced in \"Oh Yeah\" (1929), were reunited for \"The Crooked Circle\". Tough no nonsense Gleason and fluttering, daffy Pitts - completely opposite in temperament but together they work wonders. This little movie also boasts a superlative cast with Ben Lyon (equally at home in As and programmers) and Irene Purcell, who had just been the leading lady in Paramount's \"Million Dollar Legs\" (everyone was a winner in that movie)!! Combining a mixture of gags, frights and plenty of action (director H. Bruce Humberstone had tried it before in his directorial debut, \"Strangers of the Evening\" and found it worked) this is about the goings on of a criminal secret society called \"The Crooked Circle\", who meet at an old mansion called \"Melody Manor\"!!Brand Osbourne (Ben Lyon) is resigning from the Sphinx Club at the urging of his new love, Thelma (Irene Purcell). The Sphinx Club is an amateur band of crime fighters whose aim is to try to expose The Crooked Circle members. Colonel Wolters (Berton Churchill) has just received a death threat and Yoganda (C. Henry Gordon), a new member, suggests they all spend the night guarding him. The film really picks up the pace when the Sphinx members arrive at Melody Manor - clocks strike 13, tables move, pianos play ghostly music, - even weird old men come knocking at the door in the middle of the night with gifts of tomatoes!!!! It also gives Zasu Pitts, as Nora, the frightened housekeeper, a chance to bring out her bag of tricks - fluttering hands, whiney voice. James Gleason plays Crimmer, a cranky, bumbling motorcycle cop who is called to the \"old dark house\" to investigate Wolter's murder (it looks as though he wasn't guarded enough)!!!! Brand also has to contend with a stranger breaking into his apartment and his butler taking the stranger's side when the police are called. He meets the stranger (Robert Frazer) again at Melody Manor and also has suspicions about Yoganda and Thelma!!!Apart from Robert Frazer, who was such a success in \"White Zombie\" there were a few stars of the silent screen with roles in this movie. Ethel Clayton was a Lubin star from 1912 until the company folded in 1916 but she never stopped working - even if it was only in roles like Yvonne. Paul Panzer, who had terrorized Pearl White in \"The Perils of Pauline\" - was a member of the Circle.Recommended.","The Crooked Circle is a film that has a lot more potential than it fully realizes. It starts with an intriguing scene with a group of black hooded individuals in an underground room. These shady characters are the Crooked Circle and they are planning revenge on a group of amateur sleuths called the Sphinx Club. Now this set-up makes it sound like the movie could go in an interesting direction with both these groups fighting against each other. Unfortunately, the focus is subsequently too often on comedy, rather than suspense.The film takes the form of the old dark house format which was hugely popular in the 1930's. The house itself is full of the usual array of secret passageways, trap-doors and hidden rooms that was part and parcel in these movies. The mystery isn't ultimately too compelling, although there is a reasonable twist near the end. It's as creaky as you would expect but not without some charm.","\"The Sphinx Club is a group of amateur detectives who are the bitter rivals of The Crooked Circle, a collection of hooded villains. After The Sphinx Club aids the authorities in catching and imprisoning a member of The Crooked Circle, the evil gang swears revenge by targeting Colonel Walters, a well-known member of The Sphinx Club. Will the Sphinx Club be able to protect Colonel Walters or will The Crooked Circle succeed in their quest to kill him?\" asks the DVD sleeve.The threatened Sphinx Club member, Berton Churchill (as Theodore Walters) is pretty good - but, he is not the focus of this comedy-mystery. Instead, we get zany Zasu Pitts (as Nora Rafferty) complaining to Christian Rub (as Old Dan) about living in spooky \"Melody Manor\". Ms. Pitts does her best \"Olive Oyl\" (from \"Popeye\") dress and voice. And, as a bonus, Mr. Rub responds with his \"Gepetto\" (from \"Pinocchio\"). You won't see \"Olive Oyl\" and \"Gepetto\" in too many movies!Meanwhile, Ben Lyon (as Brand Osborne) is preparing to resign from the Sphinx Club. His replacement is foreboding Indian C. Henry Gordon (as Yoganda), who warns, \"Evil is on the way.\" When Gordon arrives at \"Melody Manor\", Pitts looks at his turban and says: \"I'm sorry you got a headache sir, shall I get you a Bromo-Seltzer?\" Others in the funny cast: cop James Gleason (\"Here Comes Mr. Jordan\"), hermit Raymond Hatton (\"The Whispering Chorus\"), and gay Roscoe Karns (\"It Happened One Night\").****** The Crooked Circle (9/25/32) Bruce Humberstone ~ Ben Lyon, Zasu Pitts, C. Henry Gordon, Christian Rub","If you like the \"old-dark-house\" mysteries of the type they just don't make anymore, \"The Crooked Circle\" should be added to your collection. It has many of the trappings of the genre, but what sets it apart are some plot twists that are both clever and progressive for 1932. At times the film seems to surrender itself to surreal chaos, but just about everything is well-explained by the end. Zasu Pitts and James Gleason are a comedy match made in heaven: she thinks that a myth is a \"female moth\", and he thinks that \"it's OK to be in a hurry, as long as you take your time about it\". My DVD print is in pretty poor shape (it could use some re-mastering), but still watchable, and the sound is fairly clear despite some background hiss. **1/2 out of 4.","Apparently, one reviewer didn't read the earlier reviews before writing his entry. As other reviewers pointed out, Zasu Pitts didn't talk like Olive Oyl - Olive Oyl's voice was modeled on hers! This was a comedy/mystery, and Zasu Pitts was one of the most popular comediennes of her time. She was a star of silent films, and her voice and manners transferred successfully to the talkies, where she was a big star, and favorite of audiences. Her 'whining' was her shtick, and audiences loved her for it.The role played by Zasu Pitts in this, and many other films, is actually almost identical to the one played by Stepin Fetchit and Mantan Moreland. Zasu is a whimpering, cowardly fool - played for obvious comic relief. Of course, she was a white woman, so no one mentions the obvious connection. If she had played Charlie Chan's maid, she would have fit right into the Birmingham Brown role.The plot in this film is clunky, and the acting a bit stiff and caricatured, but it was made in 1932, and they were still trying to figure out how to make talkies. Watched with that in mind, The Crooked Circle is quite enjoyable.*** After over a year, and with a second viewing, I'm back to add a few comments. It's interesting that even at the very beginning of the old dark house genre, humor was already an essential part of the mix. One might think that the setting would have featured horror/mystery films, but Hollywood had already figured out that to sell a film to the largest audience possible, it was best to mix genre elements. Thus, we get a murder mystery set in a semi-Gothic atmosphere, with more than one comic relief character. This film did have the other common element, an attractive young couple in the romantic role, but that element played only a small role here. If it was a murder mystery without the old dark house, they might have added a musical number as well. Something for the boys, the men, and the ladies and girls, all in one. Personally, I find the humor far overdone here, and would much prefer a straight Gothic thriller, but I've learned to get along with the humor over time. The policeman-as-fool was played rather hard here, the price you have to pay to get the rest of the story. I still give this a six out of ten on second viewing, but I can see where audiences would have enjoyed it at the time.","This is one of those multiple personality films that could be classified as crime, horror, or spoof. It all starts off with a sinister overhead shot of a table with a hooded group of men (and one women) making a mysterious pact that will be attempted over the next hour with lots of confusion for everybody inside this Macadamia Manor. It is a field day for the hand-wringing of Zasu Pitts, already nervous, and made even more jittery by the sudden presence of a spooky old man (Raymond Hatton) who taunts her with the pending doom until she's ready to wring her own neck just to avoid what she fears awaits her. There are tons of mysterious events which take place over the film's short hour long running time, which includes a mysterious Indian (C. Henry Gordon) making seemingly sinister comments, people mysteriously disappearing, and typically dumb police offers (lead by James Gleason) trying to figure out what's going on. It really doesn't matter what's going on, because it is still all non-sensical, yet so entertainingly presented.","Okay, now I am pretty sure that my summary got your attention and my commenting that Zazu Pitts is Satan is not without some basis. Let me explain. The film at first appears to be a dandy B-movie about an evil organization called \"the Crooked Circle\" and their vow of revenge in the form of murder on a rival organization dedicated to solving crimes. While this is very odd (especially the idea of a club of private citizens who solve crimes) and COULD have been interesting, this film falls apart despite a rather impressive list of familiar supporting actors. Why? Well because Zazu Pitts (never one of my favorite actresses) spends most of the movie whining just like Olive Oyl with a bad toothache!! While murders are being committed, people are being kidnapped or whatever, you can always count on Zazu whining at full volume--almost like someone's obnoxious 3 year-old who wants everyone at a party to pay attention to her! At the same time, she's NOT an integral part of the film but received top billing. Why she is even there is beyond me--I assume it's just to whine and yell. As a result, I found the movie practically unwatchable and it was completely ruined. Now you probably know why I referred to this actress of dubious talent as \"Satan\"! I'm sure that when the actors in this film saw the final product, they, too, felt pretty much the same way I did about her horrible overacting and amateurish performance.This film is in the public domain and can be found for free download on the internet. I can see why they didn't bother to renew the copyright.","Crooked Circle... badly in need of restoration. Sound is just terrible. Something about a group that murders people they don't like, and an amateur group of citizen sleuths who hunt the murderers down. Zasu Pitts is \"Nora\", the housekeeper. Pitts was in just about every silent and talkie film... made 26 films in 1932 alone. James Gleason is the cop, bumbling his way through the story, a role he made famous in so many films. Watching this thing is so much work. so many people doing so much talking. Henry Gordon is \"Yoganda\", the hindu, an expert in something, giving people advice. Skip this one. Wants to be funny but isn't. We stop caring after a while... Directed by Bruce Humberstone... he had directed a whole bunch of the Charlie Chan films.","Producer: William Sistrom. A World Wide Picture, presented by E.W. Hammons. Released through Fox Film Corp.Copyright 25 September 1932 by William Sistrom. No recorded New York opening. U.S. release: 25 September 1932. U.K. release: 20 May 1933. 70 minutes.SYNOPSIS: An amateur detective club led by Colonel Wolters, is the target of a secret clan of thieves/murderers.NOTES: Lucky Humberstone's second film as a director, took 14 days to shoot. To Lucky's surprise and mine, it was so amazingly successful at the box-office that it was later re-issued by Astor Pictures Corp.VIEWER'S GUIDE: Adults.COMMENT: Disappointing. This attempt to mix farce with thrills and chills doesn't work because the farce is so strained, it isn't the least bit funny — despite all the over-strenuous efforts by ZuSu Pitts, James Gleason, Tom Kennedy and company. Miss Pitts is a frightened housekeeper whose gawky mannerisms will irritate and exasperate even the most indulgent viewers. Gleason and Kennedy play bumbling cops, with Gleason fulminating stupidly all over the place and Kennedy occasionally bringing up an echoing rear. The efforts of this gosh-awful threesome torpedo most of the potential thrills in what seemed a promisingly spooky script. True, hammy cameos by Christian Rub, Raymond Hatton and Spencer Charters didn't help. For once, Roscoe Karns is not blame-worthy. In fact, he seems quite overwhelmed by the antics of his competitors.Ben Lyon has difficulty keeping a straight face in this farcical mishap. C. Henry Gordon does what he can, though not helped by the director using him as a red herring in the film's introductory scene. We also liked Irene Purcell's mystery heroine, but the best performances came from Robert Frazer as a resourceful gunman and Frank Reicher as the hero's none too subservient valet. A lot of atmospheric photography and some grandly moody sets are largely wasted.","An early, inexpensive programmer involving death threats against the leader of a club that devotes itself to solving crimes. That's all it does. It solves crimes. The death threats come from a hooded gang of ritualists who commit evil acts. That's all they do. Commit evil acts.I imagine that in 1932 this was an entertaining hour spent at the local Biograph but more than eighty years later it seems pointless. It's presented as a comic mystery -- secret identities, hidden passages, a haunted mansion on Long Island -- but the mystery isn't really gripping and the comedy seems stale.James Gleason, playing James Gleason, is a police officer who sees something suspicious and blows his police whistle. Another officer runs up and asks if there's something going on. \"Naw -- I was just tunin' up the cement,\" replies Gleason with incandescent sarcasm.Really, if you miss it, you won't be missing much.","I tried to watch this film but the longer I watched the more bored I became. I did not get a chuckle nor was I captured by a mystery. I won't say it's an awful film but I will say it was uninteresting to me.One thing that I did find of interest was that Olive Oil (her whining ways) is patterned after Zasu Pitts (who plays Nora Rafferty in the film The Crooked Circle). That is cool trivia to learn. I never did like Olive Oil - except Shelly Duvall's depiction of her in Popeye (1980) - but that is a different story.The Crooked Circle I'm sure it's a great film to some but I just did not like it like I thought I would. I love older comedy and mystery mixed but this movie did not do it for me.1/10","THE SPHINX, a club of thorough criminologists unaccustomed to loose a battle, changes direction—a Hindu with the unlikely name Uganda (--come on!--) (--yet the name is spelled differently, to give is some Hindu aspect--) becomes its new head.So, there are—a club of criminologists, a criminal association, a silly policeman, a spooked servant, a mansion, a hunchback, an attic, etc.; but this makes the movie sound better than it is.The frightened servant, the silly and feeble—minded Nora, seemed like a nice girl; and she's played by who else than the movie's star, Mrs. Zasu Pitts, who was 38 in this movie and she stands out immediately. She was simply hot—that is, before her ceaseless antics get too annoying--, her appeal transcending the datum of her role.CROOKED CIRCLE, a silly comedy, light amusement, might be of some interest to ZaSu Pitts fans. Her antics, as I stated, are annoying though."],"review-user":["reptilicus","Richard_Harland_Smith","dbborroughs","missrebeckah","tedg","csteidler","kidboots","Red-Barracuda","wes-connors","gridoon2018","jonfrum2000","mark.waltz","MartinHafer","ksf-2","JohnHowardReid","rmax304823","Rainey-Dawn","Cristi_Ciopron"],"review-date":["3 July 2005","20 March 2001","23 December 2007","11 May 2008","21 March 2005","28 August 2011","10 November 2010","19 September 2010","23 July 2009","11 February 2011","29 November 2010","8 May 2013","21 July 2007","24 January 2018","15 August 2017","6 February 2016","14 December 2014","10 September 2009"],"review-rating":["8","7","8","6","7","4","6","6","6","5","3","4","6","4","1","5"],"review-title":[" \"Evil is on the way!\"\n"," \"A fight to the knife and a knife to the hilt!\"\n"," Breezy romp is worth a look for those who like comedy and mystery mixed\n"," Olive Oyl is stuck in a Haunted House with murderers!\n"," Warring Clubs\n"," Old dark house with more than the average number of hidden panels and passageways\n"," Funny \"Old Dark House\" Spoof has Something for Everybody!!!\n"," Typical old dark house comedy-mystery\n"," Creaky Good Comedy\n"," Highly enjoyable mystery-comedy antique\n"," Hurray for Zasu!\n"," In this Old Dark House, anything can happen!\n"," Zazu Pitts is Satan\n"," not one of Pitt's better films\n"," it's the farce you have when you're not having a farce!\n"," Meddler, You Die At Midnight!\n"," Uninteresting To Me\n"," A mystery vaudeville\n"]}