{"review-url":["http://www.imdb.com/title/tt0062622/reviews"],"review-text":["A stand-alone monument in cinema history, Stanley Kubrick's magnum opus 2001: A Space Odyssey (1968) is an undeniable masterpiece. 2001 not only shattered science fiction genre conventions, but gave cinema a whole new meaning. From the grandiosity of its futuristic idea to its ambitious execution, 2001 isn't concerned with entertaining us- but rather to inspire us with awe. I've never seen a person say, \"2001: A Space Odyssey? I don't think I've seen it... oh wait, the one with like, the spaceships and stuff?\", while most movies today are forgotten once the credits roll. What viewers must understand is that 2001 not the type of movie where you \"get it\" or not, nor is it designed to thrill us with flashy special effects- but as Kubrick said, is \"...intended to be an intensely subjective experience that reaches the viewer at an inner level of consciousness.\" In it of itself, exploring the philosophical and scientific arenas of mankind while serving as a groundbreaking achievement both on a conceptual and technical level is a hell of an accomplishment, but to transcend the audience to a whole new dimension all in one- that's sheer genius at its highest form.At its premiere, 2001 polarized critics and audiences alike. Walkouts numbered well over 200, including Rock Hudson who asked, \"Will someone tell me what the hell this is all about?\" The New York Times remarked, \"Somewhere between hypnotic and immensely boring.\" \"Superb photography major asset to confusing, long-unfolding plot,\" Newsday commented. Renowned critic Pauline Kael even went as far as calling 2001 \"trash masquerading as art\". It's understandable, though. In a time in which excitement revolving around interstellar exploration and extra-terrestrial life was everyday talk, audiences came into 2001 expecting answers. When will we reach the moon? What does the future hold? Are we alone? To their great surprise, 2001 did the paradoxical; leaving more questions to answer than answered questions.Even though the late 60s marked the height of technological optimism, Kubrick saw ahead, highlighting the potential negatives of technological advancement. Notice the contrast between how apes and humans approach the monolith. The apes approach it with dignity, respect, and mindfulness. The humans approach it with arrogance, grouping astronauts in front of the monolith to take a picture. Since the monolith represents the incomprehensible (man, with his limited senses, cannot comprehend the absence (perfect black) of color or light), Kubrick may be suggesting the manner in which we handle new information is careless and hasty, emphasized in the Clavius base briefing. Scientists discuss how to distribute this exciting news to the public, for \"if the facts were prematurely and suddenly stated without adequate preparation and conditioning\", as stated by Dr. Heywood Floyd (William Sylvester), it may cause \"cultural shock and social disorientation\". It's a significant message to the anxious people of 1968 to perceive fresh information precisely and draw conclusions logically.Yet apes are not much better. They're not willing to share food and water with their fellow apes, and with the discovery of bones as weapons, kill their own race for a puddle of water- possibly foreshadowing our own demise if we continue to advance artificial intelligence. Because like our ancestors, at heart, mankind has been and will always be selfish.Far before The Terminator (1984) or The Matrix (1999) accentuated the dangers of artificial intelligence, there was 2001. H.A.L 9000, voice played by Douglas Rain, was ingeniously crafted into one of the most terrifying villains in film history. There's something about his calm voice, unpredictability, and especially, his omniscient single red eye that's so frightening. Kubrick utilizes one of his favorite filmmaking devices to compare artificial intelligence with humans: irony. Neither Dave Bowman (Keir Dullea) or Frank Poole (Gary Lockwood) display much emotion throughout the film, while H.A.L, albeit a machine, exhibits some while pleading for life singing \"Daisy\" (which, by the way, is a heart-wrenching scene) and murdering his crew members. There are clear connotations of humanity's fate when H.A.L attempts to kill Frank, Dave, and the hibernating crew members. Yet H.A.L, contrast to what he may think, is not perfect. If he was incapable of miscalculating even the slightest bit, he wouldn't have gotten himself killed. Kubrick implies that artificial intelligence has not yet reached the level of annihilating the human race, but if we are not careful, they soon will.This idea coincides with the perplexing final sequence, resembling man reaching the next stage of evolution. After the famous \"Star Gate\" sequence, Dave is enlightened in a room. The setting hints at the Enlightenment Era, exquisitely decorated in 18th century style and embellished with lavish paintings and furniture. Notice how the room is solely lit through the transparent ground, establishing a heavenly environment. The eerie silence is ominous, magnifying the mystical aura that is ever so present in the timelessness of the final scene. As Dave exits his EVA pod, he watches himself age rapidly through one-point perspective. He knocks over a wine glass while eating, suggesting that man, no matter how advanced, will keep making mistakes. As he lays on his deathbed later, he reaches out to the monolith, alluding to Adam reaching out to God in Michelangelo's The Creation of Adam. After man is enlightened, he inevitably dies.A pessimistic ending? No. Man is then transported back to Earth as a \"Space Baby\", an infinitely more advanced race, marking a new age of evolution. A masterful stroke of genius, Kubrick ends hopeful, giving us another chance to improve on our mistakes. Or is it hopeful? Is he implying that civilization is evolving badly? Or is he suggesting that civilization will NEVER evolve? There are multiple interpretations of the ending, and it's a question for you to answer.There is such a great deal of symmetry in 2001's composition throughout the film, possibly suggesting the equilibrium present in the universe. The painstakingly slow pace also compliments the exactness of its harmony, practically forcing you to admire its artistry. While Andrei Tarkovsky's work would breathe with such organic and poetic beauty, Kubrick's artificial visual fluidity mesmerizes the eye with meticulous precision and thoroughness. Each shot, averaging 13.6 seconds, possesses a sense of purity and perfection that can only be achieved through the medium of cinema.But of course, it's impossible not to talk about 2001 without mentioning one aspect. The visual effects are so unanimously praised that it's hopeless to even try to describe how groundbreaking and influential they were. Hopeless. I can talk for days about the impeccable zero-gravity effects, clever rotating sets, fastidiously constructed spaceships, the brilliant use of slit-scan photography for the psychedelic Star Gate sequence, or how it pioneered the use of front projection with retroreflective matting, but what's the point? You don't need me to appreciate 2001's immaculate visuals.Finally, the choice of music is outstanding. Originally, Alex North was appointed to score the film, but Kubrick turned it down in post-production. Critic Roger Ebert explains it perfectly, \"North's (rejected) score, which is available on a recording, is a good job of film composition, but would have been wrong for 2001 because, like all scores, it attempts to underline the action-to give us emotional cues. The classical music chosen by Kubrick exists outside the action. It uplifts. It wants to be sublime; it brings a seriousness and transcendence to the visuals.\"\"But why all the slow parts?\" asks the one who fell asleep. Primarily, to establish tone. Unlike the low-budget commercial science fiction movies preceding it, 2001 was meant to be taken seriously. It symbolizes a quest for whether God exists or not, challenges humanity's fate, and questions evolution as a whole. If each shot's average length was two seconds and there was some sappy romantic love subplot mixed in between, the whole film would've been a mess. Space isn't fast-paced like we see in most movies. Space is slow-really, really, slow. The addition of three minutes and seventeen seconds of a black screen in the beginning was also pure genius, a signal for casual moviegoers to get out of the theater now and save your time.Thankfully, its ingenuity was gradually recognized, and it's now widely regarded as one of the greatest and influential films of all time. It stands at an impressive #6 on the BFI \"Sight and Sound\" Critics' poll in 2012, ties for 2nd in the Director's poll, places 15th on AFI's 100 Years... 100 Movies, and tops the Online Film Critics Society list of \"greatest science-fiction films of all time\".2001: A Space Odyssey breaks almost every rule there is in filmmaking. The first half drags, the dialogue is unnatural, the static camera creates no visual interest, there are barely any emotional punches, characters are monotonous, and none of the protagonists, if there even are, have dimensionality, arcs or epiphanies. Nonetheless, it's transcendental and sublime, awe-inspiring and thought-provoking, visually revolutionary, technically impeccable, monumentally imaginative, substantially rich, and way ahead of its time, thriving with unparalleled originality and ambition.Only a few films will live forever. 2001 is one of them. Happy 50th birthday.","Sometimes reading the user comments on IMDB fills me with despair for the species.  For anybody to dismiss 2001: A Space Odyssey as \"boring\" they must have no interest in science, technology, philosophy, history or the art of film-making.  Finally I understand why most Hollywood productions are so shallow and vacuous - they understand their audience.Thankfully, those that cannot appreciate Kubrick's accomplishment are still a minority.  Most viewers are able to see the intelligence and sheer virtuosity that went into the making of this epic.  This is the film that put the science in \"science fiction\", and its depiction of space travel and mankind's future remains unsurpassed to this day.  It was so far ahead of its time that humanity still hasn't caught up.2001 is primarily a technical film.  The reason it is slow, and filled with minutae is because the aim was to realistically envision the future of technology (and the past, in the awe inspiring opening scenes).  The film's greatest strength is in the details.  Remember that when this film was made, man still hadn't made it out to the moon... but there it is in 2001, and that's just the start of the journey.  To create such an incredibly detailed vision of the future that 35 years later it is still the best we have is beyond belief - I still can't work out how some of the shots were done.  The film's only notable mistake was the optimism with which it predicted mankind's technological (and social) development.  It is our shame that the year 2001 did not look like the film 2001, not Kubrick's.Besides the incredible special effects, camera work and set design, Kubrick also presents the viewer with a lot of food for thought about what it means to be human, and where the human race is going.  Yes, the ending is weird and hard to comprehend - but that's the nature of the future.  Kubrick and Clarke have started the task of envisioning it, now it's up to the audience to continue.  There's no neat resolution, no definitive full stop, because then the audience could stop thinking after the final reel.  I know that's what most audiences seem to want these days, but Kubrick isn't going to let us off so lightly.I'm glad to see that this film is in the IMDB top 100 films, and only wish that it were even higher.  Stanley Kubrick is one of the very finest film-makers the world has known, and 2001 his finest accomplishment. 10/10.","For all those bewildered by the length and pace of this film (\"like, why does he show spaceships docking for, like, 15 minutes?\"), here's a word you might want to think about:Beauty. Beauty is an under-rated concept. Sure, you'll often see nice photography and so on in films. But when did you last see a film that contains beauty purely for the sake of it? There is a weird belief among cinemagoers that anything which is not plot or character related must be removed. This is depressing hogwash. There is nothing wrong with creating a beautiful sequence that has nothing to do with the film's plot. A director can show 15 minutes of spaceships for no reason than that they are beautiful, and it is neither illegal nor evil to do so.   '2001' requires you to watch in a different way than you normally watch films. It requires you to relax. It requires you to experience strange and beautiful images without feeling guilty that there is no complex plot or detailed characterization. Don't get me wrong, plots and characters are good, but they're not the be-all and end-all of everything. There are different KINDS of film, and to enjoy '2001' you must tune your brain to a different wavelength and succumb to the pleasure of beauty, PURE beauty, unfettered by the banal conventions of everyday films.  \"All art is quite useless\" -  Oscar Wilde.","A review I have put off for far too long....Bluntly, 2001 is one of the best science-fiction films made to date, if not the very best. Stanley Kubrick was a genius of a film maker and this is one of his very best works. And although it is misunderstood by many, and respectively underrated, it is considered one of the best films of all time and I'll have to agree. Back in 1968, no one had done anything like this before, and no one has since. It was a marvel of a special effects breakthrough back then, and seeing how the effects hold up today, it is no wonder as to why. The film still looks marvelous after almost forty years! Take note CGI people. Through the use of large miniatures and realistic lighting, Kubrick created some of the best special effects ever put on celluloid. This aspect alone almost single-handedly created the chilling void of the space atmosphere which is also attributed to the music and realistic sound effects. I can't think of another film where you can't here anything in space, like it is in reality. Not only is the absence of sound effects in space realistic, it is used cleverly as a tool to establish mood, and it works flawlessly.Aside from the magnificent display of ingenious special effects, there are other factors that play a part in establishing the feel of the film. The music played, all classical, compliment what the eyes are seeing and make you feel the significance of man's journey through his evolution from ape to space traveler.The story, while seemingly simple, is profound. Sequentially, several mysterious black monoliths are discovered and basically trigger certain events integral to the film. What are they? Where did they come from? What do they do? These are all questions one asks oneself while watching the story develop and is asked to find his own way. While most come away with a general idea of what took place in the story, each individual will have to decide what it means to them. Any way one decides to answer these question results in profound solutions. It's not left entirely up to interpretation, but in some aspects it is. Experience it for more clarification. The end result is quite chilling, no matter your personal solution.While it is a long film, and sometimes slows down, it has to be in order to accurately portray the journey of man. It's not a subject that would have faired well in a shorter film, faster paced feature. Those with short attention spans need not apply.Last but not least, is the epitome of a remorseless antagonist, HAL 9000, the computer. Never has a machine held such a chilling screen presence. Which reminds me, for a film with such profound ambition and execution, there is surprisingly little dialogue. Another sign of Kubrick's genius.All in all, one of the best films made to date and one of the very best science fiction films made. A personal favorite. Everyone must see this film at least once.Very highly recommended.","Instead of writing a paragraph, I'll give four good reasons why 2001 is  the greatest cinema experience of all time:  1) It is a visual Odyssey that could only be told on the big screen.  The special effects that won Kubrick his only Oscar are the most  stunning effects before that age of Jurassic Park and T2. They allow  Kubrick to give an accurate (or at least are the most accurate)  depiction of space travel to date. The silence that fills the space  scenes not only serves its purpose as accurate science, but also adds  to the mood of the film (to be discussed in a later point with HAL).  The fact that Kubrick shot the moon scenes before the Apollo landing is  a gutsy yet fulfilling move. Many have said that upon its original  release, it was a favorite \"trip\" movie. I can think of no other movie  that has such amazing visuals for its time and even of all time (sorry  Phantom Menace fans!)  2) Kubrick's directing style is terrific. As in all his films, Kubrick  likes to use his camera as means to delve into the psychology of his  characters and plots. His camera is not as mobile as other greats, such  as Scorsese, but instead sits and watches the narrative unfold. Faces  are the key element of a Kubrick film. Like classic movies, such as M  and Touch of Evil, Kubrick focuses on the characters' faces to give the  audience a psychological view-point. Even he uses extreme close-ups of  HAL's glowing red \"eye\" to show the coldness and determination of the  computerizd villain. I could go on, but in summation Kubrick is at the  hieght of his style.  3) HAL 9000 is one of the most villainous characters in film history. I  whole-heartedly agree with the late Gene Siskle's opinion of HAL 9000.  Most of this film takes place in space. Through the use of silence and  the darkness of space itself, a mood of isolation is created. Dave and  his crewmen are isolated between earth and jupiter, with nowhere to  escape. Combine this mood with the cold, calculated actions of HAL 9000  and you have the most fearful villain imaginable. I still, although  having see this film several times, feel my chest tighten in a  particular scene.  4) The controversial  ending of 2001 always turns people away from this film. Instead of  trying to give my opinion of the what it means and what my idea of  2001's meaning in general is, I'd like to discuss the fact that the  ending serves to leave the movie open-ended. Kubrick has stated that he  inteded to make 2001 open for discussion. He left its meaning in the  hands of the viewer. By respecting the audience's intelligence, Kubrick  allowed his movie to be the beginning, not the end, of a meaningful  discussion on man's past, present, and future. The beauty of 2001 is  that the ending need not mean anything deep, it can just be a purely  plot driven explanation and the entire movie can be viewed as an  entertaining journey through space. No other movie, save the great  Citizen Kane, leaves itself open to discussion like 2001. It is truly  meant to be a surreal journey that involves not only the eye but the  mind. Instead of waiting in long lines for the Phantom Menace, rent a  widescreen edition of 2001 and enjoy the greatest cinematic experience.","I write this review just after hearing of Stanley Kubrick's death. It's a great loss, and I write about 2001: A SPACE ODYSSEY, because I feel it is the consummate Kubrick film, the one he will be most remembered for. It is a picture like no other, not only revolutionizing science fiction, but changing the way films are conceptualized. It was probably America's first 'art' film and has inspired the likes of George Lucas and countless other writers and directors.Aside from its visual greatness, the reason the film spawns so much discussion and analysis is because so many people have so many different interpretations of it. Kubrick and Arthur C. Clarke, his co-writer, had a vision, but we have never really found out what was going through their minds. Of course, the skinny on its 'message' is how technology of the future will take over humanity and decide the course of our lives unless we are careful. 2001's ending is one of hope, a version of our rebirth through the star-child's flight back to earth. It is meaningless to many, but discerning filmgoers will understand.Although 2001 does not have the wicked, dark humor of DR. STRANGELOVE or CLOCKWORK ORANGE, or contain strong, eccentric characters that filled his earlier works like PATHS OF GLORY or SPARTACUS, I still feel he would've liked to be remembered most for this. If anything, HAL will be his most memorable character, dangerous, murderous, and artificial. It was a half-decade in the making at a time when Hollywood was still churning out dull musicals and just waking up to the New Wave of French and Italian cinema. Kubrick was a maverick director who made great films on his own terms, his own time, and for everyone else to marvel at. He will be missed.","I did and I lost two and a half hours of my life that I can never regain again.I honestly have no idea what the critics and fans see in this movie. And that's not because I can't appreciate \"art\". I love a good film with profound messages, brilliant cinematography, and great directing.This film just isn't one of them.My main complaint about this film is that it's so horribly slow-paced, to the point of boring its audience to death. On the other hand, sequences of dialog go by too quickly and there's not enough exposition to let people who haven't read the book know what's going on (My mother had mercy on me and explained everything before I watched it). Would it have killed them to hire a narrator? At least for the beginning and the end? Let me break it down for you: (Spoilers throughout) For the first two minutes you are treated to a black screen with no music, waiting for the actual movie to begin.For the following minute and a half, you see several pictures of sunrises and savanna landscapes. Like the audience couldn't figure out how to set the scene unless they saw the establishing shot three or four times.The next eleven minutes are occupied with the grunting monkeys. They fight, see the monolith, fight some more, pommel things with a bone. Supposedly they are prehistoric men whose evolution is being influenced by the monolith's singing. Not that you could tell if you hadn't read the book.*Finally* we get into space. Only to be subjected to twelve minutes of ships slowly spinning to the Blue Danube Waltz (A pretty quick-tempo-ed waltz as I understand, yet here it feels absolutely agonizing). At last we get some innocuous dialog and rather cryptic exposition about the government not letting people land on the moon. We are left to wonder about this for fourteen more minutes of Blue Danube and spinning ships and neat camera tricks with anti-gravity.Next comes four minutes of watching a ship travel over the surface of the moon and dock at a space station. We get a little more exposition in a board room scene that follows. Then we're back outside traveling at a snail's pace over the moon. A second monolith is revealed, again filling our ears with that horrible ringing (I had no idea that was an actual piece of music!). The monolith does its little light show and then the plot jumps forward.*Seven* minutes of watching the ship to Jupiter travel. By this point in time my brains had turned into mush. Could it be moving any slower? Maybe it's \"realistic\" to portray it as such, but we still don't need to see five or six different shots of the same thing to grasp the concept of its \"realism\". Let me tell you about this \"realism\" thing; I cheered when the secondary astronaut character died. Not because I'm a sadist and like watching people die, but because after five minutes I was just so annoyed at the sound of his darn breathing! I'm supposed to care about this character, feel when he dies! Instead I found myself waiting for blissful silence whatever way it came.Anyway, now we get to the most interesting part of the film-the part with HAL. Forget Dave the stick-of-wood protagonist. The real star of the show is that coldly impersonal, chillingly villainous, ruthlessly merciless bad guy of a computer. He's great. And the \"Open the pod bay doors\" sequence is wonderful. But it's too short. And it's not long before the director once again lapses into too-long goings on.Four minutes for HAL to die. And die he does. Slowly, painfully, losing intelligence with every minute, voice getting lower and slower, singing \"Daisy, Daisy\", all with a low and constant hissing that becomes just as annoying as the heavy breathing.Seven minutes of flying colors as Dave enters the monolith. Seven. I could FEEL my brains melting and dripping out of my ears! Seven full minutes of absolutely nothing but some guy's whacked out psychedelic version of space travel, again with that thrice-cursed chorus! We got the idea at the beginning of the sequence! Why drag it out so long? Unless he wanted to make LSD users go psychotic and have flashbacks.I'm not even going to try to explain the ending, mostly because I don't quite get it myself. Supposedly he's in an alien research laboratory and they're teaching him deep and profound things while he watches himself getting older and older and then they send him back to earth as some kind of cosmic celestial space baby. None of this comes across in the film. For all you know, it's just a sequence of images with no purpose or plot whatsoever. A lot of the movie felt that way.The first time I tried watching this movie I gave up halfway through. The second time I suffered through this sore excuse for a film, it was to help my sister time the sequences to see how long they lasted. It's that boring.Call this crummy film \"art\" if you wish. I wouldn't. I've seen more interesting \"art\" in the local museum. And I am never subjecting myself to this kind of suffering ever again.","Mankind's Self awakening is the theme of \"2001: A Space Odyssey\", a process that unfolds along a space-time continuum. We \"see\" our primordial past, and we \"infer\" a cosmic future. The powers of intuition thus become the doors of perception, in our ongoing collective journey.From this transcendental perspective, a conventional, egocentric plot seems superfluous. Our frenzied conflicts and self-important dialogue are consumed in evolutionary change, and are irrelevant in a cosmos that is vast beyond comprehension. It's a tough lesson for a vain and aggressive species. Not surprising then that some of us huff and puff about the film's slowness and minimal story. For perceptive viewers, the remuneration is an inspirational sense of wonder and awe.In this film, which is mostly visual, geometric symbols guide our intuition. Circles and arcs represent nature. Right angles represent conscious intelligence. Some people think the sleek, black monolith is a Von Neumann probe. Maybe. Without doubt, the monolith is a visual metaphor for an extraterrestrial intelligence whose physical form is never shown. Mystery is more profound than explanation.\"2001 ... \" is unique among films in content and scope. The cinematography is out-of-this-world, the special and visual effects are breathtaking, and the classical music is sublime. I rarely use the word \"masterpiece\" to describe a movie. But Stanley Kubrick's \"2001: A Space Odyssey\" is art in the highest sense, like Leonardo da Vinci's \"Mona Lisa\", or Vincent Van Gogh's \"The Starry Night\".","\"200l: A Space Odyssey\" is a supremely intriguing space-travel journey with a profound look at mankind's future... It is one of the very few great films of our times... It gives us something to think, talk and argue... It wonders about our importance in the universe and ignites our imagination and curiosity... It inspires us to dig for insights...As a science fiction fantasy, it is one of the most original films ever made... Kubrick's camera dances to the \"Blue Danube\" with planets floating exuberantly through the light years... It's an experience in the poetry of motion, a rich statement to the power of cinema...But \"2001\" reveals that it's not really a science fiction film after all... It's, instead, a philosophical enigma, a magnificent meditation on man's place in the grand scheme of things, and a quest to understand ourselves by knowing all else...\"2001\" is a unique film about man's evolution told in almost subliminal terms... The people in this classic science-fiction epic hardly matter... Kubrick relates a chronology in images of thingsthe mountains, the desert, the technology, the space capsule, the computer named HAL (who is more interesting than the humans), and the time warp... The final landing scene is the very hallmark of cinematic genius...As a terror story, too, it is a towering achievement (not on the same scream-inducing level as Hitchcock's \"Psycho\"), but in an innocent and far more haunting way...The film uses invisible but powerful forces to manipulate the plot but perhaps the most overwhelming one is the picture's vision of man... In Kubrick's fantasy, the Golden Age of man was a neglected instant between a man-ape's exaltation at discovering the first weapon and a nuclear-powered spaceship floating in a graceful orbit around the Earth... Man has indeed evolved!As a spectacle \"2001\" assaults the mind, eye and ear, with stimulating images and suggestions... We are surrounded by a totally believable futuristic environment... The film is filled with brilliant sequences and extraordinary moments: The first interesting minutes in which the story of the apes is told visually, without a single line of dialog; the zero-gravity toilet with its great list of instructions; the stewardess defying gravity by walking the walls calmly upside down; the frightening moment when we realize that HAL is reading the astronauts lips; the magical alignments of Sun, Moon, and Earth; the \"Starchild\" returning home to charm the orb...\"2001\" is filled with poetic imagery: the view of the Sun rising over the Earth; the tossing of the bone into the air in slow motion; the slow images of the giant spaceship revolving in a cosmic ballet...\"2001\" is also a work of great visual acuity... It allows us to view more than the mystery of existence and destiny implicit in every man... Its end troubles many viewers as they demand clarity where there can only be mystery... They insist upon an answer where there can only be a question... Every viewer had a different explanation of the mysterious end of Kubrick's film But for those who can accept mysticism, the climax is deeply moving...","This movie is certainly one of the greatest films ever made. It is a story told in a steady pace, told mostly not by words but by cinematic means of expression. Perfect blend of spectacular special effects and classical music bring to life creations of human imagination in both realistic and poetical way. The story itself is quite simple at a first glance. As the title implies, there is an archetypal journey, a motive repeated for thousands of years. This motive was always used not only to depict a trip in space and time, and beyond, but also had rich philosophic meaning. The film is a poetical contemplation of most exciting eternal questions. It is not just an odyssey of a person; it is an odyssey of our species. The film is great by itself, yet, in my case, the impression from it will always be mingled with that from the book. I've read it at the age of 10, really not thinking about problems like 'what is the relationship between evolution of humankind and development of human morality'. But the impression was great enough to make me fall for entire genre of science fiction.The day I learned '2001' got only special effects Oscar and was not even nominated for the Best Picture was the day when 'Academy Award' completely became two words meaning nothing to me.","I spent many a sleepless night after watching 2001. Not only because of the psychological horror (of which 2001 is a masterpiece) but also because of the way it brought me (a restless soul) some clarity to the way I observe the universe. It changed my way of thinking in a very profound way. And after reading the novel (by Arthur C. Clarke) I found myself once again inspired (a writer as I am) by the level of imagination.The Space Odyssey is not something one can just \"go and see\". One has to be ready for it, or it cannot be understood. In fact I don't think it can be understood at all, at least not all of it at once. It is a philosophical journey to the infinite and beyond, a masterpiece of it's genre and still after 32 years technically quite impressive all the way to the powerful musical soundtrack featuring 'Also spracht Zarathustra' by Richard Strauss and 'Blue Danube' by Johann Strauss.Take all the time you want, but eventually you are going to have to see this film. If it can bring some order and understanding to the universe of a struggling artist like me, it can certainly do it for you as well.Or maybe I'm just plain crazy...","For the first time we see a mysterious monolith still for long before appearance of the first human. Stanley Kubrick in the company of the screenwriter Arthur Clark shows to the viewer of monkeys. These are the beings, rather primitive from the point of view of social lines, who don't have accurate public organization. But here on the horizon the mysterious Black Obelisk appears. Creators only begin to provide the thinnest surgical hints to the viewer as a food for thought. Opinions of most of both film critics, and mere mortals dispersed about it from the moment of the movie premiere.The further travel to Jupiter looks awesome, with fascinating sounds and the color images rushing before the astronaut's eyes. The long episode of an unreal travel sharply breaks with a scene in usual, quite realistic situation in the living room where the traveler endures the accelerated aging and regeneration, having come to be an image of the star child. The star child who comes up from a monolith in space is result of this coition. This creation which received absolute knowledge, having experienced physical death and having revived, smoothly moves towards Earth. There, having found a physical body, the star child will differ from other people as well as modern people from the space station differ from the monkeys.  \nThe musical motifs (Richard Strauss' Also Sprach Zarathustra, Johann Strauss' Blue Danube Waltz) will forever bring the film to mind, and snippets of its minimalist dialogue (\"Open the pod bay doors, Hal\", \"Good morning, Dave\") pop up in homages and cultural references.In the end just wanna tell, that this is one of the best movies ever. With fantastic atmosphere, deep philosophical implication and a nonlinear plot. All of this forces your gray substance moves and to look for a way to a necessary enlightenment. And here, when you would seem it is already close to it, \"the space Odyssey\" quickly slips out your \"hands\", leaving you alone with own thoughts.","There is not much new I can say that hasn't alredy been said in regards to the plot points and themes of Kubrick's magnum opus, so I won't even try.What I will say is that I saw this film at a cinema in Belfast where it is being screened to celebrate the 50th anniversary of its original theatrical release.I have seen 2001 many times on a TV screen and always enjoyed it. How can you not love a film with HAL? But seeing it at a cinema was a completely different experience and I was simply astonished by what I saw. Here is a film 50 years old and it looked mint. The set pieces are incredible and all I could do was marvel at what I was looking at. It really gave me a new appreciation for what Stanley Kubrick and everyone involved in the production crew achieved. As I said already, I have nothing new to say regarding the overall themes of 2001: A Space Odyssey but one thing I will do is recommend that if it is being screened in a cinema near you, seize the opportunity to watch this masterpiece on the biggest stage of all, where it belongs.","There are two schools of thought about 2001: A SPACE ODYSSEY.  One, is that it is the greatest science-fiction epic ever made. This is supported by those who claim to understand the complexities involved and leading up the Star Child ending. The others, like myself, find it as absorbing as watching paint dry on woodwork.The musical background is glorious, the colors are dazzling, and there's an interesting use of HAL as a villainous computer. Beyond that, there is nothing the least bit interesting about the human characters (trite dialogue and no personality or warmth to any of the individuals), the pace is unbelievably slow (so the intellectually gifted can philosophize on the mysteries of space), and the payoff at the end leaves you either breathless with enlightenment or convinced that you have watched three hours of nothingness.I had the same letdown feeling when I watched THE CLOCKWORK ORANGE, so your like or dislike of this movie is purely dependent on personal taste. Intellectuals will take the position that you are a mentally challenged clod if you dare disagree with their elevated opinion of the movie--so be aware that this is not conventional story-telling in any sense whatsoever and only for those who admire Stanley Kubrick's way with unlikely cinematic material.","2001 is one of those movies where, if you don't like it, you are told that you don't 'get it' and need to look at the deeper meaning and symbolism. You're told that you clearly have a slow attention span, and just want to see sex, explosions, and have the plot handed to you on a platter.Let's break down the movie shall we? Three minutes of blackness, with something that sounds like a dying hippo in the background. Then we get the opening credits. A minute of fascinating shots of the Savannah. Then a bunch of monkeys find a black rock and start killing things with bones. Cut to the first of many 20-minute shots of ships doing things while the 'Blue Danube' plays in the background. A bunch of pointless dialogue, and a group of moon scientists find another monolith.Cut to a spaceship that's too long for the crew complement--three sleeping people, two people named Dave and Frank, who have only slightly more personality than the stiffs in hibernation. And then there's HAL, the 'perfect' supercomputer who runs the ship. Predictably, he snaps and starts breaking the First Law of Robotics. Now this is something that has potential. An evil, coldly ruthless super-mind who controls the surrounding environment and can predict your every move. And what does he do? He lets one guy float into space and turns off the hibernation machines so the three sleeping guys die, leaving Dave floating in a pod. He simply uses the airlock, puts on a spacesuit, and turns HAL off--agonizingly slowly. Then, apparently, there's some psychedelic 'evolution' at Jupiter.Here's the movie with the pauses taken out: Apes see monolith, kill things. Scientists find moon monolith. HAL kills people. HAL dies; Dave gets a prerecorded message, and evolves at Jupiter.This is not me 'not getting it.' This is me being bored to tears by long stretches of absolutely nothing. Sure, it's realistic, but I find I have no reason to care. No matter the message, no movie can be good without being entertaining. Frankly, every character could be replaced with Keanu Reeves, and nothing would change.","Originally, I was writing a huge analysis of this film to post on IMDb, going through the film, thinking about it in detail and peeling back all the different layers to it. About half way through I realised that it was getting too long, and I should perhaps be more concise with my review. This however, showcases the huge amount of substance and detail to be found in this film. In my opinion, the best films aren't the ones that tell you things. The best films are the ones that ask you questions, so that you can think about it for yourself.The biggest theme in this film, in my opinion, is tools. Near the beginning of the film we are watching two tribes of apes just after the creation of the world. They are rival tribes, but then there is a pivotal moment which changes everything. One tribe discovers tools, in the form of using dead animal bones as weapons, and they are automatically superior. When one apes is playing, smashing a bone against another bone, he throws it up in the air and we witness one of my favourite cuts of all time. Suddenly it cuts to a spaceship with a similar shape, millions of years later, and we come to witness the tools that were discovered by the apes now defining who the humans are. The place they are staying in, a spaceship, is a tool. Breathing, which should be a wholly natural thing, can only be done through a tool. A man's only means of contacting his family is through a tool. For a large part of the film the characters wear spacesuits which, to me, although it is all up to interpretation, is symbolic, as, without their spacesuits (a tool) they would be naked. Later in the film, we spend a long time following an expedition to Jupiter which has on board an artificial intelligence computer, HAL, an astronaut Dave, and about three other Astronauts in hibernation. The thing that is striking about this section of the film is that Dave and the other Astronaut who awakens, both give extremely unrealistic and unemotional performances. That probably sounds like a bad thing to you, but that's exactly what the director wanted to convey. The fascinating thing about it is that in a ship full of a number of humans and a computer, the computer seems to have the most humanity.In this section, the two Astronauts decide HAL the computer, has gone out of control and they must unplug him. HAL finds out, and a fascinating situation arises. HAL feels fear. Here, it is easy to view HAL as a one dimensional villain who just wants to destroy things, but really, I think he fears being unplugged in the same way a person would fear being killed. I also think he reacts in quite a human way, killing the the Astronauts in order to save himself. However, Dave reaches HAL's control room and so begins a scene that I think is more disturbing than most things you find in a 12 (I'm British, but I think that translates to a PG-13 in the USA). In this scene Dave unplugs HAL and the most interesting question in the film arises. Is this murder? Whichever way, this is a very sad scene as HAL shows genuine human sadness and fear. At the end of the film, after an odd sequence consisting of Dave going through a light, colour tunnel and then seeing various landscapes in weird inverted colours, he lands in an eighteenth century room. This is a highly debated scene and is completely open to interpretation, but I will give my views on it:In this scene, I think that Dave, has travelled so far out, that time and space are insignificant. What I mean is that he has travelled to a place where it doesn't matter where, or when you are, time moves randomly. You could be in the eighteenth century, you could be on earth, you could keep getting older or you could keep getting older, (which all happen to him): it doesn't matter. And then what I think is the most ambiguous ending in film history unfolds. A much much older version of him appears dying on a bed, then you see a baby on the bed replacing where he was which grows and in the final shot you see it next to the earth, a similar size. So what does the ending mean? What does the film mean? What is it saying about tools? Was the unplugging of HAL really murder? Is HAL really human? What makes us human? Is it trying to imply we are too reliant on tools? Perhaps it is trying to imply that we ourselves are becoming the tools, as the beings with the least humanity. This brings me to my first point. 2001 never makes any statements it, only asks questions. And the great thing about that is that, they are interesting questions I can think about for as long as I want and never come to a conclusion, as I don't think there ever was one.","Like a Circle around the human condition, 2001 starts at the beginning, skips the middle, and proceeds to the ending, right back where we started. Noting the weakness of words compared to image(s), Kubrick wisely dispenses with dialogue, preferring the power and essence of the scenery, and allowing the intelligence of the audience to do the deciphering.  Or not, depending on the audience.A monolith in cinematic history, 2001 is a high water mark of direction, execution, and achievement.  If one considers the ambition of the film (a film about everything), and the measure of success the film achieved to that end, a very sound argument for this being the greatest of all films can be made.","A whimsical, often spectacular view of a future in which advances in technology dominate the world. It is well shot and although slow-moving it is intense and enjoyable throughout. The featuring of classical music to establish atmosphere works brilliantly; it provides a feeling of awe, mystery and intrigue  the same aura that Walt Disney worked in creating 'Fantasia'. The special effects, both sound and visual, are still spellbinding by the standards of today's technology. Aside from the technical pluses of the film, it stands strong as it is one of not many films out there that has something important to say about humankind, and where the human race is heading in terms of our increasing reliance on machines and our unquenchable thirst to discover. Despite an ending that is hard to understand, it is even harder to overlook this film a true cinema classic.","When two years ago for first time I saw a space Odyssey I get nothing from it. It seems to me nonsense. But when I saw it again a few days ago I'm completely mesmerized by this piece of art. I'm not going to talk about the beginning of the movie that shows us the process of progress. The cube is the thing that I'm going to talk about. I think it's a symbol of ignorance. It doesn't matter how much we make progress in science because there's always unknowns for human even more than before. How much did monkeys and professors know about the cube? Which group has more questions? For sure it's professors who have more questions and more unknowns. The spaceship's style is like a sperm and we can see it better in the last minutes when the spaceship's body could be seen as a sperm like moving light. I think it means that our space Odyssey is like a sperm's journey to the womb. And our knowledge of the world around is as same as a child's knowledge of surroundings in the womb. That's why we can see the cube in the room at the end of the Odyssey in front of an old sperm and a young and new infant.","I read some of the last critics and was astonished, that ratings for this movie are either very high or very low, which shows that these people weren't critic at all. I had a great deal of expectations when I watched this movie. Many friends said it is superb and I like all the other Kubrick movies I watched so far. But yeah. First of all the complete movie is filmed with a very keen eye on details. The ape costumes for example are great and the space vessels seem very realistic. The effects are much ahead of its time and are still remarkable today. But there is much missing. After the initial ape scene, which has some great shots the really boring part begins. Wee see spaceships with Strauss' Danube waltz in the background. It is pretty, for about 5 minutes, but after it is just boring. The music keeps repeating and all is very very slow. Some of the former critics say that you have to appreciate the beauty in it. Well spacecrafts aren't exactly beautiful and the statement, you have to enjoy this movie as a picture is stupid, because it is a movie after all. Maybe Kubrick chose the wrong medium for his 'art'. Later on even the music itself stops and it gets worse and worse. Some critics said the ships must be slow for being realistic. That is stupid, because in space velocity is relative and it wouldn't be less realistic if the ship was faster or slower. Over all there isn't much of a plot, which doesn't need to be a bad thing if the rest is entertaining. But it isn't entertaining, therefore plot is missing. I have to admit, that the end became interesting again. After a psychedelic sequence, where one doesn't know what it means come a few very good scenes. My friend insisted, that one can't really grasp the whole thing without reading the book along. But that is not the characteristic of a great movie. The psychedelic experience could also have been caused by a lack of oxygen leading to a dream sequence. One couldn't know the difference. I believe, if you'd take only the first ape sequence and the last aging and rebirth sequence you would really get a fascinating movie. What I most hate about the movie are the people watching it and telling me it is one of the best movies of all time. These are the same kind of people that visit an art gallery for the sake of telling other people that they are interested in art. Even my friend, who praised the movie, suddenly admitted that the movie is in fact boring for the most part. Art is not good because it bores you. It is the same mentality as saying, that culture has to be boring and that boring things are culture. And yes, I am not the kind of person who loves action movies. If it would be an intelligent movie, it wouldn't be boring, because really intelligent movies aren't boring. People brag about the philosophical meanings of this movie. What is the meaning of a flying spacecraft? Why has to be a philosophical meaning in a fictional short story containing aliens teaching mankind? There simply isn't one. Most people say that this movie is awesome because their friends do and this makes me angry. To sum it up: Boring as a whole but has some interesting genius scenes. It is not a bad movie, but also definitely not great and it is certainly not mediocre.","I normally keep my movie thoughts to myself but this movie affected me to the point of voicing myself out.Movies are typically evaluated via (i) more/less objective attributes (plot, ideas, action, cinematography, etc.) and (ii) emotional impressions they leave. While the latter is extremely personal and diverse, some convergence can be achieved in the former. Unfortunately, this piece greatly fails in it: no plot, no original ideas, no action, horrible cinematography, and a very repetitive soundtrack. As far as the emotional impression goes: well, in my case, it gave me a highly unpleasant aftertaste: a very pretentious schizophrenic nightmare...Why is it so overrated then? I'd hypothesize that it is for the same reason as in the case of Malevich's \"Black Square\". When one sees something a piece of \"art\" of that type, there seem to be two typical reactions: (i) \"There is nothing there, it is junk.\" and (ii) \"There is nothing there but it must be great because everyone else thinks it's great. Then it must be an art.\" So what created this mob fame effect for this movie? I don't know for sure but it might have been the big names of S.Kubrick and A.Clark. Once such a \"snowball\" starts rolling down the hill and picks up the momentum, it is more difficult to stop it than to roll with it.Please trust your own independent feelings. Things don't become better because a million of other people say they are brilliant. Cheers.","I felt the need to review this movie after reading some reviews from other users, simply because I agreed with all. Those who love it, those who hate it, those who enjoyed it, all of them. And the reason is simple: everything they say makes sense to me. I watched the movie for the first time about 10 years ago, and watched it again last night. It still doesn't make perfect sense to me. I mean, the story is absent, the characters don't really get through you, and the ending...who gets that ending?? #SPOILERS# BELOWThe end makes no sense to me... The psychedelic travel, the space child... Maybe I'm just plain stupid, but spending two and a half hours looking at space, slooowww space, and in the end just watch a man in bed, then a baby in a bubble, no explanations, no nothing... Truly, if someone got it and has the hability to explain it to me without calling it \"art\" or whatever, simply explain it to me, I would be very thankful, not kidding. Maybe that way I would be able to enjoy it next time I watch it, maybe ten years from now.That been said, why would I rate it a 7...? I believe when I watch a movie for the first time, I should put myself at the time, the era, the social paradigm, the movie was released. And this movie is cleary ahead of its time. Note, that I am talking about the visual effects, and the general idea of the movie. This movie clearly marked an era, a filmmaker, visual effects and the idea of what space was like. For that it deserves a high rating, maybe the highest. Not to mention the hype the movie STILL causes. We still can't reach an understanding...is it a masterpiece, is it overrated. The only way to really be able to discuss it and form your own opinion is to watch it, so the movie reaches its goal: to be watched and debated. A blockbuster rarely does this, we just watch them to get some good action scenes, visual effects, whatever, but when a filmmaker creates a movie that creates hype, controversy and most importantly, a vision of the future, he is creating a cult movie...a classic. To sum up, as I said in the beginning, when i read people calling it a classic, a masterpiece, I have to agree, but I also agree with those who say its overrated and boring...For me both sentences are true.","I'm always surprised, given that the famous title track of 2001 is called \"Also sprach Zarathustra\", that nobody (nobody I've read, anyway) has noted the parallels between the movie and Nietzsche's famous work, \"Also sprach Zarathustra\". The idea of man's rebirth into a star child; an infant form of an indescribably more advanced being, is an explicit part of N.'s \"Zarathustra\"; there is a prominent passage called \"On how a camel becomes a lion, and a lion becomes a child\", in which N. describes the first incarnation of the overman as a child, transcending both the ascetic, altruistic side of man (the camel; always asking to bear more weight) and the rapacious, brutish, will-to-power side of man (the lion). The fact that the song plays during the star child sequence can hardly be coincidence. And also, Zarathustra said that \"man is a rope tied between beasts and the overman.\" The structure of the movie fits that description: a brief history of man as beast, until we become truly man by mastering weapons and acquiring reason, then a long sequence about man (the rope, as it were), and then a brief glimpse of the overman. The inscrutability of how these transformations occurred, and the suggestion that an external force caused them, is also Nietzschean; in \"Zarathustra\", he makes it pretty clear that he doesn't have a clue how people are going to be able to enact these changes themselves and suggests that we will have to depend on an outsider (Zarathustra) to show us how to \"go under\". Bowman's psychedelic sequence at the near-end could be seen as Kubrick's best 1960's-style attempt at depicting the mystical \"going under\".I know these parallels are pretty broad, and almost certainly have been noted elsewhere despite the fact that I have not personally seen it. But I just wanted to mention them, if for no other reason than to try to dispel the myth that Nietzsche was ultimately a gloomy philosopher. Few people find the ending of 2001 to be gloomy, and it is in my opinion, explicitly and unmistakeably Nietzschean. The case could certainly be made that 2001 is above all a dramatization of \"Zarathustra\" updated for the modern age. Feel free to disregard the outright snobbishness of my tying everything to Nietzsche.","2001 is the perfect movie for a certain group of people. You know who they are. Over the internet, in your college maybe--a student or possibly a philosophy/art/film professor. A person with a passion for avante-garde films with wacky imagery and little else. They're the type of people who find a college thesis' worth of material from the dialogue in the Matrix sequels, they're the ones that boldly declare a film 'art' and anybody else who disagrees with them 'just didn't get it.' 2001 is art alright. The kind of art that I can only liken as being assaulted and nearly beaten to death by an Andy Warhol painting. Yes this movie is art, and you will hate it for that.This is a shame since normally I like Stanley Kubrick movies, but 2001 is an experiment in film-making and nothing more. The plot is incredibly vague, revolving around monkeys battling a black monolith, a mission to space, and a computer program called Hal going insane since that's what most self-conscious computer programs do. The film is then peppered with other psychedelic imagery that are supposed to convey grand ideas. They'll only convey those types of things if you're pretentious and into that kind of thing, otherwise you'll view it as utterly pointless.2001 revolves around these whacked-out, LSD-induced images to string together some kind of story that interests you. It does not. A parade of shots that have little to do with one another and randomly show things happen does not a movie make.There are no doubt going to be people out there who will try to explain 2001's plot and why you should accept it as being a wonderful film. The thing is this: much like if you have to explain a joke then it isn't funny, it's the same thing with movies. If you have to explain to someone the plot and its various interpretations, then it isn't a good movie.Ultimately I can't change the opinion of the viewers and critics that loved 2001, but if 2001 proves anything it's this: keep your art to yourself.","This is certainly one of the most boring and meaningless films I have ever seen in my life. I love science and science fiction both. They are in fact 2 of my main interests in life. This movie still bored me beyond description! The accolades being heaped upon this hunk of garbage is hilarious. The most amusing tendency among the fans of this movie is ridiculing those who think it is boring and meaningless as stupid, ignorant or both. I am a professional in the computer design and engineering business. I am not stupid. And guess what? This movie is still boring and meaningless. It does have some of the best special effects of its era. In fact, most of the effects in this film would stand next to todays advanced digital special effects without being embarrassed. This is the one and only redeeming quality of this film. It's a collection of very long, very boring scenes that never seem to end. People have mentioned some of the most boring parts. The problem in listing them all is that it would be much easier to list the parts which are NOT boring babble. This movie is a complete waste of.....what seemed like 20 hours of my life. I highly recommend that you never waste time on such trash. For those who will attempt to dismiss my comment along with the other people they have dismissed let me be perfectly clear. I understood everything in the film. It is simply a terrible film. This pseudo-intellectual drivel is a director who thinks he's quite brilliant in his high school level presentation and vision of the journey of man. Of course he is very wrong indeed! If you enjoy this then I suggest you browse youtube for videos made by either inarticulate adults, or videos posted by immature children expressing their simplistic ideas of the world and mankind. The director is incompetent. What takes him 15 minutes of very boring film, a segment he labels \"the dawn of mankind\", near the beginning of the film is a segment that a skilled filmmaker would be able to accomplish in about 2 minutes at most. In fact that sums up what this movie really is. Very simplistic ideas drawn out, and I do mean DRAWN OUT SEEMINGLY FOREVER, in an effort to convince the audience that the filmmakers were very smart people. Hold a copy of the movie in your hand and you will see the condescension dripping from it. It's disjointed. It lacks cohesiveness. It adds elements of science fiction, horror, fantasy, and pre-teen created entertainment. It also fails to deliver in any of these categories. Stop attacking those who do not like this film. They aren't nearly as stupid as is implied here. This movie really does suck this bad. It's almost entirely comprised of shots and contrived scenes which are intended to showcase the effects. Nice effects. Utterly worthless film. Obtain and enjoy some of the many great documentary films about the space program if you want to see great scenery of space. To complete this huge hunk of celluloid garbage, the filmmakers end it with scenes that are not only long but can only be compared to patients in an insane asylum babbling incoherently. No we're not stupid. This movie just sucks. Beauty? Hardly. Deep? If you have a 5th grade education perhaps. Worth watching? Absolutely not! There is nothing brilliant about meaningless film that must be \"interpreted\" by the few viewers who claim they have the answer. Thats just incompetent lazy film making."],"review-user":["imew","simon_booth","drn5","Manthorpe","mmt02","Don-102","Nessy_Gliana","Lechuguilla","Nazi_Fighter_David","indraya","tapioylinen","JanskiT","praymondmurray","Doylenf","The_Mantis","jacknorwood2002","diamond-31","sol-","H-o-s-s-e-i-n","a_kingl","VVB","suws1","Cain47","mescaline16","fukoffdickface"],"review-date":["14 April 2018","17 June 2003","20 April 2003","5 January 2005","3 June 1999","7 March 1999","12 August 2006","6 February 2005","11 August 2005","29 August 2002","7 February 2000","31 August 2018","7 June 2018","17 June 2002","18 March 2005","3 September 2015","3 March 2001","3 January 2005","27 January 2014","20 December 2008","20 May 2001","24 June 2013","16 November 2001","16 March 2006","7 May 2009"],"review-rating":["10","10","10","10","10","10","1","10","9","10","10","8","10","1","9","10","10","5","1","7","10","1","1"],"review-title":[" Legendary\n"," Unmatched accomplishment\n"," My god, it's full of stars\n"," A film of monolithic proportions.\n"," Greatest Movie of All Time\n"," Tribute to one of the top 5 filmmakers of our time...\n"," Don't believe the hype-\n"," Cosmic Art\n"," The final landing scene is the very hallmark of cinematic genius...\n"," film is a poetical contemplation of most exciting eternal questions\n"," The Order of the Universe\n"," «If you understand a movie, it means we have failed».\n"," 50 years strong and this journey still has plenty to offer\n"," It's a puzzlement...\n"," Overrated tripe\n"," It takes hard work to get into, but when you do, its amazing.\n"," A film about everything\n"," My brief review of the film\n"," Where are we?\n"," Be careful, people try to sell you things\n"," Kubrick's \"Black Square\"\n"," Ahead of its time but...\n"," Nietzsche and 2001\n"," When Art Attacks\n"," Drivel\n"]}