{"review-url":["http://www.imdb.com/title/tt0062979/reviews"],"review-text":["The opening static shot of Joe sleeping, for a full 4 minuets was very reminiscent of Earlier work done by Morrissey's Quasi-partner, Warhol on the movie Sleep, which is  a static shot of some guy sleeping for 6 hours. But Unlike Warhol's work, Paul Morrissey put the narrative into the Warhol aesthetic principals,by giving the actors more substance to each scene, and then  moving around the camera, and following the actors actions more closely with a omnipresent eye that doesn't inhibit the actors in sometimes highly improvised situations. (unlike in Warhol's work actors/actresses were aware of the camera at all times and didn't allow them to lose themselves in the moment on screen).Yes there is allot of Improvisation in this film which is what gives it the feeling of watching something that is real. The movie was not scripted, before every scene Paul Morrissey told each actor what he wanted from each scene and the actors were left to their own devices improvising dialogue and advancing the narrative. Choosing the subject of Hustling for a living, selling your self for money, and pairing it with an actor that knows about the lifestyle is what really gave Joe the opportunity to make the character believable. In fact after the movie was shown around the world, people actually thought Joe was Like that in real life, Just like in TRASH, everyone really thought Joe was a junkie. One good scene has Joe picked up by an older gentleman who wants Joe only to pose for some artwork. Joe tells him he wants to earn 100 bucks, (to pay for his wife's girlfriend's abortion) \"one hundred dollars!, you'll have to take off all your clothes for that\" the old man tells him.  The old man  is in fact hiding his homosexuality, Pretending to be an artist. Back at his place He tells Joe to take off his clothes, saying that that is the hardest part for anyone to do when posing for art. But Joe's not shy, He takes off all his clothing and starts posing in various olympiadic poses,. While the old man rants on about the different artworks in contemporary society, the aesthetic of greek statues, philosophizing on the beauty of human skin, and how people are obsessed with it,  It's too much for Joe, Joe interrupts him asking him for the dinner he promised him. The aesthete's rationalization is paralleled by Joe's last customer of the day, Louis Waldon playing a guy Joe knows from the gym. He pretends that their sex is for the friendlier motive than the money Joe always requests and that despite their sex, \"we're not queers.\" The pretense to friendship is undermined when the customer shifts from the passive suggestions to brusquely ordering Joe about. The client's delusions show his need for purity in a relationship-such as glimpsed in Joe's scene with the baby, where he is nude on the floor feeding the baby bits of muffin. Only with the baby is Joe shown in a relationship were he is not a commodity. Joe runs into some other hustlers on the street, younger ones who sorta look at Joe with respect, because he's the more experienced Hustler, and they being ones who want to learn more. One of the boys asks him if he's straight Joe say's \"Hey nobody's straight. What's straight? It's not a thing of being straight or being not straight. It's just...you just do whatever you have to do\", and about the johns, he only says \"they only wanna suck your peetta!\" In another memorable scene With Geri Miller, Candy Darling, Jackie Curtis, and Joe. Morrissey pans from, Candy and Jackie (transvestites in real life) sitting down on a couch reading from an old Hollywood magazine >     The trannie's quote stuff from the magazine and then Geri's goes into her dramatic story of her rape, meanwhile Joe (emotionless) listens to it all. Later Geri does a topless dance at Joe's request but he ignores her. The film ends like it begins, but with a difference.Again Joe is Naked on his belly on the bed. Reversing the opening order, the full-length view is followed by the profile close-up. But now Joe is no longer alone. His wife is asleep beside him, but between them lies her new lover, the women's legs ardently intertwined. We see him in the relationship from which he is excluded. Joe's naked solitude is redefined as an alienation within a relationship. The film went on to gross over $2,000,000 dollars, making it a very profitable, considering it was done on a budget of only $1,500. It was banned from England for a while, and in Germany 3,000,000 people saw it making it one of the top movies in Germany in that year. It was the first underground film that was accepted on a wide scale basis, and made Joe a very well known person all over the world.","Flesh is the first film of a trilogy by Paul Morrissey and Andy Warhol, and is perhaps the first attempt to create an icon of desire out of a male leading role.  Although the film is focused on an uncomplicated character development of Joe (Joe Dallesandro), a gentle and subtly unhappy hustler, it depicts him as a passive and ambivalent object, who, in spite of a semi-evident sense of self-control, is possessed, shaped, and evaluated entirely by others.  Joe is a young and somewhat naive Adonis who exudes comfort and beauty in his independence, but he works the streets to support his lesbian wife and her girlfriend.  He is restlessly bored by an artist/customer's speeches on Greek athletic sculpture and 'body worship', but he sells his nudity anyway.  He regards the increasing advances of his homosexual friend with ambivalence, but lets them happen nonetheless.  This passivity dominates the film and succeeds in creating a visceral element to Dallesandro's appeal: not only is he desired, he is had.Perhaps the film's most interesting element is the balance of its obviously experimental nature with its palpable directness.  The snappy editing and fragmented dialogue make it fresh and 'real', yet it manages not to rely on the clichéd abstractness of art-films.  It is rough, and indeed a weaker effort than Trash or Heat, but nonetheless presents a collection of perfectly plausible characters in a light of almost absolute neutrality.","It seems inhumane to describe someone as a work of art but in the WarholArt Sphere there seems little other way to describe Joe Dallesandro in\"Flesh\". His body is displayed constantly in the nude, more consistentlynaked than any other actor I can think of in American film history.Warhol/Morrissey (the authorship of the movie remains contentious thoughMorrisey is the credited director, the film rides under the \"AndyWarhol's\" banner) objectify and expose every part of Dallesandro'shustler in the film. He was truly the first sex symbol of the 70s. Itwas only in \"Flesh\" he was so un-self-conscious and innocent thoughalways with survivalist and self-serving cunning. Joe (the character) is  an interesting kafka-esque (unable to control the world around oneself,prone to the ebb and flow of circumstance and external control) figurein the midst of a collage of underground culture figures of the 60s fromdrag artistes to quivering tricks. Its a high camp affair at times butMorrissey has a loving camera when it comes to Joe. Joe's beauty isvividly captured and the fly-on-the-wall style story of a day in hislife remains engaging a","One of the most sublime of American masterpieces, Morrissey opens the film by sexualizing Dallesandro, with his open mouth snoring on a pillow. We wonder, is he coming off a heroin high? We just see his face, then, flash, his body, flash, his naked rear. I can't think of another film that used this flash-blip form of editing so well to create a hypnotic, druggy mood, an editing method that works wonderfully as both pacing and style. After that introduction, when Dallesandro opens his mouth, his accent is jarring -- we expect him to be some kind of soft-spoken androgyne; instead, he's got the voice of a street thug -- Morrissey isn't comfortable letting our assumptions go unchecked. The lengthy opening is very sexy and playful -- it's a combination of martial troubles, Dallesandro's fascinating lip-rubbing kisses, and early morning sexual escapades; it all kind of flows together, if not always smoothly, then emotionally realistically.What I got from this was the same as what I got from \"The 400 Blows\" when I first saw it -- this is like a 20-something continuation of that story. There's a sense of camaraderie between the flesh sellers and the buyers; when Dallesandro walks the street looking for men (to fund his wife's abortion) there's the feeling of a secret handshake as boys make deals with each other. I never found it boring, though nothing happens -- nothing happens brilliantly, the boys hanging around, as they do, waiting for tricks. The main trick that Dallesandro finds is fascinating to watch, using Greek descriptions and only touching his back, a form of aesthetic body worship on the man's part. It's also dreadfully funny (\"I'm not talking to an empty bed, am I?\"). It's one of the most revealing scenes in the movie -- in any movie, I think; certainly any movie dealing with sex and sex for sale. When Dallesandro's eyes seem red and swollen, we can't tell if it's because he's drunk, ashamed, embarrassed, or all.The conversations in the film are cut-up -- they don't matter. (The film is silent in a few scenes, some of the most poignant and beautiful you may ever experience.) Yet when Morrissey chooses to include one, the way he includes it (we sort of piece it together), it's startling, such as one conversation between Dallesandro and a newbie hustler -- and neither of them ever mentioning the word \"gay\" or \"hustler.\" What follows is a scene where we listen to a pair of transvestites as Dallesandro gets serviced -- this just after explaining to the newbie \"getting used\" to the job.Dallesandro is a subject worthy of the attention paid to him, both by his clients and Morrissey. He's less than effective as an actor, in the sense of acting as performing, but as far as revealing something he's incredible -- he's someone we immediately want to feel above, yet we go through his experiences, with all their complexities, and we're forced to try and know him. He's the kind of blank slate that we're drawn to but can't get a hold on. And of course he's incredibly striking -- forgetting everything else, this is partially a testament to the beauty of the male body, Dallesandro's gorgeous torso and permanently erect nipples.The movie has one devastating scene, but like everything else you can't really master it -- a girl says that she's been raped, and her only self-defense is in saying that, had the rapist only asked for sex, wooed her, he would have gotten a better lay. It's shattering. The movie has feeling for everyone, but even better than that, it's not merely sympathetic, it actually attempts to help us understand human beings -- and without ever dictating what it is we're meant to be understanding. It neither looks down on nor glamorizes the people within the film. It feels inclusive when we see Joe's arm around a transvestite. When he reads a letter (he talks about not getting past grade eight at one point), he's utterly charming, as he pauses on a word...then says, \"woteva,\" and continues.You can learn something more profound from the interaction between Dallesandro and one of his clients in terms of gay-straight relationships than you can from any case study. Here we have the young boy who smiles (his top lip disappears as he does so) when a 30-something gym bunny Korean war veteran runs his fingers through his hair; it's a scene that feels very profound, this adult man sharing something with a younger version of himself -- it's not two gay men together, or a gay man paying a straight man, it's something else you can't put your finger on; questions of sexuality are beside the point. (Never before has popping a pimple seemed as affectionate.) After sharing something with each other emotionally (though with Dallesandro, since he's there for money, it's never apparent why he's there; though he's never less than sincere, which may be his most disarming quality), \"So...can you help me out?\" The man says sure. \"I don't mean my pants!\" 10/10","I was a junior in high school when \"Flesh\" hit the big screens, but had the good fortune to see it at midnight movie houses in NYC just two years later.Flesh is the first part of a so-called \"trilogy\" of films, featuring Joe Dallesandro, as an object of desire. It bears the \"Warhol\" name, but is more the work of Paul Morissey. Essentially the story concerns itself with the exploits surrounding one day in the life of a street-wise male hustler (played by Joe Dallesandro). Joe is young, beautiful, and a bit naive... but he manages to bring home the bacon to his wife, for reasons which should not be explained to appreciate the film fully.Of special note to film buffs is that this film (along with the remaining two of the trilogy), had no script, per se. Warhol's superstars were given simply a premise... and the words and actions which the viewer sees are quite natural (even at times ridiculous or non-sensical). But all in all it works... \"Rolling Stone\" noted in its review that the film was better than \"Midnight Cowboy\", a film of the same year, more polished by Hollywood (An Academy Award winner for Best Film) , with big name talent (I equally admire the film)... but FLESH, being improvised, was somehow more gut wrenching and realistic, without the need for complex sub-plots and any \"cause de celebre\" .. or for that matter any cause at all!The film grossed more than $3 million dollars and was an absolute sensation, particularly in the German market (which, ironically, thought they were given a \"censored version\" of the film because of the post-editing....see note below).Curiously, the film is very much \"cut and paste\" with \"pops\". \"clicks\", \"flashes\", and dialogue literally cut off mid-sentence. It is almost as if Warhol/Morissey are stating a simple truth that it is a \"day in the life\" of a superstar, snippets for your voyeuristic tendencies. Far better than earlier Warhol works of 8 hours of sleeping, and the statue of liberty as a 20+ hour movie.FLESH, in my opinion, is the first of the Warhol films that actually is digestible (given a wide pallette) and Warhol's/the Factory's first legitimate response to the Hollywood phenomenon of \"stardom\".As the first of a \"trilogy\", it portrays a young, desirable male icon, naive, sought after, responding to invitations to please his family. Subsequent films would show the \"same character\" with a differing set of values. (See \"Trash\" and \"Heat\")","Because this flick is the first feature fruit of a long lasting collaboration between Paul Morrissey, Andy Warhol and Joe Dallessandro, it is too much obvious that it was mostly made for having fun among themselves. The script is quite loose, the dialogues are too obviously improvised, one even suspects that there probably is no script at all, just thematic concepts: prostitution, addiction and poverty (which all seem to continue in the following films Trash and Heat).\nJoe Dallessandro reveals unashamedly his gorgeous body at any chance, to the hungry eyes of other addicts (not only drug addicts).Although the whole film seems like amateurish, especially the scene with other hustlers at the park is very intriguing, like a documentary project. I would not recommend to see this by itself, but watching the trilogy (Flesh, Heat and Trash) altogether will be much enlightening.","A heap of human flesh lies asleep on a red pillow. This is the hunk of naked meat that is \"Little Joe\", a New York hustler who lives with his bisexual wife and baby child. The film follows a day in his life, after he's woken from sleep by his wife demanding that he go out and do the traditional male thing - be a breadwinner. But the use she wants to put the bread to is to pay for her new girlfriend's abortion. We certainly aren't in the traditional family unit here...After playing with his child, Joe hits the streets to cruise for johns. The clients come thick and fast: the ordinary gay man who wants to meet him again because they \"work well together\", the old English classical scholar who pays $100 to see Joe pose like an ancient Greek athlete; the female topless dancer who blows Joe then boasts about being raped; the ageing gym bunny who doesn't think that what he and Joe do together is queer. After a hard day's work, Joe returns home exhausted, only to be put down by his wife and the girlfriend. He goes back to sleep as they harp and undermine him.Flesh is fascinating as it takes what is a traditional classical mainstream structure - it has an inciting incident (the money for the abortion) and set-up, a confrontation and a resolution (albeit a very downbeat one), even a protagonist with a strongly motivated goal, and then proceeds to concentrate on the details of the day to day routine of these people who are perfectly ordinary to themselves but extraordinary to most \"mainstream\" people. It all seems very authentic and natural - it's hard to see the acting, the actors are so fully being their roles - but yet the whole thing is a piece of cunning artifice - a beautifully drawn portrait or an intricately carved statue. Director Morrissey carefully plants every incident, every encounter around his theme of human flesh become packaged commodity but with such cunning slight of hand that you almost don't notice him doing it. The wife \"packages\" Joe's sexual organ, the old Englishmen laments a long gone order of classical beauty which created art and poetry from human fleshly beauty, the transvestite friends of the stripper package themselves as women whilst reading a Hollywood magazine in which \"real\" women are packaged as products; the gym bunny buys Joe's friendship and affection, thinks artificial porn is real and can't tell, as we can't, that Joe is performing his friendship and intimacy for the cash. The film itself presents itself as the ne plus ultra of cinematic realism but what we might as well be dealing with here is fine art or an early example of concept art.The genius - a word not lightly used - of Morrissey was to find a way of taking Warhol's arty pretensions to film-making, which were interesting sure but boring as hell, and making them into saleable products which remain amongst the most intriguing works of cinema art ever made - commercial cans labelled \"Flesh\" and \"Trash\" and \"Heat\" with a product label - \"Andy Warhol\" - which sells an idea about the product as much as the product itself. Yet just as you reel from Morrissey's cynicism, you are spellbound by his ability to still maintain the highest of standards and depth of meaning. The constant what seem like camera flashes continually draw attention to the filmic nature of what one is witnessing, yet you get drawn into the illusion all the same - Flesh is surely one of the most extraordinary pieces of cinema magic to ever spellbind an audience.","Although the film opens with the credit \"Andy Warhol Presents\", it was actually written, photographed and directed by cult film-maker Paul Morrissey (according to Morrissey, all Warhol provided was money and publicity).Joe Dallesandro (immortalised as \"little Joe\" in the Velvet Underground song \"Walk on the Wild Side\") plays Joe, a slightly dim-witted male prostitute, who is supporting his bisexual wife and baby. His wife wants him to come up with $200 for her girlfriend's abortion. We basically follow Joe around as he encounters various characters willing to help him, including an artist who wants to pay him to pose nude, and Warhol \"superstars\" Candy darling and Jackie Curtis.Despite being amateurishly shot, with countless technical errors, the most annoying of which is a very badly-recorded soundtrack, the film is fascinating due to it's delving into a world rarely seen on mainstream screens, which probably doesn't exist anymore. Although many scenes do go on for too long, it's too startling to be dull. Fans of Joe Dallesandro will no doubt enjoy his frequent exposure (he provides most of the flesh of the title).If you're a fan of cult or underground films, you'll not want to miss this. It was followed by \"Trash\" (1970) and \"Heat\" (1972) to form a loose trilogy.","Snap, crackle, pop! The jarring sound of every change in camera angle. And that's not to mention the white flashes and the clipped endings to almost every spoken sentence. What on earth were they up to in the editing room? Or could it be that this approach was intentional? Surely not. What purpose could it serve? Despite all its technical short-comings, this is an interesting film depicting a day in the life of Joe, a hustler, determined to earn $200 for his wife's pregnant girl friend. Joe Dallesandro is outstanding as the easy-going, passive, laid-back young man who is willing to let the other person do most of the talking while he listens with a faraway look in his eyes.The story is meagre and sketchy, documenting the uncertain life led by a man who relies on casual street sex to support his young wife and baby. One thing is certain, Joe is uninhibited when it comes to disrobing for sex or posing for an artist. Understandably so, for he has a handsome face and and equally handsome body.There is a scene in the film that is remarkably effective. There is no sound, no dialogue. Joe stark naked is crouching on the floor feeding crumbs of cake to his little baby. There is a beautiful serenity and tenderness captured in these quiet moments.Another scene of amusing interest is the one in which Joe desperately seeks a loan of $100 from a gym friend, coming to the point of asking in a very circuitous approach.Joe tries to look interested but is hesitant in his conversation when an artist gives him a non-stop resume of Greek and Roman art. It's a preliminary to another occasion when Joe divests himself of his clothes and poses as the discus thrower in true classical style.At the end of the film we gain the impression that we have got to know Joe pretty well. After all he has uncovered more than his soul.","I guess only a selected number of audience members really had any interest in watching how a male hustler in New York operates but I'd be willing to bet that even these brave souls were turned off by the irritating patchwork technique and deliberately muffled sound recording on display here; the fact that these inherent 'defects' were a direct result of the film's low-budget/underground/experimental nature is, I'd say, beside the point. Anyway, for those so inclined, the film features extensive male nudity and Joe Dallesandro, understandably, became an underground  and gay  icon! The episodic structure showing the day-to-day routine of the hustler protagonist offers a couple of mildly interesting scenes: his meeting with (and eventually posing for) an eccentric elderly artist; the one where Dallesandro expresses his views on his unusual line of work and delineates his particular modus operandi to a couple of prospective 'colleagues' including perhaps the unlikeliest of hustlers  a bespectacled nerd! Perhaps mercifully, the film ran for only 89 minutes against the IMDb's claim that its complete length is 105 (but the latter could well be a mistake)! I had watched a few other of Warhol's 'movies' and this one is decidedly not as satisfying as the most tolerable example I've run into yet, BAD (1977), and only slightly better than the likes of MY HUSTLER (1965) which were mostly a strain to sit through. The fact that this was only the first part of a trilogy did not augur well but, as the saying goes, you gotta to do what you gotta do and the other two 'chapters' had to follow in quick succession... Despite my generally negative reaction to it, FLESH is nevertheless still valuable as a 1960s time capsule and as a prototype of the Underground scene of that era, both cinematically and in real life. For the record, an image of Dallesandro from this film adorns the sleeve of The Smiths' self-titled 1984 debut album and transsexual Candy Darling (who appears here rather unremarkably) was immortalized in \"Candy Says\", the opening track of The Velvet Underground's eponymous 1969 album. Although the latter band is my all-time favorite, and one of the reasons for this is that, through their sheerly unique and ground-breaking music, they described a lifestyle so utterly different from my own, this is truly a case where I'd much rather experience something aurally instead of visually!","In a lot of ways this film defines the essence of everything I love about cinema, in terms of capturing those strange, elusive moments of unguarded truth. In other ways, it is undeniably an amateurish, unfocused result of junkies self-indulgently fooling around with a camera. Ultimately it comes out somewhere between pure brilliance and unwatchability (thankfully much more so the former than the latter). Part of me wants to reward it solely for it's absolute innovativeness and moments of pure sublimity, but at the same time I can't completely ignore the occasionally downright awful \"acting\" and overtly bad production values. At first the editing seems overwhelmingly sloppy and needlessly distracting (or maybe just wrongheadedly \"innovative\"), but after a while I got used to it, which is, in the end, the true sign of whether a film succeeds on it's own terms or not. I guess that answer basically sums up my all-around feelings for the film. That is, despite it's in-ignorable flaws, on a whole it does work very well. And, if nothing else, a film like this really shows how false and contrived the faux-documentary, shaky-cam style can sometimes be when it so obviously applied purely for effect (such as in films like the otherwise admirable Roger Dodger). Here the aesthetics are plainly derived from the necessities of the filming situation, and are not just used arbitrarily to make it look \"cool\".","The title practically says it all, and that's all you'll need to be expecting to enjoy this movie. What you get when you watch this film is tons of the beautiful, masterpiece that is Joe Dallesandro all over the screen. It is a day in the life of his character, a married bisexual prostitute, and how his life ties in with all the people around him and all the people he does business with. It is a very interesting and well done film for how well the actors play it out. They act as if it is just an ordinary day and they don't even know a camera is filming them which makes it seem so real. Joe Dallesandro is another reason why this film works out well.Now, I'm not saying that the main purpose was to make us want to jump into the screen, pull him out and play with him, but goodness was that boy beautiful, and I certainly wanted to do just that. It might be just for his looks that the reason we care to watch his character's day play out so much is because he's so incredibly gorgeous, but in any matter it still makes us care what happens to the character, which is something any film should try to do. It becomes an interesting tale because of how we see what amazing things he's able to do with his body and how amazing his body looks doing them, such as the Greek pose photoshoot and how him playing with and feeding his child in the nude is still sweet and charming whilst being devilishly mouthwatering.The movie is not meant to be a landmark among film history. It's a run-of-the-mill film about an average day that is made into an excellent story and an excellent movie overall because of how much we enjoy seeing the actors and actresses take part in it. The dialog keeps your attention, the story keeps your attention and Joe Dallesandro's existence keeps your utmost attention. I suggest you see it in the right sense and you'll be able to have fun with it and enjoy it.","In order to finance an abortion, an unemployed youth becomes a hustler for a day in this Andy Warhol produced drama that has gained cult status over time. It is certainly quite daring for a movie made during the late 1960s, tackling a lewd subject with copious full frontal nudity throughout. Viewed nearly half a century on though, much of the content seems tame and the film does not have a lot going for it, shock value aside. The technical aspects are very, very poor, and while it can be rationalised that some of this is due to budgetary constraints, any such knowledge does not make it any easier to sit through the dozens of jump cuts and audio blips throughout. The performers also have a tendency to mumble their lines (then again, what dialogue can be made out is not especially well scripted). The film has scattered strong moments, such as a humorous bit in which one of the hustler's clients moults him into various naked athlete poses, but humour is unfortunately not generally at the forefront of the film. The film does attempt to offer something in the way of character growth with the protagonist gradually coming to realise that everyone only wants him for his flesh (hence, the title) and there is something fitting in how the filmmakers themselves also only value him for his body, spending so much time on nude shots and so little on developing his character... however, all this is far more interesting to analyse afterwards than it is to endure. And, given the slimness of the content, it is perhaps inevitable that the film overstays its welcome, though it is a curio for sure.","This is the epitome of the \"experimental\" genre.Very often, films like this are simply created at the whim of the director and producer - neither of whom really know what the outcome will be.These kinds of films usually are exercises in self-indulgence.\"Flesh\" is no different. It's just that a lot of Andy and Paul do with Joe (and I'm sure that many of the scenes were realized fantasies of Andy's about Joe).Is this is a good movie? a bad movie? The answer is neither - it exists to be viewed by the people who are familiar with this genre.","4/25/18. I decided to watch this because it's considered a cult classic that was produced by Andy Warhol. Watching this 50 years after it was released does give some perspective. Basically, it's horrible. However, I can see why Warhol was fascinated with Dallesandro. He's one cool dude, absolutely photogenic and totally unbashful about showing off his wares. Other than that the cinematography was awful, the film editing choppy, the plot - non-existent. You can watch it for the sake of curiosity, but don't expect to be blown away by its lack of Art.","There's an ongoing mystery about the Warhol/Morrissey film 'Flesh'. According to this website and to the Time Out Out Film Guide its length is 105 minutes. I have a DVD of 'Flesh' which also says it's 105 minutes long. The actual running time of the film on the DVD is 89 minutes: more often it's 86 minutes. So where does the 105 figure come from. If you ask the question on Google: 'How long is Andy Warhol's 'Flesh'?', the immediate answer is 105 minutes. So far I have failed to find any version that lasts more than 89 minutes. Does anyone have an explanation for this? Where has the 105 figure come from and to which version, if any, does it refer? If there's a version of this length why are nearly 20 minutes missing from the available versions?","As a fan of Warhol/Morrisey/Factory Superstars, I enjoyed watching a movie that starred the people I've read about for years. It may not be for everyone. The story & acting is not the best. Joe Dallesandro comes off as so innocent & endearing that it's worth it to me. For any fan of the genre, Joe's or Warhol, this is a must see. There is a trilogy Flesh, Trash & Heat. In this movie, Joe plays a hustler trying to earn money for his demanding wife played by Geraldine Smith, which in real live Joe had an affair with, even though he was married at the time. Patti D'Arbanville makes a short appearance as well as Joe's real life brother Bob (who died a couple of years later). Take it for what it is, a quickly made art film starring very young \"superstars\" who did not think that this many years later people would still be viewing the film.","59/100. This is really like a home movie documentary, obviously an extremely low budget film, poorly made with awful editing and photography, but it does have a certain fascination about it, perhaps because it seems so real and natural. The acting is hard to judge because it's like watching real people, it is almost like a voyeuristic look into the life of one man and the people he encounters. It is amazing this was filmed in 1968. I am sure there was nothing else like it back then and it would be considered a racy even by today's standards. This is the first movie of a total of three that Paul Morrissey did in collaboration with Andy Warhol.","Technically abominable (with audible \"pops\" between scenes)and awesomely amateurish, \"Flesh\" requires a lot of patience to sit through and will probably turn off most viewers; but the dialogue rings amazingly true and Joe Dallesandro, who exposes his body in almost every scene, also gives an utterly convincing performance. A curio, to be sure, but the more polished \"Trash\", made two years later, is a definite step forward. I suggest you watch that instead.     (*1/2)","Although there is very little plot and whatever exists is just all improvisational, still it was a good start from a new director with no previous financial back up and also a smart move from Andy Warhol to make his cimematic productions more marketable and viewer-friendly.  In any case this story of a street hustler relies too much on showing Joe buck naked (almost all the time!).  And the creative use of a flashy editing really wears off after the hundredth time and the cutting off the dialog thing gets really annoying half-way. This would have been a much more entertaining or even dramatic if they made a documentary of the daily of an actual male prostitute or hustler, instead of letting the actors make up some nonesensical plot and dialog of their own.","Flesh is about a bisexual prostitute who spends a day trying to make enough money to pay for his wife's girlfriend's abortion. It's cheaply shot, cheaply edited, and cheaply produced, so some extra attention has to paid to the dialog because sometimes it's a little difficult to hear, though the imagery is straight-forward enough. The actor who plays Joe spends about half of the screen-time completely naked (and yes, Morrissey doesn't shy away from showing everything), and basically through a series of scenes and conversations in the streets and cheap apartments of New York you get a pretty interesting though somewhat dragged-out portrait of the sexual underground, populated entirely by passive, unintellectual people who live John to John and are ultimately unable to even think about what they'll need in the future. Though the acting is poor (and made worse by the editing, which cuts off some of the dialog in parts), there's a sense of realism here that goes beyond the likes of Midnight Cowboy and Dog Day Afternoon, more mainstream movies that can use the crisp production values and stronger acting as a sense of removal and distance between the subject and the audience (\"after all, it's just a movie\"). The dialog, in its meandering and mumbling glory, is actually really well written, making it a shame that it's so poorly delivered because it really does provide a gateway into understanding these characters. In the end, though, if this movie doesn't shock you it might not be that effective otherwise, because it is, after all, a story about bored people with no motivation.--PolarisDiB","Flesh (1968) Director: Paul Morrissey **1/2outof**** Review After just reading \"The Andy Warhol Diaries\", I then proceeded to seek out his films, and apparently all he did was fund this and raise its publicity. So I shall leave out my interest in Warhol for the sake of this review. I watched this twice just to see how I really felt (the first time I felt nothing towards it). I felt the second time that the movie has an indistinct quality that makes you want to keep watching, I can't deny that. The movie is virtually plot less and really is a camera put on actors while they most likely improvise most of their lines. At least it really felt that way.The movie is choppily edited, the lighting is murky, the film is grainy, and the sound is horrendous. The actors are the main joy in this movie (well actually only a few). Seeing Joe, Geri, the awesome Candy, and funny Jackie all hanging out and talking was the main highlight for me. I found Candy simply endearing, and the characters were all comfortable together (like Joe nonchalantly putting his arm over Jackie) and it made it an effortless watch.From reading some IMDb reviews about this, it seems that a lot of the stuff went over my head in this movie, as I rarely picked up on of the undercurrents of deeper meanings. Nothing really clicked, it wasn't that I didn't get it, I mean mostly it was people standing around and talking, what's the \"meaning\" towards that? The scenes of ambient design were the films main flaw. Too much of nothing, I know this is underground art house stuff, but seeing long shots of people sleeping, simply staring, or stretches of no plot or dialog is extremely hard to sit through for me. If I want art, I'll watch Argento or David Lynch. The \"art\" here was curiously out of my grasp. More just like a flimsy documentary (as maybe that's what it really is). So investment in visual design is out of luck for me. Still, the movie has a compelling current about it.From the plot I picked up, it's basically Joe trying to make 200 dollars to save up for his girlfriend's lesbian lover's abortion. We get to see him wake up and then the film ends with him sleeping. So basically a day in the life of Joe, the hustler and the people he encounters.As expected with a Morrissey/Warhol/Dallesendro production, I expected nudity and got it. The movie loves Joe's body, but from my perspective, the male and female nudity was somewhatclinical to make it fully erotic. Usually full frontal nudity will make people uncomfortable for some reason, but I watched this with 3 teens and none of them were annoyed by it, signs of a good approach or self confident teens? Some people will write this off as art house porn, but there's something about it that wasn't raunchy like most porn's tend to be. It didn't come off as art either. So I'm not sure what I would label this as. Is it simply underground or experimental film making? I first discovered Warhol at the age of 13, were I watched Mary Harron's \"I Shot Andy Warhol\", the movie was a pure gem, and quite authentic, from the research I did about the factory. I'd prefer watching that movie countless times then the actually Warhol deals. All these movies are somewhat forgettable, but that's' just my opinion. Obviously this will appeal to the real purists (who probably were aghast when reading my preference to Warhol) and not for someone born right before Warhol passed away. Still, I gave it a chance and still found it quite original in places.Praise must go to Candy Darling. She had me sold, she seemed so nice and warm, a easy going person, and it's a shame she passed away. She was simply awesome! I also found Joe's performance quite interesting, he seemed naive, sardonic, and withdrawn all at the same time, his facial acting really told me what he was thinking (or not thinking) all the time.The movie didn't change my world, and definitely is more Morrissey's work then Warhol. So take it in stride and see if you like it. On to Heat and Trash I go.","The first film in the Paul Morrissey trilogy, Flesh, tells the story of a male hustler Joe who lives with his lesbian wife Geri. Joe also has a son, whom we see Joe feeding a muffin to very early on in the film. Geri, in the opening scenes of the film, forces Joe out onto the streets so that he can obtain money to pay for her girlfriend's abortion. The film details the various deformed, twisted, perverted, and addicted people that he is forced to deal with (and sleep with) on a daily basis. In the end, Joe is left feeling drained, warped, and vulnerable to every perversion, and the audience is forced to confront the provocative nature of what it is truly like to be comfortable and happy in one's own flesh.This film is a revelation, and I think it's one of the best and most emotionally raw films of the 60s. It has nothing to do with the quality of the film itself, but rather the imagery it summons and the way it presents itself. This is not a good quality film for those who are just looking for a film to watch. This is the sort of film that you need to allow yourself to be emotionally invested in before you make any calls on what it is. To be frank, it's very tough to describe what the film is exactly. It's a very unorthodox film. As a matter of fact, the subject matter of the film, the camera-work, the performances, and the dialogue in this film are all very unorthodox. This film wasn't intended to exactly be viewed as a film, but rather to bring about a world that the audience can witness and get involved with in an emotional sense. I thought that, despite the crap quality, Morrissey was seriously onto something here. As a film, it obviously isn't that good, but as an exploration of sexuality and of emotional disconnection, it's a serious pleasure to watch. It is funny, unusual, sad, and incredibly sweet. It's probably the most erotic film about hustling I have seen, as well as the most tastefully innocent.I have neglected to highlight what helps the film really come together. That is Joe Dallesandro. This man has a body unlike anything I have ever seen, and a face of completely unpardonable beauty. What makes this film so deeply frightening in a way is his naive and gentle nature, and as a result we don't feel any internal fear from looking at the images but rather a sense of helpless fear. When you watch the film it becomes more and more clear that Joe has lost whatever wisdom and whatever ideas of security he has, and yet he has changed as a man because of it. If anything it has allowed him to revert to a state of abused self-confidence that really make what happens to him over the course of the film a lot more interesting. Joe Dallesandro is naked throughout about 80% of the film, but this obviously isn't done to titillate or to be shocking or risqué, but rather for the viewer to drop whatever preconceptions they have about seeing the male body and just accept it as part of the character's personal self doubts being put out and left in the open. The viewer no longer feels like a voyeur, and instead feels closer to the subject of the film. This is one of the least brave things that the film does, and yet when it ends it is the one thing that I thought about the most. This film likely has more male nudity in it than any other film ever made, and yet it's impossible to feel dirty or perverted as a result. Instead, we feel rather taken aback by the style and editing of the film(or the lack thereof), which is strictly amateur and impossibly inept. This is how we come into the film, and it is because of Joe Dallesandro that we leave the picture feeling that we didn't just watch what was merely a film made by a bunch of yuppies, nerds, and junkies.Ultimately, the film is definitely not for everyone. It will be impossible for some folks to accept the fact that the film is as poor quality and as badly made as it is. It will also be impossible for many folks to appreciate the fact that someone as seemingly sweet as Joe Dallesandro is so fearless and so ready and eager to completely put himself into constant vulnerable positions, both emotionally and physically. Flesh is STRICTLY for people who have a desire to be emotionally and visually involved in a film that digs into the darker and more repulsive aspects of the streets of New York, and refuses to place any sort of judgment. Forget that the film is about a miserable man who prefers to use himself endless to further add to the desecration of the lives of the people around him and concentrate on the humorous, horrible, and varied imagery. This film doesn't have much to say, but damn does it leave you feeling raw. Very few films have this much honesty in their imagery, and even fewer of them are nonjudgmental."],"review-user":["czar-10","JMann","Mattydee74","desperateliving","Marek-2","leandros","jaibo","RobertF87","raymond-15","Bunuel1976","bastard_wisher","Dragoneyed363","sol-","nycruise-1","bettycjung","barriew","tonlo-1","jazza923","gridoon","JAGUAR-5","Polaris_DiB","Dellamorte_Dellamore07","tonymurphylee"],"review-date":["12 October 2000","25 June 2000","27 May 2001","3 January 2005","30 November 1998","26 April 2004","9 February 2009","29 March 2006","6 June 2005","6 September 2007","17 February 2006","13 June 2010","27 February 2016","27 November 2006","25 April 2018","24 April 2014","3 March 2014","11 March 2010","13 December 2001","1 April 1999","5 November 2009","10 April 2008","3 October 2010"],"review-rating":["8","10","9","6","10","6","7","4","7","8","2","8","9","6","4","2","6","5"],"review-title":[" Lots of Flesh in Flesh.\n"," the passive object of desire\n"," The lost art of joe dallesando\n"," 10/10\n"," Flesh... the First of the Warhol/Morissey/Dallesandro Trilogy\n"," lots of flesh, lots of fun for the crew\n"," what a commodity of flesh is man\n"," Cult Classic\n"," A refreshingly different approach to film-making\n"," FLESH (Paul Morrissey, 1968) **\n"," 75% brilliant, 25% tedious\n"," The artform that is Joe Dallesandro's body\n"," True to its title\n"," Art for Andy's sake\n"," Not so great, 50 years later\n"," Where did those 20 minutes go?\n"," Might not be for everyone, but for Warhol or Joe fan's it's perfect!\n"," Flesh (1968)\n"," Well...it's a curio.\n"," Paul Morrissey basically saved Andy Warhol productions form 24 hours of boredom on film!\n"," Cheap shots, rich material\n"," Perhps only for purists?\n"," Raw, funny, moving, and rather sweet film for those who are cinematically adventurous\n"]}