{"review-url":["http://www.imdb.com/title/tt0070742/reviews"],"review-text":["The other reviews for \"The Stranger\" were all very negative. Well, for some reason, I didn't hate this one and enjoyed watching it. Am I saying it was great? Nah...but it's worth seeing.The story is a bit like the movie \"Journey to the Far Side of the Sun\" combined with \"1984\" and was intended as a pilot for a potential series. Back during the run of the \"ABC Movie of the Week\" it wasn't uncommon for the network to show pilots--either to see if the public liked them or to recoup their losses when they knew they weren't going to do the series. This one ultimately was not bought by the network--which was usually the case for these films. One exception that comes off the top of my head was the \"Nightstalker\" series...and I am sure a few more were first shown here and then became TV shows. Considering others didn't seem to like it, I guess the network did well by not approving the series!An astronaut (Glenn Corbett) is in space one moment and the next he wakes up in a hospital. This was pretty sloppy and showed that the budget wasn't very high for this project. Anyway, the hospital folks are trying to act like everything is normal but they are actually watching him closely, as they know he's an alien and comes from a planet called 'Earth'. These Terrans look like humans and act much like them but they also live in a parallel world that isn't quite the same. The biggest difference is that the government is very repressive and their way of dealing with problems is violent and nasty...and after he escapes (?) they pull out all the stops to kill him. Can the astronaut manage to survive and even get help from these Terrans?Okay...there were a few plot problems I mentioned above. Additionally, Corbett didn't have the best screen presence I've ever seen. But the story is interesting and kept me watching. In fact, I might have enjoyed a TV series like this one.","This movie takes the plot behind the sci-fi flick \"Doppelganger\" (an astronaut from our Earth crashing on a 'counter-Earth' on the opposite side of the Sun, and the Cold War totalitarian vibes on that world) and tries to turn it into a pilot for a TV series. However, the whole thing sank without a trace, and TV is probably better off for it.Everyone here is perfectly adequate in a 'made for TV' way. Cameron Mitchell turns in his usual solid performance. So does Glenn Corbett (who seems to be a kind of poor man's John Saxon) who plays the rugged individualist whose very existence poses a threat to the foundation of the 'World Order' on counter Earth.But the low budget and low energy and inconsistent script and the lack of any real imagination in the set designs and cinematography keep this Sci-Fi adventure firmly tethered on the launch pad.I'll give one example: in the original template for this pilot, (\"Doppleganger\"), the astronauts lose control of their landing vehicle in a thunderstorm, and crash their ship in a truly appalling sequence (it was obvious that their ship was never going to fly again). Then the two astronauts stagger helplessly from the smoking remains of their vehicle in the middle of howling rains and winds, only to be smacked down and overcome by faceless men yelling through loudspeakers.In \"Stranded in Space\", the astronauts are sitting in their seats when buzzers sound, things start shaking, and the camera blurs into a blackout (and as a friend pointed out, it was pretty obvious that the actors were simply shaking themselves on their seats, the director wasn't even shaking the camera or the set). I've seen episodes of \"The Twilight Zone\" and \"The Outer Limits\" that took more effort to establish mood and setting than this made-for-TV mediocrity.And that, in essence, is what's wrong with \"Stranded In Space\". No budget, no time, no imagination...just making the token gestures and hoping the sci-fi Fan Boys' imagination and enthusiasm will fill in the rest. Sorry, guys, it didn't work. I'm sure that everyone here just finished their work on this one and walked away, and never thought of it again, except as a listing on their C.V. And that's what you, the viewer will do. You'll remember, if pressed, that you once watched a TV movie called \"Stranded In Space\", but it made no lasting impression on you, and you can't recall too much about it.","Typical ABC Movie-of-The-Week circa 1973 when some cheesy and some interesting Sci Fi films were produced rather prolifically. They are still way better than the crap that Sci-Fi Channel makes seemingly weekly for \"Premieres\".This one was more or less a rip-off/remake of the much better Journey to The Far Side of The Sun(1969) which was made in England and Europe by Gerry Anderson. That film benefited from incredible FX work from Derek Meddings, a great score from Barry Gray and a good cast and had a haunting ending.The Stranger doesn't have any of that. The plot-an astronaut Glenn Corbett-blown up in space-finds himself on a parallel earth, we learn it is called Terra(one assumes the play on the word \"terror\" as well as Terra meaning Earth) with three moons. He wakes up-a prisoner in what turns out is a mental hospital-to a very paranoid and not-giving-much-info hospital staff. Managing to escape he finds out he's on this creepy, alternate version of earth but ruled by a totalitarian government called The Perfect Order and is pursued by Cameron Mitchell, a ruthless agent of the secret police for this government. The agents drive around in ominous looking Plymouths(that do not sound like Earth cars) and wear these strange knit jackets with wide lapels and they've cautioned everyone that a dangerous mental patient has escaped and that he must be found. Our astronaut manages to evade capture by dressing like the inhabitants-who dress unfashionably drab sort of like old 60's Communist Russia. When he starts asking questions-such as a scene in a bookstore when he asks \"What came before the Perfect Order?\" suspicion is aroused and up pops Mitchell and his thugs who threaten the already paranoid citizens with \"Ward E\" a sinister mental asylum. They'll do anything to cooperate and earn \"citizen points\" rather than face the ominous Ward E so Corbett is off again in The Fugitive-style escapes. The evils of Ward E are illustrated when another administrator (Tim O' Connor) confides to Mitchell that he wonders if this visitor has something to say and maybe this \"Perfect Order\" is wrong. Later we see him sitting in the middle of a weird surrealistic room, in hospital clothing, completely docile and vegetative and Mitchell warns him over his shoulder how he has paid the price for doubting. Meanwhile our astronaut befriends a young doctor(Sharon Acker) who not only believes his story of coming from-and wanting to go back to-another earth-but seems to have feelings for him. Eventually she is captured and hooks up with him later saying she escaped. He wants to use this society's slightly better space technology (which is hinted at, by Perfect Order elders that they'll eventually use to invade Earth) to escape this madness. When they get to the launch facility, she implores him not to go(he's already put on a space suit) and in the struggle, she reveals she was in fact taken for \"treatments\" at Ward E and has been brainwashed to lead him back to the authorities. He sets off an alarm which incapacitates Acker(revealing the nature of the Ward E treatments)who crumbles, grasping her head and he attempts to get aboard the spaceship. She's recaptured and the last we see is Mitchell telling her she's failed and it's back to Ward E-forever-as she screams. The launch fails and he winds up, staring wistfully at the three moons, all set up for a TV series that never happened.The biggest thing this film had working against it was lack of a budget. The FX are non-existent, space stuff is all stock and a shot of the Terra launch facility simply looks like Cape Kennedy/Vandenberg AFB footage at night. The three moons are nothing more than three balls just hung on string in front of a star field-very cheesy. It has the claustrophobic-shot-in-an-old-office building feel that many of those Made-for-TV'ers suffered from. Also, everything seems very convenient. He appears to have escaped into a regular New England-looking back lot town-that seems very near the space facility. It has a creepy moment when he takes the scarf off Sharon Acker's head to see her temple areas disfigured horribly from shock treatments, though I saw this coming a mile away, the fact she shows up inexplicably and with a head scarf on.It was a film, very much of it's time that Gerry Anderson did much better earlier, but downplayed the political angle of it.","I actually had seen the last parts of this movie when I was a child. Thanks to the search feature of plots I was able to find out the name of it. For years I did not know the name, but the movie stuck in my mind. The ending left hope that the main character would get back to Earth eventually. It was a shame it did not make it to a series. This movie reminds me of Journey to The Far Side Of the Sun. Also known as Doppleganger. If you liked this feature the other one is worth a watch. It was done before The Stranger, but shares a similar plot. Yet different. I just picked up The Stranger off of eBay on VHS. Hope they make a DVD, but it is doubtful unless it comes out on Dollar DVD. A few pilots are making it on the budget DVD's and maybe this one will.","Stranded in Space (1972) MST3K version - a very not good TV movie pilot, for a never to be made series, in which an astronaut finds himself trapped on Earth's evil twin. Having a planet of identical size and mass orbiting in the same plane as the earth, but on the opposite side of the sun, is a well worn SF chestnut - the idea is over 2,000 years old, having been invented by the Ancient Greeks. In this version the Counter World is run as an Orwellian 'perfect' society. Where, for totally inexplicable reasons, everyone speaks English and drives late model American cars. After escaping from his prisonlike hospital, the disruptive Earthian is chased around Not Southern California by TV and bad movie stalwart Cameron Mitchell who, like his minions, wears double breasted suits and black polo neck jumpers - a stylishly evil combination which I fully intend to adopt if ever I become a totalitarian overlord. Our hero escapes several times before ending up gazing at the alien world's three moons and wondering aloud if he will ever get home - thus setting up one of those Man Alone in a Hostile World Making a new Friend Each Week but Moving on at the End of Every Episode shows so beloved of the industry in the 70s and 80s ('The Fugitive', 'The Incredible Hulk', 'The Littlest Hobo' etc.) The curiously weirdest bit though was the title sequence. Somewhere between 'Stranded in Space' first airing (under the title 'The Stranger') in 1972 and the MST3K version in 1991 it somehow acquired some footage from the 1983 movie 'Prisoners of the Lost Universe'. So in 1991 the opening credits for 'Stranded in Space' run under a few shots of three people falling into a matter transmitter and vanishing. It's a sequence that has nothing to do - even thematically - with anything that is going to follow.Just to add to the nerdy B movie confusion, one of the actors in this nailed on footage, Kay Lenz, later appeared in a 1994 movie called 'Trapped in Space'. Knowing this fact could never save your life but it might score you very big points and admiring looks from fellow trash movie enthusiasts - if you could ever work out a way of manoeuvring the conversation round to the point where you could casually slip it in without looking like a total idiot...","I suppose it depends on when one actually sees the movie for the first time that their impression is formed the way it is.I saw it as a child on TV back in 1973, when it was \"The Stranger\" and I loved it. Such was the time when the space program to the moon was a reality, when shows like \"Search\", \"UFO\", and \"6M$ Man\" were showing a child of 12 of what the world could hold in their future. Adventure and technology.You got to see shows only once and that was when the network aired them. The only way people could slash your shows was by making their own parody of it; they didn't get to take your show and add in their own comments over it.I did not know what this concept of a \"pilot\" was. I saw the movie and was hoping thru out that Stryker would get home; did not know that there was a possibility of it continuing beyond two hours.Back then, would I understood what so many people hate about the movie now? I doubt it because I don't remember it as such. Do I understand now? Not really for to understand the story, one must not see it from their perspective but rather from that of the characters in the movie.If one is watching as an American, it might be humorous about the lack of security in a police state.....but if one is a subject in that state, then compliance could be expected and security can be less. When things are suppose to be perfect, perfect to an extreme degree, perfect that one is not suppose to doubt, then one is not likely to question as quickly when things are out of order.The subplots of the movie are interesting such as the old man who remembers the time before but watches his words since he suspects that there are spies everywhere. Or that the police state values knowledge to some extent for they are careful about how they control or harm their brain power.These days, one is likely to know exactly what the movie is about before they see it, so much of the suspense, surprise is lost. But the duet between the astronaut and his doctor at the beginning of the movie is a perfect exchange if one considers that this movie was made well into the Cold War and the astronaut's biggest fear is that he has crashed in the USSR. One gets quite a distance into the movie before it becomes apparent that such a possibility is the least of his concerns.This is the primary difference between \"The Stranger\" and \"Doppelganger\". The latter can be considered timeless since any comments it has about the USSR are comparatively minor and lost early on in the movie. In the former, those links are through out the movie, supposedly directly in the beginning and then as a theme variation after wards.All that said, despite my fond memory for the movie, it is rather easy to see that it would not have made it as a series. Each week, Stryker would make friends, Benedict would chase, Stryker would get away. Eventually, Benedict's society would get rid of him. Someone else would pick up the chase. A rut would develop. There might be a jab at something new such as perhaps another crew member from Stryker's mission showing up, but it probably would not be enough to keep the show going.If one goes in with the knives that others have used to slash the movie, odds are they will slash it as well. But if one remembers that this was made during the Cold War and what fears and estimations of the other side were during that time, of what the popular environment contained for the viewer, then they may find some entertaining and intellectual themes in it.","A malfunction in space sends astronaut Neil Stryker (Glenn Corbett) off course and headed to something of a parallel world, called Terra, circling the sun exactly opposite Earth. As a being from space would pose a threat to this world's order, Stryker is held until a determination can be made as to exactly what to do with him. Stryker, however, gets suspicious of his surroundings and escapes. With the help of a sympathetic nurse and a old scientist who opposes the government, Stryker will try to board a spaceship and head back to Earth.Stranded in Space (or The Stranger if you prefer) is another of those 70s made-for-TV movies that was to be turned into a regular, weekly show. In this case, it's easy to see why it didn't make it. First off, there's nothing new about the show's set-up. It was undoubtedly designed to follow the same formula used by The Fugitive or The Incredible Hulk or Planet of the Apes. You know, a stranger constantly on the move going from one town to the next taking whatever odd job he can all the while being pursued by a government agency or newspaper reporter. It's a formula that's been done to death. The second strike against Stranded in Space is its lead, Glenn Corbett. Could this guy come across any less likable? I was rooting for him to get caught. Without sympathy for the main character, this kind of show would never work. Finally, this is supposed to be science fiction. Just because everyone is left-handed and someone has hung three fake looking moons on the horizon I'm supposed to jump to the conclusion that this is some distant planet? So it's a mere coincidence that they all speak English, dress just like people on Earth, and drive Plymouth Furies? Yeah, right.The lone highlight for me was the inclusion of Cameron Mitchell in the cast. Sure, it's difficult to watch him in something this dreadful, but you know the old saying - any Cameron is better than no Cameron (yeah, I've never heard it either).As with a lot of these 70s made-for-TV movies, I watched Stranded in Space courtesy of Mystery Science Theater 3000. I wouldn't call it a great episode by any stretch of the imagination, but there are a few good jokes along the way. So in the end, while I rate the movie a 2/10, it gets a 3/5 on my MST3K rating scale.","Remake of the much better produced theatrical film JOURNEY TO THE FAR SIDE OF THE SUN from 1969 (available on DVD) about an astronaut who lands on a twin Earth on the other side of the sun.  This TV film has a good B-film cast including such sci-fi buff favorites as Cameron Mitchell (FLIGHT TO MARS available on DVD), Lew Ayres (1971 TV film EARTH II as well as Dr. Kildare in a series of films from the forties), Dean Jagger (X THE UNKNOWN available on DVD), and Sally Field's mom, Margaret Field (MAN FROM PLANET X available on DVD) to name just a few.  Credits go out to the casting but isn't as fun as any of the other films mentioned and tries to start a TV series in the vein of 60's TV show THE INVADERS.  By the way if you liked THE INVADERS, star Roy Thinnes is the star of JOURNEY TO THE FAR SIDE OF THE SUN.  THE STRANGER is more for sci-fi buffs than sci-fi fans.","An excellent example of what happens when one central body controls everyone.  I liked this movie because Glenn Corbett also appeared in Star Trek as Zeffrem Cochrane in 1967.  I also liked it because I am a fan of the apollo space program.","I watched this pilot movie for a television show that never came to be on the riff show, Mystery Science Theater 3000. Apparently, it too received the same treatment as such other MST3K classic episodes Pod People and Cave Dwellers where we get a title sequence that comes from an entirely different film all together before being treated to the actual film. It is a rather misleading tactic and one has to wonder why they do it. In Pod People, the film they show actually looks like it might be better and more horrific than the one we get. In Cave Dwellers, the film they show looks more serious and older than the one we get. Here, we get a super science fiction looking show and what we get starts out somewhat promising and then kind of falters by really going nowhere all that special. From this film, it looks like the show was going to be a take on an earlier show, The Fugitive with a few science fiction elements, but not all that many considering it takes place on another planet. Basically, nearly everything thing is the same on this planet our hero finds himself on right down to the cars! The story has three astronauts experiencing some trouble in space. One of them ends up in a hospital where there is something not quite right. Turns out, that he is not on Earth, but another planet where some sort of oppressive government which at first is trying to get information from the astronaut, but then switches to wanting to kill him because he may pose a threat to their 'perfect' society. He goes on the run and gets the aid of a nurse and a man who happens to help with the space program, but has disdain for the order so he and the astronaut devise a plan that may get him off the planet.This made for an interesting episode of MST3K. Honestly, during the first section of film I was actually more interested in what was happening in the movie than their riffs as it played out rather good...at first. Then it never goes anywhere and just becomes \"The Fugitive\" only with the very light science fiction elements. Thankfully, their riffs were good when the story was going stale so it made for an entertaining episode of the show. I liked how they kept trying to get up and leave when the movie looked as if it were going off due to commercial.So, it was not a totally bad film, but it just needed more. It was interesting up to a point and then it just became kind of a mess. It becomes guy on run and bad guys closing in and then guy finds a way to slip passed them. Pretty sure this one would not have lasted for too many seasons because there is only so much you can do with the premise. The government pretty much had a lot of people under its influence so it would have started becoming unbelievable say he had kept running into people who just happen to hate the order. So, probably for the best it was just a one episode wonder, the main bad thing about it though is no closure.","I can concur with the comments that production values were poor, but I still believe it would have been interesting as a variation on \"The Fugitive\". I can also see where it would not be believable for him to ever get home, since his best and only chance to get onto a spacecraft was in the pilot. Every Terran spaceport would be alert to him after this. Also, being on their toes, the Perfect Order would have been steadily improving their chances of catching Neil by imprinting his face in every mind. Now, that said, it could have been interesting if Neil discovered a totally different thing going on: the steady erosion and breakdown of the Perfect Order - a growing dissidence that the Order cannot deal with. The suspense would be: what happens first? Neil is caught, Ward E'd and killed, or the dissidence becomes organized and he's in the dilemma of staying out of it or helping it.The movie would have been helped if there were clues that the history of the planet was identical to Earth up to the time of WW2, explaining the similar technology, and if most of the cars seen were less popular and more unusual models, seen so often that they seem to be the preferred models. The three moons should have had some texture, some cratering and maria, and shifted position from night to night, so that at the end of the movie, one is missing and the other two are further apart. Also, there should have been at least a few \"northpaws\" - in a society that views right-handedness as being as sinister as our society used to regard left-handedness. (Maybe in Ward E, they fix people who are right-handed. Now, what if Bettina was right-handed but they let her pass, then they fixed her while doing the other conditioning, and Dylan wondered about it when she reappeared.)I noticed that all the guards - the rank and file - seemed to be \"old guys\" - in their mid to late 40s or early 50s - and thus old enough to remember pre-Perfect Order conditions. They look older than Benedict and Dr. Revere, so it looks like they cast guys happy for the work, not because they looked like young, well-educated supporters of the system.But I liked the touch of authoritarianism, and the perverse fact that it had solved poverty, crime and disease, but was ruthless against \"thoughtcrime\" (a \"1984\" term) that could cause such problems.","The storyline of \"The Stranger\" mirrors somewhat the 1969 film \"Journey to the Far Side of the Sun\" (made by Gerry & Sylvia Anderson of 'Thunderbirds' and 'Space: 1999' fame). A parallel-universe Earth is the premise of both films. But there is a difference. Where the world in \"The Stranger\" features a totalitarian regime out to squash the freedom of the citizenry, \"Journey to the Far Side of the Sun\" merely showed a true mirror world where handwriting, roads, houses, machinery of every kind, and of course internal organs were all in reverse (or mirrored) order. So, the similarity of parallel Earths is the only connection of both films.Similarly, the TV series \"Land of the Giants\" came before both of those films, having run from 1968 to 1970. It featured a world that was nearly parallel to the Earth with the exception that the planet was populated by giants 12 times the size of the humans who crash-landed there. The idea of a totalitarian government out to capture and contain the 'little people' was similar to the premise of \"The Stranger\" more-so than the premise of \"JTTFSOTS\". Perhaps because of the similarly to \"LOTG\", a series to \"The Stranger\" was shelved. Had it turned into a TV series it would have been a sci-fi version of \"The Fugitive,\" with star Glenn Corbett being chased by the baddies from week to week, hiding out in different locations, etc. BTW, a stronger script could have helped this film along.","The whole plot goes like this: An astronaut gets caught in a freak accident and lands up on some alternate earth where a Big Brother type government rules everything and controls everyone. The government, known as the Perfect Order, sends anyone who steps out of line to a place called Ward E, where they are treated pretty badly. Bad acting, predictable plotline and little to endear you to the cast makes this one a turkey.1984 does the same thing, only a lot better.","HERE WE GO... Featuring several actors from an amazing array of b-movies and made-for-tv flics, this turkey might appeal to the die-hard fan of velveeta cheese, spam and/or atari 2600, but not to the masses (except perhaps those watching a uhf channel at 3 in the morning after a binge at the local pub).  Seemingly a failed pilot for a pre-doomed series, the only thing going for this movie is the sheer ability to crack jokes about the plot.  Come on...An astronaut, adrift in space, wakes up to find himself in a hospital bed surrounded by slightly-paranoid medical staff.  Later he finds out (through the silliest of methods) that he's actually on a twin planet to earth (on the other side of the sun where we can never see).  He wanders off (actually, it's supposed to be an escape, but my grandmother's escape from the nursing home would be more exciting to watch, not to mention more challenging), and the government wants him back (of course), to pry from him certain details (I won't spoil it).  Later we find out that their space technology is slightly better than ours, as he manages to steal a shuttle for the trip back home (anyone doped up on sleeping pills could have been more sneaky, and why would they have to pry in the first place.  Didn't they get his ship too?).  And to top it all off, he crashes into the ocean, only to find himself....(sorry, not allowed to spoil it.  Too bad, because the truly pathetic\"twist, climax,\" whatever you'd prefer to call it, proves just how much of a groaner this film is). the end.And thank heaven they didn't make the series!   Great flick for drunkenbouts, cheese-fests and late-night viewing, but nothing I'd want to suffer through again.I can't even believe I went on about this turkey for more than a few sentences.Watch it on one of those mondo, make it funny shows late at night, but please don't watch it alone.  'Tis not proper to be a closet cheese-aholic!","I HATE this movie.It is the WORST of everything: acting, writing, made-for-TV-movies, sci-fi, and the 70's.The actors are completely WRONG and they all appear to need more fiber in their diet. The CARS in this movie make me want to shoot myself in the mouth- gas-guzzling dinosaurs that just happen to look like cars here on Earth. (Good thing Terra's auto industry is precisely the same as ours.) And a word here on the \"planet\": there was not a single visual to differentiate Terra from Earth. Nothing. If it wasn't for Joel & the bots I would have made a list of everyone involved with this disaster and hunted them for sport.No budget, no energy, no effort.No wonder.GRADE: F","This as a TV movie of the week held was really not bad. How bad can it be with Lew Ayers? Glenn Corbett, Star Trek's TOS Zefrem Cochran, makes a good leading man. Sharon Archer is appealing as well. Cameron Mitchel make a great bad guy. The problem is that you can not see how this would make an interesting weekly TV show. Such a show would be set in a make believe police state that does not seem to have much of an philosophy. There are only two people out there to help him. And he does not want to end the police state. He just wants to get home. He does not seem to have any compassion for the people with the exception of Sharon Archer.","Cameron, Cameron, Cameron. Here is yet another example of the spiral downward of your career, which ended with the fantastic horror that is Space Mutiny. Here you play an overacting chief of a quasi-Nazi state on a parallel Earth. This made for t.v. movie(which is simply the pilot shows of a never got made t.v. show-gee, I wonder why this one never went into production?)highlights your mediocre acting skills perfectly.The plot, such as it is, is that some astronauts from Earth crash land on an identical world that circles the sun parallel to ours. The other two astronauts are killed, and the 'perfect order' that runs the world in a 1984-esque fashion tries to find out all the info they can from the remaining astronaut, Neal Stryker. He escapes from the special hospital where he's being kept so easily that it made you wonder if all the hospital staff had been lobotomized or something. Then he wanders around trying to find out where he is and what happened, nearly giving himself away over and over again. One of the things that almost gets him is that everyone on the planet is left-handed(the opposite of Earth, nudge nudge, wink, wink). He meets up with a female doctor who already betrayed him in the hospital, and forces her to take him to a weird old guy who thinks his pigs are spies for the Perfect Order. Now that's a quality guerrilla fighter, to be sure. This old guy tries to help him steal a spaceship so that he can get back to Earth, but for some strange reason the plan doesn't work. Can't imagine why not, really, especially since their most dangerous enemy is Cameron Mitchell. It should have been a cake walk. At the end of the pilot...errr...movie, Stryker is stranded on the planet with nowhere to go. Much like the t.v. series itself, in my opinion."],"review-user":["MartinHafer","lemon_magic","zillabob","davros5-1","junk-monkey","Rosettes","bensonmum2","SanDiego","bcran","Aaron1375","gbcapp","ddc300","icehole4","dubnut","Bolesroor","doctardis","Oosterhartbabe"],"review-date":["15 October 2016","10 September 2005","19 March 2007","10 October 2005","22 September 2009","11 September 2009","10 May 2009","6 March 2004","17 August 2000","7 August 2016","20 July 2014","22 November 2007","5 February 2003","1 December 1998","31 March 2009","28 December 2011","30 January 2006"],"review-rating":["6","3","6","8","2","8","2","7","3","5","4","7","2"],"review-title":[" An Orwellian reworking of \"Journey to the Far Side of the Sun\" that isn't as bad (to me) as the other reviews would indicate.\n"," Hackwork TV remake of \"Doppelganger\" with none of the pathos or drama (or budget)\n"," Of it's time...\n"," Good effort, shame it did not make a series\n"," Earth's Evil Twin\n"," It is not a timeless classic, but it was made in a certain moment\n"," It's not hard to see why this one didn't make the network lineup\n"," Remake's cast, not plot, is for sci-fi buffs.\n"," A metaphor of state control of our lives\n"," It started off interestingly enough, but never really takes off\n"," Doomed as an imitation, but would've been interesting\n"," Mediocre TV SF flick deserves a second-look\n"," 1984 done badly. **SPOILERS**\n"," HONEST MOVIE REVIEWS--1 TURKEY (OUT OF 5 STARS)\n"," Hell Pilot\n"," Not that bad\n"," Stranded in a Cheesy T.V. Movie\n"]}