{"review-url":["http://www.imdb.com/title/tt0024897/reviews"],"review-text":["Working girl Kitty (Sothern) is engaged to Bill (Kelly), who neglects her by working long hours at his garage in order to save money for their marriage. After being stood up on her birthday, Kitty goes on a double-date/blind date, where she meets department store heir Bob Hartwell (Hamilton). She falls in love, but leaves him when his protestations of love appear to cover a desire for her to be his mistress, rather than his wife. Faithful Bill rallies 'round to comfort her, and at last she gives in to his repeated requests to reinstate their engagement, pressured in part by Bill's support of her family after she loses her job. When Bob returns, however, convinced that he wants marriage after all, will Kitty follow her heart or her conscience? This film was a lot better than I'd expected it to be. The character of Bill at first comes off as the sort of loud comic Irishman type that Jack Carson played so often. But Kelly (and the script) infuse the character with real compassion and love, and Bill turns out to be the best person in the entire group. Viewers may find themselves rooting for him against the feckless Hartwell! The tone of the film wavers, however, between light-hearted romance and a much darker side, especially in the depiction of a dance marathon and a rather horrific accident at Bill's garage.The cast is rounded out by the dependable Jane Darwell as Kitty's mother, an impish but not yet thoroughly obnoxious Mickey Rooney as Kitty's younger brother, and Spencer Charters as Kitty's ne'er-do-well father.","\"Blind Date\" is one of three stories-made-into-movie by author Vida Hurst. Lots of familiar faces in this oldie from 1934. Mickey Rooney as a mouthy little punk. He seems to be in the film for comedic and homey \"family values\". Jane Darwell again plays the strong-willed mother, just as she had in Grapes of Wrath and the Oxbow Incident. Ann Sothern is Kitty, who has been dating Bill (Paul Kelly), but meets up with rich Bob Hartwell, played by Neil Hamilton, who may or may not be better for her. You can certainly tell that this was made at the very beginning of the Hays production code -- at one point, Kitty says she can't be up there alone with him if there isn't anyone else in the house...what a change from just a year or two prior, when anything and everything was OK. Good solid plot, but a whole lot of conversation and mushy love talk. It raises the question over what a girl should be searching for in a man; should she hold out for a man with integrity who treats her nice, or just find a man with big bucks, as most of the movies from the previous 20 years had advocated...? and how do men change when their situation changes ? watch out for some violence in the strange dance marathon scene. TV viewers from the 1960s will recognize Hamilton as Commissioner Gordon from Batman..... Also some weird drama in the off-screen lives for some of the cast in this one --Paul Kelly had gone to jail for being accessory to murder in a love triangle. Mickey Rooney had an affair with Norma Shearer, who was 20 years older; Rooney ended up being married eight times. Tyler Brooke (Emory) and Spencer Charters (Pa) both knocked themselves off in real life. The title \"Blind Date\" has been reused many times, for films, TV series, and even cartoons, but none of them seem to have the same plot as this one.","In a Film In Review article Ann Sothern was very reticent about her early screen work (\"Hold Everything\", \"Whoopee\") - MGM signed her to a contract under her real name of Harriet Lake but she only made one movie for them - \"Doughboys\" (1930) and was then dropped. Columbia signed her to a contract in the mid thirties and she made a series of light hearted programmers with co-stars such as Edmund Lowe and Gene Raymond. Even though Harry Cohn often boasted that by changing Harriet Lake's name to Ann Sothern he had made her a star, Columbia didn't really seem interested in promoting her and it was up to MGM to come up trumps with \"Maisie\".Kitty (Sothern) is the bread winner of her improvident family - as well as keeper of the peace and advice dispenser and she is getting pretty fed up with it. Especially her full of beans boyfriend Bill (I have never seen Paul Kelly so animated before)!! who puts work before romance!! When he stands her up on her birthday she listens to her friend and goes on a blind date where she meets debonair Bob Hartwell (Neil Hamilton). She starts to live the high life when he gets her a job as a model in his department store but when she dismisses his cave man tactics she suddenly finds herself out of a job. Of course the thing is, Bob is completely in the dark about things - his father has sacked her during cutbacks but requests the news be kept from his son. Bob goes on a cruise with his mother, not knowing that Kitty is desperately looking for a job. Bill comes to the rescue with a job for her father and the pressure is now on for Kitty to patch things up with Bill - even though she doesn't love him.Bob comes back but Kitty is determined to stick by Bill - he has been involved in an awful accident at work - courtesy of Kitty's father and a blow torch!!! Flora (Joan Gale), Kitty's sister over hears Kitty and Bob's tearful parting and wants to make it right for them. This is a really nice way to pass an afternoon with the \"little\" actors you get to know if you watch enough old movies. Matinée idol Neil Hamilton, most people know him from the Batman TV show as Commissioner Gordon but he had a huge career starting in the 1920s - he was a D.W. Griffith discovery. Mickey Rooney showed that even during his awkward age there were always roles to be had!!!","A mild but decent low-class soaper, well directed by under-rated B director Roy William Neill -- best remembered, these days, for the Sherlock Holmes series starring Rathbone and Bruce that he directed a decade later. There is a spiffy cast in this piece and they give good performances.It is interesting to compare this Columbia Picture with its Pre-Code contemporaries from the majors and contrast its constant moral tone with the sexier stuff produced by, say, Lubitsch at Paramount. Part of the reason, doubtless, is that a minor studio like Columbia didn't have leverage against the increasingly powerful Production Code that would swamp the sex comedy even at the Majors by the end of the year. But the most of it, I don't doubt, is that the Majors had an eye on the big cities and European markets, while Columbia still was concentrating on the smaller US cities and rural markets.","The story is about a working girl (Ann Sothern) who has a pretty thoughtless boyfriend (Paul Kelly). This boyfriend is so busy trying to start his own business that again and again he forgets dates or shows up late. The final straw is when Sothern has a birthday and Kelly says he's too busy to take her out to celebrate. So, not wanting to just stay home, she goes on a blind date with what turns out to be a very rich young man (Neil Hamilton). Sparks fly but it also becomes apparent after Sothern breaks off her relationship with Kelly that new boyfriend Hamilton is a \"love 'em and leave 'em\" sort of guy. How all this is finally resolved is not too difficult to predict--just suffice to say that in the end everything works out just perfectly.This is a very modest little film from Columbia Pictures--with a relatively small budget as well as second-tier stars. It's clearly a \"B-movie\" despite there being small roles played by a Mickey Rooney and Jane Darwell--as both had yet to become famous. Now this is NOT to say that these are bad actors or the production isn't any good. In fact, given the production values, this is a pretty amazing film as everything seems to work so well despite having a pretty ordinary and somewhat predictable plot outline. That's because the actors and director did a really good job putting the story across. Plus the writers did a good job of humanizing the characters and making you care about them. The ending, in particular, is really sweet and practically had my tear ducts flowing! Because of these factors, the film earns a 7 of 10.","This mid 30's back and forth romantic drama has a humorous element. Some times a woman just thinks she knows what she wants. Ann Southern stars a the lovely Miss Kitty, that gets torn between two lovers. She off and on goes out with mechanic Bill Lowery(Paul Kelly); the problem with Bill is he loves his job too much. Actually it is the chance at making money that he places above all else; and that means standing up Kitty on the night of her birthday. She accepts a blind date with a considerably older wealthy clothing store owner Bob Hartwell(Neil Hamilton). Hartwell plies her with fancy clothes and even a job at his store. He even buys Bill's wrecker service/mechanic shop. When Kitty feels beholden to her first love, Bill; and wants to try over again with him, he breaks the relationship off. Now, what is a girl to do? Roy William Neil directs this 71 minute mini-soap opera. Veteran actress Jane Darwell plays Kitty's mother aptly. Other players rounding out the cast: Geneva Mitchell, Joan Gale, Spencer Charters and a young, but still growing Mickey Rooney.","This was a strange movie, but I did enjoy it. My Tivo billed it as a comedy, but there were some quite dramatic elements, too. (Most notably, the car falling on Bill.) I thought I had this movie figured out (Kitty would do the right thing and marry Bill and then realize that he was really the one she loved all along).I really liked the twists thrown in at the end. (Bob buying Bill's shop to give Bill and Kitty money and then Bill being a jerk in order to reveal Kitty's true feelings.) However, all of it kind of fell flat for me. Ann Sothern didn't have chemistry with either of her leading men. I just couldn't believe that she would date (let alone consider marrying) either one of them. One reason I love classic movies is seeing the fashion and cars of days gone by. Blind Date did not disappoint in this regard. Sothern's dresses were all quite stunning, although a bit fancy for a working girl (specifically the dresses worn before she met Bob). While I enjoyed this movie, it would have been much better with some chemistry between the leading lady and her leading men. The script and supporting actors were solid, it was just the leading roles that could have been better cast.","This is a disappointing drama about a hard-working model (Ann Sothern) supporting her lazy family and torn between two men: an honest mechanic (Paul Kelly) who works long hours yet seems to be intent on dominating her once they get married, and a rather lecherous wealthy playboy (Neil Hamilton) whose intentions do not seem at all honorable. The lack of likable characters, with the exception of Sothern and a very young Mickey Rooney as the younger brother who hasn't had the opportunity to become like his parents Jane Darwell and Spencer Charters yet, makes this difficult to tolerate at times. All this family seems to do is bicker over nothing and makes no effort to resolve any conflicts.While this is certainly a good looking film, there isn't enough to recommend it past that. Ann Sothern is certainly a lovely heroine, but even though she had been in films for several years (mainly as a chorus girl), she was still too green in her acting to hold together an entire movie when everything else around her was mediocre. While Kelly tries to add some softer dimensions to his character, he never fully hits the mark. Hamilton seems to be just stuck in the rut of playing less than noble wealthy men, sort of a poor man's Ralph Bellamy who never got the girl even though he used every dirty trick in the book. Sothern would have better luck when she went over to RKO for some frivolous comedies and of course much more success at MGM with the \"Maisie\" series and a string of musical successes."],"review-user":["klg19","ksf-2","kidboots","boblipton","MartinHafer","michaelRokeefe","mountainkath","mark.waltz"],"review-date":["31 May 2007","23 January 2008","23 November 2011","30 May 2007","31 May 2007","14 April 2015","29 January 2009","23 September 2014"],"review-rating":["7","7","8","6","7","7","6","4"],"review-title":[" Triumph of love\n"," black & white oldie love story\n"," Ann Sothern Was a Real Find!!!\n"," Bland Date Movie\n"," A bit predictable and formulaic, but still a lot of fun to watch as well as sweet\n"," Do they really know what they want?\n"," An odd, but enjoyable little movie.\n"," Torn between two losers....\n"]}