{"review-url":["http://www.imdb.com/title/tt0067085/reviews"],"review-text":["You will be able to tell within the first 30 seconds of this film whether you want to finish watching it. The film opens with images of planes landing at an airport, one plane after another diving into a mirage-filled runway. You will be able to accurately guess that this movie is not about a \"story.\" At first viewing, it's even easy to think the opening images are repetitive shots of the same plane. The initial drama is in the acuteness of your perception, which is built on your willingness to experience the film simply as a series of images. If after this opening, you want to see the movie, you will not be bored. You may even be mesmerized. The movie may be an emotional experience; it may be an intellectual experience; it may be both. Judging from the DVD commentary, which is essential, it was primarily an emotional experience for Herzog, and, at one point, he talks explicitly about how the film is a collaboration between filmmaker and viewer. There's plenty of room for the viewer to make of this film exactly what he or she wants to make of it. Take a gamble?","Successful films on metaphysical subjects are rare, but Fata Morgana is a good case.  You can chalk up the large subject to the ambitions of youth, but Herzog does an amazingly good job.  The movie's point is to show human beings, and even the world, from a non-human point of view.The movie is in three parts:  Creation, Paradise, and The Golden Age.  The imagery of each is in counterpoint to the voice-over.  Although the text of `The Creation' (from the Popol Vuh, a Mayan myth) refers to the primordial wasteland, the scene goes no further in illustrating the myth.  It dwells on the waste, and on various specimens of destruction (fire, smoke, wrecked vehicles).  The images from `Paradise' are anything but that, and `The Golden Age' is darkly comic  the highest culture is the strange roadside musical act.The Popol Vuh suggests that mankind is the central object of creation, but the movie does everything it can to undo this notion.  Its mythological framework has no referent in human historical time.  There are no human characters to speak of.  When a boy stands with a dog in an extended shot, the initial suggestion is of the boy's point of view; by the end it is much more the dog's.  Likewise the lizard is a stronger character than the human who introduces it, and the turtle's partner barely looks human with his big flippers.Animal stories and nature documentaries always anthropomorphize, but Fata Morgana has none of that.  Certainly the dunes look like a female body, but the simile cuts both ways.  Presumably only humans can distinguish easily between their creation and nature, and here airplanes and factories are presented alongside mountains, lakes, and waterfalls.  People and civilization are all part of a broader natural landscape.In 1979 Herzog put a new twist on the idea when he remade Nosferatu from the vampire's point of view.","Famed filmmaker Werner Herzog's \"Fata Morgana\" is breathtakingly unorthodox. Although characters appear in the film from time to time, there is no actual story. The film is also not an educational or historical documentary. It's a film without an accompanying screenplay.The film consists of curious background music and a somewhat illogical narrative VO, the combination of which overlays a long string of images from mostly, though not exclusively, the Sahara Desert. Some of the images are wonderfully odd, and out of the ordinary. The camera captures ghostly images, or mirages, optical illusions that tantalize and mesmerize.This general cinematic trend is punctuated by occasional observational asides on serendipitous topics. For example, in one sequence a man wearing goggles gives us a mini-tutorial on lizards. And in what for me was the most captivating and bizarre sequence, a small inset room contains a man with dark goggles who sings in a voice that is totally distorted by the microphone he's using, accompanied by an old lady who plays a punchy tune on an old piano. Neither the man nor the old lady seems to enjoy what they're doing. How baroque.\"Fata Morgana\" does have an underlying concept, one that unites the wide assortment of strange images and eclectic sounds. But that concept is so subtle, so opaque that you'll never figure it out without help. From this subtle theme the film does indeed make sense. Without that point of reference, however, the film can seem tedious and unending, a pointless parade of random earthy images and esoteric narrative gibberish.Unapologetically redundant, thematically baffling, and cinematically heretical, \"Fata Morgana\" will likely either make you swoon with delight, or cause you to throw up. You'll either latch on to the film's Zen-like qualities or be tempted to smash the DVD into a thousand pieces. One thing that most viewers will agree on: \"Fata Morgana\" is ... different.","Inarguably one of the most interesting filmmakers of the last 50 years, Werner Herzog has been pushing the boundaries of cinema perhaps more so than any other commercial filmmaker. I've been acquainted with Herzog for a few decades now and I've never not been impressed by both the man and his work. Last year I went to see Rescue Dawn and was somewhat surprised at how relatively mainstream the film was, yet couldn't help but imagine Herzog taking his actors and crew into the actual jungle to not only make the film, but to live it. No other filmmaker is as crazed about the purity of the film-making process and the subsequent lore from such productions as Fitzcarraldo has been forged into cinematic legend.Today I sat down to Fata Morgana, a 1969 Herzog film that could be described as an allegorical filmic postcard. Without researching the actual locations, I'm assuming it was shot somewhere in Africa, both coastal and desert, a region that could have once been the cradle of infant man, infant civilization, infant life on earth. It is these origins, the biblical notion of the Garden of Eden and the Apocalypse that Herzog is concerned with, as is voiced by the narration dispensed throughout the 79 minute run time.Watching FM I couldn't help but feel I was a passenger on a profound journey. In the opening sequence, the title is translated as \"Mirage\" and Herzog juxtaposes this translation with multiple repetitions of commercial jets landing on an airstrip. These images are perverted, their 3-dimensionality crushed flat by a long lens, piling layers of exhaust, heat waves and light aberrations all on top of one another. The effect left me to conclude: things are not as they seem.FM is divided into 3 very distinct chapters: 1) Creation, 2) Paradise and 3) The Golden Age. Chapter One, opens with countless, languid images, where bleak, barren landscapes scroll by, dead animals rot, broken shells of crashed airplanes and abandoned cars slowly disintegrate in the desert sun. The people populating this inhospitable landscape are ragged, unsmiling and apparent prisoners of the desert. The narration talks of a time before life, a time where the canvas of earth was blank and all that existed were the heavens. While the narration hearkens to a simpler, purer era, a portrait of a young boy holding a fox-like animal by its throat evokes a chilling depiction of man's cruel, ruthless attempt to enforce a dominion over nature.In the next chapter we are introduced to more of the same, yet the images and people are more animated and seem infused with a modicum of life and vitality. We listen to a goggled biologist talk about the difficultly a monitor lizard has hunting for prey in such a lifeless environment. As he holds the squirming monitor, its tongue flicking at flies, he also describes how difficult it to capture these creatures in the searing 140 degree heat. The parallel is duly noted and Herzog continues to explore this concept through repeated, candid portraits of individuals battered by the sun, the desert and the laborious efforts required to exist in this harsh realm. He also pushes forward the theme that if not in control, man asserts his control over his environment and not always in the most pleasant of ways.The last chapter takes us out of the desert's blast furnace and into the more familiar Herzog territory populated by eccentrics and absurd behavior. No one seems to have a more effective symbiotic relationship with the oddballs of the world than Herzog -- possibly this is where he feels most at home. Much like Errol Morris, Herzog chooses to place his camera in as seemingly objective a position as he can before he lets the film roll. The subsequent flirtation Herzog has with his subject is the result of him being able to continue shooting well beyond the point when most directors would have yelled cut. As Morris does, this extended roll pushes past the \"on\" moment the subjects feel obliged to offer and through their discomfort of being pushed into overtime, their facade gives way to something real. The most humorous portrait in this chapter is of the 2 person band playing an odd, polka-like song that Herzog recycles throughout this chapter. The drummer of the band wears the same goggles as the biologist, as does another guy doing a magic trick, begging the question: what's with the goggles? They definitely add some levity to the film, but one has to wonder if they hold any deeper meaning or significance, or is this just another example of Herzog's playfullness.The narration aside, Herzog utilizes folk and blues music as the experimental documentary's soundtrack. Leonard Cohen grabs the most screen time, two of his beautifully melancholic songs \"So Long Marianne\" and \"Suzanne.\" perfectly accompany the scrolling landscapes, adding to the convincing feel that we are truly along for the ride. By the end of the journey, Herzog comes back to one of the many shots that recur throughout the film: the distant framing of a lone vehicle traversing the endless desert engulfed by a water mirage that fills the horizon. Despite the overall bleakness of FM, the crescendo of the film and the mirage motif leave you with a hopeful spirit, belief that against all odds, life will persevere and possibly even flourish.Having finished writing this post, I referenced FM to discover that Herzog shot it in Saharan Cameroon only weeks after a bloody coup. True to his legend, Herzog and his crew were arrested, beaten and imprisoned. While imprisoned, Herzog fell ill with Schistosomiasis, a blood parasite. It's truly hard not to love such a hypnotic and austere film as Fata Morgana; knowing the filmmaker was willing to die to get it made only makes you respect it all the more.http://eattheblinds.blogspot.com/","--- most of Herzog's films are best watched with the commentary. His overpowering germanesque English always 'pumps' up the importance of the events/images of his films. In the DVD commentary of this film Crispin Glover is invited along to give his thoughts also.I am very partial to Herzog's films. That said, I find this one toward the top of his heap. There is a certain 'rawness' to the structure and sequences of this film. I believe that most of it was shot during other projects and pieced from footage that was taken in the Sahara. The early parts of the film are the strongest images, the equivalent of moving paintings, showing care in subtle differences in the landscape. There is an erie science fiction quality to the early part of the film that might even be reminiscent of 'Dune'--- mostly for the desert images.The later part of the film is more about a human interaction with the landscape. These people are not actors but ordinary people that Herzog (i'm sure) told them to stand around acting weird--- or maybe genuinely acting foreign to what we know---- many of the people were being filmed for the first time (he loves sophisticating the natives--- tricking them with his modern equipment--- ---one bit of advice--- don't attempt to watch this if you have distractions around--- you have to be in a quiet mood to sustain watching it--- (even I have a hard time sitting through it)---hence my recommend of watching it with the commentary","Fata Morgana is an absolute masterpiece. It's Werner Herzog's most unconventional film. It doesn't have a plot or story. Instead of a story, we're given a collection of images, words and music that work so wonderfully together. It's not a documentary either. Some of the people in this film are directed and given lines to read. It has some of the most beautiful and haunting images. Herzog shoots real mirages and we see cars and people floating around in the middle of the desert who aren't actually there but hundreds of miles away reflected like in a mirror. The use of music in this movie is so brilliant - from Leonard Cohen, Mozart, and the Third Ear Band. Imagine Stanley Kubrick's 2001: A Space Odyssey in the desert; that's what this movie is like. This film is so hypnotic that it has the ability to make you feel as though your spirit has left your body. A must see. It will change the way you view films. Rating: 10 out of 10.","I saw FATA MORGANA at its US premiere in 1972 and again in 1975. The film remained in my (inexact) memory as possible model or prototype of the \"surreal documentary\", and I think I had recollections of Herzog's long pans and tracking shots in a back chamber of my mind while filming material in the Dolomites that I later combined with manipulated WWI footage in my own audio-visual work GEBIRGSKRIEGSPROJEKT. Having lived in Austria for 17 years and now being fluent in the language of FATA MORGANA's narration, I was eagerly looking forward to re-encountering the film on DVD.Unfortunately, I have to admit that I was rather disappointed. The terms of my reaction are largely defined by Werner Herzog's own commentary on the German DVD. That he wanted to make a documentary as if from the point of view of visitors from another galaxy is a good idea and a commendable ambition, but I think the hypothetical visitors from Andromeda would have arrived with a far more anthropologically organized structure of viewing than what Herzog here presents. It would however be unfair to call the film pretentious: it's just not that well thought out. There are indeed some strong images (not only those of the desert mirages ...) that could have been used effectively as expanding material in a more narratively oriented film, or served as basis for a more \"experimental\" work, such as those of Stan Brakhage (who Herzog professes to admire), but these images are too often weakened by sloppy camera movement or flaccid editing.I found the use of heterogeneous music (Blind Faith, Leonard Cohen, the Kyrie from one of Mozart's masses) arbitrary and unconvincing. Chance-derived juxtapositions are stimulating now and then, but this is no well-thought-out dialectically surreal counterpoint of image and sound that could really cut into the eye and ear.Some sequences in the later part of the film (a foreign aid worker having African children recite \"der Blitzkrieg ist Wahnsinn\", or a scene where German tourists hop up and down in little volcanic craters on Lanzarote) lapse into the ridiculous and unfortunately retrospectively lower the level of what came before.BUT Werner Herzog is a great filmmaker who has in other works made immense contributions to his art. FATA MORGANA may be one of his weaker films, but I suspect it was essential to his development. I'ts a pleasure and a challenge to view and to think about this film.","It would be something to try and tell someone what Fata Morgana is very simply about. Or, maybe it isn't: Herzog goes to the Sahara desert and nearby villages to film assorted landscapes and the locals. But this is just the broadest stroke. It's a feat that you either surrender yourself to, or you don't. He gets into the form of the world around him entirely, without a story, bound only to certain aspects of written poetry, as his camera (shooting on supposedly discarded film stock) wanders like in a pure travelogue. One might even jump to that easy conclusion, as he puts up these immense landscapes, then moving to more rough civilized culture (though not the actual 'normal' culture itself), and to a point levels too abstract to be able to convey properly here. Sometimes it takes a while to get along, close to a purity through the \"creation\" section, but a purity in how parts are manipulated either by nature or by broken-down machines. Soon the narration, readings from the Popol Vuh (who, by the way, does the music for most of his films), with the gradual procession of actually highly stylized shots adds a whole different level to it. It's a hybrid film, and it's not easy, but the rewards are what best comes closest to Herzog's idea of \"ecstatic truth\", images he's been out for his whole career.One wonders if the images end up, by the time the second section, Paradise, leading along the words spoken, or if it's the other way around. You're eyes are moving along with the stills and pans, and the wording is close to being religious writing, but there's also the music choices, how the bizarrely spare singing and low-key classical music goes together with Leonard Cohen and Blind Faith. I think each side ends up complimenting the other, and it's something that still *seems* like it shouldn't work. Perhaps that's the draw to it, the chances taken in going through desolate wastelands and the smallest run sections of any kind of civilized life (in this case the shacks of the desert), that make it so fascinating. If only for the cinematographic sense it's a marvel, too indescribable for the casual photography fan because of molds of technique, and some of the strangest images of any Herzog film. There's pans, there's long-shots, there's hand-held while driving by the towns, there's a bus dozens of miles away that via mirage seems only a couple, there's full-on close-ups of fire and a man holding a reptile and talking about its radar (truly classic gonzo comedy), there's people holding still in fake poses, and a man and woman playing inane music. But, most importantly, it ends up feeling, at least for me, natural for the personal nature of the approach.I'm sure only Herzog would know for certain why he made this film, as opposed to the simple 'how'; he was already filming Even Dwarfs Started Small, and he ended up going through many perils to finish it. Yet this is what makes Fata Morgana such an amazing feat- it will appeal to one depending on what someone brings to it in actually watching it. It's definitely unsettling, but there's the temptation to want to see it again very soon after, just to experience all of the ideas and realities turned abstracted strange vibes (yes, the word 'vibes' applies here). It's one of the truly spectacular \"art-films\" ever made.","Fata Morgana is, by far, one of the weirdest and most perplexing art films I have ever seen. I hesitate to call it a documentary because, while is does have elements of documentation of it's images, the images themselves are so unusual, so hallucinogenic, so unclear, that I wonder whether it was really worth telling this story just so that these images can exist. The film basically is the tale of the earth and the creation of the earth shot from the perspective of an outsider, be it alien or something otherwise indescribable, all taking place in the Sahara desert. The title of the picture relates to the illusion or reflection of images, both real and hallucinated, that people in the desert often witness. These are also known as mirages.The film opens with a plane landing followed by the plane landing again and then again and again and again and again and again and again. With each plane landing shot, the actual architecture of both the location it is landing at and the plane itself begin to slowly dissolve into one another and grow less and less real and more and more reflective imagery. The imagery in this film only grows more intense and more unusual as the picture continues. The narration of the film tells of the creation of the universe as alarming sexual images of sand and landscape move past the camera. The shots go further and further into the desert and Herzog films whatever he sees and finds. The strangest reflections of the world are on display in the distance while Herzog meets some of the most pure and photogenic collections of outsiders that you are ever likely to see. When the Leonard Cohen soundtrack kicks in, you can be sure that you are in the world of a mad man who is in love with the universe.I cannot say too much more about this film without ruining anything, but I will say that it is a sobering experience and there's really nothing like it. I love seeing films that are just in classes of their own. This film certainly is a good example of how Herzog loves to intermingle narrative storytelling and documentary film-making into an interchangeable form. Fata Morgana unfortunately does overstay it's welcome just a bit, but by the time it nears it's end the images will most likely be burned into your mind forever. Definitely a must-see for those who are obsessed with the nature and the origin of the universe.","As one other IMDb reviewer puts it, \"...imagine 2001: A Space Odyssey in the desert\" and you wouldn't be far off from a brief summarisation of what to expect from this piece of cinema (I deeply hesitate to use the word \"film\"). A lecture on philosophical views on creationism, the mythos surrounding humanities existence, the before and after, that was has been, the what is and the what will be. This for some maybe a \"2001\" on sand, but they tackle different philosophical viewpoints, one about evolution and the future, the hope and potential for mankind, while Fata Morgana itself is a somewhat more metaphysical trek. I only hope I can convey it effectively enough.Herzogs style will not to be everyones liking, and those who are not of a perceived hardcore branch of cinematic viewing may, and most likely will, find this extremely hard going, and may not even see it through to its finale after 72 minutes. Fusing together a montage of footage from the Sahara, including villages, villagers and various other places for a somewhat surrealist ending, music of various genres and an almost mythical narration, Fata Morgana is severely slow paced but ultimately hugely rewarding. Opening with a montage of various filmed shots of planes landing for nigh on five minutes, you already arrival at the introduction of the film immensely confused, and the sense that this will not be like anything you have seen before echoes clear in your mind. Divided into three sections, creation, paradise and the golden age, Fata Morgana attempts, and succeeds, in being able to juxtapose images of the natural beauty of the desert with the man made instruments that taint it. Its three segments are narrated by different persons each pertaining specifically to the particular section they are voicing and provide extra emphasis on the long soliloquy's and desert montages.Fata Morgana is a film dealing with the existence of man on our Earth. It looks at the natural beauty the Earth was designed for, and concurrently looking at the potential beauty we have within us, more notably shows us our negative contributions to the world in which we live. Each shot has been purposefully constructed, using what can only be described within the context of this film as 'The Holy Trinity Of Filming' in pictures, words and music. Each part of these three pieces provides something notably to each shot, but when brought together they create something greater than the whole of their parts, they create unbridled beauty and deep thought within our minds. I will not be able to do this film the justice it deserves with mere words alone, perhaps if I had pictures and a score, and I do know this will not be appreciated by the masses, but this a profound and I will not use the term \"art film\" because this is simply just art. This is moving art which moves the mind and stirs the soul. Whether or not creationism is your want is irrelevant, because this film is about intelligent design.","\"I sense a structure inside my heart, but it's not the same as yours\" ~ Director Werner Herzog on Fata MorganaOne should not enter into the world presented by Fata Morgana without some sense of what to expect. However, beyond stating that this is a film by Werner Herzog, it is almost impossible to discuss the film using categories that are typically applied in discussions of film. Some say that this is the masterpiece of Herzog's early films. I can agree with this but only for two implicitly connected reasons. The first reason is my love for Herzog and his art. The second is that this is easily the most HERZOG film of his early films. Herzog himself has said that the film makes sense and has coherence only if you forget about logic and anything academic that you may have learned about film. So let's discuss the narratives. There is no real story unless you interpret the film as an impressionistic telling of the Popul Vuh (one of the few surviving Mayan origin myths), which is updated into the modern age in three parts. The narrative starts with numerous very beautiful and entrancing images of barren, alien-looking landscapes and extremely illusory and vivid mirages. It then becomes increasingly concerned with people and built environments as we move from the amorphous, sensual and primordial world of the creation into the allegedly civilized, and clearly ridiculous, \"Golden Age\" presumably something like what we have today. Some people see this transition as irony, cynicism, darkness, etc. While it is important that each viewer intepret the film in their own way, i can see nothing in Herzog that is not pure celebrative and eye-opening exuberance concerning a full range of experience - death, love, myth, beauty and all of the illusions that drive so much of human life. There are numerous other narratives that can be found upon repeated examinations of the film, especially if you review the Herzog collection's version with Herzog's deeply personal, journalistic commentary.Now, on to the film itself. Like many of Herzog's film, Fata Morgana is breathtakingly beautiful,. Like almost all of Herzog's films, Fata Morgana expresses something about Herzog's view of life, of people and of the earth - all of which are subjects that Herzog loves very deeply. Herzog shot the film in some of the most extraterrestrial landscapes on earth, with his very unique sense of the surreality of everyday life, and, as usual, no special effects whatsoever. The film utilizes illusion and mesmerizing images and sound to loosen the viewer's interest in narrative itself and then proceeds to deconstruct narratives explicitly while showing the utter lunacy of more familiar imagery. The film's soundtrack also defies even Herzog's own tendencies and the trope of avant garde cinema, juxtaposing opera, Asian folk music and (of all things) Leonard Cohen. This film is a must-see for Herzog fans and those interested in history of film as a pure art form all its own. The film is much more subtle than Koyaanisqatsi and its sequels, but these later films clearly owe Fata Morgana an enormous debt.","it's now some 40 years later. Herzog shows what he 'sees', and it's much more than what he was intending. Was global warming his agenda in 1971? Here is it's effects laid out dry and stenching. The polluting exodus from pollution, the advancing desolation, endless fences to the end, defining mine and not yours. To sum: people being themselves. It's not about natural beauty vs. man-made ugliness, or western civilization vs. the barbarians, it's about a very possible future world in which mankind adapts to a lizard's life. That is, if Life goes on. Myths die as storytellers die, while the world spins round. Nothing is ridiculous or wasted now that every drop counts. Diversity is strength and Music is the spoonful of sugar to help the medicine go down. Undomesticated animals' lives are precarious and furtive. The domesticated serve but are sacrificed first but for all comes their time when the dunes sweep in and the sweet water seeps out. 16 years to learn that monitor's secrets. Time's up. And what do those people know that we've never taken the time to learn? How can anyone in the me-first world, this future's mirage, see this and not be shaken.","Herzog has produced works of genius. That's because he has incredibly trustworthy cinematic intuition, believes in forces that called be charmed forth and is unafraid to take deep risks in his quest for the hypnotic.He also has some interesting things to say about his work. But I advise you to _not_ listen to what he has to say because the subtlety and depth of his work is greater than his conscious insights.A man like this constantly works/ Some of his output is well formed, others just notebooks. This is the latter. It still has moments of wonder but the scope is very local. This is a collection of short form studies. During this period, he was also writing journals, several hundred pages of cinematic notes. Next years \"Wrath\" was where these ideas were coherently shaped.Ted's Evaluation -- 2 of 3: Has some interesting elements.","Split into three distinct parts, each of them special in their own way, \"Fata Morgana\" is an ambitious work that goes both nowhere and everywhere. Herzog's most outwardly experimental work, the film is absurd, surreal, melodic, powerful, spiritual, and uniquely comical. With plenty of melancholic shots of the desert's most desolate areas behind softly sad music and some very moody, but very beautiful songs by the great Leonard Cohen to soothe its more emotional bits, as well as plenty of wacky moments of absurdity to add to the overall feeling of satisfying comedy to the piece, \"Fata Morgana\" is a messy, brilliant, sprawling 70 minute epic.As the film continues, it naturally grows on the viewer and allows itself to become much less heavy in its concepts and material. By the end of the film, every time I see it, I'm glowing with laughter and tears of perplexed happiness. A feeling of great inner peace swoops through the final shots of the film, which practically mirror the earlier, more intimidating desert shots but have a totally different effect due to the film's context. The world has been created, it has seen moments of tragedy and comedy, and, finally, it has developed into a peaceful landscape devoid of war and conflict. It is a work to soothe one's self, even if there is much chaos (which is bleached in fittingly absurd Herzogian humor) along the way. This is a mythical film, a powerful, poetic masterpiece of freely avant garde cinema that is one of the most fascinatingly funny, beautiful, and insightful works of art I have ever borne witness too. One of, if not THE, finest film in Herzog's oeuvre-despite it's totally bizarre, off-the-rails approach.","Fata Morgana may arguably be maverick German director Werner Herzog's most left-field work. This is saying quite a lot considering some of the oddities in his filmography. With this film he has outright made an experimental film and not, I hasten to add, a documentary. While this often has the feel of a documentary and some sequences evoke one, this resolutely is not intended to inform the viewer of facts in any traditional sense. In fairness, many of Herzog's fiction and factual films have crossed over with one another and his cinematic style often falls into the netherworld where these two distinct forms of film overlap. Herzog himself has stated that he makes no distinction between the two formats himself. In any case, Fata Morgana is possibly the most opaque and hard to classify of his films on account of its lack of any plot or obvious message.Set in the Sahara desert of North Africa, this is seemingly an attempt to evoke a perception of the Earth from the point of view of an alien, although you'll be doing very well indeed if you pick up on this yourself without being told about it. It's a very rhythmic film where images and music work alongside each other. There are a few long tracking shots which capture both the natural beauty and the ugliness humans create. The focus often moves onto other inert objects of the desert, such as dead animals (nature), a wrecked aircraft (humankind). Later on, there are appearances from an assortment of eccentric characters all of whom reside in this harsh land. The most memorable of these is a pianist and drummer who play a very strange form of music in a fully committed fashion. Herzog said that this middle-aged couple were the owners of a brothel, although tidbits like this can only be garnered from the commentary track; in fact, this is one of the very few films that might actually be better with the commentary track playing, as the ever fascinating Herzog himself offers much interesting info on this bizarre cinematic adventure.The term Fata Morgana itself means mirages and these are returned to several times. The film opens with a succession of edits of airplanes landing all shot from exactly the same angle and each time, the planes appear to land into the midst of a mirage. Later on, we witness a different mirage of a mysterious vehicle many miles away driving in what appears to be senseless circles in the middle of the desert. Divided into three parts – 'Creation', 'Paradise' and 'The Golden Age' – there is intermittent narration that recites excerpts from an ancient creation myth. There is also – unusually for Herzog – a selection of contemporary music accompanying the imagery, with a couple of tracks from Leonard Cohen, amongst others. In truth, it's all very baffling from a logical point-of-view and is very hard to interpret the meaning. But it has a certain hypnotic effect and, if you can somehow get into its very specific rhythm it's a film that can be appreciated. It's certainly not a film for everyone though and will even pose problems for some hardened Herzog fans. It's one I get more out of the more I watch it.","This is a 75-minute movie by director Werner Herzog from almost 45 years ago, back when he wasn't even 30. The film is mostly narrated by Lotte Eisner, one of Herzog's closest collaborators (check out the story about Herzog's long walk to keep her from dying), who has a pretty interesting life story as well. She did a very fine job narrating here, her voice is nice to listen to. It is as soothing as the entire movie and if that wasn't already enough, they also included music by Leonard Cohen, one of my absolute favorites. It is certainly not a film for everybody. Haters will say we are doing nothing, but watch the desert for over an hour. Nonetheless, I enjoyed it a lot. The poetry is interesting, the music is good from start to finish. The only part I did not like that much was near the end when these two made music. It looked like it was out of a different film and did not fit the Sahara mentality at all in my opinion. But everything else was very nicely done. The images and sound is perfect to just lean back and relax. You find out a bit about the area (also outside the Sahara), landscapes, the people and animals. I highly recommend watching this. And don't forget: Blitzkrieg is insanity.","Long before the lyrical Koyannisqatsi (1982) hit the screens and hit the big time with global audiences, Werner Herzog went out his way - literally to the Sahara desert and Cameroon in Africa - to make his visual statement about humanity's insanity upon this planet.With tireless persistence and great personal danger to himself and his crew, Herzog amassed a bucket-load of exposed film at numerous locations in the above two areas throughout 1968 and 1969. Then he went back to his office somewhere and concocted a sci-fi 'story' about aliens who visit the planet to make a visual report about the state of our tired, ravaged space ship earth. Then he edited and cut all the film to match his story. All of this information is present in the Extras section of the DVD I obtained. Thematically, FM is definitely kindred to K, but more visceral and unsettling.With consummate, pervasive irony, Herzog ignites our eyes with the beauty and serenity of the earth, rivers, mountains, deserts etc but counterpoints - even destroys - our appreciation with the detritus, destruction and devastation wrought by contemporary humanity in the 20th century. Pretty, it is not. Implicitly, Herzog is damning humanity for its stupid, repetitive behavior that is progressively destroying the planet with our well-known technological trappings - and traps. It's a self-evident story, beautifully crafted and presented. And, yes, there is a visual story. Though, to help viewers along, Herzog divides the film into three acts: Creation, Paradise, and The Golden Age; and none of it showing - with exquisite dramatic or comedic satire - humanity as worthy of any of those sublime conditions. Much of the accompanying dialog is actually quoted from the Popul Vuh (which means 'community book' according to my Mayan expert) myth, of the ancient Quiche Maya, about the Mayan story of creation.Little wonder Herzog upset a lot of people when this delicious docudrama was released. There have been earlier films - Wild River (1960) comes to mind - that explored the social and environmental repercussions of untrammeled progress; more recently, Gasland (2010) has exposed the continuing folly of frenetic fracking in USA and other countries.Will humanity ever learn? Over forty years ago, Herzog issued a dire warning with this film. Too bad nobody took much notice except to denigrate it. See this story while you can - and let your ears rejoice in the music also. Nine out of ten. January 4, 2015","I find Herzog's documentary work to be very uneven. Fata Morgana, a companion piece of sorts to Lessons of Darkness, lacks not only the harrowing spectacle but mostly the discerning eye of an author. It is by comparison amateur looking, aimless pans left and right across the desert the kind of which you would expect from any German tourist equipped with a handycam, the camera left running from the window of a car picking up all kinds of meaningless images, wire fences, derelict buildings and patches of dirt going through the lens in haphazard order, intercut with shots of sand dunes. At one point Herzog encounters a group of starved cattle rotting away in the sand, yet the image is presented much like you and me would, perhaps worse, the camera peering hand-held from one cattle to the next. For a documentary that attempts to be a visual feast, a hypnotic, surreal excursion in uncharted landscapes, it lacks the visual orchestration and conviction of a disciplined author. It's all over the place, half-hearted and tedious, Mayan creation myths recited in voice-over, then some other text Herzog fancied for literature. It's not until near the end that Fata Morgana jumps alive through a series of bizarre encounters. First with a man and a woman playing music in a room, the man singing in a distorted voice through a mic, both of them apathetic in their task. A man holding up a turtle. A group of old people trying to get out of some holes in the ground. Other than that, this one seems to have very little of substance to offer or visual splendor to offer.","This is not a movie. This is a collection of random shots taken in a fascinating part of the world, dubbed over with some random text. The footage is not that great and the text is not that great either. The end product is excruciatingly dull.On the DVD, turning the commentary on can provide some entertainment value, as the director makes a rather deranged argument that this is a sci-fi movie. It's also fascinating to read about the extraordinary risks and hardship that the crew endured to collect this footage. Too bad it's rubbish. But I think \"The Making of Fata Morgana\" would be a fascinating film, sort-of like 'Ed Wood\" was.","Fata Morgana (1971) * 1/2 (out of 4) I knew what I was getting into with this film so I actually read the production notes to before getting to the movie itself and I must admit that the notes were a lot more entertaining. Now, I certainly see why some might love this movie and call it a masterpiece but at the same time, to me, this is just a movie that's \"art\" for the sake of being art. There's really an interesting movie to discuss here but it's just not an entertaining one and no matter what type of art you're trying to create, the importance of being entertaining can never be overlooked. There's really no way to fully describe or give a plot detail of this film but it's pretty much Herzog's documentary on why images are so important. Shot in Africa, we get all sorts of images of the desert as well as various other tracking shots, which are shown with narration as well as a soundtrack by Leonard Cohen and Blind Faith. I'm really not sure what to say about this film except that it didn't work for me and Herzog's attempt to show the visuals as \"aliens looking around\" just didn't work. This is something Herzog would attempt later in his career and to me these type of thoughts have always been a miss. I'm sure Herzog has something to say with the film but I don't see it being said in the film itself. I've read his comments and listened to parts of the commentary where he explains things but if it weren't for this, the movie itself wouldn't have said anything. There are certainly some surreal moments and there's no question that a brilliant mind is behind all the images but in the end the film left me cold and bored, which is something I can't say about too many of Herzog's films as he's one of my favorites.","I read a review before entering the theater, and it said that the film made the reviewer wonder if he were losing his mind. The movie started, and the more I watched, the more I agreed, but maybe not for the same reasons. I found myself doubled up in giggling laughter many times, actually falling off my seat! There were minutes of footage of sand dunes and sand dunes and more sand dunes...and then, for no reason I could tell, a Leonard Cohen song would start up. Then more footage of the desert, maybe some verses out of the Koran...\"In paradise, roasted pigeons fly into your open mouth\"...more bleak footage, then another damn Leonard Cohen song that doesn't relate, then an interview with some German lizard collector wearing welding goggles, more footage with verses from the Koran, then yet another God damned Leonard Cohen song. I laughed myself breathless! The best thing that can be said is: The director got better with later movies.","Fata Morgana, the 1971 documentary-like film by German filmmaker extraordinaire Werner Herzog, filmed over several years in the late 1960s, is one of those rare DVDs that should be listened to with the commentary turned on. It is a visual feast of North African (mostly Saharan) imagery that is timeless. You simply could not tell that it was made over thirty-five years ago. The soundtrack to the film, including German classical music (Mozart and Handel), and rock music by Blind Faith and Leonard Cohen, also lends its timeless quality. The narration by three different German narrators (German film historian Lotte Eisner, Eugen Des Montagnes, and Wolfgang von Ungern-Sternberg) is solid, and Herzog goes on and on of Eisner's import to this project, himself, and film history, but the English speaker of the translation, James William Gledhill, has a voice that seems downright deific, which lends itself far more perfectly to this project, even though much of the text- in either language, is rather superfluous. Yes, the faux Biblical sounds of the Popul Vuh Mayan creation myth in the film's first part, Creation, is interesting, but the text Herzog wrote for the remaining two parts (Paradise and The Golden Age), along with quotes from a German poet Herzog names as Manfred Eigendorf, almost seems a satire of the first part's somber tone. The film, it seems was pieced together during the shooting of several other Herzog projects concurrently- the fictive Even Dwarfs Started Small, and the documentaries The Land Of Silence And Darkness and The Flying Doctors Of East Africa, but these projects' rejected material only add to the beauty of this film, such as aerial scenes of a flamingo mating lake from afar that give one an eerie unearthly sense, one which Herzog crows about in his commentary. This unearthly feel is present right from the film's start of several airplanes landing on a desert runway, with their images getting successively blurrier as the heat from the ground rises, and increases the distorting waves that mar the images. That this film was influential in the Quatsi films of Godfrey Reggio is an understatement. But, whereas Reggio is content to just toss images at you, Herzog has an ability that only American filmmaker Terrence Malick also has: to make a wholly self-contained vocabulary out of the juxtaposition of images and words, and one dependent upon an emotion-first thrust. Analysis can fail when brought to such endeavors. Herzog often does not understand even why his art is great. The best he does often is wholly unconscious and mesmeric. This is why his contempt for the Lowest Common Denominator pap of Hollywood is openly stated on the commentary.Perhaps the best illustration of this comes in a scene that, on the commentary, Herzog tells us followed a severe drought in Cameroon. It shows the jerkied carcasses of cattle, and Herzog describes the unbearable stench. Yet, the viewer can sense this all from the images, the blackness of the sun dried portions of animals, and the blanched bones. Yet, even in that commentary, Herzog focuses on the stench, not any deeper meaning. He is content to let you imbue and interpret what you will into and of his work, such as the almost erotically feminized shapes of sand dunes, which recalls a scene from Ingmar Bergman's Hour Of The Wolf, where Max Von Sydow, runs his hand over Ingrid Thulin's beautiful nude body's curves. But, the archetypal image in this film, which symbolizes much of Herzog's career, is of a mirage of a faraway car driving back and forth on the surface of what appears to be a lake. It is deep, hypnotic, illusive, elusive, supernatural, yet real, just as Herzog, the believer who came from a family of militant atheists, is. But, then, like everything else, it ends."],"review-user":["nienhuis","D Kieckh","Lechuguilla","frankenbenz","thelastonehere","Bloodfordracula","lucanuscervus","MisterWhiplash","tonymurphylee","benjamin_lappin","mstomaso","info-440-560876","tedg","framptonhollis","Red-Barracuda","Horst_In_Translation","RJBurke1942","chaos-rampant","ghica","Michael_Elliott","dbiguns","Cosmoeticadotcom"],"review-date":["10 December 2005","14 January 2000","9 January 2007","1 May 2008","26 January 2005","26 June 2003","4 July 2008","5 June 2007","1 March 2010","17 June 2007","21 February 2018","3 August 2012","10 April 2005","28 November 2017","3 September 2015","3 June 2015","3 January 2015","11 February 2009","25 August 2006","3 July 2009","5 September 2014","11 September 2008"],"review-rating":["10","10","9","8","10","6","10","8","9","10","10","6","8","9","1","4","8"],"review-title":[" The Viewer as Collaborator\n"," The world from a non-human point of view\n"," You're On Your Own With This One\n"," No Slight of Hand\n"," watch the DVD with commentary\n"," Haunting and Hypnotic.\n"," very good intentions, which could have been far more effectively realized\n"," still the most experimental film Herzog ever made; pretentious nonsense or close to slowly riveting poetry, you be the judge\n"," One of the weirdest and most perplexing art films I have ever seen\n"," The Mirages Of Humanity In The Deserts Of Our Minds\n"," A Structure Inside of Herzog's Heart\n"," the aliens are us\n"," Notebooks\n"," meditative exploration of the mirage and much more\n"," Strange and ambiguous experimental work from Herzog\n"," More of an experience than a movie\n"," Where aliens report on the insanity of humanity....\n"," Amateur hour by the man who gave us the titanic 'Lessons of Darkness'\n"," You got to be kidding me\n"," Strange to Say Just a Few Words\n"," The silliest excuse for a movie I've ever seen!\n"," Mesmeric\n"]}