{"review-url":["http://www.imdb.com/title/tt0082592/reviews"],"review-text":["Liebermans' entry in the original slasher craze is definitely more well made and intelligent than some. In fact, in making it he wasn't so much inspired by \"Friday the 13th\" as he was \"Deliverance\". He and his crew make this a powerfully atmospheric outing, utilizing the real Oregon woods to great effect, and turn it into a fun survival-of-the-fittest yarn, even developing the two main characters in interesting ways. Five young adults venture into the Oregonian mountains to do some camping and check out the local land that one of them has supposedly inherited. Before long they begin to be victimized by a stealthy, heavyset psychopath. Slasher movie fanatics who watch this sort of thing for gore and/or nudity will be quite disappointed with Liebermans' film, as it's clear he has a different agenda going on. That's not to say, of course, that the women aren't attractive, or that there isn't some effective nastiness to be enjoyed. But what the director really wants to convey is the need to have a respect for nature - because it CAN kick your ass if you're not prepared. He begins with an intense opening set piece and generates some truly unnerving suspense; this is the kind of film that can have a viewer literally on the edge of their seat. It's also stylishly done; take note of one scene transition in particular. Brad Fiedel, who a few years later gained his fame with his theme for \"The Terminator\", supplies a music score that is chilling in its subtlety. (The whistling is a really nice touch.) The better than usual cast features some very familiar actors: Gregg Henry, Ralph Seymour, Jamie Rose, Mike Kellin, Chris Lemmon (Jacks' son), and George Kennedy as the veteran forest ranger who's aware that the area is fraught with danger. The gorgeous Deborah Benson, who really should have been able to enjoy a much more visible career, is a standout as the female lead who starts out as a rather tentative character, starts to cut loose, and ultimately finds her inner strength. John Hunsaker is extremely creepy as the killer. There's one well executed plot twist along the way, and at the end an innovative and memorable way of dispatching our villain. The pacing is deliberate, the camera-work and cinematography excellent, and the scenery beautiful, in what has to be one of the more unheralded horror films of its time. It comes highly recommended. Eight out of 10.","1981's Just Before Dawn is one of the best tales of wilderness horror out there. It's one of the finest-made slashers of the 80's and it easily blows movies like The Final Terror, Don't Go in the Woods, or The Prey out of the water.A group of young adults come to check out the mountain property that one of the group has just bought. However they are not alone in the wild. A hulking in-bred murderer, who seems to be in two places at once, is lurking and apparently hates trespassers. Director Lieberman, who gave us such great B films as Squirm (1976) and Blue Sunshine (1977), does an excellent job with this smart thriller as well. The movie is nicely atmospheric, with a creeping sense of tension and some strong suspense. This film makes even the open wilderness seem frighteningly claustrophobic. The Oregon locations are beautiful and well captured by the crafty cinematography. The music score is a true original and awesome in contrast with the scenic visuals. Deborah Benson makes for a great lead, her presence was captivating. Gregg Henry delivers a good performance as Benson's lover and Chris Lemon provides some occasional charisma. The supporting cast, especially veteran actor Kennedy, also does quite well. A true gem of the slasher genre, that needs no gore to thrill. Definitely well worth seeking out for slasher fans and horror buffs alike. See it!*** 1/2 out of ****","Five teens set out to do some camping in the Oregon wilderness, and despite being warned by the park ranger, they soon realize that something is lurking around in the backwoods waiting to strike.When it comes to old horror movies, the only one that keeps popping up in every conversation is Friday THE 13th, so I took it upon myself to find those good old horror movies that fell short for simply being compared to Friday THE 13th, JUST BEFORE DAWN just so happened to be among the ones I found, and was really very impressive, it wasn't as bland as some of the stuff you find today, it was very sharp in terms of character development as it had quite a few likable ones, and it has this very casual pace, its not in a hurry to get to the hack and slash bits, it takes its time to set the proper mood and tone and is very atmospheric and builds some killer suspense by letting you always have that sense of dread like, somethings out there but you don't know where it is or when it will strike.Where I live its definitely an overlooked gem simply because people never heard of it or won't give it a chance, but I'll state that it is not a Friday THE 13th rip off, the two concepts don't even go near each other, but in my mind, it is overall one of the more impressive slashers I've seen in a while.","The mountainous woods, young happy campers, a warning by a park ranger and a lurking figure. The ingredients are there for a horror delight, and director/co-writer Jeff Lieberman does an adequate job at achieving it. It's formulaic woodland horror, but for most part the execution is at the top the game and the story (which is quite basic in a trimmed sense) is effectively told in certain realism. Maybe a little more exposition wouldn't have gone astray, but Lieberman's craftsmanship makes up for the material's flaws and typical details with rising tension, moody visuals and a smothering atmosphere created by Brad Fiedel's very ominously lingering score. Whenever that very creepy whistling was cued in, it painted a truly unnerving sense that settled in with the beautiful backdrop. Cinematographers Dean M. and Joel King do a striking job too. There's plenty of style abound, even with its minimal scope and the build-up is slow grinding. At times the pacing can become a stop-and-go affair. It's not particularly violent, but there's still a mean-streak evident even if some of it happens of screen. The latter chase scenes and escalating fear is well done, as it has the darkness coming alive with itS burly killer/s and you get actor George Kennedy riding his white horse in a slight, but wonderful turn. There's a likable bunch of performances; Deborah Benson makes for a strong, dashing heroine. Gregg Henry, Chris Lemmon Ralph Seymour, Jamie Rose, Mike Kellin and Katie Powell round off a modest cast of believable deliveries. The final climax is rather twisted, but the ending is one of those types that leave you thinking \"Is that it?\" A well-etched backwoods slasher item, which probably plays it a little too safe to truly set it apart from the norm.","Just Before Dawn is a gem of a slasher flick, unfortunately not too many of you guys can see it because it was released in the wake of Friday the 13th and considered one of it's rip-offs. The only version I've seen of JBD is on Paragon VHS, supposedly it is available on a compilation DVD, but I've never seen it. Anyways I digress... More like the Hills Have Eyes than Friday the 13th, this film stands on its own due to it's atmospheric look and style and it's commitment to building it's characters. The film is effectively creepy throughout, never wholly revealing the killer to you, instead masking the killer or killers, through shadows and camera work. The film score is quite haunting and unlike other slasher films it doesn't spike up every time someone moves, it just builds along with the suspense and flows with the story. The film was recently re-made, loosely, as Wrong Turn. If you can find Just Before Dawn I highly recommend watching it, with the lights out.","(***1/2 out of *****) So, maybe this is a derivative cross between \"Deliverance\" and \"The Hills Have Eyes\" (which, itself, borrowed heavily from \"The Texas Chainsaw Massacre\") -- I still enjoyed it as much as \"Hills.\"  Ignoring the cryptic warnings of forest ranger George Kennedy (who talks to his plants), a group of kids go up into the mountains to look at a piece of land one of them owns and to camp and do some mountain-climbing (this was filmed on location at Silver Falls State Park in Oregon, so the cinematography is refreshingly beautiful and authentic.)  Alas, no sooner does the gang set up the tents and get settled than a big, inbred mountain man with a raspy laugh and a rusty machete starts a backwoods game of search and destroy.  There are some irritating character inconsistencies and minor plot holes, but not as much as you usually find in these movies.  Lieberman (also director of the infamous earthworms-run-amok film \"Squirm\") creates genuine feelings of fear and helplessness, and there are a number of creepy and suspenseful scenes (one involving a couple skinnydipping and another involving a kid not wearing his glasses).  Another effective jolt is provided when we find out how the killer is able to cover so much ground in such a short amount of time.  There are also some gruesome (but not excessive) gore scenes thrown into the mix (a machete through a crotch, a fist shoved down a throat) for those with discriminating tastes.  Deborah Benson plays the heroine with an instinctive nack for tonsillectomies, and Gregg Henry (from Brian De Palma's \"Body Double\") plays the tough-acting, but ultimately wimpy, boyfriend. Also stars Chris Lemmon and Mike Kellin.HIGHLIGHT:  Pretty skinnydipper Megan (Jamie Rose) thinks that's her boyfriend down there, groping her bare back and legs beneath the dark water... until she spots him climbing up onto the bank fifty yards away!","Just Before Dawn came out during the golden days of the slasher film. The backwoods slasher pretty much started with films like Friday the 13th, The Burning, and Madman. Just Before Dawn is a step ahead of the typical backwoods slasher flick. The cinematography is gorgeous. The acting is top notch. The heroine of the film is not your typical 'final girl'.Constance is a 'woods' girl, but when it comes down to the primal instinct of survival, she's a step behind. Not until it comes to saving the life of her and her boyfriend, does the primal notion of survival kick in. There's a subtle transition that gradually focuses on the final girls hidden sexuality - coinciding that alongside her will to survive.Just Before Dawn isn't for everyone, but for the slasher fan, it's as close to perfect as you can get. The killer(s) are very menacing - Almost like it's a game to maim and murder anyone who crosses their territory. The end scene is a bit off kilter. For the first time viewer, it may be a little shocking. I'd recommend this to anyone who's a fan of the backwoods slasher. Even non-slasher fans will find something to like about it. The setting is eerie and makes one feel uneasy. The death sequences aren't particularly gory, but I'm not sure the film needed gore. See it!","JBD has something that a lot of other horror films lack. I knew that the first time I saw it. It stands above many others. It's funny to think this when it's scenario here is nothing knew. The film even has better actors for this type of flick, none better than Gregg Henry, and it's great to see him play a good guy. The actress playing his girlfriend, looks like a female version of him. Are they related? Again, despite the warning of an old buzzard (horror icon, George Kennedy, who else) not to venture into these dangerous woods, of course they pay no heed. Henry and co proceed in their R.V. into this elevated terrain, below quite a drop, (kind of has you thinking of RV with Robin Williams). The killer family (cliched) are of course deformed, some of them giants, very much Wrong Turnish 1. As they trek out into the mountains, the movie takes it time to pick off it's victims (I like movies that work this way) they are picked off gradually. JBD, an unhurried frightener flick, maintains much suspense, throughout, which it never loses, some of it truly claustrophobic. This horror is one of those few, I've actually found truly and effectively scary. Some moments, truly jangle the senses. Violence is restrained here too. Although JBD with a lot of instances and happenings which are cliché'd, what it has great suspense, which a lot of other films lack this much in volume, it's story structured with a master disciplined touch. It has a less is more thing going for it. The unrelated ten minute opening too is one of grand suspense, in a movie that pushes all the right buttons. There is a warning, on the cover that the last ten minutes of the movie may be intense or disturbing. What an over exaggeration, you'll see what I'm talking about, when you see that image.","Very scary backwoods slasher is much better than others, such as \"The Prey\" and some of the later \"Friday the 13th\" sequels. The story has to do with five teenager campers running afoul of a pair of psychotic, machete-wielding hillbilly twins. One by one they are dispatched by the murderous giants (who giggle as they slaughter their prey). This has some great photography of the Oregon wilderness, a creepy musical score, and some of the best shocks ever put into a horror/slasher film. I really enjoy the scene where Daniel and Megan are menaced by one of the killers. A classic that deserves a video re-release. I actually stumbled across this one for four bucks at a resale shop in Northern Michigan.","\"Just Before Dawn\" focuses on five young hikers who make their way into the backwoods of Oregon to a piece of property whom one of them owns; unfortunately, they get more than they bargained for when an ogreish killer ends up on their trail. Rope bridges, waterfalls, an abandoned church, and the dense Oregon forest set the stage here for a whole lot of fun and some surprisingly sophisticated thrills.It had taken me a long time to get around to seeing this film, but boy, oh, boy, what a surprise we have here! Taking pointers from \"Deliverance\" (and also heavily reminiscent of \"The Hills Have Eyes\", despite the fact that the filmmakers refute having even seen that film before writing the script), \"Just Before Dawn\" is one of the slickest and most dazzling backwoods slasher pictures to come out of the 1980s. While the general premise clearly has little to offer in terms of originality, the production values here really elevate the film— incredible cinematography of the landscapes and forests are gorgeous while conversely terrifying, and the individual cast members and their on screen chemistry is incredibly believable. Sophisticated and well-placed curves in the plot also make for some understated moments of awe and terror; in another's hands, the script here could have taken the \"Friday the 13th\" route, but there is plenty of clever writing and a serious attempt at tension and suspense. The haunting whistling score adds another layer of ominousness to the film, blurring the lines around the film's diegesis and composition— is it the soundtrack, or is someone whistling at us from the woods? Is there a difference? Jeff Lieberman's direction here is amazing, and Deborah Benson is perfect in the film's central role. At the end of the day (or rather, beginning), \"Just Before Dawn\" is one of the most under-viewed slasher thrillers of its time; while it is cherished by a great few, it is not a film that has fully received the audience it deserves. Pitted against 98% of the slasher fodder that was the 1980s, it is the cream of the crop— moodily shot, well-acted, well-written, and indelibly atmospheric. The film's peers of the time that attempted similar things (the atrocious \"Don't Go in the Woods\" comes to mind) did so with about 1/10th of the grace, and its influence has bled on into contemporary films (see \"Wrong Turn\"). Really, the bottom line is that \"Just Before Dawn\" is a class act all around. Imagine how shocked and giddy I was when I found out after watching it that it was basically filmed in my backyard! I think I've officially got summer hiking plans now, sans backwoods maniacs with machetes (or at least I would hope). 9/10.","\"Just Before Dawn\" truly captures the feeling of the Oregon woods, that is, if it were inhabited by a family of inbred maniacs. Having been there myself a couple times, the movie magnificently showcases the beautiful scenery of the area, as well as being an awesome slasher.Five teens go exploring on new land that one of them acquired, much to the dissuasion of multiple people. Through many tense sequences, they are stalked by a pair of twin inbred giants, as well as trying to navigate and survive the dense foliage and natural pitfalls of the land. The twins remind one of Michael Myers, unrelenting, brutal monsters with an urge to kill. In one memorable scene, not even a tree can stop them, which after being climbed by one girl, a twin proceeds to methodically cut it down, just to reach his victim.The atmosphere is outstanding, with the low lighting of the overall film making it even more gritty and dense. Something about being lost in the woods is just extremely frightening in and of itself to imagine. There are some very interesting and unique nuances that take place, such as the five campers interacting with the local family multiple times, and the ranger being around throughout. The last twenty minutes or so are probably the best, as the film just builds and builds. It also includes one of the best \"final girl\" scenes ever committed to film.\"Just Before Dawn\" is an outstanding example of what atmosphere and simplicity can do to power a movie. Location can create fear and horror just as much as the \"demons\" that hide within it.","On the surface, Just Before Dawn sounds just like dozens of other killer hillbilly slasher films. Whitebread Warren buys some property in the gorgeous Oregon mountains and takes his girlfriend Cowering Connie, prankster friend Jokey Jonathan and his girlfriend Makeup-obsessed Megan, and Jonathan's brother Danny (aka 5th Wheel) to visit the new digs. They're warned away from the area by a ranger, a prior survivor, AND a creepy mountain family but you know how it is...and they've got a deed! Anyway, things go wrong our cast members meet the wrong end of some sharp things. Typical 80s slasher, but Jeff Lieberman really manages to make it something special. The woods are both beautiful and ominous, the main characters actually seem like they'd be friends in real life, there's decent gore,a fun twist, and a nice example of a character finding some inner strength. Sure, I would have liked a higher body count but that's really my only quibble. Give this one a chance and you might like it.","I was lucky enough to see the \"Horror Classics\" DVD version of this film before it was mysteriously removed from the 4 film DVD and replaced with something else. The picture and sound quality of the film on that edition was a nightmare in itself. Yet, that version is STILL superior to the one with the deluxe DVD treatment. The reason was stated in Brad Fiedel's interview segments on the Special Edition DVD. He had noted what I first found so striking about this film. This being the use of music at moments of inactivity in the film, but leaving the moments of activity in silence, thus giving the horror scenes a stronger feel. The problem with this reissue is it carries the extra film score used to fill in these intentional gaps in score. Fiedel complained of this and made it clear that the filler music was not his. The music actually sounded a lot like Howard Shore's work for Videodrome. Sad for me that I am also a major fan of that film and have to associate the two.The film itself managed to add some interesting realistic elements to the genre horror film. A group of friends go up on a mountain one of them inherited. On the mountain they are confronted with a family with a nightmarish secret. The movie moves along at a great pace. In fact every time I have seen it, I still find myself shocked to see 45 minutes had passed before things started really going wrong for the campers.While the Horror Classics version is filled with many gaps, the fact that there is no score accompanying the horror scenes is what makes this film intelligent and even superior to most slasher films I have ever seen. The Director Jeff Lieberman had made some unique horror films previous to this one making this one the most mainstream and yet, very different to the mainstream at the same time. It is a good fun film with surprising acting performances to boot. The new spiffed up DVD version is worth a rent, the now collectors item Horror Classics version, now OOP is worth the hunt.","'Just Before Dawn' is one rare slasher that has impressed me every time I watched it. The reason lies in its penetrative and intense backwoods atmosphere that disturbs me deeply. Jeff Lieberman has always applied a simple but methodical approach to make the viewers uneasy. His 'Blue Sunshine' could be classified as both simple and bizarre at the same time. The antagonists of Lieberman's films often suffer from anguish and kill for the sake of enjoyment. The creepy and campy atmosphere, persistent sound of the nearby waterfall, and finally the above average performances by Gregg Henry, Chris Lemmon, Jamie Rose and Deborah Benson give this movie a constant momentum avoiding any element of boredom. The film has very less gore and almost no nudity, making this perfect by all means. One can bet that Lieberman doesn't want to make his creation famous with the help of nudity and gore, so the lovers of these stuffs would be somewhat disappointed. On the contrary, the movie seems inspired by the atmosphere of John Boorman's legendary 1972 film 'Deliverance', that involves hillbillies somewhat similarly. However, this doesn't make JBD a copy cat as it teems with originality and deploys a simple plot to please and astound the viewers.Two hunters Ty (Mike Kellin) and Vachel (Charles Bartlett) are out in the woods drinking and exploring an old abandoned church after a successful hunting trip. The men are in high spirits when Ty catches the look of a horrendous man (John Hunsaker) looking down at them through the roof hole. Ty leaves Vachel behind to trace the man down, but is shocked when his truck rolls towards him and he barely escapes injury. We soon witness a grisly figure cutting Vachel open to the groin with a serrated machete. The figure menacingly laughs while Vachel cries in pain. Ty watches in horror when he finds the figure putting on Vachel's clothes and looking at him with fiery eyes. The scene soon cuts to Warren (Gregg Henry), Constance (Deboraeh Benson), Daniel (Ralph Seymour), Jonathan (Chris Lemmon), and Megan (Jamie Rose), who are in a camper heading towards the wilderness to have a great camping adventure. On the way they are warned by the forest ranger Roy (George Kennedy) about the dangers of the wild. Roy persuades them to go back but meets no success. Ahead they meet Ty, who is out of his breath, drinking and trembling. In a palsied voice, Ty narrates his horrible experience to the teens and urges them to take him along. The teens however refuse his request and set out to the woods. Ty, left behind, gives a satirical laugh while he watches the grisly man climb up Warren's camper.The teens camp at a remarkably serene location filled with the constant sound of waterfall and packed with lush greenery. Everything seems to be as normal as any other camping excursion with an exception of a perverted killer, who is constantly on the trail of his young preys. That night they are disrupted when a local old man (Hap Oslund) comes along with his family holding a gun, and furiously advises the teens to leave at once because he thinks that they are doing no good in the wild than 'raising the devil'. The youngsters pay no heed to the old man's words and continue camping. Next day, Jonathan becomes the first target of the hillbilly, who cuts down the rope bridge forcibly facilitating Jonathan's fall. Soon Megan and Daniel become his targets, when they are stabbed in the old church. Finally, Warren and Constance are left with no option than to face their enemy.....or enemies? Well, there are so many twins around here!JBD is a great effort by Jeff Lieberman, and I personally find it more interesting and menacing than other backwoods tales like Sleepaway Camp, Cabin Fever and even Evil Dead, which all try to intensify the horror aspect with the aid of explicit gore. Surprisingly, JBD is very mediocre on gore. Here the viewers are afraid to see the clash between two different cultures, the one inculcated in the city while the other tamed in woods. Like 'The Shining', JBD has some amount of hypnotic qualities, which I suppose are due to the breathtaking locations, the placidity of nature and the fear of wilderness. JBD really comes at par with the other horror gems of 1981 like 'Dead & Buried', 'Dark Night of the Scarecrow', 'The Burning' and 'The Beyond' in terms of horror. 10/10 for Mr. Lieberman!","Ignore the bad reviews on here, this film is awesome! \"Just Before Dawn\" is a great example of what can be done in a film with a minimal budget if you have a dedicated crew, decent script, and a cool idea for a film. It's a hell of a lot of fun.I enjoyed it a lot more than most other 80's slashers because the killer is so unique. \"Wrong Turn\" ripped this movie off something fierce! There's plenty of blood and scares. My girlfriend was freaked out and she watches almost everything with me and doesn't flinch. It's got that creepiness to it.I'd say that \"Just Before Dawn\" is the best early 80's slasher out there. I really enjoyed it.8 out of 10, kids.","This was a great 1981 film which had a great story about three men and two girls who go on a camping trip together and go through thick woods and high mountains with a great water fall. This group of people run into property owned by George Kennedy, (Roy McLean) who plays the role as a Forest Ranger and rides a white horse. Roy McLean warns these young people that where they are going is no area for camping and they should turn back. Of course these young people pay no attention and proceed to have a ball swimming in the nude near the water fall and playing great music and dancing by the fire and having plenty of beer and wine. There is an old wooden one room school house that draws the gals and guys inside and it is from that point on the film starts to get very scary. There is one occasion when a young girl has to climb a tree in order to get away from a human beast who desires her body and starts chopping the tree down in order to capture her. Don't miss this film, there is plenty of everything.","Eerie. Creepy. Bleak. Wilderness slasher horror. Jeff Lieberman's «Just Before Dawn» is a somewhat overlooked slasher movie, but it is the quintessential of what a slasher movie should be. In my early teens (mid-eighties) my friends and I used to watch this gem over and over and over. As much as it scared us, we really loved it. The plot is pretty basic: Five campers (you got the stereotypes, the hunk, the babe, the geek etc.) go to some red neck mountaintop to indulge in youthful ... whatever, despite ignoring several warnings from the local forest ranger («there's demons in the forest» - which turns out to be some inbred, mutant hillbilly maniac killers). Of course the loonie mountain men stalk the campers. And then the fun begins. No, it's not «Seven» or «Zodiac». It's a low budget slasher movie from 1981, but it still stands the test of time. Think «The Texas Chainsaw Massascre meets «Deliverance» and «The Hills Have Eyes». The soundtrack is bleak, low key and blends natural with the forest sounds to create a dark, sinister mood. The acting is pretty solid, and the machete swinging killers are your worst nightmare. 8 stars out of 10.","For whatever reason, I tend to be drawn to these backwoods, hillbilly horror films like a moth to a flame. I can't get enough of them. In this particular sub-genre, I would call Just Before Dawn average. It's not the best I've seen, but it's far from being as bad as something like Midnight (1982). In general, I think these films appeal to me because of their realism. Monsters, ghosts, and other supernatural elements are fine, but even the most basic and mundane of these films ask the viewer to stretch their imagination to some degree. In contrast, we've all heard stories about the crazy inbred mountain people and their distrust of modern society. And while films like Just Before Dawn may take liberties with the extreme violence, there's no denying the real stories of actual murders as a result of this culture clash.In Just Before Dawn, a group of twenty-somethings makes there way to a remote mountain for a little fun and relaxation. They are warned twice, once by the Forest Ranger and again by a crazed man in the woods, to turn back. Ignoring the warnings, they set up camp and prepare to enjoy themselves. But these woods are home to more than the normal forest creatures. There's a killer on the loose and the group of young adults soon become the target. Sound familiar? This plot description could be applied to about a dozen films I can think of off the top of my head. It's that original.I look at Just Before Dawn as a case of missed opportunities. There were places the movie could have gone to break away from the standard 80s backwoods, hillbilly horror mold and done something unique. For example, more information on the mountain family and what makes them tick would have been very interesting. Or, more explanation on the killers and how they lived and their motives would have been very interesting. Or, including the subplot involving mountain religions (as suggested in the interview on the DVD) would have been very interesting. But as it is, every opportunity to do something other than have a group of young people stalked through the woods by an unseen, silent assassin is missed.To be fair, I'll give the movie some credit in a couple of instances. First, I thought it was a nice touch to keep the characters \"real\". What I mean is that too often in these movies, characters are little more than overdone stereotypes. The characters in Just Before Dawn aren't much different from people I've known. Second, there are a couple of very well done camera shots. For example, the scene of the killer walking through the waterfall in the background as two characters swim in the lake is very subtle and very effective. Third, a couple of the kill scenes rise above what I associate with low-budget 80s horror. The killing of the hunter at the beginning of the movie is very nice.In the end, it's a shame that the makers of Just Before Dawn didn't take more chances. Had they been willing to push the envelope a bit more, this movie might have been one of the better examples of this sub-genre instead of being merely average.","Jeff Lieberman's \"Just Before Dawn\" is definitely one of the most underrated horror movies ever made.The film,whilst a little bit influenced by \"Deliverance\" and \"The Texas Chain Saw Massacre\",is extremely creepy and memorable.The suspense almost never lets up and the atmosphere is genuinely eerie.The cast is excellent,Deborah Benson and Jamie Rose are great female leads.The inbred twins are truly frightening and remorseless killers.The film is beautifully shot-it was actually filmed on location at Silver Falls State Park in Oregon.There is very little gore,but one killing,when Verchel is stabbed in the groin,is pretty nasty and unpleasant.A must-see for slasher fans.10 out of 10-what else?","Five friends take a camping trip into the wilderness to check out the land that one acquired (or inherited). On their way up the mountain they run into a park ranger (George Kennedy) starts off with the old you best not go up there routine that previews the road ahead for them. After brushing him off they continue on their way jamming to the '70's without a care in the world. Lo and behold a local pops out of nowhere to warn of \"demons\" and such. At this point these kids should probably start for home but then we wouldn't have a film would we? They drive their camper as high as it will go then hoof it to the summit. But you guessed it them thar \"demons\" that they blew off start doing them in, one by one. Will the forest ranger save them in time? Jeff Lieberman (Squirm) turns in this beautifully shot film that is a bit slow at times. I found Brad Fiedel's (T2) music score to be very haunting and beautiful, a perfect match for the lovely forest and waterfall locations. The cast headlined by Kennedy (Creepshow 2) do a go job of relaying the fear of the script which at times came up with some tense set-pieces. \"Just Before Dawn\" drags a bit but would be an excellent edition for the fan of 1980's slashers.","\"Just Before Dawn\" tells the tale of four young backpackers who are going to check out a piece of property in the woods that one of them has inherited. Sounds like every other slasher, right? Well, while it DOES have many of the slasher clichés that were ever so popular at the time, it surprisingly has depth and a unique, creepy style that many other of these movies lack. While the other films are good for some campy fun, this is one is not campy and is more creepy and disturbing. Not to mention it has one of the best endings in horror history. Check it out as soon as possible! Rated: R for Violence and Nudity.Grade: B+","Just Before Dawn is one of those really good slashers that send chills down your spine every time you watch it! This movie has great suspense, great acting, very well done camera work (nice job Mr. Lieberman!) which makes a extremely well made slasher! Though low on gore for the 80s, it still has the effect on you after it is over. The opening kill (machete through the crotch) looked so real! And the fist to the mouth death left me stunned! Overall i give this lost classic 10 stars out of 10 stars! if you are looking for a gore-fest, don't look here. but, if you want chills sent down your back, see this one. There are 6 deaths and one of them you don't see but, it leaves you mind to think \"how was she killed?\" the stranded theme reminded me of 1977's the Hills Have Eyes, which followed kind of the same concept, but in the desert with canninbals. But, still slasher fans, give this forgotten gem, i promise you, you will be staisfied!","for a movie like this little hidden gem to come out in the 80s, its shocking how not a lot of people know about it.this movie is definitely worth a look. it has all the things you need for a horror movie. especially the good old chills.i remember watching this movie for the first time about 15 years ago, but i couldn't remember the name of it, so i came to IMDb a few years ago to ask for help on finding the title. i eventually got the name of the title, and bought the movie. i still love it as much as i did all those years ago.buy this movie!!","I've been waiting almost 25 years to see this hard to find horror thriller and I finally did since it's proper rebirth on DVD. Of course it didn't have the same impact on me as it would have if I had seen in it the 80s, but director Lieberman (his film \"Squirm\" is excellent) makes good use of the lovely Oregon location and takes the time to develop the characters, not just to have them dispatched in creative ways. A high note, Brad Fiedel's whistling music is really creepy and adds to the desolate proceedings making this great fun for genre fans. A must see if you like underrated horror films. To describe it would be an intelligent \"Friday The 13th\" sprinkled with some tasty bits of \"Deliverance.\" With that aside, there are some really cool & original moments like my favorite when a couple are swimming in a lake and the guy disappears underwater to play a trick on his gal - just when you think it's the usual scare, she suddenly looks to shore and...I honestly can't spoil it -you just have to watch it for yourself. Also, the ending is just one of those that you just have to see to believe  it came out of nowhere and it's weird & wild! The DVD includes commentary by Lieberman.","I first saw this one afternoon in the 80's on network T.V. I think I was like 9.(Picture seeing a violent horror flick nowadays on regular television). Anyway, I've seen it again years later and it's like I remembered,it's really good,scary flick. I think the reason why it might of gone unnoticed is cause it wasn't followed by a ****load of sequels i.e. Friday the 13th. But it's one of those movies that takes the original idea and does it better. Even though this is a killer in the woods flick like Friday,it has more in common with the original Texas Chainsaw Massacre.That's because the movie lays down a certain atmosphere and feeling of dread,even in broad daylight. And the killers feel more threatening than in Friday. There's also a good amount of suspense. I recommend seeing it now that it's being released on DVD in late July."],"review-user":["Hey_Sweden","Nightman85","jhpstrydom","lost-in-limbo","omegaknight_d","BillyBC","Bub_the_zombie","videorama-759-859391","ehoshaw","drownnnsoda","warsystem04","FilmFatale","lesunra","shuklavinash","coldwaterpdh","whpratt1","mrbunghoolio","bensonmum2","HumanoidOfFlesh","suspiria10","cameron-kills-it","skeletonman13","wolfmans_got_nards","moviematt71","Nixshows"],"review-date":["23 February 2013","17 February 2008","19 February 2009","24 January 2009","29 January 2005","4 March 2003","8 November 2007","21 February 2015","27 August 2000","9 July 2014","27 December 2012","29 October 2012","3 August 2005","27 August 2012","8 February 2008","6 June 2007","2 November 2017","14 March 2006","13 December 2002","13 August 2005","23 August 2010","15 October 2007","30 April 2007","5 August 2005","26 May 2005"],"review-rating":["8","10","8","7","9","7","9","7","7","7","10","10","10","8","5","10","6","7","10","9","8","10"],"review-title":[" My favourite Jeff Lieberman film.\n"," Slick backwoods horror, much sharper than your typical slasher!\n"," impressive early 80's slasher.\n"," You might not be up before dawn.\n"," These hills have more than eyes...\n"," One of the better killer-in-the-woods flicks of the '80s\n"," Great Backwoods slasher flick. A classic in all respects.\n"," A nightmarish hell pre dawn\n"," Frightening and bizarrely compelling\n"," One of the most sophisticated and unjustly forgotten slasher films of its decade\n"," Dark and gritty backwoods slasher madness\n"," One of the Better Backwoods Slashers\n"," High Grade Thriller, Funky Ending(No Spoilers so relax)\n"," The latest synonym of 'Horror'\n"," This movie rocks.\n"," Great Thriller\n"," Take me to your backwoods now\n"," Calling it \"Average\" is about the best I can do\n"," Possibly the best backwoods slasher ever made.\n"," S10 Reviews: Just Before Dawn (1981)\n"," Probably the best of the backwoods slashers...\n"," On my Top 5 List!\n"," great classic slasher movie of the 80s!\n"," Just before you hit eject...\n"," Very Good Slasher Flick\n"]}