{"review-url":["http://www.imdb.com/title/tt0026313/reviews"],"review-text":["This version of \"Enchanted April\" isn't as ethereal or delightful as the 1992 version, but it does has a certain charm.  Mainly conceived as a vehicle for Ann Harding (who was a big star in the mid-thirties, but not well-remembered today), the pacing is somewhat slow and almost appears to be a filmed stage play.  We don't \"see\" and \"feel\" the changes everyone undergoes as a result of staying in the Italian villa (as we do in the remake), but Ann Harding does her best to get that point across.  She is ethereal and pretty, and her \"hothouse flower\" talent would seem well-suited to the part.  It's interesting to compare the two versions and see how the 1992 version managed to successfully capture the flavor of the period without sacrificing anything to a modern movie-going audience's baser expectations for entertainment.  See both versions!","Four unhappy women leave dreary London to spend an ENCHANTED APRIL in a castle on the coast of Italy.Elizabeth von Arnim's novel comes alive in this charming little film which beautifully demonstrates the virtues of a literate script and ensemble acting. All the elements come together to produce a movie that, although nearly forgotten now, still produces a feeling of appreciation at the story's appropriate resolution.The actresses each acquit themselves splendidly. Ann Harding is the free-spirited wife longing for 'wisteria & tranquillity' far from foggy London. Katharine Alexander plays the quiet housewife wishing for the elegant responsibility of acting as hostess in the castle. Jane Baxter is the beautiful young noblewoman temporarily escaped from her throng of male admirers. Jessie Ralph steals every scene she's in as an old lady wanting only to be alone with her memories of the past.The men in the story are also well cast. As Miss Harding's husband, Frank Morgan has a rather complex role as a mousy researcher who has a disturbing personality change when he becomes a successful writer. Reginald Owen, as Miss Alexander's spouse, is marvelously pompous as a man well equipped to bore for England (his hilarious attempt to take an English bath in an Italian bathtub is made even funnier with the assistance of Charles Judels & Rafaela Ottiano as the castle's harried servants). Finally, Ralph Forbes, one of the decade's finest forgotten actors, is joyously eccentric as the ladies' lighthearted landlord.Movie mavens will recognize an uncredited Ethel Griffies playing the proprietress of the Hampstead Housewives Club.","I had been delighted to find that TCM was showing this, as I love the 1992 version with Josie Lawrence, Jim Broadbent, Joan Plowright...This film had a luminous Ann Harding, a wonderful performance by Frank Morgan, but others' acting made the film more of a farce then the wonderful unfolding that the later film. Reginald Owen's Arbuthnot is painful to watch and you can't understand why his wife adores him. I found out after watching the film that it was based on the stage play where the 1992 film is based on the book. The original film also felt like it was a snippet of a larger piece and felt incomplete. Too bad it was such a let-down.","The basic story idea of ENCHANTED APRIL is excellent--two very unhappy wives meet and decide to pool their funds to rent an Italian villa for a month. To further defray costs, they get two other strangers to come along. What makes it interesting are the relationships both before and during this vacation--in particular, showing how this beautiful setting actually changes their outlooks on life. Unfortunately, this good idea is totally spoiled by two key performances in the ensemble cast that are so bad that they ruin the film. Ann Harding plays the most important role in the film in a manner that makes her seem ridiculous. Her \"doe-eyed\" expression and vacant stares really make you wonder if this isn't a zombie movie or she's just meant to be an idiot! And to make it worse, Reginald Owen plays a character so obnoxious and bombastic that I was very close to turning off the film--he was that awful and unbelievable. I noticed that at least one reviewer gave this movie a 10--which is very, very difficult to understand. Sure, the film has great ambiance and a good plot, but these two glaringly silly performances cannot be overlooked as they undermine the rest of the picture. Sorry, but this film was aching for a re-make!","I found this to be a tremendously disappointing version of a charming story. I thought the acting was on the whole quite good. Reginald Owen did chew the scenery, as mentioned by others, but I found him moderately amusing in his brief scenes. TCM has made an Ann Harding fan of me, and I thought she was fine as usual here. Jessie Ralph had a field day as the old battleaxe, ordering everybody around, and Frank Morgan, as always, played Frank Morgan with a twinkle.For me, the problem was the script and/or the editing--transitions were awkward, motivations were murky. The movie was just too darned short to convey the story properly! I felt completely let down, particularly since I had such fond memories of the later version.","While Ann Harding and Katharine Alexander are charming as Lotty and Rose, too much time is spent on their husbands, played by Frank Morgan and Reginald Owen. This may be closer to the structure of the play and novel, but it deflates the women's roles when the whole point is their blossoming at the Italian villa.Also shortchanged in this 66-minute version are Mrs. Fisher and Lady Caroline (Jessie Ralph and Jane Baxter) who hardly get to establish their characters. While the basic plot exists, the lush detail that makes the 1991 version so delightful is completely missing. We only get a hint as to how the women change during their enchanted April.While Morgan does an OK job as Wilkins, Owen is overbearing and oafish as Arbuthnot and he dominates far too many scenes with his over-acting. Ralph Forbes, as Briggs the landlord, also gets little to do, and his ultimate attraction to Caroline is pretty much bypassed in favor of reconciliation between Harding and Morgan.The power of the 1991 version lies in its focus on the four women, their growing friendship, and how their enchanted April breaks down the differences in their ages and social strata (very important in 1920s English society). This version smartly downplays the men's roles as secondary to the women's. The 1991 version is a story about how women can grow when freed from their marital and social roles. The 1935 version never gets to this as the women are subservient to the men.Worth seeing for Ann Harding, but don't expect the magic of the 1991 version.","Enchanted April was one of Harry Beaumont's last movies- he only directed a few more after this one. He had made the \"Maisie\" movies in the 1930s and 1940s. In the opening credits, it says \"From the novel by Elizabeth\", and completely leaves off the author's last name... rather odd, but since it was von Armin, they may not have wanted the German association at the time... Sad to hear it was a flop when it was released, with those fun names like Frank Morgan (the Wizard) and Jessie Ralph, who played W.C. Fields' disapproving mother- in- law in \"Bank Dick\". Two gals in London (Ann Harding & Katharine Alexander) decide to rent a castle to host two of their friends, but things don't go the way they planned. Reginald Owen plays the husband with multiple personalities. Aside from a few funny moments, it DOES move pretty slow. Ralph is the only bright spot here, as the overbearing take-charge type, and the picture is quite fuzzy and out of focus for much of the film. The views of Italy are all obvious backdrops. The only saving grace here is that the Turner Classic version is only 66 minutes long. Too bad they didn't give Frank Morgan a larger role. This was remade in 1992 by the BBC as a British Film.","The 1935 version of \"Enchanted April\"  manages to be simultaneously tediousand perfunctory. It is difficult to show the transformative magic of Italy shooting in a studio with only stereotypical Italian behavior to belabor. The transformation of the four strangers fleeing London is instantaneous in the cut from the first day to a week later. Rather than develop, the screenplay flips a switch and thecharacters are different.The husbands are boring enough in flashbacks without turning up, even if their presence does not drive the four women back into their shells and/or hostilities.Jessie Ralph has the most fun (moving instead of entirely chewing up thescenery) and Katharine Alexander has some poignant charm out of herhusband's shadow (and away from his hideous droning). Ann Harding isunremarkable here (with the Production Code being enforced). She had anappropriate line in an earlier (pre-Code) movie, \"When Ladies Meet\": \"You'renot worth a minute of one anxious hour that either one of us has given you,\" but in \"Enchanted April\" can only look hurt, rush out, and proclaim fealty to her errant husband.","\"Elizabeth\" was the author's pen name (the original novel was published as \"by the author of Elizabeth and her German Garden\"), so it wasn't the film company who suppressed her German surname.I caught the last part of this on early morning TV today, and thought it would be interesting to compare it with the delightful 1991 version.I was puzzled that the two couples seemed to have inexplicably swapped names; it should be Mr. Wilkins who has the accident with the water heater and Mr. Arbuthnot who fancies Lady Caroline. The bathroom incident was funny but after that the film seemed to end rather quickly. I thought it very disappointing in comparison with the remake.","The major film studios worked on tight schedules, tight budgets and tight running times back in the 1930's, so unless you were David O. Selznick over at MGM filming a movie version of a Charles Dickens novel, you weren't given much to work with in the movie versions of popular books at the time. The studio heads wanted to fill in as many screenings as possible, so between previews, travelogues, short subjects, newsreels and cartoons, that didn't leave much time for a film over 70 minutes. In the case of the low key \"Enchanted April\", RKO timed it just as they did most of their other films. Another popular novel of the time (\"The Age of Innocence\") was luckier that it got 81 minutes, compared to the 2 hour plus running time of the 1990's remake. The 1991 remake of \"Enchanted April\" is 25 minutes longer than this version which trims the fat out at the expense of some character development, and that basically turns the eccentric society matron character that Joan Plowright got an Oscar nomination for into a typical harridan, played here with imperiousness, humor and eventually affection by the unforgettable (but sadly forgotten) Jessie Ralph.The two female leads here are Ann Harding and Katharine Alexander, two old friends from London neglected by their husbands who decide to pool their resources and rent a castle in Italy for a month. They tell the audience their back stories that involve either an imperious, braggart husband or a milquetoast writer who found success as an author by a scandalous book on Madame DuBarry which changed his personality. Harding, who always played great ladies, gets to get out of her tightly wound blonde bun and show a bit of spirit here, and when she wakes up in the morning, hair completely down, to see the shadow of a bird chirping outside her castle room and the sound of a mandolin in the background, she looks radiant. Harding and Alexander arrive at the castle to find two other invited guests (Jane Baxter and Ms. Ralph) having taken over the main rooms, with Ralph so determined to remain uninvolved with the other guests that she vigorously pushes her desk in front of the door and saunters off with her cane, even though she's obviously well over the age of supposedly doing anything so physical. But somewhere in a week's time in unseen footage, Ralph lightens up to the other ladies, and after having eyed Harding up and down with suspicion, tries to hide her glee when Harding gives her a loving kiss on the cheek for coming out of her crabby shell.The mix of comedy and romantic drama erupts with the arrival of the husbands: Reginald Owen as Alexander's brash, braggart spouse, and Frank Morgan as Harding's now popular with the ladies hit author whose sudden meeting with Ms. Baxter indicates that there's been something going on that his wife was unaware of. Owen gets the infamous bath scene, one of the comic highlights of the 1991 version, aghast that castle maid Rafaela Ottiano would dare to stay in the bathroom as he prepares to disrobe, and later encounters both Baxter and Ralph wearing nothing but a towel, and completely unaware of his lack of clothing. Morgan, too, gets a hysterical entrance at the castle, surrounded by Italian locales while riding a donkey and trying to shoo off the chattering crowd as he argues over the inconvenience of paying for a ride on a beast that trotted along slower than he could walk. Yes, this doesn't have the detail of the book or the 1991 film or the later Broadway revival of the play (where Elizabeth Ashley commanding much attention in the Ralph/Plowright role), but there is a sense of romance to it, and just as April brings a new life to the world after the coldness of winter, this April brings new life to the two marriages that had been cold for a lot longer than any winter could be.","Many other reviewers inexplicably focus on how the 1935 adaptation of Enchanted April isn't faithful to the 1922 source novel by Elizabeth von Arnim or is somehow inferior to the longer 1991 version. Sadly for them, they're missing the point. Firstly, this is a work complete in and of itself, and neither enhanced nor diminished by specious comparison to a related work. Secondly, it isn't actually based directly on the novel, but the successful 1925 Broadway play that the novel inspired, hence this being a US as opposed to European-made film. A single viewing makes this fact abundantly clear. What's more, at a mere but adequate 95 minutes, the excellent 1991 version is not – and could not – be faithful to the novel either.What we do have here is an utterly charming and concise little film that, despite its US studio-bound production, effectively establishes both mood and mise-en-scène, especially by clever use of rear projection, matte paintings and spacious, well-appointed sets. Even within the necessarily limited characterisations and plot development dictated to by its abbreviated running time of 66 minutes, it manages to squeeze in much humour, both subtle and slapstick, wry, witty dialogue and an unexpectedly powerful and poignant ending. Lastly, and perhaps most of all, it leaves you wanting more; what more could one ask of any film? Enchanted April is a masterclass in brevity and economy in its storytelling and filmmaking, and is highly recommended to all fans of early talkies.As for actually seeing it, aside from infrequent TV airings, as of 2017 is via the only authorised home video release: a 2005 region 2 French DVD on the Editions Montparnasse label, titled Avril enchanté. It features a very clean print from an unconverted NTSC- PAL master, hence its unaltered running time, and optional French subtitles in a small yellow font. Additionally, there is an informative 2½ minute intro – in French, sans sous-titres – by film historian and restorer Serge Bromberg of Lobster Films. Just be careful to avoid the lesser- quality counterfeit Spanish DVD, titled Un Abril Encantado, on the Vértice Cine label.You're in for a rare treat – enjoy!"],"review-user":["eastofeden87","Ron Oliver","arwebevenstar","MartinHafer","PeterPangloss","drednm","ksf-2","som1950","k.m.bunting","mark.waltz","BrentReid"],"review-date":["17 July 2000","27 October 2003","3 June 2005","2 June 2007","4 June 2007","20 March 2017","13 May 2008","31 July 2004","1 February 2014","10 September 2018","14 April 2017"],"review-rating":["6","10","3","4","4","9","4","3","3","6","9"],"review-title":[" A charming little film.\n"," Beguiling Version Of Classic Story\n"," Disappointing version...\n"," A decent story idea marred by horrible characterizations--this one was aching for a re-make\n"," Disjointed and perfunctory\n"," Cannot compare with the 1991 remake\n"," slow novel-to-play-to-film story of a vacation get-away.\n"," Sketchy, but still tedious (plot spoiler warning)\n"," Disappointing\n"," You too, might be enchanted, that is if you don't bash the fact that it's not the remake.\n"," Ann Harding's the star but everyone shines in this highly enjoyable early talkie\n"]}