{"review-url":["http://www.imdb.com/title/tt0033496/reviews"],"review-text":["When I was very young, my mother had a series of four Looney Tunes/Merrie Melodies shorts on tape and I watched them all several times. A Coy Decoy was one of these shorts, and I was truly shocked to read in another comment that it had been banned. When I was young I probably did not even understand the Black Beauty gag to begin with. Still this is probably why it was banned, though until I watched this on a video site, I did not even remember the gag. Upon viewing the video I did remember certain shots - in particular the shrinking of Daffy's hat and Daffy's eyes becoming clockworkish as the decoy circled him in The Lake. I was not bothered by the gag that was most likely the reason the gag was banned. Instead I was flooded with childhood memories of watching this short. Because of how much I liked this short as a child, I rate it 7 out of 10.","There is only one racist joke in this Daffy Duck short, which is basically, when Daffy rides Black Beauty, it is a black woman. I can understand partly why this joke was included, as at the time few people did not know how rude it was to be racist and it wasn't even illegal to discriminate black people yet.Aside from this point, \"A Coy Decoy\" is basically a fun, interesting short where Daffy meets characters in books and does things in books. I liked this short quite a lot (despite the other reviewers on here). The way Daffy is so in love with the clockwork duck is vaguely disturbing, yet highly amusing at the same time. Porky is a nice edition to the episode, though it was not vital for him to be there. The wolf is an example of how people thought of wolves in those days as well, blood-thirsty, terrible animals, which of course they never really have been (unless they are very hungry). I also liked the style of animation used - and the theme of the episode.For people who are totally into Daffy Duck and for people who do not mind the occasional racist joke in cartoons, enjoy \"A Coy Decoy\"!Available on YouTube.","Like the Silly Symphonies, the earliest Loony Tunes were more interested in exploring the possibilities of animation than in making a lot of sense. In A Coy Decoy' at least the title is apt. There is a book sale going on and when nobody is looking, the characters on the covers come alive. Every cartoon had to have a song in these days, so we start off with a medley by The Westerner' Porky and Ugly Duckling' Daffy. Porky is really only there at the beginning because they needed somebody to set up the punchline at the end. The rest of the movie belongs to Daffy. The Duck cracks a rather racist gag involving 'Black Beauty' at the beginning, but since he's black himself he can probably get away with it.Daffy moves to another book, The Lake', while the Wolf of Wall Street' uses a toy duck (the title character) from yet another book to snare that screwy duck. When Escape' is blocked  Daffy makes use of Hurricane', The Mortal storm' and Lightning' to get rid of the wolf, For whom the bell tolls'. We also find out that The Bridge of San Luis Rey' is about a pair of dentures. The main characters don't really have to act, just be themselves: Daffy has to be crazy, the Wolf has to be hungry and Porky, well he never had much reason to be anywhere anyway. In the end 'A Coy Decoy' does not amount to much more than a song, a chase sequence, lots of puns and of course a reference to the war.5 out of 10","Love animation, it was a big part of my life as a child, particularly Disney, Looney Tunes, Hanna and Barbera and Tom and Jerry, and still love it whether it's film, television or cartoons. Actually appreciate it even more now through young adult eyes, thanks to broader knowledge and taste and more interest in animation styles and various studios and directors.Have a lot of appreciation and admiration for Bob Clampett, with a visual and humour style so distinctive and easily recognisable. His early work was very variable but when on top form and in his prime the best of his work was great and even more. 'A Coy Decoy' is not one of Clampett's best. It is a decent cartoon though, even if there are funnier, wittier and fresher cartoons from him, and did see some of Clampett's unique style all over it and being at ease with the material. Will agree with anyone who found the 'Black Beauty' gag in not particularly good taste, the stereotypical nature is far from subtle and it was not very funny on top of that. For me, despite liking Porky on the whole and usually his partnership with Porky is legendary, he is a bit bland here and didn't really see the need for his inclusion considering the cartoon doesn't do much with him.However, Daffy as ever is a sheer delight, it is hardly surprising why he is one of animation's best, most interesting and most popular characters. He is just so much fun to watch and his manic personality is so well suited to the material. Supporting characters are far from forgettable and provide a lot of fun. The wolf matches Daffy beautifully and the literary characters are fun to spot. Mel Blanc as always does a fantastic job with the voice work, showing an unparalleled ability to bring individuality to multiple characters. The animation is as always atmospheric in crisp black and white, with lots of smooth movement, imaginative detail in the gags and rich and meticulous detail in the backgrounds. Carl Stalling's music score is as ever high in energy, liveliness, character, lushness and whimsy, and not only is dynamic and fits effortlessly with the action but enhances everything. Beethoven's \"Moonlight\" sonata is used inspiringly.What's more, 'A Coy Decoy' is enormously entertaining elsewhere, with some amusing wildness, wit and bite starting to show at this point in the dialogue. Plus there are some beautifully timed and animated and imaginative sight gags, that contain some surprises and a lively pace. Sure, familiarity with what is being referenced is in order which wasn't an issue for me being one who was familiar.Overall, decent if not great. 7/10 Bethany Cox","\" . . . comes around.\" This theme was the topic of Today's (that is, 7-21-17) \"Science Friday,\" an American radio program on the NPR network. The featured guest today was the author of \"Hitler's Last Fart,\" who scientifically proves that EVERY breath that ALL eight billion people alive Today take contains part of NOT ONLY Hitler's LAST Fart, but also molecules from ALL of Hitler's Previous Farts (and Der Fuhrer was notoriously flatulent!). THE COY DECOY brings a whiff of Fresh Air to the Study of the Gas Giants, as it pictures (literally, at 2:25) \"The Wolf of Wall Street\" (Red Commie KGB Chief Vlad \"Mad Dog\" Putin, who has merged Communism with Job-Killing Corrupt Conservative Capitalism through his pawns in the Rump\\Kushner Crime Syndicate). Putin's most deluded tool, White House Puppet Don Juan Rump, is depicted here by Warner Bros.' always prophetic Looney Tunes prognosticators as Daffy Duck, who boasts that he is sporting \"dishpan hands, flat feet, B.O., halitosis, ingrown toenails, and a midget member.\" (Rump's Sychophantic relationship with Russia is underlined by Warner's clairvoyant Animated Shorts Seers at 4:45, when Daffy performs a hand job on The Wolf's right fang, after delivering lingering caresses to Putin's snout). THE COY DECOY of the title references KGB operative Melancholia Rump, of course, who births a puzzling decoy hybrid offspring to close out this Extreme Early Warning to America from Warner Bros.","Bob Clampett's precursor to his more famous \"Book Revue\" starts off looking like a Porky cartoon, but turns out to definitely have Daffy as the star. It's a more low-key portrayal of books coming to life, with Daffy caterwauling. But then, The Wolf of Wall Street (aren't all Wall Street types wolves?) sets a trap for him.\"A Coy Decoy\" was probably one of the placeholders that the Warner Bros. animation department cranked out in between the really famous cartoons, especially since 1941 saw Bugs Bunny's undeniable ascension to super-stardom. The cartoon is really obvious as a Bob Clampett cartoon when Daffy is unwittingly hugging the wolf, and the wolf's snout starts looking rubbery. But without a doubt, the really fine phase of Clampett's, Daffy's and Porky's careers began in 1942, and was fully evident in Clampett's 1943 cartoon \"A Corny Concerto\".So, this one is OK, not great.","Not even cartoons are immune to remakes. Five years after making 'A Coy Decoy', Robert Clampett would remake this cartoon as the better (and better-known) 'Book Revue'. Both toons have the same premise: a wolf chases Daffy Duck through a bookshop, with the titles of the books supplying gags.We get here one of Clampett's typical racist jokes: Daffy falls into a copy of 'Black Beauty' and emerges riding a kerchief-headed 'mammy' stereotype.One thing that bothers me about both this 1941 cartoon and its remake 'Book Revue' is that most of the so-called 'book' titles in both toons -- such as 'The Wolf of Wall Street', seen here -- are actually movie titles. In cases where a title could apply to both a book and a film (such as 'The Bridge of San Luis Rey' here, or \"Dante's Inferno\" in 'Book Revue'), it's obvious that the audience were expected to think of the movie rather than the book. Either the Warners scriptwriters didn't know many book titles, or else they wouldn't give their audience credit for being literate. In 'A Coy Decoy', I was pleasantly surprised to see references to 'The Yearling' and 'For Whom the Bell Tolls', best-selling books which (as of 1941) hadn't yet been filmed.'A Coy Decoy' gets its title from a plot development here which wasn't used in the remake: the wolf uses a clockwork female duck to entice Daffy. This is a running theme in many Clampett cartoons, continuing right into his 'Beany and Cecil' era: a male protagonist is lured by an artificial female; either a male in disguise, or else a mechanical surrogate (a fembot?). Clampett seemed reluctant to put genuine female characters into his toons.There's a nice tinkling music-box motif for the she-duck (Warners cartoons almost always had excellent music tracks), and there's a cheeky final gag, one of Clampett's less obvious sexual entendres. That final gag is the only place where this cartoon surpasses its remake 'Book Revue', which is superior all down the line until it ends in a weak 'cissy' joke (another of Clampett's predilections). I'll rate 'A Coy Decoy' five points out of 10. Take out that unnecessary racist joke, and I might bump it up to six.","1940's cartoon, banned nowadays probably because of the 'Black Beauty' gag, in which Daffy rides a black person as if it were a horse.The whole story takes place in a bookstore, where the characters of the books come to life every evening. So we have, among others, the Ugly Duck (Daffy) and the wolf of Wallstreet. They wind up in a chase after the wolf tricked Daffy with a phony duck (hence the title).And chase is all there is in this little cartoon, that doesn't have any real appeal nowadays. Only fun if you're a true fan of the Looney Tunes I guess...4/10."],"review-user":["Char12345","Mightyzebra","Chip_douglas","TheLittleSongbird","oscaralbert","lee_eisenberg","F Gwynplaine MacIntyre","TheOtherFool"],"review-date":["26 October 2008","9 March 2008","29 February 2004","11 June 2018","21 July 2017","27 March 2010","1 February 2007","11 June 2004"],"review-rating":["7","8","7","6","6","5","4"],"review-title":[" I watched this short several times when I was a little girl and was surprised to find out it had been banned!\n"," Despite being slightly racist, I like this.\n"," This is why they call them Looney.\n"," Book covers coming to life\n"," The message of this brief cartoon seems to be \"What goes around . . . \"\n"," book preview\n"," A preview of 'Book Revue'\n"," Lame Duck, A\n"]}