{"review-url":["http://www.imdb.com/title/tt0064855/reviews"],"review-text":["This film had about everything one could wish when viewing it originally, at the end of the 1960's decade. It was immensely entertaining, and provided a contemporary view of the many changes which had occurred during that period - and were still ongoing - in terms of the Black Power movement, Vietnam, and the volatile movement which followed the quieter, preceding postwar 1950's.All of this and one of the funniest films, then or now.Viewing it for the second time recently, I was surprised to find it as engrossing as when seen originally. Its humor is as funny, and its message as strong.And in viewing it now, you get all of this, while at the same time gaining the added enjoyment of its being a \"period piece,\" and a superb chronicling of its this historic, turbulent time.","When someone refers to the independent cinema realm in the United States it's often inferred that it means the filmmaker or people behind the project had much more creative freedom and did what they wanted. This, today, is not really always the case unless someone is a solid \"auteur\" and creative freedom still comes with the caveat that one has to find distribution with one of the independent divisions of major studios or by getting picked up somehow for some kind of low-level deal at a worthwhile film festival. But Putney Swope, Robert Downey Sr's film about a tough-as-nails African-American accidentally promoted to head advertising guru at a production company, *is* independent cinema, the kind of work that went right along with the likes or Romero's Night of the Living Dead and Cassavetes Faces at the same time of getting no real typical studio distribution but causing waves, kicking ass and taking names in the cinema world. For all its moments that are rough and crude, it's unforgettable.It's also a film that is funny, very and excruciatingly funny. Sometimes the sense of humor is just so ridiculous it's nearly impossible not to laugh, from the mere appearance of the President Mimeo with his wife to lines of dialog from the advertisements Swope's team puts together like \"I can't eat an air conditioner\" in a real \"soul\" voice. It is as smart as the audience it is aiming at, which is anyone with two brain cells to put together who can see that this work isn't offensive or *too* shocking because it's meant to rattle the cage, and it does this pretty well in the first five minutes. Once that's past Downey Sr goes on his blitz of sorts as far as being a filmmaker with nothing to lose: his protagonist is part Fidel Castro, part Isaac Hayes circa 1972 (and yes it's 1969 in the film) and part hard-assed ad exec with a firing streak to make Mr. Spacely on the Jetsons look kind. And don't forget those side characters, dear God.There's so many memorable lines and moments that it's hard to keep track. From maybe the most hilarious botched assassination attempt in any movie to the one ad for \"Face-Off\" skin cream that includes lines that would give South Park a run for its dirty-mouth money, to just little asides with the one guy from Jack Hill's movies playing the Muslim who keeps giving lip to Swope and that one boy with the the nun who curses up a storm and impresses Swope in a swift stroke. It's a pretty direct message about media and advertising, but there's also a lot of powerful moments where it just hits the nail on the head about racism in America, sometimes without having to do more than a gesture and sometimes with doing something HUGE like having black panther types going this way and that around Swope's advertising regime. And for a low-budget production (I mean super low, hence the comparison to Night of the Living Dead and Faces) Downey got some really good actors, all non-union, and it's hard to imagine that some of them might have had their first time on camera here.It should be mentioned that Downey's style doesn't make it perfect: it is crude and sometimes too crazy and dated for its own good, and I'm sure I didn't get some of the underlying humor of a couple of the ads since I'm from a full generation after these ads were aired (albeit the \"Miss Redneck Jersey\" was definitely not lost on me). In general though this is one of the finest of its time period, a satire that stings and a feature with a predominantly black cast that is all too knowing of what comes from an excess of power, regardless of skin color. It is, as someone might say, \"good s***.\"","Robert Downey Sr's PUTNEY SWOPE is an outrageous stab in the back of the advertising world.  Apparently, Downey had a nose-diving career in the advertising industry, and this film are all his \"I hate this job\" daydreams while trying to endure it.  The opening Boardroom scene is some of the most bizarre, wacky and brilliant satire ever committed to film.  It's the story of the accidental voting-in of the Board's token black man as President of the agency (he's their Music Director).  From there, Downey's daydreams turn the struggling white-led advertising company upside down and into the successful black-run \"Truth And Soul\" advertising agency (Complete with what you might call a corporate Intranet: \"The Drum\" -- see the movie, you'll understand).  The movie is refreshingly un-P.C., with dialogue like, \"I'm a happy Chink!\" and the proposed advertising campaign that has Colombus meeting Indians with \"cleft heads.\"  Oh yes, and a pot-smoking midget President of the U.S.A.  There's one thing that is really annoying (to me, anyway; others don't seem to mind): that the lead character's voice appears dubbed.  WHY did they do that??  Was the actor unintelligible or something? In fact, looking at the credits for this flick, I see that Downey himself provided the voice for Swope.  I sure wish he'd email me with the reason why...  Also in the cast is actor Alan Arbus, himself a one-time Ad-man. If you like bizarre outrageous humor, this is a definite for you!","This movie shows that the free enterprise system and the quest for the almighty buck transcends all racial and ethnic barriers. Ultimately the market place determines the message that is sent to the public. This movie dramatizes that point. A conservative white-collar advertising company is taken over by a group of street-wise African Americans chaired by a no-nonsense black man who wants to make a buck and believes he can sell products by telling the the truth. But the movie shows that no matter how hard he tries to do something different, the market place and the political system demands that he conform, rendering him no different than his predecessors. Interesting, off-beat movie.","Certainly one of the most hilarious films of all time. Excellent original music, clever, heady...it's hard to be articulate about something this good. There isn't one character that you don't instantly love to watch- Myronex \"Putney, there's trouble in the black room!\" \"My name is Rufus.\" The lines, thrown away left and right, are classics themselves, recalling Slapshot, Caddyshack, Anchorman, Repoman, Dolemite, any comedy whose dialog is not of the formulaic set-up punchline variety. \"Putney, Myronex called you tasteless!\" \"My organization is pro-integration...\" \"Where's Lopez? 'He's in my head'\" They don't sound brilliant until you hear them in the context of the scene. ...This movie will eat your brain, it's too good. I've read reviews calling this film racist, which couldn't be farther from the truth. Every scene is gold, from the Etherial Cereal commercial to the Brothers In the Black Room meeting to that haunting trumpet in the closing scene. One word - genius.","I can't say how many times that one line has made me laugh or how often I've described that scene to folks not familiar with this film. I saw it the year it was released, I was 19. I don't think there were a dozen people in that East Village theater that night. For years I thought we were the only ones who saw it. Nice to see here that others found it as hysterical as I had, and see it's lasting value despite the time gone by. Rent it, buy it or steal it.... a must see.","Made at the height of the Black Power movement, this movie portrays African-American Putney Swope (Arnold Johnson) getting made CEO of a corporation after the white CEO dies (the white executives all hate each other and can't decide who should succeed the previous CEO). Once in power, he decides to turn it into a militant organization.I don't know how Robert Downey Sr did it, but he did it! \"Putney Swope\" is the ultimate jab at America's power structure. It's the sort of thing that seems like it would have come out of Richard Pryor's mind. This is a comedy classic in every sense of the word. A real masterpiece. Hilarious.","I thought I might be disappointed viewing this film again after so many years. On the contrary, I was more impressed now than in my callow youth with its honesty and brave humour. In 1969, the transition among African-American groups from a predominant policy of conciliation and integration to one of confrontation and self-determination was still quite new, and more than a little controversial. It took courage and finesse to portray both the Establishment and the Anti-establishment as the caricatures they often closely approximated in real life. Special mention should be made of Arnold Johnson's performance: he successfully avoided having his character lapse into either sociopathy or buffoonery. I'd rather watch this than \"To Sir With Love\" any old day!","\"Putney Swope\" is a unique, low low low budget gem from the late 1960's which probably would have been forgotten in time if it hadn't been for two things: Paul Thomas Anderson (who named Don Cheadle's character in \"Boogie Nights\", Buck Swope, after the eponymous hero of this film) and the limited DVD release. Watching \"Putney Swope\" is like listening to hardcore punk rock: it may not make a lot of sense (at least to me it didn't upon watching it for the first time), but you have to respect the film for its passion and unabashedly rebellious message. I didn't understand a lot of things about \"Putney Swope\", but for the most part, I liked it. The more I think about the movie, the more it grows on me.The film is advertised as a parody of New York's Madison Avenue, best known in the 1960's as the advertising capital of the world. Members of Generation X and Y may be lost on this concept, but fortunately \"Mad Men\" is on TV to provide us with this otherwise lost piece of U.S. History. What you need to know before watching this movie is that these ad agencies were largely male, and even more largely white establishments.With this premise in mind, the movie opens up with an ad agency board meeting. The members are predominantly white except for Putney Swope (Arnold Johnson, who bears an uncanny resemblance to Dick Gregory in this film), the token African-American on the board. The board members are so self-absorbed and soulless that when their chairman falls dead in front of them, their only concern is who will become chairman next. Without even removing the body from the boardroom, they begin a paper ballot to elect the next chairman.Putney Swope is elected by a landslide, but not because the other members think Swope is qualified. Voting for Swope was an ill-fated attempt for these board members to sabotage any other member's chance of being elected chairman. With their plans backfired, Swope takes charge and \"sink(s) the boat\", firing all but one of the original members and hiring all people of color in their place .After this point, the film became (for me) very weird and hard to follow plot-wise. There may not have even been a plot, really. The whole idea of the film seems to be a \"what if\" scenario, with the result being that the new \"Truth and Soul Inc.\" firm would be unconventional, but successful nonetheless. The firm ends up making so much money that the members build a huge glass case to keep the cash in for unexplained purposes. It could be because Swope doesn't trust banks, although that point is not touched upon or explained in the film. It could also be metaphoric in some way, but who knows.Most of the movie takes place inside the ad agency, with occasional scenes in the White House with a president who, for some unknown reason, is a midget. My assumption is here that some political joke was being made, but I can't figure out what. Were the filmmakers saying that the president is a small, insignificant part of American life? Were they saying that the latest elected officials (Nixon at the time) were insignificant candidates? I don't know. I found it a bit eerie, however, that the man playing the president bore a striking resemblance to future president Ronald Reagan. It is funny to make that connection 40 years after the movie was made.What this film may have benefited from is showing how consumers outside the ad agency reacted to the new ads. Of course, the ad footage possessed a strange, funny appeal for its unconventional creativity, but did these ads convince people to buy the product? If so, how? The movie hinted on the idea that the new ad campaign was successful through client interaction and the calls from the White House. However, it would have been revealing to see average people, since that demographic has always been most profitable for advertisers.Although the parodies and political messages this film may have made probably didn't stand the test of time, this film still had a lot of unique qualities. Arnold Johnson had a magnetic X factor to him that benefited him greatly in this film. Swope's rough voice was actually director Robert Downey, Sr.'s voice dubbed in, sometimes poorly, but fit the character so well in being an authoritative outsider. He hires and fires workers at random, but earns the respect of all but one of the employees for revolutionizing the ad agency and seeking out new ideas.The premise of the film was, and still is, incredibly risky, especially since the film was written and directed by a white man (Robert Downey, Sr.). However, this film declines to fall victim to negative black stereotypes which would lead to the rise and fall of the blaxploitation genre years later. Although some of the sex scenes may be a bit off-putting for some viewers, the main message is that a black owned and operated business can thrive through innovation and risk taking. Many people may not take a positive message away from this movie, but I just did.\"Putney Swope\" remains an overlooked movie from a strange era, and Downey, Sr. (even despite his son's recent comeback) never quite got the recognition as a director he deserved. However, if you find a DVD of this movie, buy it and watch it. If it's on Netflix, ditto. It's a movie that can be confusing at times, but is worth watching for its gusto, ambition, and its non-conformist stature even by today's movie standards.","1969 was the year. New York City was the place. Putney Swoope was the second Robert Downey film to achieve some recognition. The first was Chaffed Elbows (1966). Putney Swoope achieved a much wider release. Pound (1970) and Greasers Palace (1972) were even more profane and obnoxious. Those 2 films were mean spirited to the point that they actually stalled the Prince's feature film career for several years.The subject at hand is Putney Swoope. And it is a mad farce/satire that has to be seen to be believed. I'm not going to go through the plot here. What Plot?? People looking for a plot are going to be scratching their heads. Keep Scratching!! This film is not about PLOT! One could compare this to a Mel Brooks movie; only without the Hollywood parody party that Mel always threw. I also see a little bit of Monty Python in this. By the way: This film was shot before Monty had debuted on the BBC!!! I notice that the Gags and Lines that are drop dead hilarious DO NOT transfer well by word of mouth. You have to see them within the context of the film. There are some flaws in the film; but even the flaws are unique. For instance: Actors often repeat the SAME LINE over and over again; and somehow it works. How Many Syllables Mario? Putney Says the Borman Six Girl Has Got to Have Soul! etc...The B/W photography is outstanding. The Sound/Score is even better! The editing is only so-so. The acting is above average. The script is priceless. The jokes are as un-PC as you can get: MR. Bad News says \"Sonny Williams just got caught in a motel with a 13 year old girl\" Putney says \"Well at least He's not superstitious\" Uptight conservatives beware. The Anti-Establishment mindset of this film will drive you straight out of the room. Nothing is sacred.There are many things in this film that pertain to today: NO SMOKING!!! Reverse Racism; with African Americans treating Caucasions like trash. The manipulation of Mass Media over the masses; Madison Avenue, Deroit, Hollywood intentionally pedaling something that any 8 year old can tell is pure garbage; The Internet, I'm talking about \"the drum\"; Interracial dating; I could go on and on....I should also mention that there is about 8 min of this film that was shot in 16 mm Color. These are the commercials shot by Putney's agency. The spots work fairly well the first time around. They get tiresome though on repeated viewings. The real magic here is within the B/W sections of the film. It's the non-scenically lines they stay with you: \"Rent Yourself A CHORT Schmuck\". \"I love You, I Love You, I love You... did you take your pill?\". \"anything that I have to say would just be redundant\". And a host of others. I also really like the bit with the mounted minnow up on the wall: \"The game warden wanted me to throw it back... I put up such a fight, I decided to have it mounted!\" Standouts in the cast include Buddy Buttler as Putney's bodyguard #1. He should have been a much bigger star. Antonio Fargas as the Arab. He did go on to stardom on TV and in Films. Arnold Johnson has the right look as Putney Swoope. Robert Downey used his Own voice instead because Arnold couldn't remember some of his lines. Also Downey realized that He could fill in any additional dialog/jokes later on if he dubbed his Lead actor. The film does have some shortcomings. The short run time is one. I wish the beginning with the White board members would have been extended. Stan Gotlieb and Allen Garfield are outstanding. The ending seams to have been thrown together as if he just couldn't think of any more gags. All in all, this is one of the Best low-budget independent films of it's time. A time when very few indys' played outside of New York, Chicago, San Francisco and L.A. Anyone who loves satire and comedy should see this at least twice. Downey's Putney Swoope is Ahead of and Beyond it's time.","I saw this movie in its brief run in \"art house\" cinema in '69.  I found it so funny that I literally spent part of the movie on the floor, having laughed so hard I fell out of my seat.  In retrospect, years later, I thought it had been done by Melvin Van Peebles.  When I mentioned it to a friend, he said that a friend of his, Downey Sr., filled virtually every non-acting role in the flick:  Director, writer producer, etc.  He was right of course, and my memory was wrong, except that this WAS one of the funnies movies ever made.  The part of \"the Arab\" was particularly priceless.","The film portrays the capitalist establishment as a bunch of corrupt buffoons. Putney Swope, however, is different. It's a Horatio Alger story of a black man who finally made it to the top. However, Putney still has a few values that conflict with the capitalist status quo. He's not against making money, however. In fact, he's very good at it. But the difference is his values. He doesn't make ads for alcohol, tobacco or war toys. He has his principles. But eventually, capitalism wins and his greed takes over. He starts making ads that are sexist and eventually makes ads for war toys. After a schism with his radical Muslim friend his principles go down the tubes. It's a good commentary on the nature of capitalism and the role race plays in it.","Writer & director Robert Downey, Sr., a pioneer of the underground film movement in the 1960s, satirized the New York Madison Avenue advertising world with his avant-garde comedy \"Putney Swope.\" Downey doesn't confine his ridicule to advertising, but tackles black militant culture, the dynamics in Hollywood's portrayal of race, the elite white power structure, and character of corruption in any power struggle. As audacious and ambitious as \"Putney Swope\" strives to be, it qualifies as a terrible film, amateurishly made on a shoe-string budget with a no-name cast and humor that lacks hilarity. Everything about this movie reeks with improvisation. \"Putney Swope\" stirred up controversy during its initial release with its politically incorrect handling of race issues and consumer culture. Like most Marx Brothers movies, the plot is thin, providing an excuse for Downey's anecdotal gags, most of which are terrible.The chairman of a prestigious Madison Avenue ad agency dies during a board meeting. Before the body has been removed, the board holds a secret ballot vote to determine who will replace him. Each member understands that they are forbidden to vote for himself. Sheer accident occurs when everyone votes for the token black member, Putney Swope (Arnold Johnson), since none thought anybody would cast a ballot for him. Swope pink slips all but one of the white executives, surrounds himself with black, pistol packing employees, and renames the firm \"Truth and Soul Advertising.\" Swope decides to alter the face of American advertising. He refuses to accept clients whose products are alcohol, tobacco, or war toys. Swope's clients stage an exodus after he becomes the CEO, and grandstanding attracts a new line-up of clients that show up at his office lugging bags of money and prepared to suffer abuse from Swope's militant employees. Swope exploits his African-American staff, too, ruthlessly appropriating their ideas after he fires them and conjures up a number of offensive advertising campaigns, all of which are hailed as a 'new wave' of marketing genius. Incredibly, Swope's conservatism proves successful but the agency becomes the target of government operatives who argue Swope's advertising tactics constitute \"a threat to the national security.\" The high point of this black & white, 85-minute comedy are the television commercials shot in color. Unfortunately, Downey doesn't know when to cut off these ads that consistently start out cleverly but wear out their welcome. The funniest part of \"Putney Swope\" involves our eponymous protagonist's dealings with U.S. President Mimeo in Washington D.C. (Pepi Hermine), a marihuana-toking midget with a Kissinger-like Teutonic adviser (Larry Wolf) spouting tasteless jokes while trying to convince Swope to come up with an advertising campaign for his new car, the Borman 6.","When the chairman of a major advertising corporation stutters himself to death over a conference table, the token black board director takes charge and vows to not only rock the boat, but sink it as well, transforming the company into a wildly-successful and massively influential anti-white, anti-establishment three-ring circus. Very much a product of its time, this non-conformist comedy may have once been daring and outrageous, but what was meant to be vulgar in 1969 looks merely dated today. The result is a rambling, scattershot collection of rude gags and raunchy humor, maintained at an enjoyable antic pace and bound together with only the thinnest facsimile of a narrative thread. Some of the jokes hit their targets squarely, but others miss by shamefully wide margins.","If you get a chance to get a hold of this lost (for many years) gem, I doubt you will be disappointed. PS has an odd blend of social satire and ultra-cool blaxploitation-- even hints of slapstick, but it's so odd that it was not only ahead of it's time, nothing has been seen like it since.\nI strongly disagree with people who say that the film is dated, especially with Spike Lee's \"Bamboozaled\" (SP?) a few years back which was a misfire of trying to capture the same message. (Good filmmaking, disjointed script.)\nRobert Downy's direction is brilliant, allowing many of his actors to improvise, the film gets better as it goes along and the jokes swagger from hit or miss one-liners that are as forgiven as those found in a Mel Brooks comedy, to sheer non-PC 'I can't believe they just said that' fun.\nFavorite parts, the commercials. The film switches from gritty black and white depictions of the ad agency to beautiful (perhaps 16mm) color and gets away with it. I refuse to hint at any spoilers, but if you get the chance to see the DVD version be sure and watch the Downey interview (but leave it until after the movie.) My vote 10/10-- most underrated film of the late 60's, early 70's. Thank you Prince.","This movie got better with time. I can't believe that it has been forty years since I saw this at the age of 15. Yes, that's right. Movie ratings were not yet a reality, so any teenager could walk into any movie. Imagine what it was like for a kid my age to see both Midnight Cowboy and Putney Swope in the same year. Imagine the times. Bobby Kennedy and Martin Luther King has just been killed but the following summer had a man walking on the moon and Woodstock. Putney Swope was the Woodstock nation's chance to stick it to the man. You'll see where Robert Downey, Jr. got his sardonic brilliance. His old man was an instant hero to kids like me. No punches are pulled in this classic, and aging hippies will rejoice when they relive this era. Hopefully, new flower children will be emboldened by it, and this current era of fascism will come under the same scrutiny my era was subjected to.","Black and white satire of a Madison Avenue ad agency being taken over by blacks. They're headed by Putney Swope (Arnold Johnson) who is determined to change things. However he turns out to be even WORSE than his white predecessors. That's about as original as this gets.I'm sure this was considered daring and shocking in 1969 but it just seems silly today. The jokes are either unfunny (the president is a midget. HOW is this funny?), cruel or obvious and the film is full of unlikable characters. It's done in a very experimental way which makes it even harder to take...or understand. The movie just gets more bizarre and surreal as it goes along. The ending comes out of nowhere. To make it worse, with the sole exception of Johnson, ALL the acting is bad. Antonio Fargas (a regular in these types of films) is especially annoying as the Arab. This gets three stars because the commercial parodies (done in bright color) ARE amusing and there's a rare good line here and there. I heard this was a cult classic but this is more interesting than good. Skip it...unless you're in experimental 1960s films.","The outrageous humor that peppers this cheap dated B&W film enlivens the leaden cynical world view behind the plot. It is obscure to the nth degree, a serious flaw. For example: Putney is on the phone to \"The President\", who is a midget and a pawn. Why? Never explained.Mr. Swope fails to take the high road, which would have turned his surprise elevation to a position of power into a grand leap forward for his Brothers. Instead he improvises, day to day, in the end painting a picture of leadership that lacks any sense of responsibility to his racial group or to society as a whole. The word \"opportunist\" comes to mind.Meanwhile \"The President\" also lacks any sense of responsibility to the role he inhabits.The cynical, or should we say realist, view of those in power is as relevant today as it was forty years ago. The humor, erotic scenes, and gross vulgarity are enjoyable, if you're in the right mood.","Sure, the film is full of black militant stereotypes and much of the jargon of the time. In that sense, the movie has indeed dated. But as a satirical look at America's number one parasitical industry, advertising, it's still on target. But just as important is the counter- message, namely the effect of big bucks on those who would make the industry more socially responsible—no promoting war toys, alcohol, etc. Thus, the movie's also about the allures of capitalism. Note, for example, how Putney's garb suddenly changes to resemble Third-World revolutionary Fidel's, just before he pulls out of the firm. For a moment, it looks like Swope's mini-revolution has succeeded among his staff, and he's moving on, maybe to spread the movement. But then, the former militants succumb to the allure of big bucks and he departs shaking his head, perhaps to hijack a plane to Cuba. Downey's final word, however, is an ironical one as the Arab (I believe) burns down the money tower leaving the metaphorical structure of (advertising, capitalism) a smoking ruin. To me, this looks like change can only succeed as a cleansing act of destruction and not as a process of reform—a message consistent with the radical spirit of the time.Whatever the subtext, there are some genuinely funny moments, especially with the commercials that play as well now as they did then. Those who compare the anarchic style to that of the Marx Bros. make a good point. The throw-away lines fly thick and fast along with the outrageous set-ups. Forty years later, it's still a hard movie to get a consistent handle on. Despite the crudities, however, the film remains a work of daring originality with some genuinely telling moments.","It is so gratifying to see so many young people(at least many of you sound young), enjoying the insane world of Robert Downey Sr. No one was prepared for this movie in 1969. No advertising ballyhoo of any kind, no interviews on all the major talk shows, and I wouldn't be surprised if some of the actors didn't even get paid. Lenny Bruce started the ball rolling against our cherished beliefs, and institutions in this country, and he paid dearly for it. Downey picks up the cudgels, (would you believe I ordered a dacron cudgels last week and it still hasn't arrived) and does Lenny Bruce one better. Nothing and no one is safe. Jews, Blacks, the Presidency, advertising, all are decimated with, I don't want to use the cheap metaphor \"a rapier like wit\", so I won't use that tired expression, I'm too advanced for that. The story is meaningless. It's like walking into an insanity ward where nothing rational is going on and trying to make a coherent narrative of it. The President of the US is a midget with a yiddish accent; the only Black man on the board of directors of an advertising agency is elected CEO, because the whites all hate each other. Running through the picture at the CEO's side lilke a Greek chorus (the great Antonio Fargas), is a ghetto Black street kid wearing  an Arab headress, contstantly chiding Putney, the CEO to \"start the revolution\". \"Gimme a date man, I mean when does it start. Tell me the hour and the date of the revolution, man.\" There is a scene in a lavatory, where Fargas and another brother are sitting in stalls talking about their \"Johnsons\", which is superior to any rapp I've ever heard. There is a scene where the now very wealthy Putney and his wife have a white maid. She is an inept, hopless recent Polish immigrant, and they treat her like, well like many whites treated Blacks in the good old bad days----with complete contempt.The interesting part of this is the part of the maid was played by Elzbieta Czyzewska who WAS a recent arrival to this country. She did not do well here, but she took care of a fellow immigrant who turned out to be Supermodel Pauline Porizkova. A movie was made of this story, \"Anna\", 1987. It contains a remarkable performance with Sally Kirkland as Elzbieta. There was only one problem. The people who made the movie \"never heard of Elziet Czyzewska\". No recognition, no royalties, no nothing. It is a very sad story.","This movie is stunningly overrated. By today's standards it plays like Blaxploitation way down at the racist end of the spectrum.And Mel Brooks is not in it. Not THE Mel Brooks. Some nobody with the same name has a bit part, so they put \"Starring Mel Brooks\" on the packaging.Robert Downey, Jr.'s father was not an underground auteur. He was just an incompetent who made bad movies.The only thing this movie is good for is to demonstrate how desperate the film industry was in the late Sixties. They had no idea how to reach audiences, so they threw money at junk like \"Putney Swope.\" Luckily, they also threw a little money at much better films, such as \"Easy Rider\" and \"MASH.\"","Putney Swope along with a number of other films: Uptight, Zabrieski Point, The Spook who sat by the Door, Easy Rider, Midnight Cowboy depicted the times of the big change of America like no other. No matter how much conservative America may want to pull the country back to the pre-60's these films show that the change became irreversible. Putney Swope has its problems(editing and much of the acting is amateurish)yet holds up well for being over forty years old. The topics still ring quite true. While viewing this one can't help but wonder if the folks that make the AMC show MADMEN are influenced by this film. The ending, though funny, has a politically horrific feel to it. A foreshadow of 9/11? The irony that Robert Downey is the father of one of America's best and most popular movie stars adds to the entertainment and poignancy.","Robert Downey's \"Putney Swope\" is a film that I think is by far one the greatest social, political and business satires around! I can't even get into how much I love and admire this film! All I can say is all you independent filmmakers out there who think they are stirring up things, getting political!  YOU HAVE NOTHING ON THIS FILM!  Watch it and your jaw will drop!  Amazing work!  I believe that this film should be preserved as a national treasure for all independent filmmakers!\nA message to Mr. Downey: WE NEED YOU TO MAKE MORE FILMS LIKE THIS and FAST!","Y'know I never thought I would say this, But Putney Swope may be the hippest ,coolest ,funniest ,thought provoking film of all times. I just can't get enough of this I've seen it about 30 times .I happened to spot it at the now long gone Woolworth dept. store in downtown Newark NJ. This is what film making is supposed to be.Mostly because after so many years ,much of it is still timely and relevant and so funny. I know you deep thinkers out there will \"get it\" after afew viewings.Hats off to the producers of this ,beats the crap outta most stuff that Hollywood has put out. thanks.","I heard about this movie when it came out but never got to see it. It must have played on the weekend I was busy. It finally was released to DVD and I bought a copy.There is no way to rate this film. I have no way of predicting how anyone will respond to it: love, hate, detest, indifferent. Should you watch this movie your response will be somewhere in there.I would have to say that it is a film for its time. A great deal of what it was satirizing at the time has changed so much that it no longer has any relevance in that sense. I remember at that time one of the demands of young movie goers was that films, indeed everything involving the culture, should be relevant. That was the 'buzz word.' This film was relevant alright, but almost forty years later I have to ask, \"relevant to what?\" I'm glad I finally got to see it. This film is touted as a comedy. I didn't laugh once while viewing it, though I did appreciate the acerbic wit. Some of it I found downright crude, though I'm sure that was intentional.I will wait awhile and view it again some time. I have a feeling that I will get different things from it. I may even laugh at the stuff that's intended to be funny.Would you enjoy this film? I don't know. Should you watch it? Oh yes, you should."],"review-user":["caa821","MisterWhiplash","Sardony","PWNYCNY","biggus-3","LatigoMeans","lee_eisenberg","shneur","D_Burke","Zorynarecords2","Kansas-5","giantbunny24","zardoz-13","mjneu59","CULTEGUY","Rick NYC-2","preppy-3","tom-day","dougdoepke","stuhh2001","EdNauseum","mozli","RobWrong","nuport","wfgwilliams"],"review-date":["1 November 2006","11 February 2009","25 September 1999","23 December 2005","16 November 2005","13 January 2004","19 January 2006","13 March 2005","29 June 2009","23 April 2007","27 April 2002","14 August 2009","1 October 2009","27 December 2010","8 January 2003","7 November 2009","13 November 2009","7 January 2010","3 January 2010","26 April 2002","14 November 2011","3 April 2010","1 August 1999","15 April 2002","24 July 2007"],"review-rating":["10","9","8","10","9","10","9","8","10","10","3","5","10","10","3","5","8"],"review-title":[" As outstanding now as it was \"then\"\n"," smart, sharp, cutting edge, and a big middle finger to the establishment, now as then\n"," Unforgiving Satire\n"," Interesting, off beat movie.\n"," One of the finest...\n"," How Many Syllables, Mario?\n"," Take that, whitey!\n"," Revolutionary\n"," \"Putney Swope\" Is A Passionate Piece of Cinema History\n"," The Truth & Soul Movie is a 1 of a Kind Original - Like Nothing else!\n"," One of the funniest movies of all time...\n"," putney swope and capitalism\n"," Downey, Downey, Down He Goes . . .\n"," broad-as-a-barn-door satire\n"," Next to \"Dr. Strangelove\" (which would make and excellent double feature,) my highest rating for a comedy\n"," Happy 40th Anniversary!\n"," VERY dated and obvious\n"," Obscure Political Essay, Howlers Galore\n"," Black Power Meets Madison Avenue\n"," may very well be the greatest american film comedy\n"," Amateurish, Horrible, Poor Excuse for Satire\n"," That brief window of time: '67 to '74\n"," Brilliant! This is the true face of underground filmmaking!\n"," Beats Blazing saddles, Groove tube ,Kentucky Fried movie And most others by miles\n"," I don't know how to rate this film\n"]}