{"review-url":["http://www.imdb.com/title/tt0028755/reviews"],"review-text":["(Some Spoilers) Early 1930's educational movie about the horrors of contracting a social disease and the consequences that come along with it: blindness madness loss of ones abilities to function as well as infecting other people with it, even one's unborn children, and finally death. \"Damaged Lives\" is far ahead of it's times in educating it's viewers about the dangers Venereal Deasise. viewed now over 70 years after it's release back in 1933 is as good, if not better, then the many films about that subject made back in the 1940's 1950's and even 1960's.Donald Bradley, Lyman Williams, is a top executive of a major shipping company who's been going study with his girlfriend Joan, Diane Sinclair, for some time. both are finally planing to get married and raise a family. Out at a party one evening Donald meets Elsie Cooper, Charlotte Merriam, and together they have one drink too many and before you know it end up spending the night together in Elsie's home. Thinking nothing of his one night stand with Elsie Donald later marries his long time love Joan and they both plan to have a child, or so they thought. At the office Donald get a panicked call from Elsie telling him to come over to her place right away about something very important. Rushing over Donald finds out, to his horror, that Elsie has a sexual infection that she got from her boyfriend Nat, Harry Myers, and that she may have given it to Donald, and he in turn may have infected his wife Joan. Telling Elsie that she's wrong about him being infected and that she should seek medical attention Elsie shoots herself as Donald is just about to leave. Getting over Elsie's tragic death Donald gets another surprise later when his doctor Dr. Bill Hill, Jason Robards Sr, comes over to his office telling him to immediately come with him to the hospital to talk to Infectious Disease Specialist Dr. Vincent Leonard, Murray Kinnell, about his wife Joan who's just been admitted there. The terrible truth about Donald and his wife Joan hits him like a bolt out of the blue and leaves him speechless, just like it did Joan earlier. Both have been infected and the infection is the dreaded and unspeakable,back in the 1930's, infection called Venereal Disease. Told by Dr. Leonard that it would take some two years of treatment for both Donald and Joan to be completely cured it leaves Joan in a state of dangerous suicidal thoughts. Later in the film Joan, feeling that she has nothing to live for, closes all the windows in her and Donald's apartment and turns on the gas stove, full blast, in order to kill herself and Donald who was asleep at the time. Honest film about the ravages of Venereal Disease and the damage that it does to those who are infected by it, both psychically as well as mentally, and how it could be cured if given immediate medical care instead of hiding it from one's doctor and keeping it hidden, for fear of shame and embarrassment, until it's too late.","*SPOILERS* Syphilis was the AIDS of its day (its day being several centuries), a death sentence, slow and horrifyingly debilitating, and passed to loved ones and children. Penicillin changed that, but at the time of this film I think arsenic was the only cure, and iffy at that, with risk of death. {See \"Out of Africa.\"} Not well written or acted, but historically interesting. They couldn't say \"syphilis\" but managed to get \"venereal disease\" and \"syphilitic\" past the censors. I also found it very interesting that an obviously part-African woman, Diane Sinclair, played a wealthy white woman who marries a white man! Since this was of course absolutely unheard of, I can only guess that the fact she was foreign allowed her to be viewed as exotic, and perhaps Indian rather than black. She would have been a good candidate to play Peola in \"Imitation of Life\"; but Fredi Washington was a far better actress.","This is a typical early 1930s film warning about the dangers of unprotected sex and the diseases one can contract. The film was directed by Dwain Esper, who made several films in this drama. The film involves a young executive, with an important job and a long term girlfriend. His boss insists that he go out with him to a party and while out at the party he sleeps with a young wealthy woman, and contracts syphilis from her. The girl is so upset that she commits suicide. He is convinced to go to a doctor (played by Jason Robards, father of Jason Robards Jr) who displays poor people suffering from various infectious diseases. The young executive (who out of guilt has married his girlfriend, is upset when he finds out that his wife has syphilis too and that their baby might be infected. The wife, in a state of depression tries to kill herself, and her husband by opening the gas jets on the stove. There is a happy ending though.The film is entertaining, and not quite as glum as it sounds. Played out in beautiful art deco sets, and with above par acting for this type of film, this public domain film, available in VHS and DVD is worth seeing if only for its risqué subject matter.","The DVD for this film is by Alpha Video--a company that almost always releases the poorest quality prints. In Alpha's defense, often that is the only print available, but the specialize in public domain and cheap-o films. If you can find another print by a different company, try it first as the print for this film is scratchy and faded. Still, compared to most Alpha DVDs, this one is excellent--especially since the sound is pretty clear (and Alpha never seems to include closed captionings--even with films with horrid sound).A man has been dating a lady for a very long time. One night, he's a bad boy and spends the night with another woman. Soon afterwords, he comes clean to his fiancée about this, she forgives him and they marry.Very soon after the wedding, he gets a frantic call from the other woman--she NEEDS to see him and has just tried to kill herself. When they meet, he learns that she has an STD and she wanted him to know that he, too, might now have it. Then, although there is a nurse there and they are treating her for the suicide attempt, she somehow finds a gun and kills herself! The makes a HUGE mistake. He does not tell his doctor and he doesn't tell his new wife. Some time passes and now she and the baby are infected! At this point, the doctor meets with the guy and tells him about the importance of getting treatment and they shows him rooms filled with horribly infected people (actually, these were just films of people with STDs that they spliced into the film--most of whom have syphilis).In some ways the film is very progressive. It addresses a serious issue and it's interesting how the film encourages couples NOT to wait to get married but to marry fast and give in to those sexual urges--but only with each other (not bad advice at all). On the other hand, the film never exactly says what it's talking about. They never use the terms STD, VD or the like, nor does it even name the diseases. Often it is referring to syphilis but at other times it's talking about herpes or other STDs--the information just isn't very clear or specific--a VERY common problem with such films from this era. Audiences at the time must have felt quite confused about what they were seeing and many of the more naive probably needed to have some of their 'faster' friends explain it all to them! Speaking of \"such films\", in the 1930s-50s, lots of small and often sleazy production companies made films decrying the dangers of drugs and sex (though often they really just wanted to promise a bit of cheesecake for audiences who usually could not see such racy fare in Hollywood films). Many of these are hysterically funny since they are so over-done and the information so inaccurate. The most famous examples are REEFER MADNESS and SEX MADNESS (both by the same two-bit production company) and compared to how salacious and stupid those two films are, this cheap film seems like it should be in the Criterion Collection!! Interestingly, there are weirdos out there (I would definitely be included among them) that enjoy seeing the films because they are often so bad and so horribly made that they are great fun. This one, however, isn't THAT bad nor is the message that convoluted and the film of the victims isn't as grotesque as some similar films. While the message really should have been more explicit and useful, for a 1933 film it's pretty good--despite the occasionally poor acting and the ludicrous suicide scene. Remember kids--just say 'NO' to suicide!Oh, by the way, the \"two years of treatment\" they talk about in the film was actually the norm for syphilis back in 1933. Nowadays, it's a lot more treatable--as are the rest of the STDs.","An extramarital affair leads to a young couple contracting venereal disease.The Alpha Video presentation is very poor, with a grainy picture, frames that jump and sound that cuts out at times at at others is just not clear.If anyone deems it worthy, this film should be cleaned up. Granted, it is not particularly interesting or even salacious, but an improved picture and sound would at least make it watchable.The film is available in sets with \"Reefer Madness\", but do not be confused -- it is not in the same league. This one is not even unintentionally funny. It is just sad.","Damaged Lives (1933) * 1/2 (out of 4) A year before directing the first team up between Boris Karloff and Bela Lugosi in The Black Cat, director Edgar G. Ulmer made this cheapie warning film. A man goes out and sleeps with a city girl, goes back home and marries his sweetheart but soon learns the city girl had syphilis. This isn't as silly as most of these warning films but the over-dramatic nature still doesn't work. The film drags on even though it lasts just over an hour. When it comes to these warning films I think the more camp the better and this one here is just too straight to keep it entertaining.","Most of the time when you watch a vintage exploitation cult movie, you can count it in being pretty shoddy. The writing, the performances, the production values, and the directing are inferior. In fact, everything is so second-rate, you expect the film will be unintentionally funny, perhaps 'so bad it's good.' Typically, Poverty Row studios made these epics, or—in the case of director Edgar G. Ulmer's \"Damaged Lives\"—a major studio under another company title produced it owing to the taboo nature of the subject matter. \"Damaged Lives\" concerns syphilis. Nothing funny or unintentionally funny occurs in this modest 53-minute, black & white film. The genuine medical footage inserted in the story is tastefully done. There is nothing either sensational or lurid about it that would appall most people. Several examples of individuals afflicted with the consequences of syphilis are shown in either long shots or medium shots. There is no nudity, too. Unlike most exploitation movies, the characters are well-to-do, upper class citizens, and grimy criminals do not lurk in dark corners trying to persuade ignorant youth to engage themselves with women of questionable virtue. Ulmer and scenarist Don Davis treat the subject matter and the characters with more than a modicum of dignity. Sure, the protagonist suffers the consequences, but the consequences are not life-long. Neither the protagonist nor his wife die from VD so \"Damaged Lives\" concludes on an upbeat note. No, this doesn't qualify as a candidate for Mystery Science Fiction Theater.Donald Bradley Sr., (George Irving of \"Crime Ring\") has given his son Donald Bradley, Jr., (Lyman Williams of \"The Eleventh Commandment\") a promotion to executive assistant to the president and placed him in charge of the operation of all his steamships. Evidently, Don Junior had been working for his dad at sea because he shouts when he gives orders in the office as if he were yelling at a crew aboard a ship. Senior breaks Junior of this bad habit, and Junior becomes integrated in the office. Later, he breaks a theater date with his fiancée Joan (Diane Sinclair of \"Tomorrow's Children\") for a business supper date with Nate Franklin (Harry Myers of \"City Lights\"), but they conduct no business. Nate has brought along a lady, Charlotte Merriam (Elise Cooper of \"Alimony Madness\"), but he abandons Donald and Charlotte and migrates to another table to flirt with another woman. Donald apologizes to Charlotte, \"You see I don't quite know what I'm doing here.\" Donald and Charlotte get along with each other so well that they hit some other speakeasies. Eventually, they end up back at Charlotte's place, and things happen. Essentially, Charlotte seduces Donald, but Charlotte is no working class prostitute. She just enjoys having a good time. Donald is torn up about his affair with Charlotte and plans to marry Joan. Actually, he wishes that he had married Joan earlier so he wouldn't have gotten trapped in this predicament. Joan dreams about having children and dotes on the child that one of their friend couples have. At one point, Don's friend and physician, Bill Hall (Jason Robards, Sr., of \"Code of the West\") suggests that they get married. After Donald ties the knot with Joan, and the Justice of the Peace marries them for $2.00!Later, about 23 minutes in the action, Donald receives a call from Charlotte. She insists that he come see her and Donald reluctantly visits her. Charlotte is rather distraught and takes her time telling Donald what is wrong. She confesses that she has had sex with Nat on several occasions and that she has contracted an infection. Donald doesn't understand what Charlotte means and dismisses the entire situation. As he is about to leave, he and Charlotte's maid hears a gunshot, and the maid finds Charlotte dead in her room. Surprisingly enough, the maid doesn't scream in shock. In a typical exploitation movie, the maid would scream. This maid doesn't exhibit any hysterics. Afterward, Donald visits Dr. Horton, and he pays the quack a $100. Horton assures him that there is nothing to worry about. Before long, Donald's family physician Bill persuades him to come downtown and visit a famous specialist Dr. Vincent Lennox (Murray Kinnell of \"The Public Enemy\") who confirms that Joan has venereal disease. Of course, Donald is aghast and refuses to believe it. Eventually, Dr. Lennox explains that he can treat them over a two-year period and everything will be okay. Lennox shows Donald a number of people who are suffering from syphilis. The worst example is a medium shot of a man's naked chest covered with pimples of some kind. Naturally, Joan is aghast about the revelation of her disease, too. She faints while they are at Lennox's clinic. Later, when they visit Bill and Laura Hall, Joan tries to kiss their little boy. Bill seizes his little boy before Joan can kiss him, then he apologizes for his momentary display of hysterics. After they go home, neither Donald nor Joan sleep with each other in the same bed. Joan tries to gas both Donald and herself, but Donald awakens and shut off the stove. Donald tries to reassure Joan that they can live with this experience between them. Things take a turn for the better at the end when a friend called them about a problem. The friend is pregnant and due to give birth in a week and she freaks out about because she ate pickles with her husband on a diner date. Our heroic couple laughs off the friend's predicament and \"Damaged Lives\" fades out.Director Edgar G. Ulmer rarely made anything significant compared with other prestigious Hollywood helmers, but every film that he directed was done with style despite their low-budgets. \"Damaged Lives\" is not a film about debauchery, but an intelligent depiction of a social disease and its nearly devastating effects on a young couple."],"review-user":["sol1218","semi-buff","sbibb1","MartinHafer","gavin6942","Michael_Elliott","zardoz-13"],"review-date":["12 February 2005","19 July 2006","2 November 2004","13 January 2010","21 April 2011","8 March 2008","29 July 2011"],"review-rating":["7","5","4","2"],"review-title":[" Serious 1933 film about the horrors and dangers of Venereal Disease that may surprise you\n"," Historically interesting film\n"," Exploitation Film\n"," Believe it or not, this film handles STDs better than you'd expect from this sort of film!\n"," Pretty Pointless Movie\n"," Poor\n"," Going Places!?\n"]}