{"review-url":["http://www.imdb.com/title/tt0070706/reviews"],"review-text":["Somehow, this film burrowed it's way into the soft spot of my heart. Don't ask me how it happened, but I suppose having the film feature Ed \"I'll Sponsor Anything\" McMahon as a tail-chasing crack hustler had a bit to do with it.Frankly, I was disappointed with Slaughter's first outing in 1972. Nothing more than a quick throw-together to follow Shaft-mania. How does the sequel get away from this? Big Jim Brown seems stronger as Slaughter here than in the first. Perhaps this is due to the fact that one year later he had something to work from, instead of his simple \"Be like Shaft\" motivation before.The most outstanding part about the film is the soundtrack provided by pimp-daddy number one, James Brown. Almost every scene is graced with a touch of funk by the Godfather. An excellent period film, for the music, wardrobe, vehicles, lingo, and hair. I should also point out this film is also an excellent period film to represent a time in motion picture history when Jim Brown and Ed McMahon could actually GROW hair.Double the chicks, double the blow, triple the body count, and factor in Ed McMahon and James Brown. You'll be in for one hell of a 70s action flick, and one that outshines it's predecessor no less. For my money, Slaughter's Big Rip-Off can play ball with any Blaxploitation film ever made. Even Shaft. Chances are you'll disagree, but Slaughter's Big Rip-Off has it's own distinct feel. Something the original was lacking.","The movie itself is pretty good - but only the ORIGINAL version with the awesome soundtrack by James Brown. For the dvd release, the studio was too cheap to buy the rights to original music, so they replaced it with new, generic sounding funk music! And they didn't even change the credits or the packaging to reflect that!  That's a pretty big slap in the face to the father of funk himself, so that's why I say avoid this DVD at all costs.","Brown returned to his role from the year before (in \"Slaughter\") for this rough follow-up film. In the original, he had avenged his parents' slaying by wiping out a huge mob organization in Mexico. Here, he is the one being pursued (retaliated against) by a money launderer portrayed by McMahon. When the first assassination attempt fails, Brown is back in action once more, kicking gangster butt all over the place while trying to protect his new girlfriend Hendry. While the original film was, overall, a better and more coherent movie, this one delivers all the exploitation aspects in far heavier doses, making it more pleasing to fans of the genre. Aside from a fairly dreary opening on horseback and a downright deadly car ride down a city street at night, this movie clips along at a very brisk pace. Every few minutes there appears one or more of the following: drug use, sex, nudity, gunplay, murder or some other action. Brown is his usual reliable, amiable self, helped by his amazing physical presence which goes a long way in glossing over any stiffness in his acting. McMahon is a riot! With tinted glasses and his hair parted down the middle (!), he is shown meting out orders to his gang of thugs and is overheard making passionate love to his fur-clad bimbo. Seeing Johnny Carson's sidekick in a role like this is a perverse thrill. Stroud makes an impression as an intense, racially-bigoted hit-man while Peters adds just a tinge of class as an upright police detective who enlists Brown's aid. Sadly, no mention at all is made of Brown's original sidekicks Don Gordon and Stella Stevens. Suddenly, Brown now has a girlfriend (Hendry) who is likable enough, but lacking in the voluptuousness and personality that Stevens had before. Williams does an outrageous turn as a pimp who can seemingly pick any girl out of a bar and make her an instant member of his harem. The cinematography and overall direction is less polished than the first film, but this one does have a drive and a sense of danger that exceeds the original's feel. The film spends a lot of time in the sewage of organized crime, drugs, prostitution and other vices, but it retains interest through the creativity of its action scenes and the now-startling lack of political correctness. One odd note: A key supporting player in the first film was shown getting shot to death, but pops up here in a different role.","This meandering tale of mob revenge is simply not very interesting, even with Ed McMahon in a ripe role as the chief heavy. Jim Brown kicks ass effectively, Gloria Hendry proves again that she can bring life to even the poorest roles, and Brock Peters is decent as The Cop Who Plays By the Book. It's still dull and badly constructed, and even the print shown on cable is now emasculated of its original James Brown score.","9 out of 10 film-goers agree: if you put Jim Brown on screen, whatever film he happens to be in will immediately improve noticeably for as long as he remains on screen. There's just something about the guy's presence and charisma, even in a non-action setting, that makes you want to see what he is going to say or do next. So a film with Jim Brown up front and center for the entire duration is going to be fun to watch even if the surroundings are second rate. That is certainly the case here.This was a pure blaxploitation flick that doesn't pretend to be anything else, so the audience for it is going to be fairly self-selecting - a title like \"Slaughter's Big Rip-Off\" is not going to pull in the Merchant Ivory crowd or fans of British comedy. The filmmakers knew the kind of film they wanted to make, and they made it: a film about guns, drugs, sex, soul power, cussing, funk guitar and muscle cars...and mostly about Jim Brown and how cool he is. (For a contemporary version of this, think of Matt Damon in \"The Bourne Identity\", which is all about how cool Matt Damon is.) I was a little bothered by the fact that the Slaughter's supposed soul mates, who went been through hell with him and for him in the 1st \"Slaughter\" (Don Gordon and Stella Stevens) were nowhere to be seen in this one. Nor was any mention made of their characters...even though the events in this film are directly related to the events from the first film. That detracted a bit from the overall image of Slaughter as a man who inspired loyalty because he gave it. But we all know about the perils of the casting call and agent negotiations (although it's hard to imagine why Don Gordon was too busy to reappear with the highest profile celebrity he'd ever been associated with). So if you don't think about it too hard, it's OK.One really odd note to the seamless blend of guns, goons, and funk is the appearance of Ed McMahon right in the middle of things as a Boss type. I don't who was mad at him, or how he got talked into it, but he is the goofiest looking twerp you can imagine here. The eras fashions were not kind to him, and he was foolish to appear on screen in anything other than a sack suit or a Hawaiian shirt. Imagine a pale, pudgy lounge lizard in aviator spectacles, leisure suit and long hair parted straight down the middle in a page-boy bob run amok, and you still can't even come close to the horror of his appearance in this film. When Brown finally shoots him, I was praying that he would also call in an air strike to obliterate McMahon's wardrobe, so that it would never sully innocent eye-balls again.Anyway, \"Slaughter's Big Rip-Off\" might have been OK, or even good, with another actor in the role, but Jim Brown makes it a great period piece. If you enjoy blaxploitation movies, this one belongs in your collection.","Of the two Slaughter movies, this is the better and even though its hardly a Schindlers list in complexity it is bloody funny. All the men are the goodies or the baddies and the women are all just Hos and emotionally needy, eg Slaughters Girl. It is also bloody funny and The Pro has got to be the funniest movie pimp of all time, you just can't get enough of those hats, purple suits, gold chains and jive patois forever. The best bit is where he has the Harem around him going \"DO YOU BITCHES UNNASTAN\". Everything about him is larger than life and it is reminescent of Morris Day in Purple Rain. Jim Brown also proves hes a private dick for all the chicks and again he kicks whitey ass in every direction. The car scene is very unrealistic that they survive it unscathed, but hey this is the movies. Definitely the finest blax flick and it surpasses Shaft (1971). Even the first movie is pretty good.","This sequel to the original Jim Brown \"Slaughter\" vehicle is similarly bad ass entertainment, with big Jim showing off plenty of cool as always. The story is pretty entertaining, too, and the supporting cast has to be seen to be appreciated. There's a fair amount of violence to enjoy, and a bit of sex, too - even some full frontal nudity courtesy of the delectable Judith Brown.Slaughter is now being hunted by mafioso types who want to get back at him for his activities in the first film. Among those types are the smooth Duncan (none other than Ed McMahon) and his racist thug-for-hire Kirk (Don Stroud). Determined police detective Reynolds (Brock Peters) soon ropes Slaughter into stealing important documents from Duncan - to be precise, a list of people who've received payoffs.\"Slaughter's Big Rip-Off\" isn't wall to wall action, but it is enjoyable, particularly for seeing Mr. McMahon in a film of this type. He's fun to watch, as is Stroud as the kind of bad guy whom you'll love to hate. There's a bunch of familiar faces in the supporting cast, among them Gloria Hendry as Marcia, Slaughter's gal pal, Dick Anthony Williams as flamboyant pimp Joe Creole (a pimp who's also talented in the art of safecracking), Art Metrano as the sleazy Mario Bertoli, Hoke Howell as one of the Parker brothers who make the foolish mistake of not cooperating with Slaughter, Russ Marin as top cop Crowder, the always lovably genial Scatman Crothers (you wish he was in the film longer) as Cleveland, Pamela Des Barres in a sexy bit part, George Gaynes as the ill-fated Warren, and an uncredited Adam Roarke as Harry.The pacing is mostly efficient, the action when it happens is always viscerally effective, and there are some good laughs to be had as well. Just check out the amount of vocalizations during a fight scene with Slaughter and two goons, one of whom happens to be Oriental. You hear them even when people aren't moving their lips.Good if not great entertainment overall, with a very funny wrap-up. It's just a shame that the original James Brown soundtrack got replaced for the DVD; the new score is adequate but hardly inspired.Seven out of 10.","(SPOILERS ALERT) After knocking off a number of top mobsters from the L.A Syndicate down Mexico way Slaughter-no first name necessary-played by Big Bad Jim Brown, the baddest dude on the planet, becomes a marked man with the mob having a contract put out on his life. As we all would expect Slaughter is no one to mess with and the mob finds that out the hard way. By being blown away by him by the time the movie is finally over.In between we have Slaughter have some action with the ladies who ends up either dead or beaten into a pulp, by the mob, for associating with him. There's also Slaughter's two top adversaries in the film mob boss Duncan played by a buffoonish looking Ed McMahon and his top hit-man Kirk played by real life hero, who lost the sight of one eye breaking up a mugging in NYC, Don Stroud. To make things even worse for Stroud or Kirk is that he ends up beaten into raw hamburger meat by a gun-less Slaughter and then shot to pieces by him when he obviously had broken his fists banging them against the helpless man skull. That's without Kirk, who looked either drunk or on sleeping pills, never even bothering to throw a punch back in return in trying to defend himself!Slaughter of course has no trouble slaughtering anyone who gets in his way and on top of that the local police don't even bother arresting and questioning him for all the slaughtering he's done in the movie that must have push the body count higher then the body count of 1992 L.A riots! With his job now done after wiping out the entire Southern Califronia Crime Synadicate Slaughter who had unearth a list of all the politicians and police higher ups working for the syndicate is then allowed to leave town on an all expenses paid vacation, courtesy of the LAPD, to Paris France to continue his slaughtering exploits there!P.S I was bracing myself for a sequel to the movie \"Slaughter's Big Rip-Off\", which incidentally was a rip-off of the original \"Slaughter\", to follow in it's blood splattered and bone crushing footsteps. But happily enough for the people living in the \"City of Lights\" they as well as we were speared the third expected \"Slaughter\",or slaughter-house, film that if released would probably have been called \"Slaughter in Paris\".","Here's another another golden oldie, a well made feature film, blaxploitation tale, with some thrilling action, especially the start, with the fake orange and reddy gore. We too, have hot broads, as well as the big black dude you don't mess with, as referenced by other black dudes: The one and only Jim Brown (Fireball in The Running Man) who makes most men look small. We have great villains, of course of being the eternal Don Stroud, plus a surprising well acted, and genuinely authentic performance by Ed Mcmahon. Some people want Slaughter dead, where he must of crossed some really bad guys, half the fun in the story, that has us, wondering if he'll survive, which we probably know he will. Recognize a voice and face right at the start. Sounds and looks like a very familiar Police Academy regular. How Slaughter survives a drowning, with his car catapulting off a towering cliff into the seas, had me flummoxed where his girl wasn't so lucky. If you like the attributes of what I've just mentioned, and you're a serious 70's action fan, this will make your night.","Stella Stevens is off on the Poseidon Adventure, so Slaughter has to find a new girlfriend in this sequel in his battle with the mob. Judith M. Brown's audition was certainly a nice start, but she's no Stella. Of course, Gloria Hendry is working hard to keep him on a leash.It was a treat to see Ed McMahon and Don Stroud, and Scatman Crothers, along with Brock Peters. They definitely made the sequel more interesting.Dick Anthony Williams plays a classic pimp with the jive talk and flashy threads who joins Slaughter in a rip off scheme. Unfortunately, Stroud takes him for a ride. Stroud makes a classic mistake, however, and Slaughter is ready for action.The cool dude just does the job.","Slaughter's Big Rip-Off (1973) * 1/2 (out of 4) Violent sequel sees a mob boss (Ed McMahon) taking a hit out on Slaughter (Jim Brown) who of course has to seek vengeance when a couple of his friends are killed instead. This sequel to the 1972 hit comes as a major letdown because we've got a pretty good cast here but sadly they're given very little to do and this film runs out of gas before we even hit the thirty-minute mark. Not only do we have Brown and McMahon but we also have a brief appearance by Scatman Crothers and Don Stroud as well as Brock Peters who most will remember from TO KILL A MOCKINGBIRD. The biggest problem with this film is that the entire set up is just boring and never really gets us interested in what's going on. As soon as the movie starts we witness this hit and we have no reason why it's happening or who the people are that are getting killed. We're thrown right into this story but it's so slim that you can't help but feel you're just watching this movie because the first one made money and the studio is trying to milk some more cash. I know that just about every blaxploitation flick used this revenge storyline but they still could have came up with something better here. What we do get are a few fun performances with Brown once again delivering the good lines and kicking enough heads in for some slight entertainment. It was very funny seeing McMahon playing the womanizing gangster and Peters turns in a good performance as a cop helping Slaughter. Veteran director Gordon, whose credits go as far back as campy stuff like ZOMBIES ON Broadway, handles the material fairly well but he's just not given enough to save the movie.","Like the first film in this series (SLAUGHTER, 1972), I think it would be a mistake to just label this a \"blaxsploitation film\". Sure, Slaughter is a tough, gun-toting, Black man but it's more of an action picture regardless of the color of the leading man or the bad guys--and a very good action picture at that.For the second and final time, Jim Brown plays the title character. The film begins with one of the goofiest scenes I can remember in a film. As Slaughter and his friends are enjoying an outdoor party, along comes a biplane and begins spraying the group with machine gun fire! No, Slaughter isn't so tough that he then shoots down the plane with his .357! But Slaughter is ticked and no one is sure why this hit was happened--however, Slaughter is going to get to the bottom of it! Well, it turns out that the hit was attempted in retribution for the last movie. In it, Slaughter takes on the Mafia and kicks lots of butt down in Mexico. Now, in a horribly bungled and clumsy attempt, the guys in the plane kill and injure quite a few people but miss Slaughter. And, because the job was bungled so badly, the mob boss (Ed MacMahon!!) orders the pilot and gunman killed by his brutal assassin (Don Stroud--in a very typical sort of role for him). Stroud is great--scary and nasty to the core, but Ed MacMahon as the boss?! Wow, that's an interesting twist! Slaughter is now stumped. He figured out who the two guys were in the plane but by the time he got to them, they were dead. So, to help him along in his own private vendetta, Brock Peters (who plays a cop) tells him who the mobsters are who ordered the hit and got Slaughter to agree to help by doing some illegal undercover work. So, Slaughter and his pimp friend break into the mobster's mansion and steal a list of payoffs to key government and police officials. And, naturally, there is a lot of shooting and bloodshed in the process.Stroud isn't about to let Slaughter get away with this and kidnaps Slaughter's girlfriend. Now it's a standoff--Slaughter has the list but if he doesn't give it back, the lady is dead. Being a tough but gallant man, you might just be able to guess much of what happens next.The action is very good in the film and Jim Brown is menacing and tough. The only negative I noticed was that while having MacMahon play this nasty boss, at the end, he simply folded--and way too quickly. When Slaughter catches up to him, MacMahon becomes a wimp and all the previous nastiness disappears--and this is too much of a cliché and inconsistent. Still, despite this minor quibble, it's an engaging film that is NOT for the kids due to all the violence and boobs.","While enjoying a cook out on a ranch with several friends, a bi-plane appears out of nowhere and begins spreading the area with bullets. Although the former Green Berets soldier by the name of \"Slaughter\" (Jim Brown) is not killed, several of his friends lie dead and dying all around him and he immediately vows to kill those responsible. But first he has to find out who issued the contract on him and why. But before he can initiate an investigation he has to find a safe place for his girlfriend \"Marcia\" (Gloria Hendry) and somehow get the police off of his back as well. Unfortunately, this process becomes more problematic the closer he gets. Now rather than reveal any more I will just say that this turned out to be a fairly decent \"Blaxploitation\" film with good action and solid acting all around. Likewise, the addition of Judith Brown (as \"Norja\") and the aforementioned Gloria Hendry certainly didn't hurt the scenery in any way either. On the other hand, I have to admit that it loses points on the \"realism scale\" due to a couple of scenes which defied reality. Even so, I thought that this sequel was a slight improvement over the 1972 film \"Slaughter\" and I have rated it accordingly. Slightly above average.","Hey all you jive hustlers, you stone foxes, you mean dudes. Watch out cause Slaughter is back in town! If you are looking for a bad-ass, funky film to watch some night, this is just right. 'Slaughter' is back and trying to take it easy n' relax after his adventures down in Mexico. But if you are a narrow-minded gangster like 'Duncan', you are bound to seek revenge. Why, I don't know. Was 'Hoffo' in the first one his brother or what? Any who. The movie starts off with the old \"assassination from a plane\" routine. We all know that that is THE most effective way for taking out one guy in a picnic, full of people. Needless to say Slaughter survives the ordeal, but Cmndt. Eric Lassard, sorry George Gaynes I mean isn't that lucky. SMACK!! Also Slaughters best friend Pratt is killed. This is the start of a grand adventure, filled with the hippest, funkiest music James Brown himself has to offer. That's right 'The Godfather of Soul' has put his trademark up on this bad-boy. In addition to Jim Brown in the lead part, this movie is filled with some of the biggest names the blaxploitation scene has to offer. How about Scatman Crothers, Dick Anthony Williams, Gloria Hendry and Brock Peters. In other parts we see none other than Judith M. Brown and last but definitely least the fantastic Don Stroud as the evil henchman.","A mob kingpin(Ed McMahon) murders Slaughter's(Jim Brown) associates and he seeks to get even.Duncan(McMahon)puts a hit out on Slaughter, but his friends get shot instead while the gunner flew over his party in a Spearman. Duncan goes to his reliable trigger man(mechanic), Kirk(Don Stroud)to clean up the mess left in the wake of this failed hit. But, Slaughter isn't about to go down without a fight.Plot's simple as that. A revenge actioner where big Jim Brown takes out a mobster's goons as Kirk targets him for extermination. Duncan is in bed with the chief of police(..and other city officials) and Slaughter must secure a list with his name on it for detective Reynolds(Brock Peters).Fans of Jim Brown and blaxploitation should enjoy this, but the plot itself really isn't anything to write home about. Brown, built like a mack truck, makes both black and white women swoon and kicks a lot of ass..a tailor made vehicle designed specifically to make him look cool while defeating those who wish to kill him. Dick Anthony Williams steals the film as a sneering pimp, Joe Creole, who also has a reputation as a safe cracker and is enlisted by Slaughter to lift the list from a safe in Duncan's mansion. Stroud inhibits the usual heavy role of Kirk, a ruthless, cold-blooded henchman who has obviously eliminated a lot of Duncan's competition.The yummy Judith M Brown has a minor role as a former squeeze of Slaughter's who negotiates with him over information regarding those he is after in return for sexual favors(..and, we get to see her fabulous nude body as she disrobes for Slaughter, who didn't need too much coaxing). Gloria Hendry(Live and Let Die) is Slaughter's girlfriend, Marcia, her life soon threatened as Kirk desires the list for his boss. Hoke Howell has a funny cameo as a plane mechanic who, at first, doesn't give out the name of the person who hired the Spearman which flew over gunning down Slaughter's friends. Scatman Crothers stops by as an old friend of Slaughter who leads him to Creole as a favor in regards to finding someone available for opening Duncan's safe.Preposterous sequence where Slaughter somehow survives a car's plunging into the ocean after driving off a cliff, and how he's able to move about freely despite the powerful connections of Duncan is a major logical problem(..you'd think Duncan would have gunmen throughout the city with Slaughter encountering them everywhere he goes, but this is not the case). Plus, the whole opening sequence doesn't properly set the stage for the revenge of the movie(..shouldn't we get to know Slaughter's comrades a bit before they are murdered?). It does deliver the violence, though, as Slaughter lives up to his name, blowing away quite a many of Duncan's men, with blood all over the place. Brown's sheer charisma and presence are of major importance as the plot itself doesn't exactly do him any favors. It's too bad the film doesn't use McMahon more because he is fun to watch as the mafioso with those big shades and ugly suits.","Slaughters Big Ripoff could be called junk, but that is like calling Birth of A Nation Junk.Is it a good film,no. However it is an interesting film to analyze.Unlike the first Slaughter movie, this one is different in tone. Slaughter has no well meaning white partner like Don Gordon. In fact, except for the beginning, there is no good white male in the entire film. The screenplay writer, a Mr Johnson, who I believe to be African American, I believe is the real auteur of this movie. The opening scene, with an attack by an airplane may remind people of an incident in Tulsa Oklahoma in the early 1920's. Here, an elderly white man, the only good white man in the whole film, who has just lost a close horse race to Jim Brown as Slaughter, is killed by this plane, as is another black person. The attempt was made to kill Slaughter. During this scene, before the attack, their are several tables set up. Ironically, all the black people at this party sit together, separate from the white people. Even here, it is implied somewhat that while blacks and whites can be polite, they cannot be together.Later on, we will meet African American Brock Peter, who at first appears to be antagonistic to Slaughter, while his white boss, who appears to be a \"nice guy\", we will later learn is corrupt and dealing with the mob, led by all people Ed McMahon (I guess Johnny Carson show didn't pay him enough. Brock Peters however, will help Slaughter, and they form an alliance.The \"White World\" is shown to be decadent and in decline. Sluaghter beats up three \"Rednecks\", terrorize's a white perverted drug dealer\". During a murder of a white gangster who failed to kill Slaughter, imaginatively done in a swimming pool, especially as all the people at this party (all white) all of a sudden disappear, implying somewhat that \"the white world\" condones such killing though they try to show that they are respectable. The only good white person from here on end, is a white woman, who just wants to have sex with Slaughter, somewhat suggesting that for her white men are of no use. Slaughter complies, but in no way does he seem to love this woman, while he is making love to a black woman later on, and we feel that he certainly cares more for her. Also a black pimp, who appears to be a sleaze, is allowed to show courage, and that even he, has more good character qualities than \"the white man\".Don Stroud makes an interesting villain. He appears at the beginning, while he is evil, that he may be a match for Slaughter. But in the end, when Slaughter faces him, he will be no match for Jim Brown's Slaughter. As Jim Brown faces the bad white gangsters in the end, I am struck by his getting his guns ready to put the massacre on these white baddies. Certainly it might go against Martin Luther Kings principals. However, metaphorically, one could see Slaughter getting his guns ready, to go after the people behind James Earl Ray who wanted King dead.This is no classic, it is not even good cinema, but Slaughters Big Ripoff is none the less an interesting movie for what it is saying.","Big, bad Jim Brown encores as rugged ex-Green Beret Slaughter, who finds himself targeted for termination by a bunch of vicious mobsters who are angry at Slaughter for killing a bunch of Mafiosa off in the first movie. Of course, bagging Slaughter proves to be easier said than done. Director Gordon Douglas, working from a suitably trashy script by Charles Johnson, keeps the pace hurtling along at a brisk clip, expertly creates a rough, seamy tone, and stages the copious thrilling action with considerable rip-roaring brio. Charles F. Wheeler's crisp cinematography gives the picture an attractive glossy look. Soul brother number one James Brown delivers a supremely funky score. The first-rate supporting cast really carries the day: Gloria Hendry as Slaughter's concerned loyal gal pal Marcia, Don Stroud as blithely brutish racist hit-man Kirk, Richard Williams as flamboyant pimp Joe Creole, Brock Peters as hard-nosed detective Reynolds, Scatman Crothers as a kindly old pimp, the foxy Judy (\"The Big Doll House\") Brown as a sexy informant who has a steamy interracial love scene with Slaughter, Art Metrano as a freaky, greasy coke-snorting hoodlum, Hoke Howell as a charter plane pilot, and AIP biker film regular Adam Roarke as an ineffectual assassin who Kirk strangles in a pool. Longtime Johnny Carson sidekick Ed McMahon has a field day portraying extremely slimy'n'smarmy mob head Duncan, who sports a hideously ugly wardrobe that's pure murder on the eyes. Good, scuzzy vintage 70's blaxploitation fun."],"review-user":["clurge-2","wash-3","Poseidon-3","JohnSeal","lemon_magic","taneishqua","Hey_Sweden","sol-kay","videorama-759-859391","lastliberal","Michael_Elliott","MartinHafer","Uriah43","ministerbob","Scarecrow-88","kuciak","Woodyanders"],"review-date":["24 January 2001","8 March 2003","10 March 2005","12 May 2000","31 July 2005","17 August 2001","13 July 2013","22 December 2011","28 May 2014","8 February 2009","15 January 2010","27 June 2009","26 September 2016","19 December 2009","21 September 2009","2 May 2009","10 May 2007"],"review-rating":["7","4","6","7","7","5","7","6","7","6","7","5","5","8"],"review-title":[" Two words to make you see this film: Ed McMahon!\n"," Stay away from the DVD version of this...\n"," More Slaughter than a person could dream of.\n"," Disappointing black action flick\n"," Ed McMahon, noooooooo....!!!\n"," Overall some great acting and you can laugh\n"," \"You don't fight with a bull that big, you shoot it!\"\n"," Aieeee! You Dieeee!\n"," Watch Slaughter slaughter\n"," How would you like to be pickin' your teeth outta your lips?\n"," Poor Sequel\n"," A little bit better than the original\n"," A Slight Improvement Over the 1972 Film \"Slaughter\"\n"," Slaughter's back!\n"," Slaughter's Big Rip-Off\n"," No classic, but an interesting film\n"," A worthy sequel to the excellent original\n"]}