{"review-url":["http://www.imdb.com/title/tt0080855/reviews"],"review-text":["I saw Heaven's Gate on its opening week nearly twenty years ago. Tickets were sold in advance based on the great anticipation of seeing Cimino's long in the making follow up to his 1978 masterpiece \"The Deerhunter.\" The reviews came in and critics trashed the film with vehemence. An influential New York film critic led the way and most critics followed suit, and the 3hr. 40-min. film was pulled from distribution. United Artists had Cimino shorten the film by about an hour and it was re-released many months later to equally horrible reviews and to dismal business. The film at that time cost about 40 million dollars (now considered low budget) making it one of the most expensive in history and Cimino had free rein on the project with endless retakes despite it being only his third film. \"The Deerhunter\" had also received a negative backlash based on a perceived political ideology, which was not popular. I mention all this to present a possible bias building up against Cimino.                        At the time I thought the film was very good and when I saw the shorter version it was still very good only less so. The film showed up again in a museum in the early 1990's. They were supposed to show the long version but they could not find an existing print. Nevertheless, seeing the film years later I now thought Heaven's Gate was a masterpiece. Finally, the long version started to appear in a few select cities, I got to see it recently and it was well worth the wait. Heaven's Gate begins with the graduation ceremony at Harvard University. Two of the graduates are Kris Kristofferson and John Hurt and we some of the flaws in their characters early on. Despite the mandate Joseph Cotton gives in his speech to the graduating class to use their education to enlighten and improve their country, many of the graduates behave as if they are part of an elite country club. The film flashes ahead 20 years to Johnson County in Wyoming. A cattle company called \"the Stockholders Association\" has hired poor people to shoot 125 poor immigrants claiming they are cattle thieves. Kristofferson sides with the immigrants while John Hurt is part of the Association. Although Hurt is totally against this insane action he is too ineffectual a character to do anything about it.                             A massacre takes place but the immigrants do well in defending themselves. A United States Cavalry comes to the rescue of the Association  to allegedly arrest them after most of the damage has been done when in fact they sanctioned the mass killing. Kristofferson also suffers a great personal loss and the film ends with him years later as part of the elite class of his Harvard days married, bored, on a yacht, living but dead on the inside.This is a very complex film which is brilliant in every department such as it's themes, structure, direction, cinematography, writing, music, editing, set designs, and acting.   Kristofferson, Walken, Hurt, Huppert, Dourif, Bridges, Waterston, and Cotton are all excellent portraying very complex characters. Some of the major complaints I read about this film state that is ugly to look at, incoherent, too long, that the characters make no sense and that the words are often unintelligible.             In its defense, Heaven's Gate has the look of photographs of that period just as \"McCabe & Mrs. Miller\" did. Some of the scenes are smoky looking to suggest the industrial revolution or sometimes horses, wagons, people are passing by from all sides creating a sense of reality.(The critic who called it one of the ugliest movies ever made likes to use his thumbs a lot.) But in spite of all that, the composition of each frame and the cinematography are impeccable.                                                     The film makes a great deal of sense if you pay attention to it.  Everything is not spelled out for the viewer and one has to observe closely to understand the motivations of the characters or its themes. As to its length, it is a beautifully structured piece,  at times moving, poetic, exhilarating, or devastating with virtually one great scene following another. At times some of the words are unintelligible especially in some of the scenes bustling with activity. But one could understand such a cinematic film as this through its use of film language, the glances between characters or their actions. One day soon this film should be re-released in its full length so that people and critics could give it a second chance. Do not let Michael Cimino become another Orson Welles- under appreciated in his lifetime and not able to make the  kinds of great films he is capable of making.","I seriously don´t know why this movie got such a hostile reception when it was first released. Sure, it´s overlong and somewhat gratuitous in its depictions of sexuality and violence but so are lots of well regarded movies. I seriously don´t think that the people who hated \"Heaven´s Gate\" really understood it. \"Heaven´s Gate\" in its uncut form, much like \"The Deer Hunter\" shows the gross differences of living an insecure and dangerous life (like the immigrants and Averil in Wyoming) and living in comfort and privilege (like the settled \"Americans\" in Wyoming and Averil in the prologue and epilogue). Living a hard life is painful but it can also be invigorating as opposed to the dull life Averil leads in the epilogue. Also, as Michael Cimino took great pains to make the picture historically accurate , it is fascinating as a document of (and maybe indictment of) American life in Old West Wyoming. The dialogue is often genuinely clever and emotional. Combined with great music and cinematography, the movie works like a truly poetic work of art. Granted, \"Heaven´s Gate\", with its refusal to patronize the viewer, is not for all tastes. However, Hollywood turns out so much commercial dreck each year which is so much easier to dismiss as mindless eye candy (even when an example of it becomes a blockbuster) that \"Gate\" and Cimino really do deserve more respect.  All people should see the uncut version at least once and then they should make up their own mind.","I first saw this film when released in 1980. From other sources, I've learnt that the only release of the 219-minute cut was in New York City, after which it was severely cut to 149 minutes. So, I guess I saw the shorter version first which, at the time, I thought, was a very interesting anti-Western, if a trifle confusing...So, it was with even more interest that I finally obtained a DVD of the full-length version. I'm glad I did because this second viewing has confirmed for me that the movie is a true classic, and the critical vitriol poured on Michael Cimino was unwarranted, to say the very least.Yes, it's a long movie, but so have been many others. For example: Once upon a time in America (1984) at 227 minutes; Cleopatra (1963) at 320 minutes; The Ten Commandments (1956) at 220 minutes; Spartacus {restored version} (1960) at 198 minutes; Gone with the Wind (1939) at 222 minutes and others. So, it can't be the fact of running time that made so many froth at the mouth way back, when Heaven's Gate came on the scene.But note this: all of those above movies have everything to do with reinforcing myths about history and heroes.Not so Heaven's Gate: in this narrative, the American West is shown in all its grim and unrelenting harshness, injustice, and poverty. And that's probably the first reason why so many disliked this film: it laid out the circumstances of the Johnson County War of 1892 in Wyoming, showing how the Wyoming Stock Growers Association hired 50 assassins to hunt down and murder a large group of European immigrants accused of cattle rustling; and all with the assistance and conniving of authorities, right up to the President of the United States. For an essay on that war, with the background and what happened, there is a link at Wikipedia under Johnson County War.Very few like to be reminded of the really dirty periods in their country's history, and which fly in the face of what the country is supposed to be. Had it been a documentary, it would have been barely palatable for most; as entertainment, it was almost bound to fail commercially and be torn to shreds by the shrill and infamous.Leaving aside the socio-political diatribe, for a moment, that Cimino launched herein, what about the narrative  the story of the three main characters? Well, it probably wasn't unusual for men of that time to fall for a local prostitute, just as it's probably not unusual now. It's a fairly standard love triangle whereby Ella must choose between the two men, and ultimately decides upon the younger man, Nathan, who, although not above resorting to cold-blooded murder when it suits him, shows more spirit and commitment than the older James (or Jim, as most people in the film say). For some, that part of the story threads too slowly, perhaps; in the context of the wider narrative about the war, however, it is, I think, entirely appropriate.And that war is depicted graphically, viciously and cruelly with scenes of carnage that are exquisitely staged and edited flawlessly  although in the final massacre between the Association and the immigrants, I'm certain that some scenes of wagons blowing apart are repeated. A minor point and perhaps brought about when the 219-minute cut was restored? Any way you look at it, though, it hits you in the face with the noise, dust, chaos and confusion of war...Which brings me to another criticism by others: the noise and dust is such that it's often difficult to hear the dialog and even see clearly what is happening. I'll admit that I found that to be a trifle annoying at first, even backtracking to replay parts to try to catch the image or the words  until I realized that really wasn't necessary if you accept the director's intent: life is chaotic, it is difficult to hear and see in crowded situations and, in war, it's the sine qua non of this mise-en-scene. In short, it's as though you truly are present in and within the scenes...And what of the title? From Shakespeare, it refers to a figurative nearness to God and so, if you equate God with the natural world, the stunning scenery that pervades the movie  and it is stunning, hauntingly equal to that of David Lean's Doctor Zhivago (1965)  is a useful metaphor. I tend to think, however, that Cimino had something more to say, namely the idea that the brave immigrants  the God-fearing salt of the earth  were denied entry to heaven on earth and the freedom to build a life for themselves in the land that espouses to be freedom's champion.Was that Cimino's intent  to gut the myth of the American West? To show how, in America, only the rich get rich while the poor are massacred, one way or another, throughout history? Is that anything new? Not really, as we all know. Where it really hurt, however, is in showing how America was not and, by implication, is not the land of the free and the home of the brave. Instead, after absorbing this narrative, we are left with an impression that the underpinnings of America have more to do with a land of dispossessed slaves and a home for knaves...","'Heaven's Gate' is not a masterpiece, which apparently was what it needed to be upon first release to justify its great cost, and, more importantly, the continued uneasy reliance of Hollywood on the Auteur model of film-making. Yet 'Heaven's Gate', seen today at last on DVD in a cut of 229 minutes, is a superb film. It is a touch lethargic in pace. But at least it is paced. Quite apart from the incompetence of construction that marks many films today, there have been many films which, deliberate in form, have been severely damaged by being hacked down with no care for rhythm so the films become shapeless and confusing. Beyond this, the criticisms leveled at the film have become in retrospect quite lame. If the good guys and bad guys are too obviously pronounced for a serious film, and yes Sam Waterston's mustachioed, fur-clad villain is comic-opera (and not in the multi-leveled manner of Bill The Butcher from 'Gangs of New York'), and yes, the townsfolk do seem a touch 'Fiddler On The Roof' on occasions, then a few dozen serious films made since then, including 'Titanic' and the graceless 'Cold Mountain' (which bears certain similarities and is a notable failure in convincing qualities compared to this film) can be castigated for exactly the same reason. Also despite accusations, the film has a plot, quite a well-essayed plot at that. It simply does not bow to standard-form 'epic' quality, by providing Titan heroes, rafts of sub-plots and confusion. It experiments with telling in a manner more like much smaller, modest films, by carefully-caught moments of character interaction, and well-textured pageant-like explosions of communal action, as with the opening at Harvard and, most specially, the wonderful scene where the Johnson County folk, following the lead of a brilliantly physical fiddler, make celebration on roller-skates.'The Deer Hunter' was a critical and commercial success but abandoned the first half's inspired, mosaic-like accumulation of detail, and I think in a manner similar to criticism of Robert Penn Warren's novel 'All The King's Men' and its dictionary of Jacobean stunts, if Cimino had not had such a strong grasp of the conventions of Hollywood epics, he might have made a special rare work of art based in honest visualisation of people within their milieu. In contrast, 'Heaven's Gate' succeeds in screwing its narrative momentum and tension upwards in a slowly expanding arc, until the finale explodes, whilst not abandoning the mosaic approach.The central romantic triangle, for instance, resists standard inflections; a decent, intelligent, but psychically defeated man, James Averill (Kris Kristofferson) competes with a hot-shot but identity-challenged young gunman Nate Champion (Christopher Walken) for the hand of a young Madame, Ella Watson (Isabelle Huppert); there is no self-conscious bed-hopping, no slaps in the face, recriminations, or typical sad-sack moments, but more a sad and distanced decision by Ella to choose the younger man whom she loves less because he is ready to make the commitment. Ella emerges as the film's true hero (Huppert's performance, though initially awkward, is really quite excellent, balancing a dewy emotionalism with a hard-hammered spirit), attempting first to rescue Nate and then mustering the resistance party of immigrants into an enterprising defence. Subsequently, Averill is stung into action as friends die. Indeed, in the process of overcoming so many traps of cliché and style, 'Heaven's Gate' successfully and willfully throws off the defeated outsider-heroes grace note of so many '70s Westerns and portrays an eventual, vigorous, cheer-the-heroes rallying to a compromised but still relished victory. The social conflict of so many '70s Westerns at last hardens into a fully-fledged war; where capital attempts a crushing final victory over the miscreants who stand in their way, suddenly they find a massed and more-powerful people's army, led by the man who played the thoroughly-destroyed Billy the Kid a decade before. This is what led the film to be described as the first Marxist Western, but really it simply deflowers a theme of the genre extant well before the '60s. Such various and classic old-school works as William Wyler's 'The Westerner', and even 'Shane', tell awfully similar stories. It is simply here that the romantic myth of the gunslinger has been replaced by the romantic myth of the people's revolt. In a spectacular, exiting, but realistic and thus chaotic finale, the marauding Cattlemen's encampment is attacked, ringed by dust clouds punctuated by fallen horses, writhing bodies, and gunfire. Averill puts his classical education to work finally by stealing a Roman trick and bringing the Cattlemen to the brink of annihilation before they are rescued by the Cavalry (another distinctly seditious touch, but surely not so offensive after 'Little Big Man's unrelenting depiction of Native American massacres). Really, it's hard to think of a more heroically American vision of grassroots resistance. The film's only real dead spot stands as an unnecessary coda indicating Averill's eventual relapse, a rather potted piece of tragedy. Despite then certain failings and a slow mid-section, 'Heaven's Gate' is a supreme piece of work, a genuine attempt to create a contemporary Western and a new kind of epic. If one has to still join the chorus that reckons Cimino was absurd in his behaviour on set and expenditure, it is regretfully. When, today, flops like 'The Adventures of Pluto Nash' and 'K-19 - The Widowmaker' see nearly a hundred million dollars sink down the drain, and yet a tag of infamy still hangs on this film, one ponders what exactly its grim death signified. The attempt at original style, the bawdy sexuality, the very hard-won sense of detail, the breathtaking rigor of the film-making and what is being filmed, all throw into contrast what is sorely lacking in so much contemporary Hollywood product.","I've been a fan of Heaven's Gate since its first release. I've seen it at least half-a-dozen times and have long thought of it as a masterpiece. So, it was with excitement and a sense of anticipation that I took myself off to see the restored director's cut.To my surprise, I was disappointed on seeing it again and have since revised my estimation of the film. Heaven's Gate touches upon greatness in parts, but overall, lacks the thematic and narrative consistency and the passionate urgency characteristic of a truly great film.Firstly, two technical problems: The sound quality is diffuse throughout the film, verging on inaudibility at times. Some of this, perhaps, is intentional - a way to mimic the chaos and confusion of history as it is unfolding. But at key points, one is unable to register what it is the characters are saying.The cinematography is similarly diffuse. The images lack sharpness and particularity of detail. The result is a certain graininess and lack of pictorial sharpness which succeeds in blurring foreground and background.Structurally, the narrative is off-key throughout, as if Cimino can't quite make up his mind as to the effect he is after. He wanted an epic, for sure. But a pastoral or dramatic epic? The film sits uneasily and unconvincingly between styles, and perhaps even genres. At times it reminded me of Terrence Malick's 'Days of Heaven' or even 'Elvira Madigan' in its languid pace and elegant scene painting. At other times it threatens to turn into a robust 'western' more akin to 'The Wild Bunch'. In fact the latter film offers an instructive reference point for an assessment of 'Heaven's Gate' as it shares the same period concern and employs a similar tone of ambivalent nostalgia for a darker yet more heroic America. This structural and thematic uncertainty isn't helped by the poor-quality script which often sounds forced and jarring to the ear. The result is an inauthentic sense of period speech. The near-greatness of Heaven's Gate resides in its set pieces. The roller skating sequence, in particular, is astoundingly beautiful, one of the most evocative scenes ever put to film.Another set piece which works very well in terms of unifying theme, mood, and setting occurs when Kristofferson and Huppert go riding in the new rig to the lake and she washes herself while he naps in the shade. The languid pacing, evocative music and monumental scenery combine in this scene to convincingly portray the love story which might just lie at the heart of the film - and which could have been its saving grace if pursued more convincingly.Some critics have complained about the length of the film. This in itself doesn't bother me. A good film can't be long enough. The restored minutes are critical in restoring the motivation and characterization absent from the cut version, and they are full of pictorial interest.Perhaps the chief glory of Heaven's Gate lies in the achingly evocative soundtrack. The repeated waltz motif and its different scorings throughout(full band, guitar, solo fiddle etc,)lends a haunting quality to the foreground action and establishes a thematic consistency lacking in the narrative itself.Despite its obvious flaws, most notably the absence of a compelling narrative, there is a sense of grandeur about the film. One leaves the cinema with a rueful sense of missed greatness and a wish that Cimino could revisit the film -with the wisdom of time and hindsight, to put right what is so badly amiss.","Until today, I thought there only three people, including me, who considered Heaven's Gate (1980)to be a masterpiece and perhaps the last great western, (since the 1970), after, Little Big Man (1970), Jeremiah Johnson (1972), The Outlaw Josey Wales (1976) and The Long Riders (1980).     I was stunned and pleased to see that 22.5% of those voting at IMDB rate this movie a 10, as do I.  A recent book, the Worst Movies of All Time, includes Heaven's Gate.  Through it's production and release it was vilified, as no movie since Cleopatra, almost twenty years before.   At one time it was considered the most expensive over-budget movie of all time, surpassing even Cleopatra.  It was blamed for the downfall of its studio, United Artists, until everyone finally saw all the studios were falling. Michael Cimino, fresh from his glory with the Deer Hunter was hated and despised for his success and movie making excess, but clearly, that was petty jealousy at its worst.     Cimino ended up fashioning one of the great expositions of the American experience.  This film is not to be missed but any serious student of American filmmaking.","I was expecting this movie to be a stinker but I wanted to see for myself, but I was surprised how good of a movie this was.  I know longer movies often don't do well at the box office but why this was pulled and not allowed to be viewed by the public is beyond me.  It maintained my interest throughout and the scenery and photography is breathtaking at times.  The plot was good and the morality play was a good one.  I liked the realism which was along the lines of \"Unforgiven\".  I had to rent this movie to see it but it was definitely worth it.","Few films have been as vilified as \"Heaven's Gate\". It has gone down in history as the film which bankrupted a studio and wrecked the career of its director, who only three years earlier had made the Oscar-winning \"The Deer Hunter\". It contributed to the decline of the Western as a genre (although it was far from being the only cause). And played a large part in bringing to an end the reign of the Hollywood auteur, a reign which had begun in the late sixties and continued throughout the seventies (although again there were other causes). Recently Joe Queenan, the film critic of \"The Guardian\", named it as the worst film ever made.Was he serious? Could Cimino really have gone from Oscar-winning whizz-kid to Ed Wood in just three short years? The answer is no. Certainly, the decision to make \"Heaven's Gate\" must rank among the worst business decisions ever made, but critics should beware of judging a film solely on its profit-and-loss account.The film is set in Wyoming in the 1890s, although actually shot in the neighbouring state of Montana. It is based, although it takes many liberties with the facts, upon the Johnson County War, a historical conflict over grazing rights between large ranchers and small farmers, many of them European immigrants. The film's main characters are named Frank Canton, Nathan Champion, James Averill and Ella Watson; real individuals with these names played a part in the conflict, although in each case this was not the same part as they play in the film.In the film Canton is the leader of the Wyoming Stock Growers Association, which represents the interests of the big ranchers. The ranchers detest the small farmers, whom they accuse of stealing their cattle, and take the law into their own hands. They draw up a death list of 125 names and recruit an army of hired gunmen, who will receive a bounty for every person on the list killed. Averill is an idealistic Harvard-educated Sheriff who sides with the immigrants, Champion a hired enforcer for the ranchers who comes to doubt what he is doing. Ella is the madam of the local brothel and also the lover of both Averill and Champion. (In the film Ella is obviously French, but keeps the Anglo-Saxon surname of her real-life namesake, who was actually Canadian).When it comes to artistic merits of the film, I should point out that I have only seen the shorter 2½-hour version which was originally shown in cinemas and is the version normally seen on British television; I have not seen Cimino's director's cut, which runs to more than 3½ hours. Certainly, \"Heaven's Gate\" has its faults. The dialogue is not always audible, and the plot sometimes difficult to follow. At times it can seem very slow paced, especially as the action is often slowed down by big set-pieces, such as the opening Harvard graduation scene (actually filmed in Oxford) or the roller-skating sequence, which are visually spectacular but do little to advance the story.These, however, are faults which the film shares with \"The Deer Hunter\", and I find it difficult to understand why the later film should have been so reviled by the critics when the earlier one took \"Best Picture\". \"The Deer Hunter\" was perhaps fortunate in that its Vietnam War theme caught the mood of the American public at the time, whereas Westerns had already started to decline in popularity in the late seventies. Possibly \"Heaven's Gate's\" left-wing political slant (its sympathies are very much with the with the little man against big business) alienated more conservative audiences. (1980 was, after all, the year which first saw Ronald Reagan elected to the Presidency).\"Heaven's Gate\", however, also has its virtues (as, indeed, does \"The Deer Hunter\"), and to my mind these outweigh its faults. Cimino was a director for whom the pictorial qualities of a film were as important as its narrative ones, and as in the earlier film he shows here that he has a good eye for a striking visual image- the opening shots of the mist-shrouded university buildings, a train pulling into a frosty station, the barn dance, the soaring Rocky Mountains. The film borrows elements from a number of famous Westerns; the grand scale of its battle sequences recalls Peckinpah's \"The Wild Bunch\", its lush photography and warm tones are reminiscent of Malick's \"Days of Heaven\" and Altman's \"McCabe and Mrs Miller\". (In that latter film too the main female character is a brothel madam).Perhaps the film's most interesting feature is the way in which Cimino gives a new slant to old Western themes. Averill is essentially a similar character to Shane or Eastwood's High Plains Drifter- the outsider who tries to help a community in trouble. The scene where the small farmers, who have decided to fight back against their oppressors, encircle the ranchers and their private army, is strongly reminiscent of all those Westerns where the settlers are encircled by hostile Indians and saved at the last minute by the arrival of the cavalry. The difference is that Averill is defending the community not against outlaws but against an oppressive Establishment, and the cavalry in this film ride to the rescue of the bad guys, not of the heroes. \"Heaven's Gate\" is a revisionist Western, not in the sense that it seeks to replace moral distinctions with moral ambiguity (as, for example, \"The Wild Bunch\" did), but in the sense that it seeks to give an ironic new meaning to some of the genre's conventions.Cimino was quite deliberately setting out to make a perfect masterpiece. He did not quite achieve that ambition, but it was an honourable one, and his failure was by a much lesser margin than some of his detractors would have us believe. \"Heaven's Gate\", a Western on a grand and epic scale, can be regarded as a flawed masterpiece. 7/10","\"Heaven´s Gate\" is by far not the disaster its contemporary critics condemned it to be. And its by far not the pristine achievement its defenders want us to believe. As a movie, it has too many sequences that drag, to many \"lyrical\" moments that are great to watch but a major violation of the film´s momentum and too many actors evidently not knowing where they are (leading players Kris Kristofferson and John Hurt pitifully among them). But it features Isabelle Hupperts still best performance in a non-french-language movie, one of Jeff Bridges finest performances and a storyline that is willfully political, anti-establishment and anti-Reagan. In fact Cimino seems at times more concerned with the contemporary overtones of his film than with the historic tragedy itself. Coming from a director who just two years before that had made the most conservative and pro-american film about the Vietnam experience (not about the war!), who ran away with the major Academy Awards for doing so, and who had - not to forget - co-written the Dirty-Harry-sequel \"Magnum Force\" together with John Milius of all people, \"Heaven´s Gate\" must have come as a surprise with some impact. Being released in the launching stages of what was to become the Reagan-era, both Cimino and the film were dutifully punished for their conduct unbecoming. \"Heaven´s Gate\" was resurrected as the flawed masterpiece it is at the Cannes film festival four years later. Michael Cimino still hasn´t recovered from the massive blows his career had to take.","HEAVEN'S GATE will always be remembered for at least three things: destroying United Artists, wrecking director Michael Cimino's career, and ending the last golden age of Hollywood, when the directors could make the types of films they wanted to make.  To this day we are still living through the effects from HEAVEN'S GATE.  Although the film was made for only $36 million, back in 1980 that was a fortune.  Many films since have lost more money, but this one wrecked a respected studio.  There is no question as to where all the money went, for it is on the screen to see.  Everything was carefully detailed exquisitely down the extras' clothing.  An entire town was built in a remote area of Montana.  The film opens with a graduation sequence that takes place at Harvard in 1870, which is nicely shot and choreographed, but is completely unnecessary.  Many such scenes are scattered throughout, and the film is more than halfway over before the plot finally starts to move forward.  The actors all play characters who are one-dimensional and/or irrelevant, especially the John Hurt character.  Why Cimino needed so many extras to play the immigrants is unclear, because we never get to know any of them and they are so annoying when they gather together to plot strategies against the rich bad guys who want to kill them off.  The editing is pretty bad, but that's to be expected because there really isn't much of a story here, just a series of vignettes.  Vilmos Zsigmond's photography is good, but too often there is too much dust and smoke everywhere that obscures the characters and locations.  Also, the colors in the film are all washed out; it looks like the filmstock was left out in sun.  For example, in the middle of the roller-skating scene, the color simply vanishes, leaving only light brown and black!  Granted, there are a few things in the film that I admire, like David Mansfield's score.  Isabelle Huppert always looks sexy even without makeup.  The battle scenes are pretty exciting, although I could swear that I saw one particular wagon blow up four times. The film has a rather odd denoument that takes place on board a ship, but everything else in this movie is pretty odd.  Why the studio didn't bring in another writer or two to rewrite the script is a mystery because inside this mess there was a good movie trying to get out.  It's a shame that Michael Cimino still hasn't recovered from this debacle.  I sure hope he makes a comeback.","...they'd probably be better than this.Towards the end of \"Heaven's Gate\", it dawned upon me that Michael Ciminio has no idea what his movie is about. Is it an epic adventure, a revisionist western, a character study, a snapshot of a historical period, a love story, a dramatic expose of corruption, an artful meditation on humanity? Cimino has no idea. He tries to make \"Heaven's Gate\" into all of these things, more or less failing.It's not as if he was concerned about the damage this incoherence would do to the plot, characters, pacing, etc. The bottom line is SPECTACLE. The audience is supposed to be overwhelmed; by the epic subtext, cast of thousands, artistic lighting, the sheer money apparent on the screen. But any self-respecting viewer will tell you that being overwhelmed is not the same as being entertained.Every scene presents a bare minimum of information to tell the story: There's a guy. We saw him before, I think. Now he's on a train. Now he's talking to somebody. Now he's mad. And so on. We get the gist of what's going on, with little clue why or how. Not that we care anyway, the characters are all constructed as supporting players to spectacle.To make matters worse, every shot, scene, sequence, and subplot is about four times too long. There is one exception: the roller skating scene, filled with such energy and cinematic prowess that it seems tacked on from another picture. That alone was worth the price of admission. Almost.Cimino has a relatively unimaginative style of direction, which appears standard on prime time TV. Yet Ciminio constantly gets lost in \"fetishes\", which apparently are dust, trains and horses. Dust is everywhere. Everywhere. Indoors, outdoors, in the middle of grassy fields. Sometimes there's so much dust you can't even see what's going on. Whenever a train appears, we are treated to beautiful, laborious shots that clog up the storyline. There are apparently less people in Johnson County than horses, who repeatedly hog the foreground. Even in the battle sequences. In fact, the dramatic scene at the end of Part I consists of horses riding off a train, obscured by dust. I'm serious.This would be a film forgotten by time if it weren't for the titanic production misadventure that bankrupted an established movie studio, bringing the New Hollywood era down with it. Of course, \"JAWS\" and \"Star Wars\" are guilty too, but only in the best possible ways.But \"Heaven's Gate\" is a sheer mess. Not a disaster, or an ostracized masterpiece. An unguided, absolute, sheer mess. Like T.S. Elliot, \"This is the way the world ends/not with a bang but a whimper.\" It would feel a lot better if the age of the auteur that included \"The Graduate\", \"Bonnie and Clyde\", \"2001\", \"The Godfather\", \"Taxi Driver\", and \"Apocalypse Now\" had ended with a spectacular bomb.But no. \"Heaven's Gate\" is Hollywood's whimper.","I recorded the full-length \"director's cut\" version off of TCM the other day to see if there was validation for this being one of the biggest box-office busts in movie history. After viewing I can certainly understand why it was.I have no problem with movies taking their time developing, so that we can get to know characters and really feel a part of what is going on in the film. But this film gave me the impression that director Michael Cimino felt moving things along at a snail's pace automatically makes those things happen. In spite of the epic length he had to work with, Cimino's character development is quite minimalistic, due to the sheer volume of dead space devoted to empty looks and a lack of dialogue or at least a lack of comprehensible dialogue, which is thanks to un-subtitled foreign languages or bad sound recording. The end result is another film in which we just don't care what happens to these characters, because we really know so little about them, nor are we given a reason to care for them, other than the fact that they exist.The film begins with a long and tedious set-up at Harvard, leading the viewer to believe there is going to be an important significance for this later. As it turns out, there isn't. Strangely, the relationships established in these scenes end up going nowhere. By the end of the movie, several characters, especially John Hurt's and Jeff Bridges', were so pathetically wasted in their development, I wondered why they were even in the film at all.Worst, silliest, most bizarre and utterly maddening scene: the targeted immigrants decide to fight back against the band of regulators. They end up on horseback, stupidly circling around the enemy encampment like a bunch of caricatured Indians circling the wagons in an old Western serial. The only thing missing from the scene as the immigrants get picked off like ducks in a shooting gallery are those stereotypical, hysterical Indian war whoops.But that is just one example of people behaving extremely stupidly and unrealistically in this film.As someone who enjoys subtlety in a film and doesn't even mind one that is slower paced, I nonetheless found myself fast-forwarding through several non-eventful minutes of this film. Thank goodness for that technology, but it made me wonder how anybody would have had patience for even a trimmed-down version of this film when it first showed in theaters.","I was curious to see this one of the \"Big Three\" movie fiascos (the other two being \"Ishtar,\" and \"Waterworld,\" your list may vary) and so gamely gave the \"director's cut\" a try on TCM the other night.I was not disappointed by the awfulness of this movie. I wish I could understand what those who think it's some kind of unappreciated masterpiece see in it. To me, Mr. Cimino is a director (and, let us not forget, also the writer) who cannot tell a story and does not respect his audience. This film is, after all, longer than \"Gone With The Wind,\" but - unlike that fine film - scene after scene has nothing to do with anything before or after it, the dialogue is unintelligible in many places and anachronistically modern in tone, and the whole thing is unattractively photographed in sepia, as if to say, \"look at me, I'm sure making a historical epic alright!\" With all the unnecessary crowd scenes, it's easy to see why this thing turned into a money pit.I appreciated many of the other comments on this movie here on IMDb, they hit the nail on the head. With regard to the various dancing scenes, I admit I did enjoy the one on roller skates, but can someone tell me where the orchestra was that was churning out all that high volume orchestral music on the lawn at Harvard in 1870? (Or did it just come down from Heaven?)Whatever modest talents Mr. Cimino may have demonstrated early on in his career, apparently he deteriorated into a raging egomaniac somewhere along the way. Still, this movie probably could be edited down into some kind of small character-driven film. That would be a fun computer game. I would buy \"Make Your Own Heaven's Gate\" if it ever becomes available.","Now infamous Western that was (at its time) the biggest budgeted disaster in Hollywood history. I was \"lucky\" enough to see the full 220 minute version at a theatre in 1990. It was truly staggering how BAD the film was!They had a great cast, a story based on a true incident (a fight between foreigners and Americans in the 1800s), magnificent scenery...so what went wrong? Three words--director Michael Cimino. He was so full of himself after \"The Deer Hunter\" he went out and made this god awful Western. He's not totally to blame. His previous film \"The Deer Hunter\" was considered a masterpiece and United Artists gave him free reign to do anything. They let him all alone...and everything went wrong. The cost went barreling out of control and Cimino insisted on redoing sequences again and again until they were perfect.First off, the sound is horrible. Entire sequences go by and you can't make out a word the characters are saying. For instance, Jeff Bridges' character is introduced during a dance sequence, but I STILL have no idea who he was! The dialogue in his introductory scene is incomprehensible! That's the director's fault--he should have made sure the dialogue could be heard. Some scenes are shot with so much dust flying around you can barely make out what's going on. The story line doesn't make a whole lot of sense and Cimino took great liberties with the facts--in the real story only one person was killed--Cimino turns it into a massacre. There is some admittedly beautiful sequences here totally destroyed by lack of story and incomprehensible dialogue. Also the bad sound was not the fault of the theatre--all the prints sound that way.This garbage effectively closed down United Artists and was the end of Cimino's career. A textbook example of a director so full of himself he doesn't realize what he's doing. Jeff Bridges has said this is the worst movie he ever did. This is from a guy who made \"Tron\"! A definite must-miss.There is a pretty good book called \"The Final Cut\" which details the whole disaster. This gets a 1. I wish IMDb had negative numbers--this deserves it!","The director spent a lot of time making the scenes look real right down to the historical photos and all the sounds of the old west bustle. Too bad the Producers and Writer/Director, Michael Cimino, spent zero time on any of the historical facts of what the Johnson County war was really about. A lot of the war was over how public lands should be used for grazing. The cattlemen didn't want the poor sheep herders on the land to compete for forage on this cold, windswept plateau. The entire epic makes no mention of grazing sheep which was one of the most important reasons for the war.The worst scene is the battle between the peasants and the hired killers. The peasants are shown circling the gunmen like a bunch of Indians would do in much earlier Hollywood movies. The true fact is that Johnson County Sheriff William (Red) Angus, with a posse of 200 to 300 men, intercepted the gunmen and trapped them in a barn at the TA ranch. I doubt any women took part in the siege. Ellen (Ella also known as Cattle Kate) Watson and her second husband, James Averell, were hanged by a lynch mob about three years before the Johnson County invasion. Ella was never a prostitute. This was a canard spread by the Wyoming Stock Growers Association (WSGA) in order to discredit her. The fact that the plot makes her out to be a brothel madam only serves the interests of the WSGA.I object to the use of names of real people in a plot that is so obviously fiction. There is no fact in the events, time lines, or backgrounds of the characters. Why Michael Cimino would use real names of people who were loosely connected with the Johnson County war (and events leading up to it) is beyond me.The movie could have been much more interesting if it had dwelt on the political ramifications of the Federal Government intervention in a State Government's affairs and what happened after the WSGA gunmen were saved by the Calvary. Some effort was made to prosecute the Cattlemen who were responsible by the Johnson County attorney. But since Johnson county could not afford the court costs and the Governor of Wyoming, Amos W. Barber, backed the WSGA, the charges were eventually dropped.Overall I think the movie was just an excuse to show Isabelle Huppert naked for much of the three and 3/4 hours of running time on the DVD version.","Let's see. What annoyed me most? The extra long dance scene in the beginning watching people twirling around so much I got dizzy... Without even showing where the music was coming from... All part of a college graduation that had nothing to do with the rest of the film. Or perhaps it was the fact that each scene lasted about fifteen minutes longer than they had to. What a drag this film is. And the most annoying aspect is the bad guys are so bad, so obviously horrible that it seems as if the director were making this film for second graders. \"These people are bad... These people are good\". Whenever a movie has its agenda-heart on its sleeve I am beside myself. There's a scene in a rollerskating rink that seems totally out of place. Long drawn-out love scenes with the main character and a Russian prostitute that seems more like a rock star and his sexy groupie. John Hurt's character, who is part of the overlong beginning scene, drinks and disagrees with the overdone villains. His death scene could very well be the stupidest in history. And I hear everyone, even the haters of this film, talk about how gorgeous the cinematography is. I think it looks washed-out. Watch \"Days of Heaven\" if you want to see gorgeous backyards. This movie is even worse than the anti- hype. It's pointless. The epilogue, showing the main character in a yacht, was almost as dumb as the prologue. The battle scenes are tedious and dizzying. This movie is really bad. Avoid it unless you love bad movies, because this is the king of them.","Thanks go to the great Vilmos Zsigmond for making this film look beautiful, but tear that away and you have a ridiculously long (3 hours 39 minutes) weak story with mostly one-dimensional characters. The long gaps between lines and each overwrought scene- be it a noisy town meeting or a gang rape- gives you plenty of time to think about how this could have been a two hour film, and you can spend the rest of the time finding other things wrong with it. While the actors are all pros, sometimes adding dimension to their roles, they are usually bored beyond even scene-chewing. Aesthetic pacing is one thing, but then when it occasionally gives you canned lines like the bad guy saying, 'I am the law' into the sepia mix, well, it's just fodder for MST3000. Even they'd get bored. If you see it, you'll be bored, too. It's a typical Hollywoodization of an actual historical event- in other words, here, have another love triangle with a sweet prostitute, the sheriff, and a sorta bad guy. In an ultimately failed attempt to reinterpret the western, Camino instead grabs at all the standard 70's clichés: graphic violence that quickly becomes cartoonish, butt-naked ladies, jumpy volume shifts, and anti-heroes. Whee. Face it- when you think Old West, do you think... roller rink? Not really surprising that it's such a legendary flop; it has such high aspirations to fall from. On its long, long, long way down, it looks great, indulgent, and expensive the whole way, and goes flop. You will thank the invention of the Fast Forward button.","This is the movie that, pretty much, sounded the death knell for the auteur in Hollywood.  At over 40 million bucks, Heaven's Gate is so poorly conceived and executed it would take a lifetime to break down every area of failure.  What really galls me the most about it is that technically it's very bad, an unforgivable sin for the money that went into it.  John Hurt's commencement speech at Harvard is inaudible, as is a conversation between Kris Kristofferson and Richard Masur at the train station.  Some people seem to think Cimino intended this as a \"style\". He didn't.  It's just bad sound recording.  The characters are not particularly well-drawn, except for the four or five leads; in the climactic battle scene, it's difficult to tell who's the bad guys and who's the good guys.  Even on that level, it's impossible to enjoy the movie.  The casting of Isabelle Huppert as the town madam is a joke, her French accent renders the whole character a fraud.  The acting is generally stiff, without any range or depth of feeling; even Christopher Walken is bad.   John Hurt's character is the only one with any swagger or vitality (although Hurt, in his 40s, playing a fresh-faced Harvard grad with bags under his eyes is patently ridiculous).        I guess to say that it's overlong is overkill.  The roller-skating sequence could have been easily cut, the cockfight scene is rapidly becoming a movie cliche, and the final scene on board the ocean liner is right out the Twilight Zone.   Having Rod Serling appear before the camera at the end to explain what we just watched would have been the perfect finale. Actually, those scenes in and of themselves are not bad, but Cimino has not earned the right to include them, because what he's given us as the \"meat\" of the picture IS so incompetently bad.  The editing is poor, especially in the grand battle climax. At one point, the same explosion with the same wagon wheel flying from the blast is used three different times.  I wish could I say something- anything- nice about this movie: a great scene, a great performance, even one memorable line of dialogue, but I can't.  It is all just one big unholy mess.  About the only thing I did like was the cinematography and the Montana locations, which are stunning.  Even Cimino couldn't screw that up.  This is a long, boring, bad movie by all standards. And the people who say that it gets bashed only because of the cost overruns are just kidding themselves.  1/2 * out of 4","Time to make not one, not two, but three confessions.1. I have tried to make it past the first hour many times, and just barely made it past the third as of recently. It wasn't easy- good thing I had a pot of coffee nearby. 2. I absolutely hated the Deer Hunter. Thought it was complete garbage as with any Michael Cimino film. 3. I believe anyone who has sit through even 5 minutes of this cinematic abortion deserves a big cheque from Cimino himself as an apology.Don't listen to the people who call this film a masterpiece. I don't know what they're snorting, and I certainly don't want any of it, especially if it dumbs them down enough to make them call this film a masterpiece.Don't get me started on how long each scene is. The 20 minute dance scene in the beginning will make you go \"OK is it done yet????\". Or the 5 minute shots of people staring off into the distance. I don't mind movies starting off slowly, as long as the time is spent to set the tone. I'll mention Inglourious Basterds here- the opening scene is 20 minutes long and consists of a conversation at a table between a Nazi and a Jew. However, it's there for a reason. It's a scene in which miss a single line of dialogue, and you will not get the film. It does an excellent job at setting the tone and having the audience on the edge of their seat.To say this movie moves at a slow pace is really wrong- it doesn't move at any pace at all. It just sits on its arse and expects the audience to help it move. That's not to say that nothing happens, because plenty happens- too bad only 10 minutes of it are actual content. There's a difference between epics and length. The entire dialogue could fit onto maybe 3 sheets of paper, and back to back too. And whatever dialogue was there, it wasn't even interesting at all.The movie even looks like crap too. Half the film is shot in Sepia- this takes 2 seconds to get annoying, and by the third hour, it you'll be needing to see an eye doctor. This is just a horrible film, and one that should be avoided. The quote on the back of the DVD is right too- \"A Remarkable Achievement\". I'm only sure the full quote was \"A remarkable achievement in boring its audience to death\".","My friend brought this home to watch on a Sunday afternoon.  We settled in and hit play.  10 hours later (how long was this movie?  32 hours?), I was ready to pontificate.  I took a nap, and when I awoke, Heaven's Gate was just settling into the plot.  The characters are loathsome.  White upper-crust twits kill rape and pillage at will.  At last count there were 7 plots and 42 subplots in this dreadful piece.  It would have been more entertaining had the director simply shot page after page of the novel as opposed to acting this horrendous tripe out. American soldiers are using this movie on the enemy in Iraq as a method of torture.  If you're into masochism, this is your kind of film.","Had never seen (nor heard of this film) until the last couple of months, when the original was released to the cinemas here in a \"Dolby Digital New Panavision print\". Well, I can't see anything \"new\" or \"restored\" about this, except that it wasn't the \"edited\" version that was apparently released in 1981 in the USA after some (justifiably) bad press.Here are this cinema lover's problems with it: 1) Slow and overlong scenes, and requires much editing. 2) Has lacklustre focus. 3A) Poor sound: Could not hear the dialogue during scenes with noisy backgrounds, whilst other times it left one wondering if they were speaking English. 3B) Lack of subtitles for non-English dialogue. Often it is not important as one eventually understands the approximate point of a non-English dialogue exchange, but here there is QUITE a bit... and when also considering 3A, there is DEFINITELY a feeling of \"missing\" quite a lot of the story. 4) A poor \"restoration\" (perhaps it was a re-release of the original 219min print?). 5) Poor film quality or photography. 6) The film is very unclear as to what point it was attempting to make. It was understood (during the screening) it dealt with the plight of new immigrants, but it FELT more about being SOMEWTHING in regards to the protagonist - and/or perhaps his view of the world. 7) Leaves too many plot & character questions unanswered. 8) Badly directed (or should this be #1?).The only good thing was the artistic direction (sets, locations, etc); the acting wasn't bad either (when one could actually hear the dialogue).It makes one wonder how a film could be so bad, when it contains such good actors - who at the time, were either at the top of their game or were about to become famous through their future work). This obviously proves (once and for all) that having the best actors does not necessarily make a good film.One wonders if the original re-cut 149min version is any better, but reports (and other comments here) suggest otherwise. So it only gets 1.5½ out of 10 (for the scenery and acting, when it \"shone through\".","The first hour and a half could have been condensed to 20 minutes without leaving anything out. Sometimes less is more. Just way too much empty scenes that mean nothing.Did some research on populations, ethnic stats, etc for Wyoming in 1890. There were only 2,300 people there in 1890. Casper had a population of 870 but from the street scenes in the movie you'd think the whole population was on the street at the same time! In reality the streets would have been almost empty with wind blowing the dirt around. And where did all these Slavic immigrants come from??? Almost none of them trekked West in the late 1800's. They mainly stayed in the East (NY, NJ, Pennsylvania) As for the battle itself, the \"invaders\" were trapped in a ranch bunkhouse not out in the open. There was no wheeling around the \"invaders\" like Indians. And there were no barrage wagons used. Instead of 100+ people getting killed in the \"War\" maybe 6 or 7 actually died.And what is with the horrid visuals? I was getting nauseous from the yellow pall that constantly hung over the film.All in all the film is way too long and boring. And terrible on the facts.","The recent death of Stephen Bach, one of the producers of HEAVEN'S GATE, has raised the specter of at least a partial resurrection of the reputation of the cursed film. Moreover the original release, the \"long version\" was recently shown on TCM exposing the film, in ail probability, to its largest audience ever. I saw the film when it first came out at a packed screening in a 3rd Avenue cinema across the street from Bloomingdales. I think it was released on a Friday and withdrawn on the following Wednesday. Maybe that wasn't a fair release but it was and is a terrible film. Seeing the full-length version recently confirmed that judgment and with some thirty years more experience watching and writing about films I am better able to articulate why.First there is the dreaded phrase \"mise-en-scene\" whose definition is at the same time so simple yet so amorphous that it puzzles even after being defined. Basically it's everything that happens in front of a camera. For example, a crowd extra will be given a piece of action, say just walking by on the sidewalk and a spot to start from. When the assistant director yells action the extra will go through their action. If there's another take the extra will return to the start spot and go again on \"action\". All of the extras do this. Then say a cab drives up to the sidewalk and the star gets out and embraces another principal while all the while the crowd extras are doing their thing. This is mise-en-scene. In the theatre they call it blocking but cinema is far more multi-dimensional.The importance of defining mise-en-scene is because when the French critics developed their theory of the auteur the opposite of an auteur was a métier-en-scene, even more derogatorily referred to as a \"traffic cop\". An auteur was intimately involved in the meaning of a film and through the director's body of work a theme or themes discerned. The metier-en-scene was basically a company man rendering in film what had been handed to him on paper. It is the difference between say John Ford and Sam Wood.The second point is how the director, Michael Cimino, got into the position of directing films. Cimino first gained prominence directing the first million-dollar TV commercial. This depicted a Chevrolet floating down the Grand Canal in Venice. This commercial never appears on any lists of greatest TV commercials of all time and is notable solely because of how expensive it was and how utterly exaggerated it was. The effect is like that of a three year old girl brought out to entertain company who gets her biggest response when she flings her dress over her head. Cute for a three year old, embarrassing for a thirty year old. So Cimino was praised early on for spending a huge amount of money for some over-the-top image and so he learned.His first film, THUNDERBOLT AND LIGHTFOOT (1974) has a scene where Clint Eastwood and Jeff Bridges are passengers in a lunatic's car that drives back and forth, back and forth, until it drives off the road and the driver opens the trunk full of rabbits which he proceeds to shoot one by one. I had the feeling that if the producer, Eastwood, hadn't stepped in, that the scene would have lasted until every rabbit had been killed.Which brings us to HEAVEN'S GATE. I guess if one watches the film on a DVD in snatches like a mini-series it can be impressive. This is because scenes are directed with such a dense mise-en-scene that each scene is like an encyclopedia it's just plain exhausting to sit through nearly four hours of this. Its like sex, at some point it just becomes a whipping. There is the opening 40 minutes, which takes place at Harvard. Brilliantly photographed at Oxford, it is something of a non-sequitur. I personally favor the artistic way of unfolding a story as opposed to the more commercial _\"Now I'm gonna tell you what I'm gonna tell you\" of most films. However the whole preface adds up to only one line- Kris Kristofferson and John Hurt went to Harvard together. Now twenty years later All of that time, money and effort, not to mention all of the audiences' attention and energy just to deliver this almost useless piece of information.Then there's the scene in the street between Kristofferson and Masur which just goes on and on with a populated city of background extras and horse drawn vehicles in the background in continuous motion to deliver a tiny bit of expositional information. It's just so exhausting. There is just one scene after another like this. It's like trying to eat a thirty- pound pizza. Then there are these long conversations of inconsequential details and unintelligible, witless dialogue, which go on and on and are exhausting and boring. Of course any single scene excerpted looks brilliant. Overall it's a rich piece to spin praiseworthy articles about. Seen in snatches with the possibility of fast-forwarding through the boring bits or turning it off if feeling mise-en-scene whipped, it's basically painless. But don't let anybody tell you it's a good film. When I saw it in 1980 there was a guy sitting in front of me who commented on the scene where Kris Kristofferson is on his horse and he turns one way and then the other and does this about six times. \"That's symbolic,\" he said, \"of he doesn't know which way to go.\" That is basically, at its kernel, the basis of every pro- Heaven's Gate critique.Watch it, if you must, but be forewarned, this is not a film whose time has come, this is a stinker which will smell for all time. HEAVEN'S GATE is historically inaccurate in the extreme. I recommend the book BANDITTI OF THE PLAINS by Asa Mercer on the Johnson County War.","\"The Deer Hunter's\" success with critics and publics alike led United Artists to give Cimino carte-blanche on \"Heaven's Gate,\" an epic Western about the 1892 Johnson County Wars The elliptical story, about the persecution of lowly European-born farmers by Wyoming's cattle-barons, was a muddled mixture of class-conflict, sumptuous pageant and underwritten, stereotypical characters However, Cimino's fetish for authenticity and his sweeping sense of scale ensured that the film running at nearly four hours  was rarely tedious Its undeserved status as a cause célébre, with critics divided as to whether it was a masterpiece or a fiasco, derived from its inflated budget Blamed for the studio's financial problems, Cimino became a scapegoat for Hollywood's general decline, and the film, edited into an incomprehensible short version after its initial release, was a commercial disaster","I had to order \"Heaven's Gate\" off the Internet in order to see it. I couldn't find it anywhere in town. I was insatiably curious about it.I watched all 219 minutes of it in one day. I have viewed it in sections several times since. I must say, it is a painful experience. I don't mean painful as in it's so terrible you can't stand watching it, I mean painful as in you feel it's lost greatness. It should have been so much better.Vilmos Zsingmond's photography is splendid. The entire film looks like it has been soaked in gold, making it feel like you're watching a lost memory. David Mansfield's music is absolutely sublime. I've caught myself humming the tunes from this film many times.Other than that, the movie is crap. I am unsure of how close it comes to reaching it's intended greatness, but I assure you, it doesn't.The plot follows like this: James Averill (Kris Kristofferson) graduates from Harvard University full of youthful idealism. This opening runs for about 20 minutes. He runs to a commencement ceremony. Their are several very long speeches. One is from the university president, the other is from the class orator. These speeches say nothing, really. The writing is not very good. They tell about how they are going out to civilize a country. They are so wordy you get lost after a few seconds. Then, everyone is dancing on the lawns outside. Then, the lawns are empty again and everybody runs out of the buildings and gathers around a tree. They try to take flowers from high on the trunk, and end up punching each other for no apparent reason. We are given no explanation as to how or why they all went inside after dancing and then ran out again to pick some flowers. Then, they are all standing around the tree at night, singing. I guess they are saying goodbye to their youth. That could have been accomplished in much less screen time. Fast forward twenty years. James Averill is on a train west to civilize Johnson County, which is in anarchy. He is the new sheriff. From then on, the film is a mess. Their are so many scenes that serve no purpose. It takes over another hour before the characters are established. We learn that James had taken a lover in Ella, a local prostitute. Later, we learn that she has also fallen in love with a local gunman, Nathan Champion(Christopher Walken, wearing eyeshadow that makes him look like a clown). Champion is involved in a plot to kill 125 immigrants suspected of stealing cattle. It all leads up to several battle scenes that, thanks to the aforementioned photography, are very good to watch. But, the movie is so poorly made that I don't know how it escalated to the point of war. It has all been people talking to each other in cabins. The immigrants in this movie have no purpose but to look cute, look ragged or poor, and to scream things in other languages when under stress.The film has a point, I suppose, of how crappy it is to grow old. Many people think they are smart when they enjoy films with sad endings because it makes them feel like they are better then the rest of us because they don't need to feel good after a movie to enjoy it. Do not be fooled by these people. This ending is cheap. It is pointless. Well, I suppose it's point is a nihilistic view on life and old age. But it is a cheap point that can be found anywhere, and is certainly not worth 40 million dollars. Watch this movie for the look and sound of it, but don't take it seriously. It is not accurate to history, and it had nothing to say."],"review-user":["travis-46","Cherubin","RJBurke1942","wahe","jackstowaway","jlandman","lswote","JamesHitchcock","gts-3","Pinback-4","porbeagle_zen","Whythorne","PresidentForLife","preppy-3","dran001","skullislandsurferdotcom","IDs_Ego","rcraig62","Meven_Stoffat","elhbee","f_alcon","bachdt","max von meyerling","Nazi_Fighter_David","adam89er2003"],"review-date":["13 September 1999","24 February 2001","21 January 2007","25 September 2004","28 January 2005","15 March 2004","4 November 2000","28 April 2008","8 October 2000","8 August 1999","19 April 2007","6 March 2010","4 March 2010","12 February 2001","29 January 2008","5 April 2009","15 September 2004","20 June 2004","24 December 2010","27 April 2004","6 February 2005","24 October 2008","9 April 2009","30 October 2005","15 May 2005"],"review-rating":["10","8","9","9","7","9","9","7","6","5","1","1","1","1","1","2","2","1","1","2","2","4","7","4"],"review-title":[" THE CENTURY'S MOST UNDERRATED FILM\n"," don´t knock it til you have tried it\n"," As the good book says, many are called but few are chosen... and most are damned.\n"," Lost Greatness\n"," Curate's Egg of a movie\n"," A Masterpiece - I Thought There Were Only Three Of Us\n"," What did Hollywood have against Heaven?\n"," A Flawed Masterpiece\n"," A flawed masterpiece\n"," A wasted opportunity.\n"," If Cecil B. DeMille made art films...\n"," No wonder it was a bust\n"," The Reviews Here Are The Best Part !\n"," A mess\n"," Long on boring detail, short on fact\n"," It's That Bad... And Worse!\n"," A mediocre two hour film that goes three and a half.\n"," Hell's Gate\n"," A western in the tradition of The Wild Bunch... if the first three reels of TWB were replaced with \"The Sorrow and the Pity\".\n"," Utterly unwatchable\n"," The restored/original 219min version: An example of bad direction.\n"," I can see why it bombed\n"," Don't be fooled- It Stinks!\n"," A masterpiece or a fiasco?!\n"," not a very good movie\n"]}