{"review-url":["http://www.imdb.com/title/tt0068398/reviews"],"review-text":["Interesting to see this movie 30 years later; it's still good theater, even better TV. I think the unique qualities of this particular Columbo episode may have been largely due to the relationship between Falk and Cassavetes off screen, but it certainly worked in this show. This one reiterated Columbo's quirky, irritating methods; and again, one of the reasons the entire series was so watchable was the low-key progression of the drama. This is one of the few 'cop shows' I ever watch because it's based in human interaction and pyschological issues, not in violent shocks. I think Bochco did a very good job on this film.","Alex Benedict (John Cassavetes) is an orchestra conductor having an secret affair with his pianist. When she threatens to expose him and create a scandal if he doesn't leave his wife, he sees he has no choice but to murder her and make it look as if she had committed suicide. Too bad for him our rumpled detective, Lt. Columbo (Peter Falk), is on the case.Stephen Bochco has written another razor-sharp episode for the series, following marvelous detail with marvelous detail. We watch the villain commit his murder and set up his alibi for about twenty-five minutes, and we're completely engrossed. Then when Columbo appears on the scene, it gets even better.We first see Columbo after the murder (as per usual). This time he's at the vet with his new dog. Scenes of purely comic relief are usually the weakest ones in the show (think Columbo's discomfort over the nude model in \"Suitable for Framing\"). Columbo is hilarious when he's dithering or bumbling deliberately in order to trip up his quarry; but too many writers make the mistake of showing him in a ridiculous light when he's with non-suspects. Bochco, by contrast, shows Columbo a bit awkward with his new pet in a handful of low-key scenes that are funny and artfully integrated into the story. (And I'm grateful he didn't strain for a punchline to Columbo's quest to give the dog a name. As far as we learn, the dog remains nameless.) Bochco gives Columbo some of his best moments in this episode, and Peter Falk makes the most of them. He's particularly good in a monologue where he expresses disbelief that anyone could kill herself, much less this brilliant and beautiful young pianist. And he's even better in his scenes playing cat-and-mouse with Cassavetes. That these two long-time friends and collaborators would play off each other brilliantly is to be expected; and that's what we get. Notice how Alex Benedict can't help but admire the deceptively dimwitted Columbo, even as the brilliant detective is tightening the noose around his neck.Bochco makes the most of every situation in his script. When Columbo goes to question Benedict's snooty mechanic, of course – of course! – he asks the man to look at his own beat-up heap. And when Benedict finds Columbo at the Hollywood Bowl before rehearsal, of course – of course! – he's on the piano playing \"Chopsticks.\" And what should our audacious lieutenant bring with him but the victim's typewriter with the phony suicide note still in the roller.Columbo also has good scenes with a precocious little girl (Dawn Frame) and the lovely Blythe Danner, who plays Cassavetes's wife. It's nice to see Myrna Loy show up as Danner's mother, though she does little with her minor role.The director Nicholas Colasanto (who also acted, most notably as Coach in \"Cheers\") does a perfectly creditable job, though he follows the lead of nearly every other \"Columbo\" director by adding one or two silly flourishes. Scenes end by going out of focus and begin by coming into focus. Then there's that bit where Cassavetes sees the carnation he dropped at the scene of the crime – and we see a zoom-in shot of it reflected in his sunglasses. There's also one scene with Myrna Loy and group of old fogies that is atrociously performed by everyone except Cassavetes.These are quibbles, though. This is a splendidly entertaining episode, the kind that made me a \"Columbo\" fan.","Etude in Black is one of my favourite Columbo episodes, it was one of my first ones as well and the one that officially made me a fan. I agree it is not note-perfect, the scene with Myrna Loy and the fogies is very badly played and one or two of the clues were a little too obvious too early especially the carnation at the scene of the crime(which the mystery revolves around) and while I loved the chemistry between Columbo and Benedict I personally would've liked more mind games between the two perhaps.However, when it comes to the production values Etude in Black is one of the most visually beautiful and interesting of the Columbo episodes with skilled camera shots and lighting. The music is a sheer delight, and part of the reason why this episode holds a special place in my heart. The premise is a clever one, and the story is very well constructed with some fun scenes. Here Columbo is delightful, he does get increasingly irritating throughout Etude in Black but deliberately so. There is also a razor-sharp script, satisfying chemistry between Columbo and Benedict and good direction.The acting on the whole is great. Peter Falk is exceptional once again, particularly in the monologue which cleverly expresses Columbo's disbelief at how anybody would kill themselves. I also liked the scene(s) with his new dog, which thankfully were appropriately awkward(fitting Columbo's character) and low-key. Blythe Danner is divine as Janice, she looks lovely and acts very convincingly, Myrna Loy has a smaller role and is merely okay. John Cassevetes however is brilliant, very sexy and deliciously stone-cold as well. His way of conducting is the only part of his performance that rings false(not only was it an odd way of conducting but some of it was out of time as well), but his voice, mannerisms, interaction with Columbo and delivery more than compensated, he is both dark and wacky in the ending which wraps things up well.All in all, a fine episode and while not perfect it is a personal favourite. 8.5/10 Bethany Cox","The Columbo formula - as everyone knows - requires the great one to wear down his opponent almost to the verge of a nervous breakdown until they make the fatal error that reveals their guilt.For me the great moment in any Columbo story is the point when he knows who the murderer is, then has to set about proving it. In this film 'the moment' comes when he sees Alex Benedict replacing a flower in his tail coat, revealing he had been at the victim's home earlier that night. From there the pursuit is on.In 'Etude in Black' Columbo seems almost sadistic in his pursuit of Benedict. He 'turns up' at his home (twice, the first time supposedly just for an autograph), at his garage (actually sitting in Benedict's E-Type and revving the engine to pieces, having told the mechanic he was 'a friend') and at the Hollywood Bowl. He is constantly 'sidetracked' in his questioning and 'forgets' to mention the investigation has been changed from suicide to murder and that he is now in charge of the case.One blot in the film is Cassavetes 'conducting' of the orchestra. There's more to it than waving your arms about. He could at least have tried to keep time with the music. We're being asked to believe this man is a world-famous musician and on this evidence Alex Benedict couldn't direct traffic. Perhaps the pieces for the soundtrack were only chosen after filming.This is a classic Columbo episode that pairs Peter Falk with his long-time friend and collaborator John Cassavetes. I actually think the scene where Columbo asks Benedict about the cost of his house, furniture and how much he earns was improvised between them. I can see the set-up: \"Columbo has turned up unexpectedly at your house, you know he wants to ask you something but you don't know what it is. You have to avoid giving him any real information.\"","ETUDE IN BLACK is one of the strongest of the early COLUMBO episodes, where it seemed the writers could do no wrong. It benefits from the fine acting of guest villain John Cassavetes, who really gets into the nitty gritty, egotistical mindset of one of the world's top conductors, who's forced into bumping off his mistress in order to keep his life perfect.The story is a relatively complex one, offering few clues for Columbo to get his teeth into, but he does eventually start picking the story apart. Blythe Danner has a nice role as Cassavetes's ice-cold wife, and there's welcome comic relief from the detective's dog, who appears for the first time in the series. Altogether, the production values are very strong, the pacing is decent, and the sense of time and place is exemplary.","This is another of my favorite Columbos. It sports a top-notch cast, including John Cassavetes, who was never handsomer or sexier, Anjanette Comer, Myrna Loy, and Blythe Danner. Now here's something I've always wondered - had Gwenyth Paltrow been born when this episode was shot, or was Danner pregnant at the time? Thanks to IMDb, I have my answer - she was five months' pregnant. Now I can really feel ancient.Cassavetes plays a brilliant conductor whose marriage to Danner was apparently to use the social connections of her mother (Loy). He has a mistress on the side, Anjanette Comer, a prominent pianist, but she announces she wants more. She's sick of being back street. On the night of their concert, he gets rid of her and makes it look like suicide. Columbo picks up a few problems immediately. One thing he notices: \"You have a beautiful woman here - bedroom eyes - she has money, a body, and a career. Where's the man?\" It's wonderful to see Falk and good friend Cassavetes together. There's a very funny episode at the vet with Columbo's Bassett. Everyone in the cast is great.This is one of the episodes that made Columbo the classic series it became.","My first 'Columbo'. Rather enjoyed it. Great format, and Peter Falk's character extremely good...wonderfully quirky, he can take his place next to Poirot, Miss Marple, and also the likes of Marlowe and Rick Diamond. I can see why this series has such a following. As a professional musician, I HAVE to say a few things. First of all, a conductor who merely produces these pedestrian performances of the most basic examples of the repertoire (Eine Kleine Nachtmusik, Strauss Waltzes, Beethoven...) is never going to have a house like that or fame like that or cars like that, much less be called a genius. And the conducting that the actor does is so bad as to be laughable. No orchestra would take him seriously. There are several little things too, such as his rehearsal of Eine Kleine Nachtmusik (why rehearse it when they've just performed it for TV? Any orchestral musician would be able to play it in his or her sleep anyway...). His instructions to the ensemble are downright nonsensical, and when Columbo asks Blythe Danner what 'quasi fantasia' means, she says it's 'Latin'. It's Italian, as are the vast majority of musical instructions. And finally, no two great musicians would EVER have the following interchange: \"Play something.\" \"What should I play?\" \"Chopin\". Music is their job and passion, they know it well. Something far more specific would be asked for, and offered! I know. I should get out more...","Renowned symphony conductor Alex Benedict (John Cassavetes) has a problem - the pianist with whom he's having an affair threatens to go public if he doesn't leave his wife. This would ruin his career, so he decides to kill her. He arranges the murder to look like suicide. Should the police become suspicious, he has a ready alibi covering him for the time of the murder. What Benedict doesn't count on though is a lieutenant named Columbo.As a general rule, I am a fan of the Columbo movies. But unfortunately, this is not one of the best. The key and fun to watching Columbo is trying to figure out what clues he will use to trap the killer. In Etude in Black, the key to the murder (a flower) is made painfully obvious to the viewer. Add the obvious flower with the even more obvious change in mileage on Benedict's car and I'm surprised it took Columbo more than 15 minutes to solve this murder.Much of the movie is obviously padded to fill a longer fun time on television. But, it's one of these scenes that is my favorite. I get a real kick out of seeing this poor slob Columbo who makes $11,000 a year discussing property taxes with a man who makes millions. Very entertaining.","Given the friendship between Falk and Cassavetes, I'm a little disappointed that some of the interplay between them is less entertaining than it could be at times, especially during the scene where Columbo asks Benedict how much he pays in taxes, how much his house his worth, etc. which seems totally irrelevant and is just plain boring except for one amusing line (Benedict: \"Can I ask YOU a personal question?\" after Columbo has been interrogating him about his assets), as is the scene where the dog is having an injection, where Columbo speaks ridiculously fast for no apparent reason. Why does Columbo ask Benedict for his autograph? That left me expecting the murderer's handwriting to become a crucial clue, but it never does, so I'm baffled as to why Columbo makes that visit to the killer's home at all.The character of Jenifer Welles (interesting spelling of the first name) seems so clingy, manipulative and irritating that I found myself almost willing Benedict to kill her off. This is the second episode where the victim is killed while playing a piano (the first being the far superior Suitable for Framing). The moment when the carnation becomes visible in the conductor's sunglasses is slightly surreal and wholly unnecessary.The upstart Audrey (\"she used to tell me how to handle men\") reminds me of the boy genius in Mind Over Mayhem. Why is it that when Columbo meets children, they seem to be even smarter than he is? Is the fact that Columbo never comes up with a name for the dog supposed to mirror his own \"lack\" of a first name? How prophetic that one of the ideas he comes up with is Beethoven, 20 years before the film of the same name came out.There are two major flaws for me in this episode. First, Columbo doesn't actually see Benedict pick up the carnation from the floor in Welles' house. He only turns round when Benedict is holding it and about to put it back on. Perhaps he already knew it was there, but we are shown no evidence of that. Secondly, at the very end, Columbo has to rely on Janice's remembrance of the fact that Benedict didn't replace his carnation in the dressing-room after the concert. How on earth can she be so certain that he didn't put it back on then? I might expect Columbo himself to have a memory as good as that for minor details, but not a witness. I also find her attitude of \"I could have stood for anything except murder...\" (how big of you) rather inconsistent given that she clearly had a very big problem with his womanising ways, or at least her suspicions about them. I don't believe she would have stood for an affair.The ending is decidedly dark, with Benedict's behaviour becoming just a little wacky when he realises the game is up, brandishes his baton menacingly and winks at his wife (?!) Once again, Columbo ends up comforting the wife. This shows us his humanity, yet we also see a moment of uncharacteristic sarcasm directed at an innocent witness (Paul), when the latter says he never asked Welles the name of her lover (\"Oh, sure... I mean, why would a guy ask his girl the name of the other man?\") Columbo also resorts on two occasions to his old standby line \"I happened to be in the neighbourhood\", which just gets a tad irritating when repeated too many times (it first cropped up in the final scene of Murder by the Book).There is another brief glimpse of Michael Lally, who appears early on as a mechanic. Pat Morita, who was Mr Miyagi in the Karate Kid films, puts in an appearance as a servant. James McEachin, who plays William, later starred in Make Me A Perfect Murder (Season 7).","All Columbo episodes are good. some are just not signature episodes that are emblematic of the series. This episode is one of those.The charismatic John Cassavetes plays a conductor who murders his mistress rather then giving into her demands to leave his filthy rich wife replete with power broker mother-in-law.The problem is too many clues pop up right away (the carnation, the mileage on the car, the paper put back in the typewriter) and Columbo seems to have concluded who the murderer is almost from the moment of first meeting him. The whole episode than proceeds to be one where he spends most of the episode trying to break the murderer down and make him confess (and that in itself is unconvincing because it's based on something very flimsy carnation incident. Add to this a manipulative, unsympathetic victim and you have a recipe for mediocrity rather than the extremely high standard the series set for itself.","A slightly unoriginal plot aside, this is a well-unravelled, holding Columbo story, highlighted by some thoughtfully conceived and executed sequences involving real-life friends Peter Falk and John Cassavetes; a fact which unquestionably amplifies the script's effectiveness. Ordinarily, the quality of the sequences of banter between detective and villain is a significant yardstick in the overall success of the episode; in this case, despite this characteristic, other scenes could have been expanded to better effect - no motive is really ever discussed and Columbo seems to latch onto the villain with less evident evidence than in some other experiences (the important factors about the pink carnation are not significantly developed until later).One other slight fault is that there are less pieces of evidence to grab hold of here, but in one respect, the script-writer is very clever in intimating that the carnation is going to play an important part in this story, but the nailing of the villain is perhaps not as straightforward as one might have expected.Generally, a very pleasing episode, which is not as predictable as one may think.","After repeatedly saying how brilliant so many Columbo episodes are, it's time to honour an episode with maximum points. \"Etude In Black\" is not 100 percent perfect, but it's certainly more than 90 percent...maybe 96 or 97! Last week I reviewed \"Just Married\" and compared it unfavourably to \"Meet The Parents\". Well here's one of the parents, Blythe Danner, in a much earlier role as the wife of famous orchestral conductor Alex Benedict, played by the legend that is John Cassavetes. Alex has been having an affair with Jennifer Wells, a girl in the orchestra (not his first affair, one suspects). She is blackmailing Alex to leave his wife, but as his wife's mother holds the purse strings for the orchestra, Alex doesn't think it'd be such a smart move to destroy his career and marriage overnight. Instead he hatches a plot to sneak out of the concert hall before a performance and murder his young lover while making it look like a suicide.Enter Columbo and guess what? It takes him about two seconds to realise that homicide is more likely than suicide. It doesn't take much longer for Columbo to connect Alex to the victim, and soon he's following him around wherever he goes. Even though Columbo is certain Alex is his man, it actually takes quite a while and a few false leads (none of which Columbo really swallows) before he has the vital piece of evidence.Along the way there are some top-notch extra characters, ranging from the precocious young neighbour of Jennifer Wells and the English mechanic who sounds like he would be more at home on Coronation Street, through to the bedraggled looking brass player who nearly finds himself fitted up for the murder (he had also been seeing Jennifer Wells, the busy girl!). And there's even a brief cameo from Commandant Lassard from the Police Academy films. As with Leslie Nielsen in \"Lady In Waiting\", it's impossible to take him seriously (I bet you're thinking of that speech he made at the podium, aren't you?!) But it's Blythe Danner, John Cassavetes and Peter Falk who steal the show here. Blythe is absolutely divine as Mrs Benedict. From the moment she spots Alex dialling Jennifer Wells' number from memory, she feels deeply troubled by exactly what their relationship was. It's a masterful performance as she struggles to trust Alex despite her intuition telling her something is very, very wrong. Columbo doesn't help matters by interrupting her game of tennis to ask her impertinent questions about Alex's relations with members of his orchestra.As for John Cassavetes, well it's a shame he didn't make any repeat appearances as Columbo villains, because he could have been up there with Jack Cassidy and Patrick McGoohan as one of the all-time greats of the show. But this performance is superb! He's another one who falls into the \"highly irritated\" category, losing all patience with Columbo rather than befriending him and indulging him. Despite this, when the game is finally up he does grudgingly acknowledge Columbo's genius.Well it's a really, really fantastic show. It loses a couple of very small points for its rather sledgehammer view of classical music, as highlighted by many of the posters here, but none of these have any bearing on the logic of the story or the characterisations. And at least the music is good, dramatic and exciting!Finally, if you haven't come across it, there is an absolutely amazing clip of John Cassavetes and Peter Falk on the Dick Cavett show from the early 70s. I'm totally convinced Steve Coogan watched this clip and based Alan Partridge on it. Everything about the clip resembles Knowing Me Knowing You, from the cringeworthy introduction to the total humiliation of Cavett by his guests. Even the orchestra get in on the act, playing circus music while Falk, Cassavetes and their friend Ben Gazzara fool about and ridicule the host.It might not be strictly relevant to this review, but the Cavett show clip gives a nice insight into the deep friendship and professional relationship between Peter Falk and John Cassavetes. It's clear to see from the quality of \"Etude In Black\" just how well the pair worked together!","Wow! This is as good as TV gets. This is cinema level stuff. An iconic character meets up with the perfect supporting cast held up with a truly good story.Cassevettes is spot-on as the conductor of the LA Philharmonic. Blythe Danner as his long-suffering loving wife. Myrna Loy as his wife's mother and the head of symphony organization. And...Columbo.A love triangle aborted by murder this is the cornerstone of \"Etude In Black\". This is one excellent Columbo episode. Not a missed cue in the unraveling of the murder of a young pianist and love interest of Cassavettes. Uniformly excellent performances, great locale points of interest, and a story that holds up under demanding scrutiny...This is \"Etude In Black\".If you have a soft-spot for Columbo this is a must see. A truly excellent episode with a nonpareil cast.","Alex Benedict is a famous conductor and musical genius who also has a weakness for the fairer sex. However an affair with young pianist Jenifer Welles turns badly when she demands that he tell his wife of she will tell her. Sadly, Alex's mother-in-law also happens to be the Patron-of-the-Arts and is pretty much the purse string that Alex's career hangs by, so leaving his wife by any means is not an opinion so, despite the ultimatum only having two choices, Alex plumps for a third  murder. Killing his lover, he rigs her stove, leaves a typed note and makes it look like suicide.As with many TV film series (such as Perry Mason), if you like one or two of them then you'll pretty much like them all. This entry in the Columbo series pretty much follows the usual formula  we know the killer and the \"perfect\" plan but then watch Columbo follow his hunch and gradually starts to pick holes in the story he is told before eventually finding enough to prove his suspicions. Saying this is not a spoiler  it is simply what happens in all the films. With this strict adherence to formula it is usually down to several factors whether or not the Columbo film stands out or if it is just average. From the very start of this film the clues scream out at you Alex recalls Jenifer's number too easily, the missing flower, the mileage on the car  and this is a problem because it takes the mystery out of it and leaves us just waiting for Columbo is work out something that we already know. Although the film manages to pull it back, you can't help feel that it is deliberately avoiding the easy clues in order to drag things out a bit longer than it should have taken. The script fills the film with other stuff but none of these really engaged me in the way that the usual formula does.It is a shame because the cast are good on paper. Falk is as good as ever, here he brings out the more calculating side of his character, playing his cards early in this case. The potential for Cassavetes was there but it doesn't work. He doesn't click with Columbo and the lack of mind games reduces the tension. Smaller roles for Olson, Danner and Loy are OK but nothing special. The cast also includes some reoccurring faces in small roles; Police Academy's Gaynes has his first of two Columbo appearances; Macaulay has his second of three appearances; Perry Mason regular (and constant on screen cop) McEachin has a small role in his first of two appearances in the series, before settling into a much more steady job in the 1980's. And of course, Fred makes his first appearance. These are minor distractions though and the film is very much on the shoulders of the lead two, as is always the case, but here I just didn't think the combination worked that well.Overall this is an OK entry in the series that does enough to please fans but it is hard to ignore the abundance of clues here and it takes away from the mystery by giving the audience that Columbo isn't being as sharp as he was in other films.","This Columbo episode is one of the better and perhaps one of my personal favorites. The cast includes Rosemary's Baby John Cassavetes as the maestro, his wife played by Blythe Danner (Gwyneth Paltrow's mom) and his mother-in-law played by Myrna Loy (one of America's greatest leading actresses in film of our time). Anyway I disagree with anybody who criticizes against this film. This episode is one of my favorites because you have an excellent cast who do a superb job in performing. I love watching Columbo with his beloved dog who he never names in the series. This time, the episode focuses in on classical music at the Hollywood Bowl, one of L.A.'s attractions. Of course, Columbo becomes as interested in classical music as he does anything else involving a crime.","I just love Columbo and I have seen every episode from Prescription Murder to the very last one in 2003 and I have to say that this one is my 4th favourite of all time behind \"Any old Port In a Storm\",\"Identity Crisis\" and \"Now you see Him\" and trust me this is a photo finish that is separated by a print in horse racing terms. John Cassavettes in my opinion was the coolest murderer on the show. The chemistry between John and Peter Falk is beyond amazing and you can probably tell that they were great friends of the set as well. Although not the toughest murder for Columbo to solve due to obvious clues left by Cassavettes, this one just had to be the most entertaining one to watch. Cassavettes is given no room at all to even think his plan out without Columbo harassing him every moment possible. Also Etude in Black features the absolutely brilliant Myrna Loy as Cassavettes mother in Law and she is just perfect in the role and still beautiful after all these years. Do yourself a favour and watch Etude in Black because I have about 10 times since I bought the DVD 5 years a go.","Alex Benedict is a noted symphony conductor married to a wealthy socialite and having an affair with a pianist. When his mistress gives him an ultimatum, he kills her and makes it look like suicide. Lieutenant Columbo however, is unconvinced ...This is one of my favourite Columbo TV-movies (probably only beaten by Murder Under Glass), but I'm not exactly sure why. The story is a good one but mostly revolves around an incriminating buttonhole dropped at the scene of the killing, and the characters are pretty routine types - the conniving two-timer, the jealous wife and the jilted boyfriend. I think it's entirely down to Cassavetes, an extraordinary actor, who is so naturalistic he's almost impossible to read; is he a stone cold killer, a prima donna artiste or just nervous and guilt-ridden ? He doesn't behave like the villains normally do in Columbo (matey or dismissive) and seems much more real and complex as a consequence. Ironically, in real life, Falk and Cassavetes were very close friends and made three movies together. There is a lot more to enjoy however; Colasanto's direction is terrific, there is some fabulous music by Beethoven and Chopin, the Hollywood Bowl locations are wonderful, and Cassavetes' two classic motors - a Jag E-Type Series 1 and a Rolls Royce Silver Shadow - are simply gorgeous. Also, for Columbo regulars, this flick is about twenty minutes longer than normal and features the first appearance of Dog the basset hound. As with all of these stories though, it is Falk's complete immersion in the character which it makes it so compelling - check out the scene where he examines the murdered woman's effects and compares it to the police department dossier. Genius.","John Cassavetes stars as a suave but amoral Classical music conductor named Alex Benedict who feels forced to murder his pianist mistress after she threatens to tell his wife(played by Blythe Danner) and more importantly his mother-in-law(played by Myrna Loy) who owns the company he works at, about the affair. He makes it look like a suicide, but this doesn't fool Lt. Columbo(Peter Falk) who is sure it is murder, and that Alex is guilty, but must look in an unusual place to prove it... First episode of the second season is quite good, with the two stars(and real-life friends) playing off each other well. A bit too long and padded, but otherwise memorable entry.","Story-wise this isn't among the best or most cleverly written Columbo movie but the movie is extremely well made, with excellent directing and truly fine acting.Especially the acting within this movie attracts the attention. Director Nicholas Colasanto did a great job with the actors in the movie. Appereantly he allowed Peter Falk and John Cassavetes lots of space to play with, also since both are being credited on here as uncredited directors of this movie. Must be part of his directing style to allow the actors this much room. It works out extremely well for this movie. Perhaps he did this because Colasanto himself also used to work as an actor. He is perhaps best known for playing the role of Coach in the hit-series \"Cheers\", from the very start of it in 1982 until his death in 1985.So Peter Falk seems better than ever before in his role as Lt. Columbo. Also veteran actor John Cassavetes does a real great job as the movie its murderer and is a good match for the lieutenant. Beside them, the movie also features Myrna Loy. A big star from the silent movie era and also Pat Morita, in a small early role.But not just the acting-directing within the movie is real good. Visually and technically it's also a really great made movie, with slow long shots, without the use of any cuts. Also obviously the reason why this movie is longer than most Columbo movies. It really takes its time to set up things and tell its story. The movie also features a couple of nice artistic and experimental kind of shots. Of course all really fitting for the '70's.But like I said before, story-wise this just isn't among the best Columbo movies. Also the clues being left out for the lieutenant are a bit too obvious this time. It makes the murderer come across as a bit dumb, like he didn't thought his plan over good enough, while the character obviously is an intelligent man. Columbo this time also tries to irritate the suspect and other characters a bit more than he usually tries to do, in order to solve the crime. This and Peter Falk's different acting approach are a reason why his character might come across as different than he does in other Columbo movies. But different does not mean worse in this case.The movie also features a quite good musical score by Richard DeBenedictis, who after this became sort of the steady composer for the Columbo movies. A great Columbo movie to watch!8/10http://bobafett1138.blogspot.com/","After starting watching the re-runs of old Columbo movies, I thought they would all get about the same vote from me (6). But apparently I'm now starting to see differences in the movies. It happened in some of just previous episodes, that showed some pretty genius directing, and it shows in this one, but in the negative way.The movie was so boring, that I sometimes found myself occupied peaking in the paper instead of watching (never happened during a Columbo movie before!), and sometimes it was so embarrassing that I had to look away. The directing seems too pretentious. The scenes with the \"oh-so-mature\" neighbour-girl are a misplace. And generally the lines and plot is weaker than the average episode. Then scene where they debated whether or not to sack the trumpeter (who falsely was accused for the murder) is pure horror, really stupid.Some applause should be given to the \"prelude\" however. In this episode, a lot of focus is given on how the murderer tries to secure his alibi and hide the evidence etc. I really liked that. But alas, no focus on how Columbo reveals all this. And the \"proof\" that in the end leaves Columbo victorious is the silliest ever.Rating: lies between 4 and 5","One of Peter Falk's very good friends from the Actor's Studio in New York John Cassavetes is the culprit in this Columbo episode. Cassavetes is the celebrated conductor of an acclaimed symphony orchestra in the Leonard Bernstein tradition who is having an affair with a young pianist Anjanette Comer. When she threatens to tell about he has to kill her or so he feels. He strangles her and tries to make it look like suicide. But you can't fool forensics and eventually you can't fool Peter Falk.Cassavetes is famous, but he's also kept. He's married to Blythe Danner who is the daughter of Myrna Loy the wealthy patron of the symphony who keeps it alive with her charity. So when Cassavetes jumped the traces he knew he was playing with fire. Actually Cassasvetes has a well conceived plan of homicide. But a couple of things like a flower and an echo do him in. You have to watch the episode to see how.","A critic reviewing Rosemary's Baby talked about its casting. Apparently Robert Redford turned down the lead role which went to John Cassavetes who was too obvious as the bad guy which spoilt the mystery of the film.John Cassavetes was a celebrated independent filmmaker, a personal friend of Peter Falk and Falk appeared in several of his films. Cassavetes wrote and directed films for the love of his art. He appeared in more commercial stuff to raise money for his movies.Cassavetes plays Alex Benedict, a wealthy and famous conductor modelled on Leonard Bernstein. Benedict is having an affair with a young pianist Jenifer Welles who gives him an ultimatum that he informs his wife of their affair or else she would tell her. Benedict has a lot to lose if his wife finds out of the affair as his mother in law is a wealthy patron of the arts and very influential.Benedict kills his mistress and makes it look like suicide and then goes on to conduct a live televised concert at the Hollywood Bowl. Columbo is not convinced that it is suicide and after the concert, hearing that Welles has died Benedict sets off to her apartment only because he needs to retrieve a cut flower that fell off his buttonhole.This episode has some cast, three best supporting actor Oscar nominees with Falk, Cassavetes and Pat Morita. They are joined by Blythe Danner and Myrna Loy. Cassavetes shows a range of emotions, from volatile artist to stone cold killer. The part was made for him.However the pace was sluggish. By messing around slightly with the formula of Columbo, the viewers sensed that the dropped flower would return to haunt Benedict even if the writer added a twist where another man was fingered as a suspect.","This episode is a personal favourite of mine. A conductor whose career is at threat of ruin if he doesn't go public with his mistress, murders said mistress and sets it up to appear as a suicide. Murder dressed as suicide has to be one of my favourite plot lines in a murder mystery and this one certainly delivers. Benedict's confidence, irritation and slow smile are a delightful foil to Columbo's deceptive fumbling and bumbling ways. The plot itself is good, although I can't bear to watch Columbo handling crucial evidence with his bare hands, and even taking objects from the scene of the crime with him in his car! The clues with regards to the typewriter seemed unnecessarily complex to me; rather the fact that the alleged suicide letter had no fingerprints, let alone those of the victim would have been more than sufficient to indicate murder. Some say that the flower clue was a little simple. I actually think that Columbo could have solved the mystery had the flower been left at the piano, been noticed by Columbo and then matched to a picture of Alex Benedict or the set of carnations that Mrs. Benedict had at her house. But that doesn't bother me too much, as a murder suspect returning to the scene of the crime soon after to retrieve something is plausible enough. The best part of this episode is of course the interplay between Falk and Cassavetes. I am given to understand that these two had a close friendship, which works excellently here, and is also the reason why Falk's episodes with Patrick McGoohan are considered classics in the repertoire. The irritation, the condescension and the arrogance displayed by Benedict are glorious, as are Columbo's reactions. The dialogue is great throughout. Columbo's offhand \"surmise\" that Benedict might have been the murderer is one of the best parts of the movie, as is the slow and almost taunting response from the conductor who knows his crime. And it is completely fitting that the murderer concede defeat with a \"Goodbye, genius\". This is very satisfying, along with Columbo's kindness and courtesy to Mrs. Benedict. As some have noticed, Benedict's \"conducting\" is ludicrous. Furthermore, \"quasi una fantasia\" is Italian, not Latin. I don't understand how the scriptwriters could have missed that. Also, the choice of classical music was pedestrian by any stretch of the imagination. Still, that's just my inner critic speaking. But I did enjoy Blythe Danner's performance as Mrs. Benedict; sharp, languid and suspicious throughout. Her insecurities are entirely understandable and she made for a thoroughly sympathetic character. A great episode, fit to be watched again and again.","A good formulaic episode, the usual Columbo flippancy and otherworldly insight into the murderer. Cassevetes was a poor performer however, making you crave a villain a la Culp/Cassidy. Cassevetes looked uncomfortable in the role with a rather silly half-smile on his lips throughout the episode as if wondering what to do next or if to take the role seriously.Despite comments about the image of the flower in the glasses I found this a very nice touch, particular to the 1970s, often derided but innovative and effective. It occurred in the excellent performer Robert Culp's episode as boss of the detective agency, in which his actions following the murder were shown in his glasses.All in all an episode you knew was going to end badly for the (rather poorly acted) murderer from a very early mistake. Cassevetes was a poor choice-Robert Culp or Jack Cassidy were masters of the Columbo villain. This said, good formulaic and enjoyable Columbo in the days before every episode didn't become a comedic farce punctuated by endlessly repetitive Nik Nak Paddywhack let motifs.","This is the one in which John Cassavetes is the symphony conductor, Blythe Danner is his wife, Myrna Loy is his demanding mother-in-law, and James Olson is the trumpet player.Cassavetes, happily married and secure in his job, has been having an affair with the orchestra's star pianist but now she wants him to divorce his wife and marry her. The alternative is that she reveals all to the tabloids, the orchestra's financial backers back out, and disaster prevails. So he murders her.Cassavetes makes it look like a suicide but Columbo is nobody's fool. He's a sartorial shambles but he's not a fool. Piece by piece he puts together the case against Cassavetes, discarding Olson as a suspect and enlisting the aid of a young girl and of Danner. It all hinges on one of those \"clues\" that, had Cassavetes been as quick on his mental feet as he is at the podium, he could easily have gotten away with it.Cassavetes almost always gives a decent performance and he does so here, but he's the most energetic conductor you ever saw. Instead of beating the shape of harps into the air he seems to be sawing wood. Blythe Danner, with her big cornflower-blue eyes and generous lower lip, is infinitely appealing. She's the daughter of the guy who ran the First Bank of Pennsylvania, where I once had an account, and probably owned half the state. She's also the sister of an opera singer and has another brother who is a violin maker, so we can assume she knows music and snobbery. Most of the snobbery rests with Myrna Loy, who is jealous of her guardianship of the orchestra's funds. But James Olson is at least as notable as anyone else as the trumpeter with a troubled past. For those who are into modern jazz, there's a very neatly executed trumpet solo backed by a rhythm section. It only lasts a few minutes but there's a good deal of skill involved."],"review-user":["dotijean-1","J. Spurlin","TheLittleSongbird","vaughan-birbeck","Leofwine_draca","blanche-2","patriciahammond","bensonmum2","pssc6","gerard-21","leightonphillips","stubbers","AudioFileZ","bob the moo","Syl","nightwatch4773","ShootingShark","AaronCapenBanner","Boba_Fett1138","mortenwebstar2","bkoganbing","Prismark10","armanivegas","andyfromstone","rmax304823"],"review-date":["10 September 2004","14 March 2005","13 March 2011","21 May 2004","5 April 2016","10 September 2005","15 August 2005","9 March 2005","8 February 2011","28 March 2016","23 August 2004","3 March 2010","4 October 2013","9 May 2005","18 May 2006","17 February 2013","25 September 2007","20 February 2016","7 March 2008","12 June 2004","9 September 2012","6 August 2018","23 April 2017","27 December 2014","13 February 2012"],"review-rating":["9","7","10","7","5","6","7","10","9","8","10","6","7","8","4","8","6","8","4","8"],"review-title":[" Wonderful interaction between Cassavetes and Falk.\n"," Splendid \"Columbo\" episode, with a razor-sharp script and lively performances\n"," The Columbo episode that made me a fan\n"," Columbo at his most irritating (SPOILERS)\n"," Great acting in this one\n"," love it\n"," Just a few nerdy comments...\n"," The keys to the mystery are too obvious\n"," Potential not fully realised\n"," Less Than Stellar Columbo\n"," A Columbo adventure that hits the right notes in most places!\n"," My First Ten Out Of Ten!\n"," Narcissistic Profile In Crime\n"," The plot is not as good as normal and the lead pair misfire  still OK for fans but not up to the standards of the series (spoilers)\n"," One of my personal favorites!\n"," Wow!!!!!!!!!!!!\n"," One Of The Very Best And Most Unusual Columbo Stories - Don't Miss It\n"," The Conductor\n"," One of the better made Columbo movies.\n"," disappointing\n"," You can't fool forensics\n"," Étude in Black\n"," A Personal Favourite\n"," Poorly Performed Villain in Good Formulaic Columbo\n"," Up To The Usual Superior Standard.\n"]}