{"review-url":["http://www.imdb.com/title/tt0010962/reviews"],"review-text":["Silent historical drama based on the story of Anne Boleyn, newly arrived lady-in-waiting to the Queen who catches the lustful eye of Henry VIII, bad-tempered King of England who loves to feast, drink, hunt, be entertained by his court jester, watch jousts, and chase around after young beauties who jump out of cakes and assorted attractive females around the castle. Well, he's soon annulled his marriage, married Anne, and telling her it is her holy duty to produce a male heir. She fails on that score and he soon has his eye on yet another lady-in-waiting. Meanwhile, Anne spends pretty much the entire film looking hesitant, perturbed, or downright ready to burst into tears. She just doesn't come across as a happy camper (or is it just bad acting?!).This film is a solid piece of entertainment, with an absorbing story that held my interest for two hours - plus I enjoyed seeing the very lavish medieval costuming featured here on a gorgeous sepia tinted print. Emil Jannings is quite striking and memorable in his well-done portrayal of King Henry the Eighth - he really seemed like he WAS Henry the Eighth. I am not so sure about the performance given by the actress who plays Anne, seemed a bit over the top. The DVD of this film features an appropriate, nicely done piano score that perfectly suits this story. Quite a good film.","Nothing dull about this movie, which is held together by fully realized characters with some depth to them. Even the hooded torturers have body language. Jannings' performance is brilliant, all will, want and need. A Henry VIII as he must have been. Henny Porten is, maybe, nobler and purer than Anne Boleyn, but she plays the part as written: A victim caught in the jaws of a big (huge) baby.Sparkuhl's cinematography is gorgeous in the restoration, the tints sensuous. Lubitsch lets these characters breathe and reveal their corruption down to the tiniest of meannesses. He takes his time, which can try the patience of an audience accustomed to being carried away by action, but the time is worth spending. Slow your heartbeat and watch this minor miracle of German silent film.","This is a strange piece: a tale of late-medieval English history, made at a German studio, entirely produced and acted by Germans (plus one Swiss and one Norwegian). While we in the UK are quite used to Hollywood rewriting our history for us (Braveheart etc.) we don't expect it so much from our fellow Europeans. But back in the early 1920s the UFA studio in Berlin really was the Hollywood of Europe, and for a few years they had the cinematic prowess to tell whatever stories they liked.The director here is Ernst Lubitsch, who later became well-known in the US for his sophisticated comedies, and back then he was primarily a comedy director too. Anna Boleyn sees him turning his many comical tricks to more dramatic effect. A favourite comedy technique of his was the pull-back-and-reveal, as used for example in the opening shot of The Oyster Princess (1919) to show the bloated Oyster King surrounded by his lackeys. That shot is duplicated here with the introduction to Henry VIII, the look slightly more realistic but just as revelatory of the character. And although Lubitsch's pictures are in a very different category to those of his fellow UFA luminaries Fritz Lang and FW Murnau, he shares with those directors a fascination with décor and architecture. He constantly composes shots in depth, looking down corridors or through into larger rooms, from the early moments at the harbour where a set of doors are opened onto a bustling street, to the haunting final view of the scaffold. This was a common way of emphasising a large space before the days of widescreen, but it also gives the whole thing a sense of dread and inevitability, as characters advance upon us from the distance or spy on each other into a room beyond.Lubitsch also reveals himself to be a master of pacing within a sequence. For example after a handful of busy shots at the spring festival the scene, everything becomes slow, simple and a shade darker as Anna encounters Norris on the outskirts of the merrymaking. Throughout the picture the director encourages steady, measured performances, making some scenes move at a glacial pace but endowing them with atmosphere and fascinating detail, such as the eerie depiction of Anna and Henry's wedding night. Playing the king, the talented Emil Jannings is uncharacteristically restrained, giving us a menacing, moody king very different to Charles Laughton's flamboyant 1933 portrayal. Henny Porten is not quite as good in the title role, her performance consisting mostly of looking extremely disturbed. However she is able to make a good account of herself in the final few minutes, when it really matters. An honourable mention must also go to Paul Biensfeldt as the jester, who makes the most of his close-ups and gives us a sincere and dignified portrayal of this deceptively simple character.Anna Boleyn is all in all a rather stunning feature, and actually somewhat better than most of the historical dramas coming out of Hollywood at the time. It seems that, during this crucial period when the full-length motion picture was beginning to grow up and things like screen acting and set design were becoming serious professions, the Germans had the edge with their strong theatrical, operatic and artistic traditions, upon which their cinematic industry was built. Lubitsch, Jannings, and almost every other member of the crew and cast had a background on the stage, as oppose to the technicians and entrepreneurs who were running Hollywood. In Germany they knew very well how to tell stories visually, how to merge production design and performance into a complete form of expression, and they had a large pool of people with the necessary experience. The supremacy of UFA would continue until the Americans gained the technological edge in the late 20s (not to mention poaching much of Germany's creative talent), but during this short period it was the most competent movie-making factory in the world. Anna Boleyn is not even the finest output of its time and place, and yet is still made with that powerful blend of storytelling knowledge and cinematic inventiveness, and is a drama of considerable stature and elegance.","Henny Porten is far too old for the role of Anne Boleyn who, the script tells us, is such a super-attractive wench that the king severs with Rome when the Pope refuses him a divorce so that he can marry her. Porten is a very hammy actress too, with as much simpering and eye-rolling as you wouldn't believe. On the other hand, Emil Jannings really looks the part of Henry VIII, In fact he seems to have stepped straight out of Holberg's famous portrait. Admittedly, his acting is a bit exaggerated, but tolerable. And the same applies to most of the players as well. Visually, the movie is spectacular enough and the plot, though familiar, moves along with sufficient pace to retain our interest. On the other hand, Lubitsch's direction is rather disappointing. It's very straightforward with virtually no camera movement at all and little evidence of the fabled Lubitsch touch. In fact, the only stylish quality evident in the direction here is the occasional use of framing devices. Disappointingly, the 1983 print under review does not use Reisenfeld's music score but a just passably appropriate melange of string orchestra, harpsichord and choir rendering vaguely Elizabethan airs. Despite the very washed-out print currently on offer, Sparkuhl's photography still manages to shine in certain scenes – the tournament, e.g. Available on a Kino Video DVD.","This movie earns a 7--because, for its time, it was a heck of a movie. The sets and costumes (mostly which were from the proper period--though some, to the trained eye, were not) are quite impressive. It's obvious that director Ernst Lubitsch was given a huge budget to create this film--and it's better looking than the Hollywood productions of the same period. In fact, today few would realize that the some of the most incredibly complex and expensive productions of this time were German--not American. It was only in the mid to late 1920s that the American films became the best-known and best made. You just can't find a film from 1920 or so that looks better.Unfortunately, looks alone do NOT make a great film. For someone who wants the truth behind the second marriage of Henry VIII, this is NOT a great film--as many of the facts were clearly wrong. Despite what the movie shows, Anne was Henry's mistress for some time before he got around to marrying her AND the process by which the English separated from the authority of the Pope was NOT the quick process you see in the film--it took years. As a history teacher, this film isn't terrible historically--but it still should have been a lot better. And, if you are going to play fast and loose with the facts, then why not at least make the film more interesting? Overall, the film lumbers during its two hour air time and more recent films (NOT \"The Other Bolyne Girl\"--which was also a mess historically-speaking) such as \"Anne of the Thousand Days\" and \"The Six Wives of Henry the Eighth\" are more accurate and interesting.Decent but far from as good as it could have been its sumptuous treatment. Plus, while a Lubitsch film, there's little trace of his famed \"Lubitsch touch\" here in this pretty but rather dull film.","Continuing with the exclusive film programme about complicated relationships in some European courts, last night in the Schloss theatre was shown \"Anna Boleyn\", a film directed by the great Teutonic film director Herr Ernst Lubitsch. The film depicts the terrible story of the Queen consort of the British King Henry VIII. She was executed by her husband ( well, not exactly, the King ordered the executioners to do his dirty work) not to mention that this marriage caused an important political and religious historical event, the English Reformation.The film stars Dame Henny Porten, Germany's first screen superstar during those early years and Herr Emil Jannings, Germany's fattest actor in that silent era. Both play their characters in a suitable way; Dame Porten as an innocent aristocrat who becomes progressively interested in the power that the court offers her and Herr Jannings as the unscrupulous, whimsical and womanizing British monarch, a character very suitable for this German actor who overacts appropriately, given the extravagance and excessive personality of the character himself.In the early film period Herr Lubitsch was known for his outstanding costume films, colossal productions with big budgets ( \"Anna Boleyn\" cost about 8 million marks, a fortune even for this German count ) taking great care in magnificent decors as can be seen during the coronation procession in Westminster Abbey scene which employed 4.000 extras ( idle Germans of that time were used, causing revolutionary workers to create a fuss when German President Friedrich Ebert visited the set during filming).Besides the spectacle, one of the most important aspect of this and every film of Herr Lubitsch, even during his epic period, is the complex relationship between the main characters. We experience a game of different interests, double meanings, and the complicated art of flirting but what is treated lightly at first ends in tragedy. The importance of those historical facts is brought to bear in an effective way but Lubitsch is really more interested in the changing relationship between Henry VIII and Anna Boleyn.And now, if you'll allow me, I must temporarily take my leave because this German Count must take care that one of his fat and rich heiress doesn't lose her head for this Teutonic aristocrat.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/","I must admit that I fell asleep while watching this movie. It is simply too long. People who are interested in Ernst Lubitsch's work before he went to Hollywood might find it interesting, though. As a matter of fact, it is a well directed movie. Maybe there are no classical Lubitsch touches to be found. Nonetheless, I found the way the story was presented original and engrossing. There are many superbly choreographed mass scenes on stage sets as well as in outdoor settings.There can be no doubt that the makers of Anna Boleyn wanted to accomplish an artistic achievement. The set design and especially the wardrobe are fantastic. The people responsible for that must have made a thorough study of period paintings. I had the impression that many poses of the actors were also derived from Renaissance painting. Lubitsch's task might have been to lighten the whole thing up, and I could not say he did a bad job. My favorite scene is a kind of a summer entertainment for the king. On a large meadow a group of people play something like badminton, but they are evenly distributed over the whole area, and the balls fly in all directions. It happens what must happen, Anne Boleyn's ball lands at the feet of the king who already had an eye on her and seizes a racket to challenge her. The next ball lands in a grotesquely artificial copse with high weeds into which both the king and Anna plunge, together with the court jester.An interesting detail: the movie has on several occasions shots of people with different aspect ratios from the other shots. The aim seems to be to highlight certain bodies or poses by framing them. This intensifies the reference to classical artwork but also irritates when there are quick cuts between a special focus and a more general aspects.","In those years when the cinema had no voice it was truly an international medium. Stories from other lands could be brought to the screen by the movie industry of another country. One of Greta Garbo's sound films for MGM had her playing an English lady. And here Emil Jannings whose inability to speak the King's English and forced him to return to Germany plays that most English of monarchs Henry VIII. In this Jannings joined a great pantheon of English speaking players like Charles Laughton, Montagu Love, Charlton Heston, and Robert Shaw who all played the monarch who changed wives like some change underwear.Jannings is an impressive looking and acting Henry VIII. A man whose pleasures mingled with his impassioned search for a woman to bear him a male heir and the politics of Europe. Henny Polen whose career spanned five decades in the German cinema plays the luckless Anne.By the way another reviewer thought her not sexy enough to leave a king panting. In fact director Ernst Lubitsch must have seen Tudor era portraits of Anne because Polen look a lot like Boleyn.The Lubitsch touch which everyone talks about in his talkie Hollywood films is not here as such. But Lubitsch was quite detailed in his sets and costumes in what must have cost many marks in post war Germany. They look very much Tudor England and compare them with those of Warner Brothers The Prince And The Pauper where Montagu Love was Henry VIII.This is worth a look.","The story is hard to follow unless you are quite familiar with the history of Henry VIII's reign. The picture seems more interested in spectacle than story telling. Wonderful costumes.I wasn't impressed with Jannings. His Henry was mostly interested in eating, drinking, hunting and women.","A filmmaker's early work can be fascinating, if not always among his or her best efforts. Lubitsch's signature touch may not have been fully developed by 1920, but he had still made charming romantic comedies like The Oyster Princess up to that point. However, one thing fans of his 1930s and 1940s work may not expect is that Lubitsch also made big historical epics during the silent era. The most famous might be The Loves of Pharaoh, starring Emil Jannings as a lecherous pharaoh who tears apart two young lovers. The film is beautifully produced, with lavish sets and costumes, crowds rushing through the frames. Unfortunately, the pace is leaden and the story is barely engaging.Lubitsch's treatment of the rise and fall of sixteenth century queen Anne Boleyn (here named \"Anna\") follows the same basic premise: Emil Janning's lusty Henry VIII separates young lovers Henry Norris and Anne Boleyn when he tires of his aging queen, Katherine of Aragon. Unfortunately, much of the same flaws of Pharaoh can be seen here as well: what we have is a lack of engagement or an interesting heroine.Lubitsch's Anne may be the most passive portrayal of the woman put to film and her characterization is probably the biggest reason why it's such a slog to get through. Anne Boleyn was known for being charismatic despite not fitting the blonde-haired, fair-skinned beauty standards of the day with her olive complexion and dark (possibly red) hair. So of course this Anne is fair skinned, blonde, and charisma-less. Anne always looks like she is on the verge of tears or fainting. She is repulsed by Henry from the start and never possesses any ambition to become queen. We see nothing of her social skills, her religious zeal, her bravery in the face of death. About the most you get of the historical Anne is her love for her daughter Elizabeth and occasional flashes of temper which in this movie seem to come out of nowhere.All the other characters are painted with broad strokes too: the mild Jane Seymour is suddenly a calculating temptress (?!), Henry Norris is the suffering lover boy, Mark Smeaton is basically a cackling frat boy out to get Anne when she won't sleep with him, the Duke of Norfolk is completely amoral and lacking humanity. About the closest we get to a bonafide performance is Emil Janning's Henry VIII, but even he is limited to leering, glowering, and guzzling beer from tankards.The script also lumbers from historical event to historical event, with things happening laughably fast. The divorce of Katherine of Aragon took years in real life, but here it's cleared up in all of five minutes! Yes, yes, this is entertainment, not a documentary-- but considering this movie is hardly entertaining, I'm going to pick at the rushed treatment of the story much more. But as I said before, it's not a total waste: the production looks great and Lubitsch sometimes uses creative framing and mise en scene to liven things up. But when it' all at the service of a dull script, it does not help make the viewing experience any better.What really kills me is that we're dealing with a fascinating piece of history and a fascinating woman. Making Anne Boleyn a saint is about as erroneous as making her a harpy (see the terrible, TERRIBLE Other Boleyn Girl for how Anne Boleyn's character gets assassinated these days). She was capable of kindness (she gave much to charities serving the poor) and cruelty (her treatment of her stepdaughter devolved once Mary refused to accept her as queen; she was known for boasting quite a temper). Few movies about AB have portrayed her as a woman: she is the seductress, the harpy, the suffering saint-- almost never a woman.Anyway, only Lubitsch or Jannings fans will get much out of Anna Boleyn (1920). If you want early Lubitsch, I highly recommend The Oyster Princess, a movie more suited to his style and talents.","I am sure most readers here have already heard of the character of \"Anna Boleyn\" and this film here is early German filmmaker Ernst Lubitsch's take on her story. This is a silent black-and-white film and was made before Lubitsch's (and Kräly's\" breakthrough in Hollywood. Unfortunately, I was not too impressed watching this one. In the current DVD version, it runs for a couple seconds under 2 hours, which is really long and painful to watch almost, especially for a silent film. Apart from that, the film needed definitely a lot more intertitles. I personally thought from a visual perspective this was a decent film, but the lack of color of course hurts in the way we perceive the pompous sets, art direction and costumes. All in all, I personally definitely enjoy Lubitsch's comedies when it comes to his earlier works and not even the presence of Emil Jannings could make this one worth watching for me. I do not recommend it. Thumbs down"],"review-user":["movingpicturegal","heliotropetwo","Steffi_P","JohnHowardReid","MartinHafer","FerdinandVonGalitzien","manuel-pestalozzi","bkoganbing","psteier","MissSimonetta","Horst_In_Translation"],"review-date":["29 December 2006","6 July 2007","25 March 2011","12 May 2013","25 April 2010","2 December 2007","14 December 2006","3 February 2017","4 July 2003","30 April 2017","3 April 2016"],"review-rating":["8","9","8","7","7","7","6","7","5","6","4"],"review-title":[" Sad Anne\n"," Pretty Darn Stunning and Pretty Near Faithful to History, and Pretty Beautiful\n"," \"Bring fortune to our nation\"\n"," Somewhat disappointing!\n"," It looks great.....but that's really about a\n"," The Changing Relationship Between Henry VIII And Anna Boleyn\n"," Don't play Badminton too close to where the King is sitting\n"," The luckless Anne\n"," Heavy going despite the great production values\n"," \"Are you happy now Anne?\"\n"," Too long and dragging\n"]}