{"review-url":["http://www.imdb.com/title/tt0074113/reviews"],"review-text":["A lovely librarian, played by Playboy model Kristine DeBell, falls asleep and dreams herself into a strange world filled with extremely uninhibited people These people love to sing and dance and fool around Alice has a series of sensual adventures among these characters The film was originally shot as a poem to eroticism with few explicit sex scenes, which were eventually cut from its theatrical release Videocassette versions, however, have had some of the original erotic encounters joined at the end with them For an extremely low-budget picture, the producers of this film did an extremely good job The cinematography is full of life and energy, the dances and numbers quite professional, and the acting lovable Without a doubt, it is one of the best adult fairy tales around","The first time I saw \"Alice in Wonderland  an X-rated Musical Comedy\", was in the early '80 in a Movie-Theater in N.Y. City with some friends. I remember we actually enjoyed it very much, although we were left wondering why all the \"goodies\" were covered by in various forms shaped colored patches and why the movie was suddenly jumping from one scene to the next one, leaving us guessing...what we just missed. Obviously it was the soft-core edited (chopped) version, which left me with the desire to watch it again soon, but in its original integral version. Well, more then 20 years went by, during which I forgot all about this movie and, only a few days ago, by sheer chance, I stumbled upon a heavily used VHS copy (which had seen better times: a bit washed-out colors, scratchy sound and a few flaws), but guess what? It's the original uncut version and, this time, I really had a ball! Humor, Musical and Porn may sound an awkward combination but, in this case, it really works and, unlikely the big majority of boring porn-flicks nowadays invading our screens, this is a really amusing and entertaining sex fantasy, which will not disappoint you. The direction is clever, the swift editing makes the movie fly like a bird, all the familiar characters are lovable or just plain funny, all the actors seem having a good time, the songs are catchy (worth mentioning the one about \"growing up\" sung by Alice at the beginning of the movie and the hilarious \"What's a nice girl like you doing on a Knight like this\"), the dance numbers are well choreographed and staged (amazingly energetic Terry Hall proves that she can \"also\" dance and dances enthusiastically her guts away...Don't worry, she also does what she was best known for...), the acting, the singing, the set, the costumes are of quality level and then...there is Kristine \"Blue Eyes\" DeBell, in the first starring role of her career and (oh boy!) she indeed has a few H.C. sequences! Personally I think they are absolutely not distasteful, on the contrary, they are spontaneous and quite arousing. She is young and (ohhh!) so very pretty; with the help of her new friends in Wonderland, she discovers her body and her sexuality so, she sings, she dances and...what do you expect? She is also experimenting sex! The closing sequence, when she finally makes love to her boy-friend, is exceptionally well photographed and directed and is the highlight of the movie. I think her \"physique du role\" (the innocent blue eyes and captivating smile) and her acting ability, make those explicit sequences more then acceptable and actually highly enjoyable. There is plenty of sex going on in (this) Wonderland and everybody seems eager to \"get busy\" with the first available boy(s) or girl(s), which means lot of hard-core action to be seen. On the other hand, some close-up shots, clearly \"spliced in\", just to make the \"porn-hounds\" really happy, are a bit redundant for my personal taste. In general, however, the sex-action is not offensive since handled with a great deal of humor and it blends almost seamlessly with the music, the dances and the comedy. If you think you and your partner can handle graphic sex, watch it together. Take my word, you will have an hour and a half of very good time (perhaps also an after-show extra action...) This is \"Adult Entertainment\" so be careful, don't leave this video around or among other kid's videos. If your 10 years old can put his hands on it, he might amuse himself, but you will be forced to provide embarrassing explanations about the reasons why \"this\" Alice behaves quite differently from the one he red about in Lewis Carroll novel or he watched on the Disney's video. I bet, you will not forget this \"one-of-a-kind\" very soon. It's a real shame that they don't mak'em like that anymore...! I give it a 9 out of 10.","I agree with Rick who previously reviewed this.  The soft core \"R\" version is excellent.  The hard core version released later is so disjointed that it is a hardship to watch.  The extra hard core scenes detract from the great movie and are truly extraneous.While originally intended to be a true hard core porno, but the first with a true big budget and quality, Bill chickened out and opted to release an edited \"R\" rated version instead.  That version is the one that everyone loves.Years later, he succumbed to the pressure from curiosity seekers and added in much of the footage originally left on the cutting room floor, and released the X rated version.It's pretty obvious when watching the X rated version when these scenes appear.If you like adult spoofs of fairy tales, quality acting, singing, costumes and sets, then by all means get the \"R\" rated version.  You'll enjoy it.If you're an avid collector, get both versions.","Adult version of the classic Lewis Carroll tale is much better than you might expect. Here Alice is a virginal librarian who falls down the rabbit hole and learns to love sex and her own self image. Made at the time when adult films were creative endeavors with plots instead of just a series of sex scenes, this is a good looking little movie more akin to the low budget films of its day. Despite what you may think this film actually has a good script with funny jokes and good songs. Its an naughty little tale for adults. If you're wondering whether or not my recommendation is a good one or not consider that the film was pretty much only available in its non-hardcore version for the better part of the last three decades simply because the film stands up with out the sex, which is how I first saw the film years ago on cable TV. The relatively recent home video release on DVD put back the sex (in horribly grainy inserted clips) which makes it clear the removal of the shots was the best choice all around. If you're an open minded adult with a taste for something spicy I can heartily recommend this little film as a nice diversion.","This is what porn used to be, this is a true classic. I mean, it is an x-rated musical based on an actual book! There is a real plot to it and how many x-rated movies can boast that these days? This belongs in an exclusive short-list of true pornographic movie classics, including Debby Does Dallas, Deep Throat, and Behind the Green Door. I think the problem with \"pornographic movies\" these days is that it's all about the \"pornographic\" and not about the \"movie\". Alice in Wonderland has graphic depictions of sex, sure, but it is actually telling a story at the same time. Not one of the typical \"Oh, Mr. Police Man, don't write me a ticket\" plots, this takes it another step further and makes it a musical! Fabulous! If you want to see an example of \"good\" porn, this is one of the best.","When I was engaged, my fiance and I would frequent the adult bookstores. He would look for his favorite mags, and on occasion a video that caught the eye.  As much as I enjoyed the one-on-one with him that the media caused, there was never a video that I really enjoyed.  I had seen only one other movie way back when there was a satellite channel called XXX (it dealt with a private eye unraveling a case) that actually had a proper plot and was enjoyable.  All the others were grunting and puffing and blowing and whatnot.  There's only so many times you can watch a blonde bimbo faking 'it'.This movie caught my eye, and I migrated to it, allowing him to wander the shop.  He noticed (how hard was it not too? grins. I was actually interested in something, lol(!) in the video section!) and came over, buying the slightly used copy for me.  We took it home and I loved it.  Here was a \"Porno\" with a plot.  I wasn't sure it even classified as porno, but I use the word loosely.The librarian was a character I could identify with.  Alice rejected her boyfriend's advances. She was not comfortable with her own sexuality and prudish in her comments.  Bill went away, and she continued to check in books.  The White Rabbit ran through the library (one book, if you notice closely, I believe (it's been ten years since I saw the movie) was by Lewis C.) and Alice, for that same reason that propels teenagers to run into the woods when a chainsaw wielding maniac is behind them rather than towards populated areas, follows.  It's the best way to get the plot forward. Alice finds herself in Wonderland.I barely recall all the details, but I do remember clearly the swim in the lake, and how she was \"dried\" off.  I liked how they got Humpty Dumpty Up again, the Mad Hatter's size of member being on his hat to wear it proudly, and the brother sister team of Dum and Dee (which did disturb me slightly--then again, they could have been husband wife, but I never could tell no matter how many times I watched it).  The woman on the knight who told Alice go away and find your own Knight (What's a A Nice Girl Like You Doing on a Knight Like This?).The part that really caught my attention when I watched it about a year or so later was one of the cards (3 of hearts, I think) who resembled my ex's current wife exactly! We couldn't help but tease her about being in the movie! The King of Hearts was interesting, and the Queen was even more so. Due to the openness of the forum, I can't go into details, just say it was \"orgy\" based and we'll leave it at that!When we split up, I was allowed to take the video--he knew I liked it--but in the time since it's been lost in borrowing.  Someday I'll find another copy.Btw, if anyone could tell me offlist what scene was cut from the Amazon version, I'd really appreciate it.I heartily recommend this movie for the over 18 crowd.  It was soft, sweet, and really 70's, but I liked it immensely.***** out of 5. D.","Alice (Kristine DeBell) enters in a world of wonder... but not the kind of wonder that you remember as a kid. The Mad Hatter, the White Rabbit, the Queen and others (even Tweedledee and Tweedledum) show Alice some things about her body -- and other people's bodies -- that might be quite wonderful. A tale of love and lust the likes you have never seen.The story of how Kristine DeBell got involved with this is interesting. According to her, she was a model at the Ford Agency and saw that there were auditions for this film. She did not know what kind of movie it was, so she tried out and landed the part. Now, exactly what point she figured out what sort of movie it is is unclear, but we do know that she ended up going through with it.The producer was Bill Osco, probably best known at that point (and maybe even today) for \"Flesh Gordon\". The director, Bud Townsend, had made a few horror films, \"Terror House\" and \"Nightmare in Wax\", which are largely forgotten today, even by fans of cult horror.In \"Alice\", the songs are cheesy, but fit the theme of the movie. One song, \"What's a Girl Like You Doing on a Knight Like This?\" was pretty funny, and the others had similar themes going. The trial towards the end was well scripted, and fit very nicely into the world of Alice. The logic and humor were definitely accounted for. There is no denying it is an adult film, but one that has a certain level of intelligence.What more can you say about a film like this? All I know is, for people who are used to adult films where the \"plot\" iss just a 30-second lead-in to the sex, this one is going to overload you with plot and music. But, personally, I think there is something very special about this film and I hope it gets a nice DVD release with the sound and picture touched up and special features (if that is even possible). I can see this being a cult film.DeBell's story following the film is even more interesting. She began dating producer Bill Osco, who was pushing her to make another adult film, this time a riff on \"Wizard of Oz\". Author David J. Hogan says this was the original plan before \"Alice\", with the film to be called \"Dirty Dorothy\". Whether Hogan or DeBell is right is unknown, but either way the film never went forward, with DeBell insisting on not making any more of \"those\" films. (Why she agreed to do the first is still a mystery.)Through Osco, she got the lead in another cult (though not adult) film, \"The Great American Girl Robbery\" (1979). And who co-produced with Osco? None other than Chuck Russell, who went on to direct such films as \"The Blob\" and \"Nightmare on Elm Street 3\"! Through some small miracle, DeBell escaped the world of adult films and b-movie shlock, appearing in \"Meatballs\" and being a successful star ever since.While that may be a small tangent off the point of \"Alice\", it is relevant: what could have been a forgotten, bizarre attempt at an adult musical actually lead to the career of a mainstream actress and (indirectly) an incredible horror director. Who knew?","Years ago I saw the box for Alice In Wonderland in a local video shop. I remembered those blue eyes on the cover. After I saw the Big Brawl, I went back to rent the movie, but it was gone. It took me 18 years to get an X-rated cut, and it was worth the wait. The actors look very 1970s...a bit scrawny/decrepit with a lot of hair, but the story is actually entertaining. Nothing like musical numbers in the middle of a porn movie. And there was something special about Kristine DeBell. She is able to project a sort of wholesomeness in the middle of a sex scene. I thought she was great in her appearance on Night Court also. It is a shame that her career never really blossomed.","I saw this fine flick shortly leaving college.  As I sat there happily watching Alice go from repressed virgin to sexual adventurer, I got to wondering why her sexual encounters seemed familiar. Then I remembered-- Intro Psych 101 Lecture! One of the lectures dealt with the Psycho-Sexual Stages of Developement, basically the shift over time on what part of the body and its attendant stimulations gets our main attention, as well as the changing emphasis on what gives us pleasure.  Alice's first encounter is being bathed, with emphasis on the genitals and bottom.  Her next encounter is an oral one with the Mad Hatter's dingaling.  I forget the rest of the lecture and the order of Alice's encounters, but I do remember how well they matched.  It's interesting to see a skin flick with some brains behind it, rather than the cliche \"I'm here to deliver your pizza.  Let's screw.\"I don't see how Kristin DeBell's career could be wrecked by this film, as it was her first film.  And Reagan's tiresome hypocrisies had yet to mar this land when it was released, but in a way he and his stooge Meese did affect Ms DeBell.  When Meese was staging his anti-pornography commission (to distract people from his own criminal activities), Meese hired the services of an anti-porn activist named Judith Reisner.  Reisner was obsessed with images she perceived as child pornography.  She saw the \"Alice\" cover Ms DeBell did for Playboy and promptly announced she had scientifically proven that Ms DeBell was in fact a photo collage of parts from several grown women and the face of a ten year old.  Yeah, right....","I've got a copy of this on VHS, and it's definitely one of a kind!  I must admit, I've never seen a pornographic musical!  It's great!  The cast breaking into song & dance does help lighten things up and keep it funny. I like that much better than the usual \"porno speak\", where they describe what's going on even though you can see it very well!This movie is definitely worth a view.  The problem these days is, it's either: a) VERY hard to find, or b) VERY expensive when you do.","What can you possibly say? This is the uncut hardcore, musical Alice! It works too with a large energetic cast seemingly enjoying themselves to the hilt and whilst one could wish for a re-mastered version, I guess we are lucky to even have this video transfer. Pretty much a delight throughout. There are a couple of slightly off moments but this could have been embarrassing all through and it certainly is not. It also could have been and today would have been too camp. No, a very fine effort that is amusing, tuneful and just sexy enough. Fine performances particularly the Kristine DeBell in the lead and was that an unaccredited Richard Prior as the prone Knight being vigorously (if discreetly) ridden?","In fact, by today's standards, it would probably garner an R rating.  This witty, appealing fantasy musical skinflick treatment of the Lewis Carroll classic would likely make the author proud.  With songs like \"What's a Girl Like You Doing On A Knight Like This\", you will laugh a LOT as familiar characters such as the Caterpillar, the Mad Hatter and the White Rabbit put a titillating twist on the children's tale. Certainly not for the kiddies, but it doesn't have the hardcore, unemotional edge common to the genre.  It's just pure silliness and fun, fun, fun.","This is \"Adult Entertainment\" so be careful, don't leave this video around or among other kid's videos. This X-rated movie was very trippy and weird. It would make author Lewis Carroll, really mad, in a happy way. I'll give the movie, some credit. It didn't bother, trying to put logic into it, like other film versions. Still, it does make you wonder; what were the producers, smoking when they thought to put Alice in Wonderland into a musical porno. Directed by Bud Townsend, this movie is loosely based on the novel, \"Through the Looking Glass\", Lewis Carroll's second book, in the Alice in Wonderland books. This movie shouldn't confused with the Disney's 1951 & 2010's Alice in Wonderland versions as it barely haves anything to do with them. In this version, Alice (Kristine De Bell), is an adult virgin librarian, who trying to find out, if she wants to put out or not, for her annoying hound-dog, boyfriend, William (Ron Nelson). Stress over, the issue, she falls into a wet-dream-like state, where she find herself, living sexual fantasies with the White rabbit (Larry Gelman), the Mad Hatter (Alan Novak) & other odd creatures. There are three versions of this film, an R Rated soft-core sex romp, an X-rated version, and the Triple X. In my opinion, the best one is the X-Rated version. There are a few skips here and there, due to editing, but this is a very clean, good-looking transfer, especially considering it was scrapped from less than optimal source materials. The surroundings really jump out, and flesh-tones during the nude scenes are stunningly precise. The Rated R version looks like it was cheaply copy off a VCR. You can clearly see, the tracking in certain scenes, and the colors was somewhat warped and blurry. The XXX version, on the other hand, is the worst. The hardcore scenes have been inserted from rather ugly, discolor print source with the wrong ratio, with little to no music, supporting the erotica. At least, the sex scenes weren't too degrading. For a porno movie, they treat the women who work in the film with a little more respect and understood, how far, they can take it, with the actresses. The sex scenes with Alice getting lick by cat people was somewhat artsy. The scene where Alice was masturbating near the waterfall was somewhat, beautiful. The background music during this scene really set the mood, right. Then the scene where she assist in making repairs to Humpty Dumpty (Bradford Armdexter), was funny and clever, but one of the most upsetting scenes in the film, was the couple, (Tony and Sue Tsengoles) that play, the twins, Tweedledee & Tweedledum. I really didn't the whole fake Twins incest sex scene. Watching two people that look like each other, do it, was just awful. I also didn't like, how slutty and dirty, every other woman in the film, looks in the film. Where did they get these women? The Queen of Hearts (Juliet Graham) looks like she came from BDSM crack house at Times Square. The nurses look like they did a line of heroin, before showing up for the film shoot. Not attractive. Not at all. At least, Alice looks presentable. She was very attractive, and had the charm to carry the film. Her singing and acting was alright, but the cheesy dialogue, they fed her, wasn't helping her film career. I just glad, they made Alice into adult, rather than trying to make her look younger. I don't wish, for the film to go the paedophilia route. The Mad Hatter and White Rabbit were pretty amusing, in a goofy sort of way. I like, how cheap, the White Rabbit looks. His ears looks more like a Russian winter fur hat with ear flaps, than rabbit ears. I just wish, they added more characters from the book, like the Blue Caterpillar and the Cheshire Cat. While, I don't approve of pornography, based off, children novels. The movie feel like it was trying to go, all feminist, 'sexual awakening' with its tone. While the movie isn't in the same level, as Sigmund Freud or Dr. Kinsey case report. The movie felt a character study of the psychosexual development, during female adolescences. The movie does tackle the sexual consciousness, stereotype of gender role and psychosexual orientations, meanwhile, living the gonzo '70s spirit of a porn-chic film with some wit and style. There are several songs and alright dance numbers. All of them, looks like, they were having fun. The musical numbers, including the funk/gospel \"Each and Every Moment,\" the heroine's anthem \"Busy Growing Up,\" and the ridiculous \"What's a Nice Girl Like You Doing on a Knight Like This.\" My favorite has to be 'the Humpty Dumpty bring it up' song. All the music is extremely catchy, and supports by classical jazz hits, help the on-screen action perfectly. I love the New Orleans type feel music that would play during the title cards. The movie was surprising, very funny. It had tons of meta- humor, sexual innuendos, breaking the fourth wall jokes, and puns. It gets even, more, zappy, toward the end, while the movie stops being a movie, and just continues to run, with weird quick cuts. The film was produced by adult film mogul Bill Osco. Originally, Osco shot the film on the cheap with Adult Cinema intentions. But, after a warm reception at a Seattle Film Festival, he managed to sell a recut version of the film to 20th Century Fox. It was just that, the timing wasn't right for Osco. While he was able to have the prints ready, his movie was playing against 1977's Star Wars. It didn't do so well at the box office. Overall: This porno movie is pretty unique. A rare kind. A surreal must-watch, acid trip.","I remember seeing this movie for the first time with a friend while on vacation in Anaheim, California in October, 1976. While driving the tourist laden city streets , we saw a movie marquee advertising \"ALICE IN WONDERLAND XXX.\" So before even checking out Disneyland's version of the Lewis Carroll classic a half mile away, our curiosity won out and we ventured into this cinematic threshold. I remember even before the movie began how surprised I was to see this kind of film appearing in staid, ultra-conservative Orange County.Thirty two years later, I came across ALICE IN WONDERLAND at a local video store. I wondered to myself if this was the same film until I looked at the back of the jacket and saw a picture of lovely Kristine DeBell in the starring role and decided to rekindle some fond memories. Subversive Video, to their credit, has released two versions, X and XXX in the same package. As it turns out, the version my friend and I saw in Anaheim was rated X in spite of the original XXX advertising at the there. Seeing it the second time around makes me realize what a delightful romp director Bud Townsend brought to the screen. As an example of this man's scope behind the camera, in his salad days he directed two episodes of TV's DEATH VALLEY DAYS.Miss DeBell, appearing in the April, 1976 cover of Playboy is ideal as Alice. She brings a fresh all American innocence to the role as a librarian in her early twenties yearning for a better life. When her boyfriend is rebuffed from taking their relationship to the next level, Alice reaches her turning point. This is a 'musical comedy' yet the melodies are quite catchy with appropriate strings and brass to offset the generally suggestive lyrics. Miss DeBell has a pleasant singing voice as she trills about wanting to be free. That's when the magic begins. The pacing of this movie is surprisingly fluid, given the genre and the supporting cast of Wonderland are there to enable Alice as she blossoms into womanhood. Special mention goes to TV veteran Larry Gelman as the White Rabbit who seems to be the only character not obsessed with sex as he is always running late for an appointment.or something.Special features include comments from noted feminist advocate Lena Ramone who imparts how viewing this movie while attending college influenced her in choosing a career as an adult film actress after graduation.What makes ALICE IN WONDERLAND such a delightful jaunt is its garden like setting. Partly filmed in the lush, natural splendor of Vancouver B.C.'s Stanley Park, the movie belies its pornographic roots. You don't come away feeling you've watched a sleazy skin flick. At this writing, I haven't viewed the triple XXX version. The extra sex footage tacked on afterward would, in all probability, disrupt the overall flow and remove the light, breezy atmosphere evident throughout.Naturally, the Lewis Carroll version is the best way to curl up and explore Alice's adventures in Wonderland. However, for a time capsule representing 1970s' adult film archives, ALICE IN WONDERLAND is worth following that white rabbit for a ribald ride full of mirthful mayhem.","I so much enjoyed this little musical fantasy I bought a copy to share with my friends. It is a pleasant and diverting change from our mundane lives..... I believe that we can all benefit from an active fantasy life, one of joy and indulgence, I heartily recommend it!The performance is excellent, and the music uplifting!","Kristine DeBell, future co-star of mainstream classics like \"Meatballs\" and \"The Big Brawl\" started her career with this musical/porn/comedy take off on the Alice in Wonderland story. Personally I despise musicals (with the exceptions of \"South Park: Bigger Longer and Uncut\", as well as \"Labynth\" and \"Oh brother, where art thou?\"), but porn just doesn't vibe well with musical numbers. Still for what it's worth, it's better than the other porns based on fairy tails of the same era (Ie. \"Goldilocks and the Three Bares\", \"Sinderella and the Golden Bra\", \"The Erotic adventures of Pinocchio\", etc... etc) Might seem tame for those pervs raised on that crappy video-shot no story porn, but it's good for a chuckle or two.My Porn Grade: C-","Spoilers herein.Alice appears in scores of films, and many of the appearances are subliminal. I've made a hobby of collecting all the references and looking to see how cleverly they exploit the story. As it happens, there is a natural fit between Alice and sex, and the fantasy that defines life.The best example is `Sex and Lucia,' a deep exploration of sex as illogical story. This is one of the worst examples. Not as bad as Disney, with better songs and far better cards (more in keeping with what Carroll had in mind). But except for the effective innocence of this Alice, the sex scenes are sorta grafted on.Ted's Evaluation -- 2 of 3: Has some interesting elements.","This version of ALICE IN WONDERLAND is truly original. Equal parts porn, fairy-tale, and musical-comedy - this film is definitely a strange bit of adult-film history.Alice is a sexually naive librarian who ends up following the rabbit into \"Wonderland\", where she meets all kinds of \"experienced\" weirdos like the Mad-Hatter (who likes to pull his dong out whenever possible), Humpty Dumpty (who broke his wiener along with his shell), Tweedledee and Tweedledum (a brother/sisters sex-crazed duo), and the bi-sexual Queen - among others.This version of ALICE IN WONDERLAND is actually quite tame by the standards of the time - a time when a lot of porn was mean-spirited and nasty (as noted by the \"roughie\" sub-genre) - this one is actually quite funny and strangely endearing. It's the kind of thing you'd show your kids - if it weren't for the graphic sex. A little slow getting to the \"good-stuff\"...but genuinely entertaining. Oh - and some of the musical numbers are downright hilarious. If you're a drinker - have a few, if you're a smoker - roll a couple and give this one a shot. 8/10","Wonderful movie. Adult content. Lots of erotic scenes plus excellent music and dance scenes. My wife and I absolutely loved this movie and wish they'd make more like it.","I only gave this nine stars instead of ten because i really don't approve of pornography all that much. pornography has a useful purpose in society(can't say i can always think of one)but it probably does.personal viewpoints set aside, i really thought this film was pretty funny. i didn't buy this movie because it was pornography, i bought it because i am one of those 'Alice' obsessives who will watch anything about 'Alice in Wonderland'. i own just about every version there is on DVD so it was an obvious choice to complete my DVD collection with this. i must admit i was scandalized beyond my expectations, and the whole thing would have been thoroughly offensive if it hadn't been so damned funny. besides, the music is really good and i like musicals.not everyone can make a good nudie musical. anyone that has seen 'The First Nudie Musical' knows what a stink-bomb that was. considering what a low budget Bill Osco worked with, 'Alice' is pretty remarkable as a musical(it's better than some musicals made on costly budgets).the film can't totally escape the dirtiness of porn. I usually watch the XXX version for full shock effect and some of those scenes are scandalizing(scandalizing because we are talking about Lewis Carroll). i found myself feeling very uncomfortable and embarrassed during the scene where 'Alice'(Kristine DeBell) starts masturbating. it made me feel like a voyeur. and the gratuitous lesbian scenes with 'Alice' and the kitty-cats were a bit too racey.the film has a great sense of humor about everything however. there is one especially funny moment during the Queen's orgy when one of the actresses gets up and says \"who do i have to F---K to get out of this movie?\". Hilarious.i'm not sure i buy the whole sex is good for you ball your brains out philosophy here, but sex is human, and nothing human disgust me.(i don't know if i really feel that way, but i couldn't resist saying it)some people think everything should be about sex. i dunno. Jeez, just show some frick'in responsibility and decorum. this movie definitely scores points for the sex-minded, but i wouldn't push your luck, next time you might really freak someone out. i mean we are dealing with children's literature here.","I would probably not have bothered to comment on this film if I had not been disturbed by the constant references made to it here in North America as a porn film. Our obsession with what is, or should be, regarded as pornographic remains a relic of the 'guidance' provided to film makers by the Hayes committee many, many years ago and it is now really time that we relegate it to the past. So far we have not progressed far beyond establishing a somewhat arbitrary division between what we now term 'soft' and 'hard' porn, with both carrying the same pornography label. It is time for us all recognise that neither the R rated (soft porn?) release version of this film, nor the unrated version (hard porn?) available on DVD were in any way pornographic.In legal terms pornography is defined by its capacity to deprave or corrupt. Many classic books such as Lady Chatterley's lover, Fanny Hill, Women in Love, The Story of 'O' or Moll Flanders have been prosecuted for pornographic content, tried by jury and cleared on the basis of this definition, but in practice most ordinary citizens are not interested in what they regard as legal equivocation, and apply a simpler test that is rather too stringent when applied to books or films which are very close to the line, but serves to quickly clear most others from any taint of pornography. Although the Hayes code would have rated AIW as unacceptable both for nudity and for its depictions of sexual activities, in practice most people today accept that where the basic message of a book or film is clearly designed to encourage the development of long term stable family relationships in which the participants find real fulfillment, it cannot be regarded as pornographic (this does not mean that works depicting unsatisfactory or unstable relationships should be recognised as pornographic, only that these may need a more sophisticated assessment). In AIW, we have a film about a young female librarian who has had a rather sheltered upbringing, and keeps her suitor at arms length because of a feeling that this is what morality requires her to do. After he gets too frustrated by this and threatens to leave her, she falls asleep and dreams she is transported to a Wonderland (closely based on that of Lewis Carrol) where everyone she meets is totally uninhibited about their sexual needs. She is shocked, but is a kind person who takes things as she finds them, so before long she finds her own prejudices gradually melting away. She wakes up when her boyfriend returns to break off their affair, but her attitude to him has changed so completely that their relationship is fully restored, and the film ends with them living 'happily ever after' with their children in a home with a white picket fence and a family dog - an ending clearly directed to those romantics who remain very young at heart.Pornographic? - Hardly!.Suitable viewing for children? - Well probably not quite, unless they have very progressive parents.R rating? - PG would be more appropriate today.Entertaining for viewers in most age groups ? - Yes, but the film has its faults - these are discussed in many of the comments here on IMDb, however most commentators clearly appreciated and enjoyed it.I believe the only pornography associated with this film was the reported claim by an anti-pornography activist of \"scientific proof\" that a magazine picture of Kristin deBell was a photographic montage of images of the face of a ten year old with various body parts of adult models. These and other comments seriously damaged the career of a very promising young actress, but today the film appears to be on its way to becoming a cult classic, Several home video productions have been released in both VHS and DVD format; the last was a DVD containing both the R rated and unrated versions of the film, released by Subversive Cinema in 2007. Copies of this were readily available until a few months ago, now they are almost exhausted and the mail order vendors who still have copies in stock are selling them at many times their original price - a situation which usually quickly results in a new DVD release appearing. This continuing interest nearly 35 years after the original film was released points to near classic status.Commentators on this database are expected to provide fellow viewers with useful guidance on whether a film is worth watching or even collecting - my comments here were intended to stress the ongoing damage to the industry that still results from pressure on major studios to respect self-censorship recommendations originating with the Hayes Committee. On this database such general comments are very quickly marked by readers as 'not helpful' and I seldom make them; but fortunately I still have space to add that in my opinion this film is quite unusual and is well worth watching or even buying. It is flawed, but Kristine deBell gives a great performance and the film provides a fairly unique and rewarding viewing experience. Overall I would rate it at 7 stars and will be buying a copy of the next DVD edition if and when it appears. If Ms deBell is still alive today I would love to hear her comments both on the attempts to suppress this film and on the late recognition that it has gradually achieved.","Alice in Wonderland: An X-Rated Musical Comedy may indeed be one of the earliest examples of erotic fan fiction to ever surface. Receiving a considerably wide release in the late 1970's, the film became one of the defining pornographic parodies and continued to capitalize on the pornography craze in America during that time. To this day, it's something so quirky, as an idea and a feature-length film, that it practically begs you to watch it just by its title and its cluttered poster of sex-starved misfit characters.The film revolves around Alice (Kristen De Bell), who falls asleep while reading the classic novel Alice in Wonderland and wakes up in a sexual wonderland, guided by the white rabbit (Terry Spelman) and other classic characters, now bearing some sort of sexual attribute to their personalities. Alice, who prides herself on being a good-natured woman, very dainty and puritanical, has never before seen such sexual freedom and advances run rampant, and the film chronicles her sexual awakening in the land as she assists other characters, such as Humpty Dumpty and the Mad Hatter, in their own personal escapades.Kristine De Bell is a real find of an actress here, largely because B. Anthony Fredericks gives her character something to do rather than owning the title of the key masturbatory fantasy in the picture. De Bell's Alice is placed into one incredibly silly and deranged setpiece after another, yet through all this insanity, she not only keeps a straight face, but she keeps her persona straight too, naive and well-meaning. Her charisma as an actress is fairly strong and, much like Fredericks' silly screenplay, she's given a lot of creative range as an actress.Despite bearing an \"X\" rating, a rating no longer used in the United States, the film is pretty mild - it's no more graphic than Flesh Gordon (which was produced by Alice in Wonderland producer William Osco two years before) because it largely focuses on the story structure and trying to parody something in a memorable way. Pornographic films like these are interesting species largely because they are not focused on the endlessly and emptily scored/shot sex scenes, but more concerned with infusing some cheap, sexualized humor into the screenplay.Both this and Flesh Gordon are far more innocent pictures than you probably think, but both have the same problem of failing to be very erotic. Because they are bent on setting up a story and characters that mirror their original source material, they falter in the respect of trying to be erotic in addition to making an admirable attempt to cater to more people than those who would frequent a Grindhouse theater on a lonely Wednesday evening. Alice in Wonderland: An X-Rated Musical Comedy also features a handful of songs composed for the film and even those can distract from the eroticism the film wants to create but can't consistently maintain.Still, much like Flesh Gordon, there's fun to be had here. De Bell is a real find of an actress, the set decorations are largely attractive, and the songs provide for momentary diversions of plot and point-A-to-point-B structure. This is another one of those see-it-to-believe-it-pornos that would only benefit from being shown on a projector in a room equipped with about two dozen well-worn seats, a sticky floor, an incense odor, and a few shady characters down in front.Starring: Kristine De Bell, Terry Spelman, Alan Novak, Bradford Armdexter, Gila Havana, and Ron Nelson. Directed by: Bud Townsend.","Alice in Wonderland: An X Rated Musical Fantasy (1976): Dir: Bud Townsend / Cast: Kristine DeBell, Alan Novak, Terry Spelman, Juliet Graham, Bradford Armdexter: Pornographic retelling of the classic Disney film. This one regards one's transformation from virgin innocence to sexual curiosity. Alice works at a library where she turns down the sexual advances of her boyfriend. After falling asleep while reading the classic book Alice in Wonderland she is visited by the White Rabbit. She follows him through a magical portal into the sexually charged version of Wonderland. This is a warped version of the fairy tale but director Bud Townsend handles the flimsy production more professionally than the material deserves. This is largely due to Kristine DeBell, who plays Alice being far more talented than the film might first suggest. She brings in an innocence and vulnerability that is about the best aspect of the film. Alan Novak plays the Mad Hatter whose first encounter with Alice regards a blow job. Terry Spelman plays Mr. Rabbit who is constantly off to nowhere in particular. Juliet Graham plays the menacing Queen who has sexual plans for Alice. Bradford Armdexter plays Humpy Dumpty who falls off the wall and cannot get \"it\" up. This is all very crass and explicit and an excuse for pornographic encounters but thankfully DeBell found a new portal to more rewarding film projects. Score: 4 / 10","Now, I don't usually watch an adult film but when I do, it's normally bad and distasteful! However this film didn't give me my usual disgust look, it more likely gave me an interested look while looking at it. It is different and I won't say it's the best adaption I've ever seen. The costumes were so tacky and looked to be used a lot. Especially the White Rabbit or the Mad Hatter, their outfits looked absolutely stupid and disgusting! Kristine DeBell was the only one who looked sexy and gorgeous as Alice! I know she had outfits that were see through but seriously, it is meant to be all part of being in an adult film. I'm surprised that she isn't a porn star, normally ordinary actresses don't usually play in an adult films. I wonder did this effect her getting into big acting roles? It might depend on the people working for those big films! Ah well she was young and wanted to star in this I suppose!This wouldn't be my cup of tea in all fairness, I would have rather seen the costumes more modern regardless if this was in the 70's. The music was very good including the choreography. The acting was OK and the sex scene's were OK since it is an adult movie after all.I suggest for people who would be upset in watching this film should avoid it at all costs. I also suggest to not show this to your kids as it does contain too much sex scene's. In all fairness, Disneys version of Alice in Wonderland is way better than this at the end of the day....","I don't understand why so many of the comments here seem to indicate that this is acceptable entertainment. The eye-popping horror of this cinematic monstrosity cannot be overstated. Me and my girlfriend just watched it together, and I'm not sure we'll ever be able to have sex again. I'm not sure what was worse, the scrawny, unattractive cast, their supremely unphotogenic genitals, the rancid attempts at humor, the screeching noises that claimed to be songs...No, I know what was worst of all. The girls in the green leotards, with green facepaint, licking Alice to dry her off, then proposing, in broken childlike speech, that they suckle milk from her breasts. That was the worst.Also, what was with the nurses, and why do they seem to have so much trouble finding each other's vaginas? Why are all the male actors gay? Why does Humpty Dumpty waggle a dildo in the air and pretend that it's his penis? Why did my eyes have to see this? There are no words."],"review-user":["Nazi_Fighter_David","armando_mariani","LVWolfman","dbborroughs","Mistletoe_massage-1","gypsycaine","gavin6942","sifujon","davidemartin","tilleycs","christopher-underwood","Kpocc","ironhorse_iv","dbonk","Xenil-20","movieman_kev","tedg","EVOL666","Kenny-36","johnstonjames","bbhlthph","StevePulaski","anaconda-40658","Irishchatter","hatgnat"],"review-date":["28 August 2008","9 March 2005","17 January 1999","24 November 2006","12 February 2006","29 March 2004","9 August 2007","1 September 2003","28 September 2002","1 May 2003","11 January 2007","3 May 2003","13 May 2015","18 November 2008","19 July 2000","3 March 2005","12 May 2004","9 April 2006","4 April 1999","14 March 2010","13 February 2010","27 August 2015","10 March 2016","23 January 2016","1 October 2006"],"review-rating":["7","9","7","10","10","7","6","9","8","6","8","10","5","8","10","9","7","6","4","5","1"],"review-title":[" An erotic, musical version of the Lewis Carroll classic, well made and vividly creative\n"," A Porno-Musical? Yes, and a very enjoyable one!\n"," The \"R\" Rated Version is Excellent\n"," Adults only retelling of the Lewis Carroll tale is a great deal of fun\n"," Now THIS is porn!\n"," Quite an unusual film, but excellent! (spoilers)\n"," Music, Lewis Carroll, and Excessive Nudity...\n"," Fun to watch, tame by today's standards.\n"," The Psycho-Sexual Stages of Developement\n"," Definitely one of a kind!\n"," tuneful and just sexy enough\n"," Not your \"standard\" porn\n"," Alice is really deep in that rabbit hole. This will be, a visually impressive yet incoherent mess for sure.\n"," Refreshingly ribald.\n"," A fantasy romp!\n"," this isn't your father's \"Alice in Wonderland\".. oh wait, yes it is\n"," Mock Turtle\n"," Weird Mix of Porn, Comedy, Musical, and Fairy-Tale - Ya Don't See This Everyday...\n"," Wonderful combination of adult material and music\n"," Naughty But Nice Nudie Musical\n"," Hollywood in Wonderland!\n"," Innocent and fun, more-so than you'd expect, but lacks in being a worthwhile erotic film\n"," DeBell is Promising.\n"," It was OK...\n"," Once you see, you can't unsee\n"]}