{"review-url":["http://www.imdb.com/title/tt0069497/reviews"],"review-text":["This movie was originally released in 1972 as \"The Operator\".  I saw it at the Apache Drive-In in Tucson AZ in 1978 as \"Where Does It Hurt?\".  I was working in a hospital at the time and found the jokes outrageously funny and appropriate.A well tanned JoAnn Phlug, (Lt. Dish from M*A*S*H the movie) is one of the main characters and plays well off of Sellers.  Pat Morita as a young lab technician is a treat as well.The gags are non-stop and the Pepsi machine as a door into Sellers office is a stroke of genius.The title song was written by Keith Allison, who also starred as a minor character.  Sort of like the Louden Wainwright character in M*A*S*H, the TV series.This movie was risque by some standards then but would play uncut on any channel now.  There is very little swearing in it but it alludes to some sexual situations.Sadly, it has never been released on tape or DVD although it was shown by some pay services 15 years or so ago.  I happened to tape it off of the defunct Stardust Theater and watch it occasionally, it's just as funny today as it was in 1978.Too bad they don't release it on DVD as it's a classic example of '70 humor and Sellers dead-pan wisecracks are just as good now as when he was alive.","We have laughed until we cried watching this movie.  We were fortunate to have taped it off the TV for our own personal viewing, however we did this on BETA so.... when we put it on VHS the copy degraded somewhat.Pat Morita was brilliant as the lab tech.  When he sang along with the Spanish radio..... Sellers is a master of facial expression & in this movie, he was at his best.  This is a movie that needs to be released. Is there any way to light a fire under someone so they will know where it hurts (under them) and get this wonderfully funny movie released???  There is money to be made selling Sellers' funniest! Here's hoping!","I saw this movie when it was first run--in 1972, and it was just what the doctor ordered. At a stressful time in my life, Peter Sellers and crew provided for me a totally mindless romp that had me rolling in the aisle laughing. It may not be high art, but it did have something to say about the medical professions and ethics in general. Mr. Sellers, as always, played the part to perfection. I'll never forget Peter's line, \"...damn broad tastes like tuna salad.\" The supporting cast was top-notch--the overall flavor was much like \"Mash,\" and it is not necessary to point out where that story went over the following years. This movie provided my introduction to Jo Ann Pflug and to Pat Morita, both of whom remain on my personal list of favorites. Don't expect high art. I prescribe that you see it when you need to escape--if you can find a copy. Good luck.","I remember seeing the previews with my father. It looked REALLY funny, but you know how these things are, seldom do the movies live up the the trailer.As we were waiting to go into the movie when it came out, the previous audience came out doubled over with laughter. It was so funny, I couldn't believe it! Yeah, the music isn't too good, cinematography was even worse, but the GAGS. I think it is pretty much a period comedy, but the times are coming back to the same kind of things that the film made fun of. Bring it back. Jeff PS, I paid $26 on E-bay for a poor copy of it and do not feel \"taken.\"","It was a funny movie and I had a lot of fun appearing in it, my scene was with Pat Morita and Peter Sellers where I tried to serve Peter a summons, but was continually frustrated in doing so. I wouldn't mind hearing from others who saw this movie and liked it.","I'm having as much fun reading the user comments as I did watching the movie! It seems that this is the classic either \"Love it\" or \"Hate it\" movie. And I have to say that I not only am on the \"Love it\" side, I'm going on a limb to say it this my FAVORITE movie, EVER! Thank heavens I found it in the first place. Almost IMPOSSIBLE to find, I was lucky about ten years ago to record it off a late night UHF channel. Of course my liking of Sellers may make me a bit biased, but I can't see how anyone with a cornball, dry sense of humor (like me), can not be in love with this flick. The plot is great (but perhaps as a previous poster said, maybe the reason why it's not a widely known movie ... upset the medical field?) the acting is great (I can see why some may say the acting was horrible ... but that's what made this movie so great ... it's total tacky-ness) and the humor is gut busting. I'm proud to say I have watched this film no less than about 20 times and have pretty much every line memorized. This film is genius!!","I cannot understand why this 1971 Hollywood production is currently only available through an Australian video company, but such is the unfortunate obscurity of this unsung Peter Sellers classic (Leonard Maltin's Movie Guide continues to grant it the same BOMB review they gave it in the 1970's). With so many scene stealers on display, Sellers comes through with what may perhaps be his most hilarious role. It all begins with his discovery of a patient who expired at 11:15AM, but Sellers argues that the corpse is still living due to the fact that the new day doesn't start until noon! The final straw for the beleaguered hospital commissioner comes in that very room, the DO NOT DISTURB sign still on the door; once he exits the room (handkerchief holding his nose), there is a brief conversation with the doctor who hustled him in- DOCTOR: \"We can't save them all! That man was at least 85! COMMISSIONER: \"How old was he when he died, 63?\" Harold Gould plays an inept surgeon who shuts his eyes when the knife digs in, Pat Morita shines as the labman who falsifies the medical charts, Richard Lenz (whose 'pompous ass' reporter in \"The Shootist\" was booted in the rear by John Wayne) plays the patient who exposes the fraud (he only came in for a chest x-ray, until they discovered he owns a house). After discovering that they removed his healthy appendix, he informs the Commissioner, who exclaims, \"Great balls of fire!\" Lenz: \"They could be next!\" Also in the cast on screen (and supplying some excellent country-flavored music) is Keith Allison, former guitarist for Paul Revere and the Raiders, who also worked with Michael Nesmith on a few Monkees recordings (and co-wrote \"Auntie's Municipal Court\" with Nesmith on 1968's \"The Birds,the Bees,and the Monkees\"). Alas, there is some missing footage from this print, including a topless sequence with Uschi Digard near the end, also a scene with actress Kathleen Freeman (who wants to use green stamps to finance her operation), getting locked by Sellers in his office, never to be seen again (in the uncut version, he returns to his office to find that she has written in large letters on the wall 'UNFAIR PRICK' ; his response? \"you misspelled price!\").","Simply awful. I'm including a spoiler warning here only because of including a coupla jokes from the movie - there is nothing else to spoil, as it is already rotten. This dross was made during what must have been one of Sellers' \"For A Few Dollars More\" periods, when he'd participate in any crap for a few bucks. I'd seen this as a 15-year- old high school student in 1972, and loathed it then. No need to view it again; after 35 years I remember it now as one of the top five worst movies I'd seen as a kid. As I recall, Sellers had more of an ongoing cameo role than a lead here, but even his presence couldn't ameliorate the stale jokes, lame plot, and infantile repartee. One ongoing theme revolves around Sellers' use of his fingers: In one scene, he holds up his open hand to a group of medicos, and by folding down his fingers, enumerates the groups for which a hospital exists - the interns, the nurses, the administrators, etc. - until only his middle finger is left up, whereupon he says \"...and the patients!\" Har Har. In another scene, to avoid costly lab tests, he dips a finger into a urine sample and sticks it into his mouth to check for sugar, then exhorts the interns gathered around him to do the same, which they do. He then advises them that he'd placed his middle finger in the urine, but sucked on the index finger, and admonishes them to pay attention. Hee Hee. (The only reason that I remember this, and this movie, and am writing this review, is that a friend told me an even dumber version of this 'joke' today). If yu laik thiss, you gonna luv dis movey. If not, see 'Hospital', with George C. Scott (came out the same year, 1972) for some genuine, marvelous black medical humor. Better yet, read 'The House of God', by Samuel Shem, and if you can, see the movie version of it, which has never been released (please make a copy and send it to me - I'd love to finally see it).","Some people have seen The Sound of Music more than 20 times. This is mySound of Music. I used to go and see see it whenever it was in a cinema. I also saw it on TV a lot of times. Even taped it once off TV but lost the tape. I also rented it on video a few times. But I never saw a videotape of it to buy. Now it can't be found for love or money. If he were here, Albert Hopfnagel would find a way of making money from ot.Probably seen it 25 times now. But I want to own it on DVD. This is, for me, one of Sellers' best performances. Release it, please somebody. Ten-four","I remember seeing this years ago, and have not heard any reference to it until now. Although it may be lowbrow & low quality for Peter Sellers, this was a movie of moments and would be excellent and very timely material for a re-make. Especially with so many cynical & mean characters around.As I recall, Sellers is a doctor/administrator. Both he and the hospital exist to make money any possible way with no scruples. The plot follows one patient who checks in for some routine tests, lets slip that he owns a house and the bilking begins.Seller's character also reimburses a colleague with a check that is returned by the bank. Putting it under a microscope, the words \"Not Negotiable\" are barely visible. \"You accepted that check as payment! I owe you nothing,\" says Sellers.It's more of a gem than it it gets (no) credit for.","One of my all-time favourite movies. At least, that's what I thought last time I saw it 25 years ago!Unusually, the movie plot is an improvement on the book (originally called \"The Operator\" but renamed in line with the movie). The authors of the book were also the screenwriters and the took the opportunity to sharpen up the plot - changing the insurance investigator who comes to work out why this hospital has so many claims, into an innocent tradesman who is scammed into unnecessary medical attention so the hospital can take his house in payment.As a Brit I was proud of Peter Sellers starring as an American in an American movie. I can only assume his accent passed muster - it sounded perfect to me.C'mon studio - release it on DVD NOW!","Though often considered Peter Sellers' worst film, it is in fact an excellent send-up of medical corporate corruption and abuses of power. Often misunderstood, the film is actually a departure from the type of film Sellers was best known for; satirical farce. This film had excellent performances by Jo Ann Pflug and Pat Morita (of Happy Days and the Karate Kid movies), but was marked by its ribaldary, irreverence, and total madcap demolition of the medical industry of the day. It was ahead of its time (1972) in taking the outrageous path that the Monty Python crew would take into the cinema some time later. As such, it was unacceptable to the traditional Peter Sellers fan, who found the more pointed barbs in this humor to be something to which they were unaccustomed. Presently, Peter Sellers movies are in demand by fans, but this effort, Where Does It Hurt?, has by its nature become almost impossible to find.","It has been since 1972 that I saw this movie and I still remember it as one of my favorite all time movies. I would buy a copy if it were on DVD and it is too bad it isn't. You would think that anything starring Peter Sellers would be brought back. Much better than \"Being There\" and as good as the Pink Panther series. Uschi Digard had a small part for such a well endowed performer. She is bonus in this movie. I think the medical field may not appreciate this film as it really makes fun of the profession and it also makes one appreciate that Sellers was never available to treat them as his bed side manner sucked as well did his analysis of urine samples.","I saw this movie in a theater while on vacation in Pablo CO. I had just quit my biomedical engineering job at a hospital. I consider the script to be a exaggeration of the real type of stuff that goes on in hospitals. The idiots that put it down on production value don't get the point and probably have never been hospitalized. And never worked in one for sure. Billy Jack (same era) was very poorly produced but had a significant social comment and was a very good movie with a real social message.I have ever since been looking for this movie this is the first site I have found where it get mentioned.","A number of interesting off-the-wall 1970's movies just disappeared - and not because they were poorly made or acted. 'Where Does It Hurt?' is one of them. It's almost as impossible to find as 'Hammersmith Is Out' with Burton and Taylor, another early '70's flick.These are not great movies. But they have reputable actors/directors and are certainly watchable. And they're nowhere near as gross and crude or violent as many present day efforts. Big mystery.","This crude. tasteless, but occasionally funny comedy is not the best or the most professional-looking movie Peter Sellers has ever been associated with, but at least it has its heart in the right place; that is to say it has no heart at all! (it's a very black comedy). So hard to find that if you do, it's worth a look if only out of curiosity.   (**)","You know, the film industry never fails to amaze me, the fact that they are quite willing to throw a lump of money at projects like \"Where does it hurt?\" Quite possibly it is the worst movie Peter Sellers ever made, and the lowest point he ever experienced in his career. \"Where does it hurt?\" really is the pits. Badly filmed, badly scripted, incredibly unfunny (a cavity search would produce more laughs!)and a true lesson in how NOT to make a film, I have to give points however to Peter Sellers for trying to do his best. Basically the premise of the film is a hospital run by Corrupt Sellers who is assisted by a team of money-greedy staff who basically try to get insurance money out of all the patients or something. Who knows? You're so busy fast-forwading it that the only rewarding part of it is returning back to your local video store.","I was disappointed by \"Where Does It Hurt?\" For years I heard about this travesty of a movie, starring Peter Sellers in the midst of the worst dry patch of his career. I expected something memorably awful.What I saw instead was a lame but eager satire about a big city hospital, bad jokes flying fast and loose across an assortment of ill- defined characters, all culminating in a drunken orgy featuring a circumcision and a mariachi band. It's not a good movie, but it's got enough energy and curiosity value to make it mildly dynamic and entertaining to someone with low expectations.Sellers plays the memorably named Albert T. Hopfnagel, administrator of Vista Vue Hospital in California. Hopfnagel is the sort of guy so corrupt he orders a nurse to leave a dead guy in his hospital room for an extra hour so they can charge his family for another day. His mentality permeates to the staff, so that when laid-off worker Lester Hammond (Rick Lenz) walks in for a chest exam, he is pegged as a target for an unnecessary appendix removal.\"What's supposed to be wrong with me?\" Hammond asks a nurse.\"That's between you and your doctor,\" she replies.Director Rod Amateau, who co-wrote both the script and the source novel, uses a cut-screen effect to show how Hammond's bill is constantly being added to with spurious charges. The point of this satire, that doctors are greedy and unethical and administrators even worse, is established in the first five minutes and beaten to death for the rest of the movie. Shot in a rather flat and stiff manner by the aptly-named cinematographer Brick Marquard, \"Where Does It Hurt\" has a slapdash quality about it in every respect.The jokes are pretty weak in the main, with a lot of ethnic japery more lazy than mean. Pat Morita as a lab technician tells a sexy administrator played by JoAnn Pflug that she makes his eyes round, while a doctor proposes a circumcision thusly: \"Someday he might want to marry Barbra Streisand!\"I actually miss the days when bad jokes like that weren't hanging offenses. The thing about \"Where Does It Hurt?\" is that the bad jokes, like the persistent but enjoyable country-rock score by minor castmember Keith Ellison, land with a kind of zeal that makes the film easier to take. The movie has a unique 1970s gonzo quality, like Rip Taylor cutting up on the Gong Show. Sometimes the jokes are even funny, especially those at the expense of Harold Gould as an incompetent surgeon who okayed Hammond's operation and now worries about being caught.\"What should I do?\" he asks another doctor (Paul Lambert) who happens to be his brother-in-law.\"Why don't you go into air-conditioning?\"That doesn't read funny, but the dead-pan actors sell it. This goes for Sellers, too, whose offbeat characterization of the hyperefficient Hopfnagel keeps you on your toes. He's not in a quality film, but he manages to make something fun out of the experience of watching him. Maybe it's just those cool sunglasses, or the way he smugly looks at a framed portrait of Vista Vue and mutters: \"Tomorrow the world!\"I can't recommend \"Where Does It Hurt?\" but I can't really pan it, either. Maybe it's just because I saw it for free on YouTube, but whatever the reason, whether it was a fierce commitment to their craft or free cocaine on the set, its players work too hard in their misdirected way to warrant its terrible rep. It just doesn't gel into anything memorable, for better or worse.","My one line says it all. I still think of it a lot, actually I was beginning to doubt it it really existed or if I had mis-remembered the title. It was funny and I must have seen it in the Navy when I watched 2 movies or more a day on Guam in 1974-5. If you find it it is worth watching. J.","Well Peter Sellers is the greatest actor ever, but at that time his career was really at the bottom but i guess he wasnt cheap to hire. so i guess all the budget went to Sellers, and less important things was ignored like : Cinematography, Script, Editing, Soundtrack ext... Too bad that the comical Genius of Sellers is not used and this movie is completely Unfunny.","this movie was so funny. iwas on my first date an trying to be sophisticated,but i was laughing so loud and hard, i was sure he would never take me out again!!! we are married and still talk about that movie,28 years later!! that is how memorable this film is!! it has to be re-released!! either to t.v., or video!!","This is one of Peter Sellers' best movies.  Why is it never shown on TV or movie theaters?  Will it ever be released as a home movie?  Is it too derogatory for the medical field?  I would love to see this movie again.  I would like my son, who is a doctor,to see it.  Laughter is the best medicine and Peter Sellers is the best doctor for this.","Hilarious, Sellers at his funniest ... a shame you can't get this on video, or even see it on TV anymore ... I'd love to get a good copy somewhere.  Maybe it's tied up in court on some legal issue, but a truly riotous hospital farce with Sellers as crooked administrator.","One of the funniest films I ever saw in the theater back in the early '70s, and sadly, it's only been on TV a few times since.  This movie should be released on video.  It's Sellers at his sleaziest, slimiest best as a crooked hospital administrator.  Great cast, great movie.  If anyone has a good VHS copy, I'd love to buy it.","This is a great movie. Too bad it is not available on home video."],"review-user":["gwcohn-1","rlillig","dmoyes","i002492","onehoyt-2","elevatormusicman","kevinolzak","drjamespearson","brendan-66","markjansen101","Elliott-3","hippopotaman","ziggyutah","pdyoung","JOHNBATES-1","gridoon","nobita","slokes","Bad_Bent","toliboscomb","drkstr","ragsdales","A-No. 1","A-No. 1","Mac-35"],"review-date":["10 May 2004","1 April 2004","12 August 2005","15 November 2004","23 August 2002","8 November 2002","17 February 2010","31 January 2006","7 September 2004","24 October 2004","29 August 1999","17 November 2004","22 April 2007","3 December 2006","18 April 2003","6 December 2002","15 March 2001","4 October 2016","28 April 2001","19 January 2002","9 December 2000","30 September 2000","28 August 1999","21 August 1999","3 August 1998"],"review-rating":["6","10","9","1","10","10","10","5","4","10","10","10","8"],"review-title":[" Classic Sellers Humor\n"," Sellers at his funniest!\n"," A laugh when one was needed.\n"," Beyond Hilarious\n"," I was in this movie and I wish there was a video of it, too!\n"," My FAVORITE Movie ... EVER!\n"," Available, but only in Australia\n"," Sellers at his worst\n"," Adding my voice to plea for DVD of my one of favourite movies\n"," A great re-make waiting to happen\n"," Peter Sellers at his sparkling best\n"," Where Does It Hurt? - A Masterpiece Of Satire.\n"," Best movie of 1972\n"," Almost a documentary of how unethical hospitals really are.\n"," Where Do Some Movies Go?\n"," Crude comedy has some laughs.\n"," Where does it hurt? All over!\n"," Minor Sellers Misfire\n"," It is funny. A lot of slapstick, seen once, remember the bowling ball?\n"," Bad!!!\n"," i laffed so hard,it hurt!!\n"," Peter Sellers best doctor\n"," One of Funniest Ever\n"," Hilarious\n"," Great\n"]}