{"review-url":["http://www.imdb.com/title/tt0099637/reviews"],"review-text":["Forget THE BEYOND--CAT IN THE BRAIN is Lucio Fulci's masterpiece. If Dario Argento is the John Ford of Italian splatter cinema, the lyric poet and publicly acknowledged grand-master, then Fulci was surely its Howard Hawks--the caretaker and solid storyteller who knew how to sink a hole in one with the easiest flick of the wrist. Splatter-geeks somehow seem to have dismissed this picture with a contemptuous shrug--maybe it's too highbrow and \"conceptual\" for their red-meat tastes. In a stroke of daring even Fellini and Michael Powell never tried in their self-reflexive classics, Fulci plays himself--or rather, a particularly tormented and increasingly unhinged version of himself, driven mad by the combination of guilt and bloodlust triggered by making hyperviolent horror movies. \"Fulci\" wonders whether he is responsible for a string of gruesome murders breaking out around him...and the movie's combination of a fiendish, id-driven love of cinema, and a shuddering revulsion at its consequences, makes this for me the most painful and personal of all movies about moviemaking. The author's conflicting emotions are played out as nakedly as in VERTIGO or BLOW OUT--only this movie has the illicit fun of its grindhouse origins. Horror afficianados may have given this picture the high hat, but I know it has at least one fan...Jean-Luc Godard.","\"Cat In The Brain\" is a series of extremely violent sequences knitted together by a plot that feels more like an overview, describing director Lucio Fulci's most notorious years of film-making. The movie could also be seen as a dark comedy of sorts, effectively spoofing the various claims that violent cinema causes violence in real life. Fulci goes further than that, he casts himself as the star, the central figure of the film thus showing the audience who is the man behind all the cinematic gore. \"Cat in The Brain\" is not about presenting a clear story and following it. Instead it pokes fun at some of the clichés that have been surrounding the horror genre for years.Lucio Fulci plays himself as a horror director struggling to keep his humanity intact. Years of violent film making have finally began to reach him. It starts slowly, steaks and meat in general begin to disgust him, his colleagues assure Fulci that all he needs is some rest. But that doesn't help and soon the grotesque ideas for his movies begin to overwhelm his daily thoughts. In an attempt to find a cure for his dangerously maddening mental state Lucio starts going to the local psychiatrist. Unfortunately that does more wrong than good and Fulci is thrown into an even bigger mess, as the psychiatrist turns out to be a psychopath, who mimics the murders from Fulci's films in real life.The film retains all the trademarks of Italian splatter cinema, good or bad they are all here. So any comments about the acting or the technical aspects and budget constrains are quite irrelevant as to the quality of the film. It is a visual experience, no doubts about it. Fulci throws in an incredible amount of violence easily surpassing pretty much everything he's made. Amputated by chainsaw limbs, cannibalism, child murder, decapitation, these are just some of the many grotesque acts witnessed in \"Cat In The Brain\". Some of them are obviously recycled from a few the director's less profile movies but they don't stand out of the context, and actually feel quite at home here. As I noted before the movie exists much better as a satire of the genre rather than a serious piece. The way some of the violence is presented does help establish that idea. Such sequences shortly after climax are rejected by the reality in the film, as they are revealed to be actually scenes inside a movie that Fulci's character is directing. This sort of \"film in film\" presentation lessens somewhat the impact of the gore. But in no way does it make it an easy to watch film. Oh no this is far beyond and above the levels of gore found in mainstream horror, and gorehounds will in no doubt be satisfied with that fact.Lucio Fulci was a very polarized figure. People either hate his work or love it. \"Cat in the Brain\" won't convince any of Fulci's detractors in the opposite but it is nevertheless an interesting part of his filmography. One that fans should really check out.","I don't know what it is exactly, but the film is happily sitting on my shelf, with no thought of ever leaving me...Fulci has crafted one of the most ridiculous, bizzare, cheez-infested and well unique movies I've ever seen.  Not sure what else to say about it, but I LOVE THIS MOVIE!!!  The steak tartar scene is absolutely uproarious, and the whole nazi torture orgy fiasco is strangely hilarious...I'm not sure what Fulci was trying to do, but has anyone heard that, based on this film, Fulci accused Wes Craven of ripping him off with \"Scream\"?  \"Cat in the Brain\" is a must for bad movie lovers everywhere...Yes I'll definitely say it's not a \"good\" film, but I guarantee certain scenes will stick in your mind forever!  This is an exercise in craziness, people...I guess if I were a \"serious\" critic I'd give it a 3, but on sheer enjoyability (again I can't really explain my affections) I'd give it a 7....Really whacked out flick...","Things open with a shot of cats hungrily devouring a gigantic human brain. We see a director devising the screenplay for his next horror yarn. \"Chainsaw murders... evisceration... sadism...\" he mutters to himself. The description could aptly describe the next eighty-eight minutes of this movie, which contain more severings, slashings, and body parts than most gore films put together.Lucio Fulci's oddest movie is a real mixed bag. On one hand it has a really interesting premise in that Fulci is essentially playing himself, on set while directing his gory movies, so it's a movie-in-a-movie type plot like WES CRAVEN'S NEW NIGHTMARE (only this came first) that has the opportunity to explore the link between the violence in horror films and the violence in real life (and if movies have any effect), and what prolonged exposure to gory violence might do to a man! As well as this, it's a study of Fulci's supposed psychological state so gets a bit confusing as you can well imagine.On the other hand, the movie is simply an excuse to string together a series of incredibly gory set-pieces from previous Fulci films and others, and then to \"insert\" Fulci's character into these scenes as if he is witnessing the murders first hand. The effect is an interesting, if muddled one, marred by some extreme technical faults (skies and backgrounds are different colours in film segments) which are par for the course for no-budget productions like this.Fulci himself takes the leading role of the confused director, making this a must-see movie for his die-hard fans. Realising that he himself is not, and can never be, an actor, Fulci instead opts for a tongue-in-cheek performance which seems to be a case of either love it or hate it for horror fans. Personally, I think he copes admirably with the role and the comedy. Speaking of comedy, some of it is intentional but a lot of it is not, such as the cheesy dubbing and the over-the-top extravaganza of some of the set-pieces. Take for example David Thompson's turn as the crazed psychiatrist - this guy goes so over-the-top as the crazed slasher that his performance has to be seen to be disbelieved! The hilarious highlight in my mind is when Fulci repeatedly runs some poor fool who got in the path of his car - classic stuff, and for some reason extremely funny.Gore hounds certainly get their money's worth with this movie, even if the majority (but not all...) of the effects and sequences are taken from previous films (thus Brett Halsey is billed in the cast as \"the Monster\" even though he never actually acted in this film - hmm, wonder how he feels about that?). Kicking off with a corpse being chainsawed, minced and fed to pigs, the film includes a Nazi sadist orgy, lots of eyeballs, beheadings, behandings, a melting head in a microwave, maggotty corpses, bloody stabbings, a PSYCHO-derived (but even more shocking) shower murder, chainsaw and trunk decapitations, a piano-wire throat garrotting, and oodles more. Of course, it's all pretty cheap and fake-looking but there's so much of it, it all becomes a bit overwhelming - especially to the BBFC who banned it outright when the film was subjected for video release in the UK.Definitely a must-see for lovers of the bizarre or those looking for something a bit different from Fulci, although it's a lot different to the zombie films he is most widely known for. Although there is lots to hate about it, I think there is even more to like and find interesting, which is why I recommend this as a \"at least see it once\" kind of movie.","As most Fulci fans would agree, his best movies came out in the late seventies and early eighties. In 1988 he had to pull out of directing the terrible Zombie 3 after only a few weeks, due to ill health. What that ill health was is anyones guess. But judging by Nightmare concert of 1990 vintage, he is obviously still suffering. I am of the opinion that producers were pressuring him to put his name to something, and in the end, this is what came out.It is a real mish mash of a slasher story spliced with scenes from other movies. Of course, fulci plays the lead. Or rather, is on screen with things happening around him. He is supposed to play himself, though i doubt anyone could be that wooden in real life. It is often difficult to tell WHAT is happening as the film jerks from scene to scene with nothing to link them together. Fulci spends most of his time looking puzzled and shocked, just as i am sure you, the viewer, will be.It has plenty of gore in it as you would expect and will be most peoples reason for acquiring this movie. Fair enough. Just don't expect the cinematic punch of Zombie or the Beyond. At the end of the day its a horror movie, albeit a confusing one. I think it did its job, as i was left feeling somewhat disturbed and unwashed afterwards. Get it if you're a real gore hound or a fulci fan, other than that theres not really much to recommend it. Very strange psycological gore fest. Hmmmmmmmmmm....... Poor Fulci.","Lucio Fulci has the lead in this film where he plays a director of horror flicks who suffers from depression and neurosis as an effect of his own movies. Reality and fiction blur, everywhere he goes is blood and murder, Fulci becomes insane. Meanwhile his psychiatrist turns to a sadistic slasher...Watch this film for the gore, because the satire is rather unsatisfactory! There are many violent scenes like brutal stabbings, chainsaw-murders and as an entrance-sequence a cat is eating a brain... combined with much nudity and even some trashy moments like the Nazi orgy. Fulci does a solid job with playing himself and the gore-F/X are pretty stunning, especially at the end of \"Nightmare Concert\" T there´s much red juice is running!\nThe main weakness of this film is his forced wittyness, however mostly the jokes don´t function! Maybe some insider-jokes were featured which I didn´t understand, but the self-irony about a director who becomes a mentally victim of his own works stays empty at all!!6/10","Fulci is one of my all time favorite Italian splatter directors. He is also a very good story teller mixing horror, the supernatural, and psychedelic themes altogether very well. This film was truly his last great story before he directed such disappointments as \"Voices From Beyond\". The story is simple as Fulci plays himself, a horror director. After years of filming splatter and gore films it seems that Fulci starts to suffer a breakdown in which he starts hallucinating about people being slaughtered. He decides to see a psychiatrist who only makes matters worse when he convinces Fulci that he is killing people.Fulci used gore scenes from several pictures around the same time. These films I don't believe he directed but certainly produced. Some of those films are \"Massacre\" directed by Andrea Bianchi (Burial Ground), \"Touch of Death\" directed by Fulci, \"The Murders Secret\" and I can't remember the rest of the films.Nightmare Concert is a very underrated film, even by Fulci fans. But I loved this movie and have watched it many times already. It is sad that Fulci didn't get a chance to direct anything worth while after this but nonetheless this is a great film and I do recommend it to any Fulci fan, whether you like it or not. 9/10 stars","This is not a movie in its own right. This is some kind of a bizarre portmanteau compilation of his later and poorer works, with Fulci himself joining the dots.It's very poor and borders on annoying. It's not often I'd say just avoid, in favour of give it a try for yourself but here I really don't think there's anything worth spending the time over.If you do feel compelled to give it a try, check out Touch of Death first and if you think that's awesome then you might find this one reasonable.","In many interviews, Fulci showed himself very enthusiastic about \"Nightmare Concert\". I really don't know why. Certainly, the idea of a horror movie director haunted by the nightmares he has created was still interesting and novel at that time, but I really cannot figure out what kind of movie Fulci wanted to make: A comedy or a serious horror movie/thriller? Are the self-irony and self-criticism real or pretended?Anyway, the movie is a rather uninteresting affair. Half of it features Fulci wandering from gore scene to gore scene. Fulci had to play the leading part because the actor intended for that role didn't show up on the set. Fulci tries his best to make a disgusted face, but overall he seems to be rather unaffected by what is going on. On the contrary, David L. Thompson as the psychiatrist is shamelessly overacting. The other half consists of recycled footage from other movies like \"The ghosts of sodom\" or \"When Alice broke the mirror\" (notably the chainsaw dismembering and feeding to the pigs scene) and from movies Fulci hasn't even directed, like \"The massacre\". This means in particular that most special effects are cheap, crude, and unconvincing. Moreover, Fulci has problems in patching everything together: The Mercedes model he drives in \"Nightmare concert\" is different from the one Halsey drove in \"When Alice ...\", so that the scenes do not fit exactly.When he says \"what am I doing\" while watching a Nazi orgy he has filmed, this refers probably to the extremely low budget efforts which Fulci has delivered in his last period of activity.Well, the movie has only few interesting scenes. The opening when Fulci recites a \"poem\" about women hacked to pieces and so on followed by the shots of the \"cat in the brain\" is indeed the testimony of a man gone mad through his own creations. The \"steak tartare\" scene is quite funny. The ending is ironic: Fulci goes on to make horror movies despite his terrible nightmares. Beware, this ending has been altered by the producers, so that the wrong ending might appear in some versions.After all, I still had enough fun watching the movie, largely because Fulci played the lead, so that I voted it 6/10 for this, the idea, and some of the more interesting scenes.","Well, this is new...Famous Italian horror director Lucio Fulci shoots a film about a famous Italian horror director called...Lucio Fulci. After years and years of witnessing gruesome horror sequences, it becomes hard for Lucio to separate reality from fiction and he often hallucinates about committing violent murders. He quickly descends further into a seemly endless spiral of madness and unverifiable venom. Even the dedicated psychiatrist can't seem to keep Fulci on the right track... Now, when it comes to pure fun and entertainment value, Cat in the Brain certainly is one of Fulci's most pleasant films. The gore is overpowering and copious, to say the least. The amount of filthy massacres is impossible to describe, especially when you manage to get your hands on the fully uncut version (referred to with the aka:\"Nightmare Concert\"). Decapitations all around, victims ' intestines are spread on all sides of the screen and the chainsaws are working overtime! The film also becomes unintentionally funny quite soon (since it's so exaggerated) and a perfect experience to watch with a group of friends when there's beer in the fridge. Of course, from a more professional viewpoint, this production can't exactly be called a masterpiece! There's not the least bit of tension or atmosphere to detect and the characters are completely empty-headed. In order to make more room for the gore, characters are just being introduced for 5 seconds and subsequently die a horrible death. Especially compared with Fulci's highlights - like \"The Beyond\" or \"Don't Torture a Duckling\" - this film looks like a quickly warmed up snack. The best way to interpret \"Cat in the Brain\" is like a personal statement made by Fulci and a direct attack towards censorship. Perhaps after seeing so many of his films  especially the latter ones  being cut by censorship committees and bashed by pseudo-artistic critics, he wanted to avenge himself by delivering a gory mess that simply can't be cut! If you take out all the explicit violence and the truly sick make-up effects, you only got about 10 minutes of footage left! Especially because the insane killings re-occur later in the film as Fulci hallucinates about them again. You can almost hear our director think stuff like: \"Let's see how you're going to censor this now!\" Even the entire development of the murder investigation happens in the background. Are the victims missed by any of their friends or relatives? Are there any police officers looking for clues that'll lead them to the killer? You don't know and Lucio doesn't bother to inform you about that, because that would lead to sequences that don't require cutting. Oh, and it's pretty damn pretentious as well! The name \"Mr. Fulci\" or even \"Lucio\" is mentioned every 3 minutes (34 times throughout the entire movie, to be exact) and our director clearly enjoys being in the spotlights for a change. Hey, I certainly don't blame him...After over 30 years of delivering amusing movies; he deserved to have a little extra fun. You're a God, Mr. Fulci!","Lucio Fulci's Cat in the Brain is an inventive and somewhat egotistical tale of a director's decent into madness. The director in question is Fulci himself, who stars in the film. Fulci has become known to horror fans everywhere as 'the godfather of gore', and for good reason, as he has provided us with some of the nastiest and most gruesome films ever to grace the silver screen; from the eyeball violence in films like 'Zombi 2', to a man been hacked to death with chains in 'The Beyond', all the way to the full on gore fest known as 'The New York Ripper'; if you want gore (and let's face it, who doesn't), Fulci is your man. However, all this catering for gorehounds like you and I has taken its toll on Fulci's mental state, and he's quickly delving into madness, brought about by what he films. Fulci's problems don't end at his mental state either, as his psychiatrist that he has gone to see about his problem has took it upon himself to take up murder as a hobby, using Fulci's films as blueprints for the murders!I've got to say, the acting in this film is absolutely atrocious. There is one scene in particular that involves a hooker, and it's only fit to be laughed at, for both it's acting and it's stupidity. Fulci takes the lead role of the film (obviously). He's not an actor, and it shows, but his performance is actually the best in the film. It's even safe to say that one the whole, the acting is bad for an Italian horror film. Of course, nobody goes into an Italian horror expecting good acting, so it's somewhat forgivable, but I do think that Fulci could have hired some better ones. Bad dubbing doesn't exactly help either. However, something that does help is the fact that the terrible acting is counterbalanced by lots of gore, and it's extreme to say the least! People get their heads cut off, a woman is slain in the shower (and unlike Psycho, here we REALLY see it), people are hacked up, fed to pigs and there's lots and lots of cinema's finest melee weapon - the chainsaw on display, which delighted me no end. The amount of gore is massively over the top a lot of the time, which gives the film something of a 'spoof' feel, but Cat in the Brain is obviously a tongue in cheek film anyway.It would be hard to make a film about yourself and not come across as being a bit of a big head, and Fulci does indeed come across as a bit of a big head in this movie. His name is mentioned often, and he's on screen nearly all the time; it's not too much unlike 'New Nightmare' in the ego stakes, but it's obvious he had a good time making this, and I for one had fun watching it, so we can forgive him a little egotism. The film's ending lets it down - I saw it coming a mile off, but then didn't seriously think that the movie would take that route, but I was wrong; it did, unfortunately. The ending left me cold, and the film is a better watch if you turn it off just before the final two minutes. However, despite it's ending and terrible acting, Cat in the Brain is a lot of fun and will please Fulci enthusiasts no end, and it is therefore recommended.","What i have to say about Lucio Fulci ? He is a master, without a big budget, he was able to make awesome horror movies, with good gore effects.In A cat in the brain, Fulci plays himself, Fulci is \"tormented\" by visions of his own horror creations. He tries to get help from a psychiatrist, but the psychiatrist is making the things worse....he \"hypnotizes\" Fulci, in order to make him do brutal murders in real life !There is a lot of stock footage, especially for the gore scenes, but it's well edited into the movie.I have to say that Fulci made a good work, with a low budget, even if it uses stock footage it's still a good film.Fulci Lives !","Lucio Fulci was one of the most prolific Italian directors by the time of his death in 1996, yet his career had long since descended into a downward spiral of increasingly futile genre entries that could barely stand in the shadow of his earlier work. For much of the '70s into the mid-'80s, he cranked out such stylistically distinctive horrors as \"City of the Living Dead,\" \"The Beyond,\" and the brutal giallo \"The New York Ripper,\" fondly remembered by fans like myself. And while \"Cat in the Brain\" falls in with the era of Fulci's decline as a filmmaker, it is a shocking, darkly hilarious headtrip that, while a clearly inferior work (the framing, effects, and acting are below par), proves an interesting, open-ended meditation on pop psychology and film's ability to desensitize. Make no mistake: \"Cat in the Brain\" is a total gorefest, and as disjointed as Fulci's previous films, but it deserves credit for trying to be something more. In a deliciously tongue-in-cheek touch, Fulci plays himself: a director in the midst of filming yet another violent horror flick who comes down with perverse/murderous hallucinations; after visiting a shrink who puts him under hypnosis, his dreams and reality begin to intersect, to the point where the viewer cannot discern the two. The recent DVD from Grindhouse Releasing mentions \"Cat\" as an heir apparent to the likes of \"Eraserhead,\" and it does carry a similarly disquieting, awkwardly funny quality associated with the best surrealist art.","Italian film director Lucio Fulci portrays an Italian film director named Lucio Fulci in this film made up primarily of films made or produced by Lucio Fulci with a wraparound story about Lucio Fulci being affected by the disturbing films he has made and also the one he is currently making.If that summary confuses you, congratulations, because you are sufficiently prepared to enter Nightmare Concert. I really did feel like I was participating in someone else's bad dream. I was never quite sure what was actually happening to the Fulci character, what was an hallucination of his, or what was part of the film-within-a-film that the director is working on. Throw in a crazy subplot about a real killer in Rome trying to frame Fulci and you should end up like me - confused and disoriented, yet entertained.Sure, this isn't up there with Fulci's best, but I get the impression he was trying to have a little fun with his image and career and although it's a bit of cheap ploy to insert gore scenes from other movies, at least they're quality gore scenes and fun to watch. Nightmare Concert is quite a good time if you go into it without trying to compare it to your favorite Fulci film(s).ff","Thankfully, there are now quite a few uncut releases of 'A Cat In The Brain' on DVD. Not surprisingly this film suffered a great deal from the censors back in the days; just watch it for yourself and you'll get the picture. So I re-watched an uncut version recently, and boy, this still is such a 'fun' film. Whatever Mr. Fulci's intentions were at the time - must have been more than one, that's for sure - I'm still strongly convinced (more than ever, actually) that 'A Cat In The Brain' was partly intended to be a comedy. The movie is virtually plot less, or instead of a plot, it basically has only plot holes (think the size of Nebraska) tied together with hints at a plot. There's a hint at a murder mystery here, about a deranged murderer killing random people, though it's merely reduced to a background story. And as you all have probably read by now, it stars Fulci playing himself. It's also one of Fulci's most incoherent films. It also is quite ridiculous. And it all feels like it was meant to be this way. Literally stuffed with gore footage (both new and some lifted from his previous films), it's undoubtedly Fulci's most insane movie. Good stuff!","It is Dr. Lucio Fulci's party and we are all invited! In approximately 90 minutes, we are bombed with extremely gory and violent situations involving mutilations, brutal beatings, beheadings, slashed throats, exposed guts, vulgar language, etc. There is even a very weird moment from a musical film where a woman is bitch slapped without mercy while she sings!Fulci's psychiatrist's smile is one of the most frightening things I've seen in a while!This is a bizarre movie. It is brutal, filled with blood, and misogynistic. It is a tribute from Fulci to himself. Hey, even at the ending he drives a boat while accompanied by a very sexy Italian chick in a bikini.Sadly, it is a very flawed film. The plot is absurd but in my opinion it inspired Wes Craven's \"New Nightmare\" (however, Ze do Caixao A.K.A. Coffin Joe used it on \"O Exorcism Negro\" from 1974). The editing is horrible. The music is lousy. The acting sucks! Fulci may be the best actor in the whole film.But it is very entertaining for gorehounds. It's extremely violent content should please those who hail Fulci like me.","cat in the brain, suffers from what many of fulci's films do, you don't always know whats going on, the editing can be frantic, but like most of fulci's horror work, the good out weighs the bad. the movie is great for fulci fan's as the director plays a exaggerated version of him self, who sees only violence and murder in front of him, and starts to lose his grip on whats real and whats fantasy, the movie has some of the most outlandish scenes I've ever seen in a horror movie, but they work to the movies advantage and create a atmosphere of unease that remains all the way to the end, and the gore is just epic, there is so much blood and guts here, from chainsaw murders to decapitations, and yes we all know they are mostly from older movies that fulci worked on, it doesn't matter and it all adds to this piece of extreme yet, hauntingly brilliant cinema. it's not one of fulci's more widely loved films, but i think its one of his best, and is a classic horror movie. i highly recommend this movie, but definitely not for the squeamish","If you are a Lucio Fulci fan you will love this movie, like i did because I'm a die hard Fulci fan. This movie predates Wes Creven Final nightmare, the plot of the director making the movie and movie inside the movie is very similar, and this one was made first. Fulci plays himself, shooting a new horror movie (its Quando Alice Ruppe lo specchio according to the footage we see) and going mad, losing his head with all the violence and blood. The biggest part of the movie consist in previous movies footage (bassically blood and gore) but the movie is great even if you realize that all the gore is taken from previous Fulci directed or produced movies.","In the late eighties and early nineties the decline and death of independent video companies like Vestron and Media effectively shut off Italian horror films for much of it's American audience. Coincidently(?) Italian genre films also declined in quality and profitability.Occasionally movies like Primal Rage, \"sequels\" like Beyond The Door III, Troll 2, and a few Dario Argento films limped out onto video but most remained unreleased (until DVD) in the US for nearly a decade or longer. Movies from these lost years became very sought after and talked about among horror fans.Of these films, Cat In The Brain is probably one of the most hyped of all due to the legions of Lucio Fulci fans and the fact that it was not only directed by but also starred their idol, Fulci himself.Though not quite Fulci's best, it's still better than most of his later efforts. His rabid fan-base will probably love it. Italian horror and giallo aficionados might also enjoy it, depending on their tastes but I'm not sure about anyone else. People who only watch Hollywood stuff might not want to take the word of the many glowing reviews here.One thing I personally found fascinating were the scenes featuring probably Benito Mussolini's only lasting contribution to Italy, Cinecitta Studios. The name is instantly recognizable to any fan of Italian movies. Until I saw it here, I could only imagine what it looked like.","This movie was made around the time that Lucio Fulci was starting to lose his touch. Before, his movies were not only gore-filled, but they had a story, great writing, and great camera shots that were very beautiful for something any other Italian director (besides Dario Argento) could not produce. Near his death, his movies seems very poor, and somewhat distasteful. The only two movies I could watch of his were Aenigma (1987), and The House of Clocks (1989). Though, Un gatto nel cervello (The Cat in The Brain) is a very entertaining movie that Fulci produced near his death. One of the main reasons, is that Fulci actually stars in it... AS HIMSELF! The plot line is basically Fulci has been driven insane by his movies or whatever, and he starts imagining scenes from his movies being played out in real life. What this means, is that there is a lot of stock footage with in the movie, mainly from Touch of Death and Sodama's Ghost, two recent movies Fulci had produced before. I liked how the scenes were integrated into the movie, though you could tell that the footage was stock somewhat if you've actually seen the movies. Anyway's the movie is entertaining, though the gore kind of does lose the touch of any other Fulci gore epic before. Though the thing that surprises me, is that Fabio Frizzi (composer of some Fulci films such as Zombie, The Gates of Hell, and The Beyond) is actually the composer of this movie's music. You can actually tell by the bass line, sort of. I wish I could find a soundtrack for this movie, if there is one.","Fulci... Does this man brings one of the goriest and weirdest movies ever made? Answer: yes! Cat in the Brain, also known as Nightmare Concert is Fulci's last masterpiece. Yes it is, no matter what some people will say about it. There are few facts why this movie is one of the best Fulci's movies.Fulci make a fun of himself and his movies with this one. Lead roll in this movie is no other then Fulci himself, who plays... well horror-splatter-gore director, who thinks he is slowly going insane. It's filled with black humor which unlike in the most of the modern horror movies works here. Being Fulci flick, you need to know it's gory. How much? Well pretty much. I always loved gore in the movies and I never get enough of it, but Cat in the Brain actually stopped my thirst for gore, and believe me, it's a hard to archive. Even the Braindead didn't stop it. CITB is all about gore. Almost every scene revolves about Fulci, who after being hypnotized by *khmmm* evil psychiatrists is seeing all kinds of horrors for everything that happens to him or everything he sees. Some of the scenes involves him accidentally dropping the whiskey, and instead of that he sees rotten corpse lying on the floor, which starts to spit some ooze from it's wounds. Forget the Beyond or Zombie 2, this IS the goriest Fulci movie! Now I like how Fulci manage to apply all those comic parts in the gorefest movie. He is such a brilliant director. Some funny moments and lines happens from time to time, like one where Fulci says \"making gore movies is kind of a sickness\" Ending is very good considering that Fulci (and most of the Italian horror masters) is know for making ending with no sense or many plot holes. If you are fun of the Fulci, make sure you check it out. If you have a weak stomach, avoid this and repeat \"Its only a movie\" ps. some of the gore scenes within this movie: Chainsaw dismemberment (full), tongue torn out, eyeballs torn out, maggot infested corpses, zombies, decapitations, face being putted in boiling water, stabs in the shower (to head), throat slit, many parts of the body and organs being toast aside, hammer smashed face...","Contrary to some of the more credulous comments posted here, no way is Cat in the Brain \"the goriest film ever made\".  Even mainstream movies such as Romero's Zombies and Day of the Dead are much gorier, as is Fulci's own Zombie Flesh Eaters.  (If you want serious gore, check out Peter Jackson's marvellous Brain Dead, aka Dead Alive, the Flymo massacre at the climax of which is probably the single goriest scene ever committed to celluloid.) There are numerous gory moments, sure, but most of the time the SFX are really shoddy and unconvincing; many - most? - of the murderous vignettes are lifted from Fulci's Italian TV movies, and boy, does it show.The movie itself is very cheap and unbelievably inept.  One gets the impression Fulci cobbled it together in about half an hour.  The narrative is hopelessly disjointed, and the acting would disgrace a school play. There's also a nasty vein of misogyny running through it:  nearly all the murder victims are women, often nude or semi-nude, and their deaths are dwelt on lovingly and at length.  This is a lamentable trend in modern horror movies, and Fulci, bless his little cotton socks, has consistently shown himself to be one of the worst offenders.  The guy clearly got off on showing women being tortured and killed - New York Ripper, anybody? - and by watching his films, we the audience are participating, albeit vicariously, in the vile behaviour depicted.  Where does that leave us, I wonder? (Incidentally, Brian De Palma's thriller Body Double offers an interesting commentary about this uneasy relationship between actress, director and audience in a \"stalk and slash\" movie.)Nevertheless, this is an interesting film, if only for the ironic self-reflection in which Fulci indulges.  Okay, so it's not a totally original conceit, but the notion of a horror film director feeling constrained by audience expectation such that he can no longer make movies in any other genre is one worth exploring.  (Compare the career of Alfred Hitchcock, who complained that if he made a version of Mary Poppins, the audience would be asking \"where's the body?\")  Also, Fulci does appear to be saying that he himself is sickened by the atrocities he depicts, to the extent that they're sending him loopy.  Whether or not Fulci really felt the way his character - a film director by the name of, you've guessed it, Lucio Fulci - feels is debatable; after all, horror made him famous, and, presumably, rich.  And coming from the director of New York Ripper, any protest he might be making does seem rather disingenuous.I also like the notion of a film within a film within a film; playing around with the audience's viewpoint, and emphasising the voyeuristic nature of the whole filmmaking process.Whatever else, Cat in the Brain is worth seeing just for the scene in which Fulci molests a woman during one of his funny turns.  When he apologises later, the woman gushes \"Ooh, Mr. Fulci, that's the biggest thrill I've ever had in my life!\" (or words to that effect).  Fulci's reaction?  Well, you'll have to see it for yourself, but it had me in stitches.","I don't think that this is a serious horror film.Instead it is a parody of every other film Fulci has made.The main character is no dramatic at all,he is amusing!!The gore elements are completely out of sense,making them hillarious.To fully understand that this is a comedy just watch the ending.Don't compare this to the \"serious\" Fulci films.On a serious note Fulci looks like a really nice guy,and it is sad that he died after a few months.We'll always remember him!!","Lucio Fulci plays himself, a famous director of horror flicks who is haunted by nightmarish visions, partly because the brutal violence of his films is starting to get to him, and partly because his mad psychiatrist hypnotizes him into believing that he committed a series of bloody murders (for which the doctor is actually responsible). It's an interesting, thought-provoking idea, and Fulci proves to be a rather capable actor. But I have to warn everybody that the gore, although plentiful, has no impact most of the time (and this can be perceived as either good or bad, depending on you). Much of the gore exists in the movie-within-a-movie, so it's obviously meant to be fake, and much of it  is in visions and hallucinations, and we know that it's not the real thing, as well. Anyway, there are some truly impressive effects (especially a throat-slashing near the end), but in several key scenes (like in some decapitations) the editing is botched. Still, horror fans will get their money's worth.      (**)"],"review-user":["matt-201","K_Todorov","rutt13-1","Leofwine_draca","jond-2","DJ Inferno","CMRKeyboadist","mungflesh","AS-69","Coventry","The_Void","Viva_Chiba","Jonny_Numb","FilmFatale","Vomitron_G","insomniac_rod","daworldismine","ultra_tippergore","Bill357","Lotica","alucardvenom","KenLiversausage","j.g","gridoon"],"review-date":["23 March 1999","13 June 2007","9 May 2001","4 September 2016","4 February 2003","7 January 2002","1 February 2006","12 June 2018","9 August 2001","13 November 2006","22 October 2004","1 November 2010","4 April 2009","23 January 2015","29 January 2013","5 January 2013","27 October 2012","22 September 2009","10 July 2009","2 June 2009","17 May 2008","7 October 2003","2 January 2001","30 January 2002"],"review-rating":["9","7","5","9","2","6","7","7","9","7","7","8","7","8","8","6","6","6"],"review-title":[" The 8 1/2 of Italian splatter\n"," Even in his declining health Lucio Fulci still proves that he can make a great splatter.\n"," This film's power is unmistakable\n"," Bizarre self-referencing gore fest from cult director Lucio Fulci\n"," Lucio Fulci is not very well....\n"," The gore works, the satire doesn´t!\n"," Fulci's Last Great Film\n"," Fulci compilation\n"," Recycling `a la Fulci\n"," Fulci films his gory memoirs and punches censorship STRAIGHT IN THE FACE!!\n"," Fulci's swan song is a good time for all!\n"," Halloween Marathon, part 3: Dr Fulci's A cat in the brain\n"," The Director and the Devils\n"," Sharing the Night(mare) Together\n"," A whole lot of gore and a couple of laughs\n"," Denigrating, atrocious, extremely violent... Exquisite. Fulci's tribute to Fulci!\n"," a classic atmospheric, and ultra gory lucio fulci movie\n"," Great movie for Fulci Fans\n"," Fun For Fulci Fans, Not Sure About Others\n"," A movie that pokes fun at itself... nice, I must say.\n"," C-A-T In the B-R-A-I-N\n"," Not so gory, very silly, quite interesting\n"," This is fun!!\n"," Interesting implications, over-hyped gore. (MINOR SPOILERS)\n"]}