{"review-url":["http://www.imdb.com/title/tt0067633/reviews"],"review-text":["As someone who was dealing with the draft board the year this was made, I was absolutely astounded by the truth of it's vision. The haircuts, clothes, figures of speech, that was what it looked and felt like at the time. Contrary to popular memory, everyone wasn't a hippy with a few \"bad\" people who were for the war. It WAS scary! I may be wrong, but I do believe that most of the dialogue of the trial section, anyway, was written from various quotes such as from the trial of the Chicago 7. If you want to see something amazing, imagine that on national TV!!! It was on national TV!!!!Great movie!!!","My curiosity and patience to finally see this controversial film, which now has been released on DVD for the first time in the UK, has been more than rewarded. Peter Watkins has excelled himself in his audacity and technical skills. This pseudo-documentary is certainly ahead of its time and still frighteningly relevant and up to date.The film is inspired by the upheaval of the late sixties in the US, when the government has increased its legitimized use of violence and oppression, while the anti-war movement reacts increasingly violent and radical. In order to deal with both this, the overpopulation of prisons and to provide special training to riot police units, the government has introduced the so-called punishment parks. Convicted 'criminals', mostly activists, are given the 'choice' to either be locked up in prison for years and years, or spend three days in one of these parks, where they either gain their freedom their death or an even longer prison sentence. The situation in the parks is beyond their worst expectations, however. It reminded me of a sort of realistic version of Battle Royale (2000).The film's structure is extremely effective and recalls parallels with Cannibal Holocaust, which is made almost 10 years later. Both movies are constructed and filmed in such a way that the viewer is challenged in thinking and feeling he is actually watching a real documentary and therefore shocked, even though aware of the fact that: this is a film. Both confront us with the inherently violent nature of mankind, but where Cannibal Holocaust is devoid of any deeper meaning (above all, it is an exploitation movie in every sense of the word) and does not raise any critical questions about the state of the world, Punishment Park does just that.I have been profoundly impressed with Punishment Park and find it hard to believe how such a powerful and important film could have been rejected and marginalized for so long. Maybe that says enough about the truth of its content, about the way power structures in this world function. I do not agree with the critique that Watkins polarizes and stereotypes, because the movie depicts activists and the keepers of the legitimized power structures who are in reality as polarized as they are here. If they weren't, there would not be any conflict and therefore no change in our societies. In reality, confrontations between these two groups often take stereotypical forms, whether you place them between activists and establishment in Latin America, Russia or New York City. If these groups would not be polarized to these extremes, the activists would be part of the silent majorities that tacitly complain but at the same time reside in the injustices of the world.As Peter Watkins tells us in the introduction on the DVD, the actors in Punishment Park are for the most part amateurs. Most kids were real activists from LA, most policemen had been part of the national forces and even some of the members of the tribunals are part of the social and political establishment of the time. Not introducing both groups previous to the shooting of the scenes taking place in the improvised court room, adds to spontaneous and improvised feel. Parallels are drawn with issues of the time, such as the repression of Black Panther members (one of the black prisoners is said to resemble the convicted charismatic BPleader Bobby Seale) and the trial of the Chicago seven.I admire Watkins' obvious and sincere engagement with injustice and his concern with human rights and the increasingly repressive measures taken by governments (nowadays in the name of the War in Terror) to silence those that do not agree and refuse to be brainwashed. Punishment Park remains to be an extremely important movie that should be shown in schools and seen by everybody who shares these concerns. Maybe its marginalization can finally be made up for.","You can't watch a film like Peter Watkins' \"Privilege,\" a story of the exploitation of a pop music performer by big business, the state, and even organized religion, without thinking of creatively degenerate commodities like Michael Jackson or Britney Spears, who hawk corporate giants like Pepsi or some other poison for money. Or any number of entertainers, in music or movies, who become tools of political parties or commercial religious interests like Scientology and Kabbalah. A film like Privilege must have seemed almost like science fiction when released in 1967, so fantastic was its premise. Today we tend to take celebrity endorsements for granted, giving little thought to its more alarming implications. Watkins' vision has not only become reality, we tacitly accept this reality as \"normal.\"Now consider Punishment Park. As Privilege challenges the viewer to examine what is being sold to us, and why, Punishment Park demands that we reckon with what is being taken from us, and why. Heaven help America, and for that matter the world, if contemporary politicians get their hands on this film. It is already so close to reality, that in viewing it recently, I experienced a genuine, nauseating feeling of anxiety.Watkins again skillfully employs a documentary-style narrative. Whereas in Privilege some rough edges to this technique were apparent, in Punishment Park it has been honed to sharp, seamless perfection. The sense of realism is enhanced by disarmingly unpretentious, economical, believable portrayals by the entire cast. This is the kind of acting Hollywood has completely turned its back on, to its detriment, in favor of cosmetically perfect image projections. The cast has first-rate material to work with in Watkins' screenplay. Many cinematic visionaries have tried to shake the viewer out of their complacent, false sense of security. No one has ever achieved this result with such stark and chilling accuracy as Peter Watkins does here.\"What seems quite clear now, is that instead of trying to bring the estranged and excluded Americans, such as these people, back into the national community, the Administration has chosen to accept and exploit the present division within the country, and to side with what it considers is the majority. Instead of the politics of reconciliation, it has chosen the politics of polarization.\"To paraphrase one of the characters, we don't have to call them pigs because they know what they are. Better than we do.","To think this film was made the year I was born. To think people are still having their constitutional rights taken away, now in the name of \"homeland security\". To think this movie was intentionally banned from the American public. PUNISHMENT PARK addresses the political divide in the United States better than any movie I've ever seen. Had it been more widely seen, would it have changed anything? A movie like this is so polarizing, it has the potential to cause riots. It shakes you up and forces you to take sides. It makes you face the issue: are you for the people's right of dissent in a time of war, or for the constitution being compromised in the name of \"national security\"? The protagonists are forced by the government to race to the American flag in a game that undermines the very ideals the flag stands for. The acting is totally convincing. So much so, I can't see any acting going on here at all. If this is a scripted documentary, it's more convincing than any reality show on television today. PUNISHMENT PARK is possibly the most important film ever made. It really makes you think.","I had to see this movie with French subtitles, as I understand it was unavailable for 30 years. I can see why. As a mock documentary, it thinly disguises a diatribe against American society during the Vietnam era - the country's hypocrisy and its culture of violence. It is a forthright piece of agit-prop mock verite filmmaking that I can imagine would easily provoke strong reactions among the youth and among the left during that divisive era. That, of course, is its strength and its purpose. The narrative itself cuts between two scenarios. Neither is meant to be 'realistic'; each is exaggerated for impact and to push the metaphoric value of the situation. On one hand, you have a group of radicals neatly representing various factions of the left - a feminist, a pacifist, a revolutionary, a black activist, a political activist, a musician for free expression. They are brought one by one before a kind of kangaroo court made up of various bigoted, closed minded fascistic pro-war, `America Love it or Leave it' types. These 'pigs' are there to determine the guilt of these left wing 'subversives' and then give them a choice - fifteen years in a federal prison or - Punishment Park. The second scenario involves a group of radicals who have been sentenced to Punishment Park and are about to find out what that means. This story provides a second metaphor concerning American injustice and its cults of violence, division, and oppression. This group must get across the desert in 90 to 100 degree heat to a final destination, where the American flag has been placed. They have two hours to get a head start before a group of p***ed off and bloodthirsty troopers and National guardsman will attempt to hunt them down. They must then surrender or be shot. The chances - obviously - are slim. By going back and forth between these two scenes - the absurd tirades of right wing bigots against the left to the hopeless cause of radicals running for freedom in Punishment Park - the point is made quite clear. The effect of the relentless documentary style and of the film's punishing politics keeps your interest and still manages to incite and indict. Many of Watkins' images recall images of the 60's - assassinated radicals, dead blacks, assaults by National Guardsmen, gags in court, and strong echos of the McCarthy hearings. The cumulative effect is strong stuff. Where it could have gotten silly and where it could feel dated - it still disturbs. It is a fabulous premise for a political satire. It would work well now with the neo digital Verite style of  the Blair Witch Project in practice and the purloined presidency of  George W. and his oppressive cronies in charge.","It's said that this film is or was banned in the US since it was released. Since there is no information on IMDb I must rely on my other sources and believe it. If this is really true, the movie is even more hurtful and frightening and is it is anyway.The movie is a so-called mockumentary, although I think the topic is too serious call it like that. It creates a scenario where America is like a military state and all revolutionary objects are arrested immediately without proof. After an obligatory tribunal they have to decide if they go to prison for some years or choose the punishment park. In that, they have to walk through the desert for three days to reach an American flag, posted 50 miles ahead, while they're are followed by police and army troops.The movie itself pretends to be a documentary about these incidents and follows both the tribunals and the hunting through the desert, filmed by European film crews. All the facts are explained, the interviewers ask questions and film everything. People stare directly into the camera, shouting at it. It seems very, very real. Talking about realism here is nonsense. This movie is not about how to make a realistic film, it is about how such a film would look like, if it was real. And it certainly would look like this. If it would be filmed anyway. In an 'utopian' state like this, there surely wouldn't be a European film crew allowed to film those things.There are many things that frighten us. The defendants are people from all social classes. Political leaders, musicians, authors, philosophers, unemployed, etc. They seem to be hopeless, rebellious or scared. They are no heroes. They talk a lot in the tribunal, knowing it doesn't lead to anything, saying nevertheless all they said in speeches and books and songs before. One says he's not afraid to die. Is this true? Well, he doesn't have to run through the desert hunted by cops. The defendants have no chance, or at least, their only chance, the decision between prison and punishment park, is no chance really. The way they decide in the end and the way film ends, makes it clear that this kind of heroism is suicide.These tribunals remind us a lot of tribunals in the Third Reich. The officials use the same kind of idealistic speeching, ignoring all the arguments from the defendants, starting to scream at them and then telling them they should be quiet. They warn the defendants of \"watching their language\" and insult them much more. They ask them questions, the defendants can not answer, but it's never intended they should. These scenes are a statement about what we call justice.The scenes in the desert are on a different level. When we see the prisoners for the first time, we realize that they realize, they haven't got a chance. Seeing the desert and the mountains, feeling the sun and the thirst, they don't have a clue how they should stand those three days. The film crew follows them and talks to them while they try to escape this madness. They argue, should they play the game, or escape, or revolt? It all leads to the same and no one is surprised. Some will question if such parks would exist in reality in such a state? Why not? It empties the prisons and allows the government to punish the revolutionaries as they want to. It is not a gas chamber, but the Nazis killed jews before concentration camps were built. The comparison is fair, since there is no real difference.The movie is scary and depressing. The problems that are talked about sound to familiar to ignore. This is not science-fiction. Talking about poverty, unemployment and crime is not utopic. The film shows us that government and democracy as it is presented to us, is not only useless, but dangerous. It also shows us that revolution is not definitely the solution. The defendants seem to be confused because they don't really know how to fight this. They do things, but for nothing. Even if this delivers no solution to us, it still is a statement.To me, the most frightening thing is the fact of the banning of this movie. Here we have a film that accuses the loss of freedom, moral and peace. It accuses the government, a fictional government nevertheless, to be dangerous and inhuman. And then this very film is practically banned.","Contains SpoilersThis is a Peter Watkins film. If one has seen his BBC masterpieces \"Cullodden\" and \"The War Game\", one will recognize the style (and his voice) within seconds after the start. Made in 1971 it is set in a very near future, when the Vietnam war has escalated even more and now seems to involve China. Nixon is still president and civil disobedience and protest is dealt with violently using drumhead tribunals (outwardly civilian with 'everyday citizens' as judges). Because \"prison building can't keep up\", an alternative is introduced: The Punishment Park. Delinquents can choose between severe prison sentences and a man hunt in a hostile environment, in this case a 85 km trip through the Californian desert at 100°F. If they reach an American flag at the end without being caught by National Guard or Riot Police, they will be set free, or else they have to serve their sentence (or be dead, as we will see). The film is made in a completely documentary style with three European teams covering a tribunal and the course of two groups already sentenced. Scenes jump between the tribunal tent, the hunting troops and the hunted condemned. Watkin's scarce off commentary gives us raw background information (time, temperature etc.). The tribunal scenes show a kangaroo court on the one side and a wide range of personalities on the other ranging from real terrorists over 'undesirables' to clearly innocents (e.g. a total pacifist who can't even hurt flies). The defense lawyer (who does take his job seriously) has to take abuse from both sides. What makes these scenes especially eerie is their resemblance to the rhetoric of todays administration to the detail. Meanwhile, some unfortunate events in the desert make clear that the 'rules of the game' don't really apply. The question remains open, whether it is rigged from the start or arbitrariness by the troops due to those events that leads to the outcome (I suspect, it is both). At the end we are back at square one with the next group going to \"Punishment Park\". This description may indicate a heavily biased (or even demagogic) propaganda movie but that would be misleading. The behavior (all participants were nonprofessionals as usual with Watkins) looks and sounds real (the tribunal scenes may even contain text material from real contemporary trials). I'd say that this could be sold as the 'real thing' without problem. With Watkins's \"The Forgotten Faces\" the reaction was \"We can't send that or nobody will believe our real newsreels anymore (because this is indistinguishable from the real thing)\". With \"Punishment Park\" it ought to be the same. Effectively banned in the US as far as I know this is a must see that hasn't lost its power or its relevance (especially today).","I will certainly be shot for comparing this with A Clockwork Orange, but so be it.  Both from '71, both banned from television (12-June-2001, 15 votes: isn't it wonderful?), both science fiction and both concerned with an authoritative system that is growing out of (moral) proportions, both scary as hell.  A major difference is that Punishment Park is intentionally not aesthetically fine-tuned and that the corrective groups have probably never committed any crime at all, while Alex is a recidivist delinquent.  They do, as in Clockwork, spout supposed philosophical statements throughout the film.  It is an ultra left-wing propagandistic attack on a certain ultra-reactionary system filled with caricatures (absurd loyalty, juvenile soldiers and rednecks) and the Viet Nam war.  The dialogues and monologues are eloquent, but I found them sorely myopic and exaggerated.quote: 'Punishment Park.  Described by the US senate subcommittee on law and order as: a necessary training for the law officers and National Garde of the country in the control of those elements who seek the violent overthrow of US government and the means of providing a punitive deterrent aforementioned subversive elements.'The supposed delinquents can choose between their (severe) penal sentence or three days in Punishment Park, where officers in training may hunt them.  We see the interrogations of a new group alternated with footage of a preceding group that is outside in the park fighting for their dehydrated life and to get to the American flag for chauvinistic 'salvation'.  This dystopic penal system is the result of the politics of polarization, according to a condemned one.  The hand-held cinematography and the minimalist industrial sound track with constant shooting and agony in the background create a sense of realism, AND it's frightening to see how far fantasy can go in a dated film: it's almost post-apocalyptic.  What's even scarier, there are parts of the world that apply even more disreputable methods ... today9/10 (not for the political ideas of course)","Punishment Park is a brilliant piece of cinema. Shot in the SouthernCalifornia desert using his patent faux documentary style, Watkinscreates a film like no other. He follows two groups of prisoners (onepre-sentenced the other post-sentenced) throughout the picture. After they're tried by a military tribunal, they have the choice of eitherserving out a prison sentence or they can participate in PunishmentPark (a grueling three day hike through the desert with nothing but theclothes on their backs) whilst being hunted down by local lawenforcement officers who use the park as a live action trainingground). I can't say enough about this movie. Sometimes it feels as ifyou're watching a real documentary. This is one of Peter Watkins mostaccessible films. I advise you to look out for it. You wont regret it!Highly recommendedA+","Peter Watkins' film Punishment Park is nothing if not a sincere cry for justice. Of course the film is a metaphor, a provocation, a sort of alternate reality that could have been a science fiction fable if it wasn't so naturalistic as a \"fake\" documentary. And of course there weren't 'Punishment Parks' in America in 1970 when the film was made, where dissidents and rabble-rousers and draft dodgers were taken and given the chance to either participate in the 'game' or go to prison without a fair trial. And sure, at the time, the film got panned for being too blunt an instrument of provocation, of being so much about its subjects of the US versus THEM element that it was too much.But what can be said of the film today? At the time for those who didn't know it was a \"fake\" documentary, like in Finland, they panned the US government for allowing such a thing like this to happen! This is, perhaps, the best kind of compliment Peter Watkins could have received - certainly he fared better there than with the film critics who panned it and, ultimately, the film got four days of distribution by a no-nothing company before being pulled from NY city screens (it fared worse in being shown on TV or elsewhere, where for years it was just unavailable). Seeing it in 2010 is still a shocker some forty years later. Not because of what it says about its time and place, that's a given, about the rift between those in power and those not, but that it could still happen, in a slightly less extreme form, today (just look at the atrocity of justice with Guantanamo Bay for that).There's something about this film that gets under my skin. It got its way in within the first ten minutes, by sinking its teeth with its structure, of it being a British documentary on this 'Punishment Park' out in the California baron wasteland (it could be Death Valley, but whatever it is it's unbearable conditions), and how nothing is made to look fantastic. The nerve of the film is like that of Night of the Living Dead in its no-holds-barred hand-held approach to photography (only in this case the police seem to be the zombies, albeit with more of a brain which is perhaps much more frightening). Watkins cuts between this demonstration of what the 'Park' is - a three to four day excursion from one point to another where those who volunteer (and there are many, as the alternative is years in prison) who have to get to an American flag. Which is not easy when you have police just getting ready and more than willing to kick the crap out of those dissidents and, of course, shoot to kill.This is all meant as metaphor, and the most contemporary example I could think of as comparison would be District 9 (though that film didn't carry out its artistic premise anywhere near as thoroughly as this). But the metaphor is strong because of a) what was happening at the time, with Chicago and Kent State and the trial of the Chicago 7 (Bobby Seale's gagging during the trial is recreated here with one such African American on \"trial\"), and of the attitudes at the time. The what if shouldn't be diminished because of thinking practically about what would happen if this really did occur. What matters is making it seem real, carrying the documentary aesthetic and toying with it - Watkins goes from objective reporter to subjective \"WTF\"-ing at the police killing and maiming people from one scene to the next, which is chillingly effective - to make the experience last in the mind.Aside from it being a rigorous example of film-making, and a satire that is about as funny as a burning school-bus on a field trip, Punishment Park gets some major points. And the fact that many in the film never acted before or wouldn't again (some of which were actual dissidents and protesters as the kids, and some of the cops were actual cops) heightens the tension and moral identity of the scenes. But really its ultimate impact is that it lasts, in the mind as well as the consciousness of a nation. The US has laws in place to keep this from happening, to be sure, but at what point does the line thin away? Most recently there's been question of how to put on trial those accused of terrorism against the US. That, too, is an extreme example, but, again, where is that line drawn? A question I was left with at the end, or thought people might have by the end of it, is \"What will be done about it?\" Or, more precisely, \"What can be done?\" It's a call to arms that shook me up and made me depressed, but I can't say it didn't do it in the way that matters. It's one of the great incendiary films in our history; that it's also an experimental piece in the realm of documentary-meets-fiction, breaking all boundaries for its message, is further extraordinary.","This is a prophetic film about the US government quashing any kind of dissent against what it considers its moral codes of the day. Putting those accused in front of a farcical panel that represents the establishment or is supposed to speak for the masses and condemns them to be incarcerated or face possible freedom by going through the terrain of Punishment Park and if succeeding to eventual freedom. The fact that the band of 'kids' have to traverse over 50 miles in impossible desert heat with no water with armed police in pursuit is an indication of their certain fate.This is a film that boils the blood. It made me angry. It made me feel sick. It made me think. I could not believe it was made such a long time ago. It seems to reflect exactly what is going on right now in Cuba with those prisoners who still have not been charged. What the hell is going on and how can they do that? Totally contravene international law on human rights. This film covers so many themes and issues about society and how we treat anyone questioning the status quo. The film shows a tipping in the balance of power. The point where the state runs amok and is allowed to carry out its ultimate goal of simply removing dissenter from the equation. Surely diversity is the essence of humanity? What is particularly sad is that Peter Watkins himself is not given carte blanche by some British television channel to make what he wishes as this is clearly a man who has something to say. In this age of dumbed down television with anodine members of the public exposing their flesh, constantly effete presenters and vacuous woman designers, don't we deserve to aim somewhat higher in what we produce and send out to the masses. Don't we want to dream anymore?","Certain aspects of Punishment Park are less than perfect, specifically some of the acting. However I feel that this is probably the most important movie of the \"war on terror\" era. I grew up hating hippies and in some respects I still do. It wasn't until the United States was started down the path of an unnecessary and deceitful war in Iraq that I began to see the world through their eyes. I can feel what they must have felt. Although the film is somewhat dated, watching it brings those uncomfortable emotions about our present situation right to the surface. It's clear enough early in the film that Punishment Park is designed to be a concentration and death camp for all the \"unpatriotic\" elements of American society. This is certainly an exaggerated and extreme view of our polarized society, but it is CREDIBLE. At times I find myself believing that the USA could easily slip into fascism. As I watched this film I could only think about how I hear similar sentiments from people on both sides of the political spectrum almost daily. This movie is a raw, concentrated distillation of America's PRESENT political scene. I am both impressed and saddened that something this relevant (and yes, accurate) was filmed more than 30 years ago. If you take a more moderate view of the movie and choose to believe that this couldn't happen here, look more closely at Guantanamo Bay, some of our \"enemy combatants,\" the rumored CIA secret prisons and the many incidents similar to the one in Greensboro, NC in 1979 (8 full years AFTER the making of this movie).","Realistic Master-Piece. thirty years later, the pictures can look a bit old, but actually, it only accurate the 'fist in the face' effect of the movie. I never saw in my whole life a film like this one. First time I saw it, I didn't know if it was a fiction... And It didn't looked like... That movie is a masterpiece that every single person in the world have to see. It's the best ever society critical movie. The ultimate movie that demonstrate that the system is down. And the system has not change a lot, in thirty years. I think this movie would have to be watched as an education piece.","First of all, the entire script is mostly improv, adding to the fantastic illusion that what we are watching is an actual documentary. Secondly, the actors hired by Watkins were purposefully chosen to represent their true political alliances and backgrounds. The hippies portrayed are actual hippies, the government officials (though not necessarily in the government themselves) are at least actually hearty conservatives within the system, and several of the cops are actual policemen. The interactions of these actors, given the textual freedoms alloted by Watkins, eventually come to a violent head where even Watkins himself is convinced that a cast member had actually been shot. (We hear him screaming \"Cut! Cut!\" in the background.)An AMAZING film though American critics were quite harsh in their reviews, one actually reporting that it was the \"most offensive\" film she had ever seen. This not entirely unexpected as the unveiling of this oppressive communist-like mentality of America during this era would certainly rattle some cages. This pseudo-documentary definitely requires an open mind, though if you are seriously looking for an intensely accurate portrayal of 60s culture, this would be THE film to watch.","Set in a California detention camp in an indistinct future, an English film crew capture proceedings as young students and political dissidents are put on trial under a fictional 'Insurrection Act' that allows the United States government to suspend civil liberties for its own citizens in cases of emergency without the right to bail or the necessity of evidence. In such cases the government is authorised to apprehend and detain anyone they believe may engage in future activities of sabotage. The group on trial includes a feminist, a black panther and a folk singer.Those convicted by the a Conservative tribunal have the choice of a lengthy prison sentence or three days in Punishment Park, in which they can attain their freedom by reaching an American flag in the desert. They must accomplish this without food or water. They are also to be pursued by armed National Guards and police who can return them to the camp if captured to face the penal sentence attributed to each person convicted. The reality is different; those that choose Punishment Park are hunted and killed or brutalised with no hope of gaining their freedom after a policeman is found dead in the park. The park seems to be a training ground for the police and guards who need to master these acts of suppression so they can be put to use in open American society.Shot on 16mm and in the documentary style developed by Watkins, in his celebrated Culloden and the controversial The War Game for the BBC; he interacts with the prisoners and guards and observes the unconstitutional trial, inter cutting between them to create a totally convincing political movie that still remains vital and relevant. Using his knowledge of the medium, Watkins has produced a driving, relentless and ultimately frightening film portrayal of an entirely fictional American political detention camp that would not convince if it wasn't for his flawless construction. Many of the actors are amateurs improvising with broad characters. The sparks fly in the trial scenes in which each case is heard, in part to the fact that Watkins kept those on trial away from the jury until the filming of those scenes. Watkins also claims that the actors are often expressing their own opinions which certainly explain the ferocity as well as the believability of their performances.The film has been heavily criticised for polarising the opinions of those that see it. It has been claimed that the film is reactionary and unequivocally represents that conservatism and war are the root of America's social problems. While these criticisms may be valid it is important to consider that the film is working on a fictional, metaphorical level and it is perhaps the realism that the film so cleverly constructs that encourages such a heated opinion on its content. In fact the films most important theme is the problem of polarisation itself. The 'conservative' judges and brutal law officers are on one side and the 'liberal' convicts are clearly on the other with no concessions made on either side. This seems to be what the movie is really about. The new law and the park itself is the outgrowth of a situation where mediation between the two political positions has been lost.Made during and in protest to the Vietnam War and the treatment of those who opposed the war in America the films main themes of Governmental persecution of its own citizens and Conservatism impinging on civil liberties still strike the same chord in the era of the Patriot act and the identity card. It also strikes a disturbing chord with news footage of Guantanamo Bay and the treatment of Iraqi prisoners at the hands of Allied forces.The threat of internal 'terrorism' is such a volatile issue that the film cannot fail to connect with current attitudes to the subject. Not surprisingly the film has had a checkered distribution history, being marginalised to an extreme due to its content but the disturbing fact that this movie is that can still remain so relevant today suggests that the wait has not been for nothing. Punishment Park is a film that has had to fight to be seen anywhere and it demands your attention.","This extraordinary pseudo-documentary, made in 1971, perfectly captures the zeitgeist of America today...which makes it all the more scary and relevant. \"subversives\" (college students, hippies, black activists, academics) are being rounded up by the government and given lengthy prison terms for what amount to thought crimes and social protest. As an alternative to life in prison, these convicted \"criminals\" are offered three days in \"Punishment Park\". Their objective inside the park is to make their way to the American flag where freedom awaits them. Not surprisingly, the Punishment Park option is a dirty lie. This brilliant film from Peter Watkins even pre-dates \"Battle Royale\" and \"Series 7\", though its angle of attack is more blatantly political. Shot in '71, it looks and feels as fresh as anything made today. The performances are exemplary and the direction is razer sharp. The narrative cuts back and forth between various groups trying to survive the harsh conditions of the park and the McCarthy-like trials that convicted them. Today, this film still retains its power. In '71, there was nothing but nothing quite like it. This is a masterpiece that succeeds on a dozen levels. It has the balls that most people today have lost.","It kicks you in the stomach. There are other films with more convincing characters, a more realistic story, and maybe even more depth concerning political invocations. But then again, most of these are not directed by Peter Watkins. Maybe the one true genius artist of British Film to emerge out of the 1960s, Watkins has made quite a bunch of rarely seen films that perfectly capture the spirit of the outer-aesthetic world - the world of political ongoings, social problems and governmental solutions. Thus, his work is probably less \"filmic\" than, say, political, which some may call a weakening of their inherent artistic quality. Then again, why shouldn't art allow itself to become engaged? Watkins dares. And succeeds. You won't feel well with this one. You won't feel happy. Actually, you won't really like the film; it is uncompromising, honest, direct, unashamed; a smash in your face, in short. You can't help getting angry, you can't resist to let the things you see touch you. That is what makes Watkins' films so rewarding.","I saw Peter Watkin's Culloden and The War Game a few months before this and was very impressed. The technique is essentially the same, or at least very similar, in this film detailing on the one hand a trial of dissidents in California in the (apparently) near future, and on the other the attempts of a group of convicted \"criminals\" to slog through 50 miles of desert to win their freedom in a government-run \"punishment park\" as an alternative to prison. Watkins films everything in a documentary style, which causes for more than a little awkwardness or required strong suspension of disbelief: how is it that the camera crew is with the group of starving and parched prisoners over 2 days without either offering help or sharing in their misery? And that's merely the most obvious example. But questionable storytelling aside, this packs a punch; no question you have to be interested in political film-making to really get involved, but the film really isn't like anything else of its era: it pulls no punches, offers no simple solutions. The leftist political figures are certainly painted broadly at times, but they aren't all alike; the right-wing government functionaries seem a little more cartoonish, but even they are allowed to show at least a little humanity. Overall, the film gives much to think about and leaves an indelible taste.....8/10 DVD rental","Who´s not for the state is against it.Against a constitution which distinguishes itself with being conservative and contradictory in its foundations.\"Punishment Park\" is a great portrait about the Nixon era, that hasn´t lost anything from its explosiveness till today.This film is banned in America, but it should be seen by everyone - especially by US-citizens...","Peter Watkins' rarely seen Punishment Park is a brutality-laced, uncompromised political weapon set across a never ending desertscape. An unapologetically left leaning anti authoritarian abuse fest, the escapades at first appear to be so over the top militaristic and sickening that it could come off as some distant fantastical dystopian alternate history, one Harry Turtledove would even enjoy. But once we delve deeper in and really pay attention to the abhorrent diatribe spouting out of those presiding over the tent topped tribunal, as well as the shotgun toting guards overseeing the bloody affair, our eyes are truly opened. Suddenly we realize just how prescient Watkins' film-making is, as much of this is the kind of neo-con talking points about youth culture and the legality of divergent thought tossed around by politicians today. Granted, much of it was drivel pouring out then as well, but it really shows us how little has changed, and informs of how, in some ways, we are closer to such a world where Punishment Parks would be a real and frightening operation.The main players in nearly every scene are seasoned non actors, mostly chosen for their rash political views and desire to get them on camera. This lends an unprecedented heap of authenticity to the entire experience as we never, even for a second, question the reality of all the chaos. Shot documentary style with 16mm film, this appears like a gritty documentation of some despicable government test project that was classified until found years later. At least it appears to have that history to it now, maybe not as much when it was (barely) released. But this gives an added weight to all the proceedings and helps draw you into this incredible not-so-alternate universe of torture for convicted dissidents.","This is a very hard review to write, because this is a very hard movie to watch. There's so many different ways to take it, and unfortunately it forces you to take it a particular way even if you don't want to.Punishment Park is about extremes, rightists versus leftists and the destruction inherent. Two camps of protesters are put together, the violent and the nonviolent, and both are punished together by being forced to trek 50+ miles through Death Valley in the middle of summer without water... if they fail, they die. If they succeed... well...The thing is that this movie is hateful. It's utterly predictable, but not in that way where it's condescending or stupidly written, but in that terrible way where you know what's going to happen and don't want to see it, but do. It's entirely a \"necessary\" product, one that HAD to have been made during the era it was, and unfortunately one that HAS to exist, even if it's simply a terrible experience.What angers me so much about it is that it proves itself. The way it's a pseudo-documentary and it's vastly leftist politics makes it almost insulting, makes you want to just ignore it as the ranting of a zealot. If the people are in the desert, for instance, with a camera crew nearby, why aren't they asking the camera crew for water? And once they start to get desperate, how come they never attack the camera crew? Major difficulty in a movie where the director speaks.Besides, the alien looking extreme rightists in this movie are almost laughably caricaturistic, making one really feel preached to. This movie seems to beg us to not believe it, to feel incredulous that such levels exist.Yet the movie \"exists\" as it \"actually happened\" because of people's treatment of it. It was banned in England, pretty much not allowed release in America, and got very little release in very little places. The credits roll, and the director/narrator points out that at least one of his crew was subsequently imprisoned. The treatment of this movie by those in power profoundly reinforces its themes, which is terrible because its themes shouldn't exist.And then I'd love to say that this film should now be forgotten considering the by-gone era, but noooooo!! Current political landscapes and people's readiness to turn Iraq into another Vietnam either by making poor decisions or repeating said fact with slogans on picket signs makes this movie come back to the forefront again, a painful Big Brother, a terrible paean to the fear and hatred that consumed many during that era which people seem eager to reclaim in this era. Basically, it angers me to no end that this had to exist, it angers me more that it's still palpible, but not because of the movie itself but what it represents.--PolarisDiB","Death Camp Opera: Right Here, Right Now!Ten years ago, I read that a very special movie had been directed about the polarization of our society. A certain Peter Watkins was the author. His picture was acted by some non-professional actors, citizens like you and me and others. The violence of the atmosphere was described as extremely realistic. Was it a movie, a documentary? Both actually.Over the years, I realized how hard it was to find it. Maybe I would, by coincidence? Anyway, it's yet an old story. I saw it a short while ago. Totally impressing. My very favourite peace of art: Punishment Park is its name. I love this \"docu-fiction\", this \"truecastmovie\", this \"realityshowfictionnal\", what ever. After all the shock movies I saw, I reach the best with this strong and intense cinematography'experience. I found a masterpiece. There is enough on the net to know many things about the movie. It is even to buy on DVD, with additional stuff. The only words I want to add is about my own experience with this film. I can only trust such a sincere and engaged peace of art about people and for people, those who direct, act or watch. A cinema which is simply a real human experience within an art adventure or the opposite. So, I'm not talking about all the 'mucs' we can see on TV, especially the 'real'shity-show' whom the concepts of people playing them-selves are interesting, but used in a stupid and perverse way. In Punishment Park, we can see some real individuals living as they are. We only put them in a very specific context, with a few lines to follow, and we let them be what they want to be. It's a kind of therapy, a way of 'individuation' for those inside the movie and also for the active spectators in front of screens. Then, to end, the director's touch edits a short and sweet apocalypse movie, a desperate scream, a 'Death Camp Opera', where some folks are on the run after virulent trials. Punishment Park is for those who want to grow. See this film and have the opportunity to choose your own morality. Grow up and harmonize yourself with it! If you can feel it! If you can see it!! In my case, Punishment Park is stuck in me for ever, with all my love, consciousness and will.","The most amazing film I have ever seen. I didn't read the programming and I just stumbled onto the movie by accident. I thought it was a real documentary and i felt sick at what I saw. I only found out it was a movie after it was finished and i looked on the web for more info about \"punishment park\" in the U.S. It felt incredibly real and it is easy to believe that this really has happened in the US if you are from Europe. I must admit that I felt really anti-american after watching the movie and before finding out that it didn't really happen that way.","Peter Watkins' Punishment Park is a compellingly brutal film, serving as commentary on the polarization of America and the treatment of those with unpopular viewpoints in the Vietnam-era. Shot in 1971 on a miniscule budget, the film offers its ideology on American youth at the time, the dehumanization and corruption of government, and the torment of people, with the looming thought that they may have not even been doing anything wrong.The film was one of the very first to be shot in the style and tone of \"cinéma vérité,\" a technique used by filmmakers to generate a documentary-like vibe and to persuade the audiences into believing what they're seeing is real footage. It is 1970, and the Vietnam War is escalating, with president Richard Nixon losing control and running out of options. He declares America as a \"state of emergency, and proposes the \"McCarran Internal Security Act of 1950,\" which gave federal authorities the right to detain those who appeared as a \"risk to internal security.\" We follow members, mostly young university students, of various political movements, such as the feminist movement, the anti-war movement, the civil rights movement, and the communist movement who are arrested and given the choice of either serving their full time sentences or spending three days at the ambiguously named \"Punishment Park.\" Many of them choose the second option, where they are told that if they can run fifty-three miles in brutal California desert heat and make it to an American flag checkpoint, with a two hour head-start before National Guardsmen and federal authorities are dispatched to try and stop them, that they will be released and their pending dues will disappear.As we see many young students run helplessly through the desert, with temperatures well over one-hundred degrees, we focus on another group of students who are pleading their cases to a group of men and women in a tent on why they were resisting and evading the Vietnam war. The people are simply not interested in hearing their views and constantly interrupt them, leading to contentious interactions involving heavy cursing and strong morality and ethics that increasingly come into play as time goes on.The cinematography is as raw as they come, with extensive shots of desert locations inhabited by sweaty, breathless students desperately clinging to their last hope for survival and humanity-driven choices. Watkins directs this picture with numbing realism that stems not only from the provocative cinematography, but from the screenplay, composed of extemporaneous dialog and improvisation on the actors' part. Their performances are coldly real and chillingly authentic.Punishment Park sort of tires out in its third act, being that it greatly established its point and purpose within the first two, but the film relentlessly tries to depict a brutal reality filled with dissent, isolation, and strict government control that thankfully never was prophetic. What is amazing is despite ones assumption that the film's ideology and issues are dated and no longer relevant, in a post-9/11, Patriot Act, NDAA world, it would appear we must look onto films like these as poetry for the present.Directed by: Peter Watkins.","I first knew of this film because of a quote at the beginning of a song. After a little research, I found that it came from this film and, finding the synopsis interesting, watched it. I found several other mind-blowing quotes, and a sense of fear that normally lies controlled under all the illusory security and freedom our governments force unto us via the media machinery and embedded social standards to keep the masses happy in their ignorance. I am not strange to that feeling, since I may know too much for my own good, and also like to do my best to fight this putrid system we were all born into. Punishment Park is shocking because it is happening. I've seen it. While your average Joe rants about the increase in taxes while drowning his frustration in a can of beer, there are others who actually take action. And are at risk of suffering the torments of the so-called \"law\" in the name of a distorted justice and self-created ideals such as patriotism or morality. The \"judges\" portrayed in this film do exist, full of absurd and obsolete ideas, believing to be the voice of reason, while those who actually speak sense are treated like criminals, gagged and beaten by the arm of the law, individuals just like any other people who, by the almighty and imaginary power of state, are given the authority to command and do as they please with the common citizen. This movie is not a false documentary. It's a depiction of what has been happening for years in America, in Europe, in Asia, in every continent and with every government. You, thinking you can be as free as you can possibly imagine, whose biggest worries are what to have for dinner, take heed. The body lying on the pavement could be you, murdered by those who claim to come in the name of peace. \"At another time, the honorable thing or the right thing to do might be to be a policeman or to be President. Right now, I think the honorable thing to do is to be a criminal\""],"review-user":["Djangokitty","tezzzaaa","Jenabel_Regina_del_Mundo","noelartm","tjackson","davidturgay","hartmut_berger","rogierr","Captain_Couth","MisterWhiplash","ellkew","pheed","Hell-Burner","ixnever","joepublic","fertilecelluloid","Thorsten_B","OldAle1","DJ Inferno","russianberserker","Polaris_DiB","jwer79","Spockkie","StevePulaski","Lomedin"],"review-date":["25 August 2001","17 October 2005","22 November 2004","27 June 2005","13 January 2001","11 June 2001","9 January 2006","19 August 2001","14 October 2003","11 April 2010","15 August 2008","2 December 2005","30 July 2002","23 April 2009","14 March 2006","9 May 2008","11 May 2008","21 April 2008","13 June 2001","21 October 2008","26 March 2006","19 June 2004","11 June 2001","29 July 2012","11 April 2011"],"review-rating":["9","10","10","9","10","10","8","10","10","10","9","10","8","10","5","10","10","9"],"review-title":[" Amazing film!!!!!!\n"," Extremely relevant, audacious and very impressive pseudo-documentary\n"," another chillingly accurate depiction of days of future present from Watkins\n"," the more things change, the more they stay the same...\n"," A lost classic of strength and purpose.Find it. See it.\n"," Frightening in so many ways\n"," unmistakably a Watkins, eerie\n"," I will be shot ...\n"," Peter Watkins' Masterpiece.\n"," a film that questions how to live, how to die, and what it means to be in a country at war\n"," Relevant, shocking and inspiring.\n"," Did Watkins have some kind of crystal ball?\n"," Best society critical movie\n"," The Most Realistic Pseudo-Documentary I've Ever Seen\n"," The Punishment Is Worth It *Spoilers*\n"," A masterpiece\n"," A Smash in the Face\n"," the politics are the real punishment in this leftist American nightmare\n"," Just a few words...\n"," Prescient and Horrifying\n"," Hateful movie\n"," Death Camp Opera: how it happens\n"," Incredible\n"," Both options should be called \"Punishment Park\"\n"," Reality through the lens of illusion\n"]}