{"review-url":["http://www.imdb.com/title/tt0086791/reviews"],"review-text":["This retelling weaves myth and magic with the Robin Hood legend and, indeed, Robin becomes associated with the forest god, Herne the Hunter reinforcing the idea that Robin is a medieval incarnation of The Green Man (the 'foliate head' of the old religion which is often found carved on many churches).The scripts were were well written, the plotting well thought out and the characters - and ensemble cast - excellent. In particular, congratulations to Mark Ryan - who became Nasir the Saracen. Due to be killed off at the end of the the first episode, he was so good, that he remained as a permanent cast member.Ultimately, though, the series' immediate appeal was due to the amazing on-screen chemistry between its two leads, Michael Praed and the beautiful Judi Trott as (the first) Robin and his Marion. Praed's youthful, dark, good looks had an almost 'fey' quality which made the magical element entirely believable. (And by 'fey' I don't mean to imply any loss of masculinity.) The first two seasons - with Praed - were by far the best.\nIn the third season, Jason Connery had a hell of a task following an actor so perfect for the Robin role, but he did reasonably well and the strong ensemble cast carried the change of lead well. Richard Carpeneter's wise decision to make the new 'Robin Hood' a completely different character with a completely different background was a very wise move.I suppose any review should mention the immense debt Costner's Robin Hood Prince of Thieves owes to Robin of Sherwood. Some might say that 'debt' was putting it mildly! Costner not only retained the Saracen (who until Nasir had never been a Robin Hood character at all) but he filmed in many of the same locations; used the same horsemaster (Stevie Dent) and clung to the magical elements - though being a good old American boy stuck to the idea of Christianity good - old religion bad, whereas Robin of Sherwood often showed the political corruption of the Church (historically accurate)and the simple spirituality of the old religion (unrelated to 'black' magic). Alan Rickman's OTT sheriff was a wilder version of Nickolas Grace's sly characterisation.What more can I say? If you've never seen Robin of Sherwood, rush out and buy the complete thing on DVD - I guarantee you'll watch it again and again for the lovely filmic quality of the camera work, the leisurely but never dull pacing (which invests in the attention span and intelligence of its audience), the acting, the ideas, the very real emotional kick and (much praised) the delightful music by Clannad.And did I mention Michael Pread...?","There is nothing more I can add to what has already been said about the entire series. As well as taking me back to a time in my life when the words \"mortgage\" and \"bills\" meant anything to me - and when Saturday night prime-time entertainment didn't involve reality TV, people wanting to be pop stars and hour-long programmes to pick lottery numbers when I could do it myself in ten minutes at the most) - there is no other TV show or movie about Robin Hood that even comes close to being on a par with \"Robin Of Sherwood.\"Every member of this young cast brings their character to life, and the Merry Men are perfectly written and acted. The Sheriff Of Nottingham breaks away from the usual mustache-twirling, scenery-eating bad guy, and has more in common with a corrupt politician than his previous incarnations.Michael Praed's Robin Of Loxley was certainly a better Robin than Jason Connery's, but that isn't to take anything away from Connery. Praed's swansong in \"The Greatest Enemy\" is one of the best episodes of any TV show I have seen in such a long time. Richard Carpenter's knowledge of both the legend of Robin Hood and beliefs in England at that time clearly show here - and it goes without saying that if the people behind \"Prince Of Thieves\" had this much insight and knowledge of the source material, their \"Raw-bin Hood\" would not have been so dismal. Blatantly stealing elements from RoS, and yet ignoring others make this film merely a pale imitation of RoS.Without wanting to sound harsh, Connery seems to have been chosen to garner a little publicity for this often under-rated show; the son of a former incarnation of Robin Hood playing a modern-day Robin Hood. Connery handles the part extremely well, but isn't the actor Praed was. That said, I do prefer the third season episodes and stories to the first two series'. No one would envy having to follow in the footsteps of a role made famous by someone else for two series, and there is - as in all the series' - an excellent camaraderie and relationships - between Robin, his Merry Men and his Merry Woman. The addition of the \"old religion\" trying to continue, while the new religion of Christianty tries its hardest to stamp it out. It's ironic that this reminds me of \"Prince Of Thieves\" in relation to RoS: borrowing a lot of elements from the original, and tweaking them a little. Still, though, the old version prevails over time.Clannad's soundtrack works excellently alongside the programme - and I doubt RoS would have been the success it was without it. If you don't already have Clannad's \"Legend\", go out this weekend and treat yourself.All of the stars appear on the DVD boxsets and everybody has good memories and making this show. Now a huge star, Ray Winstone seems genuinely pleased to take time out to talk about his experiences and love of the show.Whoever suggested in this discussion that Carpenter should bring all of the Merry Men back together as older, wiser outlaws is 100% right. Do it now.\"Nothing's Forgotten. Nothing Is Ever Forgotten.\"","Unfortunately, only four episodes of this series are commercially available, and it is not often re-run on television.  Although the few available episodes can often be found in the children's or family sections of video stores, they deserves much more respect than this; this show is one of those rare incidences of really good television.The show mixes magic and paganism into the familiar Sherwood tale, and music by Clannad adds to the mystical atmosphere.  But the characters are anything but the swashbuckling cardboard heroes that the Robin Hood stereotype embodies, and we have come to expect.Michael Praed (in my mind, the perfect Robin Hood), plays a fallible, conflicted Robin, who is nonetheless idealistic and strong.  All of the Merry Men are fleshed out as full characters, with their own motivations and ideas, and Marion (Judi Trott) is represented particularly well.  She avoids many female stereotypes: she is beautiful but not plastic, a fighter but still definitely feminine.  The Sheriff of Nottingham (Nicholas Grace) and Guy of Gisburne (Robert Addie) are present as the classic villains, but they both go far beyond the usual limited parameters of these roles.The characters are all comfortable and unselfconscious, as though they don't realize that they are legends.  To me, this is their most appealing trait of all.The creators of the show also deserve kudos for their brave move in replacing Michael Praed when he opted out after two seasons:  instead of recasting another actor in the same role, a different Robin Hood was introduced -- a man of noble background (played by Jason Connery-- yes, the son of *that* Connery)as opposed to the peasant upbringing of Michael's Robin.  The show thereby manages to address both accounts of Robin Hood's origin.  (Many people prefer Jason's Robin.  I personally still gravitate toward Michael.  It is an ongoing debate among fans.)Even after all this time, the show still has a devoted cult following, who gather for yearly conventions with the stars.  Their devotion is understandable; \"Robin of Sherwood\" is the best representation of the Robin Hood legend that has ever been created for the screen.","Ok, some facts to get a few potential misunderstandings out of the way: This is an early 80's British production. So, everybody expecting the highest US production standards and a gloss factor 10 should back off NOW! Everybody else will have an HONEST ball of a time rediscovering one of the most underrated, and at the same time most precious gems in Fantasy TV as well as movies. This isn't only the definitive blueprint of the 'modern' conception of the Robin Hood tale, as well as 'modern' fantasy, it's also a 25-part journey through high quality Fantasy story-telling as we've ever encountered it before or after. Too bold? I don't think so. Re-watch the excellent DVD collection (the last part will appear in November) and marvel at the originality laying foundations to almost every similar project going.Be aware! It's old-fashioned and VERY simple! It's demanding and VERY clever! Contradiction? Not really. It's a child of its time as well as a prototype of what's to come. But everyone who's still kept a sense for the simple, as well as most precious prospects in story-telling, will be delighted. This is a unique gem that can only be surpassed by a greater budget coupled with at least a similarly good script. Let me tell you: That hasn't happened yet.Re-educate yourself in the unique virtues of early 80's UK television. You won't be disappointed.\nSchogger13","My dad taped a bunch of these off TV when they were imported here to the States and he recently re-purchased them off the net in two gift packs dividing the two seasons and two Robin Hoods as \"The Praed Collection\" and \"The Connery Collection\". Since I grew up watching this by many fires on misty and snow bound nights, it is probably my favorite telling of the Robin Hood story.What I liked best about this show growing up and still like best (although I do have more appreciation for Judi Trott) was the mysticism of the show. All the other tellings told of Robin Hood's rise to heroism and then his ultimate triumph and then that was it and while it was certainly fun, this series seemed to have more meat to its bones because of its introducing all those mythical elements. The music was also pretty cool, haunting and beautiful.After watching this and \"Excalibur\" one misty day, I noticed that some of the myths here were similar to Arthurian legend. Herne is to both Robin Hoods (Praed, Connery) what Merlin was to King Arthur. And the two Robins are later given a magic sword, Albion (which later became the name of our family dog).The show ran for about 4 seasons I think, the first two featured Michael Praed as Robin of Loxley, and the last two featured his successor, Robert of Huntington, played by Jason Connery (Sean's son; Sean also played Robin Hood in case you didn't know, in \"Robin & Marion\" opposite Audrey Hepburn's Maid Marion). But both Michael and Jason's characters become known as Robin Hood and/or the Hooded Man. I was surprised to read in the archives of reviews that many people prefer Jason over Michael, since people often get more attached to the first guy (maybe it's name recognition). I think they're both capable actors and they both brought something different to the show, but while Michael and Jason's Robin Hoods were both likable characters, I think I like Michael better as he had that dark, brooding intensity about him. This is not to say that Jason, while more of a pretty boy, did not have his moments (the best part of Jason's reign was watching him struggle to prove he was a worthy successor). What I find ironic is that Jason's character, Robert/Robin 2, has the noble man who rejects his heritage origin that is often attributed to Michael's character, Robin of Loxley.\nThe rest of the cast was great too. Judi Trott was a beautiful and believable Marion who had to stand up to have a place for herself in Sherwood. Ray Winstone was an intense and dangerous Will Scarlet. Clive Mantle was a lovable Little John, as was Phil Rose as Friar Tuck, Peter L. Williams as Much, and Mark Ryan as the strong silent type, Nasir. Nikolas Grace was a great Sheriff, Robert Addie an over the top Gisbon.A great show with great stories and a great cast. To this day I wish they could have gotten Michael Praed or Jason Connery to reprise the Robin Hood role for \"Robin Hood: Prince of Thieves\". I'll take them over Kevin Costner any day.","It never occurred to me that I might find \"Robin of Sherwood\" in the Internet Movie Database, but since I have, I can't help but write something about it.  Looking over the other comments, there's not much left which hasn't already been said, but here goes.One of the things which appealed to me the most about this series (besides Michael Praed!) was the grit and, to my eyes, the realism of the series. There was straw on the floor, people were scruffy and dirty, regular bathing was considered deviant behavior, the Sheriff was an atheist, everyone had a different, often myopic point of view, people died young. I remember the episode in which Gisburne falls in love with a Jewess.  When the town turns violently anti-Semitic, Gisburne can't understand why she would never consider giving up her heritage to become his safe and well off Christian wife.  To him, it was just common sense. These little details made the story rich and complex.  Combined with the mystery of Herne, Clannad's beautiful music and weekly action, I couldn't help but become addicted.  This series is the yardstick by which I measure all other versions of Robin Hood. Compared to the rest, this is the one to watch.","As listed and stated in many previous comments, this unique series has many excellent elements and ingredients to its credit. Indeed, more than 20 years after it was originally transmitted, it is still watched, and watched again, and has a huge global fan-following, something which must indicate that the makers of this series undeniably got something right.The root of the series' brilliance and remarkable appeal has however got to be that it rests on wonderfully written dialogue and timeless characters  all of which are brought to life by marvellous actors. The characters are wonderful in particular because of their complexity. In contrast to many other Robin Hood adaptations, and indeed many other film and TV-productions in general, the good guys in this series often make mistakes and can be seen to have apparent flaws, while the baddies, although put forward as evil and ruthless, frequently can be understood and even on occasion seem quite sympathetic. This very much makes Robin of Sherwood into a story about multifaceted, REAL people  rather than of good and bad people  something which very much adds to its uniqueness and remarkable appeal. Also, although very much being an action-packed series featuring numerous amazing stunts (which are remarkable in themselves seeing as this was made long before today's computer animation, green screens, and so forth. Thus, behind every one of those endless guys falling off castle walls, horses, and catching fire, there actually is a real person who at some point DID fall off a castle wall or a horse or catch fire), there is always amazing dialogue going on between the different characters in each episode. In the final analysis, however, it is generally the series' baddies  Nickolas Grace as The Sheriff of Nottingham, Robert Addie as Sir Guy of Gisburne, and Philip Jackson as The Abbot Hugo de Rainault  who get the very best lines and who more than often steal the show with their arguments full of wit and cant. \"It's a wedding, not a celebration!\" is just one of their many timeless \"pearls of wisdom\" which seems to follow one through life :-).20 years after the fact, it is indeed hard to believe that Robin of Sherwood was originally something made for television  and apparently not with a great deal of money  in order to provide fleeting Saturday afternoon amusement for small children in Great Britain. Filmed in beautiful locations, with clever, amazing scripts and featuring remarkable stunts and fantastic actors  many of whom give the performance of their lives in this show  this in numerous ways seems to be more professionally made and have more production value than many a Hollywood film.","This version of the Robin Hood myth added so much to the original, it must be the definitive adaptation. Full of nature, earth and greenery, and steeped in the spirit of the forest, this Robin is a real hero. A mystical edge and a sinister atmosphere give a uniquely original feel, the cast is superb and Clannad's soundtrack adds the perfect final touch. Unsurpassed.","Robin of Sherwood was part of my whole teen years and in a way after all these years and seeing it again on DVD now, it has not lost anything in all these years. My fascination is still there. I have never seen another Robin Hood story that had all these great color effects, the castles in the mist with red filter, the atmosphere it created. And for sure it is a series that tried to show how it could have been at that time, no beautiful styled castles, but you see the dirt and the fog in it. It has its own charm, and for me will always have. The mystical elements and also the two stories of Robin Hood that are shown here (Robin of Loxley and Robert of Huntingdon)have never been shown that way again. I love both Robins but personally I prefer Jason Connery as actor in this role.","This is one of my favorite series, all categories, all time.I was fortunate enough to get a hold of the whole series on VHS a few years ago. I loved it when I saw it back in -91 -92, when I was about 12. I love it as much, or more, today, which is remarkable considering my (hopefully) improved film appreciation and criticism skills. Most of the movies I liked back then I'm not that fond of today, besides for the nostalgia factor. That factor is present here as well, but there's so much more to Robin of Sherwood than nostalgia.There are only a few bad things about this series. First, the picture and sound quality is so-so, at least in the first couple of episodes. Fortunately, it gets better. Secondly, you could have wished for a bit more blood and realism in the fighting scenes, although I know that was not an option in this case.So, on to the good things! And there are a lot of them. First of all, Michael Praed IS Robin Hood. I don't think I have seen him in a single role since then, which only strengthen this fact for me. He delivers such a believable performance as Robin. Jason Connery had an impossible task replacing him. The fact that Michael Praed hasn't become a bigger name as an actor is unbelievable. Or perhaps that was his fate, to do this one role perfectly, then disappear.I love Nickolas Graces Sheriff of Nottingham. He is really not a complex character, but totally rotten. The relation between him and Gisburne is just hilarious. Actually, just looking at de Rainault sitting in his throne, bored, glaring, makes me laugh even before he has said anything. Another actor that deserves extra praise is Ray Winstone as Will Scarlet. You can really feel the sadness inside of him as well as his hate for the soldiers who killed his wife. Winstone is an actor that finally has gotten his well deserved Hollywood breakthrough (in films as The Departed and Beowulf). There are a lot of other great actors here, too.I love the portrayal of the Robin gang. They are having fun, playing, laughing, you really get a feel of the camaraderie between them, the closeness that comes from a tight bound group such as this. Those bonding scenes are so important.I think that it being UK produced with British actors really made it better, compared to for example the -92 feature film version with Kevin Costner, that just feels fake, fake, fake. (Christian Slater as Will Scarlet, come on..) The cast being able to speak English with British accent makes it more believable, and I get the feeling that the actors, as well as the director and writers, behind the series can put themselves much more into the shoes of the Robin Hood gang than an American crew could have. The music is wonderful, Clannad is perfect for the feel of the series. The music is another of those things they just nailed.An exciting addition also is the fantasy and magic spice that is put in there. It's not over the top, but believable and just makes the whole thing better and more interesting. I also love how nicely the mix of comedy, adventure and drama is blended.Those are a few of the things that makes this series so alive and so genuine. It's by far the best Robin Hood version I have ever seen. I won't wrap up with the \"Nothing's forgotten\" quote. But one thing that never will be forgotten, for me, is this fantastic Robin Hood retelling. See it.","An HTV (ITV) production that has stood the test of time very well, and one that even the BBC admired in its day for its high production values.This was a magic series, especially during the Michael Praed seasons (1 & 2), as the cast and crew really got along well both on and off screen. The chemistry shows in the interaction between the characters, with the acting coming across as natural and not strained.Combine this with beautiful locations, well written plots and the inimitable Clannad theme and support music and the basis for a cult classic is made.This is one of the shows that few will ever tire of watching, and for many, forms the definitive version of the Robin Hood legend.Michael Praed was in his early 20s when he did this role, and he really put his stamp on it - it is doubtful if anyone else can or will command as much on-screen presence as he does playing this character.  When he departed the series at the end of season 2, he did so in a way that probably furthered his fan following.  Pity then that he did not find many meaty screen roles after doing Robin Of Sherwood until the recent 'Secret Adventures Of Jules Verne', although his stage performances in 'Aspects Of Love', 'Carousel' and others confirm his inherent talent.The rest of the cast also deserve mention, particularly Nickolas Grace as the Sheriff and Robert Addie as Sir Guy, the hapless fall guy throughout the series.  Guest stars read like a who's who of British drama, thus reinforcing the fact that Robin Of Sherwood was a mover and shaker in its day.  It remains so today.Thankfully, the Praed series have now been released on DVD and many be pucrchased through Amazon UK, making them accessible to a whole new generation of viewers.","Fantastic series, one of my few favorites (Miami Vice and Tour of Duty are the other two, and this series is right up there with them).These guys aren't into wearing frilly tights - they dress more like woodsmen. Everything about this series breathes an aire of realism, artistic license or not.It paints a picture of a Europe only slightly out of the grasp of paganism, as most of the villagers still have their local deities, and there are Satan worshipping nuns, and magi, witches and sorcerers casting spells.However, what comes to the fore most, is that it's a series of it's time. Rather than the version of the fifties, which was a lament against centralized government and the McCarthy era persecutions, this series is thoroughly grounded in the 1980s, Thatcherist bleakness, and has a strong environmentalist leaning. Robin's protector is a nature worshipper called Hern The Hunter, who often appears wearing the head of a deer, and is a personification (as is this Robin) of The Green Man, an alternative version of Osiris (the Egyptian god of vegetation and resurrection - it is interesting to note that in these series, Robin In The Hood isn't a person, but a concept; when the old one is killed, a new one is summoned telepathically by Hern - the person may die, but Robin In The Hood will live forever, hence the concept of resurrection).The music and score are really outstanding, and performed by the Irish formation, Clannad. When watching it, I couldn't help but think how _boring_ authentic medieval Anglosaxon folk music would have been. :-)All this is beautifully shot in the lush forrests of Wales, which pass for The New Forrest.The only down side is that in the initial episodes of both series, the actors have to overcome their own skepsis, and convince themselves that this really is a serious work. After that, they get into it and the acting is great! Michael Praed as the first Robin (the second is played by Sean Connery's son, Jason), Judi Trott makes a beautiful and fragile redheaded Marion, Phil Rose as the portly and really kind-hearted friar Tuck, Ray Winstone as the volatile and lovelorn Scarlet, Clive Mantle as the giant shepard Little John, Peter Llewellyn Williams as Little John's bumpkin friend and fellow shepard, and Mark Ryan as the ex-Hashashin/Assassin Nazir - all of them giving great performances. Also great are the steady Bad Guys, Nicholas Grace as the bug-eyed, scheming Sheriff of Nottingham, and his aristocratic, bumbling sidekick (and Robin's half brother, as it turns out) Robert Addie as Sir Guy of Gisburne. Really cool too is fashion designer Richard O'Brien, as the evil Lord Owen of Clun's (Olliver Cotton) magician Gulnar (he appears near the end of the first series and later in the second).The Tithe Barn in Bradford on Avon stood in for the Sheriff's castle. (Check it out on bradfordonavon.co.uk under \"places of interest\".)So, if you're at all into mythology, the Middle Ages, romanticism, don't waste your time on Xena or Hercules - this is the real thing, so go out and watch it!Alex","This is THE best fantasy series ever, particularly the first two seasons which are flawless. The scriptwriting is beautiful, the performances never bettered- Michael Praed is the most charismatic Robin Hood yet, and Judi Trott's Marion is head and shoulders over all others, but the acting laurels have to go to Ray Winstone as Will Scarlett- watching his intense performance as a man on the verge of psychosis really drives home the fact that Christian Slater was a pale imitation of him. The direction is, perhaps, consistently better than any other series, and that music...Above all, it is the fact that it is the only programme that I watched as a kid that seemed BETTER when I saw it as an adult. If there is one TV series that deserves to be released on DVD it is this one.","I agree with all the previous comments concerning the quality of this excellent series. I enjoyed it when I saw it for the first time more than 20 years ago and I have enjoyed it just as much on seeing it again now. However, I can not offer equal praise for the NTSC DVD set from Network. The audio is fine though limited to a Dolby Surround presentation. 5.1 audio would have been nice. Still the audio shines compared to the video quality. I understand (from the commentary track) that the series was originally shot on 16mm. That does mean it will never look as good as a movie shot on 35mm, but there is no excuse for the extremely poor digital transfer that Network has made. The picture is full of grossly obvious digital artifacts (primarily \"blocking\"). This is due to poor compression encoding, not the source material. I have a better quality transfer that was made from the 1950's Richard Greene Robin Hood series, purchased on a DVD that cost one dollar. The source material for Robin of Sherwood couldn't have been worse than that but the DVD looks worse. I don't even see how this can be blamed on trying to squeeze too much on to each disc. Three episodes plus another hour of bonus materials is not much more than the four episodes on each disc in a Star Trek set and the quality of those is excellent. The DVD set does provide an eclectic and engrossing set of bonus materials. That and the high quality of the series are enough for me to recommend the DVD set, but be warned that the video quality is not up to current standards (especially for a set that will cost about $200).","Robin Of Sherwood was a great series filmed by HTV, the regional television company for Wales and West England - much of it on location at various points around the West of England, including my home city of Bristol. One popular filming location was barely 2 miles from where I live and when filming had finished one or two items from the set were left there for quite some time e.g wooden bridges over rivers before being taken away so the public actually walked over them including me. Makes me proud to live where I am. I think one \"wooden bridge\" remains to this day.","Probably the one of the most well-known quotes from 80s TV: \"Nothing's forgotten. Nothing is ever forgotten\" 'Robin of Sherwood' took a timeless legend, wrapped it with elements of other myths and legends that would have been known in that historical era, tapped into the real history of the time, and gave us something truly magical. We had full characters, not just the good good vs the bad guys (Robert Addie's Gisborne was a bully...but an intelligent one, and a character you could actually feel sorry for at times)The acting, the stunts, the directing and the camera work ALL combined to make it what it remains even now: The GREATEST retelling of a wonderful story.","This series has a truly mythic feeling to it.  Michael Praed and Judi Trott in particular are wonderful as Robin and Marion, but all the actors are superb.  Ray Winstone has gone on to win laurels for his work in independent British cinema, and his brilliance is fully evident here.  Nickolas Grace is splendidly unpleasant as the Sheriff, and Robert Addie is deliciously foul-tempered as Sir Guy, coolly sexy in his period Norman armor.  An aspect that lures me back to keep watching is the dramatization of Herne and the imaginative attempt to guess at what life in a pagan enclave, in a land dominated by a colonial Christian power, would have been like.The one element that I personally find jarring is the Clannad soundtrack.  I do enjoy the music on its own but would have preferred something along the lines of David Munrow's Music of the Crusades album which was recorded in the early Seventies and could have been used for this series.","RoS is my favourite series of all time; everything that needs to be said has been said, and really I just wanted to bore, er...share. I had just left home and was living in a bedsit in Clifton, Bristol. Every Saturday evening my friends would come around and we would watch that week's episode and then repair to the pub to discuss it and laugh at the amusing antics and dialogue of the Sheriff and Guy. The series was mainly filmed in Blaise Woods (woodland scenes) and Vassels Park (village scenes) in Bristol in the South West of England (although the extended Demons episode was filmed in Cornwall) and I recognised many of the locations whilst watching it. Some years later I would take my dog Cedric through the same woods and think about the series as I walked through the still recognisable locations (The remnants of the village were still visible in Vassels Park). Sometimes I would see Phil Rose (who played Friar Tuck) in a club I used to frequent on a Friday or Saturday night called The Alexander Club (now renamed The Luna Club) in Clifton Bristol.Perhaps I should organise tours of these locations for the faithful; just like many towns have ghost walks or history walks!!! I have the full series on DVD and play some of the episodes every now and again; I always have to watch 'just one more episode'!","When this series first came out on DVD I almost killed myself getting it off the shelf. This has a special place in my heart as I love not just the premise but the music. Clannad were right place perfect timing for this 80s Gem. I remember watching this with my late grandfather who was a massive fan too and inspired most of what I have achieved in life. The story is simple really Robin of Loxley and his band of merry men (and woman) outwit the sheriff of Nottingham and Sir Guy of Gisborne, on many occasions. The lead played by a young in his element Michael Praed is just perfect. A young Ray Winstone (who based his character on a football hooligan) is superb and adds the soldier that the merry men needed.The rest of the band slot nicely into place. The irony of the story is of course that although a saracen is one of the merry men since this version, in reality there is no mention ever of a saracen in any of the stories. The one thing that I always feel saves this production is that the acting is very good standard, just my opinion of course. I love the premise of being Herne the Hunters son and once called you are it basically, also the fact that in theory the mantle passes from son to son so never dies. Quite clever and a battle you cannot win. I am a leaf driven by the wind......... Please watch and enjoy a superb series.","To quote Jason Connery and Mark Ryan on one of the many DVD commentaries, that \"wobbly music\" over the HTV logo was enough to get me jumping from whatever I was doing to glue my face against the screen for an hour. The individual stories contained within the series were excellent and the character development was wonderful. Robin of Loxley goes through a very convincing journey over the two series he appears in, even though his departure from the programme was unplanned. Marian also develops her relationship with both of Herne's sons very well.After languishing for many years in TV wasteland, I re-encountered the series on Sky 1 in the UK in the mid nineties and was even more impressed that the series seemed even better than I remembered. This is no children's television programme, it deals with witchcraft, treason, rebellion and injustice. And, it manages to do it without showing too much blood. As far as I can recall, you only see a bit of the red stuff in the Pilot film (Episodes 1 and 2 on the DVD set). The DVDs are great, containing a wealth of extras including cast commentaries on Series 3 only (the Jason Connery Robin) and crew commentaries for Series 1 and 2. The picture quality is very good and the remixed and remastered surround sound is amazing.The idea of freedom is important, freedom prevails. Nothing's forgotten. Nothing's ever forgotten.","By mistake, I ordered a series from the BBC, their new version of Robin Hood. Very disappointing in comparison with RoS. Terrible costuming and backgrounds. While I enjoyed the Sheriff, who took cues from the Nick Grace character, the rest of the cast left much to be desired. As a \"for instance\", Marion's costuming looked suspiciously like it came from Walmart. And Sir Guy, well, he looked a bit like a character from an outer space movie! RoS has stolen the spotlight, probably forever, in the telling of this tale. Cast, costuming, story lines, scenery, filming and soundtrack by Clannad are all superb, as is evidenced by all the continual feedback some 26 years on. RoS is a timeless classic. My thanks to all who made the series.","This HTV series is beautiful. I strongly recommend watching the movie. It has got everything it should: remarkable script, strong characters, beautiful scenery and exceptional atmosphere. Add some ambient score from Clannad and you receive unforgettable picture. I love every adventure movie from HTV I saw: Return To Treasure Island, Smuggler, Adventurer, but Robin of Sherwood beats them all. I would like to thank the whole HTV production team and Richard Carpenter in particular for giving me plenty of adventures and excitement. I have got the DVD release in my little movie collection. I regret very much movies like these are not made anymore.","What can I say? This is the best Robin Hood on film, bar none.  It combines deft characterization, superb casting and realistic sets and backgrounds which meld with a haunting soundtrack to create a show guaranteed to visit the viewer's daydreams for days afterward.  What drew me at first? The fresh way in which it retold the old legends. (Well, that and Michael Praed, I must admit.)The Merries seem to care about each other, and work as a team. When did Costner's crew ever do that?  Everyone developed, even over the course of the pilot episode, even Guy of (BOO!) Gisbourne. If you like your Robin Hoods handsome and mystical, your Marions courageous, and your Merrie Men resourceful, try \"Robin Hood..The Legend.\" (1983-86)","Some people don't appreciate the magical elements in ROS,but they are what sets this series apart, that and the fact the producers actually decided to dress the actors in proper period clothes and armour--not anachronistic feathered caps,multi-coloured tights and plate armour!But I am really writing to comment on an earlier poster's article. Um, Michael Praed did not leave ROS to do Jules Verne! There are 15 years between these two series. Yup, I agree and Michael might well agree too that leaving ROS was not a good move--but it was a coveted Broadway role that tempted him in '84 and then Dynasty with its megabucks paychecks....","'Nuff said!OK I will say more! Like, I am always amazed at how vibrant and fresh the show remains, even today and its pagan and environmental themes as well as its social justice themes make it more relevant than ever in today's world.The cast is superb: I never tire of watching and re-watching this show. Quite simply, one of my favourite TV shows of all time. Like many fans, I just wish they made more.My dream is that somewhere in a vault they have some additional scenes/unused footage which can one day be incorporated back into the episodes to extend them. Who knows, perhaps this might happen one day. I can always dream!Doug"],"review-user":["artisan-4","richard_k_johnson","Isis-16","schogger13","DarthBill","Ayame","ManOnTheStairs","chuffnobbler","white-wolf","david_hagstrom","sgpfan","Alex-372","SC-14","spacecadet2041","martynhicks","anndamiana","Gothick","daver6","Kelchubordnor","kjm020","grammymember","a-lazowski","branagh fangirl","hodekin2000","douglas-eckhart"],"review-date":["19 May 2004","21 September 2004","26 May 1999","8 October 2002","1 August 2003","16 August 1999","28 April 2006","4 August 2002","25 November 2002","21 July 2008","14 July 2002","28 September 2000","1 September 1999","12 July 2004","9 January 2001","17 April 2006","18 October 1999","19 March 2015","27 December 2010","22 August 2006","24 April 2009","23 February 2008","16 March 2000","31 July 2007","21 June 2005"],"review-rating":["10","9","9","10","10","10","10","10","10"],"review-title":[" The best retelling of the Robin Hood legend - ever!\n"," The Definitive Robin Hood\n"," Nothing is ever forgotten!\n"," Some Old Pearls Don't Ever Lose Their Shine\n"," Jason Connery VS. Michael Praed\n"," This is the one to watch\n"," Timeless Escapism\n"," A very special TV show.\n"," fantastic series\n"," Is this the spirit of England?\n"," A Real Cult Classic\n"," Fantastic Series...\n"," Magical mystery tour\n"," Superb series but flawed DVD set\n"," Location filming\n"," Nothing's Forgotten\n"," Herne is alive, and magic is afoot!\n"," No need to watch any other Robin Hood series, certainly not the dreadful PC BBC remake\n"," Nothings Forgotten.......Nothing's ever Forgotten\n"," A Legend\n"," absolutely smashing version and well acted!\n"," #2 on my personal favorite movies chart.\n"," Robbing the Rich Has Never Looked So Good.\n"," the only decent Robin Hood.\n"," The best version of Robin Hood legend ever... period!\n"]}