{"review-url":["http://www.imdb.com/title/tt0046057/reviews"],"review-text":["A woman and her aunt go to Scotland to locate her evasive fiancé. This is a much-maligned film because of its denouement, but up to that point, it's interesting, well-acted, eerie, and with fine set design (by William Cameron Menzies, developed for 3-D projection). Veronica Hurst is captivating and genteel, sort of a chic British Marilyn Monroe, still in love with Richard Carlson, who is hiding a family secret in his forbidding castle; there are even bats in the belfry! It moves leisurely until the final extraordinary set-piece, when Hurst and her aunt (Katherine Emery, also the narrator), sneak out of the castle in the night to venture into the maze (pre - \"The Shining\" - 1980) and find what they're looking for in its center. As a kid, I always remembered this sequence - there's nothing scarier (or claustrophobic) than not finding your way out of a 10-foot high maze of hedges. Naturally, the two women get separated, setting the stage for engrossing suspense with horrific music. The final result is mildly disappointing really, since Carlson's epilogue {a \"Psycho\" (1960) style postscript} makes some sense to all the goings-on, even provoking sympathy. Worth seeing.","I remember this film of old. It's a great, chilling, atmospheric horror picture about a man who moves into a Scottish castle, only to discover that there are strange goings-on in the corridors at night. And there are even stranger events taking place out back, in Hollywood's most familiar hedge maze. Yes, this is the maze you've seen in every feature-length film that ever involved a topiary puzzle, up to and including \"The Shining.\" But the punchline to this story is about the last thing you would guess. I certainly didn't see it coming. This is a fine example of how good and convincing a movie can be even when the premise is utterly loopy, bordering on laughable. I'd recommend it to anyone.","Is this a good movie?  It's hard to say -- but in 1953, for many people, it was a remarkably effective movie, suspenseful, scary and then, amazingly, actually touching when \"the old gentleman\" meets his unhappy death at the end of the movie.Yes, what lurks in the Maze turns out to be something of a surprise and, for a lot of people, a hilarious one.  But the basic idea (ontogeny recapitulates phylogeny) was a very real one at the time the book was written, and does have some basis in fact.  Not that it would ever result in what we see in the movie, of course.But working on what must have been a very low budget, one of the greatest production designers -- and the person for whom the term \"production designer\" was invented -- creates a very eerie mood that was strangely compelling.  At times, of course, the movie is very silly, but it has its moments.","I recently saw this film at a 3-D film festival in Hollywood. It was in polarized 3-D (Gray glasses not red & blue) It was so much fun to watch this film with an audience, the print was excellent and the 3-D perfect. The performances were over the top and that added to the fun, the surprise ending (that we aren't supposed to share with fellow movie go'ers, at least according to the movie trailer and poster) had people howling with laughter. By today's standards this is probably more comedy than horror but with the added dimension of 3-D (complete with cobwebs and bats coming out of the screen) this film was an entertaining romp into 50's horror.","The basic premise of this film with its spooky old castle and an aristocratic family with a skeleton in the closet was a popular theme of films in 30's and 40's (THE OLD DARK HOUSE, AMONG THE LIVING,and THE UNKNOWN are a few examples.) The basic plot was probably considered old fashioned or at best \"quaint\" by the 1950's when this film was made. I agree with those who suspect that because Maurice Sandoz novel on which this film was based contained a bizarre science fiction twist, this film was made. Instead of an insane twin or assumed dead relative hiding from the law for some unspeakable crime, we have a phylogenetic freak! I think to like this film one must have a taste for offbeat fantasy. If viewed in  the right frame of mind and one is willing to suspend their dis-belief, this can be a very enjoyable film. That being said, this film has many faults. The most obvious being that of the often intrusive narration by the \"Aunt.\" Richard Carlson tries hard, but his performance is not up to snuff. Then there is the \"frog.\" In most scenes it is shown only in the shadows and in brief glimpses its okay, but at the end when it goes (no pun intended) hopping mad and jumps out the window it looks silly. While this sequence I'm told by those who have seen this film on the big screen in 3D is rather startling, shown flat or on T.V. is laughable. The \"frog\" looks like a bad rubbery prop. However even with todays high tech special effects, I don't think a giant frog could be made to look scary now matter how hard anyone tried. While \"the maze\" of the title is interesting and give indications of Menzies design genius, most of the castle consists standing sets left over sets from previous films. A SIDE NOTE: The science fictional premise of this film is based on the theory of phylogeny. That is that the human embryo goes through stages just like in evolution; a fish, then an amphibian, then a reptile, then a mammal. Sir Roger, the man with body of frog and the mind of a man, stopped developing at the amphibian stage. However according to the theory, the embryo resembles a neotenic salamander and not a frog. May I also add that this theory taught as written in stone in all biology textbooks, has been mostly discredited in recent years.","The Maze is directed by William Cameron Menzies and adapted to screenplay by Daniel Ullman from a story by Maurice Sandoz. It stars Richard Carlson, Veronica Hurst, Katherine Emery, Michael Pate, John Dodsworth and Hillary Brooke. Music is by Marlin Skiles and cinematography by Harry Neumann.Scotsman Gerald MacTeam (Carlson) suddenly breaks off his engagement to Kitty Murray (Hurst) and moves to his recently deceased uncle's castle in the Scottish highlands. Kitty wonders why and decides to travel to Craven Castle with her auntie Edith (Emery). Upon arriving they find Gerald a changed man, prematurely aged and acting in a most peculiar way. Just what is going on at this mysterious castle? What is the secret of the big maze out in the grounds?One of the early ventures into stereoscopic filming, The Maze is a delightfully off-kilter movie. As pretty much anyone who has seen it can attest, the ending, the culmination of great building by Menzies, is so far off the scale it borders on the preposterous, and for many it ruins the picture. Certainly myself had to rewind to check what I had just seen, for I felt like I must have nodded off and slipped into some sort of bad liquor induced dream!That said, for an hour this is a triumph of atmospherics and set design. Menzies and Neumann cover the story with foggy exteriors and murky shadows, while the interior of the castle is a classic case of Gothic horror textures, with Skiles' musical accompaniments are perfectly evocative. The narrative smoothly moves along with the air of mystery hanging heavy, where the visitors to Craven are locked in their rooms at night, thus at night from the gap under the doors of the bedrooms a slow moving shadow is glimpsed roaming the corridors. What is it? What is it in the distant maze that is shuffling around? Leaving weird footprints around the grounds?The characters are a stock group for the story, with intrepid girls investigating, shifty servants (naturally), well intentioned friends and lord of the manor harbouring a secret. Menzies fluidly uses the castle and grounds for atmospheric effects, neatly placing the characters within the palpable sense of dread and tragedy, and there truly are some striking scenes, especially the build up sequence to the revelation at film's climax. Then it's that ending...On reflection the makers missed a trick, the chance to really create a terrifying shock, but you have to say it's also a product of its time and budget. And whilst I understand fully the groans and laughs that derail what has gone before, there is a sadness right there in the reveal, a touching tragedy that bears thought even if the ludicrousness of it all is practically impossible to forgive. 7/10","Gerald (Richard Carlson) and Kitty (Veronica Hurst) have just finished celebrating their engagement announcement in France with family and friends, when he receives a letter asking him to visit an ancestral castle located in Scotland. Gerald's uncle reportedly has fallen ill and has requested Gerald, the sole heir, be present. Gerald goes off to Scotland, leaving his future bride behind. A few weeks pass and he doesn't come back. Concerned, Kitty sends out telegrams but doesn't hear back from her fiancé. Four more weeks pass and Kitty finally receives a weird response from Gerald, calling off the engagement and telling her to move on with her life. Not ready to give up on her relationship and looking for answers, Kitty hops on a plane and decides to pay Gerald a visit. Accompanying her on the trip is her level-headed aunt Edith (Katherine Emery, best known for her starring role in the classic chiller ISLE OF THE DEAD). When Kitty and Edith arrive at the MacTeam estate they immediately suspect something strange is afoot. For starters Gerald seems to have aged twenty-years in a matter of weeks. Secondly, this once nice and charming guy has turned into a complete jerk who repeatedly demands they leave the castle and never come back. When Edith comes down with a mild cold, Kitty uses it as an excuse to stay there to try to get to the bottom of things.Why is Gerald being so cold and cruel to the woman he was just about to marry? Why is Gerald so opposed to having company? Why do the house rules state that guests must be locked inside their bedrooms at night? Why are guests forbidden to enter certain areas of the estate, such as Gerald's bedroom and a large hedge maze out back? And what's making those strange dragging noises every night? These are just some of the questions THE MAZE poses. The movie actually does a fine job building up mystery and intrigue. You genuinely become interested in what's going on and patiently await the resolution to explain the weird events that are taking place. And then IT happens... I definitely don't want to ruin the finale of this film because you're better off not knowing, but it takes one of the most unbelievable and jaw-droppingly strange turns I've seen in any movie. It's wonderfully ludicrous in a way, but it also takes a pretty solid little b/w mystery and sends it straight into Z-Grade schlock territory. And yet, this ending seems so out of place, you're not likely to forget it once you see it.Despite the ending (or maybe even partially because of the ending), I really enjoyed this odd bird. It's extremely talky and slow moving for the duration of the run time, but it managed to keep my interest throughout. Director William Cameron Menzies (who made the much more famous INVADERS FROM MARS the same year) is best known as a two-time Oscar-winning art director and his set designs here are also really interesting. There's almost a silent movie feel at times, with model work for some of the exteriors, some painted backdrops and sparsely decorated interiors with very high ceilings. As with any good castle set there are also secret passageways and long staircases. This one also throws in a few rubber-bats-on-strings for good measure.A few of the actors are a little stiff and awkward, but I liked most of the cast. Hurst is one of those obscure and mostly unknown actresses who unfortunately never seemed to catch on despite being both beautiful and talented. Emery, who also gets to play narrator in framing shots at the beginning and end of the film, is decent enough as the overly mannered and cautious aunt. My favorite however was Michael Pate as the silver-haired sinister servant who does this hilariously upright zombie walk every time he ascends the stairs. Also on board in smaller roles are Hillary Brooke (who played the title role in the Sherlock Holmes mystery THE WOMAN IN GREEN) and Lilian Bond (Whale's THE OLD DARK HOUSE). Of course Carlson also starred in IT CAME FROM OUTER SPACE, CREATURE FROM THE BLACK LAGOON and some other horror flicks, so you've got yourself a pretty decent cast for genre fans right there. I say check it out!","You have to admire Richard Carlson. He was reliable, almost handsome, had an MA from the University of Minnesota, wrote novels and plays, and projected intelligence, boldness, tension, and earnestness that were perfectly suited to the unusual subject matter of hi later career. He was an exceptionally unexceptional actor but he was THERE for you.The opening is a brief flashback to a mysterious event in a 17th-century Scottish castle. Then a shot of a pleasant lady speaking directly to the audience (originally in 3D) and introducing us to the story we're about to follow. I like the lady too. Katherine Emery is Aunt Edith, and she had a pleasant, relaxing smile and I believed every word when she explained, \"I guess it all started with an engagement party at Cannes, on the Rivera.\" She continues to do the voice over for the rest of the film. Dissolve to Carlson and a few others at a gay nightclub in which an attractive young girl is flung around with abandon by a couple of men in tuxedos. One of the guests, uncredited, is the immortal Bess Flowers, whose entire career consisted of playing uncredited guests. Carlson seems to be enjoying himself immensely. He's engaged to Emery's niece, Veronica Hurst.His holiday is interrupted by a message from that Scottish castle, called Craven. Carlson must fly to Scotland immediately. He's next in line to inherit the castle and the title of Baronet that goes with it. The castle has no modern conveniences -- no telephone, no electricity -- and stands just as it did hundreds of years ago. Still, his fiancée doesn't object, although she muses that \"I suppose I'll get used to being addressed as Baroness.\" (You bet you will.) He does not return. Instead he sends a message to the aunt and his fiancée dissolving their arrangement. Hurst is distraught, as who wouldn't be in such a circumstance? Hurst and Emery travel to Craven Castle to find Carlson put out by their visit. What's worse, he's turned twenty years older in the past few weeks. He reluctantly puts them up for the night, cautioning his sinister butler to lock all the doors. Strange slithering sounds are heard in the hallway. Hurst is resolved to find out what the hell has been going on, and she sneaks out that night and begins exploring the cobwebbed ruins. A bat flies at her, or rather into the 3D camera lenses.It's impossible to know why bats have such a bad reputation. They mean no harm. One night, standing on the lip of the Grand Canyon, I tore a piece of scrap paper into bits and flung them into a floodlight, only to be surrounded by thousands of bats with a dawning sense of disbelief. Two or three of the more adventurous entangled themselves in my hair and I toppled helplessly into the canyon. But two days later they brought me up by mule, bloody but unbowed, still at peace with bats. Anyway, Hurst makes it to a grimy window that overlooks the back yard. There she sees a gigantic maze with dim figures moving through it.The next morning she finds a webbed footprint on the staircase and another in the gravel before the maze. At this point it's beginning to look less like a horror movie or science fiction than one of Edgar Allan Poe's fantasies. Nothing that happens from that point on changes anything.","You know, this is not a terrible movie. It's atmospheric and mysterious and the female lead plays her part well...she reminds me of Grace Kelly. Richard Carlson is always good. The conclusion is creative and imaginative, and unlike some viewers who reported on this movie, I actually liked the ending. Interesting notion. They could only do so much with the special effects back then, but I can look past that. One thing this movie has going for it that too few movies do these days is good-heartedness. There aren't any truly \"bad guys.\" Everybody is acting primarily out of a desire to do good and to look out for the interests of others rather than themselves, and I was left with a feeling of goodwill rather than the typical sense of foreboding and doom that so often is the central theme of movies like this one right to the end. A waste of time? No, I wouldn't say so. I'd say it's worth a watch.","\"The Maze\" is a lot of fun and a great example of a certain type of B-movie. It has remained firmly stuck in my mind for two reasons:First, the ending is just totally bizarre and out of left-field. Some of the other reviewers have mentioned it, but I don't really think that they have conveyed just out strange it is. I never saw it coming. It's also hilarious, though the movie plays the situation with a straight face.Second, once the movie ended (and it actually wraps up very quickly once the \"solution\" is presented), I could not help but start thinking about what had been said. For one thing, the Baronet describes the original master (who is basically a 203-year-old giant frog...seriously...not somebody with a frog-like face, but a real frog) as enjoying the chance to take off his cloak and swim in the pond. The whole frog with a cloak image still sticks in my mind. Then there's the question of how the frog manages to convey his wishes to the servants and his heirs, since he apparently runs the place. And why do the heirs all die at a relatively young age? The stress of caring for their great-great-great-grandfrog? Inquiring minds like mine want to know. In short, this film leave a lot of unanswered questions. Don't miss it.","The Maze (1953)** (out of 4) When her fiancé Gerald (Richard Carlson) leaves before their wedding with no real answer, Kitty (Veronica Hurst) and her aunt (Katherine Emery) follow him to his family's estate in Scotland. Once there the women discover that Gerald has aged for some reason and soon they realize that there's even more family secrets. THE MAZE is a hard film to judge because it contains some very good stuff but the problem is that the story itself is just boring and really drawn out for no good reason. The film features some terrific performances as well as a haunting atmosphere and these here make it worth sitting through. Director William Cameron Menzies (INVADERS FROM MARS) does a wonderful job building up the creepy atmosphere of the old castle. From the opening shots of the fog thick outside to the staircase with all the spider webs. The director really makes one believe you're in this location and he also puts the maze (much like the one later seen in THE SHINING) to good use. He also handles the B&W cinematography very well as the film looks terrific and the use of shadows is well done. Carlson turns in a good performance in the lead and I though both Hurst and Emery were good. The supporting players are good as well so with all of this what's the problem? The screenplay is incredibly weak and it just doesn't go anywhere. Gerald asks the women to leave. They tell a lie to where they can stay an extra day. They discuss what could possibly be happened. These three steps repeat themselves over and over and it's just really boring. I won't give away the secret but when it's finally revealed you really can't help but laugh. The effect of this reveal is also rather laughable. The film was originally shot in 3-D but watching the standard version I really didn't see anything that would really jump out. THE MAZE is an interesting film with a lot going for it but sadly most of the good stuff was just wasted.","The story is somewhat ordinary: \"haunted\" Scottish Castle, mysterious comings and goings, morose servants. Two women saying \"I wonder where that door leads to.\" It turns in a bit of an unexpected direction, but all in all, the story and acting by themselves are worthless.What makes this a recommended film is the way it is layered, its careful architecture. The reason is because the director was in fact a celebrated set designer/production manager. He thought in terms of spaces. More: the thing was filmed in 3D. I did not see it that way, but the layering, the sense of containment was rare, and thrilling.Readers often ask me about my notion of \"architectural\" films and I reluctantly send them to Welles' \"Othello.\" But that film has other mysteries woven into it. Here, I have an example that is essentially pure.One narrative device should be mentioned. We have a narrator that frames the thing, the way Ronald Reagan used to frame that TeeVee show presented by General Electric, and Hictcock did his show. She has the same manner, but herself is located spatially.Ted's Evaluation -- 3 of 3: Worth watching.","I grew up in the days when \"good special effects\" included rocket ships, obviously made out of paper towel tubes with a road flare jammed in them, and paper mache planets. This film was out around then, so forgive the less than incredible props, and watch it for atmosphere.I saw the title of this film on the \"Lovecraftian movie list\", so, of course, I had to check it out. It was a bit like a Lovecarft tale (I forget which), but all in all it was worth a watch.I know I'm harsh on some movie in my other reviews, but I'll cut this one slack due to its age. Hey, all of you older than 20 remember the older horror movies, where there was NO gore, no CGI, no animatronics. Horror was a mood the movie set and the only violence was either only hinted or you saw the shadow of it happening on the wall.I didn't get to see the 3D version of this film, and had to settle for a \"soft\" VHS copy (grainy, over-white and somewhat hard to watch).Still, it gets 1.5 tentacles up on the elder god-o-meter","In all honesty, I haven't seen this film for many years, but the few times I have tend to make parts of it stick in my memory, as anyone who has seen it will understand. I first saw it as a child at a YMCA Halloween party in the early Sixties, and it scared the hell out of us kids, in a fun way. I remember feeling genuine anxiety about the unknown thing lurking in the maze. I can't risk giving away the ending, except to say that it was surprising, to say the least. I remember vaguely the entire audience of young boys letting out a big scared holler, followed by laughter when the terrible secret was revealed. The ending has been seen by most viewers as one of the greatest unintentionally funny climaxes to a movie in film history, and yet oddly moving, in a way. You have to see it for yourself, which is not easy these days. I don't know if it's available on home video or not, but it would still make a great Halloween feature for both kids and adults.","Kitty (Veronica Hurst) and Edith (Katherine Emery) pay an unexpected visit to Gerald (Richard Carlson) in his castle in Scotland where he has mysteriously shut himself off from the world. His behaviour is very strange and he locks his guests in their rooms at night. Why is there a maze in the garden which is out of bounds? Kitty and Edith do some investigating and alert some friends to come and join them.....This film is entertaining to watch because the characters are annoying. But its the kind of annoying that makes you laugh, eg, Kitty's terrible pronunciation which lasts throughout the whole film. She says things like \"Ketherine\" and \"heppening\" and it is relentless. You have to laugh! Edith, on the other hand, has an equally annoying accent. She is either Scottish and pretending to be posh, or she is affecting a terrible Scottish accent. I'm not sure which one! And then there is Gerald who is just so unpleasant to his guests that it has you laughing at his rudeness! Not to mention his servants who play it up as the \"spooky\" characters. Mix these characters with the film's ending and you have certainly been entertained. I'd like to see it in 3-D.","Moody, atmospheric and beautifully lensed Gothic thriller about an ancestral castle and its dark secret. A man about to be married (Richard Carlson) is abruptly called away to his ancestral estate. He breaks off his engagement to the delectable Veronica Hurst and she and her aunt (Katherine Emery) then travel to the castle to find out what's going on. There is a maze out back and someone or something prowls its corridors late at night. Excellent storyline and quite suspenseful, at least until the shadowy creature is finally revealed. Then it's off to MST3K territory, unfortunately. Up to that point, a very good ride that may remind some of 1960's \"The Haunting.\" The focus is often on Hurst, and justifiably so. She looks terrific, even with her 1950s perm and makeup. Definitely not one of Carlson's best, and the film is largely forgotten today.","For years every time I saw it on t.v.I would get distracted that I did not under stand the story and plot.The only thing that ever bother me was finding out who was the owner of the castle in the highlands was and how it was taken seriously.Now I understand the whole movie.It'a about the build up in the story that leads to this as a result is not really funny at all.The 3d for the first time really brought me to under stand the plot better.How Carlson character has to take off to his uncles castle after his uncle's death and how Veronica Hurst and Kathrine Emory ,who plays her Aunt,a is determining to find out what has happen to him,by taking a risk in going to the castle,to see whats going on,at the protest of her aunt.The Gothic atmosphere of the whole haunted castle and it's property is very effective on 3d ,especially the fog that seems to come out of the screen.The bat scenes as Veronica is spying into the haunted house.As she was able to slip outside of her locked room were not very effective.When you throw an object at the camera the third dimensional affects are weakens as it gets closer.The sound?it's great.In it's restored affects the three channel sound makes the orchestra ,of the back ground music ,fuller,more effective,reinforcing the atmospheric quality of the film.Where Kitty's friend ,including a doctor that she invites over,to find out what's wrong with her fiances.You got some well know n character,like Hillary Brook,who was in the comedy Abbot and Costello meet Captain Kidd,that same year.Then you got the actress who played the doctors wife,D.r. played by John Dodsworth,played by the one who was in the old Dark house,Lillian Bond, a lot older.Then theirs the strange butler,played by Michael Pate,strange cause the older make up was too theatrical and unrealistic.The comment side of this films,stated that Richard Carlson was wild ,he was married ,but fooled around with other women,although in the interview of Veronica ,now in her eighties ,she stated tha he treated her friendly and under standing .Pate had a problem during the war and had just finish a 5 minute surgery to fix the problem,before getting in the picture.Although the ending may look ridiculous to some,a joke to others.,it's really not.I have to say the book might be better and one should be encourage to see if it's in the library to check it out for reading.This would enhance the interest in the movie.although some theaters off it in non Anamorphic wide screen,it was not shot that way.It' present in its one by three, seven by one ratio.With it's haunting atmosphere,minus the bat scene.The characters,oops! forgot one.Robins Hughes character Richard give an impression that he is trying to impersonate Richard Hadyn.Any how, well worth the entertainment.Well worth the wait.04/22/18","With only two weeks to go before her wedding, a young woman finds herself in distress after her fiancé, a jovial Scotsman, travels to his ancestral estate in the Highlands after the death of a relative...and does not return. The woman's aunt receives a cryptic note weeks later saying the man is canceling the wedding plans, so the girl and her aunt take it upon themselves to travel to the spooky spread and confront him. Perplexing, methodically-paced and oddly entertaining yarn originally presented in 3-D, which explains the acrobatic act near the opening. It doesn't cover all its tracks by the final reel (such as why the Scotsman has supposedly aged 20 years in two months), but the production and set-designs are quite nifty for a B-movie. The cast is solid as well, though the picture could do with a little levity or personality. ** from ****","When the film begins, Sir Gerald is engaged to a lovely woman, Kitty. However, when Gerald receives work that his uncle is dying, he immediately leaves to see the man. Within a short time, the uncle has died and Gerald has inherited the family estate. Here's where it starts to get odd. Instead of returning to Kitty or inviting her to his new home, she heard NOTHING from Gerald. Naturally she's concerned and goes to his new home in Scotland. Surprisingly, he' not happy to see her and tells her the engagement is off and she should go!! But it's late at night and she cannot...so he reluctantly allows her and his aunt to stay one night only...and on the condition they stay locked in their rooms at night! Well, with no further explanation, Kitty absolutely refuses and comes up with excuses not to leave and soon invites Gerald's friends to come and see for themselves what's happened to Gerald. The once nice guy now looks old and haggard and isn't the least bit friendly or hospitable. What IS going on here...and what does the maze in the yard have to do with all this?This film was originally shown in 3-D but I saw it on TV without the old fashioned 3-D. Director/producer William Cameron Menzies does a really good job in keeping the film suspenseful and brooding. You don't know WHAT is going on...but you know it won't be good! The music sure helps with this as well--especially when Kitty and Aunt Edith get lost and separated in that dreaded maze! So is all this wonderful suspense worth it? Well, yes and no. Yes because you'll never guess the awful secret. No, because the secret is incredibly stupid!! But despite all this, the film is so well made up until the REALLY dumb ending that it's worth seeing. And, oddly, the film does feature a happy ending after all! Weird beyond belief at the end...really!","William Cameron Menzies directed an odd bag of films and designed some fabulous sets in his lifetime. As usual, he was working on an uncompromising budget and that, to some reviewers, seems to mean that his talent wasn't somehow up to the task. This is a sorry reward for such an intelligent designer. The script gets in the way at times, admitted, but the sets - and the fabulous musical score by Marlin Skyles - give us so much more than a few laughs from dated dialogue. It's all far-fetched with the explanations at the very end but it builds up nicely, the actors are all on cue, and the lighting alone make it worth the visit. In general, so many of the horror films of the 50s are fascinating to watch today.","The next-in-line to a Scottish heirloom, which is shrouded in mystery, suddenly breaks off his engagement to an American girl; inevitably, but against the baronet's better judgment, she turns up at the forbidding estate to investigate. Distinguished production designer-turned-director William Cameron Menzies (much like his later British counterpart Robert Fuest)'s most notable efforts in the latter capacity were in the Fantasy genre: this is the fourth and least of them and would also prove to be the last theatrical feature he ever helmed. Actually, it is not that hard to see why, since what we have here is more folly than fable – even if the film's overpowering atmosphere (filmed in 3-D) somehow renders the undeniably ludicrous plot compulsive. The cast (including Richard Carlson, Michael Pate and an unrecognizable Lillian Bond – from 1932's THE OLD DARK HOUSE) is not insignificant, but they have fairly little of interest to do or say: the intruding castle visitors do nothing except prowl its sinister corridors aimlessly at night and feign illness the morning after to extend their stay there! There are a couple of intriguing incidents to be sure: the women finding troubled Carlson has gone grey-haired in a matter of months since they had last seen him and once chancing upon a mysterious nightly processionbut, clearly, the film-makers believe that the unique revelation at the end is enough of an ace up their sleeve to bother making anything of them when these occur!","A Scotsman (Richard Carlson) abruptly breaks off his engagement to pretty Kitty (Veronica Hurst) and moves to his uncle's castle in the Scottish highlands. Kitty and her aunt follow Gerald a few weeks later, and discover he has suddenly aged.I had never actually heard of this film before stumbling across it on Netflix. I can see why it might not get a lot of attention -- it does not have any big names actors, or even cult actors, and the writer, director and producer are all relatively unknown these days. This is too bad, though... the film is on par with such stories as \"The House on Haunted Hill\".I am told this film looks even better in 3-D. I can see why it might, with such moments as the bat flying towards the camera. Either way, this film deserves more attention...","I had heard about this film for years and didn't realize until last night that i had inherited a copy from my late friend's collection and it had been sitting on my shelf for more than 10 years.He would type of his VHS video labels - very neat, but tough to read sideways. In this case, he had used VHS tape made by Polaroid and the word \"Polaroid\" was printed in much larger letters than his typed words \"The Maze\", so for years my eyes just swept right by it on the shelf.His copy was taped from some TV station from their \"The 1 O'Clock Movie\". No clue where from.So - that said - it was very disappointing. \"The Maze\" is a great title and I wish more of the action had revolved around the maze. The story was ridiculous and the ending even more so.When the old lady saw the seaweed on the floor, I immediately thought \"Lovecraft\", but when she remarked \"and a bowl of tomahto soup\" I had to replay it twice. Is that what she really said? The blond lead was a total Marilyn Monroe clone (poor man's version) and Richard Carlson looked awful in that \"I am ill or troubled\" make-up.Odd film.ps - Someone had begun to tape RIDERS TO THE STARS after THE MAZE. RTTStars was directed by Richard Carlson, but sadly the tape was stopped.","When Kitty Murray (Veronica Hurst) receives a letter from her fiancé Gerald (Richard Carlson), breaking off their engagement, she travels to his castle in Scotland accompanied by her Aunt Edith in order to find out the reason for his actions.For the most part, The Maze is a routine mystery with a creepy fog-shrouded castle (that has a maze, hence the title), some oddball characters, shadowy corridors, secret passageways covered in cobwebs, and even a couple of unconvincing rubber bats on strings (which might have looked better had I seen the film in 3D, as it was intended).The action trundles along at a leisurely pace, with a good deal of atmosphere but not much in the way of excitement or innovation, and there are some questions that remained unanswered (What happened to the maid? Why has Gerald aged? And why have his ancestors all died young?), but all of this is forgiven come the schlock-tastic and totally bizarre finalé. I'm not going to give away how the film ends - that would ruin the fun - but rest assured that the wait is worth it."],"review-user":["twanurit","eileenmchenry","Erewhon","rhino00711","youroldpaljim","Spikeopath","capkronos","rmax304823","dane-92","innocuous","Michael_Elliott","tedg","ddukart","mlraymond","AAdaSC","ctomvelu1","mmcgee282","moonspinner55","MartinHafer","cstotlar-1","Bunuel1976","gavin6942","donofthedial","BA_Harrison"],"review-date":["28 March 2004","30 July 2005","25 January 2001","25 September 2003","19 May 2001","9 October 2013","3 May 2008","25 December 2015","28 March 2014","22 November 2010","8 October 2012","6 June 2010","12 January 2007","21 October 2006","24 October 2009","14 August 2011","22 April 2018","22 August 2017","23 November 2015","23 October 2015","9 October 2013","24 October 2012","6 May 2010","19 October 2018"],"review-rating":["8","7","7","7","7","7","5","7","4","6","2","6","10","5","6","7","6","6","5","6"],"review-title":[" Creepy and fascinating\n"," Fine Fifties Fear\n"," If you didn't see this in 1953, you have NO idea\n"," Campy Horror with Great 3-D\n"," Like it or not, this is a strange film.\n"," The Horror of Craven Castle.\n"," You're a green one, Mister MacTeam.\n"," Phylogeny Repeats Ontology.\n"," Not as disappointed with ending as some others\n"," Leaves me wondering....\n"," Great Atmosphere and Look but the Story Just Doesn't Work\n"," Teratology\n"," Think of the time it was out\n"," What strange secret is hidden behind the walls of an ancient Scottish castle?\n"," Unintentionally Funny\n"," Haunting, until the end\n"," Finally in it's 3D glory\n"," 3-D thriller involving teratology\n"," Curiosity might kill more than just the cat!\n"," Some Nice Pay-Offs\n"," THE MAZE (William Cameron Menzies, 1953) **1/2\n"," Perhaps a Lost Classic?\n"," Very disappointing film...'and a bowl of tomahto soup'\n"," That ending.\n"]}