{"review-url":["http://www.imdb.com/title/tt0095846/reviews"],"review-text":["The premise of the story is common enough; average family wants out of the rat race; wants to find the simple life....so they move from Sherman Oaks,California to Lake Tomahawk; kids in tow.The lake is beautiful, they have leased an old house....but wait; there may be something in the lake; people are being murdered, and no one knows how (never mind why). Gerald McRaney is excellent, a familiar face for Lifetime viewers; Valerie Harper is also good; since this film was made in '88 maybe the writer should produce a sequel!.You will also enjoy Barry Corbin as the town eccentric, and Darryl Anderson as a Bruce Dern-lookalike/crazed military man.While the story plot is a bit over the top; if you are a movie buff you will be reminded of similar scenarios from \"\"Psycho\"\"; \"\"Deliverance\"\"; as well as other horror stories of that genre. Several camera shots and sequences will give you a sense of deja vu.Sit back and enjoy; if you don't take it too seriously it is very entertaining; and better than, for example the more recent movie:\"\"I Know What You Did Last Summer\"\"; it seems they made better movies in the good old 80's!.","This Is one of those classic American made for TV movies that are just made for watching on a rainy afternoon. Although the script is highly implausible it never takes itself too seriously and neither do the cast which leads to a great tongue in cheek murder mystery / horror film best enjoyed with a bid bag of popcorn or box of chocolates. A big bonus of this film is the fantastic location filming and despite the strange goings on and even stranger residents round Lake Tommahawk I for one would not mind living there!All in all a great film to watch over and over again.","This movie for the most part is just like your normal TV movie. Not incredible acting and for being in the horror genre it would have flopped at the box office, but hey, that's why it's on TV. When I first started watching this movie I never had the intention of finishing it. I left the room a couple times to go do something else but found myself always coming back, wondering, who was it? What was going on? The only complaint I have is that there weren't enough characters to suspect. The creepy factor was great though. I was creeped out the whole time and I was a little fascinated too. I wouldn't fight to see it again but I don't regret sitting there for the amount of time it took to watch it.","Don't think of this movie as a horror movie; as such it would be a disastrous \"1\". It's almost entirely predictable and you've certainly seen everything in it before in movies that are far, far better. Instead, think of this movie as a comedy/parody. If you do so, then it's at least a \"5\" (out of 10).It begins ordinarily enough, but as the movie goes on, watch as Barry Corbin goes farther and farther over the top. By the end, it has truly become hilarious.Some weekend afternoon, when it runs on The Mystery Channel or some other cable/ satellite channel, cue it up and practice your Mystery Science Theater 3000 routine but in the horror genre: You won't be disappointed -- this movie is the Mother of all horror movie Bombs.Atlant","Rachel and Chuck Yoman (Valerie Harper, Gerald McRaney), decided the city is too busy and dangerous for their family, so they packed up their reluctant son (Gregory Togel) and daughter (Tammy Lauren) and moved back to a lake like the one Rachel lived at as a child.They say you can not go home again but this is an ideal rural home with what at first seems like a Mayberry feel. Later the residence seems to be more like the people in Deliverance. Soon bodies start turning up and everybody looks suspect with the exception of a few friendly faces. This does not keep the family from enjoying running around and messing around in the woods.We find that they have to be super ignorant to find the secrets and not tell anyone until they get ax-cepted as the antagonists. Can the ignored young Stevie save his parents or will their pursuer(s) put his/her foot in it?This film is more than most parodies as it was played with strait faces. They could not have chosen better actors and Daryl Anderson was exceptionally creepy. An added plus is that they let us know what is happening before the characters find out, instead of pulling a clue out of the hat after the fact. Anyway this made for TV movie is good for a few laughs.","The best scene of \"The People Across The Lake\" is the genuinely creepy, nightly opening-scene featuring a house, a murder & a lake. After that, it's pretty much downhill from there on as far as the horror is concerned. A family (mom, dad, sister & younger brother) is fed up with the (mildly) dangerous environment of suburbia, and decides to go and live near the titular lake. From then on, the film features too much lame happy family-related doo-doo near the lake, with occasionally some corpses popping up here and there. The couple of scenes where they discover the bodies, are pretty convincing (in terms of creepiness), but they are in shrill contrast with the rest of the goings-on (featuring just every-day-life stuff of the family settling in). The truth to the matters (the mystery as to who's doing the killing) is learned too soon, leaving only the family unknowing and the viewer yawning during the unexciting finale (featuring a discovery in a basement and running around the house), like if this made-for-TV thing suddenly remembered it was supposed to be a horror film. It's not really badly made; the content & story is just not interesting enough. The only highlight in the cast is Barry Corbin, though his performance/character is just a bit too goofy to be taken serious. Blond cutie Tammy Lauren (the daughter) might be a recognisable face for avid horror junkies too, as she also starred in \"Wishmaster\" (1997), and made-for-TV outings like \"I Saw What You Did\" (1988) & \"The Stepford Children\" (1987). She hasn't got much to do in this film, though. Skippable, but watchable, if anything.","Chuck Yoman (Gerald McRaney) and his wife, Rachel (Valerie Harper- DON'T GO TO SLEEP) lead very busy lives, and live in a very secure home w/ their kids, Lisa and Stevie (Gregory Togel and Tammy Lauren). Rachel has had enough of the fast pace and stress, and convinces Chuck to move to a rural house on a lake. At first, all goes well, other than a few backward locals. Then, Chuck decides to take a swim in the lake, and makes a gruesome discovery. Suddenly, he has a very cold swimming partner! He goes to get the Sheriff, but when they return, the evidence has vanished. When the deputy tells a story of several past disappearances, the Yoman's wonder just what sort of place they've moved into. Odd occurrences and more deaths add to the mystery. Can Rachel and Chuck figure it all out... and live? THE PEOPLE ACROSS THE LAKE is a different kind of suspense thriller. It's got a TWIN PEAKS weirdness mixed in w/ the chills. It's a black comedy about family dysfunction, wrapped in a psychological horror story. A nice change of pace for the fear fanatic! Co-stars Barry Corbin in a unique role for him...","Basically the wife wants to move back to the country, the husband is a city slicker and the family has been living in the city. The husband finally agreed to trying to live in the country for one year - if they like it they will stay, if they dislike it they will move back to the city. All that is fine to me. It's after they get to the country it becomes a family adventure for awhile with just a little bit of dead body parts showing up and a lot of talk of murders that have happened but no one knows who did them. The family finds out who - but will they survive? Great casting - about 90% of it is a rather lame film. Just watch the last 25 to 30 minutes of it - that's really the only okay part the rest is a a bunch of hooky. It's a shame too because this had potential to be a good and fun movie all the way though it.2/10","I watched this movie for the first time recently and was quite surprised at how awful it truly is. Have I seen worse? Sure but I won't waste my time watching this film ever again.THE PEOPLE ACROSS THE LAKE concerns a family who decides to give up city life due to the crime and move to the country in the midwest. Unfortunately, dead bodies keep popping up there too.The film suffers from bad dialog and bad acting pretty much all the way through. There are a few exceptions in minor roles as far as the acting, but the leads, including Valarie Harper, were not convincing at all. Add to that silly facial expressions and you've got a real eye roller on your hands. One of the things that surprised me was that although it was implied that the family was moving to the midwest, there were really bad southern accents all around. I guess the director felt that anybody who lives in the country has to sound like someone out of DELIVERANCE. There are some nice shots of the landscape and lake areas, so the scenery is good in places. That is really about all this movie has going for it though. I've seen some reviewers recommend that people watch this as a comedy. For me, it didn't even work on that level. It was just that bad.The film also is a little slow paced, but picks up a bit at the end as the family starts to realize who the killer is. And the killer knows that they know, so the stalking begins. Up till that time though much of the movie is interaction with the locals and family time. And of course, you'll see the mandatory misdirection. There is some suspense towards the end, but not enough to hold anyone's attention.I would absolutely give this one a pass for a fan of horror or suspense.","This was very very hokey. There were things that happened in this film that happened then it went to commercial break and when they returned they were forgotten. I didn't watch the whole thing because I fell asleep and I am glad I did. An easy one to guess through if you can stay that long. I didn't find a minute of my awake state during this movie to be exciting enough to keep my attention. I usually try and stay awake through movies just so I don't miss anything, even if I wasn't happy with what I was watching, but with this one I hoped for sleep. Granted I could have gotten up but the couch was so comfortable and I wasn't in control of the remote. Miss this one."],"review-user":["MarieGabrielle","yankee1924","elena1999","atlant","bernie-50","Vomitron_G","azathothpwiggins","Rainey-Dawn","aztrshbyz","tpiecemanc"],"review-date":["1 December 2005","23 October 2001","30 October 2002","1 August 2004","19 November 2005","15 January 2010","13 August 2018","4 December 2016","19 September 2017","2 August 2004"],"review-rating":["7","10","5","5","7","4","8","2","2"],"review-title":[" If you view it as a comedy it actually works...\n"," Good old fashioned hokum!!!\n"," Creepy\n"," Think of this movie as a comedy.\n"," I almost died laughing\n"," Welcome to Lake Lame\n"," \"Don't Do Anything Stupid!\"...\n"," Not At All What I Was Hoping It Would Be\n"," Pretty darn bad (and not in a good way)\n"," Hokey\n"]}