{"review-url":["http://www.imdb.com/title/tt0084228/reviews"],"review-text":["I agree with both comments above but wanted to emphasis what a fun insanely gleeful movie this is.  Very camp and sleazy.  A movie about being young. Worth viewing for Almodovar and Fanny (Fabio) McNamara's horrendous pop group 'performing' 'Suck It To Me'.  Drag queens worship Fanny and you'll see why.  A sort of Madrid Liquid Sky with humor and a decent plot.  Very cult and very 60's mod.  Pure fun.","This film exhibits Almodovar's true comic genius like no other. It will leave you reeling, and wanting to run about the streets naked while you howl with manic glee. It is truly a maddeningly funny comedy that goes way beyond risque (nothing is taboo in this lunatic-romp). It is so original that you may have trouble excepting its anything goes mind-set at first. The film's madcap style, characters and situations are akin to nothing I've ever seen. You've got to check this one out!","In his two first movies (and I would count the third one too -Entre Tinieblas-) Almodóvar was more a kind of outsider, someone who needed to express himself freely in a country that had suffered a Dictatorship for almost 40 years. Neither \"Pepi, Luci...\" nor \"Laberinto de pasiones\" tell any story in particular, at least none that's interesting. They're rather a collection of gags and sketches that are meant to scandalize and to drive up the wall all that right-winged people. Almodovar uses topics such as incest, gay power, Islamic terrorism, drugs abuse... 100% punk attitude, basically. And though Spain is much more liberal nowadays some of the passages of Almodovar's first movies couldn't be accepted by the society. How come? Well, because of the \"political correction\" stuff (isn't it some kind of censorship too?? I mean, self-censorship).Anyway, this movies have to be understood in the right context (just like John Water's first films). If you don't take that into account you'd better go and watch any other thing.5.5/10","Very typical Almodóvar of the time and, in its own way, no less funny than many of his later works. And why is that? There is nothing to be provoked or shocked about, and I guess any such effect is more coincidental than intentional. No, the great humor stems from an underlying, almost surreal, absurdity that is woven into the scenery: The characters' nearly complete lack of taboo. It's the same kind of 'comic suspense' you find in his later works, though you'll find it in a more rough version here. He's building up for masterpieces to come, but is not yet there.The sole reviewer who commented on this movie before I did, claimed that it had to be a \"very select\" group of people who'd find this movie hilarious. I do.","I was delighted when I saw that my husband rented \"Labyrinth of Passion\". I love Almodovar's films. We both loved the movie. We both couldn't stop laughing. We especially enjoyed the scene in which the transvestite is shooting a photo novel, and while supposedly being menaced by a killer with an electric drill, is told to answer the phone and say, \"I can't talk to you right now, I'm being attacked by a sadistic serial killer. If I survive I will call you back\". (That would make a great answering machine message come to think of it). We also loved the lady telling her new found beloved, \"I went to an orgy after the concert but I couldn't stop thinking of you.\" (I'm waiting to use that line on Twitter). \"Labyrinth of Passion\" is a rollicking farce with plenty of high jinks, hilarious dialog and eye candy for everyone. The film has aged well: the 1980s costumes and hairdos add to the wackiness. I would give it a 10 out of 10 rating but I am giving it a 8 for two reasons. The first is the scene which involves laxatives which includes a shot of a lady soiling herself: totally unnecessary, and it brings down the tone of the film to Hollywood gross-out comedy for a moment. The second is the suggestion that Queti is sleeping with her father: shocking, yes, but again, it ruins the tone of the film. Still, I would recommend the film to anyone who wants a sophisticated, spicy, and fun time.","While some of my friends watched (and were delighted by) the latest movie of Almodovar the cinematheque in my village screened his second movie, made almost 30 years ago – 'Labyrinth of Passion'. A couple of months ago I had seen 'Do You Remember Dolly Bell?' (made one year earlier than the film of the Spaniard) the first film of Kusturica, now this one, and beyond the similarities of the game of identifying in early works the spark of genius of the later great movies there is also an abyssal difference between the two. While Kustirica's movie show the restrains of the censorship his work was subjected to in the still-Communist Yugoslavia, Almodovar's film shouts FREEDOM.Indeed, 'Laberinto de pasiones' is a film that could have been only in 1982 and in Spain. The young director seems to be drunken by the light and colors of a world that just woke up after several decades of dictatorship. His characters live in a Madrid that has become the heaven of all kinds of experiments – in music, in love, in the way people live. There is absolutely nothing that reminds the films of Carlos Saura or Bunuel, the film is made by a young director whose career started with the liberation of Spain, and who celebrates his freedom in making movies and experiments with characters and a social medium on the fringe.Did I already say that watching this film is fun? Just saying that one of the characters is the son of the Shah of (T)Iran who happens to be gay but then is 'cured' by a nymphomaniac named Sexilia – you already got a feeling of the material Almodovar plays with. He also crosses the line to play a gay punk singer in travesty in one of the several delicacies of the film. Sure, there is a lot of trash around, and not all of it is that original, but then you have Banderas playing a gay terrorist who falls for his target before knowing whom he gets in bed with. All the story is told with a kind of detachment that makes you feel the protective smile of the director when looking at his characters and actors.No, this film is not a masterpiece, and if I had seen it by or close to the time it was made I am not sure whether I would have liked it, or identified the huge director Almodovar will become starting a few films later. If there is anything close in genre it is rather the low cost comedies that by that time I would have seen in Romania (later the boorekas movies in Israel). There is however in this film enough craziness and bluntness to break away from the crowd, and a hidden tear behind the laughs that I am pretty sure that could not have escaped me completely.","Reviewing a film is also reviewing the period that a movie was made. And besides that it also said something about the reviewer himself. Laberinto de Pasiones was made in 1982. All kind of taboos were already broken in the late sixties and seventies by directors like Pasolini, Verhoeven en Peckinpah to name just a few. In Spain the situation was different. Until 1975 the country was a dictatorship under General Franco, a strict Roman Catholic. Censorship was common and Spain missed the cultural changes the rest of Western Europe made completely. So when Spain turned into a democracy after the death of Franco the new freedom people enjoyed led to a period in culture where all boundaries were explored. In Laberinto de Pasiones a lot of things are shown which wouldn't be possible under the regime of Franco. Homosexuality, nymphomania and incest are just a few of the practices shown in this film.Of course I was aware of the films by Aldomovar, I have seen Todo Sobre Mi Madre and Hable Con Ella which are excellent movies made by a mature director who understands human nature and is possible to combine drama with humor. I have also seen Atame! which shows the exploration of the sexual behavior of humans more than his later works. But I wasn't really prepared for the overflow of sexual perversions which is Laberinto. Aldomovar provokes here and he is exaggerating. Victims are the plot and the acting. As a viewer you're completely lost in about thirty story lines about people whose only purpose in life seems to be to fulfill their sexual obsessions. The mood of the film has most in common with the kind of movies that are not shown on IMDb, seventies porn flicks and that is not a compliment to this film. It all looks very amateurish to me. On the contrary the movie is not without humor. The scene in the music venue were Aldomovar himself sings a song in drag is really hilarious and probably the highpoint of the film. And it is special to see a young Antonio Banderas as a gay special agent, a role he wouldn't consider these days.So Laberinto de Pasiones is probably an important film to free Spain from some boundaries in their cultural mindset but that doesn't make it a good film. Mediocre acting, a ramshackle plot and the mood of a porn movie prevents this from being an early hint of greatness of this director.","I'm not surprised that more people have not seen and commented on this tragic testament to the real Almodovar, since he would most likely prefer it this way. Laberinto de Pasiones is proof that Almodovar was simply a wannabe Spanish version of John Waters, the latter gaining his mainstream fame from \"Serial Mom\". \"Pink Flamingos\". With campy acting, full-frontal male nudity, incest, drug references and an unhealthy dose of toilet humor for good measure, it's safe to say Laberinto de Pasiones is Almodovar's \"Pink Flamingos\"; an exercise in camp and shock-value over substance.","A camp melodrama/comedy about Sexilia (a nymphomaniac), Sadec (a gay Islamic terrorist), Riza Niro (the son of the emperor of Tiran), and Queti (the daughter of a dry-cleaner). When Riza Niro discovers that Sadec and his colleagues are after him, he disguises himself as a punk rocker, and falls in love with the stunning Sexilia, his first straight relationship.This film is rarely seen in American because, so far as I know, it has never been released on DVD here. That is somewhat surprising given the major name Almodovar has become. And to have Antonio Banderas as a gay terrorist is something that is so out of character with how we might think of him today (2017).By American standards, the film may be considered soft-core pornography. There is a fair amount of nudity, with men and women... and men on men. No doubt this was risqué in its day, and some might still consider it so. Whether Americans are prudes or Europeans are perverts, I do not know.","I happened upon a rare copy of this early Almodovar film with high expectations - Almodovar is a prolific contemporary director, I enjoyed his 1988 film \"Women on the Verge of a Nervous Breakdown\", and I had read one or two very positive reviews of the film. Well, I must have missed completely the humor that the reviewers saw in this film. I just found it incoherent, tasteless, and boring. Yes, there are plenty of innuendos, people in drag, and crude sexual situations, and yes, these elements may have shocked audiences in 1982 (which was almost certainly Almodovar's intention), but much of the shock value has probably eroded over the years, leaving a limp storyline. Beyond that, the whole movie seemed very chaotic, none of the characters were particularly sympathetic, and for a \"comedy\" - even a dark one - I just didn't find this film funny. I suppose it is possible there is a VERY select audience for a film like this, but I'm just not part of that audience, and not sure that I want to be."],"review-user":["jhayes3","theman-24","rainking_es","madsbs","clivy","dromasca","mvanhoore","hddu10","gavin6942","Sturgeon54"],"review-date":["12 April 2001","10 January 2000","30 January 2006","29 January 2006","14 June 2009","6 December 2011","28 March 2014","14 November 2017","30 May 2017","15 June 2005"],"review-rating":["6","7","8","6","3","2","6","2"],"review-title":[" Polysexual self involved drug fiends in screwball classic!!\n"," A brilliant comedy with no equal or comparison.\n"," Anecdotal...\n"," Funny indeed\n"," The (nearly) perfect movie for sexy belly laughs\n"," when Almodovar was a punk\n"," Chaotic provocation\n"," Pink Flamingos for Spain\n"," Early Almodovar\n"," Labyrinth of Boredom\n"]}