{"review-url":["http://www.imdb.com/title/tt0075290/reviews"],"review-text":["To begin to compare this film with its successor \"Alive\" is like comparing apples and oranges. This movie as well as Frank Marshall's \"Alive\" are both capable of telling the story of the 1972 crash of the Fairchild #571 and the Uruguayan Old Christians Rugby Team in the high cordillera of the Andes Mountains. I think somewhere if you amalgamate both movies, one would get a reasonable representation of the truth of what happened that Christmas of 1972. Both are very good movies, this one is particularly dark with the relationships between the principles at its center. Though the real names of the crash survivors are not used, those who read the superbly poignant book by Piers Paul Read know who they are. One cannot help but be moved by the struggle, and this film does not gloss over the element of cannibalism of this tragedy. It shouldn't. I am disturbed by the association some of the other commenters have made with some horror movies of the genre. This shouldn't be made out to be a horror movie. It's not that at all. It does have a heart. The scenes in which the father of one of the crash survivors goes all out to find his son is touching. I think it's perhaps the main thing that sticks out in my mind about this movie. That and the music. The vignette at the beginning and end of this movie is touching. The happiness of a group of young men enjoying being together, as most of the Old Christians did considering they were from the same neighbourhoods and their families were so close to one another, juxaposed against the tragedy of the end where we see the survivors rescued and the fate of some of the 44 passengers known to the world, this movie does a pretty good job of showing the truth of what went on.\n\"Alive\" is not a bad movie. The fact that it had the sanction of the survivors and Nando Parrado and Roberto Canessa served as technical advisors cannot be overlooked. Their attention to their plight lent a definite authority to the movie, but in some cases, incidents were manufactured to give a sense of dramatic license. What more did one need to make the story \"worse\" than it already was. \"Survive\" I feel was more pulled in, less showy. Again, considering the budget they didn't have for this movie, the scenes that depicted the crash and the moments afterwards were pretty good for the time and budget. Marshall recreated the site of the crash and the crash with a lot of realism, the Cadenos couldn't considering the budget restraints. To compare this movie with that of a Roger Corman schlock film is unfair. This movie still gets me everytime I see it...which hasn't been recently. The last time I saw this it was back in the eighties. With the advent of the infomercial, there isn't much room on the dial for late night movies like this one. I'd love to see it again, if not to tape it, but to be able to correlate it to \"Alive\". Both movies are not bad and this one isn't terrible. Give it a chance. It's worth at least one viewing. You just might think it's worth another.","The highest compliment one can pay to this movie is that it's no better or worse than the 1993 version of the same story (\"Alive\"), despite its having been produced on a much lower budget, with more primitive special effects. The problem is that if you're familiar with the story, there are no surprises left; you're simply waiting for the inevitable. It must be noted, however, that the \"gore\" factor has been considerably hyped up: the scenes that are \"not for the squeamish\" amount to a total of two. (**)","Almost 20 years before Frank Marshall brought tears to your eyes with his mesmerizing epic \"Alive\", there already was the legendary Mexican exploitation director René Cardona who used the same drama as an outline for his ambitious film \"Supervivientes de los Andes\". The unforgettable fatal flight of Fairchild 571 that crashed in the Argentinian Andes on October 13, 1972. This terrible accident cost the lives of many passengers, most of them members of a professional rugby team. But 16 people of them were eventually rescued thanks to their strong will to survive and because they fed on the mortal remains of their unfortunate fellow-passengers. Of course you can't claim that this cheaply made and roughly edited film is better than the famous 90's version but I definitely appreciate and respect this film more. After all, an exploitation film demands a lot more input from both cast and crew while the big-budgeted Marshall film, although intense, feels more like routine money-making. The sets and special effects naturally can't compete with \"Alive\", but \"Supervivientes...\" delivers an equally impressive sentiment of hopelessness and creates an even more nightmarish hell of snow. Cardona's film is ambitious, surprisingly compelling and easily one of the most remarkable Mexican productions ever. I am really astonished that Cardona's take on this story isn't more exploitative and explicit. The scenes where the deceased passengers are cut open and consumed are nevertheless hard to digest, but they only serve to increase the credibility of the catastrophe and to stress the inhuman conditions of the survivors. Rather praiseworthy for a vicious director who gained fame with his notoriously bad films like \"Night of the Bloody Apes\" and the Santo-series. The unknown young Mexican actors do a great job and the musical score is endearing. The story is well-known, of course, so the screenplay doesn't offer any unexpected shocks. Either by history or previously having seen \"Alive\", you know which kind of dramas these people still have to endure before being rescued and you can only await them. Still, this is a good film that shouldn't be bashed like too often is the case.","Survive! (1976) ** 1/2 (out of 4) American version of the Mexican film SUPERVIVIENTES DE LOS ANDES, which is based on the true story of the soccer team whose plane crashed in the Andes Mountains and those who survived had to resort to cannibalism in order to live. SURVIVE! was cut down by 26-minutes, had a documentary style narration added and of course was dubbed in English. When I saw director Rene Cardona's name I was expecting some major exploitation and while there's certainly some, this here is actually fairly well-made when you consider how small the budget is. Most people are going to know this story from the American film ALIVE and if you're looking for an uplifting look on the subject then that's the film to see. This one here was obviously rushed into theaters to try and capture some of the hot buzz around the story and apparently both version were a major financial success. I was surprised to see how effective the plane crash sequence was here as they had to use some good editing to sell it. The performances aren't all that bad and there's no question that the story itself keeps you interested. There's a lot of focus on the cannibalism in the film and there are several rather graphic moments where we see the skin being removed and eventually eaten. These scenes aren't nearly as bloody as the film's reputation would have you believe but they're still going to turn some off. The American version runs 85-minutes and features some narration added to the material just so they could cut out a bunch of dialogue sequences that I'm sure set everything up. The original Mexican version clocks in at 111-minutes and contains more scenes of the military trying to locate the down plane and one survivor's father has a much bigger role in the Mexican version.","This dubbed Italia effort, the first movie, recreating the events of that tragic day in 1972, when that soccer team crashed in the Andes, is indeed involving, despite some cheaply filmed shots, that required a background screen. The surviving victims, some in a great deal of pain, finally had to resort to eating their friends. Two embarked off to get help, the second time succeeding in their quest. We learn from the first effort, if they had gone in the opposite direction, they would of come across the town. But you're in the Andes, remember. You couldn't hypothesize on where the closest help is. During this crisis of starvation and stuck in this below O blizzard, you almost feel like your one of them in this hellish ordeal. This movie which in my opinion, was better than the remake 16 years later, doesn't hold back on the dissection of these dead nude bodies, where for the living, this was their only source of nourishment. Be warned, some of the canniballism scenes may disturb but for you strong stomachs out there, this is a recommended viewing experience of a tragedy, you'll never forget, where hope and belief had to be kept strong. An inspirational drama, with an inspirational soundtrack.","After reading somewhere that this film was never released in the UK, I thought I'd write & let you know that after reading the book by Piers Paul Reid ( which was the only book ever to make me cry ) full of emotion, My friend & I went to the Odeon in York to watch this film which in the 70's was very graphic for the time, you have to put it into perspective of the time, we had St Johns ambulance active in the cinema when the Exorcist was shown, sex & violence were censored heavily let alone cannibalism, anyway my mate fainted but to this day Nando Parrado and Roberto Canessa have been hero's & an inspiration to me since the 70's","I saw this flick on the big screen as a kid and loved it -- cheeziness and all. Recently, I found a copy on video and checked it out again. Badly made, sure... schlocky fun, most definitely. It still packs an entertaining punch. It's much more fun than the dull Disney version (\"Alive\").  The only thing \"Alive\" did better were the special effects. If you're a lover of B-movies, I highly recommend \"Survive\", not to mention all the other Rene Cardona Jnr movies... and the Mexican wrestling flicks made by his father (Rene Cardona Snr). \"Survive\" is long overdue for DVD special edition treatment. Are you listening, all you kind folk, at Anchor Bay...?","I have seen so many bad reviews on Supervivientes de los Andes that I felt compelled to stand for it (or at least I'll try). First of all, of course that it looks dated, it was made in the seventies with very low budget, but that's part of it's charm. I like contemporary films but also dig the old ones for what they worth. I'm not the one to feel the urge to only see or like movies with modern treatments and effects; besides, almost every movie buff likes old fashioned motion pictures (who doesn't like films from El Santo or Plan 9 from outer space, no matter it's overall quality?). In the aspect of pace, is just a tool for covering (again) it's low cost, and I think the constant dialogs are in order of a better character and situations development. Sure, Alive has better FX, but I won't despise the old one just because of that, and I don't feel quite attracted to English speakers in an event involving people from Uruguay and for me, that gives a plus to Supervivientes de los Andes. It's like, even if Canoa, from the seventies and based on a true event too, would have a better remake now due to the advance of technology, but I think I would stick to that one based on the emotions that offers regardless it's production date.All of this is based in the impact that had on me because the first time I saw it was on TV, and nowadays I don't think it has lost some of it's primal force. Of course it's been a long time and I've seen tons of better movies in every aspect of cinema, but that doesn't diminish it's true value. It's not a bad film, and I place it above Alive without hesitation. Just give it a break.","One of the worst things a film studio can do is exploit the tragedies of others, commercializing a 'shock' or 'gore' factor in order to sell tickets to be able to buy their Birch a new diamond necklace. Another worst thing is to totally misrepresent the true facts of an incredible saga by fabricating events, dialog and images to the director's own liking. Lastly, one of the worst things a film studio can do is to use bottom-of-the-barrel actors and shoot it all on a sound stage that was rented for fifty cents a day. All three of these travesties the makers of this film are guilty of. This is, hands-down, the worst movie I have ever seen, and I've seen thousands. A score of '1' is too good for this waste of celluloid. Not only should the filmmakers be ashamed for making it, they should be ashamed for negatively exploiting the heroes of this story, which are the people who experienced this tragedy firsthand, both the living and the dead.","Making a film based on a true story, particularly one as incredible and horrifying as the 1972 Andean plane crash, is hard for even the best filmmakers.  But the Mexicans behind this forgettable and cheap exploitation flick don't even try!  The actual names of both the survivors and the casualties of the Uruguayan air force plane crash have ALL been altered, the crash itself is obviously staged in a very slip-shod manner, and the cannibalism aspect has been unnecessarily and gorily played up.  Shockingly, it made a ton of money on both sides of the border.  Thankfully, thought, it has mercifully been forgotten.  But the same people behind this would later give us the equally revolting GUYANA: CULT OF THE DAMNED!This cheap horror exploitation flick necessitated the making of ALIVE some fifteen years later.  That film was a masterpiece.  SURVIVE!, to put it mildly, is not.","This movie made so much money for Paramount Pictures that it made the producers went on to produce many big films.  All they did was pick up a Low-budget Mexican film, clean it up, and ad some scenes and released it wide all across America.  The plot is based on a true story of the Andes Mountain Plane crash where the survivors had to eat human flesh to survive. (Disney later remade this film and called it ALIVE and hired many white casts(?!). At least SURVIVE is true to real life as they were mostly Mexican on that plane).  The so-called graphic violence is cheap and cheezy and is shown un-cut on Tv alot.  Recommened if you are into these type of film. The director went on to make Universal tons of money in GUYANA CULT OF THE DAMMED 4 years later.","SURVIVE! is a Mexican version of the famous true story about the team of rugby players from Uruguay whose plane crashed over the Andes, trapping the survivors in an icy wasteland. Director Rene Cardona spent a lengthy career making B-movies, many of them in the horror and wrestling genres, and unsurprisingly he enhances the horrific elements of this particular story. Cannibalism plays an important role in the film and it's depicted in a surprisingly explicit way for the era, which makes this film much more realistic than you might expect. The cast members give average performances but the down-to-earth style of shooting adds to the aforementioned realism and the script sticks to survival staples rather than adding in flashbacks or melodrama. The plane cash is also quite well staged.","The father and son directors Rene Cardona Sr. and Jr. (the king and prince of Mexican exploitation!) first international hit movie. The Cardonas has given me hours and hours of quality entertainment and my expectations for Survive! was naturally mountain-high, being their most talked about and hyped efforts (amongst exploitation fans that is). I was really surprised to find out that the movie is actually a pretty dull affair. I suppose the negative imdb reviews should have scared me off, but the Cardona-flicks always get bad reviews, and hey - I would have seen it anyway. You all know the story, based on an actual incident: A plane crashes in the Andes and the survivors are forced to eat parts of the crash victims in order to stay alive. Much of the running time is filled up with endless talking and the moral issue of their survival is stretched out far too long for it's own good. The movie is not at all as gory as they say - I saw the uncut version and still feel that Alive was much gorier. I'm no real gorehound, but in such a slow moving picture as this a little more flesh and blood really would have spiced things up a bit. I would not say the movie is a complete waste of time, it does have its moments, but unfortunately it lacks the speed and charm of movies like Carlos, Hostages!, Night Of The Bloody Apes and Guyana (amongst others). See them before you see this.","Nobody will read this review, because nobody saw the movie. I saw it late night on cable,soon after 1993's outstanding \"Alive\" was released. I was curious to see it and compare the two. \"Survive!\" is shockingly bad, dated beyond belief, and bears such a close resemblance to \"Airplane!\" that I have to now wonder if their inspiration was at least partially taken from this 1976 stinker. For one thing, it is poorly dubbed into English, and that would be forgivable, but the ineptness of the effects of the plane crash scene is such that I wished I had recorded it, so I could laugh at it again and again.","Disney later remade this film and called it ALIVE and hired many white casts(?!). At least SURVIVE is true to real life as they were mostly Mexican on that plane).In a sense it is true, as most of these actors on the plane are Mexicans. Yes, there's white people in Mexico also. So the Mexican actors where also \"white casts\". LOL.In real life they were (are) Uruguayans. (they were the Uruguayan rugby team of that year). If you go to Uruguay, you'll see how that country is a nearly pure white country. United States is a \"cafe au lait\" one. Come to the Big Apple! So don't be surprised.I'm not saying white is good or bad. It is just the stereotype of some comments. They're all over."],"review-user":["prometheus1816","gridoon","Coventry","Michael_Elliott","PeterMitchell-506-564364","pcornerwalker-124-523494","cinedude","pifas","chris-1628","virek213","Serpent-5","Leofwine_draca","tilapia","Brooklyn-10","rocer"],"review-date":["13 April 2003","28 October 2002","10 March 2005","4 January 2014","29 January 2013","4 August 2011","3 October 2001","15 December 2004","31 August 2005","18 August 2001","10 October 1999","14 June 2018","17 September 2002","8 November 1999","20 January 2004"],"review-rating":["6","7","8","10","8","1","2","6","6"],"review-title":[" Not As Bad As Some Have Let On\n"," \"But how can they survive? There is nothing on the plane for them to eat!\"\n"," Real human misery meets Mexican exploitation\n"," Not As Bad As Some Make it Out to Be\n"," Choose Survive over Alive anyday\n"," Survive\n"," It's a wonderful example of cash-in exploitainment\n"," C'mon, give it a break\n"," A tragedy of film-making\n"," Nothing more than cheap exploitation\n"," Box-office hit that no one remembers.\n"," Surprisingly realistic\n"," Not my cup of tea\n"," Hilarious\n"," White. LOL.\n"]}