{"review-url":["http://www.imdb.com/title/tt0083853/reviews"],"review-text":["I was Stan in the movie \"Dreams Come True\". Stan was the friend that worked at the factory with the main character and ended getting his arm smashed in the machinery and got carried out screaming (where was the ambulance?) The acting in this movie was for the most part pretty poor with mostly local actors from the Fox Valley, Wisconsin. I saw the movie on the big screen. It played 2 nights in 3 theaters and was something special to see yourself on the big screen. I may be bias, but overall, I enjoyed it. Also the soundtrack was the band Spooner, who later became Garbage. My brother, Steve Charlton was also in the movie. He played Swenson the man who comes to the door on crutches to talk with the police.","I first saw this film in the late 80's when I hired it from Rainbow Video. In hindsight it's not too bad for what it essentially is: a B-grade fantasy romance flick. The story revolves around a young couple who meet at a go-kart race track and embark on a series of wacky and sometimes dangerous adventures when they are astral-traveling. It's mainly aimed at a teenage audience, although some might find the plot a bit difficult to understand especially when it tends to be overshadowed by sex scenes. Although hardly considered a classic, it's definitely more entertaining than some of the sanitized PC garbage that often gets served up as entertainment these days.","A trash classic! Basically what we have here is a story about a couple of American teenagers (one male, one female both beautiful people of course) who seem to be psychically linked, in that every time both of them fall asleep, they can inhabit each others dreams and express each others innermost desires... think Mills & Boon meets X-files and you'll be somewhere near the mark. Actually, its more like an unhappy hybrid between one of Ed Wood's famously bad B- movies and a particularly silly episode of Melrose Place, so tacky are the special-effects and so amateurish is the acting. The actors who inhabit (I wouldn't say act in) this flick say their lines like they're reading from cue cards and pout when they're supposed to be showing an emotion, and it comes as no great shock (or loss to the industry) that they have since faded into obscurity. The whole thing is just a laughably misguided mixture of styles that don't go together at all, and the end result is a intriguing curiosity that no doubt will be lapped up by purveyors of so-bad-they're-good films in years to come. I'll probably be the only person who ever comments on this film, but if you are reading and have seen it please get back, it gets kinda lonely round here...","Anyone who has viewed Dreams Come True and can bring himself to comment on it at all is indeed quite a special person. I lived and breathed this film for a couple of days many years ago, while transcribing the dialogue for foreign distributors.The remarkable part of Dreams Come True is that we have characters who can astrally project--how cool!--and they choose to enact the tamest, dullest fantasies. Between the unfortunately low budget and the subpar performances, it is a cruel waste of an interesting idea. Nevertheless, I salute anyone who finishes making a film, let alone gets it distributed. Dreams Come True is bad enough to enjoy for its badness, and that's an accomplishment.","This happened to be the first movie I reviewed for my high school newspaper, because it had some kind of four-walling special engagement at my local mall. The youth appeal was clear, with the attractive young couple, and more so, the mystical theme. Before the internet, teenagers in the '80s were fascinated by paranormal possibilities like astral projection, especially if it involved sex scenes.To be honest, I don't remember it that well, and no longer have that review (which was contained on some kind of floppy disk and printed in crude dot matrix format), but I would see it again out of curiosity. I do remember it being hokey, and even as a salacious teenager myself, it didn't seem so erotic.I'm now a film professor, so I write about movies for a living, and I will say this: for all the hype around the supernatural, there's not many movies about astral projection. IMDb lists less than 20, most of which you've never heard of, and most of which are only vaguely about the subject (or about another form of extrasensory experience). Maybe it has simply fallen out of fashion, or maybe bad movies about it have made astral projection less appealing.","This movie is a pisser! It's hard to find information about this movie and not hard to see why: it's a cheap, thinly veiled excuse to watch a cute couple getting it on every few minutes. Actually, that's also it's main appeal. The special effects are really hokey, but it's nice and sexy and there's a sweet scene involving a piece of cake (no, it's not what you think! ). The lead guy looks great in a pair of jeans. Who cares about the lack of script/plot/premise? This movie came out in 1984 but it had more of a 70s feel about it, especially the hairstyles, the special effects and the geeky best friend! Anyway, I enjoyed this movie a lot and I'm trying to get a copy of it as we speak.","Plenty of 80s loved up and loveable determination, perseverance, and personal will power, freedom, and dash of 80s signature toughness, and attitude - coupled with dreams, dreaminess, passion, and fantasy.Comes across with more than a touch of - real, and regular life in a fantasy, and fantasy in real, and regular life.The characters are cute, casual, natural, genuine, relatable, charming, fun, interesting, attractive, and un-pretentious.An America behind what Springsteen, and Mellencamp fantasized, and celebritized - but this is the REAL life and dreams and fantasies behind the real deal - Sweet, fun, beautiful, dreamy, determined, perserving, and believing. That special sense and awareness of a greater dream, and reality, in the midst of one that is sort of already pretty great as it is - but normal. The astral dreams kick in, it skirts the broad precipice between sci-fi and fantasy, never fully crossing the line into one or the other - again in the 80s believable, fun, innovative, and loved up spirit.\"Dream, dream, dream. That is all I want to do!\"The music score is great too!In this day and age, Dreams Come True is an equally enjoyable escapism from both the mundane, and the overly contrived that can make you laugh, and feel good and interested about things - Just as it was intended to be when it was created in '84!Great movie, and the neon and the sparkles make it even greater! :)","I remember watching this movie growing up. I remember watching it when I was about 13. At this age, a comedy about with astral travelling that contained sex scenes should have been awesome. To my surprise, however, this movie sucked balls. The plot made no sense. The acting was horrible. The sex scene, whilst graphic, turned me on less than that time I saw my neighbours dog eating its own vomit. The makers of this movie should be ashamed. It is hardly surprising that the director of this video went on to a long career of working in the sound department of other movies that no one with half a brain would bother watching. I have no idea why anybody would track down this movie and bother watching it in 2011, but if you do decide that that is want you want to do, maybe consider suicide instead."],"review-user":["wlime","dario-western","wrghtrwright","julesaz","tshary17","radguy","Anthony_Rauscher","shannonhewett"],"review-date":["4 April 2006","11 July 2012","6 May 2000","7 July 2002","13 October 2017","11 February 2006","15 January 2018","15 April 2011"],"review-rating":["4","7","1","3","5","10","1"],"review-title":[" I was in this movie\n"," Not too bad, but hardly earth-shattering\n"," If you want a good laugh...\n"," This is awful! Here, taste it...\n"," Back in the day when astral projection was cool\n"," A guilty pleasure!\n"," Dream until your dream comes true..\n"," Some dude can astral travel, so gets involved in the same sex scene over and over again.\n"]}