{"review-url":["http://www.imdb.com/title/tt0046081/reviews"],"review-text":["Clifton Webb as \"Mr. Scoutmaster\" is one of the all-time greats for comedy and remembering an innocence, now diminished in the world. I cannot understand why the networks like American Movie Classics and such do not show this movie, although I have requested it time and again.This movie should be shown to children now for its portrayal of loyalty, respect, dedication and resolve to achieve the best possible on an individual basis. There is so much low self-esteem talked about in present daily lives, but this movie, among many, many others, would be a wonderful learning tool for the present-day younger generation to see what can be accomplished by common sense and decency and pride in yourself and your achievements to better yourself. Sad that this type of movie does not appeal to modern audiences. It certainly appealed to us 'baby boomer' generation of yesterday. OLD LESSONS ARE UNIVERSAL AND TIMELESS.","A cute little film not designed to be a classic but as a showcase for the talents of Clifton Webb who this is obviously tailored too. He is his usual irascible self, slowly simmering to a boil and ever mindful of his dignity which is stripped away at regular intervals.Nice to see Frances Dee a pleasant actress who once married to Joel McCrea rarely worked and then often in undemanding supporting roles. Such is her part here but she does well by and is a good balance with Webb's starch. George Winslow is sweetly endearing as the misfit cub who idolizes the scoutmaster in his own way. Efficiently directed with a veteran supporting cast this moves along at a quick clip, a most enjoyable diversion.","Clifton Webb becomes Mister Scoutmaster as a matter of show business survival. He's host of a television program which is in danger of being canceled because it's not reaching the youth audience the sponsors of a breakfast cereal want to reach. What to do, but reach the minds of what the youth of America are thinking.Edmund Gwenn who is the pastor of the church Webb and wife Frances Dee attend has the perfect solution. The Boy Scout troop that meets in his church has just lost their scoutmaster because they're an unruly group of kids at times. Gwenn gets Webb to be the new scoutmaster.Remember this is Clifton Webb and this will not be an easy relationship given what his movie characters are like. But in the end he bonds with the scouts and with one particular young Cub Scout, George Winslow. Young Mr. Winslow who had an early deepening voice had a spate of popularity at the time. But despite that he comes across as a real kid. During the Fifties, 20th Century Fox softened Webb's acid image from the Forties. His first film with them, Laura where he also played an electronic media personality Waldo Lydecker had a great deal more bite than his character of Robert Jordan here. But I sure can't see Lydecker leading kids into the woods except to lose them in the wilds.Standing out as she always does is Veda Ann Borg playing George Winslow's aunt who has legal custody of him. But she's a loose living girl and that kid certainly cramps her style. Veda Ann never fails to steal a film no matter how brief her brassy part is.The Boy Scouts have undergone a lot of change since Mister Scoutmaster was in theaters. Still the polished and elegant Webb leading a Boy Scout troop will definitely get a few laughs and tug a couple of heartstrings in regard to young Master Winslow.","This movie was never intended as a big-budget film but was a cute little picture that pretty much anyone could enjoy. It probably won't change your life, but it is certainly charming and engaging.Clifton Webb plays a curmudgeon (that's certainly not new) who has a TV. However, his ratings are failing and he is worried about cancellation. So he decides maybe he is too out of touch with kids--as he and his wife have none of their own. So, he volunteers as a scoutmaster and regrets doing this almost immediately! Remember, he IS a curmudgeon and doesn't particularly like kids. To make things worse, one of the kids really likes him and follows him like a lost puppy. No matter how indifferently he acts towards the kid, the child just wants to spend time with him! The kid is cute and nearly steals the show all by himself! What happens next and the twists and turns of the movie are something you'll just have to find out for yourself. Understand that this is a light, cute and yet not cloying movie you'll probably enjoy.","The book (titled 'Be Prepared!')was written as a semi-autobiographical account by Keith Monroe, using Rice Cochran as a pseudonym. Since he was in his 30's at the time the book was published and had been a scoutmaster for only a few years, it has been suggested that many of the experiences belonged to his father, also a scoutmaster for many years. Rumor was that the head of Boy Scouts at the time was enraged by the book, and called for the head of the author. The book, if you can find it, is an excellent read and offers profound insight into the life of a scoutmaster. Clifton Webb's portrayal as a curmudgeonly yet lovable leader, somewhat naive to the behavior of boys, is enjoyable but the movie is more fluff than substance. I must admit my bias, having earned Eagle Scout in the author's troop.","It seems like tempting Fate to cast Clifton Webb as a scoutmaster, but that's what Darryll Zanuck did back in 1953. True, it turned out as an agreeable domestic comedy, nicely played, competently directed (Henry Levin) and slickly produced (Leonard Goldstein). I thought the dialogue could have been a bit sharper – even in the British version which is 15 minutes shorter than that released in the U.S.A. I suspected that the deletions were made from the opening sequences and that everything dealing with the TV program, \"Spectrum\", was also cut. Now that I've seen the complete version, I'm not so sure. The only addition I noticed was a singing-around-the-campfire sequence. There was still no sign of the TV material – an absence that makes the whole point of the movie rather like tilting at imaginary windmills. In other respects, however, Webb makes the most of his opportunities, and it's always a pleasure to see Frances Dee, still looking mighty attractive at the age of 46.","A middle aged man, Robert Jordan, set in his ways, takes on a boy scout troop after his predecessor leaves under duress. Jordan takes on the pack mostly to learn what the boys like so he can revive his flagging radio program which is losing it's appeal to the younger set. He has a rough go at first with the boys, especially so with Mike, an 8 year old who forms an attachment for the older man which is anything but reciprocated. Do things work out for Jordan and the scouts? Check out this entertaining and amusing film from the old days.","WARNING: MAY contain some minor spoilers.Hard to say anything bad about this movie, except for one thing.YOU DON'T GET TO SEE IT MUCH ANYMORE !!!! Then again, maybe that's because you have to be home in the morning or at 3 am to catch it the Fox Movie channel.Too bad, for this is another gem lost to time, Clifton Webb takes his patented sour, know-it-all demeanor he had perfected as Lynn Belvedere (\"Sitting Pretty\" and sequels), and turns 'Nature Boy'.Actually, it's like this.Webb plays Robert Jordan the host of a Sunday children's educational program that is losing audience share, and the network breaks it to him that he needs to do something about it, or else.Part of the problem may be due to the fact that the married host has no children.BUMMER !!! But as such things happen, the local church pastor needs a leader for an unruly troop of Boy Scouts, and finds a willing victim ... ahhhh 'VOLUNTEER' ... in the host, so Jordan he takes the position.Problem solved, RIGHT ???WRONG !!! This being a movie there are other problems.For example, it turns out one of the Scouts is the son of his boss at the TV station, which causes a little friction; especially since the kid is overweight, has asthma as well as an attitude.And he is the more reasonable one.Also, there is this Cub Scout, Mike (George Winslow) who wants to hang around, being the 'stray puppy' type.As it turns out, the reason is that he has no folks of his own, but is cared for by a relative who hasn't much time for him.It is things like this that makes his job harder than expected. All in all, Webb becomes more understanding of kids, and not only saves his show but learns a rewarding lesson, and eventually even adopts Mike.Still a great movie after all these years.","Clifton Webb is one of my favorites. However, Mister Scoutmaster is not one of his best. His patented curmudgeon role seems forced and even unpleasant rather than funny. The film itself is overflowing with mawkish sentimentality. In addition, the viewer is presented with numerous ham-handed references to religious faith and U.S. patriotism that come off as over-reverent rather than genuine. Clifton Webb does his best with a poor script. Edmund Gwenn plays yet another jovial clergyman and is given nothing to do. The child actor lead is played by a talentless child who displays a flat affect throughout the entire film. His sole claim to fame as a performer evidently is a bullfrog-like low voice unusual for someone of his age. However, once you've heard it, you've heard it and you don't need to hear it again. Unfortunately, he is in the majority of the film's scenes. I find this child so irritating that I fast forward whenever he shows up. Since he has a lot of scenes in this film, this means that I fast forward through a lot of the film. There were and are so many talented child actors; it's a pity this film doesn't have any of them in it. Still, Clifton Webb in the traditional broad-brimmed hat and shorts is a sight worth seeing."],"review-user":["cindy_baker50","jjnxn-1","bkoganbing","MartinHafer","danstirling2000","JohnHowardReid","helpless_dancer","pizzawarrior1956-1","holdencopywriting"],"review-date":["10 April 2002","11 March 2012","24 May 2011","17 July 2005","3 July 2006","24 February 2014","8 November 2001","16 January 2006","25 September 2007"],"review-rating":["10","8","8","8","6","6","7","10","6"],"review-title":[" LOVE this movie. Great 50s reminiscence.\n"," An enjoyable diversion\n"," Scout's Honor, You'll Like This One\n"," cute little movie\n"," Light, fun movie but a poor adaptation of an excellent book\n"," One for Frances Dee fans!\n"," Grumpy old man becomes pack leader\n"," Mr Belvedere 'takes a hike' !!!\n"," Clifton Webb enjoyable as always but movie is marred by sentimentality and annoying child actor\n"]}