{"review-url":["http://www.imdb.com/title/tt0036723/reviews"],"review-text":["Cover Girl's importance lies not in its originality as a book (it's a standard backstage Cinderella story), as much as it does in what happened to each of its stars. Gene Kelly was \"loaned out\" to do it when MGM boss L.B. Mayer didn't have much use for him at his own studio. His performance in this film, coupled with the ground-breaking 'Alter Ego' dance solo (duo?) was so successful that it made MGM take him seriously at last (he was never loaned out again) and allowed him to flourish with the soon-to-come hits of \"Anchors Aweigh,\" \"On The Town,\" and \"An American In Paris.\" Likewise for Rita Hayworth; Columbia had been grooming her for years, but she had done mostly B-level films. CG showed her off as a lead in glorious Technicolor, and paved the way for GILDA, her signature (and much more adult) role. Here she and Kelly make a sweet couple, and dance well in \"Put Me To The Test\" and the fresh, energetic \"Make Way For Tomorrow.\" They are at their most poignant in \"Long Ago And Far Away,\" but the number (played on piano by Phil Silvers and sung as they both stack up nightclub chairs) seems to beg for a dance number, then doesn't have one. Another good number is the title tune, which pays tribute to the famous American magazines/cover girl models of the day. Hayworth appears as the last model, running down a curved runway in a gold dress with her flaming mane flying behind her. A dream in Technicolor!!","It took a loan out film to Columbia for Gene Kelly's home studio MGM to realize his creative talent and give him some control over what he did in his own films. Cover Girl also became Rita Hayworth's signature film for the GIs and their pinup fantasies during World War II.Kelly plays the owner of a small nightclub in Brooklyn where Rita is a featured dancer and Phil Silvers the comic. Of course Kelly does a bit of hoofing himself there.Hayworth comes to the attention of millionaire Otto Kruger when it turns out that Kruger had loved and lost Hayworth's grandmother. In some flashback sequences from the gaslight era, Hayworth also plays her own grandmother with Jess Barker playing the young Kruger. You might remember Jess Barker was the husband of that other legendary screen redhead, Susan Hayward.Broadway producer Lee Bowman also is attracted to Hayward, but he's not interested in nostalgia. He wants her for his Ziegfeld Follies revue and in fact the biggest number of Cover Girl is the title song of the film. It's nicely done in Follies style.Hayworth also gets to sing A Sure Thing in a gaslight era number and in the only song in the show not written by Jerome Kern and Ira Gershwin, Hayworth also does an old English music hall number Poor John. When I say sing, as everyone knows Rita mouths words. Singing here is done by Nan Wynn.The biggest hit of the show is Long Ago and Far Away which is introduced by Gene Kelly. It was one of the biggest hits of the World War II era and one of the biggest sellers Jerome Kern ever wrote. It happens in fact to be a favorite of an aunt of mine who with my uncle will be celebrating 60 years of marriage this September. Long Ago and Far Away was nominated for Best Song, but lost to Swinging on a Star.What really sets Cover Girl apart and what makes it a milestone film for Gene Kelly is the two numbers Put Me to the Test and the Alter Ego number. Harry Cohn decided to do what Louis B. Mayer had refused at MGM, to give Kelly creative control of his own material. Kelly later said the alter ego number was one of the hardest things he ever attempted in his career. In it he dances with a pale reflection of himself and the choreography is dazzling and intricate. In fact after one more loan out film, Christmas Holiday at Universal, Louis B. Mayer never loaned out Gene Kelly for the rest of the time he was at MGM. And he did get creative control from then on.With that dazzling technicolor cinematography and Rita's red hair and Gene Kelly's boundless creativity, Cover Girl was and is a classic and will forever be so.","\"Cover Girl\" is the best musical Rita Hayworth ever made.  Ms. Hayworth will always be remembered for \"Gilda\", however, the next movie would be \"Cover Girl\".  The story is great.  It is about a dancer who wants to be a cover girl and makes it big in show business.  She does it without the help of her talented dancer/director boyfriend (Gene Kelly).  Mr. Kelly is given the chance to choreograph the musical numbers.  The dances are spectacular.  It is fun to see Phil Silvers, a comic, do the musical numbers with Ms. Hayworth and Mr. Kelly.  The supporting cast is perfect.  Lee Bowman is given a chance to be an interesting third wheel, the other boyfriend.","A good story about Rusty Parker (Rita Hayworth) who dreams of being on broadway which means she would have to leave the small dinner theater where she works with Danny (Gene Kelly) and Genius (Phil Silvers).  Rusty is in love with Danny.  All three are good friends and every Friday night they go to a local bar where they get oysters so they can  look for a pearl (they never eat them).  The story line provides numerous opportunities for songs and dancing.  The movie has two questions that Rusty must answer:  Is fame all that it is cracked up to be? and Is less really more if you are happy? Answering those questions makes the movie.  The movie also does a good job of showcasing the talents that all three principals had.  Never a dull moment!","For a non-MGM musical from the 1940s, this is quite a memorable and enjoyable film. Rita Hayworth, at the peak of her career, is stunning, a vision of loveliness and in full Technicolor, no less! Gene Kelly, in one of his earliest films, is a good match for her, although his character is really something of a jerk. Phil Silvers provides good comic relief, without being too obnoxious, but Eve Arden, with her dry one-liners, is an even bigger hoot.The music score is quite good for the most part...with only one sour note (\"Poor John\"). The haunting \"Long Ago and Far Away\" is beautiful, \"Put Me to the Test\" is a good number for the two leads, and \"Make Way for Tomorrow\" is a lively, fun number. Of course, credit must be given to Gene Kelly for his fantastic \"alter-ego\" dance sequence, which is without a doubt, the highlight of the film. Definitely worth seeking out for fans of Gene or Rita...this is one of the great 40s musicals. Top stars, sumptuous color, and a pleasing score. Terrific!","Two of these things are to be expected, the third is a complete surprise (that would be Phil Silvers dancing).This is a delightful, if longer than it needs to be musical.  A sub-plot with flashbacks and probably the worst Jerome Kern number ever written (Poor John), do not contribute enough to make them worthwhile.  It's as if they wrote the movie, realized they didn't have enough material to produce a full-length picture, and added these other scenes to \"fill it out\".  They don't work.It's funny to see a 1940's musical with Gene Kelly (on loan from M-G-M)clearly taking a backseat to his leading lady. His second act number where he dances with himself is one highlight of the film. Other strong points are \"Make Way For Tomorrow\" and the lovely, \"Long Ago And Far Away\" (although I thought it odd that the latter number did not have a dance sequence attached to it).  \"Put Me To The Test\", a number where Rita and Gene get to dance together, is a very good number, but the title song does nothing for me, although it is staged wonderfully.Rita Hayworth is absolutely breath-taking. Her dancing is excellent, and this is clearly a role that suits her. Some of her hair pieces, however are awful. In a few scenes, the color of them do not match the color of her natural hair. Very distracting.Phil Silvers is wonderful as Genius, Gene and Rita's friend and co-worker. Seeing him dance, especially as well as he did, was a wonderful surprise.The major problem I had with this movie was that I never believed the relationship between the three leads. I didn't believe that Kelly and Hayworth were in love, or that Kelly and Silvers were real friends.  Can't quite put my finger on it, but I didn't buy it.Excellent supporting work by Eve Arden, Otto Kruger, Edward Brophy and Leslie Brooks.6 out of 10","Good things about \"Cover Girl\" - Gene Kelly dancing with his own reflection; the luminous Rita Hayworth; the street dance; \"Long Ago and Far Away\", the cover girls sequence.  Bad things - \"Poor John\", an unbelievable by-plot about Hayworth's grandmother, and perhaps too much Phil Silvers.  But when it is good, it certainly is good.  I'd say it passes the time but nothing too mind-boggling in musical terms (although for Columbia it was probably one of the studio's peaks in the genre).","Rita Hayworth as Rusty Parker is the COVER GIRL du jour--she's one of the dancing girls in Danny McGuire's club, the most special one according to Danny (Gene Kelly) and pretty much anyone who comes across her. Take for example, Vanity magazine magnate John Coudair (Otto Kruger): enchanted by Rusty's resemblance to her grandmother Maribelle (also played by Hayworth in flashbacks), whom he wooed devotedly when he fell in love with her, he tries to relive his youth by fixing what he thinks went wrong between himself and Maribelle. He doesn't believe that Danny could give Rusty happiness, or everything she should be entitled to--he even gets Danny believing this himself. When Rusty shoots to fame as Vanity's 'Cover Girl', Danny drives her away into the ready and waiting arms of Noel Wheaton (Lee Bowman). So what happens when Danny returns to town with his sidekick Genius (Phil Silvers) in tow, only to discover that Rusty is marrying Wheaton?As a musical, COVER GIRL benefits from the beautiful score and songs written by Jerome Kern and Ira Gershwin, including the Oscar-nominated 'Long Ago and Far Away' (possibly one of the most gorgeous ballads ever written and beautifully, sweetly sung as a duet by Hayworth and Kelly), Maribelle's number 'Sure Thing' (the more lacklustre 'Poor John' isn't a Kern/Gershwin collaboration) and 'Put Me To The Test'. The dancing, of course, is top-notch, since Gene Kelly had more than just a hand in the choreography. It shows in the simplest of dances, for example his dance with Hayworth to 'Put Me To The Test', or the joyfully exuberant 'Make Way For Tomorrow' number (performed by the trio of Danny, Rusty and Genius)... which foreshadows the reaction Gene's character has to the police cop in the title number in SINGIN' IN THE RAIN. Kelly especially scored a technological and artistic coup with the 'Alter-Ego' dance. Like its successors in ANCHORS AWEIGH and AN AMERICAN IN PARIS (Jerry the Mouse and the 16-minute ballet respectively), this dance is an example of the incredible innovation and creativity Kelly brought to the modern film musical: wanting to use the film medium to present dances that couldn't be showcased on a stage, and years before CGI, Kelly insisted on dancing with the one person who could possibly match him in talent and style--himself. The number is hardly five minutes long, but it (and Kelly's genius) still takes one's breath away, even sixty years down the line. This is the reason I watched COVER GIRL, and if nothing else, this dance is truly worth it.You can tell that a great deal of money was lavished onto COVER GIRL and Rita Hayworth--not that she doesn't deserve it. Witness the scene when Rusty hits Broadway--the large screen showcasing all the different cover girls gives way to a staggeringly large stage rigged for Rusty's entrance. Hayworth is indeed one of the most effortlessly beautiful girls on show in the film, and she dances with a style and grace that is almost worthy of Kelly. (Very few of Kelly's co-stars have that honour.) She is hilarious in some scenes, for example her drunk scene when John and Wheaton come to get her from Joe's.For some reason, however, her performance still lacks the spark of greatness which would help COVER GIRL overcome its general curse of mediocrity. That curse is only lifted whenever Gene Kelly is on the screen (dancing or no), or when Eve Arden as John's long-suffering secretary 'Stonewall' sidles by with another cutting comment or clever observation. Since the film, in the end, belongs to Hayworth, neither Kelly nor Arden can save it as a whole. This isn't to say that the film is bad--it isn't. It's enjoyable, with great songs and cute numbers and lots of pretty girls to look at. But it's just not quite a classic. The dancing is classic though--so watch COVER GIRL for that, and you won't regret it.","Rita Hayworth is just stunning at times and, for me, the only reason to watch this silly film. Despite the overdone 1940s lipstick, Rita was one of the all-time glamor women of Hollywood. In fact, for a couple of years I can't imagine anyone that looked better, except maybe Elizabeth Taylor in her prime.Anyway, the co-star of the show, Gene Kelly, does not play his normal likable, at least the kind of guy we all know him from in \"Singin' In The Rain.\" Here, Kelly's \"Danny McGuire\" pouts much of the time. Phil Silvers, who I loved on TV at \"Sgt. Bilko,\" is so stupid in here as \"Genius\" you will just cringe listening to his dumb jokes....and they are stupid.The visuals are good with great Technicolor, which almost looks terrific. You get to see a lot of pretty women in here, too, not just Hayworth. Unfortunately, the story isn't all that much. It centers around Hayworth deciding about a career choice. Along the way, we get the normal shabby treatment of marriage and we get an insultingly-dumb ending. All in all, an unmemorable film, except as a showcase for Hayworth's beauty.","Chorus girl Rusty Parker (Rita Hayworth) wins a magazine's contest to pick a new cover girl. This is thanks to the magazine's editor (Otto Kruger), who was in love with Rusty's grandmother. Apparently Rusty is the spitting image of Grandma. Anyway, as things usually go in musicals, she must decide between success and love with nightclub owner Danny McGuire (Gene Kelly). Rita is gorgeous, of course, and that's only enhanced by the Technicolor. Her dancing is excellent as well. Kelly is fine in the acting department but the dancing is where he shines. This was the musical that put him on the map and from this point on he was allowed to choreograph his dance routines in films. The movie has comedy backup from Phil Silvers and Eve Arden. Arden is great but Silvers is like everybody's unfunny uncle. The musical numbers are mostly just OK. The highlight songwise is \"Long Ago and Far Away.\" The best dance number is Kelly's solo \"Alter Ego\" dance. It's not a bad musical but it's not one of my favorites.","I know it has Gene Kelly in it. I know it has Rita Hayworth in it. I know Phil Silvers provides comic relief and Jerome Kern wrote the songs and Ira Gershwin wrote the lyrics, but I've tried several times to get my appreciative apparatus wrapped around this movie and can't do it.Kern has provided a terrific, soaring tune, \"Long Ago and Far Away,\" which doesn't involve a dance, and the others are without distinction. I mean, the guy composed like nobody else. For \"Roberta\" he wrote, among other tunes, \"Dearly Beloved\" and \"I'm Old Fashioned\", icons in the Great American Songbook. Except for \"Long Ago and Far Away,\" there's nothing like that here.Gene Kelly oozes an easy-going charm but his athletic dancing here still looks like it came out of vaudeville, his arms held out at an awkward angle. He would improve quantumly over the next few years. Rita Hayworth is gorgeous but is stuck in a corny part in a corny plot.Corniness, in the sense of reflecting old-fashioned values, isn't bad per se. I don't think there's anything more juvenile than the story behind \"On The Town.\" But the book means a lot. If the story behind the numbers isn't engaging, it's difficult for the numbers to succeed. Not \"impossible\" -- look at Fred and Ginger's best -- but difficult.Unquestionably, one of the reasons for the evidently undying popularity of \"Singin' In The Rain\" is that it's funny as hell, quite aside from the numbers themselves -- which are also light-hearted and well integrated into the plot. \"Singin' In The Rain\" makes a viewer feel HAPPY in a way that this film simply doesn't. Who wants to see unhappy singers and dancers? I'll tell you who wants to watch unhappy musicals. Opera fans, that's who! There's not a somber moment in \"Singin' In The Rain\", no serious conflict at all. The more somber a musical film gets, the less entertaining it is. \"An American in Paris\" was much more ambitious but memorable mostly for its expensive sets. Then there is the dismal \"It's Always Fair Weather.\" I'd like to recommend this because nobody is better at projecting a kind of flamboyant joy than Gene Kelly. That smile belongs in a toothpaste commercial. But, really, \"Cover Girl\" isn't much more than routine.","Rusty (Rita Hayworth) works at Danny's (Gene Kelly) small nightclub as a singer/dancer. She enters a competition to become a \"cover girl\" for a magazine and wins. Will Rusty swan off to fame elsewhere. Once Noel Wheaton (Lee Bowman) appears on the scene, that is exactly what she does. How will Danny cope and will Rusty be happy in her new life...?...This film is good for hat watching. Unfortunately, there is nothing else really going for it. The film tells the story of a romance between Rusty and Danny who are inseparable along with their friend Genius (Phil Silvers). However, there are moments when Danny and Genius are stroppy and slightly unlikeable, which turns the viewer's sympathy away from them. Genius and Danny don't seem particularly thrilled for Rusty once she gets an opportunity, while Rusty is a bit quick to go off romantically with Noel. The songs and dances aren't particularly memorable either (in fact, there is only one good bit in one of the songs that is sung by Rusty) but they do provide the most entertaining parts of the film, and you can always have a laugh at Gene Kelly when he starts dancing with his over-dramatic gestures. The film is also devoid of any humour, although there are a few lame attempts at it, predominantly by Phil Silvers. An example of the poor humour is demonstrated by the childish ritual that Rusty, Danny and Genius go through before they open up oysters. I was surprised by the dancing skills of Phil Silvers and Gene Kelly's dancing style is there to see - a cheesy smile as he sings and a bum that sticks out. Great colour but a corny film.","I wanted to like this film...I really did. However, the plot was quite simple (and easily resolved) and the songs were an amazingly flat and uninteresting lot. I think all this is very apparent to me because I have recently spent a lot of time watching MGM musicals as well as films about classic Hollywood song and dance films--and \"Cover Girl\" just doesn't stack up all that well. Perhaps this is because the film is made by Columbia--a studio not known for its musicals.The film begins with a bunch of dancing girls all talking about some contest--where the winner is chosen as a cover girl for some magazine. Surprise....Rita Hayworth is the one picked. And, soon after this, her life changes--with great job offers and the wolfish Lee Bowman chasing after her. But what about her partner (Gene Kelly)? What about their act? What about the fact that the songs are so dull?So what does the film have going for it? Well, the color film is nice and Rita looks swell. And, at least one song and dance number is a standout--the one where Gene dances with himself. You have to see it to know what I mean--it must have been very difficult to choreograph and execute. But this alone is not enough to make up for the film's deficiencies--such as the notion of a granddaughter looking EXACTLY like her grandmother, the badly synchronized singing in many places and the rest. In addition, there is a romantic tension between Rita and Gene--when it all very EASILY could have been solved with her going on to a better job and Kelly keeping his old one AND they could have STILL kept dating. Overall, a time-passer and nothing more--even though it looks great.","Gene Kelly and Rita Hayworth dance up a storm. Phil Silvers puts on his own dancing shoes to jump in with the two leads on occasion and holds his own, more or less. Some of the musical numbers are a lot of fun and one of them shows off what was in 1944 a dazzling bit of technological wizardry. So with all of that why is there the feeling that this movie ultimately disappoints? The problem lies with the story which is rather flimsy, in places scarcely believable, and in the end utterly predictable. Once the movie sets up its plot you can see the ending coming a mile away. There is little to nothing in the way of drama. Along the way the wonderfully talented Kelly and Hayworth can put a smile on your face now and again with their wonderful dancing. If this was a dance exhibition it would be a smashing success. But it's not a dance exhibition, it's a movie. And as a movie Cover Girl is somewhat of a letdown.Kelly plays Danny McGuire, owner of, and of course dancer at, a small Brooklyn nightclub. Hayworth plays Rusty Parker, the leader of the club's dance troupe. Rusty's the club's star attraction but in this small out-of-the-way setting nobody's star is shining particularly brightly. But thanks to a bit of nonsense involving someone's fascination with Rusty's deceased grandmother Rusty will soon see her star on the rise. She'll have the opportunity to leave shabby Brooklyn behind for the bright lights of Broadway. And if you can't guess where this is headed you obviously haven't seen very many movies.Along the way there are some stellar song-and-dance numbers. The fact that when you see Hayworth \"singing\" you know it's not actually her voice you're hearing does detract from the experience a bit. But Kelly and Hayworth do make a great team. As do Kelly and Kelly and yes you read that right and you'll just have to see the film to understand. As the film's third wheel Silvers is the designated funny guy. Unfortunately his over-the-top antics wear thin very quickly. By the end he's so annoying you cringe every time he speaks. Full credit to him though for keeping up with Kelly and Hayworth in a big dance sequence which is a lot of fun and one of the highlights of the film. Unfortunately there are as many lowlights as highlights in the musical department. The songs Rusty's grandma gets to sing in the flashback sequences are real duds for example. Some other songs aren't that bad but are rather forgettable. The film, in all its Technicolor splendor, looks great. Hayworth may never have looked better and she and Kelly are two terrific stars doing some fabulous dance work. But its not enough. Great visuals and great dancing don't necessarily make for a great movie.","Except for a couple of spritely dance numbers and the lovely song \"Long Ago and Far Away,\" which became a big hit for Helen Forrest and Dick Haymes,this one is contrived and unconvincing even for a 'boy loses girl' musical. The distance between Brooklyn and Broadway may be emotional and psychological, but it's still only a long subway ride. The characters don't seem to grasp that much. I always had a problem with Kelly's voice, which was not up to the songs he was given. Astaire realized that he was \"no singer,\" but he put the songs over -- \"Night and Day,\" \"The Way You Look Tonight,\" \"Let's Face the Music and Dance,\" etc. And it's Martha Mears singing for Rita this time, not Nan Wynn. The most ludicrous scene in this one is Kelly and Silvers entertaining the troops as they ride along in a truck. Radically unconvincing. The 1948 film \"Easter Parade\" stole the cover girl concept and did wonderful things with it, projecting it back to a pre WWI era accompanied by Irving Berlin's wonderful \"Girl on the Magazine Cover.\" \"Cover Girl\" has about 8-10 minutes of really wonderful dance and music, but the rest of the film is dull.","Rita Hayworth plays a Brooklyn nightclub dancer named Rusty who specializes in cheesecake chorus revues; she manages to get herself on the cover of a national fashion magazine, but her impending success as a solo (with romantic offers all around) has smitten boss Gene Kelly chomping at the bit. Terribly tired piece of Technicolor cotton candy, with unmemorable musical sketches (the two worst of which are irrelevant flashbacks to the 1890s, with Hayworth portraying her own grandmother). Kelly, as always, dances well but acts with false sincerity; when he's serious, he's insufferable, and the rest of the time he's flying on adrenaline. The script is a lead weight, not even giving supporting players Phil Silvers and Eve Arden any good lines. *1/2 from ****","This is definitely an outstanding 1944 musical with great young stars and famous veteran actors under the direction of Charles Vidor. Rita Hayworth, (Rusty Parker),\"Charlie Chan in Egypt\", sang and danced with Gene Kelly,(Danny McGuire), \"Anchors Away\", Danny McGuire owned a night club in Brooklyn, N.Y. and was in love with Rusty Parker who was a dancer in his club along with Phil Silvers,(Genius),\"Coney Island\", who was the comedian in this picture and also worked and dance together with Danny, Rusty. Otto Kruger, (John Coudair),\"Duel in the Sun\" played the role as a promoter of a cover girl magazine and decided Rusty Parker was going to be his top model. Jerome Kern's music is heard through out the entire picture and the song, \"Long Ago & Far Away\" is the theme music for this musical. This film was nominated for many awards and was a big hit at the box office during WW II which kept peoples minds off of the war that was going on at the time. Rita Hayworth and Gene Kelly were instant hits and their career's exploded on the silver screen for many many years. Great Musical and a film you will not want to miss, this is truly a great Classic Film. Enjoy","I never thought I would ever say I didn't like a Gene Kelly movie. Cover Girl to me was one giant bore. The choreography was mediocre (with the exception where Kelly dances with himself)and the songs weren't memorable. Watch Singin' In The Rain and tell me you didn't hum it after the movie was over. You can't! As far as the relationship between Rita Hayworth (while beautiful I don't understand the hoopla surrounding her. She's a passable dancer and a lousy actress) and Gene Kelly, there is absolutely no chemistry.The only gem in this flick was Kelly's scene where he danced alongside himself. Is it any wonder MGM never loaned him out again? His dancing was magical, athletic and just a joy to watch. If you want to see Kelly at his best, watch Singin' In The Rain or his masterpiece An American In Paris.","Like 'Singin' in the Rain', 'Cover Girl' has a trio of two guys and a girl. In 'Cover Girl', Phil Silvers (Genius) is the comic relief. He corresponds to Donald O'Connor's funny man part in 'Singin in the Rain'. In Cover Girl, Gene Kelly's love interest is Rita Hayworth and in 'Rain', it's Debbie Reynolds. That's where the comparison ends.Whereas \"Singin' in the Rain' is a classic American movie musical, 'Cover Girl' is mediocrity incarnate. The story isn't very complicated. Rusty Parker (Rita Hayworth) is a dancer in Danny MacGuire's low-rent nightclub in Brooklyn. Rusty decides to enter a Cover Girl contest sponsored by a wealthy publisher, John Coudair, who made an unsuccessful play for Rusty's grandmother years ago. Coudair introduces Rusty to Broadway producer Noel Wheaton who makes her into a star. Danny feels slighted when Rusty starts showing up late for rehearsals at the nightclub and decides to close the club down and go on the road entertaining the troops along with his sidekick, Genius. At the last minute, with Rusty at the altar with Noel, she realizes the error of her ways and runs back to Danny. They live happily ever after.Gene Kelly has the least developed part in the movie. All we find out about him is that he owns a nightclub and is madly in love with Rusty. Coudair and Wheaton act like besotted teenagers toward Rusty and Phil Silvers delivers some thoroughly goofy but unfunny shtick. The most interesting aspect of Rita Hayworth's performance is the scene in which she gets drunk. This foreshadows what happened to her in real life. Anyone who has read her biography will learn that she disliked Hollywood, pined away for a normal home life which she could never attain but eventually began drinking and ended up with full-blown Alzheimer's during the last years of her life.Almost all of the songs in Cover Girl are old-fashioned and not very tuneful. Gene Kelly has only one really excellent dance number and that's the scene where he dances with his 'alter ego'. Earlier, the trio has another number which is a pale precursor of 'Make em Laugh' from 'Singin' in the Rain'.The most annoying thing about 'Cover Girl' is the way in which Rita Hayworth is put up on a pedestal. A couple of decades later, Raquel Welch had the same problem. Both actresses later in their careers would always try and find scripts that showcased their acting abilities. They wanted to be known as 'actresses' and not 'pinup girls'. Unfortunately, 'Cover Girl' is an example of how Hollywood used to exploit women for financial gain.","Cover Girl (1944)The war is on, and this musical covered two fronts--escapist entertainment, and good old leggy girls for the guys in uniform (those who got to see it). Betty Grable may have been the unofficial pin up actress in wartime, but Rita Hayworth was one of the real hotties of the 1940s, and another G.I. staple, and she is the visible star of this very colorful musical.The other star, secondary except in name, is Gene Kelly, who is actually a relief in his scenes, adding some stability to a sometimes frivolous and girly musical. Hayworth is great as a presence, too, for sure, and she does do her own dancing, but her singing voice is dubbed by another vocalist. Third in importance is Eve Arden (for me) playing her usual world-weary wit, in this case in the center of the cover girl search. An interesting if minor trick to the plot early on is the way they create two plots in two time periods, the present (1944) and forty years earlier. So the musical numbers (and lavish costumes) vary from one period to the other, with Hayworth providing the link. Most of the time, thought, it's the early 1940s with the usual competing romances, and a striving for glory takes off. This was Hayworth's biggest success to date, and she was married to Orson Welles at the time. The movie was a hit, both with audiences and with critics. It even won an Oscar (for the music).How does it compare to other musicals? Well, for one thing it has totally vivid color, I mean vivid, true three-strip Technicolor (the ultimate), and it helps. The dance numbers are on obvious sets, carefully and beautifully designed. Kelly was instrumental in making the dance numbers work, even dominating the director (Charles Vidor) on this score. You might even see hints of his later more famous musicals (a street scene has echoes of \"Singing in the Rain\" in set design, without the rain--a cop even ends the scene in both cases). The dancing is something of an evolution from the 1930s Astaire-Rogers dancing which was heavily tap and ballroom kinds of couple numbers. Here we see more choreographed integration with the plot and the scenes. The story, as the title suggests, has a great theme. Rita's character, Rusty Parker (she has reddish hair, which is common in these Technicolor affairs) is trying to be a cover girl for a magazine contest. Of course, so is everyone else in the country. And they bring it to an amazing climax by presenting \"covers\" designed for all the major magazines, the real thing from Cosmopolitan to Look. The actual magazines around the country got on board with the movie while it was being made and had their own contests for their covers. One dance number features each of the winning covers, seen through a giant camera lens, and each of the winning girls--so the cover models got a small dose of Hollywood stardom, too. It's fun, and clever, and it sold the film big time.There is an odd mistake in the movie--when the original Variety cover with Rusty Parker on it is pinned up by her dance friends and rivals, it shows a picture of her looking at the camera. When the camera pulls back for a wider view, it shows a different cover! Parker is looking to one side. Pretty ridiculous boo-boo.I can't over emphasize how much the production values of the film support it. The color, the photography, the set design, and the editing are all really fabulous. There are two photographers listed, and one is Rudolph Mate who has a number of great Hollywood films to his name (as well as a true legend, the German/Danish \"Vampyr\" from 1932). Technicolor consultant Natalie Kalmus is in top form (she insisted on certain colors and color pairings that worked best with the film stock). Kelly was loaned from MGM (to Columbia) for the movie, and he was given liberties in production, making his career jump two notches. The choreography is his, and MGM began to pay attention to him at this point. The great number where he plays against his ghost on the streets is inventive and fun. The production is high here, with true Technicolor, but it lacks the high standards of MGM (see \"Singin' in the Rain\" for some better echoes).\n There are lots Broadway based visuals, with sets and contrivances. It only goes so far, and it's so infected by the \"cover girl\" mentality it drives any normal person not to boredom but to disappointment. I know if I say it's sexist many people think I'm just not getting it, or I'm applying a 21st Century filter to a normal situation back then. But it's an objectifying movie with all the worst stereotyping clichés you can write into a script. And the fact remains that neither Kelly nor Hayworth are what you would call great actors. Likable (and pretty) but limited in their range.\n It's a musical, yes, and it gets around to real music eventually, and it's no less than Kern and Gershwin. The great song is a quiet number between them, Long Ago and Far Away. Some of the other songs are formula stuff, and you have to hang in there. In fact, you start to realize you are being patient a lot, waiting for the movie to rise up.","\"Cover Girl\" is a lacklustre WWII musical with absolutely nothing memorable about it, save for its signature song, \"Long Ago and Far Away.\" This film came out before Gene Kelly really hit his artistic stride, and while there are evidences of his burgeoning talent here, mostly he plays sidekick to Rita Hayworth. And there's the problem. Rita Hayworth is gorgeous, no doubt about that. But she's simply not a compelling screen presence. I've always found myself wanting to like her more than I actually do, and this movie is no exception. She's simply not a very good actress, and she's not even a very good dancer. Good looking as she is, there's something vapid about her, and this movie suffers because of it.Grade: C-","Rita Hayworth becomes the first female lead to dance with Fred Astaire and Gene Kelly when she starred with Kelly in Cover Girl. Kelly does a great job dancing with his image but Rita steals the show as the cover girl that has to decide whether she wants fame or Kelly. And like every Rita Hayworth movie I have to mention that she really was beautiful.The surprise in this movie is Phil Silver - as a dancer, not as a comedian. His comedy tires quickly but his dancing, while not at the level of Hayworth or Kelly, is still beyond what I remember him for. The three of them together are fun to watch. And Rita is gorgeous as always.The problem is you never get the feeling Kelly and Hayworth were really hot for each other (though how anyone could not feel hot for Rita is beyond me). The romance always feels forced so you are left with a lot of great Jerome Kern/Ira Gershwin songs to enjoy. If you are looking for Shakespeare, you won't find it here. But did I mention how great Rita looked? Enjoy Cover Girl for the dancing and music - the story is about as deep as a Three Stooges short. But then the Moe, Larry and Curly never had Rita Hayworth. Oh, did I point out how beautiful Rita was?","This is a very enjoyable, fluffy, glamorous musical from the 40's. 'Cover Girl' made Rita Hayworth (formerly the dark-haired Latin senorita Margarita Cansino) into a bona-fide, all-American star. It confirmed Gene Kelly's amazing talent as a dancer, singer, actor and choreographer. It epitomises the exuberance and colour of the musical genre.Rita Hayworth is great as Rusty Parker- it is her picture, and her presence is always at the forefront. Her singing is dubbed, but her dancing is absolutely brilliant and she combines very well with Kelly. I think that Rita was highly underrated as an actress- she plays every scene superbly here. Gene choreographed the dance sequences (he was basically given almost complete creative freedom here), and his 'Alter Ego' dance number is amazing. Such artistry. The stand-out tunes are 'Make Way For Tomorrow', 'Put Me To The Test', and, of course, 'Long Ago and Far Away'. The plot is rather thin, yet it does have a moral. It's about the perils of quick fame and fast money, and how any happiness with only these factors will ultimately be doomed. This will cheer you up, lift you up to your feet and make you laugh.That said, 'Cover Girl' is not the greatest musical ever produced- it has a number of flaws that must be addressed. One can say that a little bit of Phil Silvers goes a long way. His character gets tedious rather quickly. However, I was impressed with his dancing ability and how he was able to keep up with Gene and Rita. Another major problem is that too many songs are just not that great. The 'Cover Girl' number looks fantastic, but I'm not a fan of the lyrics or the singing. 'Poor Tom' is a huge downer. I think it's one of the worst numbers I've heard in a 40's-50's musical yet. It stinks. The grandmother sub-plot borders on being ridiculous. But that's only my opinion. Others may like these elements.Still, apart from it's faults it's a very, very good film, much better than most of the product churned out today. The dancing and singing is sublime, the production values are excellent, and it's mood is infectious.8/10.","Rita Hayworth lights up the screen in this fun, fancy and delightful musical starring Gene Kelly. Rita plays nightclub dancer Rusty Parker who has dreams to be a successful Broadway star. Unfortunately, her career is getting no where in Danny McGuire's Night Club. When one of her fellow dancers says she's going to enter a Cover Girl contest, she decides to follow her dreams and enters. She reminds the publisher of her Grandma, who he was deeply in love with many years ago. But when she finds this success, her boyfriend is not happy about it.I had never seen Rita before this, and I am so glad I did! She has such a scene presence and is a very good actress. There are some good numbers in here, not the best of any musical but they are melodic and good to listen to. One thing I didn't like was Gene Kelly's character. He should have supported his girlfriend! But anyway, that's perhaps the only criticism I have about this movie. Cover Girl is a glorious, fluffy film - perfect escapism. Not everyone's ideal movie, but a wonderful movie nonetheless, due to Rita Hayworth's star power. Great movie, truly impressed.","COVER GIRL is one of those Hollywood musicals that made Rita Hayworth a popular favorite with the GIs during World War II. She's at her luscious best as an actress and dancer (with a pleasant singing voice from Anita Ellis) and is in splendid form as Rusty Parker, an ambitious showgirl and Gene Kelly shines as her hoofer boyfriend.  Here's a sample paragraph describing the film from my current RITA HAYWORTH article in CLASSIC IMAGES (March, 2002):\"She certainly must have helped boost morale with her appearance in a film that many consider the finest musical of her career, dancing with Gene Kelly to a Jerome Kern score that included the Oscar-nominated Jerome Kern-Ira Gershwin tune, \"Long Ago and Far Away\".  The film received five Oscar nominations, and it is an enjoyable backstage yarn about a girl who must decide between Broadway stardom and the hoofer she loves.  Kelly had a typical role as a fast-talking dancer and there were good supporting roles filled by Eve Arden (highly amusing in a tailor-made role), Lee Bowman, Phil Silvers and Jess Barker.  It was considered inventive and way ahead of most musicals of the period. The director was her favorite, Charles Vidor and it won an Oscar for Best Musical Score.\""],"review-user":["movibuf1962","bkoganbing","smithy-8","craig_smith9","laffinsal","alfiefamily","didi-5","gaityr","ccthemovieman-1","utgard14","rmax304823","AAdaSC","MartinHafer","hall895","hcoursen","moonspinner55","whpratt1","dharmabum1966-1","Turfseer","secondtake","evanston_dad","dgz78","jem132","Incalculacable","Doylenf"],"review-date":["7 March 2003","3 February 2007","14 November 2003","28 March 2002","19 April 2004","3 April 2004","8 October 2003","27 August 2002","8 June 2007","9 January 2014","3 May 2010","1 January 2010","28 September 2012","14 October 2011","6 February 2007","6 July 2008","6 February 2007","1 September 2012","16 December 2008","10 April 2011","5 July 2005","2 February 2007","23 June 2006","20 April 2006","6 March 2002"],"review-rating":["9","10","8","6","7","4","7","5","5","4","5","6","3","7","3","3","7","4","6","8","7"],"review-title":[" Gene Kelly's pivotal role and Rita Hayworth's most glamorous.\n"," Put To The Test And Passes With Flying Colors\n"," Cover Girl Shines\n"," An Extravaganza of Music and A Good Story too!\n"," Energetic and Fun\n"," Beautiful Rita, Kern score and Phil Silvers dancing!!!\n"," Rita, Gene and good stuff for Columbia\n"," Kelly dazzles, Arden charms, Hayworth needs a little spark...\n"," Nice-Looking Cover, Not Much Inside\n"," OK Musical\n"," Mediocre Musical.\n"," Corny story\n"," Looks nice...but most of the songs and dance numbers are second-rate\n"," Great dancing doesn't make a great movie\n"," Dull\n"," \"Rusty\" is right...\n"," Long Ago & Far Away\n"," Silly plot, sub par choreography and lackluster songs\n"," Poor Man's 'Singin' in the Rain'\n"," Ignore the cheesy first dance--this one is vivid and classic in many ways\n"," Just Not Very Good\n"," Lovely Rita, Graceful Gene and Phil the Surprise\n"," Rita and Gene!\n"," Rita, Rita, Rita!!\n"," Entertaining musical with Jerome Kern songs...\n"]}