{"review-url":["http://www.imdb.com/title/tt0092580/reviews"],"review-text":["I'm an opera buff, and operas are full of sex, blood and death. It may help to know the librettos of the operas the arias are from to really appreciate this film -- my mileage is very different than Tug-3.  I am a classical music lover, and I liked this film.\nI loved Ken Russell's \"Nessun Dorma\" segment, and would actually like to see him produce Turandot, because opera is supposed to be overwhelming, truly multi-media experience , but then I loved Lisztomania.  I love *Turandot* and knowing the libretto so well may be why I don't find this segment the travesty that Tug-3 did.The Buck Henry/ Rigoletto segment is probably the most approachable for the average viewer -- they are likely to recognize the tunes, and its a classic bedroom farce.  I like bedroom farces, so the silliness didn't upset me.The \"Liebestod\" segment is so outstanding that I recommend people watch this for that piece alone.  \"Depuis la Jour\" was, for me, beautifully spiritual. And the Caruso recording of \"Vesti la Giubba\" (aka I Pagliacci) with John Hurt as the clown was wonderful.  But people just wanting naked women may feel there is too much music and not enough bare flesh and sex.","Sure, it has its pretentious moments, it plays like art-house, live-action Fantasia, but it also has moments of deep beauty and humor. Omnibus films are always a problem, but I have always had a keen interest in them. I will now rate the segments individually.Nicolas Roeg - \"Un ballo in maschera\" - This segment may very well spoil the film for some people, because it is absolutely the worst of the whole bunch. It is difficult to follow, mostly because it tries to adhere to a clear plot (a hackneyed one, at that). The photography is unaccomplished. The best thing about it is the bit of Lesbian homoerotica that it never does enough with. This segment made me VERY nervous about continuing. 2/10.Charles Sturridge - \"La virgine degli angeli\" - an unclear segment, but it hardly matters. The film has the best cinematography of the bunch, mainly because it is in a stunning black and white. The segment is dreamlike and beautiful. 7/10.Jean-Luc Godard - \"Armide\" - I chose to brave this much-maligned film for the Godard and Altman segments. With Godard, I was much more impressed than I thought I would be. I can't claim to have seen all that many of his films since he made so many that almost no one has seen, but, judging from what I have seen, this may be his best work since the 60s. It is the funniest segment in this film, and the most artistically accomplished. Bravo, Jean-Luc! 9/10.Julien Temple - \"Rigoletto\" - a very funny segment, it is also quite predictable. Still, this story about a husband and wife who are cheating on each other at the same resort is wonderfully filmed with long, complex tracking shots that depend on precisely timed choreography from the actors. It also has a great self-referencing joke about omnibus films themselves. The final scene is very weak. 7/10.Bruce Beresford - \"Die tote Stadt\" - this short segment involves too lovers in (I think) Venice. It is pretty, with some nice shots of doves flying about the city. It is slight, but nice. 7/10.Robert Altman - \"Les Boréades\" - not one of the better segments, unfortunately, this is more of a music video than a concept short film. It involves the occupants of an insane asylum attending a theatrical performance. The music and images work well together, so at least I can give it credit for being a good music video. 7/10Franc Roddam - \"Liebestod\" - somewhat unfortunate for Beresford's segment, this segment is very similar to it. As you might assume from my phrasing, this one struck me much more. It is about a young man and his girl going to Las Vegas on a fatalistic voyage. 8/10.Ken Russell - \"Nessun dorma\" - maybe the most visually striking segment, it plays in a fantasy world more than in reality. It is a beautiful tale of a fallen angel. 8/10.Derek Jarman - \"Depuis le jour\" - I have heard a lot about Jarman, and this is the first piece of filmmaking I have seen from him. Hopefully, I'll see more in the future. This one is also music-videoish, but it is better than Altman's segement. It mainly concerns an old woman remembering her younger days. The editing and the use of different film stocks to represent both time and emotion are very beautiful. 8/10.Bill Bryden - \"I pagliacci\" - the sad clown, possibly one of the most famous arias (particularly memorable from an episode of Seinfeld), this serves as the material separating each segement and the finale. It is simple and effective. 7/10.Overall, I give it a solid 7/10. It isn't anywhere near as bad as you've heard.","Definitely worth watching.Ten different directors each present a segment based on their favorite opera aria.  You don't need to be an opera lover to watch this film. (Although, of course, if you hate opera, you're really going to have a bad time with this!)Not surprisingly the segments range from brilliant to only fair.  Most of the fuss seems to be over Godard's contribution -- whether you think he's brilliant or pretentious, his segment won't change your mind.Some of the pieces have a clear narrative; others are more a montage of connected images.None of the pieces is more than 10 minutes or so; if you're not happy with what's on the screen, wait for the next segment, and think about how much culture you're soaking up.Keep your eyes open for performances by Buck Henry, Beverly D'Angelo, Elizabeth Hurley, Briget Fonda, Tilda Swinton, and John Hurt.  (The Buck Henry segment alone is worth the price of admission).","It's interesting to see what different directors will do when they are told, \"make a short film based upon a famous opera.\"  It's like looking through someone's garbage...you really get a sense for who they are.Based upon what I've seen here, here's what I think about each director and their segment:Nicolas Roeg - Always an experimental guy, but, by nature, experiments often fail.  Such is the case with Roeg's segment, which perplexingly casts his wife Thresa Russell as a (male) fascist ruler about to be assassinated.  I have no idea what he was thinking, but the segment doesn't work at all.Charles Sturridge - This guy must have major skeletons in his closet.  It's the story of three children, sadly watching a replay of themselves being killed in a car accident on TV, the result of taking their parents' car out for an ill-advised drive.  It's a beautiful, intensely sad sequence, one of the best in the movie.Jean-Luc Godard - Never known for being subtle.  This is the WORST of the movies.  If you can't figure out that it's about sexual frustration, go live in a cave.  It takes something truly special to make two gorgeous women parading around naked to be so mind-numbingly boring.Julien Temple - Mainstream director somehow having backed into the arthouse scene.  This entertaining bit of absurdity plays like an elaborate Saturday Night Live sketch, with a husband and wife out cheating on each other at the same hotel.  It's funny and sexy, and surprisingly at home with the more cerebral segments.Bruce Beresford - Great respect of love, sex and sensuality.  Pleasant enough, basically the story of a woman (Elizabeth Hurley) giving herself to her lover for the first time.  Nice buns on Elizabeth, but it's a wonderful little sequence regardless.  Gorgous photograaphy.Robert Altman - Tell this guy to do whatever he wants, and he'll be at a loss as to what he wants to do.  Utterly pointless, boring and irritating short about the inmates of an asylum sitting in a theatre awaiting the night's performance.  Nothing but a series of swooping camera shots and people acting crazy.  Really bad.Franc Roddam - Pessimistic and cynical, especially when it comes to love. Beautifully shot sequence about two young lovers who travel to Las Vegas to have one last night together before committing suicide.  Subtly gives us hints as to why they do what they do (life is a pointless series of tragedies which leads up to old age), which makes the sequence all the more heart-breaking.  Bridget Fonda's film debut, and it seems she was pretty enthusiastic about taking off her clothes right off the bat.  Nothing wrong with that!Ken Russell - Seems to have known most segments would be deadly serious and pretentious, so decided just to goof off.  Russell fans will love this sequence, others will probably just be bewildered.  Nothing to read into here, a woman is on the operating table after being in a car accident, and has hallucinations about being adorned with jewels as opposed to being stitched back together.  Well shot and genuinely imaginative.Derek Jarman - Simplicity is the key.  An old woman thanks happy thoughts of her younger days as an actress.  That's it.  Simple, charming, moving.Bill Bryden - Let's hear it for the has-been.  A dying actor (John Hurt) performs the famous opera from Pagliacci (the sad clown) to an empty theater, after which he drops dead.  It's a brutally sad sequence about the devastation a performer feels after they have been forgotten by the public.Overall, it's an interesting movie.  The girls' bare bottoms and guys' ripped pecs of Godard's sequence will help both men and women get through it, but Roeg's and Altman's misfires will have you reaching for the fast-forward button.","I have long wanted to comment on this film but have found doing so extremely difficult. When released it was promoted as a major work of art, whereas in practice it is a hodge podge of short sequences, unrelated in either style or content, so why bother with it? By its nature it could never have been a great film. Think of any film that you personally regard as a great work of art and imagine what it would have been like if it had been divided into ten segments, each created by a different Director commissioned to portray a different but fundamental aspect of human existence................Aria \"bombed\" badly when it was first released - I left the cinema feeling that, despite many interesting sequences, I would not want to see it again. But some sequences proved very seductive, and I rented a tape to re-watch them a few months later. After this happened a second time I knew I must have my own copy; this has since become one of the most frequently viewed tapes in my private collection. The film comprises a collection of short segments, each presented against the background of a well known operatic aria, but illustrating or featuring some vital aspect of life as we live it. We can quickly decide which of the various segments mean most to us, but we need much longer to decide why and in what ways the others are less satisfactory. Such thoughts keep returning even when we believe we have basically forgotten the film, and ultimately make it virtually unforgettable. Clearly, even though we are not dealing with a great film, it is a very important one.The only link between the ten segments of this film is the fact that each is presented against the background of a well known operatic aria. I would have expected opera buffs, who are totally familiar with each of the arias (and their context in the opera concerned), to have been much less enthusiastic about the very different and individualistic interpretations created by the selected directors than other viewers who are not really familiar with opera as an art form, and who accepted the aria concerned simply as background music. But from comments already recorded in the IMDb database this does not seem to be the case. Opera buffs as described above mostly seem to be significantly more appreciative of the various segments of this film than other viewers. This suggests both that the main appeal of opera lies in the music rather than the libretto; and that opera lovers are more ready to associate the arias with the emotions which the individual film directors are attempting to arouse, even when these are not those of the original opera.Ultimately we are left with ten short films by leading directors, each visually creating an emotional experience associated with ordinary life. Inevitably each viewer will find that some segments will appeal whilst others do not. For each viewer the segments which appeal most will depend upon their individual character and life experiences. There are no rights and wrongs in this respect; and reviews of this film which suggest that segments A, B and C are excellent, whilst X, Y and Z are failures, are of very little value. A more helpful approach seems to be listing those aspects of life that the ten directors felt were brought to the forefront of their attention when they first studied their aria, and subsequently attempted to interpret visually in their segments. Not surprisingly love seems to be the most important of these, it is featured in half of the ten segments. One shows the love between a newly married couple; a second shows a not much older couple who have retained their love but have become disillusioned by the life they have lived, have few expectations for the future, and are prepared to end their lives together; a third shows the pain of unrequited love; a fourth the faded love between a married couple who are cheating; and a fifth the obverse side of love, obsessive hatred that has festered to the point where one human being is driven to plan the final destruction of another. These segments (as well as some of the others) feature extensive nudity and have led to comments that the film is little more than soft porn. This seems unfair - nudity still has a strong emotional impact and is therefore a useful tool for a director faced with creating imagery that effectively conveys the message he intends within a very brief ten minute film sequence.Another universal aspect of human life is death, not surprisingly this is also recognised in several of the segments, Other emotions featured in these ten segments include humour and pathos, the subconscious urge felt even by the most beautiful women to adorn themselves, and the tranquility that old age can bring to those who feel they have done the best they can with their lives. An interesting challenge for those who do not know this film but are familiar with other works by the directors involved would be to watch these various segments and then try to identify the director responsible. Overall, it would be hard for anyone to watch this film without experiencing a strong emotional reaction to one of more of these segments; and it would be almost impossible for any individual review to do this film justice even if IMDb relaxed their length restriction on comments. This above all is a film where I would have expected that the opportunity to exchange comments about the various segments on the IMDb message board would have appealed to all those who have viewed it. For some reason this does not seem to have been the case.","10 respected directors each shot a short film with operatic arias as the inspiration (and music). I'll do each one separately:Nicolas Roeg (dir)--Giuseppe Verdi (music). A story about an assassination attempt in 1931 Vienna. Theresa Russell (Roegs wife) plays a man! Not bad--very beautiful and exotic. Russell is great.Charles Sturridge--Verdi. No story but there is some haunting black and white imagery that fits perfectly with the music.Jean-Luc Godard--Jean Baptiste Lully. Horrendous. Pointless, boring, no plot, no nothing. Filled with gratuitous female nudity. The worst!Julien Temple--Verdi. Buck Henry, Beverly D'Angelo and Anita Morris star in this funny, if obvious, story about a cheating couple. Pretty good.Bruce Beresford--Erich Korngold. Short, lush and romantic. Very good.Robert Altman--Jean-Philippe Rameau. Dull. A yawner.Fran Roddam--Richard Wagner. This has Bridget Fonda in her film debut. Beautifully done love story with a fairly explicit sex scene. Ken Russell--Giacomo Puccini. Really strange but OK.Derek Jarman--Gustave Chapentier. Lyrical look at youth and old age. Very sweet. The last is by Bill Bryden doing \"I Pagliacci\". He has John Hurt (!) dressed as a clown lip-syncing to Caruso (!!!).When this came out it almost got an X rating (for the abundant nudity and the sex scene). It was given an R with a strict warning attached saying the R rating would be heavily enforced. After the film bombed that warning disappeared.The idea isn't bad and 6 out of the 10 segments were worthwhile. Worth seeing even if you don't like opera. Just avoid the Godard segment. I'm giving it an 8.","Guess a few upscale film directors were sitting around sipping their absinthe, grappa, aramangac or jungle juice some night in the 80's during the Cannes or other film festival and one said \"Hey, guys let's do a movie where each of us creates a segment around a world class aria.\" Welllll...it kind of sort of worked. Clearly someone was smart enough to select some of the best recordings of the arias chosen, for example Bjoreling's Nessun Dorma, so if you were blind and lying on the floor just listening to the DVD you got more than your money's worth. Not every director succeeded but more did than not and the flick seems to improve with each viewing over the years. My favorite is the eerily beautiful love duet from Die Todt Statd; okay a young naked Elizabeth Hurley is eye candy but her husband singing to her, his wife's ghost, is incredibly beautiful with the love music second only to Otello and Desdemona's \"Gia nella Notte Densa\" in all the operatic repertoire. Could the flick been better, sure, what couldn't not have been but it's well worth a view especially of you're in a hyper-romantic mood.","Robert Altman, Nicolas Roeg, John-Luc Goddard--you were expecting a fun film the entire family could enjoy?  These and other directors were obviously chosen because they have not followed the mainstream, but created it. For those that complain that they did not adhere to the original story of the opera--How often does the music in a film directly relate to what is going on in the film?  It is the mood that counts.  This is what I believe the directors of these movies were doing:  creating a contemporary mood for old operas.  For the most part they succeed wonderfully.  With all these operas, who is going to like them all.  We could have used more Beverly Sills.Finally, what is art (even opera) without a few naked women?","If you like Opera, all the arias will be familiar. The treatments the ten directors give to one aria each, are totally removed from their original context. Nessun Dorma from Turandot becomes the vision of a girl in a near-fatality - gripping imagery culminates in the final VINCERO! of her survival . . .John Hurt lip-synching Vesti la Giubba from I Pagliacci is perhaps the low-point, but the madly bawdy Robert Altmann scene fails too - the rest is a lavish treat! The tragedy of children dying is captured in gritty black and white to the serene  melody of Verdi's La Vergine Dell' Angeli, the remarkable outcome of an assasination attempt at a King's life is done brilliantly to the backing of La Sua Parole from A Masked Ball . . . with  totally different ending to the one in the Opera! See this, then view it again; you will be amazed and enriched - if you like Opera, that is. If you do not, and have no desire to, then please: go back to the usual fare - this will have very little to offer you  - enjoy your Stallone and van Damme.","I saw this film when it first came out in the theaters and a recent viewing on DVD only confirms my initial opinion that it's a masterpiece, though a flawed one. So I've been baffled by the abuse heaped upon it over the years by critics and viewers and decided to finally air my own thoughts and what I feel may be the reasons for said abuselMy take on this film differs from others. First, I'm convinced that in order to fully appreciate it you have not only to love opera but see it as something essential to your life. Furthermore, you must also be willing to agree and identify with the viewpoint of the films' creators: that this all-consuming passion with opera places one's estate in today's world in a cultural time warp.Though there aren't many out there who fit this description, I feel it accurately defines the demographic of Aria's audience. I also believe that producer Don Boyd and any others who conceived of the daring idea for this film, and whose job it was to make ten scenes written and directed independently by different people somehow \"coalesce,\" knew exactly what they were doing, even though the project seems occasionally to have gone awry. (The episodes using recordings of Baroque opera, directed by Jean luc Goddard and Robert Atman, though interesting in themselves, are bafflingly out of place)Most of the episodes were cleverly organized to achieve both a cumulative musical effect and further the film's dramatic theme, which is gradually unveiled by the entre'acte activities of the seemingly enigmatic character portrayed by John Hurt who keeps appearing between episodes. A kernel of that theme arrives in the very first episode, a 20th Century reenactment of the assassination of a Swedish king as portrayed in Verdi's \"In Ballo Maschera\" (playing on the soundtrack). But contrary to Verdi, where a diffident king dies without resistance in the arms of his beloved, and in glorious song, Nicholas Roeg has his protagonist unexpectedly defend himself, shooting all of the would-be assassins dead, and thus confounding his significant other.With the exception of Bruce Beresford's take of \"Die Tote Stadt,\" none of the other episodes are dramatically faithful to their operas. Instead most seem designed to reflect an absurd disparity between the remantic sentiments of dead composers from past centuries playing on the soundtrack and the glaring realities of an every- day world gone mad: homeless children roving the streets; a couple's disastrous attempt to cheat on their spouses at a sex-themed resort; teens slashing their wrists under the neon glitz of Las Vegas, etc.As the episodes progress, the film's concern with death --- grand opera's favorite obsession --- becomes overriding. Also, recorded excerpts of busy operatic ensembles give way in the later episodes to arias sung by a single voice.The penultimate episode, directed by Derek Jarmon, forms arguably the film's dramatic climax. A single, radiant old woman, dressed in a frayed, gossamer stage costume and lit from above, is seen bowing over and over as accolades of flower pedals rain on her from on high. The beatific vision is accompanied by the aria \"Depuis le jour\" from \"Luise,\" sung by a mellifluous Leontyne Price. The woman personifies opera itself, old and tattered but reveling in her memories, taking one last bow as she bids a splended farewell to her loving and appreciative audience, unseen but undoubtedly as wrinkled and antediluvian as she.And then the final episode, in which John Hurt mimes Leoncavallo's Canio singing \"Vesti la giubba.\" As was the old woman, he too represents opera --- or perhaps the opera-loving audience itself --- over-the-top, pouring his heart out to a single, female audience member in an otherwise empty opera house. Close-ups of the woman reveal her barely concealed scorn for the singer. And when she too leaves, the abandoned man falls dead, the victim of, yes, a \"broken heart!\" Only a true opera lover could identify with such histrionics.Up to now the music used by each director had been made by recent opera stars in contemporary-sounding recordings: Price, Bergonzi, etc. But perhaps to highlight the theme of opera's passed parade, this final episode is accompanied using Pagliacci's aria sung by Enrico Caruso in a recording made nearly a century ago. Perhaps it is being suggested that the social revelance of opera has in fact died longer ago than even the films creators had imagined!","This film contains some very beautiful music (of course!) and some highly individual impressions.  It is unlikely that anyone will be enthralled by every scenario, but most viewers should be attracted to many of them. Running from slapstick to tragedy, the film illustrates life in the extreme. Don't be a newspaper critic, let your imagination loose and enjoy!","Generally when I see a videotape that has a come-on phrase like \"A superbly sensual experience,\" I take a wild guess that it will be jam-packed with images of naked women.  So, *Aria* is kind of a no-brainer.  This movie is obviously not going to appeal to afficianados of classical music--the \"videos\" are generally a little too sophomoric or melodramatic; so the target audience is guys who want to see plenty of naked women.  I would recommend this film to anyone who has watched the Annenberg/CPB project \"French in Action\" series, because the ravishingly beautiful girl who plays Mireille doffs all her clothing in a sublimely ridiculous sequence involving bodybuilders.  One or two of the pieces really do work on an artistic level. The \"Liebestod\" piece is mournful, tragic, and very affecting; \"La Virgine degli Angeli\" is chillingly beautiful; and \"Depuis la Jour\" is downright heartbreaking.  But the rest run the gamut from silly (Robert Altman's time-wasting sequence; the Buck Henry bit) to completely awful (\"Die Tote Stadt\" features the most terrible job of lip-synching ever--but hey, there's a naked girl!; the weightlifting sequence hardly plays any music and makes absolutely no sense--but hey, there are *two* naked girls!).   The biggest travesty is the inclusion of \"Nessun Dorma,\" possibly the most beautiful piece of music ever composed, in a video that looks like Mister Rogers' nightmares.  Although it has its moments, *Aria* is basically a chance for these directors to show a lot of female flesh and justify it as art.","I saw this movie in the early 1990's when it had been out on VHS for a little while. At the time, I found it to be interesting, and was especially struck by the Ken Russell segment, with the visions of the accident victim in triage and surgery.Last night, at a 2nd-run showing of the latest Indiana Jones movie, the vision of John Hurt prompted an unexpected flashback to \"Aria\", which I had not thought of in years, and the sudden memory of the Russell piece itself was enough to cause an outbreak of tears for a little bit.If I can make this observation, I note with interest the love-hate reaction that people have expressed to the Russell segment, and I have found this interesting difference in other movies that delve into deep trauma and its aftereffects. Some GET it, others DO NOT, interesting.I see by the comments and the rating that the overall work hit people in various ways. This is how it affected and affects me.","Opera and the emotions its kindles in the human soul, as seen through an artistic kaleidoscope. The various segments are different in style, range and scope ; sadly, they're also uneven in quality. Some of the segments charm, move, shock or mesmerize ; others do not. As a result the movie, considered as a whole, does not fully live up to its promising premise.However, there are images and ideas to savour, especially for people who like opera. I leave it to you, dear reader, to pick your own favorite. Me, I'm fond of the treatment given to Verdi's \"Masked Ball\", which is funny, witty and lushly romantic. It also teaches an important life lesson : if you're going to shoot at a monarch, pick on someone who didn't fight his way to the top.","I watched ARIA for the first time on DVD and boy, did that movie ever put me to sleep. This is not a criticism. The film is OK but the I can't imagine anyone not feeling sleepy while watching it. It's slow, sorta hypnotic and soundless. There's basically no dialogue. The film is only visuals and classical music, which combined together create a very calming, peaceful experience. There are very few moments when the film rises above sereneness.Nicolas Roeg - I didn't like it.Charles Sturridge - Interesting but it's very short.Jean-Luc Godard - The kookiest segment. Fun to watch.Julien Temple - Typical Julian Temple nonsense. This segment looks like a wacky music video. Didn't like it.Bruce Beresford - Elizabeth Hurley is naked. That's all I have to say!Robert Atlman - ForgettableFranc Roddam - Probably the best segment. Very slow and calm, though.Ken Russell - Tacky. Only Ken Russell would think that tacky plastic jewelery would look good. And the nudity is totally gratuitous.Derek Jarman - I didn't like it.Bill Bryden - I don't even remember this one. I was probably asleep by then.","Okay, on one level, this movie stinks.  Plot, substance, ability to keep one awake...fails.  We are aware that 10 directors had their hands on this film but I don't believe it.  I think John Derek (Bo Derek's \"Boloro,\" \"Tarzan the Ape Man,\" etc...) had directed it.  I mean think about it...gorgeous naked women, great scenery, pleasant cinematography.  This is a Derkesque film if there ever was one.  On another level, the visuals are sometimes stunning.  The scenery, location shots, nude women....very tasty.  Elizabeth Hurley and Bridget Fonda (in their young and earliest performances) strut their naked selves which alone is worth the price of admission.  The music and storylines suggest an endless sadness that never turns itself around. My suggestion, keep the sound off, fast forward to the scenes with nude women (lots of scenes so it's really a matter of fast forwarding over the few non-nude scenes), and enjoy.  Guys directing gorgeous woman to get naked.  If you are a guy, you got to love the film business.","Leonard Maltin's BOMB rating for \"Aria\" has kept me off this movie for years, but it's not really all THAT bad. It's not as good as it could have been, either. I believe the main problem is that in some of the shorts the filmmakers fail to make a strong connection between the music and the images; opera buffs may still love listening to some of their favorite pieces, but they might as well do it with their eyes closed. But they - as well as the other viewers - should keep them open for at least three segments: Julien Temple's amusing bedroom farce, lowbrow in its content but sophisticated in its camera work and featuring the super hot Beverly D'Angelo, Ken Russell's imaginative visual extravaganza (with a perfectly timed finale), and Derek Jarman's elegiac salute to youth. Most of the other contributions are fair-to-middling, but the worst of the bunch by a wide margin is Godard's inexplicable homoerotic infomercial. It's the one segment that I would advise anyone to skip. ** out of 4.","Omnibus/compilations films are rarely, if ever, consistent and Aria is not an exception. It is a fun and interesting film to watch though, and while there are a few misfires it is to me better than the IMDb rating and some reviews suggest. It is understandable why there'll be people who won't like it, especially for those looking for faithful plots to the operas featured or those who don't like classical music but those who love great music, great visuals, great singing and some interesting ideas will find a lot to enjoy.As expected, Aria is very uneven but actually of the ten segments only three didn't work at all from personal opinion. Those three were Roeg's Un Ballo in Maschera, Godard's Armide and (surprisingly) Altman's Lea Boreades. Un Ballo in Maschera has Verdi's wonderful music and the singing of Robert Merrill, Carlo Bergonzi, Leontyne Price, Reri Grist and Shirley Verrett going for it. Otherwise, it had ideas that weren't nowhere near explored enough; it was convoluted(Verdi's opera may have an implausible story but it was much easier to follow); it is one of the least accomplished looking segments in the film; Theresa Russell with a moustache and as a male fascist ruler was something that was quite distasteful and weird and it was directed in a way that I had no idea what Roeg was trying to do and because of the chaotic feel of the whole segment Roeg probably had no clear idea what he was doing either. Les Boreades is an example of something with an okay if strange idea that has nothing interesting done with it. Altman is a great director but he directs with little imagination or interest here(it feels very music video-like), not much happens and when something does you don't have much of a clue. And it's pretty much the same with Armide, the second-silliest of the segments after Rigoletto(though that was actually funny) but also manages to be duller and more incoherent than Les Boreades and it's very repetitive. Plus it's at odds at with the music and the story of the opera, the opera I consider a tragedie en musique but here Godard does it the opposite, except apart from the odd funny moment it's like a comedy with nowhere near enough laughs.However, there are some very strong high-points. Personal favourites are Roddam's Liebestod and Russell's Nessun Dorma sequences. Liebestod is an absolute wonder visually and matches Wagner's magnificent music brilliantly, of all the segments it's the segment that matches the music the most effectively. The tragic love story is beautiful and moving and Bridget Fonda makes for a highly credible debut. Leontyne Price's rich, powerful voice gives a very haunting quality as well. Nessun Dorma is wonderfully surreal and of the segments is the most imaginative visually. It is a wonderful-looking segment that while having Russell's very marmite style all over it it doesn't feel too over-excessive like some of Russell's films have been prone to. The aria is the most well-known of the ones featured and Jussi Bjorling's rendition with that thrilling top B is one of the best along with Corelli's and Pavarotti's. Sturridge's La Virgine Degli Angeli also looks stunning with a hypnotic dream-like quality, it's not as imaginative as Nessun Dorma but is a very, very close second to Liebestod as the most striking segment. It's also very touchingly done and Price also sings the aria and it's heavenly, one of the best of the aria there is. Wonderful also is Jarman's Depuis Le Jour, the most emotional and reflective of the bunch story-wise. Like Les Boreades there is a music-video feel in places but it's actually in an interesting way.Regarding the other three segments they are neither masterpieces or disasters and on the whole work well. Temple's Rigoletto is highly entertaining, wonderfully filmed and cleverly shot. But it is a very acquired taste, if you dislike vulgar you will dislike this. The farcial comedy shows actor with good comic timing, and the segment is worth it for Beverly D'Angelo who is hot with a capital H. As well as Verdi's music and the singing of Robert Merrill, Anna Moffo and Alfredo Kraus. Bryden's Pagliacci is not convincing lip-synching-wise but has a very moving performance from John Hurt and the segment is both intimate and subtly dramatic. There couldn't have been a more perfect choice of aria, and who better to sing it than one of the most beautiful tenor voices ever Enrico Caruso? Beresford's Die Tote Stadt is beautifully shot, especially the shots of the flying doves, the scenery is magical, Korngold's music is predictably fabulous as is the singing and Elizabeth Hurley is entrancing. It's also charming and touching. It is very slight though and Carol Neblett's voice does not fit Hurley at all, angelic it is but it's too mature.To conclude, very interesting and fun, it mostly looks great and is faultless musically, but is very much variable. It was difficult as to rate it either a 6 or 7 but because although the three misfires really bring Aria down to a considerable degree the music, singing, most of the visuals and four high-points segments were so good that I'll award Aria a 7/10. Bethany Cox","The MTV era needed some grounding with an MTV version for opera arias, and Aria here was the answer. Whether these ten chosen arias are the best of the best is arguable, I can personally attest that after hearing these, I went out of my way to seek the operas where several came from (those that I wasn't familiar with, at least) and bought those operas to enjoy in their entirety.The \"Die Tote Stadt\" duet was the most compelling and mystical for me. That aria (and not the nudity involved) compelled me to seek out the opera and it is now one of my favorites.The \"La Vergine degli angeli\" by Verdi is also a most mesmerizing aria, although the opera itself, \"La Forza del Destino\" is rather boring. This aria did compelled me to seek out the opera to experience it in full.The best segment, for me, was the Ken Russell interpretation of \"Nessun Dorma\" (Let no one sleep). Using the imagery of a near-fatal car accident and the need to not let the victim die was both poignant and novel. I had heard Nessun Dorma before seeing the movie, but did not know of its context. This aria interpretation was very novel and was deeply moving.Equally deeply moving was the Liebestod from Tristan and Isolda. Lastly, how can one dismiss Julien Temple's \"La Donna e Mobile\" with Buck Henry and Beverly D'Angelo. It was quite comical.","\"Aria\" as a whole is a pretty underwhelming experience, as most compilation films are. No one segment is very long, so the whole thing is painless to sit through, but I can't really bring myself to recommend it to anyone.The standout segment for me was Ken Russell's, which depicts a woman hallucinating while on the operating table after a terrible car accident. It helps that the segment is set to \"Nessum dorma,\" one of my favorite opera pieces -- I would find a filmed toaster glorious as long as it was set to that particular piece of music. Franc Roddam's segment is pretty decent, and features Bridget Fonda in her film debut. I liked Jean-Luc Godard's segment, which is set in a gym and features a bunch of body builders completely oblivious of the naked women dancing around them -- perhaps a comment on male narcissism? Robert Altman's segment, which is primarily the reason I wanted to see this movie at all, is utterly forgettable -- the only notable thing about it is that you can tell he was filming \"Beyond Therapy\" at the same time, as many of the same actors are in both. Nicholas Roeg's segment, which opens the film, is pretty bad, as is Julien Temple's painfully unfunny contribution (though it features a smokin' Beverly D'Angelo), while Bruce Beresford's is just boring. Watch Derek Jarman's segment for a glimpse of a very young and pretty Tilda Swinton.There's not much to say about films like this. Some portions are better than others; none of them are masterpieces.Grade: B-","Since only straight men seem to have reviewed this film with an eye towards appreciating the nudity, I just want to direct the Gay to segment no. 7, the Liebestod, directed by Franc Roddam. It features a young actor named James Matthers - he's young, got a gorgeous body and face, and you actually get to see some peen.Enjoy.Other than that, I'd say most of this is either just boring or else full-on sucks. Ken Russell's segment was interesting. I also think the above mentioned segment was quite poignant in addition to featuring male nudity. The rest you can keep.","I saw this film when I was in college at the University of Washington when I was 20 years old, back in 1988. I was so touched by it I later bought a VHS copy. As SOON as I saw the movie I knew I had to own a Mercedes not because of the pretentious nature of the car, but BECAUSE OF THAT FILM. I decided if I'm going to die in a car, it's going to be with some style and pathos. And needless to say, the aria La Vergini degli Angeli from La Forza del Destino was the most common played song in my Mercedes (that and the Flower Duet from Lakme). I have owned three more Mercedes after that first one (each one newer as I grew more prosperous), all for the same reason.... But it was that first Mercedes I remember most because it was an '83 (all I could afford back then when I graduated in '90) and it looked nearly identical to the one in the film.I really didn't care much for the other pieces in the film (a little too pretentious and, frankly, in one case gratuitous with what I considered unnecessary nudity) but that one black and white piece left an indelible impression on me that will last the rest of my life. It's so, so sad......yet beautiful.I would invite ANYONE with a love of Opera (especially aria's to check it out). That Mercedes piece would touch anyone (my wife loves it).Nick","Ten directors make short films based on their favourite operatic arias. Lots of pretty pictures, but most of the segments are either pointless, senseless, or dull. Exceptions: the contributions of Jarman, Russell, Sturridge, and Temple.I took very brief notes on each: \"Un ballo in maschera\": dull, clumsy, amateurish-looking and incoherent. D- \"La virgine degli angeli\": weird, dream-like story works; good cinematography. A- \"Armide\": weird and seemingly pointless, though not boring and vaguely artistic. B- \"Rigoletto\": this funny segment tells the most straightforward story. A- \"Die tote Stadt\": pointless, uneventful pretty pictures. D+ \"Les Boréades\": pointless incoherence. D \"Liebestod\": baffling sex and death story with pretty pictures. C- \"Nessun dorma\": clever, disturbing abstract art. B+ \"Depuis le jour\": somewhat effective. B \"I pagliacci\": slightly affecting opera scene is too simple. C+","Although I'm not going to talk about EVERY segment, thank goodness! Aria, as a whole is of course, a somewhat uneven glorious mess, done by 10 directors, 10 different arias, and 10 different stories. They all seem to have one thing in common. Lots and lots of naked women. Not really sure if this was just a bizarre coincidence or if it was a requirement, but Aria seems totally nudity heavy.Anyways, I found the segments set in the present much more enjoyable then the ones in the past (which makes the arias that much more pretentious). My favorite, of course, was the ultra-bizarre Bud Cort / Beverly D'Angelo pairing about the cheating spouses. Lots of fun there. Close behind was the strange beauty of the Las Vegas one with Bridget Fonda. Again, not all of it (John Hurt anyone?) works, but some of it is interesting enough.","OK, yes I know I'm a Philistine, and I have no knowledge of, nor love for opera. I readily admit that I might feel differently about this film if I did. But I don't. So, for those of you like me, skip this one unless you want to look at the pretty (sometimes unclothed) girls. For what it's worth, I thought the first segment with Theresa Russell (who I didn't recognize) was the best of the lot."],"review-user":["jkcraft","zetes","gleng1","squeezebox","bbhlthph","preppy-3","fiorerr","rlcsljo","adew","jferraira-1","robngail","Tug-3","anderbilt","myriamlenys","Maciste_Brother","SanDiego","gridoon2018","TheLittleSongbird","edew-564-801383","evanston_dad","willcwhite","ntanner-1","claudemercure","Spuzzlightyear","smatysia"],"review-date":["2 August 2003","20 July 2001","30 November 2002","25 December 2003","12 March 2006","23 September 2002","27 November 2006","25 August 2002","30 March 2001","28 March 2013","18 November 2001","2 November 1998","9 August 2008","28 December 2017","9 September 2003","23 December 2000","4 June 2016","19 July 2014","4 January 2013","28 May 2008","9 January 2011","11 January 2009","7 May 2010","10 November 2005","24 March 2003"],"review-rating":["8","7","8","6","8","8","7","9","7","8","5","5","7","10","5","5","6","5","4"],"review-title":[" erotic tension, great arias\n"," Much better than I was lead to believe\n"," 10 Segments -- Brilliant to Fair\n"," Some of it is extraordinary, some of it is awful\n"," Art is always challenging!\n"," Uneven, but worth seeing\n"," Great Fun, IF..........\n"," What art is about--challenging the viewer\n"," TEN arias, TEN directors - a FEAST!\n"," Opera's Passing Parade\n"," Over the heads of most viewers, but worth owning.\n"," Awfully strange, but it has its moments.\n"," uneven, yet impactive\n"," startling and interesting, but uneven\n"," Sleep inducing. Not that there's anything wrong with that\n"," Male directors forcing gorgeous women to get naked. Gotta love it.\n"," Ambitious venture that doesn't quite come off but has its moments\n"," A very uneven film but very fun to watch\n"," A very good attempt at MTV-ifying opera arias.\n"," Suffers the Fate of Most Compilation Films\n"," Review for the Gay\n"," I HAD to own a Mercedes\n"," pretty pictures, but mostly pointless, senseless, or dull\n"," Naked Women humina\n"," Artsy-fartsy crap\n"]}