{"review-url":["http://www.imdb.com/title/tt0062141/reviews"],"review-text":["One of the best of the 'kitchen-sinks'. Fantastic views of London and invaluable snippets of working class life of the 60's. Loach's eye seems to capture everything, yet makes no judgment - a taste of things to come. As with 'Kes', 'Riff-raff' and 'Sweet Sixteen', it serves as a cinematic social history of Britain. Carol White is completely convincing, you love her, fancy her, want to take care of her, but hold your head at her self-destructive decisions and still follow her in some vain hope. Well backed up by Terence Stamp, ( fresh off 'The collector', also catch 'The Hit' ) and a plethora of English faces ( all looking very young ). Pefectly set to Donovan's dulcet tones. Stamp sings 'Yellow is the color', in a lovely scene, ending with him saying, \" Getting better, ain't I \" ( song also used in 'The rules of Attraction' - I think ) Watch Carol Whites screen mum getting ready to 'go out and get a bloke', putting on her false eye-lashes to the sound of 'Rosie' on the radio - priceless. A treasure for anyone who was around at the time and a reminder of how good life is now in England. Incidentally Soderburgh used clips from 'Poor cow' in 'The Limey'.","In terms of style this film is revolutionary of the time. It could be defined as docudrama since the film is shot in a style of realism. It portrays 1960's London as a poverty stricken bed of prostitution and crime. The main female protagonist seems to always seek male approval. She leaps from one bed to another, loving each of them in much the same way as Diana does in \"Darling\" 1965. It is hardly an example of feminism and the Radical changes in women's liberation within the 1960's. It does, however, possess a view of hope through all the grit. Dave shows how even a criminal can be loving, gentle and kind. The film offers the audience a 2 hour exploration into the lives of the criminals in London at the time. It challenges the classic Hollywood narrative of peace, disruption and resolution. The narrative structure seems to float along with very little climaxs. This gives the feeling of realism, which many people may find dull or boring. Don't expect your Hollywood Blockbuster. You will find a challenging Independant British film, documenting the feelings of the 1960s in an innovative and unconventional way.","Loach's film attempts to depict the sorry life of Joy, a young woman involved in the shady world of criminals and petty crime. How sorry one can feel for Joy is debatable as it is a life she has freely become associated with, first through her marriage to Tom and later, when Tom is imprisoned, through her relationship with his mate, Dave. What is so interesting about the film is the settings, Loach's realistic style and the naturalness of the key performances.  Having an almost documentary feel about it - the (possibly unintentional) intrusion of the boom mike in one scene adds to this style.  Also the street scenes of the kids playing in an alley comparable to a \"20 yard toilet\" could have been filmed in any run-down working class tenement block of the sixties.  The film itself had a raw energy, especially when Joy is searching for her son amongst the demolished houses. Loach manages to present a realistic portrayal of working class urban life during 60's Britain which is well worth a look at.","Recently released on British DVD, this is a good movie (as long as you have an attention span and IQ of more than a fruit fly). Not as depressing as it could have been, this is kitchen-sink at its most dirty. Terrance Stamp is great in it, the music is sweet, Carol White is very believeable as the single mum tart who can't stop loving criminals.My favourite scene is where Carol and her friend who works in the pub with her (the one with the enormous beehive hairdo which comes down over one eye) sit outisde and gossip about all the men who walk past.The only thing that marred this was the shakey acting of Carol's first husband, but if you can get past that, you're OK. And Donovan provides some of the most languid, mellow, bittersweet lyrics to come out of the 60s.","Ken Loach showed the world the down-and-out flip side of Swinging London with \"Poor Cow\", about London woman Joy (Carol White) hooking up with a thief and having a son with him, only to see the man end up in the slammer. While his friend (Terence Stamp) manages to help her out some, he proves to be little better in what a loser he is. It soon becomes clear to Joy that she's going to have to make a serious decision about where she's going in her life.One thing that I determined - I don't know whether or not this is accurate - was a use of irony in the movie. Her name is Joy, but she experiences no joy in her life. Even if that wasn't intended, it's still a movie that I recommend to everyone. Featuring songs by Donovan (one of which - \"Colors\" - appeared in another Terence Stamp movie: \"The Limey\" (which, incidentally, came out in 1999, when I was as old as my parents were when \"Poor Cow\" came out)).","Back in the 60's, this grim study of Joy, a young proletarian wife, was the introduction to the career of Ken Loach, who became one of the most distinguished and respected British filmmakers of all time. By then I knew very little about Brecht, politics or the reality of the under-privileged, and I was quite impressed by the aesthetics of the film, its free style, its austere color cinematography, and Joy's monologues in front of the camera. I was also much surprised to find that Terence Stamp (who had become a celebrity, thanks to \"Billy Budd\", \"The Collector\" and \"Modesty Blaise\") had so little screen time. Although 20th Century Fox distributed \"Poor Cow\" in Panama, Loach did not join mainstream cinema (which this film hardly is) and I lost contact with his films. I just heard of his successes, \"Kes\", \"Family Life\", \"Black Jack\". until I caught up in the 80's. The beautiful title song by Donovan, by the way, is available in his anthology \"Troubadour\".","Not a film of entertainment, but of real lives & limited ambition for the working class in 60's. Enjoyable because of my upbringing, not sure it'd work for most people. Typical Loach. Full of TV actors/actresses of 70's/80's/90's.","You know what to expect when the first scene in Ken Loach's \"Poor Cow\" is a graphic image of Carol White's character giving birth to her son, although for my taste this was taking documentary realism to extremes. For the remainder of the film we follow White's progress, if that's the right word, for the next few years as she lives a mostly tawdry life on the edge of both poverty and legality, interacting with a mostly dubious set of individuals in not-so-swinging London in the mid-60's.The narrative is somewhat awkwardly interspersed with chapter plates, presumably written by White, although these don't actually aid the structure of the piece as the film progresses pretty much on a tangential basis although as an insight into her character's naive optimism and childlike simplicity, they may serve some purpose. Loach's soon to be trademark fly-on-the-wall camera-work is never still, long-shots, extreme close-ups, walking shots, tracking shots all to convince us like his acclaimed TV documentary \"Cathy Come Home\", of the previous year (with the same actress in the lead) of the veracity of his subject, stripping away all cinematic artifice. In this he succeeds, inviting no pity for her, only portraying her making do and working with what she has, with little prospect of escape.Of course this unremittingly bleak outlook can be overbearing and cold and there are many scenes where he could and should have called \"Cut!\" earlier, but as an insight into the working class of supposedly affluent Britain, it's important to hold up a mirror to society as he does here.In the final scenes, when White is reunited with her temporarily lost child, we are brought full-circle to that shocking opening scene as he reminds us that family love is perhaps the only true love. Whether it will be enough of a basis for White to break out and make a life for herself and her son is debatable so that some sort of a sequel might have been interesting to consider.The cast is an interesting with one with Terence Stamp demonstrating his range as the crook who White falls for and who shows her a kind of loving, even as the film makes clear in the only stagy scene in the film, his courtroom trial, that there are no victimless crimes. As in \"Cathy Come Home\", White holds the viewer's attention with her disarming honesty, vulnerability and spirit. Interesting to see the notorious John Pindin in a prominent role too.You don't watch a Loach film for comfortable viewing but as an agent-provocateur, turning over stones most would step over, he's an important director in British cinema.","It is worth noting that The Limey (1999) is a follow up to Poor Cow.  The writer of the later film has stated that the similarities between these two films is incidental.  However, Steven Soderbergh (the director of The Limey) has said that he specifically intended for his movie to be a sequel to Poor Cow.  If you liked Poor Cow you might also want to see The Limey.","Swinging London of myth, was for most at the time, a fantasy. It involved a small number of people, in a small area of the city, for a short time. But as many of those who were of this group, went on and maintained long careers in film, TV, Arts and literature/journalism, it's effect and scope was and has been much magnified.Trust Ken Loach (who else?) to shine a light in the London of the mid/late 60's' for many people, was the reality. Not just the criminal element either.Loach after all had form here, with his groundbreaking TV plays such a 'Up The Junction' and 'Cathy Come Home'. Showing the darker side of London that was then, still, an industrial city in parts.Carol White, as lead Joy, had also been in those Loach films, she was a working class Julie Christie and carried off the role of this troubled young woman with aplomb.White really was a fine actress, sadly like the roles which made her famous with Loach, the real woman was as troubled. Not due to poverty, a different kind of trouble, the numerous affairs, the decline in her career, to die from alcohol abuse at just 48 far from her London roots. It does change you way you view Poor Cow with this knowledge.Terence Stamp as Dave is excellent - though such was his stardom by then he would turn up for filming in a Rolls Royce! The notorious John Blindon (surely the most stark example of Loach's use of 'real' people who often had the same lives as they acted on screen), struggles as an actor in his first role, though again, with the knowledge of the real Blindon this is less noticeable.The Loach 60's standards of lots of sequences of real life, lots of cameo characters, loose plotting, are much in evidence.This is not a film for everyone, if you think you'll see another classic British gangster film, you'll be disappointed. But this was a radical, daring, atmospheric film, more of historic interest than greatly entertaining, worth a look.","This film can only be appreciated by someone who lives or has lived in London, especially in the late 60s.  The important thing about Poor Cow is not so much as what's happening close up on screen involving fairly inane characters, but what's happening behind them.  The film is a rich slice of what life was really like for people who knew little of or could afford less of the so called swinging sixties.  I dont think Ken Loach wanted people to identify or feel sympathy for the main character; The woman is basically good hearted but this nice trait is soon destroyed by her lies (to Dave in Prison concerning other men) and by her stout working class expose \"All you really need is a man, a kid and a couple of rooms\"Dont forget, this film will mean nothing to anyone who dosen't actually remember how bad some parts of London actually were in the 60s and dont blame our poor cow for her blinkered closed outlook.  This film was well before the days of career women.  A career woman of the 60s would likely have been regarded a closet lesbian and little else.  The film was made well before the days of women's emancipation and I think most modern day audiences will miss that.  You cant appreciate this film until you actually THINK POOR SIXTIES..... when the internet would have been used for fishing. Watch it again....I swear you can smell rotting vegetation all the way through it.....or was that my Cats.","If, like me, you grew up in London during the 60's then this film will strike a chord with you and what music it makes! Here we are not in the swinging 60's but the struggling 60's despite the promises of social justice. Here the focus on those left out of the prosperity and boom years of post war Britain. Terence Stamp, here at the beginning of his long and brilliant career, brings so much to his character and reminds us of the optimism and drive that was abundant in this decade even while serving out his prison sentence. At the forefront lie the attitudes, and bigotry of this decade and despite so called, \"sexual freedom\", attitudes to women remained entrenched in the past. Ken Loach manages to balance what essentially is the failings of the system against the never ceasing optimism of Joy (Carol White). It is clear that all she wants, , like everyone at this time, is a piece of the pie, yet somehow she never really seems to get it. Bad choices, bad decisions, and bad men, yet though all this hardship and sorrow, she says strong for her son, because in the end this is all she has. This is perhaps one of just a handful of films that brilliantly documents this decade.","This documentary-style film, based on Nell Dunn's novel, almost views like a home-movie. As I watched it, I kept checking to see how far into the movie I was and how much longer it would last. This, in itself, was not a good sign. However, Loach does use the environment and surrounding people effectively, with several close ups showing the hopelessness or boredom on people's faces. The main method of the semi-documentary is a series of episodic clips arranged in chronological order; often title cards are used to introduce the episodes. To me, the title cards suggest captions one might find in an old photo album. They are sometimes humorous and sometimes painful, but they help move the story along.The film relates the story of a young North-of-London lower class woman, Joy (Carol White) in the early 60s. She is a victim of her class in that she has never learned to think about aspiring higher. Yet, she does persist and survive. At the beginning of the film, Joy is in the delivery room giving birth to her son, Johnny. I'm not sure if mass Western audiences, at that time, had seen many human births, up close and on screen. So, that may have been new to movie goers at the time. The next scene shows Joy breastfeeding Johnny while her husband, Tom (John Bindon), scolds her for exposing herself, since he was expecting his mates to drop by the house soon. There are early clues that Tom beats and abuses Joy. Although the couple is doing OK financially, things radically change when Tom and his mates rob a store and Tom is caught and sent to prison for several years.Without marketable skills, Joy drifts from job to job (waitress, model, etc.) as she hocks all of her belongings to make ends meet. When she re- meets one of her husband's old crime mates, Dave (Terence Stamp), she falls in love with him and they live together. Unlike Tom—whom she is now trying to divorce while he is in jail--Dave is fun, kind, and loving. Some of the richest and most beautiful scenes of the film reflect the happiness of Joy and Dave. But, when he mugs a rich old woman to steal her jewelry—coupled with his record of previous run-ins with the law--he is sent to prison for twelve years. Joy continues to think of Dave. She also writes him and visits him regularly in jail. While she swears she will wait for him, she continues to have causal affairs with other men and lives from day to day and job to job. As Johnny gets older, Joy remains stuck...Once again, to me, this looks like a well-acted, but poorly-photographed home movie. On the other hand, I may be missing the great movie-making craft that Ken Loach seemed to deliver so well in Kes but missed here.","As mentioned elsewhere, I've been getting into the 'kitchen sink' dramas of Britain in the 1960s. Previously I've watched a handful of the early black and white ones, but POOR COW, the first film from long-time director Ken Loach, offered in a new wave of all-colour pictures that eventually heralded the way for the miserable likes of EASTENDERS and other soaps that came later. POOR COW is a product of its era and it shows, and that's what makes it interesting.The film is in essence the story of a young mother and her kid and their attempts to get by in a cruel and often harsh world. Carol White achieves level of naturalness in her performance that you don't often see, which means that she's utterly convincing. The male characters are presented as brutes, philanderers, or simply bland, cold men who don't care about the impact they make on people's lives. There's plenty of talent in the supporting cast, a lot of faces who would go on to become familiar on TV and in film, which makes this a fun watch despite the gruelling subject matter.The thing I found about POOR COW is that it kept me watching. I was always interested in finding out the outcome of the story, although any viewer will immediately realise that it's not going to be a happy ending. I was interested to note that the interlude in which White gets involved with a group of dodgy glamour photographers seemed to inspire a whole sub-genre of films directed by the likes of Norman J. Warren and Pete Walker. Apparently many of the scenes in the film were ad-libbed, which accounts for the slice-of-life realism of the piece.","I suppose you can watch 'Poor cow' in two stages.First of all, as a tale about an ordinary lower class girl who is severely tested in her efforts to make ends meet. Beautifully set in a 19-Sixties London working-class area, this film spares no effort to indulge you in the hard realism of her everyday's life. Also making you part of the girl's dreams about happiness and domestic stability -- not different from many other girls' dreams.After having laid such a solid bottom, 'Poor cow' invites you to connect its tale to the Swinging Sixties. A time when London was the epicenter of many freshly generated whirlwinds.Well, this film's statement seems clear to me: no Sixties-glitter & shine. 'Poor cow' tells us that even in the Sixties everyday life for common people went on as usual. Accentuated by music of Sixties' pop-icon Donovan, you may even detect that newly acquired Sixties-freedom primarily increased pressure on women to expose their nudity.----Apart from all this, 'Poor cow' deserves praise for its excellent acting + shooting. As well as for the credibility of its story -- in a Sixties-environment that surely warms the heart of everyone around at the time. Another Sixties-feature: the film shows a half naked young boy frontally. In 1967 nobody thought much about that, in our times this picture would probably have been censored as child pornography.","It's been over 30 years now but I still remember that this movie was the worst I've ever seen.  I would have thought that in this length of time something worse would have been filmed but I was mistaken.  I just finished watching \"STARSHIP TROOPERS\" and it came mighty close but it was still more entertaining than \" POOR COW \"."],"review-user":["craigjohn-1","cstailyour","ad59","bakerjp","lee_eisenberg","EdgarST","cooked","jc-osms","pheed","GrahamEngland","catsmad","michael-daniels-84521","kijii","Leofwine_draca","wvisser-leusden","Ron-36"],"review-date":["9 January 2007","17 May 2001","22 March 1999","22 July 2001","30 January 2007","25 September 1999","14 May 2002","22 January 2012","25 May 2000","16 July 2011","21 July 2002","23 March 2018","22 November 2016","10 September 2016","14 December 2013","30 July 1998"],"review-rating":["9","7","10","10","7","6","9","6","6","10","1"],"review-title":[" Set in 60's London. Working class girl's desperate voyage through relationships\n"," Radical film?\n"," 60's realism well worth a look at!\n"," There's no film in his camera.\n"," irony, and a way with Donovan\n"," A fine introduction to Ken Loach\n"," Social reflection\n"," The other side of the swinging 60's\n"," The Limey is a follow-up to this film.\n"," The Dark Side Of 'Swinging London'.\n"," Really watching a film\n"," A Ken Loach Masterpiece\n"," Life with 'Joy'?\n"," Loach's slice-of-life debut\n"," the backside of Sixties-glitter & shine ....\n"," Worst movie I ever saw\n"]}