{"review-url":["http://www.imdb.com/title/tt0080040/reviews"],"review-text":["During the late seventies and early eighties, Paramount Pictures began a streak of quality horror films paralleled only by the Universal Films of the thirties and forties. Exemplified by the Friday the 13th series, My Bloody Valentine, Silver Bullet, April Fools Day, Tourist Trap, and many others, these films, though headed by diverse directors, presented a singular atmospheric moodiness, attained through a mandated set of production techniques. As a result Paramount was able to consistently release films that seemed vaguely familiar in a comforting way, yet dealt with a wide variety of unique subject matters within the expansive slasher genre. Tourist Trap evokes the carnival imagery of Tobe Hooper's The Funhouse, yet brings it within the guidelines of the Paramount Films from this era. The dark settings and unsettling mannequins and masks lend a scary non-human atmosphere to the film that belies it PG rating. The acting is consistently solid as can expected from Paramount films from this era. The characters are even likable, making their deaths all the more tragic and shocking when they inevitably occur, a rarity in the films of competing studios such as New World or Vestron during the same era, where deaths are treated as a comic or joyful event. Under-appreciated in its day, and nearly forgotten now, this film has truly withstood the test of time and has become a classic in the eyes of those who are lucky enough to revisit it. Do yourself a favor and pay a visit to this incredible \"Tourist Trap\".","Although widely under appreciated, \"Tourist Trap\" is still a notable and worthwhile entry into the horror genre. The first film directed by David Schmoeller (of Puppet Master fame). Pino Donaggio's score is nothing short of amazing; elevating the film to a whole other level in terms of both tension and atmosphere. Connors delivers a deliciously over the top performance as Mr. Slausen; the other actors are all competent considering that this is a low budget flick. For being close to 26 years old, the film has stood up extremely well - a creepy back woods setting, decent effects, and few hidden surprises in the script; it's worthwhile viewing for any horror enthusiast. A definite cult classic! My grade 8/10.","TOURIST TRAP (1979) *** 1/2 Lurid and spooky low-budget horror quickie of some cult quality about a group of young friends on a road trip that are detoured into a nightmare when their Jeep breaks down in the middle-of-nowhere discovering a broken-down wax museum run by a deranged caretaker (Chuck Connors channeling Vincent Price and affectively off-beat to boot) with a madman brother named 'Davey' whose telekinesis leads to murderous activities. Creepy and often joltingly scary thanks in large part of the film's singular stroke of genius in using the disturbing imagery of the mannequins that seemingly come to life with screaming, gaping eye-less maws that get under one's skin and has a long-lasting effect long after viewing this arguably guilty-pleasure cheese-fest (Connors has some loony moments including a riotously black humor soaked 'soup sequence' and playing with dolls) that provides some unsettling choice edits of shock and disbelief of what is unspooling. Pre-'Charlie's Angels' sexpot Tanya Roberts is one of the doomed guests providing a few moments of genuine terror at the proceedings at hand. Kudos to filmmaker David Schmoeller (who co-wrote the screenplay with J. Larry Carroll) in treading the sublime with the ridiculous to the utterly horrific. A blend of 'The Texas Chainsaw Massacre' by way of 'Carrie' and 'Psycho' yet original none-the-less as a precursor to the genre yet to come: madman-slasher-on-the-loose. Best bits: the first victim's genuinely scary demise (those laughing dummies scared the hell out of me!); the attic sequences with 'Davey' and the film's freeze-frame ending that will haunt you for days! One of the few films that truly unnerved me when I saw it as a kid and recently viewing it on DVD gave me pause to watch in the dark .alone! Screams for a remake! Best line: 'See my friend!'","There was a time, back before USA became the home of Emmy-award winning programming, when you could turn on the TV on a Saturday night and be treated to such highbrow programming as \"Slugs,\" \"Shock Waves,\" and the pervasively atmospheric creepfest, \"Tourist Trap.\" Out of all the horror films I remember from my childhood, TT arguably left the most visible mark. As my family would gather around the TV and behold the spooky wonder of a house full of mannequins (my father was a fan of Chuck Connors as \"The Rifleman\"), I would go to my room and cower under the bed when things got too scary. For as much as this film (and others) frightened me, I was simultaneously drawn to the discomfort they produced. Scenes of a woman's face being turned into a plaster mask, a man impaled by a flying pipe, and a knife to the back of the skull left haunting marks on my neuroses that periodically popped up in the years that followed (during which, unfortunately, TT was near impossible to find on VHS).Having 'grown up' considerably since that time, and recently revisiting the 'ol \"Trap\" on DVD, I must say it has lost only a smidgen of its ability to shock. As a child, I didn't pay as much attention to pacing (especially with commercial breaks inserted every 10 minutes) or acting quality, because the horrific events were amplified ten-fold in my eyes and mind.Now, a lot of the acting seems over-the-top and amateurish (Connors, however, maintains a professional veneer throughout), and some scenes drag to the point where the subtitle \"Just killing time\" should be superimposed at the bottom of the screen. Granted, these are just minor quibbles from a fan/critic who has seen much worse instances of both these traits.Though TT still maintains a sense of terror that builds as the film progresses, my downgraded impression of it has come from being exposed to \"Carrie,\" \"Halloween,\" \"The Texas Chainsaw Massacre,\" \"Psycho\" and others that TT writer/director David Schmoeller liberally borrows from. However, he incorporates the killer-with-psychic-powers angle with great skill, careful not to overextend his homage to the point of parody, creating something genuinely offbeat as a result. As is properly cited on the DVD, the film branches off into different levels of insanity, to the point where kindly Mr. Slausen's (Connors) mannequins begin to resemble real live people...Not a masterpiece but far from a waste of time, \"Tourist Trap\" is a montage of elaborate face-masks, creepy vocal distortion, atmospheric nights, and desperate, panicked emotion. One of the more notable sleepers in the annals of horror, for those with adventurous tastes.","This is an old movie and probably doesn't hold up well for younger audiences, but it still deserves credit for it's weird atmosphere/ideas, especially on such a low budget. Scares in the best way, by tapping into dark psychological fears. Anyone can throw something at you on a screen to make you jump or show a decapitation in all it's grue in close-up, but this one takes it's time and works its way under your skin, trying to push you into the same state of madness as all the characters in it are taken to. And unlike horror movies of today, the lead characters are vulnerable and human, not smart-assed and invincible.Along the way you get one of Pino Donaggio's best scores ever, an over-wrought swirl of strings and sighing women that perfectly compliments his other scores of the era (Carrie, Pirannah, Dressed To Kill, The Howling and Body Double). There are, of course, mannequins, Tanja Roberts with dark hair in a tube top with big boobs, Chuck Conners wearing masks and talking like Harvey Fierstein(he did such a good job I didn't believe it wasn't two people!), an almost unwatchable suffocation scene and enough warped moments to give you nightmares for awhile.The DVD is a surprisingly stunning transfer with an OK commentary track by the director, who's other films didn't impress me much. This is a one of a kind flick. \"My brother doesn't want her to see meee...do you know why?...do YOU know why? (singing) He's afraid she'll beee attracted to meee...heh heh hehhhh...\"","1979's Tourist Trap is a clever, unique B thriller that stands out as one of the best of it's kind.Travellers stop at a lonely wax museum where the owner's mannequins are a little too life-like for comfort.While the film has hints of The Texas Chainsaw Massacre, Tourist Trap is mainly a creepy psychological thriller worthy of The Twilight Zone. Director David Schmoeller gives this movie an atmosphere of darkness and mystery, that reaches nightmarish proportions. Also, Schmoelloer adds the occasional touch of comic relief to the bizarre happenings.Venteran actor Chuck Connors is the best of the film's decent cast. Pino Donaggio's music score is excellent, having both lyrical and solemn themes that are perfect to the movie. A number of the film's sequences are quite memorable.For horror and thriller fans alike, Tourist Trap is an unforgettable must-see film.*** 1/2 out of ****","The slasher sub-genre has been pretty much exhausted - in fact, even by 1979, just one year after the supposed 'first slasher', Halloween (which was released seven years after Bay of Blood), was released; the sub-genre wasn't far from being exhausted; but Tourist Trap represents one of the more original outings. The film follows the same basic formula as most slashers - i.e. madman murders a load of kids, but draws its originality from the fact that madman is shown from the beginning (as opposed to an unseen assailant or a man in a mask) and we actually get some insight into his character. The fact that this killer also has telekinetic abilities, including being able to control the wax dummies that fill his house, adds to the originality. We kick off with a great opening sequence, which sees a young man fall foul of having a flat tire after finding himself in a gas station of terror. The scene is amazingly creepy, as the wax dummies taunt him and things fly from the shelves - and it gives the audience a great insight into what is to come; namely, a very creepy horror film! The acting credibility is as non-existent as you would expect from a seventies slasher, but to be honest; it's not all that bad. The girls look hot, the boys don't really matter; and Chuck Connors is more than adequately creepy in the role of the psycho. He's not exactly Anthony Perkins; but still, good enough. It's not the acting that's the star of the show, however, and as you might expect - the creepy atmosphere takes that prize. Wax models, as proved by the likes of House of Wax (Vincent Price version...) are very creepy; and the film makes best use of that fact. There are very few things in cinema that can be frightening by simply being there - but wax statues are definitely one of those things. The killer's special ability could easy have gotten in the way of the atmosphere, but the film makes best use of this fact, even, by having various things fly off shelves and it goes well with the rest of the movie. On the whole, this is a very good film. While Tourist Trap might not be absolutely essential viewing; it's well worth seeing and I can recommend it.","\"Tourist Trap\" is a genuinely spooky low-budget horror film that will surely satisfy horror fans.It contains extremely strange atmosphere and there are some quite unnerving moments of total dread and fear.Some scenes are downright bizarre for example there is one scene when Chuck Connors sits down to have dinner with a mannequin that comes to life and starts conversing with him before its head falls off.There is very little gore,but the violence is quite strong for PG-rated horror film.The mannequins look very sinister and the climax is horrifying.David Schmoeller returned to make several other genre films including \"Crawlspace\",\"Puppet Master\" and \"Netherworld\".Still \"Tourist Trap\" is definitely his best horror film,so if you want to be scared give this little gem a look.9 out of 10.","I love this movie! When I saw this movie on TV when I was a kid,it scared the hell out of me.Probably because mannequins give me the creeps too.Jocelyn Jones(Molly)is an excellent actress.She uses her facial expressions,especially her eyes,at playing terrified.Chuck Connors is great as Mr.Slausen.I was happy to see him play such a different roll.The other actors in this movie are great too! Tanya Roberts(Becky)and Robin Sherwood(Eileen) are great actresses and I hope to see them in future films,especially Jocelyn Jones! So if you love scary movies but are tired of seeing the same old thing,check this movie out!","It's funny.....you get to middle-age....you have amassed a huge DVD collection, heavy on horror, particularly the 50's through the 80's, and you think you have seen all the \"A-list\" stuff. All you're trying to do now is round out the collection with obscure \"B\" and \"C\" list films....maybe some TV movies. Then, you see \"Tourist Trap\", and you think 'how did I miss this film?', which could easily be discussed in the same breath with Halloween, Nightmare on Elm St. and Creepshow.This is a great, fun, scary movie. It helps that mannequins are naturally a bit creepy, being so life-like. I recall that excellent Twilight Zone episode with Anne Francis, with the mannequins moving in the department store. Tourist Trap has a big scare scene very early on, which could have been too much, too soon, but it really worked, and set the unnerving tone that the rest of the film continues. It made me realize how long it's been since I 'jumped' because of an unexpected scene in a scary movie.Tanya Roberts was very good in this -- much better than she was as \"Sheena\" a few years later. The gore is not excessive for the sake of titillation, and the tension is unrelenting. The ghastly images of the mannequin mouths dropping so far open, and the screams coming out, will stay burned in my mind for a long time to come.","I have just seen this for the very first time and actually can't understand why as I have a guilty pleasure for the late 70's and early 80's slasher/horror films. I know this has a following but I'd never got around to seeing it until stumbling across it on YouTube. Of course this is 33 years ago but I've always found films with these lower production values much scarier and more watchable than most of todays. Take away the gloss and somehow it seems more real. Texas Chainsaw being the best example of this. You don't come to these films looking for good acting although anyone can understand why Tanya Roberts had a pretty big career after, given she is quite stunning. To think, tied up in a psycho's basement one minute and then off to the huge TV hit Charlie's Angels and a Bond girl the next no less. Whilst this is watchable and quite fun, it does boast a truly disturbing and gratuitous scene involving a girls' face being plastered and I found that more uncomfortable than any Tom and Jerry style torture porn of Saw etc. OK this is no Halloween or Texas Chainsaw but definitely worth a watch.","\"Tourist Trap\" is a bizarre, great horror film from the '70s. The film is about a group of young adults, Becky, Jerry, and Molly, who are traveling in a jeep through a desert area. Their two other friends, Eileen and her boyfriend Woody, are in a separate car. When a wheel goes flat, Woody takes it to a nearby gas station - and meets a grisly fate to some bizarre telekinetic mayhem and some creepy mannequins. The friends get tired of waiting for Woody and go to a local \"tourist trap\" mannequin/wax museum. In front of the entrance, the car randomly breaks down, and the girls find an oasis area to go swimming in, where they are approached by Mr. Slausen, who runs the roadside attraction that is now closed down. He takes them up to the old western wax museum, and the girls stay behind while he and Jerry go to fix their car. Eileen, the curious of the two, wanders to an old house nearby, where she also falls to the hands of a mysterious masked killer and a bunch of life like mannequins. After awaiting for Eileen, Becky and Molly go to look for her. That's when the real horror begins, and the telekinetic (can move objects with his mind) masked brother of Mr. Slausen begins to kill off the teens one by one, while controlling his large amount of human-turned mannequins.Sound similar to the 2005 \"House of Wax\" remake? Well, it is. I'd heard of this movie but never seen it when I saw \"House of Wax\", but now I can see the striking similarities the two movie share - \"Tourist Trap\" was obviously a big contributor to the \"House of Wax\" remake. The mannequins in this movie are scary to begin with, some with moving eyeballs, some with no eyes at all, and some with dropping mouths that sing too. The singing was extremely creepy if you ask me, and the mannequins were eerily designed. Mannequins are creepy to begin with, they're so lifelike yet they really aren't. The movie tightly blends elements from \"Texas Chainsaw Massacre\" (the masks the killer uses are similar to those of Leatherface), with a little bit of the original \"House of Wax\", and the telekinetic powers that are displayed in \"Carrie\". The result is quite satisfying. The telekinesis was a nice touch to the movie, it made the killer all the more menacing and inescapable. The masks were terrifying, and the plastering scene was really disturbing.The score for the film was really well done, if not a little overused during some scenes. The acting may not be particularly on key, but it really wasn't that bad. Chuck Connors was really good as the shadowy Mr. Slauston, giving the character a shady but friendly feel. A young Tanya Roberts is also in the film, she's most known for her role on \"Charlie's Angels\" and more recently the sitcom \"That '70s Show\", playing Donna's mother. Robert A. Burns serves as the art director, he did a phenomenal job on the original \"Texas Chainsaw\" and does a good job here as well, creating a cluttered, musty atmosphere to both the rundown museum and the old house filled with mannequins. I found it a little odd that the original rating for the film was PG, it seems a little too scary to have such a tame rating, but the film really isn't too violent.Overall, \"Tourist Trap\" is an eerily unique, fast paced, extremely under-appreciated horror classic. Full Moon gave it a decent 20th anniversary DVD release, the commentary was interesting and the picture was clear and crisp for the most part, better than the video versions. If you enjoy older '70s slasher-horror films, \"Tourist Trap\" is an underrated retro gem. 8/10.","Ever notice how often the earliest flicks by horror directors, before they go on to bigger and higher budget-productions, are usually the ones that are the coolest and creepiest? Having budget restraints forces a talented director to utilize everything they've got to bring us a story that \"wows\" us, without taking the easy ways out! Four decades later and TOURIST TRAP is still effective, still creepy, still able to make store mannequins scare the @#$! out of you! Chuck Conners is the ghoulish remnant of his shuttered roadside \"tourist trap\" - a wax museum/gift shop - along with his plethora of mannequins. Five unlucky young adults have the unfortunate experience of having their car break down in the middle of nowhere and getting a personal tour of this closed down roadside attraction. Gritty and unpolished, but never succumbing to over-the-top shenanigans that plague so many horror movies, Tourist Trap slow burns with a nightmarish tone, and a very effectively eerie score courtesy of Pino Donaggio.Many mannequin horrors have come since, but none are as effective as this low-budget classic from 1979. A must for Horror Fans who prefer the macabre and disturbing over the shocking and gory.","Slausen's Lost Oasis. . . a place for food, fun. . . and MURDER! After a guy disappears on his way to a gas station, a group of her friends head out on a trip to search for him. They come across a wax museum where they think their friend might have ended up. Unfortunately for the friends, however, the owner of the roadside attraction possesses the power to control his wax mannequins and use them for evil. One by one, the tourists are stalked down and killed by Slausen and his legion of wax dummies. Can the friends escape or will they fall to the same fate as their lost friend? Following in the footsteps (and twisting them around) of the great classic wax films (House of Wax, Mystery of the Wax Museum), Tourist Trap takes the slasher genre to a whole new level of strange and fascinating with its bizarre story and style. As far as character development, action, dialogue, flow, etc., it seems to be just a basic slasher flick. But, it goes far beyond that as the director takes control of the plot and moves it to the supernatural thriller it is. The acting ranges from acceptable (from the main cast) to very good (from backwoods-showman Mr. Slausen (played by Western-legend Chuck Connors)). The writing moves well and the dialogue is well structured, but there are some flaws in logic as the film moves deeper into the story. Also, some scenes are a bit silly, like the moaning-mannequin attack on Becky. It's nothing, however, that would detract from the effect of the film. As one would expect from a film about wax dummies, it is full of the endless creepiness supplied by the mannequins. It's strange that a (mostly) inanimate object can just sit still and somehow be so unsettling. . . perhaps it's the human likeness, or the blank stare, or the fact that you know it's about to spring an attack. . . whatever it is, the dolls are extremely spooky and that effect is used very well throughout the entirety of the film. As far as slashers go, it's one of the best, and it stands as one of the creepiest films I've ever seen.Obligatory Slasher Elements:Violence/Gore: The film is full of some cool deaths. The gore isn't excessive, but it's done well and leaves it as being realistic.Sex/Nudity: There is an extended skinny-dipping scene with the very attractive lead females (though 'very attractive' barely begins to describe the ravishing future-angel Tanya Roberts) but it's all a tease as the girls remain mostly underwater. They do remain scantily clad throughout the film, however.Cool Killer(s): Creepy is just the beginning of Slausen and his mannequins. One of the best killers in the slasher subgenre.Scares/Suspense: From the opening scene on, the film maintains a great blend of the creepiness of the mannequins, jump scares from the attacks, and a strong level of suspense in the stranded situation. . . it's all very well done to make for a genuinely scary film.Mystery: Well, mystery wasn't really the point of the film. . . just the meaning behind all of it is what matters.Awkward Dance Scene: All these cute girls and not a single dance. Shame.Final verdict: 8/10. See this creepy slasher!-AP3-","After many of my friends recommended this to me, I figured I had to check it out, so I bought the (relatively) new Blu-Ray release, settled in for the night, and checked it out. To my surprise, Tourist Trap lives up to its hype and then some. One can see why it never became a huge mainstream success like, say, Jaws or Halloween, but it has all the makings of a cult classic.The set up is nothing spectacular. In fact, it owes a lot of its plot to The Texas Chainsaw Massacre, Psycho, and House of Wax (even more surprising, the 2005 remake of that film is more of a remake of Tourist Trap than the '53 film). What makes this one stand out from the then growing slasher genre is a sense of the surreal, the dreamlike, and the nightmarish. Attractive teens aren't just killed one by one by some creep in a mask. There's a lot more at play here than your average stalk 'n slash flick. By the last 20 minutes of the film, everything seems like a bizarre fever dream and hope is a thing of the past.A lot should be said for Jocelyn Jones' wonderful performance - going from kind wallflower to woman in the process of a nervous breakdown. Chuck Connors is also terrific as Mr. Slausen, the owner of the titular Tourist Trap whose motives seem to always be up in the air. And yes, that's future Charlie's Angel, Tanya Roberts, as one of the other victims.For those looking for something creepy and different, Tourist Trap delivers in spades. Perfect for a Halloween party or even for a kid's first horror film (it is rated PG after all).","\"Every year young people disappear ...\"So goes the tagline to \"Tourist Trap\" and so goes the concept of countless other slasher movies from the 1970s and beyond. What sets this late '70s oddity aside from competition, however, is the pure nightmare fuel of mannequins coming to life via telekinesis. Yes, you read that sentence correctly. This instantly memorable slice of frightful nostalgia comes via producer Irwin Yablans, who previously helped bring John Carpenter's \"Halloween\" to the public consciousness. \"Tourist Trap,\" unlike the wave of imitators that would arrive in the wake of Carpenter's classic, takes a page instead from Tobe Hooper's seminal \"The Texas Chain Saw Massacre\" and veers away from typical stalk & slash fare. Like \"Chain Saw,\" It is a gritty, ugly and ultimately an undeniably humorous offering of macabre madness.Stranded by the side of the road (aren't they always), a group of young folk are taken in by an odd yet seemingly well-meaning owner of a local, deserted tourist attraction, played to perfection by Chuck Conners. Soon it becomes clear why the attraction to this spot has all but dried up: turns out someone next door is killing wayward souls and fashioning them into a small army of killer mannequins! Faster than plaster drying on a face, this horrifying discovery takes these unlucky ladies and lads on a trip they won't soon forget -- assuming they can live through it.Directed by \"Puppet Master\" director David Schmoeller and co- produced by Charles Band (the guy who founded Full Moon pictures, and has been throwing countless \"Puppet Master\" sequels and knock- offs at us for decades now), \"Tourist Trap\" has an almost instantly lived-in vibe about it. From the strains of Pino Donaggio's bizarre yet familiar score to the horrific yet low-budget effects, this is definitely a Full Moon production of the highest order. Chuck Conners is brilliant as the unassuming, seemingly friendly elder, while the kids -- lead by future Bond Girl, Tanya Roberts -- are surprisingly organic and sympathetic, in spite of the limited amount of set up they are given. A film chock full of visuals you won't soon forget (especially that infectiously grin-inducing final frame), \"Tourist Trap\" is bound to leave an impression on anyone from any walk of life who finds themselves attracted to it. And to cap it all off, it's rated a measly PG!","Don't you just hate them slashers that never seem to get started? It sometimes takes them a full hour of lame red herrings before some real action takes place. \"Tourist Trap\" isn't like that! If it's typically gruesome slashing you want...than it's typically gruesome slashing you'll get! Plenty of it AND constantly from start to finish! This movie contains what is probably the greatest opening sequence in 80's horror cinema when a teenager, on a stroll after engine trouble, is trapped in a deserted house and assaulted by a creepy collection of wax statues. Four other lambs to the slaughter arrive at the house and encounter an utterly insane maniac that looks somewhat like a mixture of Leatherface (from \"Texas Chainsaw Massacre\") and one of those mad sculptors from old wax-museum movies. \"Tourist Trap\" is exciting horror entertainment, with some genuine suspense, grisly images, ultimate weirdness, morbid humor and terrific make-up effects. The plot twists aren't always original and the acting is pretty lousy but, seriously, who cares? The fast pacing and the groovy killer-icon caused this \"Tourist Trap\" to earn a spot amongst my 5 favorite slashers. A bit surprising is the total lack of nudity, though. Too bad, because all the girls look ravishing and after only 10 minutes, the obligatory line \"Who needs a bathing-suit?\" is spoken.","Made in the same era of HALLOWEEN and PHANTASM, TOURIST TRAP has always been eclipsed by the other more famous horror films made in the 1970s. And there's a reason for this. It's because it's not very good. After watching it again for the first time in 20 years, I went \"Huh? What was that all about?\" The production values are very cheap, the sound is terrible, the script is disjointed, the acting is uninspired, and the characters are uninteresting. There's not enough blood in TT for gorehounds and the confusing story is too crappy for those who love their horror movies with more chills than blood. I really can't imagine who came up with such a murky, stupid story: a man who has psychic powers and lives with mannequins. Scary...not. And to make things worst, there are so many continuity errors that it looks like the film was rushed and made in only a couple of days. The only good thing in TOURIST TRAP are the following: music by the always great Pino Donnagio, the original movie poster and Tanya Roberts, who's totally hot. If none of the latter is of interest to you then there's no need for you to watch TOURIST TRAP.","One of the oddest, most strikingly eerie and creepy horror films to come out of the 70's, \"Tourist Trap\" even by the loose, free-wheeling, convention-defying \"anything goes\" standards of its time rates as a real weirdie. Yet, it's the picture's very strangeness -- a masterfully mounted uncanny atmosphere of pervasively off-kilter supernatural dread which from the get-go registers as powerfully spooky and becomes more increasingly opaque and frightening as the film progresses, offering up ample shocks amid a few scattered moments of surreally lovely dream-like elegance and ending on a bitterly ironic, crushingly nihilistic note with a haunting final image that's hard to shake -- which makes it such a unique and singularly unnerving experience.Five teenagers traveling through the desolate California desert by car get hopelessly lost. They stumble across \"Slausen's Lost Oasis,\" a seedy, rundown roadside dive that's one part gas station, three parts crummy wax museum, and all parts ratty and foreboding. The joint's lonely, seemingly friendless and harmless owner Slausen (juicily overplayed with infectiously hammy brio by Chuck Conners) turns out to be a deranged psychic killer with lethal telekinetic powers. Slausen brings his freaky assortment of uncomfortably human-like mannequins to life and picks off the kids one by one so he can add them to his ever-growing collection of victims.Director David (\"Puppermaster,\" \"The Arrival\") Schmoeller adeptly wrings every last ounce of tension he can squeeze from the pleasingly ambiguous and open-ended script he co-wrote with J. Larry Carroll. (Said script's stubborn refusal to provide some rational excuse for all the bizarre stuff which transpires throughout the movie, often wrongly criticized as one of the film's principal weaknesses, is actually the movie's key strength, giving the picture the scary, anything-and-everything-can-happen, common-logic-be-damned quality of a true nightmare come horrifically to life which never would have been achieved if there was some kind of credible explanation offered for what's happening.) Pino Donaggio's beautifully chilling, understated score, Nicholas von Sternberg's shadowy cinematography, and Robert A. Burns' grubby, cramped production design add immensely to the film's profoundly unsettling mood. Excellent performances are another significant plus, with the pretty, perky Jocelyn Jones (Ellie-Jo Turner in \"The Great Texas Dynamite Chase\") particularly fine and personable as the most resilient and sympathetic of the endangered teens. Even Tanya Roberts fares well as a luckless lass who has a knife levitated into her head. Offbeat and unusual, \"Tourist Trap\" is well worth visiting.","When his car has a flat tire, Woody (Keith McDermott) seeks a gas station in an empty road. He finds a deserted place and is attacked by mannequins in a room and dies. Meanwhile his girlfriend Eileen (Robin Sherwood) waits for him in the car. However their friends Jerry (Jon Van Ness), Molly (Jocelyn Jones) and Becky (Tanya Roberts) arrive and they decide to look for him. They find a paradisiacal waterfall but their car breaks down. While Jerry tries to fix the car, the girls bath in a lake. Out of the blue, an old man arrives and he introduces himself as Mr. Slausen (Chuck Connors), who owns the place. He brings Molly, Becky and Eileen to his house and tells that he would help Jerry. They find a waxwork museum with armed cowboys. Eileen decides to leave the house to find a telephone, but she is attacked and strangled by a masked stranger. Who might be the killer and how will he girls flee from the spot?\"Tourist Trap\" is an unoriginal slasher with a mad serial-killer that seems to be a magician. The plot is totally predictable and how the insane killer controls the mannequins is not explained. In addition, the boring music score by the Italian musician Pino Donaggio is annoying. My vote is six.Title (Beail): \"Armadilha para Turistas\" (\"Tourist Trap\")","Pretty eerie and at times quite manic wax horror from producer Charles Band. Director David Schmoeller, who created the Puppet Master characters, uses his tight budget to create a reasonably successful number of scares. Cast is good, Chuck Connors as the wax museum's owner and a young Tanya Roberts are the most featured but Robin Sherwood (who quit acting to manage a home furnishings business) is the strongest of the leads. Albert Band features briefly as Chuck Connors' waxwork father. The DVD provides a David Schmoeller commentary which is very droll and of limited interest (his memories of making the film seem weak) - we do learn that the lead actresses all refused to shoot a nude scene though! Stephen King once said this was his favourite horror film and though I've preferred many others, this has many king-esquire moments of tension so it's easy to understand why.","Chuck Connors was never THIS creepy on THE RIFLEMAN or BRANDED or even the film SYNANON. He should have made more teen horror films with the same bad haircut he sports in this epic. Tanya Roberts was a total babe back in '79 (I guess right before she got Charlie Angel typed). This demented little flick is quite scary and grabs you by the throat.A 5 out of 10. Best performance = Chuck Connors. Great set and music. Similar to American Gothic (with Steiger and M.J. Pollard), but Mr. Connors is a one-man show who is a little TOO real for teenagers to trust. Perfect drive-in flick and I hope it made plenty of dough. Give it a chance; the ending is worth it.","I first saw this movie when I was about 5, then I saw it again a few years ago. Needless to say it still scared me. It's not so much because of effects or fancy settings, but rather the lack of them that makes it seem so raw. The acting isn't bad, and the plot is bizarre, but it makes the wheels in your mind start turning, and anytime you are on a stretch of deserted highway it will make you shudder.","It's actually a pretty good little horror film that does get under your skin. Certainly it gets a lot of mileage out of its use of mannequins. These things have rarely been portrayed in a more off-putting, memorable manner. While this does owe an obvious influence to other horror films of the decade, such as \"The Texas Chain Saw Massacre\", \"Carrie\", and \"Halloween\", it's still effective on its own merits. The creation of backwoods atmosphere is impressive, and at the centre of things is a marvelously demented performance by good ol' Chuck Connors as our merry antagonist.Chuck plays Mr. Slausen, proprietor of an out of the way museum who encounters some young adults who have had car trouble. Since the girls have a tendency to be stupid and go wandering off on their own, they're fair game. Unfortunately, Slausen has a younger brother, Davey, who's prowling around the premises, and soon these city slickers will find out just how much trouble they're in.Some nifty, and sinister, touches and twists make a difference in this directing credit for David Schmoeller, who also co-wrote the screenplay with J. Larry Carroll. Another heavy asset is the sometimes comical but often genuinely spooky music score by the always reliable Pino Donaggio. Other talents behind the camera include cinematographer Nicholas Josef von Sternberg, art director Robert A. Burns, and editor Ted Nicolaou; the latter two, of course, had actually worked on \"The Texas Chain Saw Massacre\".The victims may be daft but the actors at least do a decent job. Jocelyn Jones (\"The Great Texas Dynamite Chase\"), daughter of the great character actor Henry Jones, is appealing as Molly, while Robin Sherwood (\"Death Wish II\") and Tanya Roberts ('Charlie's Angels') offer some sass as Eileen and Becky. But Chuck is the glue that holds all of this together; he's a wonderful psycho and is even touching at times.Worth it just for a particular death scene, which is really quite disturbing.Future \"Tremors\" and \"City Slickers\" director Ron Underwood was the first assistant director here.Seven out of 10.","Recently rewatched this and I was amazed by how well it still holds up. This movie is heavy with atmosphere and memorable scares that are heightened by the creepy, discordant score performed by Pino Donaggio. Former pro baseball player, Chuck Connors, is both menacing and unassuming in a way that is reminiscent of Perkins in Psycho. It's a shame that he didn't get to act in more horror films as he certainly had an intense physical presence on the screen. David Schmoeller - who later went on to direct Puppet Master - shows a real mastery of his craft in his directing debut, albeit with moments of unintentional cheese, but these only add to the overall charm of the film. As expected, the scene when the woman's face is covered in plaster is still as anxiety inducing as it was the first time I saw it.Glad this is finally being put out on blu-ray . Hoping that it gets rediscovered and achieves the popularity it deserves."],"review-user":["aerosmithandwesson","Vancity_Film_Fanatic","george.schmidt","Jonny_Numb","TonyDood","Nightman85","The_Void","HumanoidOfFlesh","FUFFUS","microfame","mjtsmm2027","drownnnsoda","josephbrando","Shattered_Wake","molemandavid","Minus_The_Beer","Coventry","Maciste_Brother","Woodyanders","claudio_carvalho","barnthebarn","shepardjessica-1","dynamite-3","Hey_Sweden","travis_manero"],"review-date":["26 October 2004","9 November 2004","9 January 2004","29 March 2005","3 June 2004","22 September 2005","12 December 2005","16 August 2004","9 January 2005","3 February 2012","14 November 2012","12 August 2006","31 May 2014","17 September 2008","5 July 2017","26 November 2017","6 December 2005","2 April 2003","1 June 2006","19 November 2016","2 September 2008","21 November 2004","18 March 1999","3 May 2014","13 January 2014"],"review-rating":["8","9","6","10","7","10","9","8","6","8","10","8","8","8","8","2","9","6","5","5","7","8"],"review-title":[" continuing Paramount's streak of atmospheric gems!\n"," Watch it with the lights out if you dare!\n"," Creep City!\n"," see this as a child, and be scarred (and scared) for life...\n"," Weird and memorable\n"," A weird and wonderful thriller\n"," Incredibly creepy seventies slasher\n"," Very creepy horror film.\n"," I love this movie so much that I bought the DVD!\n"," Where have YOU been, little movie!?\n"," Guilty pleasure\n"," Highly Memorable '70s Horror.\n"," THE Creepy Mannequin Flick!!!\n"," One of the creepiest slashers ever made (See This Slasher #9)\n"," Fascinating low-budget nightmare\n"," It's a Trap!\n"," Terrific, to-the-point slasher!\n"," Huh?\n"," A marvelously odd & eerie 70's drive-in horror favorite\n"," Unoriginal Slasher with a Boring Music Score\n"," Wax Mask\n"," Creepy Chuck!\n"," \"a surreal and disturbing trip.\"\n"," \"Creepy\" is the perfect word to use to describe \"Tourist Trap\".\n"," criminally underseen 70's horror - spoiler\n"]}