{"review-url":["http://www.imdb.com/title/tt0079261/reviews"],"review-text":["The 1979 film musical of HAIR was loosely based on the infamous 1960's Broadway musical that became famous because of its infamous nude scene. The stage musical isn't really much more than a group of skits strung together with some amusing musical numbers; however for the film director Milos Foreman (who won an Oscar for directing ONE FLEW OVER THE CUCKOO'S NEST) and the writers have taken the basic premise of the play and the score and constructed a real story to make the show more \"user friendly\" for the big screen. In the film, naive farm boy Claude Hooper Buchowski (John Savage) is about to go into the army and decides to spend a couple of days in New York where he meets a group of aging hippies (Treat Williams, Dorsey Wright, Annie Golden, Don Dacus)who get him involved in a group of nutty misadventures, including the pursuit of a snooty society girl (Beverly D'Angelo). The story divides into a series of vignettes that range from the ridiculous to the sublime, but it is all gorgeously photographed with a clever use of NYC locations and imaginatively staged musical numbers (outstandingly choreographed by the legendary Twyla Tharp). Treat Williams lights up the screen as Berger, the unconventional and free-spirited hippie who does his best to get Claude to loosen up and is matched scene for scene by Savage as Claude, who brings a lovely sweetness to the role of Claude. Annie Golden is a charmer as Jeannie, the pregnant hippie who is pregnant by Wright or Dacus, doesn't know which one is the father and doesn't seem to care. There is one outstanding musical number after another here...\"Aquarius\" is a tour through Central Park which includes dancing horses...Treat Williams disrupts a fancy dinner party in \"I Got Life\"...\"Black Boys/White Boys\" features the late Nell Carter and Ellen Foley extolling the ethnic virtues of men and \"Easy to be Hard\" is a powerful rendering of one of the best songs in the show by original cast member Cheryl Barnes, who plays Wright's ex-girlfriend and mother of his child. This is a beautifully photographed, well-acted sung, and danced psychedelic acid trip of a movie that must be seen and once seen, will initiate multiple viewings as this dazzler has to much to offer to catch it all in one showing.","Yes, HAIR came out in the late 70's. But please don't call it a \"disco-era\" musical; there isn't a single thing in it that would suggest any detraction from its 1968 period. Judge it on its own merit; too often, a movie is compared to its stage roots and is inevitably crucified. As it is, the film plays out like one long, fantasy trip (whether that trip is substance-enhanced or not is your call)- starting with the \"Aquarius\" sequence and continuing on to the marvelous set pieces for \"Manchester England,\" \"Ain't Got No,\" \"I Got Life,\" and best of all, the \"Electric Blues\"/\"Hare Krishna\" fantasy which shows lovers John Savage and Beverly D'Angelo literally flying through their own wedding ceremony. (BTW, the woman singing \"Aquarius\" in the film's opening is not Melba Moore, but Ren Woods- a wonderful singer-actress seen a lot on TV in the 70's, and star of the Los Angeles production of \"The Wiz.\") The opening Twyla Tharp corps-de-ballet shot right on the Central Park grounds- with Woods' solo in a dizzying 360 camera pan- is an awesome start to a rock-infested musical. Ms. Moore (who performed in the original Broadway HAIR) appears later in the film singing \"3-5-0-0\" with Ronnie Dyson in the war protest scene shot in Washington, DC. And there are moments- like the \"Walking In Space\" basic training sequence or the simple close-up on Cheryl Barnes's torch solo \"Easy To Be Hard-\" which are just plain astonishing.","Now more than ever we need Peace & Love in this world!This film really showcases the wonderful music of the Broadway show, and the fabulous Choreography of the legendary Twila Tharp! I saw it again after many years, and it still holds up well.Thank you, MGM/UA for putting this on DVD! I love the option of seeing in Widescreen. MGM rocks for doing this on many of their DVD releases.Ya gotta love Treat Williams as Berger and John Savage as Claude. They couldn't have picked better actors & actresses for this film! Beverly D'Angelo is such a 'hot mama' in this film--I had forgotten just how hot! WOW!The supporting cast is absolutely great,with the late great Nell Carter making a singing cameo in a couple of scenes, as well as the kooky Charlotte Ray (Mrs. Garrett on 'Facts Of Life')The story gets a little weak toward the end, but the anti-war sentiment of the late 60's still holds up, and is relevant today. It's beautifully filmed (quite a bit on location) and is so colorful and lovely and really brings the spirit of 1968 back on the big screen.I saw this movie when it was released in 1979 when I was 15, and was moved by it then, and it still moves me now at 40. Some other reviews on here say they think it should have been made sooner--I don't think Hollywood was ready to make such a movie back in the late 60's-early 70's.The Vietnam War ended in 1975, and the whole thing hit a little too close to home, I think for this story to be filmed before it was (like in 1969, 70, 71)Bravo to Director Milos Foreman! I love this film!!!!!!!It's nice to see it again, this time on DVD. It never looked better!","I have seen this movie more than 50 times in my life, and each time I watch it the movie is just as entertaining as it was the first time! George Berger (played by Treat Williams) leads a small group of 1960's-1970's era anti-war \"hippies\" living at large in New York City. This small group happens upon a young man, Claude Bukowski (played by John Savage) who has been drafted into the US Army for service in Vietnam. Despite their best efforts to dissuade him, Claude does eventually report for basic training in the Army. Still distressed over his having left them, the hippie group steal a car and travel across the USA to visit Claude \"...for a couple of hours,\" in the words of George Berger (to an M.P. stationed at the entry gate of the Army base Claude is temporarily stationed at in Nevada). The outcome is truly touching, so I won't spoil it for those who have not yet seen this fantastic movie. The musical score is equally fantastic! Don Dacus (of the rock group Chicago), who plays the part of \"Woof\" - one of the hippies, is a not a key character, but the movie wouldn't have been the same without him. Beverly D'Angelo (who plays Sheila Franklin, an uptown girl who is befriended by the hippie group) is sensational in her role! A MUST SEE film!!","I first saw this film in the early 80's on cable. It was unique as a statement about the sixties, culture, war, music, race, and a bunch of things I'm certain I missed. However about a year ago it came back into my life as I started enjoying it with my son. He's a little young (9) for a lot of the themes in it, but he understands dancing hippies are fun to watch, and he gets the idea that end is ironic. While I can't think of other films in this genre, it does have a stand alone genius I love. It also does a unique justice to Central Park. Most musicals are lost on me, one way or another. \"Tommy\" was over the top and heavy handed in direction, \"Oliver\" seemed like crowd control on the silver screen, \"The Wall\" was so much abstract self important and indulgent dribble, but listening to \"Failure of the Flesh\" from Hair sounds right for our times today, as it did in the eighties, as it must have in the sixties...truly Timeless.","The first time I ever saw this movie was when I was four years old. I remember loving it and everything about it. 13 years later, I am now 17, and decided to watch it about a month ago because I am taking a 1960's class in school. I didn't really know what to expect, since it had been 13 years since I last saw it, but I was completely blown away by it. The actors were amazing, the music was so fun, and I now find myself singing along to every song. Treat Williams is great as Berger, the \"leader\" of the hippie group, who always gets what he wants, one way or another (except for at the very end, of course). John Savage is actually very convincing as Claude, the Oklahoma draftee who falls in love with Sheila (Beverly D'Angelo). D'Angelo is lovely as the prim and proper rich girl who eventually rebels against her upbringing and joins the hippies. The other hippies are played by Annie Golden, Don Dacus, and Dorsey Wright. Annie Golden is just adorable as Jeannie, the girl who is pregnant but still as cute and innocent as a child. Don Dacus and Dorsey Wright are good as Woof and Hud, the other two members of the group, and Cheryl Barnes, who plays Hud's fiancée, has an amazing voice. The only problem I have with this movie, however, is that the relationship between Claude and Sheila is not very convincing. They are barely ever shown together, and when they are, they fight (remember the skinny dipping scene?). It seems as though their relationship is very weak, and by the end of the movie we are supposed to believe they are madly in love, only based on the few meetings they had. I also see that many people writing reviews here are upset by the PG rating this movie has. I personally would raise the rating up to a PG-13, only because there is some drug use... but remember in 1979, PG-13 didn't exist. I don't think the nudity is bad at all, it is in no way sexual (in fact, there isn't really any sex at all in this movie), and it is only to show the childlike innocence that the group maintains. In most European countries, nudity isn't regarded as something bad, and I don't see why it is here in the US. Anyways, I give this movie a high rating, and I'm glad it was made back then, because in the insanely \"politically correct\" world of today, they wouldn't even think of making it, and even if they did, it would be a very \"watered down\" version, and I'm sure you wouldn't get the full effect. In conclusion, this is a very underrated film that is definitely worth checking out.","(May contain spoilers) I find myself disappointed with the criticism this movie receives. While it is most certainly not perfect, it is much better than it is given credit for. The acting and photography are excellent. Some of the musical numbers are great; including the title number, \"Where Do I Go?\", \"Easy to be Hard\", and \"Black Boys/White Boys\". While I have not seen the stage musical, I think that it clouds the judgement of many. This is not the musical you see in theatres. Do not attempt to compare them. The theatrical musical might have been sensational to watch, but it would never have had the same effect on film, so a plot had to be added. And the ending that has been added is just amazing. The movie left me feeling like I had actually watched something important, unlike most of today's movies, which only satisfy on one level.","One night at home I had nothing to do, and I saw that Hair was on t.v. later. I was curious about it, I mean I had no idea what to expect. I had heard people make fun of it, and I had heard people praise it. So I had to watch, I had to have an opinion.At the beginning of the film, I enjoyed The Age of Aquarius number, and was intrigued. However, when the number Hair came on, I didn't know how to react. I wanted to laugh at it and change the channel, I didn't want my siblings to make fun of me. Yet the song, though a little stupid, was also catchy. I kept watching. After I was finished watching the entire film, I had no idea what had just happened. I didn't know if I liked it or not, I did know that I wanted to see it again.This is a strangely addicting film. I watched it three more times in the days following, and my final verdict is, I love it! I can't help it. It's just so fun! The fist time I watched it I was mocking it, but by the third time viewing it I was in anticipation over when the number Hair would come on so I could sing along. I especially loved the song, How Can People Be So Hard, it's a different pace from the majority of the film. What can I say, when it was over I was singing the songs in my head for weeks. I just have to buy it. I highly recommend this film to musical lovers (especially if you love musicals like The Who's Tommy). And although I know I would never be a hippie, this film makes me want to say \"Heck with work, I'm going to grow out my hair so fleas can live in it!\" Watch it, but beware, I think it just might do the same for you!!!","The antiwar musical \"Hair\" is my number one cult-movie. I do not know how many time I have seen this film in the movie-theaters and on VHS, or how many times I have listened the CD with the stunning soundtrack, and now, this masterpiece has been finally released on DVD in Brazil.The pacifist and touching story is still amazing, a hymn of freedom, friendship and liberty of choices, and pictures the resistance of a generation against the stupidity of war. I do not know what happened to this wonderful generation of the counterculture of the 70's and their dreams, since the present world is probably worse than in the 70's. I do not recall who won the Oscar in 1979, but Treat Williams and John Savage deserved at least a nomination for their awesome performances. Beverly D'Angelo is extremely gorgeous in the role of a hypocrite spoiled upper-class teenager. I have seen \"Hair\" probably more than twelve times, and my eyes always get wet while Berger walks to the airplane singing \"That's me, that's me, that's me\", and I start crying with his gravestone in the cemetery. I believe this is one of the most beautiful, sad and touching conclusions of the cinema history. My wife, my daughter and my son also love this film; therefore I can guarantee that \"Hair\" is timeless and recommended for any audience. My vote is ten.Title (Brazil): \"Hair\"","This seems to be a love-it-or-hate-it film; I'm one of those who love it. Other commenters have said most of what I'd want to say about the movie, but I did want to add one thing:A couple of people here have complained that the relationship between Claude and Sheila wasn't documented well enough to explain \"the great love they're supposed to have at the end of the movie\" (to paraphrase one reviewer here).I would like to respectfully suggest that they didn't have any such \"great love;\" instead, Claude had a crush on Sheila, which she didn't reciprocate (or at least not to the same degree). Instead, she came along on the road trip to spend the time with Berger, whom she found far more interesting than Claude - you can see that from the time she meets him.Doesn't that make more sense, now? Enjoy!","The original stage show was a gem, but there was no practical way of reproducing its essence on film, so it appears the story was almost completely rewritten and the staging redone for the film version.What was filmed is lively and a fun depiction of the hippie movement as it never was.  Then again, most musicals reach into fantasy just a bit to give the audience the escapism reason for wanting to see movies.  The movie of Hair is presented in a very main-streamed format (unlike the stage show) and leaves out the major protests of the stage show against pollution (I understand that DOW Chemicals was a major financial backer of the movie, so that might explain the omission of all pollution references and songs - although they are on the soundtrack) as well as most references to the politics of the era or the plight of black soldiers in combat.  Gone, too, are most of the conflicts between the younger and older generations. \nThis film, however, works for what it is: a musical fantasy that should not be taken seriously or as a depiction of real history.  The songs that made it to the film are just as full of energy as they were on the stage, and the new story line (for the most part) is well done.  The ending, sadly, goes over the top and alters the whole focus of what had been the building conflict within the plot.  Overall, it is an enjoyable musical involving a very sad time in this nation's history.  Unfortunately, the profundity of the stage show is lost, and most people will only ever know the frivolity of this film rather than the beauty and depth of the original musical.","When I was younger I saw the end of HAIR on TV. I just watched the last 5 minutes of the film. And I was really impressed by it. I got goose pimples and I said to myself that I HAD to watch this film.And I did, and I've to say: This film is amazing. The songs are great, the actors are very good and the message... The message of this film is one of the most important ones: \"Make love, no war\". This film is a real masterpiece. Meanwhile it's my favourite film.The last song is one of the saddest and happiest I ever listened to. I nearly could feel myself joining the crowd. All I've got to say: \"LET THE SUN SHINE, LET THE SUN SHINE IN\"","Hair is one of my favorite movies of all times. Even not being part of my generation, I already watched this movie 9 times and I can't get enough with the beautiful message of understanding,passion,beauty and love. This movie is against the Vietnam war and shows how people should be united independent of the color,origins, religions and classes. I love the characters Berger and Woof and I think Central Park of the 70's one of the most beautiful places I already saw in my life.By the way,I still have this music in my mind:When the moon is in the Seventh House And Jupiter aligns with Mars Then peace will guide the planets And love will steer the starsThis is the dawning of the age of Aquarius The age of Aquarius Aquarius! Aquarius!Harmony and understanding Sympathy and trust abounding No more falsehoods or decisions Golden living dreams of visions Mystic crystal revelation And the mind's true liberation Aquarius! Aquarius!ps: I am surprised to see that the director of this movie is the same director of AMADEUS. I just love both movies!","The songs are fantastic and the story-line is good. Like many other acting schools, mine also produced HAIR. For most hair production it's a golden opportunity to do nude, but my production was fully dressed... I don't think full frontal nudity in a movie or a play guarantees artistic quality... And so did the creators of the movie. The movie version is great with classic hits following each other while letting the plot develop to the chilling climax. A great cast of actors, dancers and singers.","There are some wonderful visuals and musical numbers in this film version of HAIR, but unfortunately the subversiveness of the original has been almost totally lost. For those of you who don't realize it, this film is almost nothing like the original play; Claude was more or less the leader of the tribe, not Berger. And Claude was bisexual. Most of the plot in the film was totally fabricated by Milos Forman, the director. Among other things, he left out some of the more interesting songs, including one (My Conviction) that was sung by a transvestite, long before most people were even aware that such people existed. The anti-war sentiment was much stronger in the original...etc etc etc.All this does not mean that the film version of HAIR isn't interesting - obviously many people like it. But I thought you should know that it is a pale substitute for the original. For those who liked the film it might be worthwhile buying the play and discovering just how different the two versions are.I would like to say one thing here that I found extraordinary. I live in Paris, and when this film opened I went to one of the largest cinemas in Paris to see it. At that time, the French were a very controlled people in general. Despite this, something quite extraordinary (for its time) happened in the cinema the day I was there. At the point in the film where Hud's wife is angry for having been deserted by him, she sings \"How Can People Be So Heartless?\"... and she did such a wonderful job of it that the entire theatre burst into spontaneous applause. In the middle of a movie theatre, this was unheard of behaviour for the French, So I guess Milos Forman did something right!","I don't usually comment on movies that already have lots of reviews. But when I read through the reviews written by viewers who didn't like Hair I felt that my disenchantment with the film was a bit different from that expressed by other people. I saw the original stage production when I was very young, and grew up listening to the lp, from age 5 to 15. I loved Hair, both the music and the story. And when the movie first came out I saw it. I didn't like it. Now, 25 years later I have tried to watch it again, thinking that with the passage of time, Hair the Movie might have qualities I didn't notice then. No. That is not the case. If you like The Wiz then Hair the Movie might be up your alley. But if you are expecting it to let the spirit of the songs and story emerge, forget it. Watch the original Jesus Christ Superstar or watch a movie made in the 60s or early 70s, like a Cassavettes or Jodorowksy movie (or anything). But I'll try to tell you why Hair the Movie is such a disappointment.Several reviewers have complained that the movie is dated. I agree - but it is dated, not because it is about the 60s, but because it is about the late-70s. Watch Micheal Jackson's Thriller and you'll have pretty much seen the \"authentic\" 60s dance sequences. Tharp or no Tharp. Make-up, coifs, clothes, jewelry, all remind me of the cheesy late disco/early New Wave style.The producers went out of their way to flatten the significance of the songs. We can still hear the taboo words, but gone is their force, and gone are the dark insinuations the writers made about a society torn apart by racial hatred, economic inequality, and confusion over a war we were fighting for murky reasons. Hair the Play asked questions like: what does it mean to die for your country? what does it mean to be free? what does it mean to be hated? what does it mean to love? Hair the Movie doesn't ask anything. It shows us some stock characters, with easily identifiable clichéd qualities, and runs them through a predictable story. At least one reviewer complained that Hair is about a bunch of drug taking hippies, etc. etc. Sadly, that is exactly what this movie is about - cheerful, vacuous, stereotyped characters. Hair the Movie is not about humans struggling with hate, death, love; struggling with their own values and those of their families, friends, and people who they may never know but who they are told to hate. In fifty years, film critics may look back on Hair the Movie and be able to say something interesting about the fetish of the 60s, the shallowness of the late-70s, or something. For now, this movie sucks.","It sure must be great to be such a free spirit that you don't have to work for a living because you can always beg from people who do. And it sure must be great to be such a free spirit that you never have to wash your clothes or take a bath. And it sure must be great to be such a free spirit that you do not have to worry who the father is if you get pregnant, or, if you are a man, worry about supporting the woman you abandoned when she turns up with your child. And it sure must be great to be such a free spirit that you can display your superior attitude toward life by stomping all over the food that people were going to eat at a dinner party. And it sure must be great to be such a free spirit that you can steal a car just because the guy who owns it is uptight and therefore deserves to be treated with contempt.What an insufferably sanctimonious bunch these lowlifes are! My flesh crawled all through the film. Thank goodness people do not put up with this nonsense in real life.","Milos Forman celebrates the hippies: people should be able to remember with this how beautifully right they often were. They are still usually put down as much as they were when they were operational.The best \"HAIR\" is beautiful Beverly D'Angelo's, blowing in the wind as she sings \"Good Morning, Starshine\" in the Pontiac convertible with her new friends as they zoom across the Nevada desert to find Claude (John Savage.)Berger (Treat Williams) has two fabulous arguments with \"the authorities,\" both of which are very painful to watch, because you can feel the military-social force over what is considered to be his irresponsibility and paltriness. The first time is at Sheila's wedding party when he resists eviction from the party, and ends up mostly prevailing by dancing on the table--although he and all of his friends end up in jail for it. The second time, at the army base, he does not prevail and the other well-known solution is arrived at. But both times you can feel the quiet violence of authorities against gypsies.Actually, society tells you to be like the Flower Children, then punishes you if you actually do it.Just because a lot of the original Flower Children became Yuppies doesn't mean they didn't do anything important when they were hippies.The 60's were NOT over because of what some otherwise fine writers have \"authoritatively\" said had already begun to occur before the Manson murders. Anything artistically beautiful leaves living traces that endure forever: this film documents one of those movements that mattered.They called this writer \"media poison\" and she wasn't always that. She just called them \"children\" who she more or less said were just \"living this way\" and left it at that. They had been smart not to tell her everything in Haight-Ashbury when she drank gin and took ups to do the story.In the same group of essays, she claims not be interested in \"paradises, real or artificial.\" Well, that explains a lot.She said she was too unstable to take acid when they offered it to her; but this was only partially true: It was fear of paradises.Otherwise, it is impossible to miss how this extraordinary film, made almost 15 years after Haight-Ashbury and the East Village would cease to exist as they had (remaining primarily only as weak mutations reduced to unspeakable New Age ashrams, where the pot was all gone and heavily enforced k.p. duty--vilely called \"karma-yoga things\"--was prevalent) captures so much of the happiness that some of us remember so well still as we continue on as kinds of older hippies...Twyla Tharp's choreography and Ann Roth's colours are all that that strange moment was and is supposed to be--I remember the way people who had used LSD drew stars; you could always tell a psychedelic star, a psychedelic moon, a psychedelic sun. I went to a New York head shop where I was referred to an \"84-year-old morphine addict\" who lived in Paris, who I was to look up as I bought two velvet hats.Some hippies lasted. I saw Adam Purple at the Union Square Market in 1996 riding a bicycle festooned with many balloons and told him how much I had loved his tulip garden in concentric circles grown in a vacant lot in what was then a wino neighborhood on Eldridge Street, about 1977--and then razed for high-rise apartments. He said \"yeah, if it's good it won't last...\"Well, that's not exactly true, of course, but he wouldn't have been a pure hippie artist if he hadn't been able to put it that way, and not try to see it another way.His wife was Eve Purple. I hope he hadn't really married her. They obviously wouldn't have needed to.Beautiful Beverly D'Angelo seems to love Berger and Claude and Hud (Dorsey Wright) and she is never corny about it. Nobody is corny.Corniness has little to do with love.Hud's fiancee is Cheryl Barnes and she sings \"Easy to Be Hard\" full of deep Gospel that resonates dark sounds in Central Park. It is this song that proves the comprehensive intelligence of the show: Hud has just tried to shirk his responsibilities to Cheryl and their young boy. He wants to \"wish them away.\" In this song she talks about how easy it is to be hard, \"especially people who care about strangers...who care about evil and social injustice..\" those same people who will walk away from those close to them when they get in the way of their easy time of it. Gradually, Jeannie and Sheila and Berger and Woof make Hud go back and gather Cheryl and the boy up. Even the hippies were being given a strict test for hypocrisy; the beauty of this is that they pass the test so we can love the hippies. The 'carpool' going across the desert would never have been possible if Cheryl and the baby hadn't been part of the \"mornin' singin' song.\"Central Park has never been more of a movie star than it is in this one, and New York is sure *lookin' good* in this memoir of collective rapture.That same essayist said \"New York was no mere city\" and that she would always have the feeling toward it as of \"the first person who touched you.\"She was often right, of course. It's not my fault she wouldn't give the hippies a break. They had time to help bring on the resistance to the Vietnam War that forever changed the course of what America could then be, no matter how hard it tries to forget it.\"Let the Sunshine In\" makes it impossible for the song in the Pontiac Bonneville convertible to be called \"Good Mornin' Sunshine,\" and that is a true blessing, it goes without saying.It's about those psychedelic stars even though they are under the sun in the morning in Nevada and this moment in the film is like a magic carpet ride all its own. This is where the hippies just get to be hippies (like in THE NIGHT OF THE IGUANA when Mrs. Faulk (Ava Gardner) says when Richard Burton finally lets loose \"That's Shannon bein' Shannon!\"):\"Good mornin', Starshine...the earth says 'hello'...you twinkle up above..we twinkle below...\"Good mornin,' Starshine...you lead us along...My love and me as we sing...our early mornin' singin' song...\"Glitty clup cluby...libbee lubbee loobee..oh la la la lo..\"Saba sibbie saba...Dooby aba naba.. lily lo lo..\"Dooby ooby wama...Nooby aba naba.. early mornin' singin' song...\"\"Singin' a song, song to sing...\"Song song song, si-ing sing sing sing-song... \"Song song song, si-ing sing sing sing-song... Song song song, si-ing sing sing sing-song..\"(This is not a cereal song, but it would make cereal seem okay and even macrobiotic food more bearable if one remembers beautiful Beverly D'Angelo and beautiful Treat Williams-it wouldn't even hurt Anita Bryant and Pat Boone and other Baptists, but they couldn't sing it either.)A song about song. Very perfect singin' song, I'd say.","I was a hippie age 22 in 1965, have seen the play 5 times, have 2 versions of the music, and have read the script many times. Maybe taken as an separate thing, the movie is OK, but as an adoption of the play, it's terrible.First the good. The songs are sung well, and the production values are pretty good. The homosexual implications in Black Boys, White Boys is cute. The Claude/Berger switch was interesting. Hair is a fluid production, and constant changes in it are inherent provided the basic spirit of it is retained.But the basic spirit was very much distorted. It seemed like all the producer wanted was to sing certain songs, and fit the story-line to them regardless of what that did to the original intent of the play.Claude, Sheila, and Hud were presented as a selfish brats who could care less about anyone outside their tribe. Claude destroyed Sheila's parents party (it's hard to believe that she smiled while her parents were being hurt), and repeatedly stole cars. Sheila stole the soldier's clothes and car. Then she left him in the middle of the desert where he would certainly sunburn badly, probably be busted in rank, and could likely die on that lonely Nevada road. Good fun. And Hud found it fine to break his son's heart while yelling at his ex. This is not what hippies were like, not what the play described, and is directly opposite to a love generation.I've never seen a hippie beg for money. The point was to be self-sufficient outside the capitalist system, not beg from it.After Berger is thrown in jail for ruining Sheila's party and Claude offers to bail some out, Berger insists on being bailed instead, with no better plan for bailing the rest that hitting on Sheila's parents, and then hitting on his own mommy.\"Be In\" has always been a very spiritual point, but here it is wasted on silly brides floating around. Even if this is part of his trip, it ruins a beautiful song. I know they're contrasting \"Floating In Space\" with the Army. But again, it totally ruins a beautiful song.While Sheila and Claude are skinny dipping, Berger steals their clothes, laughing \"it was fun man\" even after he could see both were very annoyed. Then a little later, Berger does one thing that no hippie ever does. He hits Claude. Terrible.Then they have the perfect opportunity to sing \"Starshine\" at night in some beautiful SF spot with the stars twinkling down, maybe working into an inventive duet. Instead, the whole tribe sings it in the blazing sun speeding down the road in a convertible (stolen of course).I was vastly disappointed with the movie in 1979, and I like it even less now. I think it would have been possible to do a reasonably close adoption of the show, but this ain't it.","I saw the play production of Hair shortly after the revival. I was pumped to see it was a movie. My first problem is they only used the parts of the play they wanted to. Killing Berger, while a change, was not needed. The original ending was fine. My biggest problem is I feel like this movie makes hippies out to be these terrible people. And they really aren't. My other problem is the wrong people are singing. Woof did NOT sing Hair in the play. It was Berger and Claude. There was a connection with the characters and the audience. You wanted to see what happened. It was weird and crazy and sad and inspiring. But this movie is poorly put together. I'd rather they just film a production of the stage play and sell it on DVD. That would be amazing. Don't waste your time. It isn't worth it.","Many people have raved about the film version of the acclaimed Broadway musical here on IMDb. That being said, I went in to watching this film with a very open mind. Having seen the play only a few nights before viewing the film, I couldn't wait to see the same amazing songs and the same poignant storyline done on the big screen.However, from the get-go I was rather disappointed. Not only was the story almost completely rewritten, important pieces were omitted and songs assigned to specific characters in the play were completely reassigned to other characters (with seemingly no rhyme or reason). I was especially disappointed in the representation of Hud. In the play he (and all the other characters) are harmless, peace loving hippies but this movie makes him an arrogant and absent father of a child who then proceeds to scream at and be abusive towards the mother of the child (two characters not even included in the play in the first place).Sadly, the vocal \"chops\" of the stars in the film just didn't match the caliber of the current Broadway cast either.Someone else said it very well in one of their reviews, this movie just did not capture the spirit and real message of the play for me. A lot of people scoff at the nude scene that is in the play, but it actually holds very important symbolism and in actuality, is a pivotal moment in the plot. Obviously at the time, a full nude scene was out of the question for films, but I think the issue could have still been dealt with in the movie in one way or another. I can also say that I can only imagine what a monumental task it had to be to turn a play that revolves around only one set and its cast of characters into a feature film, but it has been achieved successfully in the past and I think it still could have been done with this play as well. Some might say you have to separate the play and just appreciate it as a film, and that may be true. But for me personally, the play is such a gem and such an important political and historical artifact that it was just impossible to separate the two.","I'm not a big musical fan, but this is one of the few I really love. Unlike many other musicals, such as \"The Sound of Music,\" none of the songs are about gratuitous stuff. Each song is social commentary, acumen on war, sexuality, recalcitrance, spirituality, and freedom. Especially amazing songs are \"Easy To Be Hard,\" \"Age of Aquarius,\" \"Hair,\" \"Flesh Failures/3-5-0-0,\" \"Walking In Space,\" and \"Hare Krishna.\" Totally revolutionary and wonderful. I can't wait to someday see it live!","Well, I've finally seen this hallowed cultural icon of the Sixties, and I gotta say, it stinks. It's a musical, and that's a lot of what's wrong with it: \"Age of Aquarius\" and \"Let the Sunshine In\" are pretty good songs, and \"Easy To Be Hard\" is passable, I guess, but all the rest are just awful, with unmelodic music and pretentious lyrics. The dancing is good, and Twyla Tharp's choreography is excellent, but that can't make up for the lousy songs.Then there's the story. Treat Williams stars as the leader of a small band of hippies, and his character strikes me (at age 68) as pretty obnoxious. Did director Milos Forman really intend for the hippies to come across as such smug, narcissistic jerks? *Were* we such smug, narcissistic jerks? I wonder.All in all: An embarrassment to all us old ex-flower children.","The stage play \"Hair\" is primarily remembered now for two things....its shocking frankness and its music.  In bringing the musical to the big screen (belatedly), the bulk of the stage version's loose plot was discarded and a more conventional storyline was created to link the songs together.  This seems to either please or alienate people, depending on their relationship to the original show.  In any case, the great majority of the songs are retained in this filmization which is more than can be said for many, many stage to screen adaptations.  And what music!  In most cases, the vocalizing even exceeds the quality of what could be found onstage, though the authenticity of the performers is obviously forsaken somewhat as the original cast was LIVING this at the time they were in the show.  The film's plot concerns an Oklahoma farm boy (Savage) who's on his way to report for active military duty during Vietnam.  He is waylaid in Central Park by a clatch of hippies led by Williams.  He also spies the girl of his dreams (D'Angelo), a debutante who rides by on horseback in the midst of all the free love gyrations taking place in the park.  The rest of the movie concerns the connections of these characters as they experience culture clash, sharing, understanding and even love.  There is copious drug use and rebellion against the wealthy along with hallucinogenic dancing and skinny dipping.  Eventually, one character makes a gesture for another which winds up costing more than could ever have been imagined.  This moment makes for a hugely poignant ending to what is mostly a light-hearted and ebullient film. True, more than a little of the original subject matter has been tossed aside, but the filmmakers must be credited for (almost) successfully weaving a story around the songs (which are quite varied in their style and content.)  The story fails with regard to creating a believable bond between Savage and D'Angelo that would endure the way it does in the story.  They hardly spend any time together in the bulk of the film (and quarrel a lot during that!), yet supposedly have this amazing love.  \"Aquarius\" gets the movie to a rousing, eye-opening start and it's just the beginning of many striking, effervescent musical moments in the show.  Oddly, the one song that is badly arranged, poorly sung and just basically mangled is the title number!  Most of the rest are excellent.  NOTHING is better than complete unknown Barnes' rendition of \"Easy to be Hard\".  She knocks the song completely out of the ball park and, sadly and inexplicably, her career went nowhere.  Williams is, at times, deliriously sexy here.  He comes off as annoyingly arrogant and stubborn at first, but eventually wins the audience over with his innate charm and vibrant talent.  As the movie nears it's close, he soars into the hunk stratosphere when, ironically, he cuts his hair.  Savage doesn't come off at all like an Oklahoman, but manages to display the contrast of his and Williams' characters.  He does an adequate job in all departments throughout.  D'Angelo (two years after her jaw-dropping role in \"The Sentinel\"!) is hardly debutante material and comes off as icy much of the time, but she has her moments as well.  Chapin does a bang up job as her brother.  The remainder of the hippie gang are acquired tastes.  Wright does pretty well, but went nowhere after this.  Golden just looks dazed and chews gum incessantly.  Dacus is quite weak and does little to enhance the film.  What's surprising is how a film that contains lengthy shots of bare breasts, male rear ends (and even split second male frontal nudity) was considered benign enough to warrant a PG rating, yet now, nearly 25 years later, America seems to still have a Puritanical viewpoint towards the human body when compared to other countries.  The tide has turned backward from the free love and self-expression era (except in trash like \"The Jerry Springer Show\" and \"Howard Stern\".)","The Hair DVD was my first viewing of this musical.  Having heard many of the songs in my early adulthood, I was disappointed by the difference in the musical arrangements.  The movie script had flaws, but there are good scenes:  Berger asking his folks for money, and the scene cuts between basic training and the hippie group, for example.  The irreverence of Berger reminded me of today's youth, with one hand out and a smart-ass retort to any authority.For me, the surprise ending upgraded this movie from average to good.  I watched the last five minutes over and over.  The symbolism of the lines of soldiers being sent through the gates of darkness to an unknown fate was moving."],"review-user":["ijonesiii","movibuf1962","stalzz64","eisbarjeff2k","dvmb65","theDIABEETUS","jason968","ashley_2_2-1","claudio_carvalho","asklepieia2000","15231","MHerby","Lady_Targaryen","cLoNe","pogostiks","Jerry-Kurjian","disinterested_spectator","pmullinsj","dspear7777","alekshea","blonde4areason@hotmail.com","fuxing626","davethemathtutor","Poseidon-3","davphv"],"review-date":["13 January 2006","23 October 2003","10 November 2004","7 August 2004","9 October 2004","3 January 2004","21 July 2002","20 November 2003","22 April 2006","13 November 2004","25 June 2003","12 August 2005","18 April 2006","5 August 1999","10 March 2007","26 November 2006","13 December 2014","27 May 2004","18 March 2008","13 May 2016","21 March 2009","16 August 2003","8 August 2017","6 November 2003","27 April 2004"],"review-rating":["9","10","10","10","8","7","10","10","9","10","6","1","2","1","1","4","10","3","7"],"review-title":[" A sketchy Broadway musical becomes an amazing screen musical\n"," \"You know I'm hung up on you.\"\n"," A classic musical!\n"," Great, over & over!\n"," Timeless\n"," Incredible\n"," Highly underrated\n"," Warning: Highly Addictive, You May even find yourself singing along!\n"," My Number One Cult-Movie\n"," Putting the record straight (mini-spoiler)\n"," Not the stage show, but a fun musical\n"," One of the greatest musicals! Amazing.\n"," Hippies against the Vietnam war\n"," A great musical!\n"," Not really half as interesting as the original\n"," More of a toupee\n"," Get a Job You Lazy Bums\n"," Superb Forman Adaptation of Legendary Vietnam Era New York Show\n"," Terrible\n"," No. Just no.\n"," Disappointing\n"," Nothing short of incredible\n"," Hair is a dog\n"," A different \"Hair\"-style than the stage version, but still good.\n"," powerful ending\n"]}