{"review-url":["http://www.imdb.com/title/tt0025799/reviews"],"review-text":["It is not always certain that by mixing comedians together you will produce laughter. The comics involved have to actually like or admire each other, or be willing to put up with each other's crankiness. GO WEST with the Marx Brothers had Buster Keaton write the script as a gag man. Groucho did not think too highly of Keaton's ideas, and embarrassed him at a script meeting. And though some of Keaton's gems still appear in the finished film (such as the gun that turns into a brush that turns into a gun) the film was one of the weakest the Marx Brothers ever made.A better film, but also affected by dueling comic egos, was W.C. Fields and Mae West in MY LITTLE CHICKADEE, which jettisoned the script for a series of duels of one liners between the leads. But the one liners were equally funny, so the film remains a success.But SIX OF A KIND is an example of six film comics who worked well together. The reason is simple: it is really three comic teams working together: Charlie Ruggles and Mary Boland, George Burns and Gracie Allan, and W.C. Fields and Alison Skipworth. Ruggles and Boland were paired in about half a dozen comedies during the 1930s, usually with Boland as a somewhat bossy wife, and Ruggles as a nervous wreck of a husband. Fields (usually a single act) was paired three times with Skipworth (TILLY AND GUS and IF I HAD A MILLION were the other two times). Skippy always figured out how to control or counter the larcenous activities of her man - it the present film she takes action into her own hands with the stolen money that is being searched for (she knows that the local sheriff, Fields, is not the one to trust with this). As for Burns and Allan they manage to effortlessly involve themselves with the put upon Ruggles and Boland on their cross-country trip by car.Ruggles quickly gets to realize what a mistake it was to agree to travel with Gracie - at one point she manages to cause him to fall off a cliff, and dangle from a branch. He is relatively helpless when she insists on 1) photographing him on his perch, and 2) correcting his grammar. The presence of George and Gracie's humongous dog (\"Ran Tang Tang\" is it's name) does not make travel arrangements easier for Charlie and Mary.Fields has some choice moments. When he insists on shouting at the quartet, he says he's allowed to do so - he's the sheriff! He also explains, during a pool game, the improbable story of how he got his undeserved moniker \"Honest John\". You have to listen carefully to the tale, as it is interrupted with his attempts to play pool a few times (once getting accidentally beaned by a billiard ball), but it does show that there were items that even Fields would have had no reason to steal.Oh, in the \"Summary Line\", I mentioned a forgotten actor named Bradley Page - he was the man who is responsible for the trouble that Charley Ruggles is suspected of. Bradley has to have a reason to leave town in order to catch up with the unwary Ruggles and Boland, so he telephones his girl friend. He tells her to call back his job and say that he has to leave town because somebody has died. There is a pause as he apparently hears a question shot back by the girlfriend. \"ANYBODY!\", he says - clearly annoyed. Although the bulk of the humor in the film is carried by the sextet of performers, Mr.Page happened to have the most amusingly unexpected line in the film.","Three zany couples, all SIX OF A KIND, become entangled in a madcap search for stolen bank loot.This is a lively, hilarious comedy, with the six stars - Charlie Ruggles & Mary Boland, W. C. Fields & Alison Skipworth, George Burns & Gracie Allen - all heartily engaged in doing what they did best: getting laughs.Ruggles & Boland make another of their film appearances as husband & wife - this time rather more amorous than usual. They were a perfect team - she the strident lioness, he the nervous rabbit - and they dominate most of the screen time here. From beginning to end, they are a delight.Burns & Allen continue the patter they originated in Vaudeville, perfected on radio & would eventually take to television, with George the perpetual straight man & Gracie the eternal fool. At times in the film she tends to go a bit over the top, but it's difficult to dislike her. Her heart was obviously made of solid gold.While Skipworth is given rather short shrift - only fragments of her formidable personality flash through - Fields is in his element as the disreputable sheriff of Nuggetville, Nevada. Whether explaining how he got the nickname Honest John' or skulking about at night looking for the missing moola, he is never less than wonderful. Best of all, he gets to perform his entire classic pool routine, preserving it forever for a grateful posterity. Finally, he executes the near miraculous - he gets Gracie to shut up.Paramount was so pleased with the success of SIX OF A KIND that they wanted to hurry the principle players into another comedy. Only Fields demurred. He felt he had now arrived at the point where he no longer needed to share a movie with other celebrity comics. The Studio finally agreed and began preparation of Fields' first solo starring feature, YOU'RE TELLING ME (1934).","Comedy can date more rapidly than drama, generally. Certainly, the comedy of Burns and Allen (while still unique) is of its era. In fact, they perfected their act in their 50s TV series -- which is still delightful if you can find it.But the value of \"Six of a Kind\" is more an artifact of particular players forever captured on film. Mary Boland is always excellent and she's wonderful here (but at her best a few years later in \"The Women\"). Charlie Ruggles essentially played the same role all his career and nobody plays Charlie Ruggles better. Alison Skipworth is barely utilized at all, here.It's the preservation of W.C. Fields' immortal \"Honest John\" routine from vaudeville that earns \"Six of a Kind\" its place in film history. It's difficult to imagine how this routine worked from the distance of a stage. But on film it's a miracle of comic construction, timing, delivery and skill (yes he actually ricochets that billiard ball off the far end of the table where it bounces back and hits his forehead). The routine is hypnotic and hysterical, and perfectly pitched for film.","A must for anyone who wants an example of a comedy that's just wonderfully ridiculous, \"Six of a Kind\" is a road-trip movie that's absolute nonsense.Ruggles and Boland make you laugh at them, with them, and for them; Burns and Allen take silly to a new level; and Fields and Skipworth show up later in the game to round out this sextette of psychos. Fields' billiard scene (reworked from one of his earlier films) is not to be missed.","That was one of the lines in a trailer about this film and for once the publicists did not exaggerate. All six of the featured players here are on the screen 99% of the time, so they have to be good.It's always fascinating how certain plot premises can be worked for either highballing comedy to a deadly serious situation. Mary Boland of the ditzy and Charlie Ruggles of the henpecked play their usual characters who are planning to motor all the way to California. To share expenses they advertise for someone to share the ride. They get Burns and Allen and a monster of a dog. That same premise was a deadly serious one several generations later in Kalifornia.Of course if you're traveling with Gracie Allen you know you're going to be going absolutely nuts trying to figure her Monty Pythonesque reasoning about the whole world. And if that ain't enough you get to run into W.C. Fields, part time sheriff and full time pool hustler who's living in sin with Alison Skipworth. But back then we didn't delve into such things.A real classic comedy from the thirties, not to be missed.","The idea in this is to take three comedy teams and combine them in one movie. The gimmick is that these represent three radically different types of humor. What happens usually is people find some things funny and ignore the others. Scan through these IMDb comments and you will see grace fall on different players in this.The Fields poolplaying routine is priceless. I've seen it before but cannot recall where. But its inserted into this project without reference to anything else. Incidentally, it works as well as it does because there is a watcher in the frame, a deadpan face that is every bit as valuable and practiced as the actor.That's indicative of how the experiment fails as a whole. If you know \"Mad Mad Mad World,\" you'll know a successful example where comedic methods actually do bump up against each other and generate something resonant, rich, higher.In this case however, the comedic models take turns. Isn't as effective.Ted's Evaluation -- 2 of 3: Has some interesting elements.","I watched Six of a Kind for W.C. Fields - he's only in it for around 10 minutes and has one long scene, the infamous pool sequence he made famous in vaudeville, and several other great moments. The reamaining 55 minutes are also delightful, thankfully, mostly due to the hilarious Charlie Ruggles as the bumbling banker J. Pinkham Whinney. He is everyone's foil. He stutters and stumbles about to our pleasure. Also, his comedy partner, Mary Boland plays his wife, Flora. Joining in the proceedings are George Burns and Gracie Allen. Boland is particularly funny near the beginning and near the end, but Gracie and Ruggles use up most of the picture. Gracie's funny, quite, but she can also get tiring. And poor George Burns has absolutely nothing to do except repeat Gracie all the time. I don't remember laughing at him once (although he has one great scene with Ruggles, where Ruggles tries desperately to get George to take Gracie and leave him and his wife alone for a while, and one with Fields, where he asks Fields to sell him a sweater; that bit is exclusively Fields', though). The situation is constantly funny: the Whinneys are going to drive to California, but to help them with expenses, George and Gracie are recruited. 8/10.","Six of a Kind (1934) *** (out of 4) A couple (Charles Ruggles, Mary Boland) are about to go on their second honeymoon when the wife gets the bright idea to save some money by placing an ad in the paper hoping to get another couple to go along and share expenses. A couple (George Burns, Gracie Allen) agrees to go but it's just one disaster after another especially when they get to a small town with a mixed up sheriff (W.C. Fields). Considering the cast you'd think this Leo McCarey comedy would be much better known but it's pretty much been forgotten over time. While it's far from a classic comedy there are enough good moments to make it worth sitting through and especially with a 62-minute running time. The biggest thing going against the movie is its screenplay, which really isn't all that good. At just 62-minutes it seems as if the movie is broken down into six, ten-minute vignettes and it really gives the movie a somewhat uneven film. With that said, enough of those vignettes work thanks in large part to the cast. Ruggles and Boland are very good together and share some great comic timing and especially in some early scenes dealing with how much she paid for the ad. Burns and Allen really don't get too much to work with as the screenplay pretty much keeps him in the background while she gets to play dumb. Even Fields role isn't the greatest but the comic legend does what he can with it. The real star of the film goes to the wonderful dog who is downright hilarious during his scenes and especially the ones where he's pushing Ruggles around.","SIX OF A KIND (Paramount, 1934), directed by Leo McCarey, might indicate a movie about a card game but actually is a road trip story featuring a combination of three popular screen teams of Charlie Ruggles and Mary Boland; George Burns and Gracie Allen; and W.C. Fields and Alison Skipworth. Ruggles and Boland are the central characters, Burns and Allen take the back seat as the secondary couple along for the ride, while the final twosome, Fields and Skipworth, arriving during the its final half, acquiring less screen time than the others, all gathered together for this one of a kind comedy.The story revolves around J. Pinkham Whinney (Ruggles), a teller at the Second National Bank, and his wife, Flora (Boland) of twenty years, preparing for their two week vacation/ second honeymoon on a road trip to California. Flora, who has placed an advertisement in the Daily Morning Globe for another couple to accompany them and share expenses, acquires the company of George Edwards and Miss Gracie DeVore (Burns and Allen), along with their great Dane, Rang-Tang-Tang. To make matters worse, Pinky unwittingly has $50,000 of stolen bank money placed in his suitcase by fellow bank clerk Ferguson (Bradley Page) with the intention of taking back the cash at Whinney's first stop at Glen Falls Hotel in Glen Falls, and leaving town with his girlfriend, Goldie (Grace Bradley). With George and Gracie doing some back seat driving, Whinney ends up taking another route to Philipsburg, getting themselves lost, robbed by a couple of tramps (Walter Long and Leo Willis), and ending up in the small town of Nuggetville, Nevada, where the Whinneys register at the Palace Hotel run by Mrs. K. Rumford (Alison Skipworth). Because they are unable to pay for their rooms (having Whinney and George sharing one room and Gracie and Flora in another), Mrs. Rumford decides to take Whinney's suitcases as security. Going over the contents with \"Honest John\" Huxley (W.C. Fields), the town sheriff who is anything but honest, acting as her witness, she encounters $50,000 hidden inside. Further complications arise for Whinney when detectives (James Burke and Dick Rush), hired by the bank, enter the scene, suspecting him of stealing the money with plans of going away with Goldie which leaves Flora in a state of shock.At 62 minutes, SIX OF A KIND has all the ingredients of a two-reel comedy in feature length form. With Ruggles and Boland doing what they do best, their scenes are nearly overshadowed by the annoying antics of Burns and Allen, whose very presence makes it totally impossible for the Whinney's to have a moment alone together. One scene finds Gracie taking Flora's picture as she stands by the ledge, causing her to fall over when told to move back, revealed in a harrowing predicament resting on a limb over the Grand Canyon. Another scene taking place in a store has George falling victim to Fields while attempting to buy a sweater. Nothing could really compare with the best known sequence of all with Fields attempting to play a game of pool and asked repeatedly by a character named Busby (Tammany Young), \"How did you get to be called Honest John?\" While SIX OF A KIND is notable as a W.C. Fields film, this being his third and final opposite Alison Skipworth, whom he affectionately calls \"Duchess\" this time around, the movie was distributed on video cassette in 1996 as part of the Burns and Allen comedy collection, commemorating the 100th birthday of George Burns. A decade later, SIX OF A KIND was placed onto DVD, triple featured with other lesser known Burns and Allen 1935 releases, LOVE AND BLOOM and HERE COMES COOKIE, preceded with theatrical trailers. Out of the television markets since the 1980s, SIX OF A KIND was given a rare screening on Turner Classic Movies in June 2001 as part of its tribute to \"Star of the Month\" W.C. Fields. A silly comedy at best made credible by the six pack accompanied by a deuce with half a deck named Gracie. (***1/2 jokers)","The plot's pretty lame, George and Gracie are okay (a few shining moments, but nothing spectacular), and the jokes aren't all that outstanding, but there is a five minute sequence with W.C. Fields attempting to shoot pool that is one of the funniest five minutes ever put to celluloid.  I howled at this scene as I have rarely howled at anything in my life.  The entire movie is worth a watch for this scene alone.","I heartily agree with those previous reviewers who praised this six comics entry to the skies. Before I actually watched the excellent Universal DVD, I was under the impression that it was a portmanteau picture akin to those in the great revival of this form in the 1950's. But it's not. It's better. Much better! What we have here is actually the best of both worlds. All the sequences mesh together rather well - even when W.C. Fields seizes center stage and tries to monopolize the proceedings, he is eventually brought into line. All the gags are so superbly timed, it's hard to believe that with one exception, they were rehearsed on the run. Director Leo McCarey obviously allowed the players free rein -- and only once did he come to grief! The one exception is the Fields sequence in which the blowhard added a few more lines to a sequence that now runs just a jot too long. But I'm not complaining and nor is anybody else (except Alison Skipworth, of course!). Available on an excellent Universal DVD.","Poor Charlie Ruggles. He has plans for his second honeymoon with wife Mary Boland and ends up with more than he bargained for, not to mention a Great Dane. You see, flibbertigibbet wife Boland has graciously advertised for a couple to share expenses with on the road, and they end up with Burns and Allen. Gracie, whose proudest moment is the three glorious years she spent in the fifth grade, owns the humongous canine who insists on sitting in the front seat then shows his gratitude by pushing driver Ruggles over a cliff! That's one pooch that can forget about his milk bone.Troubles erupt, not just because of Gracie being always in the wrong place at the wrong time, but an embezzler (Bradley Page) at the bank Ruggles works at who switches suitcases with him in order to get the money out of the branch. But Ruggles leaves with it, and Page must get it back in order to pacify his moll (Grace Bradley). On the road, the gang encounter a group of road robbers, then check into the motel owned by suspicious Alison Skipworth who along with her dipsomaniac sheriff pal (W.C. Fields) learn of the embezzling. Amusing complications occur throughout with Ruggles yearning for time alone with his beloved wife.This extremely short comedy has six stars and lots of opportunities for them to do what they do best. Fields shows off his pool routine (the same one he did 10 years later in \"Follow the Boys\" which I ironically saw again only a few days after this!), while Allen tells Burns about her wacky family, including an infant with three feet. Page, with his thin mustache and dour personality, was a type-cast villain with a voice that instantly gave him the image of smarmy characters who whether criminals or businessmen you don't trust from the minute you see them. The ending wraps the film up very nicely with a conclusion that couldn't have been done a few months later thanks to the strict production code that came into effect.","In 1933, Leo McCarey directed the best Marx Brothers movie, \"Duck Soup\". One year later, he directed \"Six Of A Kind\": it may not be quite in the same league, but it is made with a similar anarchic, lively sensibility. It's also quite daring for its time (\"Why don't you go to bed?\" - \"That was the intention\"!). Personally I am not so familiar with any of the comic actors in this film, but evidently I should fix that: Gracie Allen is totally dissociated from common sense and often hilarious (not to mention pretty cute and huggable!), Mary Boland and Charlie Ruggles have a wonderful, warm chemistry as a loving middle-aged couple, while W.C. Fields plays a Western-type precursor to Inspector Clouseau. The first half is (arguably) slightly funnier than the second, but the whole film is so short (about an hour long) that you probably won't notice. *** out of 4.","The title refers not to a questionable poker hand, but to six comic players. They come in twos: Charles Ruggles and Mary Boland as a couple driving to California for a second honeymoon, George Burns and Gracie Allen as another couple who go along to share expenses, and W.C. Fields and Alison Skipworth as a sheriff and a hotel-owner in a tiny Nevada town. No attempt is made to fashion a coherent narrativeit's a collection of comic bits strung together. All the first couple want to do is spend time together, but Burns and Allen's characters aren't married, so the men bunk together, as do the women. There is a bit of a plot: a bad guy plants $50k in the suitcase Pinky (Ruggles) is taking out of town, but because the expedition is being guided by Gracie, the loot cannot be found. The bad guy shows up in Nevada and Fields accidentally captures him. A bunch of pleasant bits, Ruggles' confused expression, Gracie's batty, breakneck talk, and Fields playing billiards with a corkscrew cue and doing a fluttery, craven, backwards-stepping double-take when he's threatened, and his wonderfully distinctive way of lingering over words. And trying to remember the name \"Gracie,\" he tells Skipworth, \"Hmm. Starts with a K... McGonigle.\" She answers, \"Oh no, no, no, no...\" \"Mmmm. Wangahanky!\" \"No, no, no, no no. Oh, Gracie.\" \"Yes, that's right.\"","The gimmick, as it were, of this 1934 Paramount comedy is the six comedy performers, paired off into three man-and-woman teams, who all appear together. W. C. Fields and his frequent screen partner Alsion Skipworth appear in the second half of the film and shine in their roles as a small-town sheriff and innkeeper. Fields seems to have been given the latitude to inject plenty of his own one-of-a-kind brand of misanthropic, surreal comedy into his part, and it works wonderfully, especially where he is allowed to do his famous pool table routine, a digression that is totally welcome since it is hilarious.At first thought it might have seemed like a mismatch to conceive of a film to be carried by the subtle domestic comedy of Charlie Ruggles and Mary Boland next to the broad, jokey Vaudeville patter of the great husband-and-wife comedy team of George Burns and Gracie Allen, but here it works perfectly because of the parts George and Gracie are given in the script. They are there are freeloaders hitching a ride to California on Ruggles' and Boland's honeymoon trip and consistently find ways to annoy them at every step, including, brilliantly, while they are each holding on to the side of a cliff for dear life.Making Burns and Allen comic annoyances to two sympathetic characters turns out to be a perfect way to fit their far-out, larger-than-life comedy characters into a real world setting -- the comedy of people reacting to them in a believable way turns out to be as much as a gold-mine as Gracie's famous naive delivery itself.Charlie Ruggles deserves special mention for his performance as the fussy banker \"Pinky\" Whinney. He's marvelously subtle and underplayed, and draws laughs from lines that in another actor's hands might not even have been heard.The script is wonderfully witty all through, and most of the way it's a perfectly extended comedy of frustration in which our sympathies are with the poor Whinneys who can't get a moment alone, and the extra bonus is that what frustrates them is just more first-rate comedy material from Burns and Allen. For the pre-code watchers out there, there is some rather suggestive material in some of the most amusing scenes, as Whinney tries to get across to George just WHY he and his wife want to be alone for a while.There are a few signs of a rushed production here -- the occasional jump cut, one of the most obvious drop sets you will ever see in a movie (right up there with W. C. Field's own short \"The Golf Specialist\"), and the knot in Field's tie is constantly changing in shape. These don't bother me, though, and they shouldn't bother anybody who is enjoying the film.\"Six of a Kind\" is a real little-known gem and one of the funniest movies I've seen in a while. If you're thinking about whether to watch it, the answer should be yes.","This film stars Charlie Ruggles and it's pretty easy to enjoy his nice laid-back persona. And, later in the film, W.C. Fields becomes an important character...so there is a lot to like. However, I didn't welcome the addition of Burns & Allen, as their characters, inexplicably, seemed a lot more selfish and nasty than normal for them. This, combined with only a tepid appreciation of the team, made this a harder than expected film to watch--though it did have some nice moments.The movie finds Ruggles and his wife (the perennially perturbed and scatter-brained Mary Boland) planning on a second honeymoon. This is in the form of a marathon drive cross-country to Hollywood where they'll enjoy a single day! Now the idea of this being a second honeymoon is a bit far-fetched to begin with, though Boland makes this trip a lot more unbearable by seeking out another couple to come along and share expenses. Here, not surprisingly, is where Burns & Allen come into the picture. Now having the ditsy Gracie come along could have been cute--especially when paired with Boland. However, she and George came off as boorish and selfish instead of funny. First, when it's time to leave, they arrive with a 150 pound dog who takes up half the car. Couldn't George have warned them? This seemed less funny than pushy. Then, throughout the trip, the pair pushed Ruggles and Boland to dramatically alter their plans--including sleeping arrangements (when they forget to mention that they are not married and George will need to room with Charlie, and Grace with Mary).In addition to the fun of watching Burns & Allen ruin the trip, there is another unexpected wrinkle. It seems that a co-worker of Ruggles is an embezzler and decides to use Charlie and his wife as part of his scheme--hiding the money in their car and diverting suspicion to them. The plan is to follow them and steal the bag with the money--leaving the police to arrest Ruggles for embezzling his employer's money. But, when George and Gracie insist on going a different route, the embezzler cannot find them and is afraid he'll never get the cash.Now into this mess comes Fields in a nice small role. He plays his usual self--and that is always wonderful. What will happen next? Will Charlie go to the hoosegow? Will they ultimately murder Burns & Allen (I sure hoped they would)? Tune in to see...but don't expect magic. I'd have much preferred a Ruggles or Fields film...not this odd combination.","But George and Gracie's are not among them. The movie is fun and the pool table scene with WC Fields has to be among the funniest I have ever seen but Gracie and George are more irritating than comical in their roles, partly from script deficiency and partly from their interpretation.  I gave it a 7 out of 10 for the rest of the cast, WC is a treasure of comedic timing and energy in this one."],"review-user":["theowinthrop","Ron Oliver","Holdjerhorses","El Marco","bkoganbing","tedg","zetes","Michael_Elliott","lugonian","derek-53","JohnHowardReid","mark.waltz","gridoon2018","netwallah","hte-trasme","MartinHafer","wisewebwoman"],"review-date":["19 March 2006","8 August 2001","6 November 2005","18 July 2000","26 June 2005","10 October 2006","17 June 2001","27 February 2012","29 September 2008","12 November 1999","27 July 2016","25 August 2012","29 January 2011","16 December 2006","12 September 2009","16 April 2010","8 October 2000"],"review-rating":["9","10","6","9","8","8","10","6","7","7","9","5","7"],"review-title":[" Six Comedians in Clover, but the funniest line belongs to Bradley Page\n"," Six Times The Fun\n"," Enjoyable anachronism . . . with one classic sequence\n"," Excellent Old-time comedy!\n"," Six cylinder comedy running on laughing gas\n"," Pool\n"," Wonderful 1930s comedy\n"," Nice Comedy\n"," Second Honeymoon\n"," W.C. Fields at his finest (for about five minutes)\n"," Always Say Bradley When You Say \"Page\"\n"," This is no trip to Bountiful.\n"," Funny comedy from the director of \"Duck Soup\"\n"," An amusing collection of comic bits strung together\n"," Six of a Kind beats all!\n"," Perhaps Burns & Allen are the weakest element in this film...\n"," Some great performances...\n"]}