{"review-url":["http://www.imdb.com/title/tt0084085/reviews"],"review-text":["Though for most of us, sexiness is a variable quality, I cannot recall a movie that did for me what this one does.  It transported me into an awfully familiar realm of longing and desire.  All the compulsive attraction, uncertainty over the outcome, the palpable fear and excitement so attendant to that state of arousal were brought to fever pitch by this flick.  So French and what I consider daring!  No matter what your orientation, I think that the danger of chasing your desire is brought full-front and center here...much more so, say, than with Kubrick's \"Eyes Wide Shut\".","Before \"Betty Blue\", the male star of that film - JH Anglade  - made this even darker romance about the love of a naive, desperately lonely young man for an older male hustler. Its a beautiful film with relaxed nudity and highly erotic sex scenes between the excellent male leads.But its also a very dark and sinister movie. Its a film of extreme passions with a raw, violent finale which is poignant as well as disturbing. Its a film which contemplates the collision of impassioned, yearning-for-love youth with the jaded, cynical ruthlessness of youth lost in the figure of the older hustler. Its not a pleasant film but its nonetheless one of the most highly charged erotic gay films ever made with an intelligent script and a powerful narrative force as the two men seek to find their own way to survive. Anglade's heartfelt performance as the intense, brooding and determined young man is soulful.","When this showed at the Seattle Int'l Film Fest I was the only person standing and clapping and cheering. The rest of the crowd booed or was silent. It is a well played small film that reaches deep into the reality of a young gay man's humanity. It is about a real man; and does not play to the insipid hyper-buffed muscular \"gay paositive\" that passes for the genre of non-porn Gay cinema (and that is why so much of contemporary Gay genre movies are so dull). This movie is Intense Passsion and Great Tragedy. The acting and directing and cinematography is fantastic; it all keeps the film clastrophobic and tense and passionate. Don't miss this if you can find it.","You've got to think along the lines of Last Tango in Paris for this one because the mood and emotion runs along the same lines and maintains the same heights - the difference being that in this exceptional, intense and torrid depiction of love among the ruins of a Dostoyevskyian dispossessed the setting is a gay-subcultural milieu - perhaps even one that is set to vanish in time, and not the equally arresting but heterosexual context of Bertolucci's own film.The last third of this film depicts a passionate love never seen in gay cinema. To talk of pornography or gay self-effacement misses the point and intelligence of this work. This film, though on first impression appears to take us into the familiar & often depicted underworld of gay street-life, then precedes to subvert the rules of this genre by exaggerating it to a super-real degree. The result is a hyper-charged emotional heightening - an exceptional strategy that elevates the drama to one of big universal themes and giant gestures.This film snatches the high ground because of the brilliant performances by it's actors, notably a young Jean Hugues Anglade and the directing. A tour- De -force of cinema. Outstanding in ambition and it's unceasing plummet into the depths of human emotion. As a contribution to gay cinema, this film conquers this difficult ground and makes it it's own triumph.","L'Homme Blesse is not for an impatient, adventure-seeking audience. There are no explosions nor is the drama straightforward. Like the films of Lynne Ramsey, the director is working more deeply with mood than with storytelling in a manner that is effective and incredibly moving. Because it does not rely on gratuitous nudity, or superficial pop-cult. story lines, this is quite frankly one of the best gay foreign film I have seen (also, see Francois Ozon, Pedro Almodovar). Nicolas Roeg's \"Don't Look Now\" gets a lot of bad press because it is sold as a horror film. That film, like L'Homme, is more than what the box might lead you to believe. If you are in the mood to sit back and be absorbed by the subtle, transformed powers of cinema, you'll love this movie.","A fine performance by Vittorio Mezzogiorno and a masterful one by Jean-Hugues Anglade adorn this stange tale of lust, desire and alienation in France.  The work of the two lead performers is striking--subtle, intense and passionate. Alas, the script is deliberately turgid and sordid, and the overall effect leaves one with a downcast spirit. Still, those who can appreciate fine quality acting will be able to savor the courageous work of the leads in this often difficult film journey of Gallic low life.","I'm afraid my attention was drawn to less important behaviors of the main character ... or maybe those behaviors were in some way allegorical or metaphorical in ways that were fraught with meaning and meant to divert my attention.I remember hundreds of years ago when I was in high school we would analyze selected books that fell under the august label \"literature,\" such as A Tale of Two Cities or The Scarlet Letter and, according to accepted wisdom & our teacher, every little thing was significant and laden with meaning. Candle wax dripping on a table, a fraying rope, a facial blemish ... everything merited hours of analysis. I wondered then, and still do, if maybe at least some of the time candle wax, old rope and acne were just that and nothing more. Unfortunately the French seem to revel in bludgeoning everyone with the insistent significance of the apparently insignificant. Crafting subtlety with a sledge hammer seldom produces an attractive result and is quite often counterproductive, although it does tend to attract the praise of gushing self-styled intellectuals.At any rate, in the midst of all the passion, I became increasingly alarmed by the lead character's apparent disdain for bathing. At one point he even goes into the bathroom, splashes a bit of water about so that his mother with hear it, and then pulls the bath plug without ever even disrobing or wiping a face cloth over bits & pieces of his person. That, coupled with the way he frequently balled up clothing, tossed it about and even dragged it across dirty floors, began to become something of an obsessed focus for me, made all the worse when he swapped his clothes for something worn by the older man and spent much of the rest of the movie in an exceeding dirty tee shirt & jacket. I suppose all of this was carefully crafted for effect, but at times the trivial & subtle become heavy-handed & pointlessly obvious.He also spent a great deal of time rushing, running from one place to another only to stop and look about ... left, right, left, right. It reminded me of the exaggerated affectations employed by actors in the days of silent films or a less than graceful imitation of a ballet dancer. I enjoyed the film, although \"enjoyed\" is undoubtedly the wrong word, just as \"appreciated\" or \"understood\" would be wrong. It's hardly your typical \"coming out\" or rites of passage tale. The more I think about it and attempt to write about it, the more I feel more comfortable in saying it was a moving portrayal of the turmoil a young man experiences as he simultaneously wants to escape from his drab, \"normal,\" and socially acceptable family life while feeling disturbed and offended by the alternative world to which his emotions are driving him.Certainly not a particularly uplifting film for someone facing such unresolved turmoil in his own life, but probably an unwarranted confirmation of the costs of this \"life choice\" for anyone who believes being queer is an optional, perverted life style. (Yes... I use the expression \"life choice\" facetiously. Who would intentionally choose this nightmare for himself?)","Jean-Hugh Anglade is excellent as the teenaged boy who wants to be a whore to please the man he loves, but the rest of this film is so bad--acting, writing, cinematography, and everything else--that Anglade's performance is wasted. Sad to see so fine an actor in such a garbage flick."],"review-user":["cineaste-4","Mattydee74","Deran_Ludd","didier-20","conmalcastiga","harry-76","Suradit","endora60"],"review-date":["17 November 1999","27 May 2001","5 May 2003","29 March 2008","19 January 2005","9 February 2000","18 August 2014","8 November 2002"],"review-rating":["8","10","10","10","7","7","4"],"review-title":[" The Sexiest Movie I've Ever Seen\n"," An erotic film to make you weep\n"," One of the great unknwowns of Gay cinema\n"," best depiction of gay outrageous passion made\n"," Effectively brooding and heart-breaking film\n"," Not for all tastes\n"," \"Coming out\" in black & white, but mostly black\n"," One excellent performance can't save a lousy film.\n"]}