{"review-url":["http://www.imdb.com/title/tt0074855/reviews"],"review-text":["*SPOILER ALERT* *SPOILER ALERT*I bought this one for five bucks at my local video store. The cover has a white woman embracing a black man while he's chained up. Did someone order a sleaze sandwich? Yes sir! \"Mandinga\" is an Italian rip-off of \"Mandingo\" that is hot and ready to eat.As the movie begins, we see life on the plantation: Slaves getting whipped, slaves talking back and then promptly getting whipped. Lots of whipping. A white woman is lectured about how she should never lower herself and have sexual relations with a slave. Then she immediately has sex with a slave. The slave is chained up so she jumps on him. Well, at least the video box cover didn't lie. Soon the white man running the plantation has sex with a chained up slave woman. This is all in the first fifteen minutes.\nSo besides interracial slave sex, what else does this movie have on it's mind? Not much. The plantation owner's son comes back from England. He is going to run the plantation and have sex. He falls for the local preacher's daughter and some family drama happens. More chained up slaves have sex with their masters. All in all, I counted about eight sex scenes. There is a nice, sordid vibe running through \"Mandinga\". I would bet there is another, harder version of this flick running around. But even this version was pretty strong for softcore. I can only recommend this one to the most fervent admirers of B-sleaze. Everyone else should avoid.","Incredibly hilarious mid-70's Italian Rootsploitation with lots of non-consensual S&M, lesbian sex, gratuitous racial cruelty etc...Few redeeming cinematic qualities, except for the fairly cool theme music with dubby \"African\" drums and flute. Brilliant sample dialog: White Slave Owner (to White Plantation Manager): \"You're so dumb, I'll bet you forgot to interrogate that n****r midwife!\"White Plantation Manager: \"Not only did I interrogate her, I did it so well she died before I could get any answers from her!\"All the black actors have 70's afros, and say \"yes, massa\" in a high-pitched voice. The female lead has sex with everybody on the plantation. 10 Stars for fans of tasteless sleaze.","As you might surmise from the title this is an Italian rip-off of the film \"Mandingo\", an American movie that was quite successful, but offended a number of people because it tried to combine a serious look at slavery in the antebellum South with lurid interracial sexploitation and \"grindhouse\"-style violence. Naturally, the Italians couldn't wait to jump on this--they were already making plenty of interracial sex films at the time, and they have never been a country inhibited by good taste (witness the cycle of Italian sexploitation films set in Nazi death camps). This film is less offensive than its model, however, because it's very ineptly made. Not only do you have the atrocious dubbing and dodgy Southern accents, but the \"white\" characters are all played by dark-skinned southern Italians and the \"blacks\" are played by northern Africans rather than African-Americans. (I also don't think there's too many palm trees and olive trees in the American South).A young man returns from Europe to his wealthy father's Southern plantation. He begins an affair with his widower father's gold-digging girlfriend (who the latter refuses to marry). But then he falls in love with a virginal preacher's daughter and marries her, much to gold-digger's chagrin. She gets her chance for revenge though when the couple's first baby is born and turns out to be black! But all is not as it seems. Strangely, there's actually no interracial sex in this movie. The lusty, evil golddigger does seem to get off on watching the males slaves be whipped, and after she and the son catch two \"slaves\" having sex, they vow to show then \"how their masters make love\" and their is a brief \"interracial\" orgy. I'm using quotes, however, because the \"slave\" couple are obviously both north African Arabs and actually have lighter skin than the swarthy Italian actress playing the white mistress.Given that all the sex here is between white people (and pretty unattractive white people at that), this would never have made it as an American \"blaxploitation\" flick. I doubt it made more than a brief appearance on the urban \"grindhouse\" circuit back in the day but it is currently in \"The Grindhouse Experience Volume 1\" DVD collection, along with quite a few better movies. I'd recommend the whole collection, but not really this movie as a stand-alone title.","This was a mish mash of a film that started out going nowhere, got lost on the way then suddenly found a plot in the last 5 minutes when the title character is FINALLY introduced. There were so many ugly, mutton-chopped guys in this film, I lost track of who was the owner and who were the overseers. I have a theory about the casting though; all the bad guys were played by ugly actors (and one ugly actress) and all the good guys/victims were played by beautiful actors. Indeed the actors who played the ultimate victims, the slaves, were gorgeous as was the innocent priest's daughter, while the plantation owner, his minipulative mistress and his overseers were pretty hard on the eyes. On purpose? You make the call.I hung in there till the end and some others might be able to make it as well. If you just want to look at bare breasts, there are plenty of them here and if you have a slave/master fetish then you'll love this film. Otherwise, watch it once, vomit, shower and never speak of it to anyone.","Trading on the success of the 1975 hit, this film is a cheaply made story of a plantation where Massa gets down with the slave women, and the Missus gets down with the big black stud, and with massa'a son also. In fact, there is so much getting down going on, that I really don't know why anyone bothered to get dressed.So, if you want to see white women rolling their naked bodies all over tied up slaves, or you just like a movie with tits on display every five minutes, then this one is for you.There is a funny/sad story in here, but it only comes at the very end so as to not interfere with all the hot sweaty sex going on on the plantation.","The Italians are undeniable masters in the questionable \"art\" of ripping off and imitating movies. What they do is take an innovative, money-making and foreign concept, maintain the basic plot and just add a whole lot of action, sleaze and political incorrectness. But what to do when the non-Italian original is already a reputedly notorious film and quite difficult to surpass in terms of slop and controversy? Well then, I guess, you simply disregard everything in terms of story-building or stylishness and fully focus on making something that is practically a porno movie! This Italian turkey was inspired by Richard Fleischer's successful slavery-saga \"Mandingo\", released one year earlier, but since the makers were even too lazy to think up a different title, you shouldn't expect anything that even remotely resembles a narrative depth, character drawings, unsettling atmosphere or thought-provoking statements regarding cross cultural relationships. \"MandingA\" is pure and simply a sexploitation effort where the plot only develops itself throughout the last ten minutes, in other words when you stopped caring a long time ago already. The characters in this film are a gathering of despicable bastards, which is of course to expect when you're dealing with wealthy and obnoxious white folks running a plantation in South America. The elderly and supremely sleazy owner of the place is a widower (who probably also won a couple of \"Moustache-of-the-Year\" awards) who exploits and extendedly whips the slaves working for him. His mistress, who if I understood correctly is also his cousin (?), is a genuine bitch of a woman who enjoys provoking arguments and sneaks out of the house overnight to copulate with crucified slaves. When the plantation owner's son returns from Europe, after approximately 25 minutes of purely wasted running time, the plot slightly begin to develop itself at last. The handsome young man has sex with the bitchy woman a couple of times (even in front of the slaves, supposedly to \"demonstrate\" how their masters do it) but eventually he falls in love with the cherubic preacher's daughter. His romantic preference obviously makes the bitchy woman mad with anger, and she plots a horribly cruel act of vengeance that will alter life on the plantation forever. Hey  I just realized this brief description of the plot actually makes \"Mandinga\" sound like an interesting film! Well, it's NOT and I apologize if I raised anyone's anticipations. It's an incredibly boring and hideous film to struggle through, but if the themes appeal to you, then definitely check out the aforementioned \"Mandingo\". Much rather than sick exploitation, that film is a truly insightful portrait of one of mankind darkest history pages and it was also a properly produced film, with real actors, great music and impressive filming locations. \"Mandinga\" has nothing, absolutely nothing to offer.","Italian rip off of Mandingo and The Drum is a badly dubbed Italian life on the plantation yarn. Lots of people who don't look like they belong in the American South wear badly tailored costumes and wander around locations that look nothing like the American south. The plot has something about the romance between a rich man and a certain young woman, the jealousy that ensues and the tragedy that follows. The film promises hot steamy sex and lots of twisted violence but nothing ever really comes of any of it, its all tease. Its all probably racially insensitive, I couldn't notice since its artistically bankrupt. The final twist is at best laughable. A major turkey.","Obviously made on the cheap to capitalize on the notorious \"Mandingo,\" this crassly pandering hunk of blithely rancid Italian sexploitation junk really pours on the sordid stuff with a commendable lack of taste and restraint: The evil arrogant white family who own and operate a lavish slave plantation spend a majority of the screen time engaging in hanky panky both each other and their various slaves. Director Mario Penzauti and screenwriter Tecla Romanelli cram this fetid filth with a teeming surplus of sizzling sleaze: we've got nasty rape, interracial copulation (one white lady makes wild love to a muscular black stud while he's tied to a cross), copious female nudity, brutal whippings, vile degradation, lots of lurid soft-core sex, and a severely twisted tragic surprise ending that mixes elements of incest, murder and miscegenation in a questionable attempt at making a statement about the horrid inhumanity of slavery. Special kudos are in order for foxy brunette actress Paola D'Egidio, whose lusty and uninhibited portrayal of depraved and lascivious wicked bitch Rhonda positively burns up the screen. Moreover, Marcello Giombini's funky, throbbing tribal score hits the groovy spot. Maurizo Centini's fairly polished cinematography likewise does the trick. A satisfyingly seamy chunk of slimy swill.","An Old South plantation owner lusts after his female slaves.Directed by Mario Pinzauti, who made a few things, but nothing of note.Clearly a take on the classic film \"Mandingo\" about a very sexual slave. This film, too, is taking place in the days of horse and buggy. And the word \"master\" is pronounced as \"masser\" -- why any black man would agree to appear in this film is beyond me (though I guess it has its moments).There is the theme that white men having sex with black women is okay, because they are property, but white women should not lower themselves to black men. It is an interesting race/sex dynamic, if you think about it. And, of course, it gets rejected. (Again, despite the film's name, there is just as much a \"mandingo\" as a \"mandinga\", if not more so.)","This time around no one who was behind the production of \"Mandingo\",and \"Drum\",were no where in sight. Do you blame them? I first saw this film once when it was showed years ago during Friday After Dark on Cinemax,and I found this film to be the most humorous if not piece of pathetic cinema I've ever seen,and for good reason why this film is nothing but cheap imitational garbage that was made for a few dollars on the penny. This was one of the worst films ever to come out of the mid-1970's,and to me the year 1976 brought out some of the worst,especially from the format of you might say,\"Bad Italian Cinema\". The film \"Mandinga\" is an Italian rip-off of the 1975 film \"Mandingo\",but with more sleaze and explicit sexual content you can handle that is absolutely hilarious to watch,especially with some of the ugliest actors ever to grace the screen. As the movie begins.we see life on the plantation:Slaves getting whipped,slaves talking back and from there getting their butts promptly whipped. In the first fifteen minutes of this film,and this is below the belt where a white woman is lectured about how she should never lower herself and have sexual relations with a slave. The slave is chained up so she jumps on him. Soon the white man,or master of the plantation is having sex with a chained up slave woman,and it gets even worse,because throughout the course of this film,which runs no more than 89 minutes,there are about as many sex scenes that they could get into this movie,and I counted more than eight,and some include bits of homosexuality where the white woman and the chained up slave woman are in a lesbian romance. The rest of it is nothing but sleaze,showing more breasts and lots and lots of interracial sex,with a low budget and some very bad acting. This isn't a installment. Its a disgrace.","1st watched  3/17/2002 - 2 out of 10(Dir-Mario Pinzauti): Silly, sex-filled master & slave having too many intimate relations movie. This movie seemed to care more about the sex than the story and kind of worked the story around the sex.  Laughable dubbing of the original Italian language in the version I watched with ridiculous ending where the attempt is made to give an anti-slave statement(or should I say one line).  What a waste of time for everyone who watches this trash.","First viewed this film on 11/03/2002, and found the film humourous and pathetic, it didn't really deal with the real history of slavery it was mostly preoccupied with showing woman's breasts, a lot of frontal nudity, and sex, sex, sex, this was like a low budget, bad acting, very bad acting, badly dubbed cheap pornographic flick.  Where did this guy go to film school??.   A very bad imitation of the film 'Mandingo' starring American actor Perry King, and James Mason."],"review-user":["Dr. Gore","seanmoliver64","lazarillo","doc_hartman","lastliberal","Coventry","dbborroughs","Woodyanders","gavin6942","raysond","dwpollar","cooldiva_2"],"review-date":["2 May 2003","26 June 2008","17 February 2008","12 March 2008","7 August 2007","22 March 2008","30 March 2008","23 September 2008","12 December 2010","4 February 2005","17 March 2002","5 November 2002"],"review-rating":["10","4","4","1","1","8","5","2"],"review-title":[" Interracial sex shenanigans down on the plantation\n"," Wow! Disgustingly enjoyable!\n"," Inept Italian imitation of. . .well, what do you think?\n"," Exploitation SU-PREME!\n"," No, it's not Mandingo\n"," A simple \"O\" or \"A\" at the end makes quite the difference...\n"," One of the worst\n"," A perfectly putrid piece of pure trash\n"," Plenty of Interracial Lust... Beyond That, Meh\n"," The other installment\n"," Silly, sex-filled master & slave having too many intimate relations movie...\n"," On a scale of 1-10, I give this film a 2\n"]}