{"review-url":["http://www.imdb.com/title/tt0069019/reviews"],"review-text":["Lucio Fulci, later known for his graphic horror films like The Beyond and Zombie, was years earlier a master of the Italian giallo (in the company of Argento and Bava) with films like A Lizard In A Woman's Skin and his masterpiece, Don't Torture A Duckling. This film has all the elements of the Italian mystery/thriller genre known as the giallo, but really pulls the viewers in by having each key character with a skeleton in his/her own closet. This keeps you doing as much detective work as the detectives in the film itself. Who is killing the young boys in town? The young rich woman who is so bored that she sexually taunts the eventual victims, the reporter who likes to tamper with a crime scene to get a better photo shot, the townswoman with a mentally retarded daughter, the local witch, the town idiot....the list goes on, and you have to keep mental notes like a true game to play and solve. The themes in this film are very daring and done with that perfect Italian style in the early 1970s. It is certain that no American studio would have even considered making a film of such strong content, and that is precisely why this is such a satisfying film (despite some unusual accent choices for the dubbing) and will definitely have people discussing its meanings long after viewing it. As the saying goes, they don't make them like this anymore, so get a copy and cherish an important film like this one!","Set in and near a poor working class town in the mountains of rural Italy, it's a story of madness. The landscape may be quite picturesque, but there's madness herein, concealed behind the mask of a person who seems outwardly normal. This person kills little children.In style and tone this film resembles Dario Argento's famous Italian giallos, those fascinating whodunit horror films, except that Argento's films are much better looking. Still, the visuals in Fulci's \"Don't Torture A Duckling\" are competent, with some interesting compositions and lighting. Lightning and thunder on a rainy night enhances suspense in one sequence wherein one of the \"ducklings\" is vulnerably alone.In one sequence the gore is a bit overdone. But this is no slasher film. A legitimate theme undergirds the story. And that theme is that madness can take many unexpected forms, not just the obvious delusions of people who practice voodoo or black magic.Plenty of red herrings render the puzzle solution difficult if the viewer doesn't assume an agenda on the part of the director. Don't dismiss someone who might not seem to be a suspect. The twist near the end provides good misdirection. However, in one scene midway through, a line of dialogue could have been added to clarify the relationship between two characters, one of whom is the murderer. The film's finale takes place on a beautiful mountaintop with the wind whistling in the background. We see flashbacks to clues and get insights into the killer's mindset.I don't care for the film's widescreen projection. But background music is effective, and ranges from jarringly creepy at the beginning to low-key jazz, to indigenous Italian songs. Acting is generally average, though in a couple of cases, it's a bit overdone.Though not as visually brilliant as Argento's giallos, \"Don't Torture A Duckling\" nevertheless is a fine film, one that contains a thematic storyline and enough of a whodunit puzzle to interest most viewers who like thrillers and murder mysteries.","DON'T TORTURE A DUCKLING is one of Fulci's earlier (and honestly, in terms of story-line, better...) films - and although not the typical \"bloodbath\" that Fulci is known for - this is still a very unique and enjoyable film.The story surrounds a small town where a series of child murders are occurring. Some of the colorful characters involved in the investigations - either as suspects, or those \"helping\" the investigation (or in some cases both) - include the towns police force, a small-time reporter, a beautiful and rich ex-drug addict, a young priest and his mother, An old man who practices witchcraft and his female protégé, a mentally handicapped townsman, and a deaf/mute little girl. All of these people are interwoven into the plot to create several twists and turns, until the actual killer is revealed...DON'T TORTURE A DUCKLING is neither a \"classical\" giallo or a typical Fulci gore film. Although it does contain elements of both - it is more of an old-fashioned murder mystery, with darker subject matter and a few scenes of graphic violence (although nothing nearly as strong as some of Fulci's later works). This is a well written film with lots of twists that kept me guessing up until the end. Recommended for giallo/murder-mystery fans, or anyone looking to check out some of Fulci's non-splatter films - but don't despair, DON'T TORTURE still has more than it's fair share of violence and sleaze. Some may be put off by the subject of the child killings, and one main female character has a strange habit of hitting on very young boys, which is also kind of disconcerting - but if that type of material doesn't bother you, then definitely give this one a look. 8.5/10","Sporting a title seemingly more suitable for a Looney Tunes featurette than a grisly giallo, \"Don't Torture a Duckling\" (1972) is nonetheless a Grade A thriller from horror maestro Lucio Fulci. In this one, someone has been strangling the preteen boys in a rural, southern Italian village and, typical for these gialli, there are many suspects. There's Barbara Bouchet (Patrizia), looking more scrumptiolicious than you've ever seen her, a rich girl hiding out after a drug scandal; Florinda Bolkan (Martiara), the local epileptic voodoo woman; her witchcraft-practicing beau; Giuseppe, the local idiot; the sweet-faced priest; his dour mother; and on and on. The film features some unusually violent set pieces, including a chain whipping of one of the main characters in a graveyard (one of the most realistically bloody sequences that I've ever seen) and a nifty dukeout when the killer is ultimately revealed. The film's bursts of violence compensate for the fact that there are no real scares or suspense to speak of. Still, this giallo fascinates, with its unusual rural backdrop, unsettling child murders, oddball characters, and freaky score by Riz Ortolani. The film has been beautifully photographed in what I presume to be Monte Sant'Angelo, near the Adriatic in southern Italy (at least, that town's police force is thanked in the closing credits). And while subtitling would've made this fine-looking DVD work even better (the American slang doesn't convince in this rural Italian setting), Anchor Bay is to be thanked for another job well done. Oh...that title DOES eventually make perfect sense, too!","This is Lucio Fulci at his best. If only all the films he made after were like this.This extraordinary film is as intriguing as Dario Argento´s \"The bird with crystal plumage\"...   If you´re an Argento fan but you don´t like Lucio Fulci films, like\"The Beyond\", \"Manhattan Baby\", \"The House by the Cemetery\", etc. this one has nothing to do with the others... this is what the Italians call \"giallo\"... that would be something like a \"who-done-it\" movie in a nutshell.You won´t know who the killer is until the last moments of the film.But apart from that, there´s the plot: some maniac living in a small village starts killing little boys... A journalist (Tomas Milian), a sexy young woman (Barbara Bouchet), a priest (Marc Porel), his mother (Irene Papas) and a witch (Florinda Bolkan) are the main characters in this tangled, bloody story.Talking about the actors, I want to say that Tomas Milian is superb (like always), and Florinda Bolkan is terrific as the village witch...Do you want to know who is the killer?...        I cannot tell you... but I can tell you that you must see this film!.\n(10 out of 10)... of course!","DON'T TORTURE A DUCKLING (Lucio Fulci - Italy 1972).Definitely a prime candidate for the most insane movie title ever conceived and that's quite an achievement in giallo-land. Originally, the film was titled even more absurdly, \"Don't Torture Donald Duck\", literally translated from its Italian title. A small Donald Duck figure features briefly as a toy, but hardly enough to render a title like this, but, apparently, it was changed in fear of legal ramifications by Disney. I railed quite a bit against Fulci's earlier LIZARD IN A WOMAN'S SKIN (1971), but here all the right ingredients are present. A surprisingly effective mystery, a good cast and imaginatively shot against an unusual rural setting. Everything just clicks. I think it's justly hailed as one of the director's most accomplished achievements.The story is set against the backdrop of a small mountain-side town in Sicily, where someone is killing young teenage boys. Among the suspects, the most obvious one is a young woman, Maciara (Florinda Balkan), a self-proclaimed witch who is seen suspiciously unearthing the skeleton of a baby and sticking pins into way effigies. Guiseppe, the village idiot is under suspicion as well, since he made a feeble attempt to profit from the disappearance of one of the boys and walked right into their trap. By the time a quick-witted newshound (Tomas Milian) arrives from Milan to cover the murders, he immediately begins to question the authorities' assumptions, when he meets two other potential suspects: Don Alberto, the local priest (Marc Porel) with a high-minded attitude, and Patrizia (Barbara Bouchet), a bored young woman from the city with a troubled past of drug offense, who also fancies having sexual relations with the young boys in town. Talk about your prime red herring.Fulci nicely contrasts modernity and tradition with the newly constructed elevated highway meandering through the Sicilian hills, past old towns where life is still firmly rooted in tradition and superstition. One could debate about the film's political stance as The North versus The South, or as commentary on small-town virtues - society's conventions in general - that are all too often dangerously close to tipping over into moral disintegration, chaos and - ultimately - self-justice by the populace. The film has often been lambasted because of its anti-catholic tone, but it's hardly an important element here, except for obvious plot-related reasons, which would be giving away too much. It's actually rather tame compared to a film like Joël Seria's DON'T DELIVER US FROM EVIL (1971). Probably, the film's rather unflattering portrayal of small-town Sicilian values (when another boy is killed, the local populace are depicted as a retarded lynch-mob) might be cause for some offense in Sicily, but - considering Sicily's problematic relation with the rest of Italy - hardly problematic for other Italians, I would think. The film vanquished into obscurity far too quickly to have much impact anyway.When talking Fulci, the amount of gore is usually a prime subject for discussion. Although eyes-gouging scenes are lacking, the film does contain two very graphic scenes. In the gross-out finale, the killer falls of a cliff, smashing his face along the rocks on the way down with gruesome results (albeit, not very realistic). And the chain-whipping sequence with Florinda Balkan in the graveyard shows Fulci's penchant for sadistic violence and typically, he's not holding back at graphically showing what most film-makers would merely hint at. Surely, one of the most horrifying scenes in Fulci's repertoire. Above all, this is a taut, well-written, effective little mystery, nicely lensed by Fulci, with an impressive cast of genre-regulars like Barbara Bouchet, Marc Porel (not very convincing as a priest), Tomas Milian and Florinda Balkan (mouth-foamingly crazy as the town's witch).Camera Obscura --- 8/10","I really enjoyed this film although I have only had a chance to watch it once. It's a great Giallo IMO and just as enjoyable as Fulci's later films. The direction was perhaps a bit rough around the edges but on the whole I thought the film worked really well and the ending was great (a real cliff hanger!). I thought one scene was particularly disturbing when the locals beat the hell out of a poor women while the radio played in the background. The inappropriate music made the images even harder to swallow but also gave the scene an emotional punch uncommon in a Fulci movie. I also felt that the story worked coherently and that the twist at the end was great. Fulci obviously has a rather low opinion of rural Italy's inhabitants because in this film all the villagers are presented as simpletons prone to mass-hysteria who live by their own backward laws (illustrated by the remorseless killing of the women) and religious beliefs.","In a small, picturesque Sicilian village, someone is brutally killing young, sexually curious boys. The local police force keep busy trying to track the killer and whittle the list down to five or so main suspects, including voyeuristic village retard Giuseppe (Vito Passeri) and an elusive, grungy, voodoo doll-poking backwoods witch named Maciara (Florinda Bolkan). There's also Don Alberto (Marc Popel), a handsome young priest who runs the local boy's school, Andrea (Tomas Milian), a journalist helping to aid the police, and the beautiful Patrizia (Barbara Bouchet), a gorgeous, but seriously screwed-up drug addict who seems to have a thing for very (I mean, VERY) young boys. As typical with the giallo subgenre, the plot won't be fully revealed until the last few frames, but if you can hang in there long enough, this film pays off. The script (written by Fulci, Gianfranco Clerici and Roberto Gianviti) keeps red herrings to a minimum and will keep you interested and the story is ably supported by excellent location work, cinematography (by Sergio D'Offizi) and musical score (by Riz Ortolani). The acting, particularly Bolkan, is also very good. Fulci fans who were weaned on his 80s grotesqueries like THE BEYOND and ZOMBIE will find more artistry and less gore on display here than they might anticipate, but they'll still enjoy a particularly nasty chain whipping scene in a cemetery (bizarrely, yet effectively, set to singer Ornella Vanoni's ballad \"Quei giorni insieme a te\") and a long tumble down a rocky embankment that Fulci liked so much that he reused it in his film THE PSYCHIC (1977). Scenes of the children being killed is mainly kept off screen (except for a brief strangulation), but the camera doesn't hesitate to linger on their corpses. The film was not released theatrically in America and, presumably because of some anti-Catholic elements in the storyline, received only a limited theatrical release in Europe.","I didn't know what to expect when I rented this widescreen DVD. I knew it had a cult following but I had also seen a lot of the director's later works which although delightfully gory were also pretty much incoherent. DON'T TORTURE A DUCKLING actually had a linear storyline and a mystery that kept me guessing almost until the end.  And after all was said and done, it was a genuinely unsettling and creepy experience. One major caveat: I would much rather have heard the original soundtrack and read English subtitles than the uneven dubbing found here.","I tend to get furious when hearing about Lucio Fulci's reputation as a director. Too often he's categorized as a no-talented filmmaker, only out to shock and disgust entire audiences with images of pure gore. True, his films contain more explicit filth and sickness as your average mainstream American production, but his films always are of wide range and the plots are gruesomely morbid. Don't Torture a Duckling is yet another story! This film is a pure gem of the Italian shock cinema! I easily dare to call this film a masterpieceit's an old-fashioned giallo that includes all brilliant aspects of genuine horror. The film shows the search for a inhuman serial murderer in a small Italian mountain-town. The bodies of  3 young boys are found, horribly mutilated. There are quite a lot of pseudo-madmen in the town but every trail leads to nowhere. Among the suspects are a greedy bum and a scary woman, obsessed by witchery and voodoo. Like a true mastermind, Fulci knows to find the right creepy tone for his film. He portrays the small town as a claustrophobic and inescapable setting of macabre happenings, supported by a giddy soundtrack. Fulci also develops himself as a genius storyteller here. The script always is one step ahead of you and the complex plot will mislead you more than once. In other words, this is a unique giallo (horror slash murder mystery). The gore isn't presented as grotesque and explicit as in Lucio's later milestones (among them are the legendary Zombie 2, The Beyond and the New York Ripper), although there still are a few nauseating and hard-to-watch shock-sequences shown. Don't torture a Duckling is the most compelling and effective achievement Lucio Fulci ever brought forward and it easily ranks among the greatest Italian horror movies ever made. Right next to the masterpieces made by Mario Bava and Dario Argento. The film is fascinating from start to finish, some plot aspects are alarmingly realistic and the tension is adrenalin-rushing at all times! A must see for horror fans and an absolute priority for Italian shock-lovers!","Lucio Fulci's \"Don't Torture a Duckling\" paints an exceptionally unflattering portrait of small-town Sicily plagued by series of brutal murders of young boys.This surprisingly well-directed film(especially in comparison to later Fulci's gorefests)is distinguished by overall atmosphere of perversity,nastiness and two truly grotesque scenes of brutal violence.The soon-to-be-dead children are depicted as casually cruel and budding peeping toms;Bruno's near-seduction by the naked Patrizia(Barbara Bouchet)really has to be seen to be believed.Highly recommended-especially in pair with my another cult favourite \"House with the Windows That Laugh\"(1976).","In the backward village of Accendura, the boy Bruno Lo Casio goes missing and the police inspector and the local commissioner and the village Captain Modesti (Ugo D'Alessio) investigate the case. When his father receives the request of a ransom, the police arrest the local Giuseppe and realize that he is innocent. Then the boys Michele and Tonino are also murdered and the police suspect of the local witch Maciara (Florinda Bolkan), who practices black magic, might be the killer but they find she is also innocent. However the superstitious and ignorant locals brutally kill her. Meanwhile that village is crowded of journalist, including the experienced Andrea Martelli (Tomas Milian) from Rome. He befriends Patrizia (Barbara Bouchet), a daughter of a wealthy entrepreneur that is living in the village after a drug scandal. They meet the village priest Don Alberto Avallone (Marc Poreli), who has a group of boys that plays soccer at the church and is the son of the weird Dona Aurelia Avallone (Irene Papas) that raises her slow six year-old daughter. They believe the child has witnessed the murders and might know who the killer is. \"Non si sevizia un paperino\" is a violent giallo bu Lucio Fulci, with a story with perversions that are sort of taboo in Hollywood. The three boys and Giuseppe are voyeurs; Patrizia is drug addicted and pedophile; Don Alberto is a serial-killer that wants to keep the innocence of the boys. The graphic violence of the four men against Maciara is impressive. My vote is seven.Title (Brazil): \"O Estranho Segredo do Bosque dos Sonhos\" (\"The Strange Secret of the Woodland of the Dreams\")","Young boys are victim of a series of gruesome murders in a beaten down Italian town. Investigators as well as journalists seek out the killer, whilst the locals are intent on giving their own sense of justice to anyone they feel may be culpable. Could it be the village idiot, who is constantly pestered by the kids? Or maybe the local witch with a skeleton in her closet? Or the luscious and rich woman with a thing for young boys? Or maybe...This is held by some as Lucio Fulci's masterpiece and one of the best giallo films out there (at least on par with the best of Dario Argento). But unfortunately I never really was a fun of giallo, so even though I have give this movies thumbs up for an extremely tight script for an Italian horror movie I just didn't feel overawed. The movie leaves you guessing as to who the killer is, but unfortunately my gut feeling from about 1/3 into the movie turned out to be true. In the end instead of being on the edge of my seat I basically waited out to the movies conclusion - satisfied on many levels, but ultimately under-awed and slightly bored.I really liked the story as well as various quirky moments (especially the lynching of Maciara coupled with some odd but surprisingly effective musical choices). The gore is limited, especially for a Fulci movie, but all in all this one is more about the mystery, than the blood and guts...Very nice camera-work and as someone once said - they don't make movies like this nowadays. Definitely worth the watch, but don't go in expecting a masterpiece.","First off, I'll give this movie 7 out of 10 stars.  So I did think that it was pretty good.  But what's with the title?  I see here that it's listed under its Italian title.  Is the English title an exact translation?  If it is, could someone explain the meaning relative to this movie?\nAll that out of the way, I'll admit that I was surprised by the quality of this film.  It's the third Fulci movie that I've seen (Zombie and The New York Ripper are the others--Quack! Quack!) and I hadn't been overly impressed with the first two.  But this one had a few scenes that I found particularly powerful (especially the beating of the woman in the graveyard).  The performances were good as was the plot (although I was put off by the woman who was so bored that she came on sexually to every young boy who crossed her path).  But, overall, a pretty suspenseful and satisfying murder mystery.","Being a seasoned fan of Italian thrillers and directors Dario Argento, Mario Bava, Sergio Martino and Aldo Lado, I thought of Lucio Fulci as an overrated hack. I had seen The Beyond which I think is totally overrated, I found The New York Ripper to be simply appalling and I didn't particularly like The House By the Cemetery. These three movies left me to conclude that Fulci is the least interesting of these Italian filmmakers. But my stubbornness prevailed and I had to check out more of his films. City of the Living Dead was a film I found very interesting but Don't Torture a Duckling is very nearly a masterpiece.Set in a small town in the Italian countryside in a repressive religious community where young boys are being murdered. The authorities are clueless as to who's behind these crimes, especially after their prime suspect has been cleared. An eager young reporter along with a rather slutty girl (who seduces young boys) investigate and eventually get to the bottom of it.Brilliant atmosphere combined with a good story and a good cast (not always the case with 70's Italian thrillers) make Don't Torture a Duckling a crackling good thriller. The plot is well constructed, not easily figured out and the end conclusion is very satisfying. Fulci creates a dynamic atmosphere of repression and guilt in a very unforgiving and ignorant community and creates some very strong visuals, particularly in a scene where a woman gets beaten to death by some local townsfolk. Fulci's social commentary concerning religion and innocence are quite edgy and every aspect is well handled. When thinking of his zombie flicks and his ultra violent giallo New York Ripper it's amazing how well he balances his critique with explicit violence and makes an even stronger point. So far I haven't seen any Fulci film made as professionally as this one.While not a traditional giallo film, Duckling has many of the genre's trademarks. Fulci displays complete control over the format, only once going overboard with an unconvincing gore-moment, but overall he seems to be even better at making mysteries than full blown gore epics. The extreme scenes here are much more powerful and really pack a punch.So far Don't Torture a Duckling is Fulci's best film by far in my opinion. Edgy social commentary combined with explicit scenes of violence and a crackling good mystery to boot.","Set in the lush of rural Italy there is something altogether different with the locale of 'Don't Torture a Duckling' in comparison to Fulci's later works. This does not go amiss and is perhaps one of the strengthening factors of this (satisfactory) film.While it is true that many of the characters are developed throughout the plot, this is not altogether convincing yet should be noted with some merit. Several reviewers have taken the opportunity to compare this film to, say, 'Zombie Flesh Eaters' - the latter usually coming under fire for it's (alleged) lack of characterisation. Let's remember though that 'Zombie', in essence, is an exploitation film and should be noted more for being a timely piece rich in visceral shock-value. Characterisation and  plot development are not strictly paramount (- although some would disagree).This is not to say that 'Duckling' is in any way a 'bad' film but it is certainly lacking something and it becomes a difficult task to put a finger on what that is. There is a degree of realism to the film itself and it's portrayal of violence and emotions. Sure, there are no exploding zombie heads or pierced eyeballs but that does not mean to say that 'Duckling' doesn't fail to shock in places. The film may look dated but in regards to it's subject matter this film is still as relevant today as it was when released, maybe more so. Particularly here in the UK, any film dealing with the death of young children, religion (it is debatable as to whether or not the Catholic Church is being swiped at here), sex and superstition is going to create strong resonances.Having heard nothing but good about this film I do feel rather uneasy by not rating it nearly as high as I thought I would. The giallo characteristics of the film are a catalyst and the musical score is very apt and helps to create a chilling ambience. The camera-work is impressive and noteworthy. It just seems that some leads and ideas never really seem to anywhere in particular...take the woman who seems to flirt with literally everyone; this may be justified by fails to rouse much interest at all. Certain parts, take the end montage of flash-backs, for example, seem emphatically 'corny' and unnecessary indeed. It may be clear that Fulci can create a film that isn't dependent on gore and can move the viewer but this isn't as ground-breaking as some have made out.To conclude 'Don't Torture a Duckling' is an overrated, underrated film but do keep an open mind. It seems like 'Duckling' is going to ever-remain as the 'tender' or 'intelligent' film that Fulci directed merely because it has little bloodshed.","Cult-director Lucio Fulci is probably most famous for his gory Zombie flicks from the 1980s that earned him his rightful reputation as the \"Godfather Of Gore\". Fulci's absolute greatest film, however, dates back to 1972 and, while it is definitely gritty and violent, it is not nearly as gory as many of his other films. \"Non Si Sevizia Un Paperino\" aka. \"Don't Torture A Duckling\" of 1972 is not only by far Fulci's greatest film, this tantalizing and utterly brilliant Giallo is one of the absolute highlights of the genre. The stunning atmosphere and tantalizing suspense, the great Sizilian setting, the intriguing story the brilliant performances or the intense moments of sheer shock - I don't know what to praise most about this ingenious Giallo! \"Don't Torture A Duckling\" truly delivers cinematic perfection in every aspect, which makes it an absolute masterpiece of Italian Horror cinema.Contrary to other Gialli, it is not seductive beauty queens who are slain one by one, but little boys who fall victims to a killer on the loose. Bodies of little boys are found in rural Sicily. While the police are desperately searching for the killer, the little town is basically full of strange people, and the townsfolk are screaming for a culprit...The film is stunningly suspenseful and uncompromising from the very beginning, with a gritty, dark, and constantly tense atmosphere that has yet to find an equal. The acting performances are among the best in Italian Horror cinema. Tomas Milian (one of my personal all-time favorite actors) is excellent in the lead, as journalist Andrea Martinelli who is investigating the crimes. Sexy Barbara Bouchet delivers both eye-candy and a brilliant performance. Equally outstanding performances come from Irene Papas and Florinda Bolkan, who is utterly brilliant in her role. The great score by Riz Ortolani brilliantly intensifies the suspense and atmosphere, and the film is ingeniously shot in fascinating Sicilian landscapes. Although not as gory as many other Fulci films, this film is definitely gritty and uncompromising in its violence, with a few shockingly brutal scenes.\"Don't Torture A Duckling\" has everything brilliant Horror requires. This is not quite as easy to get hold of as most other Fulci flicks, but I assure that searching it will pay off. Any Horror fan MUST see this personal favorite of mine, and I highly recommend any true lover of film in general not to miss this. A Masterpiece!","I've given old Lucio Fulci a lot of flack for his movies in the past, but have persevered with watching his back catalogue in the hope of finding something worthwhile; and, by Jove, I think I've at last found a film by the prolific director that is worthy of praise.I had heard that Fulci's giallos were his best work, and chose the one rated the highest on IMDb, LIzard In A Woman's Skin, to see if this was true; I didn't like it and almost gave up on ever watching Don't Torture A Duckling, his other well known addition to the genre. Fortunately, I decided to give Fulci one last go, and am glad I did: Don't Torture A Duckling is without a doubt the director's best film and is also one of the best giallos that I have seen.A spate of child murders in a rural Italian town has left the locals in shock. After incorrectly arresting both the town idiot and the local crazy woman, the police are baffled as to who the killer is. There are plenty of other suspects who could be the murderer and, in true giallo style, the identity of the psycho responsible is only revealed in the final moments. Until that point, Fulci not only fills his satisfyingly sick story with plenty of twists and turns, but also finds time for some gratuitous nudity (courtesy of the gorgeous Barbara Bouchet) and even a smattering of his signature gore, which is used sparingly but effectively.Fans of Fulci's later splatter 'classics' might find this film too 'dry' for their taste, and perhaps a little slow moving. Giallo aficionados, however, will appreciate the lovely cinematography, great score and satisfyingly logical conclusion (yes, this is one Italian murder/mystery that actually seems to make sense!).Even if, like me, you think you have seen enough Fulci films to last you a lifetime, give Don't Torture A Duckling a goit's worth it.8.5 out of 10 (rounded up to 9 for IMDb).","First of all I have to say that I'm a huge Lucio Fulci and Dario Argento fan. Although I have not seen absolutely all of their movies, I really enjoyed almost every one I did see. I really like giallos and I thought Argento was the master of this genre, after seeing films like \"Tenebre\" and \"Phenomena\". But after I saw \"New York Ripper\" by Fulci, I found out that he could do pretty good giallos besides his graphic zombie movies and even outdo Argento, on a certain level.I love Fulci's style, and yes I love gore, but this film I think, although it has a more developed plot and characters than his other films, is not his best one. What I don't like is that it can be confusing at times, especially at the end. And the fact that we go from one suspect, to another, and then another until we even suspect the retarded little girl for a moment, I think it goes too far. I know giallos are supposed to keep you guessing until the end, and the killer should be very hard to find, but this film plays a little too much with our minds. However I did like the scene when the witch is killed, I think it is very well done and gave me the chills. The acting is also pretty good and the photography is great.Although this is not a bad film, I think Lucio Fulci has made better films than this, and I think his best one is \"The Beyond\", a very different movie but a more atmospheric and visual experience.I give \"Don't torture a duckling\" a 7 out of 10.","Don't Torture a Duckling (or Don't Torture Donald Duck) rises above what some might think of the Italian horror film, or in the more specific connotation \"Giallo\", which refers to mystery/crime stories. Perhaps some of it was director Lucio Fulci's own doing, as he sort of merged Giallo and bloody Horror in the prime of his career and made it over the top (perhaps even other masters like Argento could be partially guilty). But here is a film that takes its subjects seriously, doesn't scoff at anything, and really how could it? It's a story of young boys murdered and a small village in uproar, with a local Priest, a crazy witch-lady with mojo dolls, an interested Rome-based journalist and an attractive (maybe too attractive) young woman the main figures. When it's violent it stays true to itself- it's not the kind of horror movie where you expect it to go super bloody and gory, but when it does its visceral in impact- and there's even some really good acting, which is hard to find in some of these Italian procedural. But what makes it a \"lost\" classic? (Lost as in only discovered for American audiences ten years ago) For one thing, it rises not only above its expectations of silliness and carnage, as one might see in other Fulci work (not least of which a movie more on common with ducks, New York Ripper), and even its set-up of the usual sort with the crimes being committed and the police being only somewhat apt to investigate leaving open an outsider- i.e. a journalist- and an attractive young woman to look into it themselves doesn't feel worn out or too typical. Maybe it's the setting of the village, and how the people in it respond to the crimes. They're not the more sophisticated or weird types one might find in Deep Red. These are rural folk who have a deep religious feeling to them, and feel real fear at this killer who walks among them but can't really know who is who.Fulci leaves the audience guessing up until the end, but it doesn't feel cheap or cheating. Far from it, it is a shock that makes perfect sense, and adds a whole other, deeper, philosophical dimension to the film if it was just who we are led shallowly to believe it is (hint, it's not the attractive young woman, played by Barbara Bouchet, who appears stark naked in a staggering, inappropriate but oddly seductive scene in front of one of the boys). What also makes it fascinating to watch is how Fulci shoots and edits his scenes. Sometimes it seems like a scene will cut off short, but it's really a method of editing that is like pre- post-modern cross-cutting, if that makes sense. In other words, Fulci's film feels fresh, like it could have been shot yesterday. Dutch angles, responsible zooms, and a sense of using music that is invigorating and involves the viewer in the suspense and, at one tragic moment, the sadness (hint, it's three songs from a radio). And yes, the acting is somehow better than usual. Some of it comes from that 'witch woman' played by Florinda Bolkan, and also some from Irene Pappas, or the actor playing the Priest. They take the material and the drama therein as serious as Fulci, and it pays off. What should be just a pulpy mystery story has a soul and a presence cinematically. You can feel the tension as Bouchet drives at night or is at the phone booth, or the terror (unintentional or not) when Bolkan is chased by the dogs into a circle where they all are barking, all at once at her. Consistently, the film has sharp, intelligent direction, and is far from the occasionally truly sloppy times Fulci could get later in his career. He and his crew and cast have a sensational film here, waiting to be discovered. Out of his oeuvre, this and The Beyond are the ones to beat really in terms of quality and substance. And what a title!","No wonder this was Lucio Fulci's personal favourite out of everything he directed. This is just about the darkest giallo you'll ever see, as it throws out all the kitsch, quirks and style and replaces it with social commentary, rage, and genuine emotion. (some spoilers ahead, but I don't reveal the killer)First off, the film is set out in rural Italy, swapping luxurious apartments for rocky hills and shepherds, and it's not sexy models being murdered, but a group of young pre-teen boys who are turning up strangled around the town. It's a strongly religious town where the boys are part of a youth club run by a young priest, but there's also an old magician living in the hills, with Florinda Balkan as his acolyte.Florinda sets the tone of the film as we see shots of her digging up a child's skeleton cut with that of three young boys taking the pish out of the town idiot. One of these boys encounters a totally naked Barbara Bouchet, who is new in town, and winds up the young guy by pretending to seduce him.*One of the boys goes missing and soon the town and land are full of Italian policemen with dogs. An mystery person claims to have kidnapped the boy and blackmails the family, only for it to turn out to be the town idiot who found the body and buried it. The cries of horror from the townspeople as the body is uncovered and their continual invading of scenes raises the tension throughout this film, as they turn on any suspect and bay for their blood - especially that of 'local witch' Florinda Balkan, whom we see doing voodoo on some child like dolls!Most of the cops aren't used to dealing with these mountain folk, and the only voice of reason seems to be journalist Tomas Milian, who is very restrained here. He seems to be the only one with any chance at all of figuring out the case, as he's the only one who seems to take a step back from the mounting hysteria. Unlike other gialli, Fulci really seems to have something to say here, and goes on to attack organised religion and its affects on sexuality, how it controls the masses, and the general ignorance of rural communities and the mob mind. No one in the film is entirely likable at all, and there's a whole vibe of alienation throughout the whole film, punctuated by an unidentified woman who sings, somewhere out in the hills.Of course the most famous scene of this film is where Florinda Balkan is cornered and beaten to death with chains by the murdered kid's fathers. With a car radio blasting inane tunes, Florinda is gorily ripped to shreds by chains and left to die. Except she doesn't. She crawls painfully to the highway (the only modern thing in the film) as happy families in cars blissfully drive by, and dies looking on a world she was never allowed. Fulci lingers on her corpse for a painful amount of time afterwards. The man was no hack and it's easily one of the most emotionally effective scenes in giallo.There's many other themes at play here, but I can't touch on them as they'll reveal the killer. This is a truly great giallo and just a plain great film. Viva Fulci!*Fulci got hauled over the coals for a lot of reasons because of this film, but he was brought to court for using a child in the nude scenes with Barbara Bouchet. Fulci had to reveal he actually dressed a dwarf in the kid's clothes for the scenes they appear together on screen. He also got blacklisted for having a go at the Catholic Church!","This really is a most impressive giallo from Lucio Fulci. The distinctive but odd title seems to distract somewhat from what is one of the director's finest. There is a Donald Duck toy in the film and while we have no reason to believe it was tortured it does lose its head. Even so, the more vicious 1982 outing, New York Ripper is only hampered by a Donald Duck voice in the taunting killer phone calls, so maybe that could have had this title instead. In any event here, Florida Bolkan, Barbara Bouchet and Tomas Milian turn in top notch performances and indeed even all the lesser parts are well accounted for and what with all the, presumably, local extras involved Fulci does a brilliant job in ensuring very believable performances from everyone. There is a strong sense of nastiness and hypocrisy running throughout and the film is racing non-stop from the very off with some worrying concerns for the many children involved.","Another early giallo from Lucio Fulci, and I admit that I enjoyed this a lot more than his muddled A LIZARD IN A WOMAN'S SKIN at first. Gorgeous scenery of the Italian countryside and a tight plot weaving in and out of about a hundred different subplots and strands help to keep this one intriguing throughout. The identity of the murderer is kept hidden well and the final revelation comes as both a shock and a surprise.Due to the longer-than-average running time and the complicity of the plot, this film feels like an epic. At first, it seems rather muddled and confusing, we are unsure of what we are watching, until all the pieces of the jigsaw begin to fall into place. Suspense builds as the hunt for the real murderer progresses and things finally erupt in an exciting clifftop battle between the heroes and the villain over the life of a mute child.Sometimes the film threatens to give you a headache as Fulci is never content to keep this camera still, instead weaving it in and out of his actors and actresses constantly. This makes some shots look very nice and artistically composed, others jolting and difficult to watch (especially some of the scenes where people are running through the woods - I thought I was watching THE BLAIR WITCH PROJECT at one such point!).Fulci's later penchant for nonstop carnage and over the top gore is foreshadowed here in a couple of graphic moments. In one of these, an innocent woman is chain-whipped to death by frightened villagers, which prefigures the later chain-whipping of the warlock in THE BEYOND (in fact, it's filmed in EXACTLY the same way). Fulci zooms in as blood spills from the jagged wounds on the woman's body in this moment of sadistic glory which is quite shocking to watch. The other excessive scene comes at the end of the film, when the killer falls to their death over the cliff. In a normal movie, you would see the killer fall and then cut away. Not so with Fulci. Every time there's a rocky outcrop on the cliff, the killer gets their face mashed up. Again and again. All while a crooning song plays over the action. Art or lurid exploitation? You decide.The script is a literate one, with just about every character in the film falling under suspicion at some point. The actors and actresses do their jobs well, especially the child actors who are surprisingly good in their parts. Barbara Bouchet is around to lend some much-needed glamour; the first shot we see of her has the actress sitting naked on a chair. Yes, this is indeed an adult film tackling many controversial issues; neither politics nor religion are safe from Fulci. In all, this is a well-shot and tense murder mystery, which makes use of some beautiful locations and a good cast.","Despite not boasting an A-list American actor, there's no shortage of especially female talent on display in Lucio Fulci's penultimate giallo concerning a spate of child killings which maybe linked to a bizarre ritual of a mountain recluse and a deeply disturbed woman accused of being a witch.Fulci's narrative is unwavering, even though the usual procession of red herrings are trotted out and routinely exhausted, the suspense is never subdued. Florinda Bolkan is magnificent as the maligned loner whose grief-fuelled antics raise the suspicions of a superstitious local population and their insatiable lust for revenge. Her character is an ordeal, and a tangent to this tale that's as sad and decayed as the town gripped by the fear of a relentless child serial killer.Bouchet strips nude for not her killer in the opening scenes, whilst versatile Irene Papas has a critical supporting role as the local priest's long-suffering mother. The formidable trio of Bolkan, Bouchet and Papas render leading man Milan (and Alex Cord lookalike) a virtual bystander, but this is an ensemble effort, like its storyline, lots of moving parts pulling in the same direction make for a very satisfying (and bloody) thriller.","After talking to a fellow IMDb'er a while ago about how much I had enjoyed Aldo Lado's excellent,grim Giallo Who Saw Her Die?,I was caught completely by surprise,when the extremely kind IMDb'er sent me a DVD,of what is possibly the second only Giallo title to involve a child killer, (with the other 1 being Who Saw Her Die?)which led to me picking up some cheap bread,and heading to the park to feed a deadly duckling.The plot-Southern Italy:Accendura:Taking a peak look at 2 couples who are getting hot & heavy,Giuseppe Barra's peeping tom fun is interrupted by 3 young boys called Bruno,Michele and Tonino,who yell out mockingly to Giuseppe,and cause him to chase after them.As Barra chases after the boys,a black magic performing gypsy called La Magiara plunges into 3 clay dolls which are designed to represent the boys who have taunted Giuseppe.Happy over outrunning Giuseppe,the boys start to get back into their normal life,with Michele being asked by his mum, (whose a housekeeper) to take care of an employer of theirs called Patrizia,who messes around with Michele,by walking around completely naked.A few days later:With Bruno having recently disappeared,investigating journalist Andera Martelli travels down to the secluded village,to follow the police manhunt that's taking place. Fearing that they will be unable to track down the boy,Bruno's family receive a ransom note,which tells them that if they ever want to see their son alive again,they have to pay a huge ransom.Quickly setting a trap,the police find out that Giuseppe is the ransom maker,and that he has also recently buried the body of Bruno (who Barra says was already dead when he found the body in the woodland area,which led to him making a money grabbing plan.)Whilst the police declare the case officially close,Andera begins to suspect that Giuseppe is not the child killer.As the police continue to question Barra,the body of Michele is discovered.With Michele's body containing the same markings which were left on Bruno's body,Martelli beings to fear that the mysterious killer may connected right to the heart of this unsettling,isolated village.View on the film:Despite the identity of the killer being one that the audience can take a good shot at guessing,director/co-writer Lucio Fulci, (along with Gianfranco Clerici and Roberto Gianviti) screenplay is packed with a fascinating number of subtexts which lead to the film becoming a paranoid soaked Giallo.Placing the murders in a deeply rural southern Italian village,the writers dig deep into the north/south divide,with the residences all being as deeply uncomfortable over any 'outsiders' entering their land.Taking on the strongly held religious beliefs in Italy with a real force,the writers show the deep flaws in each of the religious and government departments of the village to be ones that are simply over looked by the residence,thanks to the police and the church each filling the power vacuum which is to be found at the village.For the whereabouts of the killer identity,the writers do incredibly well at giving the chances of Martelli finding the killer a strong sense of doubt,due to the rural setting being something which is shown to be prepared to crush any voices which speak out of line.Displaying a surprising amount of subtle notes,director Lucio Fulci (mostly) restrains himself from over exaggerating the gore,by smartly taking a matter of fact approach which emphasis the unsettling mood placed in the screenplay.For the killings in this excellent Giallo,Fulci shows an unflinching eye,with the rather daring on-screen child murders placing psychological terror on the viewer,rather then drowning the audience in buckets of blood.Taking full advantage of the rural setting,Fulci counters the bursts of violence with a hauntingly poetic atmosphere,with the brilliant icy score of Riz Ortolani backing Fulci's elegant wide tracking shots,which Fulci superbly uses to show the rural isolation which the 'outsiders' are met by. Entering the movie completely naked in a scene which would lead to the title being taken to court,the beautiful Barbara Bouchet gives a tantalising performance as Patrizia,with Bouchet revealing Patrizia's provocative smile to be hiding a troubling secret. Dazzling the screen along with Bouchet,Florinda Bolkan gives a brilliant,wild eye performance as La Magiara,whilst Irene Papas brings a chill in the air as far too 'sweet mother' Dona Aurelia Avallone.Joining the 3 stunning ladies,Tomas Milian delivers a tough,gritty performance,with Milian superbly allowing Andrea Martelli tough determination to shine,as Martelli attempts to stop the next duckling murder from being hatched."],"review-user":["hippiedj","Lechuguilla","EVOL666","ferbs54","f.gimenez","Camera-Obscura","nippy-4","capkronos","jeffy-3","Coventry","HumanoidOfFlesh","claudio_carvalho","p-stepien","Layback","ODDBear","dung_rat","Witchfinder-General-666","BA_Harrison","v_borlestean","MisterWhiplash","Bezenby","christopher-underwood","Leofwine_draca","Chase_Witherspoon","morrison-dylan-fan"],"review-date":["26 October 2000","23 February 2010","9 February 2006","13 July 2006","29 April 2001","17 February 2007","5 October 1999","14 August 2006","22 September 2000","2 May 2004","15 September 2003","5 March 2017","22 October 2010","9 January 2000","24 January 2006","24 August 2002","26 February 2008","14 April 2007","1 February 2003","25 July 2010","10 November 2017","27 September 2017","27 June 2016","9 June 2015","22 October 2014"],"review-rating":["9","7","8","8","10","8","7","9","8","7","6","9","6","10","9","7","10","8","9","6","9","10"],"review-title":[" An astonishing and daring giallo, a classic in its type.\n"," Madness Takes Many Forms\n"," Excellent Mystery Film From Lucio Fulci\n"," A Grade A Thriller\n"," Excellent giallo!\n"," A genuinely good Fulci\n"," Fulci goes Giallo!\n"," One of the best films Fulci ever made.\n"," And Now for Something Completely Different\n"," An amazing Fulci film! The absolute proof that this director is a horror genius.\n"," Lucio Fulci's masterpiece.\n"," Ignorance, Superstition and Children Murders\n"," Giallo deluxe style\n"," Don't Torture a Duckling?\n"," Lucio Fulci at his best\n"," Just above par...\n"," An Utterly Brilliant Giallo Masterpiece, Fulci's Tantalizing Best!\n"," A surprisingly good giallo from Lucio Fulci.\n"," good giallo\n"," a high point artistically for Lucio Fulci with a murder mystery \"Giallo\" par excellence\n"," Darkest of the gialli\n"," Fulci does a brilliant job in ensuring very believable performances from everyone\n"," Stylish and atypical giallo\n"," Fulci tortures a duckling\n"," Who Saw Him (Her) Die?\n"]}