{"review-url":["http://www.imdb.com/title/tt0089160/reviews"],"review-text":["Fool for Love is one of the best films, and plays, I've seen in my 30+ years of adulthood--and I hate *everything* (i.e., I have very high standards). I also hate 90% of what Robert Altman has directed; Nashville goes right in the garbage can as far as I'm concerned.No spoiler here--just go to the play, if you can, or watch the film. It is intense, suspenseful, moving, funny (occasionally)...a must-see for art-film enthusiasts. Sam Shepard is a brilliant playwright and an excellent actor. The casting of Kim Basinger, Harry Dean Stanton, and Dennis Quaid for the movie was nothing short of genius.","(WARNING - CONTAINS MILD SPOILER) A movie almost designed to make you pause and check your recollection of it - it's confined to an almost empty motel where the huge courtyard resembles a circus ring and the rooms seem like temporary withdrawal points rather than refuges; as the characters become increasingly preoccupied by the past, the present increasingly falls away, until the ultimate incendiary appearance of the Countess in the black Mercedes marks the fusion of reality    and fantasy. Whether or not their stories  are true, and whether Stanton is truly the father or just a crazy old man stepping into their stories, seems impossible to determine. The theme seems to be how love of an extreme and unconsidered nature messes with stability to the point where reality itself breaks down; where exotic, misplaced fantasy becomes dangerously tangible. The image of the burning motel - a symbol of dislocation beset by destruction - is an appropriately weird ending for this strange but effective, startlingly imaginative, movie.","Adapted from Sam Shepard's play, this movie retains many play-like elements such as a relatively fixed setting (a roadside 50's motel in the Southwest) and extensive, intriguing dialogues. A woman \"May\" is hounded by a man \"Eddie\" (played by Sam Shepard). She tries to hide from him in the out-of-the-way motel, but he finds her. The film explores the history of their relationship, mainly from their childhoods, that has led them to this point. It's very easy to feel sympathy for the characters and to understand that their dysfunctional present relationship is a result of past events out of their control. We mainly watch them fight, make up, fight, make up and so on. One image that stands out in my mind, is of Eddie hauling May over his shoulder kicking and screaming, taking her somewhere she doesn't want to go.The soundtrack is also perfect soulful country with vocals by a lesser known artist \"Sandy Rogers\". She has this country doll voice that almost yodels at some points in the album! This is the kind of movie that will stay lodged in some part of your brain/soul. In other words, go see it!","\"Fool for Love\" is one of the several now forgotten films Robert Altman directed throughout the 1980s. This one, a screen adaptation of a Sam Shepard play that features Shepard in the lead role, just simply isn't very good. Altman made many not-very-good films over the course of his fascinating career, and many times the fault was his. But here I think the fault lies with Shepard for writing such a flimsy play. Altman's direction is assured, the performances are o.k. given what the actors have to work with, but this inconsequential screenplay goes nowhere, and takes its time getting there.Shepard is Eddie, a stuntman who has a love/hate relationship with May (Kim Basinger). The two fight endlessly over the course of an evening spent in some dusty motel in the middle of nowhere, while a mysterious man (Harry Dean Stanton) who may be either a figurative or literal father to both Eddie and May quietly observes. Randy Quaid rounds out the four-person cast as a gentleman caller.The only dramatic hook in the entire plot is the suggestion that Eddie's and May's relationship is incestuous. However, this hook feels more like a gimmick than anything. The screenplay doesn't explore their relationship in any detail, and it doesn't use their relationship to explore any more universal themes. Shepard and Basigner create eccentric, mannered characters who grow irritating within the first five minutes; Stanton and Quaid have little to do but provide reaction shots. The last half hour or so of the film is especially bad, when Eddie's and May's back stories begin to play out in flashback over monotone, somnolent voice over.Chalk this up to another of Altman's experiments gone awry.Grade: C-","Interesting, laid back version of the Shepherd play. On stage, with Ed Harris in the lead, it was all frenetic energy and danger. Here the piece is more moody and dreamlike. At times that works tremendously well, and it is visually beautiful. The play has been opened up in a way that feels natural and not forced. And the use of narration is very interesting and productively unsettling, since the memories we see do not quite match the words we hear. On the other hand, the slower pace makes the writing feel more melodramatic and almost old- fashioned in its twists. And Shepherd is nowhere near as interesting as Harris was on stage. We never feel that he is really dangerous. He comes off more as a love-struck kid than obsessed man. And it ends with a whimper, not a kick. Still, there are plenty of less interesting theater to film adaptations out there.","The film seems to beg for a less literally interpreted comment than those posted here (Where I looked hoping to find someone who could explain the darn thing).Usually when people methodically destroy a motel, or start SHOOTING GUNS, the manager comes out and asks them to stop. For some reason that never happens in this movie. Hmm.It seemed to me that The Old Man and the Old Trailer in the Old Junkyard are the only real things in the story, and The Old Motel with its' crackling neon lights, complete lack of window coverings, and grotesquely stained mattresses a symbolic tableau for his daily reliving of past events in his life and possible present day scenarios. Ghosts from the past appear and wander hazily around the courtyard, even interacting with each other while the old man looks on and listens with varying degrees of emotion, amusement and curiosity, interrupted periodically by his desire for alcohol which plays a large part in the imagined world he inhabits - a world where he is \"married to Barbara Mandrel\".The characters suddenly depart as the whole scene bursts into allegorical flames, and the Old Man retreats defeated again to his Old Trailer amid the conflagration. Presumably the nightmare will be repeated on the morrow, like so many Twilight Zone episodes which this movie so closely resembles except with better dialog.CB","Sam Shepard's story of obsessive love in a lonely Texas trailer park may have been a fine stage drama, but transferring the play intact from the imaginary backdrop of a theater to an out-of-doors location only makes the stage dialogue sound pretentious and artificial. Good theater doesn't guarantee a good movie, and Robert Altman's attempts to open up the play using flashbacks and fluid camera work do little more than draw attention to its stage origins, with the director's trademark slow zooming and cross-cutting giving an entirely false impression of movement and meaning (dramatic moments, including a childhood secret revealed, are subsequently lost within all the visual calisthenics). The end result is an attractive but empty experience.","May (Kim Basinger) is waiting for her boyfriend (Sam Shepard) in a run-down American motel, when an old flame turns up and threatens to undermine her efforts and drag her back into the life that she was running away from. The situation soon turns complicated.When a film is an expansion on a play, such as this is, you have to be true to the source while also going beyond. Altman succeeds, casting Harry Dean Stanton as a one-man Greek chorus and bringing a fuller vision to the story than could be shown within one room.Roger Ebert said that Altman \"has succeeded on two levels that seem opposed to each other. He has made a melodrama, almost a soap opera, in which the characters achieve a kind of nobility.\" These are kin words and not without merit.","Fool for Love (1985) was directed by Robert Altman. It's based on a Sam Shepard play. Sam Shepard did the screenplay. Sam Shepard also stars as Eddie, a rodeo rider who drives up to an end-of-nowhere motel, and starts causing trouble within the first 60 seconds.I'm amazed that this movie is so bad. Shepard is a good actor, and so are the other leads: Kim Basinger as May, and Harry Dean Stanton as \"Old Man.\" Randy Quaid has the unenviable supporting role as a \"normal\" guy who arrives at the motel to take May out on a date, and ends up enmeshed in the bizarre triangle. It's hard to believe that a brilliant director, working with such skilled actors, could end up with a movie this bad. Nothing works, except that Eddie is a menacing presence throughout. It's obvious from the first minutes of the movie that bad things are going to happen, and they do throughout the film.It's also obvious that Altman needed to open up the play so that he could turn it into a movie, and he did. He didn't do it all that well, but he did it. It's clear that people didn't like the film. At the time I'm writing this review, the IMDb rating is a horrific 5.9. (I actually helped improve the rating when I gave the film a 6. That must be a first.)The movie will work well enough on DVD, which is how I saw it. It would probably work better on the large screen, because you'd get even more of a sense of the total isolation of the motel location. However, my advice is to pick another movie. Fool for Love just isn't worth the time spent watching it.","After reading Fool For Love in a Drama class of mine, I was looking forward to seeing how Sam Shepard's wonderful play would be translated to the screen.  Much to my dismay, it was nowhere near as entertaining as the play. The film seemed to drag, the music was inappropriate for the tone of the movie, and all the raw energy of the play seemed to have been sucked out of this film version.  It's a shame to see this come out this way even with Shepard's involvement, playing the role of Eddie.  Do yourselves a favor...see the play next time it's being performed in your area or simply read the book instead.","Robert Altman directed this adaptation of a play by Sam Shepard, who wrote the screenplay and stars as a drifter who drives his pickup truck, complete with horse and trailer, to a small hotel in New Mexico. It seems he has a tempestuous romantic history with the hotel's proprietor (Kim Basinger), and the audience fills in the blanks as the film progresses, taking a distinctly sharp turn in the last third. Also with Randy Quaid and Harry Dean Stanton. The first half of the film nearly lost me for good, with not a lot happening and the performances pitched to the back row. But things get better during the home stretch, even if bits do strain credulity. From the Cannon Group, stepping outside of their usual budget action flicks.","This is a VERY dull, slow movie. With almost no redeeming qualities to it, the film lumbers towards a dramatic and distasteful climax. No way to connect with the loathsome characters, you feel like a creep, a peeping tom watching the lives of the two main actors fall apart. There can't possibly be a worse way to spend nearly two hours of your life than watching this piece of junk movie. Try Zapped! for 80s nostalgia. If you want something more stimulating, intellectually or otherwise, just stick your head in a plastic bag. Don't bother with this dud. This movie was all about the actors and writers loving themselves more than their audience. You'll feel dirty and insulted after-wards..."],"review-user":["beb5","allyjack","Katy-13","evanston_dad","runamokprods","craigbaker","mjneu59","gavin6942","Red-125","eisucks","calvinnme","spappas2009"],"review-date":["11 March 2015","20 August 1999","25 March 1999","1 May 2008","20 August 2010","25 November 2005","18 November 2010","10 July 2014","16 February 2015","11 May 2003","11 September 2018","21 June 2013"],"review-rating":["10","8","7","4","7","5","4","6","6","3","6","2"],"review-title":[" An outstanding movie from an outstanding play\n"," Strange but effective; startlingly imaginative\n"," May vs. Eddie\n"," A Somnolent Experiment from Robert Altman\n"," Interesting, worthwhile, if not totally successful adaptation of the play.\n"," A great set and opening crane shot!\n"," theater piece likely played better on stage\n"," A Nice Adaptation\n"," Sam Shepard writes, scripts, and stars in this film. It's a dud.\n"," Nowhere near as good as the play\n"," The Cannon Group steps outside their usual action genre\n"," A Very Dull Movie\n"]}