{"review-url":["http://www.imdb.com/title/tt0032676/reviews"],"review-text":["When Warner Brothers decided to produce the biography of Notre Dame's legendary football coach, Knute (pronounced Ka-Newt) Rockne, there were major hurdles that had to be faced. Rockne had only passed away nine years earlier, at 43, and his image and distinctive speaking style were well-known to football fans, nation-wide, through newsreels and radio, as was his Cinderella-like story (born in Voss, Norway, he and his family had emigrated to Chicago, Illinois when he was five, he worked to pay tuition to attend Notre Dame, then went on to revolutionize football as both a player and coach). Any film about Rockne had to secure the permission of his widow, Bonnie Skiles Rockne, and the cooperation of Notre Dame, and both wanted final approval of both the script, and the actor to play 'Rock'.While the script, focusing on Rockne's devotion to 'his boys', making football more exciting, and his unshakable faith in the importance of athletics and education to America's youth, would win Mrs. Rockne and Notre Dame's support, casting the coach would prove a challenge. When stocky, darkly handsome 41-year old Irish American actor Pat O'Brien (best known as James Cagney's frequent co-star) was announced to play the craggy Norwegian American Rockne, there was some concern raised whether he was 'right' for the role. But in full makeup, O'Brien was quite convincing, and he could mimic the coach's staccato speaking style perfectly. Knute Rockne would become O'Brien's 'definitive' role, as well as his personal favorite, in a career that spanned over sixty years.From his introduction to football as a boy (played by Johnny 'Tarzan's Boy' Sheffield), as he admonishes his father (veteran character actor John Qualen) to \"speak American, Papa...We're in America, now\", through his years working at a Post Office earning tuition money, to his courtship of Bonnie Skiles (Gale Page) and on-field partnership with 'Gus' Dorais (Owen Davis Jr.), who would toss Rockne the forward pass against Army that would revolutionize the game, the story is both entertaining and informative (Rock, it is revealed, could have made a \"first class\" chemist).Then Ronald Reagan appears, as flippant, yet private George Gipp, and the film achieves it's legendary status. Coach Rockne and player Gipp, as portrayed by O'Brien and Reagan, have a 'father/son'-like bond that is irresistible, and in less than ten minutes of screen time, Reagan establishes himself as no longer a 'B' actor, but a star to be reckoned with. The \"Win One for the Gipper\" speech has become one of the best-loved in movie (and sports) history, and, while it has been parodied frequently through the years (particularly while Reagan was President of the United States), it is still quite moving.While Gipp's untimely death casts a momentary pall on the film, his place is soon taken by the legendary \"Four Horsemen\", as Rockne introduces 'the backfield shift' to football. The coach becomes the spokesperson of College Football, defending both himself and such legends as Alonzo Stagg, 'Pop' Warner, Howard Jones, and Bill Spaulding (playing themselves), against charges of gambling and football's place in an academic environment.Through it all, Bonnie Rockne offers loving support to her often preoccupied but devoted husband and their large family. The bond they share is so intimate that she 'feels' the airplane crash that takes his life, in the film's tragic finale.Punctuated by Notre Dame's classic fight song, KNUTE ROCKNE ALL AMERICAN is certainly not a 'perfect' film (watch how frequently jersey numbers appear, disappear, and change, as vintage newsreel footage is used during big games), but the overall result is both rousing and sentimental. It's easy to see why \"Rudy\" Ruettiger would be inspired by it, and would want to add his own chapter to Notre Dame's illustrious history.The film certainly deserves it's 'classic' status!","You don't have to be a Notre Dame football fan to enjoy this, because I am not....but, as a football fan in general, this was fun to watch. It almost makes me a Fighting Irish devotee. If you can't get caught up in the emotion in this film, gridiron fan or not, you better check your pulse because this is an emotional film with some very touching scenes.As a sports fan, I loved watching the classic footage of early college games. They had some pretty wild plays back then with a lot of laterals. They interspersed that footage with Pat O'Brien shown as head coach Knute Rockne on the sidelines and some of the players, such as George Gipp (Ronald Reagan). Reagan gets pretty good billing in this film but his part really isn't that large. O'Brien is the only actor with a large role in here. The rest - all playing nice characters - include Gale Page as Rockne's wife \"Bonnie;\" Donald Crisp, as the Notre Dame's \"Father John Callahan;\" Albert Bassermann as chemistry professor \"Father Nieuwland\" and Reagan, as Gipp, perhaps Notre Dame's most talented and famous player ever.What this film does nicely is balance the personal story with the football. Neither angle is overdone. The characters in here all people you can root for, as there are no villains. On my last look, it was interesting to discover Johnny Sheffield - Tarzan's son - playing Rockne at the age of seven and to see George Reeves, TV's Superman, as one of the players. There have been very few football movies made in Hollywood, for some reason, and precious few good ones. This is one of them.","Recently was traveling in Norway from Bergen, Norway and stopped in the small town of Voss, Norway and there was a monument in honor of Knute Rockne who was born in Voss years ago. The people all know about Knute to this day and tour guides are proud to stop at his monument. This film is a great history of this great man and his great love for Notre Dame Never realized that Knute has such great talents in chemistry and laboratory science and also taught chemistry for years and at the same time coached the football team. Ronald Reagan played the role of George Gipp, (The Gipper) who was an outstanding football player; Reagan had a short role, but gave a great supporting role in this film. Donald Crisp, (Father John Callahan) was outstanding as a priest who always had great faith in Knute during his entire life at Notre Dame. This is a great Classic film and will be viewed by many generations to come. Enjoy.","This is the life story of probably the most famed football coach, Knute Rockne. 'Rock' gained fame with his pep talks that led to many memorable victories for his beloved Notre Dame football team.Pat O'Brien probably turns in the best performance of his career as Coach Rockne. Ronald Reagan portrays the dying George Gipp of the \"win one for the Gipper\" fame. Also in the cast are Donald Crisp, Owen Davis Jr., Gale Page and John Litel. Johnny Sheffield, who played Boy in the Tarzan series, plays Rockne at age 7.Father of the forward pass and backfield shift inspired even the non-football fans during his era in the limelight. This is a football classic you can enjoy watching again and again.","\"Knute Rockne All American\", the biopic about the famous Notre Dame beloved coach Knute Rockne, is an excellent sports film to watch. Not ever having seen it, we were surprised by the technique used in the movie by director Lloyd Bacon, who shows he was ahead of his times in photographing football games. The result is a vibrant picture about the man responsible for the legacy of the collegian sport, Knute Rockne.The film presents Rockne from his humble origins in Chicago to his studies in famed Notre Dame University in South Bend, Indiana. He was an ambitious man who had a vision about how the game should be played. Luckily, he went to give his beloved Notre Dame the glory he was after.Pat O'Brien looks a bit older when he starts as a freshman. In fact, he doesn't change much throughout the film, but he is fine as Mr. Rockne. Pat O'Brien shows he could inspire the players under him by just being a father figure. Gale Page plays Bonnie Rockne, the wise woman who understood her husband's call in life. Ronald Reagan plays George \"The Gipper\" Gipp, who was a legend that died much too young, but who left a legacy behind. Donald Crisp makes a good contribution as Father John Callahan who was Rockne's mentor at the university.This film will delight not only sports because of LLoyd Bacon's direction and the fast pace he gives to the movie.","The true life story of perhaps the greatest football coach the game has ever known. Knute Rockne led the game of football out of the \"stone age\" with innovations such as the forward pass and offensive formation shifts. But he is probably best known for his motivational locker room speeches. Along the way, he brought fame and glory to a tiny, little, unknown Catholic school in Indiana. Pat O'Brien is incomparable in his role as Rockne. Terrific cast that includes Ronald Reagan who gives a great performance as Notre Dame's first, true superstar, George Gipp.For Football aficionados, this is the greatest football movie ever made. Do yourself a favor and rent the black and white version. (Some versions have deleted scenes for some reason) If you got the good version, look for a brief cameo by the immortal Jim Thorpe as he sticks his head in the locker room telling Rockne and the team they only have a few minutes left before the 2nd half begins.","Pat O'Brien had his best role ever as Notre Dame football coach Knute Rockne. From humble beginnings, Rockne entered Notre Dame as a student circa 1910. He is into chemistry but becomes a marvelous football player and hero.Upon graduation, he teaches chemistry at the school but he has got the football fever that tugs at him, this forces him to give up chemistry to pursue his dream of coaching the game. In a way, too bad, the school probably lost a great chemistry teacher-certainly far better and nicer than the one I had in high school. (Erasmus Hall in Brooklyn to be exact.)He motivates his students. He will not tolerate academic underachievement. He is a coach for all seasons.O'Brien captures that common kind touch. One of his students, George Gipp, is memorably played in a fine brief supporting performance by Ronald Reagan.The years pass and the achievements run high-but Knute remains the same kind coach who testifies before Congress when football is called into question.Donald Crisp is outstanding as a Notre Dame priest who knew that Rockne was destined to coach football. Albert Basserman is adequate, but his Jewish accent in the portrayal of a priest is awkward at best. Basserman was nominated that year in the supporting category for \"Foreign Correspondent.\"Rockne's tragic death, in a plane crash, robbed the world of many more years of a totally professionally wonderful human-being. The film is great.","It's hard to imagine in this day and age how popular and how much of an impact a Norwegian immigrant and would be chemist had on the American public and how much of a national tragedy his sudden death in 1931 was viewed. But Knute Rockne was an extraordinary individual who both revolutionized and popularized college football and put a small obscure Catholic college on the map.I've heard clips of Rockne's famous pep talks and it is uncanny how Pat O'Brien got the voice and the inflection perfectly. In what turned out to be his career role, Pat O'Brien captures the integrity and fighting spirit that was Rockne. Rockne is assisted by well by Gale Page as Bonnie Stiles Rockne who complained about her home being a training camp for Notre Dame, but never threw anyone out of her house.Rockne's first impact on football was as a player with Notre Dame not a coach. One fine day in the second half of a losing football game against heavily favored Army, Rockne and team mate Gus Dorais played by Owen Davis used the forward pass as an offensive weapon. Before that football was simply a game where you just got bigger guys for your side and ran through the defense. Rockne didn't invent the forward pass, but he popularized and football became a game of strategy as well as brawn after that. Rockne knew how to work the media also. Those well publicized pep talks of his were not just to inspire his players. They were well publicized and it was in a lot due to him that college football became a major sport in that Golden Age of Sports in the Roaring Twenties. Playing a small, but key role is Ronald Reagan. As George Gipp, the first player Rockne coached to achieve greatness, Reagan not only got a good performance, but forever after a name that was handy in his subsequent political career. That deathbed scene which Rockne swore was accurate became a Republican battle cry as many a GOP underdog went out to win one for the Gipper.I still remember a widely distributed photograph in 1981 that was one of the first of recovering President Ronald Reagan at Notre Dame's graduation with his old friend Pat O'Brien. Reagan always credited O'Brien and Dick Powell of all the Warner Brothers stars of the period as the ones who were the kindest and most encouraging to a young player on the lot trying to make good.Notre Dame itself owes its prestige to Rockne. It's quite possible that Notre Dame would be an obscure small Catholic College without the reputation that football brought to it.Though George Gipp and the later famous backfield of the Four Horsemen certainly had their place in the sun it was Rockne who had the reputation. It's no accident that Warner Brothers was able to get Amos Alonzo Stagg, Glenn 'Pop' Warner, Howard Jones, and William Spaulding, Rockne's contemporaries and coaches with great reputations in their own right to appear in Knute Rockne, All American. It was there way of honoring the guy who was number one in their profession.I think more than football fans will enjoy Knute Rockne, All American. Though you might become one after seeing the film.","Some time ago, we read of the results of a poll taken by some Newspaper Sports Writers. The Questions posed were only two, and were brief and right to the point.The Question Number 1 asked respondent to tell who was his most Beloved college football team. Question Number 2 asked the fan to name his most Hated college football team. The answer to both questions was simply, Notre Dame! ND is tops on both lists! Yeah, love 'em or hate 'em, but you sure don't ignore ,em.The roots of this unique position of this Indepent* College Football Powerhouse are found in the life and career of one, grown-up, little Immigrant Norweigen boy from Chicago named Knute Rockne.As a biopic, the production of KNUTE ROCKNE, ALL-American(1940), came out relatively close to the death of Coach Rockne in a 1930 plane crash. It was about 10 years after that the film was released. That would mean that preliminary work on the project started about 8 years after our Nation's great loss of Mr. Rockne.His likeness and voice were well known from Newspapers, Radio and Motion Picture News Reels. Both Knute's Widow,Bonnie Skiles Rockne, and the University of Notre Dame had approval rights in choosing the Actor to play the Lead and okaying the script. We think that they could not have done the job any better. Pat O'Brien truly looks the part and was himself a footballer in college. Ronald Reagan is cast in the pivotal role of George Gipp**, a free spirited student going to Notre Dame on a Baseball scholarship! He was a \"walk-on\" football player.The cast runs full of talented players. We have Griffith Veteran,Donald Crisp as Fr. Callaghan, C.S.C., Notre Dame President. Albert Basserman is Fr. Newland, the Chemistry Prof and Rockne mentor. Gail Page appears as the Mrs., Bonnie Skiles Rockne. Owen Davis,Jr. is Rockne cohort, Gus Dorais(the passer in that historic ND vs. ARMY Game at West Point.)The cast is rounded out by Kane Richmond, Nick Lukats, William Marshall and William Byrne as the Four Horsemen. Real life Big Time College Coaches Howard Jones, 'Pop' Warner, Bill Spaulding and Amos Alonzo Stagg appear as themselves in scenes of Congressional Probe into College Sports and add an authentic touch. As for biopic,KNUTE ROCKNE ALL-American!,all one can only say that it hits the ground running, and did not slow down from beginning to end. There is no wasted time either. All the screen time is used to move the story along. Use of Notre Dame Choir, the Campus itself and all that Brass Band rah-rah march music all ad to the feeling of really being there.**** To this day,even though their Basketball Team and other sports teams compete in the Big East Conference, Notre Dame remains an Independent in NCAA Football. What this means, that in effect, The Fighting Irish play a national schedule.** There was no such agreement with the Family of George Gipp. There was a lawsuit some years ago over the scene portraying young Mr. Gipp giving the famous \"Win Onr For The Gipper Speech\". Television prints of this KNUTE ROCKNE ALL-AMEICAN were minus the speech in the death bed scene.*** Other Notre Dame themed Films were made over the years. THE SPIRIT OF NOTRE DAME (Universal 1931)featured J. Farrell McDonald as a Rockne look-alike coach. It also featured Lew Ayers, Andy Devine Nat Pendleton, as well as the members of the real Notre Dame Championship Teams featuring the real Four Horsemen. Then of course, we have RUDY (Tri-Star 1993)with Sean Astin, Jon Favreau, Ned Beatty and Charles Dutton, among others, in a fine cast. There was also talk of an unauthorized film, critical of Notre Dame called GOLDEN GLORY, but nothing has materialized, has it?(Let me know, Dear Reader, THANX!!)**** Warner Brothers always had great music in their, both in opening themes and in incidental music. In this Rockne Movie, they have incorporated THE NOTRE DAME FIGHT SONG in the score. Along with it were STEP NOTRE DAME and THE NOTRE DAME ALMA MATER, which had its premiere at the Rockne Funeral in 1930 at the Notre Dame Basilica.","What an inspiring movie this biography is! Some reviewers make think that it is out of date or corny or contrived, but it is better than those implications. For this entertaining film is all about the \"heritage of mind and body  to build the character of man.\" This movie sincerely focuses on one who is on a mission of honest success. Knute Rockne (warmly played by the flawless Pat O'Brien) may have just been a football coach, but what an iconic motivator he was! And, although not perfect, what a great man he was! He was Vince Lombardi before Lombardi. An 1890's immigrant to the USA, Rockne (1888-1931) had to work in a Chicago post office to earn enough money to enter Notre Dame University at an age when most young folks graduate (age 22 in 1910). He played football, and helped innovate the forward pass (1913). After graduation (1914) Rockne became a Chemistry (pharmacy) laboratory assistant and part-time football coach. Before long, his career became totally devoted to football coaching. With the talented George Gipp at halfback, Rockne won his first national championship (1919). With the \"Four Horsemen\" in the backfield, Rockne won his second national crown (1924). The coach fought hard to keep the college game clean of gamblers and scandal, and thought it unthinkable that any school should \"fix it\" for an athlete to get by in class. Rockne wanted his players to go to class and learn to make something of themselves. During a congressional hearing in the 1920s Rockne stated that sports built character. Americans took out their aggression in sports, unlike the Europeans, who had been racked with \"wars and revolutions for centuries\" (and this was before World War II!). Sports, insisted Rockne, are the antidote and the safer outlet.So many wonderful scenes abound, besides those inspirational locker-room speeches that still resonate. There are the exciting football plays, both vintage and those created for the movie. Coach Rockne takes his football players to a Rockette-type of show, from which he devises – scratches out – new football plays on a sheet of paper. The new style (\"The Backfield Shift\") merely wins the Fighting Irish another national title. At age 42 Coach had phlebitis, and so had to manage the field game from a cart under blankets or from a wheelchair. Famous contemporary coaches like Pop Warner and Amos Alonzo Stagg have brief on-screen appearances. Rockne's mentor, the faithful and humanitarian Catholic priest Father Callahan, is splendidly played by Donald Crisp.Feel the sense of impending doom, when the fateful airplane takes off from Kansas City bound for California on 31 March 1931. Rockne's wife Bonnie feels a sudden cold chill as she enjoys the warm sun on a Florida beach. Tragedy strikes as the plane sadly crashes down in a Kansas pasture. Afterward, what can be more moving or fitting than the Latin funeral rite for the fallen hero? For years this eastern writer has watched this entire movie just to confirm whether the long-excised George Gipp scenes (well-played by Ronald Reagan) had been restored (\"Win one for the Gipper.\"). A while back the dream was realized. And the result is that the movie has added another star (from 8 to 9). By the way, Rockne's winning percentage was an astounding .881! His teams lost only 12 games in his entire 13-year college coaching career (1918-1930). He lost eight of his games between 1925 and 1928. Putting it another way, Rockne lost just four games between 1918 and 1924 (seven years), and never lost after 1928! There are no asterisks, no arguments, or victorious games removed for dubious reasons.In sum, it does not matter if you root for Penn State, Alabama, Florida State, Michigan, Oklahoma, Texas, or Southern Cal. It does not matter what your religion or heritage is. Just see this movie (more than once) and enjoy it! And if you are a fan of Notre Dame, be stirred by the School Fight Song (\"Cheer, cheer for old Notre Dame \")!","Knute Rockne, All American (1940 Warner Brothers) starring Pat O'Brien, Ronald Reagan, Donald Crisp, and John Qualan is technically and artistically a splendid movie, far better than its reputation in many circles as mainly a nostalgia movie about one of college football's grand old men (Knute Rockne, long time football coach for Notre Dame University in South Bend Indiana).It is a movie of which displays the very best talents of Warner Brothers movie studio at the height of it's golden age in the years immediately before USA entry into World War II.The camera work, the special effects provided by Hollywood cameraman and then future director Byron Haskin (he later directed Walt Disney's \"Treasure Island\" [1950] and also George Pal's \"War Of The Worlds\" [1952] movies in the early 1950's and in his old age was interviewed on camera in the 1970's by Kevin Brownlow for the \"Hollywood: The Silent Era\" documentary series which described Haskin's silent era cameraman days), the slick and wonderful newspaper headline montages which punctuate and advance the movie story (which covers the entire, rather long life of Knute Rockne from his childhood in Norway to his death following decades of service as Notre Dame's football coach of fame) are all breathtaking.This is no \"airhead\" movie.In addition to the great way it captures the physical part of college football, and the charismatic personality of Knute Rockne during his coaching years (and also during his undergrad years as a student football player), the movie takes on the question of what place football and \"big sports\" have had and should have in the college world, and in American culture generally, and provides viewers with thoughtful, worthwhile answers worth pondering and reviewing often.But briefly, Knute Rockne, All American (1940 Warner Brother) starring Pat O'Brien and Ronald Reagan is an intelligent movie about a subject many people doubt is intelligent at all....football and other big time contact sports.Ronald Reagan is given second billing in the beginning credits as the co-star of the movie, Pat O'Brien's main co-star. Yet Reagan's time on the screen (he plays George Gipp, a World War I era Notre Dame University football player of fame who sadly died in his senior year at Notre Dame) is relatively brief. Reagan's actor performance is underplayed, and quiet to the point of being undramatic. His more hysterical performance as \"Drake McHugh\" in King's Row (1942 Warner Brothers) two years later is rightly counted his best and most skilled movie actor performance by movie historians (he plays a character in King's Row who has his legs amputated and is spectacular in the scene where he discovers in a hospital recovery room what has happened to him). This movie is part of the USA Federal Government Library Of Congress National Film Registry List and placed among 475 movies (as of 2010) ranked as important and notable due to aesthetic, cultural, and/ or historical importance.Knute Rockne, All American (1940 Warner Bros) starring Pat O'Brien and Ronald Reagan is important in all three areas, a sweetheart of a movie worth screening often, truly a cinematic masterpiece not ranked usually among \"the great movies,\" but worthy and excellent in every way.------------------- Written by Tex Allen, SAG Actor. Visit WWW.IMDb.Com and choose \"Tex Allen\" \"resume\" for contact information, movie credits, and biographical information about Tex Allen. He has reviewed more than 42 movies posted on WWW.IMDb.Com (the world's largest movie information database, owned by Amazon.Com) as of January 2011. These include: 1. Alfie (1966) 29 July 2009 2. Alien (1979) 24 July 2009 3. All the Loving Couples (1969) 17 January 2011 4. All the President's Men (1976) 16 November 2010 5. American Graffiti (1973) 22 November 2010 6. Animal House (1978) 16 August 2009 7. Bullitt (1968) 23 July 2009 8. Captain Kidd (1945) 28 July 2009 9. Child Bride (1938) 24 September 2009 10. Creature from the Black Lagoon (1954) 22 September 2010 11. Destination Moon (1950) 17 January 2011 12. Detour (1945) 19 November 2010 13. Die Hard 2 (1990) 23 December 2010 14. The Wonderful, Horrible Life of Leni Riefenstahl (1993) 19 November 2010 15. Jack and the Beanstalk (1952) 26 July 2009 16. King Solomon's Mines (1950) 1 December 2010 17. Knute Rockne All American (1940) 2 November 2010 18. Claire's Knee (1970) 15 August 2009 19. Melody Ranch (1940) 10 November 2010 20. Morning Glory (1933) 19 November 2010 21. Mush and Milk (1933) 17 January 2011 22. New Moon (1940) 3 November 2010 23. Pinocchio (1940) 6 November 2010 24. R2PC: Road to Park City (2000) 19 November 2010 25. Salt (2010) 24 August 2010 26. Saturday Night and Sunday Morning (1960) 21 January 2011 27. Sunset Blvd. (1950) 1 December 2010 28. The Forgotten Village (1941) 21 January 2011 29. The Great Dictator (1940) 1 November 2010 30. The King's Speech (2010) 19 January 2011 31. The Last Emperor (1987) 20 January 2011 32. The Loneliness of the Long Distance Runner (1962) 9 January 2011 33. The Man in the White Suit (1951) 5 August 2009 34. The Philadelphia Story (1940) 5 November 2010 35. The Social Network (2010) 19 January 2011Written by Tex Allen, SAG-AFTRA movie actor. Visit WWW.IMDb.Me/TexAllen for more information about Tex Allen. Tex Allen's email address is TexAllen@Rocketmail.Com.See Tes Allen Movie Credits, Biography, and 2012 photos at WWW.IMDb.Me/TexAllen. See other Tex Allen written movie reviews....almost 100 titles.... at: \"http://imdb.com/user/ur15279309/comments\" (paste this address into your URL Browser)","I caught this on TCM this afternoon and kept in on to catch Ronald Reagen as George Gipp.  As another commentor noted, it comes across as pure documentary and this movie is only for those who harbor an interest in football and are familiar with the story of \"the Rock.\"  Pat O'Brien appears to be looking off-screen at cue cards and Reagan, in the scene in Rock's living room, coughed as if instructed by a doctor.I much prefer The Pride of the Yankees with Gary Cooper, which was released only two years later and nominated for Best Picture by the Academy. However, Knute Rockne All American not so bad that you can't enjoy it and I especially enjoyed the stock footage of Notre Dame football.The only other thing that puzzled me was the pronunciation of his name. For years I've heard it pronounced NEWT with the silent k, but here it's pronounced KA-NEWT.  I guess I learned something else...",". . . since my dad said this movie was the main reason Ronald Reagan was. This movie is a good history lesson about old-timey football, if you overlook the fact that it created a myth which haunts us to this day. Any little scrawny guy who finagles his way into a ND uni is likely to have a flick made about him--just look at RUDY. George Gipp was from Michigan's Upper Peninsula, for gosh sakes. NOBODY lives there except moose and black flies. Gridders from there don't play for Alabama or Auburn--they go to Ferris State, Hillsdale College, and Notre Dame. But even with the best prayers money can buy, they still pass on at the drop of a hat: the all-night drinking and womanizing across the border at the Baron Lake Supper Club was enough to give George a fatal cold! Why should playing this loser qualify Reagan to be president? His tenure was full of Iran-Contra and other rule breaking, just like the real Gipper's! If anyone should have been elected prez based on this movie, it was Pat O'Brien. He portrayed someone who bamboozled sports writers into creating the Four Horsemen myth, which propelled the so-called \"Fighting Irish\" into a media juggernaut plaguing us right up to this year, with the mismatch between ND and the Crimson Tide. At 6-6, Michigan State would have been more competitive than the smoke-and-mirrors team led by Te'o and his imaginary friends. FDR was already failing in 1940, when he won an illegal 3rd term. If Pat O'Brien was elected instead, maybe he could have used the tricks he learned in this movie by becoming Knute to fake the Nazis out of their jockstraps and end WWII with no loss of American life. In order to understand either American college football OR the U.S. presidency, you MUST watch this gripping, seminal film!!","The story of legendary Notre Dame football player and coach Knute Rockne (Pat O'Brien).This film is an early example of the great biopic. While I care nothing for Notre Dame football, I feel like this was a really well-made film. Was it accurate? I don't know. Likely some of Rockne's lesser qualities were probably glossed over. But it still tells the story and makes a great case for the role immigrants have played in shaping America.The film is probably best remembered today for Ronald Reagan's role as \"the Gipper\". This is interesting, because even though the part is important, it is relatively small. Of all the parts Reagan played, it is interesting that this is the one that stayed with him forty years later.","I have always wanted to see this movie since there has been so much American hype about winning one for the Gipper. Now I can cross that off my bucket list. This movie has not held up well at all. Maybe in 1940 it was sentimental but now it comes across as maudlin and soapy. I had to listen to that Fighting Irish theme song from start to finish in just about every scene and I couldn't even finish the credits it was so grating. Pat O'Brian does a good job until he starts sounding like James Cagney for no apparent reason and since there have been so many jokes about that accent, it doesn't sound authentic at all and unintentionally humorous (Yeah, see, yeah). The wife had almost no role, neither did any other character including Reagan who only had about 3 scenes and was OK and then forgotten for the rest of the movie. There were so many other great movies that year and this one will forever be seen as average.","Knute Rockne All American (1940)*** (out of 4)Fun, winning story from Warner about the life and career of Knute Rockne (Pat O'Brien), the man who will forever be remembered as changing the way football was played while coaching at Notre Dame. If you're looking for a 100% accurate biography on Rockne then you might not want to start here but there's no question that the producers and studio had their hearts in the right place and they've at least delivered a very entertaining look at several highlights in the career of Rockne. I thought the film was highly entertaining from the start as we see Rockne's family coming to America and all the way up until the final day in the life of the legend. The film covers his days of attending college, his work as a chemist, his marriage to Bonnie Skiles (Gale Page) and of course his relationship to George Gipp (Ronald Reagan). The film certainly makes you care about Rockne and especially his fast-talking style, which someone like O'Brien can do with ease. The actor certainly turns in a very good and energetic performance as he has no problems making you believe he knows football and his speeches are flawless. Page is also good in her supporting role as is Donald Crisp and John Litel. Reagan appeared in countless films in his career but it's easy to see why his four-or-so minutes here are his most remembered. The football scenes are all directed extremely well, although there are still moments where stock footage is used. I think the film works best whenever we see Rockne on the field, coaching up his boys and working new plays to change the way the game was played. KNUTE ROCKNE ALL American is very \"American\" in the way he shows football as a patriotic thing and this too is something that helps carry the film.","Knute Rockne led an extraordinary life and his story is told rather well in Knute Rockne All American. We follow Rockne's incredible journey from young Norwegian boy to iconic American football legend. Produced in 1940 the film may at times seem a touch dated and at times downright hokey. And the filmmakers do lay it on a bit thick at times as Rockne is glowingly and lovingly portrayed. You may come away thinking Rockne should have been nominated for sainthood when in fact he was, after all, just a football coach. But it is undeniable that he had a great impact on the game of football as well as having a tremendous impact on the lives of so many of the young men he coached. This film shows the great impact he had and gives you an insight into why he is so revered to this day.Playing Rockne, Pat O'Brien gives an impressive performance. It's unquestionably O'Brien's movie to carry and he makes the film and the character his own. The real-life Rockne was renowned as a great inspirational figure and O'Brien's performance will make you understand why. The only quibble comes early in the film when O'Brien, in his early forties, is playing the college student Rockne in his early twenties. All the makeup in the world wasn't going to make that believable and the effect is rather jarring. But as the Rockne character ages and begins his legendary coaching career O'Brien fits the part perfectly.As for the rest of the cast one name jumps out and that is of course Ronald Reagan playing the young, charismatic, but ultimately doomed football star George Gipp. In the grand scheme of the film it's not really a large part, with Reagan appearing for no more than 10-15 minutes. But the performance has become legendary thanks to Reagan's famous \"Win one for the Gipper\" deathbed speech. It's a brilliantly-played scene, chock-full of emotion. Reagan may not have been on the screen for very long in this film but he certainly made a tremendously positive impact in a winning performance.The rest of the film strikes a balance between football and life in general with Rockne having great lessons for his young men in both areas. For football fans (and history buffs) there is a rare treat as actual archival footage from Notre Dame games of the Rockne era is interspersed throughout the film. It's a rare opportunity to see just how much the game has evolved in the last six-plus decades and an opportunity to see Rockne's legendary strategic innovations put into practice. If you're a Notre Dame fan you'll probably enjoy the fact that the Notre Dame Victory March provides a seemingly constant soundtrack for the film. If you're a Notre Dame hater...well, then you're probably not watching this movie anyway. Knute Rockne All American is an inspiring, uplifting, emotional film. Perhaps a tad overly sentimental but that's not such a bad thing. It's a very enjoyable film, one well worth taking the time to see.","This was not a particularly good film, but as a football fan I found it had something to offer. I'm also a fan of older movies and often find myself in the position of defending these to the younger people who think they're silly. I'm afraid I was actually the one laughing here at some unintentionally humorous moments. Sorry Mr. O'Brien, but I don't really think the acting was all that good with most performances as wooden as I've seen. In fact, this being the first film I've seen with Ronald Reagan I was pretty impressed as I thought he was the best here although not really great. This was mostly just an interesting documentary style movie with tidbits of info that I wasn't aware of and as a look into the way things were over 60 years ago. The standout was the great football footage- what a blast! As a result, if you're not into the game you'd probably either fall asleep 15 minutes in or just laugh yourself silly.","Pat O'Brien portrays Knute Rockne, the All-American Notre Dame football coach. No doubt, this film will be considerably more appealing to those interested in some aspect of \"Knute Rockne All-American Notre Dame Football\" - probably, it's most interesting to serious followers of football and/or Notre Dame football. You will see some good documentary-style film footage.Otherwise, it's difficult to recommend this as a FILM. It's not much more than an historical document. You'll \"know\" the end is near when Gale Page gets a chill - and, don't blink or you'll miss Ronald Reagan doing, of all things, \"Camille\"! *** Knute Rockne - All-American (10/4/40) Lloyd Bacon ~ Pat O'Brien, Gale Page, Ronald Reagan","Well, I'll say this for it. It zips by quickly, maybe forward pass by forward pass.Pat O'Brien is Knute Rockne, a teacher who was so good at football that he was made Notre Dame's full-time coach. He invented a new move, called \"the shift\", while watching some girlie dancers in Chicago, according to this story. He invented the forward pass -- or revitalized it, I forget. He coached some of the most famous football players of all time at Notre Dame and turned the team into \"The Fighting Irish.\" (Note: Knute Rockne, named after a Viking Prince of Denmark of Danish and Polish descent, led the fighting Irish to victory.) Pat O'Brien gives it all he's got. He delivers his lines with such celerity that it struck me with awe. I tried to duplicate the tempo of his utterances but it was physically impossible, even after three or four tries at the same line of dialog. His tone is that of a stern but fair Drill Instructor. When he is called before a board or a commission of some sort -- it's not clear why -- he has to describe his philosophy about football. He thinks it's essential to the human spirit. In effect he restates William James' idea that it's \"the moral equivalent of war.\" Since human nature itself is so combative -- and I can't disagree with him there -- why not let them take it out on the football field? Notre Dame is also interested, though, in shifting its emphasis away from a violent sport like football to something more refined, like hockey. PSHAW, retorts Rockne. He claims that he's opposed to it because \"I never trust a sport that puts a club in the hands of an Irishman.\" But the fact is, judging from his other comments, that he thinks any team sport other than football is for fairies.Ronald Reagan is George Gipp, one of Rockne's early stars of the gridiron. Reagan comes, displays a shy talent for playing the game, and quickly disappears because of one of those nameless diseases. O'Brien himself grows older and suffers from phlebitis but nothing is going to keep this man down. He has himself wheeled out to games against doctor's orders and if he sees a Medico approaching he scurries away.The clichés are lined up and shot down sequentially like the ducks in a very slow-moving shooting gallery. There's a certain reassuring quality in knowing precisely what's going to happen from one moment to the next in a movie you've never seen before. It's like going to a ritual service -- a mass in church or a funeral rite -- in which everything is properly laid out and organized. Comforting, you know. It's appropriate that the setting for this movie should be a famous Catholic university, even if it's not a Jesuit school.It's satisfying, too, to know that today and forever, Knute Rockne is up there coaching that Big Team upstairs."],"review-user":["cariart","ccthemovieman-1","whpratt1","michaelRokeefe","jotix100","DARTHKOOL","edwagreen","bkoganbing","redryan64","romanorum1","DavidAllenUSA","harbormoon","tadpole-596-918256","gavin6942","johnmartindj","Michael_Elliott","hall895","Stu-42","wes-connors","rmax304823"],"review-date":["28 February 2004","16 September 2006","11 October 2007","3 February 2001","28 July 2005","30 August 2002","15 May 2006","8 October 2007","1 July 2007","24 November 2010","2 November 2010","29 June 2003","3 February 2013","10 February 2017","14 September 2014","15 December 2013","27 September 2006","21 November 2002","24 August 2007","24 January 2011"],"review-rating":["10","7","6","8","10","10","9","10","9","8","9","7","5","7","5","3","3"],"review-title":[" Affectionate, Winning Football Bio...\n"," An Emotional, Really Nice Sports Film\n"," Pat O'Brien was Outstanding\n"," A must see for any football fan.\n"," The fighting Irish\n"," Greatest Football movie ever...\n"," An American for All Ages-Knute Shines ****\n"," Strategy As Well As Brawn\n"," From Norway, To Chicago, To South Bend and Immortality!\n"," The Story of a Famous Football Coach\n"," Knute Rockne movie more than a showcase for Ronald Reagan and a fun football movie\n"," It's No Pride of the Yankees...\n"," Pat O'Brien should have been elected president . . .\n"," Straightforward Biopic\n"," There's a reason you only know one line from this movie\n"," O'Brien Steals the Film\n"," Wake up the echoes. And win one for the Gipper.\n"," Interesting only for football fans\n"," The Big Chill\n"," Okay, Boys. Hit 'Em With Every Cliché You've Got.\n"]}