{"review-url":["http://www.imdb.com/title/tt0095357/reviews"],"review-text":["That quote is from P.J. O'Rourke's guide to hosting a party in his classic work, \"The Bachelor's Home Companion\". To me, it pretty much sums up the appeal (what there is of it) of this film. Or to put it another way, in his effort to construct a \"screwball comedy\", Bogdonovich kept throwing things at the wall in the hopes that some of them would stick.Fortunately, some things do. Nothing about \"Illegally Yours\" is particularly inspired (in fact most of it is strained and contrived), and no one in it is particularly great at comedy...the best most of the actors can muster is a kind of wide-eyed incredulity. But the plot throws so many twists and turns at the viewer, and there are so many rapid-fire \"bon-mots\" and quirky lines and bad puns that eventually the movie reduced me to a state of mild bemusement...and after the movie had been hitting me over the head with \"funny funny funny\" for 40-50 minutes. I gave in and actually snorted with laughter once and chuckled a couple of other times. I even guffawed once. Just once, but that's still better than anything Ben Stiller has been able to do since \"Mystery Men\". I think it was easier for American filmmakers impress American audiences with screwball humor before Monty Python,Red Green,\"Black Adder\",\"Fawlty Towers\" and similar imports caught on here. In comparison to Pythonesque and Newhartesque whimsy and wordplay, this movie's script is a bit stodgy and leaden. But it's still mildly funny even today, and none of the players (even Rob Lowe, who I've never liked) have anything to be ashamed of here. Do not skip your fiftieth viewing of \"Monty Python and the Holy Grail\" to see \"Illegally Yours\", but if IY is on opposite something dull and unfunny like \"Gone Fishing\", you may want to check it out.","When Rob Lowe decided to wear his glasses for real in this film (in real life he's quite nearsighted) I think it was his and director Peter Bogdanovich's homage to Cary Grant in Bringing Up Baby. Would that Bogdanovich had as good material as Howard Hawks had with Grant and Katharine Hepburn.Rob's a near do well here, living at home with mother Jessica James and brother Ira Heiden and sometimes whomever mom's current boyfriend is, in this case it's Harry Carey, Jr. in one of his very few roles not in a western. Rob gets a jury duty notice and like most of us, he considers it one royal pain. But when he's chosen for the jury trial of Colleen Camp it's an opportunity he's been waiting for since grade school. Back in those childhood years he was crushing out on Camp big time and now she's on trial for attempted murder.I wrote a review for 12 Angry Men in which I said the film was flawed because of what Henry Fonda did, going to the accused's neighborhood and buying a switchblade similar to the murder weapon. That was absolutely nothing compared to what Lowe does while he's not deliberating on the evidence to prove the object of his affection is innocent.The film has its moments, but I'd have to say it was more silly than funny. Colleen Camp is not quite Katharine Hepburn, though Lowe does give a good try at a Cary Grant type comedy part.Still fans of Rob Lowe will like it.","This is one of the funniest movies I have ever seen.  This, in my opinion, is Rob Lowe at his best.  I'm not quite sure why this film has gotten such a low rating.  I guess you either love it or hate it, but if nothing else, it is definitely worth a rental.","I swear if I did ever tried cocaine I'd be able to relate to this film perfectly. Its pace, as well as the dialog, churns out at speeds that some viewers might need to stop and relax their heads.There are great little elements that pop up through out the film, like how Rob Lowe's character seems to always be loosing a shoe, or how some characters keep running spirals around his zigzagged path. The story was put together extremely well and the direction seems flawless.The movie reeks of clumsy and cuteness. This is one I think most could enjoy. A few laugh-out-loud-even-if-you-are-alone moments ensure that I'll certainly be watching this again.","This one is a hilarious diamond in the rough. The acting and plot aren't that impressive, but the lines just keep on coming. This catches a lot of flack because it seems at first glance like, well, a bad movie, but it's so kooky that you can't help but be amused. The spastic lightening quick dialog and quirky characters keep it going... I was especially fond of Sharon, the Canuck on Shrooms eh? However, the one that really stole the show was Richard's little brother Andrew (Ira Heiden), his high pitched whining was somehow endearing. The whole movie rocked.","While this movie may not be a show-stopping classic, it is funny and has an entertaining plot. Rob Lowe does seem somewhat out of his element here, though he does a good job with what has been given to him. Colleen Camp fans will love this movie, as she is as attractive as ever and we get to see her in a rare leading role. Some silly moments, but overall not a bad film. Some good footage of historic St Augustine as well.","This is a good movie with plenty of comedy and action. Yes Colleen Camp is fun and funny and so is Rob Lowe. The Canuck is another entertaining gem. There are a few illogical twists toward the end but otherwise it is a wonderful movie. Anyone that loves Colleen Camp will love the movie.","Director Peter Bogdanovich seemed to have it all at one point early in his career, but I can't imagine a worse string of pictures than \"At Long Last Love\", \"Nickelodeon\", \"Daisy Miller\" and \"Texasville\", not to mention this one, a dud meant for theaters but relegated to dusty bins at the video store. Rob Lowe, outfitted to look like either Cary Grant or perhaps egomaniac Bogdanovich, stumbles around as a juror smitten with murder-suspect Colleen Camp. Camp, as proved in \"They All Laughed\" (a Bogdanovich bright spot), has the knack for screwball antics, but her character here is too brash and she fails to click with Lowe, whose bumbling is forced--to say the least. The convoluted plot hangs together by a thread, not helped by a bunch of \"lovable\" dopes in the supporting cast (including future Mrs. Bogdanovich, L.B. Straten). Cheeky, yes. Successful, no. *1/2 from ****","Seriously, I can't imagine how anyone could find a single flattering thing to say about this movie, much less find it in themselves to write the glowing compliments contained in this comment section. How many methamphetamines was Bogdonovitch on during the filming of this movie? Was he giving a bonus to the actor that spat his lines out with the most speed and least inflection or thought? The dialogue is bad, the plot atrocious, even for a \"screwball\" comedy, and claims that the movie is an homage to classic film comedy is about the most inane thing I've ever heard. The cinematography is below the quality and innovation of that exhibited by the worst made-for-TV movies, the acting is awful (although I get the feeling that the fault for that lies squarely in the lap of the director), and speaking of which, did I mention the direction is so haphazard and inscrutable that it defies the definition of the word? The whole thing is a terribly unfunny (even in the much-beleaguered world of so-bad-it's-funny clunkers), soul-sucking, waste of two hours of your life that you'll never get back. Be afraid, be very afraid...","One of the great pleasures of the movie business is finding a forgotten treasure that you had forgotten about or didn't know existed.  This picture is just wonderful and is an excellent addition to the Bogdanovich oeuvre. Which brings up the question - where is he and why isn't he working? The Johnny Cash songs were just terrific as well.","During the 1980s there were a whole series of movies that do not seem to have generated a great amount of publicity but were very entertaining, enjoyable, underrated and are presently of great nostalgic value. `Illegally Yours' definitely falls within this category.Rob Lowe provides an excellent performance as the somewhat eccentric but nevertheless very amusing Richard Dice. The whole of the cast follows this high standard and quality of acting and their combined performances contribute a dimension of entertainment and enjoyment to this movie. The script is also quite interesting for a considerable period of time and the style and the format of this movie  also enhances this quality. I would definitely rate this movie highly and provide it with a 9/10","The 80s was Rob Lowe's decade; member of the Brat Pack, and the golden boy of cinema. Whilst usually cast just as the pretty boy, a sex-toy, Illegally Yours cast him as the silly, love-sick goof, who bumbles his way through a far-fetched silly murder cover-up from the point of view of a juror who was in love the suspect at junior school. The film is wall-to-wall one-liners, funny slapstick, slips and trips and Lowe falling over a lot. I've watched it a lot of times and it still makes me giggle, and there are lots of comedy set pieces; Lowe dressed as a woman in high heel slippers, the fantastic sunglasses disguise scene, his nervy rushing around, the crazy car chases and daft over-acting. It's not a film to take seriously, it's meant to be loopy and flying all over the place and I love it. It's not a 6/10 film as in superb cinematography but it's just a hoot. Every character is overblown, Colleen Camp and all the ensemble case are a caricature, funny, and I just love this film. It's one of my favourite comedies and they don't make them like this anymore – it's not rude, no bad language and really quite innocent. Turn back time and enjoy.","I don't understand the hating on this movie. What I want from my comedies is that they are funny and feel at least slightly original, and this (to my great surprise) delivered in spades, which is more than can be said for most movies that call themselves comedies. The silliness never let up, the pacing never flagged. If you like the ridiculousness of movies like _The Man With One Red Shoe_ or _The Man Who Knew Too Little_, movies that are just a sequence of one insane coincidence after another, I think you'll like this.If your primary complaint about _Ron Burgundy_ was that it didn't explore the consolidation of the media business by corporations in enough detail, or that _The Hangover_ didn't pay enough attention to the harrowing effects of alcoholism on families around the world, well, then maybe this is not the movie for you.","Often referred to as a third-rate 'They All Laughed' (a Bogdanovich film from 1981) this film focuses on Rob Lowe a 'hopeless Romeo' who, as luck would have it is a juror on a case where his first love (when he was 6) is now being tried for murder. Most of the film is taken up by him following her while hiding behind newspapers, sunglasses and even a very bad attempt at drag. Lowe is blatently mis-cast as 'our hero' as he dons a ridiculous pair of eye-glasses (reminiscent of other Bogdanovich klutzes Ryan O'Neal in Whats Up Doc and John Ritter in They All Laughed). However, the rest of the cast is excellent in the rip-fire dialog. Jessica James is sassy as Lowe's disappointed mother and Colleen Camp, as ever, is a delight to watch as the daffy murder suspect. Unfortunately this has been Colleen Camp's last attempt in a lead role to date and one hope's that director Bogdanovich will find another vehicle for her underatted talent (he used her to great affect in 'They All Laughed' 1981). This film is much better viewed the second time around and hopefully will gain a cult audience in years to come. To be watched by Camp fans only. ****1/2 stars.","\"Those whom the gods would destroy, they first make successful in show business.\" Such are the words of legendary Hollywood producer, David Brown, taken from an excerpt in The Friedkin Connection, an autobiography from William Friedkin, one of the shining stars of the New Hollywood generation. Much has been made of the glory days of the 70s, and the films made at that time; more has been said on how Lucas and Spielberg single-handedly destroyed those glory years with their own prodigious and prototypical blockbuster films. After the 70s, many of the New Hollywood boys struggled in their careers. Friedkin was one such victim. Coppola's career never recovered. Peckinpah and Ashby's careers (and lives) ended with the death of New Hollywood. Yet no single career from this group took on the dramatic highs and lows akin to that of Peter Bogdanovich. After an impressive career as a historian and writer of the great Hollywood masters (Ford, Welles, Hawks, etc) Peter went on to direct his own films, seen through the eyes of the critics as homages to the great masters he so revered. After a string of big hits, Bogdanovich experienced a string of maligned works (Nickelodeon, At Long Last Love), which permanently damaged his career, to say nothing of his personal relationships at the time.Yet time has been kind to these films. A restored cut of both Nickelodeon and At Long Last Love have since been released, and the films have experience a kind of critical renaissance. The same would occur for his highly personal 80s film Mask. Despite all this newfound success, there are still two films of his post-Paper Moon films that have yet to receive such treatment: Illegally Yours and Texasville.For now, let us discuss Illegally Yours, a film which I had no hopes of enjoying going into it. Just about everyone, even the director himself, have spoken solely ill-words toward this film (Bogdanovich has been on record as saying that this is his worst film). So imagine my surprise when I began watching this film and found myself enjoying it. Rob Lowe is a revelation in this film. Though he would go on to show his great comedic chops in other films and television shows (most notably Parks and Recreation), it feels revelatory in this film. Make no mistake, this is a screwball comedy of the highest order. The movie begins in a kind of movie of the week way, with Rob Lowe narrating to the audience what the set-up for the film is, which might be the worst part of the film. On the other hand, it helps to set up the comically convoluted plot, so perhaps it works as best as it could. Not enough can be said of Bogdanovich's composition, which is precise to the point of mathematics. Not a frame is wasted, and every shot is always an opportunity to set up the next bit of information. Only Jackie Chan's editing is more precise, and that's saying something. I can understand how some people might be turned off by the material. The screwball comedy has really been in favor since the 1940s (though I'll still take the worst of Hollywood screwballs over what's passed for comedy nowadays), and the film wears its charm on its sleeve. That being said, in the words of Lars Von Trier \"it works only as much as you want it to work.\" This is the attitude I'd recommend bringing to this film. Come in with an open mind, and you may find yourself enjoying it as much as I did. Bogdanovich has previously stated that test screenings proved the film to be a great success, yet Dino DeLaurentiis (the film's producer) took it upon himself to recut the film in the version that is available today, which bombed hard at the box office. Peter blames this cut for ruining the film, a fate that befell the previously mentioned films. Yet time has proved those films to be enduring works, and this film is no exception. The fact that I enjoyed it so much only makes me wonder how much better the preview cut could have been. Either it's just as good as this version (unlikely), or it may have been a comedic masterpiece. The chance for the latter only has me convinced that this movie deserves a reappraisal, and hopefully a director's cut. Until then, I am satisfied that this movie exists at all, as it is a clearly underrated gem from Bogdanovich's catalogue. Recommended for anyone who's looking to unwind and watch an unpretentious comedic romp. Especially appropriate around winter time, given the films Christmas setting. At long last... I can say without a doubt I love this movie.","This tight, consistent, clever script acted by the excellent Rob Lowe and the voluptuous Colleen Camp should have resulted in a 1980s WHAT'S UP DOC? Sadly, Lowe is no Ryan O'Neal, and Colleen Camp, while lovely to look at, shows why she typically plays the Friend and not the Leading Lady in her many films. Still, good direction could have saved the day, but Bogdanovich is no less miscast than his actors. The sense of comedic timing, so crucial to this or any type of comedy, is sorely lacking here. Possibly the lion's share of the blame should lie with the film editor, but the director is ultimately responsible for the failure of this film.On the other hand, Colleen Camp gets more screen time in ILLEGALLY YOURS than in any film I can remember, so fans wishing to see more of her will want to view this flick. Rob Lowe fans, on the other hand, will find it more profitable to spend their time on his other, much better performances.","Seriously somewhere along the way someone equated amount of dialog with snappy or witty dialog. It is not, it turns out to be just painful dialog, with no rest for the ears. Yes the acting is painful, but sometimes that can be funny in a weird sort of way. Yes the plot is beyond stupid, but this is to expected in a \"screwball\" comedy. The dialog sets a low below the other factors by about a factor of 10. Avoid this at all costs.","This film is a forgotten classic that is better than most of the movies made today. The story involves Rob Lowe as a guy called for jury duty and he finds that the defendant accused of attempted murder is his first love - Colleen Camp - from first grade. The story itself is nothing exceptional, but the writing is excellent and highly original. Interestingly, this film also demonstrates the comedic acting ability of Rob Lowe - which is very good; by extension, Rob Lowe is a very good actor generally, as comedic acting is the most difficult to master. This film has excellent acting throughout, and the story and some of the settings keep you attracted to the movie from beginning to end, unlike many of the insipid movies of today that rely almost solely on stories revolving around immorality and obnoxious acting (Will Ferrell, for example). Colleen Camp, Rob Lowe, and Kim Myers are great in this movie and their acting styles keep you glued to the story. Oh, and yes, this one is a must-see for Colleen Camp fans.","Lowe returns to the nest after, yet another, failed relationship, to find he's been assigned to jury duty. It's in the plans to, somehow, get out of it, when he realizes the defendant is the girl he's had a serious crush on since the first grade.Through living in the past by telling other people about his feelings towards this girl (played by Camp), Lowe remembers those feelings and does everything in his power to clear Camp of attempted murder, while staying away from the real bad guys at the same time, and succeeding in creating a successful film at the same time.I've heard that St Augustine is the oldest city in the US, and I also know it has some ties to Ponce de Leon, so the backdrop is a good place to start. Unfortunately, it's the only thing good about this movie. The local police are inept, the judge is an idiot, and the defense counsel does everything in her power to make herself look like Joanie Cunningham! I don't know whether to blame the director for poor direction, or for just letting the cast put in such a hapless effort.In short, this movie was so boring, I could not even sleep through it! 1 out of 10 stars!"],"review-user":["lemon_magic","bkoganbing","TSHunter","Exit_of_99c_Special","Jodie-4","Hessian499","Sam-285","moonspinner55","Wendylady","jackfrost-1","president242003","HelenMary","name99-92-545389","InMyTribe","lonestormtrooper","Uthman","mak52","flyjeffersonairplane","moviedude1"],"review-date":["22 October 2005","6 May 2009","6 January 2002","16 August 2005","28 December 1998","19 January 2002","10 October 2002","24 November 2002","17 November 2006","15 February 2003","20 January 2003","28 November 2015","2 May 2013","20 October 2001","11 October 2017","20 March 2001","26 January 2004","16 December 2005","22 November 2008"],"review-rating":["5","5","8","8","3","1","5","7","10","8","4","1","9","1"],"review-title":[" \"If you keep people busy and confused, they're likely to think they are having fun...\"\n"," What I Did For Love\n"," Hilarious!\n"," Campy Fun at a Fast Pace\n"," I laughed the whole way through...\n"," No classic but fun anyway\n"," Plenty of comedy and action\n"," Like, it's a bad movie, eh?\n"," What the hell?\n"," A very funny treasure\n"," Wonderful movie from the 1980s\n"," Silly slapstick crazy 80s comedy\n"," It's a comedy that's funny...\n"," Second Time Around.\n"," Another Misunderstood Bogdanovich classic\n"," A textbook on poor direction and miscasting\n"," The writers should have been paid by the word.\n"," A classic comedy that \"pays homage to the screwball comedies of the '30s and '40s\".\n"," Better have 100 minutes to kill, 'cuz this one's definitely a bomb!\n"]}