{"review-url":["http://www.imdb.com/title/tt0052529/reviews"],"review-text":["I must admit that this is one of the few Lou Costello films that I actually saw in the theater. Most have now been seen on T.V. and I must admit that Lou is really enjoyable and he gets the girl,too. This was my first time seeing Dorothy Provine perform and of course I fell in love with her like so many others that day. I have seen most of the work she has done and enjoyed each one. Her performance in The Great Race is one of the reasons I bought the disc in the first place!Every comment on this movie tells that this is the one movie that Lou Costello did with out Bud Abbott,which is true,but if Lou had lived he would have made many more. He really does a good job and doesn't have to rely on his old routines to get laughs. I for one am sorry that the little man from Patterson,N.J. didn't get the chance to do that.I hope this comes out on DVD some time so I can add it to my comedy/sci fi collection.","Well I just happened across this movie on AMC tonight, and all I can say is it's too bad Lou Costello went from being the better half of a comic duo to this unfunny movie. This was released shortly after his death in 1959 and you could tell by his appearance here that he did not look well. Whoever produced this movie thought it would be a good idea to combine science fiction which was quite popular at this time with a comic overtone. Lou Costello plays a trash collector/inventor who must defend his 30 foot wife from the army. (No spoilers!) Ten years earlier he would have screamed \"Aaabbotttt!!!\" if he saw a giant woman. But those days were gone. The jokes in this movie might have been funny for their time, but I've seen the jokes here used countless times already in other films. In a scale of 1 to 10, all I can give it is a 5.","After \"Attack of the Fifty Foot Woman\" with Alison Hayes opened the doors for women to be just as dangerous as men, there was obviously an open market for other movies to pick up and carry the torch and what more a lovely actress than Dorothy Provine from \"It's A Mad, Mad, Mad, Mad World\" to play the role. The downsize is that cute and blonde Provine may just be too sweet and innocent looking to step into Allison Hayes' size 50 shoes. This role really needed someone with an amount of smoldering sex appeal; Provine is more the girl next door type. She may have taken and done this role to prove she could be sexy, but the material lets her down. Lou Costello, however, proves he can do a movie without Bud Abbott feeding him lines and he even interjects a dramatic role in some of his scenes when he not turning to Gale Gordon as his front man for gags. Gordon, however, establishes that all he can be is blustery, perturbed and pushy, much the same character he creates later on \"The Lucy Show.\" Charles Lane also plays the same role in everything he does: a straight man, and his screen time is limited. The special effects are convincing for the time, but I would have liked Dorothy to have been a little more than cheesecake and dressing and at least have been allowed to become dangerous. As the movie's lead character, she takes second billing to Costello who is in all of the movie with Dorothy several times vanishing like a sub-plot. The whole movie put together just can't decide if it's supposed to be science fiction, a comedy or just a parody of the Allison Hayes classic. There's a lot of good scenes, some very funny humor and some very ridiculous camp that affects the rest of the film. Still, I do like this movie for it's empowerment of women; there's not enough movies out there like this one. If this movie had a chance to be remade today, I'd highly recommend Courtney Cox and Jason Alexander in the lead roles and allow me to completely re-write the original script. Courtney tops my lists of actresses who I believe could and should adequately play gorgeous giantesses; although, I have to admit that if either of the titanic beauties Allison or Dorothy came after me, I'd go quietly !!","THE 30 FOOT BRIDE OF CANDY ROCK (1959) ** Lou Costello, Dorothy Provine, Gale Gordon.  Costello's only film without partner Bud Abbott and sadly his final one (he died before the film was released) casts him in this fantasy comedy as hapless rubbish collector and amateur inventor Artie Pinsetter (great name),  in love with the lovely niece of disgruntled politico Gordon, who unwittingly turns her into a giantess (!)  Oh the possibilities... but the film falters with some cheap special effects and lame plot, but Provine is a sight in a parachute-inspired tunic! Va-va-va-VOOM!  HEY ABBOTT!! Begging for a remake, say with Jason Alexander and Gina Gershon/Famke Janssen/Sela Ward or Selma Blair?  Or for the Gen.Y say Britney Spears and Seth Green? Hey Now!!    Just a thought.","Lou Costello (sans Abbott) plays a small town self-employed \"rubbish collector\" (and the inventor of a time-controlling machine!) who is secretly courting the niece of the town big-shot. After a spat, Lou's girl (Dorothy Provine) runs into a misty cave--why it's misty we never learn--and emerges as a 30 foot giant. Provine is certainly a good sport, and she doesn't bother trying not to look ridiculous (it would've been impossible anyway), yet the screenwriter is really cruel to this character, turning her not only into a giant but a nagging harpy as well. Provine bosses Costello around while creating havoc with the Army troops who get called in, but nothing funny is done with the transformation. Trumped by \"Attack of the 50 Ft. Woman\" the previous year, the film does feature Lou Costello in his final bow, but provides little else. The special effects are marginal, while the script needed funnier lines and the direction snappier pacing. *1/2 from ****","30 Foot Bride of Candy Rock, The (1959) * 1/2 (out of 4) A historically important film for all the wrong reasons this one is. This sad feature was released five months after the death of its star Lou Costello but it's also best remembered today for it being his sole feature without Bud Abbott. In the film, Costello plays Artie Pinsetter, a simple man who is in love with a town beauty (Dorothy Provine) but the two have to keep their relationship quiet because of her jerk uncle (Gale Gordon) who pretty much owns the entire city. Their secret is revealed once Artie's new wife enters a cave and grows to 30-feet tale. THE 30 FOOT BRIDE OF CANDY ROCK is a very sad film to watch but there's a point near the middle where a character states that he's against laughter and that he doesn't do it. Perhaps he was talking about his feelings towards the movie itself because there are very few laughs here and all the cliché comedy bits are just downright pathetic. Costello was a masterful comic and there's no question that he and Abbott were among the greatest comedy duos in history. It's also well known that his personal life was falling apart during this period and you can just look at him and see that he's really not himself. His eyes look shot throughout the picture and there's simply none of that child-like passion and fire that we all know him for. Even worse is that he's pretty much a supporting character. The first fifteen-minutes get off to a horrible start because there's a subplot with the uncle running for Governor and we get an extremely long sequence where the uncle abuses Costello except when a reporter is around then he treats him good. This \"abuse\" was clearly meant to replace Abbott but it fails. The entire comedy structure around this is just embarrassing to watch and the bad dialogue doesn't help matters. It's also hard to watch this film and not think of ATTACK OF THE 50 FT. WOMAN, which was released a year earlier. This film here has none of that campy charm and whereas that other film is \"so bad it's good,\" this one here just comes across weak, unfunny and the boring. Heck, the screenplay doesn't even try to explain why the woman ends up growing. There are also other errors including the fact that she's supposed to be 30-feet tall yet she comfortably fits in a two story barn. The special effects are all rather obvious and especially during the scenes where Costello is talking to his bride yet looking in the wrong direction. Some fans debate whether or not this movie would have been better had Abbott been in the uncle role and I think the answer is no. The story is just too weak where no one could have saved it and it's a sad reminder of being Costello's last and only solo role.","Women were standing tall in the late 1950's, at least two of them that is. There was Allison Hayes' vindictive 50' woman, and now there's the put-upon dumbbell Dorothy Provine, who at 30' decides that no man other than Lou Costello would want her. Even though he's the local trash man, he has a gift for science, fiction that is, and thanks to his wacky invention, she grows to enormous proportions, gaining the confidence to stand up to her pompous uncle (Gale Gordon) and any woman who threatens to come between her and that he-man (Bud). Of course, the military becomes involved at reports of the sighting of some monster from outer space (not helped by the frisbee she creates out of a water tower lid) and soon, both Dorothy and Lou are being targeted by missiles. Thanks to Lou's wacky machine, he ends up going back in time, eventually being conked on the noggin with pre-historic rocks before the machine gets it right and has him back in the present day almost out of danger.This is juvenile comedy with Lou in his last film, working at Columbia where the Three Stooges were still present making silly features of a similar nature. Unlike Stan Laurel, Lou hadn't aged to looking way beyond his years or out of place doing slapstick, but it's still sad to see him without his straight man, Bud Abbott. Provine is appropriate eye candy, and when she stands on top of a building laughing at the townspeople who either hated her for being too cutesy or simply for being the obnoxious Gale Gordon's niece, or were simply in lust with her, she adds a lot of presence, and more than just in her height. She's not the vindictive wife of \"Attack of the 50' Woman\" so she's much more appropriate for children to see, even though it's obvious that this was a lampoon of that cult classic.Gordon, not yet the imperious Mr. Mooney or Mr. Carter of the Lucille Ball sitcoms, was famous already for playing the no-nonsense principal Mr. Conklin on \"Our Miss Brooks\", and here, he goes from education to political wanna-be with great ease. He's a buffoon, and one of those types you can't wait to see being taken down a peg. Ironically, Charles Lane, who employed that dizzy redhead on \"The Lucy Show\" before Gordon did, is also present, playing the head of the town's welfare bureau. The special effects are pretty laughable, but there are many amusements throughout, whether it be Lou's travel through various periods of time or the final hysterical shot which left room open for a sequel which never came. Not a sad finale to Lou's career, it's still not up there with his earlier classics, but is basically harmless fluff that puts a smile on the viewer, if not a few eye rolls here and there as well.","The 30 Foot Bride Of Candy Rock marked a sad end to the career of one of the great film comedians of all time. Saddest of all is that work on this film compromised Lou Costello's health and eventually might have taken his life.Costello was 52 years old when he made this film and looked every bit of it, especially opposite Dorothy Provine. He also looked strained in his performance as well. But he did want to prove that he could succeed as a solo comic act without Abbott.Lou is a garbage collector and part time eccentric inventor and Provine's uncle Gale Gordon does not consider him an appropriate suitor for the hand of his niece. On a trip through Dinosaur Canyon National Park, Provine takes in some of the exotic waters and finds herself growing to the height mentioned in the title. Complications ensue, especially after Gordon insists on them being married without knowing the full extent of what's happened to his niece.I think Lou would have been better off if he had chosen a property that would have allowed him to play someone closer to his actual age, a father figure of some kind. His scenes with Provine just don't gel.In addition to this being the last film of Lou Costello this was also the final big screen appearance of character actor Jimmy Conlin, playing the Justice Of The Peace who marries the mismatched couple. Conlin was a member in good standing of the Preston Sturges stock company, you'll find him in many of his films.Not a good film to go out on for Lou Costello.","\"May contain spoilers\" Sadly Lou Costellos' last film has the distinction of being slightly better than Abbott & Costello's last movie together \"Dance With Me Henry\". This movie isn't all in all outright terrible it is an amusing career misfire. Dorothy Provine is nice to look at and makes the movie somewhat bearable. You can't blame Lou Costello for this because a major studio released it which meant somebody had to give it the \"green\" light. In my opinion Lou Costello was getting over problems of his own losing his son a few years earlier and the unwarranted attacks from the IRS. If you look at the last 3-4 Abbott & Costello movies you can notice the magic was gone. Check out \"Dance With Me Henry\" now that's a painful movie to watch.","Well, maybe not, but it's still fun to watch.  I think they got many of the visual ideas for that Neil Finn video from this movie.  It's Lou Costello's last acting role; he's an inventor whose only supporter is his girlfriend (played by Dorothy Provine).  They go on a date to a remote gorge, she breathes in fumes wafting out from underground, and grows... and GROWS!Costello rushes back to town to ask her uncle (played by Gale Gordon) for help; when he tells Gordon \"Oh, she's big... she's really BIG... you've gotta help us!\" Gordon gets the wrong idea, forces Costello to marry her... THEN he finds out what \"big\" meant when he comes to visit.  Costello spends most of the movie using his inventions to try to restore Provine to normal.It's a good light sci-fi comedy; Provine plays a gentle (if reluctant) giantess, and she also looks cute in a sheet.","It sounds as though \"The 30 Foot Bride of Candy Rock\" had kind of a bad reputation simply because Lou Costello was acting without Bud Abbott. Maybe so, but I think that the movie merits a lot of discussion about its era. The relationships between the sexes is obviously very dated. As it happens, one of the jokes centers around the fact that people weren't allowed to say pregnant on screen.Basically, the movie is an innocuously silly send-up of all the sci-fi flicks about people becoming giants. And besides, how can you not like the sight of Dorothy Provine wearing a parachute and looking like a vestal virgin in a sword-and-sandal epic? It's not anything special, but if the point is to entertain, then it succeeds.The sight of Dorothy Provine dressed like that is going to elate me for years to come.","Dorothy Provine does the opposite here: She keeps growing and growing. I didn't detect any subtext, though. \"The Incredible Shrinking Man\" and other movies of its ilk during the period were parables about radiation, nuclear war, and other horrors. Provine's growth is the result of an inept computer/robot.And who operates this computer but Lou Costello! I like some of his movies with Bud Abbott. But, though this is a pretty bad movie, he does fine without him. And Gale Green is an excellent foil.Green plays the pompous town big shot. He is Provine's father. He is intent on being elected Mayor. So when his beloved daughter starts having issues, he dumps her. He doesn't exactly dump her but gives up his battle against her longtime admirer Costello.This is pretty implausible: Costello is the local garbage collector.The special effects are minimal. And the subplot involving the military is lame in the extreme."],"review-user":["daverob1","littlenemo","aesgaard41","george.schmidt","moonspinner55","Michael_Elliott","mark.waltz","bkoganbing","savagerocks","wdv","lee_eisenberg","Handlinghandel"],"review-date":["24 April 2005","14 January 2000","11 November 2000","28 December 2001","6 January 2007","19 August 2011","5 May 2015","21 September 2010","5 September 2006","17 January 2000","15 January 2013","5 January 2007"],"review-rating":["9","5","7","4","4","3","4","6","3"],"review-title":[" Lou is really enjoyable and he gets the girl,too.\n"," Lou's last movie\n"," Would-Be Allison Hayes\n"," HEY ABBOTT!!!\n"," Filmed in Wonderama!\n"," Depressing \"Comedy\" That Never Works\n"," Comedy makes up for the shortage of the 20 feet.\n"," A Lotta Woman\n"," A Sad Farewell\n"," Attack of the Giant Laughs?\n"," Have you ever had a really big secret?\n"," Paging \"The Incredible Shrinking Man\"!\n"]}