{"review-url":["http://www.imdb.com/title/tt0029786/reviews"],"review-text":["Of all the major 30s star actresses, Miriam Hopkins ranks among the most bizarrely overlooked and underrated. Her string of excellent 30s and 40s films is quite impressive but she is often referred to as being stagy or brittle. Yet she had a great sense of humor and was memorable in several comedies, including this film, Old Acquaintance (with Bette Davis), and The Smiling Lieutenant (with Maurice Chevalier and Claudette Colbert). Hopkins was famous for her dislike of Hollywood, and the results has been a bad rep -- undeserved.In Wise Girl she play an heiress trying to rescue the children of her dead sister from their guardian -- the sister's brother-in-law (Ray Milland), an artist who works at odd jobs. The film offers several hilarious scene such as Hopkins taking a bath is a storeroom, Hopkins joining Milland and Guinn Williams in a Greenwich Village restaurant for $3 apiece to act as \"Bohemians,\" and Hopkins going ringside during one of Williams' fights. Milland is also excellent and very funny.Hopkins and Milland make a great couple. The film also boasts solid support from Williams, Walter Abel, Henry Stephenson, James Finlayson, Margaret Dumont, Grace Hayle, Leonid Kinskey, and Inez Palange. The two girls are OK.But Hopkins, drunk on a \"slice of wine\" and wearing a pinned-together dress that is twice her size is hilarious as she blows at stray hairs while smoking a cigarette with a long cigarette holder.... A scream.Hollywood's version of Greenwich Village is way off of course, but the courtyard complex Milland lives in, filled with artsy types, is quite impressive. Hopkins and Milland make a grand comedy team.","Society heiress Susan Fletcher (Hopkins) and her wealthy father Simon Fletcher (Henry Stephenson) are vexed that their young nieces Joan (Betty Philson) and Katie (Marianna Strelby) are living a Bohemian lifestyle in Greenwich Village with their artist uncle John (Milland) after the death of their parents (Susan's sister and John's brother). Simon has given up trying to convince John to allow he and Susan to take care of the children and have resorted to using private detectives to catch him in either unbecoming behavior or unemployed and therefore unable to care for the children properly. Susan finally decides to take matters into her own hands and goes to Greenwich Village herself, posing as an actress, to try to gain information and/or persuade him to see reason. What she discovers however, is that she not only likes the free and artistic lifestyle John and his friends are living and that the girls are being brought up well, but that she is quickly falling in love with John. Inevitably, her true identity is discovered and she is faced with the task of convincing everyone on both sides of the custody debate who should belong with whom.I really enjoyed this film, and found that its very short running time (70 minutes) was the perfect length to spin this simple but endearing story. Miriam Hopkins, one of the great 1930's-1940's actresses is delightful in this film. Her energy, style and wholesome beauty really lend themselves to creating an endearing character, even though you know that she's pulling a fast one on the people she quickly befriends. This is the earliest film I've seen Ray Milland in, and he was actually young and non-patrician looking. (And apparently three years younger than his co-star) His energy and carefree manner in \"Wise Girl\" were a refreshing change to the demeanor he affects in his usual, darker, films. Honestly, though I am usually not remotely a fan of child actors, I really enjoyed the two young girls who played Susan's nieces. They were endearingly precocious, and were really the jewels of the film. Unfortunately, I can't dig up any other films that either of them were subsequently in after this one, which is a shame since both exhibited a large amount of natural talent.\"Wise Girl\" was a film that was made three years after the Hollywood Code was instated, and to some extent, this was abundantly clear by the quick, happy ending, and the pie in the sky loftiness and ease with which the characters lived. The alleged Bohemian co-op was in fact a gorgeous cul-de-sac where the artists lived for free or for trade, and everything is tied up very nicely throughout. Fortunately, this was a light enough film and the characters were charming enough to make allowances for its fluffiness and short-comings and I was able to just take \"Wise Girl\" for what it was; a good old-fashioned love story that was as entertaining as it was endearing. Unfortunately, films of the romantic comedy/drama genre today are considerably less intelligent and entertaining, or I wouldn't find myself continuously returning to the classics. 7/10","Miriam Hopkins shines as Susan \"Susie\" Fletcher, the ever-resourceful, vivacious leading lady to whom this title alludes, and Leigh Jason directs this delightful Allan Scott - Charles Norman penned Comedy from RKO-Radio Pictures, which features Marianna Strelby and Betty Philson, each in her only screen appearance, as the children quickly becoming embroidered in a bitter custody batter between their wealthy maternal grandfather, Mr. Simon Fletcher (Henry Stephenson), and their free-spirited, impoverished Bohemian paternal uncle, John O'Halloran (Ray Milland).By morning light, Susan Fletcher returns in brilliant evening gown to her wealthy father's estate, in Fletcherville, New York, several miles north of Manhattan, from whence her Russian Prince trio of escorts, Prince Michael (Ivan Lebedeff), Prince Ivan (Rafael Storm) and Prince Leopold (Gregory Gaye), transport her, to discover 1st Detective (Richard Lane) and 2nd Detective's (Tom Kennedy) meeting Simon Fletcher, to announce that they've discovered his granddaughters abiding in Greenwich Village, after returning from Europe with their guardian uncle, John O'Halloran, who works three jobs to support them.But when Simon tells Susan that he cannot legally take custody of his late daughter's children because her late husband has entrusted their care to his brother, for as long as John can provide for them, Susan realizes an idea without a workable plan, to move into Greenwich Village under the guise of a poor but friendly stranger, to see what she can do to help her nieces.(It may seem uncanny that the brother-in-law wouldn't know the sister-in-law, nor the nieces their aunt nor grandfather, but Miriam Hopkins and company make this plot to work very well because who would know what to do next in a situation as difficult as this and still maintain light-hearted manners?) Anyway, Susan packs an overnight bag, and conceals nearly $100 in cash, but making believe that she's broke and malnourished, upon arriving in Manhattan, and into the pawn shoppe of Dermot O'Neil (Alec Craig), at which John O'Halloran bargains with Flute Seller (D'Arcy Corrigan), whom Susan champions to no avail. When Susan requests of Dermot free accommodations, she finally meets nieces Katie O'Halloran (Marianna Strelby) and Joan O'Halloran (Betty Philson), who suggest that she stay in the laundry room, offering a dough-nut, before John's disapproval of her smart attire and carefree attitude.John's friends, Karl Stevens (Walter Abel), a drunken artist once married to an heiress whom Susan knows, and Mike Malloy (Guinn \"Big Boy\" Williams), a fledgling boxer, befriend \"Susie\" after George (Jean De Briac) returns and freely enters her quarters while she bathes. Not taking lightly to this lack of privacy, Susan confronts John from within the laundry tubs, as he plasters the ceiling above her entranceway. But when John later discovers the money in Susie's purse, John suspects Susie of impersonating a poor person, but Susie finds out about it after hearing Katie and Joan's gossiping in French, a language which Susan understands and clears the mistrust among them.In addition to his position at Dermot O'Neil's, John paints signs for a department store, and seconds Mike Malloy as boxing manager. Dermot tells Susie that he cannot fire John from the pawn shoppe because John owes him too much back rent, so she inadvertently gets him fired from the department store, where she takes a job as an actress in the store window, as Actor in Department Store Window (Jack Rice) makes a play for her, and John sticks up in her defense, causing Jake Kelly, Department Store Bouncer (Frank Moran) to end his employ.At her Italian restaurant, Mama Guido (Mathilde Comont) hires John to paint a wall mural and Susie to add atmosphere, but when the three Russian Princes arrive, Susan must quickly think of a plan to send them off before they recognize her, once again, costing John his commission.In the boxing ring, Mike's Fight Opponent (Frank Hagney) begins to get the better of Mike Malloy, and the Fight Referee (Eddie Gribbon) names the winner of the match, but this, neither, helps John O'Halloran and his financial situation.Now, losing jobs left and right, Susie suggests that John enter a painting contest because of his talent for fine arts, but John tosses a knife at the want ads, to select a situation as a door-to-door vacuum cleaner salesman, during which time he demonstrates for \"Fat Mother with Baby Wilbur\" (Grace Hayle) until Baby Wilbur ends up missing somewhere in the apartment.By now, Mr. Simon Fletcher has John O'Halloran right where he wants him, and arranges for a custody hearing to claim Katie and Joan. Susan, beginning to change her tune about Katie and Joan's situation, pleads with Simon to give Susan a little more time to work things through, but the ball is set into motion for John, Katie and Joan to discover Susie's true identity.Mrs. Bell-Rivington (Margaret Dumont) testifies before Chief Judge at Custody Hearing (George Irving) of the improper conditions which John O'Halloran provides for the children, with Simon Fletcher and company on one side, and John O'Halloran and friends on the other. When Joan is asked to testify, Dr. Barry, Court Psychiatrist (Maurice Cass) claims that the children remain healthy in John's unconventional environment. So, it is up to Susan Fletcher to turn the tables one way or the other once she decides how the better interests of each party involved ought to be served.But when her plan to inspire John to paint for the magazine art contest seems to backfire, Susan enlists the assistance of Motorcycle Cop #1 (Edgar Dearing) and Motorcycle Cop #2 (Eddie Dunn) \"to do a little murder,\" to frame someone to serve jail time.Russell Hicks has a role as David Larrimore, the magazine editor, who may be able to provide a helpful solution to the situation at hand, with a little edging from that \"Wise Girl\" herself, Susan Fletcher.","Sometimes it's hard to define what separates a successful, delightful comedy from one that falls flat. In this case, the contrived plot about a spoiled rich girl who schemes to take her nieces away from the Greenwich Village 'bohemian' who is raising them, only to fall for him herself, is not promising. And nothing in director Leigh Jason's filmography suggests that he was an overlooked major talent. And yet he must have been responsible for creating a relaxed, happy atmosphere on the set that was faithfully recorded on film.He also had the good sense to cast this movie properly. The one small flaw is Miriam Hopkins in a part that Ginger Rogers would have been perfect for. Hopkins is efficient but brittle, lacking the warmth and sexiness Rogers would have had. She is further hampered by a pair of bizarrely long and sooty false eyelashes that are sometimes a distraction. But a very young and very handsome Ray Milland couldn't be better in an exuberant, uninhibited comic performance of great charm.And better than that, particularly for New York City residents, is the Hollywood depiction of Greenwich Village in 1937. Though completely synthetic and idealized, it remains recognizable to a contemporary viewer. Art director Van Nest Polglase created an amiable jumble of mews apartments and ramshackle shared backyards that is the perfect backdrop for this picture's collection of artists, strivers, smart-alecks and wannabes. Best in the supporting cast is Guinn Williams, bringing sweetness and light to his role as a prizefighter-sculptor-dressmaker, suggesting the self-invention and fluidity (sexual and otherwise) of life in the Village. Even more refreshing are Betty Philson and Marianna Strelby playing the little girls. Plain, intelligent and full of humor, these girls seem like real human beings and are nothing like the professional child actors of the time.Of special interest are a couple of memorable comic set-pieces: Ray Milland's vacuum cleaner demonstration to a woman with a howling baby is played with more spontaneity than one expects (the baby and his contortions are marvelous 'found' moments) and a phony domestic 'play' in a department store window that degenerates into a free-for-all is also fun. The movie slides slowly downhill with a straight-faced custody trial and then never quite gets back on track when the action moves to Long Island, but this movie is still worth a look.","Years later the plot device of a paternal uncle and maternal aunt in a custody battle was used in the Clark Gable/Sophia Loren classic, It Happened In Naples. Only in that it was Sophia who was the Bohemian and Clark the square. Wise Girl does not have the international setting or the color location cinematography of the later film, but Ray Milland and Miriam Hopkins do play a pair of spirited antagonists.Miriam's father Henry Stephenson who is rich enough to spoil Miriam had cut off her sister back when she married out of her class. Now with both his daughter and son-in-law dead he'd like custody of his two granddaughters. Miriam will be his accomplice in that endeavor.But the trick is to get them away from their uncle Ray Milland who has them. He's a struggling artist and he supports the girls with odd jobs here and there. Miriam moves into Greenwich Village incognito to be near them all and naturally as things go in these type films she falls for Milland.Looking at the set I can see where Alfred Hitchcock got the idea for his Greenwich Village set in Rear Window. And we meet a whole lot of colorful characters there and not just through a telescope. Milland's closest friends are prizefighter Guinn Williams and aspiring actor Walter Abel who has a bit of a thirst problem. Marianna Strelby and Kim Philson play the two young girls and Margaret Dumont has a great small part as the snooty woman running the Child Welfare League.Wise Girl may not show Miriam Hopkins at her wisest, but it's a great comedy in the screwball tradition of the Thirties. Best scene is the chaos she causes at one of Guinn Williams' prizefights. Milland has his moments as well, especially trying to unsuccessfully sell vacuum cleaners door to door. All in all a lot of laughs.","Witty, high-energy comedy with a script to die for.  You'll meet more memorable characters than you can possibly remember.  Ray Milland is a charming artist and free spirit who lives in Greenwich Village, taking care of his dead brother's two young daughters.  Their rich, beautiful, snobbish aunt (Mariam Hopkins) goes to the Village incognito to win the little girls' affection and steal them away from Milland so they can be raised by her rich daddy. The dialogue is incredibly good, the performances are Oscar-quality, and the plot is filled with more convolutions than Einstein's gray matter.  `Wise Girl' should be considered one of the great comedy classics of all time","The screwball comedy had been around for quite a while in one form or another when \"My Man Godfrey\" and \"Libeled Lady\" exploded on the screen in 1936 to push the genre forward. Comic scandals concerning the rich and infamous dominated the plots of these movies where zany society got slapped down a bit. Carole Lombard and Jean Harlow quickly became the prototype heroine for the off-kilter usually blonde bombshells who got taken down a peg or two as they dealt with a no-nonsense handsome hero who was funny in spite of their alleged serious natures. In this case, the blonde heroine is that early 1930's drama queen Miriam Hopkins, playing a snooty socialite aghast that her late sisters' children are being raised by a seemingly do-nothing Greenwich Village artist (Ray Milland). To discredit him, she moves into the same building, and finds out all sorts of ammunition in order to help her father (Henry Stephenson) win custody of them.Hopkins proves herself to be an able comic, especially when she finds her small apartment being invaded as she tries to take a bath. More and more people begin to barge into the one room apartment, and before you can say \"A Night at the Opera\", she finds herself surrounded. This is a Greenwich Village which sadly no longer exists (except perhaps in revivals of \"Wonderful Town\" and \"Auntie Mame\") and where else but mid 30's downtown would you find young children who knew how to take care of a drunk without any supervision? Everything is fine up to this point and it appears that Hopkins is lightening up her feelings towards Milland, even pretending to be trashy when old society friends recognize her in an Italian restaurant while slumming. But when the kids all of a sudden are taken away thanks to Hopkins' phone conversation with her father, she all of a sudden switches gears, claiming in court that Milland is totally unfit. This is done jarringly and without any clues as to why, and for the remainder of the film, she seems determined to be out to teach him a lesson yet make up to him for her betrayal.Still entertaining in spite of this sudden jerky change, \"Wise Girl\" isn't up there with the classics of the screwball genre and Hopkins seems determined without total success to emulate the classy screwball sophistication of Lombard, Jean Arthur and especially Constance Bennett whom she often reminded me of. She does seem to work well here with the cast and it is a far cry of her attempts to outshine Bette Davis in their two later films together, making her performance a lot more relaxed and less forced. Milland is a great sparring partner, and Walter Abel and Henry Stephenson also offer good support. The kids get some good Groucho lickings in at Margaret Dumont in the court scene where she asks them some truly stupid questions in order to test their intelligence. The wise girl(s) may not be the screwball heroine, but the two nieces who were lucky enough to be taken away from the stuffy Stephenson.","In some ways, \"Wise Girl\" is much like \"You Can't Take it With You\"- -the film that won the Oscar for Best Picture and Best Director just one year after \"Wise Girl\" debuted. However, despite its similarities (as both are about goofy rooming houses filled with weirdos), the film is inferior mostly because the film seems very forced--as if the director and actors act loudly in order to convey how wacky the film is supposed to be.When the film begins, you learn that the Fletchers are very rich and they are horrified that John O'Halloran (Ray Milland) is raising two little girls who belonged to the sister of Susan Fletcher (Miriam Hopkins). After all, John is poor and lives a crazy bohemian lifestyle in a strange boarding house...and he doesn't even send these two little girls to school! Susan decides to investigate all this undercover and befriends this odd family...and naturally John feels stabbed in the back when he later learns that she and her father are going to court to take the kids! However, inexplicably, Susan has fallen in love with John and also has determined to make a success of him whether he likes it or not!This film does have some cute moments though I had a hard time believing any of this and the film often got louder instead of more clever. Worth seeing but a pale imitation of the goofiness of \"You Can't Take it With You\".","Forced, cloying, formulaic. Do these adjectives make you want to run to rent his? Miriam Hopkins was brilliant in the original \"Dr. Jekyl and Mr. Hyde.\" A few other early movies of hers, notably \"The Story of Temple Drake,\" are never shown but said to be excellent.Here, she is cutesy, bossy, and thoroughly unappealing. Ray Milland as a Greeniwch Village bohemian not at all convincing.The two child performers are creepy and also bear no relation to the Village as it was then.Speaking as a native of Greenwich Village, I find the setting ersatz, generic, and phony. Not that I was around for a couple generations but my relatives were there in 1937. It isn't funny. It isn't remotely authentic. We don't care about the characters.So many movies were made about the struggling masses vs the capitalists at this time, and done with elan. \"Easy Living\" comes to mind. It didn't take place in the Village. But it rings very true. This rings with a thudding knell."],"review-user":["drednm","FilmOtaku","WeatherViolet","tjonasgreen","bkoganbing","David_Newcastle","mark.waltz","MartinHafer","Handlinghandel"],"review-date":["4 September 2005","14 August 2005","14 August 2010","19 March 2004","18 October 2010","3 January 2001","2 December 2014","6 November 2016","9 August 2005"],"review-rating":["10","7","9","7","8","6","6","2"],"review-title":[" The Great Miriam Hopkins\n"," Simple, yet delightful\n"," Susan Fletcher Meets John O'Halloran and Their Nieces, and....\n"," Amusing Depiction of Greenwich Village Life.\n"," Spirited Antagonists\n"," Ray Milland and Mariam Hopkins in a comedy masterpiece!\n"," Gee, Godfrey, is there nothing sacred?\n"," Enjoyable though I will admit that it was a bit forced.\n"," A dud\n"]}