{"review-url":["http://www.imdb.com/title/tt0044462/reviews"],"review-text":["I saw it the first day of its first run release at the Chicago Theater in Chicago in 1952. 'Bwana Devil' was the brainchild of radio director, Arch Oboler. - best known for the radio (and early live TV series) 'Lights Out'. Oboler's brother-in-law was Milton Gunzburg. Gunzburg was, I believe, the optician who connected the use of Polaroid lenses to the making of stereoscopic films. In 1952, television was stomping out movies and movie theaters the way rogue elephants could destroy villages. Hollywood was searching for any gimmick it could use to bring people back to the theaters. Cinerama, a cumbersome early widescreen process had come on the scene. It produced an 3-D like effect. That opened the door for Gunzberg and his brother-in-law. They called their process Naturalvision, raised some money to demonstrate the process, and produced 'Bwana Devil'.While the story and production values took a back seat to the illusion of depth, the picture was a hit. It was quickly followed by 'House of Wax' and others. Most producers opted to exploit the stereoscopic effects rather than make good movies. 'House of Wax' was one of the rare exceptions. After about a year, audiences tired of the shoddy productions, and Naturalvision eventually disappeared. Into the void Fox introduced CinemaScope, a flat wide-screen process, and helped stem the sinking theater system.I imagine seeing 'Bwana Devil' in flat projection would be painful. But for those of us who saw it with pristine prints, and quality projection, it was something to behold. Lions leaping off the screen into our laps was something few of us would forget.It has taken another fifty years for 3-D to return. Today's producers seem not to be making the same mistake as those in the early fifties. I hope so. After all, 3-D is so much more fun than flat.","Based on a true story. Bwana Devil, filmed in Natural Vision 3-D,came out at a time when movies were competing with the growing popularity of television, which was keeping audiences out of theaters in droves, Arch Obler's thiller has some spectacular photography of the African plains and is somewhat of a documentary. Lot's of shots of animal herds and native tribal dancing. The outdoor shots are brightly lit but the studio shots are quite dark. Third Dimension photography requires sets to be brightly lit. Starring Robert Stack, Barbara Britton and Nigel Bruce. This tale of a \"Great White Hunter\" hired, by the English rail-road company,to hunt down and kill two lions, that are killing off workers, is slow to start but the 3-D action picks up later with many shots of spears being thrown at the screen, on-coming trains heading stright for the camera and, of course, leaping lions jumping from the screen.  This movie can still be screen on television, in 2-D of course, and is interesting to see the shots that had audiences jumping in their seats back in 1952.","I was a teenager when this first appeared in theaters, and I saw it in Japan. The film's plot wasn't my cup of tea as a high school sophomore, but I went to see it for the 3-D process. It had been ballyhooed in the press so that even service personnel overseas had heard of it, though it never screened at the Post theater.The film started the trend of throwing objects at the audience, which was taken to absurd levels with later 3-D films.I don't know whether this qualifies as a spoiler, but you've been warned if it is. In many films of the time, actors would often work in front of a \"rear projection screen,\" where backgrounds could be projected to make it appear that they were in a different environment, such as a jungle background when the actors were actually on a sound stage. This works well on regular films, but when seen in 3-D, they look like a flat scene behind the actors. There were several scenes in the film where rear projection was used, and it didn't work well in the theaters. If seen in 3-D, it will constitute another disappointment.The film's only importance is historical, since it was the first of its kind.","Unlilke many other user comments, I really appreciated this little adventure movie. I expected a corny film, boring and nasty, as so some Sam Newfield are, such Nabonga and White Pongo...Color is beautiful, actors adequate. The story gives you great excitement,and a pretty good climax. Of course, we did not Robert Stack in such a film. Butit doesn't spoil the whole.Many users seem not to note that film is based on a true story, actual events. For those who are familiar with contemporary movies, Stephen Hopkins made \"Ghost and the Darkness\" in 1996, and that's exactly the same story. But of course on a larger scale, with excellent actors ans more budget.In short, a good surprise for me. I recommend it for those who love B movies.Especially adventures ones shot in locations.Even with some stock shots...","I saw this movie when it was first released in Pittsburgh Pa.  I had traveled from Youngstown Ohio, a distance of approx. 85 miles. I knew nothing of the plot nor the players. I had read no reviews nor had I talked to anyone who had seen it. Believe me I will never make that mistake again. It was being touted I believe as the first feature length movie filmed in the new 3D process. That was what enticed me to make a 170 mile round trip.There was a waiting line two abreast that stretched (I kid you not) 2 or 2½ blocks long and moving very slowly. I could hardy wait to be seated. If I had only known at that moment what I soon would know, I could have been ¾ of the way back to Youngstown by the time the feature started.By the time the first 3D scene was shown, I was already nodding off. The novelty quickly wore thin and from then on it was pure agony.\nWithout going into excruciating detail, I can only offer the following advice.  If you have ever seen the famous film PLAN NINE FROM OUTER SPACE, supposedly the worst movie ever filmed, it in my humble opinion stands head and shoulders above this garbage.I don't know if this has ever been shown on tv, if it has I don't know why. If you ever get a chance to see it, do something else.  Take a walk, cut the grass, wash the dog, have someone flog you with a rubber hose.  ANYTHING. Your time will have been better spent.This has been my first movie review.  It might well be my last unless a worse movie comes along and I wouldn't make book that will happen.Bill","Bwana Devil is reputedly the first major studio, full length feature filmed entirely in the 3D process. Supposedly producer Oboler went to Africa to shoot a different movie, but after hearing the tale of two man-eating lions, terrorizing railway builders, decided on this one. It's a good story too, almost Hemmingway-like; fear, redemption, the great white hunter and all. It's the telling of the story that seems to drag, almost as though filming in the new process was too weighty for the crew. The action scenes are stiff, almost too staged. But these technical problems appear small in light of the film's dramatic conclusion.","This film is worth seeing since it is a classic in the sense of being the very first full length film released in the process of three demention.  It was not very good in its acting or story plot, but can be a great movie quiz question from an historical standpoint.  It should be seen in the 3 D process with polarized lenses.","I will admit that \"Bwana Devil\" is not a great movie, but to compare this groundbreaking 3-D movie to \"Plan 9 From Outer Space\" is utterly ridiculous, as \"Bwana Devil\" is not bad--but it is slightly below average. The negatives are Robert Stack's overacting and forgetting his accent frequently as well as a few cheesy scenes (seeing a stuffed lion tossed on Nigel Bruce when he was supposedly being attacked was unintentionally funny). The HUGE plus is that this film was made mostly in Africa and looks so much better than the tons of schlocky African films of the 1930s-50s.The story is a dramatization of a real story of a couple man-eating lions and the man who ultimately killed them. It's the same story you'll see in the newer and better \"Ghost and the Darkness\"--so my advice is see this film instead. But, if you don't, you'll essentially learn the same story...along with Stack's less than stellar performance. Not a bad film at all--just not one that will bowl you over, either.","I was an usher at the Paramount Theater in Aurora, IL when this came out. The first 3-D movie. People were lined up for more than a block and we had to turn away many until the next showing. I was 15 years old and highly impressionable but this movie struck me as simply AWFUL! To this day I remember being embarrassed that people actually stood in line and paid good money to get in. How bad does a movie have to be to turn a 15 year old's stomach? Is there a rating for that. The only excitement was when a spear thrown by a \"native\" whizzed past the camera and the audience ducked. Avoid at all costs unless you enjoy bulimia.Jerry Weiland","Saw this for the first time as an 11 yr old at a matinee. Great movie but it scared me to death. I'm now 71 and it still remains the movie that I most remember as a child","Viewers: Hello. This movie does not show up on Cable very often. It reminds me of a much more recent movie, The Ghost and the Darkness. Similar plot...but has historical truth, of the two lions of \"Ranchipour\". The British colonel was building a bridge over the river, and some 150 workers were eaten by the two lions. He killed the lions. Those two lions , \"taxidermied\", are on display at the Chicago Field House,Chicago, IL.","The first film shot in 3D finds an inebriated Robert Stack pining away for his fiancé and trying to get a railway constructed in the heart of Africa at the turn of the last century. He's in British Equatorial Africa which later became Kenya colony and where the Sahara meets the veld. What's stopping the progress of the colonial British dream of a railway from Capetown to Cairo is a pair of lions.These two lions have the natives scared out of their wits. Lions are not known to attack humans, you leave them alone and they'll leave you alone unless they're hungry. But these two, a male and female have developed a real taste for human flesh. Showing no fear of man or anything man made, they attack humans indiscriminately at will. No one wants to work until this lion problem is solved.Stack's got both a lion problem and an unsatisfied testosterone problem. The second is remedied by the arrival of Barbara Britton, no one it seems can deal with the first.Bwana Devil was shot in Africa and it's writer Arch Oboler owes a lot to Moby Dick. These two lions and Stack's obsession with them are taken from the Herman Melville classic. Good thing Barbara Britton arrived when she did, she provides something Captain Ahab didn't have.Best scene in the film and it's almost laughable was when these three white hunters, best in their line of work are imported by the railroad to kill these lions. So what do the lions do, but actually enter the private railroad car where the hunters are hoisting a few with Nigel Bruce who plays Stack's sidekick and a doctor and proceed to kill them all and carry the cadavers off for a later snack. Presumably based on a true story according to the credits, don't you believe it. The 3D jungle scenes are nice, but it's attached to one ridiculous story.","I admit I have not seen this movie in 3D, nor is it germane to my opinion. As another reviewer notes, this movie elevates \"Plan Nine From Outer Space\", which was made with virtually no budget, to \"good movie\" level.This studio movie features contract actor Robert Stack, who leaves me wondering why the studio retained him on contract. He was a horrible actor, with no more depth than a mannequin. In this movie, the stuffed lions used to cold-cock Barbara Britton,(the archetypal swooning, cumbersomely-dressed white-woman-in-peril), had more animation than Stack. Or Britton.But moving on, this movie is about rogue man-eating lions. Er, lions in the wild eat moving mammals including men, so this was already a silly premise. But this \"Kenya\", obviously filmed on a Hollywood backlot (I recognize the area), features an African-less Africa. By that I mean, there are no Black Africans save for the random Black toddler who is eaten by the stuffed lions. The \"African\" slaves are all well-paid, self-sufficient, independent Sikhs! 1950's Hollywood sanitized film and TV by eliminating Blacks wherever possible. Apparently that included Africa. In this movie, \"Africa\" had automagically become the less-dark, ergo more acceptable India! I wonder how the previous reviewers missed this salient feature. Hm.What is there to recommend this movie? Well, perhaps as an example of bad acting, writing, plot, special effects, production values... It is a relic of what killed the movie industry in the 1950's and 1960's.Hint. It was not television."],"review-user":["AryeDirect","jackbwhittaker","skallisjr","searchanddestroy-1","wgsj","bux","dhaufrect","MartinHafer","gjwslw-2","kayebell-28118","blueglas-159-114603","bkoganbing","bree_thom"],"review-date":["4 July 2008","15 December 2001","30 June 2006","26 April 2008","13 April 2004","7 November 1998","10 December 2002","17 September 2013","22 December 2010","9 April 2018","7 March 2018","16 August 2010","16 August 2010"],"review-rating":["5","3","1","10","4","4","2","9","7","3","1"],"review-title":[" The First 3-D Color Feature\n"," A lion in your lap, a lover in your arms!\n"," First Doesn't Mean Best\n"," not so bad\n"," PAINFUL TO RECALL\n"," Fairly good action-adventure in Africa fare\n"," 3 D Excitement\n"," A little dull and Stack overacted, but it's better than many of the reviews indicated.\n"," One of the worst of all time!\n"," Scared me to death.\n"," Reminds me of another movie.\n"," A Lion Problem\n"," Africa Without Africans? Wow.\n"]}