{"review-url":["http://www.imdb.com/title/tt0027665/reviews"],"review-text":["When I first saw this obscure film--the ONLY feature of the Our Gang kids--I was expecting a feature-length version of one of their shorts, so naturally I was quite unhappy with GENERAL SPANKY. Watching it again after many years, I find it more strange than unsatisfying. There are a lot of excellent elements in the film, yet other parts of the film are cringe-inducing or surreal. Producer Hal Roach managed to take Laurel and Hardy from the world of comedy shorts to the world of features with great success, so it's not surprising that he would want to take the Our Gang kids from shorts to features. My only question is...why a Civil War vehicle, with Buckwheat as a slave! The box of the MGM/UA video states the Roach was inspired by the success of Shirley Temple in THE LITTLE COLONEL to cast Spanky, Buckwheat, and Alfalfa in an \"Old South\" setting, but Our Gang's brand of comedy is much different from Shirley Temple's. Interestingly, Hal Roach returned to the \"Old South\" setting a few years later, when he teamed Oliver Hardy with Harry Langdon (Stan Laurel refusing to re-sign his contract with Roach) in ZENOBIA, another strange film. Perhaps Roach was inspired to cash in on the GONE WITH THE WIND phenomenon with ZENOBIA? Since Mr. Roach was from New York State, it's interesting that he would buy into the \"romantic Old South\" mythology. In any event, as I said above, there are some excellent elements in this film. Buckwheat Thomas and Spanky McFarland are fantastic, charismatic performers who can easily carry a feature film on their own. Buckwheat, in particular, is quite moving, when he is looking at a birthday cake while incredibly hungry, and since he's never seen a birthday cake before, he thinks the cake is on fire, and because he is hungry, he starts to cry. The underrated Phillips Holmes (best known for the 1931 adaptation of Theodore Dreiser's AN American TRAGEDY), who reminds me somewhat of Onslow Stevens, is quite impressive as Marsh Valient, the Southern Gentlemen who takes in Spanky and Buckwheat. Holmes' scene with Spanky where the two of them discuss the nature of war was quite moving and still has a necessary message today (it reminds me of Oliver Hardy's speech on racial equality in ZENOBIA). Ralph Morgan turns on his gruff charm as the Union general who refers to Spanky as \"General\" and treats him as a peer throughout the film--the effect is somewhat surreal. Irving Pichel is superb as the arrogant and sleazy Union officer Simmons. On the whole, however, GENERAL SPANKY is such a strange experience, I don't really know what to make of it. Any serious Our Gang fan should see it, and people attracted to weird cinematic misfires might find it interesting also. It's still available cheaply from its early 90's VHS release. I've never been much of a fan of Alfalfa, and fortunately he doesn't appear in the film until half way through, and soon after he does his patented \"off key singing\" routine. It has not gotten any better with age. Fortunately, the film belongs to Spanky and Buckwheat, and they do a great job.","This is a cute film starring Spanky, Alfalfa and Buckwheat from the \"Our Gang\" comedies.  Set in the South during the Civil War, it may seem a little odd to see Buckwheat as Spanky's slave, but this film is as charming as the best of the shorts with the same  cast.  This was the only Our Gang feature film, and I highly recommend it over The Little Rascals remake from 1994.","During the War for Southern Independence, GENERAL SPANKY mobilizes his forces to defend the local women & children against a Yankee invasion.In 1936, Hal Roach decided it was time for his popular OUR GANG kids to branch out into occasional feature-length films. With the big success of Shirley Temple in two Civil War period movies in 1935 (THE LITTLE COLONEL, THE LITTLEST REBEL), it was only natural that Roach would look in that same direction for his GANG. Although given a rather lavish production and distributed by MGM, GENERAL SPANKY was not a critical or box-office success. The little GANGsters would henceforth stick to short subjects.Although he's given top billing & the title role, George 혩Spanky' McFarland is rivaled throughout the film's first half by little Billie 혩Buckwheat' Thomas. Here were two of the finest young actors to ever appear in American movies. With all the experience of old, seasoned pros, these two gamin could steal scenes & hearts with equal bravado. A constant joy, without a false note between them, they provide the essential reason for watching the film today.Phillips Holmes gives a quiet, gentlemanly performance as Spanky's adult protector. Nearly forgotten now, Holmes was a fine actor who died much too soon, during World War Two. Genial Ralph Morgan is especially good as a sympathetic Union general - his scenes with Spanky are quite amusing.Other OUR GANGers appear midpoint into the movie, most notably Carl 혩Alfalfa' Switzer; he gets to warble 혩Just Before The Battle, Mother.' Even pretty Rosina Lawrence (the GANG's schoolmarm) shows up to play Holmes' beloved.Irving Pichel is particularly slimy as a cowardly cardsharp turned vindictive Yankee captain. Bumbling Willie Best & feisty Louise Beavers play Miss Lawrence's slaves.It should be noted that there is racism in the film, not unusual for Hollywood of that era - but almost completely missing in the original series of OUR GANG shorts.Fans of 19th Century music will enjoy paying attention to the soundtrack, which is a long succession of ancient tunes.","Hitherto to this feature, the longest Our Gang film was a three reel silent short called \"Spook Spoofing\". A 73 minute feature is a drastic change from their usual territory, but it is a worthwhile effort none the less. Here the comedy comes in contrast to drama, with a storyline that has more to do wih the adults than the Rascals. The Civil War setting is successfully recreated, and Spanky & Buckwheat make a good team. Not a film to introduce one to The Little Rascals, but one to enjoy after being exposed to their classic shorts,","The film starts with promise because there is more interaction between Spanky and Buckwheat, but as the film progresses, the two boys have fewer scenes together. This slows the pace considerably. Billie \"Buckwheat\" Thomas gives a very strong performance in his early scenes. When he is left behind on the riverboat, his fear and abandonment are palpable and his tears are truly heartbreaking. When he goes from man to man asking for help and is repeatedly rejected the viewer really begins to wonder if this is a comedy or not. Watching a children's birthday party through a picket fence is another moving moment. As another reviewer mentioned, I was also worried about the big dog choking on chicken bones! Once Spanky and Buckwheat are in Marshall Valiant's home, Spanky tends to interact mainly with the adults and the chemistry of the children is essentially lost. The Old South/Huck Finn-type setting really doesn't do much for the plot except allow the children to be out of doors a great deal. Ralph Morgan is the most engaging adult, but then the other roles really don't have much substance to them. Louise Beavers manages some funny moments with a Yankee soldier towards the end. The villains aren't really villainous enough and the lovers not intense enough. Yet, I do think it's worth viewing if you're an Our Gang enthusiast, if for no other reason that the odd curiosity of the whole piece. I give it seven stars because, while not a great movie, it kept me engaged the whole time and curious as to what would happen next.","General Spanky---6/10.I feel mildly disappointed after watching this film. It's not a bad film, not really, but it's nowhere near as good any of the 'Our Gang' shorts that I grew up watching on TV. What are good are the performances by its chief stars, the kids: Spanky and Buckwheat. They steal the show from every adult actor in the movie with the exception of Ralph Morgan as the 'Yankee General'. The comedy bits are good, most notably the battle scene where Spanky and the gang protect their territory with a row of vertical sticks (simulating guns) and some accidental explosions (how on earth did these kids get a hold of so much gun powder?). I found myself cringing a bit during the dinner table scene where Spanky inadvertently keeps feeding a dog instead of Buckwheat, not because it was bad or unfunny, but because I know what chicken bones can really do to a dog. The comedy isn't that funny, the acting isn't all that great, but the cast carry on with a wink to the audience all the way until the credits.My favorite scene is the scene where Buckwheat keeps spitting into his hands while driving a stake into the ground.6/10.Clark Richards","Spanky and his friends all decide to play army as the country is embroiled in war. His friends designate him their general and he leads them on a rather funny encounter with real Union troops! In addition, they help a nice Southern officer escape a hanging--a hanging orchestrated by a total jerk.It's not hard to believe that Hal Roach Studios decided to give little Spanky from the Our Gang comedies his own feature film. After all, for his age, he was a dandy actor...and cute as a button. However, in hindsight, their choice of material was a bit on the grotesque side. It's not that setting the story in the South during the Civil War was necessarily a bad thing, but the whole slavery issue is very weird when you see it today. After all, in this film you see lots of black slaves standing about and singing for joy, as they apparently love their lot in life!! And, when Buckwheat (who is a runaway slave) begins to cry because he wants to have a master, too, it's just too much! If it weren't so evil, it would be comical. It's sad. Because without the racial insensitivity, the film is very good. The kids in the film are all good actors and Buckwheat really is quite adorable and effective in the film.Rather surreal...that's for sure.","OUR GANG got one chance at a feature film in its 22 year history, and this was the best that could be done? It's boring, forced and pointless, and I must respectfully disagree with the other poster on this film; the 1994 LITTLE RASCALS remake was better than this. Almost anything is. The kids are subordinate to the Civil War proceedings; it doesn't feel like an OUR GANG film at all, but like a humorless second-rate Shirley Temple clone.","General Spanky (1936)** (out of 4) By 1936 Hal Roach was attempting to shut down his short productions and making Our Gang, Charley Chase and Patsy Kelly (among others) join the feature ranks. This film attempted to put the kids on the map of features but it's also clear that it was a pet project for the top-billed George \"Spanky\" McFarland. In the film, a Southern gentleman (Phillips Holmes) takes in Spanky and his \"slave\" friend Buckwheat. Soon the children are in the fields playing war as the Civil War is breaking out and the kids end up getting mixed up with real Yankee soldiers. GENERAL SPANKY is a rather controversial movie today because of its subject matter and the way it shows slavery to be something blacks needed and wanted. I'm really not sure what the mindset was in 1936 but it's clear Hollywood really hadn't changed their ways and wouldn't for nearly another two decades so that's important to remember when watching this thing. As far as the controversy, I would never blame anyone for being offended at the idea that blacks enjoyed being slaves and we're constantly going around with smiles on their faces. What's even more disturbing in this film is some early stuff where Buckwheat loses his master and cries about it before walking around a boat hoping someone will become his new master. There are countless stereotype jokes aimed at blacks but I think the idea of a black child needing a master is probably what's not going to sit well with many. What didn't sit well with me was the poor screenplay, which really doesn't try to do anything and I do find it easy to see why Roach and his features didn't work well for anyone. I think the biggest problem is the screenplay never seems to be too worried about being funny. I thought it did a good job at showing the South just before the Civil War but the majority of the jokes just fall flat. Check out the long-winded scene where Spanky is being fed fried chicken while Buckwheat is under the table and wanting a few pieces. Spanky sends them down but the dog gets them instead of Buckwheat. This entire sequence has zero laughs because the scene is told so poorly and the timing is off so bad. Another scene that doesn't work is when the kids are playing war not knowing that the real soldiers are coming down on them. The stuff with the gunpowder I'm sure was meant to be funny but it wasn't. It's a shame the screenplay is such a mess because the performances are actually pretty good. McFarland is as cute as ever and fits his role just fine as does Billie \"Buckwheat\" Thomas and Carl \"Alfalfa\" Switzer. GENERAL SPANKY, rightfully or wrongly, will probably always be looked down upon for its subject matter but even if you can get past that you're left with a pretty bland comedy that feels overlong even at just 71-minutes.","Though the Our Gang comedies still have their followers, I've got to say that their attempt to graduate to feature films, courtesy of Hal Roach came up way short. Why did Roach have to pick the Civil War as is subject with all the attendant racism that would follow.Dashing southern cavalier Phillips Holmes takes in young orphan Spanky McFarland and his young black friend Buckwheat Thomas after Spanky inadvertently exposes a card cheat on a riverboat. All is placid and serene in the Old South and then the Civil War comes to ruin it for everybody.But even children can charm the worst in the world and there's none worse than those damn Yankees. They just come south and ruin it for everybody.Criticized though it was for its southern viewpoint, Gone With The Wind did make a good case for the southern cause and the blacks portrayed even though servile which they would be out of necessity are still three dimensional characters. Hattie McDaniel would not have won her Oscar if it were not so. Butterfly McQueen's character of Prissy as silly and vacuous as she was has some dimension.Here though is maybe some of the worst racial stereotyping ever brought forth in Hollywood. The companionship of Spanky and Buckwheat does show that kids get along, racial feelings are acquired not inbred. It's not the servility of the blacks that's objectionable, but there total acceptance of it. Right from that horrible watermelon song, sung over the title credits, the message of General Spanky is a bad one.Yet it did get an Oscar nomination for Sound recording, probably one of the very few Hal Roach ever got out of the short subject field.General Spanky is far from Gone With The Wind though.","The Our Gang series of shorts took place in more urban settings, and there were few overtly racist moments in those shorts - all the kids were playing together, in the same spaces, going in and out of the same doors, in and out of each other's homes, and no reference made to segregation or Jim Crow, etc. There was stereotyping, for sure - the black American kids, the Italian kids, the Asian kids, the fat kids, etc. But the lack of those overt racist moments is probably why these shorts have translated well enough for modern viewing. But this full-length feature throws all that out the window: here is a story set in the South and presenting enslaved black Americans as happy, sweet simpletons, treated wonderfully by their owners. It's not \"Birth of a Nation\" bad - more \"Song of the South\" bad. There's even a conversation 10 minutes into the movie between two slave owners, bragging at how well fed and cared for their slaves are. Buckwheat, here an enslaved child, overhears the violence these owners say they would do on a re-captured runaway slave, and as he is run-away, he is terrified. It's supposed to be a funny moment - but to any halfway caring human being, knowing what really did happen to re-captured run- away slaves, the incredible violence and humiliation that was all too real, it's painful now to watch this scene, to watch this reality made light of. It would be like watching an old movie making fun of the Holocaust. Lots of other cringe-worthy moments as well, like Spanky proudly proving he's a \"Southern Gentleman\" to Alfalfa by showing off \"his\" slave, smiling happy Buckwheat.So, why did I give it a 7? Because it is a PERFECT example of how, 70 years after the Civil War - and beyond - the myths of the happy slave, the genteel white slave owner, the \"noble\" and brave fighters for the Southern \"cause\" and the boorish, cowardly Northerners was/is perpetuated in the USA, this time with the overwhelming cuteness and charm of Spanky and Buckwheat, probably the two most popular members of the Little Rascals (they were always my favorites).","I see from some of the other user comments here for \"General Spanky\" mention of the uncomfortable subplot of Buckwheat a slave who is in search of a master, as well as other parts of the movie glossing over the whole issue concerning slavery. So I don't think it's necessary for me to go into depth blasting the movie for those things when others have already done the job. What I will mention, however, is that the movie is pretty tough going even if you can look beyond the controversial content. I guess I should mention is that I have never gotten into the \"Our Gang\" shorts, finding the child stars to be poor and annoying actors. So seeing them in a full length movie for me was an excruciating experience. But what really sinks the movie is that the script is a mess. Certainly the humor is really lame, but there is almost no plot, just a bunch of vignettes that are barely connected together. And while the movie is just 71 minutes long, it moves at a snail's pace. If you are looking for a Civil War comedy involving a general, watch the Buster Keaton movie \"The General\" instead."],"review-user":["django-1","Gyoza Man","Ron Oliver","joemigliore","Emberweave","highclark","MartinHafer","xidax","Michael_Elliott","bkoganbing","jcravens42","Wizard-8"],"review-date":["21 December 2004","11 July 1999","20 September 2001","3 October 2001","25 February 2010","18 February 2005","25 January 2011","14 December 2000","7 May 2011","25 February 2010","9 February 2017","3 June 2017"],"review-rating":["5","7","10","7","6","5","2","3","7"],"review-title":[" The Our Gang Kids...in the Civil War!!!\n"," A must-see for any \"Our Gang\" fan.\n"," Fighting For The Lost Cause With Spanky & Buckwheat\n"," Our Gang's period piece.\n"," Strange Our Gang Oddity\n"," General Spanky\n"," Exceptionally well made but rather grotesque...\n"," Frankly, it's one of the worst films I've ever seen\n"," A Few Cute Moments but the Story Just Doesn't Work\n"," Not Gone With The Wind\n"," Uncomfortable at times, painful at others, but a must-see\n"," Not my kind of old time comedy\n"]}