{"review-url":["http://www.imdb.com/title/tt0062369/reviews"],"review-text":["You have to be over 40, maybe 50, to have seen this, because it has never been released on tape or DVD and rarely shows up on TV anymore. It was a great piece of absurd theater that ends with Eli Wallach tucked in bed between the married couple who are his landlords, eating chicken and watching TV. Yes, it is silly, but then so is Waiting for Godot. Eli Wallach lives in a flooded basement and decides that the only way he can \"get\" a woman is to kidnap her, which represents a level of common male frustration that is worthy of humor. From the votes already cast, it appears that women liked this movie, but I'm a man and I too thought it was great. Too bad somebody doesn't make it available for home viewing.","It's up there with Where's Poppa, The Groove Tube, Putney Swope. It memorializes the NY city mind set of the period, a wonderfully strange man with a bizarre plan, hoist by by own petard, and at last retreating into the bed of his adoptive parents. Totally absurd, its the life one sees through the magic glasses, seeing things as they \"really are\"... I don't think it is ever shown anymore. If so, surely someone would Tivo the thing and put it out there. A kidnap goes awry: mixed up in a rain storm, dashing in and out or storefronts, our hero tosses a raincoat over his prey and tossing her into his bicycle powered ice cream wagon spirits her off to his basement apartment in the village. He is amazed, surprised, and incredibly disappointed when the wraps come off: instead of a luscious lady, he has captures a middle ages suburban housewife who talks and talks and talks. The film is full of vignettes of the commuters life, the suburban life, the city officials, and all the attitudes so dearly held. It pushes the limits of comedy, such as magical reality might push a drama, much as Daffy Duck is able to draw on imaginative scenes to demonstrate his plight or desires, all at the very edge of plausibility. All of it is humorous, nobody is mean.","I saw this movie on late night TV out of Buffalo about 30 years ago and I'm dying to see it again one more time before I... well.. you know. The interaction between the main characters after the Tiger (Eli Wallach) \"captures\" his prey (Anne Jackson) in a botched kidnapping attempt is absolutely hilarious. Charles Nelson Reilly's portrayal of a neurotic university dean(?) or department head is priceless. How many films can you name which are able to illuminate humanity's struggle for meaning and fulfillment by making you laugh from beginning to end? This film reminds us that we are all in that same struggle regardless of class, race, sex or religion. And who can forget the scene of the suburban homeowner on his hands and knees attacking those few tiny weeds that have dared to appear overnight on his perfectly manicure lawn!","I remember seeing this film years ago, precable. It made me laugh sooo much. Why doesn't some SMART Columbia person put this out on DVD already. Since Eli is still with us and I think he is in good health, would'nt it be great if he could do a commentary on the film,(or at least an intro, or small interview, like he did for The Good The Bad And The Ugly reissue), prehaps along with Anne as well, if they are both up for it. But anyway it is a real shame that this gem has never been released for home theater viewing. Columbia finally released Good Neighbor Sam, but you have to get it in a box set. Other 60s funny ones I'm waiting for are; The Film Flam Man, The Art Of Love, Cold Turkey, and John Goldfarb Please Come Home.","Back in 1967, a film producer visited my family and asked if they could use our home and our neighbor's home for a new film starring Eli Wallach and Anne Jackson. After negotiations, parts of the film were filmed in our home and our neighbor's home.Since I was in about 6th grade at the time, and since it was the biggest thing to hit our neighborhood, I was allowed to stay home the day of filming.Being curious, I approached the coach bus parked in front of my home. I stepped inside and sat next to a very nice (handsome) gentleman. We got to talking, as he was very friendly. He explained that he had a small part, not being filmed at my house, and we sat and chatted for awhile. He told me his name, Dustin Hoffman. After ten or fifteen minutes I left the bus.Just a few years later when watching a movie with Dustin Hoffman, my dad said... isn't that the guy from The Tiger Makes Out? It sure was... and I remembered my conversation on the bus with him. Over the years, I've followed his career.Last night I was telling a friend about this movie. We later sat down to watch \"The Holiday\".... I was saying, wow... ELI WALLACH...we were just talking about him. Later in the movie, when there was a short glimpse of Dustin Hoffman, did I really get the chills... Am very curious as to why Dustin made a quick appearance in another of Eli's movies.Just wish I could get the movie on DVD... searched the internet, and it's not to be found. Too bad... what wonderful memories that movie would bring back!!","In this era when almost everything makes it on to DVD (I'm expecting to see the My Mother the Car collection any day now) this film has been unfairly neglected. There are innumerable stupid comedies from the 60's as well as many other eras that have received at least a cursory DVD treatment. This one wasn't even released on VHS to my knowledge, despite the talents involved in the making (Arthur Hiller, Eli Wallach, Anne Jackson, Murray Shisgal (notable later for co-writing Tootsie), even Dustin Hoffman in his debut). It's obviously a product of the sixties but so is just about everything else from that era. All films reflect the tastes and customs of the times in which they are made. This was released the same year as The President's Analyst, another absurd masterpiece. That film was finally released on DVD and has developed a cult following. This film has many memorable bizarre, goofy, wacky moments. Sure, it's painted in broad strokes and has silly go-go music throughout but that's part of its charm. It creates its own absurd universe. If whoever is in charge of DVD production for Columbia Pictures releases (I believe Columbia released it) takes polls for new releases this gets my vote.","A reasonably funny albeit dated anti-establishment comedy based on the play by Murray Schisgal. Eli Wallach plays a frustrated everyman sick to death of the rat race and lack of imagination he sees around him. He decides to kidnap a sexy young girl and ends up with suburban housewife Anne Jackson by mistake. She gives him MUCH more than he bargained for. Schisgal wrote the screenplay and there are plenty of laughs to be had: Bibi Osterwald with her leg stuck in Wallach's ceiling; Wallach paying his monthly rent to landlords who'd sold his building six years earlier; a very bizarre encounter between Wallach and the NYC housing commission. Wallach, in a very rare lead, is exceptional and Jackson is charming. Bob Dishey plays Jackson's ego-maniacal yet unbelievably neurotic husband and the supporting cast includes a lot of great character actors. In addition to Osterwald, Ruth White, Charles Nelson Reilly, David Doyle and Elizabeth Wilson have roles. Arthur Hiller's direction is probably a bit too flashy for the material, he falls back on cross cutting editing and fast motion a lot (aside from its over use on the Benny Hill Show, is fast motion EVER funny?). Look for Frances Sternhagen in a very unlikely cameo and Dustin Hoffman in his first film.","I rarely write reviews but this film simply demands more attention than it gets as it contains the most hysterical kidnapping gone comically wrong sequence ever filmed.I have only seen this once and found it to be the funniest film I had ever had the privilege to watch. I laughed from beginning to end. It is such a shame it is not out on DVD or video.You can only compare its cinematography with that of It's A Mad, Mad, Mad, Mad World or Promise her Anything. Only this storyline isn't nearly as complex as Mad World.I hope in the near future this film is released as it would be a shame to lose such a comedy gem amongst the dregs we have nowadays.","I didn't really care for this.  Had they gotten rid of the comedy/slapstick and focused on the dramatic/philosophical aspects of the script, this might have been worthwhile.The more the film went on, the less I liked the protagonist/mailman.  He does have interesting things to say, but he's also a hypocritical, insecure jerk.\n3/10","Performed 1965-66 season. Director by Jim Leighton; Porterville, Ca The Barn Theater's production of Murray Schisgal's one act plays: The Typists (with Ann B. Davis, Jim Leighton) and The Tiger (Ann. B. Davis, Bill Striglos). Information from 4 page playbill","He's a curmudgeonly mailman with a big vocabulary but no social skills or common sense. She's a bored suburban housewife with a bored husband and some children who may or may not actually exist. He hasn't yet figured out that his building was sold 6 years ago and his basement apartment is now being used for storage. She wants only to return to college to finish work on her baccalaureate.The first half of this movie provides some wonderfully irreverent satire in its depiction of New York City as a benign dystopia. It has the feel of a 1960s beach movie turned into a sophisticated PG-rated urban sex romp. It occasionally falls flat in attempts to imitate the zaniness of Richard Lester films, but this doesn't detract from the clever humor.The film weakens, however, after the inevitable meeting of the main characters. It's unfortunate that the writers had to resort to a plot device so ludicrous and offensive. The movie becomes mainly dialog driven beyond this point but the dialog just isn't good enough to support that and Eli Wallach's excellent Eric Von Zipper imitation eventually grows annoying. Nevertheless, the movie still has a few surprises to offer and the quick, merciful ending provides an oddly satisfying lack of conclusion."],"review-user":["jrwygant","gberke-2","robertpacker","junefirst26","JanD824","bobess48","JasparLamarCrabb","titiantootsie","sore_throat","bkohrn","bobc-5"],"review-date":["26 December 2004","12 May 2008","14 December 2007","14 April 2010","24 April 2010","7 July 2007","10 April 2009","21 January 2007","28 June 2002","18 May 2018","15 January 2018"],"review-rating":["10","8","10","6","8","5","10","3","7"],"review-title":[" theater of the absurd\n"," A brilliant film\n"," Please Please Please - somebody put this out on DVD\n"," Please, Powers That Be.....When?\n"," The Tiger Makes Out Filmed in my Home\n"," Underrated comedy, dated but so what?\n"," Funny but dated anti-establishment comedy...\n"," The Tiger Makes Out is the Best film I've ever seen\n"," had potential\n"," The Tiger (play)\n"," Brooklyn Blanket Bingo\n"]}