{"review-url":["http://www.imdb.com/title/tt0050717/reviews"],"review-text":["This film has two of the most devious characters ever to enter Mexican cinema: Dr. Krupp,who is as evil as he is fat, and his hapless sidekick Bruno. Dr. Krupp IS actually quite the evil genius. During a flashback in the film, we find that he is clever enough to disguise himself as pro wrestling bad guy The Bat(who would ever suspect a mad scientist could be a pro wrestler?!? It's pure genius!!)and escapes the Aztec Mummy and his own snake pit trap(He was probably very happy that built that secret escape and had his keys with him). And Bruno is one of the few VERY loyal sidekicks I've ever seen in any film. The guy puts up with being punched by the Aztec Mummy, having acid thrown into his face and becoming deformed, and tolerating a boss who thinks he's a wrestler. Besides in the dubbed version, Bruno delivers the classic line \"You devil! You devil!\" better than anyone!","Got this DVD because I remembered watching these flicks as a kid on late night spookfests in the 60s.  Usually I fell asleep, now I know why.  Pretty slow moving and lacking in action.  Generally a rehash of the 1st two Aztec Mummy films with a little addition of the Robot creation.  Looks like a really poor interpretation of a Universal monster compilation.  The sequences pulled from the original AZTEC MUMMY look pretty good though. This one is kind of what a 12 yr old kid with a super 8 camera might try to do, with a little help from mom and dad who know nothing about making a movie.  And they probably would think it was good, too.  One redeeming quality, lots of eerie night shots for mood.","This flick was the introduction for a lot of us to the works of K Gordon Murray. That's because it was easy to find. It was on every public domain label in the VHS era, and before that, a late night t.v. cult classic, double knee thigh slapper. Besides, HOW do you resist the title?For late comers, a brief explanation of it's merit: Florida wheeler dealer K. Gordon Murray imported Mexican horror films, dubbed them into English, then made a mint with them at the drive in. The Mexican ORIGINALS were weird enough to begin with; American boundaries and accepted horror film conventions were cheerfully disregarded. Great, great set design and lighting were placed beside weird or laughable special effects. NOTHING in Hollywood was as close as these were to out and out strange. Now, mix in Catholic influenced social conventions, Mexican folk lore, and we are not in Kansas anymore. Add to THAT the English scripts they were dubbed into. Most were written by Reuban Guberman, who wanted words to match movements of the actors lips ON SCREEN, not the literal translation. As a result the American soundtracks tended to run from overwrought to down right loopy. There's even a fan web site for Murray that prints the best, most over the top lines for each movie. First time viewers to the films complain about the pacing, the purple prose, the production values and are told it's SUPPOSED to be that way..while the people laugh with enjoyment over things normally considered fatal film flaws. It all must be very confusing if you don't have a taste for it.This one was made back to back in 1957 with the two previous films in the series; THE AZTEC MUMMY and CURSE OF THE AZTEC MUMMY. All three are now available on the 3 disc AZTEC MUMMY COLLECTION (BCI) and it's about time. It has the K Gordon Murray version on one side, the original Mexican production on the other side. The contrast between the two is fascinating. A lot of the times the original Spanish is not much saner.ROBOT/MUMMY starts off with a nice long flashback bringing you up to speed on the previous episodes, sort of..continuity was tossed out the window in number two, and it's downhill from there, logic wise. You don't even get The Angel back, or any mention of him in this final episode. Names, places, even family trees switch between films. After a while, you start LOOKING for the continuity changes. By now, the series villain Doc Krupp is totally pig biting mad, nearly drooling with dementia and STILL wants to steal the Aztec breastplate. Rosita Arenas is sent back to the past with another nice edit of the AZTEC MUMMY floor show, and wanders out into the dark in her nightie to help find that doggone breastplate again. The mummy isn't any happier with this then he was last time.The robot actually has a production credit. It was made by 'Viana & Co S.A.'. I mention this, because it looks like the grips came up with it between takes on a slow afternoon when the real costume went walkabout. Nope.This was PLANNED. Wait until you see the controller it runs from. X box, where WERE you when Krupp NEEDED you??? The Robot LOOKS crushed to death at the end, but actually came back in two more Mexican made movies..it had a FAN BASE.. All in all, a funny quirky finish to a three movie series. Sit back and enjoy.","the usual disclaimer - I do not give 1 star ratings to movies which are harmless, bad, low budget and silly, although they may deserve it. These films are often funny, and get rated 2-4 based sheerly on entertainment value - not as a representation of their exemplary film artistry. This film fits this model perfectly. It is a Mexican monster movie, riddled with voice-over narrative and extremely weak not-so-special effects. The makeup is not that bad, and the acting is sometimes quite entertaining, but this film is almost as silly as Aliens vs Predator and the script isn't half as slick (Aliens vs Predator might get a 1 from me, but I want to see it again before I commit).The plot is ridiculous, but deliciously convoluted. If you've read this far, you must really want to know... A group of remarkably unscientific scientists comprise the main characters. Most of them are heroes - sort of - but one is (of course) mad, and quite perverse. This mad scientist invents a laughable nuclear powered robot (who looks a bit like the tin man from Wizard of Oz, but has a human face inexplicably located inside its head). An Aztec mummy, discovered by the same 'scientist' whose wife just so happens to have been an Aztec princess in a past life (don't ask), is pitted against the robot for the big \"climax\" the fight scene alone is enough to put the most stoic movie watcher on the floor in belly laughs.For what its worth, given the budget and the utter silliness of the script, this is a very entertaining low budget goof ball monster movie. If you're into that sort of thing, go for it.","It's hard not to laugh at this movie. It's hard not to laugh knowing that somewhere, someone sat down and thought that having a robot fight a mummy would make for a good picture. And it might have been if the two title characters combined for more than 5 min of screen time.  Unfortunately, most of the film consists of flashback scenes and some scientist's encounters with \"The Bat\". The robot, built out of sturdy cardboard and headlights, isn't even introduced till the movie is practically over and their monumental confrontation (the premise the movie is supposedly centered around) lasts about 30 sec.I have a lot of questions for this movie.  Why is the bad guy referred to as \"The Bat\"? Why does the mummy sound like a gorilla? Why did the robot need to have a human head? Why was there an endless Aztec dance scene? Why?","I have watched this movie twice in the past six months (what I go through so you don't have to).The first viewing left me half crazed and babbling.The second viewing at 5am on a rainy morn was a little better.I only screamed in agony once. Seems Pocona (The Aztec Mummy)had the hots for a certain Aztec Princess who was\"supposed to keep her maiden\".Obviously they gave each other the business and were put to death for it.(Now that is severe!).But before they are the film tries to put us to death with a screeching Aztec ceremony.The singing will make your ears bleed. Anyhow there is the usual reincarnation nonsense. Not to mention a treasure map on a breastplate & bracelet guarded by that swathed slob,Pocona.By this time Pocona looks like he's been on a 2000 year bender and is after the defilers of his tomb.His groans & moans sounds like he has a bad case of Montezuma's revenge(or he read the script for this movie).That will make your breath stink. An evil Dr Von Krupp appears wanting the Aztec treasure(possibly to finance acting lessons & screenwriting classes for cast & crew).He is called The Bat because in The Curse Of The Aztec Mummy he wore a bat like cape, hat and something like a ski mask over his face.Guess it's better than the Laughing Fat Man. The Bat in typical mad scientist fashion wants to rule the world. He stresses this by rolling his eyes,laughing maniacally and chewing the scenery.He has cobbled together an invincible robot.Looks like the 'bot was made from a garbage can, a chandelier and the grill of a 1957 Buick.This will make your eyes bleed.A company even takes credit for making this tin can! Well the mighty showdown between Pocona and the Robot takes place in the Mummy's new crypt having been made homeless earlier. About half of this movie is culled from \"La Aztec Momia\"never released in the US in its original form but in a chopped atrocity from Jerry Warren(see my review on \"Attack Of The Mayan Mummy\") and \"Curse Of The Aztec Mummy\".The robot is frankly stupid as are most of the characters.If that and the plot doesn't make you howl with laughter nothing will. My first impression was so bad it would have gotten a one. But after seeing \"Mayan Mummy\"(which is a movie deserving of being burned) and watching \"Robot\" again, it garners a 3.You have to watch this with no expectations at all. Then it can be naively pleasant.","This movie should have been billed as three movie-summaries linked together to form a full-length feature film (including lots of shots of people slowly walking down dark corridors and streets). BE WARNED! The first hour of this movie is simply a re-hash of the first two Aztec movies as told by the main character. The actual movie doesn't start until the thing is almost over. I must say, the overacting on the part of the Bat is quite hilarious.As for the robot, I thought a robot was a mechanical device that may or may not resemble a human. The Bat's \"robot\" consists of a radioactive reanimated corpse encased in a lead robot-body. As Tom Servo put it, \"He's not that impressive; he doesn't even have knees!\" That, and it takes the robot about an hour just to lumber across the room. But once he catches you, WATCH OUT! He'll disintegrate you with a touch (powered by radium? Pluh-ease!).This is a great movie when accompanied by Joel and the Bots. Otherwise, you're just a glutton for abuse.","Ya know, this should be one of those \"so bad it's good\" kind of moovies, but the awful truth is: the moovie is plain boring!  It takes FOREVER to get through all the pointless exposition before you ever get to see the mummy or the robot - a lot of nonsense about the Bat (evil guy) & the Professor (the good guy).  Face it: all we wanna see is the fight!  Of course, when it finally does happen, it's one of the slowest & stupidest monster fights in moovie history, and almost makes the wait worth it, but not really.  Rock & Roll Wrestling Women VS The Aztec Mummy is far moore fun!  I give this moovie 1/2 a hoof out of 4 - rent it for a chuckle, but keep yer finger on the fast-forward button!   :=8)","\"RVAM\"'s reputation preceded it. I first heard of it in one of those Medved style movie books, \"The 50 Worst Movies Ever\" or \"The Golden Turkey Awards\", or something like that. Every review of the film basically said that this movie was so bad that it would make you bleed from the eyes to watch it. So when the Exposed Film Society finally got around to showing it, I was anticipating the kind of cathartic experience that only a true cinematic stinker can provide. However, \"Robot\" wasn't really all that bad. Oh, this is definitely a \"Z\" film through and through. Some of the voice dubbing (as is usually the case for K. Gordon Murray imports) is awfully cheesy, and the movie itself seems to be structurally something of a Frankenstein, since a huge chunk of it seems to be footage from a previous \"Aztec Mummy\" movie, narrated with a voice-over by the leading man. A dead giveaway: anytime the question \"Then what happened?\" is asked more than twice in the dialog, you are looking at reassembled footage put together with little regard for plot coherence or momentum. In RVAM, \"Then what happened?\" or \"What happened then?\" is uttered at least four times in the 1st hour. Even without the structural problems, the plot and dialog don't translate well to an older American audience. For instance, as the hero explains (and explains and explains) the back-story. he includes a remark about Doctor Krupp, \"a doctor who suddenly turned into an evil master criminal\" and began his quest for the treasure that the Aztec mummy guards. No background, no explanation, he just \"suddenly turned evil\". Obviously, this was aimed at a pretty undiscriminating audience. The clincher, though, is the \"Robot\", the supposed \"showcase\" of this movie. This Robot is the worst robot special effect since \"Undersea Kingdom\" or even \"Santa Claus Vs. The Martians\". Compared to this hunk of junk, the Tin Man from the \"Wizard Of Oz\" looked like the Terminator chassis that chased Linda Connor through the foundry in T2. The Aztec Mummy himself is well designed and executed; he's recognizably undead, familiar enough to look like a mummy, and yet distinct from the \"Boris Karloff\" bandage collection familiar to most American audiences. But whoever designed the Robot in this followup had no feel for the concept...or no budget. They could at least have given him some knees, for heaven's sake. In addition, the titular battle is terribly executed and lasts less than 60 seconds. (I've seen shoving matches on junior high playgrounds that are more convincing.) Then the movie basically just stops. That seems a bit of a rip off considering the amount of time the movie spends building up to the battle itself.In spite of all these problems, the movie isn't horrible or incompetent the way a Coleman Francis film or a Larry Buchanan film was. Compared to \"Monster A-Go-Go\" or \"Attack of The Eye Creatures\", \"RVTAM\" is like a Coppola film. It's just kind of dull and boring and silly. The actors are competent (in a mannered B movie way) and reasonably photogenic; Dr. Krupp, in particular seems to be having a wonderful time as he leers and plots and capers about in his cape and \"Phantom Of the Opera\" suit. I often found myself rooting for him, in spite of his being the villain. Anyway, I've seen much, much worse. File this with \"Samson Vs The Vampire Women\", under \"interesting Mexican juvenile oddities\".","Yet another K. Gordon Murray import from Mexico aimed mainly at kids, but actually fun for anyone who fancies humanoid robots controlled by mad scientists, or ambulatory mummies.  It entertains on about the same level as those old movie serials.  Great black and white photography, nice ominous atmosphere.  All the actors offer sincere performances, but deserving of special honourable mention is Luis Aceves Castaneda as the gleefully wicked Dr. Krupp; rarely has an actor enjoyed a mad scientist role so much!  The English dubbing is another matter, but if you enjoy old-fashioned mummy/musty crypt horror films, you could do worse.","Despite having a very pretty leading lady (Rosita Arenas, one of my boy-crushes), the acting and the direction are examples of what NOT to do while making a movie.Placed in southern Mexico, Popoca, the Aztec Mummy (real Aztecs, by the way, DID not made mummies) has been waken up by the lead characters and starts making trouble in Mexico City suburbia, during the first movie (The Aztec Mummy). In this second part, the leading man and woman want to find th mummy and put it in its final resting place (a fireplace would have been my first choice...)Into this appears The Bat, a criminal master-mindless stereotype of a criminal genius who creates a \"human robot\" (some idiot inside a robot SUIT) to control Popoca and (get this) take over the world. The final match between the robot and the mummy is hilarious, some of the worst choreography ever witnessed. The funniest part is that this movie was made and released by a serious Mexican movie studio!The acting is just as awful hearing the movie in Spanish as it is in English (they dubbed the over-acting!). You should watch this movie through MST:3000. The comments are even funnier.","I saw this on Mystery Science Theater 3000, and even that show couldn't really make this movie bearable. I could make a better movie with a broken camcorder and action figures. Of course, you expect terrible special effects with a movie this old, but I've seen silents that were better. The storyline has enormous gaps that leave you trying to figure out why they are even at certain scenes. The cameraman apparently doesn't know what a tripod is, and had too much coffee, or something harder maybe, because the camera is ALWAYS shaking around. I couldn't even follow the plot, but suffice it to say, this is the absolute worst movie I have ever seen in my life.UPDATE: I saw \"Epic Movie\" a while back and have decided to give this movie a 2. It's NOT the worst movie I've ever seen anymore!","*Spoiler/plot- 1957, Rather mad scientist movie about a scientist robot makers that gets his human heart powered robot to attack and steal an secret Aztec treasure protected by a dangerous Aztec mummy. The Mexican wrestler, The Saint, becomes a policeman to oversee the drama.*Special Stars- Ramon Gay, Rosa Arenas *Theme- Mummies are too dangerous.*Based on- Frankenstein and mummy myths.*Trivia/location/goofs- Mexican film featuring private investigator wrestlers, Aztec mummies and robots.*Emotion- The is solid fodder for the MST3000 TV show for the worst films. This film has a tremendous lead-up during the suspense of this epic. The overly dramatic corny scene music out does what's on the screen. The characters mostly over act with huge gestures ala a theatrical performance. The villain, The Bat, eats up the scenery and out shines all others in the scenes with him. The money spent on the human atomic robot of the villain is ordinary to see. The use of the robot after the build up is very slow and pedantic for in-terminal minutes of boredom. The end has the Aztec mummy to be the honorable hero warrior as he destroys the robot after the electronic control is broken with a gunshot from police. The female lead gives the mummy the stolen Aztec relics that she stole many long minutes ago. The mummy just leaves peaceably and the shows end is a real downer. Not drama, no fight scenes, no nothing worth watching. A campy film that makes the ring wrestlers of that time into heroic men that fight to restore the Aztec treasures and mummy.","The first 2/3 of this film wasn't that dissimilar to the American mummy films of the 30s and 40s. Two lovers in ancient Mexico dared to defy the law and were doomed to die. One became an Aztec mummy whose job it was to guard the sacred treasure and his lady love. And the lady was reincarnated in the present day and the mummy was naturally attracted to her. So far, it's all the typical mummy film...though it's quite a bit slower and duller than the American versions. Oh, and of course the Aztec mummy looked really, really crappy.However, into this standard but boring film there is a super-villain. Why? I dunno--it sure didn't make any sense to have one. It seems this villain wants the treasure and he manages to hypnotize the lady and have her show them where the Aztec treasure is buried. Why does he need the treasure? Well, to buy the equipment needed to make an army of atomic robots, dummy! But first he has to construct a single mummy to defeat the mummy, as the mummy has so far been unstoppable.You've got to see these \"human-robots\" as they look like the enormous clunky robots from Flash Gordon and other serials BUT they have a rubber head of a supposed dead guy inside! They really look hilariously funny and seeing the conclusion when there is a huge battle between the lethargic mummy and the equally slow robot is worth sitting through the rest of the dull movie. Both battle in super-slow-motion like they are bathed in taffy... and it's done in such an artless and silly fashion that it is bound to elicit chuckles--certainly not thrills.Overall, the film is dreadfully dull and a muddled mess--especially at the end. However, for bad movie fans, it's a must-see--it's bad but unintentionally funny and great to watch and laugh at with friends.","I was expecting this to be even worse than the second entry in the \"Aztec Mummy\" series, but it's basically on a par with it. That said, about a third of the 64-minute running-time is lazily devoted to a reconstruction of previous events (yet again!): the corny Aztec sacrificial ritual is boring enough on first viewing but, watched three times in a row, it becomes positively exasperating!! However, I was gratified for their inclusion because, at least, scenes in which detail was indistinct in the prints utilized for the other two films in the set were far clearer now... Anyway, this hastily-written third (and final) chapter of the saga provides standard excitements  with yet another attempt by the villain (who miraculously escaped the grisly death set out for him at the end of the preceding entry!) at hypnotizing the heroine, in an effort to locate the dormant mummy and its valuable artifacts (which will enable him to lay his hands on the mythical Aztec treasure). All in all, it's a very painless way to kill an hour.The Bat's ravings are at their ripest here (assisted by his acid-scarred lieutenant, the result of an unfortunate encounter with the Mummy in the second film  and whose vengeful predicament introduces an unexpected poignancy to the proceedings!): he conceives a radioactive human robot(!) in order to fend off the inevitable marauding mummy. It's not clear just why the robot needed the body and the brain of a man to function, but the hulking automaton  with its clumsy movements yet deadly exterior  is obviously a topical nod to Nuclear paranoia (which, from what I've seen, wasn't so much a concern of the Mexi-horror subgenre).The one-on-one between the two 'monsters' is O.K.  the robot has the upper hand at first but, once the controlling device is destroyed, the mummy is able to take it apart in a matter of seconds! While the appearance by the hero's pesky brother is thankfully limited this time around, the latter's sidekick  somewhat incongruously  also reverts to his cowardly persona here.With this film's ending, the Aztec Mummy saga is brought to a nice closure  as heroine Rosita Arenas (the reincarnation of the mummy's lover) returns the Aztec breastplate and bracelet to Popoca and appeals to it to seek a definitive (and well-deserved) rest in the ancient temple. I've failed to mention in my comments about the two earlier films in the series, the important contribution of the musical score  simply but perfectly evoking the requisite aura of mood, mystery and dread.","I am a big fan of bad horrors, cheap horrors, b movies, and all that bottom 100 movies, and I do not deny those are the worst stuff ever to enter the big screen, or even your home video for that matter. Some of them, e.g. the infamous Manos The Hands of Fate, are truly bad, and watching them, especially on your own without any friends and beer around, is a torture for a good cinema taste. La Momia Azteca Contra El Roboto Humano, however, was not that bad. Well, of course it's BAD - it's silly, dated, corny, cheap, etc., there's an Aztec mummy, a tin robot, a fat masked villain, a mad scientist, Mexican mobsters, etc. the montage is poor, the lines, well, let's say the lines are not theatrical, the FX and SFX are the best what the Mexican low budget production could've offered, etc. etc. Still, the movie is FUN. it's so bad it makes you laugh cheerfully for an hour time. Sure it depends on one's sense of humor, however I'm pretty sure La Momia should teach any newcomers to this kind of cinema how to enjoy it. Please note: the movie lasts for about an hour, and I think it's just enough time of silliness one is able to easily digest. There's also another thing - watching La Momia can give you a clue what was the whole SF/Horror genre concept back in the fifties, when you compare it to the present day Matrix era of cinema entertainment. I think it also shows how both the industry and the audience evolved, due to the fact the watches like La Momia still attract full house in the theaters for some special shows (movies like this are special alright), and very often receive a standing ovation.","... although the more surreal aspects of this movie might slip by them. I can imagine a theater full of Mexican kids forty years ago just loving this stuff. The production level is on a par with the lesser Saturday Matinée serials of the 40s and 50s, and much of the film is footage from an earlier Aztec mummy film used as flashback, but what the hell. My favorite scene: the villain and two henchmen are stopped in a cemetery by the night watchman who holds them at gunpoint --- and proceeds to stand there doing nothing while one of the goons, in plain sight, calmly walks around behind him and conks him cold with a blackjack. The mind reels! Later on the poor chump gets fried by the radioactive clampers of the titular robot and runs screaming into the night, smoke pouring from the blanket draped over his shoulders, while the camera holds on him for an impossibly long time. A grungy black and white acid trip of a movie.","Ah, such an original title for a very shoddy film.  The dubbing is hilarious since the voices and mouths never seem to match.  As a result, I had no idea what was going on as I watched this mess unfold.  There are flashbacks within the flashbacks and no real time takes place until towards the very end.  The Aztec ceremony had me laughing.  I rewinded it twice and got the best ab workout ever.  The singing Aztec lady is comic naturale and the dancing and costumes are a hoot.  Some guy gets a face full of acid, there's a lot of fighting, you have no idea who any character is (not that I really cared), and it's a whole noir mess.  Oh, and the actual fight doesn't happen for awhile, so during the movie feel free to get up, take a nap, take a trip.  You won't miss anything exciting.","What a film.  Quite possibly the best I've ever seen, the Direction, the Production,the score and the cinematography,absoloutley wonderful. The acting is also excellent, and the Man/Robot scenes have to be seen to be belieived. I can not recommend this film enough. Get it out on video now, turn the lights down and enjoy.","Mexican 'classic' was the third entry in the Aztec Mummy series. As you will soon find out, this movie is anything but a classic, instead, it's more like a movie that deliberately tries to bore you.Some scientist wants to steal Aztec treasure from a tomb, but guarding that tomb is that walking toilet paper commercial: The Aztec Mummy. Knowing he can't beat the Mummy, he then builds a robot, and a very bad one at that. We only get to see Mr.Robot in the last reel, as he clunks around, and does battle with the Aztec Mummy.I have seen a lot of lousy Sci-Fi films, hell most Sci-Fi films I see are lousy, but this one, for it's entire duration of 64 Minuites, is the worst movie I've seen, with Fubar coming in a close second....In conclusion: Don't waste your time.","It's so bad that it's actually funny! Everyone is so stiff and trying. The FX is out of your own backyard and work closet! Have fun!","2/3 of this movie is recycled footage of the previous movies, a fact that's sadly obvious even to someone like myself who hasn't seen the original movies. And somehow it feels like a rip-off even though I haven't seen the stuff before. It's like that episode of every TV show where the characters sit around a photo album or something and you just see recycled footage of other episodes. I've seen some producers do extended montages of recycled footage, but never anything beyond 5 minutes or so. This movie is mostly stuff that had already been seen by audiences, so you could mount a case that it's one of the biggest rip-offs ever foisted on the motion picture public.I got to see it in the theater, in a 16mm print, which is good enough I suppose considering how rare this kind of material must be on film these days. I give the movie some credit for semi-convincing Gothic atmosphere and for unintentional humor, but that's about it. The Aztec mummy monster looks good, even has some mobility in his face which is better than most movie monsters of the period. But the robot is pitiful, although it's interesting that they made the human face totally visible. It's a \"robot human\" or something of the sort as they somewhat explain in the movie. I think that's considered an android. So technically in hard sci-fi terms this movie should be called \"Android vs. the Aztec Mummy\", but I doubt anyone was too worried about technicalities here anymore than they were worried about quality. In fact the movie is so sloppily put together that it makes television look good. Even the dubbing from Mexican into English is lazy and weak -- for example at one point the hero says \"I might as well begin at the beginning....\" what the heck kind of translation is that? Couldn't they at least have him say \"start at the beginning\" so that it doesn't sound repetitive? A high school newspaper editor could have fixed the screenplay of this movie. It's the epitome of utilitarian film-making, just absolutely nothing is in this movie that doesn't need to be there for the basic commercial purpose of the film. They put no more effort into making it than they had to, and considering the extensive recycled footage I would doubt that they actually spent more than a week making this movie.I will now cease posting about it on the principle that I don't want to expend more energy in the process of commenting than the creators of the movie actually expended while making it.","This is a totally awesome movie!  If you haven't seen it yet, you damn well should.  Sure, the plot is slow to develop, the special effects are laughable, the acting is ridiculous and the action is badly choreographed, but as wrestler DDP would say; That's not a bad thing....that's a good thing!  Everything about this movie is hilarious, especially if you get the dubbed version, which has even worse actors.  It's countless laughs until you get to the end, yearning for the sequel, where the mummy fights wrestling women.  Thus, I give it ten stars.  Unless you're one of those 'discriminating' and 'intelligent' people with good taste, who likes only 'high quality' films of the highest calibre, I recommend this utterly monkeydellic movie!","There must be an error. This movie belongs with \"Plan 9\", and a lot others as a quite entertaining, silly diversion. You'll never accept you like it, yet you will watch it whenever it comes out on TV. It's as simple as that."],"review-user":["NotoriousNate","rixrex","newportbosco","mstomaso","Jared G.","evilskip","squeaks-2","MooCowMo","lemon_magic","pmsusana","FrankTG","nylentone","oscar-35","MartinHafer","Bunuel1976","Eliks","horrorfilmx","InzyWimzy","andyrob35","heisalexh","sscialli","funkyfry","haznael","fjhuerta-2"],"review-date":["16 April 2001","14 August 2004","7 January 2007","22 May 2005","8 September 1999","3 October 1999","8 March 2005","28 February 1999","10 June 2006","2 February 2001","16 October 1999","27 October 2004","4 March 2009","6 November 2008","25 June 2007","30 June 2005","27 May 2005","31 October 2000","22 July 2001","22 October 2006","21 October 2018","12 December 2008","20 April 2002","22 September 2001"],"review-rating":["7","3","2","3","2","3","1","2","2","5","2","2","10","1","4","2","10","4"],"review-title":[" Some of the best film bad guys ever!\n"," A whopper of a grade Z movie\n"," It All Started Here...\n"," Queso Fundido vs Carne Asada!\n"," Very goofy and very boring\n"," Watch this &your eyes will bleed & your breath will stink\n"," Human Robot vs. the Aztec Ape-Mummy\n"," Cardboard box fights scaly pile of rags!\n"," Contrary to popular opinion, it won't make you want to gouge your eyes out...BUT...\n"," Lots of fun for fans of mummies and ancient curses\n"," Ridiculous trash made-in-Mexico\n"," Quite possibly the worst movie ever made\n"," Not much entertainment here.\n"," It's a dull and reworked Egyptian mummy film until the final goofy ending!\n"," THE ROBOT VS. THE AZTEC MUMMY (Rafael Portillo, 1958) **\n"," This movie is a pure fun, even if you're not into b-flicks\n"," For children of all ages....\n"," Mexican Mayhem\n"," understated, classic.\n"," I'll never get that hour back\n"," Hahahaha\n"," It's a disaster\n"," Muy Bueno!\n"," Mistake!\n"]}