{"review-url":["http://www.imdb.com/title/tt0062429/reviews"],"review-text":["\"When I die, someone will bury me.  And if they don't, what's the difference.  Who gives a damn, huh?\"  Thus the philosophy of life (or lack there of) is summed up once and for all in this less than classic but nevertheless fun spinoff of Sergio Leone's \"Dollars Trilogy.\"In the opening scene, three obviously evil gunmen ride into a western town and, with menacing glares, they intimidate all the pathetic normal people hiding in their homes.  The observant watcher will notice that each of these three bears a striking resemblance to characters from Leone's For A Few Dollars More.  There is one guy in Eastwood's poncho, one in Lee Van Cleef's black suit, and one seeming to act like Gian Marie Volonte's Indio.  But this movie is not about these guys.  No sooner do they ride into town when they are gunned down by someone even cooler than they, a mysterious bounty hunter known simply as the Stranger.No. this is an altogether different story.In an obvious copying of Leone's The Good, the Bad, and the Ugly, three gunmen are again vying for a hidden treasure.  Once again there is the bounty hunter and the Mexican bandit.  The Stranger (George Hilton) is a supercool bounty hunter with a penchant for shooting people while dressed up like a priest.  He is after the reward for the bandit Monetero (Gilbert Roland).  But when Monetero's gang steals three hundred thousand in gold coins, the Stranger gets sidetracked from his normal line of work.To round off the trio there is Edd Byrne's corrupt bank executive, Clayton. He too wants the money for himself.  But after the money is hidden away, the only man who knows where it is gets shot.  Now the only clue to the hiding place is a medallion that shows a family crest.  The game is too find the treasure before anyone else does.  And any gun can play.With plenty of gunfights, fist fights, and double crosses, the action takes these three to the ultimate showdown ripoff, a three way draw for the hidden treasure ala The Good, the Bad, and the Ugly -- but with a twist.This movie is not as good as Leone's films, of course, but in the end who gives a damn, huh?  This movie is fun -- 60s nihilism, spaghetti western style.  There are no rules, no enduring loyalties, and no right or wrong -- just the treasure and whatever it takes to get it.  And, though the movie is not classic, the ending surely is.  Hey, maybe we all can get along after all, for a hundred thousand a piece.If you like spaghetti westerns, check this one out.  It is fast, furious, and worth the look.","Leonard Maltin gave this film a dreaded BOMB rating in his 1995 Movie and Video Guide. What film was he looking at? Kid Vengeance or God's Gun are bombs. This film is a delight. It is fantastic. It is literate. It is well mounted. It is beautiful photographed, making a brilliant use of colors. Right from the opening scene the film grabs your attention and tips you off that this film is a well-done satire of the whole Spaghetti Western genre. The film is played for laughs from the beginning to the end with homages to Douglas Fairbanks, 77 Sunset Strip, and the famous showdown in the Good, the Bad, and the Ugly. Edd Byrnes, George Hilton, and Gilbert Roland work brilliantly together to make the satire work. It is too bad Mr. Maltin rated this film so poorly as it is undeserved. One can only guess as to his reason. I suspect that he missed the point of the movie entirely and was expecting something more serious than this film is meant to be. Kudos belong to everyone involved in this project. This film is a little gem waiting to be discovered by people who care about literate movies and appreciate satire.","A group of bandits rob a train of the gold shipment it is carrying. In their escape, the bandits split up. The one thief who knows where the gold is hidden is killed before he is able to talk. Three men have a different part of the \"clue\" that will lead to the gold. Can the banker, the bandit, and the bounty hunter work together to locate the missing loot? Or, will they kill each other first? - The plot is an obvious take-off of Leone's The Good, the Bad, and the Ugly. Various scenes in the movie are also lifted from other films by Leone, Corbucci, and more. But, to me, it's done in a way that doesn't show disrespect to the original work. Instead, Any Gun Can Play lovingly parodies some of the biggest films in Spaghetti Western history. The opening scene of three men riding into town and the final face-off between the three main stars are a wonderful homage to the SWs that came before.Castellari adds a lot of nice touches of his own - the reflection in the spilled wine, the Stranger's entrance with the vivid red background, and the playful way the gold is discovered in the end. Although highly unbelievable, many of the fight scenes are well staged and directed. Two fight scenes in particular (the market fight and the bath house fight) are very nicely done. He is also unafraid to try different things with his camera. Tight close-ups, overhead shots, and shots around corners are all common in Any Gun Can Play.Another plus is the cast that Castellari had to work with. George Hilton is always good in these movies. Gilbert Roland is literally playing Gilbert Roland. And SW newcomer Edd Byrnes holds his own with the two SW veterans. The supporting cast features, among others, SW regular Gerard Herter.Any Gun Can Play should not be taken too seriously. Nice touches of humor can be found throughout the movie. If this is possible with an SW, it's more of a \"feel good\" movie - very reminiscent of some of the Terence Hill / Bud Spencer films.","I watched this today after not having seen it since it was released in 1968. It was a lot of fun, but admittedly it is not the equal of the Sergio Leone works, or even those of Sergio Corbucci - although both are spoofed here.In the opening scene we see a trio that has two resembling Eastwood and Van Cleef's characters in FOR A FEW DOLLARS MORE and another who is clearly based on Franco Nero's Django. Clearly here Castellari is letting us know that he's going to have some fun at the expense of what had preceded him in the spaghetti western canon. George Hilton's bounty killer dispatches these three and we're informed that his next target is Monetero, played by veteran Gilbert Roland, then in his early 60s and still the epitome of machismo elegance. At this point he had been in the business for 40 years, and with the slightest of gestures, blows away his younger cast mates.Monetero and his gang rob a gold shipment from a train loaded with the cavalry as well as Edd Byrnes playing a bank employee. Kookie, Kookie, lend me some money. His gang gets away with the loot, but the money gets away from Monetero. The bank man is after Monetero for the gold shipment, Hilton's character (\"They call me the Stranger\" - a nod to Tony Anthony's films?) is after him for the reward, and the rest of the film play out a series of crosses and double-crosses, all with a fair dose of humor. The film even anticipates some of the later spaghetti westerns - particularly Gianfranco Parolini's \"Sabata\" films which also relied heavily on circus-styled gymnastics. Byrnes' character Clayton gets into some Faibanksian-styled gymnastics fights with both Hilton and later about six members of Monetero's gang, and then later both Byrnes and Hilton take on many of the same gang in a bathhouse.None of this is to be taken any more seriously than Terence Hill's antics in MY NAME IS NOBODY, it's probably just that this early in the game, it wasn't obvious that it was a spoof as the sub-genre was barely around for four years. A scene where Hilton and an insurance man spot each other through binoculars tips its hat to a similar scene in FOR A FEW DOLLARS MORE, and the overall tale of three men and the search for hidden gold is obviously based on THE GOOD, THE BAD AND THE UGLY. But the best homage comes at the end, a face-off among the three main characters that satirizes the similar scene in the latter film. Only the music fails to make the point here, whereas in other scenes the score is appropriate - as long as one keeps in mind that this is just an affectionate spoof, and on its own, it is an appealing film. The leads are more than capable - although the looping is often flat, and the production design quite attractive. Even at 105 minutes, the film moves quickly and never runs out of steam.","Three men looking for a hidden loot , they are : A cynic bounty hunter (George Hilton) going after the reward , a Mexican outlaw named Montero (Gilbert Roland) with a band of fanatic hoodlums (Ignacio Spalla, Riccardo Pizzuti, Jose Torres, among others) , besides a greedy bank clerk (Eddie Byrnes) and an insurance agent (Gerard Herter).This is a cool Spaghetti Western in Leone style . The movie takes parts from ¨For a few dollars more¨ and especially ¨The good , the bad and the ugly¨ . The film is plenty of action , fun , shootouts and results to be a surprise-filled entertainment . The picture contains funny gun-play along with fist-fight very much in the Terence Hill/Bud Spencer territory . The violence isn't crude but it suits light-weight comedy fun , though no silly slapstick like the ¨Trinity and Bambino¨ series . The movie is starred by habitual Spaghetti as George Hilton (Sartana) , Gilbert Roland (Sonora, Goldseekers , Johnny Hamlet), Edd Byrnes (Seven Winchester for a massacre) , besides ordinary secondaries : Pedro Sanchez or Ignacio Spalla, Gerard Herter , Sal Borgese , Jose Torres.. The picture displays crazy characters with twists plots and is quite amusing . In addition , a really catching score musical by Francesco De Massi . Enzo G. Castell in his first film and original Western makes a nice camera work with usual zooms and clever choreography on the showdowns , after he made more Western as ¨Johnny Hamlet¨ , ¨Tedeum¨ , ¨Kill them everybody and came back alone¨, ¨Seven Winchester for a massacre¨ , ¨Cipolla colt¨ and the masterpiece : ¨Keoma¨. Some of them are serious , others are goofy and plenty of slapstick and slapdash . This is a straight-forward story , funny in lots of parts and it will appeal to Spaghetti Western fans.","George Hilton never really grabs me like Franco Nero or Clint Eastwood, but this is a great outing for him. Basically rippin off the Django/man With No Name and doing a damn good job. The opening sequence of this gem is a classic, and the cat n mouse games that follow are a delight to watch. Fans of the genre will be in heaven.","Edd \"Kookie\" Burns, one of TV's greatest teen idols leads this spaghetti western which was also known as For a Few Bullets More.This was somewhat a parody of the Eastwood/Van Cleef westerns as everybody looked just too damn pretty. Their clothes always looked clean, their teeth looked as if they just cam from the dentist and had a whitening, and Edd Byrnes reminded me of Randolph Scott - his hair looked perfectly in place after a big fight.There was a lot of shooting, but mostly a lot of brawls.George Hilton, a spaghetti western favorite played the bounty hunter (The Stranger) and played it mostly for laughs, even though he did some fancy Clint Eastwood shooting.Golden Globe nominee Gilbert Roland (Cheyenne Autumn, The Bad and the Beautiful), with over 140 movies to his credit, played the outlaw leader.It had the elements of a good spaghetti western, but was funny also.","\"When I die, someone will bury me. And if they don't, what's the difference. Who gives a damn, huh?\" Thus the philosophy of life (or lack there of) is summed up once and for all in this less than classic but nevertheless fun spin off of Sergio Leone's \"Dollars Trilogy.\" In the opening scene, three obviously evil gunmen ride into a western town and, with menacing glares, they intimidate all the pathetic normal people hiding in their homes. The observant watcher will notice that each of these three bears a striking resemblance to characters from Leone's For A Few Dollars More. There is one guy in Eastwood's poncho, one in Lee Van Cleef's black suit, and one seeming to act like Gian Marie Volonte's Indio. But this movie is not about these guys. No sooner do they ride into town when they are gunned down by someone even cooler than they, a mysterious bounty hunter known simply as the Stranger.No. this is an altogether different story.In an obvious copying of Leone's The Good, the Bad, and the Ugly, three gunmen are again vying for a hidden treasure. Once again there is the bounty hunter and the Mexican bandit. The Stranger (George Hilton) is a supercool bounty hunter with a penchant for shooting people while dressed up like a priest. He is after the reward for the bandit Monetero (Gilbert Roland). But when Monetero's gang steals three hundred thousand in gold coins, the Stranger gets sidetracked from his normal line of work.To round off the trio there is Edd Byrne's corrupt bank executive, Clayton. He too wants the money for himself. But after the money is hidden away, the only man who knows where it is gets shot. Now the only clue to the hiding place is a medallion that shows a family crest. The game is too find the treasure before anyone else does. And any gun can play.With plenty of gunfights, fist fights, and double crosses, the action takes these three to the ultimate showdown ripoff, a three way draw for the hidden treasure ala The Good, the Bad, and the Ugly -- but with a twist.This movie is not as good as Leone's films, of course, but in the end who gives a damn, huh? This movie is fun -- 60s nihilism, spaghetti western style. There are no rules, no enduring loyalties, and no right or wrong -- just the treasure and whatever it takes to get it. And, though the movie is not classic, the ending surely is. Hey, maybe we all can get along after all, for a hundred thousand a piece.If you like spaghetti westerns, check this one out. It is fast, furious, and worth the look.","After 77 Sunset Strip ended its TV run in 1963 Edd Byrnes who became the legendary teen idol Kookie from the show was having some trouble sustaining his 15 minutes of fame as most teen idols do. By 1967 he was off to Europe to see if spaghetti westerns would do for him what they did for Clint Eastwood. Any Gun Can Play bares some faint, but very faint resemblance to Clint's pasta epics.Byrnes and Gilbert Roland are the only two names American fans will know in this cast. The nominal lead is George Hilton who really is from Uruguay and named Jorge Hill Acosta y Lara and he plays a bounty hunter who's after Roland and $300,000.00 Roland and his gang robbed, but that one of his own men stole what the stole and hid it. Edd Byrnes is the banker they stole it from, but he's got his own plans for the loot.Any Gun Can Play has a real hard time making up its mind whether it is being played straight or it's going to be a satire on the genre. About 2/3 of the way through the film it switches gears, almost like a new team of writers were brought in.I didn't really enjoy Gilbert Roland in this and that's hard for me because he's good no matter how bad the film is. But for his sake I hope his paychecks all cleared.","There's considerable amount of money behind this production, so the look of it is very good. It includes some interesting appearances by Gilbert Roland, Eddie Burns, and a brief cameo at the beginning by Christopher Lee. There are a few exciting gunfights, and a humorous bit or two - the satire on Django, the Man with No Name, and Sabata is amusing, especially when they are given the names of failed presidents of the Mexico revolution.The trouble is, there isn't any purpose in satirizing the Spaghetti Western as is attempted here. The key element in the Spaghettis is IRONY, which easily blends into comedy; in fact the source of all Spaghetti's is Kurosawa's Yojimbo, which is universally recognized as one of the great black comedies of all time, and most Spaghettis easily slipped over the edge into real comedy of a very sophisticated variety. Perhaps the best evidence of this is found in the Trinity films, which are both openly Spaghettis and openly slap-stick comedy. So why bother satirizing a genre that - by its very nature - satirizes itself? Consequently, I found the whole enterprise essentially unconvincing. None of these characters were people I would ever care about, the story was generically cliché, and the production values only reflected the money involved, not the passion of the director. Over all, a banal and futile effort to cash in on the phenomenon it mocks.","Lately, I've been watching a lot of westerns from the 1930s to the present. There are some great low budget spaghetti westerns from the late 1960s and early 1970s. This movie had all the elements of a decent western: a good story with talented actors and everything else. Although, it's a spoof of this genre, and for me the way it was done just didn't work and made for a disappointing movie.This movie can easily be divided into two parts.The first part is great; it has a great opening scene and an interesting story develops of a bounty hunter (a.k.a. the stranger) going after a bandit who is going after a large bank shipment guarded, in part, by a banker. Over the course of the movie these three characters form shifting alliances in an attempt to get the money. There are subtle comic nods to the contrivances of earlier films from this genre, but the comedy doesn't disrupt the overall story.The second half of the film is where the comedy goes over-the-top and essentially ruins the movie. The turning point is right at the part where the barmaid causally scolds the dwarf to stop shooting the customers as she goes about waiting on other patrons seemingly oblivious to the four dead bodies laying about the place. From this point onward the movie shifts from a decent spaghetti western with comic undertones to a stupid-silly spoof.There are three horrible fist-fight scenes (one at the river, one in the market and one at the baths) that follow in rapid succession as if one wasn't bad enough. The fighting is so fake it's ridiculous, and since the sound is out-of-sync with the picture it makes it even worse. In the market fight scene the banker bounces about the place on hidden trampolines and twirls around on poles like he is in the circus; it's clownish. Although, the worst part of these fight scenes is the music; it's this light-hearted, sprightly mix more suited for a square dance or a cheesy episode of 'Hee-Haw'. These scenes practically derail the main story.Overall, this movie was disappointing because it had a lot of potential as a decent western, but the comic turns just mucked it up. If you want to see a good western spoof then see 'Blazing Saddles'. If you want to see a good spaghetti western, then avoid this movie.","A gang of bandits lead by the shrewd, rugged, ruthless Monetero (a perfectly imposing performance by Gilbert Roland) steals $300,000 worth of gold coins during a daring train robbery. But untrustworthy member Bahunda (an amusing turn by Jose Torres) makes off with the coins and hides them. Unfortunately, Bahunda gets killed before he can tell Monetero where he stashed the booty. So Monetero has to join forces with cunning, cocky, enigmatic bounty hunter the Stranger (smoothly played by the handsome George Hilton) and cagey, corrupt banker Clayton (a delightfully weaselly portrayal by 50's teen idol Eddie \"Kookie\" Burns) to find the coins. Skillfully directed by Enzo G. Castellari, with a clever, complex and twist-laden script by Castellari, Tito Carpi, and Giovanni Simonelli, a playfully amoral and nihilistic tone (everyone keeps double and triple crossing each other with happily greedy abandon), a twangy, flavorsome, spirited score by Alessandro Alessandroni and Francesco De Masi, plenty of stirring shoot-outs and rousing rough'n'tumble fisticuffs, a wickedly sly sense of self-mocking humor, a steady pace, and a real doozy of a surprise ending, this giddy and often hilarious feature makes for an inspired send-up of Sergio Leone's \"The Good, the Bad and the Ugly.\" Popping up in nifty secondary parts are the luscious Stefanie Careddu as Monetero's fiery gal pal Marisol, Ivano Staccioli as a hard-nosed army captain, and Gerard Herter as flinty lawman Lawrence Blackman. An immensely amusing and enjoyable romp.","This movie does have its moments. For instance, the opening segment features three badmen obviously modeled after the main characters in \"The Good, The Bad, and the Ugly\", only they are like inferior, generic, \"Rent A Center\" versions of Eastwood, Van Cleef and Wallach; and you think, \"Oh geez, are we going to have to watch these wannabes for a whole movie??\" Only then they get killed off by the \"real\" hero, and you breathe a sigh of relief. I liked the movie a lot for that.It actually took me a while to realize that this was more of a \"spoof\" of GBU than a rip off, I thought the title (\"Go, Kill, and Come Back\") represented some ESL translator's clumsy attempt at Spaghetti Western nihilism...but later I realized that it was meant in fun. (The original title, \"Any Gun Can Play\" would have made it a lot more obvious.) In my defense, most of the scenes are devoted to straightforward action, gun-play, and exposition. For instance, the train robbery scene was done \"straight\" and fairly well, and most of the other actual killings and gunfights weren't at all campy or cheesy in any way I could see. And Gilbert Roland played his role absolutely straight throughout the movie. (BTW, now that I've actually seen him act, I understand what all the fuss was about. What a great screen presence!) And with a lot of the minor roles, such as the bandits' chief assistant, who could tell the difference? So here's my main problem with the movie. Anyone who has paid any attention to \"The Good, The Bad, and The Ugly\" knows that it is already packed full of dead-pan gallows humor and misanthropy. The characters are both enigmatic and completely venal - you never know what they are going to do or say, but you do know that it will be consistent with everything else that has been revealed about them. That's what makes it watchable; without that humor, the movie would have been a mind-numbing death-march toward a pointless conclusion with despicable characters we hated and wanted to see dead. Think about it; Eli Wallach's character \"Tuco\" was already a comedy relief character (much of the humor and jokes were at his expense) and Eastwood and Van Cleef got off deadpan one liners in almost every scene. The famous three-way \"Mexican Stand Off\" is funny, because when Tuco discovers that his gun was empty the entire time, his outraged reaction is priceless. Even the very last scene is screamingly funny and the resolution, perfectly timed, evokes a huge sigh of relief (although once again, it is at Tuco's expense.) \"Go Kill and Come Back\" simply isn't as good - or as funny - as the movie it spoofs. Most of the scenes, even the intentionally funny ones, drag on far too long; substituting broader, more genial humor for dead pan misanthropy and overcomplicated plot twists for atmosphere and character revelation relegate it to \"minor league\" status. As a contrast, the Terence Hill and \"Trinity\" movies, which have much of the same feel, are much funnier and show what can be done it the screenplay really wants to be tough and funny at the same time. If GBU had never come out and this movie was released, it still would have sunk without a trace except for the archives of Spaghetti Western fanatics.Still, \"Go Kill\" is not all that bad viewed as a pastiche. It was worth watching just to see Gilbert Roland in a major role.","This enjoyable Euro-western opens with a scene that predates a similar scene that Sergio Leone wanted to shoot for \"Once Upon A Time in the West\" but couldn't persuade Clint Eastwood to appear in. Three tough-looking gunfighters ride into a town. One is dressed like the Man with No Name in a poncho. Another is dressed like Colonel Mortimer from \"For A Few Dollars More,\" and the third is garbed like Django, except he rides a horse instead of pulls a coffin behind him with a machine gun in it. Our hero meets them in Main Street behind a wagon loaded with three coffins. \"Any Gun Can Play\" is a spaghetti western with an in-joke on spaghetti westerns since the hero here wipes out the three killers. Aside from a little too much comedy, especially in the acrobatic fight sequences, this is an above-average oater.The notorious Mexican outlaw Montero (Gilbert Roland of \"Barbarosa\") and his gang of trigger-happy pistoleros rob an army train transporting $300-thousand dollars in gold coins across the frontier. Director Enzo G. Castellari of \"Inglorious Bastards\" stages the hold up from a variety of camera angles that thrust you into the forefront of the action. The bandits seize the locomotive along with the coach carrying the gold and separate it from the rest of the train that houses the U.S. Cavalry. While Montero and his gunmen keep the Cavalry pinned down, Pajondo (Pedro Sanchez of \"Sabata\") commandeers the locomotive, kills the engineer and his crew and trundles it away, leaving the other pistoleros behind to fend for themselves. Essentially, Pajondo double-crosses Montero and steals the gold for himself. Later, Montero catches up with Pajondo at the Rio Grande. Before the bandit can reveal the whereabouts of the loot to Montero, however, a Cavalry sergeant shoots Pajondo dead. Before he dies, Pajondo tells Montero about a medallion that serves as a clue about where he stashed the treasure. The irate Cavalry captain (Ivano Staccioli of \"Commandos\") imprisons Montero, but he cannot loosen the bandit's tongue even after he uses his whip on him. Infuriated by Montero's reticence, the captain threatens to have the Mexican shot if he doesn't talk. Meanwhile, the jailers let a priest speak to Montero, but he really isn't a priest. The six-gun toting Stranger (George Hilton of \"The Ruthless Four\") masquerades as a man of the cloth and rescues Montero from a firing squad. Unfortunately, before Montero is rescued, Clayton (Edd Byrnes of TV's \"77 Sunset Strip\") takes the medallion away from him and keeps it for himself. Clayton is the bank representative that was sent to safeguard the gold. He is horrified that the Captain wants to shoot Montero. Clayton's career at the bank hinges on his ability to recover the gold. The Stranger stages a fire at the fort to distract the firing squad and Montero takes the Captain as hostage and tries to escape, but the Stranger shoots him off the horse. Before the authorities can verify that Montero is dead, the Stranger claims the body for the handsome reward he will receive and he rides out with the Captain's gracious thanks. No sooner have they left the fort than Montero's men show up to rescue him from the Stranger. From this point on, the Stranger, Montero, and Clayton forge short-lived alliances among each other as they search for the gold. Castellari and scenarist Tito Carpi, who has penned a number of spaghetti westerns such as \"A Few Dollars For Django\" and another Castellari oater \"Seven Winchesters for a Massacre,\" rely on clever humor and surprise reversals to keep the action fresh and fast-paced. One cool scene has Clayton seated at a table about to eat his meal when he hears some suspicious sounds from behind him. Clayton pours his drink on the table and sees the gunmen behind him with holstered six-guns.\"Any Gun Can Play\" lives up to its title. In fact, many guns do play, and at least twenty or more corpses pile up before fade-out. This western isn't so much a parody as it is a knock-off of Sergio Leone's \"The Good, the Bad, and the Ugly.\" Mind you, bad guys and good guys fall as frequently as ten-pins in a bowling alley, but their deaths aren't depicted in the brutal fashion of a Leone western. \"Any Gun Can Play\" doesn't take itself as seriously as the aforementioned Leone masterpiece. The three leads jockey back and forth for supremacy. Each has a piece of the puzzle that will lead them to the treasure, but they refuse to share their information until the shoot'em up finale. Lenser Giovanni Bergamini's colorful widescreen photography is spectacular, especially the opening shots of the train chuffing along railway tracks with distant mountain peaks rearing up dramatically in the background. Another great shot occurs when Montero tests the Stranger's imperturbable calm. This scene happens after the Stranger has rescued Montero and the Mexican's minions arrive to save their chieftain's bacon. Confiscating the Stranger's six-gun, Montero takes aim at the poncho-clad tough guy and empties the revolver, placing his well-aimed bullets harmlessly in and around the unflinching gunslinger. Bergamini, who photographed Castellari's World War II thriller \"Inglorious Bastards,\" frames the scene with the Stranger in the background and his pistol in Montero's hand in the foreground for a pleasing, three-dimensional style shot. Meanwhile, Francesco De Masi's lively orchestral soundtrack is as memorable for its own idiosyncratic melodies as Ennio Morricone's soundtracks were for the Leone westerns. The opening song is reminiscent of a 1950's Hollywood western with its catchy lyrics and guitar riffs. Although it isn't a major spaghetti western, \"Any Gun Can Play\" is always entertaining nonsense with interesting plot twists and good performances, especially the indefatigable Gilbert Roland who was 62 years old at the time!","The sensational success of Sergio Leone's spaghetti western trilogy (the \"Man with No Name\" films) created a tidal wave of imitators and spoofs that washed over the cinematic landscape. This one, a serious yet whimsical take on the genre, is one of the more enjoyable ones. Hilton plays a bounty hunter who heads out after Roland, a noted criminal who has just robbed a train of $300,000 in gold. Byrnes is a bank officer who was escorting the gold and who now wants to recover it. These three men compete with each other and sometimes align with each other in order to reach the treasure which has been buried somewhere and can only be found by using a medallion carrying a family crest on it. The medallion has been cut in two, meaning that the pieces must be reunited in order for the gold to be located. Lots of fighting and back-stabbing takes place on the road to the finale. Byrnes, though top-billed, is actually playing a more supportive role here. His famous hair looks quite ridiculous in the old west setting and he's no great actor, but he manages to drum up a few effective moments, notably when he decides to take on Hilton in a fistfight. Hilton is incredibly handsome and sexy. Again, he's not an actor that's going to raise the roof, but he does very well in his cocky and mysterious role. Roland adds presence and weight to the film and is effectively sly and dangerous. The film deliberately pays homage to other, greater spaghetti westerns in a tongue-in-cheek way. There are plenty of creative camera angles, intense stare-downs and elaborate fight sequences that go on too long on purpose. The facial blows are given a cracking whip sort of sound effect, enhancing the camp factor. The music for the film is enjoyable, too, and there's a hilarious Frankie Laine-esquire song over the credits referring to \"The Stranger\" (Hilton's character.) Careddu, sporting impossibly red hair, appears as Roland's cohort and lover. It's not a film to be taken seriously, but rather a gentle parody of the type of western that was being churned out at the time in droves. On that level, it succeeds rather nicely!","A train holding union soldiers is transporting $300,000 of gold, along with a banker Clayton, who's there to see it reaches its destination, but it's suddenly robbed by the bandit Monetero. However Bahunda nicks off with the gold and hides it, but when Monetero tries to get it out of him, he's killed by soldiers. The only clue is that of a medallion, but Monetero is captured and soon would be executed. A stranger dressed up as a priest comes by (who after the bounty of Monetero) and offers to save his life for half of the gold. In exchange Monetero gives him half of the medallion, but Clayton notices it and discovers something is up. Soon all three are crossing each other for the gold, but also the bank's insurance company and Monetero's gang are watching on, waiting for their chance to pounce.Just watching the opening sequence you'll know you're in for a spaghetti western with a tongue-in-cheek style and a reliance of sprinkling many references (some nicely realised) from other films (largely the Dollar trilogy) of its sub-genre. Director Enzo Castellari's sprightly direction is sprawling and mostly lightweight, but there's potential in many of his grand, showy set pieces and smooth rhythmic pace. Largely there's a lot of tussles, fist-fights (and plenty of acrobatic stunts) taking place, compared with all-out vicious shootouts. However most of these stunts are very well done, and very enjoyable and when the guns are blazing there's energy to burn. The traditional story sticks close to conventional details, but since there's a lot of conniving and outfoxing going on, the spontaneous nature makes sure you're never quite certain how it's eventually going to play out between the three. This leads up to many effective suspenseful moments, clever twists, and plenty of wink, wink. The humour within the starch script is pretty sly. Worked in favourably amongst the light and zesty style, is Giovanni Bergamini's dynamically taut framing and Francesco De Masi's impulsively rousing music score. The performances are extremely well tailored and form a striking rapport. George Hilton's wry and scuffed turn is solid as the ambiguous stranger. Gilbert Roland brings class and intelligence to his formidable Mexican bandit Monetero. Edd Byrnes gives a poised performance as Clayton, that holds up well. Kareen O'Hara doesn't get much to do, but is a worthy looker. Gerard Herter, Pedro Sanchez and Ivano Staccioli provide able support.A fun and worthy spaghetti parody/homage that throws one curve-ball after another and many fruitful down 'n' dirty antics.","\"Any Gun Can Play\" probably has more 'vamanos' and 'andeles' than any spaghetti Western out there, while mixing in it's share of black hats, stogies, beards and ponchos. The opening scene is a blast, it will make you sit up and take notice of some familiar, yet unfamiliar characters who aren't around long enough to worry about. The film keeps you guessing as to the relationship of it's three principals, as alliances are made and broken with tenuous regularity, with bandit Monetero's lady even switching sides when it suits her.I got a kick out of the way the self proclaimed 'Stranger' (George Hilton) kept raising the ante on the reward for Montenero's (Gilbert Roland) capture, and wondered if the authorities were on the same page. Even though Edd Byrnes' 'kookie' persona kept intruding, he still managed to maintain a sufficiently duplicitous posture as banker Clayton. The slick move he pulled with the spilled drink to catch a reflection struck me as surprisingly clever. The best though was taking up the pugilistic stance to mix it up with the Stranger, that was hilarious! The movie has some outstanding cinematography purporting to be the border of Mexico and it provides a great scenic backdrop to the action. The 'tres cientos mil' dollars at the core of the story is never seen until the end of the picture when it showers the principals and even then, I had the impression that if the three hombres had it to do all over again, it might have gone an entirely different way.","Undoubtedly, the least among the Spaghetti Westerns I've been watching lately: basically a low-brow rip-off of Leone's THE GOOD, THE BAD AND THE UGLY (1966) with three disparate characters outwitting one another (and occasionally forming shaky alliances) in their search for hidden gold. Leonard Maltin rated it a BOMB; while it's harmless enough, it's also totally routine and, fatally, the three main roles are stereotypes, that is to say, uninteresting: Eddie Byrnes is a bank employee with ideas regarding his consignment being transported by train; Gilbert Roland is the \"legendary\" but ageing Mexican bandit (his frequent lapses into Spanish when excited are quite corny!) who, apparently, is still irresistible to women; George Hilton as an enigmatic bounty hunter tries too hard to emulate Clint Eastwood's Man With No Name figure. Director Castellari - whom I saw at the Italian B-movie retrospective held during the 2004 Venice Film Festival, where he came off as the most pompous of the cult movie directors present! - shows little genuine feeling for the Western (on the strength of two above-average Franco Nero efforts in the genre, I ordered his collaboration with Castellari KEOMA [1976]...I'm keeping my fingers crossed now!) and the film's tongue-in-cheek approach is equally lamentable.","ANY GUN CAN PLAY (2 outta 5 stars) Totally routine \"spaghetti western\" starring that guy who used to play \"Kookie\" on \"77 Sunset Strip\". The plot is some convoluted nonsense about some stolen gold coins and various gunmen of dubious motivation trying to track it down. This is one of those \"lighthearted\" westerns... which means lots of labored attempts at \"comedy\"... and some really atrocious music during most of the action sequences (you can tell this isn't Ennio Morricone's work). George Hilton plays a bounty hunter called \"Stranger\"... but he doesn't leave much of an impression... he just doesn't have the style of Clint Eastwood or Franco Nero, who are able to do a lot with a sparsely-written character. The ending is a complete homage/parody of the ending of \"The Good, The Bad and the Ugly\"... though it's barely amusing enough to be considered a \"parody\". The highlight of the movie is the first 5 minutes... which features actors patterned after Clint Eastwood, Lee Van Cleef and someone else (Is he supposed to be Eli Wallach? Franco Nero? It's not very clear...) who are confronted by Stranger. It's an amusing in-joke for fans of Sergio Leone fans and spaghetti western aficionados... but I imagine no one else would see the point.","The film begins with a dandy gunfight, where three bandits are quickly gunned down by a bounty hunter--a bounty hunter who bears more than just a superficial to the Man With No Name from the Clint Eastwood trilogy (FISTFUL OF DOLLARS, FOR A FEW DOLLARS MORE and THE GOOD THE BAD AND THE UGLY).Immediately after, you see this man in a gold train filled with Union soldiers. Naturally, the shipment is attacked and the soldiers all fight like blind guys, so they are quickly neutralized. However, in a twist, one of the bandits cheats the gang leader (Gilbert Roland) and rides away with the gold. Soon, Roland catches up and is about to find out where the gold is hidden. But, just at that moment, the army turns up and kills the traitor....bummer. However, the Man With No Name wannabe thinks Roland knows about the treasure and perhaps a medallion given to Roland by the traitor holds the key. A strange banker, also is thrown into the mix. All three want the gold and all three seem pretty macho.Overall, this is not a particularly distinguished Western. Much of it is the plot, some of it is that George Hilton (a Uruguayan despite the American sounding name) isn't as interesting as Eastwood or some of the other premier Spaghetti Western stars but most of it is because the soundtrack simply sucks. So often the music doesn't even come close to matching the acting and it seems almost randomly added. Plus, it just isn't very good stuff as well. This clearly isn't the work of Ennio Morricone--music master of the Spaghetti genre.Overall, just a time passer--and not a particularly good one to boot.","I don't get why some Spaghetti Western critics and fans said that this film directed & written by Enzo G. Castellari, with some help from co-writers, Romolo Guerrieri & Tito Capri is a complete rip-off, of director, Sergio Leone's 1966's masterpiece, 'The Good, the Bad, and the Ugly'; when in truth, it's really does not mirror that film that well. Don't get me wrong, the concept of three corrupt gunmen having to team up, and double-crossing each other in a cat and mouse game, in order to find ambiguous clues of the whereabouts of a hidden treasure, does sound familiar. Plus, the way, this film was shot, with certain scenes in very extreme close up or drawn out to stage gun sequences, with hands slowly reaching the holster, might look like it came from Leone's work; but the similarities end there. For starters, this movie doesn't have anti-war message, like the others, as the film isn't set during any period of historical wartime. Also it doesn't focus, too much on military supporting characters and their sense of morality. They barely made appearances after the first half. Instead, the movie focus on a group of bankers, and their morality bankrupt ways in getting the gold; along with Mexican gang members who willing to betray, one another for the chance to get near it; as surrounding characters. Another big different is that this movie doesn't do a good job, deconstruction the old west romanticism like Leone, did with his gritty, over violent action sequences. This film somewhat lost some realistic ground, with it's over the top cheesy fake-looking gymnastic trampoline style stunt work & pulp adventure style sound effects during fist fights. There are even comedy sequences where people fight in their underwear, in a bathhouse, and in a saloon with a midget helping out the protagonists. It's all quite ridiculous. Plus, these scenes practically derail the main story, as it adds to the runtime, as mindless filler. Because of that, it made the movie, so badly paced. Nevertheless, my main beef with this movie; is that the director doesn't seem to know exactly how he wants to approach the subject manner. It's felt like a hodgepodge of childish comedies and adult driven dramatics. The direction was all over the place; making it, very jarring to watch. Regardless of that, the movie is very well shot. I like, how the director & his crew aren't unafraid to try different new things with their camera. A great example of that, was the reflection in the spilled wine scene; with one of the main character's entrance being shown in a vivid reddish background; like dip in blood. Another series of amazing shots was near the opening of the film, with the train chuffing along the railway tracks in goldish dusk with distant mountain peaks rearing up dramatically in the background. It was spectacular. It gave the audience, a sense of foreshadowing, on what would happen, next. The ambush action sequence, that follow it, was truly, the best scene in the film. Sadly, the climatic Mexican standoff scene toward the end was not so memorable. It was highly buffoonery. Still, I have to give, props to the main trios of actors. You never know what their characters were going to do or say. George Hilton's wry and scuffed turn is solid as the ambiguous stranger was decent. Italian's Gilbert Roland adds presence and weight to the film and is effectively sly and dangerous as Montero. Not only that, but Roland also brings class and intelligence to his role. He look & felt like sophistical, Clark Gable-like villain. By far, the best performer in the film. While, Byrnes's boyish hair look quite ridiculous, the actor gives a poised performance as Clayton. It still holds up well for somebody that started his career in soaps. As for the rest of the supporting cast. Gerard Herter, Pedro Sanchez and Ivano Staccioli provide able support. While, Stefania Careddu AKA Kareen O'Hara doesn't get much to do. She truly was nice eye candy. In the end, the film had very excellent performances, overall. As for the music. The composition by composer, Francesco De Masi was a mixed bag. The opening song was catchy with it simple lyrics and loud guitar riffs. Yet, the circus like music that played during the fistfights felt bizarre and highly dopy. As for the rest of the music, it felt very average & somewhat forgettable. Not as iconic, as composer, Ennio Morricone's music from 'the Good, the Bad, and the Ugly'. That's for sure. Still, I kinda dig how this movie opens up with three minor caricature of characters from that movie getting gunned down by 'the Stranger'. While, this scene was indeed pointless, as the rest of the film has nothing to do with it. It was a really well-done moment that tries to show, that there is a new badass in the Wild West, even if this later movie isn't as well known. After all, this film did it, a lot better, than the awful opening to 1967's 'Little Rita of the West', which really lampoon, the genre, by having a pop singer kill the well-known harden criminals. It's just sad that there isn't much, good picture & audio quality copies of this film, out there. A lot of the lower priced DVDs will have distinct audio hissing & poor color saturation. Some of them, like the cheap box set collections from Mill Creek and St. Claire are really in bad shape, as they're not presented in widescreen nor great dubbing. Then, there are those foreign DVD copies, under the film's alternatives titles 'Blood River', 'Glory, Glory Hallelujah', '300.000', 'For a Few Bullet More', 'Go Kill and Come Back', that impossible to watch, due to how out of sync, the languages are. Regardless, if you can find yourself, a good copy. This movie is still worth the watch, even if some of the action scenes & jokes don't leave you with a bang.",". . . THE GOOD, THE BAD, AND THE UGLY, the \"Rick Piper\" was so embarrassed to be a lead cast member of 1967's cover picture THE BAD, THE WORSE, AND THE WURST (aka, ANY GUN CAN PLAY) that he invented a single-use alias for his on-screen credit in WURST. Taking place in 1896 near the Italian-Mexican border, ANY GUN CAN PLAY leaves no punch Un-pulled. Though this spoof does NOT involve a single member of the \"Wayans family,\" it might as well have included the whole clan. The \"humor\" of ANY GUN CAN PLAY is so obvious, viewers will expect \"Conchita\" to ask \"The Stranger\" something such as \"Do you want meatballs with your Western spaghetti, Sir?\" The fight coordinator for ANY GUN CAN PLAY appears to be \"Roy Rogers\" (if not \"Dale Evans,\" or even \"Trigger\"). While \"The Lollipop Guild\" is apparently down to its last member here, no one offers to lend it a hand with cleaning up the full-grown corpses littering Aisle Four. If there's one single positive comment to be made about ANY GUN CAN PLAY, it's probably \"At least the trains run on time.\"","\"Any Gun Can Play\" (1967), directed by Enzo G. Castellari, is a very good pastiche of Spaghetti Westerns, especially Leone's. The first half is great, which, apart from the opening which is a direct nod to \"For a Few Dollars More\", with Monco, Colonel Douglas Mortimer and El Indio lookalikes walking into a ghost-town and then promptly killed by a Bounty Hunter called \"The Stranger\", is entirely serious, with great gunfights (especially the train-robbing scene), fast and furious action and nice performances from Gilbert Roland, George Hilton and (who manages well, considering that he is badly miscast) Edd Byrnes. But then, when the film reaches the half-way mark, there is a jokey fist-fight between Hilton and Byrnes. It isn't very funny, and is the weakest part of the film, but it throws everything you have seen previously in a new light. You realise that in fact the whole thing is a spoof of Spaghetti Western conventions, and in retrospect, the first half is so well done that you completely miss this spoof undercurrent. What now follows is a more obvious parody, with even some acrobatic jumping around from Brynes that predates all those seventies Circus Westerns. The ending, a complete send-up of \"The Good, the Bad and the Ugly\" climax, is very well done, as in other hands it could have been very silly. So, a pretty fun Spaghetti Western, that doesn't take itself too seriously. I would recommend it to anyone who likes Spaghetti Westerns.","Bounty killer George Hilton, smooth Mexican bandit Gilbert Roland (who's great), and bank representative Edd Byrnes each try to outwit one-another while searching for a large amount of gold from one of Roland's train robberies that was hidden by a treacherous member of his gang.Though not the greatest that the genre has to offer, It's still breezy enough with a lot of light-hearted, action-filled fun and a satisfying finale.Any Gun Can Play is mainly remembered for it's opening gag where George Hilton easily guns down three outlaws resembling Clint Eastwood, Lee Van Cleef, and Django.The next year, Hilton and Roland were reunited alongside Van Heflin and Klaus Kinski in the highly recommended The Ruthless Four.","There's a great use for Any Gun Can Play.As I age I get weirder and quirkier. I have begun to embrace my second-half-of-middle-age strangeness, but I have trouble embracing a grumpy prostate. A few days ago I was hurting and the Flomax and Ibuprofen hadn't been metabolized yet. I needed to take my mind off my owies so I popped in Any Gun Can Play, a second half of a Digiview twin spin.Ya know, I never thought I'd say this, but a cheapjack spaghetti-western knockoff, filled with bad acting, worse dubbing, and Edd Byrnes' Mount Rushmore hair is damned near the perfect way for a middle-aged man to stop fretting about his prostate.And I timed it perfectly--the drugs kicked in right about the \"third reel.\""],"review-user":["bobcatlew","Diosprometheus","bensonmum2","clore_2","ma-cortes","eros-in-hell","lastliberal","petit76","bkoganbing","winner55","em89072002","Woodyanders","lemon_magic","zardoz-13","Poseidon-3","lost-in-limbo","classicsoncall","Bunuel1976","hokeybutt","MartinHafer","ironhorse_iv","oscaralbert","JohnWelles","FightingWesterner","inspectors71"],"review-date":["9 August 2000","30 May 2004","4 February 2005","10 January 2004","3 April 2007","14 October 2003","5 August 2007","10 July 2008","21 October 2010","18 January 2009","16 August 2008","17 September 2008","8 September 2007","20 July 2007","3 July 2007","8 July 2007","24 June 2006","2 September 2006","5 September 2005","27 June 2009","13 July 2018","27 February 2018","19 January 2010","7 January 2010","7 January 2009"],"review-rating":["8","9","7","6","8","6","8","2","4","4","8","6","8","7","6","4","4","4","6","7","8","7"],"review-title":[" 60s nihilism, spaghetti western style -- cool, violent and fun\n"," Great Satire of the Spaghetti and Matzo-ball Westerns\n"," Nice SW Parody\n"," Any Gun is much fun\n"," ¨ANY GUN CAN PLAY ¨ is a good fun with action , struggles and shootouts by Enzo G. Castell\n"," a good ride....\n"," They call me The Stranger.\n"," cool!!!\n"," No Pay To Play\n"," satire of satire is a double negative\n"," Spaghetti Western Spoof Gone Bad\n"," A very entertaining send-up of Italian spaghetti Westerns\n"," Minor effort that alternates between spoof, homage, and rip off\n"," Entertaining Spaghetti western with the ageless Gilbert Roland\n"," Lesser, but entertaining, spaghetti western with a light touch.\n"," Partners going around in circles.\n"," \"That'll be one bandit less then Clayton, that I'll have to condemn to hell fire.\"\n"," ANY GUN CAN PLAY (Enzo G. Castellari, 1967) **\n"," Dull Spaghetti Western \"Parody\"\n"," Not all Spaghetti is created equally!\n"," This Spaghetti Western is somewhat worth playing. Just wish, it was a little more serious than silly. It got really dumb at times.\n"," If \"Clint Eastwood\" starred in a 1966 flick called . . .\n"," A Fun Spaghetti Western.\n"," Decent No-Brainer Spaghetti Western\n"," Along with the Flomax\n"]}