{"review-url":["http://www.imdb.com/title/tt0081467/reviews"],"review-text":["Screamers is an Italian fantasy film (L'Isola degli Uomini Pesce) bought by Roger Corman and released through his New World Pictures.  Of course Corman has to carve his initials on it by having one of his lackeys (Dan T. Miller) direct some additional gore footage before he has it released in the states.\nL'Isola degli Uomini Pesce is a very entertaining retelling of the Island of Dr. Moreau.  It is 1891 and Claudio Cassinelli is shipwrecked on a mysterious island with a few newly escaped convicts.  Claudio comes across the stellar Barbara Bach and Richard Johnson.  Johnson plays the dastardly Edmund Rackham: a man who is able to manipulate scientist Joseph Cotton into turning the local native population into amphibious deep-sea diving creatures, (they look like a cross between the Black Lagoon creature and one of The Humanoids From the Deep), by convincing Cotton that the mutations are being created for the highest of scientific and humanitarian motives.Having discovered the lost city of Atlantis, Rackham is using the amphibious creatures to loot its treasures.  Sexy Barbara Bach plays Cotton's daughter who has a psychic link with these mutations.  In one memorable scene, Bach takes a midnight swim with these mutants wearing only a thin white cotton dress that leaves little to the imagination. Claudio discovers one of the convicts he has befriended has been turned into a gill-creature and then all Hell breaks loose.Filmed at the same time and in the same location as Zombi 2, Richard Johnson didn't even have to change suits between films. The house where the experiments take place is the same house Johnson uses to conduct experiments in Zombi 2.  Talk about economic filmmaking!The additional footage features a few bloody beheadings, (way to go Roger!), and a laughably bad Cameron Mitchell doing his best pirate imitation.  All that's missing is the parrot.Spanish title: Le Continent Des Hommes Poissons","I finally got a chance to settle in and compare the two versions of this film currently going around -- First, the good old scummy, sleazy Embassy VHS print called SCREAMERS, and then a new fully restored Italian DVD by everyone's new favorite media company, No Shame of Italy.The American adverts about \"men turned inside out\" is as everyone says, totally misleading, and indicative of a Roger Cormanized take on what otherwise would be a superior fantasy-adventure thriller for grown ups. The complete Italian version is a somewhat sprawling, well designed and deliberately paced take on \"Island of Dr. Moreau\", and there's nothing wrong with that. It's a sumptuous, handsome Euro Horror outing with a brain, good plotting, character development, location shooting, period costuming and sets, etc.But I must admit that the 14 year old knucklehead weed puffer still lurking somewhere inside of me got a bigger kick out of the more lurid, sleazy and unkempt Roger Corman version, which has some nice over the top gore, a flashy but preposterous opening segment, and then the bulk of Martino's original film, albeit somewhat abridged to make room for Roger's idea of entertainment. The pacing was somewhat quicker, the shock sequences closer together, and you see just as much of Ms. Bach's fantastic form as you do in the extended Italian version.I still don't have much of an idea about what the specific story concerns though: there are a number of plot twists and incidental characters that were somewhat hard to keep track of. A local voodoo subplot didn't help much, and it's funny how everything culminates in just another fistfight between the noble castaway prisoner and the mad scientist ... Perhaps a few more viewings are in order. I will say this: Fans of the movie should avail themselves of one of these PAL imports and take a look at what is actually a movie rather than just another murky old home video -- the widescreen shot compositions once again reveal that Martino had an eye for filling his screen with interesting stuff. Nobody gets their heads ripped off like in the SCREAMERS print, but it's still interesting stuff, and once again proof that while his standards may have been pretty much confined to the area around the gutter, Roger Corman new good trashy fun when he had it made for him, and side by side these are actually better movies than they had to be.7/10","Sure, most people will designate \"Island of the Fishmen\" as silly and trashy hokum, but can you honestly name one other movie that brings forward THIS many exhilarating themes? This Italian gem stands for pure entertainment and features stuff like voodoo, volcanic eruptions, mutant fish-creatures, the mysterious continent of Atlantis, treasure-hunting, a remote island filled with death traps and utterly mad scientists! All this and much more in one simple movie? Yes, please! Close-minded opponents of Italian horror cinema can easily tag this film as a cheap exploitation version of \"The Island of Dr. Moreau\", but the truth is that this is so much more! \"Island of the Fishmen\" delivers thrills and adventure from start to finish with surprisingly convincing special effects and astonishingly stylish camera-work. The story promisingly opens with a small group of prisoners, survivors of a shipwreck, washing ashore a tropical island. They encounter the sadistic Edmond Rackham who rules over a native tribeand a legion of genetically created amphibian monsters that live in the island's swamps. There are so many twists and additional sub-plots in the story that it's almost impossible to write a summary but, trust me, this gem is worth checking out. Sergio Martino once again proves that he's an ingenious filmmaker who has the talent to be commercial-minded and creative at the same time. He makes great use of the beautiful island location and also the interior sets look very impressive. The staggering underwater footage and imaginative scenery really lift this film high above the normal standards of late 70's exploitation. I don't quite understand why Roger Corman reworked the original so much and released it on the American market under a different title (\"Screamers\"), because there are very few elements open for improvement. The cast members are all Sergio Martino regulars (with the exception of the great Joseph Cotton is a neat supportive rule) and give away great performances. In case you can get your hands on the recently restored German version, you're treated to fifteen uncut minutes of extra action. See it!","This movie surprised me. The box is misleading, the tagline is misleading and the costumes and tone of the film are misleading. The movie is quite gory, well-acted and beautifully shot. The special-effects are top-notch and seem to be ahead of their time, until you realize this movie came out in 1979, not in 1963 like it's tone would suggest. It is a unique take on the Dr. Moreau story, and one of the better versions filmed. The first fifteen minutes are the highlight and the most shocking, but the film doesn't ever really fall apart. Definitely worth-seeing if you are a fan of dramatic costume/horror classics and gore-fests.","Although the video box for many copies of this film claims it is about people turned inside out, this is a total lie.  In fact, apart from the opening segment, the film isn't even a horror movie.  With its sunken treasure, legions of fish people, and mad scientists, it's a lot more like a Doug McClure adventure movie.  Obviously, this film is no work of art, but it's kind of fun to watch...  Just be warned that the beginning is quite gory.","I saw this movie on television as SCREAMERS and loved it. I heard an interesting story about this film. When Roger Corman released it to drive-ins in the summer of 1981, his trailer department sent out an advance trailer which was not actually footage from the film. It was allegedly footage of a naked woman being chased around a laboratory set by a monster. During the film's opening at drive-in's, irate customers complained the did not see the movie they paid to see. Theater owners called Corman and said their customers felt ripped off. So Corman had to run off copies of the footage, and send the positive film to theater owners to splice into the film themselves. Since the footage was never part of the film negative, it has not appeared in any video, DVD or television broadcast. Has anyone ever seen this footage? Anyone who saw this film at a drive-in in the summer of 1981 remember this?","Note: this review pertains to the Americanized version, known as \"Screamers\", devised by Roger Corman. The balance of the original Italian film, \"Island of the Fishmen\", was kept, and a new prologue, written and directed by Miller Drake, and featuring Mel Ferrer and Cameron Mitchell, was filmed. All in all, this movie is great fun. It's pure nonsense, but it throws a couple of different ideas into its brew, with irresistible results for schlock lovers. We have treasure hunting (in two separate eras), biological mutations, the supposed Lost City of Atlantis, and an international cast also including Claudio Cassinelli, Barbara Bach, Richard Johnson, Joseph Cotten, and Beryl Cunningham.Cassinelli plays Lt. Claude de Ross, a military doctor who's one of a handful of shipwreck survivors. They come across an isolated tropical island, populated by Creature from the Black Lagoon type monsters, and a number of humans, chief among them the dastardly Edmond Rackham (the charismatic Mr. Johnson of \"The Haunting\" and \"Zombi 2\"), his female companion Amanda (the stunning Ms. Bach), and her scientist father Ernest (Mr. Cotten).The additional American footage actually doesn't stick out that much from the Italian film; the material was pretty hokey from the start. But it's got tons of atmosphere, a whole lot of beautiful scenery, some pretty gnarly creature suits, and flavourful music composed by Luciano Michelini. The acting in the main story is pretty good, with Cassinelli making for a studly hero and Bach as an appealing leading lady. Johnson comes off the best; he's one of those villains you actually can't help but like. People such as Mitchell, Ferrer, and Cotten were clearly hired for name value and don't get to do all that much.If you're like this viewer, and are partial to this kind of thing to begin with, you should have a fine time watching this.Eight out of 10.","This ambitious film is set in the 19th century, gave a dab of action-adventure with mythology to boot, some shocks of horror and a nod to science fiction if that wasn't enough. \"Island of Dr. Moreau\" it wasn't entirely, though the initial premise is no doubt given nod to.The zoom ins, dated synthesizers and blatantly overdubbed sound effects that usually came with campy Italian cinema can give these pictures charm like no other. However, the inconsistent creature effects and cringe worthy miniatures unabashedly shown in close-ups, instead of rolling in the fog or covering up with shadows, were just asking too much from a viewer's imagination. Most of these films have flaws from cheap production to speedy filmmaking, mirroring what was done in the '50s/'60s, but it's just a matter of how many you are willing to overlook (especially by '79). If really easy, this could be more up your alley. If not, take the detour.The acting and even the English dubbing were of decent and serious caliber to moving this along without being one giant accidental farce; which leads me to believe the producers gave the green light with a tight cast but without realistically scaling back their overzealous production costs. The owner of the island was villainous though a charming and eccentric gentleman, his former Bond-girl (Barbara Bach of \"The Spy Who Loved Me\") wife was an exquisite treat to look at, and the guest of honor, that got there from a shipwreck, was a commanding and confident presence on screen.\"Island of the Fishmen,\" aka \"Screamers,\" was not as mystifying as set out to be as an adult fantasy film. Applied to the goals the filmmakers had and their ability to realistically pull them off, the old idiom \"less is more\" usually works better in these cases, otherwise it's a challenge to step in with both feet and truly let yourself go minus the unintentional smirks. (Also submitted on http://fromblacktoredfilmreviews.blogspot.com/)","Colourful if nonsensical tale set upon an uncharted island where Richard Johnson turns in a decent performance as a mad baddie searching for the lost gold of Atlantis and Barbara Bach doesn't do very much at all. The whole thing looks like much of it was made up as they went along with little bits of excitement every now and again to keep it going. There are some decent bits, I particularly like the home made diving bell contraption that lowers them down to peek at Atlantis and I have a soft spot for the fishmen themselves. Clearly copied from the 'Creature From The Black Lagoon', they are nevertheless pretty distinctive with their big fish eyes and facial colouring and especially effective when seen six or so at a time.","I saw this film in a movie theater in Rochester, NY sometime in the mid 80s. I was fascinated by the tag line \"You will see a man turned inside-out!\" What I saw on the screen really didn't impress me too much, but, considering 15 minutes had been hacked out of it, I'm not surprised at how bad the finished product was.In the years since then I've learned more and more about European filmmakers such as Martino, Argento, Fulci, Franco and others. In fact, I now have several Martino dvds and have been impressed by his talent. I hope to get my hands on a version of this movie that is truer to the director's vision. I'm sure it couldn't be too much worse than what I saw lo those many years ago.","When a group of escaped convicts manage to flee to a remote island,they soon find that their new home is inhabited by a strangely menacing doctor(Richard Johnson of \"Zombi 2\" fame),a mad scientist(Joseph Cotten),his beautiful daughter(Barbara Bach)and a horde of superstitious natives.The tribesmen say that the doctor has created grotesque half-human,half-fish creatures for evil,secretive purposes.And though at first the prisoners do not believe this,as they disappear,one by one,they begin to change their minds.\"Screamers\" is a very entertaining mix of \"Mysterious Island\" and \"Humanoids from the Deep\".There is plenty of gore with really cool decapitation scene and throat tearing to boost.The acting is so-so,but the film is fast-paced and entertaining.Give it a look.8 out of 10.","Fans of Euro-horror flicks - Portland's video/DVD store Movie Madness has a whole section devoted to this genre - can't afford to miss Sergio Martino's gut-busting \"L'isola degli uomini pesce\" (called \"Screamers\" in the United States). Here's the lowdown: some shipwreck survivors land on an uncharted Caribbean island in 1891. The island is inhabited by a landowner, a scientist (Joseph Cotten) and his daughter (Barbara Bach). Sure enough, it turns out that the landowner is making the scientist create a race of fish-men. And while the fish-men remain calm as long as they can drink their potion, they get nasty otherwise.This movie is sort of a mixture of genres: Euro-horror, swashbuckling, voodoo, and maybe a little bit of \"The Island of Dr. Moreau\". But it's mostly an excuse to have the fish-men disembowel trespassers; ya gotta love that! I wouldn't be surprised if the Euro-horror genre gave Quentin Tarantino some of his ideas for \"Grindhouse\". After all, the European horror directors have no scruples about what they show. This is one that you're sure to like.So Joseph Cotten is the only cast member from an Alfred Hitchcock movie (I mean \"Shadow of a Doubt\") who later co-starred with Ringo Starr's soon-to-be wife and Audrey Hepburn's ex (by whom I mean Mel Ferrer) in an Italian horror flick. The things that we see in life...","action packed,with my favorite type of creature.I won't give any of it away if you have'nt seen it,cause it's worth taking the time to sit down and unravel in the mystery of things as presented in this film.It did gets slow at times and those were the moments my mind wondered which does easily anyways but moist of it kept me quietly thrilled,where you keep it in your head instead of letting it out,probably the mood I was in at the time.Special effects and action sequences you could feel made up for the occasional lulls.Of course there'es a duschload of movies out there exactly like this,the film still has it's own style and flavor,which I respect from underground independent horror movies anyways.","1891: Stalwart, morally upright military doctor Lieutenant Claude de Ross (solid Claudio Cassinelli) and several other shipwreck survivors wash ashore on a remote tropical island that's governed with an iron fist by the ruthless and sadistic Edmund Rackham (superbly played to the deliciously slimy hilt by Richard Johnson), who lives on the island with the feisty Amanda Martin (a winningly spunky performance by the ravishing Barbara Bach) and her unhinged rogue biologist father Professor Ernest Martin (a marvelously dotty portrayal by Joseph Cotten). Moreover, de Ross discovers that Professor Martin has control over a dangerous race of fishman beasts who are being exploited as slave labor by Rackham. Director/co-writer Sergio Martino relates the lively and absorbing story at a constant snappy pace, offers a flavorsome evocation of the lush and remote tropical setting, does an expert job of creating and maintaining a creepy and mysterious atmosphere in the spooky opening third, further spices things up with a nice line in dry humor, and stages the exhilarating action-loaded climax with considerable rip-roaring aplomb. While the central premise is obviously inspired by \"The Island of Dr. Moreau,\" the story nonetheless is given a great deal of freshness and intrigue because of Martino's artful melding of such diverse elements as voodoo, the lost underwater city of Atlantis, a rousing mondo destructo climactic volcanic eruption, buried treasure, unscrupulous genetic experiments, and even some exciting rough'tumble fisticuffs between de Ross and Rackham during the thrilling conclusion into an altogether dynamic, imaginative, and often immensely entertaining whole. The sound acting by the sturdy cast qualifies as another substantial plus: Cassinelli makes for a likable hero, Johnson essays his juicy villain part with supremely lip-smacking aplomb, Bach rates as a quite fetching damsel in distress, plus there are neat supporting contributions by Beryl Cunningham as sinister voodoo priestess Shakira, Franco Iavarone as the superstitious Jose, and Roberto Posse as surly troublemaker Peter. Giancarlo Fernando's sumptuous widescreen cinematography delivers a wealth of striking visuals while Luciano Michelini's throbbing tribal score hits the funky spot. The amphibious humanoid fishman creatures are pretty gnarly-looking, too. An extremely fun flick.","Previously, my respect for the brothers Martino--director Sergio and producer Luciano--had been a result of the quartet of excellent giallo films that the pair had come out with from 1971-'72: \"The Case of the Scorpion's Tail,\" \"The Strange Vice of Mrs. Wardh,\" \"All the Colors of the Dark\" and (hang on for one of the greatest titles in cinema history!) \"Your Vice Is a Locked Room and Only I Have the Key,\" those last three starring the so-called Queen of Giallo, Edwige Fenech, girlfriend of Luciano at the time, the lucky bastid! (I still have not seen the Martinos' 1973 giallo entitled \"Torso,\" which is supposed to be excellent.) But, as most of their fans know, the brothers often ventured outside of the realm of giallo, and with some surprisingly good results, if their 1979 effort, \"Island of the Fishmen,\" is any example. Originally released under the Italian title \"L'isola degli uomini pesce\" (and later, with additional gore footage shot here in the States, as \"Screamers\"), the film turns out to be a pleasingly old-fashioned, Saturday matinée-style monster bash, with a hissable villain in black, a hunky good guy dressed in white, a beautiful damsel in distress, a mad scientist, jungle natives, bug-eyed creatures and an explosive climax. What kid--or kid at heart--could ask for more?In the film, a prison ship sinks in what the viewer infers to be the Caribbean, in the year 1891. Only Lt. Claude de Ross (charismatically played by Claudio Cassinelli) and a half dozen or so convicts manage to survive, their lifeboat washing ashore on a mysterious, volcanic island. The men are quickly done in by various island perils (poison water, staked pitfalls and, most especially, some lumbering, bipedal, amphibious creatures!), until only the lieutenant and two others remain to encounter the island's HUMAN inhabitants: Edmond Rackham, who is exploiting the island creatures in furtherance of his own schemes (deliciously well played by Richard Johnson, who had starred in the scariest movie ever made, \"The Haunting,\" back in '63, as well as Lucio Fulci's cult item \"Zombie\" that same year); a beautiful young woman who the viewer automatically assumes is his wife, Amanda (Barbara Bach, apparently game for some physical stunts here); a half-mad biologist (the great Joseph Cotten, here cashing a paycheck for perhaps three minutes of overacted screen time); and a whole gaggle of voodoo-practicing natives, who carry out Rackham's every wish. And before long, treasure hunting, the lost continent of Atlantis, and a volcanic blowup (has there EVER been a volcano shown in a film that failed to eventually blow up?) are all conflated into this truly wild and crazy tropical stew....\"Island of the Fishmen\" features surprisingly solid acting from its three leads, endearingly cheezy monster effects (the fishmen look like something out of an old \"Outer Limits\" episode; for example, the monsters in the 12/23/63 episode entitled \"Tourist Attraction\") and a fairly thrilling windup, as the titular monsters go on a murderous frenzy when the island tears itself to bits. Sergio's direction is imaginative and stylish, as his giallo fans might have expected, and the music by Luciano Michelini is by turns lovely and gripping. I don't want to oversell the film, which in essence is a somewhat hokey schlockfest, but darn it, for those of us who love their BEMs (bug-eyed monsters) and their matinée material of this ilk, the picture should prove a nicely winning diversion. Think Jules Verne's \"Mysterious Island\" crossed with H.G. Wells' \"The Island of Dr. Moreau\" and you might start to get an idea of the pulpy fun in store. Further good news regarding the film is that its current DVD incarnation, from an outfit apparently called Mya, is a nice one, with a very decent print on display and proper framing of the film's CinemaScope image. Sadly, no subtitles have been provided, but a very adequate job of dubbing does serve to compensate. Break out the popcorn, sit down with your 8-year-old nephew, and enjoy!","This is a very enjoyable lost island adventure movie. A group of men are shipwrecked on an island ruled by a white \"master\" accompanied by an attractive white woman (Barbara Bach), inhabited by voodoo-practicing natives as well as some CREATURE FROM THE BLACK LAGOON type \"fish men\". The plot is silly (as in most movies of this type), the acting and the lines are cheesy in most cases, but it is a v-e-r-y polished-looking effort. The scene of Barbara Bach secretly leaving her manor at dawn (or dusk), crossing a shallow lake, and feeding the fish men a potion on the seashore is especially very poetic looking. The undersea footage of the ruins of Atlantis is also very impressive. One minor defect: the voodoo subplot seems to go nowhere. Surely, there are elements of THE ISLAND OF DR MOREAU in the plot, but I think the idea to make this movie was kicked off by previous year's WARLORDS OF ATLANTIS from Britain. By the way, I think the \"man whose inside turned outside\" tag-line in the movie's US publicity refers to the scene of a man in the lab tank who is slowly being mutated towards a fish man.","First of all, a word of advice - don't buy or watch this thinking of it as a horror film. It most definitely is not, despite the best efforts of the American distributors who re-cut the movie, added in an opening sequence complete with graphic gore of men turned inside out, put in cameos from genre standbys Mel Ferrer and Cameron Mitchell and gave the film a horror-sounding title. All that aside, the film reviewed here is Sergio Martino's original Italian movie which plays it straight as an adventure film in the style of those Doug McClure movies of the mid '70s, with slightly rougher edges and a little bit more mild gore than they gave us. Despite being best-known for his series of above-average gialli in the early '70s, Martino is a perfectly capable director who also gave us a handful of adventure and post-apocalypse type movies in the late '70s and early '80s.ISLAND OF MUTATIONS begins well enough with a boat of assorted guys floating in the middle of a desolate sea. The film's first problem is apparent - half of the men are dubbed with some of the most appallingly fake British accents you're ever likely to hear, making this scene pretty laughable. Thankfully they all die pretty quickly. Soon enough the boat is attacked by some unseen rubbery creature which smashes it on the rocks and washes the men up on the shore of an island somewhere in the Atlantic. After encountering mysterious man-eating monsters, jungle traps, and treacherous lands, our sole survivor, as played by Claudio Cassinelli, then gets to meet the island's various unfriendly inhabitants.These include a tribe of natives; a mad scientist on the brink of death; a voodoo priestess; an evil gold-hungry bachelor; an army of genetically-mutated \"fish men\"; an erupting volcano; a laboratory of slimy mutations and lots more. The few things that aren't trying to kill Cassinelli include the underwater city of Atlantis (quite impressively shown, and enhanced by some fine underwater photography), and love interest Barbara Bach. The special effects are of the cheap-but-cheerful quotient, especially those rubbery fish men which you just have to love as they throttle minor cast members and threaten others with their gnashing teeth. Although the plot is somewhat familiar, it's helped along by various adventure staples including a man being put in a cell filling with water; somebody shinning down a rope over a pool of killer monsters; enduring fist-fights; chases and a number of exploding models.ISLAND OF MUTATIONS isn't an intellectually demanding movie; it rather feels like Martino is simply treading water for the first hour and preparing for his denouement. But what a finale it is, offering up tons of excitement and near-death experiences for our heroes. Cast-wise, Cassinelli is a somewhat ineffectual hero who doesn't actually do anything heroic for the first hour, but instead just stands around and watch other events playing out. Only in the climax does he get to fight baddies and monsters as a hero should in this type of movie, but never with the same cheesy determination as a Doug McClure would. Barbara Bach is the attractive love interest with a partly-developed character, so that's better than most for a start. Overacting honours go to Richard Johnson who really enjoys himself as the wicked, greedy, ruthless, selfish bad guy (plus half a dozen adjectives along those lines), while the ancient Joseph Cotten has fun as the atypical mad scientist on the verge of death. Then there's Beryl Cunningham, again in a wasted caricature role of a voodoo priestess who doesn't actually do anything and just seems to be there to free Cassinelli from his imminent watery demise, and a bit part from an unrecognisable Bobby Rhodes (DEMONS) as one of Johnson's native servants.Although it seems in retrospect to be aimed at kids or undemanding young adults, ISLAND OF MUTATIONS is actually an enjoyable and tight little film, done well on what quite clearly is a low budget. Although it has its misses - it repeatedly fails to be scary or chilling when it attempts to be - the hits are more memorable and the film is often exciting, and the last thirty minutes are what an action movie should always be - fast-paced and with lots of battles and stuff going on. Despite its predictability this is perfectly enjoyable stuff and great in an old-fashioned way; in fact it's nice to see they could make old-fashioned films like these when they wanted to in an era and country most recognised for its sadistic violence and bloodshed in its genre films.","~Spoiler~First of all, they're not men. And they're not turned inside out. What is the box art to this movie all about? Screamers is completely misleading in it's attempt to convey the plot of what lies within said box. It's actual Island of the Fishmen, a film that was directed by the legendary Italian Sergio Martino. Legend has it that Roger Corman acquired the rights to the movie, changed the name, and flared it up a bit with some over the top gore (specifically the intro scenes with Cam Mitchell and Mel Ferrer). Screamers is an Italian take on Dr. Moreau with good actors and bad, knock-off \"Gillman\" suits. Richard Johnson (who looks like he's on the same set, wearing the same clothes, and playing the same part as in Fulci's Zombi), Barbara Bach, Joseph Cotten, and the aforementioned added Mitchell and Ferrer are pretty big names for a project like this (of course they've all done their fair share of trash too). Screamers is entertaining enough, but nothing special. Only really noteworthy for the audacity of the misleading marketing.","aka ISLAND OF THE FISHMEN...It's exactly what the title tells you...an island inhabited by fishmen. Shipwrecked doctor Claudio Cassinelli and crew land on the island, they're either picked off by the fishmen or roped into working for treasure hunting lunatic Richard Johnson. Cassinelli discovers that Johnson, who believes he's found the lost city of Atlantis, has been keeping disgraced scientist Joseph Cotten and his daughter Barbara Bach hostage for 15 years so the fishmen can uncover a treasure trove beneath the sea. Cotten, of course, is a complete madman. Bach and Cassinelli have great chemistry. This insanity was directed by Sergio Martino and is not, surprisingly, without merit. It's fast paced, reasonably well acted and the fishmen look pretty convincing (though it's unlikely anyone could prove that these things DON'T look like actual fishmen). There's an excellent music score by Luciano Michelini.","Enjoyable spaghetti creature feature with a solid cast and some cheesy make-up effects. When survivors of a shipwreck stumble upon an unchartered island, they encounter an inhospitable welcome from the self proclaimed king of the dominion (Johnson) and his amphibian servants. Not intimidated by Johnson's anti-social behaviour or Cunningham's voodoo rituals, the ship's doctor (Cassinelli) treads on just about everyone's feet to get to the bottom of the mystery. Bach plays Johnson's unwilling companion, complicit in the mystery, but desperate to escape his coercive brutalisation (ostensibly done in the name of philanthropy).Director Martino made a string of Bach-Cassinelli-Johnson flicks in 1978-79, this being probably the best. Borrowing wholesale from \"Island of Dr Moreau\", \"Creature From the Black Lagoon\" and any \"Atlantis\" picture you care to mention, Martino has conjured a lightweight homage to all three themes. His experienced cast play their parts with conviction, and the cinematography and set design is quite attractive. Contextually, this picture is a success, although experimental transmutation in rubber suits with English over-dubbing will struggle on the urban market; suffice to say it's best viewed with a healthy appreciation for this type of spaghetti sci-fi.A couple of years after its initial theatrical release, Roger Corman added a few minutes of vaguely relative footage to the pre-title sequence, featuring Cameron Mitchell and Mel Ferrer, and re-titled the picture \"Screamers\"; the additions are negligible though, so whichever version you happen to see, pack your modesty, as great expectations will go unrequited.","No skin, a bit of red stuff. (Review based on VHS version)Some hapless bystanders get embroiled in a mad scientist/nutter's quest to harvest treasure at the bottom of the ocean, which involves using some homicidal sea monsters. Of course, things go awry. - - - Sergio Martino has a solid reputation for making some damn fine thrillers like \"All the Colors of Dark\" and \"Blade of the Ripper,\" but that reputation hasn't followed him through other sub-genres. A solid opening scene (rumored to have been shot after the movie was finished) is probably the best thing going for this quasi-adventure/horror hybrid that lays on the dull exposition and parades its rubber monsters around in embarrassing pride. There are some inklings of the various talent that has accumulated; Barbara Bach looks especially good and Martino throws out some stylish moments, but that's not even close to saving this bore. Skip it.* out of 4","An on screen caption informs us that it is 'the Caribbean Sea, May 1891'. A small lifeboat drifts aimlessly at sea containing six convicts from a shipwrecked prison ship, and the ship's Doctor a Lt. Claude De Ross (Claudio Cassinelli). It's night, a strange current takes the boat towards a strange, unnamed and uncharted island. The boat hits some rocks and is torn apart. One of the prisoners is killed by what appears to be a slimy mutant fish-man creature. The next morning morning Claude wakes up to find himself washed upon a beach. He finds a pool of white bubbling water and one of the prisoners dead beside it. Claude warns another surviving prisoner Jose (Franco Iavarone) not to drink the water as it will kill him. They both eventually meet up with the other surviving prisoners, Peter (Roberto Posse), Francois (Francesco Mazzeri) and Skip (Giuseppe Castellano). Francois wanders off on his own to try and catch an animal for food, he finds and kills a large water bird. But in turn he is killed himself by one of the fish-men. Claude, Jose, Peter and Skip continue to explore the island as they put Francois's death down to an animal attack of some sort. Soon after Skip is killed when he is impaled on a spike at the bottom of a pit. Now only Claude, Jose and Peter are left. They stumble across a cemetery with lots of empty graves and signs of recent black magic rituals. Claude spots a snake on a nearby rock, suddenly a shot is heard and the snakes head explodes. A woman on horseback named Amanda Marvin (Barbara Bach) is revealed to be Claudes saviour. She tells them to leave the island immediately as it is owned by a Edmund Rackham (Richard Johnson) and he doesn't like visitors. Claude, Jose and Peter decide to carry on regardless, eventually finding Rackham's large house in which they are invited to stay. That night Peter goes after Amanda and tries to rape her in a swamp, Peter quickly becomes food for the fish-men. And a Voodoo priestess called Shakira (Beryl Cunningham), who lives with Rackham, performs a black magic ritual involving slitting the throat of a chicken at the cemetery. The next day Claude and Jose decide they should leave the island as they feel very uneasy about Rackham and think he is lying to them. Jose rides off on horseback and is lost. Claude is saved from one of the fish-men by Amanda and is again told to leave. Claude wants to confront Rackham again. Rackham reveals that he has a scientist, and Amanda's father, named Professor Ernest Marvin (Joseph Cotten) who he needs to be kept alive. Rackham says that the longer Ernest stays alive the chances of his own survival will dramatically increase. Rackham tells Claude his plan. Rackham has found the lost city of Atlantis at a depth of over 2,000 feet. He is using the fish-men as a means of getting at the lost treasures of Atlantis, and needs Amanda and her father to control them. He claims the fish-men are descendants of the original inhabitants of Atlantis. Rackham offers Claude a share of the treasure if he will help him keep Ernest alive. Later Claude remembers the name Ernest Marvin as a scientist who was condemned for experiments transplanting animal organs into human beings. Finding Ernest's secret laboratory he discovers Rackham had lied to him and the fish-men aren't descendants, their actually genetically altered people turned into amphibious creatures by Ernest's grotesque experiments! Rackham has finally had enough of Claude and decides to put an end to his meddling by sticking him in a large tank and slowly filling it with water, as the islands volcano starts to erupt and send lava flying everywhere. Rackham wants to leave the island with his treasures and Amanda, will Claude escape almost certain death to save Amanda and get off the island before the erupting volcano tears it apart? Directed by Sergio Martino I really liked this film that mixes various genres. The script by Sergio Donati is fast paced, interesting and entertaining. The plot is revealed bit by bit, which kept me interested in watching it all the way through. I must say at this point that I've seen the original version and not the one with added scenes inserted for it's US release by Roger Corman. Barbara Bach makes for an extremely attractive leading lady, but I hated the way she was introduced by shooting a snakes head off, I thought it was more than a little distasteful. Richard Johnson makes a great villain and Claudio Cassinelli a likable hero. The fish-men themselves look a little fake when the camera lingers on them too long but their cool looking and I've seen worse. Some of the miniature effects look a little poor too, but overall again I've again seen a lot worse. There's no real gore, violence or nudity in it, but that didn't really bother me actually. The photography by Giancarlo Ferrando and the production design by Massimo Antonello Geleng combine to create a very nice looking film. Period costumes, props and sets like Rackham's house and Ernest's lab with it's old scientific equipment. The lush green jungle settings also add to the visual splendour on show. I really liked this film and I was entertained throughout it's running time. I'm not sure who I'd recommend it too as it mixes various genres, I guess someone who maybe fancies something a little bit different and generally well made. If you can find a copy give it a go, I'm glad I did.","This movie is based on the novel Island of dr. Moreau By H.G. Wells. It's a fairly good one too, it's at least better than the version by John Frankenheimer.","I first read about Sergio Martino's Island of the Fishmen in Chas Balun's '80s book Horror Holocaust, where it went by the alternative title of Screamers. Since Balun's book was all about the splatter, I immediately added the film to my mental list of must see gore movies, but have only recently been able to track down a copy of the film (via YouTube). Unfortunately, what I had forgotten was that Screamers, released by Roger Corman's New World company, was a re-edited version of Martino's movie, with extra footage added to make it more marketable to the US market, and that the original version, which I had found, was virtually blood-free!The untampered Island of The Fishmen is a formulaic Jules Verne-style adventure in which a small group of castaways are washed up on an uncharted island where the owner Edmond Rackham (Richard Johnson) has creating half-man/half-fish mutants in an effort to retrieve a valuable lost treasure from the submerged ruins of Atlantis. There is lots of dreary talking and plenty of unremarkable action, but graphic violence is limited to a man having his face clawed and another falling into a trap full of spikes, making it far from the gloriously gory epic I had long hoped it would be. The film doesn't even make the most of the presence of Bond beauty Barbara Bach, who remains fully clothed throughout (unless you count her strip down to Victorian underwear, which practically covers her entire body anyway!).Shot in the same tropical locations as Lucio Fulci's Zombie, and with atmospheric cinematography from Giancarlo Ferrando, Martino's film has the look and feel of many a classic Italian gorefest, but remains a remarkably dry affair, and while the fishmen themselves are entertaining thanks to their ridiculous design and expressionless faces, the film as a whole is a rather tedious affair. I guess I'll just have to satisfy my yearning for excessively gory fish-man horror with repeat viewings of Corman's Humanoids Of The Deep (1980)—at least until I can get my hands on a copy of 'Screamers'.","I am sure I'm not standing alone when I say that Italian cult-filmmaker Sergio Martino is one of my favorite directors, primarily for the brilliant Gialli he made in the early 70s, including \"Lo Stano Vizio Della Signora Wardh\" (\"The Strange Vice of Mrs. Wardh\", 1971), \"La Coda Dello Scorpione\" (\"The Scorpion's Tail\", 1971), \"Tutti I Colori Del Buio\" (\"All the Colors of the Dark\", 1972), \"I Corpi Presentano Tracce Di Violenzia Carnale\" (\"Torso\", 1973), and my personal favorite, the masterpiece \"Il Tuo Vizio È Una Stanza Chiusa E Solo Io Nè Ho La Chiave\" (\"Your Vice is a Locked Room and Only I Have the Key\", 1972). While his Gialli are doubtlessly his most outstanding achievements, Martino has been active in many other fields of Italian Cult cinema, including the Spaghetti Western (\"Mannaja\" aka. \"A Man Called Blade\", 1977), the Cannibal genre (\"La Montagna Del Dio Cannibale\" aka. \"The Mountain of the Cannibal God\", 1978), or crazy Apocalyptic Sci-Fi Action (\"2019: Dopo La Caduta Di New York\" aka. \"2019: After the Fall of New York\", 1983). Or this fantastic little gem. \"L'Isola Degli Uomini Pesce\" aka. \"The Island of the Fishmen\" aka. \"Screamers\" of 1979 is a criminally underrated and outrageously entertaining blend of creature feature and island adventure, a film of which kind could only come from 70s Italy.The story seems like a crazy mix of the literary models of H.P. Lovecraft (hideous mixtures of fish and men), H.G. Wells (the \"Island of Lost Souls\"/\"Island of Dr. Moreau\" influence is undeniable) and Jules Verne. Of course, a film of the kind, especially one with a modest budget like this one, is being dismissed as 'cheesy' by the majority of viewers. And it is undeniable that \"The Island of the Fishmen\" is a little cheesy; however, it simply is the epitome for and insanely entertaining film. To be honest, I expected this film to be a whole lot cheesier than it actually turned out to be. While the film is cheesy enough to have the certain 'camp' charm, the special effects were a lot better than I expected them to be, and while the story is maybe a bit far-fetched, it is exciting from the beginning to the end. After their ship has sunk, Lt. Claude De Ross (Claudio Cassinelli) and a bunch of prisoners strand on a remote island full of lethal traps. The island is ruled by the sinister Mr. Rackham (Richard Johnson), who lives in a majestic mansion with his native servants and the ravishing young Amanda (Barbara Bach). But there is one other species of 'native' islanders: Hideous fish-men of superhuman strength...I do not wish to give the best parts away, but I can assure that \"The Island of the Fishmen\" unites many aspects that should be adored by my fellow cult-cinema buffs. Remote islands have always been superb Horror- and Adventure-settings. This one includes Voodoo, Mutants, an insane villain, mad science-fiction, ancient sub-aqueous worlds and mysteries, and many other notable elements, the most convincing one being the gorgeous Barbara Bach. The performances are better than one would expect in a movie like this one, the supporting cast even includes the great Josph Cotten in the role of a brilliant (though somewhat naive) scientist. The cinematography and settings are very good, and, as mentioned above, the effects are a lot better than I would have expected. Overall, \"The Island of the Fishmen\" is fantastic entertainment from start to finish, and I cannot understand why it has a ridiculously low average rating of 3.5/10 on IMDb. My only tiny point of criticism is the fact that the lovely Barbara Bach keeps her clothes on for the entire film. What the hell? \"L'Isola Degli Uomnini Pesce\" is a film that promises incredible entertainment from start to finish, and should be seen by every cult-cinema fan. My rating: 8.5/10"],"review-user":["gein","Squonkamatic","Coventry","choppyno","Whovian","PeterBradford","Hey_Sweden","TheHrunting","christopher-underwood","dargento","HumanoidOfFlesh","lee_eisenberg","lonegurge","Woodyanders","ferbs54","GSeditor","Leofwine_draca","Backlash007","JasparLamarCrabb","Chase_Witherspoon","stevencraigvankooten","poolandrews","andrew_jakobs","BA_Harrison","Witchfinder-General-666"],"review-date":["28 January 2000","12 July 2006","17 November 2005","4 August 2005","28 December 1998","23 May 2009","15 September 2014","7 June 2011","11 January 2007","25 January 2006","8 September 2004","24 April 2007","26 May 2007","8 October 2009","5 February 2013","25 April 2011","7 August 2016","21 February 2010","16 February 2010","14 January 2010","14 April 2007","1 January 2005","10 August 2000","24 July 2014","21 September 2010"],"review-rating":["8","7","10","7","7","8","8","4","6","8","10","9","8","7","7","6","4","6","8","7","5","8"],"review-title":[" Barbara Bach has never been more beautiful!\n"," ... I Kind of Liked The SCREAMERS Version Better ...\n"," The Fishmen RULE!!!\n"," Don't Judge A Film By It's Cover\n"," Screamers is a fun, cheesy adventure movie.\n"," missing footage?\n"," Thoroughly entertaining.\n"," Island of the goggly eyes\n"," I have a soft spot for the fishmen\n"," Martino's minced Fishmen\n"," Very entertaining.\n"," Ringo Starr's soon-to-be wife and Audrey Hepburn's ex meet a bunch of mutants. Whodathunkit?!\n"," pure fantasy/horror,a little derivative but still cool entertainment\n"," A very enjoyable Italian horror fantasy adventure outing.\n"," Some Cheezy Fish With Your Popcorn?\n"," Much better than the current average rating of 4/10 on IMDb suggests\n"," Old-fashioned fantasy adventure from Italy\n"," \"They're men turned inside out!\"\n"," Fishmen, Joseph Cotten and the lost city of Atlantis?\n"," Where the fish, eat the people\n"," Screamers (1979)\n"," A really enjoyable part adventure, part horror and part Jules Verne film from Sergio Martino.\n"," Island of dr. Moreau\n"," And I was so looking forward to seeing a man turned inside out.\n"," Outrageously Entertaining Island Adventure By Sergio Martino\n"]}