{"review-url":["http://www.imdb.com/title/tt0089603/reviews"],"review-text":["One would think that a film based on the life of the Japanese author Yukio Mishima would be a daunting if not impossible task. However Paul Schrader has indeed made a film \"about\" Mishima that is both superb & complex. While it is not a literal biography, Schrader & his co-screenwriter Leonard Scharder (his brother) have taken several incidents from his life, including his sucide and crafted what can best be described as incidental tableaus that are visually sparse and stunning. Mishima's homosexuality is almost not there, due to legal threats from his widow, but in spite of this, the film is still terrific, and one of the best films I saw in 1985. I should also mention the important contribution of Philip Glass who did the score, which adds an additional texture to the film, and is superior to the one he did for Scorsese's Kundun. Also notable is John Bailey's fine crisp beautifully colored cinematography and the great production design & costumes by Eiko Ishioka who went on to do the memorable costumes for Coppola's Dracula for which she received a well deserved Oscar. Hopefully this film will soon be available on DVD.","A story told in four chapters and in three levels. Flashbacks of Yukio Mishima's life, dramatizations of his written works, and the events of his final day of life.If Mishima was a fictional character, I doubt if anyone would believe or accept such a creation. But he was a real, flesh and blood, human being, which makes the film all the more incredible. Granted that some of the facts have been dramatized or \"enhanced\" for the screen, but the story is quite factual.A man of many contrasts: A devoted family man who kept a gay lover. A writer who saw his words being \"not enough\". A patriotic man at home in the present who yearned for a return to Imperial Japan's past glory. A man who struggled to unite movement with action, and saw everything he strove for fall apart at the most critical moment.The film is lovingly made, magnificently acted, painstakingly edited and the musical soundtrack by Philip Glass will stay with you for days. The film's tight budget doesn't show at all.Now available on DVD, this film is a worthy addition to the collections of true cinemaphiles.My rating: 10/10","\"Mishima: A Life in Four Chapters\" is one of those films which is extremely hard to write about simply because it hit me on such an emotional level and stunned me with its artistry to the point where writing a review or comment on the film seems trivial and useless. Hence, this will be rambling and poorly-written, but I'll give it a shot anyway.The easiest thing to talk about when discussing \"Mishima: A Life in Four Chapters\" is the technical elements of the film. The narrative is superb and fairly original with a fine script by Chieko, Leonard, and Paul Schrader and Schrader's decisions as director are pretty much faultless. Every stylistic turn the film took, every sequence which took a risk, and pretty much the whole time the camera was in motion I was utterly enthralled and fascinated with how well the film works as a film. Paul Schrader may not be as great a storyteller as some of the great directors are but in \"Mishima\" he proves that he is more than capable of being a wonderful storyteller if necessary. The film moves at an extraordinarily fast pace and one barely notices the passing of the two hours.I have to say, despite being a literature buff to an extent, I have never read anything by Mishima. I knew one or two things about Mishima, including the big ending to his story (which I won't reveal, to keep this spoiler-free) prior to seeing the film, but not much else. Perhaps this is why I felt, contrary to some others, that the film got progressively stronger and ended with a breathtakingly brilliant final act. I also found it completely refreshing how this biopic took no position on Mishima or the final act of his life- it is simply a portrait of a man, not a comment on his life. The Phillip Glass score is utterly brilliant. There is very little of this film that doesn't prominently feature it, which can come off as the result of a lack of confidence from the director, but in this case it is used superbly well in the film. The score is original, vibrant, interesting, and memorable- much like the film itself.\"Mishima: A Life in Four Chapters\" is a film that is certainly ripe for interpretation and analysis. I am not going to attempt to provide either of those, mostly because I'm not really in a position to, and also because I found this a profoundly emotional experience, a film of such artistry that it is a film that everyone should experience without preconceived notions of quality or content and one that everyone should attempt their own analysis of. It's that special. It's that good.10/10","The only pure life, is one that ends with a signature in blood.So says Mishima anyway, a young sheltered boy who becomes a celebrity author. The life of one of Japans most celebrated literary voices, is told from three perspectives, his life just before he and four members of his private army take over a Japanese military base and commit ritual suicide(shown in color), flashbacks(shown in black and white), and scenes from his novels(shown in a kind of dreamy Technicolor set design somewhere between traditional Noh Theater and \"the Wizard Of Oz\". These stories are often told at the same time, but are edited to reinforce, the slow fusing of Mishima's life with his fictions, until the end(or the beginning) when like the ancient samurai he so admires, he will be at a balance of pen and sword (when his words and actions are the same, and he is a full and \"pure\" being).Paul Schrader wrote the screen play for \"Taxi Driver\", and directed \"Cat People\"(a bizarre erotic horror film, which left strange impressions on me as a boy), and in Mishima, he comes closest to making a really excellent film.Whats interesting is to watch the poet, the homosexual, the shy and awkward man with a low body image who overstates his Tuberculosis to get of of WW2 (of which he seems forever ashamed), become a body building, samurai obsessed, a-sexual, media phenomena, all the while still writing prolific amounts of novels, plays, and short stories.A short and sweet version is to say Mishima has no father, and becomes obsessed with masculinity, beauty, sex and self destruction, in some tragic attempt to feel connected to something bigger than himself, that he was always missing. Watching him with his fellow suicidal cadets, you see him happy, delivering his big paternal speech, giving orders, and loving the control...until the speech itself, the point where pen and sword meet? Of course, this ignores the subtlety of the story telling craft here which makes this transformation so natural and remarkable. Though the story, fascinating at times, really isn't this movies greatest success. The cinematography, performances, editing,music(by Philip Glass), and set designs, are really what make this worth seeing, and more than a traditional bio-pic.One day I will pick, up a Mishima book, he does seem to have an ear for prose, and for staging ideas, but for now I'm satisfied with the film.Those interested in Japanese Literature, and post-war culture, should check out. Fans of inventive combinations of facts and fictions, should enjoy as well.","Movies are something you see on Saturday night and forget by Sunday morning. Motion pictures are works of art that stick with you forever. Mishima falls into the latter category. This is the type of thing that should win Academy Awards, a brilliant, visual peice of film that is both depressing and uplifting. Instead of doing a straightforward look at the life of Yukio Mishima, director Paul Schrader interweaves three adaptations of the author's stories into a look at his past and final day on Earth, the day he tried to lead the Japanese military into rebellion in the name of the Emperor. Failing to do that, he commits ritual suicide in an ending that hits you like a ton of bricks. The three short story adaptations allow a look into what led him to this and are presented in an experimental way that makes them appear to be filmed stage plays. Ken Ogata is magnificent as Mishima. Despite his eccentricities, he comes off as very sympathetic, a man who is quite willing to die for his beliefs and does. This makes the ending that much more devastating and the sense of loss more meaningful. Of the three story adaptations, Temple of the Golden Pavilion, Kyoko's House and Runaway Horses, it is the last that is the strongest and most emotional. It also is the story that most closely matches Mishima's mood in his final years and illustrates what truly led him to the events of November 1970. This review cannot be complete without a mention of Philip Glass' striking musical score. Not since 2001 has a film score been such a perfect compliment to it's visuals. Paul Schrader crafted one of the most beautiful movies of the 1980s or any other decade for that matter. Have the hankies at the ready because the ending will leave you in tears. Mishima: A Life in Four Chapters reminds you that sometimes film can still be an art form and as art it is brilliant.","Someone else put his finger on where this magnificent film falls short when he said, \"Mishima has already said it all, the film simply repeats.\" Ultimately, Schrader has made a movie which refuses to comment on Mishima one way or another, and which becomes somewhat lifeless and stilted in the final segment as a result. Because he is bending over backwards not to criticize Mishima, Schrader simply refuses to examine the uglier implications of his public suicide. Ironically, this approach hurts the film precisely because Mishima himself was capable of much more perceptive self-criticism. In the first two chapters -- \"Beauty\" (THE GOLDEN PAVILION) and \"Art\" (KYOKO'S HOUSE) Schrader's work is nothing short of brilliant. With great subtlety, he interweaves black and white scenes from Mishima's early life with lush full-color scenes from his early novels. What makes these sections so haunting are the subtle, suggestive differences between Mishima and the people he is writing about. For example, Mizoguchi, the acolyte who destroys the Golden Temple, is not a homosexual, nor is he a talented writer. His stammering could be a metaphor for those things, or it could be a metaphor for nothing at all. The mystery of creation and imagination, wordless and inexpressible, really seems to come to life here -- particularly in the dissolve where the schoolboy Mishima \"morphs\" into the slightly older Mizoguchi. The problems start in the third chapter, \"Action.\" Here Schrader films scenes from Mishima's RUNAWAY HORSES (one of my personal favorites) as if they are not just similar, but absolutely interchangeable with Mishima's militarist activities with the Shield Society. Schrader seems to assume that the hero of the novel, Isao, is simply a stand in for Mishima. How can you tell? Because Schrader cuts out precisely those sections of the novel in which Mishima actually analyzes Isao's emotions and his illusions. The Isao of this movie is merely a straw man who spouts platitudes about the emperor and Japan's greatness. The Isao of the book is a courageous, unselfish, but very human teenage boy, whose callous and narrow-minded parents are unable to love and who plainly have had a crushing effect on his psyche. Mishima, whether consciously or not, included some truly vile scenes of parental cruelty and manipulation in this book precisely because he understood on some level that Isao's decision to end his own life was not entirely unselfish. The connection between the sordid ugliness of Isao's loveless home and his desire to die a violent death is clear enough in the book. But it is absent from the movie. Oddly enough, Schrader thinks he is protecting Mishima in the last section, by not moralizing about the suicide, but he is actually diminishing him as an author. The RUNAWAY HORSES section is by far the weakest of the movie. The final scenes, in which Mishima at the moment of death attains \"oneness\" with his heroes, really are quite exhilarating. But they would have been still richer if Schrader had taken a more nuanced approach to RUNAWAY HORSES, instead of just viewing it as a \"blueprint\" for the last events in Mishima's life. This is unquestionably a brilliant, inspiring film, but it's not quite flawless.","It has taken several viewings for me to fully appreciate this film. Initially, I was struck by the stylized sets, but found the rest slow going and dull. I thought that such a sensational subject needed the Ken Russell treatment to take it way over the top. I now find the enforced restraint (placed on the production by Mishima's widow) to be an asset. Some of the more lurid aspects of Mishima's life are reiterated and dramatized by corresponding themes from his novels. I think it helps to be familiar with the novels - that's what finally made the difference for me. Still feel the film overall could be a little tighter and warmer, but it's genuinely unique, and deserves serious attention. Love the fact that the Japanese characters speak Japanese - not English. The Philip Glass score is mesmerizing.","Mishima is one of the greatest films ever made. Now I think Paul Schrader is the greatest screenwriter of all time, but I don't really like the films he's directed of what I've seen (with the exception of this and Affliction), but this is an amazing, disturbing, and highly 3-dimensional character study. It follows the life of Yukio Mishima, Japan's most celebrated writer, combining the last day of his life with flashbacks and his stories. I don't know how, but Paul Schrader manages to combine all of those in a very artistic way. The acting is great, so is the photography, and a perfect score by Philip Glass. Although confusing the first viewing, this is one of the few films that becomes richer with each viewing. Truly an underrated gem of a film.","The film, original and hypnotizing depicting of the fascinating Artist's life through his writings, works, especially in the first two chapters, \"Beauty\" and \"Art\". They are nothing short of perfection if you ask me. Amazing blend of three different styles - quasi documentary of the last day in his life, black-and-white flashbacks of his earlier days and exiting and stylish color sequences of his novels \"The Temple of Golden Pavilion\" and \"Kyoko's House\" helps to understand the constant and tragic search of Mishima's protagonists for beauty and for meaning of art. Two last chapters, \"Action\" and \"Harmony of Pen and Sword\" seem weaker than the first two. Two hours are not enough to explore the figure of such complexity but the attempt is very interesting and adds to my interest in Mishima - a great writer, actor, director, a military man, a man who felt that he knew where the future of his country lied and who did not hesitate a second to die for his ideas.7.5/10","Overall, the DVD package is quite good, excepting Criterion's usual decision to go with white only subtitles for its black and white sections. And given Schrader's choice to use an English language voice-over in non-Japanese versions of the film (to avoid double subtitles in some shots), one wonders why the main body of action was not filmed in English, or at least dubbed? Schrader briefly tackles this in his audio commentary, and the main reason seems to have been financial.The same is not true for the actual film, which devolves into a stylized melodramatic mess that recalls much of Akira Kurosawa's late film, Dreams, as well as being filled with the most mind-numbing platitudes about art imaginable. Yet, equally bad is what is missing, above and beyond any portrait of Mishima's family life; such as his manifest Napoleon Complex. Mishima was only 5'1\" tall and severely lacking in macho confidence, so much so that he insisted on only marrying a woman shorter than he was. Yet, any connection between these elements and those depicted is left for only the curious- and that likely will not be most people who watch this film. Thus, since the film fails on most artistic fronts, and does not generate any real further interest for its audience in its main subject matter, the very reason for the film is a puzzle, unless one feels Schrader is positing himself into a Mishima-like role. Not that it would matter, since Mishima: A Life In Four Chapters portrays its lead as a rather unsympathetic and idiotic character, albeit one with likely more talent than Schrader has.If only someone like an Ingmar Bergman, or even Michelangelo Antonioni, who started out as a documentarian, would have tackled this subject matter, the film would likely have been shorter, tighter, more purposive, and coherent, for if there was one thing that even his biggest critics could not hold against Mishima it was that he was driven and almost monomaniacal. Schrader is the opposite, desperately larding his film with almost everything that plays up his vision of the writer as madman and ignoring all that went into the artist as a man, something Schrader seems not to really get, which reaffirms my idea that his great screenplay for Taxi Driver was a fluke, that blindfolded, over the back toss of a dart that somehow hits the bull's-eye. Yet it was that lucky moment which doomed the rest of us to decades of profoundly dull and vapid films churned out on the strength of that one toss. Lucky Schrader. Unlucky us. As for Mishima? The real man's somewhere around, just as he must be in the film, right? Right?","There are very few films that are able to tell such a complicated story on so many levels as well as Mishima: A Life in Four Chapters.  One of the most difficult aspects of story telling is the ability to flashback and forward without losing the pace of the film.  This film not only flashes back and fourth with the greatest of easy, but it also flows through some of Yukio Mishima greatest stories.  This film exceeds in every aspect and is a joy to watch.  Not to mention the incredible Philip Glass Soundtrack.","This is my favourite film and I think it is perfect. Unlike virtually any other film I can name, I never watch this film and think it would have been better if they'd changed this or that or whatever. Is this the definition of a work of art?  I think so.  Every brushstroke in Mishima is perfect and it all flows from the Schrader's script.  I've always sort of liked Paul Schrader's work (you can't argue with Taxi Driver and Light Sleeper is an amazing film), but while his writing  often seems to border on the bombastic, his directing style is usually non-existent. This is deliberate, I think, because his films usually deal with a search for redemption and are set in the real world; ugly and harsh.  His style suits his themes as he presents his characters in a simple and realistic way, and lets them show the audience the truth of the situation.  Imagine if Schrader had directed Taxi Driver or Bringing Out The Dead, instead of Scorsese. But like the protagonists of those two films, while Mishima the man was ideal Schrader material, right-wing, vain and at odds with society, his works were subtle and beautiful.  In fact he had a secondary writing career as a woman's writer, churning out what can reasonably be described as romantic potboilers.  So you wouldn't necessarily imagine that Schrader was the ideal man to capture that subtlety and beauty on film.  I think the film shows that he was. The script he helped fashion splits Mishima the man into three parts; his life, his death and his mind.  His life is represented in black and white, still camera, formal compositions.  His death, for which he will always be best remembered, is handheld documentary style.  And his mind is represented by the dramatised extracts from his novels, each one revealing the thought processes of this complex man, who hardly ever wrote a character that wasn't a reflection of himself.  These dramatisations are beautiful to look at, thanks to Eiko Ishioka's remarkable production design and Schrader's imaginative staging.  In all parts, the acting is superb, especially from Ken Ogata as Mishima, who captures the essential charm, arrogance and narcissism of the man.  The photography is excellent throughout and contains images that the viewer will retain forever.  Finally, the music is simply superb, perfectly matching the images, although written and recorded before shooting, adjusted during the editorial process and then re-recorded.  How much the music influenced the shoot I do not know, but it bonds perfectly to the image. I have seen many ideas of what various people think the theme of the film is, what Schrader is trying to say.  You know, the big stuff about life, death etc.  But I do not think the film is saying anything.  Mishima has already said it, the film simply repeats.","Spoilers herein.Paul Schrader isn't an accomplished man in terms of creating novel visions. But he is an alert and active thinker of things cinematic. Whatever he does is worth pondering, even when the picture itself is flawed in some ways. (And even when one of his Italian director friends changes his ideas.)In this case, we have what I consider his most complex notion: a film about a man who lived his life as if it were a film, moreover a film that he could and did write. Even that idea could have been handled in a pedestrian manner, by showing the man and his life. But except for the final suicide episode, Schrader doesn't show the `real' life -- instead he stages episodes from the writings, mostly in a Kabukified dream manner.Schrader's commentary on this DVD is one of the best I know. It remarks that though this life was based on fabrication, the movie was mandated to be based on truth. But the original fiction the subject created is preferred by the Japanese authorities (and apparently the public, still) so the thing has never been released in Japan and the Japanese financiers have denied being so.Adds another level of fabrication to an already rich project.Ted's Evaluation -- 3 of 3: Worth watching.","This is a movie that should be viewed and treated as a piece of art.  This is an oblivious labour of love by the Schrader brothers about the life of Yukio Mishima that is full truly artistic elements.  The movie jumps from color to black and white, past to present, fictional works by Mishima to him.  All without being confusing in the least bit.  The only thing that gets me is that the entire movie, with the exception of the narrator's spoken parts is in Japanese.  Still a masterpiece that deserves an audience but hasn't found won.  Criterion, if you are reading this, this is a film that should be released under your imprint with as much extras as possible. This film truley deserves more.  10/10","Oh, how the critics fell all over themselves to praise their goldenboy Paul Schrader (author of Taxi Driver) when this movie came out. I never saw the qualities they were detecting when I watched this movie back in the day, so I re-viewed it, to see if I got it wrong. Mishima is extremely uninteresting. This is a chilly, unremarkable movie about an author living/working in a chilly abstruse culture. The flat reenactments don't hold your attention because they are emotionally adrift and stagy. And the rest of it just sits there being awful... with soldiers singing songs about the masculinity they pledge themselves to, hairsplitting about purity, the admiration of swords, etc.It must be a triumph when you learn you've landed Philip Glass; but then you have to get something out of him. Glasses score offers not a whit of distinction from his other work, nor does it provide the film any perceptible value. In 2010 it should be clear to anyone that Schrader squandered his career on work of no impact or importance (Cat People, AutoFocus, Light Sleeper, Patty Hearst, American Gigolo). He can bore you to pieces, and kill the momentum of a movie, quicker than anyone else. Schrader has made a resume full of lousy, amateurish films.","This movie is a haunting telling of the life of the author and poet, Mishima. It jumps around through his past, through his last day, and through some of his stories but is expertly constructed as it moves from section to section. It captures the flavor of the man, his work and of his times...the difficult 1960s.I think the most wonderful parts (literally, full of \"wonder\") are the excerpts from his works. The sets (especially designed to work with the camera) are amazing....stylized, beautiful and effective. They could be used as exemplars for any set designer. I woke up at night dreaming of the Golden Pagoda. The stories were powerful explorations of the nature of man and of art. After watching this film, I wanted to learn more about the works of this artist.I highly recommend this movie for anyone interested in art, poetry, theater, politics, or Japanese history.","Not many films can make a scene where a sado-masochist couple slice each other with razor blades appear beautiful, but Mishima pulls it off with plausible insight to a life style which is difficult to imagine. The film is intercut with lavishly produced scenes from Mishima's plays, but even the main biographic scenes of the film are highly theatrical.\nJohn Bailey deserves a lot of credit for the lustrous visual quality of this film.","I never heard of Mishima before I watched this film and although parts of it are a little tedious, I still find myself drawn to watch it when it is repeated on the box. At the beginning of the film, we are told about a celebrated Japanese writer behaves like a lunatic and commits seppuku in public. As the film progresses you are gently inducted into twisted logic of Mishima's mind. The stages of his life are are presented in four chapters. Each chapter itself is a blend of two contrasting narratives, the first continues the story with scenes from Mishima's life and appear in black and white. The second narrative is an adaptation of scenes from a novel and these are staged like a play and filmed in vivid colours. There is a different novel staged in each chapter. Between each chapter, the narrative returns to the present, as Mishima proceeds towards his eventual ritual suicide. This means that the drama and tension is maintained until the end.\nI suspect that many people will find this film to be boring pretentious and art-house. I respect that, this is not a film for people who want action and a strong story line. If on the other hand you are the kind of person who relishes the opportunity to penetrate the mind a bizarre man while watching his life story told in collage of beautiful pictures set to music by Philip Glass, you will love it. I loved it.","Mishima: A Life in Four Chapters is an emotional mosaic of a film, there is as the title suggests a clear structure of four chapters, but inside these are three separate - but cohesively linked through what they observe in the character of Mishima - modes of storytelling. They can be broken down as past (From childhood to the last day of his life), present (a real-time following of Mishima, ending with his famous act of public seppuku) and imagination (Three of his novels brought to life). It's rare that a film is so interconnected through style, substance and structure, the organised wholeness reflecting the subconscious life-long mission of perfection that Mishima embarks upon, ending in (when observed as a whole) what seems like a predestined fusion of artistic expression, destruction and a longing to change the world. There is a rolling development to the character, glimpses of ideas and emotions in his past are exposed and consciously studied in his novels, and are fully realised in his final act of self-crafted spiritual beautification, an act which can be viewed as culmination of the depths probed in the first three chapters of the film; art, beauty and action. The final chapter, The Harmony of the Pen and the Sword, is the most honest and brutally real, no novel to hide his extreme personality and ideals, baring his soul forcefully through protest and finally destroying himself at his highest point of honour and power.The film is incredibly arresting, the style different for each mode, each with its own visual language and manner of exploring Mishima. His past, in harsh black and white, is shown in an un-probing way, in a near historical-recollection fashion, and we simply follow his life. At first the novel sequences are quite jarring, they are so vibrant, raw and colourful, full of telling compositions and beautifully crafted, hyper-stylised sets. They are all rooted in total blackness, like they've just sprung up in Mishima's mind (occasionally the novel sequences are preceded by a scene of Mishima writing), the absorbing artificiality of it all is at odds with the shut-out realistic style of his past. It's a bold move to blend such opposite visual storytelling techniques, but the events of his past amalgamate with the beauty and emotional forwardness of the novel sections to fully conjure up Mishima. Neither would work on its own, but together they work as one and fill in the gaps that they other left out, the lack of expression in his past is filled with the constant rampage of passion found in the novel sequences, and the lack of conjunction of each novel sequence is an irrelevance as they compose of crucial elements we are now able to see reflected in Mishima's past life, and most importantly his final day. Starting with Mishima getting ready, there's a roaming kineticism to the camera. The focus is stuck on Mishima, gliding over his immaculate army uniform and watching him button up in close up. It's a very finalised way of shooting, like everything is being seen for the last time so is given a grand send-off. He is followed documentary style, hand-held camera and tracking shots structured in real-time. This almost displaces Mishima in the external world, in some ways casting him in a different light, making him seem like a determined mad man in a world full of coasters. Philip Glass' score is outstanding, punctuating Mishima's fixed path with absorbing rushes of sound. Like Mishima, the score has an evocative presence, a complicated array of short stabs of strings and bells, repeated over and over again but never faulting in aiding the visual climate.The film is an interpretation of Mishima, but is surprisingly without conclusion. This is not a flaw, Schrader bravely chooses to avoid judgment or criticism, putting Mishima in an as-close-to objective light as possible. Through the sociological fundamentals of sexuality, political action, art, and the body, Mishima attempted to perfect himself. He achieved great literary success, he body-built himself into a towering statuesque figure, he formed a private army of dedicated fellow traditionalists. What conclusions can be drawn from these achievements? Many, but I believe that Mishima is a man who never lost his childlike yearning to change the world. He carved his own destiny out of his body and his work, set his mind on a clear path early on and obstinately followed it to the glorious end. Whether or not one agrees with his life's work, I cannot help but admire his yearning for fullness. Someone who is so rigid and immovably confident in everything he does may seem unlikable, and he most certainly isn't a likable character in the strictest sense. He is, simply put, a self-formed piece of art. A piece of art that I cannot help but be fascinated by. Mishima: A Life in Four Chapters does the impossible and shows a life eternally connected to art, a life defined and destroyed through art, and fittingly it is a colossally profound and ambiguous work, a ravishing exploration of a man who melded integral desires of creation and impact together to shape something unique and special in himself, in death he was his own vision of perfection, even when the world was not.","Mishima - a life in four chapters is in my opinion the best Paul Schrader film to this day. Mesmerizing cinematography, accompanied with Philip Glass mystical musical score added a completely magical aura to the story of one of Japan's greatest novelists, whose originality and picturesque narrative are beautifully portrayed in this film. As any gifted character, Mishima was troubled with severe self conflicts, the main of them being conflict between a \"pen and a sword\" as the director puts it in his final chapter, or the struggle between the sensitive poet with homosexual feelings, living in a notoriously masculine society with centuries long warrior traditions, thus widening the gap between the sensitive and the militantly traditional side of Mishima himself.All Schrader's films (and the ones he wrote scripts for) are basically stories of inside conflict within a man that doesn't belong in an environment he lives in. That also goes for Mishima, who, apart from Japanese military school upbringing is brought up with love for theater and words. His demise consisted of both of these key points in his life, it was about words and theatrical ending in a life long play. Film like this comes along once in a long while, and most will have to wait a lifetime to reach this beauty. 20 out of 10!!","What a stunning film. A real experience. One of those you almost let wash over you like a dream. John Bailey's photography is absolutely mesmerizing and it has to be one of the most jaw droppingly beautiful films I've ever seen. Fantasy and fiction merge with the real life of Mishima and play out within the stories written by him. What a concept. The film explores Mishima's state of mind, his grasp of how art and reality converge, his patriotism and loyalty to the Japanese state and sexuality. It also has that nihilistic / self destruction theme that is often prevalent in Schrader / Scorsese projects.Total art.","MISHIMA: A LIFE IN FOUR CHAPTERS / MISHIMA. Viewed on DVD. Director and script co-author Paul Schrader's fictionalized biographical film of Yukio Mishima who was a well-known, multi-talented, and mentally unhinged Japanese artist from the middle of the last Century. Apparently little known in the West, Mishima seems to have caused quite a stir in his homeland some 50 years ago (the effects of which may still be lingering on) by publically committing seppuku after a failed attempt to convince members of Japan's Self-Defense Forces to mutiny and join his small private army to overthrow the government and reinstate the Emperor as the nation's sovereign. Schrader recreates events that occurred on the last day in the writer's life (in November, 1970) and inserts stunning vignettes based on scenes from some of Mishima's novels (three of which are defined by unique color compositions) as well as longish flash-backs (in black and white). The result is well worth repeat viewing (see below). Shot (with mostly a Japanese cast and crew) entirely in Japan, apparently the movie has never been released there (due to family legal action, studio timidity and/or political pressure--take your pick of rumors!). Schrader relies extensively on voice-over (often the mark of an impoverished script and/or production under financing) to help the viewer make sense of what's been distilled on screen. This time out, however, extensive voice-over is really needed for those unfamiliar with Mishima monogatari (which is likely to be most viewers in the West) to catch a multitude of nuance and add a richness of depth. The DVD offered end-to-end narrations in Japanese (the speaker's identity remains in dispute) and English (one is co-hosted by Schrader). Although it rambles a fair amount, the Director's input will really help the viewer struggling to make heads-or-tails out of the movie (the struggle is well worth it, so turn on the narration with your second viewing). There are two de facto stars in this picture: lead actor Ken Ogata (always as pleasure to see in action); and the cinematography (with a very significant assist from the set designer and color-coordinator specialists, it is simply outstanding!). Other performances are mostly workman like as is the direction. Score by Philip Glass delivers a symphonic knockout! Subtitles fail to catch sets of symbols and lines of dialog here and there. Opening credits are translated and all closing credits are presented in English. Recommended. WILLIAM FLANIGAN, PhD. Details: cinematography (wide screen, color, black and white) = 9/10 stars; set design = 9/10 stars; score = 8 stars; sound = 8 stars; subtitles/translations = 7/8 stars; direction = 7 stars; performances = 7 stars;\nediting = 6 stars; DVD/print (Criterion, 2008) = 5 stars.","I saw this originally on Channel 4 (UK) and it was a fantastic film that left a great impression on me. However I saw it on Irish TV recently and there was an added narration by Roy Scheider (\"we're going to need a bigger boat!\"). This ruined the film for me. His droning monologue adds absolutely nothing to the film, and if anything takes from the films brilliance. I wonder at the new DVD version that has no Roy (due to legal reasons?) would stop people from buying it. Well believe me, the film is much better for it!CheersDamian","this film is a gem. the moment when mishima tries to squeeze into a hatchback in full ceremonial gear sums up his deluded and anachronistic existence. and it's got the music from the truman show on it. george lucas helped produce it. what more could you want?","Mishima seemed to be a person constantly trying to grasp (or become) his vision of ultimate beauty. Early in life, he saw beauty in women (Beauty chapter, weaved in with \"The Temple of the Golden Pavilon\"). Then he had sex, which made him realize true beauty didn't lie in women. Then he began to think that dying for a cause (\"exploding like a firework\") would be the only way he could reach this beauty. He was too cowardly, however, and didn't truly want to die. He then began to think that achieving a perfect body is the true form of beauty. Then finally, by training his army which he tried to make as pure as his art (by practicing samurai beliefs) and devising a plan to unite art and action, so that he could finally achieve \"harmony of pen and sword\", something he had always striven for.The way the film is structured is utterly genius. It is a wholly unique film. It is obviously cut into four chapters (all of which I've just described), Beauty, Art, Action, and Harmony of Pen and Sword. The film delves into each of Mishima's attempts to find true beauty, showing his real life past in black and white, and dramatizations of his novels in vibrant color with extravagant stage-like sets and lighting, cutting both his life and segments from his novel together to show how his life mirrored his art and vice versa, and finally, cuts between the very end of his life in color, leading up to his final \"harmony of pen and sword\" through his impassioned speech after kidnapping a military general, before finally freeing himself through death. The structure of the film in four chapters also represents how Mishima himself viewed his life: as a constant struggle to transcend mere superficial and materialistic forms of art and to free himself from his constant search to find beauty (which included his own body and novels, which were both ways to attempt to find true beauty). The style of the film is perfect for the subject, and this is one of the only films I've seen which could truly tell the complete tale of the life of an eccentric genius, and show us how he thought. The urgency of the constant score of the film also fits perfectly with the urgency of Mishima's search for beauty and the urgency at which he wrote."],"review-user":["irajoel","Baroque","ametaphysicalshark","loganx-2","david-345","Dan1863Sickles","ags123","Reel07","G_a_l_i_n_a","Cosmoeticadotcom","xexses","simonbasso","tedg","allar100","onepotato2","computerkathryn","Solipsis","poc-1","Islandeye","mim-8","Smallclone100","net_orders","dbbridgeman","benski-1","quinimdb"],"review-date":["3 April 2001","21 February 2003","9 July 2008","11 August 2008","22 October 1999","24 June 2004","12 January 2007","4 July 1999","24 April 2006","7 June 2012","17 May 2002","2 February 2001","12 January 2004","28 February 2003","8 February 2010","8 August 2006","2 February 2004","4 September 2003","1 August 2008","9 May 2008","26 October 2018","7 October 2018","5 July 2004","22 March 2001","20 August 2016"],"review-rating":["10","8","10","9","9","5","9","10","10","1","10","8","10","10","7","9","10"],"review-title":[" MISHIMA: A Troubled Life in Four Chapters\n"," Magnificent\n"," Stunning\n"," Like A Boy At A Window Or A Sword In A Sheath\n"," A beautiful work of art\n"," Brilliant, Magnificent -- But Not Flawless\n"," Highly stylized, rewarding film for thoughtful viewers.\n"," Amazing\n"," Harmony of Pen and Sword\n"," O.k.\n"," Complicated but still easy to watch\n"," My favourite film\n"," The Theatrical Life\n"," A beautiful masterpiece\n"," Film as Sedative\n"," A true gem!\n"," John Bailey's cinematography makes this film sparkle\n"," Stories within stories\n"," Who are we to judge?\n"," Fascinating\n"," Completely and utterly stunning\n"," The Art of Subversion.\n"," Fantastic, depending on the version you see\n"," truly controlled filmmaking\n"," Mishima: A Life in Four Chapters\n"]}