{"review-url":["http://www.imdb.com/title/tt0088402/reviews"],"review-text":["Straight up, I love this film.  I love everything about it.  It has a great soundtrack, it has a lot of recognizable faces and it is funny as hell. There are so many plots in this film and every one of them is funny in one way or another.Where as Spicolli lit up the screen two years back, Drake is almost as memorable of a character.  All he wants to do is have fun.  He moves out of the house without his parent's consent, he skips work whenever he feels like it, he is obsessed with sex, he loves his drugs and booze and he tries to be a good friend.  It is his lacksidaisical attitude that makes him such a joy to watch.  And he comes out with some great lines.  And there are so many tiny observations that you don't see coming but they make you laugh at the sheer velocity when it hits you.  One particular moment is when Tommy and Bill are talking about Bill's ex girlfriend dating someone else now.  At the end of the conversation, Tommy takes his huge beer bottle and just throws it over his shoulder, casually.  He then says good night and the scene ends. It is a perfect scene.  Tommy's world is his own.  He really lives to party and have fun.  When the conversation is over, his time is over and he doesn't care who he offends in the process.  He has an innocence about him. \"It's casual\" is his favourite saying.Another such classic scene is Reggie handing Bill a donut.  He says something to him that me and my friends will never forget because we rewound the film ten times and watched that part over and over again and hurt ourselves laughing.  It has to be seen to be appreciated.Wild Life is a throw back to when teen comedies were funny, raunchy, had a good ear, entertained us and just wanted us to get lost in their world for 90 minutes.  Wild Life does all those things perfectly.  If this is a film that you haven't seen, give it a chance.  It is a classic.Also check out the army store guy that Jim has problems with.  He is a very familiar face now and it is his first role on the big screen.","One of those movies where you don't have to expect an award or anything from it, but just want to watch it and have a good time. A feel good movie about basically nothing just makes you laugh at how much this movie's characters are just looking for some fun and not an Academy Award. The whole thing with Eric Stoltz brother...why was that in there. It was still funny and I enjoyed but it had no point. There'll never be another movie like this. Now a days the movies try to have to much story and it turns out terriable. We need another pointless movie like the Wild Life!","There are a lot of people that put down on these type 80's movies but those people may not have been coming of age during this time. I was just starting college when this movie was released so I could really appreciate it at the time and my friends and I still, to this day, will occasionally joke about certain lines in the movie. As much as I liked Sean Penn's Character Jeff Spicoli in \"Fast Times\", I actually enjoy Chris Penn's Character \"Tommy\" more because he is the lead character with more of a actual speaking roll opposed to just a series of one liners such as with Spicoli. Chris Penn should probably pop this film in his VCR and use it for motivation to lose some weight. Yes, the subplot with the Randy Quaid, Vietnam vet character does seem a little out of place, but he does a convincing job in the role. If there is anyone out there that hasn't seen this movie but liked the other similar type movies such as \"Fast Times\", etc. I highly recommend it.","While I hold its predecessor, \"Fast Times At Ridgemont High,\" as a standard to which other teen comedies should be compared, \"The Wild Life\" is one of the better lesser known films from that time-and a worthy sequel, if you can call it that. I believe its tagline reads, \"From the makers of FTARH, something even faster.\" This definitely holds true. Though it may lack the depth of the former which tackles issues like first dates, teen sex, and abortions, \"The Wild Life\" is, nonetheless, a great flick. It's pure chaotic fun, especially due to Chris Penn's over-the-top character, Thomas Drake. If Spicolli was high on coke instead of weed, he would be Drake. Eric Stoltz, in his first major role, is great as the straight-laced Bill Conrad. The two characters work well off one another. Think a younger, hipper Odd Couple, complete with 80's gloss. Outside of them there are so many other great things about this film worth mentioning. Lea Thompsom has never looked cuter, especially during the scenes of her working at the donut shop. Jenny Wright is just delectable and fun to watch. Rick Moranis plays a great nerd/perv who is dying to get in her pants. Thomas Drake's wrestler buddies are hysterical, especially Benny, the little Puerto Rican guy, who says some pretty memorable lines. One in particular that he yells out during a night out at a strip club had me on the floor the first time I saw it. That's saying something! Finally, the movie ends with one of the best 80's party scenes on film, ever. Look out for special appearances by Ron Wood of the Rolling Stones, Leo Penn (Sean and Chris Penn's dad), and a random Michael Jackson look-alike at the party. Throw in a score by none other than the man himself, Eddie Van Halen, and you can't go wrong. For Van Hagar fans, keep your ears open for riffs that would be found on such albums as 5150, OU812, and For Unlawful Carnal Knowledge.If anything disrupts the flow of the movie it is a small subplot involving Randy Quaid as a burned out Vietnam vet. It just seems out of place and unnecessary. Other than that, it's near perfect. If your a fan of mindless but fun 80's movies and have not yet seen this one, you're in for something special. RENT IT NOW!!! p.s.-The credits say Cameron Crowe has a cameo as one of the cops in the film. Does he have his back turned during his scene because I have yet to find him. Someone please help me.","Great party movie, following the adventures of Bill & Tom, two high school buddies at opposite ends of the spectrum. Bill (Eric Stolz) prefers to live life straight-laced, while his friend Tom (Chris Penn) takes nothing seriously except partying all the time. When Bill moves out of his mother's house to live on his own he faces many issues, from his girlfriend, to his brother, to his landlord. Meanwhile, his friend Tom moves in to keep the rent down but proceeds to turn Bill's life upside down. This movie is non-stop comedy from start to finish and is a personal favorite of mine. Soundtrack features guitar virtuoso Edward Van Halen throughout the movie, also features cameos by rockers Lee Ving and Ron Wood. 70s Pornstar legend Kitten Navidad also makes an appearance! Classic 80s movie is worth multiple looks. Now all that needs to be done is a much anticipated DVD release! If you enjoyed this movie, take a look at \"The Last American Virgin\" which is similar to \"Wild Life\". I rate both highly.","The 'Wild Life,' like other 80s teen movies, are just one of those movies you watch not for story (since there really is no single, distinct plot directing the characters), but simply because you can have fun with the series of scattered events with which our characters wade through.This one follows the spirit of 'Fast Times At Ridgemont High,' minus most of the controversial plot lines ('Fast Times' addresses abortion, but this one only somewhat addresses strung out vets). Although, that is not surprising since Chris Penn's character, Tom Drake, so closely models Sean Penn's character, Jeff Spicoli. This movie is what a spin-off of 'Fast Times' would be like if Jeff Spicoli were the main character.There are essentially five main characters: Tom Drake (Penn), the anarchistic party animal; recent high school grad, Bill Conrad (a timid Eric Stolz who once played fellow surfer bonehead to Jeff Spicoli in 'Fast Times') who wants to prove that both masculinity and adulthood hinge on his having his own apartment; Anita (Lea Thompson) who is dating a sleazy cop; Eileen (the spunky Jenny Wright) who is much more independent that Anita, but no less able to entirely refuse her idiot boyfriend, Tom Drake; and Jim Conrad (Ilan-Mitchell Smith), the gloomy brother who is slightly less weirder than Josh Miller was in 'The River's Edge.' A crazy assortment of characters is typical in this variety of 80s comedy. Without a main plot, our characters' situations lead to some pretty hilarious subplots (most of them being between Tom Drake and Bill Conrad, who eventually become the 80s 'Odd Couple' when Drake moves in).Look for minor roles by Rick Moranis, as Eileen's completely nerdy boss, Harry; Randy Quaid as drugged out Vietnam Vet, Charlie; Lee Ving (lead singer of 'Fear') who briefly appears as the cable guy; and Michael Bowen (Tommy in 'Valley Girl') as Tom Drake's equally braindead jock friend.And, of course, it wouldn't be an 80s teen movie without boobs, beer, and house parties.I didn't like this movie the first time I saw it because there is really no point to most things that transpire in the story. Why is the scene at the strip club or the younger brother's fascination with the war important? It doesn't matter. I watched it a second time, a little tired and giddy, and the 'Wild Life' became the perfect late night lazy movie. Turn off your brain and enjoy. (That party sequence at the end is hilarious).","Sometimes I don't want to watch a classic film. No thought provoking drama, or a witty snappy comedy. Sometimes I just want to watch a silly little meaningless film on a rainy or snowy day. This is the film to watch.It has some good talent in it who were just getting started. That is always interesting to see. The story is this, kid(Eric Stolz) leaves high school and wants to move out on his own, trouble ensues. Freaky friends(Chris Penn, Rick Moranis), unattainable girl(Lea Thompson) and a over nagging family is all featured here. There is also a nude scene in a bar, so beware. There is a minor storyline about the little brother(Ilan Mitchell-Smith) who befriends a Vietnam vet who he starts looking up to, and later learns a little too much about his past.So if you want to give your mind a rest, your sick with the flu, snowed in or just feeling kind of silly, watch this movie and enjoy. I do own this movie and have enjoyed seeing it about 8 times now.","Fast Times it ain't.  But check this movie out, it has a heart.  Pour yourself a drink and enjoy.  It's loaded with a slew of just-beginning stars.  Sherilyn Fenn has her first on-screen credited cameo.  Chris Penn, Lea Thompson, Eric Stotz, Jenny Wright, Rick Moranis, etc.--they all look so young.  Oh and if you look closely the cop's wife is Nancy Wilson from the rock band Heart.","There is nothing not to love about this film...it still holds up as a very funny film with some great characters attached.For The Wild Life, the obvious connection and comparison will forever be Fast Times at Ridgemont High...which is fair and fitting. Like many of us, Cameron Crowe didn't just write down his reflections of his high school days...he painted a narrative as only he can. Visual, thematically accurate and draped with the soundtracks of our youth. As great as Fast Times is, The Wild Life is \"equal to\" on many levels and equally as enjoyable. Fast Times takes place during a school year chronicling several different characters as they go through the trials and tribulations of going through high school...where The Wild Life chronicles the lives of some high school kids during a summer break that is coming to a close. One of the things that never gets mentioned is how so much of the film takes place during the night...which for me was an underscore to the high school years for a lot of us who went to high school in the late 70's and early 80's. Outdoor parties, cruising around with friends, always looking for something to do and generally staying out all night...only to do it all over again, night after night....perhaps Art Linson had the same snapshot in his head when making this film...the story being told mostly in the evening has never been lost on me.From a character perspective, Christopher Penn, Eric Stoltz, Jenny Wright, Lea Thompson, Ilan Mitchell-Smith were perfectly cast in their respective roles....with Hart Bochner, Rick Moranis, Ben Stein, Sherilyn Fenn, Michael Bowen, Angel Salazar, Robert Ridgely and Randy Quaid among others offering terrific supporting roles that enhances the film. The musical score penned by Eddie Van Halen is also a great accent to the film....just terrific pacing.The Wild Life is a very enjoyable film that has several memorable lines, memorable scenes with a goof or two mixed in....but the film works to this day, still holds up. Hats off to Art Linson for making a good, funny and memorable film...released in 1984...it still resonates with those of us who remember those days fondly. Enjoy!","I love this movie to me this movie is just as good as Fast Times if not better. This movie was shown to me by my father and it has tons of great actors like Chris Penn, Eric Stoltz (the dude that was supposed to be Mart McFly's), and Leanne Thompson (Mart McFly's mom). Also the damn soundtrack was by Eddie Van Halen. Get out of here if you think this movie is mediocre because you obviously don't understand greatness.","Bill Conrad (Eric Stoltz) is graduating from high school and is desperate to be a grown up as he moves into an apartment. He broke up with his donut shop girlfriend Anita (Lea Thompson) who has since moved on having a fling with a married cop. He works with friend Tom Drake (Chris Penn) at the bowling alley. Tom is a hard-partying wrestler. Tom's girlfriend Eileen (Jenny Wright) is best friends with Anita. Bill's brother Jim Conrad (Ilan Mitchell-Smith) is obsessed with the Vietnam war and likes blowing stuff up. Wildness ensues culminating in a crazy party at Bill's new apartment.After the success of Fast Times at Ridgemont High, Cameron Crowe writes a sequel of sorts. He's better off making a straight sequel with the same characters. Instead, this one can only be Faster as the promotions claim. It's not really but more importantly, it's less compelling. This is more like a series of very memorable sequences. Like its predecessor, there are some crazy fun scenes that can be cut into a great trailer. The story isn't quite there and the characters need to be better. It's just that Cameron had already done this and needed to move on.","_The Wild Life_ has an obvious resemblance to _Fast Times At Ridgemont High_, and _The Wild Life_ comes up short.------------ Some other stan wrote the above comment. Of course The Wild Life is no Ridgemont. Ridgemont is the quintessential 80s flica. However, the Wild Life is enjoyable if you're not whiny about mindless movies being mindless movies (especially when you know it's supposed to be a mindless movie in the first place). The little Latino from Scarface is in this movie and he's straight disrespectful (\"I got Visa...Masterrrrr Charrrrge!!\") The Colonel also makes an appearance (\"Lawsuit...\"). RIP The Colonel 1931-1997.This movie is no worse than a 6 in comparison to other genres, btw. It is no worse than a 7 in terms of other 80s teen comedies at that. It does very much have the feel of a Cameron Crowe movie. Only staniels gave it a 5.","Chris Penn is hilarious as the all-time stoner brother of Jeff spicoli. This movie is great because it was a lot more real and funnier than fast times at ridgemont high. Casting was perfect and one of my favorite soundtracks of almost all Eddie van halen which went on to become songs on ou812 and unlawful carnal knowledge. This movie is one of the great stoner film heroes with cheech and chong. Fast times was more depressing than funny. Abortions, friends cheating on friends, jerking off in bathrooms, bad jobs, and failing school. Someone must hate the eighties to like ridgemont more than the wild life. The film even had great cameos like the maker of city limits Michelle schocked in the liquor store or Ben Stein in his first role in the sunny's surplus store.","Anyway I am of this era. I graduated Class of '84. Even saw Night Ranger at Disney World on my grad nite. Fashion and style this movie exemplifies the '80's. Mostly very week. I hate Chris Penn's character. He's looks so much like Alex Winter from Bill and Ted's Excellent Advernture it is scary. Just I hate his character. He has a dumb vacuous look at his face. And he is an idiot. His only funny scene I thought was when he picked up the bridal mannequin in the mall. Otherwise horrible character. A waste of space. Eric Stolz and Lea Thompson, at least you cared about them. The kid in the army jacket was cool and he should have hooked up with the girl he liked in the end. Jeez she does look familiar. I wish someone would tell me who she is. Pretty lame overall. I watched and I was high and didn't enjoy that much. If this was Chris Penn's leading role magnum opus he should be glad he died. No offense. He was much better in Footloose. Anyhow it had potential to better, but didn't try. Lame ending too.","Very strange screenplay by Cameron Crowe (following on the heels of his \"Fast Times at Ridgemont High\") has little inspiration and flails away at dumb gags. At least \"Fast Times\" had a fair share of satire and sensitivity behind its slapstick (courtesy of a good director, Amy Heckerling, and Crowe's undeniable penchant for capturing letter-perfect teen-speak); here, Chris Penn (Sean's brother, natch) is the goof-off who makes life hell for straight arrow Eric Stoltz, and the filmmakers seem to think he's hilarious. Jenny Wright has some good moments as a mall-worker, but Illan Mitchell-Smith is lost in a head-scratching subplot about a teen who seems to be infatuated with a shell-shocked ex-soldier. Queasy, confused nonsense given a shiny sheen and a soundtrack full of pop-rock tunes, but characters one would hope to avoid. Supporting players Lea Thompson, Rick Moranis, Lee Ving, and Sherilyn Fenn are wasted in stupid roles. * from ****","This movie was really funny. The people that were expecting to see an Oscar worthy comedy, should get over themselves. This was a fun movie to see with interesting and funny characters, plot lines, dialog quotes and catch phrases. I rate a movie a 10 if I have bought the DVD, or in this case, the videotape, and have watched it many times, and in this case, still laugh out loud. I have about 12 movies in my collection with a rating of 10 and about half don't have anything do do with the Oscars. Again, this was just a fun, light-hearted movie. I hope this comes out on DVD. I highly suggest checking this movie out, if you are in the mood for a wacky comedy.","This movie is such a fine example of the greatness that is 80's entertainment. Oh don't get me wrong, most of the music back then sucked. I only ever liked the metal bands from the 80s. Bands that had some balls. Forget that whiny keyboard crap and all that 'life is horrible and I want to die' garbage. But the movies from the 80's are the best. They were all about nonsense and just having a good time. This movie exemplifies that! Party! Get naked! Get laid! WOOOOOOHOOOOO!","I didn't get it. Literally, this movie is about nothing...absolutely nothing. Characters so dull, you don't care what they say, or what they do. Hell, you almost want it to be a horror movie, so that they get axed off, and you don't have to look at them any more. Okay, so maybe it's not that bad, but I did find this a major bore fest. It just seems to be a random mashup up of everything that the 80's had done at that point in time ( this was a 1984 film.) I did laugh a few times, but 90 percent of the movie falls completely flat. The funniest scene isn't until the 45 minute mark, when a fight abruptly begins in a nude bar. The Wild Life is from the same makers as Fast Times At Ridgemont High, which I think has its share of problems too, and that, also, had a few laughs, but that was another movie about absolutely nothing. Maybe its a good thing, then, that these makers have cranked out what they're good at, ABSOLUTELY NOTHING in the last 30 years.","a stupid waste of film stock, you sat there wondering why anyone involved attempted to take on this dreck. none of the characters were interesting nor intelligent, the premise of the film was to see who could be more obnoxious, chris penn's character or that of eric stoltz. the two women, jenny wright and lea thompson, couldn't have been more pointless. overall, the only actor that seemed engaged in any way was randy quaid's drug addicted Vietnam vet, who had so much to offer but the horror of what he had witnessed broke his spirit....","If I didn't have a soft spot for 80s movies, I would not have been able to sit through this flick. A movie may still be entertaining without a serious plot or point, but the problem here was that I found the main characters very annoying. Chris Penn was obnoxious and not in a fun way, Eric Stolz was mainly dull, the girls were weak beyond belief. The only one who I cared for was Jim (Ilan Mitchell-Smith of Weird Science fame), and his subplot was the most underdeveloped of all. The conclusion (if you can call it that) was also quite stupid: we are supposed to feel that this was a transformative coming of age and all lived happily ever after.\nOn the upside, the acting and soundtrack were decent and there were a few entertaining scenes. I have certainly seen worse flicks but would not recommend this to anyone but 80s buffs who have already seen all the good stuff from the era.","At the time of this writing (January 25, 2006), I am saddened to hear of the passing within the past few hours of Chris Penn. Other than Footloose, The Wild Life is the film that I remember Chris most from.I still remember in the film, with slight fondness, of Chris' wrestling character and teammates sitting in their favourite restaurant with a huge plate of french fries in front of them, drowned in an entire bottle of ketchup.Anyhow, my comment is in regards to the title track sung by Bananarama. After these many years, I still remember the rumour (Canadian spelling -- lol) that Bananarama was called in at the very VERY LAST moment to compose the track for the film and that they wrote the song on the plane bound to the recording studio to record the song and just after they recorded the song they went to shoot the low cost video for their title track. I heard that this entire process (from start to finish) took 4 hours to do! If this is true, then they truly are worthy of being the most successful female band of all time.Anyhow this is just a rumour I had heard back in the day and still remember a generation later. Perhaps anyone who reads this can comment and clarify. Thanks."],"review-user":["baumer","Finc","lsu170","gclamson","MonteCarloMan","vertigo_14","timmauk","ACME_Horses","Starrman21","dustinorteganowinsky","SnoopyStyle","chriso728762004","thestuka-1","retrokenn","moonspinner55","j_issa","Captain Fantasy-8","tdrish","wootenwriter","cpu-4","jwas"],"review-date":["16 July 1999","25 July 1999","21 June 2005","24 March 2005","3 August 2005","26 December 2004","9 January 2001","21 July 1999","20 June 2017","7 August 2018","4 June 2017","4 October 2006","27 February 2007","2 July 2007","17 May 2006","18 February 2006","21 January 2004","18 October 2017","23 June 2017","15 January 2018","24 January 2006"],"review-rating":["9","8","8","8","6","8","7","8","6","7","10","2","10","10","5","1","5","7"],"review-title":[" Thomas Drake really could be Jeff Spicolli's brother!\n"," clastic\n"," Before Chris Penn became obese\n"," \"...after Les Girls, you'll never be the same again.\"\n"," A wild film about living life to the fullest...\n"," It's Casual...(minor spoilers)\n"," a nice silly meaningless film\n"," Worth a rent\n"," Always brings back memories....funny, funny film...\n"," This Movie is Just as Good as Fast Times if Not Better\n"," some memorable scenes\n"," Don't be a fat stan like Ebert (or Sam)...\n"," Chris Penn's finest\n"," Puhleez, you got to be kidding me!\n"," Slow Times at Ridgemont High\n"," Great Fun Movie\n"," The 80's rule the earth!\n"," maybe i am missing it\n"," worthless trash\n"," Only for 80s buffs\n"," Bananarama Sings Title Song\n"]}