{"review-url":["http://www.imdb.com/title/tt0048347/reviews"],"review-text":["We have moved far beyond this tentative foray into a forbidden area-drug addiction-for the 1950s.  As such, the film may seem dated. The Man with the Golden Arm served its function is peeling back a layer of the underside of society, an eye-opener to a Southern country boy in 1955 when I first viewed this film in the theater. After some serious consideration about being too young, I was allowed to go. It was powerful and affecting then and still maintains some sharp, painful moments of the soul stripped naked.  As a movie depicting the loneliness at the core of being, it succeeds.Filled with angst, Frank Sinatra, in his best role, creates a vulnerability that makes him sympathetic to the viewer. He conveys his helplessness and ineffectualness in a beautifully restrained performance. As a voice of common sense in the dead-end urban jungle, Kim Novak as Molly is quite good. She is compassionate and yet stands on solid ground.  The interaction between Sinatra and Novak is really good.  Darren McGavin plays a slimy character and does it very well.  Eleanor Parker is superbly irritating and painfully insecure in her role of the pathetic Zosch, the crippled wife of Sinatra.  Arnold Stang is another unlikely survivor of the street. Regarded as pitiful and despicable, his character Sparrow provides tart comedic moments.  The music is almost the star of this film-brooding, frenetic, moody, poignant. Elmer Bernstein's score perfectly accentuates the tensions of Frankie Machine's spiritual weakness and physical need for heroin. Molly's theme is bittersweet and captures aurally what the film depicts visually. I know of no other soundtrack that effectively complements the tension and defeat within a man as effectively as does this one.","The Man With a Golden Arm was one of a trio of great films around that same time that dealt with drug addiction. The other two were Monkey On My Back and A Hatful of Rain. But I think of the three this one is the best.Maybe if Otto Preminger had shot the thing in the real Chicago instead of those obvious studio sets the film might have been better yet. Who knows, maybe Preminger couldn't get enough money to pay for the location. It's the only flaw I find in the film.Frank Sinatra is a heroin addicted card dealer who was busted for covering for his boss Robert Strauss when the game was raided. He took the cure while in jail and wants a new life as a jazz drummer. But a whole lot of people are conspiring against him.First Bob Strauss who wants him back dealing, especially because a couple of heavyweight gamblers are in town. He uses a few underhanded methods to get Sinatra's services back. Secondly Darren McGavin is the local dope dealer who wants Sinatra good and hooked as a customer again. And finally Eleanor Parker his clinging wife who's working a con game to beat all, just to keep him around.Frank Sinatra got a nomination for Best Actor for this film, but lost to Ernest Borgnine in Marty. Sinatra might have won for this one if he hadn't won for From Here to Eternity in the Supporting Actor category a few years back and that Marty was such an acclaimed film in that year. His scenes going through withdrawal locked up in Kim Novak's apartment will leave you shaken.Eleanor Parker does not get enough credit for her role. She's really something as the crazy scheming wife who wants Sinatra tied to her no matter what the cost. If she had not been nominated that same year for Interrupted Melody, she might have been nominated for this. 1955 marked the high point of her career. Darren McGavin got his first real notice as the very serpentine drug peddler. His performance is guaranteed to make your flesh crawl.Elmer Bernstein contributed a great jazz score to accentuate the general dinginess of the bleak Chicago neighborhood the characters live in. Not a place you'd want to bring up your family.","(Mild Spoilers) Frankie Machine had been dealt a bad hand in life. A card dealer at an illegal gambling den in his Chicago neighborhood he was busted when the joint was raided by the cops and given six months in jail. While behind bars Frankie was treated for his heroin addiction at the prisons hospital and learned how to play the drums as part of his rehabilitation program. Now out of prison and back in his old neighborhood Frankie is trying to put his life back together by getting a union card in the Musicians Union and then a job as a drummer in a band and put his old life behind him but instead it catches up with Frankie in no time at all in \"The Man with the Golden Arm\". Otto Preminger's ground-breaking 1955 film about heroin addiction with Frank Sinatra giving the performance of his life as the drug addicted card sharp Frankie Machine, the Man with the Golden Arm. Frankie tries to getaway from the life that he lead but has this monkey or, better yet, gorilla on his back that just won't let him. Soild performances by the entire supporting cast starting with Frankie's friend Sparrow, Arnold Stang. Sparrows attempt to get Frankie back on his feet by shoplifting a suit of clothes for him ends up putting him and Frankie in the slammer, and almost back to prison, until his former boss at the gambling den Schwiefka bailed him out. There's Frankie's psychically as well as emotionally crippled wife Zosch, Eleanor Parker, who sees that her hold on Frankie is slipping and is slowly driven to madness murder and suicide. There's Frankie's drug dealer Louie, with Darren McGavin in one of his first acting roles, who's hold on Frankie is only good as long as he stays addicted and Louie goes out of his way to make sure that he does. There's the owner of the gambling joint that Frankie works at as it's top card dealer Schwiefka, Robert Strauss, who like Louie goes out of his way to get Frankie back to work for him even though if he's arrested again Frankie's hopes for a new and better life will go down the drain. And then there's Frankie's next-door neighbor and friend Molly, Kim Novak,who goes to almost impossible lengths to get him over his addiction by locking him up in her apartment. It's there that he goes \"Cold Turkey\" and almost ends up dying trying to kick the habit in one of the most harrowing sequence ever put on film.A no holds barred movie with explosive performances by everyone involved makes \"The Man with the Golden Arm\" one of the great classics of realism in motion pictures coming out of the 1950's.","............................................................from Pasto,Colombia...Via: L.A. CA., CALI, COLOMBIA and ORLANDO, FL If you're under 70, there's probably no way you can remember how controversial and cutting edge MAN WITH The GOLDEN ARM was when it was released in 1955. Fortunately, my parents were very liberal in permitting me to see films and even took me to see it just after turning Eight. WOW! What a tremendous impact it had on me. It was the first \"Grown-up\" film that made me realize there was more to cinema than just Sci-Fi/Horror, Westerns and Kids' movies! Mainstream cinema had never touched the subjects of drug addiction and heroin withdrawal, which were considered taboo topics, even at the dinner table, let alone as the focus of a movie to be shown in public! The MPAA (Motion Picture Association of America) refused to give its seal of approval to GOLDEN ARM, forcing Producer/Director Otto Preminger and Distributor United Artists to release it without the MPAA's seal. This, of course, contributed greatly to both the films commercial and critical success! It also opened the door to new ways of making, distributing and classifying films.Before my recent third viewing, I had only seen it once at age 8, mentioned above, and again, in my late teens (Perhaps the 10th Anniversary Re-Release?). Despite some of the production elements and dialog that do date the film considerably, the last half of GOLDEN ARM had me in a headlock. The acting, Bernstein music, photography and editing all contribute to the mood of the movie, precisely as Otto Preminger intended! The scene where Machine(Sinatra) undergoes withdrawal pains is still unbelievably hard-hitting today.In general, Sinatra's performance is quite surprising. His Oscar nomination was very well deserved. When you consider this performance in conjunction with Sinatra's role in MANCHURIAN CANDIDATE and From Here to Eternity, you begin to appreciate just how underrated OLD BLUE EYES was as an actor! 9*STARS*.....ENJOY/DISFRUTELA!Any comments, questions or observations, in English or Español, are most welcome! KissEnglishPasto@Yahoo.com","A solid drama to begin with, \"The Man With the Golden Arm\" is particularly worthwhile for Frank Sinatra's performance as Frankie Machine. The movie was well-conceived, and it would probably have been worth seeing with any decent lead, but Sinatra makes it even better. The story is interesting and at times compelling, as Frankie struggles against himself and his circumstances.The story is told from the viewpoint of its era, yet the basic elements are timeless enough that the story still holds up very well. The details of Frankie's situation are less important than the general themes of him battling his own desires while also contending against \"friends\" who simply want to use him for their own purposes.Sinatra was good at this kind of role, as a character with his own inner demons who must also face hostile surroundings. He channels his nervous energy into expressions and gestures that convey well what is going on inside him. The actor Sinatra deserves to be remembered for roles like this one and his roles in \"The Manchurian Candidate\" and \"From Here to Eternity\", rather than for the insubstantial 'Rat Pack' features.The supporting cast have simpler roles, but they do their jobs satisfactorily. The story moves at a good pace, and it is complemented by an Elmer Bernstein score which, though sometimes jarring, is appropriate. The combination works well as a whole.","Frank Sinatra did so many excellent things in the world of entertainment that it's hard to single one out as the best.  If I had to name the best thing he ever did, though, it would be his performance as Frankie Machine, the heroin- addicted musician and poker dealer who is saved, just barely, by the love of a good woman (played by an exceptionally babelicious Kim Novak).  The \"cold-turkey\" scenes between Sinatra and Novak are terrifying and heartbreaking.  The movie is very nearly perfect, in fact, from Saul Bass's title graphics to the ground-breaking jazz score by Elmer Bernstein.  It might not be the sort of thing anyone thinks of in regard to the 1950s, but it's a must-see nevertheless.","Sinatra is thoroughly convincing as the addict in this grim horror story of what life is like for someone who has lost his soul to drugs. This is film noir made even more noir by the drab sets and lighting. We go through the terrifying experience of a man who is trying to escape from the monster he has placed on his own back.Elmer Bernstein's score is a mixture of jazz and symphony that makes the addict's frightful journey even more believable to the audience.This film opened the topic of drug addiction the way LOST WEEKEND broached the subject of alcoholism. At least people could talk about these addictions a little more freely.","I've always enjoyed Frank Sinatra's music, and just recently I wrote a term paper about his life story.  I've been fascinated by the life and legend of Ol' Blue Eyes.  However, I've never seen any of his movies.  So I wanted to see if his acting was as great as his singing.  Well...it was!  I was blown away by his performance in this movie!  He really does a tremendous job as recovering heroin addict Frankie Machine, who's trying to put his life back together and audition as a drummer for a local band.  Otto Preminger's direction is great as well.  I haven't seen any of his other movies.  I read his biography on the IMDB.  He seems like one of those directors who was sorely misunderstood, and people had conflicted thoughts about him.  Seems like the kind of person who appeals most to cult enthusiasts.  I haven't seen enough of his films to know for sure if he's really brilliant, but now I'm curious.  I want to see more of his films, because judging by his attempt with \"The Man with the Golden Arm\" this guy has talent.  I also loved the music for this movie.  The score definitely contains the kind of music that I'll remember if I ever happen to hear it again.  That's when you know you have a great score.The supporting performances are fine as well, including Darren McGavin as the local drug pusher, Eleanor Parker as Frankie's wheelchair-bound wife and Kim Novak as his lover.  It's interesting to see how filmmakers handled the subject of drug abuse, as opposed to modern attempts in films like \"Trainspotting\" and \"Requiem for a Dream.\"  Back in 1955, just mentioning the word \"drugs\" caused controversy, and if you watch the film they kept the subject on a very discreet level. There's only one scene where Frankie is actually getting heroin injected into his arm, and they showed a close-up of the reaction of his face rather than showing the needle graphically poking into his veins.  But it delivered its message without making it feel watered-down.  In a powerful drama like this, with powerful performances and direction like this, you don't need graphic portrayals of drug abuse to keep the audience intrigued. \n\"The Man with the Golden Arm\" is a dramatic gem that all film buffs should check out.  It really is an amazing piece of work!My score:  8 (out of 10)","I loved that this movie takes place on an imaginary block of an imaginary city. You could say the streets represents a state of mind just like the title ofChinatown did two decades later. Here degeneracy and addiction are thenorm. This place sucks you in and wont let go. It's here that Sinatra must face his demons when he returns home after getting clean at a rehab clinic. The film ends up being just as much about moving on from the past as it does about drug addiction. Sinatra's junky is a bit amorphous, we never really learn whether he grew up here or what led him to his addictions. However, the story is strong and told with a nice brisk pace. There are some real memorable moments (the Gamblingsequence, Frankie coming off smack, etc). Preminger's direction is great, some subtle camera work adds a lot to a number of scenes. Elmer Berstein's scoreand Saul Bass' titles perfectly set the mood. Overall, an endearing film you should check out.","*** Spoiler in fifth paragraph *** This was an amazingly frank (uh-huh, uh-huh) picture for 1955. Otto Preminger and Carlyle Productions took a chance by making it, the Motion Picture Association of America balked at certifying a film that openly shows a junky jabbing a syringe full of heroin into his arm. Frank Sinatra took a chance both on playing an addicted musician and at falling flat on his face in a role that required at least twice as much acting as he'd ever done. All in all these gambles paid off, the movie is a classic, though it's not perfect.Nelson Algren's novel may be great, but it has far too much going on to fit comfortably into a two hour movie 'The Man with the Golden Arm' is 119 minutes and often feels much longer. However, in my opinion it's not just Frankie Machine (Sinatra) that makes the film but the other characters and their sub-plots, all involving Frankie. Ultimately it's not just Frankie who has the addiction, everyone and everything seems to be dependent on him and he feels it keenly. When the pressure gets to be too much the drums start pounding on the soundtrack and Frankie steps across the street with his well-dressed \"friend\" Louie.It's an exaggeration to say that Frank Sinatra's music career was ever really in the doldrums, but in the early 50's he was in limbo between his days touring with big bands and the Las Vegas era. 'From Here to Eternity' established him as a serious actor and his career as a singer rebounded as well, but 'The Man with the Golden Arm' was still a significant challenge, the whole show sinks or swims with his performance. He pulls it off with such skill that for several minutes at a time I forgot I was watching Frank Sinatra, he must have known junky musicians and exploited that knowledge to the utmost.Set side by side with Billy Wilder's masterpiece 'The Lost Weekend' there is more emphasis on the sociological causes of addiction in 'The Man with the Golden Arm.' Whereas Don Birnem (Ray Milland in 'The Lost Weekend') seems to struggle mostly against himself, Frankie Machine is beset by external forces and he takes refuge in the needle. Neither approach is wholly right or wrong, mostly because addiction is impossible to fully explain, but it seems like this film might have benefited from a little more insight into Frankie's internal struggle.*** Spoiler *** One of the problems I have with this film is the clichéd reliance on \"quitting cold turkey.\" I realize that 'The Man with the Golden Arm' was probably setting the trend rather than following it but that doesn't make it any better. In the beginning of the movie Frankie has to all appearances kicked his habit with the help of a doctor and a treatment facility of some sort. Naturally the drama of the film requires that he backslide, but I found the All-American ideal that a man has to face his problems alone (or maybe with the help of a good woman) out of place here. Going cold turkey and riding off into the sunset with Kim Novak seemed too unrealistic. The end of 'The Lost Weekend' was similar but in my opinion was a little less rosy.","Otto Preminger's \"The Man with the Golden Arm\" is a reference to heroin addiction - something that must have been rather risky to film back in 1955, fifty years ago (the censors today STILL have a problem with drug content in films!).The lead role was originally offered to Marlon Brando, then snatched by Frank Sinatra before Brando could respond. Sinatra convincingly portrays a pro card dealer and ex-heroin addict who returns home to the city only to find himself battling the demons of temptation.Preminger is one of my favorite directors (his \"Anatomy of a Murder\" starring James Stewart is a brilliant and revolutionary courtroom drama). Preminger pretty much helped change the face of cinema back in the '50s - \"Anatomy of a Murder\" was extremely controversial when it came out due to both its plot and content (references to rape, women's \"panties,\" seduction, etc.) and \"The Man with the Golden Arm\" deals with a topic that is equally volatile.However, Preminger pulls it off without becoming exploitative. This is like a forerunner to \"The Panic in Needle Park\" (1971) and bears more than a few similarities in terms of general motifs to the classic Billy Wilder movie \"Lost Weekend,\" starring Ray Milland. These three films in particular are probably the best movies about alcoholism predating the 1980s and still remain relevant today.","This is easily one of the best movies of the 1950s. Otto Preminger directed only four or five really good movies and this is one of them. Frank Sinatra gives his best performance and the music score by Elmer Bernstein is dynamite. From the opening titles (by Saul Bass) to the hysteria of drug addict Frank going cold turkey, this is a riveting movie! With Kim Novak (giving a very good performance), Eleanor Parker (giving a very bad performance) as well as Darren McGavin as the reptilian pusher and Arnold Stang as Frank's grifter pal. Beware of bad prints: this movie is in the public domain so some copies are pretty rough.","Director Otto Preminger makes a valiant attempt to interject some real feeling into this adaptation of Nelson Algren's novel, but the material is ultimately far too false and the film fails to come off. Frank Sinatra plays Frankie, an ace card-dealer and poker-player coming out of a six-month stay in an institution to kick his drug habit; in the interim, he's become a good drummer and hopes to land a job with a band, but troubles with his invalid wife and the low-life neighborhood characters set him out on the precipice once again. Preminger can't seem to eke out a realistic scenario within these studio back streets, and Elmer Bernstein's blaring music undermines the nuances with Prestige! and Importance! Sinatra manages some hard-knock looks of concern and hopelessness, but his well-intentioned Frankie is a distressing creation (and, with all that talk about the \"bobbysoxers\" turning out for him, he's an uncomfortable sketch of the real Frankie when he was down-and-out several years prior). Glamorous Kim Novak, cast as the local working girl, is perhaps too Park Avenue for these squalid settings, however this is one of Novak's best, most subtle performances and she carries a great many scenes in the second-half. Eleanor Parker's role as Frankie's wheelchair-bound spouse is something else altogether; played on the verge of hysteria, it's a stunning portrait of a parasitic woman on the edge, needling, needy and yet aggressive. Parker appears to relish this outré role (and chews up a few scenes in the bargain)--and her big exit scene is a beauty--but in the context of this film, the performance is too hyperbolic. It's indicative of much of the writing, which walks a fine line between human drama and soap opera. This effort, pumped up for big effects, crosses that line too many times, finishing up wilted and unsatisfying. ** from ****","The Man with the Golden Arm (the movie) is a decent career vehicle for Frank Sinatra, but fails abysmally as a good adaptation of a fantastic book. You always hear about how books are \"changed\" when they are made into films- things are cut out, dumbed down, etc. Well, you can't even say they \"changed\" anything with the movie- they just told a completely different story. The characters and setting are the same sure- but not the ambiguous characterization, the depth of the men and women of Polish Chicago in the book. As for the setting, it's become merely a play stage, complete with the unnecessary \"supporting role\" players walking all too busilly down the claustrophobic, interior exterior streets. The movie is a dumbed-down, completely different take on Frankie Machine and drug addiction. When this happens, Zosh, Frankie, Sparrow, all lose their psychological edge. Frankie's drumming, a modest dream in the book, becomes his full passion in the movie (probably because Sinatra is a musician). And drug addiction is treated as shlock, exploitavely. The acting is decent, especially the snakelike Louie, who is more menacing in the movie than the book. But it's just a shame this kind of movie can be heralded as a classic alongside the book it is \"based upon,\" the real story of Frankie Machine. The movie just goes to show Hollywood can' get anything right without dumbing it down and adding a happy ending. In this case, they just changed it completely, cheapening an important and realistic story into Hollywood fluff. I'm sure as hell biased because I read the book first, so I can't really treat the movie honestly by knowing how good the book is. I actually thought about turning the movie off (and I never do that), just so I wouldn't get its silly plot confused with the beauty of the book. But this is an overrated film, and while it's not so bad, the book should come first, as it was the first. And it should have remained the only story of Division Street and Frankie Machine.","The Man with the Golden Arm was one of the first films to have as its main topic (and, in some respects, the message) the tragedy of heroin addiction. It's nowhere near a great film, but its importance lies in Otto Preminger's dedication to making it feel real and on the edge of melodrama and naturalism. What I liked is that it's not so much an expose of junkies (if you want the best expose of that read Naked Lunch, if you can get through it anyway, besides the point), but the nature of the urban environment Frankie Machine lives. He expects after he gets out of prison for dealing to go on the straight and narrow, to become a drummer in a band and make it legit as a musician. But he has his \"crippled\" wife Zosch, who can't work and needs money and often complains, and then there's the old neighborhood- he can't escape seeing Louie (Darren McGavin), who is still doing back-room card games and, yes, pushing dope. Like Mean Streets, it's hard to escape the minutia unless you leave.But then again, it's hard for Frankie Machine not to try and operate naturally in this urban quarter. It's just that he can't escape the temptation of junk (when he's booked on a phony theft charge with his friend, he sees a junkie freaking out, and it puts back the fear of going back on into his clean self). And personifying Frankie is Sinatra, and I can't see anyone else who could've played him, even original choice Brando. He fits into the neighborhood, and seems like the kind of guy who should be a step ahead of the game. But there's also a vulnerability to Sinatra that he pulls out wonderfully, and by the time we see him going 'cold turkey' in Molly's apartment, it's believable even if it's not the kind of thing those from 'my' generation would think of heroin (i.e. Trainspotting and certainly Requiem for a Dream). If for nothing else, you want to watch the movie to see what happens to Sinatra as this character.The flaws, however, come in some of the other performances, though it's a little tricky. Eleanor Parker seems to be overacting for a good portion of the movie, fooling Frankie that she's really crippled when in reality she can walk and is fooling him for one reason or another. But then it becomes clearer as it goes along- she's supposed to be nuts, and nuts with jealousy, and on that level it starts to get better. Meanwhile, Kim Novak is good, though not Vertigo-worthy, as the possible girl in the side but more like the voice of reason in the story. Then there's a Detective Bendar, who might be one of the most one-note characters/performances, ever. And also Sparrow, Frankie's nerdy friend, and the characters of Louie and Schiefka, and they're all played as one might expect them to (actually, McGavin is better than OK). As far as casting other talent around Sinatra, Preminger doesn't do all that great. And, frankly, some scenes kind of fall flat.But there's a lot of fascination in the Man with the Golden Arm, and not just as some dated piece of sociological interest. It works as compelling drama, and as a message piece conveyed without being preachy or campy. It's a genuine article, just not exceptional.","From the crash of the opening theme, \"The Man With the Golden Arm\" is classic 1950's entertainment. No subtlety here, Frank comes home from prison with a monkey on his back and goes right back to the old neighborhood, where the old scumbags still lurk. This is a tale of his dark ride with all of his emotional baggage intact. The performances are all a bit overripe, but that's part of the fun of watching. Darren McGavin and Arnold Stang are unforgettable, and almost steal the show. This and \"The Manchurian Candidate\" are the two greatest Chairman of the Board films, in my humble opinion. Don't miss either one of them.","This great movie brought out into the open the horrors of heroin addiction. It captured the struggle of a man, Frankie Machine, with a \"monkey on his back\".  Frank Sinatra did his homework, well. The acting is superb, the score is first rate and the actors all gave above average performances. Frank gave one of his best performances.  This movie has much to offer.","Frank Sinatra took this role, chewed it up with the rest of the scenery and - spat it out HIS way. TMWTGA is stagey, the ending is trite, some of the scenes need a little more cutting, but that's all. It's great entertainment from start to finish, and while you watch it you realise that Sinatra, that long-dead MOR crooner, had junkies, gangster card games and the whole US urban hustle thing in his blood - he didn't learn it from an acting coach. There are all sorts of directorial touches to keep you amused, and the (non-dated) soundtrack cooks all the way. The marathon card game beat Goodfellas, Sopranos, etc. by forty years! So it wasn't faithful to the book? What movie is? And I can't imagine it being remembered if Brando had been let loose on it; the cold turkey scenes would have been embarrassing, instead of edgy, convincing and moving with Sinatra. No-one else has mentioned the seedy, lazy, cynical cops - absolutely spot on! And Eleanor Parker would have driven *me* to smack.","Rather than go on location and make a realistic film about drug addiction in the Windy City, contrarian director Otto Preminger decided to go the opposite way and make his movie appear as artificial as possible, thus flying in the face of the fashion set by men like Kazan, Huston and Zinnemann, who were making their pictures all over the world. Nelson Algren, on whose novel the movie is based, went on record as despising it. What, one wonders, was Preminger up to, and why did he do the movie this way?The sets in the film are so minimal as to suggest a Mr. Magoo cartoon. Louie, the drug pusher, is attired as to resemble the sort of gangster the artists at Mad magazine used to draw. Arnold Stang, wonderful comedian that he was, seems out of place in a serious picture like this, and his very appearance, topped off by an exaggerated and over-sized baseball cap, elicits laughter. Robert Strauss, another actor best known for humorous roles, is likewise out of place, as his large, heavily jowled face and Runyonesque delivery of lines seems more appropriate to a Jerry Lewis movie. Against all this, stars Frank Sinatra, Kim Novak and Eleanor Parker have to work overtime to just keep the viewer from snickering. Sinatra is jittery and manic throughout, suggesting a man ill at ease with himself, hence wholly appropriate for the role of a drug addict. Miss Novak, plant-like and sublimely deadpan, is sympathetic and seems a product of the artfully dingy slums she graces in the film. Parker is pure Hollywood and very hard-working as the crippled and crafty Zosch. She is never convincing, but then neither is the film.I wouldn't recommend this movie to anyone interested in a realistic depiction of the lives of drug addicts in America. The Caligari sets alone make it unbelievable. Preminger may have been aiming for a dream effect, as the cardboard backgrounds give the proceedings the surreal feeling of a nightmare operetta, perhaps harking back to Preminger's early days in Vienna.","This is 50's drama in the Elia Kazan mold; spelled with an over-sized \"D\" and with its conscience turned up extra loud. You could stub your toe on its moral message. The cast of characters is a bunch of trapped lowlifes. And the scenario is deliberately tawdry in the hopes of scaring up some verite'. It made me wonder why realism usually means I have to spend so much time with irritating, loathsome characters like Sasha, Vy, Frankie, & that annoying stooge with the ball cap. I wanted them all lined up and shot after just a few minutes.It's not as modern as it thinks or postures. It's more of a packaged-product than a movie; they designed the crap out of the production to give the appearance of thought, depth and modernity, but all that effort would have been better spent on questioning what drama was and what it might be. As soon as the pitiful girlfriend shows up in a wheelchair you know you're in for an old fashioned, heavy-handed run through the machinery. It's Laura Wingfield all over. Unaware that a wheelchair makes her stock nearly worthless in a 1950's slum, she's also the world's biggest, most neurotic drag. It's really sad that film-noir gave way to this unsubtle, over-produced schlock.All that and an overpresent Elmer Bernstein score that leaves no room for the characters to breathe. No dramatic development occurs without an orchestra slapping the sh*it out of viewers.A ridiculous movie without a shred of nuance.","It's a shame that this adaptation of Nelson Algren's classic Chicago novel, one of the first to deal with drug-addiction, is so obviously studio-bound. Even by 1955, the year it was made, a number of more adventurous directors were going to real locations. Perhaps it was Sinatra, notoriously antsy when it came to being too far away from Hollywood or Vegas, who insisted that Preminger shoot the story on those phony sound-stage interiors which passed once for real city streets. Sam Leavitt, the cinematographer, seems to have over-lit many of these studio sets as if he was afraid of being too dark and depressing. Another minus, but much lauded in its time, is Elmer Bernstein's heavy handed big-band score which often only punctuates what is obvious. Sinatra really tries, working hard, committed to making the role seem both real and sympathetic. The primary failure of this film can only be blamed on that most vastly over-rated of directors, Otto Preminger, whose gift for self-promotion and controversy can no longer disguise the fact that at heart he was a rather mediocre director. Too bad someone like old-timer Raoul Walsh couldn't have directed this.","I've always believed that your surroundings reflect the quality of your life, and in the case of Frank Sinatra, he is in desperate need to start fresh away from the slime of his old neighborhood and the buzzing flies of human waste that surround him. He's a junkie, swallowed whole by the monkey on his back, and unable to function without it, even after six months of rehab. The people in his life are of little help, and while it is his responsibility to get off the stuff (heroine it is presumed), they really don't seem to want him to be cured for various reasons of their own. There's his wheelchair bound wife Eleanor Parker, trying to suppress his dreams of becoming a professional drum player in order to hold on to him tighter, his loser pal Arnold Stang who seems to attract bad luck everywhere he goes, and most obviously, his dealer Darren McGavin who passive/aggressively works on destroying what he went through in rehab. The only good person surrounding his pathetic existence is the equally troubled Kim Novak, stuck in a wretched marriage with a drunk. Smaller roles are filled brilliantly, particularly Diro Merande as the aging neighbor, involved in everybody's business, and perhaps an instigator of many problems. Each character has a huge back story attached without even words in the script, a testimony to the writer's attentions to details.A sleazy metropolis atmosphere surrounds him, dramatized even more by that brilliant Elmer Bernstein score which was groundbreaking in its day and still swings in the present. Brilliant direction by Otto Preminger and that fabulous Saul Bass logo drawing remind me viewer that behind those streets paved with gold are alley ways covered in decades of misery and inhumanity.","An interesting look at heroin addiction, lacking the power and gravitas of the boozy nightmare that was THE LOST WEEKEND, but nonetheless a well-made and well-directed film from Otto Preminger. THE MAN WITH THE GOLDEN ARM sees Frank Sinatra playing an ex-con who works as a dealer in illegal card games but dreams of becoming a famous musician. Unfortunately, he's also a former heroin addict who must attempt to resist the temptation of another fix.This kind of story tends to write itself and indeed there aren't many surprises in the narrative. Sinatra is adequate as the lead, but I found his character rather underwritten and difficult to warm to. He has a lot of negative qualities but few genuinely likable elements to his personality. Still, with a plot-driven film such as this, such lightness of characterisation is easy to overlook when the rest of the plot ingredients are so interesting.The supporting characters are enlivened by some actors giving very good performances. Particularly fine are Kim Novak (in a dry run for VERTIGO) as the object of Sinatra's obsession and Darren McGavin (THE NIGHT STALKER) in an early part as a completely amoral drug dealer. My favourite character is the morally murky Eleanor Parker playing Sinatra's wife who has a few hidden secrets of her own; she gets all of the best scenes and is involved in the dark heart of the movie. The set-piece in which Sinatra attempts to kick the habit is dramatic, but Hackman had it beat in THE FRENCH CONNECTION 2. Still, THE MAN WITH THE GOLDEN ARM is a very well made film, one that's there's no reason to dislike.","This sleeper film is great classic.Starring singer frank Sinatra as \"Frankie machine\"Also starring Eleanor parker as Frankie's wife.Kim novak play molly.Beautiful as always is Kim.Considered controversial in it's portrayal of addiction upon it's release in 1955.Shot in black and white.Produced and directed by Otto Preminger.This movie shows how one individual struggles to change his life situation.How his past nearly destroys his future.As this film show we can overcome our demons and let someone help us on our life pathway to recovery.This film is available on DVD and VHS.I really think frank Sinatra was and still is unrated as an actor.watch these following films,Manchurian candidate,from here to eternity,lady in cement,and a little gem of a film \"Suddenly\".Hope my review helped.","A strung-out junkie (Frank Sinatra) deals with daily demoralizing drug addiction while crippled wife (Eleanor Parker) and card sharks continue to pull him down.While this is not the first film to deal with drugs, it is probably the first to deal with them in a very serious manner. \"Reefer Madness\" and \"Cocaine Fiends\", for example, can be written off as humorous nostalgia. This film, on the other hand, is decades ahead of \"Trainspotting\" and \"Requiem For a Dream\". (Did you even know heroin addiction was prominent in the 1950s?) Variety called the film \"a gripping, fascinating film, expertly produced and directed and performed with marked conviction by Frank Sinatra as the drug slave.\" I agree for the most part, though I really did not enjoy Sinatra's acting as much as many others did, I think. Otto Preminger is a first-rate director, and I hope this film gets the respect it deserves over the long run (I found the 50th anniversary release to be not nearly cleaned up enough).While the focus is heroin and addiction, one could also make a case about this film being about love. Frankie's wife brings him down, encourages him to go back to his old habits, turns him away from his dreams. Molly (Kim Novak) does just the opposite. Divorce and adultery are hardly ever positive topics, but in this film you almost hope that Frankie goes that route."],"review-user":["dhoffman","bkoganbing","sol-kay","KissEnglishPasto","Snow Leopard","thefan-2","mermatt","mattymatt4ever","bennygillespie","Ham_and_Egger","MovieAddict2016","JasparLamarCrabb","moonspinner55","Nullness","MisterWhiplash","danielkonik","RALL","justincward","telegonus","onepotato2","ilprofessore-1","mark.waltz","Leofwine_draca","kvanclief","gavin6942"],"review-date":["28 February 2001","22 October 2005","28 December 2004","22 October 2013","17 December 2004","27 April 1999","14 September 2000","17 September 2001","14 September 2004","13 September 2005","12 December 2005","24 March 2001","28 May 2008","4 October 2006","10 April 2008","21 December 2002","11 December 1999","30 October 2005","15 August 2001","8 November 2007","12 February 2009","6 August 2016","23 July 2016","19 September 2012","12 March 2012"],"review-rating":["8","8","10","9","10","8","7","9","10","5","4","8","8","8","7","1","8","7","8","8"],"review-title":[" Only the subject matter of this film is dated.\n"," \"C'mon, One Hustler To Another.\"\n"," Do you think those bobbie soxers I'll really go for me?\n"," An Incredibly Important Movie and a MUST For ALL Serious Film Buffs & Historians!\n"," Solid Drama, & An Acting Triumph For Sinatra\n"," Sinatra's finest\n"," Real life horror movie\n"," A moving drama with golden performances\n"," A film about moving on.\n"," A daring film for 1955, long but strong. Sinatra's best dramatic performance.\n"," Gripping study of addiction\n"," One of the best movies of the '50s\n"," Fleabag settings via Hollywood, given a glossy coat and melodramatic treatment...\n"," Why not to make a book into a movie\n"," tour-de-force from Sinatra, and sharp direction, mark this as worth seeing\n"," 50's Cool\n"," A tragic story about a mans struggle with drug addiction\n"," Surprisingly powerful after all this time, thanks to Frank\n"," Strange Brew\n"," Let's have a bad old time\n"," The heavy-hand of Otto\n"," His arm may be made of gold, but he's surrounded by sewage.\n"," A look at the world of heroin addiction and illegal gambling\n"," Sleeper Film\n"," An Early, Yet Serious, Look at Drug Addiction\n"]}