{"review-url":["http://www.imdb.com/title/tt0065086/reviews"],"review-text":["'That Cold Day In The Park' is an extremely underrated psycho-thriller directed by a pre-fame Robert Altman. Sandy Dennis (who Altman would eventually reunite with on 'Come Back To The Five And Dime, Jimmy Dean, Jimmy Dean' in the early 80s) plays Frances Austen, a repressed thirty-something woman who is trapped in a boring bourgeois life after the death of her mother. She becomes fascinated by the sight of a young man (Michael Burns) who sits in the park getting soaked in the rain. After her guests leave she invites him into her home to get warmed up, and after discovering that he is mute an odd relationship develops between them. We soon find out that he he has the power of speech, but she is none the wiser, and his silence allows her to open up a little. After that things get well, complicated. I don't want to spoil what follows but it's fascinating to watch the events unfold, and Dennis' performance is terrific. Sadly she passed away in the early 1990s, Sean Penn's terrific 'The Indian Runner' being her last movie. I know nothing about Michael Burns, but he is also very good, and the supporting cast includes small but important roles from Altman regular Michael Murphy and cult actress Luana Anders ('Dementia 13', 'Easy Rider', 'Greaser's Palace'). 'That Cold Day In The Park' has been neglected for far too long. It's an excellent movie which I highly recommend.","One of the gifted Robert Altman's earliest and most underrated films, and a real showcase for the exceptionally talented Sandy Dennis who is at her best as the deluded heroine. Granted, Dennis has been known to overact a time or two, but definitely not here. She delivers a quietly intense, effective performance that sticks with you. If you're a Dennis devotee like me, THAT COLD DAY IN THE PARK is a terrific little gem you simply can't afford to miss. Michael Burns, as the odd young man that Dennis takes under her wing, also does well in his role, but the film belongs to Sandy who should have won a second Oscar for this film(she won the Academy Award three years earlier for her scene-stealing supporting role in WHO'S AFRAID OF VIRGINIA WOOLF?). Altman should have also won an Oscar for his superb direction. This dark, disturbing drama makes a great companion piece to William Wyler's THE COLLECTOR. After watching both films innumerable times, I still find it difficult to say which is the better flick. If I absolutely had to choose between this dynamic duo, I'd choose THAT COLD DAY IN THE PARK.","Robert Altman is one of my favorite directors, and I had succeeded in seeing all but two of the many films he made during his career: \"Health\" and \"That Cold Day in the Park.\" Neither were available anywhere to see for the longest time, and then a month ago or so the Gene Siskel Film Centre in Chicago had \"That Cold Day\" on its calendar, so I finally got a chance to review it.It's a much better movie than I had expected given its obscurity and the dismissive response from critics and audiences upon its release. It's the first of four dream films centering on the psychological distress of primarily female protagonists that Altman would make over the course of his career. Sandy Dennis plays a Canadian spinster who takes in a younger man who's only too happy to let her buy him clothes, food, etc. There is no sexual component to their transaction, but the sexual tension nonetheless builds to a breaking point, at which point Dennis's character goes off the rails in a macabre finale.Dennis is quite good and tones down her mannered acting habits. The film stylistically bears many of the hallmark Altman traits, like images broken up and refracted in reflective surfaces or the roving camera that will zoom in on a particular detail. I quite enjoyed this film and think that it deserves more mention in discussions about Altman's canon than it customarily receives.Grade: A-","This film requires a lot of patience. Because it focuses on mood and character development, the plot is very simple and many of the scenes take place on the same set - in Frances Austen's (the Sandy  Dennis character) apartment. But the film builds to a disturbing climax.\nThe characters create an atmosphere rife with sexual tension and psychological trickery. It's very interesting that Robert Altman directed this, considering the style and structure of his other films. Still, the trademark Altman audio style is evident here and there. I think what really makes this film work is the brilliant performance by Sandy Dennis. It's definitely one of her darker characters, but she plays it so perfectly and convincingly that it's scary. Michael Burns does a good job as the \"mute\" young man. Regular Altman player Michael Murphy has a small part. The solemn, moody set fits the content of the story very well. In short, this movie is a powerful study of loneliness, sexual repression, and desperation. Be patient, soak up the atmosphere, and pay attention to the wonderfully written script.I praise Robert Altman. This is one of his many films that deals with unconventional, fascinating subject matter. This film is disturbing, but it's sincere and it's sure to elicit a strong emotional response from the viewer. If you want to see an unusual film - some might even say bizarre - this is worth the time.Unfortunately, it's very difficult to find in video stores. You may have to buy it off the internet.","A rich but lonely woman, Frances Austen (Sandy Dennis), one day invites a boy (Michael Burns) from a nearby park to her apartment and offers to let him live there.The film was shot in Vancouver for the purpose of getting the rain, which seems odd. Many, many films today are shot in Vancouver, though the weather is not typically a factor. Was this common practice in 1969 or were they pioneering? Although based on a novel, director Robert Altman offered some ideas for the film, and he confessed that some were \"awful\". Luckily, those ideas were scrapped by star Sandy Dennis and never made it into the film. (Could she be said to be a co-writer? Not quite, but clearly a valuable resource.) Interestingly, the producer was Donald Factor, a member of the well-known Max Factor cosmetics family. His only other part of film history was producing \"Universal Soldier\" (1971), which starred nobody and was seen by nobody.","First of all, let me say this film isn't for everyone. It has a very strange subject matter. A spinster living alone and living a boring life discovers a young man in a park just across the street from her townhouse. She notices him sitting out in the rain and invites him in to dry off & warm up. The man does not speak and the woman assumes he is deaf mute. Still, she is fascinated with him and sexually interested in him. He finds her odd and continues his silence although we find out later that he isn't mute at all and that he reports to his sister everything that is going on between him & the woman. I won't give away the rest of the plot. If you can find this film watch it. You cannot take your eyes off of it. What makes it so interesting? Well, it is totally unique. I've never seen anything like it and watching these two together is very uncomfortable. Especially when you find out what this bland, boring, obsessive spinster is capable of. You won't forget it soon.","If you remember how Sandy Dennis charmed your socks off in \"Up The Down Staircase,\" be forewarned, she WILL creep you out in \"That Cold Day in The Park.\"  Remember to tell yourself, that this is only a movie, and she was only an actress...and a damned good one.","I would have given this more stars but for the contrived ending that sort of ruined the whole thing for me. Up until that point, I was seriously considering this work to be the equal of any work by Ingmar Bergman. Despite the corny ending, I still think that Sandy Dennis was easily the equivalent of Liv Ullman or Isabelle Hupert. It's shame that she died when she did, and I don't think she ever really received the accolades that she was due. Of course there was her work in \"Who's Afraid of Virginia Wolff\", in which she played a supporting role, and lighter fare such as \"The Out of Towners\", but one viewing of \"That Cold Day in the Park\" should be enough to convince any discerning viewer that Sandy Dennis was a great talent that was taken away far too soon.","***SPOILERS*** Feeling alone and needing companionship as well as love Frances Austen, Sandy Dennis, keeps all these emotions inside as she goes through life as a popular young single lady who has many high class friends. But for reasons of her own deep insecurity she keeps them at arms length. As for Frances male friends non are anywhere near her age so that she won't have any reason to have any romantic involvement with them. One early evening as Frances was entertaining some of her friends she spots outside her apartment window a young man, Michael Burns, sitting alone in the cold pouring rain. Feeling that he's homeless and alone after her friends leave Frances goes outside to the park and offers the young man shelter at her place until the rain subsides and even to stay over for the night at a guest bedroom that she has. You can see right away that Frances is more interested in just having the young mans safely out of the cold and rain then she wants to have him as a friend lover or even play-toy all for herself and as the movie progresses you see that you were right. A really amazing performance by Sandy Dennis that in a way is very much like that of Kathy Bates' Academy Award performance in the movie \"Misery\" that was made in 1990 some twenty one years later. Frances thinking that the young man was alone and homeless and, later when she meets him, mute sees the perfect person for her to have as a true friend. He's in no way her equal or better then her like the friends that she has, doctors lawyers Indian chiefs, and thus is totally dependent on her. It later turns out that the young man is not the lonely and homeless person that Frances thought that he is. It's when she slowly finds out that he really doesn't need her as well as him manipulating her instead the other way around it sets off something in Frances' mind that turns out to be a compulsion of murderous proportions. A really weird film by director Robert Altman that goes deep into the depths of loneliness and depression of the human mind. Actress Sandy Dennis is perfect as the Dr. Jekyll and Miss. Hyde personality in her acting as the lonely but at the same time dangerous Frances Austen and it's a pity that not only didn't she get an Academy Award for her role in the film but wasn't even nominated for it. Like most Robert Altman movies there seems to be a lot of improvisation among the actors in the movie and ad lib dialog especially between the young man's sister Nina, Susanne Benton, and her boyfriend Nick, David Garfield. The only thing in the movie that I found confusing is when we see Frances go to a city clinic to have a full gynecological exam and tells the doctor that she expects to get married very soon. Was her husband to be the young man staying at her apartment? But besides that the movie sticks to the story pretty well and the ending is a real shock to the audience as well as the young man. When he finally, in the end, realizes that Frances is not only a bit off-the-wall but murderously insane as well.","A sort of Altman-meets-Polanski affair focusing on the relationship between a repressed single lady and the mischievious naive hippie boy she tries to simultaneously adopt/seduce.  Ultimately, a parable about the consequences of dishonesty in romantic relationships (moral: it will destroy all parties involved), it is also an interesting 1969 period piece and a must for Altman-completists.  You'll see some of Altman's early experiments with improvised and overlapping dialogue, and an indication of his interest in using a gynecologists' office as being a window into interaction between women, later to play out a full-length picture as \"Dr. T and the Women.\"\n****possible spoilers**** Sandy Dennis portrays Frances Austen, a woman who has been aged by her environment.  As is usually the case with Dennis, her performance is outstanding.  She completely inhabits the character.  We learn that Frances lives in the former apartment of her mother, who resided there with Frances until her death, bemoaning the loss of her husband and highlighting the inadequacy of her daughter as company.   Her small social circle consists of people at least twenty years older than her - inherited friends of her mother.  Her maid is also a remnant of her mother's existence - she has stayed on to help her.  She lives a solitary life with no discernible employment or real social life.  Early in the film, while hosting a dinner party for her elderly friends she spies during a heavy downpour a young boy camped out on a bench.   On a whim, she goes outside and invites him into her home to dry off.  This invitation is eventually extended into an overnight as Frances finds herself drawn to him.  Though it isn't initially revealed, we eventually discover that the boy is not a mute, as he pretends to be.  His pretend muteness - his idea of a harmless prank - is unfortunate for both Frances and himself.  His lack of communication enables Frances to chatter incessantly and to impose an identity on him which really only exists in her mind.  We can tell that things aren't quite right with Frances and that she is more than just a lonely woman when she begins locking the boy in his room at night.  He makes a window escape to return to the run-down abode of his hippie sister and her lover who's a war veteran and it is revealed that he was originally meeting them in the park that fateful day.  The image of him as a motherless, innocent scamp alone in the world that Sandy and the audience shared up to that point is dashed for the audience.  There is also a vaguely incestual relationship between brother and sister that doesn't really play into the movie much aside from a few scenes of them romping together unbeknowst to Sandy at her apartment. Sandy discovers the next morning that his bed is empty and she seems resigned to his departure, if somewhat saddened.  He makes the decision to return - though its unclear why.  We can assume that the warm bed and lush though somewhat stale accommodations Frances offers seem a more attractive prospect than the dilapidated barracks of his sister and her lover and the over-populated home of his family.  Abandoning his former identity, he willingly accepts the identity that she's created - allowing her to dress him and feed him.  Material gain clouds his judgment.  The film loses some of its pacing here, as Altman's foreshadowing has made it pretty clear that none of this can end happily.  Though the boy likes Frances, he remains in her company for the material comforts she offers.  Frances, on the other hand, is becomingly increasingly obsessed with her imagined relationship with him and more and more dependent on having him in her life.  After a seemingly obligatory 70's \"let's get high\" scene which is perpetrated knowingly by the boy upon Frances with some herbally enhanced brownies, her offbeat manner is revealed to be something deeper and darker and much more frightening.  She randomly screams crazily then laughs hysterically and though the boy still doesn't know what's up - we clearly do.  The next day she visits the gynecologist's - telling them that she is single but soon to be married.  This trip seems to represent her last-ditch attempt to lead a \"normal\" life with the boy - the end result of these preparations - to be a traditional couple.  This scene is enjoyable because it's indicative of the style which Altman would pursue and perfect later in his career.   The acting feels improvised - a group of women discuss various birth controls and their experiences while Sandy wanders aimlessly, clearly uncomfortable hearing these women speak casually about sex, something she knows nothing about.  The overlapping dialogue and long tracking shot is also nice.  He sneaks out again that night which leads to one of the movie's most affecting scenes.  Sandy comes into his room, opening her heart to him, sharing her fears of a lonely life and describing how her elderly friends repulse her, particularly the politely amorous doctor who has had just propositioned her albeit unsuccessfully moments before.  She summons the courage to lay down on the bed beside the boy and reaches over to touch him.  Instead of stroking his hair, the head falls to the side - revealing that the boy is gone and has constructed a dummy in his place.  She screams - horror-stricken, desperate and enraged at the same time.  That night when the boy sneaks back in, he notices his dummy has been taken apart and that his bed is properly made.  Shrugging it off, he dozes off.  Of course, all is not well and his final imprisonment begins.  The movie draws to a close after Sandy has fatally stabbed a hooker she brought home for the boy.  He stands frightened trying to hide in the shadows while she tracks him down effortlessly and strokes his face, in control and out of her mind.  Though today we would be more likely to see an ending where in a crazed penultimate moment desperate Frances flings herself from the boy's escape window to her death, Altman was content to the leave the ending ambiguous.  An honest relationship has resulted, but at the cost of Frances' sanity and the boy's freedom.","What I find remarkable about this terrific film, is that Altman, the crazy and wild guy that he is, took the novel THAT COLD DAY IN THE PARK and the Sandy Dennis character was originally a male in the book. He was a mentally whacked out isolated gay who looked out of his apartment window when he spotted the hustler. It is strange that Altman fans aren't aware of how clever he was to change the sex of the main character; thereby avoiding the homo erotic taboos of gay life in the 60's and actually making Dennis' reclusive kind of madness work even better in the transposition.If you see the film again, it will be evident how wily the Altman mind works...","This is another of Robert Altman's underrated films(let's be honest, the only movie he's made that really didn't work was Ready to Wear), and Sandy Dennis gives a spellbinding performance in it.She is far better here than she was in \"The Out of Towners\". The material, I will admit, is beneath the great director Altman and the extraordinary actress Dennis, but that hardly matters anyway.As long as there allowed to do their thing and do it well, just about any story will do.","I remember that reviews of this movie were mostly negative when it came out in 1969. Critics were disturbed by the (spoiler) incestuous vibes and the sex-violence mixture. Years have passed, movies have focused on all sorts of unthinkable things, and \"That Cold Day In The Park\" no longer seems unusual. Kids from dysfunctional families do run away from home, sometmes feel lust for their siblings, and exhibit strange mannerisms. The sadness of the film is that the different ways in which the two main characters are dysfunctioning keeps them from communicating their individual needs. This is a more sympathetic study of a repressed and unstable woman than more recent garbage such as \"Fatal Attraction.\" And of course, Altman is already spicng up is film with colorful minor characters and background conversation(the conversation in the women's clinic is  very funny). Notice also how much of the film is shot through windows-making the viewer the \"voyeur?\"","Young spinster, who doesn't associate with women her own age and is eyed by gentleman from the retirement set, invites an apparently mute young man into her apartment on a rainy day. Nervous and overly-polite to hide her own sexual insecurities, she is most pleased when the boy makes himself to home in her guest bedroom...but not so happy when he begins sneaking out the window at night. Sandy Dennis is not a hapless actress, but why she was attracted to these sad-sack roles I guess we'll never know. Based on a book by Richard Miles, and about as far removed from a commercial drama as one could get, this lurid material not only attracted Dennis but also director Robert Altman (whose work is static, at best). The narrative seems almost a sex-reversal of \"The Collector\", a tag which may have sold the film-rights but which doesn't turn out to be a good idea cinematically. Even the film's best sequence (Dennis shopping for a prostitute to satisfy her prisoner) doesn't quite come off, with Sandy acting both ill and indignant (whose idea was this plan?). Michael Burns is quite good as the kid who uses this frumpy, pasty-sick woman just for her comfy digs, but he's handled too bashfully by Altman, with lots of strategically-placed towels and flesh-colored undies (Altman clearly wasn't ready for a mature picture with adult themes at this point). Sandy Dennis has a handful of very good scenes; she doesn't chatter away mindlessly here, she thinks before she speaks and she's alarmingly careful in her actions. Unfortunately, the role itself is a bummer, with an apparent slide into mental deterioration which seems to happen off-screen. As such, the abrupt finale is maddening, and the overall results tepid. *1/2 from ****","I was 19 years old when I saw first saw this film, in the theater. I have a vivid memory of a different ending. Not completely different but significantly. I just watched the movie last night and I was wrong, so I guess the following can't be called a spoiler, since it never happened. The ending I remember was that the boy was hiding in the house completely naked, Frances Austen found him quite easily and after she confronted him, she slowly sank to her knees and went down on him off camera. Only his face was in the frame and it was pretty obvious he was letting it happen, albeit against his will. But nothing like this showed up in the movie. Sandy Dennis was 32 years old when she made this movie, Michael Burns was 22. In the movie, he complains to his sister that Frances makes too big a deal about sex. Yeah? Well, then, so go to bed with her dude, and get it over with. WTF?","A rich but lonely spinster, Fraces Austen (Sandy Dennis) invites a stranger, young man (Michael Burns) to her home and lets him live with her. This movie sounds intriguing because the plot and the promotional materials suggest the subject matter of sex even more so involving an older woman, but if viewed through today's standard, this would likely confuse and could potentially garner the worst rating from its audience. And that is because this movie is totally something different. I say this pertaining to how the story was executed. More recent films tend to spoon-feed moviegoers to avoid alienating them from the story of the movie, but at the expense of losing the audience's active participation. I have realized that the movie holds up because it does not follow that trend. It offers so much more beneath the surface for the thoughtful and patient viewer. This is certainly a film that would get better upon repeated viewings. The performance of Sandy Dennis alone is a testament to that. With her almost blank facial expression, her performance adds to the emotional depth of the character. She is perfect for it. The direction of then newcomer Robert Altman (who would later direct classic films such as Nashville and M.A.S.H.) is rightfully subtle. He was able to both reveal and conceal elements for the benefit of the material.If you are looking for a movie with straight forward storytelling and a clear quick payoff to enjoy and relax to, this might exhaust and bore you to tears. But if you are interested with unconventional narratives that will make you more an active watcher and immerse you in the subject of psychology or simply in how people in the same position think and behave, this will pass as entertaining to you or even more than that. You will surely be rewarded one way or another.","Rare for me to come across a film of such quality from 60s/70s that I have never seen but this is certainly one. All the more surprising that it is an Altman film I hadn't seen but then I assume this only had a modest release and then disappeared. Easy to see why as it is a difficult film to describe and recommend to someone and pretty much in a category of its own although I do recall someone suggesting there might be a small genre of 'women going madsploitation' which I guess was to include to include Repulsion and the earlier Whatever Happened to Baby Jane. Strangely I was reminded more of the 2007 British film Hallam Foe which had something of the tone and obsessiveness. That had humour though which this has little of and what there is is very hard to laugh at. Sandy Dennis is amazing and particularly in that she has to talk to herself for most of the movie. At turns this is worrying and vaguely amusing that only makes it more worrying and even disturbing. There are some surprises but right from the beginning it is clear this is not going to end very well.","This is one of the very earliest of Robert Altman's films, in fact it was his third and it's a far cry from the large ensemble films he made later in his career, like Pret a Porter and The Player.The film centers around a rich, single woman who spots a young man sitting in the rain in the park across from her apartment and invites him in to bath and get warm. She invites him to stay, feeding him, clothing him, giving him a room and gradually building a attraction toward him. The young man remains mute throughout their interactions, except we discover that not only can he talk, he has a home and family, but while he sneaks out to see them, he returns to the house.Eventually she asks him to sleep with her one night as she lays on his bed, only to discover he has snuck out again and she goes crazy. Nailing up the windows and doors, finally making him a complete prisoner at which point he reveals he can talk. She then goes and hires a prostitute for him which makes her insanely jealous which in turn has dire consequence.The copy of the film I watched was very old and worn, which of course subtracted from the viewing experience, but the story is an intriguing one. She is such a quiet and passive character, that she barely seems predatory but just lonely and in some ways her actions do come across as good deeds. Sandy Dennis is superb in the role of this calm seemingly sane woman, who's actions become more desperate. The film however suffers because it feels stagnant during the middle part, where nothing really happens and then you have this sudden change of character which even then felt very subtle. It would be interesting to see how this story would be made today.More of my review at iheartfilms.weebly.com","\"That Cold Day In The Park\" is a dreary yet absorbing in its own quiet, slow-burning way psychological thriller. There is hardly any violence in it, but it does have a couple of shocks. Its strongest asset is the wonderful performance by Sandy Dennis; Robert Altman could hardly have found an actress better suited to this role. Having to play for much of the movie physically or verbally alone (since the other major character of the film does not talk much), she manages to be, by turns, sweet, relatable, desperate, creepy, strange, and even sexy (watch for that eyebrow-raise!). None of the other actors are really up to her level, but this film is worth watching just for her - and for a taste of early Altman. **1/2 out of 4.","Robert Altman didn't hit the big time until MASH in 1970. Most of his work prior to that was on television, though he did make a small handful of theatrical films. That Cold Day in the Park came the year before MASH. Sandy Dennis stars as a lonely socialite who spies a young man (Michael Burns) sitting on a park bench across the street. Presumably, he's homeless - he stays there even in the freezing rain. She invites him in to dry off. He seems to be a mute. The mystery behind him is intriguing, but, surprisingly quickly, it's dismissed as his secrets are revealed and are fairly banal. At first, I was disappointed. Soon, though, it becomes apparent that the audience's expectations about how this plot will develop are subverted. This film has kind of a middling reputation, but, while I wouldn't call it one of his absolute best, I don't think it should be ignored among Altman's oeuvre. His signature style may not have come until MASH - though the sequence at the women's clinic definitely is a precursor - but he would revisit similar story lines later on, most notably in Images, another of his most undervalued films. Anyone who's a fan of Sandy Dennis ought to check it out. She's fantastic in it. Olive Films has given That Cold Day in the Park a long overdue DVD/Blu Ray release (it's not the best looking Blu Ray I've ever seen, but it's more than acceptable). If you don't want to spend the money, there's also a decent-looking VHS rip on Youtube.","I was really expecting more from this.It's incredibly and annoyingly slow, as opposed to interesting and sensitively so.It's very dumb. A woman invites a boy she sees sitting in the rain, in a park, into her home and for days he pretends to be mute and she accepts it and him, without even trying to make any other form of communication. There's zero humor. I know it's meant to be a thriller, but the odd light moment would really have helped. The performances are wooden. The direction clumsy.In many ways this is more like a play (a bad play). Very little location. Very little movement. So don't expect to see much of Vancouver circa 1968.No one says anything even vaguely interesting and the final 'twist' if that's what you call it, is so predictable that it's almost a surprise.I did like the sweet Johnny Mandel theme that played during the early scenes, very much. Otherwise I can think of nothing else to recommend it."],"review-user":["Infofreak","verna55","evanston_dad","Freak-30","gavin6942","sunznc","Ddey65","pmicocci","sol1218","l-dziuban","MOSSBIE","Auteur-2","tanysare","moonspinner55","waltcosmos","BuddyBoy60","christopher-underwood","ihrtfilms","gridoon2018","zetes","Shilpot7"],"review-date":["12 July 2004","16 September 2000","16 October 2013","30 August 1999","7 July 2014","23 February 2009","15 December 1998","30 September 2015","21 October 2004","22 August 2003","1 April 2006","26 September 1999","24 April 2002","28 August 2008","1 July 2006","14 October 2017","25 April 2017","12 December 2010","1 November 2014","10 March 2013","23 October 2010"],"review-rating":["7","10","7","6","8","9","6","9","3","7","7","8","4","6","8","2"],"review-title":[" An extremely underrated psycho-thriller directed by a pre-fame Robert Altman.\n"," Desperate for companionship, a lonely spinster invites a strange young boy up to her apartment.\n"," A Spinster in Vancouver\n"," Patience Pays\n"," Altman's First Great Film\n"," Fascinating, unforgettable\n"," A word to the wise.\n"," Overlooked...\n"," Suppressed emotions explode on screen in this early Robert Altman Classic\n"," Altman-meets-Polanski...spoilers....\n"," A never mentioned fact\n"," Sandy Dennis gives a spellbinding performance.\n"," Better With Age\n"," Frigid...\n"," Was there an alternate version or is it just me?\n"," A Movie that will Reward the Active Moviegoer\n"," it is clear this is not going to end very well.\n"," Beware the spinster!\n"," Acting tour-de-force by Sandy Dennis\n"," Undervalued early Altman now out on DVD/Blu Ray\n"," Better Forgotten\n"]}