{"review-url":["http://www.imdb.com/title/tt0085426/reviews"],"review-text":["Not exactly. This is a most unusual film. Shot in widescreen and black and white, with Dolby stereo and only one whispered bit of dialogue. The world is in ruins, and our main character (credited as \"The Man\"), makes his escape from a band of looters by stealing their prized possession, a fully charged automobile battery, and uses it to power his ultra-light plane out of the ruins of the city.In his travels, he comes across a doctor, with whom he communicates non-verbally (apparently, the atmosphere is so polluted, the human race is rendered mute), and confronts another man, a clumsy, self-styled \"barbarian of the wastelands\" who wields a sword as if it were a broom.One of Luc Besson's early works, it is as original as it is imaginative. I had the fortune of seeing it on a wide motion picture screen in New York City. I still haven't forgotten it. Yes, I know that the end of the world makes for a strange concept for an art film from France, but Besson makes this unlikely premise work to perfection.Highly recommended.","I thought Besson's film managed to do without words what few films have been able to do with them; Capture true human emotions. The main character's struggles, triumphs, set backs, hopes and desires are all so honestly shown that you wonder if he is acting at all. The film has a low budget and is obviously made without the glitz and glamour afforded to most Hollywood productions but that minimalism is what allows this film to transcend the stereotypical Sci-Fi labeling and become a true drama. However calling this film solely a drama would take away from the fantastic post-apocalyptic plot. True this type of movie has been done been before but I think this one captures the joys and sorrows of that type of world possibly better than any other one does.","Great movie. Post-apocalyptic films kick ass. This one is no exception. Kept up the pace and interest without a speck of dialogue (mainly through some good character development). The fight between Reno and the Hero was tight. I also liked the use of cave paintings and medieval-like weapons to show how primitive and savage mankind had become without their technology and guzzaline. The connection between the beginning and end was a little spacey, that is, I had a hard time understanding the distances between the hotel and the opening sequence. In sum, kick ass character progression, design, story without the cushion of dialogue, and most importantly, the always appreciated desolate scenery of a post-apocalyptic wasteland.","This film was shot a few years after the Mad Max and in some way it does seem similar. However, it is a very innovative and refreshing film. \"Le Dernier Combat\" has no dialogues, but it does have sound. It was also shot in black and white and the total budget was $500,000! It is very refreshing to see a good story well told, on a shoe string budget. This was Eric Serra's first film score, Luc Besson's first feature, but everything came together thanks to Luc Besson's genius and creativity. Excellent acting on everyone's part (especially Jean Boise, Jean Reno and Pierre Jolivet) helped a great deal. It seems that French actors just can't do a bad job... The film is about a loner in the middle of nowhere who somehow befriends another loner in that weird post apocalyptic world. Their interaction (even if non verbal), as well as the drama around them kept me glued to the screen. The occasional funny moments were great and contrasted well with the dark story. I consider this to be Bessons second best film (after Nikita). One can only wish that all the low budget independent films turn out to be this good.","It's hard to use words for this movie, since it contains none itself.But the images it conveys, both powerful and sweeping, are ones which remind us why we watch movies. And you might be saying \"Well, Leonard Maltin doesn't like it, it can't be that good..\" But you're wrong. See this movie. French cinematic brilliance en ensemble.","I still can't describe what to feel when I received this by the fnac site. Such a rare movie, so little spoken and known, is difficult to find, even to fans, but the contrast betwen past and present is devastating: now I hold a DVD of the movie, with the finest quality possible. As I did in Atlantis, the other rare Besson movie I bought by the internet, I saw this one at home, with all the lights of my dvd and tv turned off, and marveled at the experience. I didn't know what to expect. Wickedly, I always searched some kind of disappointment when I saw a film by Luc Besson I never had seen before. But it never came. This movie was no exception. From the start, I understood that the person who makes a film like this as a first feature is destined to be big in the future. And so it happened. This won several prizes (including the highest prize in a film festival of my country, which makes me proud) and it shows that this movie is preparating many bigger things. This may be the most original after-the-war movie I have ever seen, beating Mad Max in originality and artistic feel. There is not a problem with this movie: its cinematography is genius, as well the perfomances of the actors. I am also proud to say that finally I saw all the movies of my favorite director, and have a copy of almost all of them (Joan of Arc is still waiting for me to buy the DVD). This movie is most of all a work of style and dedication, which makes clear why Luc Besson is a director of my choice: good taste, beautiful framing, excellent use of music (I also marveled at Eric Serra's first feature-length score) and the promise of great achievements. Gaumont did well to bet in its boy-genius, the man who would later change the face of France's and Europe's relation between movies and their public. Let's hope Besson starts working in a new directorial project. I will be the first to cheer it. Until then, I recommend this movie to anyone who need to learn a lesson of how good movies are made with little money. I loved the atmosphere of the movie, which, by its black and white cinematography, suggests us an even more depressed view of the world after the holocaust. This movie works by the sheer magic of movies: showing in pictures what we can't explain by words. And I'm with all the people who wrote comments to this movie and liked it: good choice! A great hug to everyone who sees this and feels that a little of their lives were changed.","Le Dernier Combat is an interesting and memorable take on the familiar postapocalyptic scenario, and its primary conceit -- its near-total lack of dialogue -- is effective, but ultimately it's a stylish but overly familiar \"lone hero of the apocalypse\" story without much to add to our understanding of human nature.The absence of dialogue in the film, while interesting, is not quite original -- it was done 20 years earlier in the Twilight Zone episode \"Two\" (starring Charles Bronson and Elizabeth Montgomery), which like this film took place in postapocalyptic wasteland; and that story, compressed as it was into a half-hour episode, carried an emotional heft largely lacking in Luc Besson's take.The problem with this film, as with most of Besson's work, is its essential shallowness; while Le Dernier Combat is undeniably a visually appealing work which showcases Besson's ample talents as a maker of stylish, humorous and thrilling action films (Le Femme Nikita, Leon), and while it does feature some genuinely touching and quirky moments, Besson's ability to plumb the depths of human nature falls far short of what a story of this kind demands.\nThe other major problem with this film, for a contemporary audience, is the music. Le Dernier Combat is saddled with a laughably inappropriate early 80's jazz-disco score that practically drains any dramatic impact from scenes in which it appears. Jaunty dance music isn't quite what one expects in a scene of tragic human suffering. Even Tangerine Dream would be preferable to Eric Serra's work on this film.Le Dernier Combat is a film worth seeing, if only so that Luc Besson fans can get an early glimpse of the Besson style in its infancy, and there is no denying the appeal of its performances and the impressive fact of how visually dynamic the film is given its rock-bottom budget. But science fiction fans expecting a powerful human drama should lower their expectations.","no way it would get greenlighted in hollywood today oh my gosh a movie that doesn't use it's dialogue to explain the plot?? great story everyone has lost their ability to speak. the hero is a man trying to survive in post war europe. he escapes a gang in a homemade plane and finds a doctor hiding a \"secret\" then he helps him fight off a \"brute\" played well by jean reno. the movie even has raining fish. how could you not like that ?  this movie gives us a peek at luc besson's talent.  before la femme nikita, and leon watch this with an open mind I would like to see someone pitch this idea to hollywood and see what would happen today","I am a long time fan of Luc Besson's work, and for about as long as I've known his name, I've also looked for this movie. I tried looking for this movie all over California for over four years. this past summer i took a trip to Europe, one of my missions on this trip was to at least see this movie. long story short, I bought it and watched it in France! I was blown away, it completely made my trip and i finally feel content that i have seen Luc Besson's first work. absolutely amazing character development, very thought provoking, great acting and the ultimate concept movie. if you are a concept movie fan this is one of the most original and classic. I feel as though it is a rare treat to see a movie like this one, its risky, its unorthodox, and ultimately its just downright unique. if you are a Luc Besson fan, its indeed a must see, however, whether your a Besson fan or not, its definitely an important work, overall a great contribution to the immortal art of cinema.","Shot entirely in black and white and set in a barely inhabited post- apocalyptic world where the atmosphere has rendered humanity mute, Luc Besson's feature length début was nothing short of ambitious. The plot ostensibly follows The Man as he scavenges for parts to keep his light aircraft in repair - venturing out into the wasteland he stumbles across a hospital where he meets The Doctor, a man living in fear of The Brute (played by Jean Reno) who is attempting to gain entry to the hospital and kill the Doctor. Through non-verbal communication, The Man and The Doctor come to help each other in an attempt to survive and keep The Brute at bay. Despite the innovative premise and stark, stylish beauty of Besson's direction, the film moves at an odd pace whereby it's more confusion and intrigue that keeps the viewer watching, rather than for any substance of character or story. The daring decision to have next to no intelligible dialogue throughout doesn't help matters, as the viewer is left to piece together the characters motives without explanation, but it's the score (the epitome of awful 80's synth soundtracks) more than anything else that dates the film and hindered this viewers enjoyment. While still worth checking out for any fans of Besson, the post-apocalyptic genre and cinema in general, it's not the easiest of films to watch, but one that rewards the viewer in spades through Besson's fantastic direction.","Luc Besson's first work is also his first foray in science fiction, a genre to which he will return fourteen years later with \"the Fifth Element\" (1997). Even if this film was strongly influenced by Hollywood cinema, it is still highly enjoyable. Back in 1983, \"le Dernier Combat\" reveals Besson's own approach of science fiction. He takes back a threadbare topic and his efforts are discernible to make a stylish work. Shot in widescreen and black and white, a disaster has destroyed virtually all the population from earth and we will never know what was this disaster and why men can't talk any more. Some barbarian hordes were formed. In parallel, a man (Pierre Jolivet) lives on his own and arrives in an unrecognizable Paris where he is received by a doctor (Jean Bouise).There are no words in Besson's work. The characters' actions and the progression of the events go through looks and gestures. Although the starting point and the backdrop are unnerving, the film has never the look of a despondent one. It seems that the man and the doctor try to reproduce gestures and actions linked to mankind before the disaster. The film opens with the man having sex with an inflatable doll. Later, the doctor tries to make him speak through a machine and he is a painter in his spare time. It's all the more intriguing as these paintings seem to come from the prehistoric times. Following this reasoning, one could argue that the bearded giant (Jean Reno) embodies evil and a threat to the efforts deployed by the man and the doctor to regain what finally made a human being. Ditto for the gang of baddies at the beginning of the film.The pessimistic whiff that such a film could convey isn't really at the fore and gives way to a glimmer of hope. Personally, the film could have gained with no music at all, except the one the man can hear with his cassette recorder. Luc Besson was to make better and still entrancing films like this one, he also boosted Pierre Jolivet's career as a director who will leave a patchy work behind him in the future: \"Force Majeure\" (1989), \"Simple Mortel\" (1991), \"ma Petite Entreprise\" (1999) or \"Filles Uniques\" (2003).","This is an example of what film school lecturers would call a good debut movie. It follows all the rules. Short scenes, to the point, cheap to shoot, guerilla-film-making, no sets (just disused buildings) and possibly an empty hospital wing. Also, even the black&white film-stock was a stroke of genius, probably selected more for its low expense rather than film effect, but it worked.Reno was amazing as the Brute. Everyone's acting was brilliant. The plot was simple and effective and no flabby bits left to distract you. A tight, well-crafted, cost-effective budget movie.Released in 1983, this would've been made just before the art of big-budget action spectaculars became refined by the Hollywood movie-making engine, and movie-making was more exclusive and therefore more difficult and more in need of the right people in the right places than today's internet-enabled world, so Luc Besson would've had to do quite a bit of negotiating and promise-keeping to achieve this result, which makes the end-product all the more remarkable.But, then again, the French movie-industry has always maintained an excellent reputation (yes, I know Luc Besson is Belgian, but the movie is a French production) and has been the source of many Hollywood remakes.If I have one criticism, it's that the cover-picture on the DVD (and possibly the original sales poster) bears no resemblance to the movie whatsoever and appears to be a rather bizarre image rather than representative of any of the movie's themes - at first glance, it appears to be a man in post-apocalyptic armour on a swing, but on second inspection reveals a man in armour with a lance on an office chair with his legs on a desk in a reclined, self-confident posture. This never happens in the movie once.It's black-and-white film-stock, zero dialogue, physical acting, tight scenes and brilliant actors makes this movie one worth adding to your private movie collection. A superb movie.","A poetic examination of the human condition performed without dialogue. The anti-hero, The Man builds a contraption to escape a band of marauders, out of the wastland of what was once a civilization, to the ruins of the city to scavenge for his survival. There he crosses pathes with The Brute, brilliantly played by Jean Reno, of \"The Professional\" and \"Mission: Impossible\" fame. The Man is rescued by a crazy old genius who lives in a fortress of his own design. By using their wits, The Man and the old genius are able to keep the Brute and his ilk at bay, but they realise it is only a matter of time before their defenses are compromised, so they make a break for it. This is a strongly understated tale of the desparate struggle for life, with excellent action scenes and clever humor. Of all of the movies of its kind, like \"Road Warrior\", \"Omega Man\", and even \"Ultimate Warrior\" (featuring Yul Brenner as a buff knife-fighter), \"Le Dernier Combat\" is the most artfully crafted. Copies of the video are hard-to-find, I would give my left eye ball for one. If your local art house ever has a revival of this film, I heartily recommend that you break any engagement to able to be able to see it big.","I am not an expert on film and saw this only by accident on TV years ago. Without knowing the title or director I have been trying to find out what it was ever since. I have just stumbled across it in my local video rental shop and it is just as I remembered. To me a film does not have to be completely original ( mad max, lack of dialogue ) or super fast, have everything explained or even add to 'our understanding of human nature' to be enjoyed. My advice is to sit back, relax and watch this to the end.","Shot in black and white, this Luc Besson's early film is quite artful. Here we have an interesting flick with a post-apocalyptic setting which centers around the primeival struggle for survival.  A unique thing about it is a deliberate deprivation of any dialogue what's so ever.  Besson turns this aspect into the film's advantage, thanks to his own skills and the talents of the cast.  I still wouldn't call it mindblowing, but it's definitely a well done movie that's worth seeing.","Well, I guess I was in the mood for a movie that really grabbed me from the beginning.  This movie wasn't it.  It plodded along at a pretty slow, deliberate pace for the first 40 minutes, but there wasn't really anything in it that I was terribly interested in--there's an intriguing and mysterious feud between Jean Reno's character and an old man, but more of the first 40 minutes is dominated by the wanderings of the main character, whom I didn't know much about and couldn't really relate to at the time.  He wanders around alone for the most part, he doesn't meet anyone; I imagine the director was trying to depict the loneliness of the human condition in this post-apocalyptic world or something, which is all good, but I still wish he'd trimmed it down from 40 minutes to 15, because it can get incredibly boring.But after those 40 minutes, things start to get very interesting.  I guess I won't really say more than that because I don't want to spoil anything.  So if you've seen the first 15-30 minutes of this movie and are thinking about turning it off (like I was), just stick with it--it gets a lot better.One of the most interesting things I found about this movie was the fact that it had no dialogue whatsoever, which really made me have to think about what was happening, how characters were feeling and what their motivations were, why things were how they were in this post-apocalyptic world, all of which gives the story a lot of room for audience interpretation.  And it's amazing how much more satisfying a movie is when the actors aren't telling you exactly what's going on.","With his first attempt Besson knocks it out of the park! Le Dernier Combat is an odd friendship tale and love story told with no words set in a post apocalyptic world that looks like no other. We are carried through this miserable landscape with unparalleled lightness and ease. It looks attractive enough for us to want to live there, albeit deserted and rundown. Besson inserts it with interesting new stuff for the main character to use - a self made plane, cassette player and a blow up doll. In fact every film in the genre introduces something new to the post apocalyptic world that is used in following movies. However Besson got his artistic touch all over this one. Fast, pacey episodes are followed by slow almost poetic moments of observation. It is breathtaking and visually stunning.It is really hard to tell the humanity in characters that can't speak and only moo and make gestures. But Besson makes them draw wall paintings and eat on table-cloths using forks and knives. The Doctor and The Man really grow on each other and in the end The Doctor reveals his biggest secret. Buildig up of characters without using dialog is quite challenging and masterfully done.A genius is born!","Le Dernier Combat/The Last Battle (1983) is a film that fits perfectly into the post Blade Runner/post Mad Max subgenre of the post-apocalyptic art drama. Other examples of this style of film-making can be found in Sogo Ishii's Burst City (1982), Lars von Trier's The Element of Crime (1984) and Shinya Tsukamoto's Tetsuo: The Iron Man (1988).As with those particular films, The Last Battle is notable for its visual design and emphasis on style over narrative; with director Luc Besson creating a dark, dank and depressing world of decay and dilapidation. The visual iconography is filled with rich, if somewhat slightly superficial detail; including distressed buildings, burnt out cars and gangs of feral warriors stalking the shadows. This is combined with a plot that attempts to encapsulate the metaphorical struggle of every day existence, with plenty of room left over for Besson to create a lingering sense of atmosphere and some inventive visual set-pieces. The film would be one of the first to introduce the concept of \"cinema-du-look\"; a brief cinematic resurgence in French cinema that saw a younger generation of filmmakers looking back to the days of the Nouvelle Vague and combining that sense of playful experimentation with elements of early 80's pop culture. Besson would come to define this movement with his second feature, the chic and silly crime thriller Subway (1985), by creating an archetypical cinema-du-look experience to stand alongside Diva (1981) by Jean Jacques Beineix and Mauvais Sang (1986) by Leos Carax.In keeping with the high-style/high-concept approach, The Last Battle is notable for its overall cinematic design. Firstly, the film is almost wordless, with no real dialog interaction, only sounds and a smattering of very 80's synth music care of Besson's regular musical collaborator Eric Serra. Secondly, the film is shot in black and white cinemascope, with much juxtaposition between the expressionistic use of light and shadow with the almost cinema-vérité like use of actual, physical production design and, occasionally, hand-held cinematography. It gives us a slight hint of the direction that Besson would follow with later films, such as his trio of 90's masterworks, La Femme Nikita (1990), Léon/The Professional (1994) and The Fifth Element (1997); but really, this could still be seen something of an anomaly within his vast body of work.The basic plot of the film can be explained in a single line, with the story exploring the devastation of civilization and issues of brutality, hostility and isolation. Here, French pop singer Pierre Jolivet stars as the main character (identified cryptically as \"The Man\", again, emphasising the anti-plot/anti-narrative approach of the film) who is menaced by \"The Brute\" (played by Besson regular Jean Reno) on his journey through a world filled with people rendered mute by an unknown incident. It is the titular battle of both cunning and wits between Jolivet and Reno that becomes the backbone of the film, with the two characters testing each other, both mentally and physically, in a series of prolonged visual set-pieces. Alongside these scenes we get some surreal moments and elements of broad humour that owes a small debt to the silent comedy of Chaplin and Keaton and a lot of exploration of the visual geography of the world that Besson creates, quite spectacularly, on an incredibly limited budget. Ultimately the film points towards the futility of conflict in an era when people should be banding together in order to fight the bigger issues, but this is all perhaps secondary to the world that is created and the incredibly visual way in which Besson chooses to interpret it. Obviously having no dialog and only a few minutes worth of dated electronic music, combined with the vague characterisations and emphasis on style over content, The Last Battle certainly won't be a film for everyone. Even if you're already familiar with Besson's trio of 90's classics, or even lesser known cult films such as The Big Blue (1988) and Angel-A (2005), the look and feel of The Last Battle might still be something of a shock to the system.The film at times feels like an action film, but really, when we think about it, there isn't all that much depicted in the way of conventional action. Likewise, the film could be approached as something of an art film, but again, it seems almost too shallow or too playful to appeal to that particular crowd. So who will this film appeal to? I guess the target audience is anyone with an open mind and a real love for all forms of cinema, regardless of genre or convention. Besson fans too might appreciate seeing his first feature film, which really strays from the sun-kissed cool of Subway and The Big Blue, or the ultra-chic violence of Nikita and Leon. It isn't something that I would call a classic, but for me, personally, the film has a lot to recommend; chiefly that great sense of style and the use of black and white, widescreen cinematography; which really makes it stand out. Likewise, the performances from the two leads, Jolivet and Reno, as well as Jean Bouise as an aging doctor who looks after Jolivet's nameless drifter, are all commendable, drawing on subtlety and a strong sense of physicality to compensate for the lack of dialog and plot.The Last Battle may not be a masterpiece and may very well prove to be something that alienates many potential viewers; however, having said that, one really has to admire Besson's scope and vision, especially at this early stage in his career. Thematic similarities noted by other critics to films such as Claude Feraldo's Themroc (1973) as well as the aforementioned Mad Max 2: The Road Warrior (1982) are constant, as is the vague feeling of nostalgia when you consider how much subsequent music videos and TV commercials have borrowed from this particular style. So, a real cult film for anyone with a keen appreciation for underground art-cinema, post-apocalyptic sci-fi or the work of Luc Besson.","If you expect that this movie is full of action and grabbing you from the start then don't watch it. But if you like those kind of meditative movies which stick in your mind for a while, until you get the details, then you will love it. Now don't get me wrong there is action and there are things going on just not in the usual way. Basically the plot is in a post-apocalyptic world where anyone fights in his (or their) way for survival. In this fight they lost the ability to speak... I don't want to write more to not spoil the movie for you, but trust me if you like SF-authors like Lem or Capec or even some from Orson Scott Card you will love this movie.","I am glad that Luc Besson moved on from this Cannes film festival fodder and into more entertaining movies. Although it does take a fair amount of gall to direct a post-apocalyptic film in black and white with absolutely no dialogue, it seemed obvious to me that it was geared for the Film Festival set; things happen incredibly slowly, and there is no explanation for many elements of the film (people can't talk, fish rain from the sky, etc.), but how could there be as there is no dialogue? If you absolutely must see everything Luc Besson has directed, then by all means, see this movie. But if you are looking for a well-made Besson, then search somewhere else. Luc Besson has directed such classics as Nikita, Leon, Subway, and Le Grand Bleu, all of which are infinitely more entertaining and watchable than this post-modernistic French cinema which was likely praised at the time of its release as the future of film. Fortunately, it wasn't, and Besson went on to bigger and better things.","Remember that this came out before Gulf War I, which gave us Werner Herzog's \"Lessons of Darkness\".Le Dernier Combat is not \"Sci Fi\". It's more like Judgment. I've watched it at least a dozen times. It really is a fitting companion to Herzog's \"Lessons of Darkness\": \"And in that time, men will seek death, but they will not find it, for death will flee from them.\"That someday, alas, may be today, in Iraq. But, back to Le Dernier Combat, make sure to watch thru the very last second of the film. I wouldn't call it a \"surprise ending\", but it is something you'll miss if you just assume the end won't be anything more than what you will already have seen.","Interesting as the early work of future \"Leon\" director Luc Besson, this science fiction fantasy also marks the director's earliest teaming with Jean Reno. Great production design and interesting visual(inspiring considering the budget) make this a must see for sci-fi fans. A little difficult to find in the states. Hopefully it will be re-released on  video,DVD or laser","I don't believe it... Luc Besson is not only a genius now...he has always been one... this film is for everyone who likes real good deep films...just perfect!","Belonging to the subgenre of post-apocalyptic future films, it is a stylistic and very very intimate installment. The most noticed element of the film is its silence; no one speaks. I don't think Besson, despite what is evident in most of his later work, meant it as any kind of cool gimmick. I think what makes it so clever and so effective is the fact that with no other way of communicating, everyone has to read each other based on intuition and conveying of emotion, no matter how slight. Though I wasn't glued to the screen, upon reflection I see that it's a very touching and sensitive perspective on human nature. Its vehicle is the stylized sci-fi movie. Part of its reflection on the nature of the human world is that each of its humans is not necessarily played as a perfect human being: The hero, a lone drifter in the desolate new world, is taken in by an older recluse, who refuses to keep his part of an exchange of food between him and a husky, brutish character played by Jean Reno, and so Reno tries everything he can, predominantly using brute force, to get what he wants. So, the antagonist is right, though not a good person, and the protagonist and his sympathetic foil are both wrong, though they are both good people.It's shot in a clear and crisp black and white, edited and captured in a low-key yet spry and small-scale approach, and its actors are very real. How can they not be? They, like their characters are left with the bare necessities of communication. This is one of the few truly good films that Luc Besson has written. His earlier work is almost always better than the fluff he churns out now.","If there's one thing the history of cinema has repeatedly pressed upon us, whether consciously or not, it is that physical beauty is superior. From an evolutionary standpoint, this makes perfect sense as it's how we're programmed. We are made to want the best genes for our children in order to ensure that the species continues as fit and healthy as possible, and physical appearance is the most immediate indicator of genetics.We see this again in Luc Bessons 'Le Dernier Combat' (The Last Battle). Pierre Jolivet is our nameless hero, identified in the credits as 'The Man'. Our storyline is a Hollywood standard. Our hero meets up with the nameless antagonist (identified in the credits as 'The Brute') played by Jean Reno, more on him in a moment. Our hero loses the battle, sustaining injuries but managing to escape. He stumbles upon a third nameless character (identified in the credits as 'The Doctor'), and the pair strike up an unlikely friendship while our hero is nursed back to health. Friend of the hero, who is intelligent and sophisticated but genetically inferior, is killed, leaving our hero to face the final showdown, which he naturally wins, leaving him to rule over all while getting the girl. As a French film rather than Hollywood, it's not always quite as simple as this, there are many subtleties and allegories, and all the characters have a kind of comic existentialism.Our hero Jolivet is lithe and toned, with deep, dark searching eyes. In his pursuit of the woman he is refined, presenting a neatly-wrapped gift, combing his hair. Our villain Reno, by contrast, is shown at one stage in his underpants, hairy chest with his belly hanging over. He wears glasses, an indicator of his genetic inferiority, and to further force home the impression he is given facial scarring.Our third character Bouise is the intelligent sophisticate. Painting, cooking, enjoying fine wine, repelling Reno with the wry humour of his multiple defensive barriers. He is older, weaker. He has glasses and funny teeth, but is apparently aware of his inferior position and doesn't attempt to impose himself on the woman. His role is the facilitator for our hero. When he removes our hero's blindfold, indicating he can now visit the woman without restriction, our facilitator is symbolically sacrificing himself for the hero, which is made literal a few moments later when he is killed by falling debris on the way.As a Hollywood film, this wouldn't have been anything special. But it's French, so we instead have many delights in store. Reno's character is not given the Hollywood villain treatment, despite his apparently psychopathic single-minded desire to destroy everyone in sight. The roles are instead enforced in more comedic ways; Jolivet takes a double hob to attach to his gas canister, but when Reno repels him and is sitting at his symbolic throne, not only does the gas run out, but the tape recorder which has worked perfectly up until now suddenly decides to break down, not by running out of batteries but by inexplicably chewing up the cassette. Reno is such a wonderful and likable actor that we are never entirely against him. Similarly, our hero is never entirely heroic; in the film's first scene we are shown him having sex with a blow-up doll, only to be foiled in his designs by a deflation.Another thing Hollywood would and could never have done is to make an entire film containing only one word of dialogue, a broken \"bon.... jour\" which is spoken by Bouise and Jolivet to each other. We are dropped into a post-apocalyptic world where nothing is explained (which is as it should be, I feel), least of all why people are now incapable of speech, except in that one moment under the influence of some inhalation. Bouise is the symbol of the old world, civilisation, empathy, artistry. Our hero is shocked to hear speech, but desperately wants to join; the jubilation when he is finally able to is quite touching. In his spare time, our hero appears to enjoy listening to music and looking at paintings, compared to Reno's pursuit of practicing smashing bottles with a sword. While our hero dines on cooked fillets, Reno is seen stuffing raw fish into a bubble gum dispenser. The aforementioned scene of gas and tape recorder failure can be viewed as Reno's attempt to join that civilised world, but his brute ignorance leads to inevitable failure; he cannot be what he isn't. He is the barbarian trying to assume the role of King.The remaining world is one of shattered buildings and improvised weaponry, apparently engulfed by a vast desert. Our hero is seen early on with a lance with a knife tied to the end of it, and some padded 'armour'. Reno has similar padded protection and wanders around with a sword. Even Bouise comes out to attack Reno at the gate wielding an improvised crossbow. All this medieval weaponry lends itself neatly to Bouise painting our hero in the guise of a knight on the wall. Later, Bouise adds the female figure; is this to suggest the chivalric approach he would like our hero to take with the woman? If so, the wrapped gift suggests that it has worked, leading to Bouise's approval with the blindfold removal. In the end he doesn't get the girl, as Reno has gotten to her first, and apparently killed her in his insane villainy.We are then given a final scene of our hero flying back to his original location. Here he kills the leader and assumes command, dressed no longer as the noble knight, but now in the clothes reflecting the position he will take here... the white suit of a gangster. But he's still our noble hero because he immediately frees the bizarre gimp-like water slave, and is rewarded by being lead to a woman. They both smile, and we have our happy ending."],"review-user":["Baroque","xsfanning","pengrubb","Nobody-27","Krysalis","Dockelektro","bbyun","roky-erickson","uktena92","Yaaatoob","dbdumonteil","qljsystems","mr. dug","markjephson","grob248","Foopy-2","tataf","ThreeSadTigers","sscodeller","Rooster99","bradmcc","tag-7","mirko-3","jzappa","rawkmonster"],"review-date":["9 December 2002","20 August 2005","31 August 2005","31 July 2000","18 May 1999","26 June 2001","2 January 2003","30 July 2002","3 September 2009","6 January 2011","11 February 2007","27 September 2008","25 September 1998","4 January 2004","28 July 2000","6 November 2002","25 February 2011","15 February 2008","5 August 2007","19 February 2007","12 March 2006","15 November 1999","4 October 1998","25 November 2006","6 July 2015"],"review-rating":["8","10","10","8","10","6","7","10","10","7","10","10","5","10","10","8","8"],"review-title":[" A French \"Mad Max\"?\n"," Fantastic film!\n"," Kicks ass\n"," My favorite Besson film\n"," The post-apocalypse has never been so beautiful..\n"," The embryo of a genius\n"," Entertaining But Dated\n"," great post-apocalypse story\n"," Discovering The Ultimate Concept Flick\n"," A flawed, but innovative take on the post-apocalypse.\n"," Luc Besson's debut film\n"," Brilliant debut movie\n"," The finest end-of-the-world film yet made.\n"," Loved this\n"," Final Combat\n"," Awesome! Except for the first 40 minutes...\n"," \"Cherchez la femme\" Besson style\n"," A wordless, visually expressive, post-apocalyptic art-drama.\n"," Just the type of SF I love\n"," Every director has to start somewhere....\n"," Powerful (and also witty) film\n"," Artfully directed sci-fi fable\n"," Incredible!!!\n"," When Besson Was Still Making An Effort\n"," The superiority of physical beauty\n"]}