{"review-url":["http://www.imdb.com/title/tt0067439/reviews"],"review-text":["Mon Oncle Antoine (1971)Despite having a heavy film industry presence (usually American productions looking for cheap locations), Canada's own gems have often gone by the wayside. We're too close to America to really for it to care enough about a film not about its own country, and too far from overseas to have the exotic flare found in European or Asian cinema. Perhaps that is why the film considered Canada's best goes so widely underseen and overlooked. Claude Jutra's classic Mon Oncle Antoine truly is one of the best Canadian films ever made. It's also one of my favourite films, period. It is now out in a lovely 2 disc package from the folks at Criterion. Set in an early 1940s Quebec asbestos mining town, it's a coming of age story over the course of a few days at Christmas time. Adolescent Benoit lives with his uncle, Antoine, his aunt, and a teenage girl, Carmen, who the family houses and employs at their store. Antoine not only owns the local general store, but is the local undertaker as well, among other things. The film floats around, with no real plot-wise direction. Events happen in a relaxed and patient fashion, not to highlight story, but to highlight the emotional development of Benoit as he transforms from a free spirited adolescent into adulthood. He experiences the sexual passions, the harsh indifferences and the cynicism of leaving childhood behind. Jutra balances light hearted humour and charm with dark pathos and sadness with a deft hand. There are playful moments between Antoine and Carmen, and comedy with the sneaky Fernand (played by Jutra himself), who runs the store for Antoine when he's not chasing the uncle's wife. There is also a moment of great triumph when Benoit and another boy throw snowballs at the mine owner as he makes his way through town giving out small gift bags for Christmas rather than raises or bonuses to the men as the soundtrack blares a score fit for a spaghetti western. On the darker side, there is a separate story where a family's father leaves the mines and heads to the logging camps. While he is away, his eldest son takes ill, and dies on Christmas Eve. Antoine is phoned to come pick up the boy's body, and Benoit insists he go along. The long sleigh ride through a snow storm offers him opportunities for mischief, but in the end leaves him with sad realizations about the nature of adulthood and those around him. Mon Oncle Antoine is certainly about the loss of innocence, but it is also more than just a story about a boy in rural Quebec. It is a parable about the coming of age of the province itself. Most of the mines were owned by either Americans or English speaking Canadians, as referenced by the film when the mine foreman speaks in English to his French workers who do not understand. The time period is the Maurice Duplessis era - he was the premier of Quebec with his Union Nationale. His party was deeply conservative, pro-business, rabidly anti-socialist (in any form), and formed deep rooted connections with the traditional Catholic clergy. He was also deeply corrupt, and reportedly a master of ballot stuffing. It's also just prior to the Asbestos Mine strikes and the Quiet Revolution. The miners voted to strike, which was deemed illegal by Duplessis, who continued to pledge unwavering support for the mine owners,. He also authorized the use of strike breakers which lead to incidents of violence. However, the miners had the widespread support of the public and the French media, and even most priests and the province's archbishop. This marked a major turning point in Quebec culture, as well as the shift to the social left in a large part of Canadian Catholicism. Separatist ideology increased dramatically.History lessons aside, the physical construction of the film, meant to evoke life in the harsh mining towns in the Asbestos region, must be recognized. The small town, shadowed by the mine hills, literally exudes its cold surroundings, yet still manages to fill its homes with undeniable warmth thanks to its characters. Jutra also uses practical, naturalistic lighting rather than normal crisp studio lighting. The sounds and senses of Canadian winters are placed front and centre by Jutra. This is how these towns are supposed to look and feel during winter. The feel of the film is not limited to Quebec culture. New Brunswick and Nova Scotia not only have massive French populations and culture, but the same woods, the same houses, the same towns. I know the feel of small harsh industrial towns - I grew up in one in Nova Scotia. They are not at all unlike the one in Mon Oncle Antoine. Most of them still look just like they did 50 years ago (if not worse). Perhaps that is one of the reasons why I love this film so much. It's the sensation of familiarity found in Eastern Canadian life and culture (which has its own very large French/Acadien population and culture.But alas, I am rambling, and fear that I could go on and on. Mon Oncle Antoine is one of the great hidden gems of the cinema. Its performances are earnest; the photography is evocative and beautiful in that cold, bleak sort of way; its direction is assured and inspired. It is a masterful portrait of childhood's twilight, and a sad but hopeful realization of the loss of innocence - a parable for the whole of Quebec.","This film has consistently been voted as the greatest Canadian film ever made in various critics polls over the years. Revered New Yorker film critic Pauline Kael hailed it as a small masterpiece upon original release but it is the sort of slow, intimate, character-based drama that has never achieved the sort of wide appeal (outside of Canada) that more plot focused films have. Watching some of the supplementary material on the Criterion Collection disc, it is also clear that there are many cultural references in the film that will mean more to a Canadian (particularly a French Canadian) than to other viewers.The film meanders amiably along, capturing in unhurried pace the life of rural 1940's Quebec, in this case an asbestos mining town. The main characters are Benoit, an orphaned boy, the local undertaker Antoine and his assistant Fernand played by the director himself Claude Jutra. Eventually the film reaches its big set-piece, a long, extended night sequence where Benoit and Antoine (covered in furs) must traverse the icy, snow covered landscape via sled to retrieve the body of a boy who has died at a farmhouse.The director was hailed as the new savior of Canadian cinema at the time of release, but unfortunately never achieved the level of success later on that he did with this film. He mysteriously disappeared one winter and his body was discovered the following spring after the ice had thawed...a simple note attached, \"My name is Claude Jutra\".","I saw this film when it first came out and have never forgotten it. My Uncle Antoine is much, much greater than the sum of it's parts. The movie, loosely, is about a pre-adolescent who is sent to live with a relative in a small town in Canada. There are adventures that seem more or less typical but underneath there is a current building. MUA has a leisurely pace but have patience, the reward is coming. I believe the film was sub-titled and as with all non-English speaking movies I've seen it is well worth avoiding any dubbed version. Inevitably dubbed movies reflect the attitudes of a new director and actors, with the additional necessity of lip-synching lines that don't quite fit. The English speaking Amarcord is a travesty, for example, while the sub-titled version sings. My Uncle Antoine is well worth the time to find and watch it in French.","The first in the line of Canadian coming-of-age films that included Lies My Father Told Me, Who Has Seen the Wind, Les bons débarras and Léolo, Claude Jutra's 1971 masterpiece Mon Oncle Antoine has remarkably endured as one of the most admired of Canadian films. Set in the snow-covered landscape of Quebec in the 1940s, the film is notable for the tenderness and humor it brings to its story of the loss of innocence of a teenage boy and the awakening of Quebec to its dream of independence.Benoit (Jacques Gagnon) is a 15-year old boy who has lost both of his parents and is being raised by his Uncle Antoine (Jean Duceppe) and his wife Aunt Cecile (Olivette Thibault). Antoine is the owner of a small general store in an asbestos-mining town who also serves as the village undertaker, and the film poignantly depicts the townsfolk in the rural village on the eve of their annual Christmas celebration. We learn from the outset that the mine owners are English-speaking and the French minorities are treated as second-class citizens, the clouds of contaminated smoke emanating from the mine signaling the unfairness of the system.The film moves from comedy to drama and back again. Benoit discovers the village priest as he surreptitiously takes a nip of liquor, sneaks a look at a haughty neighbor, Alexandrine (Monique Mercure) as she tries on a corset, and innocently discovers his attraction to a teenage girl, Carmen (Lyne Champagne), who also works in the store. The turning point of the film, however, is the stunning sequence in which the young boy travels on horse and carriage with his Uncle into the winter countryside where they are to retrieve the body of a teenage boy who has succumbed to his illness.This scene underscores Benoit's initial encounter with death, his awareness of his uncle's alcoholism, and the betrayal he feels when he discovers his Aunt's infidelity upon their return. Mon Oncle Antoine is a memorable and timeless classic and the freeze-frame when we recognize Benoit's transition from childhood innocence to a grudging maturity is as powerful as any including Francois Truffaut's The 400 Blows.","In a genre by itself, this film has a limited audience and narrow appeal coupled with a subtle undertone which permeates the entire production. Nevertheless, it is a remarkable piece of cinema which is as timeless as a rare work of art. Capturing a time in Québec rarely seen in movies, Mon Oncle Antoine's strength lies in the depth of its characters and the richness of the settings. Duplessis' Québec, parochial and feudal, is brilliantly cast as the backdrop which could not possibly be achieved by anyone other than a pure laine Québecois.It would be far too easy to resort to stereotypes, clichés and single-minded myopic statements in this story. Yet the director chose to skip the forced imagery and instead, focused on the essence of life in rural Québec of the time. That makes this film exceptional in its authenticity while not being pretentious in its presentation. If only more contemporary cinematic endeavors would do the same, the viewing public might not be forced to choose between the over-hyped Hollywood Pablum that passes for 'Must See' viewing.Mon Oncle Antoine is - in every sense of the word - unforgettable. It will leave a lasting impression on anyone who has ever lived in - or visited - Québec. A classic. **********************************************Follow-up: 10 May 2008After reviewing some of the comments, it's worth noting Mon oncle Antoine is NOT - and probably wasn't MEANT to serve as standard Hollywood/American cinema for mass market sales. A coming of age story, yes, but far more than simple memoirs of adolescence in 1940's Québec. Viewers who're looking for sheer entertainment at the expense of complex development of the characters will be sorely disappointed. Go watch action/adventure/romance/comedies to be amused. Watch Mon oncle Antoine to be drawn into a seldom seen, but absolutely remarkable society that has been overlooked and ignored for far too long.The Grapes of Wrath is hardly an edge-of-the-seat thriller, yet the story and characters are what makes this American classic an enduring film. Mon oncle Antoine is in the same genre.","Don't be fooled by the nostalgic aura that surrounds \"Mon oncle Antoine,\" because like the best of Canadian films darkness lurks just below the surface.  Set presumably in 1940s rural Quebec, the story explores the developing consciousness of young Benoit as he learns to deal with both sexuality and death.  The look of the film is astonishing, especially seeing as a high proportion of criticism towards Canadian cinema by the general public surrounds aesthetics.  Beyond this, the unassuming Benoit is a seductive protagonist for the audience, looking at his corrupting community with fresh an innocent eyes.  I recommend reading Jim Leach's critical essay on the film in Canada's Best Features for anyone looking to place the film into a historical context while also dissecting the form of the film. Definitely check this one out.","As a mid-teenager whose voice had probably broken a few months before, Benoit peeps at an adult world he is only beginning to understand. It is not a pretty sight. We first see him looking at the body of a middle aged man in an open coffin. His uncle, Antoine, is the small town undertaker. A little while later during a session as an alter boy, adolescent curiosity tempts him to take a swig of the communion wine. A few moments later he sees the priest also taking a surreptitious slurp, Nothing to the disillusions he is about to experience, but a foretaste. There are those artists who leave us but one work and a few fragments to remember them by. Such was the French Canadian film director, Claude Jutra. He contracted Altzheimer's in his early fifties and drowned in the St.Lawrence River, presumably suicide. His one full length feature \"Mon Oncle Antoine\" is nothing short of a masterpiece, not just a little gem but a major work that is among the most perfect rite of passage films ever made. In addition it paints a superb picture of a small town community, Black Lake, Quebec, dominated by the slag hill of an asbestos mine, the time, a winter in the '40's. Much of the film centres on the town's main store run by Antoine, his wife Cecile and their assistant Fernand played by Jutra himself. Antoine and Cecile are childless but have adopted the orphaned Benoit and offer shelter to Carmen an unwanted girl who helps with the running of the shop. The store is the town's meeting place and much is made of the annual ritual of decorating the window with a nativity scene and opening the curtains that have been hiding it on the morning of Christmas Eve to the group of eagerly anticipating onlookers who have gathered outside. This is a highlight for a town in which nothing much happens in the way of entertainment. It contrasts with a later scene where the mine owner drives his horse-drawn vehicle down the main street throwing packages of tawdry trinkets for the town's children which no one seems to want, such is the contempt in which he is held. It is a film in which small incidents such as these skilfully paint a comprehensive picture of what it felt to live in just such a small town, one December, a generation back. In addition to those associated with the store we are introduced to a family living in a farmhouse in the frozen wastes a few mile away. The father, thoroughly disillusioned with his work at the asbestos mine, leaves his wife and children to look after the farm while he tries to get better employment lumbering in another part of the country. While he is away their eldest son falls unexpectedly ill and dies, prompting the distraught wife to telephone for the services of undertaker Antoine late Christmas Eve. The journey into the night with a body box that Antoine, already the worse for drink, has to make, assisted by Benoit, forms the great climax that is to be the awakening of the youth to the absolute inadequacy of his uncle to the task. His single accusation \"Drunkard\" when the mission goes completely awry says it all. The boy has left his playful youth around the store behind and has fully experienced the bitter reality of the adults around him. On his return he even catches something of his aunt's infidelity with the assistant. In a film rich in memorable images none is more unforgettable than the final shot of Benoit looking through the farmhouse window at the grief stricken family with the open box and corpse the father, having just returned, has retrieved from the snow. The boy has become a man overnight. His life will never be quite the same again.","This movie is as much about a time and a place as it is about its characters. The time is the 1940s and the place is a small mining community in Quebec, Canada, at Christmas time. The movie has such an air of authenticity that I felt that I had gotten a glimpse into what life was like in that community at that time.The story centers on the experiences of fifteen year old Benoit, an orphan living with his uncle and aunt who run a general store, as well as a funeral parlor. Also living there is Carmen, a young woman of Benoit's age. Most transitions from adolescence to adulthood take years, but Benoit goes a long way to making that transition in a matter of a couple of days. The events that transpire in those days change Benoit from a rather carefree innocence to a sober appreciation of the complexities of life and death. We are witness to the joys, frustrations and sorrows of the people we meet.Benoit's youthful experiences are universal in the large (sexual awakening, death, duplicitous behavior, dashed expectations), but they are unique to him and that uniqueness is what makes coming of age stories ceaselessly interesting. There is a scene where Benoit is chasing Carmen around among the caskets (such life amid the symbols of death) and he finally catches her as she falls to the ground. He puts a hand on her breast, exciting for him even though she is fully clothed. What happens then is one of those moments that make these experiences unique--neither Benoit nor Carmen knows quite what to do at this juncture and they wind up just staring at each other. If you cannot appreciate such a tender scene, then you will likely not appreciate this movie.Several themes lurk in the background. One is the friction that exists between the French and English speaking peoples of the province. After finishing a beer in a bar, one of the French Canadians says, \"That's one that the English will not get.\" The bitterness between the English speaking Quebecers and the francophone Canadians is brought home in the scene that has the English speaking mine owner tossing cheap Christmas gifts into the snow from his horse-drawn carriage. The harsh life of the mine workers is portrayed with just enough emphasis to make the point. The ugly and oppressive presence of the asbestos mine casts a somber shadow over the entire proceeding, particularly given the health consequences of the mineral.Director Jutra chose Jacques Gagnon from the townspeople to play the role of Benoit, instead of casting a professional young actor for the role. I think this turned out to be a fortuitous choice, since Gagnon gives a surprisingly natural performance, aided by some skill-full camera work. Many of the local townspeople appear in the movie, adding to the feeling of authenticity; the use of natural lighting adds to this as well.Several people have accused this movie of having no plot. I am always puzzled what such people mean by that. This movie presents a sequence of interrelated events leading to a dramatic final scene. To me that is a plot. I wish some of these plot deniers would spell out what they mean by their comment. Maybe I could see the charge sticking when applied to a movie like Warhol's \"Empire\" (a continuous shot of New York's Empire State Building for eight hours and five minutes), but not to this movie.I found this engaging and altogether worthwhile.","This isn't quite the best Canadian film ever, IMO. I won't get off track and name 3 or 4 better. Just a couple of nights before I'd seen \"The Bicycle Thief\", the highly rated Italian classic, and there are some parallels. Both filmmakers shot their film in a specific time and specific place, with minimal resources in terms of sets and cast. And the result in both cases is fascinating and a joy to watch for the realistic setting and characters alone. The lingering shots over faces and landscape almost make this worth watching on its own. That being said, this one isn't quite in the same league as the Italian classic. The movie is shot in a frigid, barren Quebec asbestos mining town. That frigidity is contrasted with the warmth of the people and the eye of the filmmaker Claude Jutra. Basically, what you get is a series of vignettes that are likely nostalgic recollections of Jutra - not ha, ha funny - but poignant, and probably sometimes difficult at the time, but now warmed over with the patine of nostalgia. The movie meanders; there is little tension. Somewhere around half to two thirds way through the story begins. Everyone you've met to this point is involved, and you've gotten to know these characters rather well; so have a little patience at the outset. The story is a good one; it will leave you thinking, and it involves sex, love and death, all the basic elements. If you like Bergman, Godard, Truffaut, all that kind of stuff, you won't be disappointed by this.","Everyone agrees about the technical excellence of this film by Jutra (whose life ended short so tragically). As for the content, of course it makes a difference if you're a Quebecker, and this explains some of the divergence of opinions. For me, it is to cinema what Vignault's \"Mon pays, ce n'est pas un pays\" is to song. In addition, Jean Duceppe was himself a part of legendary Quebec.This film can be contrasted with \"CRAZY\", a current Quebec release that is successful enough to be showing here in Spain and is also about the 1960s. Urban Quebec (Crazy) vs. rural Quebec (Antoine). But also a film that must be something very different for foreigners and for people who know Quebec from the inside.","Mon Oncle Antoine observes the craggy face of a homespun community from various angles, slowly, taking its time through the beginning, as it should, until we emerge from shattered (but banal) hopes and expectations, into swirling ecstasies of dreams and a heart-stopping revelation about the terrible enigma of mortality.Aimless pans and zooms across the snowy mountainside comfort the mind and hypnotize the viewer. This restless camera work is personified in a fringe character who is equally the drifter, quitting his job at the coal mine and leaving his family to cut lumber, then quitting again and returning to the stark humanity of his boy dead. A fetching old woman cheats on her husband and a young boy dies. Old things become new and new things die. Throughout is the snowy whiteness, as wonder-stricken as the history of cinema.","It was one of the first film to use a more realistic approach of light instead of a traditional studio lighting. A very simple example of this is one of the kitchen scene, their is only one practical light above the table, like it was in those days. The lighting embrace reality instead of recreating it. Anyway that's my humble opinion.","\"Mon Oncle Antoine\" is a coming of age film set in a very rural and grim portion of French-speaking Canada. It gives you some insight into the dreadful bleakness of this sort of setting and the film consists of a couple days in the lives of two families--one soon about to experience a tragedy and the other consisting of an aunt and uncle who run a combination general store and funeral parlor.At the Toronto International Film Festival, every decade a panel of critics have voted on what they consider to the best Canadian film of all time. Well, \"Mon Oncle Antoice\" has won this distinction for three straight decades--winning over such brilliant films as \"Barbarian Invasions\" and \"Jesus of Montreal\"! Well, after seeing \"Mon Oncle Antoine\" I can't help but think that there is sometimes a HUGE gulf between what the critics and the public love, as I have no idea whatsoever why this film has received this distinction, as it's a very ordinary film. If I didn't know better, I'd think that Canadian films are terrible--but this isn't true. The other two films I listed above are exceptional--and \"Barbarian Invasions\" won the Oscar for Best Foreign Language Film--and richly deserved it. But as for \"Mon Oncle Antoine\", the film seemed exceptionally slow paced and, at times, a bit pointless and unrelentingly grim.Before you just assume I hate foreign films or have no tolerance for art films, I should mention that I have reviewed close to a couple thousand such films. It's just that this one simply did not appeal to me and it just seems very overrated. Just my two-cents worth.","This Canadian coming-of-age tale is a magnificent example of how powerful a \"small\" character piece can be. Young Benoit (Jacques Gagnon, an amateur whose expressive face could put many a more-established actor to shame) lives with his uncle and aunt (Jean Duceppe and Olivette Thibault) in a tiny village in which the primary employment opportunity is mining asbestos. Over the course of a deceptively low key Christmas Eve and Day in the early 1940s, everything Benoit thinks he knows about his small world will be turned on its ear and he will become a man. There is possibly no way to do justice (at least for me) to the precision and delicacy with which the director Claude Jutra infuses the humdrum of day-to-day life. So much happens, and yet it could be argued that \"nothing\" really happens. In reality, Life happens. While some events are more dramatic and life-changing than others, most everything is given its full due, presented with perceptive grace. (A small barrel of nails taking up precious walking space in the general store that Benoit's relatives own—his uncle is also the town undertaker-- is just as prominent a storyline as some of the more devastating turns of events—and when it is finally picked up to be put away, the film gets its biggest laugh by having the young man carrying it still lift his leg high to step over it.) Jutra isn't afraid to take his time and thoroughly investigate all aspects of life in this depressing little town; the primary foci are on sex and death—about which Benoit will learn much, though he can't make sense of all of it. What's most amazing about Mon oncle Antoine isn't that it's unlike anything we've seen before, but that it shows us the utterly familiar and universal moments of life and makes us see them with a depth we're unused to. But what I've never seen anything like in any movie is an astonishing scene between Benoit and Carmen (Lyne Champagne, another emotive amateur), the young store clerk who his uncle and aunt have basically bought from her poor father. Upstairs in the storeroom of the store, Benoit and Carmen flirt and chase each other among the caskets, she in the bridal veil a customer waits for downstairs. They end up falling to the floor, and he puts his hand matter-of-factly on her breast. She turns away, crying, and flees; Benoit, shaken, lies down on the floor and realizes they've been observed by the store's chief clerk Fernand (played by Jutra himself). It is a simple, but almost staggering scene of such allusive beauty, with both characters caught up in a moment they can't quite make sense of. And the \"sex and death\" metaphor is unstressed, allowing us to try and comprehend all the subtext without a lot of editorializing. It is in the last third of the movie, though, that Jutra brings all his themes together. A young boy has died suddenly, and Antoine has to drive hours away through the snow on a horse-drawn carriage to retrieve the body. Benoit begs Aunt Cecile to let him go (Uncle Antoine warns him, \"Don't get all excited\"), and the literal journey to manhood begins. But Jutra never bogs the journey down, full as it is, with the weight of self-importance; we watch what happens, we process what it means to Benoit, and we are allowed to make sense of it on our own. Jutra stresses nothing, he just shows it. (Benoit has a moment when he has to touch the dead boy's body. He hesitates for a moment, and suddenly takes hold, and I thought, \"I've just watched a boy become a man, right this second.\" His nascent maturity allows Benoit to react as he does when the trip back home—and the arrival at home, as well—completely knock him out of the world he's known; he's angry, he's hurt, but he's not confused. He sees what's what, and accepts it for what it is. I wish I could say Antoine is perfect, because it comes awfully damn close. There is a really silly dream sequence near the end that takes all the allusion we've witnessed and makes it rather obvious, but this is about 90 seconds out of a movie, and—though disappointingly lumpy—can't undo everything Jutra has so phenomenally laid out before. This movie affected me as few movies have; certainly nothing this year (with more than a few really fine films) comes close. In stressing again how small it is (which, as I've stated more than a few times, is right up my alley, aesthetically), I attempt to not overhype it. It's tiny, but it is as powerful a movie as I've ever seen. **** and Most Highly Recommended","I'm not quite sure as to why this is often regarded as the best Canadian film ever, but I enjoyed it nevertheless.  It took me some time before I started caring about any of the characters, but when it was over, I realized that I had actually ending up liking it anyway.  The look of the film is spectacular, and I don't think that I've ever seen a movie that felt more like winter, so the visuals were a handy distraction whenever the story seemed to be particularly slow in developing.  To be sure, there were more than a few scenes when things seemed to be progressing rather slowly, but in the end, I would say that it was a good way to spend my time.","At the core of My Uncle Antoine is a coming-of-age story about a young Quebecan boy helping out his family with the store on Christmas Eve. But it is also rooted within the historical context of the Grande Noirceur, or The Great Darkness, a period of social unrest within the French Canadian province post World War 2 under the reign of the fiercely conservative Maurice Duplessis. For residents who have experienced this it rings true - the push of residents towards rural, menial occupations, the privilege and devotion afforded to the powerful Catholic church, the utter futility of worker strikes, and the opposition towards unions. Bathroom graffiti hastily scribbled seems to recognise the discontent with the political regime. Indeed, the asbestos mine is photographed in such a way that it envelopes and suffocates the small town like a great grey shroud, in a similar manner to how the lives of the low class Quebecans are subjugated and held in place by systems beyond their control. A miner's story, which bookends the film, tells of his singular attempt to quit his job and leave for a better existence as a logger. Suffice to say, it is an unsuccessful one. As switch over to the main storyline it takes on the boyish excitement of Benoit, who is helping his uncle and aunt set up the Christmas display for their general store. It is the mark of a small town that it is the show-piece that all the residents look forward to each year, and there is a little mock unveiling that takes place. When a shy young girl announces her engagement, the whole town cheers and ruffles the hair of the young groom-to-be and drinks to the happy couple. And they are all intimately familiar with the singing voice of aunt Cecile and how she acts as the serenader for all the big events. This warm family is also accompanied by a lively score that seems whipped up from the young, excited mind of Benoit himself; a fast-paced, melodic violin piece that is fit for a jig but which shows the whole town coming together for a snowball fight. Isn't Christmas the most lovely time of the year?The film is slow paced - it unveils these aspects of the community, along with oddities that Benoit is accustomed to. His uncle Antoine is also the town undertaker, and as such coffins line the walls and floors of the second floor; but this is initially just a playground for the young boy, a perfect moment of blossoming sexuality where he and Carmen have the urges, but not the knowledge or maturity to proceed (you'll notice how they almost immediately make up afterwards). There is that dreary sequence where the mine-owner tosses his yearly 'bonuses' at each house; even without showing their contents they look practically empty. The youth and kids excitedly fight and grab at the stockings while the parents and elderly watch glumly, as they have been through this many times and are wise not to get their hopes up. And Benoit and his friend sit somewhere in the middle; they aren't swayed by the stockings, but pelt the owner's horse with snowballs, perhaps not quite old enough to lose those wide grins on their faces. Even as his uncle is called out for a grim job on Christmas Eve to collect a corpse he still has that big grin on his face; he begs to go as if he was running out the door with his friends, and the lively score once again characterises his excitement and joy. But then he is silent as they approach the tragedy-stricken family. He sits while they quietly eat the lavish dinner the mother has prepared, as if they were just visitors, and is stoic as the children enjoy the gift of candy, which is given a similar treatment as the stockings beforehand. Could he have suddenly realised the gravity of the situation in a way that the grinning teenager earlier could not? Brault's camera first and foremost shows its passion through its quick, frantic zooms - and there is not one more important than the reveal of the dead boy, scarcely older than Benoit himself, a frozen, lifeless mirror-image of himself. It is in that moment we know that his grin will never be as wide, his playfulness never as naive or mindless. What follows after is just a brutal reaffirmation of the fact. In a heartbreaking monologue, Antoine spills out a confession that is not only intensely personal but reflects the social context of the period and the suffocation of the political regime. We see Benoit's new look, his stony-faced stare boring into the heart of Cecile who knows that she has been caught out, but does not immediately recognise this Benoit. And in that final, haunting POV shot, a new consciousness behind the camera, as if he is seeing for this first time, not just looking. The mastery of My Uncle Antoine is that is is so tragic because it invests so much into the small Quebecan town, and the intricate, painful details. This elevates the emotional trauma to new levels. See the tenderness of a final sexual embrace between Jos and Madame Pouline, and how they come together in the barn. See how the exact same treatment is applied to aunt Cecile's affair; not with the usual aggressive lust, but with an air of sweetness in how Fernand stares at her and tentatively compliments her dress. Spare a though for Carmen, who think she is old enough to be wearing lipstick, before hastily washing it off when Benoit teases her about it. In her father's eyes, she is less a daughter and more a worker.","The flip side of the jollier Christmas is this sobering, low-key, funereal Eve day slice-of-life spent in a blink-and-you-will-miss mining town, where a boy orphan named Benoit (Jacque Gagnon) helps his \"uncle\" Antoine (Jean Duceppe) and \"aunt\" Cecile (Olivette Thibault), their teenage boarder, Carmen (Lyne Champagne), and clerk/assistant, Fernand (Claude Jutra, also director of this film) prepare the general store for its holiday-themed opening, complete with model manger scene in the store window, lights, and festive décor. Prior to this, Benoit helped Antoine (also an undertaker) prepare a miner for a Catholic funeral (Fernand dutifully receiving orders from Antoine and obeying without being sore as well). Benoit even serves as a bored altar boy going through the motions of a day as a priest rarely pays him much mind as he himself does his deeds quietly. The film hints at a tension between the miners of the town and the mine that hasn't given them raises and serves as a beacon of burden resting high above their home on a mountain nearby, like a looming thundercloud. Then there are the revelations that come as the day settles and Benoit does some growing up. Like how a drunken Antoine just unleashes his disappointments (no real child, a job in a poverty-stricken town, an undertaker when he would have rather been in charge of a hotel in USA instead of a general store in a small spot in Quebec) like a gushing wound bleeding forth, having to operate the horse buggy as Antoine is useless when the casket of a dead young man falls off (Benoit has a cast on one of his arms, and his attempts to get Antoine to help him fails), and discovering Cecile and Fernand fooling around while they are embracing adulterously; these events are life-altering and unexpected. Carmen and Benoit flirting (there's even a moment of sexual awakening as a horseplay leads to Benoit copping a feel of her breast while Carmen is okay with that, until embarrassment eventually causes her to flee), and her disgusting pops showing up to retrieve her income working at Antoine's store (the poor state of the people is especially noticeable here) are a glimpse into what this blossoming woman currently has going on in her own life. But what appeared to be a marriage somewhat solid (Cecile and Antoine), the film lets us see behind the curtain, and it proves to be a façade potentially fracturing.The cold, gloomy environs of the location, a local populace beholden to a mine that is unhealthy and unappreciative to its employees (the film is set right before a strike), and the solemnity of an introverted boy rarely vocal and more introspective are significant attributes to one of Canada's most celebrated films. Set in the 40s, the director perhaps deserves particular praise for the evocation of time and place, how authentic and realistic the characters are presented (it is as if we are time-warped right into a different era), and the dreary, colorless presence of a low income, grind-it-out, discouragingly dismal everyday existence for the miners who see no real light at the end of the tunnel. The final scene where Benoit looks into the window of the mother who lost her son when he just fell ill bookends the gravity of just how difficult life in the setting is.The subplot of a miner who grows restless and tired of the job goes a logging, leaving behind his family for what he considers a brief spell, not knowing his son would soon be dead upon return. That kid is the one put in a casket by Antoine and Benoit, with the undertaker inert and almost unaffected by the loss for the family (Antoine eating away at a supper prepared by the mourning wife is rather troublesome). When Antoine later can barely stand, a pitiful mess, Benoit seems to have lost all respect for him. Later, when he sees Cecile for who she really is, Benoit seems totally defeatedthese people he looked up to are truly flawed and disappointing. Fernand and Cecile trying to tip-toe around what Benoit saw by appealing to him delicately, it failing miserably, proves that the kid has grown up and not duped any longer. My favorite scene has the sophisticated beauty married to the mine accountant arriving at the store looking for a corset, with the guys truly in awe of her.","I have this romantic notion of relocating from the insanity of city life and retreat to the quiet slow paced eternally passive moments of a rural existence. After viewing this film, in it's entirety (touche), I have left this silly notion behind forever.The beautiful scenery and view of a serene, quaint, pastoral countryside is this films greatest asset. The comedic aspects of falling over a barrel of nails, a missing coffin, and a tight corset might have saved the day but not even an approximation of entertainment.After reviewing comments claiming this is the longest running, highest rated Canadian film I am persuaded to not even visit this country!High recommend for locals who want to see their hood on the silver screen. It is an extremely labored, plodding script with very little to offer other than: There is NO Place Like Home!! AMEN","First, the good part. I always appreciate films that give you a glimpse at an unfamiliar place or time, and MON ONCLE ANTOINE truly evokes what life was like in a small Canadian mining town during a cold, snowy winter. The tough life of the mining and farming families isn't sugar- coated.But the bad part...this film drags on at least a half hour too long, with endless shots of nothing happening. Maybe that's the point: winter in Canada is boring. There are several interesting characters, but we only see little slices of their lives and personalities. Despite all the \"coming of age\" stuff you'll read here, there's really no plot to speak of. It seems like a documentary rather than a drama, edited by someone who wasn't educated in the art of pacing.Why are Canadian critics so enamored of this film? Maybe because it gives them a little frisson of nostalgia about simple Canadian life (which they have probably never experienced first- hand). If I had to pick a film set in Canada that evokes the eerie beauty of the North, I would take BLACK ROBE over MON ONCLE any day of the week.","I have seen this movie many times and have never found it to be particularly entertaining. It has always been of interest to me because I was born and raised in Black Lake, the asbestos mining town that is the setting for the movie. It's always engaging to see part of one's past brought to life on the screen, but it isn't nearly enough to praise this film. I found the story line to be disjointed and fleetingly related to the facts of life in that community. Yes it does depict the long slow winters of Quebec rural life, but when you apply the long and slow to a movie it kills it for me. The last third of the movie is particularly painful. That set piece just drags on forever. And in my opinion kills the movie.","I had to watch this one for my Canadian cinema course and I was told that it was considered to be the \"best Canadian film.\" When I watched this I really did not agree, considering I've seen a lot better ones. I understand that there were Canadian themes and messages, but the fact that the characters and the plot were so disconnected with me (as a spectator) it made me not really care what the film was trying to tell me. The plot was too dry. The characters did not have many positive personality traits, but this is to emphasize the messages, not to tick off spectators. This film shows a little about the history of Quebec. Not a very interesting film; it definitely does not deserve to be put on such a high pedestal.","«Mon oncle Antoine» depicts the life in a little french-canadian village of the mid twentieth-century. The conflicts between the anglophones (who manage the economy) and the francophones (the workforce) is clearly obvious in the movie, so as the social life of the «époque». Jean Duceppe is doing a great job as Antoine, the owner of the village general store and the local funeral director. Some scenes drags on a little but the overall appreciation of the movie doesn't suffer that much of it. I gave it a 7.","As my wife said, this film is \"more boring than being stuck in traffic.\" There is no plot. The story drifts aimlessly. The characters are unremarkable.What did I take away from the movie? That some Quebecois are as susceptible to alcohol as was the American Indian (despite the French having eons to develop wines and liquors and evolve kidneys to deal with both), that Quebecois have no concept of a work ethic (i.e., they're inherently lazy), that teenage boys are obsessed with tits and that life in a far-Northern asbestos mining town is sometimes harsh.The first two are questionable at best and, as for the second two, well, blow me down! The film did make some attempt to show the division between those Quebecois of English extraction and those of French. But we initially had the audio set to English and entirely missed that undertone until one character explicitly stated (in English) that \"I don't understand English.\" whereupon we reset the audio to French, the subtitles to English and (unfortunately believing that we were missing something) rewound to the start again. Another 10 minutes of my life that I will never recover.","Explores the frontiers of extreme boredom. Life in a small Canadian town in winter as an experiment in extreme sensory deprivation. Absolutely nothing happens as viewed through the eyes of a blank, deadpan, totally uninteresting protagonist. Viewers of this film should be prepared to hallucinate in the style of \"Altered States\".In a groundbreaking study, David Snowden found that he could predict Alzheimer's thirty years in advance by comparing the autobiographical essays of nuns as they entered the convent. Those who eventually suffered the disease wrote in simple direct prose. The essays were quiet and contemplative with little optimism or episodes of joy.Now, why did I mention that? Perhaps , my mind begins to slowly unravel watching this interminable, autobiographical, contemplative film which shows, in simple direct style, the bleak and stoic life of a small community, living next to giant slag heaps of asbestos.This film became popular at the height of the Quebec separatist movement because of its presentation of this community as permanently wounded victims. Tragically, its writer-director was soon diagnosed with Alzheimer's disease in the early 1980s and apparently committed suicide.","Mon oncle Antoine was voted the greatest Canadian film of all time by the Toronto Festival of Festivals in 1984 and 1993. But why? Leonard Maltin, who I usually don't like, brushed this movie off with a sentence \"Not bad, but nothing special.\" Who's right? Does it matter if the viewer is Canadian? It's true there's little wrong quality-wise with Mon oncle Antoine. It focuses on Quebec at Christmastime prior to the Quiet Revolution. Great setting with lots of possibilities for stories. The musical score works charmingly. It's a coming-of-age story about 15-year-old Benoit. The problem is that virtually nothing happens- the high point of action in this movie is when a coffin falls off a sled. Really? What's that supposed to say? If there's a message, it's cryptic. There's nothing clearly political about this movie, nothing especially unique to Canada or Quebec, and nothing valuable or surprising to learn about Duplessis' era. Without much apparently happening, there's little here you can't get from a Cornelius Krieghoff painting.So what is the best Canadian film? I can't say I've seen many but I can point to The Sweet Hereafter (1997) or even Last Night (1998) as better movies. In comparison to those, Mon oncle Antoine is competently-made but does not shine."],"review-user":["MacAindrais","argonaut69","newday98074","howard.schumann","A_Bit_of_Clarity","credmond","jandesimpson","bandw","slofstra","translatology","stephenpitkin","i_meroyce","MartinHafer","vivalarsx","Tito-8","sharky_55","Scarecrow-88","GeoPierpont","LCShackley","sdbpearl-1","girl_in_room506","LeRoyMarko","mdkersey","Zahgurim-2","gizmomogwai"],"review-date":["29 July 2008","25 February 2010","18 December 2007","10 June 2012","21 November 2006","22 November 2003","26 June 2011","27 June 2013","14 January 2009","12 September 2006","22 November 2005","1 September 2003","26 February 2011","27 July 2013","25 May 1999","4 March 2016","15 December 2015","14 December 2015","29 January 2009","15 November 2009","14 April 2008","27 March 2001","5 June 2011","1 April 2009","6 May 2011"],"review-rating":["9","10","10","9","9","7","10","10","5","10","7","9","7","3","5","5","3","7","1","1","7"],"review-title":[" Christmas, Cuckolds, and Corpses\n"," Life in 1940's Quebec\n"," Wow\n"," Notable for its tenderness and humor\n"," Astonishing.\n"," Often considered Canada's best feature film\n"," Something special for my 150th review\n"," More here than some give it credit for\n"," Will appeal if you're a certain kind of film-goer\n"," Still haunts me after 30 years\n"," Magic Entrenched Hypnotically in Banal Authenticity\n"," The one thing that made this movie so good is the lighting !\n"," A great example of a film that illustrates the gulf between the critics and the general public\n"," Stunning Coming-Of-Age Tale\n"," Flawed, but effective\n"," Mon oncle Antoine\n"," Mon oncle Antoine\n"," Tired of That Hectic Crazy City Life???\n"," Slower than molasses in a Quebecois January\n"," A pan for Mon Oncle Antoine\n"," Not Worth Being Called the \"Best Canadian Film\"\n"," Good but not excellent\n"," Utter Waste Of Time\n"," Boring\n"," That's it? That's all there is?\n"]}