{"review-url":["http://www.imdb.com/title/tt0043822/reviews"],"review-text":["Story of a Italian Prince who falls for an Arizona singer while she is performing in Italy.  12 years pass and the actress (Lana Turner) is now a major Hollywood star, and the Prince (Ezio Pinza) is now exiled, at which point they resume the romance.Lana Turner never looked more beautiful.  Ezio Pinza was right off his success from \"South Pacific.\"  Turner and Pinza don't make a good couple, and it is somewhat evidenced by the scenes together.  Pinza has ample opportunity in this film to show his Operatic talents, in many cases Lana Turner stands around as beautiful window dressing.Marjorie Main appears in a somewhat rare non Hillbilly role, and pulls it off quite well.  Barry Sullivan appears as Lana Turners Hollywood paramour, but that plot line is not followed through with very well.\nThis movie is in the public domain, and as such can frequently be found on TV, DVD and Video.  Despite that fact, it still carries the MGM name well. Beautiful costumes, sets, musical scores and beautiful Technicolor.","Lana's a singer who ultimately falls for a prince, a real prince. The best way to review a movie of someone's favorite actor, is to ask what if someone else played that part? Well, if anyone else had been in this movie other than Lana, I probably wouldn't have watched it. While it may not win any awards, it's not terribly bad either; in fact, it's the kind of film you'd remember fondly. I could see someone watching this late at night or on vacation and enjoying its simplicity. It's very charming and also stars a young Debbie Reynolds and Marjorie Main (\"Ma Kettle\")and Ezio Pinza does have a great voice. But, having said all that, I get the feeling watching it that this project must have come to Lana at a career low. Watching such a big guy as Ezio Pinza in certain scenes (you'd have to see it to know what I mean) was just too much, becoming either unintentionally funny or just plain silly. It might would have been more effective, had they picked a younger male lead with more appeal. But upon seeing this again recently, I couldn't get over how much I liked its unpretentiousness and somewhat carefree attitude, despite the serious ending with the letter the son wrote that Ezio read over the phone. It all worked to make a straightforward film, not trying to be anything but what it is.If I had to pick the four of Lana's films that I think are the weakest, they would be \"Bittersweet Love\", \"The Prodigal\", \"Love Has Many Faces\", and maybe this one. But this is much better than the others. Finally, though, I would have to say that a movie's ending makes you either satisfied or dissatisfied with it. Usually short movies wrap things up with a pat or forced resolution and too quickly. This ending flowed and allowed you to feel your way out...In other words, only Lana fans would watch this, and only they will be rewarded in small ways. While no Lana classic, this is very enjoyable and deserves to get more attention for being another example of good clean family entertainment like they used to make.","More of a near miss than a flop, MR. IMPERIUM stars Ezio Pinza as Alex, heir apparent to and later king of a small European nation, who falls in love with a willing American actress and entertainer, Fredda Barlo (Lana Turner), but due to machinations by the sly prime minister of Alex as king, nicely played by Cedric Hardwicke, the lovers are separated for 12 years before being reunited in Palm Springs where their love is rekindled. Director Don Hartman, who also scripts, is not able to fully utilize his talent for snappy dialogue because of Pinza's tentative English usage, and the requisite rewriting, coupled with less than total rapport in evidence between the two stars, results in a somewhat raggedy tone to the screenplay, exacerbated by the studio's unkind cutting of many scenes, leading to a confusing ending. The overpowering Pinza dominates his scenes with Turner, but both performers score with good work, while Marjorie Main is impressive with her patter effects as written, with Debbie Reynolds placed on track by Louis B. Mayer for SINGIN' IN THE RAIN as a result of her sprightly performance here; only Barry Sullivan is heavily victimized by the flagrant cutting. Prettily filmed largely in Pebble Beach, California, and other Monterey County environs, the film is endowed with Pinza's iron strong operatic basso in Solamente Una Vez, as well as with original songs by Harold Arlen and Dorothy Fields, with Douglas Shearer splendidly handling the sound recording, and notice must be made of the fine set decorations by Edwin Willis, and the effective costume designs by Walter Plunkett.","This is a typical 13 in a dozen romantic musical movie from the MGM studio's. It's not any better or worse than most other productions, which means that the genre fans will most likely enjoy this movie.This is your typical enjoyable lighthearted romantic musical comedy from the MGM studio's, which means that the movie is mostly good looking, has some good musical moments but is predictable and formulaic to watch. Does it really matter all? There only are a handful of MGM musicals that have gained the classic status. About 80% of their musical productions are nothing more than simple lighthearted movies that are pleasant to watch but at the same time also extremely forgettable. These sort of movies are good to kill some time with, of course especially if you're a fan of the genre.Granted that the love-story is not the most believable or compelling one. I don't know but having a 60 year old playboy prince falling for a 30 years younger blond beauty by todays standards feels more dirty than romantic. Guess in the '40's/'50's this was Hollywoods idea of a romantic story and every young girl dreamed of marrying an older, rich, playboy prince. Who knows. Yet the story still works out alright enough, which is thanks to the actors Lana Turner and Ezio Pinza, who also have some good chemistry together.Further more the movie is filled with all of the formulaic genre ingredients and most things also don't really come as a surprise. The movie is not as musical filled as perhaps other MGM productions, which might disappoint certain people.The movie is pretty good looking, with some nice sets, costumes and setting, although it's all obvious fake at times. It helps to give the movie a pretty good light feeling and atmosphere, which helps to make this movie a pleasant one to watch.The movie features some good other actors such as Sir Cedric Hardwicke and Debbie Reynolds in an early role. Yet most of the other characters are underused in the story, which provide the movie with some missed opportunities. The movie overall as a whole has perhaps a tad bit more misses than hits in it, which does make the movie an uneven one to watch at times.More of the same all but I'm not complaining about it and so most certainly wouldn't the genre fans. The movie deserves a better reputation, for sure.6/10http://bobafett1138.blogspot.com/","Typical whipped cream MGM comedy with some songs thrown in. Lana is a small time American entertainer knocking around Europe when we meet her at first with the unlikely name Frederica Brown. One night she happens to make the acquaintance of a romantic and musical prince who gives her the supposedly more charming but just as bad name of Fredda. Swept off her feet they make plans for the future which of course go off the rails when his father, the King, dies and he must take over. This of course happens everyday to itinerant performers! His meddling prime minister doesn't deliver the note he left for her and gives her the brush. She departs for home sadder but wiser.Several years pass and Lana now renamed Fredda Barlo is a major film star with Barry Sullivan doggedly in pursuit and proposing marriage. Naturally this would be the precise moment the now deposed King would show up and they meet in the desert for a secret rendezvous, at the ranch house home of Marjorie Main and her niece Debbie Reynolds, where Lana gets the idea that he would be perfect to play the king in her new picture. You have to assume it's love because Pinza is not movie star material despite having a beautiful singing voice. It all continues on in equally ridiculous fashion until the expected ending. A contentious production which Debbie wrote most amusingly about in her first biography. Just starting out, this was only her fourth film to be followed by Singin' in the Rain, she took the role of observer. Lana, pregnant during filming with a baby she would miscarry shortly afterward, hated Ezio Pinza, a boorish lout with incredibly bad breath and an octopus's hands and never saw the completed film. Marjorie Main who Debbie had the majority of her scenes with was a dotty old sod who carried on conversations with her long dead husband and would exit the scene to use the facilities reciting her lines as she departed. Metro put up with her eccentricities though since she was popular and punctual. The director just tried to keep the leads from killing each other and delivering the film on time and it does move at a decent clip. A minor bauble for all involved this wasn't a hit when released and is certainly no work of art but it has the customary MGM high production values, the desert house in particular is beautiful, and is a harmless way to spend ninety minutes.","On assignment in scenic Italy, beautiful lip-synching Lana Turner (as Fredda Barlo) meets older singer and prince Ezio Pinza (as Mr. Imperium). The two fall in love, while enjoying the pretty Italian countryside. Unhappily, Mr. Pinza is called away to his Kingly father's death bed, leaving Lana in the lurch. Twelve years later, Ms. Turner is a Los Angeles actress, about to make a motion picture about falling in love with a King. Turner is being romanced by co-star Barry Sullivan, who wants to marry her - then, King Pinza re-enters her life... \"Mr. Imperium\" provides a tired storyline for sex symbol Turner and debuting bass vocalist Pinza, who appeared for several decades with the New York Metropolitan Opera. Pinza likely earned his MGM feature film career after appearing in the hugely successful stage production of \"South Pacific\" (1949). The cast album, and Pinza's golden \"Some Enchanted Evening\" single, sold millions. Supporting casters Marjorie Main, Cedric Hardwicke, and Debbie Reynolds give the film a even greater sense of wasted resources.*** Mr. Imperium (1951) Don Hartman ~ Lana Turner, Ezio Pinza, Barry Sullivan","I found this among a DVD of 4 older movies my public library bought. It was filmed in Technicolor but the print was badly faded and the colors are no longer vivid.Even though Lana Turner was still in her late 20s she had already done quite a number of movies. Here she is Fredda Barlo, an aspiring actress who meets up with a mysterious man in Italy. They have to part ways, she goes back to Hollywood and has a nice career in film, and they are destined to meet again 12 years later. Her lover is twice her age, Italian actor and singer Ezio Pinza as Prince Alexis, aka Mr. Imperium. He is smitten enough with her that he is willing to give up his crown, but when he finds out his son, living his own carefree life in England, would be pressed into service as a monarch, he relents and leaves Fredda yet again. The ending is reminiscent of the end of \"Casablanca\", but this time it is the woman on the tarmac watching her love fly away.My main interest in seeing this movie was Debbie Reynolds as the niece of the woman who has the B&B, her character is Gwen. It isn't a big role but it is nice to see her very early in her career, probably 18 during filming and not long before her big splash in \"Singing in the Rain.\"","Mr. Imperium represented two efforts by MGM to make Ezio Pinza a film star on the strength of the great critical acclaim that he got from his Broadway starring role in South Pacific. Maybe if he had made the film version of South Pacific back then things might have worked out differently for him. But it was still running on Broadway albeit without Pinza at the time and by the time the film was made another studio made it and Ezio Pinza was very unavailable.The film concerns a crown prince and a nightclub performer before World War II who meet at an Italian resort. Lana Turner with vocals dubbed by Trudy Erwin is the performer and Pinza the crown prince who goes incognito with the name of Mr. Imperium. They meet and fall in love, but when his father is on death's door, duty in the person of Prime Minister Cedric Hardwicke intervenes.World War II and revolution have made Pinza an ex-King and the years were kinder to Turner who became a film star. They meet again at a private resort run by Marjorie Main and her daughter Debbie Reynolds and things do rekindle much to the distress of Turner's patient and long suffering director Barry Sullivan. Will things finally go right for them this time? Mr. Imperium is not a bad film, but it was hardly the vehicle to launch a film career with. Harold Arlen and Dorothy Fields wrote some original songs for the film, but nothing of the caliber of the Rodgers&Hammestein score Pinza was singing on Broadway.According to Edward Epstein's book about Lana Turner things were most formal on the set of Mr. Imperium after Turner rebuffed Pinza's advances. And he apparently put on quite the campaign to woo her, but Lana wasn't having any. This all probably had the effect of a most pedestrian performance by her.Pinza did so much better on stage with South Pacific and later Fanny, too bad he didn't do that film either.","If there's one thing MR. IMPERIUM has going for it, it's the delight of hearing EZIO PINZA's strong bass do justice to a few pleasant songs, most of which he sings while serenading LANA TURNER, who's principal job in this one is to stand around and look beautiful while Pinza's voice takes over the soundtrack with gusto.Other than that, it's a fanciful story that's been used hundreds of times before--a commoner (Lana) falls in love with a prince (Pinza) and their on again/off again romance ends with a bittersweet decision on his part to return to his kingdom when it needs him. That's about it for a storyline--and along the way MGM gave the stars a supporting cast that includes BARRY SULLIVAN, SIR CEDRIC HARDWICKE, MARJORIE MAIN and DEBBIE REYNOLDS, all of whom have very little to do.It's been given a glittering MGM look with Technicolor visuals straight out of a storybook and the usual lavish care given to sets and costumes. Turner looks lovely and gives a warm and capable performance, but the lip synching in the opening number is a bit obvious. (Fran Warren supplies her singing voice).The script is flimsy, and doesn't get the same amount of attention as the art direction and costumes, so it's easy to forget this trifle as soon as it's over. It does provide pleasant but artificial entertainment while it lasts.Worst flaw: There's very little chemistry between Turner and Pinza who was in his late fifties when this was filmed and never did click in his screen career.","Simply miserable Lana Turner-Ezio Pinza vehicle. Pinza had a beautiful voice but he rarely uses it in a film that reminded me of \"The Student Prince\" with adults. Pinza is no leading man either. He looks like an elderly man ready to collect social security and go fishing.The plot is extremely thin and the supporting cast of Barry Sullivan, Marjorie Maine and Debbie Reynolds are given so little to do. Sir Cedric Hardwicke comes in at the end to announce that our King Ezio had better return to his people. As far as I'm concerned, the faster the better. Is that Lana Turner really singing with Pinza? Not bad if it is her. The picture would also remind me in a way of the 1960 movie \"The Prince and the Showgirl\" with Marilyn Monroe and Laurence Olivier.","Nothing has changed much in Hollywood, MALE producers still seem to think that the world is full of young women \"attracted\" to old men. While that is obviously the truth in Hollywood, I can't remember the last time a twenty-something (without a daddy complex) went wild over a 60 year old man. Here we have another example of it on film though with Lana Turner who is barely 30 in this movie and the old fart she falls madly in love with (Ezio Pinza) being 60! Ugh, hard to watch, makes the movie a joke. There is even a line in the movie where a 19 year old Debbie Reynolds says \"He is good looking.\" Right, like \"Isn't my Grampa dreamy???\" Yuck, enough to make your skin crawl. Unfortunately, the pairing of young women with old men is still the norm in Hollywood, we need MORE women producers to make movies that can offer a bit of a balance...like let's say a Ryan Reynolds falling madly in love with Candice Bergen?","This brief review contains no spoilers since the movie spoils itself. It is wooden and pedantic. It has no saving grace whatsoever. If someone invites you to his house to watch \"Mr. Imperium\", don't go. Even the title of the movie is dreadful and portends what garbage lies within. The whole plot is so bad that it could drive Mother Theresa to despair!!! It wasn't a stroke that led to the early demise of poor Ezio, it was having to act in this clunker that did him in. It must have haunted him the rest of his days. Perhaps he was an enemy alien and wanted revenge upon the Americans for his confinement. He found a perfect vehicle for his wrath in this travesty.","I had heard of Ezio Pinza. I understand he was a retired opera singer when this movie was made. As a singer myself, I enjoyed hearing him sing, with his beautiful booming voice. I had heard he played Emile de Becque in \"South Pacific\".I have heard so many bad and put-downish things about Lana Turner, but in this movie I find her pleasant, beautiful and intelligent. I enjoyed watching her tie up her turban, thinking that the red color was so garish. But in the next minute, however, when she put on the red cloak all of a sudden the entire outfit made sense and actually looked stunning. I liked the many dresses and sophisticated, colorful high heel shoes she wore in this movie.Debbie Reynolds was annoyingly perky-perky-perky, but fun. Marjorie Main played a typical domestic persona that I had seen in \"Meet Me in Saint Louis\". Here again, Marjorie is not playing Ma Kettle.I liked this movie.","For some I guess the selling point would be Lana Turner, for others Pinza, I can't imagine too many being hooked on the ludicrous teaming but in my case the attraction was the score; music by Harold Arlen, lyrics by Dorothy Fields, both ranked at the very highest level of twentieth century songwriters only a tad below Porter, Kern, Gerswhin Rodgers and Hart, Leosser, Mercer etc. Had they come up with even a minor league score the corny plot and ludicrous miscasting would have been easier to take but incredibly these two great writers turned in something that would hardly do credit to a High School end-of-term production. Adding to this is a fine supporting cast featuring Cedric Hardwicke, Barry Sullivan, Marjorie Main and Debbie Reynolds, none of whom, I would imagine, would be eager to flaunt this title on their resumes.","When the film begins, Fredda Barlo (Lana Turner) is on tour, singing up a storm across Europe. Prince Alexis (Ezio Pinza) is captivated by her and stalks her until she falls for him (not a very healthy cliche, I know). However, soon after they begin their affair, the King dies and Prince Alexis is swept off to assume the throne.Years pass. Fredda is now a big film star and she and Alexis lost contact due to WWII. Now, out of the blue, he has returned and wants Fredda for his snookie-wookie. Can this meeting at a desert resort rekindle their love or is 'Mr. Imperium' (the alias the King is now using) wasting his time?Ezio Pinza was new to acting, having spent the years before this film as a successful opera and Broadway singer. As his first film, he has a lovely voice going for him but he also is rather old to be wooing a significantly younger woman. He also could have used captions, as occasionally I couldn't understand what he was saying...as his accent was quite thick. MGM thought his debut was a bomb and they shelved the film for a year...not a good sign at all. But is it, in spite of this, any good? Yes...and no. I think the film works reasonably well DESPITE him. Pinza might have been a lovely leading man back in the 30s...but by 1951, he simply looked old...which, he was for his film debut in his mid-50s. As for Miss Turner, she's pretty much her usual self in this one, though it's sad MGM didn't cast someone who could sing in this role. Overall, a mildly entertaining film and not the bomb I expected...though this is hardly a glowing endorsement.By the way, if you do see the picture, look for a young Debbie Reynold about midway through the story.","Pretty much a \"do I want to keep watching this thing?\" type movie and a \"the box says Debbie Reynolds is in it... so where is she ? Ahhhh finally !!! DEBBIE. 1951 and on the veritable threshold of stardom and immortality ! She eventually shows up after what seems like endless traveling through the countryside by a mismatched couple with no chemistry singing insipid songs at each other followed by a twelve year break in the story of these platonic lovers and then BOOM here is this delightfully energetic little girl/woman playing Marjorie Main's niece.Imo, the story is pretty dumb. The songs are skippable. There are plot holes big enough for a Mack truck to drive trough. The \"romantic\"couple is not at all appealing BUT the scenes with Auntie and niece are worth a look just to see a star in the making.The tag-line for the picture is \"M-G-M's Singing TECHNICOLOR Romance!\" Problem was that my copy was in glorious living black and white so that when I read some of the other reviews praising its color to the hilt I was confused. Public domain VHS copies, gotta love 'em.","It's a shame this is such a poor movie. I really like the cast, especially the two leads. But poor it is.All that saves it, in my opinion, are the songs written for Ezio Pinza, most of which are really very enjoyable, and certainly beautifully sung by Pinza. But the plot is obvious and boring. The Student Prince warmed over, and not very warm at that.And, for whatever reason, there is no real chemistry between Plnza and Turner. He doesn't deliver his lines well, in part because, despite decades of singing at New York's Metropolitan Opera, his English was still very poor. In part, perhaps, because he just wasn't a very good actor without music to sing. (I don't know what he was like in South Pacific, in which he opened in 1949 after he retired from the Metropolitan Opera.)I watched all of this because I have loved Pinza's singing for decades. Unless you share the same love of great singing, I don't know that this movie will hold you. It just isn't a very good picture.","I wouldn't call it a stinker, but it isn't a heavily engrossing film either. It's a sweet musical story of love and how life can complicate things. The humour is light, the songs are nicely done. Lana Turner's song of \"My Man and My Mule\" is pretty funny. Other than that bit of humour, this is a classy film, meaning there's no down and dirty complicated anything... other than the relationship itself being complicated. The costumes and sets are really superb as well. This is such a simple film that I think it's fine for children to watch it. Although the ending is sad because life forces them to part ways again. Cedric Hardwicke showed everybody up with his sublime evil as the Prime Minister intent on keeping the Prince on track. ****SPOILER**** The ending is noticeably badly edited as it's said briefly that there's a bomb threat against the King if he returns to the throne, and this is why he chooses to go, to \"spare\" his son's life. So, I can only conclude that there was a scene edited out in reference to the bomb threat. Too bad that was edited out as it would have added much more emotional depth to the lovers parting again.Read more of my movie reviews at: http://pdmoviereview.blogspot.com/","But failed. The story is the usual slightly cliché one of a girl (who this time happens to be an actress) falls in love with a prince who later becomes a king. The girl, played by Lana Turner gives some beautiful scenes, and her opening number with her singing was awesome. Ezio Pinza has some very good lines to and gives a lot of his own numbers to show of his opera like singing voice. Debbie Reynolds was a stand out for me, she was wonderful in her role. She was the best in the movie. The script was poor, the costumes were wonderful, the back grounds like all MGM movies of that era were a fest of colorful delight! It had a lot of potential even if it was a little cliché, but somehow got lost during the middle and the end. Things happened, and you couldn't understand why, in other words it went a little to fast. There was no real chemistry between the actress and actors, there was no real connection either, and I was left thinking, why? The ending was stupid, it had no closure, no real conclusion it just left us with a lot of questions. While the movie did have good scenes, and had wonderful actresses, it just didn't cut out for me. If Hollywood were to remake this movie and give it a better script, I would not be angry.","Considering how badly it bombed on release, making a huge loss and with indifferent to negative reviews, was honestly expecting a worse film than 'Mr Imperium' turned out to me. It is a long way from great, struggling to muster average, but from what was heard you'd think it was one of the worst films there was (which it isn't).There are positives here. 'Mr Imperium' does look very pleasing, it's beautifully photographed with sumptuous costumes for Lana Turner and with serenely idyllic locations. The music is elegant and with enough energy and charm and the few songs, while most not exactly timeless, are pleasant, \"You Belong to My Heart\" faring particularly well.Ezio Pinza was my main reason for seeing 'Mr Imperium', being a fan of his beautiful, noble bass voice (one of the most naturally beautiful of any operatic bass along with Nicolai Ghiaurov), and he sings sublimely, despite being retired from opera and shifting to Broadway his voice is one that you can listen to for hours and never tire of. The best performance of 'Mr Imperium' however comes from Debbie Reynolds, in sprightly and charmingly perky charm as always.However, while Pinza sounds sublime and really tries hard with the acting (he actually was a good actor on the operatic stage) but he doesn't always look comfortable and it was like he was trying too hard. This may have been because a luminous but painfully miscast Lana Turner was so bland, like she was completely bored and didn't want to be there. Their chemistry is non-existent and a gross mismatch, sometimes bordering on unintentional creepiness, not because of the age difference but because Pinza is really trying to be animated and engage with Turner but she makes it very clear that she disliked Pinza and wanted to be elsewhere.Reynolds aside, the rest of the supporting cast struggle. Not because they are bad, can never accuse Cedric Hardwicke and Marjorie Main of being bad actors or anything, but because they have so little to do and are so underused. Barry Sullivan is so badly wasted here that his presence felt pointless. The direction is very routine, and the pace often plods.On top of that the script is at best insipid with not a memorable, funny or emotional line in the entire film. The story was so over-familiar and cardboard even in 1951 and fails to inject much spark apart from Reynolds and Pinza's singing. Lastly the ending is confused and, due to the unanswered questions feel it has, incomplete feeling.In summary, not disastrous as expected but barely average. 4/10 Bethany Cox"],"review-user":["sbibb1","JLRMovieReviews","rsoonsa","Boba_Fett1138","jjnxn-1","wes-connors","TxMike","bkoganbing","Doylenf","edwagreen","elleclarke11","PICMTN97","gkeith_1","writers_reign","MartinHafer","Byrdz","richard-1787","missrebeckah","slytherins_queen2","TheLittleSongbird"],"review-date":["11 January 2004","26 March 2009","10 September 2002","30 September 2006","8 July 2014","29 January 2009","14 July 2015","14 March 2011","4 October 2007","7 October 2007","12 October 2011","30 September 2007","5 October 2007","21 March 2011","2 July 2018","3 February 2017","20 June 2018","5 May 2008","13 March 2008","4 February 2017"],"review-rating":["6","7","6","7","3","5","5","2","1","3","6","2","5","5","4"],"review-title":[" Valliant Effort by MGM\n"," For Lana Fans Only???...\n"," Pleasant, albeit below normal MGM musical standards.\n"," Not sure why it's considered such a stinker.\n"," Mr. Improbable would have been a better title\n"," Arrivederci, Lana\n"," Not much story here, I mainly enjoyed it for a teen-aged Debbie Reynolds.\n"," Imperial Pretensions\n"," Easily forgettable but not a total failure...\n"," Mr. Imperium-Imperial Nonsense *\n"," Check out the Ages of these Actors!!!\n"," Horrible\n"," Fun and informative\n"," Missed Opportunity\n"," Not nearly as bad as I'd imagined.\n"," A year before \"Singin' \"\n"," A poor movie\n"," A sad, musical Cinderella story\n"," Had a lot of potential...\n"," Barely average but not a disaster\n"]}