{"review-url":["http://www.imdb.com/title/tt0082278/reviews"],"review-text":["I saw the Mogul Video VHS of this. That's another one of those old 1980s distributors whose catalog I wish I had!This movie was pretty poor. Though retitled \"Don't Look in the Attic,\" the main admonition that is repeated in this is \"Don't go to the villa.\" Just getting on the grounds of the villa is a bad idea. A character doesn't go into the attic until an hour into the movie, and actually should have done it earlier because of what is learned there.The movie starts in Turin, Italy in the 1950s. Two men are fighting, and a woman is telling them the villa is making them do it. One man kills the other, then regrets it, and the woman pulls out the knife and stabs him with it. She flees the villa, and after she's left a chair moves by itself (what's the point of that?), but when in the garden a hand comes up through the ground and drags he into the earth.From there, it's the present day, thirty years later. There's a séance that appears suddenly and doesn't appear to have anything to do with the movie. The children of the woman from the prologue are inheriting the house. The main daughter is played by the same actress who played her mother. At least one of the two men from the prologue seems to reoccur as another character too. She's haunted by some warnings not to go to the villa, but they all do, since if they do not use it, they forfeit it. People die. A lawyer who has won all his cases tries to investigate a little. The ending is pretty poor. Why was the family cursed? An unfortunately boring movie.There's an amusing small-print disclaimer on the back of the video box that reads \"The scenes depicted on this packaging may be an artist's impression and may not necessarily represent actual scenes from the film.\" In this case, the cover of the box is an illustration that does more or less accurately depict the aforementioned woman dragged underground scene, although there are two hands, and the woman is different. It's true, sometimes the cover art has nothing to do with the movie. I also recall seeing a reviewer who had a bad movie predictor scale, in which movies with illustrations on the cover instead of photos got at least one point for that.","Well, I'm an Italian horror big fan and I love movies from directors such Argento, Fulci, Bava Sr and Bava Jr, only to quote the most famous. \"La villa delle anime maledette\" is one of the most unknown movie of this genre, shot when this kind of cinema began its crisis that continues still today, and director Carlo Ausino sounds totally new to my ears (althoug he directed six movies... this is the price Italian directors have to pay to not work in Rome...) . But the film is not so bad. And it's absolutely not correct to talk about \"trash\". OK, the plot is not so original; it reminds me stuff like the Amytville series (the year is the same of \"Amityville Possession\" by Damiano Damiani) or \"Shock\", the last work of Mario Bava. But you have to think that this is the movie of a cinematographer (like Mario Bava movies); so the most important thing is the atmosphere, not the story or the characters; atmosphere very well created by the use of light and by the camera movement. The rest remain in the background. I think the movie works; not so good, but works; it's surely better than a lot of Hollywoodian production like \"the Haunting\" which have a bigger budget, but not bigger ideas...","Now, I LOVE Italian horror films. The cheesier they are, the better. However, this is not cheesy Italian. This is week-old spaghetti sauce with rotting meatballs. It is amateur hour on every level. There is no suspense, no horror, with just a few drops of blood scattered around to remind you that you are in fact watching a horror film. The \"special effects\" consist of the lights changing to red whenever the ghost (or whatever it was supposed to be) is around, and a string pulling bed sheets up and down. Oooh, can you feel the chills? The DVD quality is that of a VHS transfer (which actually helps the film more than hurts it). The dubbing is below even the lowest \"bad Italian movie\" standards and I gave it one star just because the dialogue is so hilarious! And what do we discover when she finally DOES look in the attic (in a scene that is daytime one minute and night the next)...well, I won't spoil it for anyone who really wants to see, but let's just say that it isn't very \"novel\"!","A group of heirs to a mysterious old mansion find out that they have to live in it as part of a clause in the will or be disinherited, but they soon find out of its history of everybody whom had lived there before them having either died in weird accidents or having had killed each other.You've seen it all before, and this one is too low-budget and slow paced to be scary, and doesn't have any real surprises in the climax. No special effects or gore to speak of, in fact the only really amusing thing about the whole film is the quality of the English dubbing, which at times is as bad as a cheap martial arts movie.3 out of 10, pretty low in the pecking order of 80's haunted house movies.","This cheap, grainy-filmed Italian flick is about a couple of inheritors of a manor in the Italian countryside who head up to the house to stay, and then find themselves getting killed off by ghosts of people killed in that house.I wasn't impressed by this. It wasn't really that scary, mostly just the way a cheap Italian film should be. A girl, her two cousins, and one cousin's girlfriend, head to this huge house for some reason (I couldn't figure out why) and are staying there, cleaning up and checking out the place. Characters come in and out of the film, and it's quite boring at points, and the majority of deaths are quite rushed. The girlfriend is hit by a car when fleeing the house after having a dream of her death, and the scene is quite good, but then things get slow again, until a confusing end, when the male cousins are killed together in some weird way, and this weirdo guy (I couldn't figure out who he was during the movie, or maybe I just don't remember) goes after this one girl, attacking her, until finally this other girl kills him off. Hate to give away the ending, but oh well. The female cousin decides to stay at the house and watch over it, and they show scenes of her living there years later. The end. You really aren't missing anything, and anyway, you probably won't find this anywhere, so lucky you.","Horror movie about a cursed house in Turin and the three relatives who inherit it. Two brothers and their cousin Elisa (who haven't seen each other since childhood) are brought together after their mother's death. They inherit her house under the condition that they live there together and never divide or sell the property. It's haunted and after many ghostly nightmares and some murders, Elisa finds a diary in the attic, learning that she is the sole survivor of \"the seventh damned generation.\"Yikes. That's quite a yard to swallow.The movie really stinks.Extraordinarily poor production standards. Bad amateurish music.Just horrible.","During a séance, a woman is warned by the spirit of her dead mother- \"DON'T GO TO TURIN....DON'T GO TO THE VILLA\". So what does she do? Well, naturally, she high-tails it to Turin, and heads straight for the villa. Said villa, which she and her siblings have recently inherited, is haunted by malevolent spirits who enjoy driving people nuts and turning lights red. By the time our dim-witted leading lady finally looks in the attic, you'll most likely be in a deep slumber. Who cares, though? You will miss absolutely nothing of interest, and any dream you may have will be infinitely more entertaining than this uninvolving, crudely dubbed Eurotravesty.3.5/10"],"review-user":["FieCrier","Cetra","brennan79","andybob-3","WritnGuy-2","arfdawg-1","EyeAskance"],"review-date":["17 December 2004","31 October 2006","7 January 2008","19 February 2007","6 December 1999","3 May 2014","22 July 2005"],"review-rating":["2","7","2","3","3","2"],"review-title":[" boring movie about a cursed family and a haunted house\n"," Not so bad...\n"," week-old spaghetti sauce\n"," Another snooze-fest with an ironic \"DON'T\" in the title (3 - 10)\n"," Quite Contrived and Bland...\n"," Just horrible.\n"," Grade Zzzzzzzzzzzzzzzzzzzzzzzzzzz................\n"]}