{"review-url":["http://www.imdb.com/title/tt0042210/reviews"],"review-text":["Utopia, made in 1950 in France, was the last film Laurel and Hardy produced. With the bad reputation the duo have for their post 1930's productions I was expecting this film to be awful. Although admittedly it isn't up to the standard of their \"vintage\" comedies I was pleasantly surprised. It's watchable, and in parts genuinely funny! And certainly the plot is of the same standard as you'd expect. Some gags are derivative from their earlier work, but when you consider this film was their first for five years after their last Hollywood produced film, \"The Bullfighters\", the routines are executed confidently as you'd expect from these professionals. Some scenes are not up to much, but the value of this film is that some scenes are funny, and as such, absolutely priceless. I particularly enjoyed the bedtime scene.I felt sad at the end of the film. Our heros are left on their own desert island. It's such a metaphor for the real life truth. Hollywood and audiences of the time had consigned the stars to a desert island of memories, and that was to become last image they portrayed in film. Ollie died seven years later and Stan died fifteen years later. Stan turned down an offer to appear in \"It's A Mad Mad Mad Mad World\" in 1963. What a shame that was - a colour film, only two years before he passed. However, his health probably wasn't up to much.These boys are probably the greatest comedy performers of all time, and although the movie is far from their true potential, it's still an honour to watch them appear in film for the last time, and touching on the echos of their towering talent.","This was Laurel and Hardy's last film and, of all their features, the one with probably the worst reputation. I can give it the left-handed compliment of saying, \"It is not as bad as you have heard it is.\" The boys are caught in a storm at sea but are saved when a submerged island rises up under their boat. Along with a few other misfits, they establish a cooperative society. Then, the outside world shows up, discovers uranium on the island and the rush is on. What is unique is the level of satire that is present in the movie's last third, even though it is genial rather than sharp. Laurel looks thin and old (he was, in fact, quite ill during filming), but gamely takes his pratfalls. There is plenty of the usual shtick between Stan and Ollie. I find it funny no matter how many times I've seen it so I laughed several times. For L&H fans.","After some real clunkers in the '40s, it's nice to be able to say that L & H's final film is a good one.Okay, so they look pretty old and they are the only members of the cast who haven't been dubbed, but this film is highly entertaining and filled with vintage Stan and Ollie humour.  The concept of them building a home on a deserted island is literally previously unexplored territory and there is an effective underlying message about how a 100%-tolerance society can result in anarchy.It might take some getting used to but it's still a film well worth seeing.","I have read so many negative reviews of this film that I expected a really horrible film. Surprise, surprise. The film is actually not bad at all. Sure, Stan does look ill in some shots but the boys are still funny and the story is engaging enough. I love the fact that the film was shot in Europe. It gives it a fresh look that is absent from their older studio-bound films. Some gags are better than others(the loading of the boat is quite funny), and the whole premise of the boys creating a country without taxes and laws works quite well. In a very funny moment, Ollie declares himself president and names the other 3 original inhabitants to key posts, relegating poor Stan to the status of \"the people\". The supporting cast are all dubbed, but this does not hinder the film. What doesn't quite work is the whole sub-plot about the sexy French singer and her fiancé. They could have cut that down a bit. Overall, not bad at all. If you're a L&H fan do yourself a favour and give this film a chance.","The boys last film is not the clunker that many would have you believe. There are numerous scenes that made me laugh out loud, especially the scenes involving Stan's pet lobster.  The style is geared toward more gentle slapstick and philosophical humour that suits the aged stars perfectly.All in all a bright and gay movie with pleasant scenery and jolly characters.  Give it a try, it's far better than the big studio pictures of the 40's in it's revised approach to the comedy duo.","***SPOILERS FOR THE SPOILED***'Utopia' (AKA 'Atoll K') is widely reviled by Laurel & Hardy fans. Being a fan of the Boys, myself, I had to find this stinker and see what was wrong with it. For the most part, very little is wrong, except for atrocious overdubbing, and Stan's appearance. He filmed this movie while in the throes of illness, and it really shows. He looks horribly drawn - actually, he looks drawn and quartered - but he soldiers on, playing the man-child character we know him best as. Similarly, while Babe Hardy is definitely aging and carrying more weight than in the team's glory days, his characterization is just as wonderful as ever.There are plenty of instances in this film where classic L&H humor takes over, such as the dinner scene in the cabin of the boat, or the cargo-loading sequence. The Boys are consistently in-character and deliver their lines with their usual spark.Knowing the story of the production of Utopia, it's amazing to me that they managed to grind out a movie, at all, let alone one that stayed true to Laurel & Hardy's long-established characters. As bad is it is, Utopia captures, for the last time on film, the essential sweetness of the Boys, and while I wouldn't recommend it as a 'great' Laurel & Hardy film, I wouldn't warn people away from it.My only real problem is with the ending. I'm one who does get tired of the stereotypical happy ending, but this is a COMEDY. The bad guys should get their comeuppance, and the good guys should win in the end. That's the way of comedy. Even the Great Stone Face, Buster Keaton, played to this rule. Though his characters sometimes wound up losing the game, you got the sense that they weren't daunted or hurt by it. In Utopia, our sweet girl winds up marrying the smarmy jackass she was running from, our stowaway stone mason winds up with his dreams crushed, building fences, the man who only wanted a country to call his own winds up killed and eaten, and the Boys themselves are stranded on an island with all their food and supplies stolen. It's just too sad, for a comedy.This film is usually found in the bargain bin, and it's worth that kind of price to see the Boys' last film, together. Don't expect miracles, but I found quite a few laughs in it.","This film has the unfortunate distinction of being Laurel & Hardy's last film together.  Though, it is true, you can see how ill Stan was and how age was ravishing both, it is NOT true that they had lost their charm.  There are bits in this film that I found every bit as funny as those in the L&H heyday.  Give it an honest try.  I think you'll find this movie is unjustly maligned.","For new L&H fans, Stan and Ollie's appearance may be a shock. Stan looks VERY thin and has noticeably aged. Ollie, in contrast, has gained a LOT of weight.If you can overlook their appearance, and the slow moving subplot, Atoll K does have some good comedy routines. However, their more elderly appearance does hamper what would otherwise be good gags. You just can't laugh at Stan while he is dealing with an inflating raft in the ship's cabin. He looks like he's truly in agony, and you want to help him instead of laugh at him. Also, the film is poorly edited. The original movie was 90 minutes long, but when re-released, it was shortened to a more tolerable 60 minutes. Most of the footage taken out was from the subplot, so taking out the extra half hour improved the movie.While \"The Boys\" had more freedom to write gags and dialogue, nobody else on the crew had any idea what to expect in a L&H picture. Confusion and the illness of Stan and Ollie caused the picture to take an entire year to make! Not long after Atoll K was released, Ollie went on a diet and lost a LOT of weight, but it was too late.","The movie is not halve as bad as people want to make you believe it is.What is the reason why so many people hate this movie? Is it because it's Laurel & Hardy's last one together and it's not their best? Or is it because of the lack of Laurel & Hardy regulars? Or because it's not made by the Hal Roach studios or 20th Century Fox? Definitely true that this movie is not a successful attempt to revive Laurel & Hardy and bring them to the '50's. It's also definitely true that the movie is far from their best but honestly, the movie still entertains well, making this movie also far from their worst. Not the most worthy 'goodbye' movie imaginable but an entertaining and suiting goodbye nevertheless. Both of them retired from movies after completing this one.The movie still features some great slapstick moments and the chemistry between Laurel & Hardy is obviously still very much present. It also makes this movie better than most of their movies together from the '40's. Quite a surprise that the slapstick humor still works out as great as it does, considering that the days of slapstick comedy had been over, ever since the '30's.The story is perhaps not as entertaining as it could had been and it features too many sidekicks and characters, with as a result that the movie looses its focus on the boys at times. A shame, because they are still the ones that really carry and make the movie.Sad to see in what poor form Stan Laurel was at the time of making this movie. He really looked ill and old, which he also of course was. He was well over 60 years old already. But after a surgery he fully recovered and still lived for another 15 years, before dying in 1965, 8 years after his good friend Oliver Hardy.An entertaining, though not perfect goodbye to the boys, Laurel & Hardy and the end of 3 decades of fun, humorous, quality slapstick entertainment of movies that are still being watched and loved by people all over the world.7/10http://bobafett1138.blogspot.com/","Probably the best Laurel and Hardy film since 1939's \"The Flying Deuces\", and their last motion picture appearance.   Better than the generally unfunny Fox studio films of the 1940's.   Its a somewhat underrated European-style farce with a mild social commentary about taxes, governmental control/interference combined with plot about Stan inheriting an island and eventually trying to setup an island country lacking in governmental controls.   There are gags that will remind you of earlier L & H films and you can forward through the tedious love interest plot which seems tacked-on and is thankfully short.   Overlook the generally annoying Euro-cast (though Max Elloy as the stateless man is OK), terrible dubbing, and Stan's haggard appearance and there are some laughs to be found.  Get the DVD put out by Platinum Corp., which is way better in picture quality than the SLP mode public domain videos that have been available to this point. Just the improvement in picture quality was enough to make this film a lot more enjoyable.","Not since Bette Davis's 1933 vehicle \"Ex-Lady\" have I seen a film that was so much better than its star said it was! Most of the bum rap \"Atoll K,\" a.k.a. \"Utopia,\" a.k.a. \"Robinson Crusoeland,\" a.k.a. \"Escapade\" has got over the years has come from the horror stories Stan Laurel told of its production. Given that he suffered a stroke during filming, looked like death warmed over through much of it (from the opening two-shot of them together you'd never guess that Laurel survived Hardy by eight years) and was subsequently diagnosed with diabetes (once he adjusted his diet accordingly he restored himself to health), one can understand why Laurel didn't think this film was the most pleasant experience of his life. Yes, it's flawed: the cheapness of the production shows through, the dubbing is awful and Laurel and Hardy were too old to do the energetic slapstick of their greatest films. But it's still genuinely funny, and Léo Joannon's story introduces elements of political satire (sometimes libertarian, sometimes communalist) one would expect to see from more socially conscious comedians like Chaplin or the Marx Brothers but never from Laurel and Hardy. The film deserves credit for being different (though its debt to the Ealing Studios' classic \"Passport to Pimlico,\" made just a year earlier, is pretty obvious) and for integrating the Laurel and Hardy comedy into a rather edgy context completely different from anything they'd used before. This isn't a great movie, but it's certainly better than the eight dreary ones for Fox and MGM they'd made in the early 1940's. I suspect only the film's technical crudity kept it from earning the cult following among anti-establishment baby-boomer youth the Marx Brothers' \"Duck Soup\" acquired in the late 1960's/early 1970's.","In their final movie together, Laurel and Hardy land on an island and try to establish their own society, but things don't quite go as planned after uranium is discovered on the island. \"Atoll K\" (also known as \"Utopia\") has the usual sorts of things that one would expect in a Laurel and Hardy movie, what with the various mishaps and things. It's surprising to learn that this flick was from France, but I'm sure that these guys are loved the world over.All in all, this is a good lesson about what might happen when one tries to form a society. Stan and Ollie will definitely live on in the annals of comedy forever.","This was part of a 3-DVD box-set, and it came with the Laurel and Hardy shorts Mud & Sand, Just Ramblin' Along, Oranges and Lemons, and the Three Stooges ones Brideless Groom and Sing a Song of Six Pants; it also came with another feature, Flying Deuces. The disc this was on came with The Tree in a Test Tube & Malice in the Palace. I haven't watched an awful lot of the duo, and other than the aforementioned ones, it has been years since I did. Not sure why this has such a low rating; it is genuinely funny and clever at its best(honestly, few of the light, goofy and, at times, cartoon-style slapstick gags fall flat), and it seldom, if ever, drags, for the 82 minute running time. It makes fun of politeness, taxes, and other everyday subjects, in spite of the unusual plot of a deceased eccentric uncle(always popular) leaving them an island. Inbetween clumsiness, knocking stuff over, falling, and other natural occurrences that are not presented as if they hurt, weepy Laurel(who looks so old and worn here) and dominating Hardy also explore social issues and government. Is that a good thing? Well, a lot of the way, the treatment of it is great. I don't think they quite keep up the quality all the way, though. Near the end(when this gets \"big\", with \"action\", as expected), this gets somewhat unrealistic, employs a sort of deus ex machina, and the conclusion has darkness to it. The FX are decent. Editing and cinematography are fine. A nice amount of laughs, and not boring. I recommend this to big fans of the two. 6/10","Stan Laurel (1890-1965) and Oliver Hardy (1892-1957) are together in film for the last time in Atoll K (1951), which is also known as Utopia.This comedy duo, that had the thin Stan and the heavy Ollie, worked together as a team since 1926 (even though they appeared together in a movie five years earlier).And this was their last collaboration.In 1955 the pair had contracted with Hal Roach Jr., to produce a series of TV shows based on the Mother Goose fables.Unfortunately Hardy's stroke prevented that from happening.Also Billy Wilder had a plan to make a film with the boys.So in the early 50's they went to France to shoot this French/Italian film, which took a whole year to make.In the beginning the pair is in the offices of a London law firm, where Laurel is to inheritance left by a wealthy uncle.He inherits an island, so the boys head for the island on a rickety yacht.On the yacht with them they have a stateless refugee and a stowaway.A storm breaks and they shipwreck on an atoll, which they name Crusoeland.The island gets a new resident from Chérie Lamour, a nightclub singer who is fleeing her jealous fiancée, a naval lieutenant.Hardy becomes the president of the island while Laurel represents \"the people\".The place seems like a paradise at first, a place without taxes or legal fees.But then Chérie's fiancée finds uranium deposits from the island.People keep coming from all over the world.The new immigrants start a rebellion and want to hang the original inhabitants.Is this the end of Laurel and Hardy? As the movie's director is credited Léo Joannon, but much of the work was done by the blacklisted director John Berry.This movie was painful to make for Laurel and Hardy.They both had some major health issues.Stan even required hospitalization.But the boys still got their job done, and what a great job they did.The on-screen chemistry is still there, and the capability to make 'em laugh.The leading lady of the movie is played by French singer/actress Suzy Delair (b.1917).She does a wonderful job as Chérie Lamour.The rest of the casting is also good.Max Elloy plays Antoine, the cook.Adriano Rimoldi is Giovanni Copini, the stowaway and a bricklayer from Italy.Luigi Tosi is Lt. Jack Frazer.The movie has pretty much of good stuff and great gags.It's funny when the boys are enjoying a meal and Stan's food keeps disappearing from his plate.The stowaway keeps reaching down and taking it.Stan blames Ollie and that means an argument.The storm sequence is amazing to watch.Stanley struggles with the life raft, crying and screaming for help.And he shrieks when those bats arrive.The ending is pretty much a perfect ending for a Laurel and Hardy movie.Boys have arrived to the right island, when their land and supplies are impounded for failure to pay back taxes.Ollie says to Stan \"That's another fine mess you've gotten me into.\"And what does Stan do? He starts to cry, of course.This movie is better than most people give it credit for.Of course the boys came up with better than this in their earlier years.One of those nine stars is for the life and work of Laurel and Hardy.There will never be a comedy team like Laurel and Hardy.","As other people said, I'd like to have never seen the Couple in a movie like Atoll K. But things happened and, as a L&H fan, I'm curious about anything they've done. Something more: I wish I could have seen, studied, touched anything still existing in the world about them! Anyway, mainly, my approach is \"study\": Not only looking at their movies for an hour of fun, but going inside an historical phenomenon, to know anything concerned. With that idea, if I can be sad - from one side - looking at them in such a bad shape, ill and with a very old-man-face, not the babies' faces we were accustomed with, from the other side I disagree against the need to express a (bad) evaluation:  this is a rarity, something we haven't to worry about in terms of evaluation.   It worths 4, 5 or more? ridiculous !!  This is only, and for all, a moment of History.  Something not to forget.  Wish I could find the 100% uncut edition! Kind regards to everybody! Ennio","OK so it's not great either, but only because of how great Laurel and Hardy have been in the past. If this film received a total overhaul, with picture quality enhanced, add new dubbing to the badly dubbed voices and added a nice unobtrusive background music then this film would truly start to take shape. As it is, it does have it's problems. People do slate it for how old the boys look. Quel surprise! they were in their 60's and had led a 'life'. However, to me, they still came across as having bucketfulls of charm, and while this doesn't even come close to tickling the feet of their classics( I gave it a 4), it's worth a watch simply because it's them. To think otherwise would be impostorous!!","Stan and Ollie's farewell falls far short of the boys in their prime, it's true, but the film is nowhere near as bad as its reputation suggests. From what I'd heard about it I almost didn't want to watch this film  in much the same way as you want to remember a loved one hale and hearty rather than eaten away by cancer  but I braved it anyway. The print is atrocious with blurry visuals and poor sound, but even the poor picture doesn't disguise how ill and gaunt poor Stan Laurel looks. Apparently he had dysentery and prostate problems during filming, which accounts for his appearance. Ironically, Oliver Hardy, who would be the first of the duo to pass away, looks the better of the two, although it's plain to see that he'd piled on a few pounds since their heyday.The film's storyline is fairly ordinary fluff about the boys travelling to a deserted island Stan has inherited and establishing a utopian society that works perfectly until the population count increases beyond single figures. There are a few glimpses of the old style from the boys but any enjoyment is tempered by the knowledge that you're watching ageing men trying to recapture something that they no longer possess. The rest of the cast are French, and the dialogue they speak is dubbed into English, which makes it visibly difficult for Laurel and Hardy to play off them they way they used to with familiar faces of old.This film probably isn't one you'd want in your collection if you're a Laurel & Hardy fan, but neither is it one that should necessarily be avoided at all costs.","By 1951, Laurel and Hardy were showing their age. Their last film together, \"Utopia\", to my mind was a sad send off for the boys who were so brilliant in films like \"Way Out West\" where they were not only funny but broke out into song and dance in creative fashion. There are glimpses of their trademark humor here, but by and large the film failed to satisfy this viewer whose memories of Stan and Ollie recall an earlier vintage.Perhaps part of the problem here is saddling the duo with cast members who share close to equal billing and screen time. Max Elloy as the cook/mechanic, Adriano Rimoldi as the man without a country and Suzy Delair as the nominal love interest for all of them don't have enough personality among them to complement the story in a fulfilling way. Delair's Cherie in particular can't make up her mind about old boyfriend Frazer (Luigi Tosi) and by the end of the movie winds up flip flopping yet again.Most of the film's humor takes place in the first third of the story, as Stan and Ollie learn of their inheritance from Stan's uncle who has passed on. The obligatory dismantling of the fortune by way of government fees and taxes leaves them only a derelict yacht in Marseille and an island in the South Pacific. That set up at least allows them to fashion their own government on the island that doesn't rely on laws or taxes of it's own. The inevitable onslaught by the outside world following the discovery of uranium is enough to spell doom for the island's Utopian ideal, which it lost as soon as it became Crusoeland.There are redemptive moments few and far between like the bit with the life raft and Stan's friendship with a pet lobster. Yet even as far back as 1951, crass commercialism reared it's ugly head with an extreme close up of a bottle of Welch's Grape Juice. You'll have to search long and hard for such a blatant product endorsement in another film of the era. Of course today, virtually every film displays a branded name.I'd like to be more positive about \"Atoll K\" as my admiration for Laurel and Hardy's body of work is very much one of appreciation. They provided loads of laughs while I was growing up, and still do today. At least with their earlier films, one didn't have to see an optimist.","Oh, why did it have to end like this? Laurel and Hardy's last film, from the crudely cranked-up Cuckoo theme (with erroneous credit to Hal Roach) to the closing \"Nice mess\"/\"I couldn't help it\" schtick, this is the duo as a grotesque parody of themselves. In between, their relationship is now solely constructed of uncertain acting, asinine dialogue and half-hearted slapstick. People slate King of New York, but Chaplin's final bow-out was nowhere near as undignified as this.What really hurts to someone who loves Laurel and Hardy is the appearance of the two comedians. The video cover I'm holding shows them at their prime, all boyish smiles and glowing skin, with a blurb on the back that reads \"The photograph on this sleeve is for illustrative purposes only and does not necessarily reflect the content of the film.\" Necessarily? It doesn't even come close. The actual film sees them at least fifteen years older than the photographs that adorn the sleeve, with Ollie distressingly overweight. This is not humorously, or comically, fat, as he would normally appear, but ill looking and on the verge of obesity. He would be dead seven years after this film was made, after a series of strokes. Stan, meanwhile, suffering a prostrate problem and dysentery, looks ghoulish as his weight has plummeted drastically. Every time something bad happens to him, such as getting squashed between a lifeboat and a table, you fear for his life. Even Ollie giving him a traditional slap makes you terrified he could be killed. He would last for another fifteen years after the completion of this film, eventually passing away from a heart attack in 1965. It's upsetting to think of such cherished performers growing old and dying painful deaths. And it's distressing watching their deterioration, both in health, and in performance, on screen. When I, and, I'm sure, almost everyone else, likes to think of Laurel and Hardy, I think of Way Out West, Busy Bodies or Our Relations. Seeing them in such physical ill health and performing dire routines at the dog-end of their career is a blight on my happy memories of them.The warning signs are clear right from the opening credits, which list not only four writers, but also someone to come up with the concept, and a credit for \"gags\". So if Monty Collins was writing the \"gags\", then what were the other four writing? And in that case, why was Monty Collins paid a fee, given that there's no evidence of a single \"gag\" in the whole film? Over 40% of the movie is spent travelling to the eponymous island, during which we experience some of the most painfully unfunny scenes the boys were ever involved in. When I saw the bat scene I wanted to curl up and die, so great was its childish ineptitude. Yet what kills the film stone dead is that all of the support cast are dubbed, unable to speak English. Not only does this make the film disjointed, but also it severely depletes Stan and Ollie's reactions to their co-stars. Flatly directed with appalling film stock and absolutely atrocious editing, this totally belies the rumoured $2 million that was spent on it. Frankly, it looks terrible, and while a DVD release might clean up the picture, the sound and image quality is vastly inferior to any of their Hal Roach work.Stan and Ollie's \"friends\", Giovani and Antoine are charisma-free bores who stand out greatly against Laurel and Hardy's outdated repertoire. This is another major problem with the film, in that none of the supporting characters are funny, or keyed in to the boys' innocent mentality. The dubbed harshness shown to L & H (\"you - the fat one\") makes them stand out as isolated social misfits, rather than loveable sub-anarchists. There is evidence of some darker political satire - though Duck Soup this ain't - and the concept of an island with no rules is an interesting topic. Perhaps more relevant now than it ever was, a film that looks at the problems of immigration and the American constitution suddenly becomes most topical in 2003. Sadly, however, beyond an amusing scene where Stan is elected \"the people\", this doesn't really go anywhere. And this somewhat black humour does have its harsh edges - or is a Laurel and Hardy movie where rape is directly implied and Stan threatens a man with a bottle, only to accidentally glass someone in the face, your idea of a good time? After all the years of Stan and Ollie sharing a bed, we also get a definite reference, with Stan accidentally kissing him - Ollie wipes off the kiss in disgust. Also worrying is the implication that Stan and Ollie's illegal immigrant friend, Antoine, ends his life being eaten by a lion. Mind you, I never thought I'd see a Laurel and Hardy movie where they were due to be hanged, either. The need for the intrusive and unfunny narration is a further pointer to how messy the whole thing is, with the American release (the same version available on video) hacking out 16 minutes in a vain attempt to improve it.Almost completely unwatchable, this horrifically made, relentlessly unfunny movie serves only to tarnish the reputation of Stan and Ollie - avoid at all costs.","ATOLL K was the final film Stan Laurel and Oliver Hardy made. Produced in France in 1950, it was the first film the team had made in about five years. Production on the film was chaotic, with language barriers (Laurel and Hardy were among the few on the set that spoke English), illnesses (Stan's being the worse), and a somewhat incompetent director (Léo Joannon spent three days filming a lake that he thought looked nice).The basic premise is that the Boys have inherited a yacht and an island from Stan's late uncle. The duo journey to their island, but get caught in a storm along the way, eventually landing on an atoll. Joining them are stateless man Antione (Max Elloy), Italian immigrant Giovanni (Adriano Rimoldi), and Chérie (Suzy Delair), a nightclub singer running from her workaholic fiancé. Pretty soon, the rest of the world takes interest in the atoll, leading the castaways to form their own government - with no laws! This film can be enjoyed if one gets beyond its obvious flaws: 1. Health-wise, neither Laurel nor Hardy was particularly well during most of production, and it shows. But one adjusts to their appearance after awhile. Besides, their performances are still top-notch. 2. The dubbing in the English-language print is atrocious. Tons of studio 'noise' can be heard in the background. Incidentally, the great Paul Frees did the English dubbing for Max Elloy's character.3. The plot gets a bit dark during the film's second half, with the comedy taking second place to the story. However, the first half of the film is quite enjoyable. Unlike some of their previous efforts for 20th Century Fox and MGM, Stan and Ollie are entirely in character here. And there is enough fresh material to keep one invested. And the second half does have some memorable bits sprinkled in.Check the film out for yourself and form your own opinion. One word of advice: try to get the uncut 100 minute version of the film. The plot makes more sense in that print than in UTOPIA, the American edit.","I just watched Atoll K-Laurel and Hardy's last movie together and known here in the states as Utopia-on Internet Archive expecting to see some extra footage since the IA version had a running time of 2 hours and 21 minutes. Turns out that it's basically the same version I previously watched on the bargain basement VHS tape from Goodtimes Home Video that ran an hour and 23 minutes (with the exception of no product placement of the Welch's Grape Juice label being inserted when a bottle was shown) with the rest of the running time devoted to dark blank space. While Stan does look like he might be dying anytime soon, he still performs fine physical comedy with Ollie during much of the first 45 minutes or so. Then the plot of taking a yacht with a stowaway and a man with no country aboard-not to mention a charming female French singer also coming to inhabit an uncharted island they all end up on-takes over with eventual complications that pretty much bogs the comedy down and never really recovers despite the familiar ending of Ollie saying for the last time to Stan, \"Here's another nice mess you've gotten me into!\" before Stan cries uncontrollably before the fade out. In other words, if you're a die-hard Laurel and Hardy fan, this movie is recommended for you to see at least once. Anyone else wanting to get familiar with this classic comedy team should seek their earlier work they did for Hal Roach from the '20s up through 1940 when they completed their final Roach film, Saps at Sea. Come to think of it, even some of the L & H Fox flicks (have yet to see the two they made for M-G-M) from the '40s are better than this one...Update-8/29/09: Just watched some missing scenes that appeared in the Italian version on YouTube. Cherie sings in one and has a conversation with the Captain. In another, that Captain's wife pulls a gun on Cherie. In one more, Giovanni explains why he left his country with a flashback scene. Stan is dubbed in high pitch here!","It´s true that Stan Laurel was sick when it was made and it maybe would have been better if this film never had been done. Still there are not so bad and some scenes are  funny.Rating:2,5 out of 5","Any real fan of Laurel and Hardy will want to miss this movie. It is so very, very bad, it is actually painful to watch. I've seen it two or three times now and it is always worse then the last time I watched it.Not only does Laurel look so sickly, but the story is a mess, the directing is ham fisted and there is not a single solitary laugh in the whole terrible mess of a movie. It is not worth seeing let alone buying no matter what length it is, since there are a few versions out there.I am not slamming Laurel and Hardy, I love their movies that is why I vow never to watch this thing ever again. It is a pity that this is not one of the \"lost\" Laurel and Hardy films. Miss it, I warn you!"],"review-user":["captain_obda","MikeF-6","G.Spider","Alberto-7","Chris-773","knsevy","maestro-1","mkaiser-1","Boba_Fett1138","wsureck","mgconlan-1","lee_eisenberg","TBJCSKCNRRQTreviews","Petey-10","ennio.bertona","Steamcarrot","JoeytheBrit","classicsoncall","The_Movie_Cat","mtw120","tavm","anton-6","tommartin4002"],"review-date":["27 September 2003","16 May 2005","23 October 1999","26 October 2000","4 December 1999","3 December 2003","9 July 2002","15 July 2005","7 February 2007","19 February 2001","25 September 2007","19 April 2006","28 June 2010","8 April 2010","14 September 2000","5 August 2006","24 November 2008","26 February 2006","1 February 2003","15 August 2014","13 September 2008","30 July 2001","21 March 2004"],"review-rating":["9","6","6","5","6","7","7","6","6","9","4","5","3","7","4","6"],"review-title":[" Stan and Ollie's last film makes for a fond farewell\n"," Doesn't live down to its bad rep\n"," Why won't people give this a chance?\n"," Laurel and Hardy's last film is actually not too bad\n"," Far better than you'd think.\n"," Not as bad as reputed\n"," Unjustly maligned\n"," Atoll K enjoyable if you make a few allowances...\n"," Better than currently given credit for.\n"," Last but not least\n"," Quite good, and an appropriate sendoff\n"," utopia just might be unattainable\n"," I would care to repeat it\n"," The last adventure of Stan Laurel and Oliver Hardy\n"," Sad to see Laurel & Hardy in such a bad shape, but each one of their movies must be approached as an historical study.\n"," It's not that bad\n"," Stan & Ollie's Farewell\n"," \"When you get to the island, you better see an optimist.\"\n"," \"Nothing to do from now on but eat and sleep.\"\n"," Not Nearly as Bad as Some Have Claimed\n"," Atoll K-or Utopia-was an interesting, if uneven, final Laurel and Hardy movie\n"," Not good but worth watching.\n"," Don't bother seeing this one!\n"]}