{"review-url":["http://www.imdb.com/title/tt0067445/reviews"],"review-text":["Luchino Visconti's \"Death in Venice\" is a masterpiece of utterly haunting beauty that will capture the imagination of anyone interested in the screen's capacity for breathtaking images. It is a poignant tragedy based on Thomas Mann's classic novella of the same name. Visconti has captured many of the essential qualities of the book and employed a superb visual style (with the assistance of the great cinematographer Pasqualino DeSantis) for a story which is essentially an interior one. It is about the struggle within the soul of a man, Gustav von Aschenbach, a composer vacationing in the Venice of 1911.In Mann's book Aschenbach was a writer, but Visconti asserted that the book had been inspired by events in the life of Gustav Mahler, whose music, mostly the haunting adagietto of his Fifth Symphony, is used as background (and foreground) music, helping create an almost tactile mood of melancholy.Dirk Bogarde plays Aschenbach, a man possessed by feelings of failure, haunted by the grief he and his wife (Marisa Berensen) shared over the death of their daughter. He is a man on the precipice of emotional collapse who finds both redemption and destruction in the contemplation of beauty. \"The creation of beauty and purity is a spiritual act.\" God and composers are alike.In this film beauty becomes incarnate in the form of a young Polish boy vacationing at the same hotel, the Hotel des Bains on the Lido. The boy's stately mother is played by Silvana Mangano. The long-haired blond boy is Tadziu, aged 14, played by the Swedish Bjørn Andresen. Aschenbach is smitten by, then obsessed with, the boy's beauty, in a manner that is more spiritual than sexual, but which must also contain a good deal of sublimated sexual longing. At first he merely steals opportunities to look at the lad. They never speak. Gradually he starts to seek him out, self-destructively spurred-on by the boy's coquettishness and knowing glances. Bogarde makes the character's longing as tangibly moving as it is ultimately pathetic.All this takes place in a misty Venice dense with metaphorical gloom and a mysterious plague (cholera) carrying death to its inhabitants. In one horrifying scene a barber \"re-makes\" Aschenbach's face so that it is both a grotesque parody of youth and an ominous death mask.Visconti's skill in recreating lush period detail, to paint family-album poses of aristocracy, to make beauty seem dangerous, to underline the complexity of human psychology, are all in evidence here. The color photography by Pasqualino De Santis, and the costumes by Piero Tosi are excellent.The ending of the film is unforgettable: Gustav languishing on the beach, the Polish folk song in the background, the boy Tadziu in the water turning into an angelic apparition with extended hand. Overwhelming!I cannot imagine a better film ever being made of Mann's great and essential work.","Turn-of-the-century Venice is depicted in all its elegance and decay through the eyes of a composer who knows he has little time left to live.  The composer is obsessed not just with beauty, but with the ideas behind beauty, and his theories are slowly proved wrong when he finds himself infatuated with a beautiful teenage boy.  He becomes obsessed with the boy and amidst the backdrop of a city quietly dying with a plague, he simply observes and ponders, trying his best to keep his desires at bay.The core of the film is in Dirk Bogarde's performance.  As there is little dialogue in the film, he must act with his eyes and through his mannerisms, and he never falters.  In the reflection of his eyes we see beauty as it is distinguished in the depths of all of our souls (well, those of us who have souls!).  We see the awe, the pain, the fever, the fear, the desire and the ultimate surrender all in that forlorn face.The music (most of it by Gustave Mahler) also reflects all this, and Visconti's incredible photography of the decaying Venice pinpoints the end of an era in a way that is both dreamlike and unsentimental (despite the romantic quality of the film).The film is slow and langorous, like the hush of the ocean sweeping the shore.  For those who like the visual quality of dreams and the somber romanticism of adagios, this film will be something to cherish forever.","I first saw \"Death in Venice\" 1971) about 15 years ago, found it profoundly moving and often thought about it. Watching it again few days ago, I realized that it is close to the top of the great works of cinema. With hardly any dialog it captivates a viewer with the beautiful cinematography, the fine acting, and, above all, the Mahler's music without which the movie simply could not exist.\"Death in Venice\" is a stunning Luchino Visconti's adaptation of the Thomas Mann novella about a famous composer (in the novella he was a writer but making him a composer in a movie was a great idea that works admirably) Gustav von Aschenbach (loosely based on Gustav Mahler) who travels to Venice in the summer of 1911 to recover from personal losses and professional failures. His search for beauty and perfection seems to be completed when he sees a boy of incredible divine beauty. Ashenbach (Dirk Bogard) follows the boy everywhere never trying to approach him. The boy, Tadzio, belonged to very rare creatures that own an enigmatic and inconceivable power which captivates you, enchants you, conquers you and makes you its prisoner. Ashenbach became one of the prisoners of Tadzio spellbinding charms. He became addicted to him; he fell in love with him. Was it bless or curse for him? I think both. He died from unreachable, impossible yet beautiful love which object was perfection itself. The last image Ashenbach's eyes captured was that of the boy's silhouette surrounded by the sea and golden sun light. Nothing could compare to the beauty and charm of the scene and to take it with you to the grave is the death one can only dream about. If he could, Ashenbach probably would've said, \"I was able to witness one of the faces of perfection, I could not bear it but I was chosen to learn that it exists here, in this world and I can die in peace now because it did happen to me.\" Unforgettable music, Gustav Mahler's haunting adagietto of his Fifth Symphony found perfect use in a perfect movie. It reflects every emotion of a main character - it sobs, it longs, it begs for hope, and it summarizes the idea that once you are blessed to encounter beauty you are condemned to die. I may come up with hundreds movies that use classical music to perfection but nothing will ever compare to \"Death in Venice\". I dare say that Mahler's music IS its main character - it would change and sound differently depending on what was happening on the screen. It sounded triumphantly when Ashenbach returned back to Venice, to what he thought would be his happiness but turned to be his death. It sounded gloomy when he first entered Venice from the sea. You can hear so many different feelings in it - tenderness and adoration, confusion and self-loathing, worship and melancholy, but always - LOVE that gives the purest happiness and breaks the hearts (literally). The movie for a viewer is similar to what the boy was for the aging composer/writer/Artist. We are enchanted and captivated by its power and beauty as much as Achenbach was by the boy's mysterious charm.","\"Slow\", \"slow\", \"slow\"... I read many people complain \"it's slow\"... slow what? This movie takes its time. All the most beautiful things in life take time. When you make sex with your girlfriend would you try to make it last five minutes? No you would like to make it last the whole night. When you eat good food in a good restaurant would you like to finish it in two minutes? No, you sit down, enjoy the place, the food, the company and the wine. When you visit an art museum, would you rush through the rooms? No, you would move slowly, pay attention, and stop at the artworks that mean more to you. So why should a movie be different?If you want speed, then eat at McDonald's, rush in the tube, watch TV commercials, and pay a prostitute for a 5 minute work.If you are looking for real emotions, deep feelings and thoughts that will last in your memory and heart for a long time, then you don't want to miss this movie.One caveat: don't go watching it for the gay theme. This movie isn't about gay love, if you look at it through this point of view, it will let you down completely. This movie is symbolism from beginning to end, it does not speak of what you see. It speaks of the struggle of the artist to reach the beauty, so close, always unreachable, and, like another reader perfectly commented, so inevitably connected with death, because the only perfection that a living being can ever attain, is in the death. If you look at the movie from this point of view, it will show to you for what it is: a complete masterpiece, from beginning to end.","Luchino Visconti's 'Death in Venice' is one of the most misunderstood masterpieces of cinema. Based on Thomas Mann's 1913 classic novella of the same name, the film not only capture the quintessential of the novel but also reinforce a powerful questioning through superb visuals. Adapted by Mr. Visconti himself who decided to focus on the Venice chapter only as well as to modify the occupation of the main protagonist, Gustav von Aschenbach who becomes a music composer (highly inspired by the composer Mahler), the film was also inspired by other Thomas Mann's novel like 'Doctor Faustus' or by Marcel Proust's writing. Often reduced and presented as a decadent film in which homosexuality and pedophilia are the main themes, the novel like the movie deals in fact with a much more complex and powerful dynamic.Indeed the film is based on an equation between Death and Beauty as an aphorism for Perfection and in which the results is Time (or the lack of it). Perfection, Beauty is a chimer, pursuing it is pursuing Death as Time is passing by. At first von Aschenbach does not understand why the perfection of the form in his musical composition does not lead to the perfection of his symphony and therefore lose himself in a quest for Beauty following the young Tadzio as not only a symbol for this ultimate Beauty / Perfection but also as the Mask of Death. In this Venice, marked by Death and cursed by the plague, the Time is running out and the fascinating quest for Perfection finally appears to be a dangerous game to play.All the notions that build up to the main questioning are revealed during this quest for Perfection and this race against Death. The notion of Urgency reinforced by an avoidable sorrow as Von Aschenbach realizes he is getting old in the hair dresser scene. The notion of isolation right from the beginning emphases by the personality of Aschenbach himself and showed by Visconti as someone cold and rigid and therefore alone. The notion of Desire which leads to the understanding of the main questioning: for Aschenbach, Perfection is reached through hard work it is a consequence not a fact. The Young Tadzio blows away this certitude. Does von Aschenbach desire Tadzio or is he fascinated by what he represents: Perfect Beauty?The challenge of Luchino Visconti was to apply a superb cinematography and a precise narrative method to a film that in nature deals with complex concepts. By succeeding in this task Mr. Visconti delivers a haunting piece of cinema, a true emotional experience, a masterpiece.","Death in Venice is a movie I need to see once every ten years. It is always different, because I am always at a different stage of life.The movie is about art, beauty, longing, death. Some scenes are painfully slow, others simply annoying to watch, especially if you have seem them before. Yet I would not want to miss a single frame. The music is repetitive, the main theme of the adagietto from Mahler's fifth is used again and again. Yet I would not want to miss a single note. When the last image fades, the last note dies, I am left numb and exhausted.This movie is a monument to film making. As with most really good movies, the saturday evening crowd should stay away from it. And this is simply the best movie ever.","I first saw \"Death in Venice\" when it was initially released in 1971. Today, I saw it again (by chance!) while I was channel-surfing. It had the same hypnotic effect on me that it had then. To wit: I sat down, vacuum cleaner in hand, and remained there. In 1971, at age 21, I recognized the film's poignancy but not in the way I was able to now, at age 56. Yes, it's slow-moving and not very much \"happens\". But its beauty, especially the wonderful close-ups and the use of Mahler's music, endures. Those familiar with Thomas Mann's novella of the same name,and other of his works (e.g., The Magic Mountain) will recall that nothing much \"happens\" in these stories, either. However, these classics (both in print and film) are apt to remain with us long after the latest special effects action film has disappeared.","I must admit that on the surface Death in Venice seems to have a rather troubling, unpleasant plot. An old man follows a teenage boy for most of the movie. Let's pretend that we don't know anything about Mann's book and we dived straight into this film on television. Death in Venice is a lesson to avoid writing stories off as what you think it means or is about. There's much more going on beneath the surface here. If you don't relate to our lead character, who looks rather lost in Venice... then you should at least appreciate the absolutely incredible cinematography and the way the music Mahler fits into it. This is one of the best uses of classical music to pictures you will see after Stanley Kubrick's work on 2001 and a Clockwork Orange. Yet, this movie has a level of sophistication that you might compare more to Barry Lyndon.Okay, moving away from Kubrick, Visconti is his own artist, reaching levels typical of the greats of Italian art. Many won't agree with me because this film might not be their cup of tea for several reasons. There's some really long scenes here with seemingly not much point to further a plot. But that's not the style of Death in Venice. It's all about mood, atmosphere, often all the background people and fanfare going on at the hotel all around him, it reflects his state of mind and it's achieved with such precision to detail... and again here I'm going to compare to Kubrick, like Jack in the Shining - that kind of psychological breakdown. But The Shining has been appreciated by the mainstream too, while Death in Venice is largely unwatchable for the mainstream. This is higher art. The scenes where he comes close to the boy, and the finale is just so perfectly executed, that every filmmaker should watch Death in Venice as a lesson.","Cinema's greatest period started in post-War Europe with Italy's Neo-Realist movement.  During the next 2 or 3 decades that followed, France's New Wavers caught everyone's attention, and there was always Bergman up there on his desolate Scandinavian island somewhere, making bitter masterpieces.  But in 1971, Luchino Visconti brought the art-form to full circle, geographically speaking, with his miraculous work  *Death in Venice*, which might as well be called  *The Death of Europoean Cinema*.  After the Sixties wound down, so did the great European filmmakers, who, with some exceptions, generally grew exhausted and passed the torch to a new American generation of Movie Brats  (Coppola, Scorsese, & Co.).  This movie absolutely feels like a grand summing-up, not just of Visconti's particular obsessions, but of the general attempt of European filmmakers to achieve the aesthetic ideal in movies. And rest assured, you will find no sterner task-master than the Visconti revealed here.  He's not playing to the crowd, folks:  either you get behind him and follow along, or you get left behind.  The pacing is a challenge: slow, but never without emotional weight.  \"Incidents\"  are few and far between, but each seems loaded with symbolic significance in a sturm-und-drang cosmos.We will probably never be in such rarefied company again, in terms of the movies:  one of the century's great writers who inspired the tale  (Thomas Mann), one of the greatest filmmakers directing it  (Visconti), one of the greatest actors in the lead role  (Dirk Bogarde), and swelling almost ceaselessly in the background, Gustav Mahler's 5th Symphony.  Taking full advantage of Mahler's ability to inspire Romanticism in even the most cynical breast, Visconti changes the main character, Aschenbach, into a decrepit composer from his original persona as a writer, even making Bogarde up to LOOK like Mahler  (geeky mustache, specs, shaggy hair, duck-like walk).  Bogarde, by the way, delivers what is probably greatest performance of an actor in the history of movies:  it's a largely silent performance, and the actor has to deliver reams of meaning in a gesture or a glance -- a difficult trick without mugging like Chaplin or merely acting like an animated corpse.Cinema just doesn't get better than this.  I'll ignore the complaints from the Ritalin-addicts out there who say that it's too slow, but even the more legitimate gripe concerning some of Aschenbach's flashbacks with that antagonistic friend of his is misplaced.  The flashbacks fit neatly within the movie's thematic concerns  (i.e., which is the better path to aesthetic perfection:  passion or discipline?), and the suddenness and shrillness of these interruptions serve to prevent sleepiness among the viewers.  (Of course, some viewers will sleep through this movie, anyway.)  A nonstop stream of Mahler and beautiful, dying Venice would be nothing more than a pretty picture; but this movie is actually about something.  And what it's mostly about is suffering:  Romantic  (capital R)  suffering, in particular. As a suffering Romantic himself, Visconti knew whereof he spoke.  If for nothing else, see  *Death in Venice*  for its portentous opening credits . . . and for its unforgettable ending, with Bogarde's jet-black hair-dye dripping off of his sweaty, dying head and onto his chalk-white face.  Meanwhile, off in the distance, young Tadzio, the object of Bogarde's dying desire, stands in the ocean and points toward the horizon like a Michelangelo sculpture.  The climatic sequence sums up with agonizing economy everything that the movie is about:  love, lust, beauty, loss, the ending of a life set against the beginning of another life, and cold death in the midst of warm, sunny beauty.  *Death in Venice*  is a miraculous work of art.    [DVD tip:  as with the simultaneously released Visconti masterpiece  *The Damned*, I recommend that you turn the English subtitles ON while watching this movie.  It's ostensibly in English, but the DVD's sound seems muddy and there's a lot of Italian spoken during the film, anyway.]","Definitely one of the most difficult, artistic, powerful and discussed films ever made \"Death in Venice\" had an almost impossible mission: Put blood on the veins of a story in which almost nothing happens and yet have a statement to made. If you consider that's quite difficult to read the book (I abandoned after 10 pages thinking that Thomas Mann took too long to told the story only pointing views on art and similar things which I felt very close to other book of his called \"Tonio Kroeger\" a very good book) you're gonna think that this cannot be filmed. Luchino Visconti tried, conquered and made an important film. But I must say this film entered in my list of one the most hated movies I ever watched and it only got out of it this year after 6 years of my first view. By the time I watched I didn't care much for it, I was expecting a more developed story, a few more movements than it doesn't have and at the end I didn't get it all. A few years later, and much more older, finally I found \"Death in Venice\" an more complete film than it was years ago and thanks to the brilliant and unique performance of Dirk Bogarde I think I went further on my notions of perception of what's the story and what's the point of it. Still has some doubts about the excessive use of artistic licenses used by the screenplay and some never answered questions but still is a great movie.Bogarde plays Gustav Von Aschenbach a famous composer that travels to a Venetian seaside resort in search of repose after a period of artistic and personal stress that includes the death of his son. His heart is weak, his emotional state is a completely mess, and he's desperate to achieve something great with his music. To make his travel worst (perhaps better depending on your view) he meets a beautiful young boy named Tadzio (Björn Andrésen, good actor with a magnetic presence almost without saying any lines) a teenage boy traveling with his parents. Gustav can't stop looking at Tadzio and vice-versa but the meaning between the look they gave to each other is very different. Alternating with the trip to Venice Visconti shows us some flashbacks of Gustav's life while he was married; the conversations about the notion of art and real beauty with his friend Alfred (Mark Burns), and Gustav's breakdown which led him to Venice. Pay attention very closely to the conversations between Alfred and Gustav about beauty, and what a real artist is. These moments always get something to say about what Gustav is doing in Venice searching for Tadzio in all places even knowing that there's a epidemic of Cholera coming to town.I don't know if the movie follows the book exactly but I think some notions of the main character were drastically changed. For instance people always say that Gustav is a cloistered homosexual, but in the film if you really pay attention Gustav is a little bit far of it, he was married with a women, and his supposed sexual interest in Tadzio comes from his thoughts about pure beauty, something that really makes him feel complete (along with his music) and that's what he really sees in Tadzio. Of course, there's the enigmatic and provocative look that Tadzio got in his eyes: \"You must never smile like that. You must never smile like that at anyone.\" says Gustav to himself in one scene (best quote of the movie). Before you start to think that he's a pedophiliac, calm down and see Gustav's trying some approaches but doing noting except look and think about the boy. The book is one focus (Gustav's point of view) and so does the movie. If it wasn't we would be able to know what Tadzio had on his mind with such gestures. Be patient and try to watch more than once because this is one of those films when you don't get the general idea by watching one time. It grows with you and the more you see, more the vision of what you think this story is it changes. Dirk Bogarde has the performance of a lifetime here and I can't imagine another actor playing Gustav. His last and moving scene is the most impacting and powerful scenes ever filmed: his character sitting in the chair, dying of the cholera, looking for the last time Tadzio running in the beach. Very well photographed. Gustav Mahler's music are well played in a good synchronized scenes. One of the forgotten films at the Academy Awards of 1972 it was nominated for best costumes (it lost for \"Nicholas and Alexandra\"). The costume designs are beautifully made and it is a key part for the film; notice the first time Gustav sees Tadzio dressed in white with some blue lines on the shirt, almost like if he was an angel to Gustav. What a vision! 9/10","Thomas Mann's novella \"Death in Venice\", published in 1912, was one of the earliest mainstream literary works of to deal with the subject of homo-erotic desire. Gustav von Aschenbach, a famous German author, travels to Venice, where he meets and becomes obsessed with Tadzio, a beautiful teenage boy whose Polish family are staying in the same hotel. Aschenbach discovers that cholera has broken out in the city but that the authorities, fearful of losing income from tourism, are trying to keep the outbreak a secret. Despite this discovery, Aschenbach neither leaves the city nor warns his fellow-guests, as either course of action would mean his being separated from Tadzio, with whom he has fallen in love.Mann was himself bisexual, and the story is based upon his own experiences while visiting Venice the previous year, when he had also been fascinated by a handsome young Polish boy. The depiction of Aschenbach also draws upon Mann's memories of the composer Gustav Mahler, whom he had known and who had died in 1910; he shares the same first name and Mann's description of his physical appearance would also have fitted Mahler. This may be the reason why, for the purposes of this film, Luchino Visconti made Aschenbach a composer rather than an author and made use of Mahler's music; the famous Adagietto from his Fifth Symphony is passed off as a composition by Aschenbach. Visconti made other changes to the story to strengthen the identification with Mahler. In the book Aschenbach is a childless widower whose wife died many years earlier and who has never remarried. In the film Aschenbach's wife is shown in flashbacks and although she does not accompany him to Venice there is no indication that she has died. (Mahler's wife Alma did not predecease him- indeed, she survived him by more than fifty years). They are, however, shown mourning the death of a young daughter, just as Gustav and Alma Mahler lost a daughter some three years before his death. I first saw this film in the late seventies, a few years after it was made, when I was a teenager studying Mann's book for my German A-Levels. I remember being impressed by it at the time, but then I was a very impressionable young man and probably thought that any art-house film based on a work of classical literature, shot against the background of a famously beautiful city with plenty of classical music on the soundtrack must be a great classic of the cinema, especially if (a) it deals with a controversial subject and (b) nothing much happens except long conversations about Art and the Meaning of Life. Since then my admiration for Mann's novella, a book with a well-deserved reputation as one of the major works of twentieth-century German literature, has grown, whereas my regard for Visconti's film has decreased. Mine is not the normal complaint of the \"loved the book, hated the film\" brigade, namely that the film-makers have altered the story too radically. Apart from the few changes to Aschenbach's circumstances mentioned above, and the omission of the opening scenes set in Munich, Visconti has kept fairly faithfully to Mann's plot. There are, however, some works of literature which do not lend themselves to a cinematic treatment, and \"Death in Venice\" seems to be one of them. There are some good things about the film. The photography of Venice is certainly beautiful, reminiscent of some of Turner's paintings of the city and rivalling that in \"Don't Look Now\", another film from the early seventies set in the same location. Dirk Bogarde was normally a talented actor and the young Björn Andrésen, with his prettier-than-any-girl beauty, certainly looks the part as Tadzio. (Andrésen, who is heterosexual, became something of a gay icon following this role, causing him some embarrassment). The Adagietto is certainly a beautiful piece of music, although I sometimes wonder if its association with this film has done Mahler's long-term reputation any good, leading people to associate him with decadence and morbidity. The problem with the film is that its good looks are all on the surface. Mann's novella contains little in the way of action and not much in the way of dialogue; the two main characters, Aschenbach and Tadzio, never exchange a single word. Its significance lies beneath the surface, on the psychological and philosophical levels. On the personal level it is a character-study of a man who has striven to live an ascetic life, governed by discipline, restraint and reason, but who finds his world- view shattered by the sudden realisation of his own powerful sexual desires for a boy. On the philosophical level it is an examination of two contrasting attitudes to life, the Apollonian life of reason and the Dionysian life of passion, a concept derived from Mann's study of the philosopher Nietzsche. Visconti, who was an intelligent man, doubtless understood the complexities of Mann's work, but it is these very complexities which make it difficult to adapt for the screen. The contrast between Apollonianism and Dionysianism is not a naturally cinematic subject, and the complicated inner life of an intellectual writer or musician, unaccompanied by some dramatic outward action, is equally difficult to dramatise. Visconti is never able to find a substitute for Mann's ideas. The lengthy debates between Aschenbach and a fellow-composer about musical aesthetics do not add much interest; they simply help to make a lengthy and tedious film even more so. The film may be beautiful, but it is also dull and long-winded, and in such a context its beauty becomes something excessively rich and cloying. In Mann's story Aschenbach dies after eating an overripe strawberry, and this becomes an appropriate image for an overblown film in which Dirk Bogarde appears to die of a surfeit of overripe beauty. Too much Venice, and too much Mahler, can be bad for your health. 5/10","Set in Venice mainly on the Lido, Visconti's \"Death in Venice\" is a triumph of filmmaking combining the excellence of Dirk Bogarde's characterisation and expert photography of the resort area in all its various daily moods. For those who love Venice, this is a film to cherish.Mahler's music frequently heard throughout the film heightens the drama. The mood it creates is not always happy.  But then what else would you expect with a title like that?There is not a lot of dialogue in the film. Rather sparse in fact. It's mainly background noises and chatter and laughter among the hotel guests. The intriguing part is to interpret the exchange of glances between Gustav von Aschenbach a composer of some renown and a slim teenage youth Tadzio who see each other from time to time across the tables of the hotel dining room, on the beach and at odd unexpected places around Venice.  They seem to acknowledge each other's presence shyly at first with little more than the suggestion of a smile but later with a strong and riveting and urgent gaze.Each viewer will have his own interpretation.  The composer has lost a child of his own.  Is this behaviour an expression of yearning for the child he loved?  Is it perhaps a sexual attraction towards this fragile young man with his dazed somewhat girlish stare?  Could he be discovering some new inspiration for a yet unwritten musical masterpiece?  Who knows?From beginning to end this film captures the true spirit of 19th Century Venice.  The elegance of the ladies, the deck chairs on the sand, the children frolicking in their neck-to-knee bathing costumes, the glow of sunsets and a general feeling of satisfaction with the world.  While some may think the pace is rather slow at times, the film has an overall gentle quality, but with a simmering indecision between two repressed human beings. Be prepared for a sad and beautiful ending.","I saw this movie in 1971 when I was very young. All I recall is a very sad story about an artist who was very ill when visiting Venice where he spent time furtively seeking out a boy he was attracted to. It was sad and depressing and a bit creepy. I watched it again 45 years later on TCM and it seemed to be a much more powerful statement about a tragic life and death that reaches its climax in Venice during a sweltering summer in 1911 when the city is overtaken by a cholera epidemic. The main role is played by Dirk Bogarde, a British actor, who is making the best of his last days longing for a love he can never achieve.The background music by Mahler is very sombre and fits the tragic ending. The city is being scrubbed to stop the spread of disease and no one wants to frighten away the tourists, who are the city's economic lifeblood. Again, the symbolic conflict between dreams and reality. The acting is superb. The period costumes are stunning. The photography is powerful and sweeping with seas, sunsets and the skyline of Venice. This movie is not entertainment but a work of art. I couldn't take more than one of these works at a time but it is worth seeing as a unique achievement.","So many good reviews. The film is excellent the book also. It is mostly a tragic gay love infatuation story. The people who go into beauty--ascetics--death perfection of art on and on (and the movie does present the story this way) are missing the real story.The real story comes out better in the book = a late middle aged man (Dirk Bogarde is too young and handsome for the role) becomes infatuated with a 15 year old boy. Possibly the first such awakening of his homosexual id--in 1913 it was still punishable with prison.In Mann's book Aschenbach was an author (it is widely believed Mann had Gustav Mahler in mind). In any case Aschenbach has had lots of losses in life and recent failures in his career and is suffering from a near mental breakdown. Now comes the ultimate degradation of his persona as he becomes infatuated with Tadzio. Mann was no stranger to psychoanalysis so there was clearly a carnal interest as well.The movie miscasts Tadzio--Bjorn Andreson is too lithesome and feminine and frankly not sexy enough for the role. A dramatically better movie would have cast him better--everything would be much more understandable then. Most of all he needed to be much more masculine.So....Aschenbach sinks lower and lower--dyeing his hair and using make up to attract the boy. The movie is pretty clear about the sexual nature of all this--but has lots of flash backs feeding this cover up that it was all about art and ascetics beauty death blah blah blah. While it was mostly hormones.The costumes are wonderful...everything really well done...I could spend hours talking about symbolism e.g. Esmeralda the boat to Venice also the name of Aschenbach's first prostitute (sexual adventure)... That would be an effort and bore everybody. These things you appreciate as the movie unfolds and add depth and intelligence to the film no need to enumerate them (plus there are too many to count). The film is a jewel that way.Read the novella and buy Mahler's 5th. But you know the film is uniquely good as well. This is rare (a movie as good or better than the book).RECOMMEND HIGHLY","A Nobel Laureate, the German novelist Thomas Mann was always concerned about the relationship between the artist and the society he lived in. He was right to be worried. (He wound up in Los Angeles.) Visconti's film and Mann's novel that it was based on are kind of autobiographical. It's the story of a German professor, played by Dirk Bogarde, who is a composer (author in the novel) with composer's block. It's the turn of the century and, like the 1800s he's played out. His friends advise him to take a trip and find some peace and quiet near the beach in Venice -- the one in Italy, not California. The hotel doesn't turn out to be so quiet. There is, for instance, a sizable Polish family with half a dozen kids chattering away in the lounge and dining room. At first it seems to annoy Bogarde but then he notices a blond boy in his early teens and the kid is stunningly beautiful. Bogarde is attracted to him because an artist is always interested in innocent purity, in whatever form it takes. But his interest turns into something more than a distant admiration and he follows Tadzio around Venice, never speaking to him, let alone touching him. Finally, sweating and ill, Bogarde has the hotel's barber give him a make over -- a hair cut and dye, make up, and lip rouge, \"restoring what nature has taken away.\" A caricature of himself, Bogarde continues to follow Tadzio around, while a cholera epidemic sweeps Venice and nails Bogarde himself, who is captured by the \"sure-enwinding arms of cool-enfolding Death\", while reaching out to the boy on the now-empty strand. The cholera doesn't come out of nowhere; there have been portents -- an early warning against eating fresh fruit, a man collapsing in a railway station, but nobody having to rush off to the toilet. When James Joyce is handing out gifts in \"Finnegans Wake\" he included \"a collera morbous for Mann in the Cloack\" as an homage, an enigmatic sequin reflecting how internationally famous \"Death in Venice\" had become. It's a curious film with all sorts of correspondences. Mann's story was almost autobiographical. He himself was bisexual and Tadzio is closely based on a real Polish boy he met in Venice. Mann gave his main character, Aschenbach, the features of the composer Gustav Mahler, a good friend, whose musical excerpts form the only underscore for the movie. So Mahler is the source of Bogarde's mustache and pince-nez.Visconti has said that the movie was a disaster at its first showing but a producer asked him enthusiastically who had written the melancholy score. \"Gustav Mahler.\" \"Great! Can we get him?\" Bogarde himself was bisexual. And Tadzio, despite his being a male, is groomed like a pure young girl throughout, all eye shadow and rosy lips. The other boys have the short hair cuts of the period but Tadzio has a Farrah Fawcett do, so he looks like a figure that might be glimpsed in a Halloween parade in Polk Gulch. Tadzio isn't unaware of Bogarde's interest. From the moment they first see one another in the hotel lounge, coy Tadzio returns Bogarde's rapt gaze with a secret smile. He flirts ostentatiously with the older man. He's later seen kissing a friend. What the hell is up? Have we run out of heterosexuals? Sometimes I think I'm the only straight man left in the universe, except for wearing pantyhose. They keep out the chill and aren't as uncomfortable as you might think.Anyway, Bogarde makes a perfect Aschenbach, troubled, tragic, and ridiculous. He was really a fine actor. Tadzio is a pretty girl. We don't really see much of anyone else. Marisa Berenson isn't on screen nearly enough. We could have used more of her statuesque grace, and if she'd shed her hampering outer garments, the movie would have been ennobled. Wardrobe is superb. Every woman's bonnet has a wide brim and is topped with feathers, bouquets, amuse-bouches, and other stuff that looks like a mobile dropped from the ceiling of an art museum. Venice, a city of gondolas and dreams, looks surprisingly cool, gray, and hazy. I suppose it's disappointing because Venice is in \"Italy\", which is supposed to be sunny in romantic stories. If it had been a few miles away in \"Yugoslavia,\" the absence of sunshine would have been expected.","It may be hard to explain how, but this film is a masterpiece. Perhaps, because i never imagined that a plot like this or a film with so few words would convey all this poetry. The true poetry and aristocracy of human passions and obsession. Bogard is amazing and needless to say that Venice is utilised as a perfect scenery: dark, sinking and dreary just like Bogard's soul. And classical music is more that a simple background escort to human feelings. In my opinion, a classic masterpiece of european film-making.","From the first to the last scene of the movie, director Visconti excels at his art, to the extent that the movie is ensured to remain as a cultural treasure for only God knows how long. It is perfection - as a movie, that is, but the story has some minor shortcomings.Thomas Mann's novel is also a perfect piece of art, so of course it is impossible to bring into another media. Visconti follows the story pretty much, and it is only when he allows himself to deviate slightly, that the transition falters. And no matter how wonderful the scenery is, the tension in the air between the characters, the hundreds of subtle signals and allegories, the almost unbearably heightened serving of Mahler's music - still, the minute anomalies in the plot disturb me.Maybe I'm just a victim of man's desire to flaw the flawless. Nevertheless, I will offer one example, which I regard as crucial.WARNING: SPOILERSIn Mann's story, Aschenbach eats the strawberries which probably contain the disease that will kill him, after giving up his frustrated chase of the boy Tadzio in Venice. Unable to catch one delight, he settles for another - which poisons him. It is very subtle in the book, but it is there. The forbidden fruit, of sorts, but more a sign of him surrendering life itself.In Visconti's film, he also eats strawberries, but in a rather insignificant scene by the beach. The chase in Venice ends in a much more melodramatic way. It works, too, but lacks some subtlety, indeed, and also the multi-layered symbolism, giving food for thought.But that's all forgiven, when the film allows us to feast on beautiful sceneries, faces and constellations, and certainly as many other symbols as we can possibly digest - the last gesture of Tadzio, standing in the water, being the equally sublime and mysterious finale.","I must say I reluted to see \"Death In Venice\",because been a great fan of composer Gustav Mahler,I though the film was an insult.But one day I saw a film called \"Modesty Blaise\",and I sat my eyes in the most beautiful actor I have ever seen:Dirk Bogarde.When I find out that he played the leading role in \"Death In Venice\",I decided to leave all my prejudices aside,get all my courage and rent the film.I can only say one thing:Sublime.Gustav Von Aschenbach is the perfect man.He is beautiful,handsome,talented,sweet.The fact that he falls in love for someone of the opposite sex is something secondary.All that he needed was someone to understand his genius,that is the one thing that he did not find in Venice.\"Death In Venice\",is a masterpiece of a lifetime.Dirk Bogarde is the most talented and beautiful actor of our lifetime","Death in Venice has nothing to do with sexuality - hetero, homo, or otherwise.  It's about God, man, beauty and creation.  Man loses.  End of story.","In DIV, Visconti overstates the Mahlerishness of Aschenbach to the point of confusion, and worse, does the same to the 'boy-ogler' interpretation of Aschenbach to the point of insult. The result ends up feeling like an horrific parody - or even fictional bio - of the great composer / conductor.Mann, upon whose work the film is apparently based, much admired Mahler, and, learning of his death, gave Aschenbach Mahler's first name and (apparently), his appearance - but unlike Visconti, Mann cast him as a writer, not a composer. Mann's written work was already mostly finalised when these 'honours' were bestowed at any rate. But more importantly, Mann is widely thought to have drawn from a number of different sources for his main character; different traits from different people, and to specific ends. In short, the clumsiness of the film's choice of visuals, seems to lecherise Mahler himself through a 'little boy obsessed' Aschenbach, and insinuate something of Mahler himself which has no real basis. The overplayed likeness left the feeling that what was going on was really nothing to do with the novella, but instead a 'secret revealed' about Mahler. And so the story lost all philosophical meaning immediately, and became something more like slander or gossip, leaving the perhaps less studied Mahler-appreciating audience to be misled into supposing all sorts of things - even trying to extrapolate something of the historical relationship between Mahler and Schonberg (as if Mahler's helping of Schonberg required any more motivation than memories of his aspiring composer / musician younger brother, Otto!)But aside from this terrific complaint which I might at least be able to (unreasonably!) write off to misinterpretation, the film's slow broody stillness - and labored sincerity - cannot reach a shadow of the way to the effortlessly profound music which it misappropriated. Way back in the day (July 19, 1971), Alan Rich did a great review of this movie in the New York Magazine. \"...the insult to Mahler doesn't like in any imputation about homosexuality, not even in the way this element is luridly underlined in the movie. It lies, rather, in the cheap, uncomprehending niggle-naggle about the arts that Visconti puts into the mouths of Aschenbach-Mahler and Alfred [-Schonberg]...\"It's easy enough to find on googlebooks. That review pretty much says it all - other than one more comment which desperately need to be made, and that being, that the film's lack of subtlety pushed it Aschenbach firmly into 'little boy ogler' territory, which was simply creepy, but which also obliterated much of the intelligent introspection and 'longing for the lost days of youth' that the film might have otherwise evoked. Someone likes it I guess. Not me. Tacky. Slow. Self-serious. Overblown. Self-important. Failed art- house bordering on mockumentry bordering on defamation.","I watched this with an open mind, I really did, after having it suggested to me. \"Oh it's a masterpiece\" \"It's so wonderful\" were the sentiments of others. No, no it wasn't. I admit from a cinematography point of view, some of the shots were great, in fact the opening scene was beautiful, but this didn't make up at all for the plot, or lack of it and the way the rest of it was set up. Just because something is artistic does not make it good. I got a real sense from this film that it was artistic for the sake of it and that those who actually like it, like it to show off how arty they are. It was badly written, slow and incredibly uncomfortable to watch. Forgive me if a plot that revolves around an Edwardian Pedophile doesn't get me going. For the love of God, if I had to watch one more long pan in shot of that boy in his swimming trunks, I swear I would die. It was so uncomfortable as you zoomed in on his face, or costume. Through the whole thing I felt like I was the pedophile for watching this man with this really disturbing obsession with the little boy. Nothing happens, in the entire film. All that happens is you follow Bogarde's character around while he's on holiday, and view him stalking this child. Following him around, sitting on the beach for a bit. Watching him while he sits and reads his newspapers, while occasionally cutting to a flashback of before the holiday and Bogarde's character's last concert, which wasn't received very well. Then his mate harking on about what beauty is for no apparent reason and having an incredibly pretentious rant about \"what does beauty mean.\" I didn't identify with any of the characters what so ever, there was absolutely nothing compelling in the plot, it didn't seem that the film had anything to say at all as it aimlessly wandered about, like a dog sniffing at a hedgerow, trying to find a scent.It was unbelievably boring, i had nearly slit my wrists through despair and desperation by the end. People will accuse me of being of the generation that just loves things to be quick, and guns and car chases are all that I care about. Not so, I love a good film, that has a good plot and I really love attention to detail and getting lost in a film. But the fact of the matter is, this film had none of those things, bad plot, bad dialogue and unidentifiable characters.","Philistines beware, especially American ones! This has all the elements you'll hate - a langorous approach to film language, a painterly sense of composition, an intense homoerotic focus to its elegant narrative, a wonderful and unusual use of music and, even worse, it's based on a story you'd probably hate as well... If, however, you do feel that films don't to have derivative plotlines, be full of action and crappy dialogue, don't need the visual grammar of MTV/TV Commercials, then watch this. It's one of my favourite films, and is perhaps Visconti's most perfectly formed piece of work. It's sublime, like the movement of Mahler he uses insistently throughout the film.","The opening of MORTE A VENEZIA resembles a Duran Duran music video with classical music and this is the highlight of the movie \" In terms of what Theo ? \" In terms of everything , but especially excitement . I doubt if there's ever been a more sluggish slower moving movie than this one . Yeah okay it's a European art house movie so I wasn't expecting Charles Bronson to massacre hordes of bad guys but even so I did expect some substance if not an actual plot The film revolves around Professor Gustav Von Aschenbach visiting Venice . Gustav visits Venice and goes on a gondola , Gustav eats in an expensive restaurant , Gustav looks out of his hotel window and if it's excitement you want Gustav has a flashback Bad enough if this was the entire movie but it gets worse because Gustav notices a pretty boy teenager . So you've got a middle aged academic lusting after some teenage boy he has seen , some old queen is becoming obsessed with a stranger . Great idea for a movie ? I don't think so either and thank gawd it remained a yawn fest instead of some sleazy precursor to gay porn I notice a lot of people who praise this movie have tried to intellectualise it . I can only be monosyllabic and unpretentious in my view and say that the only subtext I could relate to was the physical and emotional disintegration of Gustav but it wasn't caused by the effete beauty of the teenage boy - It was caused by watching such a boring and ostentatious movie","I'm not sure where to start with this. In short, it was a disappointing movie. Having taught the novella, I was aware that it would be a hard story to turn into a movie. The movie has a couple of interesting lines (mainly between Alfred and Aschenbach) but it doesn't represent the debate on art that basically shapes the novella. For one, I was expecting an older Aschenbach and a younger Tadzio. In the book, Tadzio is fourteen, but he is described as pure, ideal, innocent, whereas in the movie he reeks of sexuality and is a tease. He is an accomplice to Aschenbach, he always looks back at him, almost provokingly. In the book, it is Aschenbach who steals glances at the boy. As for Aschenbach, I imagined something closer to the professor-turned-clown in The Blue Angel (based on a story by Thomas Mann's brother Heinrich) than this forty-year old with hardly any gray hair. In all fairness, I do think that Dirk Bogarde did a good job, but either someone else should have done that, or he should have made to look older at the beginning. I know that the discovery of homosexuality is important to the story, but the movie minimizes the talk about art and the duality between the Apollonian and Dyonisian inspirations and focuses instead on Aschenbach's obsession of Tadzio and does not justify it. I liked the fact that Mahler's music was used, because ultimately he did inspire Mann to write his story. I'm not sure turning Aschenbach into a musician was a particularly good move. Or the creation of Alfred who I don't remember in the book.And one thing that really got to me was the sound and how it did not match the actors' lips. I was wondering if it was dubbed because I expected it to be in Italian. But then I remembered that each Italian movie I have watched has this problem. It just bothers me because these directors (Fellini is the other person I'm thinking of) are supposed to epitomize perfection in Italian cinema, and here are their characters laughing without sound, then you hear a noise that doesn't correspond to their faces (I'm thinking of the scenes when Aschenbach almost collapses and starts laughing. This scene could/should have been the strongest, but it was annoying instead).","Bad both as a movie and as an adaptation. Laden with superficial and pseudo-intellectual flashbacks, in which the performances are even worse that in the rest of the movie, surely due to the torture of having to recite whole paragraphs of cheap Philosophy guides that not even the director understood. Add to that the constant and irritating use of unnecessary, clumsily done zooms, and you have an almost unbearable film experience that not even all the Mahlers in the world could save."],"review-user":["ItalianGerry","Zen Bones","G_a_l_i_n_a","Patatino","auberus","The_unemployed_cynic","rezdoc1","daveedrenaud","FilmSnobby","Rodrigo_Amaro","JamesHitchcock","raymond-15","barryrd","colorado-32493","rmax304823","irene s","stefan-144","vivian_baum_cabral","apocalypse later","tim-john-mead","maharg27691","rancid_man85","Theo Robertson","msultan","rubentpm"],"review-date":["7 June 2004","13 April 1999","11 December 2006","29 October 2004","12 July 2004","27 October 2002","27 October 2005","6 November 2017","3 April 2004","25 June 2010","17 June 2013","18 May 2004","21 June 2017","21 June 2017","20 November 2014","9 February 2004","7 January 2003","13 July 2002","22 January 1999","27 September 2014","8 May 2013","3 June 2003","4 October 2005","11 June 2004","28 January 2001"],"review-rating":["10","10","8","10","10","10","9","5","8","9","10","8","10","9","9","1","2","10","4","7","1"],"review-title":[" The best possible film of Mann's novella.\n"," A visionary masterpiece (but not for those with short attention spans)!\n"," Beauty Found and Lost in Venice: Mann + Mahler +Visconti = a Masterpiece\n"," More and more beautiful as the years pass by\n"," A haunting piece of cinema, a true emotional experience, a masterpiece\n"," A monument\n"," \"Death in Venice\" after 30-plus years\n"," One of the greatest films\n"," The Death of European Cinema.\n"," Love It Or Hate It But Try To Watch More Than Once Even If Hating It\n"," A Surfeit of Overripe Beauty\n"," Unforgettable romantic drama\n"," A unique achievement\n"," excellent infatuation 'degradation' and death...film is a jewel\n"," Looking For Love In All The Wrong Places.\n"," such a wonderful film..\n"," Not topping the book, but what scenes and what sounds!\n"," The Perfectionism Of Visconti+The Music Of Mahler+The Beauty Of Bogarde=Perfect Film\n"," Grow Up.\n"," Pretense on top of pretending\n"," Give me two hours of my life back\n"," This is how I'd like to die...\n"," Yawn . Yawn . Yawn\n"," ignores important aspects of the novella\n"," Incredibly overrated, pretentious and just plain dull.\n"]}