{"review-url":["http://www.imdb.com/title/tt0037595/reviews"],"review-text":["Anyone who has watched the recent remake of 'Christmas in Connecticut' will fully appreciate just how wonderful the slim story was in the hands of Barbara Stanwyck, Dennis Morgan and Sydney Greenstreet. No masterpiece, but so much better than the weak remake. The whole film revolves around the mistaken belief by editor Greenstreet that Stanwyck (his favorite Martha Stewart-type of writer) is a homemaker with a house, husband and baby in the country. This, of course, means that the inventive woman has to enlist the aid of others to play out her scheme when Greenstreet invites himself and a ship-wrecked sailor (Dennis Morgan) for the holiday week-end.The slight comedy develops a few complications along the way--and it all looks very holidayish with the lovely country home in Connecticut--which, thanks to Warner Bros. art decoration, looks like something from a magazine cover. Stanwyck's forte is really heavy drama but here she displays a light enough touch to make her scenes with Morgan and Greenstreet delightful to watch. She gets great support from Una O'Connor, S.Z. Sakall and Reginald Gardiner under Peter Godfrey's light-hearted direction.It's as unpretentious a confection as a child's homemade Christmas card and just as charming--light and fluffy entertainment that makes no great demands on your viewing pleasure. Worth viewing, especially around the holidays.","From the perspective of the hectic, contemporary world in which we live, the so called `good old days' always seem so much more serene and innocent; an idyllic era gone by of which we have only memories and shadows that linger on the silver screen, as with `Christmas In Connecticut,' a warm and endearing film directed by Peter Godfrey.  Barbara Stanwyck stars as Elizabeth Lane, a popular `Martha Stewart' type magazine columnist who writes about life on her beloved farm in Connecticut, always with the latest recipe at the center of the story.  One of her biggest fans is Alexander Yardley, played by Sidney Greenstreet, the publisher of the magazine for which she writes.  Yardley has never visited her farm, and in response to an idea expressed to him in a letter from a nurse, Mary (Joyce Compton), he decides to spend an old fashioned Christmas with Elizabeth, her husband and child and, as a special guest, a certain Mr. Jefferson Jones (Dennis Morgan), a sailor just recovered from spending fifteen days at sea on a raft after his ship was torpedoed.  Elizabeth of course cannot refuse her boss, but there are problems; not the least of which is the fact that she has no farm and writes her column from the comfort of a high-rise in the city.  It makes for a precarious situation for her as well as her editor, Dudley Beecham (Robert Shayne), as the one thing Mr. Yardley demands from his employees is total honesty.  What follows is a charming and delightfully romantic comedy that transports the audience back to a seemingly more simple time and place, to share a Christmas Past where a warm hearth, good food and kindness prevail.Barbara Stanwyck absolutely sparkles as Elizabeth, with a smile and presence warmer than anything the grandest hearth could provide, and totally convincing as a city girl entirely out of her element on the farm.  Morgan also fares well as the somewhat naive sailor, whose trust in his fellow man is admirable.  Even with the deceptions being played out around him, he's the kind of guy you know will somehow land on his feet, and in the end it's Elizabeth you really feel for.  One of the true delights of this film, however, is Sidney Greenstreet.  His Yardley has a gruff exterior, but beneath you know without a doubt that this is a man with a heart as big as Texas.  It's a straightforward, honest portrayal, and it's a joy to watch him work; the most memorable scenes in the movie belong to him.The supporting cast includes Reginald Gardiner (John Sloan), the terrific Una O'Connor (Norah), Frank Jenks (Sinkewicz) and Dick Elliott (Judge Crothers).  A feel-good movie that plays especially well during the Christmas Season (though it would work any time of the year), `Christmas In Connecticut' is a memorable film that never takes itself too seriously, is thoroughly uplifting and will leave you with a warm spot in your heart and a sense of peace that makes the world seem like a good place to be.  It's a true classic, and one you do not want to miss.  I rate this one 10/10.","This Christmas gift arrived courtesy of TCM. We had never seen the film, even though we have seen most of the films of Barbara Stanwyck. This comedy made us laugh so much, that at times, we had to restrain ourselves, in order to hear the dialog.This is a movie that should be seen by people suffering from stressful situations, especially around Christmas. It would certainly lift one's spirits by just letting go. The movie would make a perfect gift in the form of a DVD, or a VHS tape. \"Christmas in Connecticut\" was directed with great panache by Peter Godfrey, based on a story by Aileen Hamilton. The best thing in the movie is the felicitous pairing of two of the most popular stars of that era: Barbara Stanwyck and Dennis Morgan. Barbara Stanwyck always played strong willed women, obviously, this was a change of pace for her. In this film, as well as \"Lady Eve\", Ms. Stanwyck displays a knack for comedy. She and Mr. Morgan, who played in a lot of musical comedies, make a winning combination.There are no weak performances in the film. Sydney Greenstreet, an actor notorious for playing 'heavies', is a delight to watch as the rich, and fat, Alexander Yardley, the man who owned a media empire and who knew a good thing when he saw it. Reginald Gardiner, an accomplished English actor, adds luster to the stellar cast behind the two principals.S. Z. Sakall, is another source of continuous mirth; he plays the Hungarian chef Felix,who has a hard time with his own version of the English language. Also, Una O'Connor makes a perfect Norah, the housekeeper in the Sloan perfect Connecticut farm.In reading other comments in this forum, it's sad to learn that the glorious black and white cinematography is not appreciated by some people. After all, color was not widely used in the 40s, and most of the classic movies have to be seen in its original format because, what would be accomplished in 'coloring' them?This film should be a requirement for anyone looking to spend almost two hours of uninterrupted fun at Christmas time because total merriment is assured. Watch it with an open mind and heart an maybe you'd like to see \"Christmas in Connecticut\" every year.","This lightweight but pleasant holiday feature makes the most out of a pretty slim premise, thanks to a solid cast and some resourceful writing. Not meant to be taken very seriously, it provides easygoing entertainment with some simple but upbeat themes.Barbara Stanwyck was an interesting choice as the lead, and she makes it work well enough. The premise of Stanwyck's writer character trying to fool everyone and maintain her image is more suited to screwball comedy than to a holiday feature, but the tone is kept light and funny while having just enough of the holiday atmosphere to be believable. The supporting cast helps out, with the likes of \"Cuddles\" Sakall and Sydney Greenstreet getting some good moments.This kind of light but worthwhile feature is not as easy as it looks - as witness the string of crass, barely watchable holiday features of recent years. While hardly anything deep or brilliant, \"Christmas in Connecticut\" holds up well enough to be among the more enjoyable movies of its kind.","It finally hit me watching my VHS of Christmas in Connecticut what other film this one reminded me of. If it weren't for the fact that the other was done 20 years later, I'd say it was a remake.Just as Rock Hudson was a phony fishing expert for Abercrombie&Fitch who had to get some on the job training at a fishing tournament, Barbara Stanwyck plays an forties version of Martha Stewart.Stanwyck's a cooking columnist who's built up this whole image of living on a small Connecticut farm with husband and baby cooking all these marvelous delicacies. Trouble is she's unmarried, childless, writes her column from her apartment in New York and doesn't know how to boil water. But her writing is a hit with the public.Trouble comes when she's hijacked into cooking a home Christmas dinner for a war hero sailor played by Dennis Morgan who gets to sing a couple of songs as well. Got to keep up the image at any cost. And her publisher Sidney Greenstreet likes the idea so well that he invites himself to the dinner.So with borrowed farm, baby, and Reginald Gardiner who'd like to make it real with Stanwyck she tries to brazen it through. Christmas in Connecticut's now a Yuletide classic and deservedly so. The leads are warm and human and they get great support from the assembled players. S.Z. Sakall as the Hungarian restaurant owner/friend of Stanwyck from whom she gets her cooking information and Una O'Connor as the housekeeper have a nice chemistry between them. Reginald Gardiner and Stanwyck have no chemistry at all, obvious to all but Reggie and he's funny in his stuffed shirt way.Most people remember this film as one of Sidney Greenstreet's few ventures into comedy. If he's not an outright villain, a cynical observer of life or a tyrannical tycoon, Greenstreet is few other things on screen. Christmas in Connecticut gave him a rare opportunity to burlesque his own image and he made the most of it.In a biography of Barbara Stanwyck, she mentions she enjoyed making Christmas in Connecticut as a welcome change from some villainous parts like Double Indemnity she'd been doing recently. One of the things that made doing the film so enjoyable was that between takes, director Peter Godfrey and Greenstreet would do some impromptu entertaining of cast and crew with English Music Hall numbers. Made for a relaxed and warm set and the cast responded accordingly.Now if only someone had been filming those numbers.","I first saw this film about 15 years ago, and I have been enchanted by it ever since. It is such a feel-good experience, that I could happily watch it at any time of the year. However, to me, it is the ultimate Christmas movie.The fact that it is in B&W is irrelevant - although I often wonder what it would be like in colour. You can just get that warm, glowing feeling watching the Christmas events unfold. Stanwyck and Morgan are perfect together, and Greenstreet is the antithesis of his usual character, Sakall is a blustering joy to watch.It is light relief and certainly does not tax the brain, but leaves you feeling glad that you saw it.I can't wait for it to become available on DVD in the UK. I shall certainly be at the front of the queue to buy it.","This is a screwball comedy disguised as a Christmas movie. I almost prefer Barbara Stanwyck in this than in the Lady Eve. She is a bit less restrained, a bit warmer. She moves with ease in an almost all male cast. The holiday theme is almost incidental, it definitely takes a sideline to the charade in the house of her being a domestic goddess. Barbara Stanwyck carries the movie right through to the end. Her extra slim figure is pleasing in very simply tailored clothes. Your heart almost sinks for her when she is going to be married to the very droll architect. The actual farm setting is fun and makes it more believable. Not very well known, but not to be missed.","At the time that this movie was made most housewives knew exactly who Barbara Stanwick was parodying.Today only some women over 50 probably remember Gladys Taber,whose column \"Butternut Wisdom\" ran in Family Circle Magazine from before World War II until the 1970's.She lived on Stillmeadow Farm in Conecticut,and her columns were collected into a number of books,Stillmeadow Seasons, Stillmeadow Daybook, etc. The lines that Barbara Stanwick recites as she types them for her column are quite typical of the ones that began a typical Gladys Taber column.Besides cooking and country living,she got rather nostalgic and philosophical at times.She talked a lot about her favorite dogs, mostly cocker spaniels.You might say that Martha Stewart is the Gladys Tabor of today.Christmas is Connecticut may not be any cinematic masterpiece,but it is pleasant,lighthearted entertainment,soothing to the stressed out mind,and that is good enough","Christmas in Connecticut (1945 - Directed by Peter Godfrey) Barbara Stanwyck stars as a well-known magazine food writer who has been lying to her millions of fans that she is married with child and lives the traditional wife/mother role in a lovely country farm house. Magazine editor Sydney Greenstreet decides that Stanwyck should host returning war veteran Dennis Morgan at her country house over the Christmas holidays! Yikes! What's Stanwyck to do? Why marry her long time suitor, architect John Sloan, (who just happens to have the perfect country house in Connecticut) in a hurry and high tail it out to Connecticut faster than you can say \"I do\" before the boss finds out and she loses her job and becomes the laughing stock of the country.  This is a charming and lightly played holiday tale that allows Stanwyck to turn in one of her best comedic roles.  The movie has all the ingredients for a holiday classic: a farm in the country, lots of snow, mishaps and miscommunications to keep everyone guessing as to how the whole thing will turn out in the end. Of course, Stanwyck never does marry her architect friend and instead falls head over heels with the war hero.It's one of the lesser known holiday movies, but year by year, is getting more and more attention.  If you don't go for the heavily sweet holiday fare, this is just what the doctor ordered.","Make sure you make this delightful comedy part of your holiday season! If you admire Dennis Morgan or Barbara Stanwyck, this film is a fun one to watch. They really work well together as you would see in this movie. The whole cast was very entertaining. Since I'm a Dennis Morgan fan, this film was a real treat! But...everyone can enjoy it! Recommended!","The destroyer of Jefferson Jones (Dennis Morgan) and his partner Sinkewicz (Frank Jenks) is sunk by the Germans and they float adrift in a raft for eighteen days. When they are rescued, they are sent to a hospital and Jefferson has to follow a stringent diet imposed by the doctors. He seduces his nurse expecting to get solid food and she decides to write to Alexander Yardley (Sydney Greenstreet), who is the owner of the Smart Housekeeping magazine where the famous journalist Elizabeth Lane (Barbara Stanwyck) writes a column about recipes and food, asking him to allow Jefferson to spend Christmas with Elizabeth and her family in her farm in Connecticut. The prepotent Yardley sees the chance of free promotion of his magazine and forces Elizabeth to invite the hero Jones. However, Elizabeth is single, does not have a baby and lives alone in a small apartment in New York and she made-up a perfect married life for her fans. Further, she does not how to cook and the recipes belong to her Hungarian friend Felix Bassenak (S.Z. Sakall), who owns a restaurant in New York. The architect John Sloan (Reginald Gardiner), who has been wooing Elizabeth for a long, proposes to marry her in his farm in Connecticut and she brings Felix with her to help to proceed the farce. The things get complicated when Yardley also decides to spend Christmas with Elizabeth while she falls in love with Jones.\"Christmas in Connecticut\" is a delightful and witty comedy of errors about a famous food writer that makes up a fictitious life and has guests to her world. I have just bought this DVD and it was the perfect entertainment for a rainy Sunday afternoon, with hilarious situations and wonderful performances. \"Christmas in Connecticut\" is indeed a must- see for the Christmas period. My vote is eight.Title (Brazil): Not Available","This film is one of my favorite Christmas classics. Sure, it's fluff, it's not \"relevant\", but when did movies being simply entertaining and fun become a bad thing? No, this movie is definitely \"A Good Thing\" as Martha Stewart(appropriately)would say! Barbara Stanwyck is so appealing in this film and Dennis Morgan perfectly compliments her. Both of them have charm and warmth to spare. They are assisted by a crew of those incredible character actors who seem to have disappeared since the 40's and 50's--Sydney Greenstreet, S.Z.(Cuddles)Sakall, Reginald Gardiner and Una O'Connor among them. Where are characters like this today? Not one role could have been better cast. Bette Davis thankfully refused this role as beneath her and she was right to refuse it. She would have attempted to steam roll over everyone and everything around her and completely destroyed the film. Stanwyck was a strong actress, but had the wisdom to play this lightly. She has seldom been more appealing and is pitch perfect. Morgan is the essence of the nice guy. Because his part is the least splashy there is a tendency to overlook his skill. Just the fact that he could hold his own surrounded by such distinct character actors is an accomplishment in itself, but he too is absolutely perfect as Jefferson Jones. Skip the ill advised(and pointless)1992 remake and watch this bright, sparkling holiday gift!","Given the acting roles he played in the 1940s (Casper Gutman, Signior Ferrari, Mr. Peters, Jerome K. Arbutny, Ex-Superintendent Grodman, Count Fosco, Titus Semple) it surprises many of his fans to learn that originally Sidney Greenstreet made a name for himself in comedies in the West End and Broadway. He was usually such a total villain, or serious actor to the public that his comic talents were ignored. In fact he actually did make four comedy appearances (one a spoof of his villainous portrayals with his villainy partner Peter Lorre in a cameo appearance). His best total film appearance in a comedy was probably that of magazine publisher Alexander Yardley in \"Christmas In Connecticut\" (although his autocratic, half-mad soap tycoon in \"The Hucksters\" is a close second). Despite some problems with the screenplay, it is a good film, and usually revived in the Christmas season.Elizabeth Lane (Barbara Stanwyck) writes a column in \"American Housekeeping\" magazine for Yardley, where she gives household tips and cooking recipes. She is the 1945 version of Martha Steward, except that Ms Steward is a cook and house-owner, and can vouch for trying out and testing what she advocates. Stanwyck can't. Her cooking recipes are those of her friend Felix (S.Z. Sakall), a gourmet chef and restaurateur. The house she describes as her home (a model farmhouse in Connecticut) belongs to her unofficial boyfriend, architect John Sloan (Reginald Gardiner). Gardiner really would not mind marrying Stanwyck, but she is not fully ready to consider a final commitment to him.As the film begins, an American is shipwrecked by the Nazis. This is Jefferson Jones (Dennis Morgan), a sailor. He spends two weeks in a raft before being rescued. Sensing publicity value, Greenstreet decides to grant Morgan's wish to have a genuine old fashioned Christmas in Connecticut. He basically tells Stanwyck that she will entertain Morgan and himself at her farm for the holidays. Stanwyck is unable to explain that the columns image of herself (complete with her ability to flip flap-jacks, and raise a baby she supposedly had with her husband) is a lie - if she does she will be fired, as will her immediate boss Dudley Beecham (Robert Shayne). In a moment of depression she accepts Gardiner's proposal of marriage, and then Gardiner finds his Connecticut home is dragooned into becoming the \"actual\" home of Stanwyck and himself and \"their baby\".Of course, aside from putting off Greenstreet's meddling curiosity, Stanwyck and Morgan find that they are falling in love (much to the annoyance of Gardiner - he does actually expect that Stanwyck will still marry him). Complication following complication occurs, as lies piles on lies, and as neighbor's babies succeeds neighbor's babies, before Greenstreet begins to wonder if he is missing something. But it is a comedy, so everything works out well. Even Greenstreet, at the conclusion, is amused by the entire madness - his celebrated hearty chortle mirroring that of Santa Clause for a change. This is not a classic comedy, certainly not a great one, but amusing enough for the season to be worth watching in December.","This is a wonderful old fashioned Christmas favorite, which I try to catch on TV every year if I can. It revolves around a Martha Stewart like journalist named Elizabeth Lane, charmingly portrayed by Barbara Stanwyck. However, in contrast to Martha, this lady is a phony with no domestic skills whatsoever. The other cast members effectively complete the story, and include Dennis Morgan (Jefferson Jones), Reginald Gardiner (John Sloan), and Sydney Greenstreet (Alexander Yardley).Elizabeth Lane is a journalist who writes food articles, portraying herself as a happily married country homemaker with children. In reality, she is a single woman living in a New York City apartment and cannot boil an egg. Her recipes are borrowed from her Hungarian chef friend, Felix. Elizabeth gets away with her deception until the publisher of her magazine, Alexander Yardley, decides he wants a nice old fashioned country Christmas, and invites himself to visit her, bringing with him a returning war hero, Jefferson Jones, a sailor who had been shipwrecked. Yardley demands total honesty of his employees. To get out of her predicament and save her deception based career, Elizabeth borrows the Connecticut country home of her longtime architect suitor, John Sloan, a dull, fussy chap who has long sought marriage. She also borrows a neighbour's baby (actually, several) to pass off as her own and her 'husband' Sloan's.Of course this scenario makes for much merriment. It's a screwball comedy and a charming romance, with the added attraction of a Christmas atmosphere. Whenever I think of this movie, I picture the snowflakes falling, the tree beautifully decorated, the fire roaring in the hearth, the turkey roasting, and Christmas cookies baking.Why did Hollywood feel compelled to do a remake? I understand there is a 1992 version, directed by Arnold Schwarzenegger and starring Dyan Cannon, Kris Kristofferson, and Tony Curtis. I have not seen this modern adaptation nor do I wish to. This old favorite is perfect just the way it is and a holiday 'must see' along with It's a Wonderful Life, White Christmas, Miracle on 34th Street, and of course all the versions of A Christmas Carol.","Barbara Stanwyck is a sheer delight in this wartime comedy, about a sailor invited to spend Christmas with a popular magazine writer's family, at her farm in Connecticut. The problem is she has no husband, baby, or farm, as she writes about in her column, and she can't even cook; her wonderful recipes being provided for her by her good friend \" Uncle\" Felix, owner of a Hungarian restaurant in New York City.Things get even more complicated when her strict publisher boss invites himself along for Christmas. A scheme is hastily planned, with her stuffy fiancé providing an actual Connecticut farm, neighbors providing a borrowed baby, and a quick wedding planned when the publisher isn't looking. But when the handsome young sailor arrives on Christmas Eve, romantic complications ensue, as the supposedly married author falls like a ton of bricks for the nice guy Navy man and vice versa.This is a charming, warm film that deftly balances humor with sentiment and is a wonderful showcase for Barbara Stanwyck to display her considerable comedic talent, aided by such marvelous character actors as Sydney Greenstreet, Una O'Connor, S.Z.Sakall, and many others. A Christmas night dance at the town hall is a toe tapping delight to see, and the unexpectedly sweet and feminine side of Stanwyck is a wonderful surprise, for viewers who have seen her mainly as tough, bitchy women in femme fatale roles. Truly a wonderful film that has stood the test of time.","I have always loved old movies but this is one of my top ten favorites...it has all the charm, 1940's quaintness, and good old fashioned romance and it's hilarious, to boot! Barbara Stanwick plays an independent single woman who writes cooking\\home life articles for a famous magazine...under the premise that she is a married homemaker. Even the president of the magazine is under this delusion. Enter a handsome GI, (played by the talented Dennis Morgan)just rescued off of a raft along with his buddy. His simple wish is to stay at the homey Inn the she writes so eloquently about and relax with her famous home-cooked meals. She now has to frantically find a way to save her job and reputation...add to this that her fiancé is in a hurry to tie the knot doesn't help. The humor is superb and the chemistry between the leading characters a lot of fun. Throw in the character-actor nicknamed \"Cuddles\" (who fits this name completely) it becomes even more adorable. This has become my must-see movie that I snuggle in with a cup of cocoa each Christmas season. A wonderful, enjoyable movie to enjoy at Christmastime or anytime!","Personally, I don't like a lot of b/w movies, but there's something magical about this movie. The movie starts with Elizabeth Lane (Barbara Stanwyck). \"Liz\" writes a magazine column about how she's the 'Martha Stewart' of Connecticut. Of course, she's lying. This becomes a problem when her publisher, Mr Yardley, asks her to play host to a NAVY sailor over Christmas. In addition, Mr Yardley, who's going to be alone for Christmas, invites himself up to the farm for the Christmas party. From there, things just go crazy.Since the movie is set on a New England farm, the movie has a warm holiday feeling. Plus, the characters are hilarious. Mr. Yardley is always shouting orders, and Liz's friend Felix is always yelling 'Catastroph!' when things go wrong. Finally, the movie ends the way a Christmas movie should end; a jolly fat man laughs and shouts \"What a Christmas!\" In short, no matter what age you are, you will love this movie.","Charming film, funny, and leaves you with a real feel-good feeling.  Does anybody know why all those babies in 1940's films look so . . . well, homely?I like S.Z. Sakall (spelling?), and I LOVED the part where he asks the African-American waiter if \"catastrophe\" is good.  The waiter's reply is so intelligent, you just know he's going to med school nights on the GI bill or something.  This is something simply not seen in films of this era, and it floors me every time.  I wish it could have happened more often . . .","This is our favorite Christmas movie, and we watch it every year. Actually, Christmas is kind of incidental. There is nothing religious or Santa Claus related about it, although there is a prominent Christmas tree in the living room, and Elizabeth Lane (Barbara Stanwyck) has trouble decorating it; also, the war hero, Jeff (Dennis Morgan), sings a Christmas song at one point. It is definitely winter, though, in all its Hollywood splendor. There's realistic-looking snow galore and horses and sleighs to glide through it.The event sequences are pretty incredulous, but this is a farce, and farces are not supposed to be believable. What I like most is the acting -- all of the actors are perfect for their parts -- and the dialog. The dialog sequences fit together like a perfect puzzle. There is one hilarious scene after another, and the fast pace never stops until the end. While the final result is not surprising, the way it's carried out is.Besides Stanwyck playing off Morgan, there's an interesting relationship between Uncle Felix (S.Z. Sakall) and Alexander Yardley (Sydney Greenstreet), two outstanding actors who also played in Casablanca. Sakall is an excellent character actor who is not that well known, but I hope to find him in more movies.Leonard Maltin's Movie Guide only gives this movie 2.5 stars, but I think it is worth at least 3.5, if not 4, stars as one of the most hilarious 40's comedies and an excellent Christmas season film.","It's fun and fast paced, as one falsehood leads to another and another toward an inevitable, surprising conclusion.  The suspense separates this Holiday flick from all others.  One wonders how the pieces are going to fit, both during the movie and in the future.The character actors laid the foundation and entertained us in the process. Sinkewicz (Frank Jenks) shows us what manipulation can get...and ultimately what manipulation can cost!  Uncle Felix (S.Z. Sakall) sizes up each person for us while trying to protect \"Lishka\" (Barbara Stanwyck), and this helps us decide who we are going to root for in the end.If we could ever achieve a perfect world, imperfect people would likely have to undergo a series of events such as these.A glaring weakness is that fake baby cry after it allegedly swallowed Uncle Felix's watch.  I've heard more authentic crying from a doll in a toy store.Watch it, and you'll really feel like you've been somewhere!","I found this movie disappointing. Which surprised me, because I like most of the actors and they do a decent job here. So what's the problem? Well, it all just seems too contrived.Barbara Stanwyck is fine as the female lead, although I don't see this as one of her outstanding performances (and there were many). Dennis Morgan is pleasant, as he always was; I typically enjoy him in a film. Nice to see Sydney Greenstreet taking one of his lighter roles. Reginald Gardiner, not always one of my favorites, is fine here as the husband to be (?). S.Z. Sakall plays S.Z. Sakall (he was no actor...always played the same role...but was adorable). And, Una O'Connor was as delightful, as always. So, the problem is not the actors.The problem is the script. Sort of a screwball Christmas story...but not quite. Disappointing in terms of romance. It had its funny moments, but not that many moments strung together. The only thing that really comes together in the story are the contrived circumstances.I'm not saying it's a bad movie. It's okay. Pretty average. But as much as I love a good Christmas movie, this just didn't light my Christmas tree. Okay to watch...once.","Though it's a Christmas movie, \"Christmas in Connecticut\" could have been done any time of year, as it's the story of a soldier who spends what is to be an idyllic time with a Martha Stewart type. That's what he thinks. In reality, the lady in question, portrayed by Barbara Stanwyck, has a popular magazine column about life on a farm with her husband and baby. She has no farm, no husband, and no baby, nor are the many recipes she publishes hers. They belong to the restaurant owner nearby. When her no-nonsense editor, Sydney Greenstreet, insists that she entertain soldier Dennis Morgan, she enlists the aid of her boyfriend to use his farm, and she transports herself and the restaurateur there. There's even a baby...well, actually, there's more than one. Chaos ensues, and the charade becomes increasingly difficult to play out, especially when Stanwyck falls in love with Morgan.This is such a wonderful movie, and even if you're gravely depressed, \"Christmas in Connecticut\" can lift you right out of it. Barbara Stanwyck is wonderful as the career woman turned homemaker. Despite not being as flashy as Crawford or Davis, she was nevertheless able to do what any role called for - she could be cheap, elegant, warm, nasty, cold, and/or sexy and she makes it look easy. On top of that, she is always attractive and alluring. Dennis Morgan is a handsome and charming solider; as an added bonus, he gets to use his Irish tenor. Fiancé Reginald Gardner is all business, and you can tell he's not quite right for Stanwyck. S.Z. Sakall as the fake uncle/real chef is hilarious, especially as he prays Stanwyck can flip a pancake before an audience.I can imagine the impact this delightful film had at the tail end of World War II. It must have been a real beacon for the better times to come.","I have seen this film several times and never tire of it. It is a witty and clever film and does not need sex or violence to make up for a lack of talent. The whole family can view it and simply enjoy it.","No need to wait until Christmas to watch this laugh a minute film. In this film a War Hero is invited to a life style magazine writer who is a Martha Stewart before there was a Martha Stewart. She makes all her meals look like fine dinning. Her articles talk about her private life which includes her marriage and her child. The problem is that she is lying. She is not married and can't cook. When her boss demands that she take in the war hero she is up the creek. Other problems include that she doesn't have a child. It is a very funny film that you should see! This is the film that many situation comedy show have stolen from.","Stanwyck and Morgan are perfectly cast in what is, in many ways, a modern equivalent of Dickens' Christmas Carol in its sensibility. The success of the film depends on the casting of Sydney Greenstreet as the Alexander Yardley character. Yardley is the modern equivalent of Dickens' Scrooge in the way he exercizes control over his employees -- until the Christmas spirit overtakes him. The role is a 'walk in the park' for Greenstreet who had been one of the stage's great Falstaffs when he was part of the Lunts' company. Greenstreet had only entered films five years earlier when, at age 61, he was featured in what was to become a film classic, the first and best film John Huston ever directed: 'The Maltese Falcon'. 'Cuddles' Sakall was probably never better in his traditional role as the embodiment of middle European gemutlicheit. The attractive set used throughout most of the film is an eye-pleasing gem."],"review-user":["Doylenf","jhclues","jotix100","Snow Leopard","bkoganbing","lindaog","SoftKitten80","edalweber","mrcaw1","steveareno","claudio_carvalho","kga58","theowinthrop","roghache","mlraymond","tntHim","jwhale9382","BLG-2","jwbeauch","fatman-3","vincentlynch-moonoi","blanche-2","estimate","Christmas-Reviewer","Byron Lane"],"review-date":["6 November 2001","20 December 2000","25 December 2004","30 November 2004","6 December 2006","30 November 2004","1 December 2004","18 November 2006","27 April 2004","12 November 2000","9 December 2012","17 November 2005","11 December 2005","6 April 2006","20 December 2007","8 April 2006","10 November 2004","5 October 2002","18 December 2011","3 December 1999","25 December 2013","17 December 2005","3 June 1999","8 August 2016","9 January 2006"],"review-rating":["10","10","9","10","9","8","8","8","8","8","10","10","8","10","10","7","8","9","10"],"review-title":[" Pleasing holiday comedy thanks to splendid cast...\n"," Transporting And Delightful\n"," The best Christmas gift one can receive!\n"," Lightweight But Pleasant Holiday Feature\n"," A Yuletide Man's Favorite Sport\n"," Ultimate Christmas movie\n"," Excellent screwball comedy\n"," Who \"Elizabeth Lane\" was REALLY based on.\n"," Classic Holiday Movie!\n"," A film full of holiday fun!\n"," The Moonlight and the Snowand the Cow\n"," A SPARKLING Christmas CLASSIC!\n"," A Nice Seasonal Comedy, and Sidney Greenstreet finally gets a good comic role\n"," Charming & delightful holiday classic\n"," Heartwarming comedy delightful change of pace for Stanwyck\n"," Old fashioned Christmas romance with a \"modern woman\" touch\n"," A True Holiday Classic\n"," Yes, that's good!\n"," Christmas nostalgia with perfect dialog\n"," The Best Holiday Movie\n"," Fine actors, contrived story\n"," A movie for all seasons\n"," Very enjoyable film.\n"," Martha Stewart is a Fraud\n"," An Undeservedly Neglected Classic\n"]}