{"review-url":["http://www.imdb.com/title/tt0088550/reviews"],"review-text":["Every time I watch Larry King Live, he rolls out the most softball questions for his guests. He rarely gets any useful information because he doesn't ask the hard questions. This comes from his start on radio.King established himself on the radio and basically has not changed one bit of the format for television except for his talking head being visible. He becomes like a puppy for his guests & the only time he really gets useful information from them is whee they volunteer it or a caller to the show actually asks a hard question.Larry is a nice, fatherly type of interviewer. This means he should not have a prime time show on a major news network if you consider CNN one. I don't because of the history of CNN.Copying (ie. Cable) New Network was started by Ted Turner as an alternative to network news in that it could broadcast news 24/7. When it first started, the only TV competition was from NBC,ABC, & CBS. Because of this, CNN Copied the format of their competition & achieved respectable ratings. This worked fine for CNN until they got competing networks which were innovative & provided better/ fresher news coverage. In response to the heating up of competition, CNN went into denial & panned its competitors who were eating their lunch & ratings because CNN wanted to resist change. This didn't work very long & their ratings began to plummet.Now the Copying News Network is trying to re mold itself by re-inventing itself by copying the leading news network format. Unfortunately, this show represents a big piece of the problem. It is 21 years old & showing it's age very badly. Sorry to say, King needs to be moved out of Prime Time or scrapped altogether.","Post 9/11, I watched Larry King every night. He had a panel of political heavyweights talking about the news everyone was talking about. Over time, however, the show regressed into a mediocre Barbara Walters special with most of the guests being three hundred years old and far out of the spotlight, like Art Linkletter. I agree, King still manages to corner the market on topical guests but his knowledge of the topics is limited at best and as a result the interviews often become trite. Case in point, King recently interviewed the woman Roman Polanski supposedly sexually abused umpteen years ago. Having just seen \"The Pianist\" and knowing very little about the topic, I tuned in. Larry knew so little about the account (despite having unlimited access to relevant court documents and media accounts) that he basically took every word that woman said as the gospel. C'mon, Larry get with the program. And please, stop asking everyone where they were on 9/11?","Larry is a perfect example of the Democratic Party in the United States, of which he is a staunch member. King used to be somewhat fair and unbiased and had a variety of guests on. The Party used to be centrist, too, but that was another era. Now, like, Larry, it's Far Left. At least 90 percent of all the guests on King's show in the past year or two are Liberals who sit there and bash President Bush and every Conservative they can think of.....night after night. Bill Mahar, one of the more viscous ones, is - and you can look this up - the most frequent guest in the history of King's TV show. You can count on other outspoken Left Wingers to be on King's show each week, but don't hold your breath waiting for a Conservative. They are few and far between.King was also one of the innovators of the media overkill. That all began with the O.J. Simpson trial. Night after night after night that's all you ever saw back in the mid '90s. Whatever latest gossip on Anna Nicole Smith, or the Petersen murder case, or Paris Hilton, Britney Spears or some other tabloid subject, you can bet Larry will beat it to death. Sadly, all the other networks do the same thing now. Larry was a leader in that regard.King also has the nerve to sometimes give advice, such as on marriage. I am not kidding; I 've heard him say it. The joke is that he has been married and divorced a half dozen times! This man has few scruples, believe me. When it comes to morality, he is clueless. Maybe that's why he has Dr. Phil on, to explain some facts of life to him regularly. Larry will nod, but he doesn't understand any more than when Billy Graham used to talk to him.King also is becoming famous for the \"softball\" interview, meaning he asks no hard questions. That is a lot due to the fact that most his guests are of his political persuasion. People know being on King's show is liking having an hour public relations gig.What all this has meant is a serious decline in ratings the past five years. People see through him and his Liberal-and-tabloid-TV mentality and switched over from King and CNN to Fox News.","As talk-shows go, Larry King Live is not bad, and since he occasionally gets good guests, it's a show to turn on once in awhile, but not compulsively. When Bill Maher, Carl Bernstein, a former president, or other substantive guests sit across from him, it's not too bad. Other times, he tends to host guests involved in the latest celebrity scandal which contributes absolutely no intelligent information to the country and feeds a largely uneducated public that wants to hear the latest gossip about movie and TV stars. During the OJ Simpson trial, it seemed like every other guest on his show was related to the case. But is this really journalism? Or the National Enquirer on the tube? Sometimes, it comes off a little bit like trash television--Jerry Springer in a sit down interview with phone calls instead of a live audience.On the other side, King's show is definitely much better than Bill O'Reilly whose show is nothing more than a rightest-political platform of the Rush Limbaugh variety. That said, Larry King is not a bad interviewer, but alas, he is not a great one. King does not always come off like he completely comprehends when intellectual material is being presented, especially if it is by a scholar or historian with a new book on subtle aspects of politics. Always seems like the minute King can't quite deal with the issue at hand, that's when he turns to the phone calls, maybe hoping someone out in the country will have a better question than he has. He might interview someone like David Gergen, but may not have read any of his books. Sort of like the movie producer that never bothers to read the script.When it's an entertainment celebrity, no problem. He can come off like he's thoroughly knowledgeable since the material is not that substantive anyway. Talking to Elizabeth Taylor about her relationship with Richard Burton is not exactly rocket science. And I notice he usually has seen the star's latest movie. Watching a movie takes much less time and contemplation than reading a book. However, if it's the likes of John Dean or Bob Woodward, King comes off a little like he didn't quite finish his homework. So off to the phones.If you are looking for real in-depth interviewing, Terry Gross of NPR is probably the best interviewer in the United States. She reads and/or researches everything written by or about her guests beforehand and has a working knowledge of those areas. I don't see King quite doing that. Granted, he probably has an audience 1000 times larger than Terry Gross, which may say more about the American audience than King. In short, Larry is better than Bill but not as good as Terry.","Love him or hate him if you haven't yet then learn to respect the talk show king that being Larry King. \"Larry King Live\" has been a key success for CNN now for 16 years, over the years Larry features the people from the entertainment and political world in which they talk about issues concerning life and current times of the world. Larry is a great host as he can ask the tough questions to anybody, plus when a scandal or controversial issue is making headlines this talk show examines best. During Monday thru Friday at 9PM on CNN \"Larry King Live\" has become idolized pop culture so tune in.","I've been a fan of Larry King's show for awhile, I think he does a terrific job overall and I don't think he ever 'wusses' out, as so many people seem to believe. He's a subtle Scorpio, he gets his zings in when he needs to, just as he managed to do last night with Paris Hilton, during her first post-jail TV interview.The thing about this entire case that has really amazed me is that Hilton is still apparently clueless about why Judge Sauer gave her what she believes was a too-harsh sentence (and what's more, actually MADE her serve it) . In all the time she was in jail, supposedly alone 23 hours a day in her cell, she never once, in her mind, rewound the events which led to her being given the sentence that Judge Sauer saw fit to impose on her. She never once realized that it just might have set off a major red flag when she (1) showed up late in court for the original hearing and (2) proceeded to inform him, when he asked her did she not know that her license had been suspended, did she not get the papers in the mail, that \"I have people who read that sort of thing for me.\" All the time she was in her cell, she never came to the realization that this action (showing up late) and that statement -- and more importantly, the attitude - the utter cavalier disregard for the court system and the law in general and her driving privileges in particular that she displayed -- just might have made Judge Sauer (pardon the pun) go sour on her. Last night, on King's show, after giving lip service to how she has been changed forever by her traumatic experience, how she has \"learned\" her lesson, she answered his question, \"Do you think you got a raw deal?\" with a resounding yes. And during the course of the conversation (if you can call it that), she said more than once that she did not feel she deserved what had happened to her. King asked, gently, more than once, if she does not feel she creates the situations in her life that she \"finds\" herself in, to which she pretty much stared at him blankly. She basically, therefore, holds the conscious belief that she's been victimized in this situation; she does not understand how she herself caused it, that day in court, by her cavalier attitude with the judge. I feel this is very sad - tragic, even, considering what a huge \"role model\" Hilton is to some people, and it renders anything she said last night about her so-called rehabilitated state into the realms of complete and utter cluelessness, contradiction and hypocrisy. During the course of the interview, Hilton alluded to spending a lot of time in her cell reading the Bible. At the end of the interview, King scored major points by asking her what her favorite Bible passage was. She responded by groping perplexedly at her pathetic notes (completely superficial non-insights, which she had read on air as if she were Nelson Mandella or something) and finally grunting out, \"I don't have a favorite passage.\" Judge Sauer, in my book, is a hero, and after last night, so is Larry King, for subtly exposing Hilton for what she truly is.","I was deeply enlightened by Larry King's interview with Joel Osteen. I read Mr. Osteen's book, \"Your Best Life Now\" and even though I enjoyed reading the book, I was disturbed by some of the comments made by Mr. Osteen. I brushed my feelings off thinking it was just me because so many people love Joel Osteen. When I read the interview on-line it confirmed what I felt when reading the book; Mr. Osteen thrives on himself instead of giving all the glory to God who put him where he is today. The interview with Joel Osteen ended with the \"icon\" asking Larry King if he was ready to submit to Jesus Christ and Larry's answer was no, I think I'll give a deathbed confession. This is not a direct quote. I hope Mr. King has the opportunity to confess on his deathbed instead of dying in an accident where there is no time to confess anything. My question to Mr. King is wouldn't you rather be living as a Christian and find out there is no heaven than to live as a non-believer and find out there really is a hell? What do you have to lose, except your soul? My prayers are with you, Mr. King.","I used to watch this show all the time one time he had Ron Popeil on his show to discuss the Showtime Rotisserie and Barbecue. At the beginning of the episode Larry asked Ron to put a chicken in the machine and he wanted to taste the chicken at the end of the show because chickens take about an hour and when he tasted the chicken he said something like This Is The Best Piece Of Chicken You'll Ever Have. And then he asked Ron a question but he interrupted Ron and said I've gotta another piece of chicken and went off for another piece of chicken. Another time he had Bob Barr and Larry Flynt on his show because Bob denied charges of pergniry and condemned Larry for false accusations. Another time he had Brenda Van Dam the mother of Danielle Van Dam on his show and Brenda told Larry how upsetting it was to see David Westerfield kill her daughter they used to end their show with a song they also at times discussed movies.","This show has aired for many, many years and is currently still airing every week on CNN! Larry King has many famous guests including actors, actresses, singers, Government peoples, and more! He has conversations with them and asks burning questions such as news and more!! I remember way back in 1996 that the WWF (now WWE) made a skit on Monday Night Raw of his show because CNN is/was a Turner company and the WWF was feuding with Ted's WCW big time that year. How it went was they called the show Larry Fling LIVE, had similar special effects or the intros and logos and there was a guy who played King and two guys that played Hulk Hogan but as the Huckster and Macho Man Randy Savage but as the Nacho Man. The entire segment mad fun of all of them. Anyway this caused some ruckus with King and the WWF never did it again. Anyway I thought that would be a bit of information you didn't know! If you like talk shows and celebrities interviewed then I strongly recommend you watch this program today!"],"review-user":["DKosty123","wjewilliams@yahoo.com","ccthemovieman-1","classicalsteve","Brian-272","Rogue-32","slmorgan","CmHowell99","Movie Nuttball"],"review-date":["13 December 2006","6 March 2003","2 March 2008","26 September 2008","19 July 2001","28 June 2007","30 July 2005","27 January 2003","13 June 2005"],"review-rating":["2","3","7","7"],"review-title":[" A Patsy for his guests- & getting worse\n"," Past its prime\n"," Hang It Up, Larry\n"," Larry King Live: Not Bad, Occasionally Trashy, and May Need a Better Interviewer than King\n"," The talk show that features anybody and everybody of the entertainment and political world, and the tough questions are asked by Larry plus many times the most controversial issues are talked about.\n"," Paris Hilton: Clueless 3 weeks ago, clueless today\n"," Interview With Joel Osteen\n"," This show is my life style\n"," Larry King Live!\n"]}