{"review-url":["http://www.imdb.com/title/tt0090638/reviews"],"review-text":["Anastasia: The Mystery of Anna was a two-part star studded historical T.V. movie based on the Peter Kurth book, Anastasia: The Riddle of Anna Anderson. It keeps up historically pretty much, names are changed etc. But sticks to the real story quite well. Omar Sharif and Claire Bloom do quite well as the Russian royals, Czar Nicholas and Czarina Alexandra. What stuck out in my mind was the all too short portrayals by Rex Harrison and Olivia De Havilland. All in all it was a pretty classy production with some fine acting. I was quite awestruck by the production values when it first aired on NBC in late 1986. Also starring was the fine German actor Jan Niklas who had previously starred in NBC's other Russian epic \"Peter the Great\". I felt that Part 2 skipped over some important details of Anna Anderson's trip to America. It's important to know too, that in 1986 less was known about the Anna Anderson story. Back then it was still not known whether her claim to be the Grand Duchess Anastasia was genuine. By the late 1990's more was known and Anna Anderson is now reputed to have been a fraud. Too bad the networks aren't making fine made-for-television movies like this anymore.","It's a shame, because although this film is entertaining (in an American soap-opera sort of way), the fact that it's so loosely based on the story of Anastasia and the book by Peter Kurth, means it doesn't really live up to it's potential.The real characters of the Romanovs, the uprisal of the Bolsheviks, imprisonment and execution, royal conspiracies, and in general, an accurate portrait of Anna Anderson's life, all take secondary place to beautiful setting, pretty costumes, an attractive cast (most of the acting is quite good) and an unfortunate 80's tinge (too many perms).The film goes off on a tangent, eventually delving into the realms of fantasy and sickly Mills&Boon-style romance. Don't get me wrong, it's a fun film to watch, but had it been more intelligent, more ACCURATE and more sinister & mysterious, it would have been so much more captivating and entertaining. I gave it 6/10.","This is a richly produced, atmospheric telling of the Anastasia legend set against the time of the Russian revolution. It has the look of an authentic, handsome movie of the kind made during the golden age of Hollywood. In the title role, Amy Irving gives what is probably one of the finest performances of her career. Others around her are equally impressive: Rex Harrison, Olivia de Havilland, Claire Bloom, Omar Shariff, Jan Niklas and Susan Lucci.The epic story begins with the start of the revolution and the exile of the family of Nicolas and Alexandra. After fleeing execution, the story follows Anastasia's years of struggle to regain her royal heritage--and the opposition of forces around her who call her an imposter.Winner of two Emmy Awards, two Golden Globe Awards and much acclaim from critics and public upon its video showing in 1986. Well worth viewing.","There can be no doubt that this was an entertaining piece to watch. It had a mixed ability cast with many of the main roles very badly miscast. The pre revolution scenes were too sickly sweet for words. I think the real Anastasia would have found them difficult to stomach. The whole series was loosely based on Peter Kurth's book on \"Anastasia\". It would have been so much better, given the huge budget, if it had been more historically accurate. It is more Mills and Boon than serious drama. It was more a love story between Anna Anderson and Prince Eric than an accurate account. I would have liked to have seen more about the trials. An interesting drama would have not painted the other side all bad like this did. I guess there was an agenda established from the very beginning that there was no possibility of denying that Anna was not Anastasia. That is where the whole thing disintegrates, sadly.","It's out of question that the real Anna Anderson was NOT Princess Anastasia. Apart from very distinctive differences in physical appearance(Anderson's eyes are perceivably larger, lips thicker, nose larger and turned up at the end....etc), Anderson's unable to speak Russian was a ridiculous tell......That's why I detest Anna Anderson and her confederates so much. Not a lot of swindlers have the audacity and endurance to scam for 60+ years with such a blatantly untenable scheme.Yet to some extent I have sympathy for Anna Anderson. Life must have been hard for a young Polish peasant worker in those days. And to impersonate another woman for 60+ years is an arduous task for anybody.She had to hold back her fleshy lips all the time to mimic the thin lips of Anastasia's, and had to occasionally go lunatic to make people believe all her chaotic memory was just a result of mental problem.Anna Anderson was an awesome woman on a wrong track. Had she put her good-looks, learned elegance, endurance, acting skills into proper use, she could of made a first-class actress.On a side note: Some main characters of this two-parter seem to be loosely based on real figures. Prince Erich could be a mixture of Gleb Botkin(believed by many the most possible brain behind the whole scheme), Duke George and Dmitri of Leuchtenberg, and several other figures. And Darya Romanoff seem to be based on the gorgeous Princess Xenia Georgievna Romanova. But unlike the real confederates, Prince Erich was motiveless in this show and supported Anna out of love for and sincere belief in her, which is touching.On the whole this is a great show. Fictionalised a bit but still remains faithful to the reality. The power of Amy Irving's acting lies in that she successfully represented Anderson's self-assuredness, the mixture of impersonating others and being herself is intriguing. Just as Princess Xenia said about Anderson:\"She was herself at all times and never gave the slightest impression of acting a part.\" Highly recommended.","The subject was treated by Anatole Litvak in 1956 .more than its value,it marked Ingrid Bergman's reconciliation with Hollywood and she won an Oscar.\"Anastasia: the mystery of Anna\" is more interesting,more historically accurate because serious studies have appeared since 1956.But by now,it has become irrelevant cause the truth is known thanks to science.It is a good MTV work,even if there's no longer suspense.Older people will salute one of Olivia de Havilland's last appearances as the dowager .Amy Irving does a good job with Anna who deserves to be called \" a brilliant impostor\".","long time, I was very critic about this film. for its status of one of many films in Hallmark style. for a predictable story who could be presented in better manner. and long time I perceived as only good thing the performance of Olivia de Havilland. but the new technology is the best enemy of prejudices. it is not great. but it is beautiful. Amy Irving does an admirable job and Omar Shariff gives one of the most interesting Nicholas II portraits. and, sure, it is almost a crime to ignore Christian Bale in the role of Alexei , if you really are his fan. but, more important, it is a coherent story. and useful adaptation of a case who impress not for its last verdict but for the circle of illusions. story of a myth, it is one of films who gives more than a historical sketch but who reminds the wounds of a period.","It was probably watching this TV movie that got me interested in the debate as to whether \"Anna\" was really Tsar Nicholas's daughter Anastasia. Since seeing it I have made a point of watching various documentaries and also bought a book. Despite the evidence that has been discovered since the film was released, I sometimes still think she was. Such is the power of Amy Irving's acting in this 2-parter which is somewhat liberal with the historical facts, but packed to the brim with tear-jerking drama and Irving's totally convincing performance.I was not consciously aware of Irving before this, though I must have seen her without realizing it in \"Carrie\" (another favourite film). In \"Anasasia\", I never felt for one moment that \"it's only a film\". For me this woman WAS Anastasia, and when part one ended with her in the railway carriage meeting members of the royal family, I knew that come hell or high water I had to see the second part. I just wanted to see how she would prove that she was who she claimed to be, and as the story progressed I felt an intense hatred of Rex Harrison's character, though I greatly admire him as an actor.When I saw the movie listed again in the TV guide, I convinced my Mother that we should watch it, and afterward she thanked me for doing so, being almost as keen as I had been to watch part 2. Then I bought the video and can totally recommend it. \"Anastasia\" is one of those rare TV movies that you simply must watch for the sheer enjoyment of watching the finest acting I have ever seen on TV, and it doesn't really matter whether you believe the legend or not.","I wouldn't be so sure to accept the DNA tests as irrefutable evidence against Anna Anderson. First, read Peter Kurth's book on which this film is based. Anna Anderson knew things that only the real Grand Duchess Anastasia could possibly have known (forensic evidence in Anna's favor aside). Second, compare the pictures of Anastasia and Anna Anderson. Anyone can see that they are one-and-the-same person. Third, visit Peter Kurth's website (url below) where you can read detailed information about the DNA tests, as well as why Franziska Schanzkowska and Anna Anderson are not the same person (scroll down to the link, \"ANNA-ANASTASIA NOTES ON FRANZISKA SCHANZKOWSKA\"). Even Schanzkowska's relatives believed that their sister and Anna Anderson were not the same person.I for one will always believe that HIH Anastasia Nicolevna Romanova and Anna Anderson were indeed the same person; I will never be swayed to the contrary .www.peterkurth.com","The poor woman who was portrayed in this movie would be convincing except for DNA evidence proving she wasn't Anastasia Romonov. Either you believe she was who she said she was or the member of the British royal family who provided DNA and shared a common ancestor with the Romonov's in Queen Victoria wasn't who they said they were which is unlikely, this aside the woman probably believed she was a Romonov even though she obviously wasn't the film seems to make her out as a callous actress who was playing everybody for fools as an alternative for her mental problems said by the surviving family even so this film was entertaining and doesn't end the mystery which was unsolved at the time of it's making but shows it as it was a mystery and I'm glad the DNA evidence is conclusive since there would be people on the internet arguing whether she was who she said she was.","\"I Never Lie\" is stated by Anna Anderson in this highly dramatized version of her life and battle for recognition of the Grand Duchess Anastasia. Unfortunately, that is exactly what this retelling does- time and again. Anastasia: The Mystery of Anna cannot be successfully counted as a biography of this Anna Anderson, nor is it fictional enough to be compelling. Overall, this made-for-TV film has the feel of a documentary created with limited research. It is a shame that the movie shoved aside historical accuracy and important details of the book where an excellent cast was involved (with several large names, including the late Rex Harrison). The first half hour displays a compressed tale of the Romonovs' captivity until their execution the following year using information from the foreword of Anastasia: The Riddle of Anna Anderson, the biography upon which this film is based. The acting was well done, the story close enough to accuracy. Since little is known of the Romonovs captivity and, exclusively, their death, liberty can be taken with this part of the biography with little effect. A half hour into the film, Anna Anderson falls off a bridge in Berlin in 1923. This event, in the book, had occurred in 1920. Later during her first interrogation, 'Anastasia Tchaikovsky' never claimed that her bastard son was dead as she had in the movie; on the other hand, according to her, was alive and well in Rumania. Furthermore, she had never herself claimed that her son was named after her brother Alexei- that was wrongly concluded in a supporter's notes. Anna herself had denounced this statement, explaining that she had named the young Tchaikovsky after her father and not her brother. The acting is well enough and the production overall has the feel of a documentary in cinematography and tone. With a three-hour running time this movie could've well been so; with more attention to historical detail and the book itself. Leaving out details is not an object (such as the facts that Anna spoke some German, French, and English as well as limited Russian and that she was wrongly identified as Tatiana by Clara in the beginning); changing them does. There is only one thing to be said: read Anastasia: The Riddle Of Anna Anderson for the truth. This film is a documentary gone wrong without a doubt and is at best useless.","The screenplay is the worst part of this film, as it lurches from one premise to the next, missing all the important bits that would have made a number of different stories possible. (This film is confusing, because the audience doesn't know what the story is.) I had no problem with the low-production values and the acting wasn't great, but this is telly, so it was fine. I don't mind if some scenes looked like they were done in one take. But having such a non-sensical screenplay is completely unnecessary. Did any executive actually read it before forking out the cash? Avoid this at all costs.The prologue in particular was so poorly written, it needed a voice-over to fill in all the details that had been left out. The prologue was rushed, it wasn't clear what was happening, ie. The Russian Revolution was reduced to \"Some riots are happening in Petersburg\", with the next scene being soldiers arresting them. I know the basic history of the Revolution, so I could fill in the details, \"those pesky Communists\". The prologue is best ignored.This could have been a thoughtful study of a person who is confused about who she is. It sets up this premise in the asylum. It could then have her struggling to identify herself for the rest of the film. No. Gone. The film assumes she is who she says she is (even though there is still no empirical evidence.) It sets up a melodramatic romance, a love so strong, it'll believe anything she says. Okay, a soppy romance. No, because it makes no sense. The love interest seems like a crazed (and incidentally, sleazy) lunatic, bursting out in wild gestures. This also doesn't work, because the film stupidly decides to tell the truth in the monologue at the end. They never got married and she returned to America. The love story collapses. Despite there being plenty of love scenes, I was never convinced of the reason that they were in love. I find rom-com romances more convincing, despite there only being one or two scenes which establish that they've even spent any time with each other.It could have been a thriller-type thing where the film assumes she is who she says she is, and she struggles to prove her identity. No, the court case is summed up rather than dealt with. The bizarre voice over comes back, again to fill in the details of a better film.The funniest thing to consider is what really happened. Anna Anderson was a loony who went to America and married another loony and they did crazy things together. Throughout her life, she had bouts of lunatic behaviour. None of this in the film either. There's a really annoying character in the asylum who crops up from nowhere and announces herself as a 'One Flew Over the Cuckoo's Next/'Twelve Monkeys'-type informant. Thankfully, she vanishes, having brought nothing to the story.","A correct TV drama. But not more. The subject was interesting and the speculations was not insignificant but only virtue of this film is presence of Olivia de Havilland as Maria Feodorovna. After years and canonization of Romanovs, the film is almost nice. Story about a woman who believes be daughter of last Czar , vulnerable Amy Irving and seducer Jan Niklas are parts of an over time and relevant may be short appearance of Omar Sharif, very young Christian Bale or Rex Harrison. The result - easy video, fake problem, trace of an evaporated perfume and few minutes of remembrance of a heinous murder. In fact, only sin of this movie is not stop after the Imperial Family assassination."],"review-user":["BaileySEA","anne-25","Doylenf","aussiebrisguy","SevenPrcntKokaine","dbdumonteil","Kirpianuscus","rhbr26999","GregoriusInLA","FadedOut","WhisperingBells1959","Edmund_Bloxam","Vincentiu"],"review-date":["14 April 2005","19 January 2003","22 May 2001","8 May 2007","23 November 2008","11 July 2008","29 July 2016","14 May 2005","26 December 2005","6 April 2006","4 August 2009","20 November 2009","31 December 2011"],"review-rating":["9","6","5","10","9","6","6","1"],"review-title":[" A Glittering Television Adaptation\n"," Not as good as it could have been\n"," Superb telling of the legendary story with excellent cast...\n"," Entertaining but more like a fairytale than history\n"," Mystery Solved,Yet Legend Still Remains.\n"," Tsarina of the impostors\n"," story of a myth\n"," Great acting in a great movie\n"," DNA test results\n"," Would be convincing except.\n"," \"I Never Lie.\"\n"," Screenplay makes no sense and pieces it together completely wrong\n"," Nice. Maybe.\n"]}