{"review-url":["http://www.imdb.com/title/tt0094910/reviews"],"review-text":["Michael Ritchie's \"The Couch Trip\" is a wonderfully anarchic comedy about what makes a good psychiatrist. It is so subtle and wicked that you start to realize what a stinging satire it really is. It is also Dan Akyroyd's best movie, made in a particularly great film year (1988)for him. First, \"The Great Outdoors\" and now this.Akyroyd stars as John Burns, a career crook who fakes insanity to escape prison. Now, a dumb comedy would just be about this. But \"The Couch Trip\" uses this as a springboard for everything else. Beverly Hills psychiatrist George Maitlin (Charles Grodin, subtly hilarious here)has a nervous breakdown and a replacement is selected: Lawrence Baird, who happens to be Akyroyd's psychiatrist! You can pretty much guess what's going to happen, but the great thing about \"The Couch Trip\" is not what happens, but how it is done. \"The Couch Trip\" gives Dan Akyroyd the best role he has ever had. His John Burns is one of the truly original comic creations in movie  history. Wicked one liners and physical humor are a part of it, but what makes it special is that Akyroyd makes Burns a lovable character. We root for him and grow to like him a whole lot during the 98 minute running time.But Akyroyd isn't alone here. He gets strong support from other great comic actors. Walter Matthau joins the hilarity as a con artist minister who catches on to Burns' secret and commits genteel blackmail. Charles Grodin \"slow burns\" his way to another great comic role as the burned out psychiatrist. Grodin has been one of the most underappreciated actors in Hollywood. It's criminal they haven't used him more often. Richard Romanus plays Grodin's slimeball lawyer to perfection.\"The Couch Trip\" is one of many films made by the now-defunct Orion Pictures Corporation that are currently unseen. MGM spent a fortune buying the Orion library but have yet to truly cash in on their acquisition. \"The Couch Trip\" joins \"Dressed to Kill\", \"Blow Out\" and countless others in gathering dust rotting in the vault. Shame on MGM for their inaction. Hopefully, with new management, \"The Couch Trip\" will find the audience and respect it deserves.**** out of 4 stars","I would agree with the comments already posted to this site by the previous rater.I first stumbled across this movie back in the '80s, when I was employed at a psychiatric hospital. Unfortunately, many of the barbs aimed at the psychiatric profession do hit home. I especially enjoyed the ending, where the psychiatrist would speak thru the door to the hospitalized Grodin. Trust me, its fairly accurate.Of course, doors at most psych hospitals are not locked, nor are straightjackets used much these days, and any hospital MUST be licensed to have a \"padded room\".But a wonderfully underrated film, and certainly one that is quite amusing.Jeff","I am surprised that this, well above average 80's comedy scores only a 5.2 from all the IMDB voters.  Dan Ackroyd does his usual satirical turn as a con who seizes a great opportunity to steal a contract from his prisons physician.  He retreats to California to start his work giving advice on a radio show pretending to be the infamous Dr Lawrence Baird.  The only person that knows he's an imposter is the drunken priest (Walter Matthau) who comes along to be pampered by Ackroyd's new found wealth having blakmailed him. Charles Grodin throws in a good supporting performance too.  For its genre I think this film deserves the same crediblity as 'Ferris Bueller' or 'Trading Places'.  7.5 / 10","Only one comment (as of this writing) on IMDB??  Which is the ultimate example of why this is a very underrated comedy dealing with Aykroyd's escape from a mental facilitly (more like a den for misfits) and masqerading as his hated supervisor/doctor from the nutbarn.  He heads to L.A. with his assumed name to sub for an unstable radio shrink (Grodin) and his candid approach garners him city-wide attention.  He fast talks his way into a big contract and seems on his way.  He gets distracted, though, by knockout Dixon (his real-life wife, how lucky), who is some kind of shrink-producer and also by Matthau's perceptive homeless schemer.  He's onto Aykroyd and says he'll keep quiet if Dan splits the cash with him.  That's just a little of what's going on in this busy little conman adventure, as at the same time Grodin is getting wise with the real doctor Aykroyd is impersonating. And Grodin's wife is also involved with his lawyer, who is seeing dollar signs in Aykroyd, as well is a kiss-butt producer, and annoyingly assisting Grodin is Clennon, the real doctor who is supposed to be replacing him.  There are a lot of great jabs at the psychiatry profession, and the entertainment business, the best being the short but very memorable scene where Aykroyd takes calls on the radio, one of the funniest scenes I've ever watched. Unfortunately, the film ends abruptly and could've used a better knock out blow.  But, from beginning to (near) end this provides a lot of solid laughs and it's too bad that the kind of plot it has doesn't permit another trip to the couch.","As a fan of Dan Aykroyd, I watched this film when it was recently shown in the middle of night on TV. I wasn't expecting much, so it came as a big surprise that I loved it so much.This is the type of film that Dan Aykroyd seems to love to make. A chance for him to 'ham it up' and not take things too seriously. If you loved him in The Blues Brothers or Ghostbusters you'll know what I mean, and you'd be wise to check out The Couch Trip.Avid fans of Aykroyd will also have fun spotting all the tiny links to his other films in the script!I can't describe this film without spoiling it for you, so all I can do is tell you to check it out. I can't praise this film highly enough, and it must surely be time for a DVD release!!","I wasn't expecting much from this movie to be honest, it was on late night television and only stayed to watch it because I couldn't sleep, but I found it funny, original and it has a great cast. This is one of those lost eighties comedies which more people should see. Dan Aykroyd is especially brilliant giving his usual mad perfomance! See it if you can...9 out of 10","One of the most underrated comedies.  Dan Akroyd is hilarious in this over the top role; Charles Grodin gives a performance nearly as good as in \"Midnight Run;\" and Walter Matthau gives a superb comedic performance in this sometimes subdued, sometimes wacky film.  Akroyd and Matthau have great chemistry together....","This was an 1970s-type irreverent comedy, poking fun at the psychiatric profession and at Beverly Hills. I didn't mind that but I did object to more that irreverence regarding marriage and religion: two topics which secular filmmakers (meaning about everyone in Hollywood and elsewhere) just can't stop trashing. Walter Matthau plays a scuzzy character, \"Donald Becker,\" who walks around with a cleric's collar on, which offends me but when has Hollywood ever been worried about offending Christians?Anyway, despite that nonsense the film has its entertaining moments and even some charm to it. Dan Aykroyd is good at paying a nut-case and Donna Dixon (\"Laura Rollins\") is a knockout. I am sorry she didn't have a bigger role.","A patient in a chicago physcriatric hospital is in a war with Doctor Baird. When he intercepts a call for Dr Baird to replace LA shrink Dr Maitlin in his practice and his radio show.  Baird had been selected because he was inept enough not to put Maitlin in the shade.  Burns escapes from the hospital, travels to LA and assumes Baird's identity to get the job.  Issues are complicated when drifter Becker recognises Burns as a conman and tries to get in on the act.This is an earlier version of Dolly Parton's `Straight Talk' - a straight talker gets mistaken for a radio host, gives mad advise but the public love it.  This is complicated by Matthau's conman getting involved and other little subplots.  The plot doesn't always convince or hold the interest but it is quite amusing at points.  The ending is pure laziness as it attempts to milk a happy ending out of unlikely circumstances.Aykroyd is well suited to his character and provides all the jokes here. Grodin and Matthau are both good but Matthau is certainly greatly underused. Really it's Aykroyd's show and everything slows down when he's not onscreen or when he's having to move the story on.Overall this is a very standard film.  It's only amusing when Aykroyd is allowed free reign, for the rest of the film it's dull at times, aimless and meandering at others.  Of the famous cast, this is nobody's finest hour.","The Couch Trip bears all the hallmarks of a failed vehicle to inflate the principal actors' fame at the expense of long-term product saleability. Just watching it, you catch moments that would appear in a trailer - one-liners mostly - yet the overall plot is far-fetched and ridiculous. Some may say that the movie is supposed to reflect the insanity of its protagonist Becker (Dan Aykroyd), but I disagree. The acting is wooden more times than not and the plot's clunkiness is too noticeable to overlook.Aykroyd delivers his character and dialogue with Aykroydesque aplomb, but never really breaks through an invisible barrier of being... Dan Aykroyd playing an obviously Dan Aykroyd role. Matthau delivers perhaps one truly funny line (see the scene where he literally sucks all the jelly out of the donuts using straws: \"If anybody wants a donut without the jelly, they're ready.\") but the rest of the time he treads out a tired role in a way that clearly indicates how unhappy he was making this film. Grodin is just more of the same... a pent-up, angst-ridden bag of nervous energy on the verge of a complete mental collapse - a parody of his repertoire - and delivers a prosaic role.The humour is overtly physical, though much too inferior for successful slapstick. The scripting problems come down to the fact that it was written to the actors' needs rather than the audience's benefit. It accommodates them in all their clichéd glory. No scene illustrates this better than when Aykroyd is in a limousine with the TV on in the background. A semi-witty condom commercial starring Chevy Chase plays - an obvious reference to their on-screen partnership in Spies Like Us - and even here Chase succeeds in being a send-up of himself.Most of the Saturday Night Live crew were involved in many of memorable family of comedies in the 1980s, of which Aykroyd and Grodin are members. The Couch Trip comes across as a quickly thrown-together, industrially-produced, colour-by-numbers replica of National Lampoons, promising funny actors, never delivering.It's a lazy piece of film-making that was intended to give Aykroyd more air-time (forgive the unintentional word use) and barely makes use of Matthau except as a parody of himself.Truly unforgettable.","Dan Aykroyd plays an inmate for the criminally insane who escapes a correctional facility. One day he took a call from his psychiatrist and accepts a job as host of a call-in radio show. Plans his escape to Los Angeles to report to the new job. There a lot of adult humor with no nudity. Not recommend for kids. Worth to watch.","This is a strange, little, forgotten movie from the late eighties.  It's one of those \"Large-cast kitchen sink\" movies that delivers some good gags. If you like the people in this one, give it a shot.","To say I wasn't expecting much sitting down to watch \"The Couch Trip\" is an understatement. I had no idea what it was about - I thought it was going to be a journey into the realm of sexuality when I heard Chevy Chase played a condom man and the movie's title involves the word \"couch trip,\" *wink, wink.* Then I figured out that it had something to do with a mental institute and a patient escaping. My expectations dropped even lower.I was literally expecting a grin movie - the type where you grin once and walk out feeling a bit cheated. And in a way, this is cheap comedy - it doesn't have the greatest gags, the plot is ludicrous, but you know what? I had a big dumb smile on my face the entire time I was watching it.Dan Aykroyd plays John Burns, a patient at a mental hospital who may or may not actually be mental. He gives the psychiatrist, Lawrence Baird (David Clennon), plenty of grief and misery, which leads us to believe he is a sane person after all.Following a little bit of a riot in the mental institute's cafeteria, Burns is awaiting a tongue-lashing from Baird in his office when the phone rings. Burns picks it up, pretends to be Baird, and finds out the caller on the other line, Harvey Michaels (Richard Romanus), wants the real Dr. Baird to come fill in for a radio shrink named George Maitlin (Charles Grodin), who is taking a vacation with his wife, Vera (Mary Gross). Michaels wants Baird so bad he has even booked him a ticket on an airplane.Burns escapes the institute with the help of a receptionist, and drives to O'Hare. He gets Dr. Baird's ticket, gets on the plane, and eventually poses on the air as Dr. Baird. His show is a phenomenal success. \"People love him!\" one man says, and the other man replies, \"It's because he actually cares about them.\"Donald Becker (the late, great Walter Matthau) is an ex-mental patient who recognizes Burns' clothes to be confinement-issued pants and shirts. To keep him quiet, Burns promises Becker a percentage of his income. The secret is kept closed.Meanwhile, Maitlin and his wife get in an argument. He flies home to end his vacation short and realizes that the man on his talk show is not, in fact, Dr. Baird after all, but no one believes him. He gets the real Dr. Baird, but unfortunately he has lost his ID so the police take them as nutcases and don't listen to their story.Let me name just a few of the plot holes I noticed while watching this film: Burns poses as Dr. Baird, but is never asked for his ID, even when claiming his plane ticket (he was robbed, he says, but they would still make sure he is Baird). If Burns becomes so very famous, how come the real Dr. Baird in Chicago never heard people talking about him? Word travels. And finally, why would the police ever arrest Maitlin and Baird (the real Baird, that is) without following up on their stories?To be frankly honest, I couldn't care less. I went into this movie with a closed mind and it surprised me - I really liked it. It entertained me. Its ideas are essentially ludicrous and not at all realistic, but Dan Aykroyd gives a truly spirited performance as a half-a-loon that makes \"The Couch Trip\" a trip worth taking. 3.5/5 stars -John Ulmer","There are a couple of significant problems with this film, although that's not to say that it's not worth watching. After all, I could have just turned if off, but I stuck with it.First, the longer I sat watching the film, particularly in the scenes in the mental institution, I had this feeling that Ackroyd was being very smug here. The \"aren't I just terribly funny and clever\" syndrome. Which is not to say that he wasn't fairly funny. But it bothered me. And, at least in that part of the film, things just happened so easily...and almost totally illogically. Things improved once he took up his role as a fake psychiatrist radio personality.Second, if you're watching this film because of Walter Matthau, you're probably going to be disappointed. He's very clearly the second or third banana here, and that's quite a step-down from his star status of less than a decade earlier. Yes, his role is critical to the story, but just about anyone could have played the park.Charles Grodin always worked out pretty well when a part suited him. This is not one of those times.I don't even know what to write about this movie. It's just \"okay\"; has a few funny moments. But it's just disappointing. Maybe watch it once. I can see why the IMDb is so low.","does anybody know why this movie is called the couch trip? i was just watching it and am still not sure why this title was picked the movie was very funny and its probably my favorite Dan Aykroyd performance it even beats out his Ghostbusters performance i had never heard of the movie before i seen it in a sears store i read the back and thought it sounded good so i bought and when i finally got a chance to watch it, i thought it was better than what i had originally expected. this movie rates as good as animal house and national lampoon's vacation in my mind i wish comedies that have come out lately were written as well as this one was nothing sad happens in it and the bad stuff that does happen are also funny parts if anyone else feels this way and would like to read a comedy script for a movie that doesn't have a sad situation in it email me at killer2511@hotmail.com","Michael Ritchie makes what I call emotional comedies. The best example of this is of course The Bad News Bears which is hilarious but grounded in real humanity by Walter Matthau and the rest of the cast. This film has a good cast and a solid script, but Aykroyd nearly ruins the film by his slapstick performance. This would have better suited by Chevy Chase who handled Ritchie's comedic style perfectly in Fletch.","Dan Aykroyd plays John Burns, a psychiatric patient under the care of the medically inept Dr. Baird. The two share a fierce rivalry culminating in Baird threatening to send Burns to a maximum security institution where he will be used for testing. Baird is also planning on leaving town to fill in for a psychiatrist radio show host who has fallen into a mid-life crisis. There's an identity mix up and Burns is mistaken for Baird, leading to him being the host of the show. But, believe it or not, Burns is actually better than the original host-and he has the popularity to prove it. He soon becomes the most listened to talk show in the U.S. and he definitely has the numbers to prove it. But, eventually the real Baird finds out about the mix up and attempts to track down Burns. What follows is a nice little cat and mouse game of a movie with some pretty decent acting on Dan Ayrkoyd's part. Walter Matthau also gives a good performance as Burns' cross country tag along.The tone of the film is incredibly well balanced and the jokes are mostly hits. In fact, there's nothing too terribly wrong with this film. It's surprising it's gained a reputation as a terrible film. It has a lot of heart in the story and it's very well cast. Dan Aykroyd is perfect as con-man John Burns. His performance is reminiscent of Bill Murray in \"Stripes\", which is an interesting turn for Aykroyd, considering by this time he had been type cast as the techno babbling sideman. It's interesting seeing Aykroyd in a full on lead role.So, overall, \"The Couch Trip\" is a fun little comedy It's nothing groundbreaking or spellbinding-but it is definitely a creative take on the cat and mouse genre. It's definitely not just your ordinary, average comedy.","This was a good and enjoyable 'silly' comedy, that is filled with a whole bunch of crazy fun characters. A typical great '80's comedy, with also some great '80's comedy stars in it.The movie is truly uplifted by its cast. Dan Aykroyd is really great. It's funny but I don't I've ever seen him play the main character before in a comedy. I already always liked him as the sidekick but with this movie he proofs that he can also handle a comedy in which he plays the main character. The movie also further more features Charles Grodin and Walter Matthau, among others. Esepcially Charles Grodin is also great as the stressed out psychiatrist. Walter Matthau seems a bit out of place, since his character doesn't serve a significant enough purpose in the movie, comical-wise.The concept and the story show great comedy potential. An escaped 'menthal' patient takes the place of a psychiatrist. He and his radio show become an huge success. But of course soon things are starting to go crazy again when people start to see through his scam and the real psychiatrists shows up. It provides the movie with some great silly moments and some real great laughs. The movie made me laugh out loud at times, due to how silly it all became at times.But things start to get really crazy toward the ending of the movie, in a not so positive way. The movie tries to put way too much in the ending, both comically and dramatic/morally. The movie gets very crazy and unbelievable and things get rushed way too hard. Even the characters start to not work out as good anymore. The movie tries too hard but it simply fails. The ending just doesn't feel right and satisfying enough. A shame, otherwise I would had surely rated this movie higher.A movie definitely worth watching for a couple of good laughs but it just isn't the best 'silly' '80's comedy around.6/10http://bobafett1138.blogspot.com/","\"The Couch Trip\" is one of those silly comedies that they cranked out in the '80s. In this case, Dan Aykroyd plays a mental patient who poses as a psychiatrist, and he goes to Beverly Hills to sub for Charles Grodin. Most of the movie's humor springs from their satirical look at Beverly Hills and people's empty lives there (a woman has a power struggle with her maid).It's the sort of movie that you just watch to have a good time. Don't expect any kind of religious experience. But you'll most likely laugh a lot at how the Beverly Hills people flaunt their wealth. Also starring Walter Matthau, Donna Dixon, Arye Gross and Victoria Jackson (of \"UHF\").","Couch Trip, The (1988) ** (out of 4) Disappointing comedy about an escaped mental patient (Dan Aykroyd) who is mistaken for a real psychiatrist and he's asked to take over a radio station for a real doctor (Charles Grodin) who just happens to be having a nervous breakdown. The nut-case replacement becomes a hit with all of his listeners except for a homeless man (Walter Matthau) who knows the truth about him. Considering the cast you can't help but view THE COUCH TRIP as a major disappointment. I'm not sure of the history behind this film but it really does seem as if the three leads signed on to do the picture and then the script was written. Then the screenwriters, already knowing they had these comic geniuses signed on, decided to just come up with the weakest idea and try to pass it off as a story. The entire story is basically your typical mistaken identity thing but it just doesn't work in terms of laughs. You pretty much know a story is in trouble when the cast has to work so obviously hard to try and come up with some laughs. This can be seen as early as the first scene when a man is about to commit suicide and the Aykroyd character walks out onto the ledge to try and talk to him. Just watch how hard and over-the-top Aykroyd is having to act and it's because the material is so weak. All three of the actors give it their all but there's just nothing here for them to work with. Aykroyd goes over-the-top playing this madman but no laughs ever follow. Matthau plays crazy better than anyone else but it just makes you smile and never does it get a laugh. Grodin plays the same type of smug character that he's done throughout his career but it just doesn't work here. The entire film is just one bland joke after another and if it wasn't for the actors giving it their all then you would have hit the eject button after about thirty-minutes.","Dan Ackroyd in his prime stars as Johgn Burns, a mental asylum escapee who poses as his own shrink to travel out to La La Land and host a popular radio talk show while the regular host (Charle Grodin in his snarling prime) takes a vacation. Along the way, Ackroyd hooks up with Walter Matthau, a fellow nutjob, and the rest is sheer hilarity. Ackroyd and Matthau play off very well off one another. Ackroyd's stunning real-life wife, Donna Dixon, is along for the ride as yet another shrink. The ending feels a bit rushed and contrived, which is the only thing that keeps me from giving this film my top rating, an 8. A lost '80s gem.","Dan Aykroyd has fun in a fast talking con man role in this reasonably amusing but never uproarious comedy. He plays John W. Burns, Jr., a criminal who faked insanity in order to get a somewhat cushier life inside a mental institution. Burns runs amok at this place, getting it on with the secretary (Victoria Jackson) and making life miserable for his stuffy, hostile psychiatrist (David Clennon). One day he intercepts a phone call to Clennon, who's been selected to temporarily fill in for a hot shot L.A. pop psychiatrist (Charles Grodin) who's suffering from lots of stress. He pretends to be Clennon, and the hilarity ensues as he keeps up the charade in front of Grodins' associates, played by the likes of Richard Romanus, Donna Dixon (the lovely real life Mrs. Aykroyd), and Arye Gross.You know you can't go completely wrong with a cast such as this. Everybody plays their role to the hilt, whether it's Clennon as a guy we'll love to hate, the perfectly chosen Grodin in peak grumpy form, Arye Gross as a pathological ass kisser, or Mary Gross as Grodin's wife. Aykroyd is amiable and charming and as good at ever at getting lots of dialogue out quickly. Good character actors add to the enjoyment: Mickey Jones, J.E. Freeman, David Wohl, Michael Ensign, Charles Levin, Scott Thomson, Don Stark, and others. But you have to pay close attention to catch a cameo by Chevy Chase, who'd acted for director Michael Ritchie in one of his most successful vehicles, \"Fletch\". It's also a joy to see veteran Walter Matthau in one of his more carefree roles, as a self styled oddball who realizes Aykroyd's secret and attempts to blackmail him.The plotting is kind of standard, as we see the highly unorthodox and tactless Aykroyd actually become a real hit on the air while filling in for Grodin. This, however, leads to one of the better gags in the picture as Aykroyd thinks he's found the solution to following through on his promise of free therapy to Grodin's patients. The R rating does allow for some well timed (but not excessive) use of profanity - that actually made it into the trailer!Six out of 10.","Patient; Dr... yesterday I dreamed I was A Wig-Wam. Akroyd as Dr; Hmmm.... Patient; The night before I dreamed I was a Tee-Pee. Akroyd as Dr; Hmmm....It's clear you're two tense.Akroyd; where are you from ? Friend; I'm from Queens. Akroyd: I'm from regular parents myself...It's this sort or slapstick, quick and hilarious dialog with funny situations that makes this movie real fun and happy to watch.I don't agree with the list of 'If you liked this movie...' I would choose 'Dumb and Dumber' or 'Ace Ventura Pet Detective' like flicks...Don't miss this comedy. It's soul rinsing..."],"review-user":["Katmiss","NNY_Shadow","rodnie","mcfly-31","gfjones","DJ-Holly","rrsuther","ccthemovieman-1","bob the moo","qljsystems","cmyklefty","Scott_Weinberg","MovieAddict2016","vincentlynch-moonoi","Brad-D","paul-2148","tuckerconstable-07055","Boba_Fett1138","lee_eisenberg","Michael_Elliott","ctomvelu-1","Hey_Sweden","jimmyro"],"review-date":["29 May 2001","11 December 2005","14 March 2002","1 April 2001","20 November 2002","20 June 2001","20 August 2002","18 March 2007","25 January 2002","24 November 2004","27 December 2001","12 June 1999","27 September 2003","13 May 2013","4 June 2009","22 August 2018","14 November 2017","22 January 2007","1 July 2007","28 November 2011","9 July 2008","12 April 2015","14 December 2012"],"review-rating":["10","9","7","9","8","4","7","10","6","10","7","6","6","7","7","6","9"],"review-title":[" AKYROYD'S BEST MOVIE!\n"," Couch Trip\n"," Very funny underrated 80's flick\n"," effective conman comedy\n"," An Under-rated Gem!\n"," Enjoyable!\n"," Underrated\n"," The Good & Bad Of 'The Couch Trip'\n"," Amusing, but nothing special\n"," A truly underwhelming movie (Spoiler)\n"," Need a good laugh watch this film.\n"," Pretty funny\n"," A trip worth taking...\n"," Disappointing and smug\n"," why this title?\n"," A solid comedy by Michael Ritchie nearly ruined by Aykroyds over the top mugging.\n"," \"The Couch Trip\"\n"," Fun movie that unfortunately gets worse toward the end.\n"," cute\n"," A Failure Considering the Cast\n"," Almost brilliant comedy\n"," Delivers some good chuckles.\n"," Hilariously Looney...\n"]}