{"review-url":["http://www.imdb.com/title/tt0086972/reviews"],"review-text":["Cave Dwellers is actually a sequel and its original title was something along the lines of Ator: The Blade Master. However, this film was done by the same people who did various other films back in the day so they changed the title, changed the credits and added footage from another film in the credits! They have to be the same people who did Pod People too, and what else do this and Pod People have in common? They were both riffed mercilessly on Mystery Science Theater 3000. Not sure why they added the footage from another film as it kind of confuses things, it certainly did with Pod People as the alien in the credit sequence looked nothing like the creature in the film. Here you have a completely looking film all together! The title is rather stupid too. Not the Ator one, but rather the Cave Dweller one as there are Cave Dwellers in the film, but they make up such an insignificant plot point that one wonders what the people at this company were thinking. Heck, the flashback sequence detailing the first film was almost as long as the cave dweller portion of this film! So this company just may have been run by people who liked to edit stuff as a hobby, maybe? The story, a bad guy goes to a castle to get some sort of new weapon or something from some old man who prattles on and on. The old man's daughter must go to the ends of the earth and there she will find Ator and his mute sidekick Thong. Ator is a man of legend who has killed a spider puppet already and he has also mastered the sword and getting buff and greasy! He joins up with the daughter as they set off on a quest to save her father, but for some reason the way back to the castle is much longer than the way to Ator's place. They must fight invisible soldiers, cavemen, wicker wearing warriors, a snake puppet and finally make their way to the final confrontation where the old man will implore Ator not to kill the evil doer so he can be tried...um, Ator has been killing left and right, why stop him now? This made for a great episode of MST3K as it is one of my favorite Joel episodes. I prefer Mike, but here, Joel is on fire as he was in Pod People too. This company may edit a film to the point of lunacy, but the end result is a film worthy of some riffing. Not a film though that I would want to track down and see unedited from said company and Joel and the bots as I just do not see it vastly improving at all. The only way I'd want to see it, is if the female lead got topless or something and I do not get that vibe from this one.So, a bad film indeed. There is better action in the flashbacks than in most of the film and too often there is just way to much lead up until something actually does happen. Case in point, the whole snake sacrifice scene. We get to watch the bad guys send multiple damsels into a hole while the hero's sidekick takes his sweet time making his way to the hero. By the end of the sequence, all the damsels were dead! Not very heroic and it took way to long! Suffice to say Conan the Barbarian would kill Ator in a fight. Heck, this guy is not even as good as Yor: The Hunter from the Future. Now that guy was bad to the bone, he didn't make no hang glider, he flipping used a pterodactyl! That is hardcore Ator! You are not!","The credits come from the Sandy Frank stitching job that was made to turn this movie into Cave Dwellers for re-release.  Now that that's cleared up...oh!  Excruciating, eye-gouging pain.  Blade Master leaps shamelessly on the sword & sorcery bandwagon started by the Conan flicks...except the bandwagon never left the garage anyway.  As such, this Italian flick is a dud trying to rip-off a box office dud, with predictable results.  However, this would give too little credit to the director and writers, who make no effort whatsoever to maintain a coherent plot, continuity, any semblance of era-accurate continuity.  Miles O'Keefe is no leading man, now or forever (Tarzan The Ape Man proved that, if Ator didn't).  Just an unlikeable picture and a chore to watch.","(spoilers) Horrifyingly enough, I have actually SEEN the film that this horrid film was a sequel to.  It was called Ator the Fighting Eagle, and I saw it when I was just 8 years old.  It made such an awful impression on me that i never forgot it.  I've been an MST3K fan for a long time, so when Cavedwellers came out on tape I bought it.  I was horrified to realize that it was a sequel to the wretched Ator movie that i'd seen so long ago! Ator's costume has, somehow, gotten ever skimpier than the last time i saw him.  How can he wear that tiny little bikini?  Doesn't he care that it shows off the fact that he has no...errr...package?  And poor Thong...he gets no lines and no girl, and has to follow that frizzy haired girly doofus Ator around all the time.  Has anyone else noticed that Miles O'Keefe walks like a woman? No wonder he's not interested in the pretty if somewhat lackluster Meela.  The evil but prancy bad guy Zor is more to his taste, I'm sure.  I loved Zor's cardboard spray painted swan helmet, and the way he spent all his time trying to touch some part of Ator.  The fight scenes are so badly choreographed that its a wonder that the swords ever manage to connect.  The dull old guy spends all of his time standing around looking depressed.  Ator drinks from a cup given to him by a guy who hates him, and then looks surprised that they drugged him. He must be pretty smart though-he invented a hang glider in the space pf five minutes ,then flew it into a rift in the space/time continuum so that he travelled briefly into 17th century Bulgaria.  That was after he stabbed the giant snake puppet, of course, and saved the post coital Meela while she sat around doing absolutely nothing. The real hero of the movie was Thong, who saved Ator several times from his boundless stupiditiy, and killed the evil Zor in the bargain. Kudos to Thong, the only competent person in the whole film.","I mean, you just have to love the Italian film industry. Someone came up with a post-doomsday action movie (\"Road Warrior\") and the Italians were busy for years doing one rip-off after another. Then some other one came up with a successful barbarian movie (\"Conan\") and the Italians were busy... eh, see above.Besides countless other variations of the theme (one of my favorites is Umberto Lenzi's \"The Barbarians\" starring the Paul twins) the Ator series was created. And this, the second one, is probably the worst (or best, depending on your point of view).Ator is called back into action by his old teacher, who has discovered some kind of nuclear power that, of course, has to be protected so it won't get into wrong hands. The old man sends his daughter to Ator, and after a few complications Ator, his sidekick Tong and the girl set back to the castle, which meanwhile has fallen to some evildoer (of course, an old \"class mate\" of Ator). Somewhere along the way the heroic trio forgets about the plot and eradicates some giant snake-worshipping cult for the fun of it (not before some virgins are sacrificed). Just in time before the madman finally loses his temper and kills the wise teacher our heroes remember their duties, invent hanggliding and grenades and save the day.Included: terrible acting by all participants (especially O'Keeffe), incredibly hilarious \"special effects\" (you just have to adore the snake fight scene, which must be sort of a hommage to \"Bride of the Monster\"), badly staged fight scenes, numerous continuity errors (Ator flies two different hanggliders during the climatic battle, watch for it, just an example) and an overall non-understanding of the concept of  history (cavemen, \"civilized\" barbarians, castle-builders, all thrown in one film).If you're, like me, devoted to bad movies, this is the one of the series to see, you'll probably end up ROTFL. For the records: the Malta-filmed third part is actually quite watchable.Considering Joe D'Amato's other efforts this is probably his most entertaining movie, as he certainly has failed to deliver watchable horror or erotic movies. But I strongly have the opinion that this was completely by accident.","A bad low budget flick, it is a real pain to watch.  The scenes shown in the credits appear to have nothing to do with the rest of the film.  For some reason this movie, set in the Middle Ages, features grenades, a hanglider, and an atomic explosion.  The main character, Ator, is supposed to be hero because he can defeat puppet snakes and spiders.  For some reason the writers decided to name his sidekick \"Thong\"(or is it \"Fong\"?).  This movie was just another reason to change the channel until MST3K came along, and, as always, made it very enjoyable.  At the end, they give a hilarious review of all the film's continuity problems. The film is titled Cave Dwellers when shown in MST.","Miles O'Keeffe once again assumes the role of the mighty Ator in this the first sequel to the original film.What can I say? - This pretty much represents B-Movie Nirvana! The plot is ludicrous, the script is terrible, the acting is hammy throughout, the special effects....well let's not even go there! - all in all this movie is a veritable delight! Highlights of the film include Ator and Thong (his mute companion, not his undergarments) being attacked by invisible assailants in a cave (certainly saved on the fx budget there!), Ator battling what has to be the most unconvincing giant snake ever committed to celluloid, and of course, the infamous hangliding scene! There's one question I have though......at the end of the movie we see a huge atomic explosion when Ator supposedly destroys the Geometric Nucleus (as the narrator tells us)......how in the hell did Ator destroy it and manage get out alive?! Did he fashion some form of primitive timer/detonator or something? Oh well, such an illogical ending really only adds to the movies overall charm - they just don't make them like this anymore!","It wasn't until the end of the MST3K episode did I note that there was a guy in a fight scene wearing glasses and tire marks where Ator was riding his horse.  This movie stunk like yesterday's gym socks (at least it wasn't bad as 'Manos').  The only things that were good about it were the hunky, Conan dude, Ator, and the riffings from Joel and the bots.  What I can't understand is how the shots of the white guy and the black guy (in the beginning and the end of the film) have anything to do with the movie?  It looks like they were extras off of the film of \"Ben Hur\" or something.","There are plenty of reviews that describe this movie as the worst ever made. For sure there are plenty of mistakes:  lackluster acting, rather boring and cliched and at times paradoxical script, and the stock B-movie sound and \"special\" effects.  As noted, there are plenty of glosses of plot, making _Cave Dwellers_ a tissue of fantasy film, especially in comparison with the Lord of the Rings trilogy.  However, this movie is not the worst movie ever. Most, if not all, (including this review) of these reviews are written by fans of MSTK3.  Therefore, many of these reviews are pretty much summaries of the MSTK3 episode of _Cave Dwellers_.In the episode, Joel, Tom Servo, and Crow remark to the Mad Scientists that this is the worst movie ever sent to them.  Of course, loyal fans have taken this quote and ran with it.  I have found this movie endearing-not in a way that one finds _Forrest Gump_ endearing-but in the effort put into this movie by some the cast.  Also, this movie is laughable without its MSTK3 treatment.  That is because _Cave Dwellers_ does not take itself seriously, and it is not trying to import into its viewers some sort of righteous theme.  For all of the monster puppets, medieval hang gliding, and continuity lapses-this movie does not advertise to be any more that what it is, a shallow depiction of a rather shallow genre.Likewise, I can't bring myself to hate Miles O'Keeffe or Lisa Foster. Instead this hatred is for Coleman Francis, Tony Cardoza, Jennifer Lopez, Arch Hall, Jr., and so on.","As a fan of Grade Z movies myself I'll say this as a word of kindly advice: don't watch this movie as it is!!!  You've been warned!  This movie has tons of continuity problems and the special effects are unbelievably horrible!!!   Cave Dwellers or The Blade Master (or whatever you like to call it) is set in the Middle Ages, right?  Ator and his friends set out to fight some evildoer who sacrifices young girls to an anaconda, and along the way they fight cavemen, invisible swordsmen, an anaconda puppet, and get this, they have to protect the earth from a bomb called a \"Geometric Neucleus\" that posesses nuclear power!     MST3K had every right to make fun of the hidiously terrible movie.  Since when was there hang gliders, hand grenades, and nuclear power back in the Middle Ages?!   Other bloopers that were mentioned were the hang gliding scene, and as anyone can see, Ator was flying over a modern city, and a caveman wearing sunglasses?   And who can forget the infamous 'tire tracks' in the background at the end of the movie?  Heck, even Joel and the 'bots were complaining about this literally bad movie!   If you're a fan of bad movies and you want to check this one out, it's only worth watching on MST3K!  Another thing I can't believe is that these Ator flicks even had a prequel and some sequels!  You would probably feel sorry for Miles O'Keefe for even participating in such stupidity of this type of  entertainment.  But the movie is funny, and the MST3K version is even funnier.","There's simply no redeeming quality about this film. OK, some of the costumes are OK, but they're nothing you can't see in, say, the Conan flicks. And what's up with Ator's hair? I can't believe this is part of a series! I will say one thing about this film: it was deemed bad enough for a righteous lampooning by the early cast of MST3K and I suggest to anyone that's curious enough to see how bad this film is to watch that version of the film for moral support if nothing else.","BOOOOOOOORRRRRINNGGGGGGGG and STOOOOOOOPIDDDDD. Kept falling asleep. If you want to see Miles O'Keefe loping around in a furry Speedo by all means rent this movie. If not please don't bother... Rife with anachronisms. Was this supposed to be set in the Ice Age, the Iron Age, the Steel Age or the Age of Reason? What was the reason for the black nylon wig on the guy dressed up as Genghis Khan? Was that really supposed to be Genghis Khan? If Ator had access to so much advanced technology and science why did we have wait another 1000 years for Leonardo? It's never clear where Ator comes from or if he's supposed to be some superior sort of being. You wonder if it was all explained in the first movie but after seeing this one you KNOW you'll never bother.","Just to advise people out there that there are some folks, such as myself, who relish watching the actual movies used on MST3K. At present, my collection of such films is in the dozens, including such hallmarks as Cave Dwellers, Pod People, Manos: The Hands of Fate, Hobgoblins, Final Sacrifice, The Screaming Skull, Boggy Creek II, The Beast of Yucca Flatts, and many, many more. Frankly, I find it enjoyable to provide my own commentary, not just suffer through what isn't always particularly funny from Mike/Joel and the bots. Granted, I have suffered some degrees of pain while watching these films, but you should give it a try. Some elements of the films, like the \"Hear the Engines Roar Now!\" song in Pod People are completely obscured by the overdubbed commentary. If you want a truly unique experience, watch the episodes, and then rent the films themselves.","This was the second MST3K'd movie I ever saw, and still holds a place in my heart as one of the most hilariously awful film experiences you are ever going to have. Miles O'Keeffe (sp?) is in this, using his chiseled physique to score another payment on the mortgage on his condominium. He's stiff, wooden, and unconvincing, but he still comes across as a cool, likable guy, and at least he's photogenic. That's the only decent I can find to say about the movie, so I thought I would get it out of the way right up front. The fact that he is in the movie adds another point to the score and saves it from being a \"1 out of 10\". In no particular order, examples of how badly put together this film is:1)OK, the Tanya Roberts clone (Mila) quests to 'the ends of the earth' to find Ator, which takes 3 minutes of screen time, including the time she spends stumbling around dying from a poisoned arrow in her shoulder (which I assume would have slowed her down quite a bit). So Ator heals her up, and takes his trusty aid Thong and sets out to go back to the her castle...and proceeds to take the next 50+ minutes of the movie recovering the ground that Mila traversed in 3 minutes. How does that work??? I know that the intrepid crew is being harassed by magical forces and enemies etc. on the way back, but still...!2)Apparently the writer/director felt the need to add 'depth' to the film by adding a running debate/Socratic dialog/game of 20 questions between Zor (the mean John Saxon wannabe) and the wise man Akronas (the Richard Harris wannabe). But Joe Damoto apparently got his philosophical training from Hallmark cards, T-Shirts and bumper stickers, and he doesn't understand tempo, pacing, or timing...and neither do the actors. (Crow's remark during one of these exchanges is the tag line for my entry). The scenes with these two drag on and on, bringing the movie to a screeching halt and killing any momentum or excitement generated by the sword-fighting and questing of the heroic trio.3) Once Ator arrives at the castle (and is captured), things go even farther downhill. Zor decides to feed a bunch of women victims, along with Ator and Mila, to the Serpent God he keeps in his basement. This scene had some potential for excitement, so the director immediately kills this potential by instilling the scene with all the drama of people waiting in line at the DMV to pay their traffic fines. Ator proceeds to have a big battle with the Serpent that is barely more convincing than Bela Lugosi's battle with the rubber octopus puppet in \"Bride Of The Monster\". 4) The climactic scene, in which Ator invents the hang glider out of twigs and animal skins, is so patently silly that it completely blows the viewer out of the movie and makes you roll on the floor, laughing until your sides hurt. 5) Oh, yes, and the filmmakers decided to include stock footage of an atomic explosion at the end, with the moral that Ator decided to destroy the 'atomic nucleus' McGuffin that drives the movie because mankind was 'not ready'. (\"Zzzzip! MESSAGE COMING IN!!!\") Just like \"Bride Of the Monster\" again, come to think of it. All it needed was a bystander to observe, \"They tampered in God's domain.\"6) For some reason, the version of the movie I saw features introductory and closing homo-erotic credit sequences that have absolutely NOTHING to do with anyone or anything else in the movie. I have no idea where this footage came from, but it is actually WORSE than the actual movie it bookends. Watch this only if you are a big fan of Miles, or if you enjoy the way MST3K skewers material like this.","The Blade Master, alternatively titled Cave Dwellers, is a pathetic Conan the Barbarian rip-off that was made in Italy and dubbed into English. It was made on a very low budget by people who knew virtually nothing about acting or directing, but that still doesn't explain how things went so horribly wrong. I suspect the writer(s) may have been smoking something.The titular hero is the beefy, Ator, who we first see in the opening credits, sneaking through some caves alongside a black man who is never seen in the actual movie. It's hard to tell what is actually going on because there's no sound, the footage is extremely choppy, and the lower half of the screen is blacked out so we can read the credits. Our first proper introduction comes in an extended flashback in which some philosopher/monk/king tells his daughter Leila Ator's life story so far, which I suspect occupied an entire previous film. No sooner is this father/daughter story time finished then the castle is attacked by a horde of barbarian horsemen, and Leila flees to call Ator for help. She finds him of course, along with his sidekick, the unfortunately named Thong. Then it's up to the three of them to save Leila's father, and the kingdom, from the bad guy.This movie's biggest problem, aside from the lack of any money or talent, is that it never quite gets its act together. It never establishes the time and place. I can't tell whether all this is happening in prehistory or in the middle ages. I'm also not sure if this is supposed to be Earth or if it's some mythical realm. I don't think they ever refer to the kingdom by name.Nor is there much sense of scale or space. For instance, Leila's father tells her that Ator's home is 'at the ends of the Earth.' Yet after escaping the castle, she arrives at Ator's cave in the very next scene- with the arrow she was shot with during her escape still embedded in her chest! This would lead one to believe that the ends of the Earth weren't so far after all. But then they spend the rest of the movie returning to the castle. I don't know how that works, and I suspect that neither do the writers.Anyway, while the heroes are having their adventures, the bad guy is holding Leila's father prisoner. He doesn't kill the old man because he wants to discover the secrets of a powerful weapon known as – I'm not making this up- the geometric nucleus. But his method of interrogating the old man is rather strange. Rather than torturing the knowledge out of him, the evil warlord engages him in long, boring conversations. I very much doubt that any real people have ever spoken the way these two do. The bad guy sounds like a Republic serial villain, and Leila's father sounds at various times like a fortune cookie, a teenage socialist, and an educational video on the importance of the modern justice system.Not that the other characters have dialogue that's much better. Ator is established early on as having been the old guy's most brilliant student, a master of magic, science, and natural philosophy. Yet when he opens his mouth he talks like a first year English-as-a-second-language student, which he may actually be. At one point he gives a less than rousing speech laying out the blindingly obvious strategy for an upcoming battle, and then the battle never takes place! Did they mean to film the battle and then run out of money, or was the speech intended as a red herring? I don't know, and I'm not sure it really matters.Now I've put this off as long as I can, but there are two scenes in this movie that leave me asking \"What the hell were they thinking?\" The first comes when the heroes storm the castle. Ator tells Leila and Thong to take a secret passage into the fortress while he prepares a distraction. \"He's up to something\" remarks Leila. Boy is he ever. Cut to Ator jumping from a cliff- aboard a hang glider made from ropes and skins. WTF!?! He actually flies- and drops bombs! - from a hang glider. At this point they might as well bring in the Great Gazoo atop his flying saucer.But as unbelievable as the hang-gliding scene is, this next one takes the cake. At the end, as Ator rides off into the sunset, the movie cuts to footage of an atomic bomb test, while a voice over guy intones that modern man would do well not to unleash world destroying powers, etc. Once again, WTF!?! They actually put a clear anti-nuclear warning into a sword-and-sandal B-movie! One might as reasonably slip a message about overpopulation or credit card debt into a pirate movie. I don't know what they were on when they decided to make The Blade Master an issue movie, but I'm guessing it was something pretty strong.Now let me think, is there anything else I should mention before wrapping up this review? Oh yeah, there's a scene where the good guys nearly get sacrificed to a giant snake. It's a bit hard to tell because it was so dark, but I think the snake-god was a massive plush toy. And I'm fairly sure that the princess's chest plate was a hubcap. When the leading lady is given a hubcap to wear, it's safe to say you're watching a true no-expense-taken enterprise.","This movie is like Conan.  It even has a human sacrifice scene where 5 virgins are fed to a giant snake.  Overall it was a good movie, exotic locales and beautiful women.  The women that played the human sacrifices were very beautiful.","This film must have been quietly released on some other side of the world, perhaps even in English. Hopefully nobody understood a word, not there's anything to understand in this movie anyways! Haahaa! Call me a nut, but I think this is one of the best movies ever. Why would I come to that conclusion?? Because it's my national pasttime to sabotage horrible films and this one begs for it every other minute! Once I became a fan of Myster Science Theater 3000, I had no doubt in my mind they'd find it somewhere and use it. Sure enough! The version they acquired was entitled \"Cave Dwellers\" using some strange intro footage not even from the film itself (apparently, they were ashamed to use footage from their OWN film!). I can't say I recommend buying this film. Rather, I highly recommend getting the MST3K version. Sure to find it most anywhere MST3K DVD's are sold, don't miss out!","This is about one of the worst movies I'd ever seen.  It's not the worst though - Manos the Hands of Fate holds that honor.This movie has a lot of problems.  To begin, this whole movie is a cheap rip-off of the Conan movies.  There's the babe in a skimpy dress wearing a hubcap, the quiet Asian warrior, the cookie cutter bad guy, the almost mindless soliders, and so on.  There's lots of continuity errors in this film.  Some of the dumbest errors I've ever seen are in this film.Fortunately when I watched this film I seen the MST3K version.  Joel and the 'bots make the film watchable, otherwise I probably would've turned it off five minutes into the film.","Ator 2: L'invincibile Orion (1984) 1/2 (out of 4)Really bad sequel has Ator (Miles O'Keeffe) having to travel to try and save his mentor who has been kidnapped by the evil Zor (David Brandon).ATOR, THE FIGHTING EAGLE was a pretty bad movie but thankfully it had enough campy moments to make it entertaining. It also had a pretty good battle at the end, which also helped keep it rather entertaining. That film obviously had a low-budget but it seems this sequel has even less of one and the end result is just a downright awful movie.It's amazing what campy or laughs can bring to a bad movie. This one here really doesn't have either of them, although there's one sequence where a woman falls into a pit of rattlesnakes and it seems the rattle sound effect is coming from a baby's toy. Outside of that this here is a pretty dire film from start to finish. There's really not a good thing that can be said about it and sadly nothing is bad enough to where you can laugh.The performances this time around are just as bad as the first film with O'Keeffe returning but acting even less. Brandon has to be the most nonthreatening bad guy in movie history. He's meant to be some sort of great God yet he probably wouldn't scare a group of five- year- old girls. The supporting players are all bland and boring as well.ATOR 2: L'INVINCIBILE ORION was released under countless titles and probably got it greatest bit of fame thanks to Mystery Science Theater 3000. I haven't seen that version so I can't compare but this one here is certainly without any laughs or entertainment value. Sadly, this here wasn't the worst Joe D'Amato directed picture.","I've never watched Mystery Science theatre so can't comment on that, however, I have watched Ator the Fighting Eagle and is was so much better than this. What were you thinking, Joe D'Amato?This time, William Berger is some scientist who has invented something and David Brandon of Stagefright wants the secret, but Berger's daughter has done a runner with it so it's up to the world's best Brian May enthusiast to sort things out. Only this time he don't have a bear sidekick, or does anything cool, or anything, because this film is talk, talk, talk, and not much else. Where's the giant spiders, zombies, and Laura Gesmer of the first film Joe?This time, Ator ruminates on things, uses science, and talks with folks as we look at how much time has passed and wonder when the film is going to get good. Luckily it does, but you don't get anything particularly outlandish here except for Miles in a handglider. But still, not so good.","*Spoiler/plot- The Blade Master(Cave Dwellers), 1984. In a time of ancient swords and sorcerer, a young man explores and fights for good.*Special Stars- Miles O'Keeffe, Lisa Foster.*Theme- The future is much like the ancient past.*Trivia/location/goofs- Color. Italian. This film was produced quickly and cheaply to try to cash in on future release of 'Conan the Barbarian' film. The film had no script, and mostly had improv scenes. Goofs: Watch for obvious tire tracks in ancient battle fields, hand rails on ancient castles, and sunglasses wearing barbarian 'extras' during battle scenes.*Emotion- The lead muscle bound performer, Mr. O'Keeffe says working in movies is not a career, and it shows here. A horribly confusing and 'could care less' film with a group of comic book characters performances just as bad. This offering is utterly forgettable as a film presentation. Not even worth a campy B-movie status, just horrible and a waste of your time.","Considering that this is a film about a muscle bound, sword wielding hero, it is surprisingly boring. There are several scenes of looong dialogues that have no impact on the plot and other unnecessary scenes that make the movie more drawn out than it has to be. However, when something actually happens it is fairly enjoyable in a comical sense, as the actions scenes are very poorly choreographed and executed. The best part is the 1/4 of the film where it seems the film makers ran out of story and just threw in everything they could imagine, no matter how stupid. There are hang gliders, bombs and even a nuclear explosion, as opposed to the cavemen in one of the opening scenes. That's just thee kind of thing I like to see in this kind of movie, more of that and less boring dialog would have made it, well, not good, but funny. As is, it was really rather meh.","Why yes, I do have a question. In fact, I have several questions.One - What was the deal with the opening and closing credits? I get the fact that they're living in the same world as it's all primitive and what, but it might've been nice if they were actually in the same storyline. The beginning credits consisted of a bunch of weirdos in loin cloths more or less frolicking through some overgrown shrubs and the ending credits consisted of some weird turkey-headed guys with spears escorting some other weirdos in loin cloths through a cave and then two of the weirdos smile at one another. Continuity anybody?Two - What was the deal with the prologue? Yeah, it was good background to explain Ator's origins, but the scenes were detailed and produced well enough (and that's saying a lot in a movie with garage sale quality props) that they could've very well been their own movie. Were they? Is there some prequel I'm not familiar with here? If there is, I wanna see it so I can compare it to this so-called movie.Three - What exactly was the old guy's discovery? Was it a rear view mirror that contained some kind of atomic particle, which might explain the mushroom cloud at the end of the movie? A mushroom cloud, which by the way would've completely vaporized Ator if he was anywhere near it when he destroyed it even though we see him riding his horse unscathed through an open valley (with four-wheeler tracks seen at one point in the background) before the end credits.Four - Where did Ator keep his hang glider? In his hair? And why was he flying it over Mad Ludwig's castle in Bulgaria like he'd entered Pink Floyd's \"Learning To Fly\" music video? The two castles looked nothing alike!Five - How could the girl have reached the ends of the Earth so quickly? I know it's the power of editing, but if it's any indication of her travels since she didn't take along any provisions from home, then the world must be considerably smaller than anyone would've guessed.My head's hurting just trying to think of answers to these questions.","Ator is an Italian rip-off of Conan The Barbarian, obviously filmed in a short period of time and with practically no budget. Apparently a big part of the film is improvised. It delivers everything the B-movie lover needs: Crappy acting, bad special effects (think of the invisible soldiers), cheesy synthesizer music, dramatic zooms and hilarious monsters. There's no need to go any further into the story of the movie, because it really doesn't play that much of a role.What makes me not like this movie as much as I like other B-movies is that it isn't THAT bad all the time. It has some decent scenes. It's not bad enough to be good again, but it's still an enjoyable flick.","Like all sword and sorcery fans, i sincerely expect that the next sword and sorcery flick that i can get, it would be better..but i always fell in the same mistake all over again...do you know what i mean?Im sure you do... What can i say about \"Ator the invincible\"...hum..its really bad, one of the crappiest ultra-low-budget sword and sorcery flicks i ever seen, even worst than \"Ator, the Fighting Eagle\". Milles O'keefe is bad, Lisa Foster is awful as actress, but is a beautiful girl (maybe the best thing in the movie). Zor,NOOOOO...ITS ONE THE WORST BAD GUY EVER, is a Genghis Khan rip off with a fake mustache!!!!The plot is terrible, i think everything is terrible in \"Ator the Invencible - 2\"...But what can we say...definitely, along with \"Gunan il Gerriero\" (Franco Prosperi) and \"Wizards of the Demon Sword\" its the WORST sword and sorcery flick ever made, JOE D'AMATO F@CK YOU!. If you like this one, i recommend: ,\"Gunan il Gerriero\"(Franco Prosperi - 1982); \"Ator, the Fighting Eagle\"(Joe d'Amato) and \"Warrior and the Sorceress\"."],"review-user":["Aaron1375","Gislef","Oosterhartbabe","Pucki","GeneralB","HaemovoreRex","Shannon-32","kilgore2345","wishkah7","paulo20","slurmuole","smcrabtr","lemon_magic","williampsamuel","jlsa18","dogeymon","jgreen8824","Michael_Elliott","Bezenby","oscar-35","a-twetman","TitusYorick","fritzgagi","buchass"],"review-date":["12 November 2001","28 December 1998","3 May 2004","20 February 2000","31 October 1999","12 June 2005","30 June 2002","5 March 2004","9 June 2000","13 June 1999","3 August 2005","10 February 2006","17 April 2005","6 December 2014","17 May 2001","21 October 2005","29 December 2003","8 March 2017","12 April 2015","5 April 2013","28 February 2013","19 January 2012","12 December 2010","26 April 2010"],"review-rating":["2","1","1","2","9","2","1","1","1","2","1","9","1","4","3","2","3","1"],"review-title":[" Ator fights evil in all forms including puppets.\n"," Hey, those ain't Ator's Opening Credits!\n"," Heh-Dude looks like a Lady!\n"," Something you just have to love Cinecitta for...\n"," Also called Cave Dwellers or REALLY BAD ITALIAN FILM\n"," A non stop laugh fest\n"," Great MST3K fodder!\n"," A poor movie from a badly treated genre\n"," Watch the MST3K version of this movie!\n"," Ator's hairdo is so queer\n"," Ator the What?\n"," \"Proud\" owner of the actual movie, not just MST3K version\n"," \"I say...I could drive a truck thru one of your cues! Tempo! Pick it up!!!\"\n"," Makes Conan Look Like a Classic\n"," Cool movie\n"," Best of the worst!!\n"," This is almost one of the worst films ever.\n"," Really Bad Sequel to an Already Campy Original\n"," Guns don't kill people, Ator does\n"," Horribly confusing.\n"," Hang gliders, cavemen, bombs and boring conversations.\n"," Any Questions?\n"," Enjoyable B Movie\n"," The zero degree of Sword and Sorcery Flicks...\n"]}