{"review-url":["http://www.imdb.com/title/tt0141825/reviews"],"review-text":["This little-known TV film is about a young high school track runner who gets sexually assaulted by her coach. Since she idolized and trusted her coach too much, she was unable to disclose that fact at first. Simple plot, yet it somehow managed to keep the viewer interested till the ending. Ariana Richards (Jurassic Park etc) plays the lead character with enough sincerity, but all the other actors had a bad time. I know I'm not to expect too much from these productions but I have to say that the script is really bad. There are some dialogues that seemed to have been written by simply non-professional people. Given a better script I honestly think the movie would fare better. The good thing about this film, although, is its simple and straightforward style of storytelling without falling for any exaggerations. I guess that's the reason that it won't appear awful to the viewer in a single watch.","Race Against Fear has to be one of the most moving TV movies I've seen for a long time.  All of the performances from the main actors were superb, especially that of Ariana Richards (Mickey Carlyle), William Bullimer (Coach Kurt Ansom), and Susan Blakely (Margaret Carlyle).  Ariana in particular put on an extremely emotional performance, with facial expressions to match. She portrayed the emotions that Mickey was feeling perfectly, and you could easily believe that she really HAD been raped, so realistic was her performance.RAF is an incredibly realistic movie, due to the moving performances from the cast.  Bullimer came across as a rapist incredibly well, and you hated him more and more as the movie progressed.  Blakely also put on an emotional performance as the mother of the raped girl (Mickey Carlyle), and you felt increasingly sorry for the Carlyle family because no-one believed them about the rape.All in all, RAF is a great movie.  It is both moving and full of suspense, as you are continually unsure if Ansom would be prosecuted for the rape, due to the lack of witnesses, evidence, and belief in the claim.  I thoroughly recommend seeing this movie.","It's funny how my opinion on this movie has changed since the first time I saw it. I caught it on NBC when it first premiered and boy, did I think that it was good. I made the mistake of not recording it and for a while after that I looked EVERYWHERE for it. Couldn't find it but finally Lifetime came to my rescue. Lifetime is known for helping me out with those movies that I can't find anywhere else. I watched it again the other night and guess what, I hated it.The plot is simple. The movie starts off good but soon travels downhill. It takes a while for the movie to actually get going, but it finally does. Oh, and it has the one thing in movies that bugs me the most: it starts off showing what will eventually happen. That irks me to no end. I mean I knew what was going to happen, but it still frustrates me when that occurs.\nSo, it drags on, and it drags on, and it drags on. It's entirely too slow.I feel bad criticizing the acting here, but it has got to be done. I liked Ariana Richards in 'Jurassic Park' no matter how minor her role was. She is just awful here. Seriously, I haven't seen such bad acting since I went out and rented a Bette Midler movie. Oh, yeah, I don't like Bette Midler. Richards is just so...so...boring. She puts absolutely no emotions into her words, which results in her character being not likeable. I at least didn't like the character. Susan Blakely, on the other hand, is really good. Good acting, good character development, no complaints from me in that area. William Bumiller wasn't anything great.This plot has been done so many times that it needs to be put to a rest. 'Race Against Fear' is slow-moving, predictable, and has some very, very bad acting. I would not advise anyone to watch this. I'd suggest another TV movie: 'She Fought Alone.' It's basically the same idea and I know that I said that all movies along this line need to stopped, but it IS good; a lot better than this horrible thing.","Another paint-by-numbers movie from Lifetime that has you shaking your head that such things still get produced. Ariana Richards plays high school student Mickey Carlyle, a promising track star. Kurt Ansom (William Bumill) is Mickey's track coach from hell who pushes \"his girls\" to be the best they can be. Susan Blakely has a fairly empty role as Mickey's widowed mother.Richards has that fresh scrubbed look typical of high school teenagers and she does a good job with what she's given, which is pretty bad. Her reactions to her coach's increasingly inappropriate actions are fairly authentic. And her tenative interactions with her beau are believable.*SPOILER ALERT*However, it's after Mickey is sexually assaulted by her coach that the movie goes off the deep end. Mickey stops going to track practice and starts skipping classes. When she sees him in the hall, she doesn't act frightened or freak out. He acts like nothing's happened. She acts like nothing's really happened. This is totally unrealistic. She even returns to practice, although she has little heart for it now. It's only when he attempts to assualt her again that she's jolted into telling her mother.\nThere's one scene that features Mickey's classmates individually telling her how awful they think she is for turning in the Coach. It is so hideously \"time to gang up on the victim\" time that you want to cringe. Then again, subtlety was never Lifetime's strong point.Of course, there are the usual twists and turns. Will Mickey recover from her trauma? Will the awful coach be convicted? Will her friends believe her? It's all so hollow and predictible that you know what's coming.\nKudos to Richards ability to show her acting chops. But please get this kid a good agent who can find her some decent acting roles. This movie tanked.","Broken Silence or \"Race Against Fear\"1998): Starring Ariana Richards, William Bumiller, Susan Blakely, Tracy Ellis Ross, Teryl Rothery, Scott Vickaryous, Marissa Rudiak, Ken Camroux, David Neale, Bruce Dawson...Director Joseph Scanlan, Screenplay Sara Charmo, Jean Gennis, Phyllis Murphy.This is another Lifetime channel film, made exclusively for television, released in 1998, directed by long-time TV series director Joseph L. Scanlan. Inspired by true events, it's a lot like the majority of Lifetime movies, a cautionary tale for women, raising awareness of the predator lurking within the family (a mother, father, wife, husband) and mentor (teacher, in this case track coach). The young and little known actress Ariana Richards (she played the small girl in Jurassic Park)delivers a highly convincing performance as high school track athlete Mickey Carlyle, who is raped by her coach, Kurt Ansom (William Bumiller) and must suffer in silence as no one believes her story, except for, of course, her own mother (Susan Blakely). Together, mother and daughter fight to put Kurt Ansom behind bars. The film drags on quite a bit, is ultimately predictable, at times far too melodramatic for the sake of drama itself, but is genuinely powerful in the end. Ariana Richards' performance is of the daytime soap kind, but she is the strongest in the entire cast. Her facial expressions, body language and overall acting is realistic in terms of how she, as an aspiring athlete, idolizes her coach, is in turn violated by him and must now live with the shame, trauma and further, fight him in court. William Bumiller plays the part with a nasty sort of duplicity, though he is far from subtle. He has abused other star athletes before, who have remained silent and made it to the top, and appears outwardly innocent. William Bumiller, a lesser-known actors like the others, has has never done a role like this but but he does a believable and strong performance overall. It's especially disturbing to see him in this role because he is a sexy lead actor in everything else he does including some lesser known films and on the soap opera \"Guiding Light\". The only real problem I had with this film is the manner in which the film is structured. As the film opens, we watch Coach Ansom about to rape Mickey, letting us know right away that this guy is no good. But this makes for weak character development and story. If the first scene had instead been the sequence with the opening credits in which we see Mickey running/jogging in the city across a lake, we would have better character development because we don't know that Coach Ansom, while seemingly interested in the success of his star athlete, is really a nasty piece of work and we would have seen Mickey idolizing a person whom she thought she knew and then received a rude awakening when she realizes she was wrong about him. Director Joseph Scanlan is no stranger to drama for TV (Knott's Landing, Star Trek, Quantum Leap, The Outer Limits, Lois And Clark, Earth Final Conflict and movies like La Femme Nikitta. In 1996, Scanlan had directed another Lifetime movie, similar to this, \"Stand Against Fear\" (1996). He manages to convey the gravity of the event. We are genuinely disturbed by the coach lurking around the showers where he rapes his own student. These scenes are graphic and ought to be viewed by mature audiences, but its message is clear: sexual predators and rapists are not always a stranger and can assume different forms, and their preying grounds can even include a high school. This film supports the cause of fighting to prevent violence against women and urges women who have been silent victims to testify and fight so that rapists will cause no further harm to others. Despite other negative reviews, this film does a great job in expressing its message and ought to be given to mothers, daughters, high school students (including both male and female). As bad as rape is, staying silent when it happens is even worse.","When I first saw \"Race Against Fear\" (don't you just love LMN movie titles?), I had to keep scratching my head. Was this meant to be serious? Why couldn't the main character even run like a normal person running, much less like a star runner? How did I know that the coach was evil only 1 minute into the film? All of these questions, and no answers. Then, I just let the inane script and the awful directing just carry me away...it was easier not to resist...then the film became funnier by the minute, and I now rank it among my top ten junk movies from LMN. Some have said here that Ariana Richards is really talented but that the material was flawed - I heartily disagree. Not only can she not convince me that she's an athlete, she's walks wide-eyed through the rest of the story, like she's just landed on earth. Maybe the coach broke out of prison and finished her off...at least I hope so."],"review-user":["shanfloyd","nelbo","llihilloh","Swangirl","FloatingOpera7","duncmoll"],"review-date":["13 August 2005","7 March 1999","19 January 2003","13 January 2003","25 May 2006","22 November 2007"],"review-rating":["6","9","10","3"],"review-title":[" A simple TV drama without exaggerations.\n"," Brilliant, emotional movie, and a superb performance from Ariana Richards\n"," I finally realized that this is not a good movie.\n"," Nice young actress but awful script\n"," Breaking The Silence: A Lifetime Original Movie\n"," One of my favorite bad movies\n"]}