{"review-url":["http://www.imdb.com/title/tt0103434/reviews"],"review-text":["This show has to be the worst ever. Everybody hates it but yet it has very good television ratings. That's the cross every film fan has to bare I guess.I don't even know how to describe how bad it is. I can't talk about teleplays as there can't be one. If there is some plan written behind this crap it's not worth calling it a teleplay. Also acting would be the wrong term here as what they (I won't use the term actor as well) do is nothing more then getting up early, memorizing a couple of lines, saying them stoically in front of the camera and complaining about getting home late when in fact their work can be done in 3 hours.Unfortunately the about 25 minutes a day we get tortured by them are not enough. They sing, rap, dub films.....Talking about dubbing films. How come that Oliver Petzokat got to dub Lou (Tobey Maguire) in Cats & Dogs? As I heard the german dubbing for this film in a Trailer before Shrek I got kinda angry that they seemed to have ruined this assumedly great movie. Where Shrek worked good this one will fail. I am going to check your work out in this one dude. Dare you it's bad....","Okay, I'm just going to disagree with the past comments that criticized this show. I happen to think this show is awesome. (I mean when Jasmin Weber was still on and Franzi was still alive, so addicting!). And I was surprised to learn that this was categorized as a soap, because it just doesn't carry the same look and feel as soaps in America. Soaps here are absolutely horrific! At least GZSZ films on location, features real music and more plausible story lines. Moreover, the acting on GZSZ, for the most part, is quite believable especially with Josephine Schmidt and Felix Jascheroff. (Plus, soap actors are some of the hardest workers around in the business as they have the most demanding work schedules). If it's ratings are that high, it must be doing something right; soaps in America are shown in the day-time and, historically, have always had rock-bottom ratings. Give GZSZ a chance! Trust me, it's good!","I think that you can not imagine how these people really work...!! Before I came to the studios to watch the guys work there, I actually thought quite the same as you do. But since I saw and did the work the guys on that TV-show have to do, I have to say that they really do deserve respect for what they are doing all day long. That really is no easy work. And also the actors, which in your eyes may be terribly bad, are really great people and a lot of them really can act! I don't think that the material given to them can really show that, as I think this material isn't very good. But THEY are truly good! So I don't think that you, before you haven't seen these guys doing there work, can judge over them! And I shouldn't have judged over them as well before I met them, but I did and am now terribly ashamed of it. So please, do not allow yourself to judge over these great people unless you haven't seen them doing there job.","GZSZ is the longest running daily soap in Germany and it's cult! I started watching it from the first day on and I got hooked on it right from the start. Over the years so much has changed, the old characters like Heiko, Elke, Tina, Saskia etc. left, and new ones appeared like Marie, Kai, Cora or John. I have to say that I liked GZSZ better in the years 1995-2000 because today the show focuses too much on the younger characters. My favorite character is Sonja Wiebe because she is the most scheming person that has ever been on that soap and she is also one of the most interesting characters on the show. Tina Bordihn was great as the first Sonja but as Tokessa became the recast of Sonja the character got even better."],"review-user":["vincent.vega-2","idwhatever","cbrodka-1","redaktion-1"],"review-date":["14 July 2001","25 November 2008","15 July 2008","19 February 2002"],"review-rating":["8","2","10"],"review-title":[" 2270 Episodes.....so we suffered a lot. No end in sight though\n"," GZSZ is Awesome!\n"," Comment to the text written before..\n"," GZSZ is a wonderful legend.\n"]}