{"review-url":["http://www.imdb.com/title/tt0102658/reviews"],"review-text":["Fashion newspaper editor Dyan Draper has a habit of exposing those in the fashion world in her column.  It's only a matter of time before she in bumped off by someone.  Lauren Jeffreys is the main suspect as she had a public fight with Draper and was seen entering her building shortly before her death.  Lauren is a friend of Della's so Perry takes the case despite also being a witness for the prosecution.  Meanwhile Ken hooks up with a minor-Mafia hood to hunt down the real killer.If you've seen one of these things then you've seen them all. The legal realism of these shows are always very doubtful but the drama is still enjoyable. Here for Mason is a witness but is still allowed to prosecute - also they do an unusual and unfair line up in the courtroom itself! Mason does his usual ripping into the witness stuff which is good and this time it isn't as straightforward as it usually is with a view twists making the climax different from usual (slightly). Ken's investigation is better than usual here and is enjoyable thanks to the presence of mobster Loomis as his partner - makes a change from Alexander Paul or some other dippy girl.Burr is as good as ever in a role that he could do in his sleep with no real difficulty.  Hale is as underused as always but seems happy to be there. Moses does his usual stuff and gets help from Clohessy (best known for Oz)who is quite enjoyable, despite being a bit of a caricature (`hey! Gone on get outta here' etc).  Muldaur is solid and is an unusually famous defendant having been in Star Trek.  DiCenzo is fun in a small role as a dressmaking mobster!Overall this doesn't really stand out from the majority of the Mason movies but if you like them then you'll like this.  It isn't the best of the series but it's as good as the rest.  Worth watching if you liked any of the other ones.","(Some Spoilers) Taking a trip to NYC to get an award from the American Bar Association Perry Mason and his private secretary Della Street, Raymond Burr & Barbara Hale, run into an old friend at a local restaurant the founder and editor of Metropolitan Magazine Lauran Jeffreys, Diana Muldaur; not knowing that within the next 24 hours she'd be charged with murder and he'll be the attorney defending her in court. It turns out that Lauren after having a loud argument at the restaurant with rival fashion editor, of the sleazy tell all tabloid Suite 2000, Dyan Draper ,Valerie Harper, she came over to Dyans place later that evening. It was after Lauren left Dyan was found dead with her head cracked open on the floor.Perry as usual has his work cut out for him with Lauran not only being at Dyan's place the night of her being found murdered but having a motive in killing her. Dyan was going to print an editorial about Lauran taking bribes from fashion designer Marco Sabatini, GIanni Musso,in order to write favorable columns about him in her Metropolitan Magazine. Perry later at cross-examination of Dyan's eventual murder seems to have gotten the two magazines mixed. The mysterious murderer had the favorable columns about Marco written on Dyan's Suite 2000 Magazine personal computer. This was to make it look like it was written by Lauran who coincidently also turned out to be the mother of Dyan's assistant and one of her top fashion, or gossip, writers Julia Collier,Ally Walker!Trying to track down the link, Designer Marco Sabatini, that can connect Dyan's murder to who murdered her Perry gives that assignment to his hot shot PI the very durable and punch-drunk Ken Malansky, William R. Moses. Malansky gets hooked up with members of the New York Mafia who were financing Marco's career in the world of fashion and who's boss is Marco's distance cousin Albert \"Big Al\" Nandone, George Dicezzo. Getting nowhere with \"Big Al\" and his top henchman tough guy \"Brooklyn Tony\" Loomis, Robert Clohessy, Malansky finally has Perry himself get to step in and get \"Big Al\" to open up only to have Marco. It's then while \"Brooklyn Tony\" is slapping the pestering an annoying Malansky around that Marco gets killed by a hit-and-run driver who later turns out to be the person who murdered Dyan.It takes a while for Ken Malansky to convince \"Big Al\" to keep his emotions from overtaking his logic in whacking anyone whom he as much as suspects murdered Marco. Malansky later finds out who was involved in Marco's hit-and-run death who also turned out to be the same person who murdered Dyan! It also turns out that the double-murderer was working for Dyan herself and even more shocking Lauran knew who she was and wouldn't report him, or her, to Perry or the police! Seething hatred revenge and a 25 year old grudge against Lauran lead to a maniacal plot to frame her for a murder that she didn't commit against a person, Dyan Draper, whom the killer should have been eternally grateful to.","Despite the fact that the plot follows the well-known recipe of \"who did it\", which has characterised all the Perry Mason movies so far, the characters of the present film are not so well-developed and the selected cast fails to give them flesh and blood. Of course, in general, the Perry Mason movies are not significant, but, even for their low standards, this one is weak.","Excellent Perry Mason show with the theme in the end that hell hath no fury as a daughter scorned.Valerie Harper briefly appears in a memorable portrayal. She plays a miserable fashion editor who digs up dirt on all those around her orbit. Of course, Harper, with her blond hair, is soon killed off. Suspicion immediately falls on Diana Muldaur, a rival editor, who had words with the Harper character right before the latter's demise.The person playing Tony Loomis steals the show here. As an underworld hood, Loomis is jealous of college boy attorney Ken Melansky (Robert R. Moses) and lets him know it. You think that they're reaching some kind of bond, but when the they apprehend the guy they think knocked off the head gangster's cousin, Loomis shows his true colors.Scott Baio appears as a young, sure-of-himself- D.A.- ready to lock horns with Mason. He tells him at the beginning that he looks forward to beating him in the case. We all know how this turns out.","Perry Mason: The Case of the Fatal Fashion finds Perry and Della Street in New York getting an award from the American Bar Association. An undefeated trial record ought to get some recognition I would think. Anyway a friend of Della's, fashion editor Diana Muldaur gets herself arrested for the murder of a rival, Valerie Harper and in fact Raymond Burr and Barbara Hale witness a confrontation between the two at a posh eatery.These two rivals have a thing going that makes Hedda and Louella look like school girls. Of course Harper has a number of other people who loved her equally as much.The same perpetrator also ran down a fashion designer who could have exposed the individual. This throws Perry with his trusty investigative lawyer, William Moses in an alliance with some mobsters. Seems that the designer was a cousin of a mob boss who wants also to mete out some justice in their usual manner. One thing I could not get is when Moses and mobster Robert Clohessy track down the perpetrator I cannot believe that the police were also not vigorously pursuing the case. Of course Clohessy has some access to sources that the cops just don't have.But the best part of this particular Mason entry is Scott Baio as the young rather full of himself Assistant District Attorney introducing himself to Raymond Burr saying how he studied all of his cases and looked forward to beating him. Foolish Boy.In fact my favorite scene is Burr and Baio at a sidebar with the judge. Baio was wanting to reopen his case and add a witness and came ready and prepared with precedents. Burr catches him off guard and says he has no objection to the new witness and then proceeds to demolish the witness on cross examination. Absolutely priceless.Scott Baio is the best thing in this particular Perry Mason movie and it should be seen for him alone if nothing else.","Of all of the post-1985 Perry Mason movies I have seen, this one is my least favorite.I confess I have never liked Diana Muldaur as an actress. She only seems to know how to play one type of character - a hard-bitten career woman with some undefined chip on her shoulder who for that reason is extremely difficult to in any way sympathize with. This one is no exception - it runs true to form.The only thing that saves this movie, in my opinion, is an earnest performance by Scott Baio as the prosecutor - I actually found myself rooting for him to win, and the movie is worth seeing for him alone.","THE CASE OF THE FATAL FASHION is one of the last of the Perry Mason TV series and sometimes that shows in the hackneyed nature of the plot which really has been done to death in all kinds of TV shows and movies previously. The story is about a gossip columnist who is killed by somebody she's offended and of course the list of suspects is as long as your arm. Perry and Della just happen to be in the area and witness an argument between a suspect and the murder victim just prior to her death, thus becoming integral to the court case.The story that follows is quite watchable although the writing isn't always as strong as it could be and it doesn't rank next to a Columbo, say, from the same era. Raymond Burr's professionalism keeps you watching, however, and there's neat turn from Scott Baio as a hot young lawyer determined to beat his idol. There's also a great little sub-plot involving Ken joining forces with a gangster's enforcer in order to find the murderer; this adds pace, excitement, and humour to the story.","Perry Mason arrives in New York to receive an award from the American Bar Association but, as usual, it is not long before he finds himself defending somebody framed for murder. This time it is the owner of a successful fashion magazine Lauren Jeffreys (Diana Maulder) whom is accused of killing her bitterest business rival Diane Draper (Valerie Harper)the owner of a rival magazine. The police believe Jeffreys did it because two people - a neighbour and the security guard - saw her enter the victim's flat on the night of the murder. In addition, jewellery belonging to the dead woman was found in her desk and, at Draper's office, an article accusing Jeffreys of taking bribes from fashion designers in exchange for rave reviews in her magazine was discovered on her computer and a floppy disk was stolen from her apartment. Mason has plenty of suspects to probe - all of whom feared that Draper was about to expose them in her editors column. Meanwhile, Jeffreys estranged daughter Julia Collier (Ally Walker) and Draper's former PA is bitter that her mother deserted her as a baby in Texas and fled to New York for the good life. Will the fact that her mother is on trial for murder lead her to try and reconcile her relationship with her?Another routine courtroom drama in the long running series of made for TV revival movies that successfully returned Raymond Burr to his best loved role as the world's most famous defence attorney. This ranks as being neither among the best nor the worst of them. As a mystery it plays fair with the audience and the clues and plot turns -on the whole - run smoothly, coherently and logically to the denouement.But, in terms of acting, direction and overall handling it is utterly mundane and indifferent. It has the air (like many of the others) of being a mass produced product being rolled off the production line at breakneck speed with everyone just going through the motions.The premise of Lauren Jeffreys attempting to reconcile with her estranged daughter Julia Collier has promise but it is insufficiently developed in the script and Diana Maulder and Ally Walker's performances do not do enough to stir our emotions. But, I suspect that this was shot on a fairly hectic production schedule and I doubt if there was time to expand on it even if the actors and their director would have liked to have done that.William R. Moses' action man bit as the young attorney Ken Malansky sees him fall under the clutches of mafia boss Albert Nardone (George DiCenzo) who forces one of his heavies to help his investigations after his cousin, Marco Sabatini, is murdered. They locate a vital suspect that Mason needs if he is to stand any chance of clearing Lauren Jeffreys of killing Draper. But, Malansky is double crossed by Nardone and he abducts the suspect planning to exact revenge in his own way and the young attorney must find him and persuade the mafia lord that it is best for the suspect to appear in court and let the law take its course."],"review-user":["bob the moo","sol1218","darth76","edwagreen","bkoganbing","steveneaklor","Leofwine_draca","jamesraeburn2003"],"review-date":["14 September 2002","7 May 2007","14 September 2002","21 September 2010","20 April 2008","9 October 2006","10 January 2017","19 December 2015"],"review-rating":["6","4","10","7","2","5"],"review-title":[" Enjoyable - above average for the Mason films\n"," Tell me Mr. Malansky waddaya think, teal or the periwinkle?\n"," Boring\n"," Fatal Fashion- Wears Well ****\n"," Foolish Boy\n"," Weak\n"," A hackneyed story with some fun elements\n"," Routine courtroom drama - okay as a mystery but totally mundane and indifferent in its treatment.\n"]}