{"review-url":["http://www.imdb.com/title/tt0118604/reviews"],"review-text":["When a trio of American teens travel to Paris for a daredevil challenge they decide to bungee jump off the Eiffel Tower.  During the jump Andy manages to save the life of a girl attempting suicide.  However when he later tries to find her again he finds that she has something to hide.  When he and his friends attend a party held by friends for hers they find they are trapped by werewolves.  Andy gets bitten and becomes part of a world he wants no part of.This is a belated sequel to the 1980's classic `American Werewolf in London' and indeed it tries very hard to be just like it - the corpse black humour, the dreams within dreams sequences etc.  However the story is different as it introduces a wider werewolf conspiracy idea to the plot.  It actually works quite well - it's not better than many other creature features but it works OK.The main problem with it is that it is very much another teen horror movie - with a stupid rock soundtrack, valley girl style humour and dumb spectacle. It lacks the original's black humour and it isn't anywhere near as tense as `London'.  The special effects are totally CGI and they don't work as well as `London's' - it all looks too computerised, and seeing everything takes the scare factor out of it.In fairness when you look at it as a stand-alone film it's not so bad even though it doesn't stand out from other teenage horror movies.  But a sequel to `London'? - sorry but it's not a great addition to that piece of work. Tom Everett Scott looks like he's stepped out of American Pie into a horror movie!  He's OK but he doesn't compare with Dunne all those years ago. Julie Delphy is actually quite good - she doesn't have much of a character but she carries herself well.  The other characters are either rough French skinheads or American teens.Overall it's entertaining enough - but it pales terribly when compared to the original.","OK, so I don't know why they decided to make another movie about a Yankee college student going to a European capital and becoming a lycanthrope. But still, \"An American Werewolf in Paris\" definitely has its moments. Some scenes were no doubt thrown in for comic relief, like \"You can't just pop up and tell me what to do.\" I agree with a previous reviewer that people who slam this movie are comparing it too much to \"An American Werewolf in London\". Maybe there's a slight feeling of that one, but you have to take this one as something new - and rather campy - to really enjoy it. Tom Everett Scott and Julie Delpy do a pretty cool job. But either way, I think that I've had my fill of movies about US citizens becoming lycanthropes in the Old Continent.So what do YOU plan to do the next time that there's a full moon?","If you want a great plot, terrific special effects, good humor and characters you can really care about, rent An American Werewolf in LONDON. Stay away from this tripe.For one thing, the supposedly high-tech special effects are terribly disappointing. Hard to believe that even though the original movie was made 14 years before this one, its SFX are actually more realistic, mostly because the transformation scenes in this movie often happen either off-camera or while the character is running behind something.Also, the humor in the movie falls short. Granted, the \"chewing gum\" skit was pretty funny, but as I walked out of the theatre I was pretty ashamed of myself for laughing at such an immature joke. The Eiffel Tower scene is funny only because of its felonious breaking of the laws of physics (Uh, since the Tower spreads outward, wouldn't these bungee jumpers wind up slamming into it at some point during their fall?)And finally, the plot is simply insulting. Even though the original movie had little more behind its story than \"I'm a werewolf, oh no\" that is even better than this stereotypical drivel about an anti-American punk who wants to \"purify\" the world from the country. If that's not bad enough, their method (luring Gen-X tourists into a club to meet their grisly deaths) is awful inefficient. And to top it off, there are numerous mentions and depictions of eating/drinking someone's heart (including a scene in which Julie Delpy sticks a human heart in a blender - yummy), none of which are suitable for anyone with a stomach.As stated in the beginning, if you really want to see a good werewolf movie, the original 1983 film will suit you just fine. But if you rent this one, be warned: the producers and writers spent more time getting Bush to sing the theme song than they did writing the plot.","As a sequel to An American Werewolf in London, this film is sure to disappoint many. It certainly doesn't have the talent that was involved on that one. No John Landis. No David Naughton. No Jenny Agutter and other more-than-competent actors. No Rick Baker and dazzling, innovative special effects. I could go on...and on. But if one distances themselves from seeing this film as a sequel(and really it is not a sequel at all...it doesn't have any of the same characters from the first film), this film is not that bad on its own. Sure it is relying on your memories of the London film to get fannies in the seats. Yep, it uses the same character TYPES and situations(dead victims talking and being funny comes to mind quickly). Other than that and the fact that werewolves are involved(and a romance of course), I found few other similarities. This film is definitely going for more laughs and takes itself even far less serious than An American Werewolf in London. The leads...Scott and Delpy are pretty good. The rest of the actors are pretty good too, with Julie Bowen as a slutty American and the guy playing Claude particularly good. I also loved all the French police and the gentle humour inherent in every line they said. The script has some genuine scares laced throughout the picture but always comes back to the humour. French werewolves enjoying feasting on Americans was a particular funny storyline. Director Anthony Waller creates a fast-paced film with some excellent sequences interspersed with some sophomoric plot strands. By no means is this a great film, or even a great horror film/spoof, but it is a film that should grab and hold your attention. Make you jump a few times and laugh out loud now and then.","I can't honestly believe that this is a sequel or follow up of John Landis classic comedy horror movie from 1981 . I suppose you can't really describe it as an original werewolf movie either since the bare bones of the story steal elements from the one set in London: An American tourist visits a famous European capital , he narrowly survives a werewolf attack that kills a colleague , he embarks ( Pardon the pun ) on a sexual relationship with someone in the medical profession , he turns into a werewolf , he's visited by apparitions of his dead victims , etc etc . and reading the previous line I've just discovered how much the storyline has in common with the original that it seems very similar indeed . The difference lies in how enjoyable and entertaining the Landis movie is With this Paris based movie there's no scenes that really stand out . There's no naked man waking up in a zoo wondering how he's going to get back home with no money or clothes , there's no bizarre dream sequence of Naziwerewolves and there's no spectacular climax . AAWIP does try to be funny but is there anything more embarrassing than failed humour ? I'm thinking of the scene where Andy McDermott has to convince someone he's got chewing gum in his pocket and not condoms ! Perhaps the biggest difference between the two movies is that there's no poignancy involved with this dubious follow up . You really do feel sorry for the protagonist's fate and dilemma in the London movie , here you just feel Andy is nothing more than a cypher going through the literary motions of a script . There's also a large number of plot holes visible . Is this the first time The Lunar Club have carried out a massacre ? If not then aren't large numbers of corpses with their hearts torn out been reported in the world's press ? Why haven't the police got leads ?Everyone else has mentioned it and so will I - The visuals are poor . Look at the bungee jumping scene at The Eifell Tower , it's painfully obvious that it's achieved via some blue screen projection while the werewolf transformation is done by some very cartoonish CGI . I won't put Anthony Waller in the same bracket as Stephen Sommers as a director who totally ruins a movie because of an over reliance on CGI ( The major problem with AAWIP is the screenplay coupled with a high degree of expectation from those who saw the 1981 movie classic ) but I would have preferred the Rick Baker type special effects used for the transformation . To be fair it's reasonable to speculate that perhaps the budget didn't stretch that far . But at the end of the day this is a fairly poor horror movie that didn't need to be made and DOG SOLDIERS is much better entertainment","This DVD is missing its calling as a Heineken coaster.... This is a great example of why no one should ever go see a sequel with a different director/writer than the original. Two hours of this turkey left me begging for Exorcist 2 reruns. NO legitimate laughs. NOT ONE decent scare. The script was just a mess and I felt bad for the actors who had to perform it (they must have had sick relatives at home or monster coke habits or something).The original was a makeup effects landmark. So naturally, the producers of the sequel thought it would be a great idea to to scrap makeup FX and do CG werewolves instead. These CG werewolves had me laughing a lot harder than any of the \"comedy\". It was just a total miss. If ya want a night's entertainment, go rent the original again. Or go take a film class and make your own horror film. You're bound to do better than these fools did.","\"An American Werewolf in Paris\" is an excellent horror-comedy, in the great tradition of \"The Lost Boys\" and \"Fright Night\".  I see that a lot of people dislike this movie.  These are obviously hardcore horror fans who wanted to see something dark and gothic; but instead got something blackly humorous and were not amused by it.  I admit, \"An American Werewolf in Paris\" is not really scary, but neither are \"The Lost Boys\" and \"Fright Night,\" and those two movies seem to be highly regarded by horror fans.  I don't understand why everyone hates this one so much.  If you are a fan of horror-comedies, or if you have a morbid sense of humor, this is definitely for you.  I think it's great: nine out of ten stars (On a one star DVD, I should say.  It would have been nice to have some extra features besides the trailer.)","One of two movies I have actually thought about asking for money to stay until the end.  Most movies have at least one thing that is worth staying for, even if it just to laugh at how bad it is.  I never found it for this movie.  Nothing was good, from the script, to the very bad effects.  The worst movie I have ever seen.","I have mixed emotions about this film, especially as it compares to its forerunner,\"An American Werewolf In London.\" That film had it's funny moments, it was still more of horror tale than anything else. This updated version, now set in Paris, does not have that \"edge\" at all and simply isn't in the same class....but it does have some good things going for it that the first film did not have and overall it's still fun to watch. So, \"werewolf purists\" aside, most of whom think this film is pure garbage compared to the London version, I'll still give it decent marks since I don't care what others think. I liked it even though I agree \"London\" is better and I prefer that version, too. The first 30-40 minutes of this movie is strictly played for laughs including a hysterical scene with a \"balloon\" in a restaurant. It also introduces the lead female character, played by Julie Delpy. I don't see enough of this actress. She doesn't seem to make that many films, or least ones I hear about over here in America. This French actress has a face that is classic beauty, so the film got points for having her in it, and she looks great.When the horror starts, it can get scary and the special effects are good. I also liked the lack of profanity in this film, unlike the first one: no f-words and no Lord's name in vain - amazing!However, there are plenty of sexual remarks and there is one scene with a guy running out of bar tied to a cross which was blasphemous to me. The soundtrack is heavy metal which isn't appealing to a middle-aged guy like me, either. This film is geared a lot more toward 20-somethings, if that helps anyone.It's entertaining.....just don't expect it to live up to the first film.","5.5 out of 10Werewolf movies are usually alarmingly bad, even though they should, in theory, make for more interesting villains than vampires, zombies, and slashers.  But An American Werewolf in Paris is an exception, sort of.  Tom Everett Scott stars as a daredevil who tours Europe with his buddies, performing outrageous stunts.  During one particular escapade, he saves the life of a young woman (Julie Delpy) who tries to commite suicide.  Thinking she's the girl of his dreams, little does he know what he's getting into.Paris tries to be a mixture of different genres: it wants to work as a horror film (to a mild extent), an action/adventure, and as a comedy.  Dog Soldiers was definitely far superior at these aspects, but AAWIP's campy approach makes it a decent timewaster.  There's not a single boring moment, though a lot of the material is admittedly very silly.  Thankfully, none of it's taken very seriously, and some of the humor is actually very funny. Scott and Delpy (who's probably the third most beautiful French actress I've ever seen, behind only Mathilda May and Sophie Marceau) have good chemistry together, even if Scott's performance is a little on and off.  The werewolf effects are obviously CGI, but more \"serious\" effects work would have ruined the campy mood.","\n  It's very hard to compare this movie with American Werewolf in London.There, the first-time seen transformation effects, the plot and the acting were very satisfying, and the movie was a classic of contemporary horror. Here, lots of loose ends in the screenplay and incredibly poor acting made this film enjoyable only for the see-all-terror-movies buffs. The movie shows well the trend of using CG (computer graphics) in every key scene, which really seems artificial and boring after some shots. ","I've seen this movie several times, and I just can't get enough. Every time I see it, I discover some new detail that I enjoy more and more each time.It combines a tasteful comedy, with a sublime horror. The actors all seem right to their parts, and it bring freshness to werewolf movies, it's not just the killing, it's truly amazing.","I had been a huge fan of the original \"American werewolf in London\" and, while I had no real hopes this would be as good as that one (which was just funny good, not really good), I had hoped to be entertained. I was not. Aside from some physics bending during a bungie jump scene, a really weak plot and some really stupid characters, the movie just went nowhere. I've watched training videos that were more fun to watch than this mess.","I don't know why I get my hopes up for sequels... my hopes are always destroyed.This movie is no exception. For starters, it's important to note that An American Werewolf in London (AAWiL) will always have a special place in my heart as one of the first horror movies I remembers seeing on HBO as a kid.This movie lacked just about everything that AAWiL had: good acting, good special effects, a decent soundtrack, etc. Tom Everett Scott is a terrible actor... the kind of actor I see and wonder how he ever gets casted for anything. Julie Delpy is OK and I dig her accent. Everyone else was pretty much fluff and/or fodder. The effects were God awful. It's hard enough to pull off CGI monsters and hairy ones are even harder to make believable. When you are making a sequel for a movie that had effects that are still impressive by today's standards, some serious effort has to be made if the intent is to make a movie that rivals the original. This one isn't even in the same league as AAWiL. The music for AAWiL was also very well done. AAWiP had... Bush? Yeah, that's the route you want to go to create a timeless classic.Unlike other reviews I wouldn't even go so far as to say this movie would have good as a stand-alone (no connection to AAWiL), but I wouldn't even give it that much credit. It just sucked.","The daughter of the werewolf from AWIL is alive and living in Paris where her mother and stepfather are trying to overcome her lycanthropic disease. A trio of American tourists on a thrill seeking trip around Europe manage to stop her from plunging to her death from the top of the Eiffel tower and are embroiled in a horrific but often hilarious plot involving a secret society of werewolves based in the city and a drug which allows werewolves to change at any time... This time there's no need for a full moon...This film is so bad, it could be the worst film I've ever seen. The characters in the film are very dumb, we don't even care about them, and seem to have fun making the movie instead of making a good horror film.There are so many horror clichés in this film, but I think they were trying to make fun of them. This film relies on humor more than making a scary film. And for the funny scenes, I did not believe it one second. I thought they were trying to make a horrible film on purpose! And in this horror film, it has violence, gore, and tons of sex scenes (AKA a lot of nudity). That's probably the lines for a horror movie. The sex scenes comes out of nowhere, like the director told the actors to perform them because of the line \"sex sells\".All of the acting in the film are horrible. The CGI was mediocre. I really didn't like that that much either. Well, here are some good things in the film: The last 10 or so minutes in the film have some horror elements. It's more like a creature fight between two werewolves.If you would like to see a horror film, STAY AWAY from this one. I think people who love this movie are so dumb. Maybe they've seen another film. This is one of the worst movies ever with everything bad in it and characters who don't even know they are in a werewolf film.","I just don't get it.  Why call this a sequel to the film \"American Werewolf\" when it has absolutely NO connection with it whatsoever?  The first film was funny *and* scary with ground breaking special effects.  (If memory serves, the Oscar category for special make-up effects was *created* for this movie).  \"Paris\" is none of these things.  Awful effects, and not much else. Do not see this movie.  Rent the original \"Werewolf in London\" instead. You'll be much happier.","Well, if you've seen this movie and you've never seen the original (American Werewolf in London), either because you've never heard of it, you didn't like this one and felt that the original must have been worse, or you just haven't gotten around to it, see the original.I know, this review is for this movie, not the original, but I still want to recommend that you see the original as it broke so much ground in the concept of a horror comedy, a genre that has so few movies in it that when a good one is made, it stands out.OK, now this movie here is still a fun movie and it is in the horror comedy genre, so it's got some work to do if it wants to appeal to any group of people out there.Yes, there are a bunch of people who love horror movies, and probably even more who love a good comedy, but it's difficult to appease both even when you stick with only one genre, let alone trying to find an audience for one that mixes two that are not typically put together.This movie has some pretty darn good special effects, an actual plot, pretty good acting overall, some interesting settings for their scenes, a little nudity, some blatant humor (things like site gags and one liners) and even some subtle humor that is more biting than outright humor, and it even has (for those who care) a little nudity.The action scenes are pretty dang fun if not a little gory, and a few surprises for those who enjoy those as well.See the original if you are only going to see one, but otherwise, see both.","Well, what can be said about a \"horror comedy\" that features neither horror nor comedy? There are no characters in the film, but much too many  plot lines - all underdeveloped and mostly superfluous.The computer generated creatures look bad, a bit like Disney versions of oversized rats without a tail. The walking dead are the biggest rip-off apart from the title, the shall look like the dead in Landis' movie, but are far removed. They just look like bad actors with abit of plastic and bull's blood added.Two plot lines really showed some promise (the love story and the \"company\" story), but failed as miserably as the director, the writers, the SFX department, the production and the actors.","Released in late 1997, \"An American Werewolf in Paris\" chronicles events in Paris when a trio of American daredevils (Tom Everett Scott, Phil Buckman & Vince Vieluf) encounters a suicidal young woman (Julie Delpy) at the top of the Eiffel Tower. The girl turns out to be the daughter of the werewolf from 1981's \"An American Werewolf in London\" and her mother (from the earlier movie) and stepfather are trying to remedy her lycanthropic disease. She's somehow linked to a clandestine order of werewolves in the city who regularly lure people to raves in order to feast on 'em. There's also a subplot about a drug that allows werewolves to change at any time with no need for a full moon. Julie Bowen, Pierre Cosso and Thierry Lhermitte have peripheral roles. This is a stand-alone movie and so it's not necessary to see 1981 film first; I recommend catching it just for the first half. The Eiffel Tower sequence is particularly creative and thrilling. Despite what some say, Everett Scott makes for a quality main character, just as effective as David Naughton in the original, if not more. Like the first film, the movie expertly mixes horror with comedy. There are spooky scenes set in catacombs, dungeons and graveyards with the requisite full moon looming, all to a rockin' soundtrack. Unfortunately, the second half starts to mark time by becoming redundant and dull compared to the excellent set-up. And the CGI werewolves are decidedly cartoony by today's standards; although I'm sure they were pretty state-of-the-art at the time.The movie runs 105 minutes and was shot in Paris with studio work done elsewhere. DIRECTOR: Anthony Waller. WRITERS: Tim Burns, Tom Stern & Waller.GRADE: B-","Crappy nominal sequel to An American Werewolf in London. It really has nothing to do with that movie besides the similar name and some ripped-off ideas. Pretty shameless cash-grab that thankfully was not well-received. It's a terrible movie with some awful performances, a script I wouldn't wipe my ass with, and some particularly shoddy CGI special effects. Tom Everett Scott has a very unappealing screen presence. I just can't with that guy. Julie Delpy is slumming here but we do get her obligatory topless scene. I don't know the names of the actors playing Scott's buddies. They were generic and forgettable so I won't bother to look them up There's very little time devoted to the werewolves, perhaps due to the poor FX. Most of the time is spent on the lame comedy. Avoid at all costs. A real waste of time.","Andy McDermott (Tom Everett Scott) is backpacking across Europe with his two idiot friends. They have this daredevil game and Andy climbs up the Eiffel tower after hours. They find Serafine Pigot (Julie Delpy) jumping off the tower and Andy jumps off after her. Luckily he has a bungee cord tie to him. Andy tracks her down. She reluctantly agrees to go out with her. She's a werewolf in Paris and there is a whole society of werewolves. The boys get lured to an underground club and it's a night of terror. Julie Bowen plays American tourist Amy Finch.This starts off really badly with a stupid looking Eiffel tower sequence. Then there are twiddle dee and twiddle dumb. The movie is trying very hard to be funny and fails miserably. Tom Everett Scott is playing a goofball but he comes off as really pathetic. The stupidity of the three guys is really annoying. The CGI is functional and probably the best that could be hoped for at the time. The makeup looks bloody. The simple scary plot of the original is lost in this chaos of CGI wolves and camp. The original was a really good example of a well made horror. This is an example of a poorly done one.","Whaddya want from a B horror flick? This movie is funny and silly and camp -- perfect. It's not as good as the original (duh) but certainly has its charms. I liked the joke about clamato juice. See it, if you're in the mood for a non-threatening, generally interesting, often funny good time.","I'll admit it doesn't live up to its predecessor, \"An American Werewolf in London\" but I thought it was enjoyable to watch.  The werewolves themselves looked kinda funny because you could tell that they were unfinished c.g.'s was my only thought. But the end confuses me, \"When Andy fights Claude on the train and deliberately takes the drug in his chest (and yes if you watch carefully it is on purpose NOT accidental) and then kills Claude and eats his heart (yuck) why is the curse broken in Serafine\"?. Claude stole the blood from HER not vice-versa, this makes her the original not Claude.","It took me nine years to finally see this film. Back in 1997 it sounded like a dreadful idea. However, now, with a Blockbuster Video movie pass, I can take chances on certain films without actually having to 'pay' for them.It's a dumb film. What made \"American Werewolf in London\" work was it was more of a serious film than a comedy, and the comedy was wonderfully dark, which added well to the horror element. \"Paris\" seems aimed toward attention-deficit teenagers, though it's rated R. The lead character is too goony to be of much interest or to be taken seriously, plus he'd have been killed in his early-on rescue scene; therefore, the film doesn't even try to make the unrealistic set-up seem realistic. (You can't buy into a drama or horror film if the film doesn't strive to be true in its own world.) CGI werewolves aren't scary. \"London\" has outdated effects, of course, but they're still wonderful to watch for the audience is being treated to a painful and prolonged transformation. A real-seeming, nice guy -- not some bland goofball -- is going through something horrific, and the special effects strive for realism and therefore one can buy into the transformation, all the while knowing it's not real. Turning an actor into a cartoon werewolf is not engaging and therefore there's nothing to buy into.The ending is one one of those \"ha-ha\" wrap-things-up-in-a-bow scenes that plagued so many horror/suspense films of the 90s, such as the also-unnecessary \"The Vanishing\", a weak remake of a gut-wrenching Dutch film.","Woeful and unnecessary sequel to a bonafide classic. An American Werewolf in London was, indisputably, a gem of a movie: humorous, demented, with just a dash of romance and so very, very British it made me want to stand up and sing God Save the Queen every time the movie ended. Then came this abomination. You know you are in real trouble when the leads are so utterly unlikeable you are glad when they are slaughtered, and actually start cheering for the lycanthropes. Tell you the truth, folks, I only got about half way through this CGIed travesty before losing the will to live and turning it off. Absolutely pitiful and a putrid waste of anyone's time."],"review-user":["bob the moo","lee_eisenberg","Loogaroo","BaronBl00d","Theo Robertson","cybercuke","panamajaq04","brothl","ccthemovieman-1","Li-1","Edu-2","rccl","Tirdun","satyr_child","moviewizguy","jschell","buddhadan-1","Dierk","Wuchakk","utgard14","SnoopyStyle","Bram-5","alex-162","davitalvitch","smellthecult-com-1"],"review-date":["28 January 2002","15 August 2006","9 November 1998","8 July 2004","3 August 2005","21 June 2006","25 February 2004","2 October 1998","28 February 2006","28 November 2002","15 August 1998","4 May 1999","7 February 2001","30 October 2004","3 June 2007","14 March 1999","20 September 2006","9 February 2002","13 April 2017","10 August 2014","20 June 2014","5 April 1999","10 January 1999","16 January 2006","6 October 2009"],"review-rating":["6","4","1","1","7","5","10","1","1","1","6","1","6","2","5","2","1"],"review-title":[" Not a sequel  more a cash-in title\n"," So what next? \"An American Werewolf in Athens\"?\n"," Go with the Prequel\n"," Don't Look at it as a Sequel\n"," Retrogade Werewolf Movie\n"," What a train wreck....\n"," A genuinely hilarious horror film.\n"," So bad it you can't even laugh about it.\n"," Amusing, Scary But Not 'London'\n"," An enjoyable enough timewaster.\n"," Bad wolf!\n"," amazing\n"," Worst I've seen in years.\n"," Agreed... this movie stunk!\n"," Could be the Worst Film I Have Ever Seen\n"," Why? Why?\n"," Good but not as good as the first\n"," The Big Rip-off\n"," The first half is great; the second half falters and peters out\n"," An American Viewer in Agony\n"," characters too stupid, too much camp, not scary\n"," better than you expect\n"," not a terrific sequel but, it was worth watching\n"," Dumb and Unnecessary\n"," Drivel. Of no consequence. Avoid\n"]}