{"review-url":["http://www.imdb.com/title/tt0119068/reviews"],"review-text":["ERNEST GOES TO AFRICA is the BEST ERNEST movie since ERNEST GOES TO JAIL. I mean, Each ERNEST flick was worth watching just to see the multi-talented Jim Varney playing loveable goofball ERNEST P. WORRELL... but when it comes to the most laughs, AFRICA is one of the best.  Perhaps one of the funniest moments I have ever seen in an ERNEST flick was in this one where he walks up to an African tribe with the woman he longs for and says, \"Let me take care of this, You have to know how to talk to these people!\"  He then proceeds to talk some Ernest Jibberish for a few seconds until the tribe leader knocks him out with his cane!  Simply Hilarious!!!  Even the very opening of the film where ERNEST mimics a bunch of Animals with his rubberface and funny voices will have you laughing from the get-go!  I sure am gonna miss seeing any new goofy hijinx for our good buddy ERNEST. Star, Jim Varney was sadly taken from this lifetime too early at the age of 50 due to Lung Cancer.  Thankfully his performances will Live on Forever on DVD! I think John Cherry and Coke Sams need to make the 10th and Final ERNEST Film: ERNEST GOES TO HEAVEN which would be a bio-pic about the real life of the man who played our good buddy Ernest.  God Bless ya Jim!","I hate that this will be the last Ernest film ever made by Jim Varney. I hate that we will never get to hear him talk to Vern, his ornery and uptight (and invisible) neighbor. I hate that people hate this flick, but it's not as bad as they say.Ernest attempts to win the heart of a pretty waitress by gifting her with an artifact, which unbeknownst to Ernest holds Magickal powers.This is truly funny, and an Ernest classic. Face it. They only say they hate it because it strays a bit from the classic Ernest formula.This film is quite endearing, as much so as the best of them.It rates a 6.4/10 from...the Fiend :.","Many people might say that this 8th installment of the Ernest P. Worrell franchise is totally lame, but they're just idiots cause in my opinion this is the best of the now completed series due to the passing of Jim Varney at age 50. This time Ernest tries to win the heart of a waitress by giving her a gift. What Ernest doesn't know is that the gift is an artifact from an African tribe. Ernest and his girlfriend Rene(Linda Kash.)are then taken to Africa by a guy who wants the \"gift\" because of it's worth. Ernest and Rene escape and travel through The Dark Continent meeting new friends and enemies along the way. Exciting, great story, acting, and o.k. humor. ****1/2 out of *****.","Not the best Ernest movie but still a nice one. It is a typical Ernest movie where he plays the idiot and the other characters support the effort. When things go wrong in America he ends up in Africa with the women of his dreams. She of course does not appreciate it but has no other option but to go along with Ernest. The scenes with the African(?) natives is fairly funny and the fact that Ernest wins their support and help is of course necessary for the plot, otherwise the bad guys would win. The bald, fat guy who is one of the main bad guys does his job well and of course gets his come-uppence by the end of the movie.","While this movie does have a bit of a darker feel, it is still a good one. I know it has been said that every other actor-besides Varney-were C movie actors. Well, maybe, maybe not. I think it's because Varney has a way of stealing a scene or a show and overshadowing every one. My favorite character-besides Ernest-came out. Good old bitter, Auntie Nelda. She's always fun to watch. Hey, You the Hindu cracked me up and was the first time I've seen that character. But what really took the cake was Varney dressed up as a Harem Girl and dancing to the beat of his own drum. But, 'she' catches the eye of the prince and, not knowing that the Harem Girl is really a man-Varney, the prince kisses 'her'. I laughed so hard especially when the camera got a close up of Varney doing his 'Eewwwww' face. I have to say, Varney doesn't look bad in a blond wig and false lashes. It also got me to wondering, since Varney and Robin Williams were friends, did Varney's character, Auntie Nelda inspire Robin's character, \"Mrs. Doubtfire\"? Coincidence? They do resemble one another quite well. I do wish that 'Ernest the Pirate' was finished. I would've loved to add that to my large 'Jim Varney' collection. I'm happy about my array of Ernest movies and sad as well because I know there will be no more and I have to be satisfied with all the Ernest movies and Jim Varney movies I have. And no, I will NOT resort to watching the 'New Ernest'. That would be an insult to the 'Real Ernest'. It's like a slap in the face to Varney. I recommend watching this movie but I will say this: it isn't for small children. Teenagers are OK. No, there's no bad language or crude, sexual content. But there is the deal with the rhino named Dorothy who takes the heads off the goons, which you don't see but it's implied. And there is an implication of cannibalism. So, no not for the younger crowd. It is rated PG, so adults have to decide if their kids can watch it. I love it! I'm a sucker for anything Ernest.","OK, so one night me and some friends decided to get really stoned and watch a movie. Unfortunately for us, we chose 'Ernest Goes to Africa.' I have never laughed so hard in my entire life. This movie is beyond bad. I have literally pooped out better films than 'Ernest Goes to Africa.' (I poop films) The highlight of this movie, for me at least, was the opening sequence, when Ernest is making silly faces. When they showed him with a head the size of a peanut, I lost it. Perhaps I found this so funny because at that point I was the most high. Perhaps you are right.If I had to guess what George W. Bush's favorite movie is, I would guess 'Ernest Goes to Africa.' Never before have I seen a movie rely more on 1950's stereotypes of people of color. There were times when words escaped me and I just stared in awe.As I was watching this, I couldn't help but wonder, is this movie meant for children? Do literate adults actually watch this? How could there possibly be a whole franchise of 'Ernest' movies? Is this really my life? Is this real? I hated this movie.","I saw this on WAM last night and had to see it.  As another viewer said, there were flashes of pure brilliance so in contrast with the bad plot. Basically all the Ernest humor was really good.  Anything having to do with Africa was bad.  Sometimes, it wasn't clear whether the filmmakers knew the difference between Africa and India, as Indian accents abounded.  Jamie Bartlett was also an excellent villain.  Somehow seeing him yell the standard, \"You fools!\" at his henchmen gave a kind of satisfaction you don't normally get from a B-movie villain.  Regardless, it was an Ernest movie, thus stupid by definition.  If you like Varney's characters (Ernest/Hey You/etc[you shouldn't know about all of them]) then you should definitely see this movie.","Fate puts a pair of priceless items in Ernest's hands and he gets kidnapped and taken to Africa because of it. This was my first Ernest film so I can't compare it to his others, but I thought it was fairly amusing. Good stuff if you like slapstick humor and plain old clowning around.","Actually feel quite bad for saying this and criticising 'Ernest Goes to Africa', because this is coming from somebody, who while acknowledging that they had faults and were not great films, actually enjoyed most of the 'Ernest' films in a guilty pleasure sort of way and made a conscious effort to take them for what they are. Felt somewhat nervous reviewing the film and criticising it.Mainly because of people getting the wrong idea about me. Am a long way from a detractor, a defender if anything, and actually wanted to like 'Ernest Goes to Africa' having liked all the theatrically released films while being a little harsher on the straight to video outings. Regardless of the critical reception for all the films being near-universally negative, while being more positively received by audiences. But partly because of the trend for critics to be bashed, with anybody offering as much as a criticism for any of the films being at the risk of being shouted down and made to feel that they're wrong, let alone dislike it.This sort of attitude reeks of arrogance and has gotten significantly worse in recent years. Usually try to refrain from saying this or bringing this up, but this is becoming increasingly annoying, whatever has happened to respecting people's opinions regardless of whether you agree or disagree. It really isn't that hard to do.Back to reviewing 'Ernest Goes to Africa'. 'Ernest Goes to Africa' is not without redeeming qualities, none of the 'Ernest' films, even the weaker ones, are unsalvageable. The best things about it are the music and Jim Varney. The music is full of rocking energy and affectionate nostalgia and really adds a great deal to the action in the film. It's hard still not to relate to Ernest, the sort of character that is a well-intended serial bumbler with a well-meaning big strong heart but always finding himself messing up without intention.Varney is fun and likable in the role, to me there is enough freshness in the interpretation to not make it too tired or endless mugging and his performance does give the film much needed energy. A few parts are funny, personally liked the beginning and thought the highlights were the tribe scene and the character of Hey You.However, faring worst are the story and Linda Kash. Even for an 'Ernest' film, where the story was never a strong suit, as well as being the thinnest story of the series, the story in 'Ernest Goes to Africa' is the series at its dumbest, most muddled and dullest, with a real lack of momentum due to some scenes (such as the over-stretched and poorly staged chases) going on for far too long. Complete with a ludicrously contrived ending that belongs more in a badly done cartoon. Kash has the single most annoying character of the whole series, especially in her treatment of Ernest who really did not deserve how she treated him, and she is atrociously irritating in the part.The supporting cast are no better, with the villains being non-threatening and their actions are silly and repetitive. Varney is the sole bright spot in the acting stakes. 'Ernest Goes to Africa' is really not written well at all either. The humour works a few times but they only happen in glimpsing flashes rather than as an overall whole. Nobody expects a sophisticated script in an 'Ernest' film, that was well established with as far back as 'Ernest Goes to Camp' (that's right the one that started it all off) and it's like expecting a porn star to have acting talent. The script however is truly infantile with constant groans and head shakes than laughter, hearing some of it is enough to make one feel like their IQ has significantly dropped.Likewise with the gags, which suffer from being childish and contrived and from lack of momentum from some going on too long. Pacing is dull and makes the short running time feel longer, while the direction is just as dull and bordering on ineptly clumsy. 'Ernest Goes to Africa' is the cheapest-looking of a series that have always been clearly low budget (though the theatrically released films didn't fare anywhere near as badly as the straight to video ones), the scenery looks fake and the camera work. One doesn't expect such low quality for a film from the late 90s with film-making generally become significantly advanced technically when done right overtime.Overall, disappointing and to me the weakest of the 'Ernest' films. 4/10 Bethany Cox","Man, why did I rent this movie! While Hey You the Hindu was great and the story reeked of typical Ernest proportions, this film should have never been made. Sometimes stupidity takes a backseat to nostalgia, but from now on, I'm listening to my gut more often. What a pitiful movie to watch, one which didn't need to be the swan song of Jim Varney and his lovable character Ernest P. Worrell. The story was horrible, it was slow and dull, and the film stock clearly indicated the series had hit rock bottom. What a sad waste.","I honestly don't know where to begin when reviewing a movie as pathetic as Ernest Goes to Africa. Aside from two or three good laughs dispersed throughout the film, there is nothing positive about this hour-and-a-half waste of time and life. It is incredible that someone was able to round up a group of people willing to act, film, and edit this piece of trash, and even more incredible that this is the eighth installment in the Ernest series.During the opening credits of the movie, we see Ernest posing next to various African objects, such as wooden masks and the heads of African animals, making faces and gestures that would probably make most 3rd graders laugh. This opening scene gives the viewer a taste of Ernest's frequent attempts at humor, and demonstrates how his comedy falls flat 95% of the time.The first thing that really hit me about this movie is how bad the acting is. Everyone in the film is a typical C-movie actor, but Linda Kash stands out as especially terrible. She is the epitome of overacting; all of her lines are delivered with shockingly inhuman enthusiasm that you'd find only in a middle school play. Most high school theater students probably could have replaced these actors and delivered a more powerful performance. Jim Varney at least displays some comedic ability every now and then, but for the majority of the movie he just acts like a complete retard, trying to be humorous by making stupid faces and speaking in different voices.Ernest Goes to Africa begins in Africa, where an archaeologist has stolen two priceless gems from an African tribe. The gems then make their way back to the United States, where an unidentified man is seen running from several henchmen through a flea market. He hides them in a bucket of \"two for a dollar\" items, and then runs from the scene. Ernest is looking for a gift to buy for Rene, a waitress he likes, so he goes to the flea market and of course buys the priceless gems. He later takes them back to his house, paints them, and glues them together to make a yo-yo. He gives the yo-yo to Rene and she explains that they can never be together because he is just an average shmoe, and she wants a man of adventure. Rene and Ernest are tracked down by the henchmen, and are then brought to Africa to be kept as prisoners.Most of the movie really doesn't make sense. Once Ernest is in Africa, he falls out of the truck that they are carrying him in and lands in a river. In the next scene, we see him as a Hindu servant named \"Hey You.\" His skin is dark and he is wearing a loin cloth. At first, I thought Jim Varney was playing another role in the film in addition to Ernest, but I immediately recognized Ernest's idiocy once Hey You began to speak.Another scene that sticks out in my mind as being completely ridiculous is the car chase scene in the African wilderness. Rene and Ernest have taken an ostrich farmer's truck and are being chased by the henchmen. Driving at about twenty miles per hour on a fairly straight road, both henchmen are shooting at Ernest, who is in the back of the ostrich farmer's truck. Ernest, on the other hand, is throwing ostrich eggs at the henchmen and their driver. The henchmen never hit Ernest once during the five minute chase, but Ernest is able to fend them off by hitting them and their driver in the face, making their car swerve off the road and explode in a giant column of smoke. I should also add that Ernest is slingshotting the eggs, two at a time, from a large bra.The set design is also incredibly poor in this movie. There is a large portion of the film in which Rene and Ernest are walking in Africa, trying to find civilization. During their hike, we see them walking through fields and jungles, which probably could have been shot anywhere in the United States. The fields are simply plain grassy fields, with no indication whatsoever of being anywhere near Africa (they could have at least digitally added some African trees in the background), and the jungles look like the woods of rural Connecticut with papier mâchè skulls, vines, and thorns hanging from trees. According to IMDb.com, the film was actually shot in South Africa, but I still wouldn't believe that at all.The movie goes on and on, Ernest joke after Ernest joke. The rest of the movie doesn't really make any sense either; the African tribesmen all speak English for some reason, and Ernest is later challenged to a \"Battle of Truth\" by the lead henchman, who is suddenly dressed in an outfit that resembles that of a ninja, yet also somewhat resembles that of a bondage submissive. The henchman has a table of axes, swords, knives, and maces before him, while Ernest has a table with a sandwich, a teddy bear, and a few other worthless items. However, Ernest wins the battle and somehow ends up saving the day.Overall, this movie is painful to watch. I couldn't handle it in one sitting; I had to stop halfway through and do something productive for a few hours to compensate for the brain cells lost while trying to appreciate Varney's humor. They should really put a Surgeon's General Warning on the box to let people know that they will in fact be slightly more retarded upon finishing this movie. I would have to say that out of all the movies I have ever seen, none comes close to being as pitiable as Ernest Goes to Africa.","I never thought an \"Ernest\" movie could ever suck, but boy was I wrong about this movie. This \"Ernest\" installment totally flat-out SUCKED!! The plot was atrocious, and the movie as a whole was excrutiating to watch. I watched this one out of extreme boredom, and I hardly ever laughed while watching this (The day I saw this dreck sitting on the shelf at the iggle video rental area at the nearby Giant Eagle near my house, and renting it was one major mistake.). The movie was so bad, that I had to turn it off less than an hour into it (something I never had encountered with any other \"Ernest\" film).Jim Varney is the high point of this dismal \"Ernest\" movie. His Hey You the Hindu character was funny, and the best part of the movie, the rest of it is well... crap.Just stick to one of the other \"Ernest\" films, and stay away from this one. You will be disapointed.","I saw this film when it came out in '97. I was in third grade at the time and was attracted to a new Ernest adventure. Even at age nine, I found it an unfunny, complete waste of time. I wasn't a hard kid to please- nine year olds usually aren't, but it was a bad sign when lovable and hilarious Jim Varney as Ernest P. Whorrol couldn't get much of a reaction of me.     Last Thanksgiving, I was looking through the TV guide and found that \"Ernest Goes to Africa\" was on USA at two in the morning. It was a lonely, secluded slot and I decided to give it some company. Then fifteen, I just wanted a smile and an hour and half of entertainment. My judgement hadn't changed in five years and I constantly flipped channels, but for whatever reason this one had me coming back.      You see, there is some kind of odd magic about this film that drew me in for some reason. Maybe it's Varney's presence...maybe its the wonder of generic, late night USA, but whatever it is, I would actually recommend watching \"Ernest Goes to Africa\".     The story is predictably trite.  Owing oh so much to `Raiders of the Lost Ark' the plot involves the theft of priceless jewels, the Eyes of Agolie, being stolen from a worshipping tribe by ruthless archaeologist Mr. Thompson.  They inadvertently end up at a flea market where Ernest finds them and makes a yo-yo out of them.  (Quick criticism, these jewels look completely like plasticit seems like director John Cherry III didn't even try).  With Ernest's beloved Rene, a waitress who is `sick of hometown ordinary shmoes', he is kidnapped out of suspicion and ends up fleeing Thompson and his goons in a series of scenes that become more and more unwatchable in a downward spiral.    There are some honestly terrible scenes that will no doubt repel you. It starts off on the wrong foot with a desperate opener where Varney tries and tries with his large amount of comedic skill to bring out laughs with his reactions to different African artifacts, but the scene fatally doesn't work.  Jim is brilliant at Ernest, but in this unrelated beginning he feels like some goofy friend trying to bring out a laugh when your in a mood incapable of letting you smile.        The film has even more to complain about.  It is shot on a pretty cheap-looking video that may turn you off right off the bat.  It seems every actor present besides Varney is either a bad one, or just an irritating one- especially Linda Kash as Rene.  The traditional Ernest gags like the cranky granny have finally become tried thanks to Cherry's dull direction this time.  He has a noticeable boundary between live-action cartoon and adventure film, and it is painful when frequently crossed.  This is by any definition an uneven film due to this boundary.      OK enough smushing this film; that is too easy of a task.  Liking it is a hard one, but I challenge you to attempt it.  This film has a great asset: how much fun it is to hate it.  If you don't feel the compelling magic I felt to watch it, then I recommend it for this pleasurable bashing, even if you are not a cynic.        The bottom line here, `Ernest Goes to Africa' starts of catastrophic, flattens even more in the middle and has an unpredictably unsatisfying ending, but if this comedic adventure isn't somehow an escape from boring old life, then I don't know what is. I recommend renting this bad film, staying up late, and letting it take you out of your head for an hour and a half."],"review-user":["jeffgrooves","Elswet","aaronzombie","SanteeFats","bug76","nohumpingcars","Clouds-3","helpless_dancer","TheLittleSongbird","Agent10","gavinshapiro","dootuss","Nick_Dets"],"review-date":["8 December 2002","24 March 2007","21 April 2000","21 April 2013","25 March 2011","22 June 2006","3 August 2002","30 April 2000","9 July 2017","22 May 2002","6 March 2006","7 October 2002","22 November 2003"],"review-rating":["6","6","10","1","7","4","5","2"],"review-title":[" A Very Funny Ernest Adventure-KnowhatImean?\n"," Don't Listen to Them! It's NOT That Bad! In Fact, It's GOOD!\n"," The best of the series that unfortunately won't continue\n"," I like it\n"," Hey, You. It's Ernest\n"," This is the most racist movie I have ever seen\n"," Good Ernest humor. Bad movie.\n"," Is Ernest stupid or just unlucky?\n"," To me, the weakest of the 'Ernest' films\n"," What a way to go\n"," What a pathetic film!\n"," Painful To Watch.\n"," Pretty Bad, But Surprisingly Memorable\n"]}