{"review-url":["http://www.imdb.com/title/tt0183979/reviews"],"review-text":["The movie is ok, you know what you're getting simply from the title. Anyone wanting oscar winning material should rent the god father, for those who want to see beautiful women and here bas dialogue this is it.Nikki Fitz makes this film with her amazing body which justly gets alot of screen time, the close ups of her ass are a rewind moment and she certainly seems to be enjoying her work. The other girls give just as much energy but it is Nikki who'll you remember most.","Virtual Encounters 2 features: 1) professional production quality 2) good editing that won't bore you 3) dopey skinny boys 4) a cheesy but cheery story 5) fun music, and 6) very nice looking girls who move themselves wellThey should show it in film school -- it's the best soft porn ever made. And be sure to get the unrated version.","*SPOILER ALERT* *SPOILER ALERT* I bought this DVD. Gentlemen, I give you Nikki Fritz. Her body is a work of art. How many hours of sculpting and molding go into making her body as tight as it is? It's truly mind boggling. There are plenty of hot women in movies like this but she stands tall above the rest. I'm going to petition Congress to have her body declared a national monument. Nikki Fritz, I salute you.\"Virtual Encounters 2\" is the tale of two cyber pimps and the virtual reality machine they adore. They charge their fellow students a fee for letting them live out their wildest fantasies. Seems reasonable. Nikki Fritz shows up for two cyber fantasies. The first one has her riding some guy on a motorcycle. The other one has her in a girl/girl/guy with some fellow construction workers. Both of these scenes are excellent and take full advantage of Fritz in sweaty motion.The only problem with this flick is that all of the sex scenes are shot like a rock video. Music blasts over every scene. So we never get to hear Fritz and friends say one single word, groan or anything audible during sex. I'm sure she would have added some sweet music of her own if someone had just turned down the stereo. Otherwise, \"Virtual Encounters 2\" is just what the doctor ordered for a Nikki Fritz fix.","This has no relationship to Virtual Encounters 1, so it's not really a sequel. The two videos just share the general concept of people having simulated sex through a virtual reality machine. So if you were really blown away by the story and dialog in VC 1 (yeah, right), and expecting a continuation in VC 2, just be warned.  All the actors and actresses are new, but it has the same excellent director, Sybil Richards.But like VC 1, you get lots of beautiful women and a lot of great sex scenes that push the envelope of soft core just about as far as it can go.If you have VC 1 and you liked it, you'll like VC 2. If you don't have either, but like really good softcore sex, get both.","At any given moment, there are probably at least a half a dozen versions of any adult-themed movie on the market: hard-boiled and soft-boiled; bland `R' or spicy `NC-17'; edited for European markets and edited for domestic cable. So tuning in late at night, we rely completely on the luck of the draw. But perhaps that's part of the appeal, those little surprises that (metaphorically) fall into our lap.So I was cautiously optimistic at the start of an `R' rated version of Sybil (or Cybil) Richards' latest entry in the Virtual Encounters' franchise. The plot, of course, is the merest scrap of an idea: horny college geeks set up a virtual reality business to cater to the sexual fantasies of other horny college geeks.   And the opening scenes are strictly `R', with coy camera angles offering discrete glimpses of naked bodies. (Although there is a moment of greater promise, when the camera lingers over the elfin charms of Brandy Davis as a nude model in an art class.)So the plot lurches forward.  We see a James Bond clone seduce a Bond girl in a brief and demure scene.  Ho hum.  We see one of our horny college geeks as a biker boy, waiting for his biker girl .  More ho hum.And then, like some memorable event high on the Richter scale, the wickedly pneumatic Nikki Fritz shows up as the biker girl and the moment becomes molten.  The scene is long and intense, spliced into this movie like one of those set pieces from Penthouse videos with names like `Hot Wheels' or `Leather Forever'. But don't misunderstand me.  This is a good thing.  In fact, this is a very good thing. And unless the MPAA has pushed the envelope on `R', I can only assume that some thoughtful programmer substituted an unrated version.And since we have been very good boys this year, there's yet another present under the tree, as the equally voluptuous Chrissey Styler joins Nikki in seducing some very lucky construction worker.  Hard hats fly, clothes are torn off and soon the screen is filled with naked, sweaty flesh.  One more long and ferocious set piece, apparently spliced in from the same Penthouse video,(And, as I watch more and more late-night cable and learn the syntax, here is a revision of one of the unwritten rules: girl-girl scenes are allowed in `erotic comedies', as long as the episode is fantasy or a dream.)After a few less memorable moments pass, Chrissey Styler is featured in her own scene, as a coed client has a VR encounter with Chrissey as a private dancer.  The pretty coed even gets lured on stage, undressed by Chrissey, and the two entertain us with their dancing and exchange a few provocative glances.Without these three interludes, `VC2', would be a mildly entertaining trifle, with scenes that wobble from modest `R' to racy `NC-17'.  But the charms of Chrissey Styler and Nikki Fritz are impossible to resist; their encounters vibrate like a sexual tuning fork and the rest simply surrenders to the fast-forward button.","Seldom is seen a film sequel that surpasses or even equalls the greatness of it's original predecessor. Such a film is VIrtual Encounters 2.\nIt's about a couple guys in college who sell virtual sex to the entire campus. If you like seeing naked chicks, this one delivers. Six-foot tall Chrissy Styler is an amazing specimen and you will be dreaming about her for days if you ever have the good fortune to catch the unrated version. She wears just the right amount of body glitter in her multiple nude scenes and her giant cans appear to be real. ( = Giddyup!!W/the exception of James Cameron's \"Aliens,\" Francis For Coppola's \"The Godfather Part II\" and - of course - the Zuckers' \"Airplane 2,\" this is the only sequel in movie history that takes a classic film and improves upon it. It's criminal the way this film was ignored by the academy. Nikki Fritz and that broad who gets tied up in the beginning (as well as the brunette who gets a rubdown towards the end) all deserved Best Supporting Actress nods.  \nShame on you, Hollywood!!!","Mildly goofy soft-porn late-night cable-movie fare.  Kind of amusing if you can buy into the concept of folks (mostly women) wanting to go off to some guys' dormitory to have virtual orgasms right there in front of them.  At least the main characters look like they're having fun.","The main character of this sex-filled drivel, Mel (Ethan Hunt), notes on several occasions, \"She deserves better than this!\" The \"she\" he refers to is Ginger, played by beautiful Brandy Davis, who indeed DOES deserve better than this. Brandy deserves better than this film, its lame script, and perverted Mel. A guy who gets off at watching his dream girl have sex with another man, even in virtual world, seriously does not deserve her AT ALL. An A- for the simulated sex scenes, an F for the script.","The plot and characterization of Virtual Encounters isn't worth mentioning, so I won't. But the sex scenes featuring Nikki Fritz and Chrissy Styler are worth mentioning. A wonderful golden light fills the scenes, bringing out the beauty of Fritz and Styler's skins (and the guy's too, to be fair). The sex scenes are more in the nature of tableaux than actual depictions of sex, composed for their beauty and for showing off the beauty of the actresses. I will also say this -- Nikki Fritz is not at all shy about giving up her butt to the camera, and she's got a gorgeous butt.Worth seeing strictly for the sex scenes, the Virtual Reality stuff is the merest rationalization for all the action.","... And boy is it soft I saw this on cable channel Bravo one Saturday night and here in Britain we often have these dire \" Erotic \" soft core movies turning up late at night on Bravo . This one follows a WEIRD SCIENCE type plot of a couple of college geeks building a virtual reality headset that makes you have sexual fantasies .  When you`ve seen one of these movies you`ve seen them all with a bunch of bimbos looking like they`re advertising silicone implants . Come on I`ve actually seen breasts in real life ( I`m sure some other of us have too ) and they wobble around unlike here where they defy the laws of , if not physics than at least gravity . The sex scenes are these tedious affairs where a well buffed geezer rubs himself against his co-star without any dialogue or sound apart from some muzak and when they climax it looks like they`re both having a bad attack of constipation . The girls themselves are very pretty especially Brandy Davis and Nikki Fritz but they`re wasted in these type of soft core movies And if it`s fantasy you`re after I recommend the LORD OF THE RINGS trilogy","Movies like this aren't generally watched for their plot, so I'll dispense with even talking about it. Rather, this film is all about the skin, of which this film has plenty of(or at least the unrated version I caught), in surprisingly explicit detail, I might add. And thus, pretty much ruins the whole point of softcore. Leaving something out stirs the imagination, and unable to show real sex, the simulation  is supposed to be more, I'll say 'dynamic', then the real deal. Sadly, this film does neither, and instead straddles the line between hard and soft quite poorly. If you want sex, you'd be better off getting a real porn. If you want imaginative (if not patently realistic) action, you'd be better off with something like Hotel Exotica. But there is plenty of skin, so it's not half bad.","This film is really, really full of sex. Hot sex. I watched it (of course) on Cinemax; and I liked it of course; those virtual fantasies are played out so much in great style, and I kind of enjoyed the story line. But one must know that when a soft porn film director sets out to make another soft porn film; all he/she wants to do is film good sex scenes. And I got nice sex scenes, full of skin. Yet another reason some people call soft porn Cinemax films \"Skinemax.\""],"review-user":["pete d","snsh","Dr. Gore","dbrown-070204","monsters from the id","tomt71","Gislef","deadkerouac","kargman","Theo Robertson","juwnd","mdf_316"],"review-date":["30 June 2002","29 May 2003","27 March 2005","26 September 2003","18 December 1999","7 December 2002","16 July 1999","28 February 2000","20 May 2001","4 August 2004","15 May 2001","14 June 2001"],"review-rating":["8","8","5","2","3","6","10"],"review-title":[" Nikki Fitz!!!\n"," best soft porn ever made\n"," Fritz me\n"," If you liked the first one, you'll like this one.\n"," Put On Your Headsets And Fasten Your Seat Belt\n"," Another Godfather??\n"," Electronic Soft Porn\n"," She deserves better.\n"," Great cinematography and composition makes sex scenes work\n"," Soft Core ...\n"," underwhelmed by the action\n"," i really enjoyed the film.\n"]}