{"review-url":["http://www.imdb.com/title/tt0119591/reviews"],"review-text":["Fresh, luminous Helen Baxendale and the magnetic Jason Connery, a slightly more subdued, less craggily Celtic version of his famous dad, make a sexy pair of doomed partners in this low-budget Scottish production.  Many ingenious touches, and some scenes, especially those leading up to the murder, among the most compelling versions of the play I have ever seen. A worthy successor to Orson Welles' cheeseparing lensing for Republic Pictures.  Good stuff.","This low budget production of Macbeth brought the play back to life again and is by far the best version I have watched. Jason Connery and Helen Baxendale are superb in their roles and bring a humanity to their characters that makes you feel with them. There is solid support, in particular from Graham McTavish, Iain Stuart Robertson, Kenneth Bryans and Jock Ferguson is brilliant as the porter. Jeremy Freeman makes a good job of his directorial debut, and should go far. This film is well worth watching.","Every review I have read so far seems to have missed a crucial point. Shakespeare wrote for the accent and the pronunciation just as he did for northerners in other plays. The Scottish accent changes the emphasis and rhythm of the language and affects profoundly what is said and the way it is taken. So, listen again and note the difference. The play is well done and the rhythm of the words are so much better than that provided by people using received, polite, well- enunciated English. I am reminded of the time a teacher in a school in Leicester, unknowingly, asked me, age 14, to read a piece of Walter Scott which was written in the tone of the Border. I come from the Border and when I read it as it should be read it made all the difference.","I have said elsewhere that only people who really know what they are doing should attempt to do Shakespeare. This also goes for the reviewers: only those who really know Shakespeare should attempt to review a Shakespeare production. Otherwise ignorance will make you say things that reflect as poorly on you as a poor Shakespeare production reflects on its creators.Why are many people saying bad things about the Jason Connery Macbeth? Well, one reason is that the technical side of things is not in order. The available versions do not have a crisp picture or sound quality, and the movie is kept in a torch-light mood which under these conditions tend to smudge the colors and the light somewhat. Which is a shame, because if the technical things were in order, this would be a very good movie. The direction is good, the acting is impressive, and the overall style is effectively atmospheric. It is not as good as it might have been, but it is almost as good as the Polanski version, and has its own characteristic style. It is colorful rather than dark, but an effect similar to darkness is achieved by the production being dominated by reds, oranges and earth-tone colors, enhancing the torch-light mood. The milieu and costumes are realistic and convincing, and the Scottish accents are great. Macbeth with the proper accents is the only appropriate way to experience this play!As I am a bit of an idealist, who tends to see a film in its (imagined) ideal version, I choose to look beyond the technical deficiencies of this movie, and judge it as if I had access to a crisp and perfect version. It is a worthy Macbeth in any case, all the more admirable for being a well-produced movie rather than a filmed stage play. It's really too bad about the technical defects; hopefully a more polished version will be available one day. But an enjoyable Macbeth in any case, and one that merits a good rating.8 out of 10.","Excellent performance. There still are good actors around! Also great directing and photography. Very true to Shakespear, and a 'must' for all Shakespear fans. Macbeth (Jason Connery) moved me to tears with his final monolog (out brief candle, out)He gave the sphere of moral decay and dark forces a human face, which makes it the more interesting. Helen Baxendale is a very credible lady Macbeth who can be very cheerfull at times and sometimes she just looks like a naughty girl, but deadly in her taste for blood and evil. If you love death and decay, and Shakespears lyrics... this is the one.","MacBeth, I've always thought, is the most accessible of Shakespeare's 'Great Period' plays. Compact, focused, with heaps of violence, it should have been the play most open to screen adaptations. I'm not aware of a really good rendering of the story, however - the best effort being Orson Welles's vigorous shoestring version. To the list of MacBotches we must add the Connery/Baxendale effort.(It seems it was not a 'film adaptation' at all, but a TV version that was given a theatrical release, post Luhrman's Romeo + Juliet and Branagh's Hamlet. That might explain some of its flaws, but doesn't excuse them.) It starts well, with a feisty battle sequence with pleasingly grisly witches looking on. Poor old Gray Malkin and Paddock are cut from the opening scene, but they aren't alone for long. In quick order they are joined by the bloodied Sargent and his account of the battle, the treachery of the Thane of Cawdor, the luckless master o' the Tiger, even MacBeth's meeting with Duncan when he is invested as thane of Cawdor. All of these had virtues that plead like angels trumpet tongued against the dark damnation of their sending off, but sent off they are. These aren't the only cuts, either. This is MacBeth in a hurry.From the opening battle we are pitched directly into MacBeth's encounter with the witches, which is well done. Brian Blessed, curiously, directed the witchy sequences, and he has great fun with the special effects as MacBeth and Banquo are told of their fates. Jason Connery as MacBeth is awkward, obviously unsure what to make of the verse. Graham MacTavish as Banquo, on the other hand, is capable, making his lines natural and easy. Within a few minutes of Connery's mumbling, the viewer is struck the urge to see the roles reversed and MacTavish in the title role. No wonder MacBeth felt he needed to kill him.These first few minutes marks the high point of the film. From there we move to Helen Baxendale receiving word of her husband. She's as lost as Connery, and denied the beard that he gets to hide behind. Her \"Unsex me here\" invocation of evil is embarrassing, not unsettling. There are some reasonably clever touches - MacBeth's \"We will speak further\" is not a sign of his hesitancy in the face of his wife's wicked ambition, but his attempt to silence her prattling as he throws her onto the bed.The acting of the leads is the biggest let down. Connery's method consists of staring glazedly about the screen while he mumbles his monologues via voice-over. Baxendale looks pinched and neurotic. An attempt to do something interesting with \"Is this a dagger\" - the fantastical dagger is a shadow cast by a cross on an altar - falls flat due to Connery's poor delivery and sloppy direction, which mars the production throughout. We accompany Lady MacBeth back into the murder chamber, where she gets to stab the reviving Duncan, but the effect is comic, not dramatic.Big scenes are botched - the appearance of Banquo at the feast is made incomprehensible through attempts to mix subjective rendering of MacBeth's delusion with what those around him see, or don't see. The second meeting with the witches is even less coherent, and the prophetic visions are confusing. Timing seems to be an issue here - Banquo's banquet is the centrepoint of the play, but the film moves rapidly towards conclusion after it, giving it an unbalanced feel and no scope for the intricacies of the riddles MacBeth is caught in to be appreciated, or for his descent into madness to be convincing. Another crucial cut is the scene where Malcolm tests MacDuff, and MacDuff learns of the murder of his family. This robs his revenge of most of its emotional force - and the character of a lot of the screen time. He's a virtual stranger when he turns up to kill MacBeth.A point for trying. MacTavish's Banquo earns another. The first few minutes garners another. But that's all. From then on it's sound and fury blah blah blah.","This is for \"mcjadt\", who wrote:\"Within a few minutes of Connery's mumbling, the viewer is struck the urge to see the roles reversed and MacTavish in the title role. No wonder MacBeth felt he needed to kill him.\"Funny, I felt the same way about the two actors who played those parts in Polanski's version -- and again when I saw the play live with Richard Jordan as Macbeth.It may be -- and I said MAY be -- that Shakespeare fully intended the audience to grasp immediately that Duncan is putting his trust in the wrong guy, and wrote their respective speeches accordingly: Banquo bluff, open, and truly self-assured, Macbeth a different breed of cat altogether despite his undoubted military skill and courage.I believe you are supposed to think: \"Huh. Something wrong with that guy ... Banquo's the cool dude, here ... \"And all three actors in the versions I've mentioned have let Shakespeare have his way.That's just one of the things that makes Macbeth such a tough role to play -- I tried it once in workshop form (the scene where Lady M is trying to talk him out of his scruples, such as they are) and just about turned myself inside out trying to reconcile the sensitive, brooding, poetic philosopher with the ruthless, merciless murderer -- the two sometimes showing up in successive speeches.Connery could have done better, I guess. So could Finch. So could Jordan. But since Bernard Shaw considered the role to be so unbelievable as a single human person as to be almost impossible to fully portray in a credible fashion, and since Shakespeare sets Banquo up from the beginning to be the better man, well ... best to focus on what any actor foolish enough to risk playing it does RIGHT, instead of wrong.","What do you mean son of actor, not an actor. You don't become an actor just because your daddy is a superstar---it doesn't work that way, not in UK at any rate.Macbeth (this version) is a low budget Scottish movie. You can't compare this to the Polanski version because Polanski has all the budgets in the world. Jason acted throughout school, but his big break came in 1985, when he landed the role of Robin Hood in Britain's \"Robin of Sherwood\" television series. He has appeared in many films since then, including \"Shanghai Noon\" and \"Lord of the Rings 2″. Jason has since moved behind the camera, forming the production company, Unconditional Entertainment. He recently wrapped filming on his latest movie, which stars Cuba Gooding, Jr. and Ray Winstone. And all this has nothing to do with being the son of Sean Connery. If you think Jason said to Sean, \"daddy, I wanna be in Macbeth movie that they are going to film,\" and Sean said, \"sure, son, whatever you say,\" and made a phone call and got his son the role, you are mistaken. In fact, Jason Connery is being cut out of his father's will. Seeing as how his father is Sean Connery, that's a big chunk of change Jason will be losing out on. The reasoning behind the decision is apparently Sean's strong feelings that his only son should learn to provide for himself. The relationship has become fairly strained, with Jason even threatening to change his name. ------------------------------------ Of being the son of Sean Connery,\"I realize that I'm always going to be compared to my father. There are innuendos all the time. Should I spend my whole life justifying myself?\" ------------------------------------So stop being a jackass and accuse him of not being able to act just because he is son of Sean Connery (big deal!).Watch Jason in Bullet to Beijing and you'll form a different opinion about his acting ability.","In terms of look and feel this is faithful to the period and Jason Connery and Helen Baxendale are excellent as the Macbeths, with the supporting cast in fine form. The film suffers from poor production values, cheesy music and some dialogue editing that is strange. However, and on balance, this is a good version of the Scottish play, and well worth a viewing. It compares favourably with most other versions and I await he new Fassbender version with trepidation, as the trailer shows totally inappropriate backgrounds. This Jason Connery version is a film interpretation of the play rather than a a film of the play as performed on the stage so allowances have to be made. The use of the Scottish accent is authentic and the costumes seem as accurate as they can be. Baxendales interpretation of Lady Macbeth is excellent, and Jason Connery makes a good fist of a difficult role.","Jason Connery is not an actor; he is the son of an actor. His Macbeth is the worst I have ever seen. Oh yes, he murders king Duncan, but he also kills William Shakespeare. His wife is even worse. Please, give me Polanski's version on DVD, so I can forget this monster. Jon Finch, Orson Welles, Laurence Olivier, there you have ACTORS!","Thank goodness not all Dutch people are that ruthless. I think Jason is being judged like that by most people, simply because he has a famous father. Maybe he's not as great as some of those actors, but he's definitely not as bad as suggested. I watched the movie some years ago, and I actually loved it. I knew Jason from other movies and of course Robin of Sherwood. But I must say I really liked his acting from this movie on. It was really good!During the movie, I actually forgot he was the son of. Sean.. who?And if you're a Shakespeare lover, I can recommend this movie. I'm sure you'll enjoy it!","I have just watched this \"latest\" version of Macbeth and was pleasantly surprised with the solid acting and obvious effort that had to turn a low budget historical piece into a fully fledged watchable movie.One note however, the music was very lame and added nothing to the intensity of the film and sounded like someone with a keyboard and a bunch of samplers as opposed to a full orchestral score.  I think Paul Farrer needs to get his act together!!!","I had high hopes for this production, being one of my favourite works.Indeed, a lot of it is reasonable: Helen Baxendale is not a bad Lady Macbeth, but lacks the devilry which the original character is infused with. Many of the minor characters do well, and the Scottish settings are superb.The big disappointment to me is Jason Connery in the title role: he seems to be reading his lines off a cue card with the wrong glasses - surely for the first time, as well. He can do so much better. Any production when compared to the sublime Ian McKellen (Macbeth 1979)who to my mind gave the gold standard performance, is going to struggle to be appreciated, but I actually fell asleep and had to rewind this one before I could get through it - hardly a great sign.Honestly, one to Avoid.","From the opening title shot of a candlelit Sutton Hoo war helmet (many might wonder what a relic of the East Anglian Vendel culture is doing in the Scottish Highlands, but of course those searching in the dust for thorough historical accuracy in Shakespeare are always on a hiding to nothing - and doubtless the striking clocks in \"Julius Caesar\" hath made those people mad), and the stirring strains of the pipes, we are plunged into a \"Macbeth\" taking place in a Celtic twilight of hairy \"Braveheart\"-esque warriors and gloomy castles, well fitted to one of the most grim and gritty of the Bard's plays.Old Shaky's story lines are well-known, so we may safely skip over the plot precis. Jason Connery takes time out from being known as the second (and second-best - nothing to be ashamed of as Michael Praed was so good in the role) Robin of Sherwood to give us a Macbeth believable as a seasoned warrior of Moray and trusty, if untrustworthy, vassal of an early mediaeval king. Helen Baxendale is as luminous and radiant as always, acquitting herself well with the accent, as my favourite Lady Macbeth (i have admittedly still to see Francesca Annis in the noted Roman Polanski version), swinging from highly-strung hysteria to sexy coquettishness as she lures her easily-swayed husband to do the deadly deed.The other standout member of the cast is Graham McTavish (Warden 'Nicey' Ackerman to fans of sci-fi sitcom \"Red Dwarf\") as the indomitable Banquo. Good direction and striking scenery in authentic Highland locations make this a Macbeth that will not have viewers crying \"Out, vile jelly!\", as they may need their eyes in order to give it a deserved second viewing.","I was looking forward to this film, because I like the play and I couldn't see how it could fail.  How wrong could I be.  Whoever had cut the play had cut everything not vital to the character of Macbeth, losing lots of good passages.  The Scottish lords were not developed and for all the reasoning it gave him *spoiler*\nMacbeth could have been killed by another lord not MacDuff.I think most of the failings in this were due to fiddling with the script as opposed to the acting but I have to say it is confusing when Sayton and Banquo look quite alike."],"review-user":["dale_switzer","honeybun-4","tony-gibbons","sarastro7","inez-1","mcjadt","clikdawg","gokool-david","robertasmith","JGDullaart","marieke234","Korben-3","musky-3","cold_lazarou","dennis-77"],"review-date":["23 March 2004","17 August 1999","20 February 2010","17 April 2010","30 April 2002","16 March 2009","12 November 2012","24 July 2008","24 September 2015","21 February 2003","29 October 2005","5 December 1998","18 June 2000","6 November 2011","18 April 2000"],"review-rating":["8","8","10","3","6","8","6","1","8","1","2"],"review-title":[" Surprisingly effective Shakespeare on a shoestring\n"," superb production\n"," Shakespeare wrote for the accent and it must be spoken like that\n"," Very good Macbeth movie\n"," There still are good actors around!\n"," Meagre version of a great play.\n"," Role Reversal?\n"," What do you mean?\n"," Could be a lot worse\n"," How to murder Shakespeare\n"," Great job!\n"," A nice effort\n"," Fair effort, let down by Connery\n"," Is this a Robin i see before me?\n"," Disappointments\n"]}