{"review-url":["http://www.imdb.com/title/tt0185364/reviews"],"review-text":["(There are Spoilers) Driving down a lonely country road one rainy afternoon Joanna Kndall, Margaret Colin,is distracted for a brief moment and runs down a little girl riding a bicycle on the side of the roadway. Doing what she can to keep the injured youngster comfortable Joanna goes to call for help at a local service station. Before she can give her name Joanna hangs up the phone in order to get back to the girl and see if she's all right; it's then and there when the nightmare begins for Joanna. Heart-wrenching drama that can effect any one of us when you try to do the right thing but are influenced by the words and feelings of those around you. Getting back to the accident site Joanna sees it's cordoned off by the highway police. Before she can tell them what happened, and her involvement in it, Joanna starts to have second thought about turning herself in. What would at first have been a tragic accident turns out to be a hit-and-run with Joanna facing time behind bars, if caught. Even far worse she has to live with herself in what she did seeing almost every day the family of the little girl she ran down Kelly Corey, Dallas Deremer, who goes to the same school as her two daughters Mindy & Holly, Gretchen Esau & Kira Posey. Joanna's life starts to come apart as she tries to keep the truth from her friends and family, not to mention the Eaton Police, of what she was involved with in little Kelly's accident. You can easily see how the words of her friends and neighbors as well as her husband Doug, Drew Phillbury, about the hit and run, effected Joanna. It was those words that had Joanna unable to bring herself to admit what she did not just for her own concern but her two daughters and her husband as well. Feeling that they'll be shunned by the people that they knew as friends as well as neighbors for years. Joanna on the verge of losing her mind tries to implicate her friend Nancy Grayson, Sherry Hursey, in Kelly's hit-and-run accident by trying to plant her earing, that she lost in Joanna house, at the accident site. It's then that she realizes what she's doing and suddenly stops,keeping her from making an already bad situation even worse, not wanting to have Kelly's accident but also innocent Nancy's freedom and reputation on her conscience as well. Margraet Colin gives a stunning performance as the guilt ridden Joanna Kendall and you can really feel for her seeing how she's being eaten up inside and not knowing just what to do. Wanting at first to turn herself in to the police a series of miscalculations causes Joanna to become a fugitive from the law. When she eventually did Joanna became the most hated and despised person in Eaton. Not being herself, when still at large, Joanna's husband starts to feel that she's either back to smoking or even having an affair. Never in a million years would Doug have thought that Joanna was the person who ran down little Kelly and left her to die on that rain soaked road! The look on his face, with his mouth quivering, when he found out the truth said it all.The last few minutes of the movie took a lot out of you knowing what Joanna was going through, not to downplay the suffering of the injured Kelly Corey and her parents, and how she now has to face the music for what she did and have to live with it for the rest of her life.","Just watched this film on TV and it was awesome. had just planned on watching it whilst doing some work however i ended up watching the whole film with out doing work as it was so good! Actors my not be very well know but the story line makes up for it. the fact that the actors make are less well known only makes it more believable that the events could occur. i did not feel a biased towards one character as i have no judgement of the types of character as i have never seen any of the actors in a film before which made it even more enjoyable.would recommend watching it.","Margaret Colin stars as the principal figure in this story; as I watched it, I remembered her bit part in Adrian Lynes's \"Ünfaithful\" as Diane Lane's neighbor in a tony NY neighborhood.This movie was surprisingly good, and Diane Stillman deserves credit for an accurate portrayal of class, crimes, and misdemeanors, which actually occur in upscale neighborhoods (perish the thought!!!).It is real but not over-dramatized; the audience lives through her accident, the pain it has caused;denial; and the ultimate resolution.It is more than just a question of \"what is a good person\" as Colin speaks to her husband....is a person's character defined by one single act; and should they be condemned forever because of their action?? The questions are pertinent; It is also amusing to see several cinematic references to Martha Stewart (i.e. the fussy, bothersome mother);Colin is reputed by her sometime friends to be a \"perfect hostess, with perfect genes\"....(gag); and a scene wherein Colin is confronted by police;(the \"friends\" also betray her, later)....The denial and facades of American society are addressed; (Oh, murder doesn't occur here; similar to the theme in \"Ä Season in Purgatory\", by author Dominick Dunne, about the true murder of Martha Moxley; in Greenwich, Connecticut); Colin is aware of her crime; but consciously finds herself perpetuating the facade, until she finally breaks down;rent or buy this film; she is an underrated actress who does quite well in these roles.","The main point of the movie, IMO, is the fact the Joanna's whole life has been nothing but a series of facades. The movie opens up with her secretly dying her gray roots, and hiding the used kit in an empty tissue box. What is strange is that she is hiding this from her HUSBAND. If she has to hide mundane things from her loved one, one can bet that she is hiding even bigger things from others involved in her life.When Joanna accidentally hits Cory, she leaves the scene to call the police. By the time she returns, the police and ambulance are there, as well as people from her community, remarking \"What kind of person hits a child then just leaves her there?\" Well-respected in her community, she makes the decision to keep quiet about what she had done. But, she never realized how difficult it would be the keep up her facades...Great movie-I have seen it many times!","***SPOILERS***   ***SPOILERS*** Wow, what a predicament Joanna has found herself in. After accidentally running over a young child, she goes to call for help, only to return to the crime scene amidst a group of very angry onlookers. Understanda- bly, this is too much for her to handle, and she flees the scene. Luckily the child didn't die, but is seriously injured and in a coma. So starts the biggest struggle in Joanna's life: should she keep quiet or speak up? At first she doesn't, but eventually she realises that it's torture living with such a horrible secret.At one point she even joins a search party to help find the culprit. And gradually a detective starts to question this woman's behavior. She wants to tell the truth, and she never meant to run away from the crime scene, but is it worth telling and having the whole town hate you for it?The thing about this movie is that you don't choose sides. Joanna is very much a good role model, even though she's made some wrong choices. You feel for her, even though you know what she did was wrong. Her journey is a good representation of what any human being would go through if something like this were to happen to them.Margaret Colin is an absolutely brilliant actress. She was amazing in the TV series Now and Again and great in films like Independence Day and The Devil's Own. Her performance here is so realistic and unforced that she carries us singlehandedly through the entire film. In the end, I wanted to see more of her. Lisa Vidal also provided some good supporting work as the gentle, resourceful detective.To wrap it up, if you wanna see a movie that will make you think long afterwards, one that will say \"This is reality\", then you won't want to miss this one.My rating: 9/10","This is such a great movie to watch and all the actors put together a great film which would be enjoyed by everyone! It is very emotional in parts, so when you watch it grab a box of tissues to keep you company!! This movie doesn't deserve a rating below 10/10!","Margaret Colin gives an outstanding performance in this made-for-television movie about her involvement in a hit-and-run accident. Driving home on a rainy afternoon in poor visibility she is distracted & then collides with a young riding girl a bicycle, knocking her off & seriously injuring her. After trying to make her comfortable she leaves the scene of the accident to phone for help. Some reviewers have pointed out a flaw in the plot that make the movie implausible. Everyone these days carries a mobile phone so why didn't she have one?. Back in 2003 when this was first aired it was just possible to believe she wouldn't be carrying a cell phone. When she returns an ambulance has already arrived as well as a large group of people. They all think the girl is the victim of a hit-and-run driver who has fled the scene. \"What kind of a person would do something like this\", they are saying. She is racked with guilt & fails to admit her part in the accident even to her husband. Things just go from bad to worse for her as tries to cover up her mistake & starts to lose her rationale. You really do feel for the poor woman & the torment she is suffering. A lady detective has been put on the case & begins to suspect that she might be involved by some of her increasingly odd behaviour. Her relationship with her husband is beginning to break down completely. When it all gets too much for her to bear any longer she decides she must tell her him the truth. It a shattering blow to their marriage & her relationship with her children. The girl's mother is furious at what she has done & cannot understand why she never owned up earlier. She will never forgive her & she is also shunned by her friends & neighbours who also despise her for what she has done. At the movie's end she is forgiven by her children but it is left uncertain as to whether her husband will ever do the same. Hit And Run is a made-for-television movie way above the average.","Spoiler Alert I worked as an extra on this Lifetime TV movie (filmed in Seattle). It's really interesting when you take part in the production of a movie, because usually, they are still in the process of either still writing parts (as was the case here) or making editing cuts and major changes from the final parts.My husband and I both worked as extras in this movie, and I recall them discussing on the set how it was yet to be determined whether or not the little girl dies in the end. Frankly, I never thought Margaret Colin's character really got adequate punishment for her crime of hit and run, lying to police, covering up, etc. Could you imagine how the ending would have had to change if she had ended up killing the hit and run victim instead of her ending up coming out of her coma okay? Just something to think about.By the way, I play a police detective you can see for a split second and my husband plays another detective you can see quite often (we've counted four times). Margaret Colin was great to work with and very down to earth, although Lisa Vidal (now a Lifetime regular) was aloof.Overall, the movie turned out to be about a 7/10, but like another poster commented, is still a real tear-jerker and makes a great Saturday afternoon cable flick.","\"Hit and Run\" is a shattering story starring the always wonderful Margaret Colin as a society lady who \"has it all\" until she hits a child with her car and leaves the scene. Hence the title. The tragedy is that she goes to call for help and returns, but is frightened away by angry passers-by who think the hitter abandoned the scene. This was made in the days when not everyone had a cell phone or there wouldn't be a story.Colin's guilt and anguish are palpable and cause her to act so strangely that a detective gets onto her right away. Her lies sink her deeper and deeper into a self-loathing hole, causing her to make a bad situation worse.This is a very thought-provoking story, and one can't help but to feel this lady's pain, wishing throughout that she would simply come clean.As a TV movie, thanks to Colin and a strong script, this is a well above average TV movie.","Most Lifetime movies are sappy, repetitive stories about pedophilia, kids who cut themselves, teen pregnancy and murder. It's not that these aren't important issues but it makes them cliché when overdone. I was surprised to find this among the heap, a strange yet possible story that de-rails the snobby neighborhood it takes place in.Joanna Is happily married, has two little girls and is a member of all the parent committees and has a good reputation among neighbors... but when her car hits a small child on a day of pouring rain, and she covers up the truth, she quickly learns what a choice like that can do. Meanwhile, the investigating police officer is hurrying to catch the mystery hit & run suspect, since she is trying desperately to get pregnant and can't believe someone would hit a little girl and leave her in the road.There were, as in every Lifetime movie, corny and sappy moments that just make you want to run outside and barf in an old lady's purse, they're so bad. But the soundtrack is haunting, perfect for the situation, the acting was great especially for a TV movie and the plot was thought-provoking. We may not have ever done something as drastic as squash a child in the road, but everyone has at one point or another lied to cover something up, and I'm sure most of us have regretted it. What Joanna suffers isn't so much what other people know, but more the mental turmoil of having to know that she's the one all the moms in town are out to find, that she's the one who hit that little girl.All in all it's pretty good for a Lifetime movie, if you want something new to pass the time this is one of the better ones.","When the police car made her pull away, all she had to say was that she had hit the child and had gone to call the police.That being said, we have a very interesting story here of a respected town family whose wife and mother accidentally hit a child during a severe rainstorm and when told to leave the scene, she did so.Obviously, the woman, a decent person, suffers from a nervous reaction to what has occurred and she is soon spotted by a female police officer as a prime suspect.You know that ultimately the woman would be caught or she would turn herself in. The film deals well with the emotional trauma she is undergoing and how the town is unsympathetic when the truth comes out.Given a six month suspended sentence at a hearing, the ending is poignant when the woman confronts her two young daughters. It appears that the children are ready to forgive her, but the town continues to ostracize her.","This is a story of a loving and wonderful mother who loved her family and all her neighbors and gave all kinds of parties for all kinds of occasions and raised money for community needs for the poor and needy. This woman was played by Margaret Colin, (Joanna Kendall) who on a very rainy day hit a little girl on her bike and left the scene of the accident in order to get help. However, she got cold feet and under very difficult circumstances decided to keep quite about what she had done until her soul bothered her so very much she started to get out of complete control of her life and family. Drew Pillsbury, (Doug Kendall) played the role of husband to Joanna Kendall and was finding it very difficult to find out just what was bothering his wife. Lisa Vidal, (Detective Rico) became involved in the case and decided to try and solve this case by investigating all the neighbors and started hounding Joanna Kendall. This is a story of just one fact, Tell The Truth and You Will Have No Problems. End of Story","This Lifetime movie entitled \"Hit And Run\" tells a story of a woman named Joanna Kendall,who hit an 8-year-old woman on a bike on the road while driving on a rain and mistakenly decided to run after that led her feeling enormous amount of guilt afterwards.It stars Margaret Colin as Joanna together with Lisa Vidal and Drew Pillsbury. No question that the premise of the movie is simple.If the Joanna only never multi-tasked while driving or had he just had a cell phone,her emotional nightmare would not have happened.Added to that,had she decided to tell the truth immediately instead on dwelling on the situation for a long period of time to that point that it got to better of her conscience,then things would have been a lot better for her emotionally.What about the 8-year-old Kerry riding a bike going home on a rainy day? Obviously,even her parents are partly to blame.There are many lessons learned from it.No question about it.But instead of dwelling on them primarily,the viewer will definitely get carried away by Joanna's situation due to the good performance of Margaret Colin.","Margaret Colin stars in this Lifetime movie entitled \"Hit And Run\" together with Lisa Vidal and Drew Pillsbury.In this story,we are introduced to Joanna Kendall,a woman who felt guilt-ridden after a tragic experience.Joanna was driving in the rain.But during the middle of her driving on the road,she tried to grab something inside her bag which led her to accidentally hit Kelly Corey,an 8-year-old child on the road while biking.Without a cell phone,she panics upon hitting her and decides to use the phone booth to call 911. But upon her return to the site of the accident,she was surprised that the ambulance and paramedics were already there.Upon recognizing the wrath that the people had felt,she decides to keep quiet about the incident which led the accident to be classified as hit and run.This led to Joanna to an agony of guilt as the movie progresses which affected her and her family life.I don't blame some reviewers by saying that there were some lessons learned from this movie.First,one must always bring a cell phone.The movie was made back in 1999.Cell phones were already of common use during that time.Another is not to multi-task while driving.No question that multi-tasking while driving has been a common cause of accident especially at present when people keep busy using their cell phones.In Joanna's case,she started to grab her pack of cigarettes from her bag.She should have done that when stopped or no accident would have happened.Other lessons learned should be to stop smoking for it causes a lot of bad things in our health.Finally,parents should pick up their children who are young as 8-years old instead of having them go home on bike.So in the end,the parents of Kelly - Tom and Bev Corey - should also be blamed for the accident that happened to their daughter.As for the movie,it was good that Margaret Colin did well in portraying Joanna that the viewer would probably forget all the silly mistakes by Joanna and Kelly's parents mentioned in the previous paragraphs.It also made it a better-that-your average typical Lifetime drama movie.","Joanna Kennd was driving home in the rain and hit a kid on bicycle when she tried to fetch something from her purse. She went to investigate and found the child is too seriously hurt to be moved, so she went for help. When she returns, she was waved off by the cops. Thus began the tormented journey for Joanna until she made things right in the end. Joanna, played by Margaret Colin is completely believable in the role. Her every grimace, hesitations conveyed the guilt and conflict (will she see her own daughters again). Margaret Colin has been one of my favorite actress since I first saw her in Independence Day. She adds a womanly grace to everything she does, even in playing a woman who had done some wrong. Thanks to Colin's excellent performance, this movie was captivating from beginning to end, despite a simple story line. There was enough happen stances to make it interesting and of course Margaret Colin pushed it over the top. With the success of Independence Day, I wish Ms Colin to land more substantial roles beyond television. Nine out of ten stars.","I heard that this movie was going to be on and wondered what it was about. It was all about a mom who hits a little girl early on and through a series of events, learns that she made a mistake. At first she helps the little girl but when she goes for help, she comes back to see and hear people talking about what kind of a horrible person would leave someone lying at the side of the road like that. She goes home and is frightened half to death about what just happened. She tries to tell her husband but he doesn't listen to her. It's a good movie that makes you learn to be more accountable for your actions! I liked Lisa Vidal's character of Detective Rico in this movie. She adds more to the movie I think.","SPOILER ALERT!  This movie made me want to jump into some Replay sneakers, join a clique of PTA moms, and make buying baguettes the highest priority in life!  It presents the viewer with a situation that we will probably all find ourselves in at one point:  whether or not to leave an accident scene where a critically injured child might need your help after you've run them over.  I'm really glad that I spent my Sunday afternoon watching this- now I know that when one is guilty of a crime like this, they shouldn't try to hide behind their super-long bangs and bite their lip.  They should jump into their Jeep and plant a friend's earring at the scene of the crime!","Joanna runs over a little girl on a bicycle while reaching in her purse for CIGARETTES. Let me repeat: reaching for CIGARETTES. That makes her a bad mother right there. Joanna is setting the WORST possible example for her children, and worse, she is endangering their health by sucking those nasty things. Not only is she reaching for cancer sticks, she's doing so while driving on a winding, narrow road on a rainy day. No rational human being could be that stupid. Then again, this is a movie, and Joanna was not rational. In my mind, cigarette smokers are hard-core drug addicts. But their actions will always harm others due to that vile second-hand smoke. As long as someone doesn't drive after drinking or drink to excess, it's not going to hurt anyone. Same with pot. Can't feel sorry for someone who abuses his or her body by smoking, then is so addicted to nicotine that he or she cannot concentrate while driving on a narrow, winding road, especially in bad weather.","The nerve of the woman who's daughter was hit. What kind of incompetent parent leaves their kid out on a country road on a bike in the rain? I almost lost my child, well, no thanks to you, Joanna should have told the witch.She's the one who belongs in jail along with her husband. Even still a pretty good movie unlike the cheesy crap they usually play.I would recommend this movie to everyone. Also you can't really blame her she did call 911. I may have done the same. At the end of the movie getting off like she did is unrealistic but still a good movie. So be sure to watch this one and keep an open mind. I would probably have given a little higher review but the stupidity of the parents made it impossible.","This movie was playing on Lifetime Movie Network last month and I decided to check it out. I watched for the first 20 minutes and then shut it off b/c I am sorry but plot holes that are integral to a movie's plot make the movie nothing but garbage.The movie is about a woman who accidentally runs a child on a bicycle off the road, leaves to get help, returns only to find out that it's being called a hit and run and there's a hunt for the 'monster' that hurt (in the end killed) her.This is a movie about a female in an affluent neighborhood who has 2 small grade school children and who is an active, sociable woman and yet in order for this movie to work, it needs to be believable that she does not own a CELL PHONE. Sorry, but that's complete BS especially when everyone else seems to have one - they used theirs to call 911 when they found the girl lying on the side of the road - when our lead female left the scene of the crime to go phone 911 at some payphone. When the lead female comes back, the ambulance is already at the girl's side and there is chatter about how horrible the person is who hit and left her.Just DUMB. Sorry but I am not willing buy that this woman doesn't own a cell phone which is needed for the movie to work. Please don't insult my intelligence movie, thanks. Maybe if this took place in 1970 or 1960, I'd buy it but it's clearly a present day (1999 at the time) movie. ..but wait, if she had a cell phone, there would be no movie. Pfft.The woman clearly knows about technology since she had computers in her house, ones the kids played games on so all the movie had to do was make her cell phone dead in the car, making her resort to another way to call the cops.. leaving out a cell phone altogether just created a ridiculous plot."],"review-user":["sol1218","y2nat","MarieGabrielle","MissLong","Saayman","Andrew Hopper","Hotwok2013","shelsie","blanche-2","TheBlueHairedLawyer","edwagreen","whpratt1","Marian20","Desertman84","sq8188-162-458059","Go_Skins","aim-imdb","DavidSKS","sharky740","PhantomAgony"],"review-date":["30 December 2005","24 January 2005","26 December 2005","22 December 2005","30 June 2001","14 July 2002","28 December 2014","3 January 2003","31 March 2005","17 September 2014","20 June 2013","12 May 2007","10 April 2017","10 April 2017","24 June 2016","1 April 2005","9 March 2003","3 October 2017","23 November 2016","31 January 2010"],"review-rating":["7","10","9","10","10","10","10","7","8","9","6","7","7","9","6","3","7"],"review-title":[" Imprisoned by Guilt\n"," Awesome\n"," Is a person to be condemned for one single mistake.........\n"," A Complicated Life...\n"," Suspenseful and Involving; Great performance by Margaret Colin\n"," A wonderfully adapted film!!\n"," A heart-rending movie.\n"," Margaret Colin was great on and off camera\n"," when good people do bad things\n"," One of the better Lifetime movies\n"," Hit and Run-The Law Made Me Do It ***1/2\n"," Tell The Truth Immediately\n"," Margaret Colin Gives A Great Performance\n"," Lesson Learned From Hit And Run\n"," Personal Study\n"," You better think twice!\n"," The moral of this story: Watch out for PTA moms on the run\n"," Reach for that cancer stick, woman!\n"," Stupidity\n"," NO Cell Phone? RIDICULOUS\n"]}