{"review-url":["http://www.imdb.com/title/tt0114694/reviews"],"review-text":["As it turns out, Chris Farley and David Spade only made three movies together (\"Coneheads\", \"Tommy Boy\" and \"Black Sheep\"), but this was truly the \"Citizen Kane\" of their pairings. Farley plays Thomas Callahan III, the dimwitted heir to an auto parts company. His father Big Tom (Brian Dennehy) hires mild-mannered Richard Hayden (David Spade) to look after him. Big Tom is getting married to a \"ten\" (Bo Derek), so everything has to be in order. After Big Tom suddenly dies, Tommy and Richard have to try to sell half a million auto parts to save the company from bankruptcy. From then on, the movie is pretty much an excuse for Chris Farley to do what he does best: make a mess of everything.When this movie first came out in the theaters, I saw it with my grandfather. He figured out early on that the Bo Derek and Rob Lowe characters were hiding something. But you can completely ignore that and simply luxuriate in Chris Farley's antics. Nothing is safe around his stomach, and hell hath no fury like his happy-go-lucky attitude. The scene where he sets the cars on fire, and later the deer scene, make for a pure laugh riot. Chris Farley and David Spade were truly the John Belushi and Dan Aykroyd of their era. It's a pleasure to always be able to think about \"Fat guy in a little coat\" time and again.","I saw this film knowing absolutely nothing about both it and its stars, Chris Farley and David Spade, and I have to say that this film is a comic classic. It is so stupid at times that it can only be hilarious. Farley is brilliant as the bumbling idiot who takes to the road with his dad's right hand man (the equally excellent Spade) to find the funding to save the families 'auto parts' business. Relax, put your brain on auto-pilot and soak up the fun. A great supporting cast features film favourites such as Brian Dennehy (Cocoon), Rob Lowe (Wayne's World) and Bo Derek (\"10\"). Highly recommended for a good laugh.","Yes, I know, it's not THAT old of a movie, it only dates to 1995. However, so much has happened in our world since then, it just *seems* like it's been around for years.I think the movie is very good and very funny, and certainly much better than critics gave it credit for (every time I see it in the TV listings it has only one star by it. Why?!). I watch it routinely (it's on TV a lot, especially USA network). Two things I like about it are the pacing, and the deeper story that plays in the background.First, the pacing: this movie hits the deck running and never stops moving, it just keeps rolling right along, from one nutty event to the next, but it is all carefully intertwined and everything works in   symmetry to bring the viewer to the (admittedly schmaltzy) happy ending. Anyway, I like it when a movie maintains a good pace or a rhythm, never letting itself get too bogged down. \"Tommy Boy\" is one of those.Second, the deeper story in the background: all the times I've watched this movie, I've never lost sight of the fact that the story didn't just revolve around some big dumb guy who couldn't seem to find his way out of a wet paper bag. No, there was always in the background the sad issue of Tommy Boy's beloved father dying. Plus, another sobering issue, that of how all this will lead to rather dire economic consequences for a business (Callahan Autoparts) that's been around for a long time and has employed lots of people in the town of Sandusky. Those two grim facts of life - death in the family and impending economic consequences - make this movie more compelling watching than one may realize, and I think this movie will hold up well over the years to come just for those reasons.But enough with the gloom already. This movie is just plain FUNNY, thanks not just to Chris Farley, but to an entire cast that seems to work really well together. I couldn't envision the cast members being changed or replaced in any form. And Chris Farley did such a seamless depiction of this funny guy named Tommy Boy, that I still, in my heart of hearts, just know that there really IS a big dumb funny guy named Tommy Callahan, somewhere in Sandusky, Ohio, who is running an autoparts factory. No, there really IS a Tommy Callahan, believe me... It's kinda' like Pee-Wee Herman: that wasn't really an actor named Paul Reubens playing him, no! - there really IS a Pee-Wee Herman, who is totally in love with his bicycle, and has a dog named Speck...Funny, but I look at waitresses in restaurants just a little differently now (thanks to that wonderful scene where Tommy Boy explains to Helen why he sucks as a salesman). And any time I'm feeling down, I just remember: \"Fat guy in a little coat.\" \"Hey, Prehistoric Forest!\" \"Holy Schnikees!\" \"Hey, quit playin' with yer dinghy!\" plus many other lines, LOL LOL Those will always cheers me up!","This film should go down as a slapstick comedy classic. Farley's untimely death should be lamented, he was a comic god. This movie is unashamedly stupid, but if you'll just relax it's also one of the funniest films you'll ever see.Ok, it has a paper-thin plot, but it does contain some cinematic firsts: a moose breaking its way out of a classic car; Rob Lowe being electrocuted through his pecker; a fat man in a little coat.See this film. Twice","This movie has everything! It has a good storyline, good acting, great scenery, adventure and some brilliant gags! Chris Farley plays Tommy Callaghanhe mega successful company 'Callaghan Auto Parts' has to go on the road to stop the company going under after Big Tom dies. The trouble is that Tommy knows nothing about break pads and needs the help of Callaghan Auto Parts worker Richard (David Spade). From the moment the two dorks hit the road, the movie is just so much fun. If you love slapstick with a great storyline you'll love this because the gags keep coming thick and fast and the movie will just make you laugh out loud! It was so sad about Farley's untimely death in 1997, but a credit to his genius is 'Tommy Boy'. Get it, chill out and enjoy this brilliant slapstick!","What can you say about Tommy Boy, well its without a doubt stupid, over the top, and not a film with any real message to make you think about life in general. But its also a very, very funny film and most likely my favorite Chris Farley film (Black Sheep coming a close second).\nI should point out that i am English so i haven't seen any Saturday Night Live shows and only know Farley and Spade from their films and Spades stand up comedy. I think that if you want a film to watch that kills an hour and a half and keeps you laughing from start to finish then this is for you.\nIt does have moments of slushy \"i love you\" in it but they are very few and far between and the slapstick comedy is well worth the wait. The story line is very basic, Farley must sell his late fathers brake pads to keep his business alive. But its the amount of situations that both Farley and Spade encounter along the way that make the film so funny and watchable.\nI can't say enough about this film to really sell it to anyone but it simply is a very, very funny film and ironicly if it has a message to leave the viewer with its how sad the loss of Farley is and how much great comedy was lost once he died.Watch this film\nRotten Addict!","This is a comedy in which Thomas 'Tommy' Callahan III (Chris Farley) who is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Thomas 'Big Tom' Callahan II (Brian Dennehy), owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy's soon-to-be stepmother, Beverly Barish-Burns (Bo Derek), and her supposed son Paul Barish (Rob Lowe). But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard Hayden (David Spade), Big Tom's right-hand man.  Beverly and Paul who are con artists and also husband and wife who try to con Tommy and his family out of the company's money.  Tommy and Richard travel all over the Midwestern United States trying to sell a half a million brake pads.  If they don't sell the half a million brake pads, the company will be sold to Ray Zalinsky (Dan Aykroyd).  This movie is full of great laughs and everybody will enjoy it. If Chris Farley was alive today, I bet there would be many more great and funny movies like this one.  There are plenty of great passages that I hear everyday from this movie.  I have seen it so many times I have lost count. I pretty much know it by heart.  It is that great of a movie.  Everybody needs to see it.","I watch this film (or portions of it) every time it comes on television. I don't buy many DVDs, but this is one I will definitely make an exception for eventually. Chris Farley and David Spade's antics have been well documented in the other reviews, but in addition to the comedy, you might also find yourself shedding a bit of a sentimental tear. There is one particular scene that had me going from tears of sentiment to tears of laughter in a matter of seconds (the sing-a-long in the car - you know the one if you've seen the movie). Even Rob Lowe had some very funny moments. Frankly, I don't know how they ever managed to finish this movie, as I wouldn't have been able to keep a straight face had I been one of the actors. I imagine there were a lot of re-takes.If nothing else, this certainly has to feature the funniest cow-tipping scene ever filmed, though I'd be hard pressed to cite other such scenes. Unlike many of the recent comedies, this one is funny throughout. Highly recommended.","I won't go into great details about this film, basically because there aren't many worth mentioning. It's just a funny little romp with Farley and Spade annoying each other and trying to sell some brake pads in their spare time. I must however say that one scene almost had me on the sticky floor of the theater because I was laughing so hard. In the scene, the duo are driving down a highway in Spade's recently trashed GTX. An old Carpenters song is playing on the radio and the two are emotionally singing along with it. That alone is funny enough, then the hood of the car pops up and they skid wildly out of control. This produces a hilarious argument culminating in Spade smacking Farley in the head with a 2x4.The only time I have ever laughed harder in public was during the snowman scene in Dumb and Dumber.That's really all I have to say about this film. Farley was an adorable slug of a guy. I miss him, even though some of his films were real stinkers.I'd give it 8 of 10 stars.So sayeth the Hound.","If you haven't seen Tommy Boy, I just feel sorry for you. Where I live, it's been everyones favorite comedy for ten straight years. Also, Black Sheep is another great one with Chris Farley and David Spade. This movie is pure, clean comedy unlike some of todays films. You'll laugh the hardest you've ever had, and you'll wonder why you hadn't seen it earlier. When Farley and Spade are on the same screen, it's beautiful. They contrast each other perfectly. I don't understand the low rating on this site. It's a shame people rated it so poorly. Spade really has some good one liner sarcasms that are gut splitting, and Farley has idiotic one liners the are hilarious. Even if you don'y like this movie, it gives you social status because its the talk of parties everywhere.","This is one of my favourite comedy films.  Chris Farley is hilarious as the accident prone moron and David Spade is perfect playing the straight-man to Farley.The dialogue between the two of them is brilliant. The scene where the two of them are in the car singing along to Superstar by The Carpenters is a classic.Chris Farley was a great comic actor who had amazing potential - he will be sadly missed.","There were very few truly classic Chris Farley movies. He died before being able to develop fully into a great comedic actor. The movies we have though, give us a glimpse of what could have been. Tommy Boy was the best of Farley's cinematic efforts. His pacing was great, his innocence and excitement are overwhelming and infectious throughout the film. The dialogue between Farley and Spade is so well delivered, that one can listen to it over and over (\"and thank you sir for choosing me\").The scenes that i think capture Farley's genius (and Spade's perfection in delivery) are the sales scenes (especially when Farley sets the man's models on fire. His escape into his imagination is wonderful, and it is something that leaves me breathless every time (as i am laughing so hard). Also, don't forget the wonderful line, \"And that's when the whores come\". Wait for it. Wait for it. its worth it.","Once in a while a movie comes around that really makes you laugh; not just an occasional giggle, but a wet-your-pants, remember-the-lines-forever kind of laughing.Tommy Boy is one of those movies.This is Chris Farley as many people see him now. His memorable performance as Tommy, a son losing his father and trying to keep his company alive, may sound tragic, but the hilariousness that he puts into it makes you forget that.David Spade also ties the story together. Playing Tommy's traveling companion throughout the US to help sell brake pads, his constant sarcasm and criticizing of Tommy keeps you laughing even during some serious times.Just as he has done many times, Chris Farley makes this movie all the more funny by poking fun at himself. For instance, nearer toward the end of the movie, he's sitting on a bench in the city just thinking about how much he messed up. It's a very somber moment. Suddenly, the legs on the side of the bench he's sitting on give way, and the half he's sitting on falls to the ground while the other half remains standing. His response? \"Could've done without that.\"I think it's hard to find a movie that makes you crack up without an R rating lately, making Tommy Boy a movie for most audiences.Chris Farley's death, no matter how long ago it was or how many people brush it off, was saddening to everyone, but this movie helps keep his memory alive and using laughter to ease the pain.","A totally awesome flick and a masterpiece. Farley and Spade at their best. One of those movies that keeps getting better over the years. The movie is also one of my all time favorites. The movie deals with Farley and Spade trying to save the towns auto break factory after Farley's dad's death. There's warmth,heart and pure fun with this film. Highly recommended to all. Nice Scenery to boot and the gags will have you on the floor rolling in laughter. Did I mention excellent acting? Chris Farley shines in a few touching moments as well as hilarious. You'll laugh til you cry. Bo Derek and Rob Lowe make an excellent team as the villains.A must see flick.","Forget Glengary GlenRoss. Never Mind Tin Men. If you're an intellect, Mensa (or MLM - Mensa Like Me), or \"High-Brow Humor\" (1000 bucks if you can forever once and only provide the single correct spelling for 'High-Brow') type of person -- you will get this. You will laugh your butt off. Literally. I've lost 12.5 pounds from watching this move repeatedly, dancing to the music, and jumping up and down with laughter. The acting is as believable and natural as it gets. Yes, from the whole cast. Savvy watchers will notice how Rob Lowe cannot keep himself from laughing during the 'hose-down' seen. Having lived just a couple doors down from Chris on 19th just off of Wells, I remember the 'Beverly Hillbilles' ride on the station wagon around the Mission. I remember how Chris was too shy to talk to people in social situations unless he could have a sip of \"Courage\". I remember the funniest, biggest-hearted comedian of a guy that loved life and entertaining, despite that he was always nervous doing it. Probably nervous because he didn't just want to do things right -- he wanted to do the right things.","This movie was right on! Been my favorite since a long time. Its all funny and all but if you watch the movie more carefully a third or fourth time, there are subtle messages that would help many people get thru hard parts in his/her life. This, at least in my opinion.If you ain't seen this movie....RENT IT and WATCH IT NOW! Its on the lines of movies like dumb & dumber, the water boy, just in case the 'intelligent' humor types are wanting to know what kind of humor, Tommy Boy is about! Well I have nothing else much to say, but if anyone liked Tommy Boy, mail me, I'll suggest more killer movies. Right now Will Ferrell is the rib tickling funny man of Hollywood.","This is my favorite movie ever, and I know most of the movie by heart now. This is one of the few movies to have ever made me laugh until I cry. I first saw tommy boy at the age of about 10, and thought that Chris Farley was the funniest man alive. Years after his death, I still hold that to be true. Farley as a child-like \"college graduate\" and David Spade as his Wise-cracking, impatient partner are the perfect roles for each. Who can watch the deer/car scene or Farleys \"other guy's brake pads\" speech without laughing? I recommend this movie to Farley/Spade fans, Saturday Night Live Alumni fans, Silly comedy fans, and those who liked Black Sheep.","I think Tommy Boy was one of Chris Farley & David Spades funniest movies. It showed they're acting ability and the true friendship of the two great actors.  The on-screen chemistry between these two were legendary. Nobody will ever be able to fill Mr. Farley's shoes...ever!  RIP- Chris Farley","Most Lorne Michaels films seem to fail because they're essentially just extended versions of skits that barely managed to make people laugh in five-minute segments. \"Tommy Boy\" is a character right from \"SNL\" - a big fat lovable (in their opinion) goof who doesn't know anything.David Spade gets the Thankless Overwhelmed Everyman role. He's paired with the Annoying Overweight Slob and they endure Miserable Misfortunes as they travel cross country to Save Daddy's Business.The plot, for starters, is really faulty. The whole premise - daddy dies and rich stupid son has to save the family biz - can be traced back to just about any movie you want. Like any SNL style film it is reduced to a simple motivation - empty, shallow; just a reason to see a fat guy and a thin guy be \"funny\" together.The movie's biggest \"influence\" is the 1987 comedy classic \"Planes, Trains & Automobiles.\" That movie is great because the plot isn't stale and recycled. It's basic, yeah - a guy traveling home for Thanksgiving gets stuck with a slob. But it's real, dammit. It makes all the difference. The characters are real, the situations are far more real. \"Tommy Boy\" is pure slapstick and its ridiculous situations undermine the characters - we feel nothing for them, and we don't care about what's happening on-screen. \"PTA\" walked the careful line between outrageous and utterly believable and relate-able - \"Tommy Boy\" is simply absurd, with jokes like a simple deer-in-the-headlights turning into a crash turning into a struggle with a dead deer that really isn't dead, then awakens and wrecks their car.The whole wrecked car thing is stolen completely from \"PTA\" and it's eerie how much stuff in this film actually does resemble the Steve Martin/John Candy movie.Farley is simply way too obnoxious to find likable - I've never enjoyed watching him in any movies and this hasn't changed my mind. Spade's given very little to do, serving as the movie's most thankless character.Dan Aykroyd is wasted as the Evil Baddie who plans to destroy Daddy's Business. The ending is a joke, and not in a \"har-har funny\" way. More like a \"oh god are they serious?!\" way.Some people dig it, that's cool. But I just can't get into it, nor do I appreciate all the stuff it \"borrows\" from - not just counting \"PT&A\" - without any credit whatsoever.","Well, on the day that Rob Schneider plunges himself further into the black hole of notoriously bad movies by starring in the absolutely not-at-all-wanted \"Deuce Bigalow: European Gigolo\" (hmmmm....wasn't there a film called Roadtrip which was followed by a sequel called Eurotrip? And now there's Deuce Bigalow: Male Gigolo followed by sequel Deuce Bigalow: European Gigolo.......I smell a pattern. Perhaps soon there will be Spiderman: European webs are Hotter.....or not) I am writing about this much maligned (at time of release) film. I was one of those maligners, I must admit. I turned my nose up at it even while Chris Farley shoved cocaine up his nose and the SNL cast struggled through one of the worst seasons in their history in '94-'95, the Norm McDonald anchorship notwithstanding. Films like Happy Gilmore, Tommy Boy, and Black Sheep came out in the couple years after this period and we realized there was a dark future for the caliber of Spade-Farley-Schneider-Sandler films. However I watched this film the other day, ten years after and 8 years after Chris died and could not stop laughing. Yes it's not particularly sophisticated. Farley does what Farley does (not unlike Manny being Manny) but his \"Van Down By the River\" motivational speaker shtick in which he laments that while he may not \"wash enough\" or \"wear well-fitting clothes\" or \"use deodorant more than twice a week\" translates well here as the ever self-effacing character who realizes he's not the brightest, not the best-looking, and could stand to lose a few pounds. All the same, he's trying his best to do what he's supposed to. And David Spade just tosses off his snide one-liners as he did for \"Spade's Hollywood Minute\" and basically stings Farley's self-esteem. There's really not a whole lot more to say than that. I love the one scene when Farley catches Spade spanking his monkey and then makes a couple quips about it. Can't remember what the first one is but the second one, they're lying in their hotel beds and Farley says to Spade, \"Do you like baseball?\". Spade mutters something inaudible in response and Farleys says, \"the New York YANK-ees?\" Anyway Farley does his awkward, painfully sensitive, frat-boy shtick. If you like, you like it. I couldn't stop laughing.","Tommy Boy (1995): Dir: Peter Segal / Cast: Chris Farley, David Spade, Bo Derek, Brian Dennehy, Rob Lowe: Pathetic juvenile comedy starring Chris Farley as Tommy boy and he has just arrived home from college celebrating an array of straight D minuses. That pretty much sums up the effort that went into this film. Brian Dennehy plays his proud father who hires him on as part of his business, which specializes in brake shields. He introduces Tommy to his fiancé and son, which thrills him to the point of inviting his new brother out cow tipping. On the wedding day his father has a heart attack and business is in trouble until Farley and right hand man David Spade on a road trip to save it. They are unaware that the new fiancé is really out to sell the company. Dreary plot reduced to road movie formula. Director Peter Segal shows potential here but with The Naked Gun 33 1/3: The Final Insult he had a better script and broader laughs. Farley and Spade go through one embarrassing situation after another unable to avoid mugging or overplaying. Bo Derek and Rob Lowe should have known better. It might have helped if Derek's seductress met with consequences. Certainly Lowe is met with greater consequence than just a bad career move. Purposed to capitalize on Farley's success on Saturday Night Live but it should be tossed into a busy interstate. Score: 2 / 10","Tommy Boy is one of those rare movies that will make you laugh out loud even if you're sitting alone in your home watching it on video. It is a genuine tragedy that Chris Farley died so young, given his comic potential. When Tommy Boy first came out, I thought SNL alums Farley and Spade had the potential to be a modern-day Hope/Crosby comedy team- doing a series of movies together, playing more or less the same type of characters and entertaining us with their adventures. Though their subsequent buddy flick, Black Sheep, was a much weaker film, it showed that the duo had the potential to continue churning out comedies while sticking to the basic formula. Had Chris Farley still been alive, he most certainly would have starred alongside Spade in Lost & Found (the buddy part was written with him in mind), and continued the trend. Tommy Boy is one of the most entertaining, quotable, genuinely funny comedies of its generation!","This movie is by far my favorite movie of all time. There is just no comparison to this film.The title may seem stupid, and it may look like another American Pie, but no. This movie actually is quite good and well written. The jokes are hilarious and you will be laughing every minute of this movie.There is not one moment of this film that I didn't like. It even has a great plot to it. Tommy, a hopeless 20 something who just graduated college returns to his hometown of Sandusky, Ohio. He is given a job at this father's auto part company, even though he isn't very smart. Tragedy strikes though, when Tommy's father dies and the company is in danger. In order to save the company Tommy must sell at least a half a million of the company's break pads in order to pay off the bank.To do this Tommy (Christ Farley), goes on an insane road trip with Richard (David Spade). Richard, a smart and sarcastic man, is reluctant to help Tommy. He thinks the entire trip will just be a failure.I won't give away the ending, but the end result of this film is great. Its a good comedy. Chris Farley was hilarious in this film, him and Spade are magic together.","Farley and Spade's best work ever.  It's one of the all-around funniest movies I've ever seen.  Watch it once and you'll be hooked and soon have all the lines memorized.  No sleepy for Tommy Boy!","This is your typical junk comedy.There are almost no laughs. No genuine moments. No memorable lines. No scenes where you think to yourself, \"that was clever\". Nothing. The plot is embarrassingly bad. It's ugly to look at and boring as hell! There is no substance here. This movie has nothing. It doesn't matter if Farely was in this or not. A crap movie is a crap movie no matter who's involved. Also, David Spade is a terribly unfunny comedian who plays the same lousy character in ever movie/TV show that he's in.This movie was dead on arrival. There is no life here. No fun. No intelligence. There are plenty of other \"dumb\" comedies more enjoyable that this one. This film is just pathetic. 2/10"],"review-user":["lee_eisenberg","rob-236","Eric-1226","Nathan F","GrantCAGE","rottenaddict","collinroever","jordan2240","TOMASBBloodhound","Xpect25","Andy B-8","pmcguireumc","bandgeek428","mrtroll2006","djvisocky","sand_warrior","clover_hat_boy","nothin_but_cheeze","MovieAddict2016","tnrcooper","anaconda-40658","baritus","lovedance215","Miller13","rorschach46"],"review-date":["5 June 2005","18 May 1999","8 September 2001","28 February 1999","16 May 2001","19 February 2003","19 April 2004","18 July 2005","11 January 2004","4 July 2005","27 August 1999","9 November 2009","14 July 2006","5 July 2006","4 April 2006","29 May 2005","20 February 2005","22 June 2003","31 August 2005","12 August 2005","29 May 2015","5 February 2006","3 January 2005","6 January 1999","30 November 2007"],"review-rating":["10","8","9","10","10","8","9","10","10","10","10","10","4","8","2","10","10","10","2"],"review-title":[" Thank you, Chris Farley, wherever you are...\n"," One of the best comedies of the '90's\n"," Still funny after all these years...\n"," Top movie\n"," Farley's Best Movie By Far!\n"," Chris Farley at his best\n"," Great Comedy Everyone Needs to See\n"," If you didn't find this funny, then you need to find a sense of humor\n"," The second hardest I ever laughed at a theater.\n"," Greatest Comedy\n"," A personal favourite.\n"," A film that captured Farley at his best\n"," What could be funnier?\n"," Tommy Boy\n"," The Best Sales/Motivation Movie Ever Made...Period\n"," Brilliant Brand of Humor with Subtle Message\n"," Favorite Movie Of All Time\n"," !!!Great One!!!\n"," Simply not very funny at all and rips off loads of other movies\n"," Hilarious hilarious film. Chris Farley is missed\n"," Overrated Crap!\n"," Great Comedy\n"," Greatest Comedy Of The 90's\n"," Housekeeping!\n"," Poor\n"]}