{"review-url":["http://www.imdb.com/title/tt0119848/reviews"],"review-text":["Walter Matthau and Jack Lemmon, both of whom are sadly missed, proved once again that they were a team dedicated to their craft of bringing hilarious moments to the screen. This film is just another example of this.This time out they play two brothers-in-law who land on a ship as dance instructors on board.Of course, their boss is a perfectionist and miserable person named Gil Godwin who just enjoys harassing these boys. It's hilarious how Lemmon gives a quick lesson in dancing to Matthau and how the latter dances a riotous rumba with the boat's owner Rue McLanahan.Too bad that fellow dance instructors Hal Linden and Donald O'Connor are given so little to do but their parts call for that. Matthau falls for Dyan Cannon, on board with her fellow gold-digging mother, the usual outrageous Elaine Stritch. Unknown to them, Matthau has no money either. The widower Lemmon falls for Gloria De Haven, looking lovelier than ever.The film belongs to Matthau and Lemmon and will serve as a further tribute to their illustrious careers.","I found this movie to be quite good. Although some people call this movie the \"Grumpy Old Men And The Sea\" it is hilarious at the right moments and soft at others. Matthau and Lemmon are two great actors and if you like one or both of them, be sure not to miss this film.","A competent comedy that delivers the laughs for fans of Jack Lemmon and Walter Matthau. I suppose this film was made for those who enjoyed the two GRUMPY OLD MEN films, as there seemed to be a bunch of these buddy team-ups spotlighting the comical duo in their twilight years. The idea is a sure-fire one: Matthau, a bumbling gambler who's thousands of dollars in debt, connives his unsuspecting friend Lemmon into taking a free cruise with him where they can meet rich old ladies; the catch is, they've been signed on as Dance Hosts and Matthau can't dance. OUT TO SEA is a funny film, and not all of the chuckles are to be found courtesy of Lemmon and Matthau. I found Brent Spiner (best known as Data from STAR TREK: THE NEXT GENERATION) to be very humorous as the snobby ball-busting dance coordinator. As the prissy boss of the two aging actors, he manages to match them in the laughs department. Though the film doesn't really need any, there's also a a love story or two to be found here as well, involving Dyan Cannon (who looks pretty fine for her years). *** out of ****","Movies aren't always suppose to be about deep, provolking thoughts. Sometimes they're simply meant to be escapes from reality. Out To Sea fits the bill perfectly. A light hearted \"golden years\" romantic comedy, Out To Sea may not be big budget, you might be able to easily tell when they were acting in front of a green screen, but it's still very much a movie worth watching. A sweet movie that needs to be given a break. This is just good, light hearted fun. It's not meant to be a deep movie. It's something worth watching. If for nothing else, you must see it for Brent Spiner's humorously stiff and uptight rendition of Oye Como Va. Gil is a character you love to hate and Mr. Spiner pulls off the perfect evil comic foil to two beloved comedy movie gods.","While this movie is not the most entertaining in the world, I think it is better than most over all. I mean it had it's little laughs and just all around a good feeling. It's not too often we get to see two old geezers just having fun with their age and honestly having a good time with the jokes. Walter and Jack had such a great chemistry together as friends/brother in-laws. Just watching them romancing these women was fun and you rooted for them all the way because wither we have to admit it or not, for their age, they still had game! :D I loved just the whole plot of being able to move on and having fun no matter how old you are. I'd recommend this movie for a nice laugh if you want one.7/10","I was totally surprised just how good this movie actually is because when I first saw it I was only mildly amused! I must say however, that I am still very disappointed that Donald O'Connor wasn't given a bigger and better role! He was an enormous talent.There is a great chemistry among all the main cast members and Matthau has never been funnier.I am tremendously glad that this picture got made because we get to see Lemmon and Matthau team up for the very last time; in a vehicle that puts their talent to great use. Brent Spiner proves that \"Data\" from Star Trek the Next Geeration is not the only good character he can play.The storyline is really quite simple but the comedy and the characters work really well and I laughed heartily throughout this movie and I highly recommend it.","Walter Matthau plays Charlie Gordon who cons his widower brother-in-law Herb Sullivan (Jack Lemmon) into a cruise in search of rich and lonely ladies.What he doesn't tell Herb is that they have to be dance hosts. Out to Sea from 1997 is a comedy with excellent actors.There are great performances from Elaine Stritch, Dyan Cannon, Gloria DeHaven, Rue McClanahan, Estelle Harris, Hal Linden and Donald O'Connor.Lemmon and Matthau make a great team in the lead.This movie would be much worse without them.This legendary couple saves the movie.They're both dead now.Matthau died July 1st 2000 and Lemmon June 27th 2001.These two made us laugh in so many movies.The world of comedy lost a lot with them.So thanks for the laughs you two.We will miss you very much.","Charlie Gordon (Walter Matthau) is the guy who can't seem to let go of horse racing. The debts pile up high on his head. So, he decides that it is time for him and his brother-in-law to take a trip out on the open seas. His brother-in-law, Herb Sullivan (Jack Lemmon) whose wife passed away reluctantly tags along. It is not until they board the Westerdam that it is realized that Charlie signed them up as dance hosts. What follows is some hilarious antics not only on the open seas, but on the dance floor. And a sweet love story also comes along too. People criticize this movie for the pointlessness it brings. It is actually quite funny, but seems to be geared more toward the seniors' group. I think this movie was quite good. Rent it for a weekend and just see.","I got a few laughs out of this one, more than a lot of other so called comedies. The big ship was a knockout and getting to see a lot of it's scenery was fun: as was getting to see some of Dyan Cannon's curves. This wasn't the height of Lemmon's and Mattheau's career, but it wasn't a total dog as some suggest.","Jack Lemmon and Walter Matthau have got to be one of the best buddies ever to work together. They have made lots of movies together, i think they are both fantastic when they do work together in a movie. Out to sea is a fantastic comedy movie i think to watch. I give the movie 10 out of 10. Jack lemmon and Walter Matthau will be remembered when the movies they did together will be on tv. They will be sadly missed. God bless you both.","After the making of GRUMPY OLD MEN and GRUMPIER OLD MEN, the box office success of those two films made it evident that another film property co-starring Jack Lemmon and Walter Matthau was needed. They found one property, THE GRASS HARP, where they shared one scene together. But then this film was made which was fully their film together. Like most of their films Lemmon is the quiet partner who is dragged into the troublesome situation by the noisy partner Matthau. Here they are brother-in-laws (Matthau's sister, who is dead). Matthau convinces Lemmon that he needs to take a sea cruise to end his long period of mourning. Lemmon does not realize that Matthau got them free passage by signing them onto the cruise as social dancers (partners for elderly lady passengers). Lemmon can dance, but Matthau cannot, and one scene has Lemmon trying to teach Matthau, only to be caught by Donald O'Connor and Hal Linden dancing together (O'Connor and Linden jumping to the wrong conclusion). If they can't pull their weight as social dancers, they will have to pay the $1,500.00 per person fare as travelers. Neither can afford that. Matthau really could not care much about this - he hopes that he will be lucky to find, romance, and marry a wealthy woman. Lemmon is encouraged to do the same, but he is not as mercenary. As it turns out Lemmon does meet Gloria De Haven, and Matthau meets Dyan Cannon (and her mother, Elaine Stritch). But the course to true love is never smooth in movies. Matthau has a rival for Cannon, in Edward Mulhare. And Brent Spiner, the cruise entertainment director, is an evil martinet determined to impress the cruise line owner (Rue McLanahan) to put him in control of all the cruise ship's entertainment centers.It is a well-cast film, which helps (this is reminiscent of the two \"Grumpies\" films that preceded it. But those films had better balance to them. They had moments of pathos where one could see Lemmon and Matthau were not just funny men but human types. Here Lemmon is shown to have such a weakness - he has romanced De Haven in spite of his qualms, but at a critical point remembers his deep love for his first wife. But Matthau's personality is so mercenary (a \"cousin\" to his \"Whiplash Willie Gingrich\" in THE FORTUNE COOKIE), that his turning into a legitimate lover of Cannon doesn't quite sit well. Nor does it sit well when we find other likable characters can be equally mercenary.However there are plenty of great moments in the film. Spiner's unplanned involvement with a colorful local parade is one. So is Matthau's ridiculous dance with Rue McLanahan that looks atrocious (he calls his non-steps, \"the crawl\")but that she enjoys. Spiner, better known as \"Mr. Data\" the android in STAR TREK, THE NEXT GENERATION, turns in a fine comic villain performance. My only criticism is that Linden and O'Connor seem too peripheral in the plot (although both do give filler about the ruthlessness of Spiner, whom Linden really dislikes). But the film is still very amusing, and worth while seeing. Unfortunately it was not their final film. That would be THE ODD COUPLE II.","There isn't much to say about this film. It is entertaining, and was not made with the intent of winning any major awards, but just to make people laugh. Most of the humor works quite well too. It is very reminiscent of Lemmon and Matthau's other projects together THE ODD COUPLE II and Lemmon's solo with James Garner MY FELLOW AMERICANS.The film has divine originality as the plot has not been done before; but the story has its share of cliches. The dance host director (played by Brent Spiner) who has the honor of taking on the \"bad guy villain\" role of this film is quite laughable, but still acceptable. The film goes from depressing to funny as hell and makes you forget your life for a while.Quite a good comeback for the Grumpys. Well worth watching. I recommend you see GRUMPY OLD MEN, THE ODD COUPLE II and MY FELLOW AMERICANS.OUT TO SEA: 4/5.","8/2008. When I originally wrote my comments, shortly after first seeing this film, I took a critical view, feeling that Lemmon and Matthau had basically \"phoned-in\" their performances, which paired them in a manner they'd done several times previously.But upon seeing it again, it seemed different, especially in view that neither of the two main mega-stars lived a great deal longer after its release.With the exception of Spiner, all of the eight principals are performers with considerable experience, and likewise unavoidably a lot \"longer in tooth\" than we've seen in many of their other film and t.v. work. But isn't almost everyone?Seeing it again, while it certainly won't be regarded as a \"classis\" in any of their careers, it is a fun film, with a lot of interesting scenery as well.From my viewpoint, it reminds me that many films, plays, etc., can often be looked at either from a very critical viewpoint, or looking instead to the lighter side, without expecting a film to be another \"Citizen Kane,\" \"Casablance,\" or (in terms of the two leads), another original \"Odd Couple.\" It also will provide a continuing piece of nostalgia for Lemmon and Matthau, as well as the others in the cast.","It is a great film, just like any other movie that Jack Lemmon and Walter Matthau do together. This one was hilarious. Two guys that pose as dance hosts to go on a free cruise. Thisfilm was funny, hilarious and a joy to see. I remember when this film first came out and I first heard about it I said to myself I can't wait to see it, I know this film will be good and it was. I liked Jack and Walter's adventures in this film especially the Cruise Director, Gil Godwyn who was such a jerk to work for, But it was funny to see Jack and Walter test his patients. Never the less if you haven't seen this film yet you are missing out on a great film. Jack Lemmon and Walter Matthau always work so well together in films. It is a shame that they are no longer with us.","\"Out to Sea\" (hereafter \"OTS\") is basically a melding of \"Grumpy Old Men\" (or \"The Odd Couple\", take your pick) with a typical \"Love Boat\" episode. Before you groan and decide this is something you might want to skip, I wish to assure you that comic and acting (and sadly, now departed) legends Walter Matthau and Jack Lemmon effortlessly turn on the smooth, wacky, exasperated, and cunning charm to make OTS a laugh-filled, satisfying, if somewhat predictable romp.The frantic fun begins when Matthau's character Charlie Gordon, a shifty gambler in hock with several bookies and loan sharks, persuades his despondent, widowed brother-in-law Herb Sullivan (Lemmon) to take a cruise with him on-board the Holland America liner Westerdam presumably to cheer him up. When Herb protests that neither of them can afford a cruise, Charlie assures him that he managed to wrangle free tickets. Herb grudgingly agrees.Of course there's a catch. Only after they board the ship does Charlie inform Herb that in exchange for the free room and board, they must serve as dancing partners and escorts for \"unattached\" women passengers. Though Herb is understandably agitated with Charlie for this con, he figures he and Charlie can make the best of it. After all, cruises have all sorts of amenities and benefits, and the Central America/Mexico itinerary is enticing. Besides, Herb is a good dancer. But, of course, there are other catches.One, while Herb can trip the light fantastic, Charlie can't. In fact, Charlie has all the dancing grace of the Scarecrow from \"The Wizard of Oz\". Two, their boss is the despotic, brown-nosing, and smugly irritating martinet Gil Godwin (Brent Spiner, in a role as diametrically opposite to his unemotional, rational role as Data the android from \"Star Trek – The Next Generation\" as a role can be). Gil is the cruise director from hell with a soul of a drill instructor. He warns all the dance partners that dancing is as far as it goes with the women passengers. Any kind of relationship, even the most casual, is strictly forbidden. Naturally, Gil keeps a haughty eye on Herb and Charlie – especially Charlie, who spends much of the movie shirking his dancing duties and dodging and disobeying Gil's edicts.And so \"OTS\" launches into a comedy of deception, mistaken identity, and screwball antics. Besides avoiding Gil, Charlie keeps busy by playing poker against the snobbish, wealthy card expert Cullen Carswell and doggedly wooing the apparently glamorous, well-to-do Liz LaBreche (a still stunning Dyan Cannon), traveling with her ornery, cantankerous mother Mavis (Elaine Stritch) who wants her to marry someone worthy of her social station and who instantly disapproves of Charlie. Meanwhile, the more subdued Herb finds his own romantic interaction with Vivian (Gloria DeHaven), a fetching widow traveling with her grown daughter and son-in-law. They are mutually attracted to each other. Problem is, Vivian, through Charlie's interference, believes Herb is a doctor. Herb is actually a retired Gimbel's sales clerk, but is afraid to tell Vivian the truth because he doesn't want to disappoint her. Besides, Herb still stubbornly yearns for his deceased wife of 46 years, Susie.Again, the plot is straight out of any \"Love Boat\" episode, but Matthau and Lemmon are consummate, confident pros who can squeeze laughs out of the most outlandish doings. Through both physical slapstick and quick and sharp dialogue, Matthau and Lemmon seem to be having a ball in \"OTS\" and therefore let us have fun, too. And yet, good comedies always have a core of emotion and pathos. Both Matthau and Lemmon have it in \"OTS\" and so we hope that they can rise above the sticky deceptions and white lies they have built and find love and fulfillment. Do they? Well, think about any \"Love Boat\" episode and how it turns out that Herb and Charlie aren't the only ones harboring secrets in the movie, not least Gil and his shameless flattering of ship owner Ellen Carruthers (Rue McClanahan) in order to secure a promotion, and rest assured that poetic justice comes into play.P.S.: Although I have been on several cruises with several cruise lines, including Holland America, I have never been on the Westerdam. OTS showcases the ship well and I'm sure Holland America was grateful for the publicity. I would love to take a trip on the Westerdam someday.","A bit of the plot from Moon Over Miami and even more from The Monte Carlo Story has Walter Matthau as a degenerate footloose gambler getting a bit long in the tooth persuading an equally aged, but more square Jack Lemmon to take a cruise and try and fleece the old ladies in Out To Sea.Matthau needs Lemmon because Lemmon can cut it on a dance floor and he's signed them on as dancers for the unescorted women on the cruise. Of course Lemmon doesn't know that. What he does know that Matthau who is the brother of his late wife has come to him with one scheme after another for years. And Matthau owes some big money to the bookies and that's why he needs cash.So they go on the cruise and as for Matthau he gets involved with Dyan Cannon and her mother Elaine Stritch and its poker not the dance floor where he meets them. Matthau has to deal with a pompous Englishman in Edward Mulhare who really is a sitting target for Matthau's cons.As for Lemmon he gets involved with Gloria DeHaven who is accompanying her daughter and husband on a holiday. They don't think she gets out enough. Oddly enough that's how Matthau feels about Lemmon.As for the rest of the cast, Star Trek's Data Brent Spiner has a great part as an obnoxious twit of a performer and dancer who lords it over the others of greater talent who also include Hal Linden and Donald O'Connor. Matthau bounces some great lines off him and Spiner's reactions are priceless. I'd also have to single out Elaine Stritch who comes into her own explaining the facts of life to Cannon.During the Nineties we were fortunate indeed to have Lemmon and Matthau in some great films, specifically written for them. In Out To Sea you can see that a great supporting cast was assembled for them. Like some of the comedy teams, these two comic actors did variations on their first film together The Fortune Cookie where Matthau is the con artist who is always dragging Lemmon into one of his schemes.Out To Sea isn't as good as The Fortune Cookie or the first The Odd Couple, but it's still plenty funny.","with two old friends.I've always enjoyed both Lemmon's and Mathaeu's films, and of course their team efforts are always worth watching, and often hilarious.Although I didn't personally regard this film as in the hilarious category, it is certainly a competent and entertaining vehicle for fans of the two principle actors and of 60s style romantic comedy plots.Brent Spiner may actually steal the show in terms of laughs as the arrogant and tyrannical Cruise Director.Gloria DeHaven proves that senior ladies can remain enormously attractive.","i think matthau and lemmon are the funniest pair of comedians and god's gift to film!  i think they are really talented and have great chemistry in every film they did together and OUT TO SEA is no exception!! dyan cannon is great in her role too.","\"Out to Sea\" is a fun movie starring that wonderful duo of Jack Lemmon and Walter Matthau. This film is not quite as funny as their \"Grumpy Old Men\" comedies (which it strongly resembles), but there are many laughs throughout. Lemmon and Matthau play a couple of in-laws who take a cruise together. Once they get on the boat, the thing Lemmon doesn't know is that Matthau has signed them on as dance hosts so they don't have to pay for the cruise. This infuriates Lemmon who's in no mood to dance. What's worse, Matthau doesn't even know how to dance. Nevertheless, they go along with it and it the process they meet some of their fellow passengers and crew members. Here are the crew members: there's the cruise director Gil Godwyn, played to the hilt by \"Star Trek: The Next Generation\" veteran Brent Spiner, who acts like an evil dictator. There's two fellow dance hosts, played by \"Barney Miller\" star Hal Linden and veteran movie musical star Donald O'Connor. There's the ship's owner Mrs. Carruthers, played by \"Golden Girl\" Rue McClanahan. As for the passengers: there's Vivian, a widow played by Gloria De Haven, who falls in love with Lemmon. There's Liz, played by one of my all-time favorite actresses, Dyan Cannon, who falls in love with Matthau. There's Mavis, Liz's mother, played by veteran stage actress Elaine Stritch. And they meet others as well. All these actors are a pleasure to watch as Lemmon and Matthau play off of them. It's great to see Cannon here, see's beautiful as ever; Stritch is a hoot; Spiner is a funny comic villain who's plays it deadly straight; De Haven is wonderful; Linden, O'Connor, and McClanahan have a good moment or two; and finally, the two main stars, Lemmon and Matthau, are fine as usual. A nice little gem of a comedy.\n*** (out of four)","Yes, you should be ashamed of yourself, for wasting two of the greatest comic actors ever in this piece of mediocre Hollywood-ised fairy-floss. Have we lost the ability to make charming movies so much that we must resort to this series of cliched characters and predictable situations?  Billy Wilder, Ernst Lubitsch and Preston Sturges come back - we need you!Having said that it is always a pleasure to see Jack and Walter - and it's good to see veterans like Gloria De Haven, Donald O'Connor (why didn't they let him dance more?) and Elaine Stritch back on the screen.  But the real star is Dyan Cannon's figure - can she really be sixty years old!?!  No-one has the right to look that good at her age!","I don't know which is worse; the cravenness of producers in trying to make money by pasting the Lemmon & Matthau come-on over any old product that comes along, or the cravenness of Lemmon & Matthau in willing to go along. This movie ranks as one of the honored few that I stopped and rewound halfway through because to go on was too painful. I did this just after the following exchange -CANNON: I've never seen a lunar eclipse.MATTHAU: Well I have.CANNON: Really?MATTHAU: Yeah, but the moon got in the way.That was it for me, folks. The dialogue here is so leaden and devoid of humor one is amazed they had the gall to bill this as a comedy. Matthau at least invests his pitiful material with some of his old spark, but Lemmon, resplendent in his new Stepford-like facial tuck, seems to be sleepwalking through the experience. He was probably trying to pretend he was somewhere else. The cast looks like the residency list at the Hollywood Home for Out-of-work Has-Beens. Is that Donald O'Connor? I bet they're going to have to have him dance, right? Quelle surprise! The only good part of the movie was getting a glimpse of what fantastic shape Dyan Cannon is in at the age of 61 (source: the Internet Movie Database, naturally!). Yea verily, a dog.","\"Out to Sea\" is the last of nine comedy films that Jack Lemmon and Walter Matthau made together. The two Oscar winners and senior stars had given us some funny and entertaining films over the years. Besides their comedy, each had a distinguished film career that included dramas, action films and mystery-thrillers. Matthau lived just three more years and died July 1, 2000, at age 79. Lemmon would live just four more years, and died June 27, 2001, at age 76. In this 1997 film, the boys are in their usual form. They have slowed down some but still appear to be chipper. They are a couple of retired codgers. Lemmon plays Herb Sullivan and Matthau is Charlie Gordon. They are brothers-in-law. Charlie's never been married and Herb, who wed Charlie's sister, has been a widower for a year or so.This film has some prominent actors in supporting roles, and these add to the humor. Dyan Cannon, Gloria DeHaven, Elaine Stritch, Hal Linden and Donald O'Connor all are good for laughs. Brent Spiner plays the stars' nemesis. He's Gil Godwyn, cruise director.The plot is far-fetched, and that makes it even funnier. The cast seemed to be having a ball making this film. It isn't on the level of the earlier Lemmon-Matthau comedies, but it's still an entertaining film that's sure to arouse many laughs. It's a good adult film to enjoy, especially for middle aged and older folks. Few in younger audiences are apt to enjoy or appreciate old-fashioned humor, especially among the older set.Here are a couple samples of humor in the dialog. Gil, \"No, you listen to me. I'm your worst nightmare. A song and dance man raised on a military base. Dismissed!\" Herb, \"I'll bet his father was cruise director on the Bismarck.\"Herb, to Charlie, \"You're crazy. Years of insanity have made you crazy.\"","Wlater Matthau and Jack Lemmon are one of the most beloved silver screen pairings, having made such classic films like 'The Fortune Cookie' (for which Matthau won his Oscar) and the more well known 'The Odd Couple' together.In the 1990's film studios realised again what a great partnership they had on their hands to exploit,and so the duo made four films together in this period, with 'Out to sea' being one of them.It's not a great film, I'll say that from the start. The plot is thin and the film itself is overlong. BUT, what makes it is the chemistry between the two leads. Their friendship both on and off screen shines through for all to see and these talented comedic actors wring every last joke out of the script. For that alone this film is a good one.A mention must go to Brett Spiner also, who has the thankless task of playing straight man to Matthau and Lemmon. He does however steal quite a few scenes and deserves the laughs he gets.Overall, this isn't the duo at their best, but it certainly beats a lot of the other comedies we have today.","Out to Sea (1997): Dir: Martha Coolidge / Cast: Jack Lemmon, Walter Mathau, Brent Spiner, Dyan Cannon, Brent Spiner: Very funny comedy with two elderly males attempting to relive their glory days. The title regards the clueless high hopes by the leads. Walter Matthau plays a gambler who talks his widowed pal into going on an all expense paid cruise but he didn't mention the catch, which is that he signed them both up as dance hosts. The entertainment organizer, who opens his own act, takes an immediate dislike to our grumpy old men. The rest involves their encounter with two other women. Jack Lennon still loves his deceased wife so he struggles in accepting new love. Matthau gets caught up on the dance floor for which his inability to dance is put hilariously to the test. Familiar plot travels a predictable formula but director Martha Coolidge shows examples of comic timing. She previously made such entertaining comedies as Valley Girl and Real Genius. Matthau and Lemmon have irresistible comic chemistry. Brent Spiner plays the entertainment organizer in a standard role yet a terrific foil. Dyan Cannon plays Matthau's love interest but the role is too straight forward. Brent Spiner plays the foiled master of ceremonies who views our duo as a major inconvenience. Theme regards aged friendship. That keeps the script from drifting out to sea. Score: 7 ½ / 10","Is this a great film? No. But it's a fun film, particularly for those of us old enough to remember the hey day of Jack Lemmon and Walter Matthau -- a match made in heaven, if ever there was one.As with his character here, Lemmon really was 71 when this was shot; Matthau was only 59, but looked much older. Each only lived 3 or 4 years after this film, but they did make a sequel to \"The Odd Couple\" after this. So, while it's not a great film, it is great to see these two real-life pals together again on screen.The plot is simple: Matthau (a gambler) ropes Lemmon (a retired store clerk) into going on a cruise, and Lemmon doesn't realize that it's not as passengers, but as professional dance partners. Matthau hopes to hook up with a rich widow (at which he fails...sort of...Dyan Cannon), and Matthau just wants out, but falls in love with Gloria deHaven. Along the way there are some funny hijinks, but only the ending is disappointing...way too impractical.Along for the cruise as other dance hosts are Hal Linden and Donald O'Connor, who, frankly, get too little screen time. Brent Spiner is good as the overbearing cruise director. Elaine Stritch is fun as Cannon's mother. Edward Mulhare, who died shortly after making the film, plays another cruise ship passenger. And Rue McClanahan plays the owner of ship. It's a fun group of seniors.This probably won't tickle many of the younger crowd, but I think it's fun. Just not GREAT fun."],"review-user":["edwagreen","FilmCritic-3","JoeKarlosi","JamiJR","Smells_Like_Cheese","Tankard22","Petey-10","FilmCritic-3","helpless_dancer","rossrobinson","theowinthrop","Jack the Ripper1888","caa821","morrowman2","japamo","bkoganbing","vranger","lefteyez54","jhaggardjr","David-240","rupie","SimonJack","studioAT","anaconda-40658","vincentlynch-moonoi"],"review-date":["22 March 2009","6 May 1999","2 July 2004","15 December 2004","1 January 2006","8 March 2007","31 October 2002","28 December 1998","10 September 2001","9 January 2004","24 July 2005","1 April 2003","20 July 2006","7 June 2004","19 December 2014","15 October 2012","17 May 2009","2 August 2003","10 July 2000","10 November 1999","29 April 1999","4 February 2016","25 August 2015","21 July 2015","17 November 2014"],"review-rating":["8","7","10","7","9","7","10","6","8","8","7","7","8","7","5","7","7"],"review-title":[" Out to Sea-Go Down to the Sea in Ships to Catch this One ***1/2\n"," A good movie\n"," Out to Sea (1997) ***\n"," Light Hearted Romantic Comedy\n"," Just a fun romantic comedy that I think anyone can get a little kick out of\n"," A Very Very Funny Film!\n"," Thanks for the laughs!\n"," A Very Funny Movie\n"," Decent enough comedy\n"," fantastic\n"," Amusing Follow Up to the Two \"Grumpies\"\n"," Entertaining.\n"," Nostalgic twilight pairing\n"," what can I say it's a great film\n"," Two Comic and Acting Legends Keep This \"Love Boat\" Movie Merrily Afloat\n"," Fleecing the old ladies\n"," A comfortable comedy ...\n"," yes!!\n"," Sweet Lemmon-Matthau romantic comedy\n"," Shame, Hollywood, Shame!\n"," out to lunch\n"," Funny last pairing of Lemmon and Matthau\n"," Out to see. In for a laugh\n"," Lemmon and Mathau Not Stranded.\n"," Not the Odd Couple's best, but still fun\n"]}