{"review-url":["http://www.imdb.com/title/tt0154506/reviews"],"review-text":["The debut that plucked from obscurity one of the brighter stars of contemporary noir is an assured, if limited, stab at the con game and obsession.  Filmed for zero money, Nolan couldn't have chosen a better subject than the drab and seamy underside of London to ply his trade, given the lack of funds.  This short (67 min) is at its best in playing with the audience's and protagonist's expectations about who is scamming whom, though the initial set-up does ring some alarm bells in the credibility dept. The muddy cinematography (he often used natural lighting due to budget) can be mostly chalked up to noir stylization, though the limitations do show at times.One can easily see Nolan's style developing in this fledgling effort; many of the same themes of blurred identity and expectation smashing recur in MEMENTO and INSOMNIA.  Not a masterpiece but good and certainly worth a look for modern noir and Nolan fans.","Christopher Nolan's first feature film wowed critics who saw it when it first came out. Shot on a micro budget of $6,000 this is a student film with real class. The film is shot in black and white, and features people who you assume are friends of Nolan's appearing in the movie. This is not to say they are bad actors because they are quite good. You could see Jeremy Theobald and Alex Haw appearing in other projects but unfortunately they haven't since this was made 6 years ago.Nolan's thriller, much like Memento, does not play chronologically, it shifts the scenes around much like Pulp Fiction. The writing is fantastic. It is a great twisting thriller but because the temporal order of the film is shifted around it makes it even more interesting. I thought the last ten minutes in particular when everything starts to become clear were excellent.\nFor a film of such a small budget and with no recognizable names at all, this is so good. It is superior to most that Hollywood studios offer and Nolan after three films (this, the superior Memento and the not quite as good but still excellent Insomnia) has cemented himself as the most exciting new talent of recent times. I can't wait for Batman.This film is short and sweet and certainly a great watch. It is very professional and the twists are fantastic and completely surprising. I also thought that the score from David Julyan was also excellent, very atmospheric and had a chilly quality to it. He has gone on to compose Nolan's other films. Overall I would recommend this, I intend to get all of Nolan's films. This is a low budget gem. *****","Christopher Nolan's first directorial effort, a year before he did \"Memento,\" and this is almost as brilliant as that classic.  He uses time differentials in a similar manner to tell his story, and it's a very clever one.Bill is this young writer who begins following complete strangers around just to see where they live and what they're all about.  One day, he follows this man, Cobb, who turns the tables and confronts Bill, who breaks down and confesses what he's up to.  Cobb is a burglar and he takes Bill along on a few jobs to teach him the ropes.  Both men are voyeurs of a sort and a bond begins to grow between the two of them. But there's an ulterior motive for Cobb nurturing this relationship, and it all ties in very smartly at the end.  No, I won't spoil it but this is a very cool movie and I'm beginning to think Christopher Nolan is a genius.If you like suspense films with surprise endings, this one is a must see.","After watching Memento one might well wonder how Christopher Nolan pulled off something that audacious, that brilliant, in what was his major directorial debut. Watch Following, the no-budget thriller which was Nolan's actual directorial debut, and you begin to understand. With no money, with an amateur cast and doing pretty much everything (writing, shooting, directing) himself Nolan created a little masterpiece. Whatever \"it\" is that enables someone to make great movies Nolan clearly has it. And had it right from the beginning.Fans of Memento will see a lot of similarities, hints of what was to come, in Following. The most obvious parallel is the nonlinear time structure as the story here unfolds completely out of order. Whereas the story in Memento proceeded more or less in a straight line which just happened to be moving backwards here there is no line at all. Scenes are placed in a seemingly random order. We're all over the place. At the end, in the beginning, somewhere in the middle, back to the end again...it really could have been a jumbled mess. But Nolan gives us a little assistance in orienting ourselves with the shifting appearance of his main character. He has three distinct looks to him and once you figure that out you can figure out where you are in the story. But there are still enough twists and turns to make your head spin, to keep you guessing right up to the end.The less said about the plot the better. Best to let you try to piece the puzzle together for yourself. Much like Memento you really have to see it all the way through to fully appreciate the true genius of it, to understand how any missteps from Nolan along the way could have unraveled his whole story. When the movie concludes you can't help but be amazed that Nolan could pull this off essentially by himself. At least with Memento he had a little help. Here it's just Nolan and his small cast. There are really only three roles of any significance in the film, maybe four if you're being generous. But this little troupe and their first-time director combined to create something really special. The acting may at times seem a bit amateurish but that has to be expected from performers who are certainly not acting pros. And any little quibbles with the performances do not detract at all from the overall movie-watching experience. The actors do more than well enough to get by, well enough in fact that you're surprised there were not bigger acting roles for them somewhere down the line if they wanted them. That the performers have a great story to work with certainly helped their cause.Things do get a little convoluted in the end as Nolan's story takes its final turns. You worry that things may be getting away from him a little bit. But he manages to ultimately pull it all together. You may have to really think about it after things are through but it all makes sense when you run it back in your mind. And it's nice every now and again to have a movie that actually requires you to think isn't it? Christopher Nolan seems to specialize in movies like that. He just makes great movies. Here he did it with no money, all on his own, never having made a movie before. It takes a special talent to pull that off. And among his many talents Nolan also apparently possesses the ability to see into his own future. When you watch Following note the Batman logo on the main character's apartment door.","Just watched this on DVD three times - Once the 'normal' way, once with the scenes in consecutive order (in this doozy of a film noir, the beginning, middle and end of the story intertwine), and once with the director's commentary running. Quite amazing. A bare-bones tale, told with more flair, energy and substance than most big-budget overblown features being released today. I think this is an even more accomplished film than the subsequent Memento, which turned me on to Nolan in the first place. Can't wait to see what he does with a bigger budget (and bigger box-office stars) in his next film, Insomnia.","I just finished watching Following and I thought it was great. I rated it 8 out of 10. I plan on watching it again with the director's commentary and then again in chronological order.I rented this movie because of my fascination of Christopher Nolan's more recent movie Memento. Following has some similarities; this movie was probably the blueprint for Memento. Even the music in some parts is very similar.Shooting the movie in black and white gives it a mysterious feel. The story and dialogue is really good. The performance of the actors is believable.Christopher Nolan made this movie on a really low budget. I look forward to his next release Insomnia, a big budget movie with my favourite actor Al Pacino.","Great film. No gratuitous gimmicks like in most Hollywood films. Everything supported the suspense of the plot. B&w gave it a basic, no-frills feel also. In short, it was visceral in its simplicity of cinematography and cast.Following serves as an interesting contrast to Memento. Characters in both used manipulation and subterfuge extensively. In that sense, both reminded me somewhat of \"In the Company of Men,\" also highly recommendable. One difference between Nolan's two films is that Memento was a little easier for me to follow, given that the b&w scenes progress in a constant chronological direction, and so do those in color. I don't think that was true of Following, where scenes seemed to be shown at random. If you have the choice between VCR and DVD, I'd highly recommend DVD, since that gives you the option of watching the movie a second time in chronological order, not just in the scrambled (albeit ingenuous) order presented by Nolan. It also makes it easier, upon a second viewing, to piece the order together for yourself, if you want to.As another viewer noted, one of the best things about both this movie and Memento is that none of the cast were famous. They were characters, not big-name actors who brought in personas developed in other movies.Given certain similarities in the plots, I wonder if Memento is sort of a remake of Following, but intended to reach a bigger audience, like Edward Burns made She's the One in the mold of -- and with largely the same cast as -- The Brothers McMullan.","Vital and inventive British film about a man who becomes obsessed with randomly picking people out in the street and following themBill becomes obsessed with picking people out in the street at random and following them. He is drawn into the criminal underworld when he chooses to follow a burglar, Cobb, who catches him in the act and encourages him to take things further... This is a rare and inventive British film, one not concerned with being flavour of the month in the style mags. Its low budget is displayed like a badge of pride, which is refreshing rather than annoying. It runs out of steam before the end, but Nolan hints at something very special here.","A debut movie of a great filmmaker is either a stinker (\"Alien 3\", David Fincher) or a statement that he is there to stay. (\"Reservoir Dogs\", Quentin Tarantino and \"Following\", Christopher Nolan). \"Following\" is a very well made film, considering the circumstances under which it was made. The film is, in fact, a rulebook or a template of future Nolan films. Most of his future movies can be found in \"Following\" in the sense that most of his future movies have - broken timeline and non linear storytelling making the movie more thrilling, crime or criminal-ish adventure, manipulation of people and a surprising reveal, that's either mindblowing or in the case of \"The Dark Knight Rises\" (2012), studio's insistence. This movie is a crime thriller. Keeping away the circumstances and knowing nothing about other Nolan films, it's very good. Not excellent, not great, but simply very good. The pacing of the story feels rushed. There is character development but the pacing is so quick that we do not have enough time to get invested in the characters. Some things about the protagonist are simply addressed in the story by the characters in it, rather than telling it dramatically. The fight scenes and some acts of violence are a bit poorly choreographed. However, the suspense was excellent and the twists were mind blowing. Consider now, that you have watched Nolan's other movies as well. The rushed pace was inevitable for a movie which wanted to deliver a lot, but had only an hour of runtime. The issues with fight scenes and acts of violence are still the same, however, we can get a clue of how things played out off screen when a character addresses something about the protagonist. It's like the future Nolan films made it better. If you've seen any of his future movies containing a theme of manipulation, it's quite easy to figure out. The awesomeness of the suspense and the twists are retained. At last, consider that you also know how this movie got made. Man! It was lucky even to see the day! A budget of $6000 during the 90s for British film? It's probably gonna be forgettable. It might not be as good as it was supposed to be if it got a made under favorable circumstances, but surely ain't forgettable. I don't find it appropriate myself, but this movie is a masterpiece - in the sense that an almost no budget flick was made to be so good! I have seen other almost no budget films like \"A Fistful of Fingers\" (1995 or so) made by Edgar Wright, and it was just plain bad for me. I would never watch such films ever again, except for this one and any other such film, if I find them in the future. It was my fifth Nolan movie. I watched all three of his Batman movies, and I absolutely loved the second one, the first one was excellent and the third one was just good. Then I watched \"Memento\" (2000) which made me a Nolan fan. But it was this movie that made me appreciate him as a filmmaker in the way I do today. Judging it in a plain manner, I would give it an \"8/10\" and an \"A-\". But, for the reasons explained in this review, it gets a special \"10/10\" and an \"A+\".","In this intriguing noir thriller (looking like the Forties, but with a  psychology befitting the Nineties), Director Christopher Nolan employs  a number of techniques he would perfect in his internationally  acclaimed Memento (2000), most notably scenes presented out of time  sequence for effect, and a naive protagonist taken advantage of by  others.  The film opens with \"Bill, the Innocent\" (as I might dub him), played  by Jeremy Theobald, trying to explain to someone, perhaps a social  worker, perhaps even a police inspector (John Nolan), why he took up  following people just for the fun of it. He doesn't just follow women,  he points out.  He's not a stalker, as such. He's just curious. He's an intriguing and  sympathetic character, a Brit writer with a lot of time on his hands  who seems something of a throwback to an earlier age with his clanking  manual typewriter and the photo of a pursed-lips Marilyn Monroe on the  wall of his shabby apartment.  Things began to go wrong for him, he further explains, when he broke  some of his \"following rules\" and got too close to his prey. What he  doesn't know and what we don't know yet, is that his clumsy following  technique has allowed him to unwittingly become the followed himself.  Enter a juicy blonde (Lucy Russell) walking down some steps from her  apartment. (This scene is out of sequence as far as chronological time  goes, but psychologically speaking, her appearance signals his  entanglement). Enter now a scheming, sophisticated psychopathic  thrill-seeker named Cobb (Alex Haw) who entices Bill with his  (apparent) practice of burglary just for the powerful feeling one gets  from invading the sanctity of another's life.  Although justification for the temporal inversions here is not as  clearly established as in Memento, nonetheless the technique works  well, and Nolan provides us with a clever ending that sneaks up on us  and makes in a few seconds all that went before clear. Or mostly clear.  You might want to rewind and view the first few minutes of the film,  and then everything should be clarity.  This low-budget, black and white, deliciously ironic little film (71  minutes) marked the auspicious debut of a film maker who has already  made quite a name for himself, not only with the aforementioned  Memento, but with Insomnia (2002). It will be interesting to see what  Nolan does next.","Bill, Jeremy Theobald, is an inspiring writer who hasn't gotten anything published as of yet. Bill also has an odd and strange habit, he likes to follow people.Bill picks out some stranger in the streets diner or on the subway, metro, and follows them as if he were their shadow. Maybe Bill does this to help him in inspiring himself to write the great novel that he's been dreaming about or get an article of his get printed in a major magazine? Maybe it's because it fills Bill's lonely life with a purpose and even makes the person of his curiosity a face in the crowd with meaning and substance by his paying attention to him or her? Or maybe it gives Bill someone to look after and care about and be responsible for besides himself? Bill has a simple rule that he follows religiously when he follows someone : after you follow him or her to their home or place of work you stop. One day Bill follows Cobb, Alex Haw, home and instead of following his rule of stopping he still keeps following Cobb. Bill will soon realize how right he was with that rule he set for himself in following people and at the same time how wrong he was by breaking it. Amazingly good low-budget movie made by Christopher Noland in 1998 before he hit it big in Hollywood with his ground-breaking and original motion picture classic \"Momento\" some two years later that has already become a major cult movie. \"Following\" is actually a much better movie then \"Momento\" because it's a conventional and easy to follow story. Compared to \"Momento's\" which was at first confusing and then when you realize what the movie is telling you in it's backward storyline very complicated. Whats makes \"Following\" so much better is just by it being simple but at the same time brainy in it's affect on those who watch it. The movie is far more direct as well as devastating and you don't have to see it over and over to get just what it was trying to tell them like \"Momento\" did. \"Following\" is a story within a story within a story with one of the most surprising as well as simply manipulated ending, if you watch the movie again and notice the clues, that you'll ever see.Made with an unbelievably small budget of $6,000.00, thats less then what most Hollywood movies budgets out for coffee-breaks, with a no-name cast in black and white and just over one hour, 71 minutes, long. Hollywood as well as the motion picture industry outside of Hollywood can learn a lot from Chris Noland in how someone with nothing more then talent and imagination can achieve what millions of dollars in most cases can't; make an intelligent and at the same time penetrating film with next to nothing in money and no big name stars.","Christopher Nolan had his goals set on Following in a very narrow direction, and in that direction he pulled off something that reminded me of the kind of great little 'poverty-row' movies the likes of Ullmer directed back in the 40s. Only this time, he's able to implement touches of homage- things like black and white photography (a given due to the shoe-string budget but also essential to the dark crevices these characters inhabit) and casting of the actors (the John Doe lead, the slick male counterpart, and the beautiful-in-a-gritty way femme fatale)- while keeping it in the realm of the 90s underground indie where for several thousand dollars and specific choices in locations and music and such anything could be possible. That, and as well in the film-noir mood Nolan also puts together a cunning web of a plot, maybe even more so than Memento. Where the latter was a work of a psychology unfolding by way of a plot enriched by looking to the past inch by inch, here the non-linear structure serves the purpose of showing how far someone like Bill can go through as dark a path as Cobb, only in an environment where keeping on your toes is not for someone who's not really twisted and into the deeper mind games Cobb is.Of course, the whole act of following someone becomes the main thrust of the story, and going into it I wasn't even sure where it would lead, if it might be some kind of stream of consciousness ala Slacker where Nolan would lead his character along to one urban British person to another. But the establishment of the ties of Bill to Cobb are done in a quick and excellent way, as we see right when Cobb approaches Bill at the café to ask what he's doing following him tells almost all we need to know about both- that, and the first robbery he brings him along for. What seems to soon be a good score on the horizon is really all one big set-up by Cobb and his lady (just called 'The Blonde', maybe a too-obvious homage to noir, but why carp). But this is revealed in a way that actually truly had me guessing, as the manipulation of the narrative worked all the more to arouse questions not so much of why but of how. The density is brought out all the greater due to the actors understanding of their essential points as characters, with Alex Haw being brilliant as a true sociopath who can barely mask his 'deep' ideas about what it is to really take pleasure in a burglary, and Theobald with that demeanor of someone who can never be as smart as he is in what he really does, but is more intelligent in that naive way that stands no chance in the dank environment such as this; Russell almost makes it too easy, even with a face that would send Ana Savage shaking her head.Meanwhile, Nolan is also on the ball with his style as a cameraman, keeping nothing in that doesn't add to ambiance and suspense, with the fade-in/fade-outs not too quick to leave a lasting impression, but enough to add to the 'this-could-lead-anywhere' logic of the script. He follows it in hand-held form as if he knows where his limitations lie, and yet is fantastic at keeping the essentials: close-ups when need be (one I loved is Russell's face in a small mirror), and a fairly simple techno track that never detracts. Sometimes, as mentioned, the line between seeing something in 'present-day' and seeing something that is as everlasting as a solid pulp story of low-level criminals with mind-games and moral ambiguity is always never totally clear, which for me is practically irresistible in its dark way. Simply put, this is one of the great calling cards I've seen from a filmmaker in recent years, and should hopefully be something that future fans of Nolan's other work can look forward to to discovering. Or even to those who think that noir has gone to the rapid-editing and big-gun-firing dogs of the mainstream (even in independent films) it's a bright little 71 minutes.","People seem to love this film. Reviews talk about its ingenious twists and turns. Well, maybe if I'd never seen \"House Of Games\" or even \"The Usual Suspects\" I might have been a bit more surprised. But as it was, I figured out who was pulling the wool over whose eyes pretty much from the word go. Perhaps I've just watched too many double-(or triple-)cross thrillers.This is basically apprentice work. Nolan wrote a film he could shoot for peanuts. In that respect, there's no denying he's done a great job. Despite the fact you can hear the camera running in most shots, he's put together a well directed film that manages to rise above its zero budget. But the script needs so much more work - it really could've done with a couple of more drafts. It falls into some very basic traps, like characters constantly \"explaining\" the plot to other characters for the benefit of the audience. The acting is okay, though funnily enough the best performance comes from someone who never had any intention of becoming a professional actor (he's now an architect).I thought all the twists and turns a bit tiresome. Very much hand-me-down Mamet. The actual idea of \"following\" complete strangers is quite intriguing. Too bad the movie doesn't bother to pursue it after the first few minutes.Still, Nolan designed this as a calling card movie. Like an eye-catching student movie, it got him noticed, and he's now working in Hollywood. And I wish him well. In fact, his Director's Commentary on the DVD of \"Following\" is much more interesting than the film itself.Watch it if you're a bit curious. But, really, it's no great shakes.","Christopher Nolan is a sick man.  I say this with all due respect, after witnessing his almost-legendary first feature, \"Following\".  This is not a normal film.  Even if its narrative were presented in strict chronological order it would still not be normal.  Its stark monochrome cinematography, weird music, bizarre performances (which range from the subtle to the wooden, often in the same sentence) and disturbingly warped plot all serve to instill a deep sense of unease in the hapless viewer.  Why do we watch films like this?  Certainly, part of the pleasure comes from seeing characters with whom we can identify and empathise, carrying out acts most of us will never do: burgling, beating, safe-cracking, you know the sort of thing.  Oh, and breaking people's fingers with hammers.  This is not a \"nice\" film.  I would recommend it to anyone, with the warning that they may not enjoy it, but they should definitely see it.  It's seedier than \"Memento\" (Nolan's recent cult classic) and cuts up the narrative for no real reason other than because it can.  This has the mind-bending effect of, for example, showing someone's beaten-up face long before we find out who provided the beating.  Why does Nolan do this?  Because he can.  Because it's cool.  Because it all adds to the menace and unease and perverse pleasure of this strange, strange movie. The follower becomes the followed.  Victim becomes assailant.  Telling the truth lands you in prison.  Lover becomes victim.  Movie audience becomes deeply impressed. Christopher Nolan, you are a sick man, and I applaud you and wait with baited breath for your next excursion into mind-f*ck cinema.","I saw this movie after I saw Memento.  I was very impressed with Memento so when I saw this at the local video store, I decided to check it out.  I was equally impressed with this little film.  I like black and white films so that was bonus, especially for a noir film.  I thought the acting was very good by actors I have never noticed in other films.  It is short and makes you think, which you can't state about many films.  I loved to guess where a film is going and 90% of the time I know the general outline of the film and where it is going in the first 10 minutes.  Nolan's films are never that easy to decipher at first glance.  I won't spoil the film other than to state the protagonist of the film is not talking to his shrink after he has taken his stalking too far at the beginning of the film as I originally surmised.  This movie is basically a rough draft for some of the ideas and themes Nolan would later explore and exploit in Memento. It works on its own and if Nolan had never done anything afterwards would still be a major talent.","Bill is unemployed but aspires to be a writer. Some time ago he took to randomly following people around, just to see where they go and how they act. He never did anything to the person or followed the same person twice, but he just did it. However on one occasion he breaks his own rules and follows a man more than once. The man is the strangely enigmatic Cobb, who twigs that Bill is following him and confronts him. It transpires that Cobb is a burglar but that he shares Bill's interest in people  seeming to give his victims an \"experience\" as much as trying to make a living stealing from them. Bill joins Cobb on these emotional break-ins but soon he again breaks the rules and engineers a barroom meeting with a woman he has robbed, getting close to her and agreeing to do a job for her.Weather-wise, 2007 was one of the worst summers I think I have ever experienced in the UK; endless gloom, hardly a period of sun that lasted longer than an hour and none of the heat-waves that normally lift spirits generally. However one of the positives of the summer was that the BBC launched a season of British films from across many decades. Rather than wheel out the Bank Holiday classics though, the season screened many films that I had never even heard of and are rarely shown. This is not to say that all are that good but at least many of them were interesting. With Following I must admit that it took me a while to get into it because it does move slowly at first and the slightly disjointed timeline did break up the flow.As the film goes on this becomes less distracting and it started to get my interest. After this we hit the final third where the twists start to happen and suddenly the reasons for Nolan's delivery becomes clear in the way where, with some of his other films, everything falls into place all at once. Despite the slow start, the writing is strong and makes for a satisfying story that ends on a strong note. Nolan plays the script well and this part of his work is good. He doesn't do quite as well with the cast though and the performances are more a necessary evil rather than something where it feels like a lot of effort has been put in. Theobald was OK in the lead role but I wasn't convinced by him as he didn't really change across the film. Haw was much better; OK he plays like Rupert Everett but he at least fits his character and remains a slight enigma throughout. James is OK as indeed are many of the supporting cast but nobody is anything special or memorable. I can understand why things turned out this way but it does leave the film open to accusations of the reveal being the all.Overall though, this is an interesting and engaging film that starts slow and is hard to get into but falls into place the longer it goes on. The total delivery doesn't get even effort put into it across the board and the performances and characters are weaker than I would have liked but the plot and structure carries it, making it more than a curio from Nolan's career.","At 70 minutes long, \"Following\" is Christopher Nolan's shortest feature though it certainly isn't his best. But you've got to hand it to him just for coming up with the fantastic story idea. \"Following\" juggles quite a lot of ideas in its runtime of 70 minutes, but somehow the puzzle still remains incomplete by the end of it.A young writer (Jeremy Theobald) follows people around London to find inspiration for the characters for his first novel. He follows specific people and never the same person again, just to see where they go and what they do but decides never to obsess about or get curious as to why they do what they do. Those are the rules he abides by. One day, he decides to follow a clean cut, smart-looking fellow who goes by the name Cobb (Alex Haw). Cobb quickly figures out that he is being followed and confronts the young writer. Cobb introduces himself as a thief, who burgles the houses of people he finds interesting and asks the young writer to accompany him on his burglaries. The young writer becomes infatuated with a young woman (Lucy Russell) whose house he burgles along with Cobb and then things start to go wrong for him.With a budget so low, a film with a story as gutsy as this deserves high praise. To be honest, \"Following\" starts off spectacularly, skimming the streets of London with inspiring cleverness that makes the city look as tempting as it makes it look dangerous, and Nolan slowly builds the tension the narrative requires. The writing in the first few sequences is outstanding, and Nolan delves into the story as soon as the film begins. The two lead characters, the young man and Cobb, are meticulously written so that the viewer gets a useful insight into their minds, what they are thinking. And that's one very important aspect of the film: You need to guess what the characters are thinking even though they don't voice it out loud. And those are pretty much all the positives I have to say about the film.Somewhere in the midst of the second-half, the film cripples. And that's very unfortunate because Nolan's got some great ideas up his sleeve, and he makes a big flaw of letting one on too soon. After that, the film turns into a drama instead of a mystery for the plot continues to unfold in a frustratingly predictable manner. What's left to enjoy is some kind of twist that unfurls in the last sequence, managing a graceful conclusion to a decent feature. But the plot does not attempt to avert what's about to happen and the conclusion does not differ much from the one you might've guessed sometime during the film.Of the performances, Theobald and Haw are convincing. Haw, who plays the cunning Cobb, certainly looks the part and delivers well. The same goes for Theobald. Russell, on the other hand, lacks the urgency that her character was required to throw up in a traumatic situation. Playing the role of a seductress, she comes off as wooden instead of charming, thus remains totally unconvincing in her performance. \"Following\" has wit and diabolical cleverness stashed up somewhere in its stupendously structured plot. It is a film that won't disappoint you, though when the plot concerns a mystery, I expect it to keep me guessing till the very end. Sadly, \"Following\" fails there.","Spoilers herein.`Memento' struck me as intelligent and clever.It folded time in a way that supported the narrative self-reference. The device of the text on skin spoke to the vigorous selfexamination of what it means to act. Seeing this predecessor disappoints, as does reading the comments that think these films are in any way similar.Oh, this has some time shuffling. But it has nothing whatever to do with the story, which is a relatively standard triplecross surprise. Here, it is an aid to the storytelling. But `Memento' spoke to deep issues of narrative and representation: the story was a throwaway -- just an excuse.","Christopher Nolan's reputation continues to grow, especially when we consider the success of his revamped attempt at DC's Batman. And if the calibre of your cast reflects your importance in cinema, then Nolan's experience with the likes of Pacino, Johansson and the continued use of Bale, stamps credit on his achievements. However, looking back at Nolan's budgeted and auteurish feature debut, Following, it might be difficult to understand how such an English filmmaker is enabled to make such huge leaps into the Hollywood mainstream. On first impressions - Nolan's deconstruction of the linear narrative is admirable and has since become a recurring technique for the director, most notably in his critically praised follow-up Memento. We are constantly on the edge of our seats with Following, with the film revealing future scenes that seem unclear until Nolan is ready to clarify them. Despite always knowing more than the protagonist, the audience are presented with a puzzle to solve, though naturally we reach the conclusion at the same time as our man (Jeremy Theobald) - the end. On a stripped down viewing, Following rarely veers from classical conventions - it begins with an introductory voice-over, a man enters a life of crime, the thriller-style music peaks where it ought to, there is a love interest/femme fatale (Lucy Russell), the same man receives his punishment, and the film is even shot in a contrasting black and white (no doubt a financial conclusion). Nolan also makes a predictable nod to Hitchcock with a string of voyeuristic shots as well as a perfect-crime plot with the character Cobb (Alex Haw). In conclusion, it's a clever way of presenting a somewhat dull plot and, given Nolan's growing success, a proved way of grabbing the attention of the mass audience. The film also provides an interesting social commentary with Cobb. His ability to read the robotic of the average person shows a disturbing side to comfortable living.","A noir-esque tale with abrupt leaps in chronology. In other words, a warm-up for MEMENTO. The later film succeeds both because of and despite its gimmick. The earlier film (Nolan's first feature) ultimately feels nothing but gimmick. The theme of invading other people's lives is shrugged off after a few weak Tyler Durden-isms and never explored in depth. The performances are mediocre. The photography and other technical aspects show promise, but it's not especially impressive craftsmanship. It all just seems to revolve around the cleverness of the script, and I found the gotcha twists a bit tedious. Not bad as a first effort, but not a very fulfilling or even entertaining experience.","Been a fan of Christopher Nolan's and decided to check out some of his older work. My impression of this film was that it was pretty average and even though it is relatively short, some parts seem to drag on and/or be repetitive. Despite this, the film had an interesting story and was well written, the acting was also quite solid as was the movie as a whole. The ending was also quite good but by now I've come to expect that from Nolan. Several times during the film i caught myself thinking that certain parts were a little cheesy. Not something I would watch again and i do not strongly recommend it but it may be worth your time to see it once.","Most good directors make few low budget or few normal budget movies or some T.V shows before they make a great influential movie because some afraid to take risks, some need to prosper and many don't have what it takes, Christopher Nolan wasn't one of those directors because he made a great movie right at the beginning with so little money and this movie proves that what I am saying is right. I've seen many good directors' first movies so I know what to expect from a good director's first movie and this movie exceeded my expectations. I knew that it is just 69 minutes long before I start seeing it but it is so well directed and written that during and after seeing it I find hard to believe that it's just 69 minutes long because it gave me a good 2 hours movie experience in just 69 minutes.The actors did a great job in it, they acted like they are good professional actors. Its a shame that Jeremy Theobald and the charming Alex Haw didn't go far after this movie and its a shame that Lucy Russell didn't go as far as she should be.Only geniuses like Christopher Nolan himself can make great extremely low budget movies like Following.","It's utterly irrelevant to me whether this movie had a budget of 6 thousand, 6 million, or 600 million dollars. I only care about the end-result, what I get on the screen. \"Following\", despite its ultra-short length of 70 minutes, required me to watch it in 3 sittings (sleepings) - that's how dull it was in parts. Not badly made, but after the interesting first several minutes, the movie goes nowhere i.e. it turns into a mere run-of-the-mill noir drama. Who cares if it's written and presented in broken form? I've seen so many films done that way, it doesn't get me excited anymore at all. It's still just another double-cross crime film, the kind of cliché crap one could have expected from a Huston/Bogart team-up. Yawn. I had expected something more unique to develop out of the initial premise of the central character following people. I wouldn't have even viewed this film had I known its plot was so standard.The twists and the story are not only not interesting, but quite far-fetched. The woman's character isn't properly fleshed out. \"Memento\" was considerably better. This was just a solid little early effort, nothing more. No need to get ecstatic, people...","Even with only 6,000 bucks and a cast of part-time actors, Christopher Nolan was a master. Nolan is in my opinion, the next great and our first taste of Nolan doesn't contradict that.None of the problems that constantly plaque and discredit the low budget independent picture haunt Nolan and crew. Our actors are inexperienced and young but they deliver and engage us in this story. In all honesty I think Following is Nolan's best screenplay because it is the one he had the most control over. It's a beautifully imagined film. It takes us into a world where we don't feel limited by the constraints of budget. The dialogue and atmosphere is bold and intelligent.Nolan's trademark method of telling the story out of continuity is applied for the first time here and here it is done in a way that throws the story full out at you. With Memento and The Prestige you have to think a bit to truly get a complete grasp on the genius but Nolan doesn't try to confuse people with his prototype film. We can distinguish time by the appearance of our protagonist. This method of telling a story is both creative and engaging. I am Glad that Nolan has had so much success with it because his films become more than what they could be with this method. The pay offs in the Prestige and Memento would not have been thrilling at all if the movie was told in a conventional format. This idea has been done with moderate success before but Nolan has truly made it his own.The script here is Nolan's finest. I had some doubts about his writing abilities, I all ways imagined that his brother Jonathon was the writing talent but he proves me wrong with Following. It is a thought provoking story which makes interesting observations of people and how they function. Cobb's assessments about burglarizing and how it can lead you to discover what makes people tick actually sounds plausible.My only real complaint is the camera work gets shaky at times but it doesn't take away anything from the story or the acting.Following is the first film of the man who will personify 21st century film-making at it's finest.","CAUTION!  There's kind of a spoiler in here.  I don't think it'll ruin the movie, but if you want to really watch the film with no expectations, I would stop reading now  I don't want to take too long here, as most of the other comments have documented the strengths of this film quite well (and it does have many strengths).  Overall, I found this to be a solid, interesting movie, but my major complaint is that the entire plot seemed way too silly. I don't see any reason why Cobb would create such an elaborate plan to do what he did.  It seemed to me that Nolan just set up this story as a way to show off his directorial/writing talents rather than to really tell a story. This wasn't nearly as interesting or emotionally-appealing as Memento.  I give it 3.5 out of 5 stars."],"review-user":["secragt","supertom-3","senortuffy","hall895","Rogue-32","mikepwong","ChrisBagley","ginger_sonny","Kmb_the_Nepali_reviewer","DeeNine-2","sol-kay","MisterWhiplash","Max_Planck","phiggins","mdana","bob the moo","advaitkamat","tedg","clark_ricky","MartinTeller","Dannybrownhawks","Will3451","fedor8","DarthVoorhees","kingspank0"],"review-date":["14 April 2003","4 January 2004","26 October 2003","15 September 2010","23 January 2002","21 February 2002","23 July 2002","13 September 2004","30 May 2018","14 February 2003","8 March 2004","3 March 2007","7 June 2007","25 January 2002","15 May 2002","28 October 2007","7 January 2013","3 April 2002","4 September 2009","4 January 2012","14 March 2013","21 September 2010","1 April 2008","17 February 2008","17 March 2003"],"review-rating":["8","10","8","8","9","8","8","10","8","9","10","4","9","6","6","6","9","10"],"review-title":[" Nolan's Clever Debut\n"," Low budget masterpiece!!\n"," Fascinating suspense film.\n"," No budget? No problem.\n"," Christopher Nolan is The One to...follow\n"," Great Blueprint for Memento\n"," High brains, low budget, nothing superfluous\n"," British genius\n"," A remarkable and clever debut for Christopher Nolan.\n"," Stalking as a hobby; burglary as a thrill\n"," Follow that movie and step on the gas\n"," a small shot of British neo-noir bliss\n"," I'm mystified by the high praise this gets\n"," warning wow movie great this spoiler is\n"," If You Loved Memento You Will Love This Movie\n"," The structure and plot covers the weaknesses in characters and performances\n"," A decent, flawed first feature.\n"," Just the Hammer\n"," A Look Back\n"," Following (1998)\n"," Good for a first movie.\n"," Christopher Nolan is a genius right from the beginning.\n"," A whole minute was wasted on a hair-cut.\n"," Low Budget film-making at it's absolute finest\n"," All style, no sensibility\n"]}