{"review-url":["http://www.imdb.com/title/tt0101412/reviews"],"review-text":["During the closing credits (at least in the version that hit theatres), the Beastmaster can be seen running into the sunset. This sunset is actually a painted backdrop, and after a while, you can clearly discern that the guy is actually running in place for almost two minutes as the credits roll! A perfect end to a perfect movie!","I liked this movie way too much.  My only problem is I thought the actor playing the villain was a low rent Michael Ironside.  Of corse Ironside is just a low rent Jack Nicholson.  I guess Mike was busy that year with \"Highlander 2: The Quickening\".  Sadly \"Beastmaster 2\" would have been a much better career move.  It is certainly the best of the Beastmaster series and in many ways reminiscent of that great big screen classic \"Masters of the Universe\".  Not only does it star the incomparable Mark Singer it also features an amazing supporting cast, specifically the second girl from \"Sliders\", Uncle Phil from \"Fresh Prince of Belair\" and evil chick from \"Superman 2\".  It rocked my world and is certainly a must see for anyone with no social or physical outlets.  BEASTMASTER FOREVER!!! ROCK'N ROLL!!!","I really liked cult filmmaker Don Coscarelli's fantasy \"Beastmaster\" and this follow-up \"Through the Portal of time\" really does decide to go in a different (much campier) direction, which looked like it could have been its downfall. Despite its bad wrap (although it does have its fans), mostly modern-day setting and rather goofy tone it still remains quite a competently, enjoyable good and evil sword-and-sorcery comic strip venture. For most part it seems to be playing for laughs (sometimes intentional other times not), and the fish out water novelty (Dar trying to stop Arklon getting his hands on a dangerous weapon while in Los Angeles) has its amusing moments. The tone and style had me thinking of another sword-and-sorcery caper with a very tongue-in-cheek approach \"Deathstalker II\" and no surprises why, as Jim Wynorski had a part in both screenplays. Dialogues are risible, but there are few humorous in-jokes within and the direction is constantly spirited. The performances are fairly animated, almost mock-like. Bryan Singer returns as Dar the Beastmaster. Bringing all the right qualities to the role, although it does feel like a self-parody and there's no doubts he really likes to boast about his \"friends\". Along for the ride are his animal friends (although the panther has been replaced by a tiger). Wings Hauser decked out in long blonde hair, phantom of the opera style of mask, a cheesy grin goes about his evil shtick with great aplomb, by waving about his magic wand / bow with little respect and having organisms when reading minds. Sara Douglas who parades around provides the wit as the witch Lyranna and the lovely Kari Wuhrer perks it up in her role as the modern-day girl who gets caught up helping Dar. Some other faces show up like; James Avery and very minor parts for Michael Berryman and Robert Z'dar. It's not perfect, but it's a breezy and theatrically hammy time-waster.","All the reviewers are making one big mistake. This movie was not suppose to be taken seriously.It was made for kids and teens of the late 80ies or early 90ies and as such it was truly a film of it's time. If you hated that period, or love the first movie so much that you can't even take a joke about it, then this is garbage, but only because it wasn't meant for you. The low budget here and failure of the Beastmaster 1 at the box office (grossed under four mil. with a nine mil. budget) were obviously the reasons to drop the seriousness of the original and to put it in the present day. You can complain about the story, dialog or logic, but again this was made to run, not to win races. If the movie had tried to take itself seriously it would be a total failure, but it doesn't do that for a second (in \"our\" world, Dar sees a movie theater that's advertising The Beastmaster 2, enough said). To paraphrase Clint Eastwood from Dirty Harry movies: This movie knows it's limitations. It's more of a comedy/parody then usual adventure. Soundtrack (for the time) was also great. Actors aren't taking themselves that seriously either so even the usually irritating \"spoiled rich brat\" role (played here very well by young Kari Wuhrer) turns out good. So, if you are nostalgic for the 80ies/90ies (cheese) culture, or you liked the first part, and don't mind going out on a cheese limb, you'll have tremendous fun with this attempt to revive Dar in the 90ies (literarly). This is not really the sequel to the first, and don't watch it if that's what you want. It's more of a \"what if\" fantasy sequel.As for the \"why different dimension and not just different time\" question: When in history did we have those tall winged humanoid creatures that suck the flash of bones (from the end of part 1)? By the way, the movie ends in the Zoo because of an attempt at a cheap (moneywise) big finale. It's suppose to be the best place for Dar to show all his moves (him being the manipulator of animals).","If you are ever in the mood for a truly terrible film, it would be hard to find something that could even compare to this. I have spent a lot of time watching a lot of terrible movies just for the sheer joy I get from it, and man, this is one of the worst. This movie was so bad, I had to buy the third Beastermaster online. That one wasn't as bad, which is amazing since it was straight to video. This is one of those films that is hard to comprehend how it was made in the first place. I mean, someone had to actually have read the script (or many scripts, I'm sure they made several drafts) and said \"Yeah, that's it. Here's some money.\" Actually, they probably just wanted to make a Beastmaster 2 before they even had a script, then went with whatever they had. Ack, horrible. So, if you are a fan of really bad movies, watch this one. It is a true classic, and film doesn't get much worse than this. And if it does, please let me know.","I love the first and third Beastmasters, but this one was an abomination. It was almost as horrible as 'The Never Ending Story 3', for the same reasons. They took a fascinating fantasy world of Barbarian tribes, farming villages, witches, supernatural creatures, and a cult of religious fanatics using a pyramid; and thought it would be funny to mix in our materialistic pop-culture world of rock & roll, sushi (I think thats what it was), and flashy sports cars. These two worlds do not belong together. I do not want to see a bunch of ancient barbarian looking people dancing to some rock song on the car radio. I have a sense of humor, but this is just stupid. This is what Hollywood does to good fantasy movies when they run out of ideas. Don't give up though, the Eye of Braxus is much, much better. That one I gave a 10. This one, Portal of Time, I give a 1. Believe me, I don't always give such extremely high or low ratings. I just tend to comment only such movies.","First of all: Remember that this genre was quite popular in the beginning of the 90's, as well during the 80's of course. Many out there who're voting, and never seen this before, tend to compare this with modern movies and their film techniques and not seeing it for what it is. Not going to say masterpiece here, nor a work of art, but well above average. Actually, there's one part of this movie-series that are in some fashion a work of art, and that'd be the work they did with the animals. No you say? How do you get a friggen tiger to behave, the ferrets (Of which we won't get to see too much, except for in the beginning, as they \"acted\" in the first movie. That eagle, how do you train one to begin with? Let alone getting it to lay almost dormant on the ground for that period of time until Dar picks him up?Then there's that nostalgic feeling of the 90's vs. a parallel world without modern technology. That part I like, and also am missing the 80-90's when ppl. were more friendly (Started to become worse during the 90's though) and not like today were we're screwing one another over something as trivial as monetary issues, or even worse, status. I'm not saying that y2k is when it all started or anything, 'cos it did way before that, I'd say like the 70's or something like that, probably before that, but what I'm saying is that it has escalated enormously since technology grew into what it is today when it's easier to hide behind a computer instead of socialize as we did 'back then'.With this I want to point out that \"thanks\" to science we've become increasingly obsessed about, or should I write picky about how well a movie is made, what funding it had, how good the directors (status) are etc. This is what passes for good movies nowadays. Yeah, sure, a lot of them ARE good, but that's most likely because they (Companies behind them) were well funded and all of that ballet. Back in the old days the filming-crews were experimenting with new cameras, lenses, and generally improvised whenever something difficult to shoot came up. They didn't have the same kind of funding either, as the the investors weren't aware whether it'd be a success or not. And by saying that, they also didn't have that much insight into the technical stuff (A.k.a. - This is how the movie will turn out to become!).It bothers me that ppl. are ignorant of such things, as well as clanking down on actors (\"Bad\" movies in general), when it's really the (casting-) directors fault, or just a bad written script. It's rarely ppl. take a movie for what it is and how much heart has been put into it.This movie I think they mostly did for fun, and because we ppl. always have it in for cultural hick-ups and also we like it when disasters happen and all that jazz.I gave this 6 out of 10 just because it's fun, retro, and I like Mark Singer (Mostly from V-series really) as an actor.","...and all from the script. That's because this isn't a sequel, it's... more like an overgrown tongue-in-cheek fan-fic film that just happened to lure Singer in for the ride.There's a lot to laugh at here, and unfortunately the \"plot\" is most of it. The players are fairly game and give some effort to their portrayals, but the writing just is never serious. Sadly, sometimes it pretends to be, but always returns to campiness before long. The dialog is very dated, too, as others have noted. Prepare to wince.Taken for what it is -- cheesy, spoofish fun -- it actually isn't too bad, IMO. 4/10 for being brisk enough to carry me along to the end and make at least a few actually funny jokes. (My favorite was the line about the 2 guys she'd met in Mexico.) Kari's character annoyed me a lot at first but she got better later. Wings actually surprised me; I thought he made a serviceable villain (at least for this sort of camp), and I was expecting him not to fit well. Then again, I was expecting a real sequel....One thing that needs pointing out is that Lyranna vanishes near the end of the film. The character just isn't seen any more, with no explanation of what happened to her. Oops.So... If you don't allow it to be what it is and instead hold it up to the first movie, it stinks, as most reviewers have pointed out. If you're going to watch it, don't make that comparison. Just mostly forget the first movie, relax, and laugh at the intentional and unintentional humor here. Throw stuff at the TV when the cheese gets too thick. That way you should be able to enjoy it well enough.","This time The Beastmaster(Marc Singer) returns only to face off a new enemy Arklon(Wings Hauser) however due to an annoying teenager(Kari Wuher) they are transported to the future where they then duke it out. Lots of (lame) fish out of water jokes ensue. You honestly don't get sequels this rotten to the core. Beastmaster 2 is a painful movie to behold. The references and \"hipness\" date the film badly (This was made in 1991) and really who wants to see The Beastmaster in the present times? Also of note is Wings Hauser who's embarrassing performance is easily the film's best asset. Singer looks awkward, Wuher is irritating and the whole 1991 slang just makes the movie downright unwatchable. This is easily one of the worst movies ever made.1/2* out of 4-(Awful)","Marc Singer is back looking more leathery than before and sporting some rather obvious hair extensions to his blonde locks. Is it me or does he look less buff than before also?So the Beastmaster is in trouble again as we find out he has a half brother who just happens to be conveniently evil. At his side is the somewhat evil sorcerer Sarah Douglas, looking gorgeous as ever, together they find a portal that lead them to Earth in the early 90's and decide they want to pinch a neutron bomb (yep that's right). Its up to Dar to follow them through and errmm...stop this catastrophe!Firstly the portal they go through apparently leads them to another dimension, a parallel universe, not through time at all, but that is merely one huge plot hole of many. The entire film is a complete pile of dingo doo doo, it has nothing to do with the first film and doesn't follow on from that in any way. The only continuity plus points are the character of Dar looking as he did and his creature companions.The main issue I'm sure most fans had was the simple fact this isn't a fantasy film. Its starts off as one but descends into utter gimmicky cheesy nonsense when the characters end up in LA. We then get this horrific trashy B-movie that is filled with pop culture of the 90's instantly dating it horrendously. Its all virtually exactly the same as the live action film of 'He-Man' with Lundgren accept it doesn't have any decent visuals, sound, characters, effects etc...Hell they even parody the film by having a film in film moment when Dar and his new badly acted yet admittedly hot bratty rich teen girl friend drive past a cinema and it has 'Beastmaster 2' showing! That's the type of stuff saved for comedies not fantasy action flicks, the pinnacle of lampoonery right there and out of place.I dunno what the writers were doing but for some reason they decided going down the hammy parody route would work for this franchise. All the action is pantomime stuff with no blood or gore, not that the original had much of that but there were some nice icky bits of darkness. The villains are farcical, even though I love and adore Sarah Douglas her constant silly quips and one liners were awful, whilst the main bad guy was like a low rent Jake Busey...with a Phantom of the Opera mask on that didn't quite fit.I think the term tongue-in-cheek is too kind for this disaster, its...a disaster! There is audio dubbed on badly everywhere, the direction is poor and its all looks like a homemade video. The only one thing that is quite good is seeing the late great James Avery as the strung out police chief. Hearing him bellow out 'Bendowski!' in that deep voice of his is the highlight.3.5/10","Dreadful sequel of The Beastmaster (1982) with striking discontinuity: Dar's ferrets Podo and Kodo are both alive (whereas Kodo died in the original movie, leaving offspring, but nevertheless) and Ruh the panther is now an Indian tiger (in movie 3 a lion, by the way). Singer looks okay (except for his very blond hair, where did that came from?). Parallel world 1990 scenes should all be deleted, including the teenage girl and her Porsche. Dar's evil brother is more imbecile than evil. One of few highlights: cameo of The Hills Have Eyes' Michael Berryman as pilgrim. Obviously Tanya Roberts as Kiri could have saved this movie, as she would save every film.","Near the end, when Jackie and Dar approch the military base, they are on a Mercedes. A few shots later, it has become a BMW - At the begining, Jackie leave her car in the desert and go looking for gas, but she let her lights full on. That is not logical, especially singe at the very end we see that her car is still having power. - At the end, just before Dar returns in his world, Jackie's car is facing the wall. After Dar leaves, the car is in the other side.","Like the first Beastmaster movie this is s so-so ripoff of Andre Norton's Beastmaster and Lord of Thunder, great science fiction about the last survivor of the Navajo nation who arrives on a new planet following earth's destruction during a war with the alien Xik, and learns to deal with his loss and love his new home Marc Singer's character in no way resembles Hosteen Storm and his animal companions are only close to the book. This is basically a cheapo that owes more to the Hercules movies of the 60's than to Sci-Fi.","This is the greatest example I can think of to prove the theory that when Hollywood runs out of good ideas, they make an awful sequel and ruin the first one. Now don't get me wrong, I absolutely love the first Beastmaster; I even liked the third one pretty good, but this movie is atrocious. I am a huge fantasy/sword & sorcery movie fan and I hated to see such a terrible sequel made to such a classic as the first Beastmaster. So why do I hate this movie so much? Well, where do I begin? First of all, the whole idea of the movie is ridiculous. Dar and his evil older brother Arklon(who was nowhere mentioned in the first movie..Huh?) cross over into our world via a handy dimensional time-portal gate. Ya see, Earth just happens to be on the same parallel interdimentional plane as Dar's world. Whereas with the first movie, you're led to think the movie just takes place in the past, but with this one you're shown it's a completely whole other world altogether...that's just one of the many things I hated about this sequel. It didn't work with \"Masters of the Universe\", and it sure doesn't work here either! Movies like this should take place and stay in their own time-line and their usual surroundings. For Christ's sake, what's next? Hercules in New York...er, uh..bad example! Moving on...Arklon's after a device called a neutron detonator to use as a threat against his enemies to rule his own kingdom. So, it's up to Dar, his ferrets,his eagle,and his tiger(not a spray-painted one this time) to go off and save the world...but along the way they have the help of a young, cool, and hip Senator's daughter who gets caught up in this whole mess and she show's Dar around L.A., takes him for a joyride in her BMW, and helps get him out of tight situations here and there. How convenient right? And speaking of convenient, I found it awfully convenient and easy for Arklon to sneak into a highly guarded military base and get away with a stolen, highly destructive nuclear weapon...even with half the U.S. Army and L.A.P.D. after him....waaaaay to easy, even for an evil barbarian sorcerer from another world. There are sooo many plot holes in this I don't know where to begin; like why did Arklon go to the L.A. zoo for at the end of the movie?!? He absolutely has no reason whatsoever to go there; and wouldn't that be like the last place you'd lure your greatest enemy who just so happens to have the handy ability TO CONTROL ANIMALS?And don't you just love these kinds of movies where the police are portrayed as total idiots and even with half a dozen cops firing at one guy, they still don't manage to hit him? The police in this movie belong in the \"Police Academy\" series! They are about as useful in this movie as reading glasses are for the blind! Even the title of the movie makes no sense: \"Beastmaster 2 : Through the Portal of Time\"...they never actually went through a \"time\" portal because the movie isn't set in the future of Dar's world, it's set in a parallel world along ours in the astral plane, so they NEVER actually go through time, only a dimensional world along theirs; so NO actual time-travel is involved at all! This movie tries to come off as funny and it does...not because of the humor, but because it's just so bad...and that's putting it mildly. The acting, dialogue, plot, characters, and ending are all so cheesy it's hilarious. What more can I expect from the guy that brought us \"Return of the Swampthing\"(another bad sequel)? Sorely missed here is Don Coscarelli's wonderful directing and serious feel of the first one!! Avoid this stinking piece of garbage like the bubonic plague and stick which the first one and maybe the third one if there's nothing better on T.V.","Truly flatulent script, and I was very disappointed with Marc Singer for agreeing to be in it.I actually walked out of the theater about 15-20 minutes into it, and demanded my money back. I have actually walked out of a movie only 3 times in my life (I am 43 years old) and this is the only one that made me mad enough to demand my ticket price back. If I could have, I would have gotten a refund on the popcorn, too. This was a truly lousy movie, and there is no excuse.For one thing, how does someone who was raised as a pre-tech barbarian learn to DRIVE A CAR? IN California!!!? (Driving a car is a somewhat tricky skill, and in California, even tricker...I should know, I live there.)","This one kind of is like an earlier movie from 1987 \"Masters of the Universe\" based on the cartoon \"He-man\". Basically, you have a great old world and they for some reason have to have nearly all the action of the movie take place on modern earth. Well I guess it is not so modern earth now and that it is an ancient world now of strangeness and a den of good times gone by. Well I guess I can figure why they did in fact place nearly all the movie in modern times in this and that movie. To save money on costumes and sets. It is a lot easier to recreate what is going on in the present than a strange world like that of Eternia in He-man or an ancient world with cults and strange pyramids, sacrifices and strange creatures that hug you to death. This movie is forgettable and not very entertaining, your first clue that it is not going to be the best movie in the world is that Robert Z'Dar is in it. The only thing this one has going for it is the animals which are not as prevalent in this one as they were in the last. Marc Singer is back and it is sad to seem him in this state, the guy was a fairly good actor reduced to trying to make a sequel to a movie that really did not need one, and even if it did it came five years to late."],"review-user":["bonjo-2","drunk-2","lost-in-limbo","Alfabeta","bil_buntin89","thewag777","Tony_Hedlund","JamieWJackson","fmarkland32","phubbs","perrymoree","jimraynor","Lee-92","cyberray1976","lucens","Aaron1375"],"review-date":["30 June 1999","28 March 1999","3 April 2011","7 March 2009","6 July 2006","24 January 2005","13 March 2009","3 December 2013","11 June 2006","11 March 2014","22 August 2013","28 December 2001","27 July 1999","15 September 2005","21 February 2007","22 December 2009"],"review-rating":["10","6","1","1","6","4","1","3","2","2","1","2"],"review-title":[" check the closing credits\n"," Dar, you crazy Beastmaster you!!\n"," \"Master, of the beast\".\n"," Great if you take it as a (very) B sequel with cheese\n"," So bad, everyone should watch it.\n"," Disgrace to the series, but the next is better\n"," Not that bad, really...\n"," you'll laugh! you'll cry! you'll cringe!\n"," The portal of dime(store quality)\n"," Beastmaster 2: Through the Portal of Time\n"," Probably better not to watch it\n"," Goof report\n"," A so-so rip off of a great book\n"," One of the absolute worst sequels EVER!!!\n"," Only movie for which I have ever demanded the return of my money\n"," They should have stopped after the somewhat enjoyable first movie.\n"]}