{"review-url":["http://www.imdb.com/title/tt0163025/reviews"],"review-text":["I LOVED the first Jurassic Park at the tender age of 10. It had everything you could want from a movie minus some underdeveloped character personalities but that film ROCKS even until this day and age. Part two was good though not as the original. The third installment: Terrible. Where was the adventure? Where was the excitement? Where was the suspense? Where was the danger? Drained of all the qualities of what made the first one so memorable. This could be blamed primarily on the director, Joe Johnston, who made that box-office bomb The Rocketeer nineteen years ago. What more can be said? At least the special effects were good; the fight between the T-Rex and Spinosaurus and the scene with the Pterodactyls but the plot was basically nonexistent and the acting was wooden and lifeless with no sense of conveying believability. And what's with the \"theory on raptor intelligence\" part? Were they assuming that raptors were smarter than birds and primates? One needs only to read various books on dinosaurs to find out. Seriously I don't expect movies to educate audiences but a little research wouldn't have hurt. I first saw this on opening day expecting more action, adventure, suspense, danger, and terror. Yet I got a lot less bang for the buck. A fine example on what happens when you switch directors mid franchise.Not even up to par with the original. Pure piece of crap. If they got the gall to make a fourth installment, better get Spielberg back on board or else this franchise will become \"extinct\" like the dinos.","Jurassic Park 3 was a shorter and less entertaining of the three. I thought this sequel might be good because JP2 was good but I was wrong! I have picked some notes while watching this movie. Usually Jurassic Park films are 2 hours long, this one is some 40 minutes less! and does not quite contain the same fun and horror it did on previous jp's. DR. Grant returns which is a suprise. It didn't have it's entertaining parts though i must admit. JP3 had amazing special effects, most probably the best out of the three. I have heard that Jurassic Park 4 will be released in 2004. Should I say this one will be a bad sequel as well?","As problematic as 'The Lost World' may have been, it did expand the horizons of the Jurassic Park universe, 'Jurassic Park III' was a huge step backwards. The characters are sub-standard, the story is lazy and shamefully contrived, and the effects aren't as good as either of the previous movies, almost seeming to be a parody of a Jurassic Park film.The plot, as thin as it is, centres around the rescue of a boy named Eric who ended up stranded on the now restricted Isla Sorna, and the survival of the rescue team led by Alan Grant. Alan is lured to Isla Sorna by seemingly rich businessman Paul Kirby on the promise of cash to fund his dig. The plane lands and Amanda Kirby, Paul's wife, attracts the attention of Spinosaurus which causes the plane to crash and devour members of the crew. The rest of the movie is a series of chase scenes involving the Spinosaurus and the Velociraptors, interrupted by cloying domestic drama between the Kirbys reuniting with Eric and coming back together. The climax itself is unsatisfying, requiring a military deus ex machina that just feels tacked on.In all fairness, Sam Neill does a good job at bringing a jaded Alan Grant to the screen, working with what little he had. But his character is ruined by undoing his arc in the first film about learning to love kids and marrying Ellie, here Ellie is married to another man with two children. The writers could have prepared something special involving Alan and Ellie's relationship and their place in the world with live dinosaurs on the planet; it was insulting to undo all that development. His scenes in the prologue had potential, showing Alan's struggle to keep palaeontology alive and rekindle his love of dinosaurs. But it all amounts to nothing.The film has only a few worthwhile action scenes, specifically the Raptor attacks and the group's encounter with a colony of Pteranodons in a giant aviary, a memorable scene conveyed with an eerie and mysterious atmosphere. Some of the musical cues are melodic and charming, but I yearn for John Williams's talent. At times, the visual effects for the Raptors are actually quite good, but the rest are incredibly rushed and don't allow the audience to soak it in like in the first film. Due to the weak writing and wasted characters there are the many stupid moments throughout the movie. Barely twenty minutes into the film, Alan has a dream about a talking raptor on the flight to Sorna, it's intended to be scary and foreshadow the Raptors' capability of speech but it comes off as childish and goofy. (Real life raptors weren't even capable of human-level speech patterns). The ever annoying Amanda Kirby seems to exist only to scream, bicker and run away, never contributing anything but maudlin or moronic moments. William H. Macy is completely wasted. The rest of the characters are bland and forgettable. Some outright stupid moments include a satellite phone being heard from the belly of a Spinosaurus, said Spinosaur is shown as being able to break a fence designed to contain dinosaurs yet cannot break down a rusty metal door, a ridiculous cameo of Barney (I wish I was joking!!), and a cheap regurgitation of the dino dung scene from the first film.Even the dinosaurs themselves have been ruined; the CGI herbivores are pushed to the background with little screen time, and the carnivores don't behave like real animals, like in the previous films. The animatronics are clunky and the CGI is too obvious. The movie tries to recreate the sense of awe and wonder from the first film, but it feels forced and artificial.The most obnoxious change is the addition of the Spinosaurus. While I accept that it was larger than T-Rex, Spinosaurus was not a rampaging movie monster that hunted human-sized morsels like a serial killer. This leads into the infamous duel between the Rex and the Spinosaur, and it's a problem because the T-Rex was an integral part of the previous films and a childhood favourite. The fight itself was overly brief and anticlimactic. The T-Rex was set up as a predator with both ferocity and nobility, having it dispatched in such a way feels like a cheap shot. It was just a botched attempt to showcase a dinosaur that hadn't earned it's stardom like the Raptors.What frustrates me the most about 'Jurassic Park III' is that there was potential to make up for some or more of the shortcomings of 'The Lost World'. Instead it's the shallowest and the least adventurous film of the entire trilogy, there's too much focus on the domestic drama. While the first two films dealt with themes of science, technology, playing god, and man vs. nature, 'Jurassic Park III' took the franchise away from exploring such themes, choosing to be safe and marketable and lacking in substance.","First of all, this final episode in the Jurassic series did not deserve all the bad reviews it got when it was released. In fact, it was a lot more enjoyable than the stupid second JP. Did it equal the first? No, of course not. The original story was easily the best of the three, but I found this an enjoyable movie and far better than what I had been led to believe.The filmmakers were smart in making this a short film. People had seen plenty of the dinosaurs by now so let's no overdo it...and they didn't with an film just under an hour-and-a-half (not including the final credits.).That made this short-and-sweet. We saw some new reptiles, had a few scares, enjoyed the beautiful jungle scenery (filmed in Hawaii) and - bang - it's over. The characters were fine, nobody totally annoying as in the second film. The lulls featured a family getting back together and finding their missing teen. Nothing wrong with that.A good story unfairly maligned and nice, short evening of entertainment.","The action was not well developed, nor were the character or anything else about this movie.  One big rehash of the first two films, that didn't even come close to equalling their quality.  The ending and other parts of it were so bad, that I was laughing.  This is the worst movie of the summer, even worse than The Mummy Returns.","I went to see JP3 last night to vet it before I take my 6 year old daughter. She is desperate to see it having seen JP and the Lost world and generally loving dinosaurs. I am a great movie fan so have my own opinions on the film but first I'll address the suitability of this movie for young viewers. The original film and Lost World are true 'family movies' containing elements for everyone - decent story, good acting, great (groundbreaking) effects and humour etc. There's nothing wrong with kids being scared periodically, being scared is part of the whole monster movie experience. All that said, JP3 is too 'full on' for one as young as 6 and I think I'll try to get her to wait for DVD, to tone down the whole experience. She saw the first two at home and wont be expecting the sheer sound and visuals of this movie at the cinema. I would advise other parents the same, at least with kids this young.As for my opinion of the film - well, we've seen it all before. I've read many comments and agree with most. Its lame storyline is its down fall and this could've been so much better. In my opinion a far better film would have carried a 15 certificate at least. One they could have made for adults only, and really explored new territory and therefore could not be compared to the previous two. A huge audience loves scary films and monster movies so why not go for it with a proper modern day horror. Throw in a good conspiracy theory plot about INGEN and some realistic profanity and gut wrenching effects. In short give people what they really want. JP3 does niether for either age group.For your children, I reccommend the BBC's series 'Walking with Dinosaurs' it's informative and has near the same quality of effects.See for yourself.","If the first of this seemingly interminable series was rather far-fetched, at least it didn't push to the extremes of absurdity (well, maybe not more than a few times); Jurassic Park III does practically from the start. Dinosaurs and pterosaurs are constantly depicted exhibiting traits that might be believable in primates, dog packs or even domesticated animals but would be ridiculous to attribute to reptiles; the writers go so far as to mention the \"alpha male\" of a pack of large herbivores - I guess that makes it sound more \"authentic\"... Even in the original movie such behavior strained credibility past the breaking point on a few occasions, such as having a dinosaur burst through solid walls as if it recognized what a wall is and anticipated what would be on the other side - was that a tyrannosaurus or Godzilla? How many wild animals has anyone ever seen demonstrate such behavior? With each movie the 'raptors become more and more fiendishly clever; by the time V or VI rolls out (probably on direct-to-video), you might almost expect to hear one of them say, \"I am your father!\"","Jurassic park. The name alone strikes images of people, running and screaming--bleeding and sweating--from huge, ugly, fast, vicious DINOSAURS. Oh, joy. Now, don't get me wrong, I liked the first two movies alright, but I mean, come ON, people! It's like the old saying, \"Two's company, three's a crowd.\" In my opinion, this has gone overboard. There are some good aspects, but the bad tend to overthrow the good, in this case. For example, the graphics were 'a little bit of alright', but they didn't show enough dinosaurs besides the T-rex and the Raptors, so what's the point? Or, that some parts were great, and made you jump out of your seat, but there was NO PLOT! \"There they are. Run. Must get off island. There they are again. Run.\" Doesn't quite cut it in my book! And while the first two had the same underlying plot, they weren't nearly as predictable as this one. I don't understand how people can perfer a movie like this VS....Oh, let's say a masterpiece like \"Final Fanatsy.\"  People REALLY need to wake up, 'cause at this point, it's just sad","This is one terrible, terrible movie, every thing that can go wrong in a motion picture of this size goes wrong with a savage gusto that can be attributed to the fact that no one working on this film wanted to make a quality film. The actors themselves look like they don't want to be in this film, and the direction of the film look too disjointed to be taken seriously. The screen play feels like it was written by a five year old and judging by the ending of this fluff piece, it looks like the five year old just gave up and went to sleep.The real sad part about all of this is the fact that it's a sequel to two much better movies (Jurassic Park and The Lost World) that had a lot of quality to them. Judging by the way this was handle, it looks like Steven Spielberg is finally getting too big for his own head and not to mention too lazy to care if the movies he's making are even good or not.","Personally, I am very disappointed with this movie. The story is so thin, the special effects are well made, yet not very \"special\".Only two new dinosaurs are introduced - the Spinosaurus and the Pteradactyl (not really a dinosaur) - and the rest of the movie is about the boring Veloci Raptors that now have learned how to communicate.The story is not by Michael Crichton. He's not been near the movie which is \"based on characters created by...\"I think Steven Spielberg should be hung, drawn and quartered for producing this nonsense.Before watching JP3 I watched \"Blood for Dracula\" from 1974 and I enjoyed that movie a heck of a lot more.","After viewing a screening of this movie last night the only words that come to mind for this movie is \"awful\" and \"how could they?\"  Not only was the story weak, dialogue over dramatic and badly cast, its not worth seeing it for $7-$10!  Wait for this movie on to go on rent or watch it on tv.  I think the filmmakers tried to bank too much on the success of the first jurassic, but in my opinion they should have stopped there.  This installment was just another studio's bad-attempt at trying to top the first two (although the second one was bad as it is).  So, instead go see Shrek for the third time or better yet, stay home.. Save the gas money, the overly priced tickets, and the $4 popcorn! Thank god I didnt have to pay for this one...which seems to be a trend lately, what is wrong with hollywood?!","Jurassic Park was great, The Lost World was decent, but his one bites the dust.  This movie, although fun at some points, is an overall disgrace to the Jurassic Park film series.  It tries to out do its original in an hour and a half and fails miserably.  This movie is just one chase scene after another, but without the fun and creativity that was seen in the first and carried over a bit into the second.This movie was a cheap exploitation of a great film.  Hopefully, unless film makers can actually try to put the essence seen in the first back into these films, we will stop at three.JP3 rates as a 3/10.","Horrible, and really cheap looking sequel to Jurassic Park and The Lost World does not even do the title any justice with a laid brain plot involving a lost boy, and two annoying parents who you want to see eaten. Sam Neil is wasted with thankless role and The special effects are a major let down. The movie is so bad, that you really want to sue the makers of this crap for liable, and for every thing in their pockets.  I don't know what went wrong but I hope they bring back the people who made The original two movies for the (hopefully) Last Jurassic Park film.","If you can remember the Godzilla remake by Roland Emmerich & Dean Devlin, then you must have had nightmares on how bad it was. The bad rip offs of much better movies and the extremely corny, sentimental dialogs only written to please slow adults and small children. This movie was so bad in fact that you don't need Mike and the Bots from MST3K to make fun of it, the movie writes it's own punch lines for you to say. Any movie with Matthew Broderick as an action hero should be an indication on how bad it is, and with a monster that looks more like a raptor than the Godzilla who all know and love, the recipe for failure is pretty big.Which brings us to this film which is not only one of the worse sequels ever made but probably one of the worse films made period. Sam Neil is a great actor, but the film itself is so bad that it makes him look like a buffoon. The way they tried to make him into an Indiana Jones wannabe is not only sad but also flat out laughable. He comes more a cross more like Chevy Chase than Harrison Ford.  The casts of supporting characters fares no better and in some respect fare much worse. William H Macy is probably one of the best actors around but you really can't tell that by his performance here which is beyond annoying.  Tea Leoni is flat out annoying as well as his wife, a woman whose scream could chip years old paint. I think the only actor who fares decent here is the late Michael Jeter, who is barely in the film at all. His performance is funny, and could have benefited the film a lot more if he was in it more.The special effects are not as impressive as they were in the last two films, and the direction is very disjointed compared to what Spielberg was able to do with the first two movies.  Spielberg was able to create tension and create action scenes that can blow your socks off. Joe Johnson, who steps in for Mr. Spielberg this time around not only abandons what his predecessor had done before but completely disregards any logic that the other movies had. The first two films where about science and the dangers of tampering with nature. This film is just a strait forward monster movie that does not even have a plot to go by. The characters here are nothing more than Dinosaur food and the setting itself does not even look like the island of the last movie. There are even certain things in this film that even contradicts some of the information that was giving in the last two films, and it tries to bring in a dinosaur that was not even created in those movies.Its really sad to see Joe Johnson demean himself with a bad film like this, because he has done much better work in the past.  The Rocketter is a prime example of a good comic book movie, and October Sky is a well-paced family drama that should have had more notice in the theater. With this movie, Joe looks like he just wanted to cash a pay check, and judging by the way every thing in the film was done, it looks like every one involved were doing the same thing. Which is sad in a sense because it's the fans that pay for it in the long run.","Jurassic Park 3 was released four years after the Luke warm reception of Spielberg's (underrated) The Lost World. Spielberg opted to not return to helm another Jurassic film, and directing duties were passed over to Joe Johnston. Jurassic Park 3 see's the return of Sam Neill as Dr. Alan Grant, from Jurassic Park. Laura Dern also returns as Ellie Sattler, but sadly in a less prominent role. The story for JP3 is quite simple, Grant is lured by \"adventurous\" couple Paul, & Amanda Kirby, played by William H. Macy & Tea Leoni, to fly over Isla Sorna, with Grant acting as their guide, for money. However the Kirby's are not rich, and lied to Grant so he could help them find their missing son Eric, who wen't missing weeks ago in a parasailing accident near the island. Of course things go wrong, the plane crashes leaving the Kirby's, Grant, his colleague Billy, and a few others stranded on the island. JP3 can only be enjoyed as a trilling dinosaur spectacle, but there isn't much of anything new, or interesting.There are some positives aspects in this film, Sam Neill is a fine actor, and he brings credibility to the film, and is still believable as the Grant character. While the rest of the characters aren't all that fleshed out, the film is well acted, with William H. Macy, and Sam Neill being the standouts. There's a few new dinosaurs, Spinosaurus being the main one. Spinosaurus is a neat dinosaur, and the roar for Spinosaurus is also well executed, and is distinctly different sounding from the now famous T- Rex roar. The animatronic dinosaurs/CGI are once again well executed by Stan Winston's team, and Industrial Light & Magic (ILM). JP3 is the first film in the series to combine CGI dinosaurs along with practical ones in the same shot, and the blending between the two is well done. The Spinosaurus attack on the river is a thrilling scene, taking place in water, which hadn't been done. There is also a thrilling Pteranodon sequence, offering a ariel attack which hasn't been seen yet in the franchise. The scene is dimly lit, with fog, and creates the best sense of suspense in the movie. The music in the scene is probably my favorite bit of new music in the film. John Williams didn't score JP3, instead composer Don Davis best known for his work in The Matrix films, provides the music, and does a good job, creating new music that still fits stylistically within the franchise.Though there are positives in JP3 there are many negatives as well. One of the biggest ones I had was the screenwriters not having Grant, and Ellie as a couple. Instead they have a friendship type relationship, and Ellie has a child (with some random guy) who call's Grant \"the dinosaur man\". It just seems stupid to not have Grant be with Ellie after the events of the first film. Grant's character arch of not wanting children changes after he saves Lex, and Tim, and is seemingly ready to settle down with Ellie, which now seems wasted. The dumbest thing about it is it adds nothing to the characters, or the overall film, and was a stupid decision on the writers part. Grant has a dream on the plane nearing the island, and turns to see a raptor that says \"Alan\". The scene is very cheesy, and really is just plain silly, right up there with the gymnast scene in TLW. The Spinosaurus T-Rex fight is neat, but having the T-Rex (a fan favorite) lose, and die, just didn't sit right with many fans, myself included. The characters (while well acted), aren't all that interesting, or all that likable, the Kirby's put peoples lives in danger to find their son, and Billy, decides it would be a good idea to steal raptor eggs to help fund their research back home. There are also many continuity issues in the film, like why the island doesn't look the way it did in TLW, or why the raptors look radically different (some have feather-like quills on their head) from how they did in the pervious films. Where the Spinosaurus was during the events of TLW is suspicious too, the only clue given in the film is when Grant says that Spinosaurus wasn't on Ingen's list. Perhaps the worst part of JP3 is it's ending, which feels insanely rushed, and anti-climantic, almost as if the filmmakers said \"This is going on too long, lets wrap it up\", but with a runtime just over 90 minutes, the abrupt conclusion seems strange, with the previous films being over two hours long. Jurassic Park 3 despite is faults, and there are multiple ones, is still an enjoyable flick for what it is, but it's a huge step down in terms of story, and character, and is just an unnecessary edition to the franchise. The story isn't very interesting, or inspired, and the only thing new in the film are the look of the raptors, and a few new dinosaurs. It's explained during a dinner scene with Grant, and Ellie that the raptors were far more intelligent than imagined, and could talk to each other, but much of this could be assumed in the previous films. Spinosaurus makes for a cool looking successor to T-Rex, but seems more like a movie monster than an animal, compared to T-Rex who while running around chasing/eating people, had moments in both Jurassic Park, and The Lost World that showed a naturalistic side of them, like caring for the infant T-Rex. The only real advances in Jurassic Park 3 are technical ones, but effects aren't what makes a film great, it's the story, and characters that drive a film, and that wasn't strong enough in this entry of the Jurassic Park series.","JPIII is very good at what it tries to do. That is, update the formula used in its prequels to create even more lifelike dinosaurs. Unfortunately, it didn't try to do much of anything else, leaving us with yet another big, dumb, summer action flick... hardly the caliber of the previous films.Basically, the story goes like this: a rich kid is taken to Costa Rica by his parents to do some para-sailing... and, for some reason, he decides that an island famed for its man-eating dinosaurs would be the best place to do it. Surprise, surprise: Something Goes Wrong, and the kid is stranded on the island. Who do his parents go to for help? Dr. Grant, the paleontologist who happened to get himself involved with dinosaurs before. Rather than telling him the truth upfront, they con him into coming by giving him a big fake check and swearing that they will not touch down on the island. Dr. Grant agrees hesitantly to this condition. But when they get to the island, they touch down anyway, making their plane a prime target for a dinosaur attack. Something Goes Wrong again, and this time, Grant and the kid's parents are stuck as well.The plot pretty much ends right there, and that's only the first thirty minutes of the movie. The rest of the movie involves people running from and/or getting eaten by dinosaurs. Like I said, it's a big, dumb, action flick. If you're looking for something that even remotely has an air of the old Michael Crichton magic, look to the first two films. Jurassic Park III is the beginning of what will become a reiteration of the Jaws fiasco... endless sequels until one of them sucks so bad, it finds its home in the infamous Bottom 100 list.","I though the first two Jurassic Park films were fun, a grade A entertainment that had a little of everything to offer. A very good story pack with a lot of emotion and thrills. This film unfortunately does not have any of the things that what made those two movies so good, and it does not even have a shred of decency to cover up the fact that nobody involved even cared about what they were doing. The island looks like one big sound stage split in several pieces, and the actors involve look like they are sleep walking in their parts. The dinosaurs in this movie are a little too computer generated for there own good, and the new dinosaur looks like a man in a rubber suit. Don't expect to find a story here because that would be asking too much from this movie.  Think of it as the dumb down version of The Blair Witch Project, but without the thrills or the interest to make you care about what is happening on screen.","What was the point of doing another movie.  You could also say what was the point of me seeing that movie, at least it was a cheapie night.The plot itself is really ridiculous and the acting about the same, except maybe for Sam Neill who is not bad in his character. It would have made a nice tv movie but that's about it.  There is no really original or exciting moments in the film, and not a lot a scary parts.  The only time i jumped is when one of the character stepped on a staircase and almost fell.The special fx are ok but nothing ground breaking.  And what is this... talking raptors??!!  Next thing we'll see is a movie about talking apes.... (oops!)The movie may be fine for kids or teenagers( i'm sure McDonalds will sell a lot of happy meals), but if you want a minimum of a good time, avoid this one, go see shrek for a second time.","I must admit, straight away, that Jurassic Park is one of my favorite movie franchises of all-time. I have a special place in my heart for Steven Spielberg's one-two punch of Jurassic Park and The Lost World. Both films represent, to me, the absolute zenith of blockbuster filmmaking. More than just the game-changing special effects, it was smart writing, endearing characters, and a savory buffet of craftsmanship that made those films stand out from the crowd. For the third Jurassic Park movie, the directorial torch was passed to Joe Johnston, and predictably, the result is a film that seems like it comes from another universe. Jurassic Park 3 is nowhere near the level of the first two Jurassic Park movies, and I suppose for those less enthusiastic about the series, that may be a dealbreaker. For me? Well, I was able to get past it. The clear step down in quality may take some getting used to (maybe even a couple of viewings), but I found that once I made peace with the fact that JP3 isn't an A-caliber blockbuster, what I was left with was a good B-caliber blockbuster; A breezy little summertime thrill ride with some fun dinosaur action. And come on, who doesn't love dinosaurs?Was Jurassic Park 3 really a necessary sequel? Was there some story waiting to be told? Some unanswered questions or themes to explore? Of course not. You can smell the studio's fingerprints all over Jurassic Park 3's script. The story is best described as a question, \"How do we get Alan Grant back to a dinosaur-infested island?\" The writers, Peter Buchman, Alexander Payne, and Jim Taylor, answer this question, but after that, they've got nothing. After Grant is duped by a divorced couple into visiting Site B in order to find their missing son, the film is just a chase picture, or maybe you could call it a wander picture, because there really is no urgency to the group's plan. Just get off the island, is about the extent of it. Tea Leoni and William H. Macy play the divorced couple, and they are good as typical Midwestern, suburban parents. Sam Neil's return as paleontologist Alan Grant is one of the few welcome sights in the character department. Neil does some classy work, and it is nice to see him back after he sat The Lost World out. The other characters, with the exception of the kid, are basically dino food from the beginning, and I do mean the beginning. Jurassic Park 3 wastes little time getting to what we all paid to see, dinosaurs eating, chasing, and just downright harassing humans. From the very start of the film, with a cartoony title card that shows a raptor claw slashing \"///\" through the Jurassic Park logo, it's apparent that this Jurassic Park does not take itself near as seriously as the first two do. There is not much effort given to building tension, which was at least half the appeal of Spielberg's movies. No time spent preparing us for the eventual running... and screaming. No, it's just all-out action from the very moment Grant arrives on the island. The dinosaurs themselves have taken the leap from lifelike animals to movie monsters. They chase and eat and roar. Why? Because they're dinosaurs, that's why. You won't hear any talk of maternal instincts here. Jurassic Park 3 aims for the basic visceral thrills of the series, and Johnston hits that target. Watching people run from dinosaurs is a lot of fun, no matter the context, but Johnston and company do construct some truly rousing set-pieces. The Spinosaurus vs T-Rex fight is a neat little 'Why Not?' moment, and the trip into the Pterodactyl cage is bigger in scale than anything from the previous two films. You don't get much in the way of tension in JP 3's action scenes, but they move along nicely, and they're well mounted for sure. The special effects, while not quite on the same level as its predecessor's (despite coming out four years after), are still effective. When it comes to realizing extinct creatures in three dimensions, ILM and Stan Winston are still a quantum leap in front of everybody else.Jurassic Park 3 is a textbook definition of 'disappointment'. It's a sequel that lacks the passion, spark, and creative talent of its predecessors. I hated it the first time I saw it, but as time goes by, I find it harder and harder to dislike. It works like a thrill ride at Disney World or Universal Studios. A quick pre-ride set up, and then it's time to strap in for non-stop dinosaur action. Jurassic Park 3 doesn't claim to offer more than those basic thrill ride pleasures, but those pleasures are enough for me. For summer matinée fare, you could do much worse.72/100","I have watched this film before and I can honestly say that when I had gone to see the film, I had high hopes of a great action plethora, and many plot twists, but my hopes were, in an instant, dashed to pieces. The film had a poor plot, with a weak set of characters.Alas, my hopes were crushed, as were a fair few people who had seen this film as well. This film revolves around dear Dr. Grant from the first film, who has taken on an assisting new student. They have been promised funding by a couple who wish to travel to the island. But all goes awry when some of the travelers interact with the fauna and make their way into troublesome matters, involving the 'raptors as usual, and some new (and substantially bothersome) predator, who performs an unforgivable act for Jurassic Park fans...With less action involving scientific theory, as was the original intent with the first films, and more action involving blind terror and chaos, as well as gaudy family moments which choked viewers with cheesy false sentiment, the film leaves little to the imagination. All in all, this film was very poor and very clearly the worst of the series.","OK, the second one was bad enough, this takes the cake. Raptors, yes we get fierce creatures of old. Now I'll go a long with the whole preposterous fantasy of bringing dinosaurs to life once again. Whatever it's a movie. This takes nature and tells everyone that it's a horrible place to exist in. Perhaps Michael Crichton had a bad experience camping or at the zoo. First dinosaurs are mindless killers. Next they're obsessive compulsives with a penchant for human flesh. The people in the movie are approximately the size of baby bunny would be to me. I've seen the island, there's plenty of food. Why are they going to huge lengths to eat these FIVE people? OK so one guys stole some eggs. So the raptors are in search their lost young. Isn't that nice. But these apparently ferocious creatures are scared off by smoke canisters? And hey when do 14 year olds become commando and crocodile dundee all rolled up into one? A 14 yr old that can survive in a jungle WITH dinosaurs for 8 weeks. Not going to happen. This movie fails in every way imaginable. Indestructible satellite phones (I can barely get my cell phone to work), para military crap everywhere and a narrow way out at the last possible second every single time. Falling 50 feet from atop a crane into water... that's not going to hurt? Oh I forgot, William H Macy is Arnold Schwarzenegger. There's nothing plausible in this movie whatsoever save one thing. it's under 90 minutes. It's no wonder it stayed wrapped in it's plastic until today. Stay away from this movie. You have been warned.","What is it about Hollywood that they keep making lacklustre sequels and tar the image of some true classics? JP3 is just one example. There are many more. 'Alien Resurrection, Star Wars (Both prequels, inparticular Episode 1), Beverly Hills Cop 2 & 3, Matrix Reloaded, Terminator 3, American Pie: The Wedding and not forgetting the Jason Voorhees/ Michael Myers/Freddy Krueger franchises are a handful of sequels that are mediocre at best and should never have been made. All the earlier films in these franchises were genuine classics.POSSIBLE SPOILERS The original Jurassic Park was a stunning, groundbreaking feat in film-making by the legend that is Steven Spielberg. I loved it. The second was a welcome follow up, up until the farcical finale. They should have ended 'The Lost World' when they leave the island and left the Jurassic Park films alone. Instead we have a T-Rex made to look comical and totally undignified, chasing buses, drinking from swimming pools and eating dog kennels.And then theres JP3. Where to start. It has to be with Spinosaurus. Spinosaurus! What is that all about? It eats a mobile phone and kills the star of the first two, the T-Rex. Rapters having a conversation with each other! What will they do in the 4th? Strut around with mobiles and pagers, and give each other a call when they spot potential prey! Spino already has one.The pterodactils (the ones with the wings for non-specialists) section was a worthy addition and should have been given more attention before this when these films had an ounce of respect.Oh just a couple more things. If a dinosaur has swallowed a phone it would digest in its stomach. You would not hear it ringing from inside a dinosaur's belly. Why don't the rapters just eat them at the end, after they successfully negotiate the return of their eggs? They just leave them to escape with the navy who, without being noticed,  magically turn up in boats and helicopters on the other side of a few trees .As you have probably grasped by now this film frustrated me somewhat and is just as frustrating now as it was when it came out. Shambolic.","I am a big Crichton fan and I did NOT appreciate this movie. For starters, there was no novel for them to base it off of (even though they wouldn't have followed the novel very well.) Second, the writer obviously knew very little about the subject he wrote about seeing as the paleontologists talk in layman terms throughout the entire film, not giving it the scientific facts that add to its predecesor. Thirdly, and this one isn't all THAT big of deal, but the graphics and robot interaction was terrible. When they changed from one to the other, it wasn't very gradual or subtle. The skin looked way too plastic on the robot. This film should've been made by the original creators, then maybe it would've been better.","This movie is on my list of the top 20 worst movies I have ever seen. There is no suspense, no updated computer animation, and a horrible ending. There were a lot of holes in the story line that were obvious to an average movie goer. If you are curious, I would recommend that you wait for it to come out on video."],"review-user":["johnnymacbest","mosquito1985","oscar-stainton","ccthemovieman-1","nin_fragile14","Blindman-2","pmicocci","Jacki-chan","marvreturns","canislupus","twistdsm99","c_p_c","theunseeneye","mikenickky","jaredmartin-464-711711","veemee78","stormscourge","jean emmanuel frojo","jaredpahl","Theshapeshifter","pete-545","armo_852","Dyonus","corbinbs"],"review-date":["22 May 2008","11 June 2003","20 August 2013","15 May 2006","18 July 2001","24 July 2001","16 August 2004","28 July 2001","6 June 2003","19 July 2001","14 July 2001","5 October 2002","26 May 2003","22 July 2003","1 July 2015","16 July 2006","29 July 2003","25 July 2001","5 October 2015","2 October 2005","19 August 2005","11 October 2003","27 January 2003","17 July 2001"],"review-rating":["5","6","5","8","1","1","1","1","1","1","3","1","1","6","1","1","1","7","1","1","1","5","1"],"review-title":[" The weakest of the first two films.\n"," Not as good as the previous JP's.\n"," A True Disappointment\n"," Much Better Than Its Reputation; Short & Fun\n"," Stupid Plot, rehashed ideas\n"," Why not go all the way\n"," Dumber by installment\n"," \"Two's company, three's a crowd.\" J.P. 3 doesn't compare to the first two.\n"," One long TV pilot for a bad family series.\n"," This movie really isn't worth it...\n"," Wait for video, heck wait for TV!\n"," They should have trashed the park after Lost World!\n"," Makes straits to video look classy in comparison.\n"," Makes the American Godzilla remake look like a masterpiece in comparison.\n"," Jurassic Park 3 is as Inventive as it's title.\n"," Unneeded\n"," I can't find a kind word to say about this film, that's how bad it is.\n"," talking raptors??!!!\n"," Amusing Dino Adventure Without The Sophistication or Craftsmanship of Spielberg's Originals\n"," Extinction should be, in this film's case, forever...\n"," Absolutely horrendous...\n"," Why oh why oh why!!\n"," A disgrace to Michael Crichton's work.\n"," By far the worst Jurassic Park movie yet!!!\n"]}