{"review-url":["http://www.imdb.com/title/tt0109760/reviews"],"review-text":["THE EXPERT, starring Jeff Speakman, is the definition of DULL!!!Dull, characters, dull situations, dull direction, dull actors, dull cinematography, dull music.I don't really understand this movie. Is it supposed to be an action movie? It's almost as if Speakman wanted to be in a serious movie but the level of acting and writing found in THE EXPERT is below your average TV drama. And there are some typical \"Speakman pummeling bad guys\" scenes here and there but the main aspect of the movie relies on some sort of believable drama, which is totally wrong for Speakman or is so badly directed that it just doesn't work with the action star. In the end, this confused movie looks and feels very nondescript and bland. The worst aspect of THE EXPERT is the music. The composer is a Jerry Goldsmith wannabe, with his pompous and melodramatic score, which simply doesn't belong in this kind of (dull) movie. It's as if the producers knew they had a very dull product on their hands and they asked the composer to make the film feel more compelling and dramatic with his score, which makes the entire movie look even more confused, goofier and dull.Don't waste your time watching this, even if you're a Jeff Speakman fan.","Jeff Speakman never really made it beyond the lowest ranks of martial-artists-turned-actors (lower than Don \"The Dragon\" Wilson, for example), and with vehicles like \"The Expert\", you can see why. There are three major problems with this movie: 1) The plot - or should I say plots - are all over the place, there are some characters who get a lot of screen time but serve little purpose, 2) There are only 4 fight scenes in total, some of them completely unrelated to the main plot and some taking place in the dark, 3) The music score is overzealous and overbearing. Strange as it may seem, this is really the most annoying thing about this film: the score persistently tries to convince you that you're watching some sort of grand epic, instead of the low-budget limited-action film you are indeed watching. With all that said, at least there's James Brolin around to lend a touch of credibility. *1/2 out of 4.","Poor Jeff Speakman! He should have been the next great martial arts movie god, but didn't make it! He looks so puffy from the 'roids in this movie he can't even move fast! How did he gain so much weight from \"Street Knight\" in such a short time? Can you say \"steroids\"?. Too bad, because he is such a normal actor, and much better than the crappy people who stepped into his place after this! I wish he had kept up his progress from his first starring movie, but he went (to me) downhill after his 3rd movie. Too bad, but he seems to be doing great with his martial arts schools, so I am happy for him. I wish he was doing great movies again, but at least he is doing something for the martial arts community.","John Lomax (Speakman) is a civilian military CQB, or, \"Close Quarter Battle\" instructor. When his beloved sister Jenny (Nagy) is tragically murdered by a serial killer named Martin Kagan (Shaner), initially Lomax is satisfied when Kagan is sentenced to die by going to the electric chair. When an inexplicably sympathetic doctor, Alice Barnes (Datcher) insists that Kagan is schizophrenic and that any and all murders were committed by his alter ego Martin Mirman, the dangerous psychopath is granted a stay of execution. But not for long, as an incensed Lomax decides to put his CQB skills to work to finally erase Kagan from the planet. But first he needs to get weaponry from his old buddy Snake (Varney) and find time for romance with reporter Liz Pierce (Gracen). Will Lomax's Expertise be enough to get the proper revenge? The Expert starts off in classic Martial Arts movie style, with a shadowy figure displaying his moves as the opening credits roll. Unfortunately, the rest of the film doesn't live up to this promising intro. The actual action scenes are minimal, and Speakman only Kenpo's it up on the baddies a scant few times. The first major action scene feels strangely slow and confused. A lot of the running time is spent as a Prison Slog, with no action whatsoever. Despite the presence of James Brolin as the warden, these scenes are ultimately pointless. We liked the moment when Brolin becomes unhinged, but overall neither he, Speakman, or the rest of the cast can overcome the mediocrity within.Michael Shaner, who we remembered from Bloodfist (1989) where he played the infamous \"Baby\", and Angelfist (1993), or possibly other movies with the word \"fist\" in the title, portrays the main baddie in a boo-hiss hateable style. His resemblance to a young Robert Davi made us believe fan favorite Davi also could have assayed the role. Because of the fact that when we first see Martin Kagan he's fixing a copying machine and has ink on his face (and because the camera keeps cutting closer and closer on to his leering face with each successive loud musical stab), we were prepared for a first, an evil copying machine repairman. Sadly, despite the hilariously ham-fisted telegraphing of his evilness, he was just your standard baddie.Let's not forget that Jim Varney is also onboard as a Vietnam vet who works at a store called Gun City USA. Now that's what I call shop 'til you drop. Even though it's a glorified cameo, it was nice to see Ernest himself call Speakman \"The Best\" and act as this movie's Machine Gun Joe. Elizabeth Gracen played the typical female reporter, this time resembling Teri Hatcher, not to be confused with fellow cast member Alex Datcher. The main problem with The Expert is that it ceases to be an action movie for vast portions of the running time. And anyone renting or buying a Jeff Speakman movie called The Expert isn't expecting that, and it's a disappointment. Supposedly the great Larry Cohen and the equally-great William Lustig had something to do with this production, but went uncredited. We can see why.A prime example of 1995 video store shelf-filler, regrettably, we were not impressed with The Expert.","Oh, well I thought it should be a good action, but it was not. Although Jeff Speakman stars there is nothing to watch.Only two fight for almost 1,5 hours, yak.A lot of talking and everything is so artificial that you could not believe it. The plot is clear from the beginning. If you want good action don't rent this movie.","i can't say i loved this third film featuring Jeff Speakman in a starring role.but i didn't hate it either.i thought it was a bit better than his second effort,Street Knight,though that's pretty faint praise.this one's a little less boring,and the fighting sequences are a bit better.the acting is not great,though Speakman himself actually isn't too bad,and actually seems to have improved since Street Knight.however i thought Michael Shaner as the Villain was a bright spot in an otherwise dense sea of fog.again,this is one movie that fails to distinguish itself from the rest of the pack and is no more than average for the genre.for me,The Expert is a 5/10","This film looked to be another great Speakman flick. However, like Deny says, too much talking, and not enough fighting. The only redeeming factor here is that the fighting scenes were very well done. Speakman is a great martial arts actor, but whoever directed this script did not understand the point of this kind of film. Street Knight and The Perfect Weapon were outstanding martial arts films and I highly recommend them to any action enthusiast.","This was Steven Segal-lookalike Jeff Speakman's third starring role, as a special kind of cop who decides to exact his own brand of vengeance on the man who brutalized and murdered his sister. The guy is convicted and locked away, but this isn't going to stop The Expert. Pretty lame action flick, with a couple of clumsily staged fights and a big showdown in the prison, where the bad guy is about to bust out when Speakman arrives to exact his revenge. Nothing much to recommend here, although I always liked Speakman, who apparently stopped making movies in 2006. However, I think I've seen him on TV occasionally, but I'm not 100 percent sure. Skip this one and check our hero out in The Perfect Weapon instead..","Of course I am going to think it was a great movie. I recognized several people I didn't see during filming also. I was the one playing the guard about an hour into the movie in the death row exercise yard asking for a light for a cigarette. I also changed this one scene. They had originally had it set to go into the rec yard and straighten out the inmate and turn him around and walk him out. The Director said \"It is taking to long, what would you do Gower.\" I said, \"We need to go in and hook the arms and drag him out backwards. That way your camera can stay on his face as we take him off set.\" I also lived at this same prison as a young child as my father was the Assistant Warden of Security. I am also a current employee with the Tennessee Deaprtment of Corrections as a supervisor at the Riverbend Maximum Security Institution. Even though a lot of the movie was a joke, the part I was in was reality enough. Also in the bar scene the dancer kicking high in the air and leaving the stage was an actual stripper I use to work with at a club called \"The Classic Cat\".","SWAT cop Jeff Speakman comes home one night to find his sister dead and so when the suspect is caught and is given the death penalty, Speakman gets sad, however when he hears that the killer might get out of the death penalty he gets ticked off and so Speakman breaks into the jail to execute the guy himself. The serial killer played by Michael Shaner is so transparently mean spirited and just around obvious manipulative that it's fairly contrived to think that someone would buy into his story that he is mentally unstable. The Expert does feature some well staged action sequences but the reason why I didn't care for this flick was that it clearly didn't know what it wants to be. Is it exploring capital punishment (because there are people that get the chair even though they're sorry and there is an innocent man who is on death row.) ? Is it about how to cope with a murder that hits too close to home or is it a revenge thriller about what happens when justice doesn't prevail. However without a stance to take, The Expert pretty much talks itself in corners and every action sequence seems to be out of place, while the politics are so heavy handed that they seem too overwrought to really convince. In other words The Expert has too much on it's plate and for the action crowd this only provides the bare minimum action while for fans of movies that get political, will be disappointed by the lack of a stance taken. The movie itself has a few interesting elements but typically the messy plot got in the way of the revenge plot. Fans of Speakman should find something to like but after this flick he seemed to disappear into obscurity.* * out of 4-(Fair)","My main critique of this film is twofold: 1) 80's/90's action films like this tended to be reactionary in some way, but the message this one hammers home even silly for its genre, and 2) Jeff Speakman, while a good martial artist, is a charisma vacuum as an actor. First, however, what the film does have in its favor. As previously stated, Jeff Speakman is quite convincing as a martial artist and, in general, as a physical presence. I certainly wouldn't want to mess with him in real life (contrary to whatever Steven Seagal's beef with him was). The plot is also quite efficient, if rudimentary, in the way it sets up the characters and moves the action forward. The first scene in particular establishes Speakman's character as the no-bs \"expert\" that the title indicated he would be. The action scenes were also well-choreographed and there was some decent camera-work in the slower portions of the film. I also thought that James Brolin and Jim Varney (in a one-scene cameo) did respectable acting work. However, just about everyone else, Speakman included, was halfway decent at best. The writing also wasn't anything to be proud of either. My biggest issue with the film is the \"message,\" if one can call it that. THE EXPERT delivers yet another right-wing fantasy about a lone \"hero\" who takes on an ineffectual justice system by doling out his own version of justice against the violent criminal who killed his sister. Of course violent criminals should be punished, but the negative way it portrays a female psychologist involved with the case very unsubtly clues the viewer onto what the film's stance is. Not that a film shouldn't take a stance on anything, but I happen to think the stance wasn't very fair. Aside from that, the score was overblown and there were a few pacing issues in the middle portion, where the main character barely gets any screen time. I know I shouldn't have expected too much, considering Jeff Speakman was a third-tier action star at best, but the obvious message-making made it a little bit of a chore to sit through.","This was Speakman's fourth big film, well in low budget way. As usual in these low budget action films, he is an former trainer of special units, who seeks revenge. Normally, typically, and as usual Now I haven't seen any other Jeff latest film, they are kinda hard to come by but, he is busy today with Kenpo seminars all over the world and I think it's a good idea to stop when you are supposed to and keep a low profile and do what you like to do. I kinda doubt in Jeff latest films maybe because I am a fan of 90s action films. OK, the story is usual, a sadistic maniac Kagan (played by Michael Shaner, who you probably remember for \"Lethal Weapon\" (1987), he was the guy who was \"saved\" by Mel Gibson from suicide jump. He made an interesting performance, but not too well to be noticed for more upcoming roles), kills John's (Speakman) sister and, therefore he seeks revenge his own way. You know, kinda badass and radical. There's actually nothing that quite special in the film, the action scenes were solid, the movie has an interesting music score that fits perfectly in the scenes. Jeff is really good in his fighting scenes, as always. We got actors as James Brolin (as a cold prison warden) and Alex Datcher (as a liberal fighter for convicts rights, or whatever), other actors didn't do anything much with their performances, well what did you expect from a low budget film? But here's what's cool I was quite surprised by this. Jim Varney appears in film as Speakman's war buddy who is a pawn shop owner, and who also supplies Speakman with some cool weapons and equipment for his revenge. Varney is a comedian, but even in this 5 to 6 minute role, he proved otherwise, he was really cool in the role. And I really suggest all Varney fans to check him out here, you'll love it. Ernest P. Worrell can be a badass, I tell you. Well, overall, low budget action film fans here's a real treat, enjoy it.","The working title of this film was \"Brute Force\"I worked on this film and never got paid. It was a typical Hollywood shell game. The production company declared bankruptcy and was bought by a sister company. This film aired on Showtime. My name appeared in the credits.When I called the production company about payment (after airing) they asked I \"prove\" I worked on the show. LOL. How about my name being in the credits? LOLI was surprised to find it under my name on IMDb. Once again, they credit me with the work, but never paid me. It's so typical of Hollywood."],"review-user":["Maciste_Brother","gridoon2018","jiggsmcgretzky","tarbosh22000","deny","disdressed12","Invictus","ctomvelu1","MrGowerM64","fmarkland32","brchthethird","swedzin","jmctn2000"],"review-date":["3 June 2003","13 February 2009","22 September 2006","4 August 2014","12 December 1999","14 June 2010","30 January 2000","22 January 2013","24 January 2006","12 April 2007","1 August 2016","26 November 2012","21 July 2011"],"review-rating":["2","4","4","2","5","5","10","5","5","5"],"review-title":[" Not worth your time or attention\n"," Slapdash action flick\n"," Not as good as \"Street Knight\"...\n"," A prime example of 1995 video store shelf-filler.\n"," A movie not to watch\n"," average at best\n"," A disappointment\n"," Not Speakman's best\n"," I was in the movie The Expert\n"," Game Of Death...\n"," Halfway decent action film dragged down by obvious message-making\n"," The extreme, the exact, the expert... Speakman\n"," Typical Hollywood\n"]}