{"review-url":["http://www.imdb.com/title/tt0168085/reviews"],"review-text":["I don't usually like TV movies, I reckon that if the thing was any good it would make it to Hollywood. This one though is better than average, pretty high production values, a few interesting story twists and some nice shots of NYC (along with Toronto) hold the interest.","As bad as they get. This film commits the fatal error of making the viewer not care what happens to characters. The two women in this flick are so stupid that you begin to root for the bad guys so this thing would end.This film is one of the few that was so bad that I had to turn to another channel. Put in highbrow language, this film lacks verisimilitude. People, not even people from Ohio, simply do not act like this. Well, maybe the writers do.There is not enough beer in the world to make this film bearable.F903","Naked City: JWAB does a pretty good job of balancing its two A - B stories, eventhough I'm not all that fond of multiple plot movies. And Scott Glen and Courtney B. Vance make a great on screen dual. However,  I'm not sure what kind of message a movie sends when two flat-foot country girls can get off scott free with murder, grand theft, and to top it off, win a free flight home (in first class no less--at least from the looks of their attire anyway). Gee, I guess that blue wall of silence is still rather think!Rating: 8","This Showtime cable film features a talented cast and weaves together several storylines involving the darker side of New York... from the naive and innocent tourists' nightmarish adventure to a pair of undercover cops on the streets... to an old friend's betrayal, it has it all.Well worth a look, as is its sequel.","The \"Justice With a Bullet\" episode of \"Naked City\", a series of journeyman cops and drama stories set in NYC, involves a contract on detective Halloran (Vance) and a couple of midwest young female tourists who find themselves in trouble with gangsters. An entertaining flick which doesn't take itself too seriously, \"Naked City: JWAB\" is an okay no brainer watch for couch potatoes into crime flicks.","The essence of this film falls on judgments by police officers who, fortunately ethical and moral men, act on situations within situations in a city with a super-abundance of violence and killing. Good compound interacting story lines and above-average characterizations."],"review-user":["seamanm","fiat0903","Kylic","dumas","=G=","hero"],"review-date":["16 April 1999","22 January 2006","6 December 1999","25 December 1998","26 May 2002","16 October 1998"],"review-rating":["4","1","8","7","5","7"],"review-title":[" Better than your average TV movie\n"," Fatally Bad\n"," Pretty good for a tv movie (some spoilers)\n"," A slick, intriguing off-beat thriller\n"," Okay cops & gangsters popcorn flick for couch potatoes.\n"," mega-city cops take on crime and serve to judge/resolve\n"]}