{"review-url":["http://www.imdb.com/title/tt0187696/reviews"],"review-text":["I was very curious about Anatomy (aka Anatomie) and if I was going to see it, I was going to have to buy it since no video stores in my area carried the film.  Since it was not a low-priced DVD, I did take a chance and thought I'd take a peek at other comments on IMDb.  Many of the comments didn't give me enough hope of forking out lots of bucks for a film I had never seen nor had any clues about.  I basically got the idea it was a sexy youth-oriented romp being compared to many cookie-cutter teen thrillers. Well, something in the back of my mind told me to ignore those types of comments and buy it!  I did, and was I pleasantly surprised!If it is going to be compared to any other films, I would say it's a variation of Coma and Extreme Measures.  I couldn't see any comparison to films like Scream, Urban Legends, et al.  Yes, the cast is young (that's because they're med students! At least they aren't the increasingly boring high school type characters), and yes, some are lusty (basically the character played by Anna Loos is, and it is handled quite tastefully in the German language version), but Anatomy is well constructed, there is a tense mood throughout, the sets are amazing, the makeup effects are a wow, and Franka Potente is very credible in her role.  I found myself enjoying all of it despite a few gaping holes in the plot!  The story of a student discovering a sort-of secret society doing autopsies on still-living patients is a rather creepy scenario and what happens to those patients afterwards is quite clever.  Sure, you could ask why didn't she just GET OUT OF THAT TOWN?  Okay, but then the film would be over within a half hour.This was the first effort from the German part of Columbia Pictures, and it's actually quite an impressive one.  There was a bit of care in the production and to actually offer some genuine thrills is an accomplishment. It is a bit mature in mind, as it doesn't resort to constant opportunities for sexual encounters(a breast fest) or juvenile drug jokes.  Anna Loos' character, while often making sexual remarks and looking for some fun, was actually a nice touch--having a character that was a woman more intelligent than any of the men in the school.  She found that sex was really just a distraction for her and the men rather lacking.THE IMPORTANT STUFF:  Watching this film in the original German language with English or French subtitles is the BEST way to enjoy it.  I saw the theatrical trailers dubbed in English and was disgusted by the change it made in the film's tone.  I have never seen a properly dubbed film in my life--they never can find voices that suit the film's actors or characters. Sure enough, I tried to watch some of Anatomy dubbed in English and the intelligence level of it dropped severely, making it seem more like a comedy. A good example is when one guy was freaked out at being cut open and screamed to be sewn back up--hearing it in German he sounded frantic, but dubbed in English he sounded like a comedian. Frankly, I'm sick of hearing people say they can't handle reading subtitles or watch a \"letterboxed\" film.  Anatomy comes off as silly with dubbed voices that seem octaves too high for any of the people you see in the film, and Anna Loos' sexual comments then just sound like awful remarks right out of Fast Times At Ridgemont High. I wonder if the negative comments about Anatomy are from people who watched it dubbed, it just doesn't seem like the same film at all!  This is not a cheap horror film and deserves to be viewed as it was created.  Interesting to note that some of the English subtitles are different in scenes in the feature and the \"making of\" supplement.As it turns out, I gambled and won with Anatomy.  It's a competent thriller with likeable characters and doesn't try to go for cheap thrills.","When Medical student Paula Henning (Franka Potente, of \"Run Lola Run\" fame\") wins a highly coveted scholarship, she's understandable enthused. But strange experiments are being done on live sedated bodies somewhere on the premises. When she recognizes a corpse as the boy she met on the train there, she decides to snoop around. What starts of as a reasonably captivating little thriller derails completely by the third act and becomes a carbon copy of any other slasher film made, which is a shame as if the film just stayed on target, it would've been something special, as the acting was good into then and the camera-work was pretty good throughout.My Grade: C DVD Extras: Commentary with director Stefan Ruzowitzky; 2 Deleted scenes with commentary by director Stefan Ruzowitzky; Anna Loos - My Truth (music video); 2 & a half minute Make-up featurette; barely 5 minute Making-of featurette; Talent files; Production photos; Storyboard comparisons; Dubbed Teaser & Theatrical trailers; and Trailers for \"Circus\" (2000) & \"Run, Lola, Run\"","\"Anatomy\" is a somewhat decent film if not entirely all that great.**SPOILERS**Preparing for her studies, Paula Henning, (Franka Potente) is accepted into Heidelberg University with Prof. Grombeck, (Traugott Buhre) in his Anatomy Class, said to be one of the most advanced and prestigious around. Meeting with other students Gretchen, (Anna Loos) and Caspar, (Sebastian Blomberg) in the class, she wonders if her family reputation will affect her chances. When she gets back to her classes, she starts to wonder about the selection of corpses used, and begins to suspect that something isn't right. Investigating the situation, she finds evidence that an illegal practice of outlaw doctors performing unethical experiments is linked to several professors on the campus, and she soon finds herself targeted to keep the secrets hidden, and she races to stop them from doing so.The Good News: There wasn't a whole lot to this one. One of the best parts to this is the mystery angle that's played up about what the practice is really doing and who's involved, generating some tension to this one later on. The fact that it does this is actually a fun idea, as there's plenty to be crept out at by the rather large amount of time spent among cadavers, which is enough on it's own but here, using the practice is where it really scores a lot of great scenes where she's investigating them. That the look to them is really creepy is another big plus, as the look where they remain intact but are displayed so that the inner workings and organs are visible, often-times while the skin is still attached to the rest of the body, producing a cool and creepy visual. The film does include a little sleaze with it's really fun striptease in the morgue. It works nicely and really gets those elements into the film. The last good plus is the fact that the last half of the film is a full-on traditional slasher movie sequence, complete with a creepy stalking through the library and out into the rest of the campus and is done with a lot of fun times and come really good moments to come along with it. It's one of the better scenes in the film and they're all quite well done, leaving these as the highlights of the film.The Bad News: There was a couple of really big flaws noticeable for this one. One of the main ones is the complete lack of true horror atmosphere for the film. The idea behind it isn't exactly the greatest one to provide some horror elements, seemingly set-up like a thriller instead with the inclusion of the evil cult and the very way it's handled in here. The fact that it's introduced into the film so very late as it is does account for some flaws, as we're left with the utter dullness of the first half's focus on the special classes and the behavior surrounding them that not a lot of horror-specific elements are presented into the film, but also because it does this, we don't really know a whole lot about the cult to begin. Seemingly, it relies on the notion of being practitioners of illegal experiments to create it's fear of them, since we know nothing about the other than how they work, which can work if they only went into action more often as they don't really do that much anyway. That manages to make the cult hardly involved in the film about them and completely nonthreatening due to their absolute non-appearance and complete cluelessness over what they are actually doing, effectively reducing their fear. The last flaw here is the fact that this one is really dull, as it doesn't have a whole lot of stuff that manages to stick out as being worthwhile for the longest time due to the inclusion of all the other elements mentioned so far make it all the more boring. These here are the film's flaws.The Final Verdict: Not entirely worthless, but not all that enjoyable either unless you happen to be a fan of these films or like the concept. If either of these apply to you, then this will be highly recommended viewing, otherwise this will most likely be a severe disappointment and should be viewed with caution.Rated R: Graphic Violence, Graphic Language, Nudity and a mild sex scene","ANATOMY (Anatomie) Aspect ratio: 2.39:1Sound formats: Dolby Digital / SDDSA brilliant med student (Franka Potente) is pitched into a conspiracy at Heidelberg University, where a secret fraternity of medical deviates practice dissection on living subjects...Stefan Ruzowitzky's superior thriller - the debut feature of Columbia Pictures' European production arm - derives inspiration from similarly-styled US shockers of the period (SCREAM, I KNOW WHAT YOU DID LAST SUMMER, etc.), and exploits the audience's worst fears about invasive medical procedures. Beautifully photographed by STALINGRAD's Peter von Haller, the film contrasts picture-postcard Heidelberg with the silver-grey starkness of the anatomy rooms where German superstar Potente struggles to disentangle herself from an ancient conspiracy of horror. Second-billed Benno Fürmann (THE PRINCESS AND THE WARRIOR) - the film's 'token' beefcake - emerges as a key player around the movie's halfway mark, beginning with a nerve-shredding set-piece recalling the potato truck sequence in Hitchcock's FRENZY (1972). In a happy turnabout from standard practice, all the nudity in the film is male-oriented, including what Ruzowitzky has described as Fürmann's \"famous butt shot\"!! Who says modern horror movies aren't camp? Great fun, and followed by ANATOMY 2 (2003).(German dialogue)","Before Franka Potente became famous with the Bourne trilogy she made this German movie. As a student in, you guessed it, anatomy she has to go to the most important school to learn that but there is a secret. Some people joined a kind of mason. She notices that something is terrible wrong in the school and she starts to investigate. Wrong. What happens next isn't really horror it's more some kind of thriller but you really have to watch it for the effects. A few years ago it was a hype to see the exhibition Kopferwelten. What you saw there is what we have here only they didn't used real bodies but it was so nicely done that it could be used in classes. It never becomes gory or even bloody, it is really the atmosphere that creates the movie. But it is one that you must have seen because, some people fears that it could happen to you....","Anatomie (Anatomy) is an entertaining and engaging film that falls short of delivering the discomfort that should be connected with the films subject matter.  The idea of ethical ignorance in the medical science world is one that pushes the viewer towards discomfort, and the realism of the institutions ('Heidelberg') and the special effects make it a not-entirely easy film to watch.However, the characters, the script, and the gloss of the film all seem too familiar with the Scream movies that repopularised this sort of genre. Sadly, then, whilst the subject is one to care about, the viewer is presented with another movie full of college student characters that we don't really get a chance to care about, unresolved subplots, and hammy stage-killings that have been reinventing themselves since the memorable Drew Barrymore opening scene in Scream several years back.\nSteven Ruzowillzky makes a fair effort of the script and the direction, but pushes no boundaries other than the general theme.  Whilst we are presented with an entertaining film with some reasonable performances, we are unfortunately left with the old feeling: nothing is wrong with this film, but nothing is extraordinary either.An entertaining film, and an interesting chance to see how foreign filmmakers have been influenced by the post-scream 'horror' culture.  6 out of 10","Okay, I had reasonably high expectations for this. The controversial subject matter was a good concept. As a horror fan I admit I was fascinated and very excited about this.It turns out they had a great idea, but it was terribly executed. Let's see. This movie seems to run in 3 modes: Happy, Sex and Dark. The problem is that the movie never decides what it wants to be. The \"Happy\" parts I believe were meant to contrast with the \"Dark\" parts, but it doesn't work. The soundtrack is one of the reasons.The movie transitions between these 3 modes very badly, I can't even begin to say how much the directing and editing suck. There's sex in the most unappealing and unerotic way. I'm not complaining but even for Horror standards they were unnecessary and filler.The characters are all unlikeable with the exception of Paula (Potente). Her friend from Munich is a slut and possibly one of the most annoying characters in movies I've come across recently.There's a bit of plot which I won't go into detail... It's not stupid and in more talented hands would make a good movie. There's even a nice twist and a cool conspiracy going on. Don't try to understand everything because there are giant plot holes here.It's all so shoddily done that you don't care for the victims, the perpetrators, anyone. And to think this could have been great. I can say ONE good thing about it which is, the movie shed some light on today's unethical medical procedures. With genetics and controversial sciences advancing, this could have been a great philosophical film that raises and discusses these questions. But you won't find that here, just a series of scenes loosely pasted together with people and things that you don't care about.Skip this and go watch Flatliners instead, you're welcome.3/10","(minor plot-spoilers coming up)\"Anatomie\" is the kind of film that actually proofs how low the nowadays American horror industry has sunk. This German thriller/horror film is nowhere near perfect (or even 'great'), yet it's a lot more refreshing, original and imaginative than what we've seen from Hollywood lately! Unlike the tedious and uninspired US-slashers, Anatomie brings forward quite a lot of suspense, gruesome violence and a couple of interesting ideas and settings. The wholesome of this interesting mixture still is somewhat flawed, but at least the attempt is there and you have to respect that. The story of Anatomie handles about a super-intelligent group of students who're selected to enjoy a special education at Heindelberg University! One of them, Paula (Franka Potenta) soon discovers that a traditional foundation of surgeons is still active in Heindelberg. They perform unethical experiments on dead bodies...Now, within this organization, there are even bigger weirdos who suffer from some sort of strange fetish for human intestines! It's up to Paula to put a stop to this unorthodox manners but who else can she trust?!? Indeed, this basic plot is a little far-fetched and therefore, Anatomie goes over the top multiple times. Also, some of the characters are really difficult to take serious...They're supposed to be the most intelligent, young medicine-students in all Germany and all they ever talk about is sex and...more sex! Franka Potenta (the over-talented girl from the cult-hit 'Lola Rennt')does succeed in making herself believable, though! There also is a good use of music, scenery and - very important - medical slang!! Your head will start to spin when hearing all those Latin names for diseases and drugs...Nevertheless, I hardly think it was necessary to try and make this film look even more intelligent than it is. It remains entertainment in the first place! Anatomie was a huge success in Germany and the neighboring countries. It also found its way to the American cult-circuit and a sequel was released in 2003. Especially recommended if you need a break from the overblown Hollywood screamers!","I saw (unfortunately) the dubbed version on Encore.Student Paula Henning (Franka Potente who was also in the cult favorite \"Run Lola Run\") stars as a serious medical student who gets into a prestigious school in Germany. But she soon discovers that some students go missing and the bodies they work on in the anatomy lab are incredibly fresh...I was stuck seeing the dubbed version on Encore. It hurt a lot (the words not matching the lips got annoying real quick) but I still liked what I saw. The acting was good, it was beautifully photographed, it wasn't TOO gruesome and I was never bored. Even more refreshing was a likable heroine who fights back when the bad guys go after her. The (mild) nudity was, in a refreshing twist, male! A previous poster mentions Benno Furmann (who is excellent) showed his butt but I don't remember seeing it. Regardless this is a well done, scary and excellent thriller. From all I've read the original German language version is the best (I don't doubt that for one second) but the dubbed version is watchable. I give this a 7.","1st watched 6/24/2007 - 4 out of 10(Dir-Stefan Rujowitzky): OK thriller, but a little too predictable. This story is based in Germany, which is also where the movie is made. It is about a young medical student who gets a shot to go to a premiere school in Heidelberg and arrives seeing some strange things occurring. Someone she met on the train there and saved, shows up on the school's experimentation table and she's suspecting foul play right away. She does some investigation and the disappearance of her friend leads her to a secret society called AAA(and no it's not Alcoholics Anonymous) that has something to do with the anti-Hippocratic oath and is used to perform experimentations on live people that doctor's wouldn't normally be able to do. She finds out her grandfather(who was a dean at the school) was a big part of establishing it and it's pretty readily filled by members of the school. It's an interesting story but the problem with this movie is how quickly the audience is told what's going on and then it's kind of a horror movie with the heroine fighting off the bad boy of the group that's taking things to the next psychotic level. Although this movie was made in Europe, it plays to a young American audience with it's focus on gore, sex and the horror film premise(which is really it's big downfall) and explains why it probably made good money and spawned a sequel but doesn't necessarily make for a good movie.","Anatomie is a great horror/suspense movie.It's different from the horror teen movies which are always the same and very boring.Inded!The movie is very well produced and with a lot of creative and scary.I had never watched a german movie in my life ,and now I'll give more attention for them. Because this move deserves attention especially in the rest of the world.Franka Potente is just superb and pretty.I think she's very cute and has a lot of potential.She's one of the most promisor actresses on hollywood.And now she's only success after she played `The Bourne Identity' and in the next `Try Sennteen'.She has potential!The movie goes well until the end.In the final hours you'll be a little upset with the twists in the story and some facts not very understandable.But you'll survive!The autopsy scenes are incredible and horrible at the same time.Imagine you, seeing people stripping your body, your organs and muscles.It's just terrieble!But,I think that these things really happens with innocent people.Some `doctors' must go on the streets looking for beggars and deficient people to anatomize their bodies.I think that some institutions do these sort of things and it's really sad!It's brutal and degrating the way that ,in the movie, doctors do the autopsy in common and nondead people.You can see that this motion picture isn't just to entertain us but for raise doubts about the medicine system in the world.These atrocious facts could be happening right now on your city , and you won't know anything.This movie is essencial for those who want to follow the medicine carreer.It's a great database!And it worthwhile!P.S.:Conclusion:Pay attention to the other countrie's movies cause it's not only North America that does it well!","Firstly, this movie works in the fact that it is disturbing.  I really did not like seeing all these scenes where people get cut up alive, etc.  The weirdly erotic introduction gives one a sense of necrophiliactic wonder. It is somewhat... distastefull to me personally.  But the movie really works in that respect, and it is suppposed to be scary, so I give it credit for that. Yup, a few points there for those scalpels and....well, damned disturbing idea of getting disected alive.But what this movie lacks is an interesting plot, characterization, or real surprises.  The whole teen-flick horror genre usually goes in a very simple, predictable way.  Lots of 'tense' moments, creepy guys who are insane, and the big question of all: is the boyfriend the murderer?  This movie fits into the category of \"Scream\" and countless others which have spawned over the 90s.  Well, I won't spoil it for you, but it's not exactly interesting who is the killer.  We find out who it is half way through... and from there on, the movie drudges on, trying to fill in some time... rather boringly to say the least.  I was looking at the clock a bit on this movie.The lead actress is great, as usual, but the carboard acting box she is placed into makes one groan in pain... the college girl who is a detective who everyone thinks is insane, but she is the one who really knows whats going on.  And the cops?  Ahhh, they just laugh and eat donuts.  Very predictable, flat, disturbing at times, and most of all, boring and dull... It's like an American film company took a flight to Germany to shoot a movie to make it foreign..... hmmm..... or did they?","This is a pretty lousy picture.It offers nothing unique or original or even interesting.A medical student discovers that a secret society at her university is engaged in macabre medical experiments.And of course she becomes involved in solving the weird deaths at the school.This movie started out promising with a few cool special effects in which a guy is partially dissected while alive and tries to get away after he wakes up but then even that fizzles and the rest of the special effects are pretty routine plastic models of the human body and that unreal looking blood that these second rate horror movies always seem to have.And as if the routine plot and the lousy acting wasn't enough this movie had subtitles that many times didn't even match the dubbed English that you hear being spoken and then add that to the mouth movement not matching the dubbing ..well let's just say trying to coordinate all that in your head isn't worth it for this mediocre movie.I was at least counting on some skin in this movie and except for a bit during the opening credits this movie didn't deliver on that either.This is a boring routine run of the mill horror/gore movie---short on horror and gore.Skip this movie unless \"Ernest goes to Camp\" is the only rental left.","I was shocked at how good this German version of films such as Scream was. Surpassing all the modern American efforts at slasher films.It as what all those films don't. Likable characters, genuine mystery, suspense, graphic murders and a brilliant soundtrack.This stylish horror film is one of the best of its kind to come out in years. German cinema is going from strength to strength just lately. Its a shame more people wont go to see such films because they are missing out. It is easily available on DVD so even if you hate subtitles I think you should see it. It will be one of the best horror films you will see all year.","This movie had such a good premise to start with. Suspense, slashers, a secret society, and you really couldn't figure out who the bad guys were until the last quarter of the movie.But it contained so many dumb clichés from the worst of the old American slasher/horror movies. Now, I love slasher/horror movies, but there are all the old clichés that have long disappeared from American cinema. For example, the old \"I hear noises in the basement and I'm home all alone and the basement light doesn't work, so I'll go down to investigate\" cliché.Three examples of these clichés just really irked me to no end: 1) When Potente finds out that there may be a secret society at work at the medical school carving up live bodies, she proceeds to ask questions and tell EVERYONE -- very publicly. In essence, she is saying, \"I found you out. Come kill me because I am telling everyone your secret.\" And then she wonders why she finds blood smeared all over her bed and is brought her roommate's severed finger in a towel.2) Even after one guy she met two weeks ago ends up on the dissection table and she finds out about this secret society disemboweling live people, she goes to the lab where all the dead bodies are stored 2-3 more times BY HERSELF AT NIGHT to investigate.3) Her roommate gets killed. She gets chased by the killer, whom she knows, doesn't report him to the university or the police, then leaves the school to go home to visit her parents. Then she returns to school, apparently thinking that this guy who tried to kill her will let bygones be bygones and not try to kill her, even though she knows his secret. She was, of course, wrong.For someone who was supposed to be so smart (she was studying to be a doctor in the best school in Germany), she acted like the cliché bimbo in a horror movie.These things just made a potentially good movie very frustrating, and made me wish the ending would come even sooner. Halfway through the movie, I stopped routing for her and wished that she would end up on the dissection table, too.","Finally got to see this movie last weekend. What a disappointment..it barely reaches \"made for TV\" level. Given the list of actors, I would have expected something substantially more sophisticated. The movie lacks a good story, well, actually any story for that matter. It has no credibility, instead lots of predictability. Save yourself the money and the time.","\"Anatomy\" tells of an attractive young female medical student who attends the University of Heidelberg where she discovers an ancient secret society of doctors who practice human vivisection. The film is an artful shoot with great anatomical props and a story which is a little more intelligent than typical American horror flicks where hockey masked hulks go around butchering teenagers. The video release I watched was also very well dubbed. Overall a cut above your average horror flick and an mildly thrilling and suspenseful watch for most. The last two words of the film are particularly telling.","This German film stars the appealing Franka Potente (\"Run Lola Run\", \"The Bourne Identity\") as Paula Henning, a talented and ambitious medical student who earns the opportunity to study at the prestigious Heidelberg institution. Her newfound friend Gretchen (Anna Loos) is mostly interested in guys, despite having plenty of brains herself. While Paula finds herself attracted to Caspar (Sebastian Blomberg), she gets wind of a conspiracy being engineered by various personnel to experiment on living bodies, all sense of ethics be damned.Ultimately, \"Anatomie\" doesn't head anywhere surprising, becoming more and more conventional as it goes along. Still, while it doesn't reinvent the wheel, it entertains in decent enough fashion, having clearly been inspired by such things as early David Cronenberg. At every point, we're reminded of the horrors that can be visited upon the human body. Therefore, there is some enjoyable gore and violence, and some that is disturbing at the same time.Our villains are actually revealed sooner than one might think, so what follows is a little \"the end always justifies the means\" speechifying (but not too, too much of it) from these determined individuals. Of course, some of them are committed to their cause, and there are others that are simply psychotic.There's a little bit of sex, as well as some nudity, so \"Anatomie\" delivers on a visceral level. It's very slick from a technical viewpoint, with some wonderful widescreen photography (especially outdoors).The clinical approach of our villains is contrasted with the understandably reviled, emotional reactions of our heroine Paula, convincingly portrayed by Ms. Potente. Benno Furmann, Holger Speckhahn, Traugott Buhre, Oliver Wnuk, and Arndt Schwering-Sohnrey co-star, with a particularly showy role for sexy blonde Loos.Nothing great here, but certainly this is all watchable enough.Seven out of 10.","This is \"Anatomy\", a German psychological thriller film from 15 years ago. It is actually one of the more known German movies abroad and it features Franka Potente playing the lead character briefly after her breakthrough in \"Lola rennt\". Looking at how long ago this was made, it is a bit surprising that so many actors in this film are actually still very popular today. This includes Benno Fürmann, Oliver Wnuk, Sebastian Blomberg, Anna Loos and maybe Rüdiger Vogler, who already worked in the 1970s with Wim Wenders. The writer and director is Stefan Ruzowitzky, from Austria. He won an Academy Award in the Best Foreign Language Feature category for \"Die Fälscher\" a while ago, but \"Anatomie\" or maybe also \"Die Siebtelbauern\" were his breakthrough films.Here we follow a young medicine student who gets accepted at a prestigious university, but quickly finds out that there are dark forces performing unethical experiments on a regular basis. The most interesting fact, however, is that these are not the real antagonists in this movie. It is more the radical wing of this group I just mentioned who are not scared of killing whenever and whomever they like. Now my general perception of this film is a double-edged sword. I liked parts of it and felt is was a decent thriller, but other parts I was not too fond of at all. This already starts with my perception that Fürmann, Loos and Wnuk are simply no talented actors in my opinion. Especially Loos did nothing for me here. Literally, the only reason why I felt she was in this film was to show her in the end when she was dead. Apart from that, Holger Speckhahn is not an actor by any means. Not even a good television show host, but even worse as an actor. Blomberg, who has more range, has been given a stupid role of a love interest to the main character that adds almost nothing to the film where he cannot put his talent on show at all. The only somewhat good thing was that you could wonder about basically every character in this film if he was good or bad and keep changing your opinion throughout the entire film repeatedly. For example, I was fairly certain that Loos' character would be actually evil and her friendship with Potente's character was just facade.Talking about Potente, she looks stunning in here and she is also maybe the best actor in this movie. Sad to see her career has gone south a lot since then. The ending credits include a nice German song names \"Alles\" (\"Everything\") and the refrain says something like \"do you believe this was already everything?\". This does not really make sense in terms of the story in this film, but it makes sense looking at the fact that Ruzowitzky made a sequel a couple years later. About this one here, I recommend it to fans of horror thrillers or fans of scalpel action, but everybody else can do without it. It's not half as good as it's famous.","I've watched a fair few German films now as part of my mission to improve my language skills so I feel confident in pointing out one or two commonalities I've noticed among them: No matter what year/decade German films are made, they always feel like they were made in the 90s. Granted, Anatomie was made in 2000 but even more recent German films (and TV shows) always have a 90s feel to them due to various reasons, the most prominent being the typically all-white cast. German films are very 'Disney' in the sense that there seems to be this 'ideal' vision of what Germany looks like or rather, what the German audience looks like but the reality is that times have changed and even Disney is finally updating its thinking. German films need to diversify, stop portraying women as simple stereotypes, and stop promoting smoking in films. I am sick to the back teeth of seeing the main protagonists light up in every single German film I watch. Not just because 'morals' but also because it's distracting. As soon as someone takes that first drag, you know their breath absolutely stinks so if this is happening right before a love scene, it's completely off-putting.Another thing I've noticed is that German films will often have a fascinating premise and will start off strong but will then falter towards the middle, like they don't know how to properly pace a film or write an engaging story from start to finish. I sometimes wish people would send me their scripts for review before selling them to studios! I did feel that the film was very predictable but luckily, Anatomie doesn't try to be a 'true' mystery. The bad guy(s) is revealed fairly early on but there was at least one twist which I didn't figure out until near the end.A special mention for Benno Fürmann; a powerful actor who simply terrifies in every scene. He also worked with Franka Potente in the superb Der Krieger und die Kaiserin (2000) where he put those tremendous eyes of his to good use too.After the opening and an initial genuinely gruesome and terrifying scene, the horror of which Hostel (2005) later replicated, Anatomie loses momentum and meanders down an irrelevant path instead of focusing on the daily duties of the students at the medical school. That was a huge missed opportunity and like so many other German films I've watched, it felt like a case of 'the audience is invested now, we can switch to auto-pilot'.I only watched this a few hours ago and already, I can't remember the ending. There was another ending during the credits so maybe that's interfering. No, I've got it: it was an extremely predictable, although fitting ending.If you have time to kill, this is definitely worth a watch. It will however, be almost instantly forgotten.6/10","This German horror film from 2000 stars Franka Potente, the breakout star of the 1998 film \"Run Lola Run\". It answers the question how do they really get the bodies for those amazing Body Worlds Exhibits? Real human bodies injected with a plastic like substance leaving their muscles and vital organs on display in amazing detail. Medical horror movies seem hit a nerve, so to speak, as they prey on primal fears that everyone can relate to. All the way back to the original Frankenstein, medical horrors have been a staple of the genre. The environments are cold and sterile with lots of stainless steel instruments from scalpels, saws, and drills. Putting you life in the hands of a possibly insane stranger, is their anything else more scary? Yes there is being operated on while still awake! Ahhhhh! Paula is a bright med student who gets accepted to the prestigious Heidelberg Medical School who discovers the existence of a secret society. Heidelberg opens its new state of the art anatomy wing where the students have access to all the corpses they can handle. But when Paula recognizes a guy who ends up on her table she starts to investigate his death. She finds a mysterious tattoo on his ankle and a very unusual blood sample. It is found to have a sort of plastic polymer in it. Paula's investigations lead to a ancient secret society called the Anti-hippocratics. All doctors take a Hippocratic oath to help patients, but not this group. Their research is paramount as they use live people to practice on and learn from. Putting aside medical ethics for \"the greater good\".Although this movie is pretty dark and disturbing, their are several moments of dark humor that lighten the mood a bit. The effects used are pretty awesome and the highlight of the movie. It does however suffer from a poor script and doesn't hold up to a reality check. \"Anatomy\" is and intense and graphic ride that is worth at least one watch. The Body Worlds exhibits that continue to travel around the world did originate in Germany but thankfully use willing donors.","I had never seen Franka Potente before The Bourne identity, and I fell in love with her immediately. So far, I have only been able to get my hands on one film featuring her, and it's a real winner for those that like mystery/suspense with a little gruesomeness.No, it doesn't feature her bod, nor that of the incredibly beautiful German TV Star Anna Loos. Anna was hilarious with her \"naughty\" comments throughout. (As an aside, she is supposedly the lead singer of, or a member of a band called Leck mich am Arsch, which is also the name of a Mozart composition. You can have a lot of fun googling that bit of German.) She does do a song in the movie soundtrack.She is a doctor doing some research and stumbles on an old German medical society that does autopsies on people while they are still alive, using some sort of paralyzing drug. Lots of suspense as they discover she knows who they are and come after her - sort of like Extreme Measures.Also stars Benno Fürmann, who was in the superb Joyeux Noël, and who I am sure many will see in next year's Speed racer. Yes, it's not just Frake and Anna; there are plenty of German hunks for the ladies.","Anatomie isn't very unique in horror genre, in fact it isn't even scary at all. It reminds me of its American cousins, horror slashers. It's just a copy of any other horror slasher and as a German movie it's just too American with nothing to add to it.Actually Anatomie is too predictable and boring, its plot is not intact and consistent. It's got stupid scenes to it which don't even fit into a horror movie genre. Amusing sex scenes with pop music and topless women in underwear. Why do they need to have it all in just one movie? They should have made a cheap German adult movie instead.I can't recommend this movie to anyone because it's just too boring.","Paula Henning (Franka Potente) one of the top German medical students is accepted into the medical school at the beautiful Heidelberg University.As a grand-daughter of a former renowned medical scientist now retired she questions some of the unusual practices occurring at the Department of Anatomy. Working alone and often secretly at night, she takes specimens of human tissue from cadavers for microscopic examination.  What she finds astounds her and sets her on a path of further investigation.The screen play is designed to shock.  A dissection room is eerie enough but when dead bodies begin to twitch, beware...  Add to this unethical students using scalpels like lethal weapons and hyperdermic needles in reckless abandon.  Further there is much blood and even a decapitation.  This film is not for the faint-hearted.  The department has developed an astonishing plasticising method of preserving humans as life-like specimens.  These are shown in the film.  A spooky atmosphere is generated because much of the action takes place in the laboratories and shadowy corridors at night.Mention is made of some of the Nazi experiments on living human beings as if to justify the research work designed to help mankind. This adds even more horror.After the frantic chases around the corridors, one is left with a pounding heart.  And in the end one wonders what the people of Heidelberg think about their doctors in training - not a particularly reassuring thought. I wonder how many hospital appointments were cancelled after prospective patients saw this film.","There is an endless supply of trashy horror movies. It seems that people never get tired of trying to scare and thrill. Alas, very seldom these attempts succeed. This, unfortunate movie has almost no redeeming value. The story is highly predictable, most of the actors very uninspired, or just plainly miscast, special effects of very low quality. It took a lot of effort not to switch off the DVD and go to bed. With such a limited number of foreign movies issued in the USA, why in the world would anybody want to import this drivel. To top it all, apparently there is an \"Anatomy 2 \", for those who have nothing better to do. I'd rather watch the paint dry."],"review-user":["hippiedj","movieman_kev","slayrrr666","Libretio","trashgang","ElChivoDave","pmdawn","Coventry","preppy-3","dwpollar","leonardozeligbrazil","winstonsmith_84","mrush","Markmainwaring","VirginiaMovieMan","u23s","=G=","Hey_Sweden","Horst_In_Translation","MovieSonic","RockPortReview","lastliberal","ernesti","raymond-15","sergepesic"],"review-date":["3 October 2001","27 September 2005","13 April 2009","22 April 2005","27 June 2010","1 January 2003","22 June 2008","22 February 2004","11 July 2008","24 June 2007","24 August 2002","19 January 2002","26 June 2006","25 February 2006","20 February 2005","31 January 2002","5 April 2001","7 January 2017","27 June 2015","3 May 2015","6 April 2015","2 October 2007","2 June 2006","19 July 2004","13 July 2009"],"review-rating":["8","5","6","5","5","7","3","6","7","4","2","3","9","3","3","6","7","6","6","7","6","1","6","2"],"review-title":[" Intense, enjoyable thriller IF VIEWED IN ORIGINAL GERMAN LANGUAGE!\n"," it gets derailed on its way to the third act\n"," Disappointing, dull and completely overrated\n"," Gruesome shocker exploits audience's worst medical fears\n"," Kopferwelten alive\n"," An entertaining, but unfulfilling, German take on the Scream/'teenhorror' genre.\n"," A mess.\n"," German suspense beats American slashers!\n"," Bad dubbing hurts but I liked it\n"," OK thriller, but a little too predictable...\n"," Creeeepyy\n"," Foreign Film Feels American\n"," Not very good\n"," The German Scream\n"," I can't believe this movie was given such good reviews! It's horrible!\n"," Disappointing\n"," A cut above the average horror flick.\n"," Routine, but absorbing medical thriller.\n"," Honor thy father\n"," Competent mystery / gore\n"," Awesome German Horror!\n"," Leck mich am Arsch\n"," A very generic horror movie\n"," Overall a rather unpleasant offering.\n"," Trashy horror movie\n"]}