{"review-url":["http://www.imdb.com/title/tt0153866/reviews"],"review-text":["An example of genius filmaking. The epic story of three major stages of life for a young boy told with eloquence and raw fearlessness. Rarely does a film come along that causes me to out loud say during most of the viewing, \"this is a really good film....\" again and again. That is exactly what happened when I watched this film. I really do not understand how anyone could not like it. I found myself at moments crying and laughing at the very same moment, unable to control how I felt about the scene. The acting is outstanding. Eric Mabius- why is he not all over movie screens? He was really extraordinary. His seemingly effortless attempt on the screen impacted me in deep visceral ways. I thank him. In my opinion, Eric Schaeffer is one of the best filmakers around, and I hope he continues to rise to the challenges that he faces while trying to give us art in the face of ferocious commercial filmaking.","As i watched \"Wirey Spindell\" i couldnt but laugh at what was taking place on screen. Wirey sure got a lot of play from both boys and women but i was confused as to why the actor that played Wirey in H.S. was 10 years old. Then the actor changed age to like 20 to play Wirey when he was a senior in HS...but whatever, i thought it was funny.","I've been looking forward to watching \"Wirey Spindell\" since having happened across Schaffer's \"Fall\". Unfortunately, I found \"WS\" to be a wandering, unengaging, boring bunch of claptrap pieced together with, what apparently is Schaeffer's signature, a mix of story, narration, and poetry. The film recounts the sexual and other experiences of a Manhattan man about to be married through self-narrated flashbacks. Like beads on a string, Schaffer apparently has strung together every little sexual life experience, while neglecting to tend to the beauty of the necklace. The result is a disjointed rambling story about a boy growing up which fails to  engender empathy and leaves the viewer disconnected, unsatisfied, and with a bad after taste which taints the mechanical feel-good ending. A mediocre indie and a step backward for Schaeffer.","I, as many IMDB patrons seem to have, stumbled upon this little film when it appeared on the Canadian \"Showcase Network\".  I was, as many of you, also sucked in and watched the entire film.  I was hooked, at first, by the literate dialogue and wry sense of humour that the film is rich with.  I was coasting along comfortably on a sort of \"Kevin Smith meets Killer Films\" wave until half way through when the movie really buckled down and explored it's themes in more detail... with a decidedly darker and more poignant edge.  Far from being taken out of the experience, I was brought further in.  This is not the best film of it's kind and will certainly not have universal appeal... so I do understand some of the more negative reactions to it.  But I bought in... and enjoyed it immensely.  The \"flash back\" type movement in the chronology was effective, the characters were well-realized and the issues raised were human, accessible (to my experience anyway) and interesting.  I was quite impressed with the film's ability to remain sweet, funny and entertaining while not shying away from controversial subject matter and raw emotional language, dynamics and situations.  This movie is a great antidote to a lot of the schlock that has permeated the witty/clever romantic genre.  A kind of male Brigitte Jones for the literate sect.  Take 2 hours out of your busy schedule and jump into Wirey's world... or you could go rent \"You've Got Mail\", 'cause if that appeals to you, you won't like this anyway!  Those of us who did like it will be alright without you on our side...","I was surprised to read the comments of the person who so disliked this film.  It really is quite funny.  There are definitely a few laugh out lines that my boyfriend and I quote to each other.  Some of the situations might be unsettling (bisexuality, drugs, a particularly strange child's view of sexuality) but believable at the same time.  It's about communication and miscommunication between men and women.","I disagree with the imdb.com synopsis that this is about a bisexual guy preparing to get married.  It's more about all the crap we go through - self-induced and because of our parents - that we have to \"get over\" when we grow up.  Like the Linda McCarriston poem says, \"Childhood is the barrel they throw you over the falls in.\"  This movie is much more like a narrative poem.  It's about life and the mistakes we make and hurt we inflict and experience over the years, and how in the end, it's all about love (I'm not trying to be hyper-sensitive or schmoopy) and finding and being with one special person.","Wirey's journey through the final days of bachelorhood, liberally sprinkled with flashbacks to a sexually active and diverse childhood.It's definitely not a feel-good romance movie.  It is a romance movie, but one without illusions.  Everyone's an adult here, not your cup of tea if you want another Sleepless in Seattle or Notting Hill.","This is supposed to be the story of the life of a man named Wirey Spindell from age 8 through to 36 told in narrative by the character at each age point in his life. So for example, when he's eight, it's the eight year old's voice that is doing the narration; when he's in junior high, it's that one doing the narration, etc. That's about the only interesting thing about this movie. It looks like each actor playing Wirey is a separate character. Not only do they not look alike, their life experiences don't seem to match up.Avoid this movie like a bad cold.","I usually can tolerate twisted movies, but this one is really a sick obsessive self-absorbed movie!Firstly, the writer/director is totally a self-absorbed guy full of sick jokes that are not funny at all. Secondly, he is also a sick pervert who manipulates and poisons children's mind! I can't believe my ears when I heard the sick and perverted monologues spoken by the kids!I really feel sorry for Zane Adlum and Devon Matthews. They are both very talented, but fell prey to Eric Schaeffer's dirty little-known movie!And what the hell happened to Eric Mabius' good looking face? I mean, he met this girl that he's supposed to marry, but he wasn't in the wedding! In fact there is this bald guy in his place! Did time really fly that fast?Anyway, don't waste your time to see this movie, unless you want to be poisoned and manipulated by one sick Eric Schaeffer!","I saw this movie on a night i couldn't sleep, i loved it and searched to find out when it would be on again, probably the best movie i have ever seen, at the time, and even now the cast is full of people i had never seen before but it seems like a real life story based out of NYC, This is the kind of movie that elevates the viewing pleasure because you see it, hear it and feel it, from the moment i saw Wirey drinking a beer and watching the game i imagined what it must be like to grow up without a father, there are so many lines from this movie i use on a daily basis like \"the personal alone time\" in the bathroom drinking a 7-11 beverage, GREAT FILM","I like the earlier description of this movie as a life poem.  I caught this totally at random on the Movie Channel last night, and was captivated enough to stick with it the whole way.  There's really just a toally unique voice to the film, a poetry of narration that's meaningful without straying into pretension.  There's also many hilarious moments from Wirey's middle-school days that are crude without being potty humor.  It's sad that this movie is so low-rated.  The fact that there are so many 1's makes me think the numbers are cooked- I can't see how anyone could see the movie as that abysmal.  Sure, this is by no means a typical romantic comedy, but it is a very unique viewpoint of a very unique life, of a man whose very appeal comes from his detachment, a detachment he must overcome before it destroys him.  Give this flick a chance.  It came out of nowhere for me, and I feel the richer for it.","Seeing as how I am a big fan of both \"Fall\" and \"If Lucy Fell\", I came to \"Wirey Spindell\" with high expectations. I am not sure I could have been more disappointed. This had it all, weak dialogue, weak performances... you name it I was let down. Oh well, better luck next time Eric.","Though several scenes of Wirey Spindell can be described as \"over the top\". I thought that it was refreshing to see something that was willing to go to a level of near-taboo twisted comedy.Wirey Spindell is a great film with great dialog. I wouldn't say that this film is for everyone, but the film is on my top 10 list.If you can look beyond it's occasional offensiveness and watch it for the film that it is, I would hope you could see it in the same light that I do.","... as a child growing up in the flatlands, I went through a lot of the same things the main character in the movie went through. Oversexual elementary school friends, parents who should never have had children in the first place, getting beat up in school, doing tons of drugs as a release (and to gain popularity)... that is what childhood is like. It was very poignant for me. I think a lot of people on this board who gave this movie negative reviews would have you think that this movie was pure fiction. That the things you saw in this movie could never happen. Kids cursing. Oh my goodness. 10 year olds drinking in front of their parents. Couldn't happen, right? My mom used to *buy* my smokes for me when I was a kid. Anything to keep her son from being belligerent. Anyway, I'm way off topic. I enjoyed the movie very much and like its narrative style. I found the movie very real and believable. It's definitely worth a peek. A little self-indulgent, but give it 20 minutes and you won't tune away."],"review-user":["bwm26","ferrariguy15","=G=","Grosik_Stim","smercy_2000","sholm","subir1","bbbl67","Matt73","mao2000-2","*(CableGuy)*","kjdwords","cantthinkofanid","bones_boy"],"review-date":["18 September 2002","26 June 2002","22 June 2002","9 May 2002","16 October 2002","27 December 2001","28 January 2001","13 February 2004","31 August 2002","5 July 2006","21 April 2002","2 August 2001","29 May 2003","12 June 2003"],"review-rating":["9","10","4","8","9","10","9","1","1","10","10","2","10"],"review-title":[" An exploration of three major parts of a man's life in an attempt to explain his fear of intimacy days before his marriage to a woman he knows he should and does love.\n"," interesting\n"," Disappointing\n"," Dialogue and risks set it apart\n"," sick and twisted but funny and real\n"," More like a life-poem than a movie\n"," Funny like nothing else.\n"," Horrible, completely disjointed\n"," One Sick Obsessive Self-Absorbed Movie\n"," great film\n"," Beautiful and underrated.\n"," It makes me quite sad...\n"," anyone who argues with this movie being distasteful has missed the point.\n"," I like this movie for more personal reasons...\n"]}