{"review-url":["http://www.imdb.com/title/tt0103882/reviews"],"review-text":["As a physicist, talk about blackholes and cosmology gets my heart racing. However I found this presentation too slow and not packed with enough information for the interested layman (who is most likely to see it). If you have more than a passing curiosity in this sort of stuff, go to the library and check out some books. You will find they explain current scientific cosmologies with far more detail while at the same time filling you with more of a sense of wonder than this movie does. Also to set the record straight: Hawking is NOT considered the \"greatest mind\" or the world's \"smartest person\" as commonly asserted even among the user reviews here at the IMDb. Hawking himself has commented that \"It is rubbish. It is just media hype. They needed somebody to fill the role model of disabled genius. At least I'm disabled.\" To be fair, he is probably a genius but among history's greatest scientists, people like Einstein, Newton, Gauss, and many others easily are even more highly regarded. This is not to disrespect Hawking who is a undoubtedly a great scientist but rather not to disrespect others who have done even more than he has. Anyhow, see the movie if you are truly into science. But if not, I think it would be boring for you.","Most of the movie is about Stephen Hawking's life rather than Stephen Hawking's ideas. It's more a biography than a document about the science behind time. For a title 'a brief history of time', it's rather talks about anything about time at all. The movie forget to add the subtitled in the book in which the movie based on. It should had the subtitled \"From the Big Bang to Black Holes\") added to it. A Brief History of Time was supposed to explain a range of subjects in cosmology, including the Big Bang, black holes and other super-string theory, to the non-specialist thinker, but the movie doesn't follow that. Although they share a title, the film is a biographical study of Hawking, and not a filmed version of the book. While the movie gives a great insight of the life of Hawking and how he end up in the wheelchair. The movie doesn't mix the story of his life with that of his research that well. The theories come out of nowhere like the Big Bang and leaves while we move back to the story of Hawking's personal life, then back to another theory and then back to the story. It doesn't seem intertwined. I would rather have the movie address the subject using examples of Hawking's life rather two different subjects trying to share screen time. While the choice of topics is well balanced and gives you an interesting introduction into the modern view of our universe. The movie is a bit outdated with its facts. In particular the introduction of sometimes contradictory models explains how physics works the evolution of ideas. Yes, since we live in a static, (which means a fixed or stationary), Multiverse. Space and Time are illusions, according to scientific principles. Each of our now's, are like a succession of snapshots, that we chose with our free will to form probabilities, to make our reality. According to Quantum Mechanics, nothing at the subatomic scale can really be said to exist until it is observed. Until then, particles occupy uncertain \"superposition\" states, in which they can have simultaneous \"up\" and \"down\" spins, or appear to be in different places at the same time. The mere act of observing somehow appears to \"nail down\" a particular state of reality. Because our concept of time means ever thing has to be moving in linear fashion, it is very difficult to fathom that time and space are illusions but since science proves that they are illusions, everything is static and eternal. Ultimately, this documentary postulates the theory that there must have been a beginning of time (and the universe), but then suggests that perhaps that the universe is indeed eternal in origin without a point of creation in some oval shaped model he showed, as opposed to the classic point model where the laws of time and modern science breakdown and the dawn of time. Watch Lawrence Krauss's lecture for a much more complete/contemporary cosmological painting. Still an interesting personal perspective of Hawkin's experience but the audio quality is terrible though. The other people sounds like they are speaking through a computer like Hawking. After a while, it's get really annoying. Still it was very interesting movie.","A very fine and intriguing documentary from Errol Morris about the life and work of physicist/celebrity Stephen Hawking, who revolutionized the way we think about the universe in his monumental book of the same name. The film is really divided into two stories, the life of Hawking as he struggles to overcome his paralysis, and the brilliant work he achieved in spite of his physical limitations. One gets the impression that had Hawking never became ill, he wouldn't have been as compelled to carry out the kind rigorous intellectual work that he of course did carry out, and (he himself notes that he was quite bored with life prior to his paralysis). Morris does a fine job with the material; the first half hour of the film suffers from a dry PBS feel, but the aesthetic and intellectual intensity takes off from there, the film never digresses into a mere sob story. Morris nearly always keeps the material more intellectually intriguing than it is uplifting and sentimental.","Courage can be described in many ways. This small documentary slowly presents a life story that shows how a person can incredibly overcome physical obstacles but also who without fear can go beyond the mental obstacle of facing any question about why we are here and where we are going.At first the style of the film seemed ordinary, typical short interviews. But the experience grows on you. Partly this is due to a haunting film score by Philip Glass but mostly because of the amazing life and ideas of Stephen Hawking. Step by step we are led up a ladder of more amazing concepts. At the same time we are always reminded of the physical struggle of this man, how he has more than endured but triumphed.","I was one of the few locals who had the opportunity to watch this on the big screen.  The film was pulled 3 days after its release, but I happened by chance to be visiting the strip mall where the theater was located on its last day.  I feel very lucky, although I wonder how a film of this nature ever made it to the big screen in the first place.I don't recall having heard of Hawking before this film, mainly because I was fresh out of high school and carefree at the time.  However, I am now well versed in many of his theories, and althought I disagree with many of his opinions, I still find him to be one of the most amazing individuals of our time.  Simply, his willpower is enough to put us all to shame, and his cosmic imagination is unfathomable.  A Brief History of Time should be required viewing for anyone with any interests outside of mundane popular culture.  I also recommend it if you are a writer, a thinker, or an admirer of cosmology.  Anyone can enjoy this film, and I hope that you enjoy it as much has I have.  We need more films like this at the theaters!  Please?","Along with Carl Sagan, we can credit Stephen Hawking with de-mystifying the Universe.  We've been fortunate to have two such men in our time with the gift of translating Physics into a format we don't need a degree to comprehend.You will find yourself in awe of Hawking's mind, and justifiably so.  It would be truly remarkable if we could find a way to venture into his brain and feel the pleasure he takes in what so many of us find abstract.The biography of this remarkable man is just as interesting as his research.  Told in documentary fashion through interviews with family and friends, we see his development from a precocious child to a mischievous youth to remarkable adult.   Also, we have the chance to meet Mr. Hawking himself,  who is very personable with quite a sense of humor.I strongly recommend reading the book A Brief History of Time to accompany the film...it picks up where the film leaves off regarding the sciences, and is less biographical, except for his brief summaries of such luminaries as Newton and Galileo.","A Brief History of Time is not only a documentary on the beginning and the ending of the universal and reality as we know it, this is a story about the man and the genius known as Stephen Hawking. It is his story that reflects the story of time and change throughout the history of the universal. The style of the documentary / editing style of the interviews begin and end with a quick fade to black. Almost like blinking in between segments and interviews, the documentary gives you an odd feeling like this is the view point of Stephen Hawking and not the eye of the camera. The running time is only a little longer than an hour. It is a short story, then again, its subject matter could be talked about for days and days. An interesting and proud story.","This is a really two documentaries: one about Stephen Hawking's intellectual evolution and one about his theories. Several people reminisce about Hawking as a child, student, and young scholar. I didn't give this film too many stars because I thought it withheld information from us when it really is all about providing information. One, because the people speaking are not identified until the very end in the credits. It would have helped to be able to know that one was the sister, one the friend, another the aunt, etc. Perhaps we are supposed to figure this out from context, but trying to decipher what they said AND sorting them into categories was hard to do because some clips were rather short. Two, the theoretical explanations were too short; please don't give us just teasers, but delve into the subject matter a bit more.","Documentary maker Errol Morris tackles nothing less than the origin and fate of the universe, placing the often mind-bending theories of the popular science guide alongside a portrait of the author himself, British cosmologist Stephen Hawking, who for many years has been confined to a wheelchair, unable to move or speak, while his mind has been ranging freely all over creation. Hawking (and his ideas) can't help but inspire a compelling film, but there's an uncomfortable sense of déjà vu because the style is identical to 'The Thin Blue Line', with the same Philip Glass music score, the same oddball graphic digressions, and the same clips from old Hollywood movies (in this case Disney's 'The Black Hole', with mad scientist Maximillian Schell). But unlike the previous film there isn't any sense of resolution, because the questions posed by Hawking (\"why do we remember the past, but not the future?\") will likely never be answered. Out of respect for the scientist Morris downplays the deadpan ridicule that made his earliest films so amusing, but there's no shortage of the trademark dry wit, much of it provided by Hawking himself, who narrates most of the film with his own computer generated voice.","Errol Morris's \"A Brief History of Time\" manages to be, in its succinct 80 minutes, a moving biopic and a thought-provoking documentary. Based on the best-selling book of the same name by British cosmologist Stephen Hawking (1942- ), it is accessible for those who are not science experts (without being condescending), yet still have an interest in questions about the origins of the universe and, therefore, ourselves (will time ever come to an end? which came first, the chicken or the egg?; and so on).Featuring interviews with the Hawkings (Isobel and Mary Hawkings, Stephen's mom and sister, respectively), Janet Humphrey (Stephen's aunt), several people related to the world of science (astrophysicists, professors, researchers, etc.), plus interviews and clips from lectures with Mr. Hawkings himself, we reflect on some of the most fundamental questions about our creation. The beyond reasonable, sensible and bright conclusions presented by this man whose body might be paralyzed, but whose mind is one of the greatest of all time (few would argue against this statement) make this film both a fascinating lecture (or, even better, meditation) and an inspirational life story. And with his fantastic reasoning and suavity, Hawkings ends up proving (as far as reasoning can prove, or define, the power of faith), the very existence of God. A great achievement of filmmaking, perception, philosophy, science, and perseverance. Bravo, Mr. Hawkings. Bravo, Mr. Errol Morris.","Based on Stephen Hawking's \"A Brief History of Time\", this amazing film by Eroll Morris documents the the life and work of one of the greatest minds in the history of astronomy. He has contributed more to Science, despite his debilitating disease, ALS, than an able bodied Scientist could only dream of.The film begins by telling of Hawking's childhood, and how he was a poor student that was recognizably bright. He slacked his way through college and university, where he was diagnosed with the disease that would take away normal functions of his body, but would allow him to continue living and thinking perfectly.Morris discusses how the brilliant mind of Stephen developed from childhood to the present, at one point his mother tells how- when she was pregnant- she prophetically bought a astronomical atlas to read while in the hospital. Hawking himself narrates the timeline of his discoveries, while Morris interviews close friends and colleagues whom have been lucky enough to befriend the magnificent man. He tells how he was first intrigued by the discovery that the Universe was expanding similar to how a star would expand. We also know that stars eventually die and become what is now known as \"black holes\", if this is the case,will the universe not too begin to contract, reversing itself until we reach the \"big crunch\"? as Hawking puts it. And when the universe does begin to recede, will time not \"reverse\"? When posed this question, I began to think that death may not be the end, perhaps one day time will go backwards, and our death will become our rebirth and our birth our death. The universe is one big cycle just like everything else in life. This is what Hawking is telling us, everything in the universe recycles itself. This is completely logical and can make your mind wonder in a million directions pondering it. This is why i love this film and why isay it is a MUST SEE!!! An 11 out of 10 ...Morris never ceases toamaze!","Stephen Hawkings is a genius. He is the king of geniuses. Watching this movie makes me feel dumb. But it's a great movie. Not highly entertaining, but very very intriguing. The movie centers around wheelchair bound Stephen Hawkings, a man who makes Einstein look average, and his theories and scientific discoveries about the universe, time, the galaxy, and black holes. Everyone at sometime or another during a really intense high comes to a moment when they think they'v got the universe and the cosmos figured out and they swear as soon as they sober up they'll write it all down. Well here is a man who actually held that feeling for more then six hours. Here is a man who despite suffering from Lou Gehrig's disease has become the greatest mind the world has yet seen. Watch this and listen in on how he has formulated theories on black holes. Awesome. You won't be the same after you see it.","I have been a huge Errol Morris fan ever since I saw Thin Blue Line and heard it saved a life. To date, this movie is his best piece of work.The plot is a mixing of Stephen Hawking's Book of the same title intertwined with the man's life. The story is told through interviews with family, friends, and Hawkings himself.Don't be fooled; It totally sounds boring but the whole package is dynamic and thought provoking. The blending of life and theories is seamless and thoroughly entertaining. I was particularly moved at how well they humanize this genius and omniscient man. Tho physically powerless, Hawking's greatness and shear brilliance is encapsulated into a real live human being that we are allowed to laugh at and aw over at the same time.Find this movie. Watch it and enjoy. And if the studio who owns this picture reads this, A 15 year Anniversary edition would be perfect NOW...","An introspective look at the relationship between Hawking and the space/time contingent.  This film expores the Gallilean and Newtonian laws and there relation to Einstein's Theory of General Relativity.The film is methodically directed, exposing details of the man (Hawking) as well as his work (Black Holes).  Interviews with his family are a little too long so sadly there is less development of his theories and ideas. \nA Philip Glass soundtrack superbly compliments the film.  Only one other man could compose such haunting instellar melodies (Jean Michel Jarre).Overall I would highly recommend this movie on the basis of Hawking's 'nuggets of wisdom' and his adequate explanation of an Event Horizon!","A brief history of time. The cosmological content of this documentary is fascinating, the thoughts provoking and the man... brilliant. Yet I had a hard time enjoying this documentary. The way the family members and professors are interviewed feels so unnatural. These members were interviewed on specifically built sets and were directed uncomfortably. Mostly, their accounts came across as very acted and forcefully directed. The (deliberate) non-inclusion of asked questions manipulates the given information into a very harsh and impersonal format. I do not know who are responsibly for the interviewing but they did a dreadful job and with that took away from the viewing experience.Overall still a fascinating documentary well worth seeing, if only for the interesting concepts presented.","I confess that I have never read the book of the same name by Stephen Hawking, and although I have a broad interest in questions about the origins of the universe, I lack the scientific background, knowledge and training to really be able to do more than scratch the surface of the subject. Having heard many people over the years speak highly of the book, I thought this movie might help me do more than scratch the surface - but it really didn't. In fact, the movie in many ways is less about science than it is about Stephen Hawking's life. It's a documentary style biography, as opposed to the dramatized biography presented in the 2014 movie \"The Theory Of Everything.\" And I have to say that the biography part of this is excellent. One does get a feel for Hawking's life from his childhood (really, from his birth) onward. I've always been something of a fan and admirer of Stephen Hwking -\n feelings that are enhanced today, quite honestly, by his willingness to make regular guest appearances on a TV show like \"The Big Bang Theory.\" Aside from his TV appearances and his scientific research, Hawking is probably best known for being afflicted with ALS (in every day terms, Lou Gehrig's Disease.) What we learn from this movie (at least it was speculated by his mother) is that it was his ALS diagnosis that really motivated him in his work. Before the disease, he was a very bright but often unmotivated young man. Perhaps it was the prospect of having a limited time to live that made him what he is today - at least, that seems to be what's suggested here. This is an interesting look at his life - even very inspiring. If Hawking could overcome the challenges he faced and become what he's become, how can I complain about my relatively minor inconveniences? So the bio part of this movie is well done.The scientific part of the movie I thought, though, was a little bit lacking, for two reasons - which are a little bit contradictory, I confess. First. a lot of what was offered was admittedly over my head. I could be impressed by Hawking's knowledge - but it's kind of like being impressed by anyone who says a lot about things you know little about. I have to accept that he's right, because I don't know enough to say he's wrong, or even to question his ideas - which, as one of the interviewees in the movie said, is the very heart of science. But I don't know enough to raise the questions. And yet, at the same time (and here's the contradictory part) while I may not have the knowledge to question what Hawking says or his theories, I also felt there was a little bit of a lack of depth to this. We hear a little bit about a lot of his theories - which is maybe all the average scientific lay person can even begin to process, but the lack of depth was still noticeable. He raises a lot of intriguing ideas - but they don't seem to come to any real definitive point. Perhaps that's appropriate, given his conclusions about the universe having no real singularity (and thus no real beginning) and the ongoing lack of the infamous \"theory of everything.\" I shouldn't be bothered by the lack of depth - because if this had been any deeper it would have been even more inaccessible to me - but somehow I was.Having said that, this was an interesting film. If I thought there might have been a lack of depth in the presentation of the science, the interviews that were at the heart of it (from family members, friends and colleagues) gave us real depth into Hawking the person. He's is an intriguing (even fascinating) man. I'm not onside with some of his conclusions. Admittedly (as I've confessed) my scientific knowledge about the origins of the universe is limited, but I still see nothing that was presented here (or that I've seen from Hawking since) that convinces me that there's no God. His research likely blows holes in some of the creation myths of various religions - but they are, of course, myths that seek to reveal truth rather than fact (and truth and fact are not identical - the former is philosophical, the latter is scientific.) Even one of his colleagues interviewed in the movie acknowledged that he personally believed that \"the universe\" has a \"purpose\" - which is a philosophical (and potentially even theological) statement. As a person of faith, I've always found that science (which I'm fascinated with) deepens faith rather than detracts from it.In any event, this movie was one that I found thought provoking. Perhaps not without its weaknesses - but definitely thought-provoking. (7/10)","This is a difficult film to rate, because the film is supposed to be based on the writings and research Hawking made available for the layman. But instead it goes off into Hawking's personal and professional life, while only superficially touching on the general concepts that Hawking has researched. The distillation of scientific information is a tricky process, and I don't envy the film makers for tackling this project, because it must have been a real challenge to formulate and codify in an emotional vein Hawking's writings.The film makers chose to portray the man in a hope of getting people to connect emotionally with his ideas, and in this way better understand what it is he discovered about the universe, and where such information might take us. I think this angle of attack partially successful, but perhaps lacking in the more mathematical underpinnings of Hawking's theories. But that's just the way things are. Unlike Sagan, whose purpose with his films was to explain how science itself works, and the history behind the molding of the scientific process, we have Hawking's theory on, essentially, everything. Why the universe seems to \"go\" in one direction in terms of what we call \"Time\", and why things don't operate differently. Such a topic requires more of a sharper focus on the math and how that math describes the physical world. That's a tall order, and it's one the film maker's adroitly side step in this piece.Still, I enjoyed the film for what it is, and I truly hope to own a copy on DVD someday. Until then I'll have to look to my old VHS for a night's entertainment on Hawking's theory of life, the universe... and EVERYTHING! (with a nod to Douglas Adams).Take if for what it is, an emotional retrospective on the genius that is Stephen Hawking.Enjoy. :-)","Subject Matter: Cosmology, Quantum Physics and Stephen HawkingSoundtrack: Phillip GlassHave I died and gone to Heaven? You will be enraptured.","I'm no physicist but I have read extensively about the subject matter in this documentary (which is surprisingly old). I did appreciate the commentary about Hawking and his life. What was lacking for me was more of the science, even in layman's terms. We would get an idea and then cut to someone who knew him as a youth, talking about his potential. I would love to have seen a couple scientists discuss further a few of the theories. Nevertheless, this man couldn't be more heroic. Imagine what he could have chosen as his path after suffering from this horrible disease.","The juxtaposition of Hawking's physical deterioration & his growing intellect is what makes him such a captivating figure. This is curiously beautiful documentary uses tiny cinematography choices, subtle movements, & unique angles to capture how Hawking saw time & space: with curiosity & beauty. Yes, it's a bit dry, but not nearly as dry as it could've been thanks to some stellar direction & editing. The way he describes the experience of death by black hole makes me wish that is the way he could've gone. RIP.","Which came first? The chicken or the egg? Stephen Hawking is an astrophysicist and quantum mechanic and has contributed numerous works now seminal to theories on the origins of the universe. He is widely regarded a genius; he considers this to be balderdash. Hawking himself has said, \"They needed somebody to fill the role model of disabled genius. At least I'm disabled.\" I hope this film didn't leave any hardcore physicist type behinds when it actually presented the story of Hawking as a person and not an educational lecture on the specifics of quantum mechanics; of course this was never the goal of the film. It's about Hawking. Not QM. The film is not a technical masterpiece: basic documentary techniques are used. Few to no frills. Talking heads, basic photograph slideshows, b-roll, and a tiny, tiny handful of mood shots. The filmmakers have called attention to the edits on the interviews by leaving a split second of blackspace between the cuts. I consider this a sign of respect to the audience's intelligence. (That comment might not make much sense unless you've cut interviews). The Philip Glass soundtrack is beautiful and perfect. It is, if anything, too minimal... but layering drama strings over the telling of these stories too much would probably be trite. It's not outside the realm of possibility, in my mind, that more soundtracking of the interviews might have been attempted and it was decided that it was cheapening the film. I kind of suspect--and this is completely reckless, baseless speculation; I could be completely wrong on this--his real question is not \"how\" or \"when\" did the universe begin... but \"WHY\" did the universe begin--that is, if it \"began\" at all. I might regret going out on that limb and have to retract the statement, but it's just this feeling I'm starting to get having familiarized myself with his works and now, thanks to this film, a glimpse of who he is as a person. To me, Hawking's true genius lies mostly in his ability to give the ideas of quantum mechanics to everyone. This film is amazing and uplifting, and Hawking is triumphant on many levels.","Sadly I only found this excellent film when transferring a well used VHS copy to DVD for another university lecturer who uses it in her classes - it's tragic that it's only currently available in PAL format abroad, since this well packed 80 minutes is one of the best layman's summations of Hawking's theories (more thoroughly and eminently \"readably\" gone into in Hawking's book of the same name) together with as nice a companion biography of the man that I can imagine. By leading us through the chronology and the process Hawking went through in arriving at his conclusions, we not only find them but the admirable man himself and the family which he came from far more comprehensible.This should be aired at least once a year on cable channels as an example - along side Ken Burns admirable work with figures of the past - of how enthralling a documentary on a living subject can be, and be available on a reissued DVD for every college library in the country. Why only 9 our of 10? I wish the film itself were longer and the \"Woody Allenish\" type on the year cards which index the milestones in Hawking's life and thought were a bit bigger - but these are mere quibbles. The film is both emotionally warm and intellectually wonderful. See it if you can.","A film about the life and work of the cosmologist, Stephen Hawking, who despite his near total paralysis, is one of the great minds of all time.Errol Morris never fails to find the best subjects and turn his camera on the right people. I love that he was able to find someone who said that Hawking had come from a \"very eccentric\" but \"highly intelligent\" family, with Stephen actually the most normal. Who would believe that? Thanks to Criterion, the film is now (2014) available on Blu-Ray, and just as important as ever. Hawking is still alive (defying the odds) and his theories are coming under attack from the next generation. Can he hold on to his legendary status?","Stephen Hawking has one of the greatest minds, or if that's too simplistic to coin for him one of the most curious and daring, that also happens to be trapped in a body crippled by a disease that leaves him in a wheelchair and a computer to communicate. Perhaps I didn't know enough about Hawking going in (I always knew him as 'that guy speaking like a computer who knows a lot about like, the universe and stuff, you know') that he is British, that he was a rather normal kid, and, perhaps most remarkably, the disease that could have possibly left him dead at 21 put him in the position of putting his life in focus.According to Errol Morris's equally curious and coolly, visually dazzling portrait in A Brief History of Time, Hawking was already brilliant, in spurts (when other Oxford students were faced with daunting algebraic equations, he answered more than three times the amount in an hour's time), but when faced with challenges, mostly from other theories by other scientists, he bounced back with his own. Beneath some of the complex scientific talk- and if you got any less than a B- in astronomy, like me, you'll need to keep your ears especially perked up in explanations of time's possible infinity or the peculiarities of the black hole- there's a human being who just wants to enjoy his goose on his birthday.Morris captures Hawking just right for those who can't get enough of his theories on how particles may be going in and out of a black hole, or if there is even a creator or not depending on how much one takes into account Einstein and time. But he also captures the back-story on the man and his condition, which creates this as something much more interesting than if Morris had done one or the other. Too much talk about the cosmos would make one's head hurt, and too much about his personal life and one might wonder what all the fuss is about this bloke who's book of the film's title was on bestseller lists for over five years.Almost in spite of his appearance, Hawking defines what it is to be a conscious entity in a universe which, he observes, he won't be apart of if and when the universe goes kaput another 10 billion years from now. Through it all, in A Brief History of Time, we get a glimpse of a genius and his humility (not to mention his colleagues and family's' ten cents here and there) through an unfathomably hypothetical and mathematical thought process of the universe."],"review-user":["MyOpinionIsFact","ironhorse_iv","rbloom333","BB-15","dubnut","Cari-8","caspian1978","brigitte-johnson","mjneu59","Benedict_Cumberbatch","meddlecore","PIST-OFF","thegoodness","ThePrinceofPeas","JustinHook","sddavis63","Blueghost","Zorro-3","Hitchcoc","matthewssilverhammer","thor-teague","eschetic-2","gavin6942","MisterWhiplash"],"review-date":["20 July 1999","31 October 2012","29 November 2008","27 June 1999","12 August 2000","19 August 1999","20 April 2005","28 August 2016","8 November 2010","5 October 2010","19 July 2005","11 May 1999","14 May 2006","22 May 2000","2 December 2009","29 December 2017","1 June 2010","14 August 2000","12 October 2018","21 April 2018","5 October 2016","14 October 2012","19 April 2014","17 March 2008"],"review-rating":["4","6","6","8","7","6","10","9","10","10","7","7","9","8","8","9","8","9"],"review-title":[" Could have been much better.\n"," The life story of the man in the chair\n"," Interesting Look\n"," Pondering the Big Questions\n"," Stunning, moving, and ultimately unique\n"," Also a Brief History of Stephen Hawking...\n"," 2 Stories in 1\n"," Interesting for young teens and older\n"," life, the universe, and everything\n"," It is a fascinating time\n"," Outstanding and Thoughtprovoking...A Must See!!\n"," Guy In Wheelchair Figures Out Universe!\n"," Waiting for the DVD\n"," Quantum Mechanflicks\n"," Good information, bad presentation\n"," Part Biography - Part Science\n"," Good personal look at Hawking.\n"," Heaven\n"," Good, But!\n"," Curious and Beautiful\n"," Educational, dignified, human, touching, mind-expanding\n"," Superb companion to Hawking's book for anyone who wants a sampling of relatively recent thought and those behind it\n"," A Look at the Greatest Mind Since Einstein...\n"," An attempt to (somewhat) humanize time, space, and the universe\n"]}