{"review-url":["http://www.imdb.com/title/tt0166252/reviews"],"review-text":["Wow!  I'm surprised to see so many negative and lukewarm opinions on this movie, which I had never heard of (apparently it was not highly promoted by the studio) but which I luckily stumbled upon on an international flight.  I so thoroughly enjoyed it that now I'm interested in more by director Peter Chan and screenwriter Maria Maggenti.  I did not know there was a book, either, but I've made a note of it for future reading, too.I admit I feel a bit defensive now, in the face of the other comments here on IMDB.  So, what did I like and why did I like it?  First of all, unlike some other viewers, I thought the movie WAS very funny.  It takes sort of a Steve-Martinesque view of the tender absurdity of humans and their feelings about each other (OK, OK, I just saw a stage production of Picasso at the Lapin Agile, and the tone reminded me somewhat of this).  Although there is physical humor, too, what I liked most were light touches, like how Ellen DeGeneres' character instantly, wordlessly went back to working for her boss (played by Kate Capshaw) as soon as she got the apology she felt she deserved -- after insisting with great finality that it was all over.I also felt this film was a celebration of the beautiful but almost lunatic breadth and diversity of the kinds of feelings we group together under the heading of \"love\":  everything from young (and older) wide-eyed lust, to slow steady enduring commitment.  As well as friendships, coworker relationships like the one just mentioned, family bonds . . . the list goes on.Most of all, I guess I appreciated the fond, loving tone of the movie.  The artists seem really to like, and love, people.  Yes, there ARE quite a few characters, and they're all different ages and different sexes, they're about different trials and tribulations, but they're all treated with light-hearted love and respect, for the sometimes silly but vulnerable beings we all are.So, if YOU like people, I think you'd like this movie.","'The Love Letter' is quite a gentle breezy sort of romantic comedy- drama. It's about opportunities that are missed because people aren't more forward about their feelings. The humour isn't wacky like in most American films. Assuming the director's seat, Chan does quite a good job of portraying the small dockside town and introducing its quirky characters. The story interestingly intertwines the lives of the characters through a love letter. The dialogues are pleasant and the acting is quite good. Kate Capshaw does a good job of carrying the film and maintains a good chemistry with her co-stars. Tom Everett Scott fits the part.It was odd to see Danner play Capshaw's mother because the age difference did not seem believable enough. Tom Selleck was alright. Ellen Degeneres and Geraldine McEwan are scene stealers. In addition, I was amazed by the whimsical soundtrack that flows beautifully with the film, pumping some energy into it and would work well as a standalone score. IU felt the film would have benefited more had their been more comedic situations. At times it gets too serious and that needed to be toned down a little. I liked how it ended without showing the two lovers kissing (as has been evident in x number of rom-coms) but instead suggesting a promising future for them together. 'The Love Letter' was a pleasant watch, a kind of slice of life film.","An exceptionally well-done film.  Not Hollywood-ish, thus some mixed reviews.  But I've viewed this 4 or 5 times, and love it.  The editing and pacing are unusually synced to produce the feel of a special film. the music is a big plus.  This is a gem to recommend to people who love good film, not those who want yet another blockbuster.  Allow yourself the time and focus to move to the same pace, and you'll be rewarded. And the fact that the locus is a bookshop, the home of books which are similarly low-tech and rewarding is a fine match","Kate Capshaw stars in this charming story of a divorced book store owner who finds a love letter between the cushions of her couch. Who is it from? Therein lies the tale. Working for her in the book store are a handsome college student (Tom Everett Scott), a feisty store manager (Ellen DeGeneres), and a sweet young teenager (Juliane Nicholson). Waiting in the wings is Tom Selleck, the town fireman, who has held a torch for Capshaw all his life. These are all pleasant folks to spend a couple of hours with. The town is picturesque and the background score is romantic (by Luis Bacalov, composer of Il Postino). It's interesting to note that everyone does not end up with whom you expect. Supporting roles are ably, though too briefly, handled by Blythe Danner and Gloria Stewart (Titanic). Director, Peter Chan, who has been involved in the Hong Kong film world, has done surprisingly well with this material which is so American. I'm sure we'll be hearing from him again.","This is not typical Hollywood cookie cutter love story.  The tone and style reek of French cinema (although it doesn't seem to be a remake).  There are some lovely performances, and exquisite scenes.  I found myself smiling a lot throughout this movie, and will look out for more of the directors work. Plus anything that gives Geraldine McEwan work is to be supported.","This film shows up on the premium cable channels quite often and, I find that I keep watching it over and over again. The performances are wonderful, and the material has so much happening that there is always something new to take away from the film.Maybe I am too often distracted when watching films at home, you know the drill, the dogs bark, the phone rings, the popcorn finishes during the credits. But this film is about people and what motivates us, what enlivens us, what causes rifts between us, and what inspires us.For me, it is films like The Love Letter that keep me taking a chance on new films. Frankly, I am surprised that the film is not better known. I would love to see Blythe Danner and Geraldine McEwan in many more roles. They are a delight to watch. Kate Capshaw is wonderful and I had no previous idea that she would be. Ellen DeGeneres plays a role that is much more complex than simply being the comic relief.This film provides interesting visuals as a proper background to the characters and their interactions. I find it refreshing every time I take the time to watch it.","We avoided watching this movie when it was released commercially, even though we had read Cathleen Schine's novel in which this movie is based on. Director Peter Chan's take on the story looks good on the screen; what with the picturesque setting of Rockford, Ma., as the background and all the cute houses where the story takes place. The result is a film that is easy on the eye, but alas, like eating a Chinese dinner, it leaves us hungry for more.Helen, the owner of a book store, finds a letter between the cushions of the couch of the shop. She reads it, and it sounds intriguing, because the writer goes to express how deeply he feels for the person the letter has been sent to. Since it has no name, Helen assumes it has been intended for her alone. She believes Johnny, the young assistant, has sent it to her. The young man, who likes the older Helen, is only too happy to tell her how he feels about her.Basically, \"The Love Letter\" is a story about missed opportunities. Helen who was in love with George, the local chief firefighter, married someone else, but her marriage failed. George also is getting a divorce. George confesses he had gone away to New York when he was younger to get away from Helen and his life in town and he had also sent her a postcard from New York, which Helen had kept, but had not read the message inserted within the card. It's at this moment when Helen comes to her senses when she realizes her affair with Johnny is only a summer fling.The film will be liked by the audience for which it was targeted. Kate Capshaw, who produced the movie, is fine as Helen. Tom Everett Scott plays Johnny. Blythe Danner, Geraldine McEwen, Julianne Nicholson, Tom Selleck, Ellen DeGeneres, and the rest of the cast do good work also.The film has an ironic twist at the end when the real recipient of this letter is revealed.","Aside from the fact that this movie was filmed mostly in Rockport MA, which is a beautiful town where my mother once rented a small storefront and I spent many a pleasant summer as a child, it is fun and cute little film. \nI must admit that I had no desire to actually see this movie even though I have a weakspot for romantic comedies (I don't know why).  The trailers I saw were not appealing, the cast did not look that interesting and I had no idea what the plot would be about.  In the end I found it to be an interesting meditation on relationships and family.  I thoroughly enjoyed myself and must admit that I thought that this film was one of the most overlooked gems of last year.  I am disappointed that so few people seemed to have enjoyed the very \"human-ness\" that this movie presented the viewer with.I have read many bad reviews of this film, and must admit a certain level of shock at the cynicism that is prevalent in them.  As a grad student I consider myself to be quite cynical, but this was a beautiful little film that deserves much better than it got.","This film was panned by critics, all of whom were male.This is a wonderful little film with fun, funny and realistic characters, and an interesting, romantic story that will touch the inner romantic in all of us.  It's not laugh-out-loud funny, but it is pleasant to watch these characters interact and is very fun to watch.And for the guys, Kate Capshaw isn't bad to look at, either.","One of the greatest and most wonderful surprises of 1999, \"The Love Letter\" is a sparkling little film. Held back by a remarkably asinine trailer--which manages to combine the three or four dull, brief moments in the movie--the picture is a warm-hearted, eminently watchable tale. I had assiduously avoided the flick because of that very trailer, but ended up having to watch \"The Love Letter\" on an 11 hour flight from Seoul to Vancouver. I could easily have watched it three times--it's that much fun.Kate Capshaw is bent and broken-down but somehow manages to be both incredibly lovable and believable. Tom Everett Scott is absolutely priceless in his role as a confused young hunk. but any damage they may have done to the overall film is negated by the superb performances of Scott and Capshaw. Sure, it's not worthy of an Oscar. But neither was \"Shakespeare in Love\", and look what happened there.","I normally don't like romantic films, but I love this film very much. The story is really touching, and the ending is very appropriate. I feel I really care for many characters in this film. I feel I can feel their feelings. While most romantic films always make me feel detached and bored, this one completely makes me feel involved, starting from the scene of Capshaw running along the beach with Scott until the ending scene. I want to rate this film 11 out of 10, because I want to give an extra one point for the ending.      The acting part is very strong. Kate Capshaw has a good opportunity to show her talent. Though I'm not impressed with Scott in `Dead Man on Campus,' this film completely changes my viewpoint towards him. He's so irresistibly charming here. Geraldine McEwan is as terrific as ever.     This film might not be as good, complex, deep, or believable as other films which deal a little bit with the same kind of relationship, such as `L'ecole de la chair' or 'Post coitum, animal triste,' but `The Love Letter' can still be proud of itself as it casts a rare different light on that kind of relationship. And that difference makes this film eminently enjoyable. By being unambitious and relying on great charms of small stars, Dreamworks, this time you really make my dream come true.","Helen (Kate Capshaw) owns a bookstore in the sleepy, coastal town of Loblolly by the Sea. Divorced, Helen has a young daughter who is going to camp for the summer, giving mother a bit more freedom. Working at Helen's store are the manager, Janet (Ellen DeGeneres), a man-crazy village-gossip girl who has eyes for the handsome fireman, George (Tom Selleck), and two young college students, Jennifer (Julianne Nicholson) and Johnny (Tom Everett Scott). One day, Helen stumbles across a romantic, tender love letter and she suspects that Johnny has written it for her. Throwing caution to the wind, Helen and Johnny begin a small-time \"thing\". But, the letter subsequently lands in others' hands, including Janet's, who thinks George has sent it to her, and Johnny's, who imagines Helen has penned it for him. And, on and on the letter goes. But, in truth, George possibly has eyes for Helen and Jennifer has fallen hard for Johnny. The town's museum curator, too, may have a secret love. Will tangled affairs like these ever straighten themselves out? This is a cute movie with a gorgeous setting and capable stars. Each of the main actors gives a pleasing performance, including the addition of Blythe Danner and Gloria Stuart to those mentioned previously. Then, too, the coastal scenery is most lovely, the costumes quite well-chosen, and the photography very nice indeed. There are a few surprises, including a subtle gay plot development, which may not please all viewers. But, for those who love romantic comedies, this one should be included on any list of good choices for the genre.","I'm a large scarred heterosexual male ex-bouncer, ex-rugby player, and ex-boxer, and I love this movie.It's no \"Mystic River.\" It's a piece of fluff. But there is room in life for fluff, and when that fluff is engagingly shot, well-acted by attractive, likable people, cleverly plotted and full of good dialogue, there's even more room for it.I'm not the biggest Tom Selleck fan. But he's good in this. So are Julianne Nicholson (love her bald head and freckles), Ellen Degeneres, Kate Capshaw and even Tom Everett Scott (That Thing You Do!).The scenery is nice, the mood is upbeat, there's heartache and wistfulness and farce and even a little redemption.Any (male) reviewer who disses this movie is, shall we say, not perfectly confident in his masculinity. In the meantime I'll continue to catch bits and pieces of it without apology whenever it shows up on cable.","The Love Letter (1999): Starring Kate Capshaw, Tom Everett Scott, Tom Selleck, Ellen De Generes, Gloria Stuart, Blythe Danner, Jessica Capshaw, Alice Drummond, Bill Buell, Erik Jensen, Margaret Ann Brady, Walter Covell, Patrick Donnelly, Lucas Hall, Christian Harmony, Christopher Nee, Breanne Smith, Marilyn Rockafellow, Sasha Spielberg, Jack Black.....Director Peter Chan, Screenplay Maria Maggenti.Based on the novel \"The Love Letter\" by Cathleen Schine, Director Peter Chan's film version, released in 1999, was not a big box-office draw, not even for a romantic movie with some comedy elements. While it was not as popular in theaters, it soon became a beloved film on cable television and on VHS/DVD. Set in a seaport town in the good old USA (I forget the exact location), this is the story of a mysterious, passionately written love letter who sparks emotions and confusion among the principal characters, each who think the letter is personally addressed to them. By the end of the film, we don't know who the lover or the beloved is but the power of the letter has altered the lives of nearly everyone in the small town. The cast is made up of wonderful actors who have fared well on TV and film, among them Kate Capshaw in the lead role of middle-aged beauty Helen, a bookstore owner, comedienne Ellen DeGeneres as her friend/employee Janet Hall, young hottie Tom Everett Scott as Johnny, the young 20 something guy who falls for the older Hellen and an older Tom Selleck as the firefighter George Matthias who must compete with Johnny for Helen's affections. There are cameo roles by veteran old Hollywood actress Gloria Stuart, who is best known to modern audiences as the elderly Rose in \"Titanic\" (1997) and a cameo by Kate Capshaw's own daughter (with husband Steven Spielberg) Jessica Capshaw. The love triangle is between a middle-aged woman, an older man and a young man, each of whom feel as passionately for Helen as the writer of the mysterious letter. The conflict lies in Helen's indecision. Will she choose the right person ? Which man has the most to offer her ? Johnny is in a relationship with a girl his age who loves him with a passion all her own, and is in fact, a kind of reminder of what Helen was like at her age. George is in the process of divorcing his wife and has lived a worldly and eventful life. A cultured intellectual, he takes Helen on an opera date, where the tragic death of Puccini's ultra-Italian heroine Tosca moves Helen to explosive tears. There are lots of beautiful vistas of the charming coastal town, rendered beautifully by cinematographer Tami Reiker. The score is a paradise of romantic and lovely songs - \" I've Never Been In Love Before\", \"I'm In The Mood For Love\" and \"Only The Lonely\". Ellen DeGeneres as Janet Hall, who is consistently late to her job at Helen's bookshop, who endlessly dates men without being able to find the right guy , is simply wonderful. She has not lost her comedic flair, even though at this point in her career she was not appearing much on TV or film because only about two years before her hit mid-90's TV show \"Ellen\" was cancelled because of her \"coming out\" as a lesbian and the new lesbian subject matter of the show. Here you even find comedian Jack Black, long before he made it big, in the bit part of a fisherman. This is a moving film about human emotions and making decisions that are significant, about the human need for a passionate consuming love and the general love of escapism brought not only through books, letters, and music, but through a genuinely loving and secure relationship. This is a great film with wonderful moments and an infectious romantic spirit.","This is definitely a girl movie.  My husband found it utterly boring, but I think this is a really sweet movie.  It's amazing to think that just a note can bring so many people together.  This is a great get-away for anyone who loves a cute, funny romance!","\"The Love Letter\" was visually pleasing: All the main characters were attractive; the setting was beautiful--the water, boats, birds, narrow streets and old houses; and the book store had an appealing clutter. The movie was sweet and funny. The letter itself was like a main character. The romantic relationship between Helen and Johnny is easy to imagine for no other reason than that they appealed to each other. Add to that the letter's imagery, and the romance becomes even more compelling, more credible. The movie's flavor and texture were consistant--a fine piece of work and a pleasure to watch.","The Love Letter is not a wacky comedy but a romantic comedy regarding imaginations and assumptions.  Beautifully put together with some good performances, romantic, thoughtful and containing subtle humour.  I recommend this movie whole heartedly to anyone with a little soul.","This is one of the better feel-good films of 1999 with Kate Capshaw leading an all-star cast about a small town and a love letter.  First off, the scenery is beautiful, and anyone who sees this film and doesn't want to move to this location is crazy!  For the cast, Capshaw is stunning as the lead actress who captivates the emotional roller-coaster role.  Tom Everett Scott is charming as the \"author\" of the note throughout the film, and the always delightful Ellen Degeneres is hilarious!  Blythe Danner and the actress who plays the bookstore saleswoman are both terrific, too.  Although it was unsuccessful, the film is great as it is both short and sweet and well as very romantic.  10/10","So well done. The photography, sound, music and the performances were the best. It's also an amusing story line that brings a smile to your face with each scene--I loved it and I'm a 60 year old heterosexual guy. Each character seemed to fit their part to a tee. It's the best performance that I've seen from Ms. Capshaw--she's been in more movies than I thought, but this was a wonderful achievement. I suppose it's a plus to have Spielberg money behind you allowing for a fat budget and all the best that money can buy technically. Two of the cast have successful T.V. shows of their own now--it's easy to see why. Tom Selleck does his usual good job.","Although it's definitely an enjoyable way to spend a couple of hours and it's always worth a watch, this film never quite meets the targets that it should for two reasons. Firstly, after the first forty-five minutes or so it focuses heavily on Helen and Johnny, who are far less interesting characters than most of the others - Janet, Jennifer, George and Miss Scattergoods are all much more enticing. Although at first this works, since in life we don't always know everything about everyone else, and because the point is being made that perhaps Helen is slightly self-involved, it quickly wears thin and we want to see more of the other characters.Secondly, the film seems to lose its way in terms of plot in the second half. The letter itself holds far less significance than it does in the first half and, again, although this works well in some ways, it seems odd to leave so much of the potential displayed in the first half behind.Overall, this film is sweet and good-natured, with some genuinely hilarious moments - for example, Janet explaining condiments to an avid audience. The lazy but quietly desperate atmosphere that Helen feels is heavy and the sense of living in a small seaside town is accurately portrayed, but the film isn't quite as intelligent as it's trying to be. It just misses being both a light romantic comedy and being a clever portrait of life. However, it's still good and if you get the chance, it's definitely worth seeing.","The Love Letter (1999): Dir: Peter Ho-Sun Chan / Cast: Kate Capshaw, Ellen DeGeneres, Tom Selleck, Tom Everett Scott, Gloria Stuart: Intriguing romantic comedy about misinterpretations in romance. Title represents expression in a muddled and confused manner. Nobody knows who wrote it but when Kate Capshaw discovers an anonymous love letter she begins to hear every word in everyday conversation. She works in a bookstore with Ellen DeGeneres and are frequently visited by Tom Selleck who plays a fire fighter once involved romantically with her. She regrets a past mistakes involving a post card and hopes to correct the mistake upon his upcoming divorce. Tom Everett Scott plays a student who works at the bookstore and hopes to go to college but upon discovering the letter he believes Capshaw wrote it to him. Clever although not satisfying in its conclusion. Director Peter Ho-Sun Chan does well with presenting the true author. Capshaw brings one of her best performances while DeGeneres delivers on comic relief as well as the best lines. Selleck is charming, and Scott pulls off a humorous performance as he embarks upon blind romance. Gloria Stuart makes her post Titanic appearance to offer that last minute presentation of love and endurance. Superb film that echoes lost opportunities and how one simple love letter can cause so much trouble. Score: 8 / 10","My girlfriend sneaked this on when I put the kettle in and tricked me into watching it. I am glad she did.This is a well made, tender, lovely story about a small community in 'no-where' USA.The lead is outstanding (she seemed familiar but took me ages to place her - she was Willie In Temple of Doom) The story is quite abstract and floats gently around the characters rather than pulling them along. Everything about this movie is understated and tender. I found the characters captivating and as seemingly trivial events (in movie terms) affect their lives we shared their emotions.I think the problem some people may have with this film is it is EXCEEDINGLY gentle, even for a chick-flick. There is no action, high drama or big revelations. If you get bored or fidgety easily or are not in the right mind-set you may wish to save this for another day.","\"The Love Letter\" is a somewhat pleasant, very very low-key romantic comedy in which the use of just the right few words in a mysterious love letter unlocks the secret passions and longings of a sleepy sea-side town's inhabitants.It's not for all audiences.  \"The Love Letter\", I feel, benefits from it's simple and quiet tone.  Never intentionally wacky and phony like most romantic comedies it's quaint, picturesque, and comfy.  However, for these exact same reasons, many viewers will be bored and disinterested.The cast is nice.  It's great to see Tom Selleck again, and is such an underplayed role.  And it's hard to believe this is the same Kate Capshaw we met 15 years ago in \"Indiana Jones and the Temple Of Doom\".  She's quite naturally good here; improving in every role I've seen her in since grating on Indy's nerves.  And is it possible Capshaw is just getting lovelier and lovelier with age ? ( What is it about that Spielberg!?)It doesn't amount to much; but after another noisy summer movie season I'll probably look back with brief fondness for this light-as-a-feather romance.","The best character in the movie is played by Ellen DeGeneres.  It's a blend of her usual smart-ass delivery and some real pathos in her conflict with the Kate Capshaw character.  I don't want to reveal any key plot points, since this is the first weekend of it's release.  So I'll just say it's a fun movie, bring a date.","I thought that the love letter was a pretty good movie. There were certain things that could have made it better. But Kate Capshaw is absolutely beautiful, and she showed it in this movie. I wish that there could have been a few more revealing scenes of her, but it was still a very good movie. It was very fun to watch!"],"review-user":["David Webber","Chrysanthepop","booknman","cinemel","srmobile","nathomsen","jotix100","A-Ron-2","Quicksand","Criz","sleepsev","inkblot11","Marrenp","FloatingOpera7","patsworth","pauldoster","viv.ferguson","simon24tb","mtatom","hjaggs","anaconda-40658","thekarmicnomad","DocHobbs","Charlie Goose","bp134ever"],"review-date":["30 October 1999","29 January 2009","1 April 2001","1 June 1999","27 August 2002","23 October 2006","6 July 2006","11 February 2000","1 June 1999","26 October 1999","26 March 2001","12 December 2007","30 November 2006","15 September 2006","8 August 2003","24 November 2001","16 July 2001","2 June 2001","15 July 2006","28 May 2008","16 June 2015","1 October 2013","27 May 1999","22 May 1999","15 April 2001"],"review-rating":["9","6","7","10","7","10","10","7","10","10","7","8","8","7","8"],"review-title":[" An appreciation of the (often funny) kinds of feelings we have for one another\n"," A Web Of Missed Opportunities And Mixed Feelings...Because Of A Letter\n"," A gentle gem to recommend to people who love good film.\n"," Pleasant romance\n"," A nice attempt at a French movie\n"," This film refreshes and enlivens\n"," Sincerely yours,\n"," I am surprised this many people have actually seen this film\n"," Great Summer-y Movie\n"," An Absolute Treasure\n"," my most favourite Dreamworks' film so far\n"," Let us be clear, The Love Letter is a delightful film\n"," Dammit, I enjoy this picture\n"," The Love Letter That Rocked A Town\n"," A really cute chick flick\n"," one of my favorite movies\n"," A Pure Delight\n"," Wonderful Feel-Good Film\n"," Top quality production with excellent performances all around.\n"," A good film that's nearly great\n"," Open It Up.\n"," Sailing crystal calm waters with the tiniest of ripples\n"," low-key romantic comedy (heavy on the romance, not the comedy)\n"," Cute, no real substance\n"," Comments about the Love Letter\n"]}