{"review-url":["http://www.imdb.com/title/tt0163025/reviews"],"review-text":["This film get so much crap and hate this one and Jurassic World: Fallen Kingdom get's so much hate and crap for it. I was one of the people hating this film and I didn't care for. But this movie grew on me more than The Lost World: Jurassic Park it is an action film. It is a rescue mission people are been eaten. This is my third favorite film in the Jurassic Park franchise because it is only 1 hrs 20 minutes it goes fast paced around it is not boring it is not 2hrs long and I really, really love Dr. Alan Grant much more than Ian Malcolm that's just me.Jurassic Park III is a decent film in the trilogy they bring Dr. Alan Grant back and Laura Dern as Dr. Ellie Sattler she has only 2 scenes but she is a decent. We see Dr. Alan Grant's life. I love Sam Neil as Dr. Alan Grant and I love that he goes on an Island Isla Sorna, where man is up against dangerous predators in the ultimate battle for survival. This movie nature takes no prisoners and pulls no punches.The mercenaries are been eaten in the beginning of the film and you also have a cast that I like you have Michael Jeter, John Diehl and Bruce A. Young I like all of them. Willam H. Macy did a fine job and I like Téa Leoni who was married with David Duchovny Fox Mulder from The X-Files that time. I like Trevor Morgan as Eric Kirby he wasn't annoying kid he did a good job, he was smart and recourses, he was useful in this movie. He survived that length of time by himself & saved Alan against Spinosaurus, so yea I like that and I like this film. He was at least better than those two stupid kids in Jurassic World that annoyed me.I like the idea that group was been chased on a B site island Isla Sorna by Velociraptors they are been chased on those island. I love Spinosaurus in the film I love it. I love that group was attacked by Pteranodons who abduct Eric and Billy (Alessandro Nivola) saves the kid I like the idea he sacrificed him self with parachute. I love the group fighting on a boat with Spinosaurus who try to eat them and Dr. Grant fires a signal flare on Spinosaurus to make a fire so that Spinosaurus can go away.The movie grew on me I watched more The Lost World: Jurassic Park as a teen, but this movie Jurassic Park III grew on me the CGI effects were not that bad at all on dinosaurs. The third film was directed by Joe Johnston who directed Captain America: The First Avenger and The Rocketeer. I haven't seen The Rocketeer in a long, long time. He did a decent good job directing this movie I have no problem with it. I love Captain America: The First Avenger to death and I love this movie to death. I love Sam Neill in this movie I love his character I would take Dr. Alan Grant over Ian Malcolm that is just me. He was decent not full of his self like Ian Malcolm I just don't that character that much.Jurassic Park (1993) the first movie is a classic and my number 1 favorite film in the franchise, The Lost World: Jurassic Park the second movie is my least favorite of the three, this one is decent action more than the second one it is my third favorite Jurassic Park film. Jurassic World the fourth movie sucks and Jurassic World: Fallen Kingdom the fifth film is decent and it is my second favorite film in the franchise. Both Jurassic Park III and Jurassic World: Fallen Kingdom gets completely crap.Jurassic Park III it is a good decent action film who get's so much crap and hate for it for trying something different.","I LOVED the first Jurassic Park at the tender age of 10. It had everything you could want from a movie minus some underdeveloped character personalities but that film ROCKS even until this day and age. Part two was good though not as the original. The third installment: Terrible. Where was the adventure? Where was the excitement? Where was the suspense? Where was the danger? Drained of all the qualities of what made the first one so memorable. This could be blamed primarily on the director, Joe Johnston, who made that box-office bomb The Rocketeer nineteen years ago. What more can be said? At least the special effects were good; the fight between the T-Rex and Spinosaurus and the scene with the Pterodactyls but the plot was basically nonexistent and the acting was wooden and lifeless with no sense of conveying believability. And what's with the \"theory on raptor intelligence\" part? Were they assuming that raptors were smarter than birds and primates? One needs only to read various books on dinosaurs to find out. Seriously I don't expect movies to educate audiences but a little research wouldn't have hurt. I first saw this on opening day expecting more action, adventure, suspense, danger, and terror. Yet I got a lot less bang for the buck. A fine example on what happens when you switch directors mid franchise.Not even up to par with the original. Pure piece of crap. If they got the gall to make a fourth installment, better get Spielberg back on board or else this franchise will become \"extinct\" like the dinos.","Jurassic Park 3 was a shorter and less entertaining of the three. I thought this sequel might be good because JP2 was good but I was wrong! I have picked some notes while watching this movie. Usually Jurassic Park films are 2 hours long, this one is some 40 minutes less! and does not quite contain the same fun and horror it did on previous jp's. DR. Grant returns which is a suprise. It didn't have it's entertaining parts though i must admit. JP3 had amazing special effects, most probably the best out of the three. I have heard that Jurassic Park 4 will be released in 2004. Should I say this one will be a bad sequel as well?","As problematic as 'The Lost World' may have been, it did expand the horizons of the Jurassic Park universe, 'Jurassic Park III' was a huge step backwards. The characters are sub-standard, the story is lazy and shamefully contrived, and the effects aren't as good as either of the previous movies, almost seeming to be a parody of a Jurassic Park film.The plot, as thin as it is, centres around the rescue of a boy named Eric who ended up stranded on the now restricted Isla Sorna, and the survival of the rescue team led by Alan Grant. Alan is lured to Isla Sorna by seemingly rich businessman Paul Kirby on the promise of cash to fund his dig. The plane lands and Amanda Kirby, Paul's wife, attracts the attention of Spinosaurus which causes the plane to crash and devour members of the crew. The rest of the movie is a series of chase scenes involving the Spinosaurus and the Velociraptors, interrupted by cloying domestic drama between the Kirbys reuniting with Eric and coming back together. The climax itself is unsatisfying, requiring a military deus ex machina that just feels tacked on.In all fairness, Sam Neill does a good job at bringing a jaded Alan Grant to the screen, working with what little he had. But his character is ruined by undoing his arc in the first film about learning to love kids and marrying Ellie, here Ellie is married to another man with two children. The writers could have prepared something special involving Alan and Ellie's relationship and their place in the world with live dinosaurs on the planet; it was insulting to undo all that development. His scenes in the prologue had potential, showing Alan's struggle to keep palaeontology alive and rekindle his love of dinosaurs. But it all amounts to nothing.The film has only a few worthwhile action scenes, specifically the Raptor attacks and the group's encounter with a colony of Pteranodons in a giant aviary, a memorable scene conveyed with an eerie and mysterious atmosphere. Some of the musical cues are melodic and charming, but I yearn for John Williams's talent. At times, the visual effects for the Raptors are actually quite good, but the rest are incredibly rushed and don't allow the audience to soak it in like in the first film. Due to the weak writing and wasted characters there are the many stupid moments throughout the movie. Barely twenty minutes into the film, Alan has a dream about a talking raptor on the flight to Sorna, it's intended to be scary and foreshadow the Raptors' capability of speech but it comes off as childish and goofy. (Real life raptors weren't even capable of human-level speech patterns). The ever annoying Amanda Kirby seems to exist only to scream, bicker and run away, never contributing anything but maudlin or moronic moments. William H. Macy is completely wasted. The rest of the characters are bland and forgettable. Some outright stupid moments include a satellite phone being heard from the belly of a Spinosaurus, said Spinosaur is shown as being able to break a fence designed to contain dinosaurs yet cannot break down a rusty metal door, a ridiculous cameo of Barney (I wish I was joking!!), and a cheap regurgitation of the dino dung scene from the first film.Even the dinosaurs themselves have been ruined; the CGI herbivores are pushed to the background with little screen time, and the carnivores don't behave like real animals, like in the previous films. The animatronics are clunky and the CGI is too obvious. The movie tries to recreate the sense of awe and wonder from the first film, but it feels forced and artificial.The most obnoxious change is the addition of the Spinosaurus. While I accept that it was larger than T-Rex, Spinosaurus was not a rampaging movie monster that hunted human-sized morsels like a serial killer. This leads into the infamous duel between the Rex and the Spinosaur, and it's a problem because the T-Rex was an integral part of the previous films and a childhood favourite. The fight itself was overly brief and anticlimactic. The T-Rex was set up as a predator with both ferocity and nobility, having it dispatched in such a way feels like a cheap shot. It was just a botched attempt to showcase a dinosaur that hadn't earned it's stardom like the Raptors.What frustrates me the most about 'Jurassic Park III' is that there was potential to make up for some or more of the shortcomings of 'The Lost World'. Instead it's the shallowest and the least adventurous film of the entire trilogy, there's too much focus on the domestic drama. While the first two films dealt with themes of science, technology, playing god, and man vs. nature, 'Jurassic Park III' took the franchise away from exploring such themes, choosing to be safe and marketable and lacking in substance.","I went to see JP3 last night to vet it before I take my 6 year old daughter. She is desperate to see it having seen JP and the Lost world and generally loving dinosaurs. I am a great movie fan so have my own opinions on the film but first I'll address the suitability of this movie for young viewers. The original film and Lost World are true 'family movies' containing elements for everyone - decent story, good acting, great (groundbreaking) effects and humour etc. There's nothing wrong with kids being scared periodically, being scared is part of the whole monster movie experience. All that said, JP3 is too 'full on' for one as young as 6 and I think I'll try to get her to wait for DVD, to tone down the whole experience. She saw the first two at home and wont be expecting the sheer sound and visuals of this movie at the cinema. I would advise other parents the same, at least with kids this young.As for my opinion of the film - well, we've seen it all before. I've read many comments and agree with most. Its lame storyline is its down fall and this could've been so much better. In my opinion a far better film would have carried a 15 certificate at least. One they could have made for adults only, and really explored new territory and therefore could not be compared to the previous two. A huge audience loves scary films and monster movies so why not go for it with a proper modern day horror. Throw in a good conspiracy theory plot about INGEN and some realistic profanity and gut wrenching effects. In short give people what they really want. JP3 does niether for either age group.For your children, I reccommend the BBC's series 'Walking with Dinosaurs' it's informative and has near the same quality of effects.See for yourself.","The action was not well developed, nor were the character or anything else about this movie.  One big rehash of the first two films, that didn't even come close to equalling their quality.  The ending and other parts of it were so bad, that I was laughing.  This is the worst movie of the summer, even worse than The Mummy Returns.","Jurassic Park 3 was released four years after the Luke warm reception of Spielberg's (underrated) The Lost World. Spielberg opted to not return to helm another Jurassic film, and directing duties were passed over to Joe Johnston. Jurassic Park 3 see's the return of Sam Neill as Dr. Alan Grant, from Jurassic Park. Laura Dern also returns as Ellie Sattler, but sadly in a less prominent role. The story for JP3 is quite simple, Grant is lured by \"adventurous\" couple Paul, & Amanda Kirby, played by William H. Macy & Tea Leoni, to fly over Isla Sorna, with Grant acting as their guide, for money. However the Kirby's are not rich, and lied to Grant so he could help them find their missing son Eric, who wen't missing weeks ago in a parasailing accident near the island. Of course things go wrong, the plane crashes leaving the Kirby's, Grant, his colleague Billy, and a few others stranded on the island. JP3 can only be enjoyed as a trilling dinosaur spectacle, but there isn't much of anything new, or interesting.There are some positives aspects in this film, Sam Neill is a fine actor, and he brings credibility to the film, and is still believable as the Grant character. While the rest of the characters aren't all that fleshed out, the film is well acted, with William H. Macy, and Sam Neill being the standouts. There's a few new dinosaurs, Spinosaurus being the main one. Spinosaurus is a neat dinosaur, and the roar for Spinosaurus is also well executed, and is distinctly different sounding from the now famous T- Rex roar. The animatronic dinosaurs/CGI are once again well executed by Stan Winston's team, and Industrial Light & Magic (ILM). JP3 is the first film in the series to combine CGI dinosaurs along with practical ones in the same shot, and the blending between the two is well done. The Spinosaurus attack on the river is a thrilling scene, taking place in water, which hadn't been done. There is also a thrilling Pteranodon sequence, offering a ariel attack which hasn't been seen yet in the franchise. The scene is dimly lit, with fog, and creates the best sense of suspense in the movie. The music in the scene is probably my favorite bit of new music in the film. John Williams didn't score JP3, instead composer Don Davis best known for his work in The Matrix films, provides the music, and does a good job, creating new music that still fits stylistically within the franchise.Though there are positives in JP3 there are many negatives as well. One of the biggest ones I had was the screenwriters not having Grant, and Ellie as a couple. Instead they have a friendship type relationship, and Ellie has a child (with some random guy) who call's Grant \"the dinosaur man\". It just seems stupid to not have Grant be with Ellie after the events of the first film. Grant's character arch of not wanting children changes after he saves Lex, and Tim, and is seemingly ready to settle down with Ellie, which now seems wasted. The dumbest thing about it is it adds nothing to the characters, or the overall film, and was a stupid decision on the writers part. Grant has a dream on the plane nearing the island, and turns to see a raptor that says \"Alan\". The scene is very cheesy, and really is just plain silly, right up there with the gymnast scene in TLW. The Spinosaurus T-Rex fight is neat, but having the T-Rex (a fan favorite) lose, and die, just didn't sit right with many fans, myself included. The characters (while well acted), aren't all that interesting, or all that likable, the Kirby's put peoples lives in danger to find their son, and Billy, decides it would be a good idea to steal raptor eggs to help fund their research back home. There are also many continuity issues in the film, like why the island doesn't look the way it did in TLW, or why the raptors look radically different (some have feather-like quills on their head) from how they did in the pervious films. Where the Spinosaurus was during the events of TLW is suspicious too, the only clue given in the film is when Grant says that Spinosaurus wasn't on Ingen's list. Perhaps the worst part of JP3 is it's ending, which feels insanely rushed, and anti-climantic, almost as if the filmmakers said \"This is going on too long, lets wrap it up\", but with a runtime just over 90 minutes, the abrupt conclusion seems strange, with the previous films being over two hours long. Jurassic Park 3 despite is faults, and there are multiple ones, is still an enjoyable flick for what it is, but it's a huge step down in terms of story, and character, and is just an unnecessary edition to the franchise. The story isn't very interesting, or inspired, and the only thing new in the film are the look of the raptors, and a few new dinosaurs. It's explained during a dinner scene with Grant, and Ellie that the raptors were far more intelligent than imagined, and could talk to each other, but much of this could be assumed in the previous films. Spinosaurus makes for a cool looking successor to T-Rex, but seems more like a movie monster than an animal, compared to T-Rex who while running around chasing/eating people, had moments in both Jurassic Park, and The Lost World that showed a naturalistic side of them, like caring for the infant T-Rex. The only real advances in Jurassic Park 3 are technical ones, but effects aren't what makes a film great, it's the story, and characters that drive a film, and that wasn't strong enough in this entry of the Jurassic Park series.","First of all, this final episode in the Jurassic series did not deserve all the bad reviews it got when it was released. In fact, it was a lot more enjoyable than the stupid second JP. Did it equal the first? No, of course not. The original story was easily the best of the three, but I found this an enjoyable movie and far better than what I had been led to believe.The filmmakers were smart in making this a short film. People had seen plenty of the dinosaurs by now so let's no overdo it...and they didn't with an film just under an hour-and-a-half (not including the final credits.).That made this short-and-sweet. We saw some new reptiles, had a few scares, enjoyed the beautiful jungle scenery (filmed in Hawaii) and - bang - it's over. The characters were fine, nobody totally annoying as in the second film. The lulls featured a family getting back together and finding their missing teen. Nothing wrong with that.A good story unfairly maligned and nice, short evening of entertainment.","JPIII is very good at what it tries to do. That is, update the formula used in its prequels to create even more lifelike dinosaurs. Unfortunately, it didn't try to do much of anything else, leaving us with yet another big, dumb, summer action flick... hardly the caliber of the previous films.Basically, the story goes like this: a rich kid is taken to Costa Rica by his parents to do some para-sailing... and, for some reason, he decides that an island famed for its man-eating dinosaurs would be the best place to do it. Surprise, surprise: Something Goes Wrong, and the kid is stranded on the island. Who do his parents go to for help? Dr. Grant, the paleontologist who happened to get himself involved with dinosaurs before. Rather than telling him the truth upfront, they con him into coming by giving him a big fake check and swearing that they will not touch down on the island. Dr. Grant agrees hesitantly to this condition. But when they get to the island, they touch down anyway, making their plane a prime target for a dinosaur attack. Something Goes Wrong again, and this time, Grant and the kid's parents are stuck as well.The plot pretty much ends right there, and that's only the first thirty minutes of the movie. The rest of the movie involves people running from and/or getting eaten by dinosaurs. Like I said, it's a big, dumb, action flick. If you're looking for something that even remotely has an air of the old Michael Crichton magic, look to the first two films. Jurassic Park III is the beginning of what will become a reiteration of the Jaws fiasco... endless sequels until one of them sucks so bad, it finds its home in the infamous Bottom 100 list.","Jurassic park. The name alone strikes images of people, running and screaming--bleeding and sweating--from huge, ugly, fast, vicious DINOSAURS. Oh, joy. Now, don't get me wrong, I liked the first two movies alright, but I mean, come ON, people! It's like the old saying, \"Two's company, three's a crowd.\" In my opinion, this has gone overboard. There are some good aspects, but the bad tend to overthrow the good, in this case. For example, the graphics were 'a little bit of alright', but they didn't show enough dinosaurs besides the T-rex and the Raptors, so what's the point? Or, that some parts were great, and made you jump out of your seat, but there was NO PLOT! \"There they are. Run. Must get off island. There they are again. Run.\" Doesn't quite cut it in my book! And while the first two had the same underlying plot, they weren't nearly as predictable as this one. I don't understand how people can perfer a movie like this VS....Oh, let's say a masterpiece like \"Final Fanatsy.\"  People REALLY need to wake up, 'cause at this point, it's just sad","Boring. Painful. Annoying. Badly written. Anti-climactic. These are 0.0002% percent of the words I could use to describe this film, but I'll just stick with 'fail' to keep things simple. Alright, let's get into the 'spirit' of this ass-fest and insert a bad dinosaur pun.Let's take a bite right in (GET IT?)Talented actors go to waste in this third installment of the once dignity-possessing series. I'm going to spoil stuff, because I already summed it up by saying \"fail\" so why not go further? A divorced couple (William H. Macy and Tea Leoni, two good actors who's talent is set aflame by bad writing) pretends to be married and tricks some emotionless character from the first film to come with them to the island to find their son, played by Trevor Morgan, a decent young actor who mysteriously isn't doing many movies anymore. Oh, and I shouldn't really call the main character emotionless. His thing is to grunt and complain and give warnings about the island's danger, even though no one really dies except a few background people and one character who gets about 30 minutes on screen. What a dick of a main character. No one here is likable. Unless you count Udesky, played by Michael Jeter (RIP) who seems to be the only quiet and innocent character. But, he's a balding mercenary, so of course he dies after 44 minutes or so. And he's also the only character to die that we actually got to know (sort of, not really). Tea Leoni's thing is to complain and whine. At least she still has a career. And I'm pretty sure this movie is the reason William H. Macy ended up having to star in \"Shorts\". Poor guy. He could have gone places after \"Fargo\". So anyways, Grant, the super-grumpy main character, is also a paleontologist. He has a sort of intern or student or something named Billy,who is a young paleontologist. He supposedly is killed by Pteranodons halfway through the film, but of course he's alive at the end. Speaking of the end, there's no climax, unless you count the confrontation with the raptors, but that wasn't even an action scene. And I guess director Joe Johnson thought it would be cool to be more \"scientific\" by giving only the male raptors feathers. Okay, but why are they blue, and why do the Pteranodons have TEETH? THEIR NAME MEANS \"WINGED WITHOUT TEETH\"!!!! They even decided to put in a DREAM SCENE. No comment on that. I'm probably running out out of space, so I'll end on two positive notes-1. At least the music was okay. 2. There's still a different JP sequel to watch that has it's dignity.","Spoilers warning :Jurassic Park, the first episode, was simply innovative, amazing, intelligent, and great. The Lost World was, let's say, bad.  But this is different from the two first chapters. Let me explain. This is the (very simple and stupid) story of a young boy doing some kind of parachute with a friend of his parents over Isla Sorna (the island where the story of The Lost World happened).  But with some amazing coincidences and unpredictable events (do you feel the sarcasm?), they crash on the island. Then, 8 weeks later (that's a long time to survive, on a near island) the parents pay Alan Grant to come with them save their son on the island. Don't you think the story is stupid? Don't you think this is gratuitous reason to go on an island and get eaten by dinosaurs...This is stupid to the extreme...seriously.  But, not only they have a crap-head scenario, but they also have special effects that are really not as good as the first two's.  I couldn't recognize the raptors, because teh dinosaur models are different and cheaper, and also, the dinosaurs are so fake sometimes, it's evident...the illusion isn't really there.  There are new species of dinosaurs, but the only T-Rex you see lasts only one minute.  But the most stupid point of the film, making it a possible winner at the Razzies fest, is the NEW intelligence of the dinosaurs...they communicate like humans (they don't speak, but it almost sounds like that sometimes), they look at each other, they trap humans...this is awfully stupid...and especially in the dinosaur fight, one of them kills the other by holding his head and breaking his neck...and why don't they eat the humans they kill?  The acting isn't so good, William H Macy is real bad and fake, like Tea Leoni...some awful one-liners, too predictable to be true...really.  The action is so brief, you can't enter into it, there is no stress, no suspense...and the movie has a running time of 85 minutes...plain bad. Overall, stupid story, bad acting, sucky scenario, lame action, no plot, no suspense, just a sell-out under the Jurassic Park title. 2/10","If the first of this seemingly interminable series was rather far-fetched, at least it didn't push to the extremes of absurdity (well, maybe not more than a few times); Jurassic Park III does practically from the start. Dinosaurs and pterosaurs are constantly depicted exhibiting traits that might be believable in primates, dog packs or even domesticated animals but would be ridiculous to attribute to reptiles; the writers go so far as to mention the \"alpha male\" of a pack of large herbivores - I guess that makes it sound more \"authentic\"... Even in the original movie such behavior strained credibility past the breaking point on a few occasions, such as having a dinosaur burst through solid walls as if it recognized what a wall is and anticipated what would be on the other side - was that a tyrannosaurus or Godzilla? How many wild animals has anyone ever seen demonstrate such behavior? With each movie the 'raptors become more and more fiendishly clever; by the time V or VI rolls out (probably on direct-to-video), you might almost expect to hear one of them say, \"I am your father!\"","This is with out a doubt, one of the worst films ever made.  It's Mystery Science Theater 3000 material at it's finest. It does not have the Heart or soul that made the first two enjoyable, and it's bad in every way. The acting, the directing, and don't even mention a plot because it does not have one. The score of the film is even bad, so bad in fact that It almost destroys what John Williams Did with the first two films.  \nI don't know who is worse, The people who made this trash or the people who is defending it. These people Say it's better than Lost World but in reality, it's Not.   The Lost World is Way better than this piece of garbage.  Jurassic Park 3 even Makes Blair Witch 2 looked good.","Before watching the movie, I expected some new and cool graphics. That never happened. The graphics is the same as always and in fact, some parts in the movie is surprisingly disappointing, because of the poor animations. The acting in the movie is acceptable and good, but the story is VERY boring! It's very predictable all the way and there's no real \"WOW\" scenes. All in all a \"below average movie\", which won't be remembered for very long. I gave it 3.","This is one terrible, terrible movie, every thing that can go wrong in a motion picture of this size goes wrong with a savage gusto that can be attributed to the fact that no one working on this film wanted to make a quality film. The actors themselves look like they don't want to be in this film, and the direction of the film look too disjointed to be taken seriously. The screen play feels like it was written by a five year old and judging by the ending of this fluff piece, it looks like the five year old just gave up and went to sleep.The real sad part about all of this is the fact that it's a sequel to two much better movies (Jurassic Park and The Lost World) that had a lot of quality to them. Judging by the way this was handle, it looks like Steven Spielberg is finally getting too big for his own head and not to mention too lazy to care if the movies he's making are even good or not.","What was the point of doing another movie.  You could also say what was the point of me seeing that movie, at least it was a cheapie night.The plot itself is really ridiculous and the acting about the same, except maybe for Sam Neill who is not bad in his character. It would have made a nice tv movie but that's about it.  There is no really original or exciting moments in the film, and not a lot a scary parts.  The only time i jumped is when one of the character stepped on a staircase and almost fell.The special fx are ok but nothing ground breaking.  And what is this... talking raptors??!!  Next thing we'll see is a movie about talking apes.... (oops!)The movie may be fine for kids or teenagers( i'm sure McDonalds will sell a lot of happy meals), but if you want a minimum of a good time, avoid this one, go see shrek for a second time.","It's hard to really put this movie down cause despite it's problems and there is many, it has it's heart in the right place. The aim I guess that the people behind the scenes were aiming for was a family movie with a bit of suspends and while there is a family movie to be had here, it also tries to be a Jurassic Park film and unfortunately it fails as both to a degree.It fails as a family movie cause the script is not strong enough to support the story. Despite the venom thrown at William H Macy and especially Tea Leoni, both are very appealing actors and they do work hard to make it all work but the script just handicap their efforts to make it possible. It fails as a Jurassic Park film cause it lacks the tension, suspense and the story points that made the first two films in the series ( Jurassic Park And The Lost World) so well made and memorable. Not to mention the fact that they felt like fully formed movies with a beginning, middle and end. Jurassic Park 3 just feels like a Saturday morning serial. Not bad but nothing like the other films in the series. There is one scene in the film that almost manages to bring a little tension which is the bird cage scene but even that ends up flat compared to any of the scenes in the other films of the series. The other major problem is the fact that While Sam Neill works his ass off to make this film watchable, the script does the most disservice to the character of Alan Grant, whose happy ending from the original Jurassic Park was not only ruined thanks to this movie but has his character dumb down in order to fall for the dumb stuff that happens in this film. Despite all of this, Sam Neill is working overtime to make you care. Too bad the script did not.As I said before, it has a lot of heart thanks to it's actors but thanks to a bad script, Jurassic Park 3 is with out a doubt the weakest entry in the series.","Jurassic Park III is an example of an excuse to make a Jurassic Park film for money without any thought or care in the development of the plot.The original Jurassic Park had originality, it had a LOT of interesting SCIENCE fiction elements incorporated into it. The next JP film needs more SCIENCE in it to support its fictional elements; this was the genious of the original JP, and it is what gave the film credibility. Michael Crichton is a genious, but the writers of JP3 could not write their way out of a paper bag. Some of those lines made me flinch they were so bad (i.e., \"I dare them [pterodayctls] to nest in Enid, Oklahoma\").  The worst part of JP3: William Macy.  Macy deserves an academy award for the most number of stupid faces made by an actor in 90 minutes. As Malcom would say about Jurassic Park III: \"They packaged it, slapped a [Universal] seal on it, and now they want to sell it, they want to sell it!\"  I was a HUGE fan of the original JP films, and I watched the original JP mutiple times. I would like to see a JP4 with a REAL plot on a HIGHER intellectual level.","What a wasted of time and talent. A movie so bad that it even makes some of the finest actors around look like they came out of dinner theater. The story is nothing more than a summery of a real story and the acting is way below averaged.  The Dinosaurs even look embarrass to be on camera, and they themselves don't look as well as they did in the first two movies. The movie barely gets anywhere before it ends, and is not even as long as the others in the series. I really loved Jurassic Park and The Lost World but this movie is just too disappointing to be added to my Jurassic Park collection.Entertaining for those who are sleep deprive only, and maybe they might even turn off the tape before the movie ends.","I heard reviews raging from bad to horrific concerning this film, and I still wanted to see it regardless of the extreme bad word of mouth. The word of mouth had kept me away from it for so long because I'm such a fan of the first two films, and I didn't want to ruin the experience of those films by watching this movie but I gave in out of sheer weakness. Now I know why the movie received all the bad feedback.The movie is a complete mess from start to finish. The plot absolutely makes no sense what so ever, even going as far as to contradict itself in certain points of the film. The acting is tepid at best, with Sam Neil giving the best performance out of the group, which is not a big feat considering the fact that he's sleep walking through out the entire movie. Jeff Goldblum is not in this film, and it's painfully obvious because he at least brought an intelligent sense of reality and danger to the first two movies, and top of that he was interesting character to follow. The cast of characters in this film are so unbearable to watch that you as the viewer will want to be transported into the movie in order to kill each of them in a slasher movie kind of way.  Interesting enough, The movie itself feels more like a slasher film that a Jurassic Park Flick because the dinosaurs look and act like murderous monsters that actual animals.Speaking of Dinosaurs mind you, the big creatures are more like live action puppets than the real dinosaurs we saw in the first two movies. I don't know what happen but these dinosaurs can't be from Stan Winston, because he of all people should know how to make a monster but hey, he like every one involve with this cinematic piece of trash probably took the easy way out thinking that people were stupid enough not to notice. In reality, who were they kidding? Themselves actually, because the movie itself is now being touted as one of the worse films ever made, and it deserves that reputation.It's a give that a sequel will never live up to the original, but The Lost World at the very least a worthy effort to The original.  This film does not even deserve to ride on those movie's reputations which it shamefully does.","Meat headed follow up does the low class approach to film making, and shames the franchise with a no plot story and incompetent acting. The special effects are bottom of the barrel, and the directing has no direction. The only decent thing about the movie as a whole is the facts that it's shorter than its predecessors so you don't have do sit there in agony for too long.Stick with the first two movies instead.","There is really no reason for this movie to have been made. First off, This is not even based on anything written by Michael Crichton and it shows by the lack of any real story or substances. Second, Nether Steven Spielberg or Jeff Goldblum is involved, and it shows by the amateur directing and the lack of depth. Spielberg knew how to spotlight the wonder and power of these wonderful creatures, and Goldblum gave the films it's intelligence and it's heart. Unfortunately, this movie does not benefit from ether of them. And it suffers greatly because of it. Sam Neil Returns as Alan Grant Who is trick this time around into looking for a missing kid who has crashed landed on the Island Sorna (Setting of The Lost World) And instead ends up trap on the island with the parents trying to get off the island. Now this would have worked if there were more to the story than that but unfortunately there is not, and it does not even try to be anything other than that. The whole discussion about The danger of playing god is tossed out for a run in the mill monster movie that has no brains or heart. Sam Neil is a very good actor but his character reminds us on why Jeff Goldblum character is so important to the series. One hint, Goldblum's character had brains, and a sense of humor. Sam Neil's Character has nether. If he did, he would have had the parents of the missing kid checked out before he agreed to go with them on the island. The parents of the missing kid are in fact so dumb, and so annoying that you end up wishing that they would be eaten by the dinosaurs, as for the screen writers and the director of the abomination of a film. There is barely any mention of the first two films, and the story does not even make any lead way into trying to connect it's self to those movies.  It does not even make sense in some aspects of the story, like how the Spinosauris even got on the island in the first place. It was not in The Lost World, so why is it in this one? At The End Of The Lost World, The military was surrounding the island because they did not want the Dinosaurs to go to the mainland, so where aren't they surrounding the island now? All of this and the quality of it make this the most pointless and useless film of this series. It seems like the makers of this film did not even try to make a good film, they just expected people to just swallow it, with out thinking on what they were seeing.  That is a really sad because it taints the magic of the extremely better first two movies.My advice Rent The first Two Films film of this series instead of wasting your time with this one.P.S. As for the whole Debate on which was a better sequel (Jurassic Park 3 or The Lost World) While The Lost World was not as amazing as the original, It still upheld the quality and substance. Something Jurassic Park 3 does not even attempt to do","The original Jurassic Park was exciting mainly because of the dinosaurs and the special effects, but the characters, the dialogue, and the overall plot were rather dull.By the third film the characters, the dialogue and the plot have all become much worse, and in addition to that the dinosaurs are no longer that interesting. The end result is a dull, unimaginative film filled with stupid characters, unrealistic plot twists, and not so impressive CGI creatures. This film wastes no time to introduce us to the characters, but it does not bother to develop them. Most of them die pretty quickly anyway. Of course, we are introduced to a child in the latter half of the film, and this character manages to be more irritating than all the rest combined. Apparently he has been living all alone for two months, evading giant meat-eaters and actually having fun. He almost seems sad that the show is over and shows no emotional reaction to the fact that he is not only being rescued, but that his parents are on the dino-infested island. It all ends with a deus ex machina that overshadows the one from the first film (of course, they could not use that one, because they used it early in the film, in a scene where they are saved from a dinosaur by having another dinosaur show up and start a fight with it, allowing the characters to escape in the confusion). Does anyone know how many islands inhabited by dinosaurs there are, and who is in charge? Who cares? There are people being chased by dinosaurs, and that's what you paid to see, right? So shut up and stop asking questions.This film was made for no other reason but to squeeze even more money from the franchise, and it exhibits no traces of genuine desire to create something artistic. One star, as far as I'm concerned. I don't appreciate being treated like this by filmmakers."],"review-user":["rambofan4life","johnnymacbest","mosquito1985","oscar-stainton","Blindman-2","nin_fragile14","jaredmartin-464-711711","ccthemovieman-1","veemee78","Jacki-chan","fstormchaser","~PL~","pmicocci","batman200011230","Jones-41","marvreturns","jean emmanuel frojo","midnighttheater","awfmail","planetlarss","dumb2ugly","turnmeonread","shortcut10509","pesic-1"],"review-date":["1 November 2018","22 May 2008","11 June 2003","20 August 2013","24 July 2001","18 July 2001","1 July 2015","15 May 2006","16 July 2006","28 July 2001","16 September 2009","19 July 2001","16 August 2004","22 July 2001","14 July 2001","6 June 2003","25 July 2001","8 July 2015","25 September 2003","27 July 2003","5 June 2003","4 June 2003","27 December 2001","28 December 2013"],"review-rating":["8","5","6","5","1","6","8","1","1","1","1","1","1","3","1","1","4","1","1","1","1","1","1"],"review-title":[" Nature takes no prisoners and pulls no punches - third favorite film in the franchise underrated fun popcorn action film\n"," The weakest of the first two films.\n"," Not as good as the previous JP's.\n"," A True Disappointment\n"," Why not go all the way\n"," Stupid Plot, rehashed ideas\n"," Jurassic Park 3 is as Inventive as it's title.\n"," Much Better Than Its Reputation; Short & Fun\n"," Unneeded\n"," \"Two's company, three's a crowd.\" J.P. 3 doesn't compare to the first two.\n"," Fail\n"," How to sell a movie with its name...\n"," Dumber by installment\n"," The Worst Sequel since BatMan and Robin.\n"," below average movie\n"," One long TV pilot for a bad family series.\n"," talking raptors??!!!\n"," Has it's heart in the right place but it's with a doubt the weakest entry in the series.\n"," JP3 Lacks Originality\n"," Excruciatingly Bad\n"," Sometimes the bad word of mouth is justified.\n"," Not good at all\n"," Was not made by Steven Spielberg, and it shows.\n"," Hunt for more money\n"]}