{"review-url":["http://www.imdb.com/title/tt0104922/reviews"],"review-text":["DON'T EVEN TRY to figure out the logic of this story.  But do ride along with 10-year-old Gus on the most bizarre road trip ever witnessed.  More weird characters and implausible situations than a Twin Peaks reunion! Nothing makes sense, yet it's impossible to stop watching Motorama!  Now, where can I find that 'R'????","Let's start from this point: This is not a movie intended for the common audience. Utterly bizarre, somehow incomprehensible, totally unpredictable, it just keep you stoned watching at the screen trying to figure out what will happen next. If that by itself doesn't make you agree it is an excellent movie, then go back to your \"family\" movies and forget about MOTORAMA. It has material to be considered a cult movie, it can be placed in the same category with movies that win awards in Cannes or other intellectual film festivals, but, sadly, Hollywood already let if fall in oblivion, simply because it is not commercial. The performance of young Jordan Christopher Michael may not be Oscar material, but he gives the right touch to the story. Even the genre is difficult to describe; it is not a comedy in the proper sense, you don't know if you are supposed to laugh at the strange situations in which Gus gets involved. It is more like an impossible adventure that some kids may wish to have, but don't let them watch it either... it is not a movie for kids. So, if you like Disney movies or are looking for a \"Home Alone\" style, this one is definitively not for you. But if you enjoy reading Edgar Alan Poe or the works of Tim Burton, then you will like Motorama. So, jump in your red Mustang, get a tattoo spelling \"Tora\" and cruise Strangeland with Gus. I'd like that...","Joseph Minion wrote this eerie, spooky, unusual film which is expertly directed by Barry Shils. It's subject matter is straight out of the Twilight Zone. The story begins with a pint-size ten year old boy named Gus (Jordan Christopher Michael) who's abusive home environment spurs him to steal a beautiful, mint condition, red 65 Ford Mustang and run away. Despite his inability to reach the foot peddles, he crafts a prosthetic foot device to reach the floor. Along the long stretch of roadway, which he flies over at top speed, he encounters a dozen unusual characters. His secret objective is to gather a series of Collectable cards in an effort to win a Million Dollar Prize. What he discovers is a tribute to the universal law of Be careful what you wish for. Gus is subjected to an odd collection of weirdos, kidnappers, bikers and an occasional helpful nudge towards his goal. What the movie allows the audience is a cruel, insightful look at life. Indeed, for movie buffs, we are treated to a whole plethora of Hollywood thespians. Stars like Michael J. Pollard, Vince Edwards, Drew Barrymore, Dick Miller, Meat Loaf and John Diehl are scattered throughout the film. Interestingly enough the movie itself is fascinating and even at it's conclusion, one has the notion that it must be seen again. I did. Recommended. ****","Too bad 'Motorama' never found an audience that would appreciate it! Misleadingly thought by some to be a kids movie, it is closer in spirit to David Lynch's stylized surreal looks at the \"real\" America. Jordan Christopher Michael plays a young boy who runs away from home, and travel across America in a stolen car. Only it isn't exactly America as we know it. At a gas station he is given some \"motorama\" cards, which are part of a competition which has a possible 500 million dollar prize. He slowly becomes obsessed with the game as he continues on his increasingly bizarre trip, which sees him encounter a strange bunch of oddballs, eccentrics and weirdos. He even loses an eye along the way! The nutters he interacts with are played by an amazing array of character actors and cult figures including Lynch favourite Jack Nance ('Eraserhead'), Susan Tyrrell ('Flesh and Blood'), Mary Woronov ('Eating Raoul'), Michael J. Pollard ('Bonnie And Clyde'), John Diehl ('Stripes'), Dick Miller ('A Bucket Of Blood'), Robert Picardo ('Innerspace'), Flea, Meatloaf, and a teenage Drew Barrymore (note sleaze fans - a pre-breast reduction teenage Drew Barrymore!). This movie is easily overlooked in the video racks - especially with its misleading \"Home Alone meets Thelma And Louise\" packaging - but it is really worth watching. Fans of quirky road movies like 'Wild At Heart', 'Highway 61' or 'Roadside Prophets' should enjoy this quietly subversive dark fantasy, which in my opinion is one of the most unfairly overlooked movies of the last ten years or so.","Little Gus is a ten year old delinquent. He runs away from his parents and decides to go on a road-trip. Reaching the petal is somewhat tough for him, so he creates a device to help him. His goal is to win a gimmicky lottery type card game called Motorama. He has to find all eight letters in order to spell M-O-T-O-R-A-M-A. Dark laughter follows as it turns into the road-trip from hell. He runs into some deranged Lynch like characters. Most memorable is the gas station attendant, who puts his picture on a kite in hopes that God will see it. Later Gus gets a tattoo and an eye-patch for his injured eye. He becomes one of the most rebellious bad-ass 10 year olds you may ever witness on screen. This is no kid's flick! Look for cameos by Jack Nance, Flea and Drew Berrymore. Be warned although Drew is on the front cover, she only appears in the film in a dream sequence for a couple seconds. Also the film gets confusing towards the end reaching David Lynch territory, you may want to watch it a couple times. \"Motorama\" was written by Joseph Minion, most well known for his screenplays for \"After Hours\" and \"Vampire's Kiss\" So enjoy this depraved surreal road-trip of fun!","Offbeat film about a kid who runs away from home and steals a vintage Mustang and treks across a surrealistic version of the southwest collecting cards for an oil company promotional game called Motorama. Most of the performances in the film amount to cameos by recognizable actors and actresses, with only the kid getting any real screen time. Although ultimately the film doesn't really go anywhere it's an interesting trip to watch. Be warned that although Drew Barrymore appears on the video box she's only in the movie for about eight seconds. *** out of *****","This is a great, dark, offbeat little film, a modern day adaptation of the quest for the Holy Grail myth. It's a sleeper if there ever was one. I saw it on cable some years ago and taped it. I've loaned it to many of my friends and everyone loved it.","This is an entertaining surreal road movie. It was written by Joseph Minion, who also wrote After Hours, Martin Scorsese's excellent surreal film. The film follows the adventures of a ten-year-old kid named Gus, who drives a red Ford Mustang across some fictional states with names like Tristana (A tribute to Luis Buñuel's film, perhaps?), Essex & South Lyndon, in search of eight elusive Motorama game cards from various Chimera Company gas stations. The film has a surreal feel to it because a lot of the things are unusual, like the money for instance, which is like blank paper with numbers on.Most of the characters are nasty to Gus on his trip. They tattoo him, punch him, but this doesn't stop the kid on his relentless quest. Some oddball actors like David Lynch incumbent Jack Nance, Meat Loaf & Flea also make appearances. Jack Nance plays a motel owner, who when he first meets Gus tells him, \"If you see any squirrels, give them to me\". This is a movie where a man and his wife abandon their young children because the man owes Gus $100; and a mother encourages her son to raise his voice louder while speaking rudely. If you're a fan of Twin Peaks and surreal movies, you'll like this. An odd little gem of a movie.","Madness. Pure madness. Isn't it beautiful? Motorama is one of the strangest movies you might ever see. The dark overtones, mixed with the purely bizarre story make this a definite must see for fans of the weird and zany. A very funny movie!","I watched this film late at night on an independent station. When I saw the title, I wasn't very interested. But, the idea of a 10 year old driving intrigued me. Quite the strange film, but I enjoyed it. I really recommend it.","This movie may be the best ever if you like watching movies and laughing and then subjecting your friends to watch those movies too. If you're anything like me, and you probably are, you'll be laughing for years to come at the jokes in this movie. One of the funniest parts is when Gus sharks some money off a guy with kids and then the guy takes those kids into the forest like Hansel and Gretel then he and his wife go home with them. The soup scene kitchen is rife with comic genius of buffoonery: \"Inspection officer -- Here!\" and the lines to follow will stay in my mind forever probably. When I have shown this movie to my friends, they usually say \"What was that?!?\" so if you're in the mood for one of those types of movies, yippee! This movie is so OOP it's not funny anymore, so probably the easiest way to get it would be online auctioning. The first time I saw it was from a rental.","Motorama viewers should already by keen on other offbeat b-grade desert-based films such as Bagdad Cafe or Repo Man (which more or less takes place in the desert). It also models some of the bizarre humor (and especially eccentric trail of characters) of writer Joseph Minion's comedy, 'After Hours.' In a sort of desert roadtrip fantasy, a metaphor of temptation and redemption, Gus (played well by Jordan Christopher Michael), a clever 10 year-old boy cashes in his piggy bank, steals a Mustang, and runs away from his grossly neglecting parents. It begins as a trip through salvation (which is apparent in the scenes with John Diehl), but once he becomes hooked on a scratch-off game called Motorama, he becomes easily tainted by temptation and looses his childish innocence. He travels from one crazy fictional state to another concocting ways of getting Motorama cards from participating gas stations, just enough so that he might spell out the prize winning word M-O-T-O-R-A-M-A and be eligible for the $500 million cash prize.Along the way, he is embattled with dozens of strange characters such as Flea who plays a high strung busboy, Meatloaf who plays a crazy biker, and Mary Woronov and Sandy Baron (a Seinfeld regular) as two violent kidnappers. The DVD rerelease can be very deceptive, as have previous attempts to sell this film to the non-cult market first with taglines comparing it to Home Alone and Thelma & Louise. The newest calling it a love story with the tagline implying that the film is about Jordan Michael Christopher on an adventure to meet the girl of his dreams...which, despite the size of her picture on the DVD cover, is actually only about a 1 second cameo by Drew Barrymore as the fantasy girl that Gus dreams about. Why didn't they just market it for what it was? Thought it may seem totally bizarre on first viewing, it is actually a well-designed narrative. Motorama is great material for fans of strange b-grade comedies. This was quite an interesting story, and particularly because of the strength of its lead actor--Jordan Michael Christopher (who unfortunately has few other screen credits of note)--and the clever metaphor inherent in the plot. Hopefully its re-release on DVD will make it an easier find for cult fans.","(Some spoilers included:)Although, many commentators have called this film surreal, the term fits poorly here.  To quote from Encyclopedia Britannica's, surreal means:\n\"Fantastic or incongruous imagery\": One needn't explain to the unimaginative how many ways a plucky ten-year-old boy at large and seeking his fortune in the driver's seat of a red Mustang could be fantastic: those curious might read James Kincaid; but if you asked said lad how he were incongruous behind the wheel of a sports car, he'd surely protest, \"NO way!\" What fantasies and incongruities the film offers mostly appear within the first fifteen minutes.  Thereafter we get more iterations of the same, in an ever-cruder and more squalid progression that, far from incongruous, soon proves predictable.  Not that it were, on the other hand, literally believable-- but it were unfair to tax Motorama in particular with this flaw, any plausible suspension of disbelief having fallen precipitously on the typical film-maker's and viewer's scale of values ever since \"Raiders of the Lost Ark\" became a blockbuster.\"Hallucinatory\": How do we know what a hallucination is if part of having one is not knowing that we are having one? At any rate, some people know that they enjoy \"hallucinogenic drugs\"-- but if Motorama typifies the result of doing so, then I'm at a loss as to why anyone would take them more than once.  There is, of course, the occasional bad trip.  The movie must be one of those, pun and all.\"Juxtaposition of words that was startling\": How many times can a ten-year-old startle you by uttering \"Oh, my God!\" when he likes something, or \"Damn!\" when he doesn't? These two interjections are about par for the course with this script.  Sadly, any sense of the surreal in what passes for dialogue could only reveal, in direct proportion, one's naivete regarding the speech patterns of the rising American generation.\"A world completely defined and minutely depicted but that makes no rational sense:\" Motorama's world indeed makes no sense, but it is about as completely defined as a cartoon in an elementary school newspaper.  The numerous guest stars in the cast all have cameo roles even less intelligent than our little hero who exclaims \"Damn!\" in the blink of an eyelash but needs several seconds to concoct the lamest lie. And even *his* character, despite appearing in nearly every scene, gets no significant development. Here's scant reward for any viewer who sympathizes, as I must, enough to wish to know him better and understand 'where he's coming from.' One vaguely senses a far better story and protagonist struggling to get out.\"Fully recognizable, realistically painted images are removed from their normal contexts and reassembled within an ambiguous, paradoxical, or shocking framework.\" No, we see a succession of stereotypical and ever more dilapidated billboards, filling stations, greasy-spoon eateries, cheap hotels, and their lowlife habitues along country highways, exactly where they stereotypically belong.\"Largely responsible for perpetuating... the traditional emphasis on content.\"  There is little content, moment-to-moment, in Motorama.To sum up: Picture British millionaires dressed as clowns or pirates on the way to a posh costume party, sitting serene and mute as cautious chauffeurs inch their Rolls-Royces like fragile skiffs through a roiling sea of desperate humanity, Chinese who implore them through the windows and smear the glass with blood.  Or imagine a stadium full of abandoned antiques, limousines like those above now rusting, and white pianos tinkled by ghosts. Into this detritus wander an exhausted boy and an ailing woman to whom he clings as mother-figure becoming girl-friend, who fall asleep side by side on the grass.  He is awakened-- on the Feast of the Transfiguration, \"white and glistering\" day 1945-- by a brilliant flash on the horizon that is not the rising sun.  Finding that his consort has become a corpse, he first believes that he has witnessed her soul going up to heaven.  Later he explains only a little less innocently, 'I learned a new word today: atom-bomb. It's like God taking a photograph.' Now, *there* are just two samples of cinematic surrealism, surrealism whose ironies ripple out far enough to invade its film's very title: Empire of the Sun.  If you seek surreal, *please* don't miss it.  Alas, however hard he treads on the accelerator to race his chariot through and beyond the desert, no scenes so exquisitely strange, rich, subtle, or gorgeous await Motorama's poor little Gus in his quest.None of the above necessarily constitutes a thumbs-down on this film. Though somewhat disappointed, I can't dismiss it, in view of the respectability of another genre that it does exemplify-- one influenced, to be sure, by surrealism, but also by expressionism, existentialism, and Franz Kafka's pessimism amidst omnipotent power structures. Let's try on for size: Theater of the Absurd.Turning to E.B.'s article on this style, I am amazed by how, to the extent that Theater of the Absurd is a valid artistic style, the above objections to Motorama vanish like a puff of smoke.  I'm tempted to quote the entire text as support of the identification.Theater of the Absurd attempts to show \"that the human situation is essentially absurd, devoid of purpose...  humankind is left feeling hopeless, bewildered, and anxious.\": Having instantaneously achieved his purpose of getting away from a depressing home life among bickering parents, Gus finds himself purposeless until he drives past a glittering billboard reading \"Motorama\" and decides to win the lottery that it promises.  As others have already revealed, this ambition proves illusory: although the game \"never expires\", the sponsoring corporation has no intention that anyone should ever win, and has ways to trick, confuse, and leave crestfallen any aspirant to the reward.  He, like others, is ultimately disappointed in his dream.\"Absurdist playwrights, therefore, did away with most of the logical structure of traditional theatre.  There is little dramatic action as conventionally understood; however frantically the characters perform, their busyness serves to underscore the fact that nothing happens to change their existence...  a timeless, circular quality emerges.\" \"Language in an absurdist play is full of...  repetitions...  repeating the obvious until it sounds like nonsense.\" Underneath a sometimes \"dazzling comic surface,\" we find \"an underlying message of metaphysical distress.\" Gus's obsession with a silly game, his inane language, the plot device wherein he divines a bleak future and/or returns to an earlier moment and takes a different but still bleak turn-- so much fits now.  While an admirer of the surreal would do better with some films, anyway, of Spielberg, admirers of Motorama as it really is should find fellow-travelers-- not instead but addition-- in the works of Beckett, Ionesco, and Genet.But one can't quite stop here.  After his disillusionment with the game, Gus returns to \"Phil\" (i.e., Love), the first attendant he had met and the one person who had treated him decently, although he had also scolded him-- at a service station advertising \"Be full-filled!\".  Under Phil's tutelage he learns a life of waiting for cars.  We might note here that the absurdist playwright Beckett had entitled his most famous play \"Waiting for Godot,\" and that for Godot we should read \"God.\" God is one of Phil's preoccupations, too.  Furthermore, as the indirect result of his previous encounter with Gus, Phil is badly maimed and goes about in a cast with his arms straight out horizontally.  In the last scene, Gus, now Phil's protege, says that he wants to hear music.  We hear none, but we see Phil wiggling his fingers at the end of his outstretched arm, beckoning Gus closer, and Gus responds.  The End.Finally, on to an author whom I happen to be reading currently, the Anglican theologian William Stringfellow.  If this rebel-lawyer is not acknowledged as an architect or undergirder of Liberation Theology, which is more a Roman Catholic than an Anglican movement, perhaps he should be.  Police brutality and corporate greed are a cliche in cinema and literature, including Motorama, but Stringfellow supports and illuminates such sentiments with impressive warrants from scripture, tradition, and reason.His most significant work is an expose of the earthly activities of those fallen angels whom the Bible refers to as principalities and powers. Principalities, wrote Stringfellow, are behind all of our popular three I's: Images, Institutions, and Ideologies.  All of these commend themselves to our worship by making false promises.  The more deeply involved with an image, an institution, or an ideology any person becomes, the more his own personhood becomes \"depleted\" and be becomes a slave to them.  Promising power, control, and immortality, they inexorably deliver helplessness, chaos, and death.  As essentially fallen, defeated powers, they can do no more than that.  Yet they beguile humans with that \"dominion over the earth\" promised by God in the book of Genesis, while in fact no one of us controls an image, an institution, or an ideology bent inevitably on its own hegemony and self-preservation. They take on lives of their own.  \"Dominion\" happens to be a mistranslation: a more accurate rendering of the Hebrew would be \"stewardship.\" But this is a quibble beside a more fundamental problem: Most of us neglect to notice that God had delegated this power to Adam *before* the fall.  We have no reason to assume that we, his descendents, still exercise it now: on the contrary, it should be obvious that demonic forces have stolen it from us.One might add two observations of C.S.  Lewis: First, that \"man's conquest of nature\" is a mere illusion, and a ruse to cover the fact that one is really talking about the conquest of some men by other men with nature as the instrument; and secondly, contrary to popular belief, Satan is no kind of good-time Charlie.  He may dangle out pleasures at first, but he is very niggardly with them and will withdraw them from any human firmly in his thrall, perhaps leaving his prey sitting in front of the fire feeling miserably sorry for himself and seething with resentment.Now, applying these insights to Motorama, we seem them mirrored remarkably in Gus's experience.  He is, if not nice, at least a pretty little boy prior to falling victim to the Motorama game.  The first signs advertising it glisten glamorously.  The longer he continues, however, and the deeper he journeys towards the sponsoring corporation's headquarters, the more shabby they become.  He's lonely, meeting no one else who plays the game.  The stations giving out the cards have either fallen into ruins or are staffed by zombies.  The people he does meet along the way are more and more ugly, deceitful, and hostile.  (The fact that the principalities answer to a common dictator does not mean that they can abide one another).  Gus's humanity is leached out of him as he becomes not only totally self-centered and oblivious to the needs of others but partially blinded... disfigured... prematurely aged while infantile in the literal sense of linguistically challenged.  Eventually even his precious Mustang is taken from him in a crash, and he must continue in a dead man's wreck.  Yet at long last, having done everything he thought was expected, he presents himself to the principality in its proud tower to receive his prize.  Using the biblical power to confuse wielded by those who have built such monuments to their own vanity, its agents evade him, disappoint, insult, and finally throw him from the top floor.  He FALLS long and hard, landing, finally in a body of water. In other words, in classic symbolism, he DIES.  He has met the inevitable bad end of anyone who has put his faith in such a deceiver.But this fate proves to be only a warning look into a mutable future. He repents and returns to Phil, and upon seeing him performs the very first generous, selfless act we have seen from him for almost an hour and a half: noting that Phil is now handicapped and hardly able to insert a hose into a gas tank, he asks, \"Can I help you with that?\" Then, seeing the \"help wanted\" sign, he decides to apply for the job, explaining to the motorist with whom he was hitch-hiking that he reckons he'll get out here, because it doesn't look like too bad a place to work.This interpretation is conjectural, of course, and it may surprise or even outrage the film's \"cult classic\" aficionados who see quite different points in it.If Motorama isn't quite my cup of tea, I'm at least convinced now that it's hardly the worst film ever made.","This oddity contains Bunuel-like touches, but doesn't sustain one's interest. A 10 year old roams a bizarro America in a stolen Mustang, while the usual cult movie suspects (Dick Miller, Mary Woronov, Susie Tyrell) commit malicious acts in the name of comedy.  Like his AFTER HOURS and VAMPIRE'S KISS, the screenwriter delights in making you squirm.  I remained unaffected, due to the broad acting.  You know you're in for it when Meat Loaf and Flea give the most appealing perfs.  (And what did this kid's screen test look like?  He's insufferable.) Recommended to the dozen or so fans of SONNY BOY ('87).","Some movies are off-beat, but enjoyable, but many movies are just mind-numbingly weird.  \"Motorama\" fits not-so-nicely in the latter category. Many seem to like it because of endless guest appearances and a total lack of sense, but those two things can only take a movie so far, and \"Motorama\" simply doesn't have any other merits to its credit.\"Motorama\" delights itself on plot improbabilities.  Its main character, Gus, is a cussing 10-year old on a roadtrip across an imaginary country trying to collect game pieces to win $500 million.  When interacting with adult figures, none of them seem to notice or be concerned with the fact that he's 10 years old.  At first it's incredibly funny, but it quickly becomes just too unbelievable, especially considering the people he runs into and the fact that he seems so unfazed by a lot of the disturbing (to someone that age) imagery going on around him.  Gus has no depth, and, as an anti-hero who has no problem causing misery for others to get his game pieces, it's hard to feel sorry for him when he encounters trouble.That trouble is provided by a slew of guest appearances, each mistreating Gus in more and more strange ways.  Besides making the already worn-out plot even more unbelievable and less enjoyable, the characters share Gus' lack of depth and are equally unmemorable.  The character's actions can get a little interesting, but the actors themselves don't add anything to them, thus negating the whole point of getting big names (they could've been played by anyone and the character would've been the same).  These guest appearances seem to have been signed more for marquee value than anything else.\"Motorama\" should be interesting - it's a unique idea, but there's too little semblance of sense in the script for it to work.  Incidents that should have a lasting effect on the anti-hero and the viewer don't, as the movie quickly moves from incident to incident, in the hope that something will eventually make the audience feel sorry or understanding for Gus.  That never happens, as by doing so nothing is allowed to connect, it just jerks back and forth as if on a conveyor belt, one incident after another.  With a story so nonsensical it ceases to be enjoyable, and a main character who never evolves to care for himself or anyone else on a higher level, \"Motorama\" has little to offer except a brat sneaking around and trying to get rich.  Why should we care about that?","On the theory that you don't have to understand everything about a movie, \"Motorama\" succeeds. The story of a 10 year-old boy on an expedition is filled with interesting sights and people, and there are few points in the movie's road where you can see straight ahead. The camera has recorded lots of little details, so keep your eyes open--the kid's roadmaps, his money and especially his hair towards the end of the movie. On a broader note, you'd think a child driving a vintage Mustang would draw lots of attention, but not in this film. Somehow everyone treats him as just a \"little person,\" and pretty soon that's exactly what you believe, too. Overall, a very nice movie with lots to see, and a quiet pat on the back","A 10 year old kid fed up with his parents arguing decides to hot wire a car and go on a surreal journey across America to find Motorama cards, which is a gas station card game, that if he can find to spell out \"Motorama\" he has a chance to win 500 million dollars. He meets many bizarre characters along the way. No one can make an 'instant cult classic', Joe Minion's previous \"After Hours\" achieved that by sheer merit & an amazing director, but it wasn't instant. This movie, on the other hand, is just bizarre just to be bizarre. No rhyme or reason to any of it. The plot is incidental at best and seems to exist just to showcase various cameos. It's just not a fun film nor a thoughtful one. It's way too slapped together. I've heard many comparisons between this and David Lynch films. That's damn near heresy as even Lynch's 'worst' film (worst in quotes, as he doesn't have an bad films really) is still miles above this dreck. Eye Candy: Cynthia King is topless very briefly DVD Extras: Trailer for \"Joe Dirt'","I loved this movie, I saw it when I was about 8 years old and almost seven years later, this evening I got to see it again. I really thought it had an interesting idea, they only thing that upset me was the ending which I felt was a cop out. 'Round here it's hard to find this movie and I was lucky enough to have seen it on BRAVO. I also expected to see more Drew Barrymore in here too!","While I would admit that there might be some people out there who might like \"Motorama\" and consider it something of a cult classic, I have to also admit that this movie didn't do much for me. It is too quirky for its own good. We have a central protagonist that we learn almost nothing about before he starts on his long road journey. He encounters a lot of weird people on the road (some of them surprisingly mean-spirited) whose appearances don't seem to have any point. And the end of protagonist's quest is unclear, though it seems to indicate that it was an utter waste of time, making the 90 or so minutes following this character a waste of time. If you want to see a GOOD road movie about a character encountering weird stuff during his journey, seek out a copy of \"Interstate 60\" instead.","This has got to be one of the most magnificent things I've ever seen on film. I don't know if it's as serious as it seems to try to be, but that hardly matters. This film is extreme, absolutely wild and surreal. The packaging and the marketing only make it more so because you *know* that ever so often some mother has to reprogram her kid to accept our reality after he checks this out from the video store expecting something completely different. Look at the roadmap, for one thing! And where else in America can you see a ten year old kid swear as much as this one does and then get his eye ripped out by pervert the rival of Pulp Fiction's Zed? And that food inspector scene is the best! The amount of well known to vaguely recognized actors in this film is one of the best things about it: Soon, much sooner than you realize, you too will find yourself saying, \"Is that Meat Loaf? Is that Drew Barrymore? Is that the holideck doctor from Star Trek: Voyager? Is that Flea? Is that the sawmill owner from Twin Peaks gassing squirrels with car exhaust? And isn't this guy from the new Rob Zombie movie? He looks an awful lot like Shrek.\" I think my favorite scene is at the very end, with Phil in a full body cast. I mean, please, why aren't more movies like this shown in airplanes? This director hardly has anything else to his name higher than Return To Salem's Lot, but he displays true stumbling man-child genius in this creation! If you're an intellectual looking for something to p**s away your evening on, I highly suggest this film for satisfaction. This movie's plot is all too ridiculous, but imagine it taken out of context: *boy arm wrestling an over aggressive Meat Loaf, who seems hell bent on taking out his anger at not being accepted into Guns N Roses, looks over his shoulder and sees the doctor from Voyager enter the bar* Can you imagine what any half brained channel surfer active through the last six years would think of seeing that? Now imagine if you actually cared about Meat Loaf or Voyager to begin with! Or imagine if you're a Flea fan. Rocky Horror Picture Show fans, this film contains notable music, mind you, but its soundtrack is more plasticine than Mad Max 3. What does that entail for you? This is the retarded, inverted mongoloid cousin-sister-mother-puppy of The Rocky Horror Picture Show. How about when Gus' sleeve flies back onto his arm in an act of cable-access special effects quality mastercraft? When I saw this film, it was on the suggestion of my cousin who had watched half of it in a fit of half-aware childhood in the early half of the nineties and who has since been haunted by vague memories of it, I myself had not slept in three days. It made me laugh! Of course, it's also an anxiety movie. The music doesn't encourage the suspense but it eventually gets to the point where it's been fully established that the American Censorship Committee has obviously missed this film entirely and absolutely anything can happen in it and probably will any time Gus turns a corner or the view so much as changes camera angles. I found myself obsessing over the possibility of those cards flying out his window at any second. Watch this movie. Awesome!","I'm not going to say too much as this movie isn't worth the effort.  To put it simply the movie absolutely sucked!  This is the worst movie I have ever seen.  The storyline was stupid, you couldn't follow what was happening, the characters were so annoying especially the main guy.  I wanted someone to kill that kid and put him and the movie out of it's misery.Very, very bad.","Allow me to explain my summary.  When i say that \"Motorama\" is number one on my list, it is number one on my \"worst movies ever\" list.  I have shown this movie to many of my friends, simply so they will say that it is the worst film ever made.  So far, they all agree.  I do encourage people to see this film at least once, just to bask in the stench this film exudes.  It lacks plot, promise, and point.  I have had more enjoyment watching ants run about carelessly than I did when I sat down and saw this movie.  See it, and then agree with me.","I caught this on cable one late night in the early/mid 90's. May have been Cinemax's Vanguard Theatre ( where they would feature cult, B, art house, etc.)but I can't remember.It starts out with scenes of a kid making something wood and metal in what looks like a basement while his parents are violently arguing upstairs. At first, it's hard to tell if the voices are flashback and the metal and wood creation are some torture device of a deranged psycho or perhaps the kid is going to use the device he's building to kill his arguing parents. As it turns out, he is making leg extensions so that he can run away in this candy apple red 60's era Mustang.From there it becomes a surreal road movie where the boy stops at various gas stations to play some long forgotten sweepstakes game. You get a certain number of gallons of gas from Chimera Gas Stations you get a game token and peel off the sticker, you collect letters and if you spell out MOTORAMA, you get a visit and tour of the Chimera headquarters.Along this odyssey, he runs into the freakiest cast of characters to ever inhabit the deserts of the American southwest. He comes across a variety of oddballs at rest stops, diners, gas stations, and roadside attractions. None of which seem to realize, or at least acknowledge, that he's a young pre-teen kid.One of the scenes I remember as particularly bizarre was a married couple pick him up, act overtly sexual towards him, and I believe, drug him. When he awakes, they apparently have given him a tattoo.Eventually he makes it to Chimera HQ but it turns out they want to renig because no one was supposed to make it that far. My memory is a little fuzzy on the exact ending.I have been looking for this movie off and on for ten years and every time I would describe it I would get blank stares as I tried to describe the whacked out plot to people. Apparently it is on DVD now so I can check one more off my wanted list.I urge anyone who is a fan of offbeat black comedy road movies, to find this and watch it!","Although this film never attained commercial notoriety, my experience has led me to conclude that many well-done pieces of artistic expression often do not gain mass appeal.  The story line depicts a young boy stealing a car and embarking on a surreal, dream-like adventure with very little basis in our conceptualization of time and space.  Therefore, anyone who attempts to view this film from the perspective of its conformity to reality will likely be disappointed; it is not intended to be \"realistic.\"  It is, however, intended to be metaphoric with extensive symbolism apparent to those with superb attention to detail.  In addition, the symbolic representations are left open for interpretation, which can be said of much great artwork. Don't be fooled by the cover (if you happen to rent or buy this film)-- the movie is not what it might seem to be on the surface.","This movie is incredible. It is one of the few truly unique films out there, and I can't believe I hadn't seen it until just last night. It doesn't fit into any trite movie formula, but it's also not meaningless fantasy. Motorama truly has a hypnotizing effect on the viewer. You become as obsessed with trying to figure this movie out,as the boy is with winning motorama. I love how this film is pure metaphor and completely disregards reality. It takes place in a completely fictional world. Even the names of the states and the money are fake. And yet there is something so familiar about that world. I won't say anymore about the plot, but I just highly recommend this film to anyone who appreciates an original and strange story."],"review-user":["comquest","Mad Mark","thinker1691","Infofreak","NateManD","westpac","jlee-1","Afracious","Matt-162","parodytonite13","solicitme","vertigo_14","Cantoris-2","Zontar-2","EdYerkeRobins","Edit848","movieman_kev","MikeK-7","Wizard-8","JumpyRoo","kylemcd77","fatchex","ajpunkahontas","gumplord","danielle81"],"review-date":["1 September 1999","21 February 1999","13 March 2013","31 July 2002","30 July 2005","15 March 2003","5 March 2003","2 February 2000","25 December 1998","6 December 2001","25 December 2004","18 December 2005","7 June 2003","18 March 2004","7 July 2002","23 August 1999","8 February 2008","22 August 1999","19 September 2011","4 June 2001","14 March 2002","28 March 2001","5 April 2007","27 January 2000","29 September 2000"],"review-rating":["7","10","8","9","9","10","8","8","7","4","3","3","10","10","1","10"],"review-title":[" Don't even try ...\n"," The strangest, most bizarre, and best movie ever starred by a young boy.\n"," \" Getting on the road to hell, all one has to do is believe \"\n"," One of the great \"lost\" road movies.\n"," I enjoyed this crazy road-trip!\n"," Offbeat\n"," Mythic\n"," An entertaining surreal road movie\n"," Genius!\n"," Shocking!\n"," Don't do drugs, you have this movie instead\n"," A drastically offbeat road trip tale of temptation and redemption is a sure cult classic. (spoilers)\n"," More absurd than surreal, with significant Christian symbolism\n"," Spins its wheels\n"," A Selfish Brat and His Bizarre Adventures...Huh?\n"," Scratching your head isn't a bad thing...\n"," When off-beat becomes off-putting\n"," Great!\n"," Quirky without substance\n"," Beautiful!\n"," Worst movie ever\n"," A look at a film that is number one on my list.\n"," Strange and Bizarre but good\n"," Brilliantly done art flick!\n"," A unique and amazing experience.\n"]}