{"review-url":["http://www.imdb.com/title/tt0101656/reviews"],"review-text":["Although some people might think this was a \"Die Hard\" rip-off, this movie actually came out BEFORE \"Die Hard\".What makes this movie an above average movie is quite simply: the direction and cinematography.Director Stephen Hopkins (years before he directed \"Predator 2\", \"Blown Away\", and executive produced the TV series \"24\") creates a lot of tension from with his unique style -- which can be seen later in \"Predator 2\" -- but he failed to stick to this same kind of style with later films he directed -- which is very disappointing. And considering this was his first feature film (he was the 2nd Unit Director on \"Highlander\")-- he makes this film look like he's been directing for years!Peter Levy's cinematography is BRILLIANT! He's still, in my opionion, one of the BEST cinematographers in the world! I'll see anything that Peter Levy is the DP on.So, if you're in the mood for a \"Die Hard\"ish kind of film -- that looks good and has a lot of tension, this is the movie to see. It's a very underrated thriller that didn't get too much attention in US (it's an Australian film).","This is the story of a maniac cop who, for some reason, has it in for a young college stud and his mates. After they report him to his supervisor who in turns suspends him pending psychiatric evaluation, he finds an opportunity to psychology torture them when, on a bet, the kids hack into a department store's security and unlock the door. Only, they get locked in the store, along with the weirdo. Murder and mayhem are afoot, and the kids are running around trying to survive until morning when they may be able to escape.'Dangerous Game' would have been a successful cat-and-mouse psycho thriller probably if it was set in a different location. The thought of psychotic cop chasing around a bunch of innocent teenagers in a department store just didn't work. Especially when he comes face-to-face with his flinching prey quite frequently and yet, does nothing serious quite often. There was no real confrontation as would be sufficient for this kind of story, and may've worked better if say, for example, the teens were loose in the neighborhood and left to fend for themselves against this weirdo (especially if that took a few days while he makes them increasingly paranoid...although granted, even that is clichéd).What a shame, too, that it could not have been a better thriller, considering a funky cast of young Australian characters. Even a light hearted adventure despite the madness of the villain interspersed through the picture might have even made it a more satisfying picture. Instead, it started out fresh, and sure did have plenty of action sequences, but wound up verging on the ridiculous.","A young computer expert and his friends manage to disable a department store's security system so they can break in for the thrill of it.Once inside they find themselves stalked by a killer-a deranged police officer(Steven Grives)that the teens had caused to be suspended from his job earlier that day.\"Dangerous Game\" is fairly exciting Australian slasher/thriller with some lush photography and stylish crane shots.The film is relatively bloodless and our psycho cop kills only one teenager during it.Still there are some suspenseful chase scenes and the location sets provide some suspense.The characters behavior is sometimes pretty silly and illogical,though.7 deranged cops out of 10.Watch this one in pair with \"Maniac Cop\" or \"Psycho Cop\".","See where it all began for Aussie director Stephen Hopkins - \"Dangerous Game\". Australia's Psycho Cop, but without the wisecracks. You can't help but think the film's craftsmanship caught the eyes of the Nightmare on Elm Street 5: The Dream Child producers for them to hand him the gig. Watching his debut feature, I can see why they did.This gripping little homegrown suspense-thriller with a few offbeat strokes uses a very familiar set-up (Uni-students in a department store after hours being stalked by a mentally disturbed individual- a police patrolman - with an axe to grind, and no, not literally). Don't go looking for a body count, let alone slasher as its slow rhythm virtually plays out in a long-winded cat and mouse concept. What starts harmless, turns into damage control when the harassment leads to something fatal.The premise is straightforward, and fairly slight on the exposition with an inkling of dementia from an antagonist with more than a few loose screws, but it's Hopkins' stylised direction and camerawork leaving quite the lasting impression. By the end the plot simply eroded into a canvas of see what sticks. Its use of imagery and a fruitful principal performance (an excellent Steven Gries) is where the excitement mainly lies. Visuals show creative flair in camera positioning (as if it's on a string) alongside hue lighting and slow-motion. Nothing quite like the firepower of a shotgun, and not just one, captured in slow-motion. The colouring on screen at times can be vibrant ( definitely the toy section sequence) and some tension infused set-pieces (anyone for dominoes, or rooftop stroll?) are spectacularly presented for such a minor low-budget production.I would love to see this film get a restored bluray release in the near future, as I think it would scrub up rather well.","David (Miles Buchanan) and Jack (Marcus Graham) are two good friends attending college. Jack works out and David knows computers. They are on the onset of dating Kathryn (Kathryn Walker) and Ziggy (Sandie Lillingston). There is also a psychotic suspended police officer named Murphy (Steven Grives) who has it in for Jack and anyone he knows. This isn't a who-dun-it. We know Murphy is the killer (see DVD cover).The kids, on a bet, enter a huge department store at night, only to get trapped inside by the creepy Murphy. Like Val Kilmer in \"The Traveler\" Murphy likes to whistle, except his tune is \"When Irish Eyes are Smiling.\" The film manages to generate suspense.If you like kids in a store, try \"Chopping Mall.\"Parental Guide: No sex, nudity, or F-bombs.","A group of teens that have broken into a huge department store, are attacked by a crazed police man. Exciting and suspenseful throughout and refreshingly devoid of extreme violence and gore, but those Aussie hairstyles and accents are a bit much to take. And they can induce headaches. But this is still a good thriller. 7 out of 10.","Back in the 1980's when you wanted to watch a cheap and cheesy little B movie, the only label that really delivered the goods on the home video front was the late great home video company Medusa Home Video(anyone in the U.K who might happen to read this review will instantly recognise the name) Medusa Home Video thrived on releasing some really good and seriously off the wall movies that would never ever see the light of day.If it's was Italian action movies(Warbus & Blastfighter spring quickly to mind) then it was sterling efforts emerging from down under, some might not have been very good, but you can never fault the overall commitment when it came to movies like Kadaicha, Out Of The Body.It is true what they say, for every miss-fire, you will inevitably discover a little gem, and as such Dangerous Game certainly delivered the goods.At the time I wasn't familiar with the name of Stephen Hopkins(then again who was) but after this movie Mr Hopkins received the call from America and made a few decent genre movies(Judgment Night, Nightmare 5 & Predator 2) but with his directorial debut, Hopkins much like Russell Mulcahy displayed with Razorback, that even if you had next to nothing in the way of a budget, you could more than make up for in the way of style.That is not to say that the film had many flaws attached to it, Yes its true that the movies plot revolving around five teens being terrorised by a maniacal cop is in any way original, but it does help if you have the actor Stephen Grives playing the crazy arm of the law, who through every scene we get to watch and feel the emotional breakdown of this troubled law enforcement officer.It's been many many years since I last watched this movie, but it takes a certain something about a movie for me never to forget about it, Sundown - The Vampire In Retreat is one such movie as is Steve De Jarnatt's killer thriller Miracle Mile.What is that one thing you might ask? Well it takes a few things, a decent concept, some really good dialogue and as always some barnstorming acting. With every thriller you have to have a really good villain, and not since Inseminoid has Stephen Grives had the chance to exercise his acting chops but equipped with some exceptional dialogue, his freak out speech when he toys with Marcus Graham's character Jack and that of Kathryn when he realises that they have never seen a dead body before just rocks! When I had the movie in my collection, I always had to rewind that one scene just to hear every line of dialogue.What of the rest of the cast, yes it's true that Grives is the star of the show as the Irish cop working down under, but the young cast more than hold their respective own, Miles Buchanan(Bliss) as the computer nerd who holds a serious torch for Ziggy(Sandy Lillingston) and Marcus Graham who for the majority of the movie is the main aim of psycho cop Murphy psychotic attentions.Whilst not a very bloody movie, it does deliver, the Medusa Home Video cover was always the coolest and whilst this movie has all but fell beneath the radar, if you can find it, check it out and get ready to experience antipodean horror in your life.Ps, the ending promised a sequel, thankfully such a thing never materialised.A Dangerous but very true 10 out of 10 for this lost little Australian gem","Slick handsome thriller about a group of teens who break into a department story for the thrill of it all, but find themselves falling victim to a deranged police officer whom the teens caused to lose his job earlier that day. While this slasher is exciting and generates much suspense (while building up characterization too), at times I felt like I was watching a Die Hard ripoff.Rated R; Violence.","This movie mainly serves as a showreel for Peter Levy's vast talents as cinematographer, with some flashy moves by director Stephen Hopkins. That aside, the plot seems to pause occasionally for the lush camera-crane shots to end. Given a fairly by-the-numbers story, the acting is quite good, but its less entertainment, more visual candy.Both Hopkins and Levy have gone on to bigger and better projects, so someone liked this film a lot!","An exceptional performance from Marcus Graham as the crazed Jack...   A movie that will keep you on the edge of your seat and always guessing as to what happens next.  A must see for lovers of true blue Aussie Films."],"review-user":["vinnytman","vertigo_14","HumanoidOfFlesh","lost-in-limbo","nogodnomasters","bigpappa1--2","jamesbourke59","brandonsites1981","philth","Just_Me-3"],"review-date":["16 March 2003","24 November 2005","23 July 2012","22 June 2018","9 January 2018","20 May 2000","2 January 2012","16 September 2002","2 November 2001","5 October 1999"],"review-rating":["5","3","7","7","5","7","10"],"review-title":[" Good thriller!\n"," Australian thriller takes a dive. (spoilers)\n"," Psycho cop in the shopping mall.\n"," A nice looking debut.\n"," A policeman is all I ever wanted to be\n"," Good thriller\n"," Get Ready To Experience Some Horror In Your Life!.....\n"," * *1/2 out of 4.\n"," Eye Candy\n"," On the Edge of your Seat !\n"]}