{"review-url":["http://www.imdb.com/title/tt0198284/reviews"],"review-text":["This focuses around the lives of four women, all good friends, and their male companions. Each has a story, the men as well, everything links everybody to everybody and everything is being brought to a quick change after a trip the girls take to Palm Springs.Basically, the film is no different from other of the genre, but I liked the details. Brooke Shields is a divorcée that fears loneliness, therefore she bangs just about everybody to get to have a \"warm body\" next to her in the morning, but then can't really commit. As a man, I find these women are a blessing :), but she is not a happy person. Everything else that happens revolves around this crazy woman, but in the end we get more clarity over life and relationships, which is good.I can't tell if the acting was bad. It didn't seem to me. The script was a little inconsistent, but not more than any romantic comedy. It's a bit more depressing than most, which is good, because you don't get dreary romantic comedies every day :)It's worth a watch with the missis, especially if you have cheated on her or plan to ...","Brooke Shields did a superb job. She played her character with realism. Throughout the movie, I felt like I was on the sidelines, watching real people play out a real life drama. The clips of Dr. Drew Pinsky and Adam Carolla (playing themselves, as entertaining as they have always been) added additional comedic interest. Long before the movie was over, I turned on my VCR to begin recording...if only for the music credits. The movie contained a wealth of great songs. I thought many (if not all) of the characters were well played. The fact that it had a fantastic soundtrack made it an even more memorable movie. I have added this movie to my list of \"Good-to-great movies that I would watch again\".","On Sunday, my friend, Patty, and I went to see the first viewing of \"After Sex.\" Because it was being shown as part of the SXSW Film Festival here in Austin, our chances of getting in were risky because we hadn't bought $55 passes for the festival. We had been watching the schedules for weeks because we thought \"The Weekend\" would be showing. But, two weeks ago, \"After Sex\" showed up on the schedule with no warning or advertisement. Because it looked like they were quietly sneaking it in for feedback, we thought we'd take a chance. We arrived an hour early, and sure enough not many festival-goers knew it was playing- so they opened up the movie to general admission. We got in for $4! By the time the movie started, though, it was a full house.So, how was it? Not what I expected, which is a good thing. The movie is a fast-paced comedy about a group of friends: two married couples, one engaged couple, and a divorced woman. The film explores the relationships between men and women through these friends. The script is very fast-paced, and the camera angles are quirky. The soundtrack is excellent, and we found ourselves wanting to buy it as soon as the movie was over. Was it perfect? No. When the movie stuck to comedy, it was very good, sometimes hysterically funny. But, when it delved into the serious side of relationships, it was uneven. Not because of the writing, but because of the acting. All of the actors had great comedic timing, but a couple of them just didn't have the range to play \"serious.\" (Notably, Brooke Shields and Dan Cortese) But, thankfully, their crying jags were brief and didn't detract from the movie too much.And what about D.B. Sweeney? Terrific! He plays a husband opposite Virginia Madsen, and the two show the best acting of the movie. His character is this sweet lug who reads self-help books to make sure his marriage stays strong and, God bless him, he has no idea what to do with the information! He has some of the funniest lines in the movie, and honestly, I missed some of them because the audience was laughing so hard. When this movie comes out, be sure and catch the first scene with him and Virginia Madsen. I call it the watch scene, and maybe it was so funny because I'm married, but I was laughing about it even after the movie ended. These two also did a great job when the mood got heavier. The last scene with them is beautifully done, and it doesn't dawn on you until later that the two never speak a word.I think the movie will be a sleeper. The audience gave it a round of applause, and I'd love to see it again when it's released. There have been so few movies lately that are just enjoyable and fun to watch, but this is definitely one of them.","Usually when I review any film, good or bad, I like to comment on why I have the feelings I do. But in the case of this film I truly cannot be bothered. This film lacks good direction, has lame acting, a terrible script and starts to be become laughable and in poor taste. It also shows that the actors and actresses really have chosen a project that will bring a quick end to their careers. I am talking of people such as Brooke Shields (Suddenly Susan), Virginia Madison (from the great romantic comedy Electric Dreams') and D.B. Sweeney, so on and so on. So my rating for the film? CMRS gives About Sex': 0.5 (  - Bad Film) Why? Well quarter of that rating goes to the entire cast, crew and behind the scenes people for turning up for a few weeks and putting on a movie, albeit a disgraceful one. The other quarter, goes to the best parts of the movie, that of the two men talking in what looks like a psychologist's office. I have plenty of experience in such a place, and a lot of what these guys say makes plenty of sense. It is a shame the other parts of the film did not add up. Enough has been said already. Please beware. This is a film that you will most likely hate, with a vengeance, because I know I do.","Being a D.B. Sweeney fan, I've been on the lookout for this movie for quite some time.  I recently rented the video and found it very enjoyable.  It had some really hilarious scenes.  The dysfunctional lives of some of the characters was unsettling, but I think the movie also showed that it's possible to keep your life on track or get it back on track if it's been derailed.","I was pleasantly surprised with this one. It's actually quite interesting and engaging. The cast is strong, even Dan Cortese. Brooke Shields has come into her own as an actress. Black and White must have really set her free, 'cause I have never seen her in this much command playing a conventional character. If marketed right, could be a medium-size hit.","Brooke Shields -- in a departure from her \"Suddenly Susan\" duties -- plays a bitter divorcee who embroils three girlfriends in a \"girls only\" weekend in Palm Springs.  The problem: Brooke is \"unattached\" and on the prowl, while her friends are all involved.  Hence the title implications and emotional backlash their \"amoral\" weekend causes.Despite a few laughs generated by Dan Cortese (\"Victoria's Closet\") and MTV \"relationship authorities\" Adam Corolla and Dr. Drew Pinsky, this is somber stuff for women only. D.B. Sweeney, Virginia Madsen and Jon Polito co-star.","It's amazing that such a cliche-ridden yuppie angst film actually got made in the first place. The characters are so weak, and the acting so uninspired, that it's impossible to care about any of them-- especially Brooke Shields. The temptation to fast forward through the slow parts is almost irresistible. If you like this genre, you'd be better off renting \"Singles,\" or \"Bodies, Rest & Motion.\"","I caught this flick late one night while I was sick with the flu. It didn't improve my outlook one bit. \"After Sex\" is one heckuva dreary film focusing, in its own disjointed way, on the aftershocks of intimacy. Or at least thats what it tries, and fails, to do. I have to admit that the idea of having outsiders comment on the action ala Greek Chorus is interesting, but in this case its done in such a clumsy way that it actually hurts the production.The acting is the second weak point. The actors seemed to either be ham fisted over the top or phoning in their lines via collect call.The end result is something akin to what you'd get if Tommy Wiseau's \"The Room\" met and had a baby with \"The View\", and then complained about it for an hour and a half."],"review-user":["siderite","ilywymy","u00rul","Old Joe","lsw-3","Red66","brude2000","filmbuff-70","JillClarke2"],"review-date":["29 December 2005","9 November 2006","7 June 2000","28 April 2004","27 August 2000","8 April 2000","13 March 2000","30 August 2000","24 February 2011"],"review-rating":["7","5","8","3","2","1","3"],"review-title":[" I kinda liked it\n"," I thoroughly enjoyed this movie: Very realistic, and great music!\n"," SEEN IT LOVED IT WANT TOO BUY IT!\n"," If this is what happens after sex', heaven help us!\n"," Funny and sad\n"," Surprisingly engaging adult relationship drama\n"," A dreary, depressing relationship drama\n"," Cliche-ridden and uninspired\n"," Brooke Shields channels Tommy Wiseau\n"]}