{"review-url":["http://www.imdb.com/title/tt0116675/reviews"],"review-text":["Jaded starts out strong, but loses steam quickly and trails off into nothing. It raises a lot of interesting issues and then does nothing with them. Omitting the court scene at the end could be forgivable but leaving several loose ends without resolution was unsettling at best. Although for the most part those threads (such as what exactly the customers in the bar were paying $500 for) have fairly obvious conclusions, leaving them hanging in the air in that way robbed this movie of a satisfying conclusion. As it is it almost seems as if they ran out of money to film the courtroom scene and thus made a movie out of the investigation and then just tacked on a ending.The low budget for this film was painfully apparent - it seems almost like a student film. I've seen better production values in porno. Which is puzzling since for the most part the actors involved are professionals that are recognizable from more superior efforts (such as Aida Turturro from the Sopranos). Along with any sense of flow, the director failed to elicit good performances from her actors that we know can do better, with the exception of Carla Gugino, who seemed to be acting in a different film with the intensity that she brought to her performance. She was unfortunately the only thing enjoyable about this movie with a strong premise but no follow through.And shame on whoever commented that Carla was chunky - do women have to be anorexics with stick arms and legs to be acceptable? She's a gorgeous young woman and those kinds of comments are just ridiculous.","\"Jaded\" should not be considered as en erotic thriller because the sex scenes are not for viewing pleasure unlike movies like \"Indecent Behavior\" or \"Friend Of The Family\". \"Jaded\" is not an easy watch as it's story is difficult to conceive and it's not that common in society. From the beginning of the movie, with the first scene, you expect more strong scenes. The raping scene wasn't (in my opinion) a well created scene. I think that the director didn't use proper camera techniques overall in the movie. That's why it looks sometimes dull and becomes boring almost near the end.The performances are extremely good from all the five female characters. These women gave strong, intense, but believable performances that demonstrate the actresses' dramatic abilities. The legal concepts helped a lot to understand the plot's difficulty because the legal term of sodomy is different from a simple raping. From the point of view of Meg's defense, sodomy needs to be penalized as a raping (a huge crime grade B) although it's a different crime. Pat and Alex's defense claims that Meg enjoyed and asked for it. This is where the movie turns interesting to see who is trying to tell the truth. The only thing for sure is that the sex scene fits into a legal definition of a crime. Watch \"Jaded\" if you like legal issues that aren't very common in your society. If not, give it a try because it's a very good and strong drama.","\"Jaded\" takes on the complex question of abuse: the perpetrators and the victims. In lesser hands it would have degenerated into an erotic thriller made for direct-to-video. This director, however, has managed to pull off a textured multi-layered study with a decidedly different point of view.Given the fact that the director/writer is a woman and the main detective and D.A. are also women, this could have turned into a very anti-male film. It is not. To be a sexual predator IS gender neutral. The nudity of this film is not erotic. The rape is brutal not sexual. We are looking at victims and not titillation.The gifted cast rings true. For a film that is so little known, I was surprised at the quality of the performances. They are good. Carla Gugino and Rya Kihlstedt are incredible.Somehow, this film got lost. Perhaps it is too smart for its own good. It is a \"should see\". Highly recommend. A thinking person's sexual thriller.","I disagree with the other comments made about this movie, because I didn't think the movie was all that bad, I mean, it had a good point to it, which is in the tagline, not all preditors are men, which goes to show us women that we shouldn't just go hating men because they rape women, because women can just as easily cause just as much physical and emotional pain from the damage of rape. Before I watched this movie I didn't even KNOW it was possible for a women to rape another women, so it's opened my eyes WIDE open. I also thought that Carla Gugino's acting was excellent too, she must of had to dig deep to do this role. And I didn't think the rest of the acting was all that bad either. My overall rating of this movie, would probably be 7/10 which is farely good, since not many movies make it past 5 and 6. If you like an intense film about rape, you would like this one. The only foibles I had with this movie was as was mentioned earlier, the \"no show\" court case that everyone expects, they shouldn't have let the chase for the offenders gone on so long, so that they could have fit the court scene in, it just would have made the movie so much better.","From the comments below, this movie apparently was not well-liked. With the subject matter being unusual, and some might say salacious, I get that many people may figure it as exploitative. I did not really see it that way. The film was clearly low-budget, and that did hurt it somewhat. I thought that a lot of the actors did fine jobs, if not Oscar-worthy. Rya Kihlstedt did well with a challenging role, and I liked Anna Levine and Aida Turturro as the detective. And Carla Gugino was very good, playing her damaged character with intensity. Someone below commented that she was \"plump at the time\". I don't know what she looks like now, but I thought she was gorgeous. A real woman's body looks far better than the currently popular Angelina-Jolie-type anorexic look which is NOT attractive. Although flawed, the movie held my interest throughout.","Clearly a low-budget movie with minimal style. Since this is the case, one would hope for an abundance of substance to overcome to obvious lact of style. Sadly, this isn't the case. While the premise of the movie is interesting and deserves to be discussed (re: men are not the only ones capable of hurting another human being, all it takes is the right circumstances and the right (or wrong, actually) frame of mine for a heinous crime to be commited), but a leisurely-paced direction left a lot to be desired. Acting by all concern is one-note and not effective, though Gugino is possibly a standout (though not by much). This truly feels like a low-budget production, but that in itself is not an excuse for making a poor movie. I cannot stress enough that while the movie's pace is laborious (much to its detriment), this is not a bad thing, since Kubrick's movies are known for their slow pace. Yet, when the pacing is this laborious and what's happening onscreen is ineffective, this leaves the viewer to wonder what's on the other channel, which happens to me a few times.","A young and naive lady (Carla Gugino) gets brutally beaten and raped by two crazed women (Rya Kihlstedt and Anna Levine) during a late, drunken night on the beach. Naturally Gugino is distraught beyond comprehension, while the two others (Kihlstedt in particular) vehemently question Gugino's memory and her motives. \"Jaded\" is a really ugly movie that I had lots of trouble sitting through. The mature themes are one thing, but the lack of credible performers and a really crazed and demented story turn the picture into a terrible exploitation flick that has no value at all. The trio of female leads prove that they cannot handle the material and end up appearing more like spoiled adolescents than complex adult figures. Turkey (0 stars out of 5).","For a serious movie, the box cover for Jaded is all wrong. With moments of strong sexuality, the movie is not a sexual thriller but a drama. Still, with lack of experience from a first time director, Jaded falls short of anything serious. Carla Gugino is the main draw. Wanting to do a serious role, Gugino offers her naked body to draw a large audience to this movie. The acting, at times, is good. An interesting supporting role from Christopher Guest makes Jaded worth watching, from time to time. Still, Gugion's \"assets\" are the main attraction. Caryn Krooth's amateur film making loses any true drama that Jaded tries to create. The story and acting can only tell part of the story. With simple direction throughout the movie, the story is unable to progress to anything dramatic with a simple director behind the camera. At times, scenes are shot with only one, maybe two different shots. Whether this was an issue of time or budget, the style of direction loses its feel and reminds the audience that they are watching a low budget movie.","\"Jaded\" offers a premise with potential as it looks at the rape of a woman by two other women and ask the question \"when is rape not rape?\". Unfortunately the flick seems to suffer from bad direction as it slogs through legal minutia while trying to weave some kind of story with a handful of foul mouthed and poorly portrayed characters only to end abruptly. \"Jaded\" is lame stuff only for the bleary-eyed couch potato in the mood for some dark drama.","Caryn Krooth is an interesting director. But I think she was confused whether to make a sleazy lesbian thriller or a film that about the limitations of rape laws or a police procedural. Carla Gugino is great eye candy. So are the other females including the rather corpulent investigator (Aida Turturro) who always wears low cut dresses. The threesome lesbian skinny dipping that leads to rape is very well shot. Rya Kihlstedtthere is excellent as the vicious lesbian. She really pulled off the role well with the great introduction scene at the bar. Catherine Dent was pretty and I could sense a hint of sexual tension between her and Turturro. But the sexual tension was not well developed. There are certain arty farty student aspects to the film. But overall, i liked it. It does not really work as a mystery/police procedural. But it is a nice little unique film with a great Carla Gugino, set in a sleepy beach town.(7.5/10)","I had this movie given to me, and have to admit, I am glad that I did not pay money for it.The back of the box makes it seem like some kind of sex triangle, with 2 women trying to seduce her.  But the reality in this movie is far from that.In reality, the main subject is the victim of a vicious and sadistic rape by the two other characters.  There was absolutely nothing in this that I found interesting at all.Even movies like Silence Of The Lambs and Wild Things (which the box tries to compare this movie to) were riveting, because of the unexpected turns and suspense.But Jaded has none of this.  It concentrates on the rapeists and the sick relationship with the boyfriend of one of them.  And the persuit of a videotape that may prove the victims story is true.While it does show that same sex rape is possible, it is not a movie worth watching.If at all possible, pass this movie up at all costs.","You must admire this film for attempting to tell a rather disturbing story about a rather isolated situation.  However, with the exception of Carla Gugino, the acting was boring, quite possibly because the screenplay was also boring, the direction went downhill after the shock of the opening sequence, and the score was simply one tune played over and over again in the most inappropriate moments.  Furthermore - what was the point of this film?  It seems to change focus every twenty minutes.  And after all these points have been raised, we simply 'skip' what seems to be the most important part of the film - the court case - and are given a somewhat confusing voice-over narration and some text that has no relevance to the bulk of the film.  One would think that a minority film such as this would at least have a purpose - otherwise, what is the purpose?","The casting by Lina Todd and Yolanda Geralds and costumes by Laura Jean Shannon are pretty fantastic.  As the directorial debut of Caryn Krooth, it lacks the punch one might hope for, but it has its strengths.  The now-popular Carla Gugino was a bit plump at the time, but still shows some sass.  Chris McDonald steals the show - two straw hats up - way up!"],"review-user":["wherever","insomniac_rod","maeander","Jacey-4","smatysia","yojimbo999","tfrizzell","caspian1978","=G=","PimpinAinttEasy","mushrom","Dr. Gunn","JohnnyB-11"],"review-date":["4 July 2001","4 July 2005","2 March 2005","24 March 2000","21 December 2014","3 May 2001","21 May 2004","6 September 2004","6 June 2002","22 August 2017","4 November 2002","7 October 1999","30 September 1999"],"review-rating":["7","9","6","5","4","8","1"],"review-title":[" Carla Gugino stands out in an otherwise amateurish effort\n"," Not an erotic thriller by any means.\n"," An extraordinary thriller with first rate performances.\n"," I thought this movie was okay\n"," I did not find it overly exploitative\n"," Laborious\n"," Exploitation---Thy Name Is \"Jaded\".\n"," The Box Cover is Wrong\n"," Not for the jaded\n"," A small, unique and interesting film\n"," Not what the box says it is\n"," What was the point of all this? (one spoiler)\n"," Some of the best subject matter in a film but poorly directed\n"]}