{"review-url":["http://www.imdb.com/title/tt0171580/reviews"],"review-text":["Nurse Betty (2000)This is a sleeper, a dark comedy with enough inventive twists to call to mind The Truman Show but with a greater sense of reality to hold it down. Renee Zellweger is flawless as the naive, sweet, but utterly detached young woman named Betty who is addicted to a soap opera called \"A Reason to Love.\" This seems sweet enough, but her husband is a jerk (totally) and things start to spiral, and get dizzy, as reality even for the viewer starts to shift ground.Not that you are ever confused about what is happening or who the good guys are. The good guys are not Morgan Freeman and Chris Rock, for sure, as this unlikely and comedic father and son duo get involved, incidentally at first, in Betty's strange inner and outer life. A chase of sorts ensues, the soap opera becomes reality, and then reality becomes soap opera. And it's really hilarious and inventive and fast paced.Is it a total work of genius? Probably not. Maybe Charlie Kaufman would have added another twist in there (I'm not sure how), and certainly some of the side characters could have seemed less cardboard, or less awkward as actors. But Zellweger is unbelievable (really, your jaw might drop at how convincing she could play her mental blindness, and her awakening, of sorts). And Morgan Freeman is his usually convincing and engaging self. The utterly disgusting violence of one 20 second scene might turn off some viewers near the beginning, but if you can keep watching, the movie gets better from there. Much better.","Nurse Betty is really an interesting movie. I guess we all know someone who is so convinced that the characters in a soap opera are real, that you can't explain them with any means that these are just actors and not real persons.'Nurse Betty' isn't a nurse at all. In real life she is an ordinary housewife who works at a diner. To escape from her awful husband and the problems in her miserable life, she has become a very dedicated fan of a soap opera. After she witnessed her husband being murdered, she goes into some kind of a shock and she loses all grip on reality. She thinks she's in love with one of the characters from the soap opera, a doctor, and decides that she'll visit him and start a family with him. The hit men however think that she knows too much and go after her to kill her.As I already said, the subject is quite recognizable (if you leave the professional hit men and the murder out of it) and the movie was funny. The story was well directed and the actors did a fine job. It had everything I always want to see when watching a comedy. I give it a 7.5/10.","Neil LaBute takes a dramatic turn from his first two films, In The Company of Men & Your Friends and Neighbors, with this funny and original thriller/comedy/road movie.  When Betty (Renee Zellwegger) witnesses the brutal murder of her no-good husband (Aaron Eckhart), she develops a bizarre sort of amnesia, and flees in his car, not knowing that there is large stash of drugs in the trunk.  Morgan Freeman and Chris Rock are the hit men who follow her.What Betty is chasing, besides a new beginning (although she can't remember the old life) is her beloved, Dr. David Ravell (Greg Kinnear).  Only problem: Dr. David isn't real, he's a soap opera character on the show `A Reason To Love' and he's really an egotistical actor named George McCord.To say any more regarding what develops would be too much, but Nurse Betty is certainly original.  Its hit men are, like the hired killers of Pulp Fiction, are violent yet philosophical, its take on soap operas terrific spoof material, and its acting is the best feature of all.  This has to be one of the best cast films in recent years.  Renee Zellwegger is perfect for Nurse Betty, with the constant gleam in her eye that pushes her in her quest.  Morgan Freeman brings his constant state of grace to the role of a killer at the end of his career, and Chris Rock is his partner, a man of rage and great impatience. Greg Kinnear is at his comic best as the vain actor/soap opera doctor.  There are also great supporting performances from actors such as Emmy-winner Allison Janney (The West Wing), Harriet Sansom Harris (Frasier's agent Bebe Glazer), and Kathleen Wilhoite (Chloe on ER). Actually, the supporting cast is a Who's Who of television best character actors.A unique film that is funny one moment and chilling the next, Nurse Betty is a mix of great acting, casting, and a terrific screenplay.","LaBute's 'Nurse Betty' tells the story of a young housewife (and part-time waitress) in search of the man of her dreams. Sounds like another fluffy romance, no? Not quite! Her adulterous trash of a husband is scalped. Two hit men, a father who's about to retire and his son, are after her (the father happens to be in love with her). The man of her dreams is a character from a soap opera...she travels half the country just to be with him. Little does she know that it's only an illusion. Yes, it is a bizarre little comedy but fun nonetheless. Zellweger proves to be the perfect choice to play Betty. She delivers a very nuanced, comic and moving performance. Has Morgan Freeman ever gone wrong? He's just laugh out loud hilarious. Chris Rock too takes a chance playing the villain and does a fine job. Greg Kinnear and the supporting cast that includes Tia Texado, Allison Janney, Aaron Eckhart, Kathleen Wilhoite and Crispin Glover are all good. the soundtrack is beautiful and very romantic. It just adds to the surreal mood of the film. A lot of the film takes place on the road giving us glimpses of the beautiful American landscape and an adventurous feel. Towards the end, there's a beautiful scene between Morgan Freeman and Renee Zellweger (well I can't say what it's about without giving spoilers) which is the real turning point in Betty's life and the way that scene was presented amidst the chaos in the next room is amazing. 'Nurse Betty' is a sweet film that dares to go against the usual standards of American comedy. There are some very graphic scenes of violence and there's the element of suspense as the father and son track down Betty. Yet, it manages to stand as an adventurous comedy that is uplifting and brings a smile.","People keep asking \"is this a romantic comedy?\", \"a black comedy?\", \"a violent thriller?\".  If you're the kind of person who is not comfortable with a film unless you can safely store it into one of five or six comfy little categories, move on (or as Jack Black says, \"go to the mall!\").  To quote Roger Ebert, \"audiences lobotomized by one-level stories may find this confusing\".  It's really a sweet little comedy that breaks a number of 'sweet little comedy' rules, by introducing real terror and a few (count 'em - 3) scenes with a bit of gore.  Like Jonathan Demme's minor masterpiece, SOMETHING WILD, we are taken out of a safe little world (Kansas, literally) to another dimension.  This dimension is part Oz and part grit.  Oz is the fantasy life of the main characters (for Zellweger it's Kinnear, the fictional doctor on a soap opera, and for Freeman it's Zellweger, who he sees as a sort of modern Doris Day).  Intertwined with the fantasy is the frighteningly realistic fact that Freeman and his son Wesley, are hit men. What hit men do ain't pretty.  I'm personally relieved that this is not a cute comedy with 'widdle cuddwly' hit men who are really not so bad because after all, their violence is bloodless: we can overlook what they do. UH-UH!  We are not left off the hook that easily!  On the other hand, Morgan Freeman is an authentically charming guy, and in many ways, this film contains some of the most sparkling romance (real and/or imagined) that's been seen on the screen in a long time!  This indeed is a film that breaks many conventions while celebrating others, but be forewarned, this is not a safe, cuddly film.  You're not in Kansas anymore!","I'm not sure why I picked for a borrow from mom for \"Nurse Betty\". I think just because I had heard a little bit of this movie. But I'm glad I did. \"Nurse Betty\" is an original and clever movie that has humor and a darker side. This was one of Renee's first big one's before hitting it major in Hollywood. I can see why, she is an incredible actress. The scene where she finally realizes what had happened and she's on the set of her favorite soap opera, you can see pain, confusion, fear, and embarrassment on her face. Just to let you in on the movie, she plays Betty. A shy and insecure woman who stands by her abusive husband, she's a waitress, and is in love with soap operas, especially one where a certain cute doctor, Dr. Dave Revell. When she happens to see her husband's murder accidentally in separate room, the murders she notices are two customers she just had, Morgan Freeman and Chris Rock. She then just looses her mind and leaves town after talking to he police and says she needs to find her former fiancée, Dr. Dave Revell. So, she travels along the country to California to find Dr. Revell, and wants a job as a nurse to work with Dave, she's seen the show so many times, somehow she's just awesome at being a nurse when she saves a woman's brother. Despite everyone telling her that she is delusional, she just looks at them like as if they were the crazy one's. When she meets the actor who plays Dave Revell, George(his real name) thinks she's just a crazy fan trying to get on the show. She just looks at him with confusion and believes that he and her belong together.Renee was terrific, she was so believable on loosing her mind in the movie. She has come such a long way, and wither you want to admit it or not, she's adorable and a great actress.Morgan Freeman plays one of the assassin's, Charlie, who is the father of the two. He is so charmed and smittened by Betty and while chasing her around the country, he becomes almost just infatuated with Betty to the point where he almost falls in love with her. He and his son Wesley must find Betty when they find out she was there at the murder scene and could give away their identities. When Charlie sees Betty and catches her finally, she's scarred at first, but calms down and they know they have a real connection. It was a beautifully played scene, my opinion is that Morgan gave a stronger performance. He's just great.A surprisingly decent performance by Chris Rock, the son, Wesley. He is so \"gun\"-ho about just getting the job done in a rush and taking care of business. I loved his comedic performance at the end where he and the gang he's holding hostage by gun point are just watching the soap opera's together. Classic. \"Nurse Betty\" is a great movie that I'd recommend for a good laugh and just in all a nice honest little movie I think anyone could enjoy.9/10","There's some heavy-duty talent involved in this movie. Morgan Freeman and Chris Rock as a father-son hit team. Greg Kinnear as a soap opera star. Direction by Neil Labute. The brilliant script is by John C. Richards. Well, maybe not everyone if familiar with that guy. But his screenplay is what makes it all work.Renee Zwellweger is front and center. I'd love to say this was her breakout role, but she had been in \"Jerry Maguire\" four years earlier. Still, I think this movie proved she could carry a movie by herself without Tom Cruise co-starring. She does carry it.How do you classify this movie? Light-hearted romance. No. Black comedy? But it's sweet, kinda. Crime drama. Well, sorta. But really, none of the above. It's about a crazy lady who, without really realizing it, puts her faith in luck. And it pays off. Even if the main character is insanely deluded.Can this work? Zellweger sells it.","There's much to enjoy here if you like movies because of the actors. I was attracted to this film because of Morgan Freeman and Chris Rock who always deliver, but there's also great acting from the rest of the cast, most notably Zellweger but Kinnear is also perfectly casted as is the rest, no exceptions. All a joy to watch.And then there's the offbeat plot with a woman living in a fantasy of being a soap character that takes over her life and makes her forget that she was just a waitress in Kansas with a cheating husband who got killed in front of her eyes by hitmen. Sometimes I thought the movie was thrown way off balance with the sudden bloodshed but most of the time it was a very warm film. It was the wonderful, strange mixture between cold reality and movielike fantasy that made it interesting. It's good for a couple of dosed laughs but I would classify this as a tragic comedy with a relatively happy and satisfying ending, tho it may be cheap to some. Funny thing is, as life can be stranger than film, all in the movie could in theory happen! And the focus is still very much on human emotions so in that way the movie is still down to earth.Better than I expected, this film rules, can't get enough of Morgan or Chris but really everybody did a great job making this film.\n8 out of 10","This is an adorable, if somewhat edgy, comedy from a clever and witty script by John C. Richards, crisply directed by the very talented Neil LaBute, proving that he can handle comedy just as adroitly as he can the art house movie.Renée Zellweger stars as Betty Sizemore, a sort of Doris Day of the 21st century, a waitress from Kansas whose fantasy life centers around Dr. David Ravell (Greg Kinnear), star of a TV soap opera called, \"A Reason to Live,\" to such a fanatical degree that she has memorized lines from the show after watching the tapes over and over again. (This will come in handy later on.)Morgan Freeman and Chris Rock play a father-son team of cocaine-dealing hit men who ignite the premise of the movie by murdering Betty's slimy used car salesman husband, played by Aaron Eckhart, who starred in In the Company of Men (1997), also directed by Neil LaBute. Chris Rock is a comedic psychopath, and Freeman a fatherly murderer whose favorite dictum is \"three in the head, you know they're dead.\" One of the amazing and characteristic things about Morgan Freeman is that even while playing a professional criminal, he manages to sound like the wisest, gentlest man you ever knew.True, the plot relies heavily on co-incidence (Betty copping the keys to the Buick that just happens to have the goods in the trunk), precise timing (meeting Dr. David and entourage at exactly the right moment), and some questionable psychology (Betty's partial and convenient amnesia). But such contrivances should be written off as poetic license and ignored. After all, who would criticize Shakespeare for the tortured plots of his comedies? More significantly, what makes this work is the cleverness of the plot melded well with the personalities of the characters (while gently satirizing them), and some very funny dialogue. My favorite line is when Freeman, looking gravely at a picture of the disappeared little miss Nurse Betty, soberly remarks to Rock, \"We may be dealing with a cunning, ruthless woman here.\" I wonder, could it be that some of the pseudonymous (and humorless) reviewers who trashed this movie here and at IMDb are jealous, out-of-work screen writers?An observation and a question: Renée Zellweger has the kind of on-screen presence to delight the most jagged heart. And who really is the reigning queen of contemporary filmland comedy, Zellweger or Reese Witherspoon? They are both brilliant. Witherspoon is a little more over the top while Zellweger is more impish. It would be interesting to see them trade roles, say, Zellweger as goody-goody A-student Tracy Flick in Election (1999) and Witherspoon as Nurse Betty. Too bad something like that can't be done.Incidentally, the song, \"Ca Sera, Sera\" heard in the background won an academy award for best song in the Hitchcock thriller, The Man Who Knew Too Much (1956), starring James Stewart and Doris Day. The reason it reappears here is not entirely clear, but the resemblance of the wonderfully naive Nurse Betty to the on- and off-screen Doris Day (who also had a hit recording of \"Ca Sera, Sera,\") goes beyond the strawberry blond hair to a kind of irrepressible innocence. In Nurse Betty, however, the Doris Day world of white picket fences and monogamy is given a contemporary spin. Although this is to some extent a romantic comedy, it is one in which the answer to the question, Who gets the girl? is one never seen in a Doris Day flick.Bottom line: if you can watch this without laughing old loud and crying some real tears, you need to get your hard drive fixed.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","As Betty Sizemore (Renee Zellweger) secretly watches her tyrannical husband Del (Aaron Eckhart) being murdered by the vengeful hitmen Charlie and Wesley (Morgan Freeman and Chris Rock), her bruised sense of reality becomes totally immersed in the fantasy world of her favorite soap opera. In a state of complete denial and delusion, Betty escapes both physically and mentally from her unsatisfied, small town life to search for \"Dr. David Ravell\" (Greg Kinnear), the handsome and loving hero of \"A Reason to Love\", a soap opera set in a hospital and produced in Los Angeles. Immune to reality, Betty arrives in L.A. and becomes \"Nurse Betty\" as she tries to belong in the hospital world of her dream lover. Meanwhile, the angered Charlie and Wesley track Betty down, convinced she is a dangerous witness who also knows about their compromising dealings with Del.Nurse Betty creates comedy and suspense by contrasting its main character's extreme innocence and optimism with the evident hypocrisy and violence that surround her. By clearly defining the protagonist's difficult life, Nurse Betty justifies its character's tendency to turn away from reality. Thus, while offering a comment about the popularity of the soap opera within the film, Nurse Betty also makes a comment regarding the widespread addiction to television and its celebrities. In addition, Nurse Betty benefits from the effective manipulation of its protagonist's mental state, particularly in those scenes where she cannot distinguish between \"Dr. David Ravell\", the character, and George McCord (Greg Kinnear), the actor who plays him. Betty's incapacity to recognize George as an actor leads to funny misunderstandings, which stress the magnitude of her delusional state. However, in spite of these successes, Nurse Betty suffers from the troubling characterizations through which the narration evolves. For example, while Charlie and Wesley are consistently portrayed as a comical pair, the brutality of their actions undermines any sense of appreciation or acceptance the viewer might have initially experienced. Similarly, although the initial scenes establish Del as a detestable man, the humiliation and violence he experiences with his murderers surpass all the humiliation and violence he caused his wife Betty.Finally, toward the end of the film, Charlie undergoes awkward transformations as he develops an obsession for Betty; an obsession which results in noble feelings of love, and which ultimately destroys him. Consequently, since the characters' roles as victims lack consistency, the story's victimization processes seem random and unsubstantial. All in all, Nurse Betty's indeterminacy --rather than creating suspense-- weakens its characters and pollutes its plot.","Three is a charm, and it certainly was for Neil LaBute - his first three films (of In the Company of Men, Your Friends and Neighbors, and this one) were fresh, original, darkly funny, had personality and insightful, not clichéd look inside his characters' hidden desires and motivations. What he saw often was not pretty but always honest. Of three, Nurse Betty is the best - deliciously multi-layered, full of twists and turns, making fun of the TV obsessions and turning upside- down many genres. What is the film? A sort of a cinematic onion that reveals its layers one by one. It's a black comedy and a thriller, a road movie and a modern version of the girl Dorothy's adventures in the Wizard of Oz. It is very detailed clinical description of post- traumatic stress disorder and the parallel story of two dreamers who in the same fashion created in their imagination the ideal lovers that were so far removed from reality as Kansas from Oz. And the awakening was truly shocking. Renee Zellweger in a Golden Globe-winning performance has never been better, before or after Betty (Chicago came close). Morgan Freeman has never been as romantic and so much in love at the same time being a cold-blooded and meticulous hit-man. Greg Kinnear as a man from Betty's dreams, \"so handsome that a bit more and it would be a crime\" was perfectly cast and funny as the shallow TV star. The presence of Aaron Echhart and Crispin Glover did not hurt the film, either. But the real star is the script, so rich and unpredictable that it was pleasure following all its turns and twists. Underseen and underrated indie film that has only became better since I saw it first time soon after its release, it is a rare treat. This is a very funny and very dark film. It is dreamy, and it's one of the movies that make me happy just to know that it exists. Definitely recommended for repeat viewing. The ending is beauty itself. There is another \"never\" I have to add -Neil LeBute has never done anything as fresh and enjoyable since \"Nurse Betty\".","This excellent film is another reminder for us to look under the surface of things. Beyond even the most sordid or terrible details there is something extraordinary waiting for you if you had eyes for it. Betty's ingenuity, purity and capacity of transfiguration, symbolized and enhanced by her post-traumatic shock, leave a mark on everyone in the film and in the audience. It's like Charlie (Morgan Freeman) put it clearly, that the two of them are resembling one to each other more than you'd think, hence his fascination with her as a personification of that ideal of purity long lost by him. The film is powerful and diverse. Life is diverse, too. It has its horrid moments and its soulful moments. Why do we need to squeeze the film in a category (comedy, be it dark or not)? Even the scalping scene, apparently appalling for so many people, is not that graphic and is very short. Most of the performances are excellent, and first of all Ms. Zellweger of course, who is perfectly cast and entirely believable. Betty is a kind of 'Dona Quijote', looking for the extraordinary and the soul-fulfilling beauty in every thing. 'You don't need anyone, because you have yourself.' It's a soulful, even spiritual film, much more effective in its suggestiveness than a morose, didactic, preaching and pretentious one.","The Bad: The gimmick of this film, as with very many, is contrast. This time its the well-exercised contrast between mindless brutality and open, honest innocence. What's new is the ratcheting up of the extremes. The violence is a new extreme in this context. How much more can we escalate? Is our own innocence so permanently numb?The Good: This film is remarkably sophisticated in its self-referential layering. Here is an indicator that in this category at least the general intelligence level in the US is rising. It takes real abstract thinking to appreciate this, and one imagines that an audience in the 80s would be thoroughly puzzled.Simple films with theatric self-reference usually mix real life with a play-within-the-play. \"Shakespeare in Love\" and \"illuminata\" are of this ilk. Slightly more complex is real life within the play as with \"The Truman Show.\" But here we have a new and lovely evolution, six layers of self-reference. We have the layer of the real-life Renee and her film character. I am in no doubt that the marketing of Renee as the new America's Sweetheart is the real basis of this effort. So Renee playing the public Renee. Then we have Renee playing Betty. We are lead to believe that the three are simultaneously real. But this has been common for 75 years.What's new is Betty \"becoming\" Nurse Betty. Another layer, and then full circle as the \"real\" nurse Betty becomes the play Nurse Betty. This last is assumed before it actually happens. Finally, we have Freeman's fantasy angel Betty, which we assume is the root of all the conflated layers. That makes six layers by my count. Think about it: this film requires a sophisticated viewer. As it will likely be a big hit, that sophistication must exist in the masses. Wonderful!Incidentally, only two people in this film can act, and one is not Chris Rock. What's with this guy?","This is a strange film but that's somewhat normal when the category is \"dark comedy,\" a la Fargo and numerous others of this genre. You wind up getting a rough film but one with a lot of laughs. This isn't Fargo, but it reminded a bit of it with the two hit men and a likable female lead. Unlike Frances McDormand's role as the cop in Fargo, here we have a ditsy but ultra-sweet girl played by Rene Zellweger. The hit men are played by Morgan Freeman and Chris Rock: an odd duo.Freeman, in a role uncharacteristic of him, plays a profane hit man who is at the end of his career and mellowing. His is really a strange role, a real contradiction at times. Rock is his normal ultra-profane wise-cracking younger guy as Zellweger's character suffers some setbacks.For a comedy, this movie had a shocking amount of f-words and assorted other profanity including a lot of Lord's name in vain material. A lot of it wasn't necessary, either. Some of the stuff in here is not all black humor; some of it's uncomfortable to watch.However, if you can get past (or have a profanity filter) the language, this movie is entertaining because of its mixture of comedy, romance and suspense. There are nice colors in here, too. As I said: a strange film.","Nurse Betty (2000): Dir: Neil LaBute / Cast: Renee Zellweger, Morgan Freeman, Chris Rock, Greg Kinnear, Aaron Eckhart: Very unique black comedy about fixation or excessive imagination resulting from being desensitized. Renee Zellweger plays Betty Sizemore who works at a diner and obsesses over a soap opera called A Reason to Love. She believes that soap star David Revell speaks directly at her. After her husband is savagely scalped to death, due to a situation involving stolen drugs, Betty gleefully sets out to meet the man of her dreams. Too disturbing for laughs but interesting and detailed. Director Neil LaBute presents the fantasy dysfunctional elements mixed with warped reality. Zellweger is radiant poising as a nurse believing a false lifestyle. When she finally does snapped back into reality, the film makes some interesting implications especially with Betty. Morgan Freeman and Chris Rock are excellent as her husband's killers out to find drugs hidden in the trunk of her car, unknown to her. Freeman draws laughs through a sudden infatuation with her, while Rock is violent and excessive. With that said, the violence presented is too graphic for the film's tone. Greg Kinnear plays Revell who sees Betty as an act until the tables are turned. Aaron Eckhart plays Betty's husband who gets in too deep with our two assassins. Bizarre portrait of reality and fantasy collision. Score: 9 / 10","Hard to categorize this movie, but many things come to mind. My boyfriend described it as Blue Velvet filmed by the Farrelly brothers and I think that is an excellent description. My problem with this film is that it sets up its premise so exquisitely in the beginning - Renee Zellweger trapped in a waitressing job that she can actually do in her sleep, who watches her favorite soap so zealously that she can pour coffee while staring at the screen. As we follow her around in a day we begin to realize how desperately she is trying to keep going by losing herself in a false positivity sustained by soap opera platitudes, but that these are becoming increasingly more difficult to apply to her sad life and bad marriage. As she soldiers on through the day, more and more things unravel around her, so that by the time she witnesses the brutal murder of her husband, she is completely consumed by her imaginary world. Up to this point, Zellweger balances the tension of her delusional positivity with a buried sadness that is so delicate, when it comes out every once in a while, it is heartbreaking to see. Then LaBute just abandons ship with her and launches into a road trip movie that loses all dramatic tension by creating extremely cartoonish interactions and characterizations that do not come into balance again until Bette meets up with her soap opera star at a charity event. The scene where Bette introduces herself to the writer and some of the cast of the soap opera \"A Reason to Love\" is one of the best balancing acts of conflicting views of reality I have ever seen on screen. But once again LaBute abandons Bette to one-dimensionality so he can rush over to the Grand Canyon for yet another badly written scene where Morgan Freeman is trying to have a conscience and Chris Rock is just trying to get the job done. The point at which I got anything out of their interaction with each other was the point at which Chris Rock decided to stop \"acting\" and just start doing his foul-mouthed comedy routine. Finally there seemed to be some spark and life to their relationship, and the road trip aspect started to pick up for me. I feel like Mr. LaBute is very good at theatrical manipulation of audience expectation, but not so adept at filmic flow and continuity. I am glad he exists, and the film was very interesting and very watchable, but I think he still has a lot to learn about how to create and sustain a convincing oddball reality throughout the duration of a feature length film.You can't have intermissions in a modern movie theatre, but I felt as if there were intermissions in this film, that plot lines would ebb and flow like tides until each character was plucked out of the group and given meaning. Perhaps this would have been best done as a play first, and then the ensemble cast rounded up to do the film. I was underwhelmed by the artistry but entertained by the quirky story, so I think I will just leave it up to other viewers to determine - is the film half-empty, or half-full?","Renee Zellweger is Betty, a Kansas waitress who wants to be a nurse, who is infatuated with a soap opera actor (Greg Kinnear), and who is married to Del, a cheating, stupid male chauvinist who's trying to sell some stolen drugs. Unfortunately for him, he gets brutally, bloodily murdered instead, while Betty secretly watches. It leaves her unhinged, believing that Kinnear is really the character he plays, Dr. David Ravell, and that she is his RN ex-fiancée. She heads for LA to find her lost love, not knowing the stolen drugs are in her trunk. Pursuing her are Charlie and Wesley (Morgan Freeman and Chris Rock respectively), the hit men who inadvertently killed Del before they found out where the drugs were hidden. They pursue her across the country, while Charlie gradually falls in love with his image of her.And in LA, things get totally bizarre, as no one realizes that Betty is delusional. Alternately funny and touching, this movie is almost perfect. Stop reading commentaries and go see it.","To sum this movie up, it is LaBute carrying his sadism over into the realm of comedic farce.  The predictable result is that he is constantly stepping on all the jokes by insisting on surrounding them with blood-curdling violence and extremely hateful characters.  There is also evidence of his continuing efforts to insult and ridicule everything in sight but then to apologize for it with weak gestures to the PC.  Basically the movie just doesn't work, its plot is beyond contrived, the characters are one-dimensional cliches, there is no consistency or development of anything, and the comedy (where it is not totally out of place) is the worst kind of High Concept drivel.Morgan Freeman and Renee Zellweger are completely wasted on characters that seem like parodies of studio-driven audience pandering--no matter what, make them likeable, neutral (and neutered), and full of moral platitudes. Crispin Glover is in here just long enough to convince you that he doesn't belong in movies anymore.  Chris Rock actually has negative chemistry with fellow hitman Freeman--it's as if they are acting in different rooms even when they are two inches away from each other.  In effect, Chris Rock seems like a digital insert.  At least he isn't as annoying as Jar-Jar.LaBute's 15 minutes may well be up by now.  It's already looking like he's overstayed his welcome.","I think this movie is terrible.  I watched it last night as sneak preview and could not understand why people were laughing.  \"Betty\" is an inane character but if one wants to believe the movie she is severely mentally ill and the film writers and directors use this for laughs.  Meanwhile, the two men in pursuit of her seem aimless, cruel, and yet supposedly reflective. Sure it all a fantasy, but it is a boring one.  I far prefer the edginess the directors used in \"In the Company of Men\" to this not so subtle mockery of women, the mentally ill, African Americans, and the movie watcher.","I often go and see movies I have no idea about. I have managed to avoid trailers, publicity interviews etc and just want to be entertained with no idea of what is about to happen. I may just go on the poster or the actors or just because I have time to kill. The 25th hour and A Bronx Tale are two fabulous movies I found at the cinema for the first 2 reasons and was enveloped in a magical tale that blew me away.Nurse Betty is the other end of the scale, the desirability equivalent of cinematographic leprosy. Trying to be both funny and dramatic and failing miserably at both. I don't think I even cracked a smile during the whole movie. Chris Rock normally very reliable for some good laughs every movie and a skilled comedian stunk up the screen every time he appeared on it. The normally reliable Morgan Freeman trying to portray a cynical and world weary crim suddenly developing a gentle wistful crush on a young women whose reality check bounced comes across into this sluggish borefest as a sad old pervert, uttering bad lines in an amateur pantomime.Zellweger is merely irritating in a childish, retarded sort of way and certain exudes no appeal to anyone with an IQ of over 14 unless they have been at sea or in prison for a minimum of 8 years. Crispin \"the creepy thin man\" Glover has a small role and has been banished to obscurity for his association with this turkey. The only actors that can say they earnt what ever they were paid for this blemish on American Cinema was Greg Kinnear in a role as another self obsessed moron who falls for \"loveable\" loon Betty's charm and provides the improbable crapfest its most improbable twist (except if someone actually liked this movie!!!) and Christoper McDonald is worthy as a sleazy redneck who is Betty's abusive husband before he sends her round the twist.As I said this movie is a mismatch of styles, mostly bad, all badly done that fit uneasily together to form one of the worst 1 1/2 hours of my life. I still dream of suing the producers/director for my ticket price and mental anguish. I would not recommend it to people on Death Row except it may hasten their search for religion and definitely their desire to be executed.Horrible. Ghastly. Woeful. The Streetfighter of Romantic Comedies. Oh yes, and Romantic comedies should probably never depict graphic scalpings. And they should be at least mildly funny. Not an obvious tax deduction hashed together by a collection of talentless gits.","If you want blood and gore - this is the movie for you.  As usual Renee (and Greg too)is perfect - but, ohhhh the script is beyond revolting!  Too bad, this had such potential, but even with outstanding actors as Renee Zellwegger and Greg Kinnear, you need a barf bag to sit through this gratuitously violent and disgusting film.","I cant understand by reading all the rave reviews about \"Nurse Betty\" if I saw the same movie as everyone else. This movie was awful. Everyone in the particular theater I was in hated it, I didn't hear one laugh from anybody the entire film, just groaning and sighing. Has the quality of comedy stooped so low that people can take a boring, uninteresting, and thoroughly stupid piece of trash like this and make it sound like an instant classic. Is comedy really dead? I hope me and all the people who wasted $7 bucks tonight aren't the only ones who feel this way.","Betty (Renée Zellweger) is a Kansas diner waitress obsessed with the soap opera 'A Reason to Love'. Her husband Del (Aaron Eckhart) is a sleazy car salesman cheating on her and selling drugs. She sees him being scalped by criminals Charlie (Morgan Freeman) and Wesley (Chris Rock) and she goes into shock with delusion of being Nurse Betty on her favorite TV show. She goes to LA to find George McCord (Greg Kinnear) who plays Dr. David Ravell on the show thinking Ravell is her ex-fiancée. Del had stuff the drugs in the car and the two criminals go after her for the drugs.It's a black comedy but none of it struck me as being terribly funny. A graphic scalping can do that to me. It's quirky. I have nothing bad to say about the performances. Zellweger is fully committed to her delusional character. She is definitely suppose to be funny. I keep thinking a different way to get her to the delusion would allow the movie to be much funnier. She could get hit on the head. She could see her husband cheating. Murder and more specifically scalping seems like such an extreme option. It makes Freeman and Rock not funny.","Neil LaBute's uneasy blend of thriller and dark comedy is a queasy affair.LaBute doesn't have a light touch at all, which more than anything is what a film like this desperately needs. He begins the movie with a scene of intensely graphic violence, and it's hard to recover from it. You can't sit back and enjoy the film's comedic elements when you're not sure when or if something horrible is going to happen again.Renee Zellweger does her best, but she's in the hands of a director who's out of his element.Grade: C","Betty Sizemore (Renee Zellweger) lives her life through soap Opera \"A Reason to Love\" as a way to escape her slob husband and dull life. After a shocking incident involving two hit men (Morgan Freeman and Chris Rock), Betty goes into shock and travels to LA, believing that she is destined to marry the show's main character (Greg Kinnear).Nurse Betty is that rare thing, a lesser known film with an all-star cast and a fluffy Rom-Com plot that surprises with it's terrific script and spot on acting. Indeed, such a plot makes one question the R rating, but it's warranted all right. The shocking incident that sends Betty over the edge is a tad too graphic compared to the light, amusing comedy that is to come and feels like something out of a different movie, but at the same time it is necessary to believably show Betty's transformation into the doe eyed, lovable nut job she becomes.As we go along with Betty on her journey, director Neil LaBute works some extraordinary magic which makes the movie unique and high above your bog standard comedy of error. An example of this would be Betty's first meeting with her crush. She pours her heart out to him and he plays along, thinking she's auditioning for a part on the show. Even as we are aware of the ludicrous nature of Betty's ramblings, the music swells as she speaks, giving us, the audience, Betty's emotional perspective. We almost believe what she is saying, yet we understand that her mind is fractured. Whereas other filmmakers would try to accent the ridiculousness of the situation to wring every ounce of possible comedy out of the scene, LaBute is sensitive to his main character and treats her with the utmost sympathy and understanding.The banter between the hit men played by Freeman and Rock is priceless, the excellent script doling out clever line after clever line for them to riff off of. Freeman in particular is excellent as always, pacing himself as his character slowly and blindly falls in love with his own ideal of Betty, not even truly knowing who she is or what has happened to her. Aaron Eckhart once again shows versatility in the thankless role of Betty's no-good husband and he is almost unrecognisable. The other revelation here is Kinnear, whose portrayal of the soap's star is not too overcooked. There's a tendency to lay on the celebrity bastard cliché as thickly as possible, and Kinnear resists, instead imbuing him with a pompous yet restrained self importance, despite simply being a soap star.The soap opera is realised so well, it could almost exist. LaBute and co hit the nail on the head with this one and a good thing too. If the soap opera had been too satirical, a large part of the film would not have worked. To do a \"Days of Our Lives\" spoof as seen in Friends would have been the wrong move for this movie. The dedication to detail pays off, as the style and feel of the soap opera begins to bleed into Betty's reality more and more, while keeping with the overall unintentionally comedic aspect of the genre. The scenes on the set feel real, as opposed to some films in which the atmosphere feels so manufactured, you wondered why people who do it for a living can't get it right.The neat resolution of the final act, while being a tad predictable, is wholly satisfying overall. It's a shame that after LaBute directed this wonderful film, the mainstream came calling for him to direct the abysmal remake of The Wicker Man, a fine example of a man so totally above the material given to him. Unfortunately, one cannot absolve him of all responsibility.If you haven't seen Nurse Betty, it's something to discover. If you have, it's worth a re-visit. There is a charm to Nurse Betty that is infectious, even if it may not leave you thinking that much afterwards. A hidden gem nonetheless."],"review-user":["secondtake","philip_vanderveken","fleagles","Chrysanthepop","Zen Bones","Smells_Like_Cheese","dave-sturm","FlorisV","DeeNine-2","chrisbrown6453","G_a_l_i_n_a","Ana_Banana","tedg","ccthemovieman-1","anaconda-40658","ytbufflo-1","saintonge","Brian-268","oceanfan","thefunboy1","Star52","matte723","SnoopyStyle","evanston_dad","filmbuff20"],"review-date":["1 May 2010","6 January 2005","27 September 2000","22 February 2008","25 March 2002","21 November 2005","21 May 2010","29 August 2003","10 August 2001","11 July 2001","1 May 2013","22 December 2011","8 September 2000","2 July 2006","10 June 2015","26 January 2006","28 December 2008","24 September 2000","8 September 2000","5 July 2006","2 April 2003","17 September 2000","24 May 2015","23 July 2010","9 May 2009"],"review-rating":["8","8","8","9","8","9","7","9","9","6","9","5","10","1","1","1","1","1","5","5","8"],"review-title":[" Inventive and weirdly funny throughout, but touching, too, and Zellweger amazes!\n"," An underrated movie on how people sometimes don't see the difference between reality and fiction\n"," Great casting, acting, and original screenplay\n"," A Splendid Little Black Comedy.\n"," For The Adventurous Only\n"," An original and fun story\n"," Zellweger sells it\n"," Unique, inconsistent but great\n"," Cute, edgy and very funny\n"," Nurse Betty focuses on an unhappily married coffee shop waitress in Kansas, whose ungratifying life blends with her fascination for soap operas as a form of escapism.\n"," Dreamers\n"," Betty Quijote\n"," A New Step in Mass Media Layering\n"," Decent Dark Humor, But No 'Fargo'\n"," Nurse Zellweger.\n"," A near hit or a near miss?\n"," A Brilliant, Overlooked Black Comedy/Drama\n"," Bad aftertaste...\n"," Hated it\n"," *****May contain spoilers ******\n"," WARNING: DO NOT WATCH THIS FILM!!!!\n"," What is going on here?\n"," awkward black comedy\n"," Neil LaBute the Wrong Choice for a Film Like This\n"," Charming comedy, despite one jarring yet necessary scene that shot the rating to an R.\n"]}