{"review-url":["http://www.imdb.com/title/tt0119567/reviews"],"review-text":["Steven Spielberg returned to direct this sequel,(loosely) based on the Michael Crichton novel that sees Jeff Goldblum returning as Dr. Ian Malcolm, who is enlisted by John Hammond(Richard Attenborough again) to return to Jurassic Park(though on previously unmentioned Site B) to study the dinosaur population, and also to rescue another team, which includes a former flame of his(played by Julianne Moore). He reluctantly agrees, and after locating her, finds to their disgust that the company INGEN has allowed hunting parties to take place, where big-game hunters(led by Pete Postlethwaite) stalk and kill dinosaurs, though the tables would of course be turned...Good sequel has equally effective F/X and terrifying story, though a few too many characters; the twist toward the end is surprising and entertaining, though some poor editing leaves a big plot hole aboard the discovered freighter...still, a worthy sequel that holds up today.","I guess I'll have to put this one under my guilty pleasures department. I've always been a sucker for dinosaurs, and with the filming technology available today, a film like this one and it's predecessor have just the right ingredients for a fun time. Granted, there are many elements in the story here that don't make a whole lot of sense, but there's that old saying about suspending disbelief, so that's what I'm applying here.Besides all the puzzling plot elements, and you know what most of them are, here's one I picked up in an early scene. When Kelly (Vanessa Lee Chester) looks at the wall map showing 'Las Cinco Muertes', The Five Deaths, the island of Isla Sorna is at the center of that cluster. In the opening screen narrative it's stated that this island is eighty seven miles southwest of Isla Nublar, but none of the other islands on the map go by that name. So a bit of a continuity slip-up there.You know what I got a kick out of? At one point, one of the principal characters upon arriving on the island, states that the Eisenberg Uncertainty Principle is in effect, that is, it's not possible to study something without changing it. That was oddly reminiscent of the original Star Trek Prime Directive; an interesting concept but virtually impossible to maintain, because once you're there, your actions have consequences.Say, and how about that Roland (Pete Postlethwaite), is he a Nascar contender or what? Recall when the InGen team first arrive on Isla Sorna and he's driving on the jungle trails with Ludlow (Arliss Howard). I had to rewind the scene because he had his head turned completely around to Ludlow in the back seat for a full forty seconds at one point - how did he do that? Well anyway, not a lot of credibility to the picture, but how can you not marvel at the imaginative CGI work creating those magnificent dinosaurs? Stego's, T-Rex's and all those mini-predators make for a couple hours of dino fun. You don't even have to pay attention to the scientists.","Not quite as good as the first one only because several of the first movie cast was not in it. Sam Neill, Laura Dern are two that come to mind. This is still an excellent movie. Jeff Golblum is back as Doctor Ian Malcolm and does his usual good job. His character is still insightful and more importantly he still gets some humorous lines as well. Julianne Moore plays a very tunnel vision doctor that is more interested in the animals than in her own survival, at least at times. One of the not so good guys that are also on this island if the hunter played by Pete Postlethwaite. He is there for the protection but his personal objective is to bag a big one. Well it turns out he gets bagged.","The Lost World takes place 4 years after the disaster in the original Jurassic Park with Ian Malcolm discovering from John Hammond that there is a second island full of dinosaurs waiting to be exploited by the New heads of Ingen.  So with the help of his friends, Malcolm tries to stop them in order to keep the dinosaurs from not only being exploited but to save his girlfriend who is also on the island. With that action comes the danger and mayhem that you would expect from a sequel to Jurassic Park. Jeff Goldblum shines once again as Ian Malcolm and Richard Attenborough shines once again in a extended cameo. The new cast starting with Julianne Moore is good as well and the tension and action is up a notch from the original Jurassic Park. What hurts this film a little is it's climax at The San Diego Zoo that is a bit too over the top but regardless, Spielberg's magic is still evident and it still delivers. 8/10","Here comes the sequel to an epic. Steven Spielberg is back and what we get is a mixed bag. I saw it as a kid and naturally loved it. But as we grow older, so do our knowledge and need for probing. Some cast members did not return and weren't even referenced to at all in the story but other aspects in this film make up for it. Jeff Goldblum does reprise his role and I'm quite happy about that. Julian Moore and Vince Vaughn star here, but to me the actor who really caught my eye was Pete Postlethwaite, as Roland. In terms of story this film was definitely built as a thriller. A lot of the story is non-sensible, as I'm sure you've read. The boat somehow guiding itself back to the exact spot where it was destined via no pilot (or maybe auto-pilot), an experienced mercenary on an island full of flesh-eating dinosaurs wandering off just to take a leak, with Juan listening to his MP3 trying to catch a baby dinosaur when I'm sure you heard its enraged father is right behind himeh, the list goes on give or take. Basically this purely a money-shot type of film. We do see a bit of a deeper side to Goldblum's character and that does add a bit of zest to it all. A lot of the other characters are mildly gone into, just barely enough to get a sense of who they are. But suckers like me to this day end up caring for them. Ha-ha Decent characterization at best.Once again a riveting score by John Willams, but in all fairness we get no real time to appreciate it. The SFX of course good as can possibly be, but we established that in the first movie. In America what movie doesn't have good SFX? That's why I don't care when people say Godzilla films SFX are terrible. Because I LOVE dinosaurs I give it a 7.9, around a near B-, but no doubt still a keeper by far. I proudly own the DVD as part of my collection.","As entertaining, and as unbelievable, as the first is Spielberg's return to rampant, DNA induced Dino's, \"The Lost World\".I guess a sequel was inevitable, as is the final twenty minutes of this film. Surprises are supplied in the script, yet most of the action sequences lack imagination. Only the very early scenes impress, the initial encounters being at times thrilling, especially the scene in which the T-Rex's shove twin trailers over a cliff.Special effects again take the limelight, but we've seen it all before, so the affect is diminished. John Williams score makes a welcome return, and his aural composition is supported by great cinematography.Dr. Malcolm (Jeff Goldblum) returns from \"Jurassic Park\", and is now the hero of the moment. Goldblum plays well the mathematician who is decidedly unenthusiastic about being among the deadly dinosaurs. Much more keen is his new g.f., played by the likable Julianne Moore. She is the palaeontologist who volunteers to observe the dinosaurs in their natural habitat and make recordings for entrepreneur Sir Richard Attenborough. Vince Vaughn forms part of this passive group. Heading up an opposing, aggressive band who plan to capture and export the beasts is Pete Postlethwaite, portraying most enjoyably the great white hunter who longs to stalk a male T-Rex.Leave it to Spielberg to recreate the excitement, drama and thrills of the first film. A shame about the closing thirty minutes though.Sunday, July 13, 1997 - Knox District Centre","The Lost World: Jurassic Park, the sequel to Steven Spielberg's iconic blockbuster, was released to massive commercial success, but critical disappointment. While audiences flocked to see the follow-up to the highest grossing movie of all-time, critics lambasted the movie for failing to live up to the high mark set by its groundbreaking predecessor. I'm here to set the record straight. The critics were demonstrably wrong. The Lost World is one of the most underrated, and over-hated movies of recent memory. Four years after Jurassic Park captivated audiences around the world, Steven Spielberg returned to the director's chair to craft a sequel that matched the original in every area that mattered. The Lost World is as technically accomplished, as thrilling, and as exquisitely crafted as the highly praised, Jurassic Park. Critics be damned!Michael Crichton's sequel novel serves as inspiration for The Lost World's story, which introduces Isla Sorna, or Site B, as its main setting. This island is the site where Jurassic Park's dinosaurs were bred and raised. After the events of Jurassic Park, the site was abandoned and dinosaurs roam free once again, in a proverbial \"lost world\". Ian Malcolm, the neurotic chaotician from the first film, is the centerpiece figure of The Lost World, substituting for Sam Neil's Alan Grant, who was left out of Crichton's book. Malcolm's girlfriend, Sarah Harding (Julianne Moore) and her team of biologists are sent to Isla Sorna to study the unique animals on the island. Meanwhile, InGen's team, led by great white hunter Roland Tembo, played with scene-stealing gusto by the late, great Pete Postlethwaite, come to capture some of the island's larger inhabitants. Ian Malcolm learns of this news and takes it upon himself to retrieve his girlfriend from the dinosaur-infested island. The Lost World doesn't bother much with exposition (After the pieces are put in place, it's non-stop dino-action), but David Koepp's script is not simple-minded. Here is a story that, in its own way, still develops its characters and encourages engagement. There are ideas present in The Lost World (on greed, nature, human hubris), which is more than you can say about its successors.One of the criticisms The Lost World often receives is that it lacks the compelling characters of the first film. It's a complaint that holds no water. Moore's wide-eyed, overly enthusiastic Dr. Harding, Vince Vaughn's militant eco-activist, Nick Van Owen, the aforementioned big game hunter, Tembo, and the rest of the new characters are, in the most basic sense, well drawn. What they lack in situational awareness (haters will have you know that there are dumb decisions made by some), they make up for in personality. Love them or hate them, these are real characters. People, with passions and flaws. Not the fleshy placeholders of JP3 and Jurassic World. And that's not to mention Jeff Goldblum, who carries the protagonist load admirably. When you think about it, his role here is not only different from the first film, but different from most anything Goldblum has done. We know he can do quirky, but his understated cynicism here comes off totally natural all the way through. Malcolm is the ultimate grounding force among all the dinosaur chaos; a huge asset to the movie.The cogent story and memorable characters, as welcome as they are, are only the icing on this cake. The essence of The Lost World is its fantastic dinosaur action. Here is where this movie outclasses nearly all its competitors. The Lost World is Steven Spielberg flexing his cinematic muscles. He takes the set pieces, a trailer dangling off a cliff, a basecamp ambush by territorial T-Rexes, or a raptor hunt in long grass, and weaves from them some real tension, suspense, and above all, thrills. Spielberg knows how to tease an action scene and have it explode to life at just the right time. Even when things move to San Diego in the final act, the richness of Spielberg's action remains. His sense for visual iconography, like glass slowly cracking, shadows streaking across tents, and trails being made in grass, is unparalleled. We've grown used to modern action that numbs the senses, but the satisfaction of Spielberg's action is that it enriches them. At this point, he's just showing off.But what is dinosaur action without the dinos themselves? If Jurassic Park redefined creature effects for the modern age, The Lost World perfected them. Combining the very best of both animatronics and digital effects, Stan Winston and ILM create dinosaurs even more dazzling than those in Jurassic Park. The intricately detailed large scale animatronics move smoothly with a wide range of motion, and the CGI is as photo real as anything in 1997, or today for that matter, but what separates these dinosaurs from other movie monsters is the way they are treated as characters. The dinosaurs of the Lost World: Jurassic Park are written and directed with a constant eye for realism. The T-Rex parents, the biggest stars of the film, don't chase and eat people just because they are T-Rexes. When they attack, we know why. They exhibit maternal instincts when their baby is taken from them and territorial instincts when the scientists venture too far into their domain (As do the stegosauruses, in a fabulous early scene). It is a credit to writer David Koepp that a film that could have easily devolved into mindless action maintains a certain level of intelligence, even in its most fantastic moments. And we aren't just told that the dinosaurs are \"animals, not monsters\". They actually behave that way. The T-Rexes sniff the air for signs of their baby, the raptors snap at each other during a hunt, the compys swarm a piece of food dropped on the beach; These moments feel like they were taken from a documentary. Of course this is how dinosaurs would behave. They are given reasons to roar and chase, when the lazy thing to do would be to create dinosaurs that exist only to look cool.Okay, so the story may not be as fresh as the original Jurassic Park, I can buy that, but The Lost World matches the first movie in nearly every other way. The special effects, action, score, set design, cinematography, you name it, they all carry the same mark of quality as the original Jurassic Park. There is passion behind the creation of The Lost World: Jurassic Park. A novel from Michael Crichton, Steven Spielberg at the helm, ILM and Stan Winston at the top of their respective games, and John Williams providing the music; This is the only Jurassic Park sequel that can stand with the original. It does exactly what a big budget sequel should do. It skips through the requisite set-up and launches full force into the thrills. The Lost World is jam-packed with jaw-dropping special effects and pulse-pounding action, yet it stays smart enough and scary enough to feel fulfilling. It's the very best kind of summer popcorn entertainment, and without question the best sequel to Jurassic Park.89/100","The Lost World has its problems. Yes, the wonder is gone and seeing dinosaurs this time did not have the same impact as it did with the original but this film still manages to pack a mean punch in terms of action and scares. Jeff Goldblem is fantastic, proving to be the best lead this series has had and the movie carries two of the best scenes ever filmed by Spielberg himself. The first involves the trailer over the cliff and the raptors in grass scene which still remains one of the scariest scenes Spielberg has done since the original Jaws. The movie also still has the intelligence and wit of the original Jurassic Park, something neither the terrible Jurassic Park 3 or its much more fun follow up Jurassic World had.After all these years, The Lost World still remains the best sequel in the series and rightfully so.","The Lost World is Steven Spielberg's follow up to the innovative Jurassic Park, so how does it's sequel measure up by comparison? Well it's far better than most have given it credit for. The Lost World is a flawed film, but it's a film that set out to be different, and not just a rehash of the previous film, something the newest film in the franchise Jurassic World has done. Many seem to like Jurassic World for how it \"recaptures\" the feel of the original film, but by comparison, comes off as a pale soulless imitation of Jurassic Park.The Lost World however, gets away from the theme park idea, and does something that wasn't expected. In The Lost World it is revealed that there was another island called Isla Sorna (Site B) that had dinosaurs that were bred, and raised before being brought to Jurassic Park, on Isla Nublar. The film starts with a wealthy family yachting, and stumble upon Isla Sorna, where their daughter is severely injured by little dinosaurs called Compsognathus that act like land Piranha.Jeff Goldblum reprises his role as Dr. Ian Malcolm, and is summoned by John Hammond for reasons unknown. Ian Malcolm is still a sarcastic character, much like he was in Jurassic Park, but his character is visibly different after the events of Jurassic park, he rarely laughs, or smiles, and Ingen has made Ian a laughing stock, after trying to create public awareness after what happened to him at the park. Hammond is also losing his credibility, after the incident at Jurassic Park, and Ingen has taken control away from Hammond, and given it to his arrogant nephew, named Ludlow, who Malcolm has clashes with.Hammond tells Malcolm that he has been trying to preserve Isla Sorna, and protect it from human interference, but implies that the island is in danger of being pillaged for it's assets. Hammond say's public opinion could keep exploiters from removing the dinosaurs, but that in order to gain such support, a photo record must be obtained, which means sending people in to research, which Ian immediately disapproves of. This is until he finds out that his girlfriend, Sarah Harding a Paleontologists, has already gone to the island. This gives Malcolm as reason to go to a place he would rather never revisit again, as this dinosaur island has no fences of any kind, and the dinosaurs are free roaming.Ian arrives to the island with two other companions Eddie Carr, a field equipment expert, and Nick Van Owen, a video documentarian as well as Malcolm's daughter Kelly (a unneeded character) who sneaks aboard the ship in one of the team's vehicles. Soon they find Sarah, and come across a herd of Stegosaurus, where Sarah has a close encounter when she gets to close to an infant Stegosaurus. The Lost World focuses a great deal on the nurturing habits of dinosaurs, which expands upon the first film, which tried to portray dinosaurs not only as movie monsters, but as animals. This film carries that idea further, and delves into how these animals act in a more naturalistic environment. The T-Rex's also have an infant, that gets injured by Ingen's team. Sarah, and Nick repair the baby's leg, but when the T-Rex's show up, they're less than appreciative, and wreck the trailers/vehicles, believing they have to defend their territory further. This forces Malcolm, and his companions to join forces with Ingen's team headed by Ludlow, but lead by Roland Tembo, played by the late Pete Postlethwaite. Of course since both teams have different agenda's this leads to conflict. Regardless they come together to try and reach a communication center to get off the island. Of course along the way dinosaurs show up, resulting in casualties. After the group gets separated by the T-Rex's, Roland tranquilizes the male T-Rex. Ludlow then want's to bring it to San Diego, where a facility has been built to house the dinosaurs, since the dinosaurs captured earlier were released by Sarah, and Nick. This is where many people are left divided, some liking the T-Rex running around San Diego, and some hating it.There's no denying that the way the T-Rex gets to the mainland isn't well executed, and makes little sense. It also may feel tacked on because it was, the original ending was different, but Spielberg felt the The Lost World needed a bigger ending, just as he did with Jurassic Park. While it may seem out of place, the entire film teases the idea of bringing dinosaurs back to the mainland. Malcolm, and Sarah find the infant T-Rex that was also brought back, and use it to lure the adult T-Rex, back to the cargo hold of the ship, where they both could be contained, and be brought back to the island. Not before the T-Rex causes some dino-damage down the streets of San Diego, which admittedly is neat to see. The Lost World isn't as good as Jurassic Park, but it isn't as bad as critics, and \"fans\" alike have made it out to be. The Lost World has it's issues, such as underwritten plot elements/characters, and unneeded characters like Malcolm's daughter Kelly, but also has a strong cast/performances, and the effects are even more believable looking than in the first film. The animatronic dinosaurs looked even more convincing in The Lost World, especially the T-Rex's that had subtle changes made mechanically, making them much more lifelike. The CGI is also impressive, especially during the Compsognathus sequence that required the animation of several little dinosaurs. John Williams provides another great score for The Lost World, adding more tribal melodies to go with the mood, and look of the film. The Lost World may not be Spielberg's best film, but it's hardly his worst, and it's a decent, well made followup to a film that never really needed one.","The Lost World: Jurassic Park continues the story of John Hammond as he summons chaos theorist Ian Malcolm to his home with some startling information, while nearly everything at his Jurassic Park had been destroyed, his engineers happened to have a second site, where other dinosaurs were kept in hiding. It seems the dinosaurs on the second island are alive and well and even breeding; and Hammond wants Malcolm to observe and document the reptiles before Hammond's financiers can get to them. Still directed by Steven Spielberg, we are brought a sequel to one of the most iconic films on the 90's, this sequel still brings the fun, humor and as much as you expect, more Dinosaurs. We are still brought the glimmering sight of the animatronics dinosaurs and some CGI ones as well, but Spielberg really took the time to make these reptilians so fundamental and pure. Besides the dinosaurs, Jeff Goldblum is another extravagant aspect of this film, he makes the film so jocular with his corny charisma, he really was the standing point for me in this. The film I will say does suffer from some pretty cringeworthy moments from some nonsensical dialogue and scenes that will make you sigh from incredulity. One reason I'm really grateful with this film is that we get to know more about the characters we come to know and love from the first film, I just love knowing more about characters that come to grow on you and just have a pleasure participating with there time. The action in this really dominates, it makes the storyline shift more to a side of the film that makes it more compelling than you think it'll be, it gives more fun to a story that you wouldn't expect to variate. Even though there isn't much strong tense moments, there are occasions where it can get pretty nerve racking, from malicious destruction from rapid creatures to violent beings, there is still a lot of excitement to take from and have fun with but at least it isn't dispiriting. Overall, The Lost World may not be as perfect as its predecessor but it's still one of the most fun sequels that we have been given in such a long time. We are still brought corny aspects, Jeff Goldblum, Dinosaurs, humor & even amusing action. TLW certainly delivers another roaring experience!","I still don't get the hate for The Lost World: Jurassic Park and the love for Jurassic Park III? Can Someone explain to me why is III in your opinion so much better than The Lost World: Jurassic Park is? In my opinion III lacks on the story and is not terrible because Steven Spielberg did not Direct the movie but it is terrible because the whole movie makes no damn sense it is too short, it lacks on the story and is really awful to me. It has no character development in III at all and lying to Dr. Grant and trick him on that island is just inhuman and awful. And Why is Jurassic World so much better than The Lost World: Jurassic Park? I am sorry is not better than the second movie. In my opinion is not, but is at least better than Jurassic Lark III is but is not any better over The Lost World: Jurassic Park (1997).An Underrated classic sequel in the series and the last movie directed by Steven Spielberg. I have enjoyed this movie much better than Jurassic Park III and Jurassic World. The movie is very bashed and criticized by their fans of the first film. Just like Indiana Jones and the Temple of Doom this is the sequel that is very bashed from critics and fans again. This is the first and unfortunately last great sequel to the original Jurassic Park. I think Jeff Goldblum and Julianne Moore did a good job on there performances. The Lost World: Jurassic Park is like Godzilla T-Rex in San Diego. I still love This movie a very underrated science fiction/action sequel film in The Jurassic Park entry franchise. I think for it's sequel it had a good start running. The Lost World: Jurassic Park is loosely based on Michael Crichton's 1995 novel The Lost World.The film won 1 award for Best Effects and Visual Effects. Things I don't like: The film has a few problems that are really unnecessary and I really hate it:The daughter of Ian is black in here,which makes to me no sense since Ian is white. Vince Vaughn was unnecessary to cast him and unneeded. I seriously hate Vince Vaughn,this is a science fiction/Action film not a comedy Vince get this in your head! Vince stole Roland Tembo bullets for his shot gun and with that action Vince jeopardized and put whole people in the camp in the mortal danger and T-Rex come after them and eat bunch of people cause of him. Roland could shot the T-Rex and save people and because of Vince's action he couldn't. I seriously hate Vince Vaughn for this. I am glad he was cut by the end of the film.Peter Stormare/Compys sequences from swarm of Compsognathus knock him and killing him were really unnecessary and unneeded etc.), plus it has a sluggish pace and such.Baby T-Rex in this movie was extremely annoying and his yelling in the trailer and in the car it annoyed me so much and on end of the movie.Thing's I love in this movie: T-Rex dinosaur in a city San Diego, the chase and eating people in the city are awesome. Ian and Sarah drive to the amphitheater harbor and pick up the infant. They make sure they bait the creature with its infant and drive back to the docks and place the infant in the cargo hold of the ship.Sarah prepares a sedative dart and shoots the T. Rex as Malcolm closes the cargo hold door, trapping the animals inside. Awesome! Surviving hunters travel through an open field of tall grass. Ajay tries to warn them, shouting \"DON'T GO INTO THE LONG GRASS!\" but none of them listens and are killed one by one by Velociraptors.Pete Postlethwaite as Roland Tembo as famous animal hunter was awesome, I seriously I love the actor and his character, He came to Isla Sorna along with his hunting partner, Ajay Sidhu, in hopes of gaining the ultimate trophy and not for the money a male T. Rex.He survived in this movie. A shame a good actor Pete Postlethwaite died 4.years ago and he is not with us anymore. Jeff Goldblum as Dr. Ian Malcolm from Jurassic Park (1993) and Julianne Moore as Dr. Sarah Harding did a good job on there performances.Returning of John Hammond his nephews Tim and Lex the same actors from Jurassic park (1993). Tim and Lex had a brief cameo but John did had a cameo on the end of the movie. Daughter Kelly to do some a gymnastics and kick a little raptor trough the window was really a bad ass awesome.Cgi and the film effects wasn't that bad either they were really good. John Williams did return as music composer and he did return with his theme music score. Like its predecessor, The Lost World: Jurassic Park was scored by famed composer John Williams (a longtime collaborator with director Steven Spielberg).John Williams didn't write a stereotypical sequel score, but instead developed a wildly different style for the different location, cast, and darker tone of the second Jurassic Park film.The Lost World: Jurassic Park is a 1997 American science fiction adventure film. It is the second installment in the Jurassic Park film series. A sequel to 1993's Jurassic Park.I love Jurassic Park (1993) as everyone do but I also love The Lost World: Jurassic Park. NOTE: I still take this movie over Jurassic World and over Jurassic Lark III anytime. Grade: A- 9.5/10","The Lost World: Jurassic Park is an above average sequel.  I just saw it for the third time and I will still continue to fight for it.  The script (although containing flaws) is a billion times better than its sequel, Jurassic Park 3.  When I look back at the three times I've seen it (Theater, VHS, DVD) I saw very few flaws in an overall exciting movie.  The biggest flaw is that the \"wonder and amazement\" were at a low level.  This is mainly because we were exposed to it in the first film and it is hard to keep things fresh.  Other than that, this film is one of the better sequels ever. Great action and adventure, (3 of 4 stars)","No matter how cliché the story line gets, or how many suspense sequences that have been done millions of other times in other films appear on screen, you can't deny how much we all love seeing gigantic dinosaurs scare the living daylights out of moviegoers. These ancient and magnificent beasts are brought back to life with the directed craft of no one other than Steven Spielberg, the movie God. With the huge success of \"Jurassic Park\" in 1993, Spielberg keeps the story going strong with \"The Lost World: Jurassic Park.\" Four years after the failure of Jurassic Park on Isla Nublar, John Hammond reveals to Ian Malcolm that there was another island (\"Site B\") on which dinosaurs were bred before being transported to Isla Nublar. Left alone since the disaster, the dinosaurs have flourished, and Hammond is anxious that the world see them in their \"natural\" environment before they are exploited. Yes, there are villains trying to exploit dinosaurs. How cruel. We continue to see the scientific approach to balance the epic chase scenes and the terrifying T-Rex sneaking into tents and eating scientists left and right. Sadly, we don't get the same visual effects as we did in 1993. They seem to be a tad less in quality. However, who cares! They're good enough to scare the heck out of us and wrap our minds in a world where even the ridiculous and dimwitted plot of a squeal is still ridiculously entertaining and a joyous thrill ride full of razor sharp teeth and ear-piercing roars.","The Lost World was a film which had to reach a very high standard. following the impressive Jurassic Park which pioneered the consistent use of CGI and arguably one of film's most symbolic creatures, T-Rex.Because of this a pretty good film was slated. In one sense justifiably so as the Lost World could never compare to the first instalment in the franchise. It was always going to be an impossible task to improve on the first film which had so much going for it and unsurprisingly it is not the best film in the world.In some respects this film does shoot itself in the foot. The end sequence is silly, there are numerous unexplored errors and for the raptor fans, they get a pretty raw deal. Furthermore the Lost World continued on the premise that children would be able to survive a dinosaur attack while mercenaries with guns could not...If you leave these issues aside the Lost World is a respectable movie and no matter how many times I watch it does entertain.What I liked was that unlike Jurassic Park 3, it continued the idea of the dinosaurs being animals rather than monsters. Apart from the Raptors which were just as scary and monstrous as in the first film, none of the animals attack for pleasure or financial gain (compared to the humans in the film). They hunt and kill for their basic needs and instincts. One could say that the film follows an ecological route, and criticises all corporate involvement in animal exploitation.Plot wise, The Lost World is basically an add on to the first film. We find out that there is another island other than Isla Nublar with dinosaurs called Isla Sorna and the now bankrupt Ingen wants to harvest the island in order to ship the dinosaurs back to the mainland. Hammond, who had recently lost control of the company, however disapproves of this and so decides to construct a team to document the animals in order to gain public support for their conservation. He tries to recruit first film survivor Ian Malcolm who initially refuses.However when Malcolm finds out his girlfriend Dr.Harding has already gone to the island on her own he decides to rescue her. What transpires is a 2 hour survival movie full of dinosaur attacks, suspense, action and Jeff Goldblum (Malcolm) attempting sarcasm along the way.While the sarcasm may grate after a while the movie does have some great one liners: Nick:\"Hammond's check cleared or I wouldn't be going on this wild goose chase\".Malcolm: \"Well your going to the only place in the world where the geese chase you\"Similarily while the plot isn't that complicated the characters are enjoyable. Malcolm is definitely the funniest with his sarcastic one liners (see above). Roland played by Pete Posthelwaite (a surprising casting as I would not expect to see him in a Hollywood action movie) is especially good as the cold, yet human hunter character in the film.The only annoying character is surprise, surprise Malcolm's daughter Kelly, who despite spending almost the entire film screaming and whining about the least bit thing (stereotype teenager), is brave enough to do a complicated gymnastic routine inside a derelict house on rusty bars to kick a Raptor through a window. It is an annoying trait in Jurassic Park that in every film there is always an annoying kid.Interestingly when compared to the book the film is does a good job. Jurassic Park the film was nowhere near as good as the novel but there is a definite improvement over the Lost World Novel in this film. Not saying the book was bad (or for that matter the first film), it was just that I enjoyed the film a lot more. My advice is to watch the film before you read the book. While the book has its moments don't expect it to be a repeat of Crichton's classic first novel.Additionaly the CGI and models come back with avengence!!! As you'd expect after 4 years of development the dinosaurs look better than ever, and still look pretty impressive. Certainly this film has aged pretty well.The moving models have improved as well. Supposedly both T-Rex's in Lost World contained twice the equipment of the previous T-Rex from the first film. Lost World looks great and as you would expect from a Spielberg film, has great production values. Locations look sublime with the coniferous forests, tall grass and no fencing making the new island look and feel like a true lost world rather than a science experiment. Finally I personally loved the look of the vehicles. Certainly this is not a film which will disappoint (or unlike the JP III will confuse you)with its look and feel and as stated before has great production values.All in all, this is a severely underrated film which was always going to be slated if it was not 100% as good as its predecessor. It is not as good as Jurassic Park but the Lost World is definitely a film you can enjoy. Certainly it will entertain you for its 2 hour duration and has always been a personal favourite. So its unsurprising that I was overjoyed to see it move ahead of the disastrous Jurassic III in the IMDb polls. A well deserved result.","Where do you go when you've created one of the best popcorn thriller films of all time? Many of the haters of The Lost World wouldn't be able to answer that question. Meanwhile, I believe that Spielberg and Koepp found the right way to go about it, and created an delightfully ominous sequel with enough substance that it can proudly stand beside the original.The Lost World is noticeably different to the first, which Spielberg, Crichton and Koepp deserve credit for. They haven't just remade the first one all over again. They've brought back the stuff we loved - water vibrations, the wonderful score, Jeff Goldblum - and added plenty of new stuff so that this film can stand on its own.I love the feel of The Lost World. There is some terrific tension, some outstanding drama and I never once felt that I was watching a set - its a real place. Two of the greatest scenes in the film are Sarah on the glass, and the slow ruts carved in the grass as the raptors close in. Its so tense and yet beautiful in its simplicity. My absolute favourite scene are Eddie's attempts to rescue Nick, Sarah and Ian from the trailer. Everything that can go wrong does go wrong. And when the T-Rexes show up to attack Eddie, I groaned in sympathy, for what else could possibly go wrong? Even the jump scares in this movie were effective.What always set Jurassic Park aside from its popcorn thriller counterparts is its wonderful cast. The original had a beloved trio of characters and even beloved minor characters like Robert Muldoon. This film takes that formula and even manages to improve on it. Kelly isn't as good as Lex and Tim, but the writers made a wise choice in focusing on Ian Malcolm as the film's protagonist, wheras the previous film sidelined him for most of the movie. Of the new additions, I loved Julianne Moore as Sarah, Vince Vaughn was surprisingly believable as Nick, the ever-underrated Richard Schiff is terrific as sardonic Eddie Carr, and Arliss Howard strikes the perfect note as the villainous Peter Ludlow. He isn't diabolical, but rather snobbishly set in his ways, and he fits the film perfectly. But by far the best character in the film was Pete Postlethwaite's Roland Tembo. His opening monologue sold me on him before he even got halfway through it. He's fast-talking, knows what he wants and doesn't suffer fools. I would have loved to see more of him. The VISUALS of this movie! I never fully appreciated the animatronics of Jurassic Park until I saw this film as well. The highest compliment I can possibly offer is that the dinosaurs look real. I could touch them and I can tell what they'd feel like. A small dinosaur headbutting a car door, and a T-Rex chomping on a traffic light are the two highlights of just how seamlessly the visuals blend with the reality. These days, the dinosaurs would be 100% computer animated, and that is a dreadful shame, because present day films can't capture even a fraction of the wonder of this film.Yes there are a few flaws. The opening scene raised the stakes so high, until John Hammond reveals that the young girl survived. Not only is this completely unbelievable (when looking at Dieter's fate later in the film) but it makes the opening scene obsolete. They should've just told the story without showing us, because the appeal of Jurassic Park is its ominous tone.At times, the camera cuts away from crucial moments, but considering that they were limited to what they could create at the time I can forgive it. Dieter's death is the most obvious example - he runs behind a log and gives up the fight instantly so he can die off camera. Yes the gymnastics scene was a bit silly, but I didn't mind in the scheme of things. The T-Rex stomping through San Diego felt both tacked on and required a huge suspension of disbelief (no one hears it stomping around) and there are a few major plot holes (namely, if the T-Rex devoured the crew of the ship, why was it still trapped? A deleted scene was meant to show that raptors did it, but then where did they go?)But I won't end on a low. The Lost World boasts simply incredible visuals, a lovable cast, a novel idea and a lingering sense of ominous dread. I could never have asked for more in a sequel.","Steven Spielberg's sequel to his Syfy classic Jurassic Park not only follows the same formula that fuels the fire of the original movie but has a rhythm of it's own to be it's own film. It's a darker, sleeker film this time around with a mean streak that delivers the goods ten fold yet never forgets it's roots as an intelligent thriller with a lot of heart. Jeff Goldblum once again provides the intelligent and dramatic backbone that drives the story forward while Richard Attenborough provides once again the majestic presence that makes this movie meaningful. Throw in a wonderful and strong turn by Julianne Moore and a strong scene stealing turn by the late great Pete Postlethweite and you have a stronger cast of characters than you had with the original.Spielberg brings some of his best bag of tricks to this film as well with some of the most show stopping scenes in the series including a falling Trailer scene that has to be seen to believe and to this day, the most scary raptor attack ever put on film. While there are a few viewers who did not like the climax in San Diego, that climax still packs a fun, mean wallop that neither the two sequels that followed (The horrid Jurassic Park 3 and the so so Jurassic World) have top in their entire films.While Spielberg and his main cast of characters did not return for the next two films in the series, nothing can take away from the sheer fun and excitement that The Lost World gives to the series. You never know, Spielberg could just come back again with his crew to bring the Jurassic Park series back to it's former glory.","Steven Spielberg's superb follow up to his original dinosaur classic finds Ian Malcolm (Jeff Goldblum) with the help of John Hammond (Richard Attenborough) trying to protect what survives the original Jurassic Park in a sequel that truly lives up to it's name sake. Julianne Moore, Vince Vaughn, Arliss Howard and the great Pete Postlethweite rounds out the cast in a darker, more relentless film that has some of the best action sequences ever filmed for a Jurassic Park movie. While the film is not with out it's faults, this movie is with out a doubt the second best film in the series. Sadly, neither Spielberg and Goldblum return for the next two sequels in the series and the quality of the series definitely take a sharp dive in quality with their departure.Which is a shame because the Jurassic Park series deserved more than the dumb and badly acted monster movies they have become since Spielberg and Goldblum left the series after this film.","This is a solid follow up to a classic dinosaur crisis movie. I remember watching this movie at the theater as a kid and enjoying the heck out of it. As a kid I just really found this film to be mesmerizing, exciting and entertaining. Watching it now I still found it to be a enthralling and fun movie to watch. The plot is coherent and the sense of action and excitement with the story is put together very well. There is a lot of good ideas and settings when it comes to the dinosaurs and human interactions and action sequences. It all melds together in the good old fashion Spielberg style. To the point it was thrilling from beginning to end. Most of the characters was coherent with the story and it was nice to see Dr. Ian Malcolm (Jeff Goldblum) as the main lead this time around, since he was a likable character in the first \"Jurassic Park\" movie. Although the actress that played Ian's daughter was pretty bad when it comes to the acting department, at least in this film. Overall this movie is most definitely a worthwhile watch and it's one of those films I don't get why some reviewers bash on it.8.4/10","Very good sequel to Jurassic Park finds Ian Malcolm (Jeff Goldblem) in a race against time to save his girlfriend(Julianne Moore)and stop Ingen from taking dinosaurs off the island in order to take them state side for their own Jurassic Park. While the wow factor is gone from the first movie, the intensity is up considerably with some of the best action, tension and humor of the series. Goldblem once again commands the screen as the audience guide and it's voice of reason and the special effects manages to even out due the first movie by leaps and bonds. The late Richard Attenborough and Pete Postlethweite rounds out the cast in this very worthy follow up. Its definitely The second best entry in the Jurassic Park series and the best follow up to the original Jurassic Park","Creating a worthy follow-up to a major blockbuster is no easy task. But if all the pieces are in the right place, it is not impossible. Four years after the enormous success of Jurassic Park, Steven Spielberg took control of the director's chair once more in an effort to enhance the franchise and add on to his already spectacular legacy. Did he succeed? In the eyes of most critics, no. However, I applaud Mr. Spielberg for an admirable effort and creating another crowd-pleaser, even if it didn't match up to the high expectations.On another personal note, I was very happy to see Jeff Goldblum reprise his role as Dr. Ian Malcolm as he has always been my favorite character in the series. Since Malcolm is now more aware of the dangers of John Hammond's activities, his personality is less goofy and more serious this time around compared to his previous adventure.It took several viewings for me to appreciate this film to its fullest. At first, it seemed weak because it sacrificed the philosophical messages that helped make the first film great to fit in more action. The philosophy is found in one of the key quotes by John Hammond. \"Life will find a way.\" There *is* a point to all the chaos because it is all caused by the humans and their relentless desire to interfere with nature. Every tragic event seen in the film could have been avoided with sensibility and that is the message that is echoed throughout the entire series. Don't attempt to control the uncontrollable.If there's one thing that makes the film worth watching, it has to be the special effects and the dinosaur animatronics. The infant T-Rex featured in this film is so lifelike that I often had to remind myself that it wasn't a real dinosaur. It was *that* convincing.Also be on the lookout for Vince Vaughn (before he became the mega-star that he is today) as one of Hammond's researchers and a humorous scene involving a T-Rex in the modern world.","My Rating: *** out of ****. I dont understand all the horrible reviews for this film. Sure not a great film, but definitely a good, entertaining movie. I enjoyed it just as much as the first Jurassic Park. The Lost World still contains impressive, eye popping effects. These are just as flawless as the CGI as the first Jurassic Parks. There are more dinosaurs and they all look great. The film contains more action than the first and its all exciting. One scene that stands out is the scene with the Raptors in the fields. I love the way Spielberg shot it.\nThis is not a big acting movie, but its not that bad. Jeff Goldblum is good as Ian Malcolm, but had a little more energy in the first one. Julianne Moore is adequate but looks a bit uncomfortable at times. Vanessa Lee Chester is better than the other kids in the last film. The rest of the acting is adequate. Many people thought this film was redundant of the first. I wouldnt call it redundant but it is a little bit too familiar in areas.  The Lost World takes place in a different area but it is not much different from the first one. However, it is an entertaining movie. The action overshadows the story.\nThe big problem I have with The Lost World is the ending. It doesnt make sense how The T-Rex got loose. Its also a King Kong Rip-Off. Its visually stunning looking, the TREX doesnt look out of place at all. But it was showing CGI instead of doing something with the story. Nevertheless, even with its flaws The Lost World is entertaining and not worthy of its horrible reviews.","Okay, the best Jurassic Park is obviously Jurassic Park. It was the most faithful to the fantastic Michael Critchton books, plus it was well done. As a sequel, The Lost World does just fine. Of course, I'm used to seeing horrible sequels all the time. Jeff Goldblum does a good job reprising his role as Ian Malcolm, and the newcomers of Julianne Moore and Vince Vaughn do well too. The story is a little unbelievable, though. After recently being replaced by his nephew as CEO of InGen, John Hammond(Richard Attenburough) reveals to Ian Malcolm(Goldblum) a site B: A place where dinosaurs run free. He sends him and his girlfriend, Sarah Harding(Moore), technology expert Eddie Carr(Richard Schiff) and photographer Nick Van Owen(Vaughn) to document the dinosaurs, while the official InGen team, led by Roland Tembo(Pete Postlethwaite), tries to capture the T. Rex and transport it to San Diego. As always, there is many bone-crunching deaths, the Special FX are excellent, but the story and plot fall a a bit short. Overall: 7/10","The Lost World is the sequel to the 1993 classic Jurassic Park. Whilst this film is not as good as the original it does stand up well as a sequel. Jeff Goldblum returns as Ian Malcolm. Malcolm has been asked to return to another Island were Dinosaurs have been allowed to live without cages. Malcolm refuses but when he finds out his paleontolagist girlfriend is already there he goes with a team of documentariens to rescue her. However several accidents ensue and they are left stranded on the Island with a second party. The film does not have the all round strength of the first and is far more dependant on thrills and its visual effects this time round. It does however succeed as good entertainment and its better than the third installment in the franchise by quite a bit. The Dino sequences are handled well with the Raptors in the long grass being the highlight of those and quite possibly the entire film. The T-rex features strongly again ( and this time there's two of them) along with a new and nasty little green dinosaur compsagnathus. The acting is'nt Oscar worthy or anything like it but the characters do have some charm and when they are put in danger you care what happens to them which is always a good sign. It does suffer a little from a bloated and anti climatic ending that is funny for about 2 minutes but I wont spoil it for you none the less. I give the Lost World its high rating because it does exactly what it sets out to do, entertain us. So I think its fair we overlook some of its flaws as with any kind of blockbuster sequel they are always there.","I saw this in a theater in 1997 and I thought I liked it.  I just saw it again on DVD last night, and I now I know I do.  What I can't figure out is why so many people think it's so horrible.   After seeing JP III a few weeks ago, I still think The Lost World is better.  Of course the original is the best, but The Lost World is packed with suspense, witty dialogue (especially Goldblum's), and of course, the usual great looking dinosaurs.  There are a few things I don't like, the gymnastics routine towards the end being at the top of the list.  But other than that and a few silly lines, this movie is almost as thrilling as the first.  Personally, I don't care if the plot of this one is weak.  I've never even really given that any thought.  The first 100 minutes or so are loaded with excitement, then the finale with the T-Rex in the city is, if you ask me, played mostly for laughs. Yes it's like Godzilla, and The Beast from 20,000 Fathoms, but that's the point.  It's like those movies but with 21st century (almost) special effects.  And it's just plain fun to see this dinosaur stomping through the suburbs, drinking from a swimming pool and, wreaking havoc at gas station minimart.  I think if you don't take the San Diego scenes too seriously, and look at it as Spielberg's way of paying homage to *and* poking fun at the Godzilla-type movies, you can appreciate this portion of the movie. Then to wrap it all up with Bernard Shaw from CNN, and an obvious open door to a sequel - what more could you ask for?  Well, maybe a better plot as some people seem to be saying, but I think this is a great popcorn movie and it works for me.","The Lost World.Steven Spielberg's second visit to the land of claws and teeth isn't nearly as good as the original but it does have some scenes that will go down in cinema history. But unfortunately for every great scene there's an equally dumb one.Set on the second island of Isla Sorna, an island that was suspiciously never mentioned in the original film. Apparently this is where the dinos are bred before being taken over to Isla Nubla where the park is situated. Anyway Dr Ian Malcolm's girlfriend, Sarah played by Julianne Moore is on this island taking snaps of the dinos and obviously she needs to be rescued. Why a woman is alone on an Island with man eating dinosaurs is beyond me? Perhaps that's it right there. They're man eating dinosaurs! (A subtle nod to the original movie). So off Malcolm (Jeff Goldblum) goes to rescue her. He tags along with a research team and they soon encounter a second team who are there with a totally different agenda. Before you know it, there's the running and the screaming and secondary cast members being munched in all sorts of gruesome ways.The Lost World isn't completely devoid of the magic that made the first film great, however it does seem that the people involved in making this film have tried to suck out as much magic as possible. Only Spielberg's fantastic direction and the superb cast try to deliver. This time around there's no Dr Grant or Ellie. Lex and Tim get only a brief appearance and John Hammond is bed ridden. Never the less, there is a good cast here. Goldblum seems to be the go to man to help save a franchise. Anyone who has seen the abysmal Independence Day sequel will know what I'm talking about. Vince Vaughn and Julianne Moore are strong support. Pete Postlethwaite is the show stealer and why he wasn't utilised more is quite the mystery. Regardless of this it was the original cast that helped conjure up the magic in the first film and sadly they're absent here.TLW is a much darker affair. Admittedly I agree getting chased by carnivorous dinosaurs is never going to be light hearted but there's just something missing. I think it maybe the large number of bad choices made by the script writers. Like I mentioned before, for every great moment there's a really stupid one! A great scene of the splintering glass window is masterfully directed by Spielberg, it is then quashed by a stupid scene when the young girl kicks a Velociraptor by performing a gymnastics routine!Another example is when the Velociraptors enter the long grass and we see their trails closing in on the victims. This is classic Spielberg. Only to be quashed by the T Rex arriving in San Diego. What did Rexy do? Did he kill everyone on board of the ship and then steer the vessel to port by himself? I think he'd struggle with those tiny little arms of his. Also he must have escaped containment, killed everyone then got back into containment and closed the lid! Eh?!!The First half of TLW is a decent movie then it seems that all creative control was taken away from the director and given to a bunch of morons that have never watched Jurassic Park. Rather than concentrating on making a plausible sequel, what we have is a very long commercial for a certain German car company. Taking the movie out of its correct environment and putting it into the city was perhaps one of the worst ideas in movie history. This is a 6/10 movie mainly due to the first half of the film. Still it's better than Jurassic Park III."],"review-user":["AaronCapenBanner","classicsoncall","SanteeFats","gummydy","gigan-92","gcd70","jaredpahl","JDheart","jaredmartin-464-711711","condillon","ivo-cobra8","FilmCell","dom-lerose-8","AdderCowley","luke-a-mcgowan","givoled","coolkeoo","KineticSeoul","midnighttheater","Dash_Rendar","MF210","indy42","eternalsea","jann-6","stevenrotherforth"],"review-date":["18 September 2013","25 January 2015","7 July 2013","17 June 2015","30 September 2010","28 June 2008","29 August 2015","27 June 2015","21 June 2015","10 June 2015","8 August 2015","12 August 2001","7 June 2015","12 November 2007","6 June 2015","1 July 2015","28 June 2015","8 June 2015","8 July 2015","18 April 2006","19 October 2003","25 March 2006","11 March 2006","19 August 2001","12 November 2017"],"review-rating":["7","7","8","8","8","7","9","9","8","8","10","8","7","8","10","10","8","9","8","8","7","7","9","6"],"review-title":[" Part II.\n"," \"Yeah. Ooh-ah, that's how it always starts.\"\n"," Very good\n"," Not as good as the original but it's still a very good movie in it's own right.\n"," Here Come the Money Shots!!\n"," Entertaining and unbelievable\n"," Supremely Thrilling, Suspenseful, and Visually Breathtaking, The Lost World is a Summer Blockbuster Sequel Done Right\n"," Still the best sequel to Jurassic Park.\n"," The Lost World is a Very Unappreciated Sequel\n"," An Underrated Sequel\n"," Defending an Underrated Sequel The Lost World: Jurassic Park\n"," Above Average Sequel\n"," Somehow cheesier than the original, but still entertaining!\n"," Not perfect but you know what pretty damn good\n"," The Lost World boasts simply incredible visuals, a lovable cast, a novel idea and a lingering sense of ominous dread. I could never have asked for more in a sequel.\n"," Epic, wondrous and thrilling: The Lost World remains the best sequel in the Jurassic Park series.\n"," The first and unfortunately last great sequel to the original Jurassic Park.\n"," A solid sequel to a classic\n"," Definitely the second best entry in the Jurassic Park series.\n"," Excellent Sequel\n"," Underrated\n"," Pretty Good- Not as Good as Jurassic Park, not as bad as JP3\n"," Very good sequel\n"," I like it\n"," A film where a girl kicks a dinosaur by doing gymnastics! (Say no more)\n"]}