{"review-url":["http://www.imdb.com/title/tt0178928/reviews"],"review-text":["Holy Cow! Don't watch this unless you collect creative travesties.Superficially, this is a stew of the same persiflage usually served up on family TV: kindly voodoo projected as Luke Skywalker's Force; a protective father who goes through painful doubt; innocent pubescence; racial justice; magical help for the North during the Civil War (no lie); leavened with all sorts of minor platitudes. Probably, this is no worse than thousands of slapdash dramas. What makes this interesting, almost hypnotizing, is how it rests on the rough skeleton of Shakespeare's play. It blindly tramples, it innocently debases arguably the best play of arguably the greatest writer in English.Gosh, I cannot even describe the arbitrary transmutations used to fit this simple diorama: Arial a slave, Frederick a Union officer, Prosper a planter who learned voodoo from his slaves... it all hardly matters. One interesting thing: The Tempest was the first great work of literature about the American experience. Almost 400 years later, it still has some of the most profound and complex visions of dealing with non-Europeans, slaves and the forces of nature in the New World. All of that rich content is waiting to be leveraged, dummied down if need be. All is ignored here.It is as if the Hardy Boys were named Tom and Huck and the plot was about petty racial dramas in painting a fence. Wonderous.And Peter Fonda? This was right after the interesting Ulee's Gold, where he actually acted. No sign of that here.","Jack Bender's \"The Tempest\" is an adaption of Shakespeare's play \"The Tempest\". Bender transports the plot from medieval Italy to Mississippi during the time of the American civil war. He includes the slavery problem and the role of revenge in wartimes.Prospero, re-named Gideon Prosper is not the Duke of Milan but a landowner in Mississippi. He learns voodoo magic from the female slave Mambo Azaleigh. He saves her son Ariel, who thus accompanies him into his exile. The island is not situated on the sea but in a swamp near the banks of the Mississippi. There lives an Alligator hunter, a so-called \"Gator-Man\", who later tries to rape Prospero's daughter Miranda. During the time of the civil war, Ariel wants to join the Union troops to help fighting against slavery. Prospero does not care about the war. He is only interested in his personal revenge on his brother Antony. When Antony and his bookkeeper Willi Gonzo (Gonzalo) try to cross the river, Prospero raises a storm. The Union soldier Frederick gets lost in the swamp and finally comes to the island. He and Miranda fall in love with each other but Prospero won't accept that. Meanwhile, Ariel transformed into a raven by Prospero, finds out that Antony has feigned to ally with the Union but plans to betray them. Antony and Gonzo meet Gator Man in the swamp and conspire with him against Prospero. They kidnap Miranda and Ariel but Prospero freeze them and helps the Union defeat the Southern army. In the end Ariel is free, Frederick and Miranda are bound to marry, Prospero returns to the plantation and Gator Man gets back the island.Peter Fonda represents Gideon Prosper powerfully and convincingly while the character of Antony stays rather flat. It was no bad idea to perform the Tempest before the background of the civil war but perhaps the director has risked too much. In some parts the story seems constructed or comical. Gator Man for example does just appear without any explanation. That it needs a kidnapping to bring Prospero to his mind and that he loses confidence in his power shows that Bender tried to make Prospero more human but only made him a weak old man without his magic. Prospero's original authority and wisdom is not made clear.-------------End of Part 1----------------------------","I tried to watch this adaptation, but it was just so awful I couldn't torture myself like that. The performances were quite sub-par, with the exception of Ariel. Fonda was way over the top in a role that should be handled with some subtlety. I have studied Shakespeare and seen many adaptations, and this is, by far, the worst one I have ever seen. I have to wonder why on Earth someone made this film. Shakespeare can, and has been, beautifully adapted in many cases. This is not one of them. If you must watch this film, may I suggest a drinking game? Take a drink every time they go off book from the original idea and two drinks every time Fonda overacts. You should be quite drunk in a very short time.","The (DVD)movie \"The Tempest\", directed by Jack Bender, was published in 2001. It didn't make its way to German cinemas and neither the director or an actor were able to receive an important award for this movie. The movie refers to the Shakespearean play \"The Tempest\" which was published at the end of the 16th century. The director tried to create an modern version of this play, but failed. At the beginning of the movie the plantation owner Prosper gets in a conflict with his brother Antonio about the treatment of their slaves. Antonio sets his brother a trip and tries to kill him but with the help of a witch, Prosper is able to escape and flees with his daughter and a slave called Ariel to a small island nearby the Mississippi river. For over twelve years he has lived isolated on this island, till a lucky chance enables him to take revenge on his brother....If Prosper will be lucky you have to find out by yourself.In my opinion this film is really a bad try to create a modern version of the original play by William Shakespeare. The story of the movie is confusing as well as the characters. Prosper doesn't have the same powers as in the tempest..... END OF PART I","I keep waiting for Peter Fonda to start acting.  For someone who comes from such a talented family, it's a mystery to me why Peter Fonda can only play Peter Fonda trying to play someone else.  And, that's the good news in this disappointing dog of an adaptation of The Tempest.  A string of loosely connected ideas that only suggest a relationship with the Bard's great play is what we're served.  The setting is the Civil War and Prospero's (here Guideon's) evil brother looks like an 1890's melodrama villain, complete with Snidely Whiplash moustache.  I kept waiting for him to go \"Uh ha hah!\" which would have been a high point in this dreary presentation.  None of the supporting cast was memoriable and Peter Fonda's lack of expression and wooden body movements made the lackadaisical story drag on and on. The Tempest is the Bard's statement about the rage of man's unjust treatment of man.  The only believable character was the Gator man, the Caliban counterpart.  The transferrence to the swamp had possibilities but the Civil War setting just didn't make it.  All in all, a very disappointing production.  I saw it on video and would advise, if you want a Willy Shakespeare fix, save your money on this one.  Rent something else, like Branagh's Much Ado about Nothing, or Kevin Kline in Midsummer's Night Dream.","I felt the treatment - being set during the Civil War - was original and refreshing. Peter Fonda was, perhaps, a little bit bland as Prosper/o but still a workmanlike performance.I was a bit disappointed that Gator Man, the Caliban figure, was portrayed as merely a 2D villain, not the somewhat self-pitying Frankenstein's-monster-type Shakespeare paints.","The dialogue and acting only meet soap-opera standards. This must have aired on TV during times when mainly teens and pre-teens were watching. While it is not a terrible film, the over-done special effects and trite style is certainly not for those expecting quality. Peter Fonda must have been paid a good amount for him to stoop to this low level, or maybe he did it with young viewers in mind.While the costumes and editing are commendable, I am perplexed how Fonda was nominated for a Golden Globe for his acting. If you are sick in bed, or a dreamy young person then this film may be for you - otherwise do not waste your time.","For a TV movie this was definately worth seeing.  All the acting was very well done and the story itself had a touching universal theme.  I have not read/seen the original and as a rule I can't stand Shakespeare, but I enjoyed this movie(the civil war setting was very well done as well).  Dont expect to see an epic, however you should find it moving enough to enjoy. By the way (on a side note) don't compare this (or any other movie for that matter) to the original work.  Movies aren't supposed to transfer a book to the screen, but rather take the general idea of it a then adapt a story from it. When people say \"the book was so much better\" (they're usually wrong anyway) what they are really trying to say is the book was so different.","Never having read or seen the Bard's original work, I can't begin to compare this work to his story. So I won't. Instead I will just say that this was a very entertaining story with some very nice special effects (and some that looked a little lower in budget, but still decent enough to enjoy). I thought all the primary actors did a fine job performing. The style of magic seemed more black than white and is almost certain to offend anyone easily upset about that sort of thing, but I thought it was well done.","Shakespeare would have been outraged. The writers mutilated Shakespeare's amazing work. Ariel is the only believable acting performance. The African voodoo, secluded swamp, and \"Gator Man\" character make the movie a mockery of Shakespeare's true Tempest. Don't waste your eye-sight on this movie.","I had just finished struggling through the Shakespeare play, and found the core idea of the whole thing fascinating.  Shipwrecks, magic, hallucinations, a beautiful girl, the evil protaganist.  When I saw the ad for a tv movie, I knew I was going to like it and I did.Katherine Heigl is one of my favorite actresses (Miranda) and she carried the role off just right.  The special effects were convincing enough to not interfere with the enjoyment of the movie.  My favorite part is Ariel morphing as he returns tot he ground.  Plus it helped that Ariel was gorgeous.Nice work...just glad it was a tv movie or it would have gotten mauled by the critics.","...but it's still an entertaining TV movie.  The transposition to the Civil War makes a nice change of pace, and adds a few subtexts (such as Ariel's servitude to Prosper/Prospero) that you might not otherwise see. Thankfully, they didn't try to make it a mini-series:  at 90 minutes, it's just about right."],"review-user":["tedg","anika_trelenberg","scapozza","kampfschweinhenrik","artzau","Tamaal","nz man","sangris","Willscrlt","jjohnso4","Aislynn","Gislef"],"review-date":["21 July 2000","11 January 2005","15 October 2005","11 January 2005","7 February 2001","7 November 2001","5 September 2001","16 June 2000","7 January 1999","29 April 2001","27 September 1999","15 December 1998"],"review-rating":["3","1","3","2","5","10","10","2","7"],"review-title":[" A Wonderous Travesty\n"," The Tempest\n"," Insulting\n"," The Tempest\n"," Disappointing and off the mark\n"," Personal through love and deep knowledge of Shakespeare.\n"," A simplistic made-for-TV flick aimed at the young crowd.\n"," a lot better than I expected\n"," I've never read the original, but I really liked this one.\n"," Confused effort, poorly written, waste of visual exertion\n"," Definitely not big screen material, but satisfying\n"," Shakespeare, it's not...\n"]}