{"review-url":["http://www.imdb.com/title/tt0076975/reviews"],"review-text":["i can remember when i first watched it. i thought wow, the real spider man. of course i was like 5 years old, but the wonderment that i felt at watching a real person in a spider man costume stopping the bad guys with his spider powers...i would love to see it again. but, since Stan lee and the majority of people didn't like it, we'll probably never see a DVD release of it. I wish i knew a way to find them on VHS or meg...anything. i'd love to watch them again. Stan, for peter's sake, some of us enjoyed the old series, let us have them again. And for future reference, Stan, if you need any help with casting future releases of Marvel movies, let me know.","I have caught this show in reruns on SCI-FI before, and I have to say I enjoyed it.  Okay, so maybe the special effects aren't the best in the world, but it was still a fun series. Spider-Man has always been one of my favorite superheroes and I really enjoyed watching him fight crime in this series. I wish they could have brought in more of the supervillians for him to fight though. But it was still a fun series to watch.","For starters, I think this show was great fun and had great storylines but not many people seem to like it.I guess whether you like it depends on your age. If you're a young kid who's been brought up on a diet of CGI and all those amazing special effects then it probably doesn't appeal to you. But I think it was fun.The stories were great. In one two part episode Spider-Man battles an evil villain by the name of Mr White who has stolen an atomic bomb which he plans to detonate. There's plenty of fun as Spidey battles dangerous henchmen and performs some unbelievable stunts. Another great episode featured Spidey in Hong Kong but my favourite episode was where Spidey investigated a bogus haunting.Nicholas Hammond was good as Peter Parker/Spider-Man and he played the part of man with huge responsibilities on his shoulders very well. The late Robert F. Simon played the grumpy but good hearted Jonah Jameson and did a good job.There were no super villains in the shows which I think was a good thing. The Incredible Hulk series of the 1970's didn't feature super villains either. Spidey got involved in real situations with believable people and in a superhero TV series I think that is much better than having a super powered villain every week.All in all, highly recommended. There's some good stunts in the series too. Whilst I am quite sure this series will pale in comparison to the new Spidey film due to hit UK cinemas in June 2002 I would have no problem in recommending it to superhero fans.","the amazing spider-man TV series had had 15 episode's all together and did not last that long as a live action series it was shame as nicholas hammond wanted the incredible hulk and spider-man to team up but it never happened, the series did have its comic book moments j.j shouting at parker robert f simon was great as jameson he had the voice. aunt may was played by irene tedrow and was terrible as aunt may in the first episode she is constantly moaning at peter to take his pills for his allergy some of my favourite comic book moments spider-man's web shooter is broken and he goes to a taxi and ask' him to take him home the taxi driver refuses because spider-man has no pockets in his costume spider-man jumps on top of Capt. Barbera's car and puts his head down to speak to him, spider-man gets cloned and at the end j.j is dressed in a spider-man costume and capt barbera arrests spider-man but it not the real spider-man its jameson in the costume","When I was a kid I remembered this show but thought that now as an adult the show might be a bit dated. Well yes it is but for me that makes the show more retro (and the musics very funky). This show is mostly well written. I do think its a travesty that this show was cancelled after one season especially when this show was more popular than the Incredible Hulk. I think fans should overlook the poor special effects and enjoy the stories. This next sentence contains spoilers: My favourite episode as a kid was when there were two spiderman that battle against each other interestingly a similar idea is concocted in Spiderman 3 the movie. I liked the ideas in this TV show some will hate it. I believe Stan Lee wasn't a fan.","Does anyone know the status of a potential DVD release of Spiderman with Nicholas Hammond. It seems like everyone has forgotten about this series. Granted the F/X were not like they are now and it was played as camp. I know that a lot of Spiderman fans think of this series as a bad stepchild. I disagree, just part of the Spiderman legacy. I wish that whoever has the rights to release this on DVD will do this. I hope it is not another rights issue like the Superboy series. While we are at it. Sam Raimi if you are out there, contact Nicholas for a cameo in Spiderman 3. To some of us who grew up with Nicholas as Spiderman, it would be a treat. Bring Spidey back.","Though, short lived \"The Amazing Spider-Man\" was one of the best made for TV versions of a famed comic book hero. Only \"Wonder Woman\" (Lynda Carter) (the best of the genre and \"The Incredible Hulk\" (Bill Bixby, Lou Ferrigno) were better.\"The Amazing Spider-Man\" outclasses the 1966-1968 \"Batman\", because the high camp elements of the latter often ruin the adventure. \"Spider-Man\" outclasses all three television interpretations of \"Superman\"- \"Lois and Clark\", \"Smallville\", and of course the George Reeves \"Superman\" which brings up the rear.\"The Amazing Spider-Man\" was an action drama, during the late 1970's, the pre-CGI era, when stunts had to be performed by stunt men, not in the database of a computer. \"Spider-Man\" had its own very talented stuntman to perform the death defying daredevil acrobatics. His name was Fred Waugh, who donned the spidy suit for the action sequences. Nicholas Hammond, better known as one of Julie Andrew's children on the all-time movie classic \"The Sound of Music\" was Spider-Man during the dialogue scenes. Hammond's Spider-Man also had his own secret identity as Peter Parker, similar to Christopher Reeve- Superman/ Clark Kent, Adam West-Batman/Bruce Wayne, and of course Lynda Carter as Wonder Woman/ Diana Prince.It's unfortunate that the series only had thirteen episodes. Because when the first episode hit the airwaves in November of 1977, the entire country was watching it on CBS that Wednesday night. In all fairness, CBS should release this pilot episode as well as \"The Deadly Dust\", the \"Captive Tower\" etc. on DVD shortly. \"Spider-Man\" was short lived, but did have a cult following, and in my opinion was a heck of a lot better than the movie interpretation of the famed comic book hero starring Toby McGuire.CBS might be hesitant to release these episodes for two reasons. (A) There might not be a broad market for them based on the lack of longevity of the series and a generation of children and young people who weren't born when the series originally aired in the 1970's. (B) One of the early \"Spider-Man\" episodes dealt with a terrorist with designs on the World Trade Center, which was attacked twice many years after this show went off the air, in 1993, and of course the devastating attack against this country on 9/11/01 in which the towers were destroyed and many innocent lives were lost.However I don't think that it would be in bad taste to release this \"Spider-Man\" episode even if the show was adventure, derived from a comic book, and camp in nature. The live action \"Amazing Spider-Man\" doesn't have a large following but it has a cult following. If and when CBS releases it out on DVD this cult following could be explained along with the episode in which Spiderman saved the towers in 1978, but how in September of 2001 real life proved to be different from the movies. I like to follow the news, but I also like Science Fiction/Fantasy. Therefore I am eagerly awaiting the release of \"The Amazing Spider-Man on DVD\".","Yes, it's campy.  Yes, the acting wasn't very good and the scripts were dull.  Yes, the special effects are *very* dated.It doesn't matter.  \"Amazing Spider-Man\" is one of those time capsules that perfectly captures late 1970s action TV.  It was funky, it was campy, it was cheesy, and it was great.Sure, it could have been better.  Given time, the series could have hit its groove and easily been as good as the other Marvel TV series of the day, \"The Incredible Hulk.\"  Legend has it this show was cancelled because of low ratings, but I heard CBS both wouldn't commit to a consistent timeslot, and they didn't want to be known as the Superhero Network (they had \"Hulk,\" \"Wonder Woman,\" and showed the hideous \"Captain America\" and \"Dr. Strange\" movies).  They could have had a real winner...","The show wasn't all that bad. Despite revealing mistakes, weak acting and, story lines. It did all right in spots. Some of my favorite episodes were The Curse of Rava, A Matter of State, Photo Finish, and The Chinese Web. But Spider-Man couldn't be the hit that The Incredible Hulk was. Although it could have lasted one more season. Nicholas Hammond seems a lot older and mature, then the comic book Peter Parker. But he was good in the role. I hope when The Spider-Man movie comes out in May. That fans will rediscover this series.","It couldn't be the hit show that The Incredible Hulk show was. But it did allright in spots. At least it wasn't boring like The Bionic Woman. It may have had a few badly written episodes. And some revealing mistakes. But the acting was pretty good at times. And the wall crawling scenes were terrific also. It may not have been the best superhero show. But it was not the worst. Nicholas Hammond was a lot older then the comic book Peter Parker. But he was still good in the role. I hope when the Spider Man movie comes out, that fans will rediscover this series.","i also loved the spiderman tv series/movies from the 70's. i had a mean crush on nicholas hammond.","Honestly I can't get over how so many people disliked this show. I can understand why, but I still think they're being a bit unfair. Granted, the lack of actual comic book villains may be off-putting, and there are a great deal many differences between the comic book Spider-Man and this Spider-Man adaptation BUT the core of the character is still intact and and that is the most important thing. Also, you have to remember that this TV-Series was made in the 70's. You honestly can't expect to be wowed by special effects. And hey, I'm a 90's kid and yet I still love it. Nicholas Hammond actually fits the role of Peter Parker rather perfectly, he even looks like him from the 90's animated series. Granted, he lacks Spidey's witty humour that we all love but I think in this show's case, that's a good thing. This show can be a lot of fun and has a very catchy theme song.I hope that someday this show will get an official DVD release but until that day comes I'll just have to make do with my VHS copy.","Some people think this was a rather bad TV series, with cheesy effects. (considering it was filmed between 1977-1979) but really, look back at those years and think, \"We didn't have computers back then.\" so if you think about it, it's a rather good TV series.I always figured bad ratings killed the show, but no. the network did. they canceled out their theme as \"The superhero network\" and abandoned a short lived spider-man series. if it had gone on, it probably would have run well into the 80's, and if it was really lucky (And i mean really lucky), the early 90s.And no one wanted to pick this series up.Anyways, Jolly old (or young) Nicholas Hammond, of The sound of music fame, is brought to the TV screen as peter parker, the Secret identity of the amazing spider-man. along the series, peter deals with a clone, a beautiful girl from a foreign country, and a corrupt politician.while the series is way out of timeline (being that peter is already graduated from university, and thats when he gets bit, and uncle Ben is already dead,) The audience is treated to action, suspense, and the attitude that the characters have towards peter and his alter ego, spider-man.While it's also slightly disappointing that Robert. F Simon looks nothing like J.J.Jameson, it's not so disappointing that Betty grant isn't Betty grant, but a hot African American girl (who reminds me of Halle berry, who is one of the hottest women on the planet) so really, this one wasn't so bad.but considering the time, and how much drama they packed into this one, it kind of foreshadows what bad TV is today. either way, it's entertaining, even for today.8/10","I only saw the pilot episode of this drivel, but that was enough for me. This awful series seemed to be made by people who never read a Spiderman comic or just didn't care at all about that character.This lacked of every single one of the virtues that made \"Spiderman\" a popular comic in first place. It didn't have anything to do with the story in which it was supposedly inspired. Instead of that, it was something completely different (And not good at all, for that matter) which just shoehorned the superhero for a few couple of scenes. Several viewers complained about the liberties that Sam Raimi took about the original comic when he made his movie version of \"Spiderman\", but all those liberties are nothing compared with the absolute nonsense that this series was.As something independent to the comics, this is merely bad (With extremely poor production values and a boring storyline) but as an adaptation is just plain terrible. This series is just one big bad joke that is best forgotten.0/10 (I would give this a negative score if I could)","Like \"The Incredible Hulk\", \"Spider Man\" (played here by Nicholas Hammond) was another in the superhero stable that entertained legions of fans (adults too) in the late seventies, myself included. My review here refers to the pilot in which mild mannered Peter Parker inherits the senses and agility of a spider, after coming into contact with radioactive waves during an arachnid experiment. His boss at the local rag (David White, post-Larry Tate on \"Bewitched\") is eager for him to cover the story of how seemingly random citizens are suiciding, which leads both Parker and his alter ego to discover an elaborate mind control plot involving the evil Edward Byron (Thayer David) whereby he commits crimes vicariously through his hypnotised victims.What distinguishes the pilot from its peers, in my opinion is the cast - Mike Pataki and Bob Hastings as the cops, Jeff Donnell as Aunt Parker, Len Lesser (future uncle Leo on \"Seinfeld\"), Ivor Francis and Harry Caesar. Lisa Eilbacher is so-so as the love interest in a role not too distant from her signature performance in \"Beverly Hills Cop\". It's definitely young adolescent material, but even as an adult, I found plenty of drama, action and light comedy to enjoy.Less pretentious than the recent remakes, I'm still a little confounded as to why the three feature-length titles (the other two are \"Spider Man Strikes Back\" and \"The Dragon's Challenge\") haven't been re-distributed for DVD, to enjoy some residual popularity (and just plain ride the coat-tails of the Raimi success wagon). Anyway, probably still available on VHS, so if you're spider mad or just curious about this now 'ancient predecessor', it shouldn't disappoint.","Just reading why this show got canceled makes me rather steamed. This was a favorite of mine as a kid and I always watched it when it came on no matter how many times I saw the episode. Sure the effects were not great, but they were also not horrible either. They did a fairly good job with the costume and it had the nice 70's vibe to it that is always enjoyable to see and hear as the music was also very 70's. It did not really have any villains from the comics, but then most comic book live show adaptations had none to very few actual super villains from the comics. Spidey's powers were a bit different here too, he had his Spidey sense and he could climb walls, but he was not nearly as strong as the Spider-man of the comics. He was super strong though as I do remember an episode where he broke into a room by breaking the door knob off, he just was not the car hurler that the one from the comic book can be. The show was set in Los Angelos so there were not as many buildings to swing from, but they did okay with the web. It is nice that this show actually has the web shooters and not organic shooters of the movie. I love the movies, but part of me wishes they would start over and do the more smarty pants Spidey that has the mechanical web shooters. This show had a good star as Peter Parker and he was okay as Spider-man, it is nice to see a Spidey who does not basically live in the slums like he does in the movies. Neither this show nor the movie though has a Spider-man that is quick with the insult like the one in the comic. Still, this show was fun without being as corny as the Batman show.","The Amazing Spider-Man is the first live-action TV series that was based on the popular superhero comic book of the same same.It follows the exploits of Peter Parker,a freelance photographer of the Daily Bugle who managed to acquire superpowers after he was bitten by a radioactive spider that enabled him to acquire the abilities of a spider. It stars Nicholas Hammond of the Sound Of Music fame together with Michael Pataki,Robert F. Simon,Ellen Bry,Chip Fields and Irene Tedrow.While this maybe only have been a short-loved TV series which was unfortunately and unfairly axed not due to poor ratings but rather due to a TV executive's strong dislike for superhero TV series on the TV station.Looking back from today,it maybe now considered to be cheesy fun due to the absence of CGI technology back in the 1970's that special effects were definitely conventional and due to being a low-budget being a TV series.But nevertheless,it was definitely an enjoyable TV show especially for children who are superhero fans.Hammond did a good job of portraying Peter Parker and Spiderman.The stories were definitely good during its time and they were definitely enjoyed by its viewers.Overall,it maybe a short- lived but it still remains a classic almost 40 years after it was aired and it has definitely been considered a cult by Spiderman fans.","For me, it was the first Spiderman. And that does it, like many childhood impressions, the best. Sure, after decades, it has the mark of its period and that is fair to be. But the seduction remains. It could be defined as nostalgia but it works. Because Nicholas Hammond gives a nice performance, because the special effects are naive, because CGI is unborn and the script is so easy than it becomes a delight after a hard work day. And, sure, because zou are part, in same measure, from serie. For memories. And for inner child.","Along with \"Wonder Woman\" and \"The Incredible Hulk,\" \"The Amazing Spider-Man\" was the only other live-action superhero TV series to make a splash during the 1970s. It's really pointless to describe the plot since if you know the Marvel Comics comic book series that inspired Spider-Man, then you already know the story, with Nicholas Hammond as Peter Parker/Spider-Man. This series always had great death-defying stunts, which were great for the time it was made, when everything had to be done using live, flesh & blood human beings and not a computer. Many other iterations of Spider-Man would follow in the later decades after \"The Amazing Spider-Man's\" debut on television, most notably three animated series and two live-action movie series. Sam Raimi's \"Spider-Man\" movie series - with Tobey Maguire as Peter Parker/Spider-Man - was my favorite incarnation of the character ever, with \"Spider-Man 2\" (2004) as my favorite superhero movie and my #2 favorite movie of all time. Spider-Man is my all-time favorite superhero. This show was just another reason why.10/10","It's easy to look at 1977's The Amazing Spiderman series and laugh our asses off. We've already had three live action Spiderman films that were able to perfectly capture Spidey's grace and agility through the use of cutting edge CGI. But, even before Sam Raimi's films, the original live action Spiderman series was ridiculed on a regular basis. Even going as far back as the mid 80's, it looked so craptastically cheesy it rivaled Adam West's and Burt Ward's Batman in preposterousness. But, hindsight being 20/20, I realize we all may have been wrong. It may very well be the single best interpretation of this characterEVER.I know this sounds insane. However, there were a lot of things this show had that really worked. One, for instance, is the lead. When this show was still airing on CBS, the comics saw Peter Parker as a college student somewhere in his early to mid twenties. He was depicted as being tall and having a lean, athletic build. Well, Nicholas Hammond matched those qualities to a tee. He stacked up to Peter Parker the same way Christopher Reeves did to Superman. I won't lie; his portrayal lost some strength when he was in costume. However, out of costume, he did a damn fine job playing Parker as a highly intellectual dude with great power and great responsibility.Besides Hammond's physical performance, I've got to bring up the special effects. Silly string that stood in for webbing; webs that had to wrap around flagpoles to stick; wall-crawling that looked like a man being lowered from an off camera rig; web swinging that definitely looked like a stuntman being hurled through the air at the end of a rope; Spidey leaping from rooftop to rooftop by overlaying video onto background footage. Yeah, they all look more like student film territory by today's standards—worse even. Nonetheless, when this originally aired, these visuals were bleeding edge stuff. CGI was all but science fiction. Green screen tech was too cost prohibitive for television. This was the best that could be done, and, in 1977, it glued asses to seats. So while the first ten minutes of 2002's Spiderman blow this out of the water, ASM was quite revolutionary and outright jawdropping for its time.Spiderman looked cheesy, but realistic. The truth of the matter is that spandex only makes for dynamic attire in comics, cartoons and videogames. In real life, even if you were built like Hugh Jackman or the Rock, it would make you look like a chump with an overly pronounced feminine side. So Hammond looking less than impressive, when in costume, is pretty much what Spiderman would look like in real life—deal with it. The costumes worn by Tobey Maguire and the one to be worn by Andrew Garfield are more dynamic and eye catching. But, between style and reality, I always choose the latter.Over its brief thirteen episode run, none of the villains from the comics were featured. This is a point of contention for most, and an understandable one. But this was a TV show in the 70's. There was simply no money to include characters like the Green Goblin, Doc Ock, Sandman or any other classic foe of Spidey in a compelling manner. Even so, ASM did feature a take on the 1970's clone storyline when it was still a fresh in the comics. It wasn't much, but it was the best they could do and was quite remarkable for the time.Given the era in which this aired, ASM was nothing short of miraculous. 1977 was over twenty years before comics were finally allowed to enter the mainstream without being frowned upon. It was an extremely hostile period where comic books were treated with all the dignity of a dirty Kleenex. It was so hostile CBS gave ASM the runaround for two years before pulling the plug. When they did, it wasn't due to low ratings because the show was doing well. They cancelled it simply because, after Wonder Woman and the Incredible Hulk, they were afraid CBS would come to be known as the Comic Book Station. Seriously. That's it. Hell, Stan Lee saw fit to bash this show (even though he was a script consultant). But I'm willing to bet that could've been over him not being given a cameo—something he's apparently quite fond of.In the over 20 years between the cancellation of ASM and the 2002 film which rewrote the rulebook on blockbuster premieres and opened the floodgates for Marvel in Hollywood, ASM was ridiculed by any and everyone. I too occasionally took shots at it. But, now in my thirties, I can honestly look back and see what ASM really was. It was a program that had a lot of ambition, took a lot of creativity, did everything it could to succeed and still came up short—all because it was two decades ahead of its time. Had the public attitude towards comics been more positive back then, this would've been on the air for years and been a smash hit. It would've been the best live action Spiderman, probably to this day.If you're a fan of Spiderman or of comic related media that's seen fit to ridicule this effort, stop. 1977's The Amazing Spiderman deserves your respect. It deserves all of our respect. And I just want to add Stu Phillips' theme is one of the most infectious pieces of music I've ever heard. It gets in your head and just sticks there—like a spiderman.","I absolutely love \"The Amazing Spider-Man\"! It holds a very special place in my heart, as it was through this very series I was first introduced to one of the most famous and beloved comic book characters of all-time, Spider-Man.Nicholas Hammond, who played Friedrich von Trapp in \"The Sound of Music\", portrays Peter Parker/Spider-Man to absolute perfection. Hammond is smart, funny, and everything the character of Peter Parker should be and that Tobey Maguire wasn't. Unlike Maguire, Hammond actually has charisma and charm.Fred Waugh, the stunt coordinator, also took on the role of Spider-Man when some of the more dangerous stunts were performed. His work is still awe-inspiring. Some highlights include Waugh's scaling of the Empire State Building, hanging from a helicopter high above the city streets, web slinging from one building to another, etc. I enjoy watching real stunts performed by real people not CGI. CGI is too easy to spot, and it really takes away from the enjoyment of an action sequence. Give me a real guy in a real Spider-Man suit any day! The supporting cast is strong with Robert F. Simon, Chip Fields, Michael Pataki and Ellen Bry all well-suited for their roles. Simon's take on J. Jonah Jameson, the publisher of the Daily Bugle, finds that perfect balance between Jameson's trademark grumpiness and enough likability to explain why anyone would keep working for him. Chip Fields is a delight as Peter's occasional sidekick, the tough-talking but sensitive Rita Conway. Rita is Jameson's assistant, and while not in the original comics, her sassiness and playful personality make for a welcome addition to the Spider-Man mythos. Michael Pataki, the late great character actor, played the irascible Captain Barbera, a New York City cop who was often suspicious of both Peter Parker and Spider-Man. His character appeared only in the first season. Ellen Bry played Julie Masters, an attractive young woman who was both a friend/love interest and rival of Peter Parker. She, too, worked as a newspaper photographer but not for the Bugle. Julie's desire to always get her story led her to get in over her head on more than one occasion. Her character appeared only in the second season.While the series changed the origin story of Spider-Man, most notably with its removal of the murder of Uncle Ben, a satisfying alternative that was more friendly for 1970s television and for any children who would be watching was filmed in its stead. Aside from that, the series was quite faithful to the source material. Spidey's powers were generally the same: he had superhuman strength, the ability to cling to walls, leap high in the air, a super sense of a balance and a \"spider-sense\" to warn him of danger. Spidey's gadgets including his web-shooters, utility belt and \"spider-tracers\" also played an important role in the show. To date, \"The Amazing Spider-Man\" provides the only live-action depiction of the aforementioned spider-tracer tracking devices, and are featured prominently in several episodes of the series.I can't say enough good things about this show, I absolutely love it! I give it a ten out of ten! I definitely recommend checking it out. The series hasn't been officially released on DVD yet, but nearly all episodes have been released on VHS. You can find \"homemade\" DVDs on many online auction websites, you just have to look around for 'em.It has been recently announced that unknown actor Andrew Garfield will be taking on the role of Peter Parker/Spider-Man in a new reboot of the Spider-Man franchise scheduled for release in 2012. All I can say about that is there's no way he'll be able to top what Nicholas Hammond's already done. Hammond was, is and always will be the best Peter Parker in my book. Thank you, Mr. Hammond, for introducing me to Spider-Man and for providing me with many fond memories of watching your show while dressed up in my own Spider-Man costume, pretending to fight crime while on my own make-believe adventures.","Okay, I admit it. I'm a geek and I read comics.  Something about many comics is that they work wonderful on paper and in cartoon form. But the logic of them working as live action is hit or miss. Marvel comics in general this is very, very true of. While the incredible hulk show TV show and X-men movie turned out great. How many other marvel super heros turns in live action failed? (HMMM, Cap. America, Punisher, Fantastic four, and THIS SHOW!)This show is so cheesy you'd swear it was made in Wisconsion. Nick Hammond was waaaaay to old to play Peter Parker. (he wasn't boyishly cute enough ethier, but that's just fan girl musings.) Where's Mary Jane, Flash Thompson and many episodes Aunt May? Where's the cool bad guys? Most importantly, where's the money for the show!! The stunts and special effects are lacking. Even when I was a little kid I could tell that. One episode they have a bomb made out of egg crates. Yeah, uh-huh, we need a superhero for that. Spider sense is just light's flashing in Nick Hammond's eyes. Now his spider sense makes him psychic. What!! The scripts were pathetic and often you couldn't have a episode with out a few plotholes. But it is entertaining as camp. My finance and I watch this show and laugh our butts off. It is funny if one wants a lesson on how not to do a superhero show. I just hope the new live action movie does a heck of a lot better.","I am a little surprised that this series is remembered by even the relatively-few people it seems to be; as a 12 year-old fan in 1977, I caught what episodes of this series as I could, although I must have missed some due to it being yanked all over the schedule like it was. Of course, kids, we only had TV Guide, and the local newspaper television supplements to help us, you know, in those \"prehistoric\" days.I have seen a couple of the television movies made from episodes tacked-together lately, the nostalgia value is still high even if the series' production vales weren't so great. Nicholas Hammond as Peter Parker/Spider-Man was really too old for the part, but that said, he was clearly a good-hearted, kind fellow one could accept as a super-hero sort of person. I missed more elements from the comic book like Mary Jane, for example, but they did adapt the clone saga from the mid-1970s era of the title which was nifty. Robert F. Simon did well as J. Jonah Jamison even if he didn't look anything like his comics counterpart.I think CBS mad another error by not having super-villains to oppose Parker, as this undoubtedly turned off many of us then-young fans. I suppose the fellow with psychic powers in the Curse of Rava was about the nearest thing to one.All this aside, it wasn't as bad a show as many seem to think, given the limitations of 1970s action/super-hero television effects. I'm not sure if this is out on DVD yet or not, but hope it will be so in time if it isn't.","This show suffered many set backs which really hurt it. A live action Spider-Man is a really good idea, but this did not have the writing or the special effects to build on the premise. It seemed kind of campy to me (not as bad as that Batman show, but you know what I mean). This show could of lasted longer if he actually fought super villains from the comics and had better writing."],"review-user":["gowen29","Indyfan82","Big Movie Fan","fish4spider-1","jamesgoodsir","betorlando35","jrm23july@aol.com","Shield-3","mack3175","mack3175","mergalvez","Yugi-Muto","The_Light_Triton","Rectangular_businessman","Chase_Witherspoon","Aaron1375","Desertman84","Kirpianuscus","dee.reid","alanrayford","chucknorrisfacts","hippiegal","jefffisher65-708-541158","Op_Prime"],"review-date":["16 October 2005","28 October 2001","8 March 2002","27 December 2005","27 August 2006","14 November 2005","4 May 2006","29 June 2000","13 January 2002","19 January 2002","20 August 2004","5 July 2013","11 February 2008","17 December 2012","16 July 2010","16 September 2009","26 November 2014","22 August 2018","21 September 2012","3 April 2012","17 July 2010","19 November 2001","28 June 2013","17 April 2000"],"review-rating":["8","8","10","8","1","8","7","8","10","9","10","6"],"review-title":[" i liked it\n"," A great live action superhero series\n"," WHY DOES NOBODY BUT ME LIKE THIS SHOW?\n"," this show should be on DVD\n"," A series that met my expectations\n"," The Amazing Spiderman DVD\n"," It Won't Be Truly \"Amazing\" Until CBS Releases The '78 Spider-Man on DVD\n"," Guilty Pleasure...\n"," A fairly descent show.\n"," A fairly descent show\n"," great!!!\n"," One of my favourite Spider-Man adaptations to date...\n"," Too bad this wasn't given any time to stay alive.\n"," The worst Spiderman \"adaptation\" ever made\n"," The Other Spider Man\n"," The show that made me the Spider-man fan I am today.\n"," Short-lived TV Series That Became A Cult\n"," nostalgia\n"," A great, early take on my favorite superhero...\n"," One Amazing Spiderman.\n"," I love this show!\n"," Why comic books often don't work as live action.\n"," Peter Parker is bitten by radioactive spider, become super-hero\n"," Filled with many flaws\n"]}