{"review-url":["http://www.imdb.com/title/tt0123349/reviews"],"review-text":["Based to some extent on writers, David Croft and Jimmy Perry's, own experiences as Butlins Holiday Camp entertainers in the UK during the same timescale the programme follows, \"Hi-De-Hi!\" epitomises the 'slapstick, postcard humour\" of post-war Britain. Set in the fictitious seaside town of Crimpton-on-Sea, \"Hi-De-Hi\" chronicles the comedic goings on within the Maplins Holiday Camp - one of many dotted along the British coast owned by the mega-rich, but never seen (on screen) Joe Maplin.Although the actual show began in 1980 with the pilot episode and ran until 1988 when the BBC deemed it too tame for it's cutting edge comedy department, seasons 1-5 focused on 1959 while seasons 6-9 spotlighted 1960 - a time when the old style British Holiday Camp began to fall into decline. During the first 5 seasons, Jeffrey Fairbrother (played brilliantly by the late, great Simon Cadell) was the camp's entertainment manager; a well meaning, yet slightly pensive ex-university professor breaking free of his upper class background and venturing into the \"real\" world to head his team of entertainment staff who were in stark contrast to his own laid-back personality. From season 6 onwards, Fairbrother was replaced by Clive Dempster (played by David Griffin when Cadell quit the show at the height of it's popularity), an ex-RAF war hero who, in many ways, was similar to Cadell's character in background, but more a scoundrel than a gentleman.However, the real stars of \"Hi-De-Hi\" throughout the nine seasons were Ted Bovis (played superbly by Paul Shane), a stereotypical working class, ale drinking, bawdy comic - someone who could never resist an opportunity to fiddle the campers; Gladys Pugh (played by Ruth Madoc who's currently experiencing a career comeback with appearances in the hit BBC Comedy, \"Little Britain\"), chief Yellowcoat (what the entertainment staff were called because of their bright yellow jackets) and sports organiser - but more importantly, the one person who saved Jeffrey Fairbrother and Clive Dempster from embarrassment by covering up their inexperience in running a holiday camp; Peggy Ollerenshaw (Su Pollard), the slightly dopey, yet lovable lowly chalet maid with a burning ambition to become a Yellowcoat, and Spike Dixon (Jeffrey Holland), Ted's innocent protégé learning more about 'show business' than he hoped for.As usual with a Croft & Perry production, the assembled cast of characters were a bunch of misfits played superbly by the actors involved. Mr. Partridge (played by the late Leslie Dwyer, who was in his 70's by the time he left the show), the alcoholic child-hating children's entertainer; Fred Quilly (Felix Bowness), a former champion jockey with a dubious past; Yvonne & Barry Stuart-Hargreaves (Dianne Holland & Barry Howard), the snobbish former ballroom dancing champions who were in the twilight of their careers; and Sylvia and Betty (Nikki Kelly and Rikki Howard), the two main girl Yellowcoats who were always looking for the type of fun Joe Maplin would never allow in one of his camps.\"Hi-De-Hi\" typified the slapstick era of the late 50s with it's saucy and, to a certain degree, vulgar \"tongue-in-cheek\" humour (jokes about people sitting on toilets and anecdotes about 'women with big knockers' were the order of the day). But despite it's whiff of \"Carry On\" funniness, it was always so innocent and became something of recommended family viewing back in the 80's. Of course, the critics of the show remarked that the show had outstayed it's welcome by a good couple of years, but I disagree. While the early seasons focused mainly on bawdiness and slapstick humour, the latter series of \"Hi-De-Hi\" saw more thought put into the scripts and the main characters (especially Spike Dixon & Gladys Pugh) were able to grow with more sensitive story lines. That said, there were a few criticisms of the show. Clive Dempster was no Jeffrey Fairbrother, and the former didn't quite have the on-screen chemistry with Gladys as Jeffrey did (I personally think it would've been more believable if Gladys had married Jeff); five seasons dedicated to 1959 and four to 1960 caused more than just a few continuity errors (the disappearance of old faces and introductions of new characters weren't explained properly, especially with the Yellowcoats who came and went with much regularity; and the character of Gladys Pugh, who, in the pilot episode was made out to be a free-loving man-eater that was suddenly transformed into a naive virgin like character! Also to mention quite pedantically, most of the 1959 holiday season was covered in season one, so to stretch the rest of the year out in five further series was something bordering unbelievable. Still, the show wasn't meant to be meticulously looked upon, and the comedy more than outweighed it's flaws.All in all, \"Hi-De-Hi\" was probably one of the last comedies from the BBC's golden period, and even if it never managed to rival such British comedic mainstays as \"Only Fools & Horses\", \"Porridge\" or even \"Last Of The Summer Wine\", \"Hi De Hi\" will be best remembered as a comedy the whole family could enjoy. If you haven't already checked it out for yourself, I implore you to do so.","Excellent sitcom from Jimmy Perry and David Croft. A spoof on the post-war UK holiday camps of Billy Butlin (a concept which lives on to this day in Club Med, and equally ghastly).The characters are performers in, or employees of, the camp.  The long-suffering campers return year after year to have tripe dished out to them.  Has dated well and worth watching given the chance. Although the humour is broad it is probably not suited to US tastes.","When this series first started, I freely admit I was not a fan. On first view, it was not up to their shining glory that is Dads Army. On the other hand, nothing is. I first started to 'got it' with the horse on a horse scene. I laughed and laughed. Since then, it has appeared on repeats and channels like UK Gold. The performance of Simon Cadell is outstanding. Every cast member fits their role like a glove. It grows on one and all I can say is, Well Done Jimmy Perry and David Croft.","I get really fed up with sitcoms; you feel you always know what is coming so it ceases to be funny. On the other hand, Hi De Hi, you rarely know what is coming and it's laugh out loud funny. I have just purchased the second set of the series, (series 3 -4)and I am surprised at just how much I am enjoying it all - again. I have nothing but praise for the writers or the actors (or the many unseen crew members) because the entertainment they provide is well worth the wait. The gems that have come from this series and the respect that the actors achieved through it speak for themselves. Croft and Perry created some pure gold some of which shines through Hi De Hi.","This series (at least any episode featuring the late, great Simon Cadell ) was brilliant. As a barman in one of \"Billy's Brothels\" at the end of the 60s, I experienced many of the antics first hand. What a trip down memory lane! Like all of Perry / Croft sitcoms, all the characters are strong and all have a share of the funny lines. Great acting, great comedy and an accurate representation of what post war Britain was all about before the advent of cheap packaged holidays to the Costa Somethings. Along with \"It ain't half hot Mum\" and \"Dad's Army\", this is classic comedy. Brilliantly observed and the larger than life episodes (for example the horse on horse incident) hilariously acted and produced.","I missed the early editions of 'Hi-De-Hi!'. I think it must have been the title that put me off. In those days, the Welsh language editions of 'The Radio Times' only used to print titles of certain shows without imparting information as to what they were actually about. 'Hi-De-Hi!' suggested to me a bad quiz show hosted by Leslie Crowther or some inane U.S. import. I caught up with it eventually, and was surprised to find the names Jimmy Perry and David Croft attached. As was the case with 'Dad's Army' and 'It Ain't Half Hot Mum', Perry based it on personal experience, in this case his time as a Redcoat at a Butlins' holiday camp. Before cheap air travel came along in the '60's, camps such as these sprang up along British coastlines, providing entertainment for working class families and earning millions for their owners. ( As a matter of interest, I worked in one such camp in the '80's as a chef - Barry Island, South Wales - known to all and sundry as 'Shag Land' for reasons I won't go into! )The premise is this: in 1959, archaeology professor 'Jeffrey Fairbrother' ( Simon Cadell ) becomes bored with stuffy Cambridge and applies for a job as entertainments manager of Maplin's Crimpton-On-Sea camp, a post he is ill equipped to handle. Life is one long round of spaghetti eating contests and people in silly costumes being thrown in swimming pools. His staff includes resident comic 'Ted Bovis' ( Paul Shane ), his out-upon sidekick 'Spike Dixon' ( Jeffrey Holland ), miserable Punch and Judy man 'Mr.Partridge' ( Leslie Dwyer ), snobby ballroom dancers 'Barry' ( Barry Howard ) and 'Yvonne Stuart-Hargreaves' ( Diane Holland ), and the unforgettable 'Gladys Pugh' ( Ruth Madoc ), a fiery Welsh woman who lusted after Fairbrother at every opportunity. Bubbly Su Pollard stole the show though as cleaner 'Peggy Ollerenshaw', whose driving ambition was to be a 'Yellowcoat' ( all the important staff members wore them ). A number of sexy girls occupied these coats too, most notably Nikki Kelly's long-legged 'Sylvia Garnsey' and statuesque Rikki Howard's 'Betty Whistler'. We never saw Joe Maplin. He communicated to his staff in the form of ungrammatical missives, which poor Jeffrey was forced to read aloud. \"Hi-De-Hi!\" was the campers' greeting, usually met with the equally inane 'Ho-De-Ho!. One fan was the late Sir Fred Pontin.I always found Bovis the most convincing of these as well as the most tragic, like Archie Rice he was the comedian whose big break never came, reduced to cracking corny gags for the amusement of drunken late-night audiences. He took advantage of his position to indulge in a few perks, and in one memorable episode Fairbrother's patience snapped and he sounded him out: \"Lies! Lies! Lies! Lies!\". A father and son type relationship developed between Ted and Spike over the course of the series.As with every other Perry/Croft production, the cast were excellent, particularly Cadell, Holland and Shane. Ruth Madoc's prissy 'Gladys' was much imitated in school playgrounds, while Leslie Dwyer's misanthropic 'Mr.Partridge' and Felix Bowness' jockey 'Fred Qulley' also proved popular. The visual gag everyone remembers came in the episode 'Charity Begins At Home' as drunken Mr.Partridge spots a pantomime horse riding a real one along the beach. Looking at the bottle of whiskey in his hand, he decides to stick with it and instead throws away the banana he had been eating! With its frothy blend of '50's nostalgia and saucy postcard gags, 'Hi-De'Hi' was a big hit for B.B.C.-1 in the '80's, resulting in a massive upturn in bookings for Butlins and Pontins. John Le Mesurier made a guest appearance, as did satirist John Fortune. Cadell left after the fifth series to return to the theatre. His replacement was David Griffin's 'Squadron Leader Clive Dempster', a war hero reduced to living off borrowed money and with a liking for fast cars. Leslie Dwyer's death in 1986 robbed the show of one of its funniest characters. 'Carry On' star Kenneth Connor was brought in to replace him as 'Uncle Sammy'. Barry Howard was dropped, and Ben Aris stepped into his dancing shoes to play posh pig farmer 'Julian Dalrymple-Sykes'. The period setting occasionally caused problems; in one episode, Sylvia and Betty had to dive into the pool to rescue Peggy who for some reason was dressed as a shark. The revealing costumes they wore were wrong for that era. Still they looked great in them so who's complaining? In another, Ted sang the Tom Jones hit 'Delilah' to campers. It was not composed ( by Les Reed and Barry Mason, incidentally ) until 1968.Maplins closed its doors for good in 1988 - the camp decided to go upmarket, and the staff were told by Alec Foster ( Ewan Hooper ) that their services were no longer needed - and the last shot was that of Peggy ( now a Yellowcoat ) all alone, jumping into the air, and shouting the show's title one final time. I don't rate it as highly as Perry and Croft's other shows, but its popularity is undeniable. It was probably one of the last British sitcoms to generate tremendous public affection, mainly because it featured likable characters in a recognisable setting. Goodnight campers! Hi-de-Hi!","this series is still the most popular comedy series in English television history. it takes place at a holiday camp in england in the 60's. which was only twenty years past when this series was on TV. The late talented simon cadell (1950-96) was particularly good in the lead role and his replacement did pretty well considering who he was replacing. the show is well worth watching and is not only funny, it is nostalgic as well. actually the eighties themselves are now nostalgia! which only adds to the whole feeling of comedic affection that the show was aiming at in portraying a bygone era that of the old holiday camps of the fifties through mid -sixties. so watch it and enjoy a classic comedy from those wonderful brits. I asked my library system in coloardo springs to order episodes of this and they did and they are checked out a lot. so hi de hi , hi de ho! lets go watch a great TV show!.","I liked this series. I love British humour.This show is completely silly but hilarious.I knew of a number of the main actors from another series called You Rang M'Lord which is funny too but sadly, youtube only has a few episodes there.I watched the entire Hi de Hi series on youtube which was great.I noticed the writing started to get old in the last few seasons with a lot of repetitive themes. It went especially downhill in the last season which is common with TV series.I was so disappointed that they didn't write a better and more creative ending. Instead, they wrapped it up in a rather hum drum and nonsensical manner.I think a better and more logical happy ending would have been for the rich man who led the camp to somehow have his family take him back into the fold, in spite of his marriage, because they needed him to come and run their farm and amusement park.That way his wife (the Welsh woman who was the best yellow coat around) could have helped run things and the majority of the rest of the staff could have all been given jobs there. This would have been a much better and a very happy and settled ending rather than the half hazard one they wrote.That's my two cents.","This is a classic example of what happens when a sit com is on TV for far far too long. Everything gets tired and the jokes start getting repeated over and over again. OK, from the start, the first couple of series were quite good. You had an Entertainment Manager (Simon Cadel) being pursued by his deputy played by Ruth Madoc, a cleaning lady wanting to become a yellow coat, an alcoholic child-hating Punch and Judy man, a bent Jockey, and a stand up comedian. As said earlier, it started well but went on way too long. Once Simon Cadel left it went downhill fast, you were getting dire story lines, and a new entertainments manager who Ruth Madoc (again) threw herself at. When a comedy is all filmed in one place there is a limit to the number of jokes that can be cracked. Unfortunately this went on so long every joke was cracked 3 or 4 times over. If this comedy had been stopped after 2 series it would have gone down as an all time classic. As it is, it will be largely remembered for the dreadful last few series.","I throught Simon Cadell was very good as  Jeffrey Fairbrother much better actor then the bloke who replace him he was not very good my favourites in it were Gladys Pugh and Jeffrey Fairbrother and Peggyand ted I throught the writing was very good as well","After Jimmy Perry demobbed from the army, he found work as a Redcoat in a holiday camp. This experience later fed into the creation of his 1980's sitcom 'Hi-De-Hi', which he wrote with his long term writing partner David Croft.Set in the 1950's, all the action takes place in Maplins Holiday Camp. In the first episode, naive Jeffrey Fairbrother ( Simon Cadell ) takes on the role of manager at the camp. He is constantly pursued by sports organiser Gladys Pugh ( Ruth Madoc ). He also finds himself trying to stop fiddles carried out by camp host Ted Bovis ( Paul Shane ) and Spike Dixon ( Jeffrey Holland ) towards the campers.One of the other characters was Su Pollard's boisterous Peggy Ollrenshaw, a chalet maid whose grandiose dreams of becoming a yellowcoat cause no end of problems for the other members of staff. David Griffin, the future Emmett from 'Keeping Up Appearances', joined the cast in series six as Clive Dempster, who took over from Jeffrey Fairbrother as manager.'Hi-De-Hi' had a long run but overall was very much a curate's egg, from what I can remember of the show. Both Su Pollard and Ruth Madoc were boring and unfunny as Peggy and Gladys, particularly Pollard who just came across as a half-wit who wasn't the full shilling, though Paul Shane and Jeffrey Holland formed a decent enough double act as Ted and Spike. Simon Cadell was also too spineless to be funny as Fairbrother. David Groffin, who replaced him, was far superior in my view.The show ended in 1988, when Perry and Croft finally seemed to run out of ideas for the show, though many of the cast later donned servant costumes instead of campsite uniforms for Perry and Croft's superior 'You Rang M'Lord'.","Hi de Hi sent up a popular British institution from the fifties and sixties, the holiday camp ,a relatively cheap seaside holiday where campers stayed in chalets, ate in canteens and enjoyed entertainment of varying quality. Written by the former Redcoat Jimmy Perry, Hi de Hi sent up these regimented holidays that were popular before foreign holidays and caravan camps became more affordable. ( I stayed in a later version of a holiday camp in 1985, based around a caravan park, and it had distinctly Hi de Hi attractions, beauty contests, kids singing, entertainment provided by an elderly comic whose routine was stuck in the fifties).Also this was the era when Hi de Hi was at the peak of its popularity, when 16 million viewers would tune in to watch the goings on at a fictitious holiday camp in 1959. OK it does look a bit cheap and dated now, mostly being filmed in a studio and the jokes could get a bit repetitive, but on the whole Hi de Hi was good fun, particularly the ones with Simon Cadell as the entertainments manager, Geoffrey Fairbrother, an upper class academic who was seriously out of his depth. In one episode he introduces classical music recitals, which go down like a lead balloon, and is constantly being thwarted by the camp comedian, the devious and scheming, Ted Bovis, played brilliantly by the late Paul Shane. Also Fairbrother is lusted after by the sex starved chief Yellowcoat, Gladys Pugh, a Welsh woman who speaks with an exaggerated accent and whose attempts to seduce Fairbrother fail with hilarious results.Indeed watching the re runs on BBC Two recently, after years of being absent from the television, made me appreciate the earthy charms of Hi de Hi, a sitcom hated by the trendies at the time, but very popular with millions of viewers who loved the innuendo, memories of holiday camps and simple humour. Also what made it more watchable were the misfits and has beens who worked at the camp such as Barry and Yvonne, the ballroom dancing champions no one had heard of, the disqualified jockey Fred Quilley, Peggy the cleaner who dreams of being a Yellowcoat, and an alcoholic Punch and Judy man who hates children. As ever from Perry and Croft, a strong ensemble sitcom that is still well remembered today and with a cracking rock and roll theme tune.","A variation of this was said by John Cleese in one of his earliest, if not his first, appearance on an American sitcom, Cheers, on which Cleese was Dr. Simon Finch-Royce, a colleague of Frasier Crane (Kelsey Grammar).In the episode \"Simon Says\", Cleese told Sam Malone (Ted Danson) and Diane Chambers (Shelly Long) that they weren't suited for one another, so Diane kept dragging Sam after Cleese, to his hotel, insisting he rethink his conclusion, until finally, Cleese, a la Basil Fawlty, would scream out his hotel window \"Listen up, World, the perfect couple has finally been achieved, so you can stop trying!!\" I thought of this line as I watched the twelve episode set of \"Hi De Hi\" available to America. A slight alteration to the quote, the perfect sight gag, the perfect physical comedy joke.For those wanting to know, \"Hi De Hi\" was a show that, unlike Mr. Bean, Doctor Who, Fawlty Towers, Hyacinth Bucket, Are You Being Served, Jeremy Brett, Helen Mirren and numerous others, never reached American public television.\"Hi De Hi\" was also about a subject that America knows virtually nothing about; these late 1950s vacation resorts in the UK that were a colossal failure, it seems.At best at this time in America, we had the summer camp for kids, such as what might be seen in Disney's \"The Parent Trap\" or Bill Murray's 1980s comedy \"Meatballs\".The show, however, was a huge success and ran for eight years, dealing with the staff who ran the resort and tried in vain to keep the campers amused.Definitely two of the standouts were Spike (Jeffrey Holland), who was the stooge who would be thrown in the pool for jokes, often in a different costume which we would unfortunately never see again (and most of the time, we didn't see him go in the drink) and Peggy (Su Pollard) definitely a centerpiece as a cleaning woman who wants to be one of the entertainers. She will do anything to be part of the show. She almost drowns when she wears a shark costume to Spike's drag costume of the damsel in distress.That Spike and Peggy take their respective indignities with a smile is what makes it difficult to be amused by other characters such as a grouchy puppeteer or disapproving snobby ballroom dance instructors.So in the episode \"The Day of Reckoning\" this time Spike must wear the legendary horse costume. But such a costume requires a second person. Once again, it is Peggy who volunteers to be the horse's posterior.\"Could be my big break!\" she says.They are taken (in costume) by the horse trainer to retrieve a real horse that has been delivered. The trainer panics when the delivery man recognizes him and flees, leaving Spike holding the real horse's reins.The duo decide to head back with the horse and what do they do? They do what anyone else would do who has a journey to make with a horse. They ride it.In the costume. Truly the ultimate sight gag of the costumed horse perched upon a real horse.Hence, the John Cleese quote from \"Cheers\": Hear that, world, you can stop trying because perfection has already been achieved. Now the most juvenile of minds might say it looks like a sexual encounter, but that is for the viewer to decide.To me, it looked exactly like what it was; two people in a horse costume riding a real horse.That the Marx Brothers or Lucille Ball or Laurel & Hardy or Carol Burnett never did this very joke is beyond me.The only way to top it that I can deduce is two people in an elephant costume on the horse, or two people in the cow costume on the horse, or two people in an elephant costume on an elephant.But the blueprint was here on Hi De Hi.","For me, this programme epitomises everything that was wrong with the BBC in the 1980s. I'm astonished to find that it rates so highly (7.0), although the mere 300 or so ratings it has garnered clearly reflect that only hardcore fans have bothered visiting this page (can't remember exactly how it was that I ended up here). My parents used to watch this tripe (back then we only had the 3 channels to choose from) and I always considered it an especially cruel and unusual form of torture. Despite consisting of only 6 or 7 episodes per series, due to the BBCs seemingly endless cycle of repeats, it seemed to hardly ever be off the air.To give credit where it's due, many of the actors did a reasonable job; the best they could with such appalling, repetitive material. It is to their discredit, however, that only Simon Cadell had the good sense to get out after they won their BAFTA (how on earth did that happen?), having already seen every joke recycled about 25 times over the course of 5 series. The depths to which it plummeted over the remaining 4 series are probably the main reason David Croft had to create 2 more TV series to provide much-needed employment for the 'stars' of this awful show (by this time, we had satellite TV so no-one was forced to suffer through these the way my generation was forced to suffer through the likes of Hi-de-Hi and 'Allo 'Allo).Hi-de-Hi is typical Croft/Perry fare, in that all the characters are severely dated stereotypes, taking part in poorly-conceived and executed farces that could easily have been written by a drunk comprehensive school drama teacher. I didn't think the 1st series was funny when I was 7 years old and I could barely believe they were still making them when I was 15. Amazing, really, that the BBC saw fit to screen this rubbish alongside such gems as The Young Ones (1982) and The Hitchhiker's Guide to the Galaxy (1981). Its 'popularity' (among a largely captive audience) is testament to the fact that, by the cynical use of 'canned laughter', it is possible to convince my parents' generation that practically anything is funny."],"review-user":["SetzersGretsch","Bernie-56","dwf","selffamily","peedee100","ShadeGrenade","mikedobcol","hondacivicdx","welshNick","katslaterc","RaspberryLucozade","glenn-aylett","richard.fuller1","TheDreadedNat"],"review-date":["18 October 2005","19 October 1999","11 September 2001","9 March 2008","25 February 2011","21 July 2008","13 October 2005","8 October 2014","23 October 2007","6 September 2003","23 September 2018","20 February 2015","4 November 2005","19 January 2014"],"review-rating":["10","9","8","9","7","3","6","8","1"],"review-title":[" \"Good Morning Campers, Hi-De-Hi!\"\n"," Hilarious British sit-com\n"," Gets better each time\n"," Wonderful.\n"," true to life\n"," \"That's the first rule of comedy. You've got to have reality!\"\n"," hi de hi an excellent comedy\n"," I liked this series - silly but good for a laugh - I'd rewrite the ending\n"," Quite awful by the end .......\n"," very good series\n"," ''Go go go to the holiday rock!''\n"," Anyone who has been to a holiday camp will understand\n"," Hear That World, You Can Stop Trying Because Perfection Has Already Been Done!\n"," Abysmal\n"]}