{"review-url":["http://www.imdb.com/title/tt0166811/reviews"],"review-text":["It's always good to see my man, the underappreciated Esai Morales, starring in films. But this film is a true waste of his talents. Mr. Morales seems at home in thrillers, and what may have looked promising on paper doesn't always translate very well onto film. The inheritance storyline is nothing new. But any fresh idea would have been a welcome addition to the plot here. Michael Ironside and a miscast Malcolm McDowell are also wasted in roles they could have phoned in. The action in the film is very tired and the plot absolutely predictable. I guessed the entire storyline nearly halfway through the film. Hopefully this film will be just a stepping stone to better films. Peace.","Formula movie about the illegitimate son of a rich Chilenian who stands to inherit a fortune and gets mixed up in the affairs of bad guys and falls in love with a beautiful female lawyer (Vargas). It looks very much like a TV movie, not really exciting. The only reason I bothered to see it was because Valentina Vargas was in it. No real surprises here, though it is nice to see Vargas. Great looking Chilenian landscapes on display but Malcolm McDowell's part is very small and doesn't add much to the movie. Michael Ironside plays as usual a bad guy but this is not one of his most memorable parts. The chase scenes are standard fare.","He's the only reason to see this film.  He gives a very good performance--much better than this crap deserves.  He's very handsome and very talented--he deserves better than this.  Also depressing is to see Malcolm McDowell in this.  He's another talented actor who deserves better but, like Esai, he gives a very good performance.  So, if you're fans of either of them you might want to watch.  Otherwise, stay away.  One more complaint--couldn't we have had more scenes of Esai shirtless?","This movie is really BAD, there is nothing appealing or worth of commentary in it except for the beautiful settings: Chilean landscape. I know I must supply four lines as a commentary for this movie, but the thing is that it is such a bad movie, that I can only say that is actually BAD. Michael Ironside is the only one who saves the money in the film.","Southern Cross, written and directed by James Becket is a waste of good celluloid and actor's efforts. A formula film is not necessarily bad if it pays off on it's promise, which this film does not. It is a tiresome concoction of movie cliches that can be traced to a thousand different films from the past. It is full of random and empty plot twists that add nothing but aimless action, such as a trip by the protagonists to a ghost town where the villains (unexplainedly) follow them. This was obviously concocted as an excuse for a shoot out and escape scene bordering on the preposterous, with people popping in and out of doorways and running past windows while firing pistols at each other.  It makes one believe that somebody told Becket there was a ghost town in the Chilean foothills and he said, \"Oh great, lets do a shoot out scene there.\"Don't even waste your rental money on this. It is a bunch of random bits and pieces from a hundred different films thrown together to call an action drama.","I'm watching this right now on tv55 - I really like it. I can't believe I'm so alone in this.It's slow and the other actors are not so hot - it's true Esai is giving the best performance, but I like the plot as well. It's more plot than a straight \"character\" movie, but not a full blown thriller, I'll give you that. But for someone whose favorite movies are all either character movies, or suspense films - I think it's great.The dime-store support cast is almost irrelevant as they have such tiny parts. Give it a try. Esai is GREAT! The plot is intriguing. The music is fantastic and the scenery - as mentioned previously, is amazing.","This movie was very well done. I loved the way Esai Morales portrayed his character. The best scean is the love scean. hah! No really, the emotions the actors put out is amazing. Great movie! I give this movie an A+"],"review-user":["mrseldomseen","Macholic","preppy-3","andialu","slim-6","randip12345","EsighFan4life"],"review-date":["22 August 2000","9 April 2007","4 June 2001","11 January 2000","11 November 1999","23 October 2004","25 January 2003"],"review-rating":["3","2","3","2"],"review-title":[" Esai Morales, and little else!\n"," Looks like a TV movie\n"," Only worth seeing for hunky Esai Morales\n"," Should be used only as a post card\n"," A poorly written, poorly directed formula film.\n"," Call me crazy, but I like it. 8/10\n"," A+\n"]}