{"review-url":["http://www.imdb.com/title/tt0116835/reviews"],"review-text":["Captivating tale of backstabbing behind the curtains. The movie follows the plight of David Letterman and Jay Leno as they struggle for the elusive Tonight Show spot. Letterman led by his desire for the coveted time slot and Leno led by his agent and little-devil-on-the-shoulder, Helen Kushnick.Kathy Bates (Kushnick) is excellent in this movie, alienating herself from such top dogs as Bob Wright, Warren Littlefield, and Howard Stringer. Towards the end of the film you are so entranced with how she handles every situation from guest bookings to delayed taping, that you find yourself wanting more.John Michael Higgins (Letterman) plays his part to the tee. At times I found myself wondering if he was any relation to the real Letterman.I highly recommend this movie to anyone interested in  entertainment or the world of corporate negotiations.","THE LATE SHIFT was an interesting made for HBO movie that took a detailed look at the power struggle that ensued between David Letterman and Jay Leno when Johnny Carson announced his retirement and both wanted to replace him. This struggle is now part of Hollywood folklore, but for those who don't know the story and are aware of where Letterman is now, it might be interesting to learn that David Letterman wanted to replace Johnny Carson as host of THE TONIGHT SHOW more than anything in the world, but Letterman found his dreams being derailed as frequent guest host Leno had one of Hollywood's most powerful agents, Helen Kushnick, in his corner and working tirelessly to get her client the job. It's not often that we get to see behind the scenes Hollywood machinations recreated for entertainment value, but for fans of these two late night superstars, this movie provided a fascinating look at a very turbulent period in late night television. According to this movie, Letterman was practically promised the job by Carson himself while NBC had promised the job to Leno and that's where Helen Kushnick came in. The movie presents Leno as sort of a milquetoast who allowed his career to be manipulated by Kushnick and feigned ignorance to some of Helen's strong-willed manipulations of some of NBC's biggest power players and it presents Letterman as this smart and savvy businessman who, despite having Carson's support, was railroaded by NBC and Kushnick. John Michael Higgins and Daniel Roebuck credibly recreate Letterman and Leno, respectively, but it is the razor-sharp performance of Oscar winner Kathy Bates as Helen Kushnick that keeps this movie bubbling. Bates commands the screen in one of her best, if not so well-known performances as the venomous Hollywood agent who eats television studio executives for breakfast. There is also a wonderful turn by impressionist Rich Little as Johnny Carson, but it is primarily a fascinating story and the powerhouse performance by Bates that make this one worth checking out.","Over the years I've watched this movie many times from seeing it on \"HBO\" and I now own a copy on DVD. I must say it's very memorable and entertaining in the meantime it's interesting and educational too. As any TV fan can relate to the time of the early 90's when the time came up to replace Johhny Carson the TV living legend of \"The Tonight Show\" who's it gonna be Jay or Dave? This original film from HBO \"The Late Shift\" stays true to form and depicts the real events very well showing the behind the scenes battle between networks heads of NBC and CBS and even ABC they were all fighting for the services of Jay and Dave. The acting makes it seem real as very little actual TV footage is shown with real life people as the actors portraying Leno and Letterman make it seem so real. I haven't read the Bill Carter book so I don't know if it stayed true to the pages, but I have highly enjoyed this film over the years. From the moment when it starts showing CBS entertainment heads watching Leno sub for Johhny and they decide they want to get in on the late night game. Yet when Carson announces his unexpected retirement NBC wants to stay loyal with Leno yet conflict arrives when Letterman wants a crack at the slot at 11:30 too. It was fun to watch the wacky meeting with Michael Ovitz(Treat Williams)who makes all networks want to consider Letterman for a show. It was interesting to see the scene of Johhny telling Letterman by phone in a direct way to walk from NBC and consider CBS. And by the way Rich Little was terrific as Johhny Carson his portrayal couldn't be matched. And plenty of tense moments were provided by showing the bickering and firing of Leno's talent manager Helen which NBC heads pressured him to do. Overall great film that showed what TV is really like and it proves that networks are power and money hungry while showing that's it's a cutthroat business. Clearly there's no business like show business. Great work from HBO very memorable and a watch anytime it showed the true story of the late night wars.","Although a made for cable film by HBO, it is an enjoyable movie and a fascinating look at the back-stabbing and double-dealing world of television.  Allowing the viewer to peek behind the scenes of the so-called late night talk show wars in the early 90s, as Jay Leno and David Letterman competed for the coveted position as host of the Tonight Show.  Kathy Bates gives a bravo performance as Leno's mercurial manager Helen Kushnick and one can feel empathy for what Leno/Letterman endured at the hands of tv executives.  It is just as timely now, considering the recent events involving the failed attempt by ABC to replace Nightline with Letterman.  No matter how many times I have seen this film, I still find it as much a  pleasure to watch as I did when it first aired.  If this should ever be released on DVD, I would certainly add it to my collection.","as a former TV editor, I can say this is as authentic as it gets. It even led to Letterman's producer (thought to be a source) resigning (eventually) in real life. Letterman was outraged (OK, so one goofy thing is it has him throwing softballs at a tire swing on his estate; total fabrication) but the main information is hilariously true, from the silly bidding war for Letterman once he decided to leave NBC to Leno's problems with an agent who was not ready for big time, but who he let run the show (almost to a disastrous exit) out of his famed loyalty. If any of you kids don't grasp the idea of why Letterman is jealous to this day, see this tape.","The Late Shift is a great book, I read the book several years ago, and I was transfixed at the cutthroat debauchery that went on when Johnny Carson retired and Jay Leno and Johnny Carson tried to grab his spot. When the movie came out, I snagged a VHS copy of the movie, and having reread the book recently, it's hard to say which I enjoy more, because they're quite equal in the amount of information conveyed. The two lead actors, John Michael Higgins, and Daniel Roebuck, two actors I never heard of before, and haven't heard of since, play Leno and Letterman convincingly, despite Letterman's dismissal of his portrayal as being poor. They play the parts quite well, despite a lot of people looking for an imitation of the two. I wasn't as interested in that. The story is what counts. And that brings me to Kathy Bates. Kathy Bates, playing Helen Kushnick, IS this movie. She plays this evil bitch of a character so menacingly you realize how on earth can this woman control herself, much less a national TV show. Yikes! There should be a sequel!!","I think this movie actually has a lot of nice things to say about a lot of people (Johnny Carson, Ted Koppel), and it shows that Letterman and Leno actually liked and respected each other a lot. Treat Williams as the half-Kung Fu Master, half-Godfather-like Mike Ovitz is terrific.","Alright, so maybe the impersonations of Jay Leno and David Letterman are not spot on, but you still get a sense of who these people are and how they operate behind the screen.  Bob Balaban and Treat Williams are excellant as Warren Littlefield and Micheal Ovitz.The movie doesn't go for joke and punchline but it is still funny.  Kathy Bates in particular is amazing as Leno's manager.Funny, amazing, interesting, very watchable, this is a good TV movie.","I read the book written by Bill Carter on which this movie is based many years ago. The book is certainly stronger than the movie. It provides more detail than a movie can possibly provide, the end result being that I thought the movie seemed a wee bit sketchy on a handful of items. All things considered, though, and given the limitations of the medium, the movie provides a wholly entertaining and informative account of the battle between Jay Leno and David Letterman in the early 90's to host \"The Tonight Show\" after the retirement of Johnny Carson.The highlight is clearly the performances. I can think of no more difficult performance for an actor than to play a character who is still alive and well-known and on TV on a regular basis. John Michael Higgins nailed the part of Letterman perfectly. Watching him really was like watching Letterman. Daniel Roebuck tried valiantly to be Jay Leno, but somehow didn't pull it off as effectively. His whole \"look\" seemed fake, and he just didn't seem natural in the role. In a less central role, Rich Little not surprisingly nailed the voice of Carson, although the look was a bit off. In the book, the most interesting of the central figures was probably Leno's agent, Helen Kushnick. In the movie, Kathy Bates was perfect in the role, although not quite as out of control as Carter's portrayal of the woman in writing.In the end, this is light and entertaining viewing. The subject matter isn't especially important in the overall scheme of things, but it's a fun behind the scenes look at a memorable time in the entertainment industry. 7/10","***SPOILERS*** This film depicts the brutal bloodbath caused by the retirement of Johnny Carson to determine who would succeed him. The impersonations of David Letterman and Jay Leno are performed in a satisfactory way by John Michael Higgins and Daniel Roebuck, though the performances weren't great. Reni Santoni is the best-performing of the \"execs\" (he plays John Agoglia of NBC), and Warren Littlefield (played by Bob Baliban) is a close second. I was shocked at the way in which Littlefield eagerly discussed dumping Johnny Carson. This was Johnny Carson! This scene evinces the cut-throat, what-have-you-done-for-me-lately world of television. Kathy Bates delivered the best performance of the film as Jay's agent, Helen Kushnick. Another commenter asserted that Leno was portrayed as a simpleton in the film. I respectfully disagree. The relationship with Kushnick bordered on something akin to domestic violence. She orders him around, and, when he rebels against her at the end, she tries to play the sympathy card (mentioning her dead husband and son); however, when Jay terminates their relationship, she turns violent again, screaming \"Don't you leave me, you two-faced bastard!\" before smashing a picture on the floor. Overall, the movie is hilarious, and I wish that it were shown more often.","\"The Late Shift\" tells the behind-the-scenes story of the battle for the coveted role of host of the Tonight Show after Johnny Carson's retirement. Depending on your view of the world, the film, a docu-drama, may leave you forever seeing Jay Leno as a petty, ambitious, and ruthless; and as having forced Carson's premature retirement. You may also come away with the conclusion that Jay, a hard-working professional entertainer, fought for, and won, the jewel of his profession that un-sympathetic NBC executives dangled before him at the expense of David Letterman, who had faithfully served them for years on their implicit promise of the highest prize they could give–the job of hosting the Tonight Show.As a result of the well-publicized (and over dramatized) war for the Tonight Show job, Jay no doubt gained many fans but lost many more. Surely millions of Americans (even with the recovery in ratings Jay enjoyed after the drop that followed his initial installation as host) continue to blame him for the loss of their nightly guest into the bosom of their homes. But to truly understand Jay's campaign for the hosting position you must view his fight after seeing him in the Jerry Seinfeld documentary \"Comedian.\" Viewing Jay's life, and the life of the stand-up comic, from the behind the curtain standpoint the documentary provides, will permanently absolve Jay of any perceived wrong-doing in connection with the Tonight Show.\"Comedian\" ostensibly follows Seinfeld's foray back into the world of the \"working\" stand-up after ending his record setting television series. Since everyone knows Seinfeld could have easily, and expected that he would, rest on his laurels from leading \"the best comedy in television history,\" its easy to think a film documenting his return to stand-up as an attempt at self-aggrandizement. The film shows that Seinfeld's return to stand up does not come from a desire to give a gift in return to a first love that gave him more than it ever could have promised.And the film itself is much more than an homage to his love. The film is a window into the craft itself and a sometimes brutal exposition of the people who love her. That love is no more evident in any of the films' participants–truly the legends of the art–than in Jay Leno. His love for his art exonerates Jay for any hurt or jealousy remaining from his ascension to the throne of comedy and raises him to a national treasure in American entertainment. Although Jay has announced his own retirement from Tonight Show host, I can only pray his departure is on his own terms and not accelerated by illness. Good luck, Jay.","While The Late Shift is in no way as good as the original book that describes in detail what happened to David Letterman, Jay Leno, Johnny Carson, Helen Kushnik and the rest of the late night cast of Characters, it is quite enjoyable, a good ride, and a fun time. Both Leno and Letterman are played well, if not a wee bit over-acted. It's worth renting.","The directing is brilliant, the casting is remarkable (though I would've loved to have seen a little more of Aaron Lustig (from Y & R fame), who played Paul Shaffer). I only have two minor quips about the film, as subtle as they are. One- Roebuck's Leno is excellent, but his stage presence (i.e. during what appears the taping of one of his late show episodes) is a tad underwhelming. Two- the distribution of the foul language. I am willing to tolerate foul language, so long as it is not used gratuitously, and to a degree, the film was gratuitous. The language seemed to be used as a tool to reduce the pathos of Bates' otherwise well-portrayed Kushnick by her frequent use of it, and served to make Roebuck's Leno a goody-goody by his lack of use of it (of course, if the characters really did behave this way, kudos to everybody). Nonetheless, the piece is an excellent one, as far as television and video are concerned. The film, I feel, had potential for the big screen, but would've required re-casting for the bit parts, and probably a different director, as well (the aesthetic feel is that of the Larry Sanders show, good for HBO, mediocre for cinematic purposes).","Good movie, great story, great characters, I enjoyed it immensely, enough to buy the DVD when it came out. The real life story it purports to tell is more fascinating and engrossing than anything the fictionalizers could ever come up with. My friend who is in the media business said they shouldn't show insider dealings like this, it gives the business a bad name. As if.There are a few problems with the DVD though: First, the sound volume is awfully low so you have to run up the TV volume to watch it. I notice that its also like that when HBO runs it so its in the original production copy. Second, for about the first five minutes the left side of the video is cut off, that is the picture is cut off about one inch short of the left side. After the five minutes it fills the screen properly, left to right. Sloppy technical production like that is very amateurish and I don't know why the director and producer let such sloppiness slide by.Still, even with the technical flaws, its an enjoyable story, one of HBO's best I think.","I don't even like watching those late night talk shows, but I found this one really interesting.  I imagine it's probably close to the truth---it \"feels\" like an honest account, if that means anything.  Kinda feel for the people somewhat when you watch it.  A nice movie for a Saturday night.","This is a clever and entertaining film about the backroom battling that went on to choose a successor to Johnny Carson on the Tonight Show. However, the movie's ultimate thesis, that David Letterman's superior comedic talents were overlooked because of his controversial nature, and the show diminished by the enthronement of an inferior Jay Leno in the leading comedy program on television is simply untrue, as anyone who has watched both Leno and Letterman perform can see for themselves. The hard and simple truth is exactly as one NBC exec stated in the film \"Jay Leno is the funniest man in America.\" And David Letterman is not. Once you realize this, then much of the machinations in the film become irrelevant. Ultimately, the whole film amounts to little more than sour grapes by Letterman fans, who just cannot accept that the better comic was chosen by people whose business it is to know these kind of things. The final proof is that despite Letterman's early lead, possibly because of the hype that emerged from the battle for Tonight Show succession, Leno's show has consistently proved to be the more popular, thus, in my mind at least, refuting Letterman's claims to be unfairly robbed of his rightful inheritance.","I can't tell whether this movie would be interesting to people who are wheelers and dealers, but it interested me precisely because I'm not. If I'd paid half the attention to ploying the system, squeezing the cow, as these characters do, who knows what dazzling heights I might have reached? The story is probably familiar to most viewers by now. When Johnny Carson announces his retirement from The Tonight Show, NBC has to choose between two replacements -- Jay Leno and David Letterman, who can both claim to be qualified. They choose Jay Leno, which annoys Letterman. Not that Leno and Letterman aren't friends, but their socioeconomic interests are in conflict. All sorts of wheelings and dealings go on, which end with Leno keeping The Tonight Show and Letterman moving to an opposite spot at CBS.Godzillions of dollars are involved of course, so it behooves everyone to act rationally. The problem faced by these characters -- not just the two stars but everyone else -- is defining \"rational.\" Reason ought to lead you to achieving a goal. But suppose you have several goals, equally important, and contradictory? Is \"success\" measured in dollars? In self-satisfaction? In security at the expense of self expression? How much is friendship and loyalty worth? These are hard decisions to make but, fortunately, for millionaires it's not lonely at the top. There's plenty of advice.The most reasonable person -- in the sense that he is least influenced by fear or sentiment -- is Michael Ovitz, played by Treat Williams. As someone says jokingly about him, talking to him is like talking to the Godfather. \"You have a problem? We can solve it.\" Ovitz went on, as I understand it, to head Walt Disney but has recently been involved in some sort of contretemps. I think they're kicking him out of Walt Disney and giving him two million godzillion dollars to ease the pain of his passage.The most interesting character, I thought, was Helen Kushnik, Kathy Bates. She was Jay Leno's totem person. And -- the book is more explicit about this -- she was evidently one of those people who, once in power, go completely berserk and believe that limits don't apply to them. It goes beyond pushiness. They become tyrants. I don't want to sound sexist but Kushnik's behavior takes a distinctly feminine form. The monster sacre hiding behind the stage props. Judy Garland's \"stage mother.\" They protect and advance their clients as if the clients were some rare marketable commodity. Kushnik self destructs, as everyone predicts, but I'd have liked to know more about her.But it's also fun watching the sparring that goes on between the players. Here is Jay Leno, host of The Tonight Show, sneaking around through a garage and eavesdropping through a crack in the doorway while a discussion takes place that will decide if Leno is kept on or fired.\"The Late Shift\" isn't about a subject that occupied much of my life space at the time this was going on, but it held my interest because it's one of those minor inexpensive kinds of projects that cable, especially HBO, does so well from time to time. If it's not quite up to the standard set by \"Barbarians at the Gates\" it's because it wasn't written by Larry Gelbart and it doesn't have James Garner's outrageous lead performance. \"The Late Shift\" sees some irony in the story but not much in the way of laughs, but that's okay too.It's a intensely thought-provoking movie too. Here is the thought it provoked. \"Where in the hell was Michael Ovitz when I needed him?\"","This movie is a surprisingly faithful adaptation of the book, so if there are any inaccuracies they trace to the book, not the movie. The only thing that I noticed was left out of the movie was some of the background that took place in the 80s and even 70s - the book opens by explaining that Carson wanted Letterman to follow him, and going into why Leno was so loyal to Kushnick. The film gives very abbreviated versions of this background two thirds of the way in, which I think would be confusing to viewers who hadn't read the book, making them wonder for most of the movie why people were behaving the way they were.Sequencing aside, the movie is a quite good job of adapting the book. I do wish the film had done a better job of explaining Carson and Letterman's friendship, and the rather vile emotional manipulations the book alleges Kushnick used on Leno. However, most of what was left out wouldn't really have worked in film formanyway. In so far as the book was an accurate story of the late night wars, the movie is too. If you're wondering what happened with Leno and Letterman, this movie will do in a pinch if you don't want to read the book.If you don't care about Leno and Letterman, this is a decent drama full of intrigue that probably would be worth your time if you catch in on TV, but it's not really worth renting or buying, the movie kind of assumes you already know and care about the Leno and Letterman saga. Only Leno's background is hinted at, and again, not until late in the movie, and I think the entire movie manages to not mention Letterman is from Indiana, had a long-time friendship with Carson, and it fails to really explain why Letterman was even worth fighting over in the first place, mostly he comes off as an egotistical jerk in this movie.This movie is mostly for fans of either of the late-night shows. It didn't have to be, with some better editing this could have been a fascinating story even if you'd never heard of El Chinno or the Gap-toothed one.","It's a behind-the-scenes movie about the battle between Jay Leno (Daniel Roebuck) and David Letterman (John Michael Higgins) for the Tonight Show on NBC. Jay's hard-charging agent Helen Kushnick (Kathy Bates) schemes to get him the show. They are approached by CBS. Then she gets him a secret deal with Warren Littlefield (Bob Balaban) and John Agoglia (Reni Santoni). When Johnny Carson surprises everybody by announcing his retirement, Leno is given the show. Letterman hires agent Michael Ovitz (Treat Williams). Kushnick steps on some toes as Tonight Show exec and starts making enemies.This is a solid TV movie from HBO. The minutia of each piece of information can be pulled apart by those involved. Kathy Bates is great and I'm sure Kushnick has plenty of bones to pick with this movie. Jay Leno doesn't come off well either as a naive puppy desperate for approval. Letterman comes off much better. This is overwrought but the material allows for it. It's a fun take on a fascinating story.","This could also be a twin movie of Howard Stern's \"Private Parts.\" This is a movie that excels because of the fantastic depth of the supporting cast and a strong performance from Kathy Bates. I've been hearing about this movie for literally 20 years and I'm glad when I finally got to see it.There are real lessons to learn from this movie about corporate politics. While media critics and I-95 corridor may prefer Dave Letterman's wise guy antics over Leno's more 'play it straight', style, Leno won because he was easier to work with, courted the affiliates, and wasn't afraid of country music as a music guest. I seriously wonder whether Conan watched this...","I remember this movie getting a lot of flak from reviewers when it was new. Letterman and Leno themselves had objections. Letterman called it (paraphrasing) the biggest waste of film he'd ever seen, and Leno objected to the simpleton portrayal of himself. But Letterman had John Michael Higgins as a guest on his show so it seems he didn't take anything too personally. A DVD re-release, with opinions and such from those involved, could be interesting, though I suspect the days when late night talkshow wars captivated the nation are gone and not returning soon.I preferred the Letterman impersonation to the Leno, but could never buy in to either. They never rose above caricature, and I never simply accepted them as actors. For comparison: Paul Sorvino as Kissinger in Oliver Stone's \"Nixon\" comes to mind as an impersonation which may have seemed laughable in the first few moments but which seemed at least plausible after the first moments of amusement wore off.The highlight of the show for me was Treat Williams as Michael Ovitz. Williams' speech to Letterman was not as great as but reminiscent of Alec Baldwin's entrance (and quick exit) as Blake in Glengerry Glen Ross.\nThey could have done more with Johnny's role in all this. I know he was mostly uninvolved in the events portrayed in this movie, and most audiences will be familiar with his reputation such that Johnny Carson needs no introduction. But more context about why Dave and Jay and all comedians revere Johnny would have given this flick the substance it lacks in being a gossip film.Guess I should read the book...Rich Little imitating Johnny Carson, unfortunately, came across as nothing more than Rich Little imitating Johnny Carson.I tell you what, after watching this movie, then watching either the Letterman or Leno show, all I want to do is crack open my Johnny Carson DVDs and see the real thing.","Interesting and short television movie describes some of the machinations surrounding Jay Leno's replacing Carson as host of the Tonight Show. Film is currently very topical given the public drama surrounding Conan O'Brien and Jay Leno.The film does a good job of sparking viewers' interest in the events and showing some of the concerns of the stakeholders, particularly of the NBC executives. The portrayal of Ovitz was particularly compelling and interesting, I thought.Still, many of the characters were only very briefly limned or touched upon, and some of the acting seemed perfunctory. Nevertheless, an interesting story.","Now, I'm a bit biased, since I'm a big fan of late night television.  I've been a loyal fan of Jay Leno for about 6 or 7 years, and think he's one of the funniest, most talented comedians out there.  And David Letterman is one hell of a comedian as well, though I only watch his show (unless Jay's a repeat) during commercials or when he has a better guest than Jay on the show.  Daniel Roebuck and John Michael Higgins are both fine actors and they very much resembled Jay and Dave, but did they disappear into the characters?  Nope.  Roebuck barely nails down Jay's voice and expression, mumbling at a high pitch, sounding like a castrati Marlon Brando.  Higgins nails down David's facial expressions (for example, his trademark squirm) but he doesn't nail down Dave's voice.  Those who aren't big fans of late night TV might be a lot less biased.  There's a couple comedians who can do dead-on impersonations of Jay.  Why couldn't they have selected one of them for the part?  And the same goes with Dave.  I'd rather they had Norm McDonald play the part.  Norm doesn't look a hell of a lot like Dave, but he did a great impersonation of him on SNL.  \"Hey...you got any gum?\"  That was so hilarious!However, I learned a lot about the late night wars which I had very little knowledge of at first.  I never watched \"The Tonight Show\" prior to when Jay Leno was host, so I didn't know about the struggle to finally replace Johnny Carson and the countless negotiations that finally convinced Dave to move to CBS.  I knew very little about what happened behind the scenes and found the film very enlightening.  And Kathy Bates gives a knockout performance as the foul-mouthed former executive producer of \"The Tonight Show.\"  She basically steals the film.  My score:  7 (out of 10)","First, I love the actors' portrayals of Leno and Letterman; they even LOOK authentic!  Daniel Roebuck is buried under (or ABOVE) a prominent latex chin, and John Michael Higgins was given that gap-toothed grin.  Second, the settings in which the events took place have a naturalistic look to them. The only nit-picking complaint I have is, please don't use a celebrity impressionist (SORRY, Rich Little!) to play Johnny Carson!  All I was seeing was deft mimicry; not a three-dimensional portrayal of a mercurial talk-show host.  Who would've been better?  If the producers wanted a BIG name, use Anthony Hopkins.  Well...Rich Little AND Anthony Hopkins have BOTH played President Richard \"Tricky Dick\" Nixon .... well, it was worth a shot."],"review-user":["erasmus9","Isaac5855","blanbrn","fx_gent","mikey_editor","Spuzzlightyear","AlabamaWorley1971","vikingsrule78","sddavis63","wolf1282","jerrodlwilliams","Photog-4","ProfDave","radzewicz","bek-12","michael@piston.net","rmax304823","knucklebreather","SnoopyStyle","jeffreygwilliams","sorabji","rbnn","mattymatt4ever","Bellybub"],"review-date":["20 July 2000","16 May 2007","31 May 2008","11 August 2002","18 December 2004","20 June 2005","11 March 2000","3 October 2002","18 October 2009","28 October 2006","4 May 2009","16 August 1998","26 February 1999","29 May 2006","22 April 2000","15 October 2005","10 January 2005","5 October 2009","7 February 2016","17 January 2015","21 November 2003","17 January 2010","5 December 2002","25 May 1999"],"review-rating":["10","7","9","10","10","9","8","8","7","8","9","8","8","7","6","6","7","10","7","4","7"],"review-title":[" Excellent account of the late night wars.\n"," A Fascinating Look at one of Hollywood's most interesting Power Struggles\n"," Well done and good original movie dramatization that's funny and tense while taking a behind the scenes look at the late night TV wars of the early 90's.\n"," Enjoyable Behind-the-Scenes Look at Television\n"," A great look behind the scenes\n"," Two men, one show, two networks\n"," I don't know how true it is, but it's mighty entertaining!\n"," A really good movie.\n"," Solid Account Of The Leno-Letterman Battle\n"," And I thought comedy was harmless...\n"," Good background on the real Jay Leno\n"," Good movie for an overview of what happened\n"," One of the best films I've ever seen.\n"," Great story, mediocre production\n"," Really, really interesting... makes you wonder if it's true\n"," Entertaining, but wrong\n"," Oh, it's not lonely at the top.\n"," Decent documentary, below average movie\n"," solid TV movie about a fascinating TV story\n"," Fascinating movie for Media Junkies\n"," A creditable gossip film\n"," Interesting\n"," An enlightening, entertaining film\n"," The Men Who Would Be King of Late Night\n"]}