{"review-url":["http://www.imdb.com/title/tt0113981/reviews"],"review-text":["Night Hunter starts in '1968' as a young Jack Cutter (Chris Aguilar) is unexpectedly handed the family tradition of becoming a Vampire hunter when a fellow Vampire hunter Sid O'Mack (Sid Haim) betrays his family & hands them over to the Vampire's, to aid Jack on his quest he is given a book that contains the name of every Vampire alive, or dead whichever way you look at it... Jump to 'June 1995' & Los Angeles where the now adult Cutter (Don 'The Dragon' Wilson, also credited as co-producer) has but four names left in the book including, Argento (Vince Murdocco) & Carmella (Sophia Crawford) together they are the last of the American Vampires. As they all dine in a restaurant Cutter crashes the party & kills them, job done right? Wrong as King of the Vampires Bruno Fischer (Nicholas Guest) calls in the last four remaining Vampires from around the world, the French Tournier (Maria Ford), the Asian Hashimoto (Ron Yuan), Ulmer (David 'Shark Fralick) & Sangster (Vincent Klyn) to track Cutter down & kill him. Meanwhile Detective's Hooper (Marcus Aurelius) & Browning (Cash Casey) don't have a clue & a nosey reporter named Raimy Baker (Melanie Smith) becomes involved in the battle between Cutter & the Vampire's on which the very fate of Earth rests!Directed by Rick Jacobson I thought Night Hunter was quite a fun way to pass 85 odd minutes. The script by William C. Martell mixes martial arts & horror with a fair degree of success, it moves along at a nice pace & is at least never boring & thankfully doesn't seem to take itself too seriously. The character names that reference other horror film director's/actors are a little tacky though. Some may be surprised at how closely Night Hunter resembles Blade (1998) yet was made a couple of years prior, the lone moody long coat wearing Vampire hunter who happens to be an expert in martial arts, the scene set in a nightclub & the innocent woman drawn into the world of Vampire's. Night Hunter doesn't really stick to traditional Vampire film law, for instance sunlight only irritates their eye's, they can only breed on a solar eclipse (why?), stakes through the heart & garlic is no good as the way to kill a Vampire in Night Hunter is to break it's neck. I could have done with a bit more horror & a bit more blood as it leans more towards the martial arts side of things. The dialogue is suitably cheesy & the character's are just about likable enough in a silly way.Director Jacobson does his best to ruin the film, the actions scenes are OK but lack a certain something & for some bizarre reason whenever an action sequence takes place he shakes his camera constantly, it's like the camera is placed upon a washing machine full cycle! Hey Rick, mate, it's not clever or stylish it's irritating & annoying. The gore is disappointing with a few gory gunshot wounds & a few splashes of blood, breaking Vampire's necks don't involve much blood unfortunately.With a budget that probably didn't amount to much Night Hunter is competently made throughout. The acting was bad most of the time & what's with 'The Dragon' thing in Don 'The Dragon' Wilson's name? Has he legally changed his name? Does he sign cheques Don 'The Dragon' Wilson?! Does he get mail addressed to him in that name? I think I might do something like this, from now on I want to be known as Paul 'The Killer Klown' Andrews...Night Hunter is one of those crap films that transcends it's limitations & awfulness to become pure golden entertainment. If you like your films fun then Night Hunter might be for you, if your looking for big-budget thrills in a similar vein (! Vampire's, veins & blood get it?) then Blade & it's sequels would probably be a better choice. What the hell, I liked it so sue me.","Hard Justice is an excellent action movie! The whole movie is really nothing but shooting and fighting but it does have a very good vampire plot! For the people who say they don't make shoot em ups and fighting films like they use to. Well, this one is really hard-core! Don 'The Dragon' Wilson is excellent and his character is really cool in the movie. Nicholas Guest was very good as well and he arguably steals the show! He really performs as a fantastic villain! Melanie Smith was also good. I think that this very fine looking actress is very underrated. Michael Cavanaugh was good. It was really cool to see Vince Murdocco in this film! As for the action, it is truly awesome with all of the gun fights and the super cool fighting scenes. The fighting in this picture is really some of the greatest I have seen! There is so much that happens in the 86 minute run time. For the action fans you will be blown away by all of the fire power and superb fighting that this film has to offer! Night Hunter is a movie that isn't easy to locate and if you are at a video store and you see it for sale buy it up because this movie is big keeper and plus the box is cool! There is a ton of action that has to be seen to be believed! Look and see if you can find some good deals on Ebay, Half.com, Amazon.com's Z-Shops and Market Place Sellers! In My opinion Night Hunter is one of the greatest fighting films that I have ever watched and the characters are so neat. If you like Don 'The Dragon' Wilson and want to see Nicholas Guest in a great performance then I strongly recommend that any action movie fan who loves shoot em ups, fighting movies, and vampire films and has been disappointed by other movies that has the look of a true non stop action flick but fails to deliver it to get and buy Night Hunter today!","Jack Cutter (The Dragon) comes from a long line of vampire hunters. When he was just a kid, vampires attacked his family farmhouse. The Cutter family has a sacred book all about vampires and how to combat them. His family tells him \"don't trust anyone\", and he is sent off to be on his own. In 1995, now an adult, Cutter has tracked and killed every vampire in existence - except an elite underground club of nine multiracial vamps, led by the sinister Brit Bruno (Guest). Cutter teams up with Raimy Baker (Smith), a reporter for the \"National Inquisitor\". But can he get over his deep-seated trust issues? Can he avoid the cops and exterminate the last vampires on earth before the solar eclipse when they will gain maximum power? Will Jack live up to his nickname of \"The Hunter\"? Night Hunter is a Ring of Fire (1991) reunion of sorts, as Don The Dragon, Maria Ford, Ron Yuan and Vince Murdocco all return in front of the camera, and Rick Jacobson and Art Camacho behind it. However, there seems to have been a conscious effort to do something totally different and not repeat themselves. They succeeded in that, and it is a nice novelty to see Don in a different kind of role: a dark, horror-tinged storyline instead of a sunny, romantic one like Ring of Fire. Two sides of a coin I guess. Maria Ford is always welcome, and Melanie Smith will be instantly recognized by Seinfeld fans as Jerry's girlfriend in a story arc on that show.Don doesn't say anything until 20 minutes into the movie, and his character and dress are very clearly influenced by The Crow (1994) and Brandon Lee. It's also one of the better Don performances we've seen, as his wooden delivery is hidden well by a character that doesn't talk much anyway. As this is a Corman production, and he is known for \"borrowing\" ideas popular at that time, the film also borrows the flamenco music of Desperado (1995) and some ideas from From Dusk Til Dawn (1996). Interestingly it predates Blade (1998) in the fact that it has Vampire POV and Ford's character is similar to Traci Lords'.As far as the fights are concerned, it seems to be a mix of gunplay and martial arts, and highlighted by Don's punishing finishing moves and death blows. A positive for Night Hunter is that it seems to have created its own vampire rules and mythos. For example, vampires may come out during the day, especially if they wear special sunglasses. Vampires shoot guns, and there is a gunshot-cure serum. Notably, you can only kill them by breaking their neck. So that sets the stage for some violent moves. But there is a major downside...You've heard of \"shaky cam\" but during the fight scenes, they seem to have initiated something we called \"earthquake cam\". The screen violently shakes, so much so you begin to feel ill. The attempt to be stylish is somewhat appreciated, but you can't sicken your audience by sticking the camera in one of those paint-shaking machines at the hardware store and not expect a reaction. If this was done to cover up the moves of the actors, there's no need for that as Don's moves are excellent. They really should have reined in the earthquake cam. And sometimes they added a strobe light on top of it! For a Don The Dragon movie with more of a professional sheen, and featuring Don in an unorthodox role, by all means try Night Hunter...but beware the earthquake cam.For more insanity, please visit: comeuppancereviews.com","Yes, indeed we have a winner- a winner in best dumb-action-movie!The only reason I chose to vote a 10 for this movie is because it's so incredibly bad-made that it actually becomes funny.\"Night Hunter\" is basically about Jack Cutter, a Vampire hunter (Vampire hunters have been in his generation for centuries, apparently), and his mission, being that he has to kill the last remaining Vampires.This movie contains one of the cheesiest scenes I have ever seen in my life. Not to mention the really bad gun-shooting scenes. When people are shot in this movie, blood splatters- thick as ketchup all over the place, this makes the movie seem so cheap and lame that you just lose interest. A constant shaking of the camera is what annoys me the most during the fight-scenes. This is, I suppose, done to create an \"action-effect\", though in my opinion it gives no effect whatsoever. Its completely ridiculous! All stunt-scenes are done extremely badly. E.g a scene where the dead Vampire-leader gets thrown off a roof. When the corpse hits the ground, it bounces like a wobbly rubber-doll. A scene where Jack sniffs the ground, getting a vision was so lame it got me laughing hysterically.Lame music, cheesy scenes, bad acting and plain dumb filming techniques are obviously the functions that make this movie such a malfunction. To state that this is a good movie would be the same as stating that nuclear bombs are good for humans. Clearly those of you who say that this is one of the best action-movies, haven't seen many in your life.This is basically a B-class vampire-action-movie that deserves 0/10 but which I'll give 10/10, just for its ability (being the lousiest action-movie I have ever seen)of making me laugh and because I just can't live without it.","This is a classic mid-90's B-action-flick, it's so bad I thought at first it was made in 1985 because of the poor picture quality but I was surprised indeed, it's from 1995.The movie starts out with a underdeveloped story of vampires and they kill some kid's father. The kid has actually some sort of curse on him, which is never explained any further how he eventually got it.20 years later or so, he only needs to kill a dozen remaining vampires but unfortunately the police tries to capture him because they think he's a killer - no wonder when you're running around with a sawn-off shotgun like an idiot.The hero, whose name is Jack Cutter, usually returns to his hideout which looks incredibly similar to the Highlander's one from the television series with the same elevator.Cheesy scenes follow and follow, for example when Cutter sees a homeless person and gives him a little bag of raw meat out of his jacket. What the heck? It gets even funnier when you see fight scenes. The director obviously wanted to give them an heavy action feel so he hired a parkinson patient as a camera man. The result is that the sight shakes so immensely that it would make an epileptic burst out foam even through his nose.Cutter also searches some vampires in the club, with his drawn shotgun, but the people dancing there didn't seem to care very much, oddly. And another shotgun obscurity is when he shot at an vampire, the camera angle switched back to the vampire for a short moment and then one second later you see him dual-wielding two pistols at him. Where did the shotgun go in all of sudden? There are even more of such scenes but are way too numerous to mention. The ending is really weird, in fact it does not even feel like an ending, it seemed that the movie would have another 2 or 3 minutes.With a almost non-existing plot, bad actors, cheesy fight scenes, a main character who has only 15 lines in the whole movie, it's not too surprising that this movie can be considered garbage in every aspect, even fans who voted this movie a 10 out of 10 can't deny this. Only the unintentional humor saves it, though.","As far as video fodder goes, this movie is okay, with its mix of modern-days-vampires action and fights ; in a way, it can be viewed as a forerunner to Wesley Snipes' \"Blade\". In fact, with his long hair, black clothes and somber look (well, as far as a non-actor can convey), Don Wilson, looks very much loke Brandon Lee in \"The Crow\" ! From Crow to Dragon, there's only one","....and by different, I mean that he plays what you could call an older male Buffy in this one! (Or maybe you could say a white Blade, but he came later). \"Night Hunter\" scores novelty points for combining vampires with martial arts: of course traditional vampire elimination methods simply won't do, according to this mythology the only way to conclusively kill one of them is to break his (or her) neck! There are two main problems with this film: a) it is quite slow-moving, b) the camera-work employs what could be described as an \"earthquake effect\" during some of the fight scenes - the restaurant one in particular almost made me nauseous! But the fights themselves are tightly choreographed in a mostly grounded style by the experienced Art Kamacho, and Wilson's fight with Ron Yuan is good by any standards. Glad to see Maria Ford and Sophia Crawford as sexy, high-kicking bisexual vampires, but they are both underused - they never even share the screen together. **1/2 out of 4.","Pun intended. This low budget action/horror vehicle for Don Wilson's ability to kick things is the stuff direct-to-video fare is made of.The plot: Wilson is a humorless vampire hunter who comes under fire from local law enforcement after he is forced to slaughter creatures of the night in view of the public. Police chase him, vampires chase him, he responds by kicking...a lot.There is a little more to the story, but it is so inconsequential that I honestly can't remember it; I think people actually spoke in the movie, but that's up to debate. The plot is nothing more than a set-up for Wilson to kill as many vampires as possible in the running time, usually by kicking them.The technical specs are, in a word, anemic. Little color treating, amateurish use of lighting, simplistic use of camera and angle. Blood and gore is noticeably limited, odd for this type of film. The most hurtful of the filming foul-ups is the jarring shift to super-shaky cam during each and every fight scene. If the camera begins to bounce around like a reese monkey on speed, then you know Don is about to start kicking everything in sight.All in all, this is the kind of bad movie that can be made good with a few friends and a lot of cynical humor. Otherwise, do not watch, unless you really like to watch things get kicked.3/10","More exciting than the Wesley Snipes film, and with better characters, too. The last vampire hunter must save Los Angeles from a coven of vampires out to conquer the city, aided by a tabloid journalist. Lost of fun... and the names of the characters are great!","Night Hunter is a vampire movie that is set in modern times. The film comes up with some innovative ideas about vampirism that are at odds with the traditional vampire movies. The traditional way of killing a vampire is abandoned as well as how, or I should say when, are new vampires made. I like the old traditional ways but for one movie it's alright. The most bothersome things in this movie are the fight scenes and there are quite a few. Actually the fight scenes are the movie. Anyway, during the filming of the fight scenes, they shake, wobble and spin the camera to make it look more hectic and presumably to give it more action. It was a bad idea. It failed and they should have realized it and tried something else. All it does is ruin the scene. Since there are so many fight scenes, this annoyance is quite frequent. There are numerous mistakes, and unanswered questions throughout the film. Not enough time was spent on the details. This movie is watchable but only if you have nothing better to watch and you don't expect too much. There are much better choices out there.","Every single fight scene (and there was a ton of them - this is a Don Wilson film) was ruined by shaking the camera.  What's the point?  Not only that, but most fight scenes included flickering the light intensity.  And to insure complete dizziness a few scenes put the camera on a carousel to spin the action in a circle.  It's crude, unpleasant and kills the film.Otherwise this would have been a decent non traditional, vampire, time wasting film for people who may like hand to hand combat.","Night hunter is a sold B style action movie. Get a life and grow up people. Don \"the Dragon\" Wilson is a kick boxer, (hall of fame) and not an actor. If your looking for an Oscar, it's not here brother. Looking for kick ass action movie with lower then low budget, this is it.The plot line may have been a little thin, but what B movie isn't. I understand everybody is a critic and how one man's junk is another man's treasure. Get real people, judging every movie like it is an Oscar contender, just silly. Awesome fight scenes, mixed with a new twist on vampire moves. See it if your a fan, rent something else if your a hater.","NIGHT HUNTER is a godawful foray into the action horror genre from martial arts specialist Don \"The Dragon\" Wilson. To say that it's a dud is an understatement; this is a film with absolutely terrible action choreography and direction, the nadir of which is the decision to shoot the fight scenes with what can only be described as an \"earthquake cam\", constantly trembling which makes the scenes unwatchable. Thankfully director Rick Jacobson has improved in recent years with his work on various episodes of the SPARTACUS TV series.The plot is very light and features Wilson (who's made up as a goth, much like THE CROW) going after a vampire gang who were responsible for the death of his family. A seemingly innocent woman gets involved in the mess, and there's a lot of killing, although few special effects. However, this truly is one of the poorest-directed of all the B-movies I've sat through, and anybody who claims to enjoy this stuff must be a real glutton for punishment.","In a change of pace, Roger Corman just distributed \"Night Hunter\", and didn't have anything to do with its making. That may explain why the production values of this Don Wilson movie a little better than usual, with some well-chosen locations that don't make this effort look as cheap as usual. Despite this, I knew I would still be in for a rough time, since the movie was made by schlock producer Ashok Amritraj. The script is pretty bad, with plot points that are never explained (like the healing elixir) or don't make up their mind (the movie at one point says vampires can be killed by breaking their necks... then later says they can be killed by breaking their backs!) Most people who watch this movie won't care about the script, and will just be interested in seeing the action. But be warned, the action isn't very good. The action is extremely tightly filmed, with rapid editing and unspectacular choreography. With most of his movies being as badly made as this, I think I know why Wilson retired from making movies several years ago.","I always rent a film with the desire to like it. However, this film started with two strikes against it. The first strike is that its lead is Don \"The Dragon\" Wilson, an inept actor by anyone's standards but a solid martial artist. I'm not a martial arts fan so I'm not big on Mr. Wilson. Second, its a vampire flick and you can count all the decent vampire films in history on one hand--and you won't employ all your fingers. So, you might be wondering, why I rented this. Well, I'm a video completist and will watch anything that Melanie Smith appears in. So there you have it.The film focuses on Don who plays Jack Cutter, the son of vampire hunters who were killed by head vampire Nicholas Guest and his minions when Don was just a boy. He grows up determined to rid the earth of vampires. When the police chase him (he has the ignorant tendency to run around town with a shotgun at any hour, day or night) he is hit by a vehicle driven by Melanie Smith. Melanie's intro isn't a casual hello for she, in Mina Harker like fashion, is the reincarnation of a lost love from Guest's past. So Don must save the world from bloodsuckers and the girl from the head fang-face.Don does battle with far more eyeliner than Melanie Smith wears... I guess vampire killers need to look dark-eyed. Also, filmgoers that can't stand movies that have vampires walking around in broad daylight will hate this film. They can combat the sun with shades.STORY: $$ (Too clichéd. The reincarnation subplot wasn't needed. This film borrows too heavily from other sources to flesh out its weak script, such as the Bram Stoker borrowing. Also, when Melanie gets shot while driving her car, she clearly gets it in the left tit, which made for a tricky Kennedy-esque shot from the officer who accidentally drilled her. Yet when Don treats her, her wound is in the right shoulder. However, jumping wounds aside, the head vampire is quite progressive and should be applauded for adhering to the call for diversity. His four vampire followers are a woman, an Asian, a black guy and a white guy. Way to go!)ACTING: $ (Although this is B-Rate fare there are many B-Rate films that boast solid acting. When your lead is the wooden Don \"The Dragon\" Wilson, you've ascribed, before filming, to low-grade acting. We also have the terrible erotic-thriller actress Maria Ford as the female vampire and Nicholas Guest is quite less-than-menacing as the lead vampire. Melanie Smith does a fine job with what little she has to work with and James Lew, who, perhaps, should have been the lead, gives a fine cameo performance as Don's dad).NUDITY: None","This is one of those films which (like most straight to video/DVD fodder!) sadly, unfortunately DOES NOT live up to its poster! I remember years ago in the late 1990s, seeing a VHS (yes that long ago!) copy of it in my local video rental store, picking it up, reading the cover and thinking (as other reviewers have already mentioned) that in this film Don Wilson had a similar look to that of Brandon Lee in The Crow. And that it sounded like quite a fun film and also a bit of a change for Don Wilson, I believe it's the only slightly Horror themed film he has appeared in. However I didn't bother renting it at the time (1998/99) and it wasn't until many years later (2013) that I actually saw the film when someone kindly uploaded it for free on Youtube (In fact most crappy straight to DVD/video films should be uploaded on Youtube, because they certainly aren't worth paying to see!). And when I eventually did see it I thought to myself \"That was crap and it didn't live up to its poster\" and furthermore \"I'm glad I didn't pay to see that all those years ago in the video rental shop\". Like most low budget, straight to DVD films, the film is hampered by budget limitations, poor acting and a lame script. And as everyone else has mentioned, I really do not understand that earthquake camera effect?! William C Martell, the man responsible for the poor script usually blames the failure of films he wrote on the cast and crew involved and never seems to take his fair share of the blame! He often claim that the cast and crew changed almost every word he wrote! Martell said that Don Wilson did not actually want to do a horror/vampire themed film and when he eventually agreed to it, he wanted to control every damn part of the film? Well that may be true but from the looks of things Martell probably wrote the script in a couple of weeks, if that? He really needed to spend more time on it and made sure he sold it to a better production company as well! Don Wilson claims that ALL of the films that he \"starred\" in \"made money\" by that I assume he means that they broke even? But I find that hard to believe, because more expensive Wilson films such as the Cybertracker films had a few million spent on them (from the look of them) and how does a film that did not get a cinema release make a few million to break even? They couldn't have made that much on video, because it's the films that were previously at the cinema that make the most on video, not a film that's been released straight to DVD/video and \"stars\" a cast of nobodies.","Don Wilson stars as Jack Cutter (Ooh real tough name!)a vampire slayer who goes up against a vampire army, you see the story is a little different because vampires can't be killed with silver, crosses or sunlight but rather through snapping their necks (How convenient as it cuts down on the budget) and it's here Cutter runs into a reporter (Melanie Smith of Trancers III fame) Night Hunter's action sequences shake for no reason during the fight sequences and although it's meant to emphasize the mood, it just makes the movie more jarring. What is worse is that these fight sequences are botched beyond belief as Wilson's martial artistry is disguised by disjointed editing. Of course the most interest comes from the fact that indeed this predates Blade, however the problem is that this was done on a small budget and that it had Don Wilson in it. It's from Roger Corman and basically this turkey is a movie most people would pay NOT to see. I unfortunately am a bottom feeder and I cater to the section of the store looking for gems, in this line of work you always run into turds. With Night Hunter, I just may have the world's stinkiest turd.1/2* out of 4-(Awful)","Attention, possible spoilersThis film is so lousy that it actually becomes funny.  The director has put in all the clichés that have ever plagued B-series movies.  The stupid bimbo (nice rack) getting caught again and again by the bad guys, chief villain smirky and revealing his plots before they happen so they can be ruined and who, of course, bullied/killed the hero's father in an unclear past, a side-kick in the person of a policeman - small, bald and whose only preparation for the last battle (another cliché) is returning his baseball-cap rim-backwards etc.  The film's end really tops it.  After the chief villain dies when the hero Paralised Stoneface Jack or whatever throws him from the roof of a building ten stories high, they walk out of the building.  Which, from the exteriors, looks three stories high only and very much like your regular city hall. \nWhen they exit the building, the side-kick can't walk, being that his right leg appears to be wounded.  How, nobody can tell: ten minutes earlier he fell down shot in his shoulder and his feet were fine.  There is no further explanation for the inquisitive mind of the viewer who would be curious to know such trivial things as \"Where is the villain's body which should lay near the building?\" and \"Why is there no police or even curious folks gathered round the said body?\".  I could go on forever with the list.  Why does another one of the bad guys claim to have invented martial arts when he gets his ass kicked in no time? Why do bad guys in general make silly movements when attacking?  Why does the hero look so faggy?  Is there anyone really thinking \"yes, these characters and this plot makes this a film to remember\"?  And the actors suck.  Our hero and saviour of the day wears the same expression on his face.  The whole film.  That disgusted-trying to be cocky smirk must be some copyrighted feat of him.Also, thinking that until now 12% of the people having rated this film gave it a 10 makes me full of fear inside.  They might have been serious and then we're doomed.","I usually enjoy a good \"Slay the vampire\" movie, but this was not one of them. Don the \"Dragon\" Wilson brings his dark brooding image to the sceen, but the writers forgot to bring an original idea to the script. Also someone had the idea to shake the camera during each fight to give the scene a earthquake effect. I fell asleep three times during the first half hour of the film. It would have been better if I had just kept on sleeping."],"review-user":["poolandrews","Movie Nuttball","tarbosh22000","dominat","adrianAKArosemarys_baby","Phroggy","gridoon2018","Ky-D","cine_critter","ChuckStraub","jimadamgolfer","kbluedragon","Leofwine_draca","Wizard-8","BloodTheTelepathicDog","JulianPeacock","fmarkland32","Andreman","mattmurdock1"],"review-date":["3 January 2006","31 December 2004","11 October 2010","17 February 2005","13 February 2005","14 March 1999","21 September 2009","9 May 2005","29 October 2001","8 December 2004","23 February 2003","5 January 2008","12 March 2016","8 March 2011","11 August 2011","9 January 2015","7 November 2006","19 August 2004","19 November 2002"],"review-rating":["7","10","5","10","6","6","3","10","6","7","2","3","1","3"],"review-title":[" \"We must feed so that we may breed.\" Quite good fun in a dumb sort of way.\n"," One of the most incredible fighting films ever!\n"," A Different Don\n"," We have a winner!\n"," B-Movie cheesiness at its best, very best!\n"," From Crow to Dragon\n"," And now for something a little different from The Dragon....\n"," Hunting vampires kinda sucks.\n"," Better than Blade!\n"," Vampirism at odds with traditional vampire movies.\n"," Whole Lot of Shaking Going On\n"," Night Hunter for an Oscar?\n"," Vampiric dud\n"," Wilson's talents are wasted once again\n"," Vampire Hunters Need Eyeliner... Not Stakes and Holy Water\n"," This Film DOES NOT live up to its poster!\n"," Play Duck Hunt instead...\n"," The Night Hunter of Vampires!!! of the NIGHT!!! (spoilers)\n"," A dull Blade\n"]}