{"review-url":["http://www.imdb.com/title/tt0141459/reviews"],"review-text":["PSYCHO: THE SNUFF REELS is another sick, super-extreme Japanese gore film. This review will all be a spoiler - there is no story to the film. Also, there was no English audio or subtitles, but I don't think I missed much because of that... Two people are brought in to make a porn video. They do their thing for a while (of course, all the hardcore action is pixelated...) and then they take a break. When they come back, they tie up the girl and have some BDSM type of play, but the chick isn't really digging having dildos shoved in her ass. When they try to give her an enema, she flatly refuses. They take another break, and when she isn't looking, she's hit in the head with a baseball bat. When she wakes up, she's tied to the bed. Someone cuts her foot off and then her arm. They cut her tongue up with some sort of shears then cut a hole in her stomach and play with her intestines. The male porn actor then f!cks her in her gut wound. Then they smash her in the face with a meat cleaver. When that's done, one of the film crew hits the guy over the head and knocks him unconscious also. They cut his nuts off, and that's pretty much it.This film won't really appeal to any normal person as entertainment. It is definitely sick and disgusting, and is the whole reason I sought this film out, so on that level I was not disappointed. The fact that there is no story at all makes it less enjoyable. I know it's supposed to come off as a snuff film, but it's obviously not real. The tongue scene is obviously fake as are the other gore scenes, but the special effects are decent and it is still VERY rough. Only recommended to fans of AUGUST UNDERGROUND or perhaps FLOWER OF FLESH AND BLOOD or DEVIL'S EXPERIMENT from the GUINEA PIG series. 6/10","If you were enjoyed by watching \"Guinea Pig\" - then you'll like this movie to! \"Psycho: The Snuff Reels\" is a nice pseudo snuff movie with lots of sex elements. Actually the effects are not so realistic like in \"Guinea Pig\", but its still pretty gory.\"Psycho: The Snuff Reels\" contains 70 minutes of sex, fetish and then torture scenes. First 20 minutes is like a normal porno movie. After that you'll see fetish sex scenes. And last one is a torture scene. The guys torture and rape girl - they cut off her legs, hand, tongue... In the end guy rapes girl in her stomach (!) and after that other guy beat him and cut off his balls. Sounds pretty sick, isn't it?:) Like I said - it's pseudo snuff movie. \"Psycho: The Snuff Reels\" is pretty rare Japanese movie and as I know it's really hard to find it. But if you are crazy about that sort of films I believe that you can find it!","\"Tumbling Doll of Flesh\" by Tamakichi Anaru is a Japanese shocker about three thugs who sexually abuse,torture and dismember a young woman whilst filming their horrible actions.Typically twisted Japanese porno sickie that offers plenty of sadistic sexual violence and grisly gore.There is no plot to speak of,just plenty of hard core sex scenes(optically censored again)and lots of blood.The special effects are quite impressive-the dismemberment of Japanese porn actress is shown in unflinching detail.The tongue cutting scene really made me squirm.Her arm is also chopped off and her stomach is graphically sliced open and finally one of the sickos is having sex with her intestines.\"Psycho:The Snuff Reels\" actually reminds me \"Guinea Pig:Flowers of Flesh and Blood\",but it's not as memorable.So if you're a fan of ultra-depraved Japanese sickies like \"All Women Are Whores\" or \"Raping My Virgin Slave\" give this one a look.8 out of 10.","Tumbling Doll of Flesh (aka Niku daruma and Psycho: The Snuff Reels) This was on my want list for quite a while, and then I finally scored a copy on Ebay a while back. It's never been on DVD, and what I got from Ebay was a very good quality DVD-R, which I'm quite satisfied with. The movie is I believe the most extreme example of torture porn, with an emphasis on porn. A woman responds to an ad for a porn movie and goes with the producer to a place where it is filmed. The porn is definitely real, with the annoying Japanese pixelation to try and hide the hardcore shots, without much success most of the time. After the porn movie is shot and the actress is ready to leave, she gets clubbed over the head with a baseball bat, and taken back to the room and savagely dismembered in slow shots, and in one of the most disgusting scenes, the male porn guy screws her in an open wound in her chest. This is after both legs have been severed, her arm, and a few other niceities. This movie outdoes the Guinea Pig series by a long shot, in fact, they are not even close to the realism, although cheap gore effects, shown in this movie. This is indeed one of the best fake snuff films I have ever seen, if not the best. Now I must warn you, that if you are not into this stuff, you should stay far far away. This movie is very strong, and with the real sex, it is in a very sick way, erotic to an extent. And I mean, in a very sick way. But wherever you come down on this subject material, this movie brings the goods home, and I would definitely recommend you seek it out. After reading about the movie, I was expecting something very strong, but it exceeded that by a bunch.","just watched this \"film\" and it actually made me want to write my first comment on IMDb.com, even though i've been a user for more than 9 years. the reason that i watched this, is because i like splatter films and sometimes i like to test my limits and see what actually still shocks me. first of all, the gore in this film didn't shock me, not even the idea that someone came up with this and made it into a film - what really shocked me, is that there seems to be a market for this kind of crap. don't get me wrong - i'm all against censorship, but this film seems to me like it was made for some kind of fetish crowd that seems to get off on this type of sh*t.it didn't give you that same kind of disgust and guilt that one felt after watching films like \"august underground\". that film is terrible to watch, but at least you get the feeling that the filmmakers want to show you how disgusting violence is. in the case of \"niku daruma\", it seems like it was made strictly to arouse people. i prefer films that shock, because they are well done and thought through, like Gaspar Noe's films, or Takashi Miike's, or Funny Games or Man Bites Dog - those films will stick with you for a while. this film i will have forgotten by tomorrow, and the only thing that will stick with me, is the thought, that somewhere out there, there are people getting aroused by watching this sh*t. if you read this, please check yourself into the next hospital or shoot yourself - this of course does not apply to gore hounds, who just love splatter. you're cool! peace","First of all , you should watch this only if you don't mind the lack of subtitles , pornography , kinky sex and utter , horrifying and truly shocking depravity . I mentioned kinky sex , but to call sex in the second half of the movie \" kinky \" would be a great understatement . It's more like a punch in the face if you aren't prepared for this sort of sickness . That being said , I can go back to reviewing this morbid piece of pseudo - snuff genre brought to us by our fellow Japanese .The plot seems to be fairly basic , almost nonexistent : a girl is hired to perform in amateur porn movie . Don't expect much in first 30 - 40 minutes . There is some dialog - if you don't speak Japanese it's not going to mean much to you - that seems to be an occasional chatting between the girl and the crew & performer , then there is some porn ( straight sex ) , and after the scene is finished the performers and the crew take a break . And then ... it starts to happen .It seems that the girl is talked into performing one more scene - this time tied with the rope . The abuse begins : whipping , slapping , hot wax ... In the end , girl breaks down and cries . They untie her .Then we see performers and crew sitting at the table as if nothing had happened - except for the girl . She is visibly shaken and looks like she wants to leave . She walks to the door , sits on the floor to put her shoes on ... and that's when hell breaks loose .She is hit in the head with the baseball bat , her wound is treated , she is tied to the bed . What ensues can be briefly described ( I'm not going to spoil everything for you ) as rape during dismemberment . Think of \" Flower of flesh and blood \" , mix it with porn and you will get the idea .It goes on for about 20 minutes or so . SFX are very good , makeup too . Everything is shown , with no mercy for the viewer . You have been warned .I thought \" Visitor Q \" was a very sick movie . After watching \" Niku daruma \" it looked like a fairytale to me .This movie is so sick , so depraved , so twisted , so disgusting that the harshest words pale in comparison to it's finale . Too bad it's released only on VHS so there are no subtitles available . But the movie still works without them . So , if you are into ultra sickness , extreme sadism and other beauties of this beloved genre , check this out . I hope you won't have nightmares .8/10 .","Not near as well made as the \"Guinea Pig\" flicks it was inspired by (\"Flowers of Flesh and Blood\" or \"Devil's Experiment\") and not conveying any real philosophy, this video feature, which is barely feature length, adds hardcore sex (with mosaic censoring) to its inspiration. The special make-up effects, which include stomach slitting and disembowelment, are pretty good, if overlit. The amateur feel of the production is a distraction. It all looks cheap and lazy. The lighting is harsh and the sound and editing are sloppy. The simple story involves a porno actress who ends up starring in a real snuff movie. Just when she gets tired of being abused, the real abuse begins. In the film's hero scene, an actor cuts the woman's stomach open in graphic close-up, stuffs his member inside it, and proceeds to do his thing. I didn't find \"Psycho - The Snuff Reels\" shocking. On the contrary, I found it to be a desperate attempt by amateurs to one-up \"Guinea Pig\" and its bloody ilk. Interestingly, this was distributed by Aroma, a leading fetish producer.","This movie just didn't do it for me. I like horror and splatter movies but this one has very little to do with horror. The effects are cheap and when they chop of one of her feet it looks so fake. The same goes for the other effects like the tongue torture and the gut sex. They could have spent of few extra bucks on the effects.With lots of sex (with pixelization as in all Japanese movies) this is just a sick fetish porn and there seems to be a market for sick stuff like this. While bloodier, for me it fits in with titles like Squirmfest / Purge and the Genki series. These movies feature girls eating and playing with every fluid that comes out of your body, eating bugs and fish in a gross way and having sex with all kinds of weird animals, like toads, eels and... One look at the covers will tell horror fans to look elsewhere. No horror here,just sick and degrading sex scenes.Horror fans should avoid this one and are better of checking out Guinea Pig2: Flowers of Flesh and Blood or even August Underground Mordum. While these are not great they at least offer a horror experience and Niku Daruma absolutely fails in that department.","If you choose to watch a movie with the title \"Psycho The snuff reels\", you know what kind of sick stuff you can get...or you think so. This Asian movie goes beyond. Forget about those hyped Guinea Pig movies...this is the real deal. This movie is the \"real fake snuff\".A porn actress performs in a movie (you know, she is fuc**d) in a movie and then, the real movie in the movie begins...a snuff one! The girl is mutilated, raped in wounds and all kind of sick stuff in that direction. This movie is insane, totally insane, the FX are just great. Be warned: this movie doesn't have nothing like a plot, its just gore, porn and pseudo-snuff Highly recommended for fans of this kind of movie. 9/10","i came across this film on the net by fluke and i was horrified by its content of vivid abuse violence and torture scenes. it was a relief to know it was not real after reading the comments. what dangerously sick animals of a person make something like this and for what purpose goes beyond belief. i was even more shocked to see people appraising the film in the comments section of this site. this is a extremely disturbing film indeed which could change your life forever. the people behind this should be bought to justice asap. today they shown a girl getting raped and butchered on screen tomorrow it could be a child. even its fake or not its very very deathly disturbing,nauseating indeed.","Niku Daruma, alternatively titled Tumbling Doll of Flesh, is a movie that follows an adult actress as she takes on a new job in a porno, however, when it gets abusive in nature, she gets cold feet but by then, it's already to late for her to leave. She's soon beaten unconscious and then tortured for the remainder of the movie. It's a pseudo snuff film done right, essentially. Unlike my last review on August Undergrounds Mordum, this movie actually had a story, which really helped the progression of it as a whole. Unfortunately, there isn't (to my knowledge) a copy online with subtitles, so I did have to watch it in full Japanese. I understood around 25% of the dialogue, but it's not essential to fully understand it as you can gather what is being said through the general tone of the scenes which adds a massive plus to this movie for me. I think what gives this movie the \"disturbing\" factor is that all the sex scenes within it are completely real. The only fake parts are the gore (which still actually look real, in my opinion.) Naturally, this isn't a film for the family or for the weak stomached folks out there as there is a lot of sex, violence and extreme gore including stomach-wound rape. The characters and the scenes out of the main plot are so mundane, which I feel makes it a lot more believable, because it genuinely looks like something a couple of amateur snuff film makers have put together. We're also treated to a storyline, so we fully understand what we're watching and whereas the production value is low, the concept and the execution are fully on point. The fact that there is no remorse for what they are doing really adds in bonus points for it seeming like a genuine snuff film, too.Think of me what you will for endorsing this movie, but out of all the pseudo snuffs out there, Niku Daruma is the one to watch. It is 18+ and can only be found online so don't go into this with the heart of a Disney character. It's dark, it's disgusting but I found it to be better than most shock horrors out there."],"review-user":["EVOL666","Skullcrack","HumanoidOfFlesh","Indyrod","Bitoque","sevdah","fertilecelluloid","gerard1976","ultra_tippergore","rabksaj","chelseaabenwell"],"review-date":["16 October 2005","17 May 2005","17 December 2004","27 October 2007","25 March 2008","18 March 2007","26 December 2007","17 May 2008","3 October 2006","18 January 2008","20 July 2014"],"review-rating":["6","8","8","7","1","8","4","2","1","6"],"review-title":[" Nasty Japanese Fake-Snuff Film\n"," nice pseudo snuff movie\n"," Truly vile and sickening Japanese pseudo-snuff film.\n"," The Most Extreme Torture Porn Ever....\n"," what the....\n"," Porn , bondage and dismemberment\n"," Guinea Pig revisited and some hardcore with mosaics\n"," Just not for horror fans.\n"," For fans of really extreme cinema only...\n"," sick and senseless\n"," Best of the Pseudo Snuff Genre\n"]}