{"review-url":["http://www.imdb.com/title/tt0109900/reviews"],"review-text":["Giorgino is a strange, dark, obsessive object; the casting is impressive, the plot is powerful, reminded me of Edgar Poe's tales. Probably not a masterpiece, but it does leave us with the remembrance of strong images, fine music, fear, sadness, confusion, and a sentence that says it all : the wolves are coming. GIORGINO is quite forgotten now, and when it was released nobody seemed to appreciate it. That's a shame. If you ever have a chance to see this, well... give it a try.","Giorgino is a long, excruciating journey from bad to worse in the life of protagonist after whom the movie is named. Young demobilized, gas-poisoned First World War lieutenant of very delicate health, who previously was a doctor in an orphanage for children with some mental deprivations, goes in a search of their new location and finds much more than he ever intended to and quite of a different nature. Depressive atmosphere of ultimate despair, where the insane ones are much less horrible than the sane, where the madness is a kind of poetry, will hold you hypnotized from the very first frames of this film to the last. And all the beauty: beauty of the winter and mountains, beauty of snowy landscapes and wild woods, I don't even know how all the sorrow and sadness of last days of war could be made so beautiful.","I think it's incredibly hard to write any kind of full-scale review to Giorgino, merely because it's one of those viewer-dependent, complex, poetical and philosophical films that are impossible to be watched enjoying their visuals and their story while cracking their artistic core at the same time, yet there are several things which are quite certain and beyond any doubt about the movie for any man of art (which, I hope, I am).The first: it's a certain masterpiece, even of that kind of art that is able to stand the test of time; the second: it's one of those rare \"dark\" movies in which the darkness is poetic, even romantic, attractive and much more sad than depressing, just like many of the Pieter Brueghel the Elder or Caspar David Friedrich's paintings. As to the core of the movie, its artistic aspect, someone called it Kafkian though I don't agree with that hasty attitude because actually it's far beyond Kafka's misanthropic logic and much more like Edgar Poe's parables: dark and scary but through that touching the most gentle strings of our souls. Actually, on the poetic side (which is much more important here than the narrative), Giorgino is a tale about eternal peace and love which can be achieved solely through saving oneself's inner child or, to be more precise, the childhood of one's soul. It is no secret, that such childish people are usually branded as crazy or at least misfits by our society, ignoring the obvious fact that they all have a virtue all the other grown-ups have lost: the virtue of true love, the kind of love that is called a God's love by Christian scholars.Indeed, Giorgino may be called a very Christian movie, with \"Be like children\" (Mt 18:3) as it's real hidden tag-line, though the film never deals with any kind of moral and concentrates solely on the Christian philosophical aspects. Though I think Boutonnat was too harsh portraying \"grown-ups\" as some sort of demons, incarnated as wolves, trying to kill childhood in the rare survived hearts, but it's his point of view and he has a right to think so. While watching Giorgino don't try to look for hidden symbols and meanings (though there are some), better try to understand and learn from at least some of the fables Boutonnat had hidden in the twists of the movie plot.I have to admit that the movie greatly impressed me with excellent photography, especially I was happy to see the rational use of color filters, incredibly smooth and apposite editing, wonderful acting of all the actors and, of course, the atmospheric beauty of winter mountains which reminded me of the Brueghel's \"Hunters in the Snow\". Also, interestingly enough, one scene, where Death itself shown in the form an old woman with sunken black-ringed eyes, instantly reminded me of Pesta (Plague) by Theodor Kittelsen, the Norwegian painter who made a series of drawings to the story of how the black plague swept out the population of a small town in a mountain valley. Is it a simple coincidence?","Giorgino can to some people look a bit long but it's one of rare real romantique adventure film. It could be compare to Docter Jivago  with a bit of Sleepy Holow. You must see it.","That's certainly not the best film ever. But that's certainly worth seeing for people with a special kind of mind. So the one who loves sadness and depression, and scary fairy-tales at night, and wolves and real madness - welcome! If you find a copy, of course:) As for me, I could stand it only once... But since that the Wolves, and Saint-Lucy, and children's drawings, and a headless Christ live in my nightmares.","I finally managed to see this movie...after so many years of expectancy...I was so curious to see if this movie it is as bad as some people say..And my opinion is that this movie it wasn't bad at all,on the contrary it was AMAZING...I enjoyed every second from it...from the beginning until the end...The actors were great they sent me the feeling that i was living the story at the same time as the movie was playing...The landscapes were so beautiful were the film was shot...and it did charmed me.. Also the music was extraordinary and i have nothingto reproach..I think that the plot was very original i don't think that i saw a movie like this...It is a shame that it isn't recognized all over the world..to bad for those who didn't get the chance to see it. i give this movie 10/10","How to summarize this film ? it is simply impossible. Why you should see it ? maybe for the story, very probably for the actors (Giorgio, Catherine...), above all for the universe and the poetry. This is a tale. Sad, sometimes dark, but a tale. I LOVE this film !!!! Just waiting for the DVD !! Thank you mister Boutonnat.","Although it has been a failure in movie theaters because mainly Mylene Farmer, one of the 3 top stars in France had not the first role. Fans had changed their mind after that and were waiting for it on DVD. When it has been released on DVD this year it has have a tremendous success ! The others fails was the slow pace and the incredible length (3h) at that time (1994) that have annoyed critics. But the melancholic story makes mandatory that slow pace and long time. The moral of the film is you cannot escape from the death you are destined for. It is the same theme than in the movie \"Final Destination\" and makes it a Gothic tale. The atmosphere is very melancholic.","I have started to write this review to the birthday of Mylène Farmer, a great French singer. Only because of that film I have acquaint oneself with her magnificent clips.I will not repeat all what was written before me, I will say that \"Giorgino\" has made a lasting impression on me as a film that combines incredible bleakness of the narrative with amazingly beautiful paintings of nature. I bow before the genius of Laurent Boutonnat as director and composer, who wrote music which penetrates you and penetrates to the heart and turns the soul — I first listened to the soundtrack and then watched the film, and not left disappointed. The actors played for such an atmospheric film like \"Giorgino\", in my opinion, just awesome, although for me in the first place was, of course, Jeff Dahlgren (Giorgio Volli) and Mylene Farmer (Catherine Degras) — in my opinion, love embodied them in the film, the most tragic of all that I've seen (except maybe \"Titanic\", but now, after seeing this creation, I can't be sure). Very impressed with the way doctor, how is the main character, and the image of professor Beaumont — completely different ideas about medical ethics and all of humanity with respect to both the patients, and in general to people.Thanks the director and all the actors that have made it possible to touch the unexplored parts of the soul that always feel, but at the same time, too often muffled in itself, the name of which is sympathy and compassion for the man.","So boring you'll fall asleep after the 20 first minutes. Sorry Mr Boutonnat, I do admire your work (all these beautiful \"films\" you directed such as \"Tristana\", \"Sans logique\" etc...) but here, the plot is extremely... vain ! Except the magnificent photography, everything appears dumb and there's no envy to know what will happen at these \"medium\" actors. Moreover, the dialogs are minimalists. The famous question \"where are the children\" is repeated so often it looks like a farce. Believe me, it's a pure waste of time (concerning the plot), and 3 hours is a long long time. Certainly the real reason of this box-office total mess !"],"review-user":["uso_dorsavi","JustApt","Efenstor","jackvonb","StrangeSavage","baddezil","itty-1","davidjulien","kmhf-25079","melimelo34"],"review-date":["21 December 2002","5 May 2008","17 August 2008","19 April 2002","20 December 2001","20 May 2008","15 July 2002","23 April 2008","4 March 2017","20 May 2005"],"review-rating":["10","10","10","8","10","10","10","10","10","2"],"review-title":[" Forgotten jewel\n"," Things Are Never Quite So Bad That They Can't Go Worse...\n"," Be Like Children\n"," The movie that mix David Lean and Tim Burton.\n"," Words full of nothing...\n"," I am amazed\n"," A moment of Pure Poetry...\n"," This film is cult\n"," \"Giorgino\"\n"," An awful work !\n"]}