{"review-url":["http://www.imdb.com/title/tt0118214/reviews"],"review-text":["OK, so it's a silly movie, but I think they knew that when they made it. And there are some neat little twists on the otherwise tired, overdone \"Godzilla\"-type genre.  Borrowed a tape just because I knew someone in it, but I did loan it out to a couple pals, who also kinda liked it.","Yes, this movie sucks.  But it's still a lot of fun to watch.  Especially if you want to get rid of those annoying friends who only hang around you because they think your taste in films is \"unique\" and \"cool\", and they think the language you speak is \"hip\". Basically, if you've got someone hanging around you trying to absorb your personality, invite them over and make them watch Zarkorr! with you. This movie is loaded with inside jokes of a bizarre nature that the uninitiated simply WILL NOT GET.  Come ON!  An alien race presents itself to a postal worker, in the guise of a tiny mall chick?  No one else found that funny?  Or the interviews FOLLOWING the film, where the director EXPLAINS the monster camera angle?  Don't see this film to entertain yourself. Rent this film to get rid of stragglers and door-to-door evangelists!","If you are looking for King Kong, you mispelled your search!  This is a low-low budget movie that was soley >ment to entertain people in a comic sense.  Here is the >most ordinary human who is the only 1 who can save the >world from a 185' 300 ton behmouth.  Surely you can see the humor in that.","First, let me make it clear that I'm a big fan of bad sci-fi, especially when it involves gigantic, city-stomping monsters. But this one is so fantastically lame that I can't even like it for being bad. They apparently didn't shave enough money off the budget by skimping on the props (the only prop we have to indicate the size of the alien girl is an oversized novelty pencil, available at Spencer's Gifts for about fifteen bucks), they also decided not to outlay for concept or plot. The monster DOES look okay, in my opinion, but it doesn't have enough interaction with the backgrounds, i.e. not enough destruction to suit most fans of the genre. The general rule of giant monster movies is: If you don't have a lot of fake-looking buildings to smash, then you'd better have another fake-looking monster to wrestle with. This movie has neither. I can't make my final complaint about the movie without giving away the ending, but suffice to say the origin of the monster, and the method found to get rid of it, just don't hold water. Not even as well as most of these movies. Skip it.","This is an utterly forgettable picture.  A friend of mine picked it up in a bargain bin at a local rental place for $.50.  He should have demanded a refund.  Or at least a discount.The plot is something like this:  A giant monster threatens the earth and aliens decide that the most average human being on the planet must be chosen to save the earth.  Thus a tiny holographic space alien appears before a postal worker and tells him that he's \"it.\"The devil is in the details when it's time to rate a movie, and on that count Zarkorr!  The Invader fails miserably.  The monster Zarkorr only has a few brief moments on the screen, totaling maybe 5 minutes tops (with a generous estimate).  The cute alien hologram has even less screen time and might be the most interesting character to look at, and only because she's wearing a \"teeny bopper\" stereotype outfit, complete with a teasingly short pleated skirt.  The climactic final battle with the monster is over before you can say \"Whiskey Tango Foxtrot, over.\"  In the next moment you are left to ponder whether you've just experienced a train wreck or if someone just drained 3 pints of blood out of you.Admittedly though, this movie did deliver one line that my friends and I to this day still repeat and laugh at and was about the only bright spot in this otherwise abysmal picture.  As the cast of \"protagonists\" is being \"interrogated\" by the fuzz, one of them responds to the questions with the statement \"What are you, some kind of a question asker?\"  It is delivered in such a preposterous manner that if you're sitting with a group of friends (who won't be your friends long if you actually talked your friend into watching this) you may actually experience a howl or two of incredulous laughter.While this is no Manos or Eegah (It's not even bad enough to be classically bad) this movie will still bore you with its awful dialog, unimaginative characters, and nonexistent special effects and still deserves to inhabit the bottom 100.1.5/10","Okay, I like monster movies as a general rule; I'm a big Godzilla, Gamera, King Kong, etc fan. I appreciate a good monster movie with a guy in a rubber suit. Zarkorr just sucks. The only part of it I liked was the beginning, they opened the movie with the monster erupting from a mountain. That was cool, and many monster movies have the problem of bothering us with the human characters and not introducing the monster(s) until a half hour in or so. The movie didn't go downhill from there, it flat out dropped dead. Lemme put it this way, this monster can shoot lasers from its eyes. Fun, right? They kill it by reflecting its eyes back at it. A regular guy just reflects them back at the monster when it finds him. Doesn't try to eat him, throw anything at him, step on him; just fires those lasers while they get reflected back at him, BAM. Zarkorr is dead. The worst Godzilla movie would be better than this junk.","This movie stinks. IMDb needs negative numbers in its rating system to properly evaluate this turkey. The acting is either wooden or over the top; the film was apparently NOT written by anyone in particular; and the monster scenes were mediocre at best. Even as a movie driven solely by the monster scenes, those shots were so disappointing that they could not inspire any sympathy for the rest of the movie. I want the 80 minutes of my life back that this movie stole.","Aliens let lose a giant monster named Zarkorr, then send down a hologram that looks your average stupid teenage girl to tell postman, Tommy Ward (Rhys Pugh, in the only movie you ever see him in) that has been chosen to fight. Also if he loses the plant goes doom, so he goes off to fight Zarkorr the Invader! This movie is bad, very bad. So bad it you need negative numbers just to gave it a rattan. Horridly written, bad directing, way below Power Rangers over-the-top wooden acting that you're just whiting for a horde of Lumberjacks to come out of no where and cut them down! And don't get me started on the theme song at the end. The people who made this stemming pall of S$@# should not be aloud near a camera or any thing to do with films. Zarkorr is a cool looking monster that should have been in a movie a million times better than this one. Do your self a favour and don't see this movie, it's 80 or so minute of life. The actors that are in this never worked again by way.3/10"],"review-user":["zineland","gomi_girl","franco-28","knsevy","chrono-1","danhollow","Zarkorr","kevinclark1988-1"],"review-date":["14 August 2001","1 April 2001","13 October 1999","28 October 2001","10 April 2004","6 May 2011","14 February 1999","23 October 2007"],"review-rating":["4","8","2","2","2","1","2"],"review-title":[" It's So...so-so!\n"," For when you really want to get rid of those annoying guests...\n"," Funny low budget movie.\n"," Hold your nose\n"," This movie belongs in the bottom 100.\n"," Poor.\n"," Stinks\n"," Zarkorr the Lame!\n"]}