{"review-url":["http://www.imdb.com/title/tt0113638/reviews"],"review-text":["Why is there such a sharp division of opinion on this charming movie? I suspect because it is a \"difficult\" romantic comedy. In almost all romantic comedies, it's clear from the credits which couples will end up with each other. The male and female leads are destined to be paired, as are the secondary male and female stars, and the pleasure lies in seeing the couples correctly sorted out after a lot of confusion. In \"Let It Be Me,\" the only absolutely perfect pairing is that of third leads Patrick Stewart and Leslie Caron. It's a very close question whether the engaged couple, Campbell Scott and Jennifer Beals, and the dance studio partners, James Goodwin and Yancey Butler, are really destined for each other or whether they should change partners and dance. \"Some people just belong together,\" Beals says, but which people is a harder question to answer here than in most comedies, though it is satisfactorily answered by the ending.","Dance movies usually keep my interest and Let It Be Me did just that. However, the two main couples had very little chemistry and as I watched it I would have been like with a better cast. Jamie Goodwin was wooden and mechanical. Aside from looking great from the hairline down, he was barely adequate. Jennifer Beals is a very good actress and tried hard to create something with dance instructor Jamie Goodwin, her former high school love. She and her fiancé played by Campbell Scott were a more credible couple. Yancy Butler was very smooth, but she looked bruised and unhappy during her non-dancing scenes. The third couple played by Leslie Caron and Patrick Stewart were lovely, charming and pleasantly predictable. They grounded the movie with their mature romance and skillful dancing. Their wedding at the end of the film was the most satisfying scene. The other dance sequences were good, but not great.","None of the other reviews mentions that Yancy Butler is incredibly lovely in this film and will surprise you with her dancing abilities.  She looks utterly seductive sporting her mid-90's era thigh-high stockings.  This film is a \"must see\" for her fans.However, others might want to skip it and work on re-alphabetizing their CD collection.","If you like dancing, you'll like this film in general but you might find it a little boring in places.  Patrick Stewart is charming and he has a really good chemistry with Leslie Caron.  It's really nice to see Jennifer Beals again, she's a fine actress and one of the great beauties of Hollywood, though she doesn't flaunt it like so many others. I saw on the credits that Elliott Gould (a great dancer) was in this film, but for the life of me, I could not find him in this movie.","If you loved \"Dirty Dancing\" you'll enjoy this movie; both were written by Eleanor Bergstein.\nHeartwarming story about three couples at a dance studio. Perfectly cast. Jamie Goodwin and Yancy Butler make a stunning dance team.  Patrick Stewart with an American accent (!) and the ever graceful Leslie Caron.  Jennifer Beals, in a surprisingly conservative role, and the dashing Campbell Scott, as the confused groom-to-be.\nThe bar scenes between Gabriel and Jordan, are hilarious.\nThe score is lively, the dance sequences beautiful.  It's an uplifting movie! Made me want to go out and take lessons, myself.","Love this little film, that reminds me somewhat of the original Japanese gem, SHALL WE DANCE? (not the overblown Gere/Jlo remake...) Luckily I found it and taped it when it was showing on a STARZ Promo Weekend, because as far as I know, it's not available on DVD. I'll watch just about anything with Yancy Butler (anyone remember the short-lived TV series MANN AND MACHINE ???) in it, and she positively shines in this. She does a dance routine to a disco song that is verrrryyyyyy HOT!! Loved all the other characters in it, especially the ones played by Patrick Stewart and Leslie Caron (where's she been all these years?). This is one of those films that I take out from time to time and always come away smiling after watching it. Recommended highly!!!","Sweet but empty dance movie about three couples, two of whom change partners then return to their original love interests. The problem is that the characters in the love quadrangle are boring and superficial. They seem less than passionate about their dreams--love or otherwise--and when they break up and return, their motives are strikingly flimsy and unconvincing. What did they see in each other in the first place that they can so easily drift? Regardless of the backstory about their lost love, pregnancy, smiling in bed at each other, nothing in their motivation defines distinctive, memorable, or engaging characters. Dialog is trite, lacks freshness and wit. Actors are fine: Jennifer Beals is appealing, Yancy Butler sexy and smoking. The third, older couple, Patrick Stewart and Leslie Caron, whose lives end happily, have no discernible story to portray. The writing in the film fails them utterly. Dancing is fun but not great; contrast mediocre sequences here with the dynamite dancing in Flashdance. Script = C-.","There's not much to this movie, but it's sweet and has a fairly good ending. It was worth watching just to see Patrick Stewart and Leslie Caron dancing. Yancy Butler, from Witchblade on TNT, is a pretty good dancer herself.","Let it be Me is nothing more than a cute romantic film about couples who falls in love during dance lessons. I remember James Goodwin from his Another World days. It's nice to see Leslie Caron again as Patrick Stewart's love interest. The dancing could have been better though without being corny at times. Otherwise, it is well worth a watch to see couples fall in love. It's not Dirty Dancing but it's from the writer who created that phenomenon. Let It Be Me is about couples who get together during dance classes. The cast is first rate with Leslie Caron, Patrick Stewart, Jennifer Beals and Jamie Goodwin. It's not what you expect but it's okay and fare.","I felt that this movie had a lot of heart and must have been a labor of love for Eleanor Bergstein. The primary actors (Campbell Scott, Jennifer Beals, Yancy Butler, James Goodwin III, Patrick Stewart, and Leslie Caron) were very well selected and played their parts with excellence. It was a very uplifting movie that I wish was available on tape or DVD. A rare gem.","I just finished this movie and my only comment is \"OH! WOW!\". Jennifer Beals is ok as the fiancee, but Yancy Butler as the female dance instructor is pure sexual dynamite! Having watched her in WITCHBLADE, I was not prepared for the pure unadulterated sensuality and raw sexual excitement she launches onto the screen.I gotta see THIS movie again....if only for Yancy Butler as Corrinne!","Enjoyable movie,i thought they made Jennifer Beals look to old though, and she didn't show much passion through out the movie.Yancy Butler on the other hand was just awesome,I wish she made more films showing off her sensual side as she did in this one. Patrick Stewart made the film in my opinion. He puts great energy into any character that he plays.The film was somewhat predictable you could see the ending coming. The dancing you could tell looked rehearsed, but since these are professional dancers or teachers you expected more speed and confidence from their moves.The ending also seemed rushed. I would have liked to have seen more passion,sexual tension, between the couples.Some jealousies between the couples would have given the movie more depth also. I am a Yancy Butler fan and that is why i was looking for this movie to come out and it finally did on cable. I hope they make it into a DVD","This has got to be one of the worst movies I've ever seen. It just came on German television (never made it to the cinemas), and was one of those movies that you watch totally flabergasted, wondering what the makers were thinking when they first realised how bad the movie they were working on is and why they didn't stop there and then. One also has to wonder why the movie has no plot. Brief outline:Boring guy passes a dance place, decides to learn to dance. Learns to dance there, becomes really good, meets charismatic dance teacher and fat guy. Gets on everybody's nerves because he's dancing all the time. Takes his fiance to the dance place where she meets her ex-dance partner from high school, who just happens to be the boyfriend/husband of the boring guy's dance instructor. In between all of this, Patrick Steward, who is also a dance instructor, falls in live with an older student and they get married at the end. As do the boring guy an his fiance but only after several \"steamy\" scences b/t the boring guy and his dance teacher and his fiance and the husband of the dance instructor. What really disappointed me was that there was no big state-wide dance competion that the boring guy and his wife win in the end. Can't have everything, I guess.Only groteque fascination allowed me to watch all of this movie. Oh: the German titel is: \"Flirty Dancing\"!","I found this movie really hard to sit through, my attention kept wandering off the tv. As far as romantic movies go..this one is the worst I've seen. Don't bother with it.","No, no, no, no, no, no, NO! This is not a film, this is an excuse to show people dancing. This is just not good. Even the dancing is slow and not half as entertaining as the mediocre 'Dirty Dancing', let alone any other good dance movie.Is it a love story? Is it a musical? Is it a drama? Is it a comedy? It's not that this movie is a bit of all, it's that this movie fails at everything it attempts to be. The film turns out to be even more meaningless as the film progresses.Acting is terrible from all sides, the screenplay is definitely trying to tell us something about relationship but fails miserably.WATCH FOR THE MOMENT - When Patrick Stewart enters the scene and you think the film might get better as he brightens up the dull atmosphere. For a second.","This film could have been so much better. It had a few nice points, but it was quite amazingly boring! It wasn't that the acting was bad, it was just that the script was pretty poor, and the plot was pointless.Also, I just didn't believe that Gabe's fiancee had anything going on with her old high school sweetheart. And Gabe's fiancee was very annoying.Perhaps dancing fans will enjoy the dancing scenes, but in my own opinion, this film is a bit if a waste of time.","It's impressing the lack of ambition of this movie, the kind of film that practically almost nobody watches.Jennifer Beals is as beautiful as always.But the movie as a whole is only recommended for professional dancers or fans of dancing."],"review-user":["gimhoff","2mg","ZunuFilm","waldorfsalad","Eve4","DEREKFLINT","robert_kirschten","Lady_Logain","Syl","AHTinVA","bluegerm","williamburts","a2800276","blurrysarah","peapulation","i_love_it","SkaVenger"],"review-date":["5 June 2004","6 January 2005","16 October 2002","9 March 2000","17 January 2000","15 February 2005","11 June 2011","31 August 2002","10 July 2002","5 May 2003","11 January 2003","2 March 2011","14 January 2002","19 November 1999","4 September 2006","25 December 2003","2 November 1999"],"review-rating":["5","9","5","5","5","10","8","5","1","2"],"review-title":[" Charming but \"difficult\" romantic comedy\n"," Kept My Interest\n"," For Yancy Butler fans\n"," A sweet film\n"," If you loved \"Dirty Dancing\" you'll enjoy \"Let It Be Me.\"\n"," A Favorite\n"," Vapid romance with OK dancing\n"," Good for quiet Sunday afternoons.\n"," A cute romantic film\n"," A rare gem of a movie.\n"," An astonishing small movie that somehow slipped below the radar!\n"," Let it be me\n"," Awful\n"," Dull\n"," QFC - Let it Be Me\n"," Not a Very Good Film\n"," Not much of a movie but not bad either.\n"]}