{"review-url":["http://www.imdb.com/title/tt0125034/reviews"],"review-text":["(There are Spoilers) End of the human race via a deadly and unstoppable infectious disease or virus is the storyline of the the made for TV thriller \"Carriers\".Were told that a US military/industrial operation for the US Army involving the drug company Gensystems got involved in a top-secret biological research experiment that suddenly went berserk when it. The by-product of the experiment, was introduced to the public as a fertility drug. One of the scientists working on this drug Jonathon Parker, Berry Bell, unwitting gave it to his wife Holly, Pamala Reed, to increase her chances of getting pregnant who eventually gave birth to twins two normal and healthy girls Alex & Lucy, Elke Larson & Kylie Larson, who were born with the virus in their systems. It was much later when they were in Gabon Africa with their father at the Gensystems Camp Rafflesla Research Facility that all hell broke loose when the two girls accidentally ate these genetically grown green barriers that brought the dormant and deadly virus out into the open.Spreading across the Atlantic after wiping out the entire Camp Rafflesla staff, except Lucy & Alex, the virus enters the US through a shipment of monkeys slated to be used for experimental purposes at Ft. Detrick MD. Within days it kills dozens of persons who as much as came in contact with either the monkeys or persons or were infected, by being bitten or sneezed at, by them.The movie gets a bit complicated when Doctor Maj. Carman Travis, Judith Light, and her colleague at Ft. Detrick Capt. Arends, Bill Nunn, start to uncover what's behind all these deaths. With the help of an unknown worker at Gensystems they come up with a government plan to use biological warfare against an enemy country by infecting It's people with the deadly drug. The plan was to sneak the drug into country as green berries and then have the virus activated by's it's population eating them.As both Maj. Travis & Capt. Arends get closer to the truth they find where the experiment were being conducted at a closed down US Army installation in Mississippi called Ft. Willard. Capt. Arends finding a secret CD disk in the forts computer room he later comes in contact with one of the persons who was very much involved in the experiments a former worker for Gensystems Dr. Larrimore, Joe Insoe. Dr. Larrimore reluctantly, when he realized that millions of lives are at stake, reveals the whole truth behind the experiments at the fort and who was behind them.Maj. Travis desperately trying to get a antidote, from the two carriers Alex & Lucy, made and immediately used to inoculate the American public from the virus is stymied by her boss Col.John O. Bailey, Philip Bosso. Unknown to Maj.Travis was involved with the covert experiments at Ft. Willard with Gensystems some ten years ago. Col Bailey will do anything, even murder, to keep the truth form coming out about his and the US military and the president of Gensystems Frank Sanborn (Nicholas Pryor), who had earlier committed suicide, involvement in them.Nail biting but predictable ending with Maj. Travis and Col. Bailey, Maj. Travis superior, facing off as the two sergeants under Col. Bailey's command are left with the unenviable dilemma of arresting Maj. Travis thus letting the entire country go to hell. The solders are thus faced with having hundreds of thousands if not millions of Americans die from this deadly and uncountable virus, in following their commanding officers Col. Bailey orders. Or using their common sense and rejecting Col. Bailey and letting Maj. Travis gets the very important antidote out, in the little time that she has left, to the American public in order to save them. You can just guess what their decision was.","I've watched the first 15 minutes and I can tell that there was no consultation with any military type personnel.  Judith Light's charactor (an officer) has her hair down past her shoulders!  One of the first officers that greets her as she walks in to the medical facility she works at is so overweight that his pant pockets gap!  No - there was no military advising them on this movie.  Even an ex-military enlisted could have assisted here.","OK, imagine that every state in the US, nay, every country has exactly the same trees growing and ground foliage. Imagine, also, that a monkey-trapper's camp so far off the beaten track you had to do the first half of the approach by river has a beautifully tarmac'd, perfectly straight road leading up to it. Imagine a world where you have to wear a full biohazard suit to collect a floppy disk, then you just drop it in a ziploc bag and transfer it to your pocket with no precautions as soon as you get back to the office. A world where two nine-year old girls are happy to give lots of blood without complaining. This is the world this movie is set in.On top of that, it's one of the most cliché-ridden pieces of excrement it's been my misfortune to witness in many a year.I liked it. :)","There is an outbreak of a virus unfamiliar to science.  It leads to a \"hemorrhagic fever\" of some sort.  An army doctor, a major, played by Judith Light, accompanied by her black colleague, is designated to investigate it and uncover its source and its treatment.  They manage to trace the infections back to Africa, thence to a mysterious government facility in Alabama.  It turns out that the virus was developed (somehow) as part of a government-sponsored investigation by a private research organization into genetic restructuring.  That's basically the source.  The treatment is discovered serendipitously through the exposure of identical twins to the virus, one of whom had a transfusion from an immune person and who's blood now carries the antibodies.  That's it.Did you find that confusing?  I can only call them as I see them.  There is the germ of a great, suspenseful movie in these ideas, and the production blows its chance.  This has to be one of the murkiest plots ever.  Murky plots are okay in some kinds of movies.  I suppose I'm still not sure what \"2001: A Space Odyssey\" was about.  But this is supposed to be a scientific detective story.  A subplot is thrown in about a despairing mother, Pamela Reed, whose two children disappear while visiting their father in Gabon.  We get time-wasting discussions between Reed and Light about how it feels to be a mother and worry about your children.  The time wasted should have been spent on exposition.  There is nothing about various levels of protection against infection, about how those alien-looking suits work, or about sterilization procedures.  (They use Lysol!)  As the story unfolds we learn practically nothing about viruses, let alone THE virus.  (There's a ten-second glimpse of what looks like a strand of spaghetti during a slide show.)  If only we had learned as much about viruses here, where it's essential, as we learned about ants in \"Them.\"  Or about alien microorganisms in \"The Andromeda Strain,\" before that story collapsed during its last few minutes.  As it is, \"Andromeda\" stands next to this flick as a model of explanatory clarity.  At any rate, I couldn't follow this plot. It's too bad.  Because anyone who wants to learn just how thoroughly creepy the real possibilities of such an outbreak are should read a well-written book about the subject, \"Hot Zone,\" by an author whose name now escapes me. The symptoms of the ebola-like virus are described in this film by offhand references to the liquifying of internal organs.  Read the book, if you can find it, and discover exactly what this involves.  We've already had a couple of close calls in real life that virtually no one seems to know or care much about.  The influenza outbreak of 1918 flattened the United States and Europe, but that was nothing compared to the viruses we are on the verge of unleashing on the world because of our penetration of heretofore unfriendly environments like tropical rainforests.  In these secluded areas, a virus may be endemic among a population of monkeys or wild boars, where they may cause no more serious symptoms than a common cold.  (HIV was basically a nuisance to chimps.)  But we are in the process now of providing them with a new host, the largest, most populous land mammal around, and one who travels rapidly all over the place by airplane.  In the movies, when there is a threat posed like this, science comes to our rescue.  The experts are called up.  Only, as regards this particular threat, there are no experts -- and no protection at all.The acting in this film is perfunctory.  Judith Light is pretty convincing as a commanding officer, or commanding person.  You can probably count on the fingers of one hand the number of times she blinks while the cameras are rolling.  The big military/industrial conspiracy is the usual stuff, detracting from any realization that the real demon here is so small.","I've been hearing a lot of this new bird flu that has killed dozens of people in South East Asia over the last three years . Apparently it's on the thresh hold of mutating into something very contagious and millions upon millions of people are going to be wiped out in a global pandemic . Just thought I'd mention this in case you haven't got round to writing your will yet .I'd also thought I'd mention it since I was watching something called CARRIERS tonight which wasn't about naval warfare but opens with a scene that's a cross between OUTBREAK and an episode of THE X FILES I saw many years ago . I thought I'd be watching something with added resonance after hearing the stories about the danger posed by bird flu but after the not unimpressive opening CARRIERS descends into a cheap and cheerful TVM and like every other TVM you'll see the lead characters are female , one of which is a ballsy authority figure while the other lead female is a mother of young children . It goes without saying there's a sick child subplot too What is irritating about the TVM format is that it overwhelms the potential of what could have been quite a good film if it was made for cinema . There's a fairly gory scene of someone coughing blood all over a nurses face and a very impressive jay walker getting run down stunt but these bits are quickly forgotten as the mood descends into family sentiment since this - And just about every other TVM ever made - was made for an essentially female audience"],"review-user":["sol1218","dede-12","Peet42","rmax304823","Theo Robertson"],"review-date":["16 December 2006","20 June 2002","26 May 2005","21 June 2002","26 May 2005"],"review-rating":["6","2","1","4"],"review-title":[" The mutations just don't seem to be following the normal pattern!\n"," An embarrassment\n"," Compellingly dreadful\n"," Muddy\n"," Just Another TVM\n"]}