{"review-url":["http://www.imdb.com/title/tt0151993/reviews"],"review-text":["Dumb is right: Tom and Jerry reach their goal of a non-stop air flight to Africa but then worry about mixing in with the natives. They put on \"blackface,\" crash the plane, try to survive on an airplane wing floating in the ocean, and then survive the wild animals once they get on landHaving read a few reviews before seeing this, I knew what to expect. It was simply these two guys doing their Amos and Andy/Stepin' Fetchit impressions. Offensive to blacks? Of course, but that's the 1930s for you. Some of their lines were funny, some were stupid. The main fault I had with this cartoon was the audio, as it was often not easy to understand what these two guys were saying.In all, a curiosity piece, but don't let the racism stop you from checking it out. At least it gives you an idea of how times have changed....for the better.","In the 1930s, Van Beuren Studios was NOT among the premier cartoon makers. In fact, most of the cartoons I've seen by Van Beuren stank...and this one is among the stinkiest! It stars Tom & Jerry (no relation to the later MGM characters) and they never were enjoyable during their two year run. Here, however, they not only aren't funny and the animation poor, but they are completely racist! The duo are flying over Africa and decide to land...so they paint themselves up to look black and begin talking like the characters from \"Amos 'n Andy\"! Surely many modern viewers would have an apoplexy if they see this today and it's sad to think that this sort of thing was considered acceptable back in the day. What makes this even less acceptable is that it's simply not funny...not in the least. I never once came close to laughing...nor will any sane person. While I hate the notion of censorship, I am glad this sort of crap isn't shown on TV today. If you are curious about our history and how times have definitely changed for the better, you can find this an other banned cartoons on YouTube.","While credited as a Tom and Jerry cartoon, this is not the cat-and-mouse team but an earlier Mutt-and-Jeff rip-off featuring them going to Africa and disguising themselves in the stereotypical burnt cork makeup to try to blend in. While the dialect humor is mostly lame, there is a brief musical sequence involving \"black skeletons\" that was entertaining. I have to ask however, how could Tom and Jerry still have their makeup stay on even after being dumped in the water a couple of times? One of many entries produced by the Van Beuren Corporation for distribution by RKO Radio Pictures before RKO made a deal with Disney. Only worth seeing if you're an animation buff or is interested in how certain ethnicities were stereotyped as entertainment way back when.","Tom & Jerry are visiting Africa and disguise themselves in an \"Amos-n-Andy\" fashion. They even act and talk differently, with the standard degrading usage of extremely poor grammar associated with the stereotypical image of blacks portrayed in many cartoons of the era. Aside from the offensive images, this cartoon just isn't very good. Why were they going to Africa in the first place? Apparently just to provide the audience with another Amos-n-Andy and the additionally overused cannibalistic portrayal of native Africans. The only reason this got a 2 instead of a 1 was there is a decent few seconds involving an octopus.Worth one view, which will still leave you shaking your head wondering how ignorance could prevail...(Note. I consider some cartoons containing such racially stereotypical images very good. It all depends on if there is good content surrounding the cartoon, or if the only reason for the existence of the cartoon is to make fun of those incorrectly portrayed. In other words, if you get rid of \"Mammy,\" shuffling feet, the poor grammar, and black-face with giant lips images is there anything left? In the case of \"Plane Dumb\" there is not.)","The Van Beuren Tom and Jerry (as said already not the famous cat and mouse, this is a human duo that lasted for just under 30 cartoons, 29 if memory serves correct, between 1931 and 1933) series was interesting but uneven and not easy to rate as an overall whole. At the series' best, the cartoons were good, very good in a few cases. At its worst, they were really bad.'Plane Dumb', following on from one of the best in the series 'The Tuba Tooter', is down there with their worst, actually a strong contender for THE worst. And there is a lot more wrong to 'Plane Dumb' than being widely and unsurprisingly considered one of the most racially offensive cartoons ever made, just to make that clear before anybody asks. Although the flaws are far more numerous and more glaring, 'Plane Dumb' is not without redeeming qualities. The best thing about it, like pretty much all the worst of their cartoons, is the music score. It is lively, characterful and beautifully and cleverly orchestrated, and not only adds to the action but enhances it and gives the cartoon the energy that is sorely lacking elsewhere. The other redeeming quality is the suitably menacing animation on the whale.Regarding the racially offensive stereotypes, before any attacks start there is the acknowledgement that there were plenty of stereotypes in cartoons and films in the 30s, some of them not being subtle or kind. Very few, if any, were as littered with racial stereotypes as much as 'Plane Dumb' and in a way that's this distastefully over-the-top and unsubtle, not just in the ugly character designs but also in the way they speak, their dialogue and the way they act. Far more offensive than any of the stereotypes in the \"Censored 11\" cartoons, including the most offensive of that collection 'Angel Puss'. Not just that, none of them will fly or bode well with anybody today and are too far of its time to be relevant or current, anybody will find this is the case regardless of skin colour.As said, however, 'Plane Dumb' has far more problems to it than just being offensive. Apart from the animation of the whale, the animation is far too simplistic and static, with little imaginative about the backgrounds, sloppy synchronisation and it's best not mentioning the character designs. Tom and Jerry themselves have rarely been the most compelling of characters, they are not just bland here but they have seldom been more annoying. When they are literally unrecognisable for most of the cartoon for obvious reasons it is hard to believe that it's them, they feel like completely different characters.Humour also just isn't there. The timing is dull throughout and the gags are too few and lack any inventiveness or comic timing of any kind, the usual strangeness and absurdity that is basically the tone of the series do not come through. This is because of 'Plane Dumb' being uncharacteristically for a Tom and Jerry cartoon dialogue-heavy, and while different can work in this case that was a huge mistake. The reason being that the dialogue itself, and its wince-worthy stereotypical nature, is cringe-inducing. There is nothing funny or endearing about it, it's basically annoying and overboard dumb and nothing else. The story is never a strong suit in their cartoons, this story is one of the flimsiest and also one of the dumbest and most senseless.Overall, of an uneven series 'Plane Dumb' is one of the worst and very bad ones. 2/10 Bethany Cox","Tom and Jerry are transporting goods via airplane to Africa. But being white men, they're worried they won't be safe, so they put on blackface to fit in. Once they're wearing it, they adopt black dialect and fully inhabit their new characters. They crash into the ocean and use the wing of the plane as a raft. Before reaching land, they suffer the advances of an over-affectionate octopus and more serious danger from sharks, a swordfish and a whale. Once on land, they're frightened by fantastic creatures, and duck into a cave. Inside it's even worse when they encounter living skeletons in blackface. And upon exiting the cave, things are even worse than that when they are discovered by cannibals.\"Plane Dumb\" is an especially sloppy effort from Van Beuren Studios. One example: a lion, unknown to Tom and Jerry, enters the cave before they do. But the animators must have forgotten about it, because the lion never appears again. Another example is the ending that's not an ending: it's just an arbitrary stop.According to a YouTube poster, the cartoon \"was originally intended to feature the voices AND caricatures of a popular 'Negro' comedy team known as Miller & Lyles. But Aubrey Lyles died of tuberculosis before the recording session was completed, and co-directors John Foster & George Rufle were forced to rework the animation into a 'Tom & Jerry' story.\"They shouldn't have bothered. The crude animation and poorly-executed gags make the film a loser from beginning to end.","I was under assumption that this was the cat and mouse duo but it wasn't instead it was something that shouldn't have been made not even for its time. They disguise themselves in the \"blackface\" fashion because they fly to Africa and they even act like Stepin Fetchit and all the others rolled into one. There are some cartoons that are racist but they are classics, being a mixed woman I have the right to say this, but if you are into the historical aspect of these cartoons try Merrie Melodies \"Coal Black and de Sebben Dwarfs\" or \"Angel Puss\" you won't find them on DVD because the distributors promised not to put them in the mainstream, but you can find them on a site as YouTube. I don't recommend little kids seeing this but if you want to see how early America was racist and ignorant these are better suggestions, not to mention this particular cartoon has poor animation, i know it was 1932, but I have seen better for its time.\"Plane\" unnecessary. -1 out of 10.","My God, the things that passed for entertainment in this country...This is *not* the \"Tom and Jerry\" you may have enjoyed on Saturday Mornings, featuring a hapless cat and a clever mouse. This is a much earlier animation series, featuring a pair of Mutt-and-Jeff clones who get themselves into various scrapes that result in any of the then-typical dancing-skeleton-type gags that made up so much of early animation.This particularly vile outing, apparently originally intended as a vehicle for a pair of actual black stage comedians of the time, has the pair crashing in the ocean while flying to Africa, necessitating black-face make-up, exaggerated \"negro\" dialect and \"Feets, don't fail me now\" situations.It only shows that in the 70 years between emancipation and this film, the American view of Africans hadn't progressed much. Then again, at least one of them apparently had a pilot's license."],"review-user":["ccthemovieman-1","MartinHafer","tavm","jtf1972","TheLittleSongbird","J. Spurlin","MsBoomBastic","dland"],"review-date":["4 July 2007","19 January 2017","21 November 2006","30 July 2005","20 November 2017","4 May 2008","21 June 2006","28 November 2005"],"review-rating":["3","2","1","2","2","2","2"],"review-title":[" My, How Times Have Changed\n"," Another god-awful Tom & Jerry cartoon...and it's NOT the Tom & Jerry you're probably thinking of right now.\n"," Plane Dumb features the worst in racial stereotyping\n"," Offensive, and just not a good cartoon...\n"," Dumber than dumb\n"," Sloppy \"Tom and Jerry\" cartoon from Van Beuren\n"," \"Plane\" Racist\n"," Dumb racist tripe\n"]}