{"review-url":["http://www.imdb.com/title/tt0159752/reviews"],"review-text":["A film that has C Thomas Howell (Dead Fire) as a star should raise alarm, and let's face it, to a certain extent you should know what to expect. The thing with Sheperd is that the whole set up is great: A post-apocalyptic underground world where religious factions fight for the mind and souls of the populace? That sounds great, doesn't it?In the hands of, say, Enzo Castellari or Joe D'Amato, this would have been a great film, and although the film is full of nice quirks and strange characters, the film just seems to meander along and regularly falls into cliché. On the quirky side, you've got Roddy Piper as a messiah type leader (and truth be told, he's good in this), David Carradine as a John Wayne impersonating, crazy ventriloquist (also good), and various scantily clad women, but the action is terribly filmed and the story is just what you would expect. C Thomas Howell (Nursie) just doesn't cut it for me as an action hero. His beard reminded me a Gary Bushell, of all people. I suppose with more to do he would have been more acceptable, but he just runs from one scene to the other with a chick and her kid in tow.You see (Thomas Howell), our hero is a Shepherd, who kills other religious leaders on behalf of Piper, but balks at a hit and has some guys sent after him, one of which was his old cop buddy with a secret. His hit turns out to be another Shepherd with a kid, whom our hero takes a fancy to as his wife and kid were murdered by someone or other. Did I mention that Howell does all this so he can watch his past through sunglasses? If you want to see Carradine acting really strange, or Piper carrying a cross, then this film has that, but if you want a film where you can guess the ending (except for the head scratching motives of the ex-cop buddy), then well I guess this film has that too. It's remarkably unremarkable.","I say \"flick\" because this doesn't deserve the appellation \"movie\", and certainly not \"film\". I regret paying for the rental, and although I've never walked out on a movie before, this would have been it, had I seen it in a theatre. A society living underground in the future (oooh, THAT'S original), lots of burning barrel drums, unexplained ambient light shining through windows, an ungrateful woman and her shock-muted son...the list goes on and on. C. Thomas Howell affects the husky voice of the stereotypical loner; you know like Eastwood's been done to death.  He needs special sunglasses to remember his wife and child, yet in the flashbacks, he's the same age! Talk about a poor memory! I stared incredulously when the little boy Abe randomly pushes a code into a door and it opens! No tension, pithy religious (what religion?) under/overtones...saddest of all: I expected better from Roddy Piper;Quite possibly the worst movie experience in my life.","There are only a few movies which can be called `must see' and SHEPHERED is one of those films. In many ways it was ahead of it's time (and you can tell it was a source of inspiration for several better-known films) Copied by many, equaled by none, this truly is one great movie.The story is complex but unfolds itself as a taut yet frequently amusing thriller and highly thought provoking exploration of the nature of humanity. The story takes place in a post-apocalyptic world where people must live underground and chaos reigns. C. Thomas Howell is a `Shepherd' one who protects the populace for various religious leaders by killing off any unfit members of the society. The whole idea made me think about our society. It's really a brilliant social commentary, which is more than I can say for certain recent sci-fi/action blockbusters. MATRIX RELOADED and REVOLUTIONS didn't make one feel that any real innovation was taking place, just dull video-game effects. But SHEPHERD scores on the action scale too...Not once does this movie let the viewer catch their breath. Peter Hayman proves himself to be one of the few genius action directors. We're talking 100%, high grade, down home kung fu fighting! It was excellent. Really good special effects, shoot-outs, bleak-futuristic cyber-punk noir style the film really has its own elements.When talking about SHEPHERD, it's impossible not to mention how much style it has. The vision of this city is really stunning. It recalls images of Tim Burton's very memorable vision of Gotham in BATMAN. And these sights are photographed by Graeme Mears with a degree of skill that puts Gordon Willis and Conrad Hall to shame. Even the special effects proved amazing. Doubtless the scenes where fighting occurs are landmarks in all of filmmaking. This movie is a ballet of awesome visual display.Still, at the base of it all, there lies an interesting story, carried through by a strong cast. The acting (especially Rowdy Piper) and the plot are both great, and excellently directed. In contrast with loads of futuristic films made with a strong artificial flavor, the characters are believable and the dialogue is natural and full of wit. I'm always proud to see a great film like SHEPHERD come along. It's a damn shame that it didn't receive good distribution and made nothing in the box office. It's a rarity worth searching for. This movie will impress you and make you feel 10 times cooler for having seen it!","I have NEVER fallen asleep whilst watching a movie before.I did with this one.Avoid at all costs, give your time and money to a worthy cause instead.","First of all, let me start by saying that I have been a devoted follower of C Thomas Howell's career ever since \"The Outsiders\" and \"The Hitcher\". He was an up and coming star in the 1980s - with hits such as \"Soul Man\" also. The future was bright for this young actor and he had the potential to go on from there and really assert himself in Hollywood. Put it this way - Tom Cruise had a bit part in \"The Outsiders\" while Howell had the lead. Look at Cruise today !!! But picking material like this drivel will only denegrate Howell's career even more - if that was possible. Why does he pick stuff like this? A small part in a major movie would be of more benefit to him than this rubbish. Essentially the story here takes place in a post-apocalyptic world where everybody lives underground where chaos reigns. Howell is a Shepherd - protecting the flock of various religious leaders by killing off any undesirables. He's a hitman in other words. The sets are so bad, they wouldn't look out of place on a Thunderbirds episode. The use of slow-motion needlessly repeats itself throughout the movie but is well backed up by bad acting (and bad is a kind word here), no continuity, scenes that are thrown in for no reason whatsoever, vehicles that looked like they were made from a Corn Flakes box and a directorial style that bordered on stupidity. Oh yeah, and the storyline was pathetic too. I hate writing bad reviews about films - especially those in which I really like the star - but this film is so bad I don't believe for one second that anyone could have been proud of it. I am not a filmmaker nor am I a director but I would hide my head in the sand if I'd spent whatever amount of money and time on this movie. In short - this was a monumental waste of time and energy and I would not recommend anyone to EVER see this film. It came free with a DVD player I bought but I still turned the thing off halfway through because I was embarrassed for Howell. Come on C - give yourself some credit and wrestle yourself away from these non-hit wonders and try to knuckle down and get a good part - however small.","First of all, let me start by saying that I have been a devoted follower of C Thomas Howell's career ever since \"The Outsiders\" and \"The Hitcher\". He was an up and coming star in the 1980s - with hits such as \"Soul Man\" also. The future was bright for this young actor and he had the potential to go on from there and really assert himself in Hollywood. Put it this way - Tom Cruise had a bit part in \"The Outsiders\" while Howell had the lead. Look at Cruise today !!! But picking material like this drivel will only denigrate Howell's career even more - if that was possible. Why does he pick stuff like this? A small part in a major movie would be of more benefit to him than this rubbish.Essentially the story here takes place in a post-apocalyptic world where everybody lives underground where chaos reigns. Howell is a Shepherd - protecting the flock of various religious leaders by killing off any undesirables. He's a hit-man in other words.The sets are so bad, they wouldn't look out of place on a Thunderbirds episode. The use of slow-motion needlessly repeats itself throughout the movie but is well backed up by bad acting (and bad is a kind word here), no continuity, scenes that are thrown in for no reason whatsoever, vehicles that looked like they were made from a Corn Flakes box and a directorial style that bordered on stupidity. Oh yeah, and the storyline was pathetic too.I hate writing bad reviews about films - especially those in which I really like the star - but this film is so bad I don't believe for one second that anyone could have been proud of it. I am not a filmmaker nor am I a director but I would hide my head in the sand if I'd spent whatever amount of money and time on this movie.In short - this was a monumental waste of time and energy and I would not recommend anyone to EVER see this film. It came free with a DVD player I bought but I still turned the thing off halfway through because I was embarrassed for Howell. Come on C - give yourself some credit and wrestle yourself away from these non-hit wonders and try to knuckle down and get a good part - however small.1/10 - and only because there is no setting for 0/10.","This is a little movie with big ideas, even if perhaps some are borrowed. Definitely influenced by the aesthetics of 1991's Total Recall, this 1999 action/sci-fi is set in a post-apocalyptic underground society ruled by rival religious cults. Thomas C Howell is Dakota, an assassin, or \"Shepherd\" given an assignment to take out a female Shepherd from a rival cult.\nThis is not a movie without its flaws, the acting isn't the best and some of the effects have dated quite badly now. Roddy Piper is entertaining as a religious cult leader, but his appearances in the movie are sporadic and he doesn't interact with the other lead stars at all during the movie.\nThe overall production, however, is very impressive on such a shoestring budget. The set design could give bigger movies of the time a run for their money, and David Carradine is also delightfully deranged as the creepy ventriloquist.\nThis could have been a much more successful movie with some tweaks here and there, but as it stands its still a good point of interest for a 90's low budget retro fix.","A giant piece of crap, but an amusing one. If it had kept up the energy it has at its outset, and if it, you know, made any kind of actual sense by the end, it might actually have been a decent B movie. As it stands, it's definitely of the so-bad-it's-good variety. C. Thomas Howell stars as a \"shepherd\" (which was the film's original title before it was rebranded with a more sci-fi title), which is some sort of religion-based assassin. You see, it's the future. Great wars were waged on land which have driven the survivors underground. Now a handful of crazy religions are fighting it out down there. Roddy Piper plays the major villain, a Christian preacher who is sick of losing ground to a cult of women under the watch of Sophia (Marina Anderson). Howell is tasked with assassinating a member of her cult (Heidi von Palleske), but she and her son remind him of his dead family so he saves her and tries to keep her from other assassins instead. Oh, and David Carradine is along for the ride as a ventriloquist. It's all very nonsensical, but the silly (but even sometimes clever) production design is fun and everyone overacts to a hilarious degree - except for von Palleske who comes off like a robotic Jessica Chastain.","Planet Earth has suffered a terrible environmental disaster so humanity now survives underground split in to different religious cults . What caused the catastrophe ? I have no idea ? why is humanity split in to different ecclesiastical factions ? I have no idea . Since the surface of the Earth can no longer support human life how are the humans able to grow crops in order to feed the population ? I have no idea . What sort of producer thought this screenplay deserved to receive funding ? I have no idea SHEPHERD is one of these films that creeps up late at night on cable channels . The sort of film where you consult the IMBb to see if it has any merits . The number of people who've commentated on SHEPHERD on this page hasn't yet reached double figures and this is a film that was released nine years ago . Perhaps the people who have never seen it are the lucky ones ? As for the rest of the plot it's very routine . Grumpy former cop Boris Dakota whose wife and child died several years previously meets a woman and her child and it's up to him to save their lives , almost like a futuristic western . Throw in a former wrestler who now runs the God channel , a fascist Christian bloke who's trying to snuff out Boris , a ventriloquist , some T&A for the sake of it and you've got a mess of a film . I guess after seeing this Neil Marshall's DOOMSDAY is possibly a masterwork of cinema in comparison","Although I was somewhat wary before watching this movie, because Roger Corman produced it, I decided to watch it all the same. Actually, for the first part of the movie, I thought, \"Hey, maybe this might turn out to be good.\" That's because despite having a low budget, the movie's computer special effects, sets, and props were a lot better than you usually get in a Corman movie. However, the movie soon collapsed in my eyes. The story is pretty incomprehensible at times, and it was hard to get interested in the characters' plight at times. The action is also not that special, coming across as dull and badly edited at times. Howell does try hard, even taking off his clothes in one scene, but we didn't need to see that. If you're a fan of Carradine, be warned - his appearance lasts less than five minutes.","Matters get to a great start in this at least with some nice special fx work depicting the inception of a war in space - Great say I and I was immediately filled with high hopes.....but it was sadly not to be for any initial positivity was subsequently dashed horribly upon sitting through this to the end. Frankly, this film is a mess; Irritating characterisations, a story that goes nowhere and poor action sequences do not a good movie make!Both main stars, Howell and Piper are utterly wasted in their roles although the latter at least does appear to be enjoying his role somewhat whilst the supporting cast are made up of infuriating oddities such as an annoyingly voiced priest/bookie, David Carradine as a psycho ventriloquist(!) and an annoying soldier who spends half the film beating up on his subordinates.There's really very little to say about this film in fact other than to avoid it - it's ninety or so minutes better spent on the toilet if you ask me.","yes, this is a prety bad film,  and it does have some unexplained aspects, plus the sex scene lasts way too long, and does nothing for the plot. anyway, this was a very class film, you have to see past the imperfections of the film, however badly it was filmed, and however pathetic the martial arts aspects, in fact, i kick better than howell. i loved this film no matter how badly it was made, i reckon that if this had been made as an annimation, it would have kicked ass, considering it was only a very low budget film, they just couldn't achieve the grandure and scale that was needed to make that film work, that and the fact that the robot, was about as effective as a lepper with a sharp stick, they quite blatently used the leftovers from short sircuit on that thing. i draw cartoons as a hobbie, and i'm gonna say right here and now, that i am going to remake this film in animated form and send it to the makers of this film, simply because i think this film deserves a second shot.","If \"B\" movies, tired and corny scripts, and golf carts dressed up as some sort of futuristic mode of transport are your sort of entertainment, you'll probably enjoy this. Otherwise, forget it. The topless newsreader, though completely irrelevant, did give a few seconds of amusement."],"review-user":["Bezenby","mito-3","nutsy","Forever Damned","markymarky","markymark70","peterellisroberts","zetes","Theo Robertson","Wizard-8","HaemovoreRex","thirdangelanimation","dave-1093"],"review-date":["22 March 2013","11 June 2000","14 February 2004","8 June 2002","6 December 2002","25 March 2009","3 September 2018","6 September 2015","11 May 2008","9 March 2011","31 July 2010","7 August 2001","15 February 2003"],"review-rating":["5","1","9","1","1","6","7","3","2","2"],"review-title":[" Quirky, but dull\n"," Quite possibly the worst \"flick\" ever made.\n"," DESERVES TO BE CALLED \"CLASSIC\"!\n"," Zzzzzzzzzzzzz !\n"," Howell should be ashamed of himself for this one.\n"," Howell should be ashamed of himself for this one\n"," Stands out from the flock\n"," Definitely bad, but I found it kind of fun\n"," Dire Post Apocalypse Thriller\n"," Very disappointing\n"," Truly abysmal\n"," a comic book story, very western.\n"," I'm sure those were golf carts...\n"]}