{"review-url":["http://www.imdb.com/title/tt0138464/reviews"],"review-text":["GEORGE AND MILDRED was a spin off from the mid 1970s sit-com MAN ABOUT THE HOUSE . Though I haven't seen the series since it was last broadcast I do remember it being fairly amusing with most of the comedy arising from the eponymous couple going to live beside the snobbish Fourmile family , a sort of LOVE THY NEIGHBOUR without the cynical racist gags .Having seen this \" big screen version of the show \" I find myself asking what it's a big screen version of ? Certainly not of a popular mid 70s sit com of the same name . For some reason the movie jettisons all character interaction from the television by having George and Mildred leaving the street where they live behind and getting caught up in a plot involving some serious gangsters who want something George has inadvertently picked up and which leads to some cringe making situations and lines like: \" Did he give it to you \" \" No that's the first time a man has resisted my charms \" \" I meant the envelope \" You do get the impression that screenwriter Dick Sharples ( Who never wrote an episode for the original sit-com ) has never seen an episode of the source material and has got the show confused with the CARRY ON series of films . In many ways it resembles the same mistakes of the latter LOST IN SPACE movie in that it has absolutely nothing in common with the series that spawned it","Let me start by saying how much I love the TV series. The nature of class war was always going to be a subject worthy of poking fun at, but this TV series exploits it better than most. The chemistry between Yootha Joyce and Brian Murphy was always electrifying and the writers wrote almost entirely flawless episodes every time. In my opinion, it is the best British sitcom of the mid to late-1970s, surpassing the likes of RISING DAMP, ROBIN'S NEST, ARE YOU BEING SERVED? and so on. With the ON THE BUSES series having finished a few years earlier, GEORGE AND MILDRED became the next pride and joy of ITV (or ITV 1 as it's now known), enjoying a four-year run on the channel.The movie however is absolutely terrible in almost every respect. The general essence of the TV series has almost entirely been stripped by the writers of this abysmal movie (who anyone will immediately notice are not the same ones who worked on the series). As one commenter has already pointed out, Mildred lacks the sharpness she had on the TV series and does not come across as anywhere near as overbearing.The plot, instead of focusing on the class war with the Fourmiles that was the very foundation of the TV series, actually writes out the Fourmiles almost entirely after the first half-hour. The plot, if you can call it that, consists of George and Mildred going on holiday to some hotel and getting mixed up with gangsters. First rate talent in the form of Stratford Johns, Kenneth Cope, David Barry and Sue Bond are all wasted here. Most of these are well past their heyday and all of them look very embarrassed as if they very well know that the only thing worth hanging around for is a paycheck (which probably won't be much).The jokes and gags in the movie (if you can call them that) rely heavily upon traditional British farce, including mistaken identities, embarrassing situations, poorly-timed slapstick, characters losing control of what is happening to them and general confusion. And it all fails miserably. As another commenter has pointed out, it seems as though the writers of this movie have never seen an episode of the TV series and instead crafted out a something resembling a CARRY ON romp. The scene where George is stripped down by Sue Bond's character is particularly out of context.A mystery surrounding this movie is the BBFC certification provided - 15. Just why is it rated 15 when all there is to see is harmless, non-vulgar entertainment?Not surprisingly the era of sitcom spin-of came to an end not long after this movie was released (shortly after the sad death of Yootha Joyce). And the company behind this movie, Hammer, well known for producing first rate horror movies back in the 1950s to mid 1970s, soon disappeared into total obscurity.All in all, the movie is a near total washout. My advice - skip this and stick to the TV series. You won't be missing anything, I assure you.","George & Mildred - The Movie lacks the talents of its TV writer John Mortimer who brings the close quarter cut and thrust of George's class war with the Fourmiles alive.The plot is cut from standard spin-off cloth - hit-man/mistaken identity - and has as little tension as there are laughs. The producers should have taken a leaf from Rising Damp, (also 1980)which was also bought to the big screen after the TV series demise, and kept much of the story in familiar setting.Yootha Joyce died in 1980 but she should not be remembered for this creaking piece of work encumbered as she was by her illness. Mildred lacks the sharpness of her TV incarnation; cutting asides and withering looks largely directed at Georges lack of libido. George's sputtering incredulity also gets lost in the more expansive sets. This is not to say that they were much to shout about. The budget for this movies looks pathetically small; a restaurant they go to is clearly a new semi-starched house with some Christmas lights adorning the front door.For fans of 70's British comedy or those who just want to revisit an old TV companion from their youth this film can add nothing to the experience and they should just stick to the first four TV series out now on DVD.","By 1980 the British cinematic trend of converting filmic spin-offs from situation comedies had already run out of steam. Margaret Thatcher had entered Downing Street as PM and the British climate changed considerably. British comedy in the coming decade would see alternative comedy blast through the walls to make a mark, whilst situation comedy shows moved to a different plane to that of their heavily sexed 70s brethren.George & Mildred was a wonderful show, itself a spin-off from the equally adorable Man About the House, the film suffers, not just as the death knell of a once proud British tradition, but also as a victim of climate change. That it bares little resemblance to what made the show popular in the first place is something used to pound down on the film with, but the production team were trying to keep up, sensing the wind of change they took two much loved characters out of the comfort zone and attempted to keep them viable. Oh it didn't work, not at all, but the will is still admirable.It's not a great film, it's passable at best because fans of Yootha Joyce and Brian Murphy can at least enjoy their stoic performances. While there are some very good gags in the script. But ultimately it's a tired picture, the set-pieces lack zip, the plot ill advised and underwriting the Roper neighbours, the Fourmiles, is a big mistake. Joyce would die soon after the film's release, a victim to alcoholism aged 53. Sadly this film is no way to remember her, anyone interested in her work are advised to see her 1970s TV output to view a wonderful actress at work. 5/10","George and Mildred is one of the greatest sitcoms to come from the \"70's\" decade.Like Bless this house,this sitcom is a Domestic one.This feature length movie though decides to take a trip down memory lane for the couple.Mildred decides that she and george will celebrate their anniversary of their wedding in a posh hotel.The catch is George gets himself into trouble and hilaritys pursue.It is not up to the standards of its small screen counter-part but is still a funny and good film.George is his usual self in this film and provides some great laughs especially with his screen time at the start and end with the fourmiles.The original cast are still present,which is a good sound start,and some well known comic actors also are present,for example \"Carry On Matron\" star Kenneth Cope as the bumbling hit man.The film though is relived on DVD, with oddly a 15 certificate (why???) and i would say is harmless family fun just like its small screen counter-part.Its drawbacks though is that it ends pretty sharply, and i do wish the fourmiles featured a bit more.I think if the film took a different angle such as \"A holiday with the Fourmiles and George's friend in pursuit\" might have fetched a better plot,but all the same it was a fair BIG screen match. (8.4/10)","As with a lot of TV-to-film sitcoms, this failed miserably to transfer to the big screen. The mainly studio settings of the TV version forced some sort of discipline which is sadly lacking here. Seems quite appropriate that this was made by Hammer Films. A classic of the horror genre!","George and Mildred is a truly unfunny film. This attempt to translate the successful TV series to the big screen was a dismal failure, as is so often the case.The wit and clever one-liners from the TV shows have gone missing. The plot is a typical English farce of confused characters and mistaken identities, which is neither funny enough nor weird enough to provoke many decent laughs.Die-hard George and Mildred fans might want to see this final episode of the pair's output (Mildred died of hepatitis before the film was released), but others should invest their time more wisely.","After seeing other reviews on here, I viewed this film with some trepidation, & not with my expectations too high..It starts off brightly enough - we get introduced to the familiar characters from the sit-com in the first few minutes (albeit living in a different road to the one used in the TV show, but similar enough).Once the plot is established about the Ropers celebrating their anniversary at a swanky hotel, things unfortunately start to go downhill. As so often with previous British 70s sitcom spin-offs, the humour doesn't always work when familiar characters are put into a completely new setting - & it's the same here.The usual humour about George's laziness, Mr Fourmile's snobbishness & Mildred's upwardly mobile aspirations being dashed are jettisoned for an unwise 'mistaken-identity' plot (which ironically could very well have been written for someone else entirely!).The whole film lurches into being a slightly bawdy sex-comedy - much more like something from the early 70s than the 80s, & George & Mildred don't really get to play to their strengths & behave as they do in the show.Despite a good supporting cast including Stratford Johns, Kenneth Cope, Harry Fowler (& an early appearance from Vicky Michelle), the whole film becomes rather exhausting about halfway through & wears out its welcome, as the whole thing starts to fall flat.Not to say that there are some laughs along the way - but nothing as good as what we've seen in the G & M sitcom.It's sad too that this became Yootha Joyce's final work - being released after her death, & thus putting an end to this warmly-remembered series, leaving this film as her epitaph.It's certainly worth watching if you're a G&M fan, & an interesting period piece - & good of course to see these characters one last time. Just don't expect to be blown away... we'll leave that to the 'hitman'!","OK I'll agree with the critics this is probably the film that killed off the sitcom spin off boom as George and Mildred the movie is way below par compared with the television series and wasn't a big success at the box office.However, it's not a complete disaster as the characters remain true to form- George is a layabout with no sex drive and no ambition and Mildred is a sexually frustrated social climber- and Stratford Johns is amusing as a mildly camp gangster Harry Pinto and the scene where George is seduced unwillingly by Pinto's moll is hilarious. It's just a shame that the Fourmiles, the snobbish next door neighbours, are reduced to minor roles and the car chase scene at the end is poor and predictable and some of the jokes are too obvious. Also could a socially inept and not very intelligent middle aged man really pass for a contract killer and would a top gangster be taken in by this.Yet when the alternatives are football and property shows and Murder She Wrote, George and Mildred is passable and I always seem to end up watching it with such dire alternatives on the other channels. My advice would be, if you expect it to be as funny as the television show, you'll be disappointed, as I was when I first saw it in the eighties, but if you want an amiable way to pass the time on a wet Easter Monday, the film is watchable","This, the last and probably least, of all big screen versions of situation comedies is made even more unfortunate by being released after the untimely death of Youtha Joyce. It is surely not a way she would have wanted to have been remembered. This follows all the established clichés of other sitcom adaptations: going on holiday, mistaken identity, and the involvement of incompetent organised crime (the main villain is occasionally seen bald and sometimes bewigged, no doubt a homage to Lex Luthor in the contemporaneous Superman film). A whole plethora of bit-part British actors of the period gives a slight pleasure since the viewers can entertain themselves with the \"What's his name? I recognise the face. Wasn't he in-?\" game. Otherwise this is a painful experience. The script is dreadful even by spin off standards. Everything here is lazy and more importantly, unfunny. Typical scene: A hit-man runs up a flight of stairs to kill George and out of breath, he talks to Mildred about his children, then takes the lift down only to run up again, spots George (by chance) but then not kill him. Its a drawn out and embarrassingly bad sequence and not remotely amusing. In the end, the villains chase George and Mildred in their car. We are told repeatedly they are going down a dead end. However the road (unlike the script) is not a dead end. After the villains have a cheaply shot and unfunny crash, the Ropers end up on an airfield which seems to be created merely so George can elicit the hilarious line \"He's flying a bit low.\"","G&M started a the odd couple downstairs in Man About the House and went on to amusing the nation in their own sitcom.What was the typical small-scale personal charm of the couples chemistry on the small screen, G&M's transferral to the big screen was as appalling as genuis's Morcombe and Wise, and countless fine TV shows.\nUnfunny.  Unsatisfying and featuring an ill Yootha Joyce who died before the film was released.","I've always found this film odd to watch as Yootha Joyce passed on before it's release and her last on screen moment being a wink to the camera before switching off the light heading upstairs (another series on TV was planned before her untimely death).Sadly the plot leaves the usual TV storylines (and for the most part excludes their neighbours the Fourmiles) for a mistaken identity plot (where George is mistaken for a hitman!).The guest cast can't help the film from being on of the worst sit-com spin-off films as well as being one of the final (with Rising Damp) damp squibs of the genre (Future feature length adaptations such as Last Of The Summer Wine and Only Fools and Horses would be TV specials).Sadly the end of an era in so many ways.",".......'The Who?''Yes, or them'That's the funniest joke in the whole film, but again, George and Mildred is an endearing film adaptation of the sitcom, because we all know a couple like the titular pair, and you don't really have to look that far sometimes.The plot is as thus, it's their weeding anniversary, and the restaurant where George proposed to Mildred sounds like the ideal romantic evening.But it's turned into a biker bar that serves all their food with chips and seventies smut.So Mildred decides they should have a weekend at the world famous London Hotel, where George 'hilariously gets mistaken for a Hit-man by Stratford Johns using a really awful accent, and wearing an even sillier wig.And that's the film.What struck me the most about this film was just how many people were literally killed in this adaptation of a family sitcom. I counted at least four people shot to death by Kenneth Cope, which sat uncomfortably with me for a film of this genre.Roper and Joyce are perfectly fine in their respective roles, and although it's an awkward marriage at times, they have wonderful chemistry.So it's a comedy of mistaken identity, much like 'Blame It On The Bellboy' and it's as British as meat and two veg.We have pratfalls, amorous blondes, threatening bikers with Love and Hate tattoos, car chases, and your token Spanish stereotype.It's pretty funny in a 'you won't laugh' sense, and it's quite sad that the last image in the film is the late Yootha Joyce breaking the fourth wall and winking at the audience....","In 1980, 'George & Mildred' went down the same route as its predecessor, 'Man About The House', and became a feature film. The original cast were retained, Peter Frazer Jones ( who had worked on the series ) has stepped on board again as director whereas Johnnie Mortimer and Brian Cooke relinquished their roles as scriptwriters and instead entrusted Dick Sharples ( creator of the Thora Hird sitcom 'In Loving Memory' ) with their duties. The film is generally despised by 'George & Mildred' fans, largely due to the fact that Yootha Joyce was ill during filming ( and it showed ) and sadly died not long after the film went on release. Well, I may be in a minority here but I liked it, better than the series itself in fact. At least the jokes used here were not ones already used in the series.It begins like this - Mildred is keen to ascertain whether or not her husband George has remembered their wedding anniversary. Needless to say, he hasn't. By the time he comes to remember, he books a table at the restaurant where he first proposed to Mildred but to his horror, he discovers on arrival that it has been turned into a greasy spoon café run by Hell's Angels style bikers.Later, at Mildred's insistence, George then books a weekend for two at a swanky hotel. No sooner have they arrived than George is approached by vicious gangster Harry Pinto ( who believes that George is a hit-man ) who instructs him to murder a rival crook.I think by now you can see where this is going. Yes, it is contrived, and yes, it is impossible to watch the film without cringing occasionally, but somehow it still manages to be endearing. Yootha Joyce and Brian Murphy were as marvellous as ever, particularly the former despite her ill health. The Fourmiles, played by Norman Eshley, Sheila Fearn and Nicholas Bond Owen aren't used terribly much here sadly, though Stratford 'Dixon Of Dock Green' Johns makes up for it. The film ends with George and Mildred returning home, having somehow managed to evade Pinto and his angry mob ( as well as Pinto's rivals ), talking affectionately of their weekend away before heading upstairs to bed. A caption - ''The End, or is it the beginning?'' appears on screen prior to the credits, hinting that another series was on the cards, however this plan collapsed when Joyce died from liver failure just four days after her 53rd birthday.Les Reed supplied a lively theme tune for the film, a great improvement over Roger Webb's dreary theme used for the series. Kenneth Cope, Sue Bond, Dudley Sutton and Michael Angelis all appear in supporting roles.Earth shattering? Hardly, but it is nowhere near as bad as many make it out to be. It makes for simple, unassuming entertainment, best enjoyed with a cup of cocoa. Funniest moment - One of the bikers at the cafe makes a pass at Mildred, so George in anger asks him outside for a fight. As the man is twice the size of George, Mildred covers her eyes at the thought of George getting beaten up. However, moments later the man re-enters the cafe with his clothes in tatters, as though George has given him a good hiding. Mildred is not stupid however. She soon susses out that George has paid him to feign being beaten up.Second funniest moment - George getting suspicious about Mildred's behaviour towards him so he wonders if she has been gossiping about him to Anne. He asks Jeffrey: ''Has your missus said anything about me?''. ''We don't discuss you, it encourages Tristram to pick up bad language!'' replies Jeffrey.","GEORGE AND MILDRED is one of the last-gasp British TV spin-offs that were made during the 1970s. Initially Hammer helped to popularise the cycle with their successful ON THE BUSES trilogy, and before long we had movie adaptations of pretty much every popular TV series going.I never actually watched the TV show GEORGE AND MILDRED, but I gather it was substantially different from this rather lacklustre vehicle for the stars. Brian Murphy and Yootha Joyce are transported from their surroundings and plonked down in a luxury hotel, where all manner of supposedly humorous situations arise, like Murphy being mistaken for a hit-man.The humour is of the sniggering, nudge nudge, wink wink variety, and not very funny to be honest. Except double entendres galore and some very lame character jokes. Murphy and Joyce try their hardest, but the paucity of the budget is rather apparent in the skid-row production values, and it's impossible to ignore the scene where shots are being fired point blank at a car window and it refuses to break. Old-time stars including Kenneth Cope, Stratford Johns, Harry Fowler, and a likable Dudley Sutton (who references his role in THE LEATHER BOYS) play in support."],"review-user":["Theo Robertson","manchester_england2004","Bwim","Spikeopath","dhsb58","jancyclops","timothyblack","canndyman","glenn-aylett","son_of_cheese_messiah","shemsuapep","kittenkongshow","FlashCallahan","RaspberryLucozade","Leofwine_draca"],"review-date":["25 July 2005","9 January 2009","9 September 2006","25 April 2014","1 July 2004","18 January 2004","3 January 2002","24 August 2017","9 April 2012","25 April 2011","29 July 2001","18 February 2018","2 July 2017","26 May 2015","27 February 2016"],"review-rating":["4","2","3","5","6","4","5","5","1","1","4","6","8","4"],"review-title":[" Has Nothing In Common With The Series\n"," Abysmal movie adaptation of a classic British sitcom!\n"," Wheres Johnnie?\n"," Maybe they have a punk version by the Sock Pistols?\n"," From Small Screen To Big\n"," Pretty awful!\n"," Failed attempt to move to the big screen.\n"," A sad end to a wonderful series\n"," Bearable for a wet Easter Monday\n"," Sad swansong of the 70's sitcom spin off\n"," Dreadful.\n"," Sad end\n"," They might have a punk version by the Sox Pistols.......\n"," George & Mildred's Final Frolic!\n"," Tired and not very funny, if I'm honest\n"]}