{"review-url":["http://www.imdb.com/title/tt0167059/reviews"],"review-text":["This film is an absolute work of genius. It blends little bits of laugh-out-loud humor, with lots of really great satire, and commentary on the whole issue of the apocalypse and the millennium. The camera movements and tricks take a few minutes to get used to, but after that they add to the feeling that this is no ordinary, bland movie, and give a sense that what is happening is completely farfetched and fantastical, and at the same time very very real.One of the best i've seen!!!!!!!!","Hal Hartley entry into a European film series is one of his two or three best efforts to date, and, lucklily, one of the few available on DVD.  At only 63 minutes running time, my only quibble would be with Hartley I always leave wanting more, but never so much as this time.  Martin Donovan is astonishing as Jesus.  PJ Harvey is beautiful and interesting as Magdelena, but the high point for me was Thomas Jay Ryan (Henry Fool) as Satan. Hartley gives him excellent dialogue and a chance to use his resounding voice to full effect.  Look for three scenes in which a microphone awaits him, as if a poetry slam is about to be won by the devil.  I have read other comments on this film and had to add mine because there is not enough praise going around.  If you like Henry Fool, Martin Donovan in anything (Opposite of Sex), and/or very clever comedies based on biblical ideas, get this as quickly as possible.","Unable to find a rental, I broke down and bought this film, and am delighted that I did. I've seen Martin Donovan only once before, in Onegin. I thought he was British! Surprise! There are so many great scenes and lines in The Book of Life, it would be impossible and unfair to list them all and I couldn't do it justice anyway. Jesus is portrayed as happy to be back among human beings helpless as they (we) are; he's compassionate, but weary of the job he's been charged to do. Who wouldn't be? And, God's kicked him out of heaven, for some reason which was not clear, or perhaps I missed. Another reason to be weary! Jesus and the devil have it out in a most amazing scene. Listen carefully, there are some great lines that are almost thrown away. I have one complaint that has to do with a common and incorrect reading of Scripture. Mary Magdalene was not a prostitute. She was possessed by demons which Jesus cast out, but she was NOT a prostitute. That was another woman.. .This was also my first Hal Hartly film, and while I loved the antics, and interesting movements of the actors, the soundtrack, (P.J. Harvey singing \"To Sir With Love\" in the record store with music blasting in the background!) I was a little put off with the \"ethereal\" camera work. It definitely worked for certain moments, but I felt that it was somewhat distracting, and I wish this technique had been used a little less. I'm one of those whose optical nervous system can't handle broad sweeps or quick, jerky movements of camera work. Otherwise I give this film top rating, and am a new Hal Hartley fan.","One of the many speculations about Y2K was that the world was going to end at the stroke of midnight on December 31, 1999.  In `The Book Of Life,' writer/director Hal Hartley takes a look at the possible ramifications of a new millennium Armageddon, beginning with the return of Jesus to Earth on New Year's Eve, 99.  The story examines the task of the Son of God, who must open the remaining three of the seven seals contained in the Book of Life (now contained in a Mac laptop computer), in which there is also the names of the one-hundred and forty-four thousand good souls who will be spared on the last day.  Jesus (Martin Donovan), along with Magdalena (P.J Harvey), arrives in New York City to make the preparations necessary for carrying out his Father's will, but he begins to have second thoughts; must he judge the living and the dead?  Do they deserve what must befall them? It is a cup He would prefer not to embrace at this particular moment, which gives encouragement to Satan (Thomas Jay Ryan) who fears that the fruit of all his hard labor is about to be washed away at midnight, for he can only continue his work so long as there are people around who cling to their pitiful hopes and dreams. \tAn artistically rendered, high concept film, Hartley presents the story in an intelligent, thought provoking manner, taking great care in dealing with the sensitive subject matter so as to make it inoffensive even to the most ardent fundamentalist.  The dialogue between Jesus and Satan is intriguing and stimulating, as is the effect of their presence upon those they encounter during their corporeal stay in the city.  It's an engrossing meditation on the spiritual side of Man's fragile existence and a contemplation of that which has been prophesied in the Revelations of St. John in the Apocalypse, the last Book of the New Testament.  And there is logic in Hartley's approach to the Second Coming; he maintains the aesthetic of the contemporary setting while employing altered film speeds which visually give the film an ethereal quality.  Christ inconspicuously wears a suit and tie, effectively blending in with the populace, while Satan's attire is a bit more casual, his appearance somewhat scruffy; he sports a bruise above his left eye. \tDonovan is well cast as Jesus, lending a benevolent mien and a sense of restrained urgency to his character that is very effective.  It is, of course, a unique portrayal of The Saviour, and possibly the best since Max von Sydow's in `The Greatest Story Ever Told.'  He successfully conveys a feeling of inner peace and tranquility, of serenity, that is the essence at the very core of the character.  And Ryan is thoroughly engaging in his role of the Prince of Darkness; he has a distinct manner of speech and a resonant quality to his voice that make him absolutely mesmerizing to watch.  His eyes are darkly penetrating, a trait he uses effectively with furtive glances and captivating stares.  He's the guy who could sell you anything in exchange for your soul before you ever knew what hit you.  It's a memorable performance that contrasts so well with Donovan's portrayal of Jesus. \tThe supporting cast includes Martin Pfeffercorn (Martyr), Miho Nikaido (Edie), Dave Simonds (Dave), D.J. Mendel (Lawyer), James Urbaniak (True Believer), Katreen Hardt (Lawyer's Assistant) and Anna Kohler (Hotel Clerk). In his own, inimitable style, with `The Book Of Life,' Hartley has crafted a perspective of the last days that is interesting, entertaining and truly unique.  He has a way of capturing life as it is just off center, a method which works especially well with a film like this.  Comparatively short for a feature film (running time of 63 minutes), it nevertheless is one of Hartley's best, and more than worth the price of admission.  It's a film that will stay with you and perhaps make you think about some things you may have tucked away in a corner of your mind for later.  And that is part of the attraction of this film; it makes you realize that `later' most likely is now.  I rate this one 9/10.","I just saw Hal Hartley's 'The Book of Life', and while not out-and-out my favorite Hal Hartley film, it has all the charm one can expect from his work.Another reviewer complains of \"predictable\" and \"unbelievably straightforward\" (not sure what he means) jokes, and a plot that \"rumbles on from one event to the next\" (again, not sure how that is bad), but this is not a plot-driven or joke-driven film. It is idea-driven, and brilliantly so, as most of Hartley's films are. The film is only a few minutes more than an hour long, but it has more ideas contained within it than most feature length films. Even though he claims that \"Hal\" ought to have known better, and relays his experience that acting in Hartley's films is \"peculiar\", the other reviewer does not seem to truly be familiar with this director. If this person was, it would seem less likely that they would denigrate the performances in the film, which are quintessentially Hartley-esque. Martin Donovan, who is a treat to watch in any film but particularly in his element when working with Hartley, plays a disillusioned Jesus, who has arrived in New York with his assistant, Magdalena, on the eve of the millenium to open the final three seals on the book of life, and reluctantly unleash the Apocalypse. Satan, played by 'Henry Fool''s Thomas Jay Ryan, is also lurking about in NYC, continuing to trap souls, and grousing about the coming apocalypse, albeit for different reasons than Jesus. Although Jesus and Satan are iconic characters, this film, as one would expect from a Hal Hartley scenario, chooses instead to base it's characterizations of them on their human qualities, placing them under, rather than outside, the influence of humanity. I believe that anyone who appreciates Hal Hartley's work, or who appreciates  smaller, more thought-provoking films, would find plenty to rejoice about in \"The Book of Life\".","This movie is one of a kind.  All of the Hal elements are there.  Dramatic pauses, unique camera work, off beat score, memorable one-liners (Satan: \"Natural disasters...very profitable\").Even Martin Donavon as the tortured J. Christ who suddenly realizes that revenge is not redemption. There is a humorous scene where Satan and Jesus meet at a bar, do a couple of shots, and discuss the future of the world. To some (Christians), this movie may seem a bit blasphemous.  But that is because they are too busy putting Jesus on some pedestal while forgetting that the Bible says he was just as much a man as a god. And the Mormons love it, even though Jesus questions who they are in the film. Looking forward to Hal's next full length feature, No Such","The whole recontextualizing of Christ is just killer subject matter. Once you get past despising or evangelizing ancient religious texts, they are a wealth of great metaphors, characters, plots and paradox. PJHarvey here is super junky-sheik petite punk-rock eye candy- with a biblical twist. The idea was kind of a Svankmayer meets Bukowsky perspective on the cataclysmic turning of the millennium- a great concept. Didn't quite pull it off though. The proof is always in the surprise sense of irony in the ending, and it just didn't have it.","In The Book of Life, Martin Donovan plays Jesus, who shows up at JFK airport on December 31 to usher in the new millennium by battling with Thomas Jay Ryan (Satan) and deciding the fate of the world. There is also David Simonds (Kurt the accountant from Amateur) as a compulsive, homeless gambler.As usual, Hartley creates a surreal world in which the beauty of the ordinary made strange and otherworldly flows through artfully-framed scenes and urban/industrial landscapes filled with dazzling light and shadow. As usual, he introduces seemingly incidental details early, then brings them back later in hilarious and unexpected contexts--the humor is simple, but giddy and irrepressible. Hartley has an amazing ability to build toward small and rapturous moments of the simultaneously mundane and outrageous. As usual, he creates a tone that is jaded and world-weary but at the same time, vulnerable, open, and honest.  He moves within minutes from uproarious humor into language that is metaphysical and poetic-the kind of writing that is so dead-on and perfect that it's difficult to hold back tears despite the lack of obvious emotion. Another awesome and highly entertaining film. The Book of Life is shot (a digital camera?) with a blurry effect: a sense of the celestial hand-in-hand with impending doom and a hyper-awareness of the present as fragile and fleeting in it's last moments.  All of Hartley's films have a way of prioritizing the present, but this unique effect compounds it as the images wash across the screen in a way that is at first jarring, but becomes increasingly beautiful as you settle into it. The final shot is spectacular. All this may sound precious, but the film is a comedy and it makes fun of itself even as it makes fun of the concept of Armageddon, Judgment Day, and `urbanity.' Although it is actually quite profound, moving, and life-affirming, it is for the most part lighthearted and playful. The acting is flawless in terms of the kind of the subdued tone that Hartley has developed in his films (a tone that some people don't get and that prompts them to judge such acting as hollow--the same people who have a negative response to Peter Greenaway). As always, there are bound to be people who respond to this film with cynicism and scorn-people put off by Hartley's abrupt shifts and what they see to be pretentious or mannerist techniques, but who has time to consider the opinions of such dull and callous fools? Anyone who is a Hartley fan will love this film-if they can get a chance to see it, that is. It's hard to say what it would be like on video.","I taped this movie and have inflicted it on everyone who's come to visit me. I love it very much.  I loved Martin Donovan as Jesus and I REALLY loved Thomas Jay Ryan as Satan.  In our house we quote movies all the time. I spent a month quoting Satan.  I guess as a writer I look a little deeper into these things, but I truly loved it.  I loved the constant movement of the actors, the odd angles, the digital blur, and the soundtrack.  The microphones in strategic places for Satan were great too.  A movie that knows its a movie.  Very cool.","Though not Hal Hartley's best work (my personal favorite is \"Surviving Desire\"), there is still much to like about this movie, especially for fans of Hartley's dialogues. Even to audiences new to Hartley, I would definitely recommend this movie over the sophomoric \"Dogma.\" This movie is more intelligent, truer to its source material (the Bible), and more fun than any of the other pre-millennium apocalypse movies. This movie is actually part of the French \"2000 As Seen By.\"  (2000 Par Vu) series; as such, it is perhaps even a lower-budget film than Hartley's other works. While the need for simple scenes shot with digital camera is understandable in this context, the main problem with this movie is the unfortunate overuse of the blurry/jittery effect. I'd be happy to never see this effect used in a movie again; especially at the beginning, it almost makes the movie unwatchable. But overlook this flaw, and you'll be treated to a fine film. Especially notable is Magdalena (played by P.J. Harvey) relating how Jesus saved her from being stoned to death; a short scene I found surprisingly moving. (Despite the fact that it was NOT Mary Magdalene that this happened to; the woman in the Bible was unnamed.)","This is my favorite Hal Hartley movie. All his movies are small gems. I love independent movies and I hope Hal Hartley never goes mainstream or sells out. What if the Lord Jesus did come back and loved his people so much that he could not open the final book and destroy the unbelievers? It was nice to see P. J. Harvey in a movie since I am a fan of her music. Don't watch this if you are a fan of cookie cutter Hollywood movies, you will be disappointed.","This film is probably Hal Hartley's best one. The subject, of a unusual originality, is treated (that's usual with Hal Hartley) with great humor. This characteristic isn't at all the only quality of this film: the fussy frame composition (everything is parallel, until the smallest details), shooting angles, lighting, giving a more supernatural dimension to these blurred images (Jesus' coming down couldn't be filmed in a conventional way), the falsely \"poser\" acting, are qualities that make this Bible re-reading, carried out in the form of an apocalyptic delirium, essential.","This 1-hour 30-minute inside joke is best understood by Catholics, the number one religion of self-medicating comedians the world over. That isn't to say it can't stand on its own which it does, that the film isn't without its flaws, which its got. Technical issues, mostly: Belief that in 1998 digital was the answer when in fact it was in its infancy - a Beta of a Beta if you will, and re-mastering will never improve it. For the love of God, Hal...please get yourself a Red One. Or three.If you like Hartley films of course, you'll like it. I liked it, because I liked Grim/Fool, and there were added benefits of retrospect: I couldn't help noticing a disturbing self-prophecy, an airliner soaring overhead, used as a harbinger of Armageddon in this 1998 movie. It was as if Cheney had gotten the whole idea from Hal. It's true - Hartley moves his players round into the camera like it's the House of Commons, just one piece of the gimmickry that needs a rest. After all, we're already paying attention to the actors, and the writing is alive. Not great writing, but...fervent. Can I use the word fervent? Purposeful, intelligent, not condescending.Absolutely love PJ Harvey in this, course I'd love her anywhere. Oddly, if Helen Mirren needs a younger self, she should look Harvey up and bring a bottle of blond.","One of my favorite Hartley movies. (As if there could be a \"bad\" one.) Although, this may be a bit more on the religious side of things than we would normally expect. Nonetheless, it still maintains that Hartley slant to which we've all become accustomed.First picture Jesus and Satan discussing their ideas, opinions, hopes and regrets about the impending end of civilization. Now imagine the entire conversation taking place over a few drinks in your neighborhood bar. And as an added conversational (not to mention visual) distraction, let's toss in PJ Harvey as the sultry companion (aka Magdelena) to Mr. Chist. Then, just for grins, in the background, an ever present Salvation Army Band (played by Yo La Tengo) to serve as an added diversion. The road to moral justification has never been such a pleasure.Quite possibly more questions than answers, but therein lies the fun. And Mr. Donovan is subdued brilliance, as always.","Hartley on low-key form: Martin Donovan, born to play Jesus, comes as Messiah to millenial Manhatten; P.J. Harvey is excellent as sidekick Magdelena.  A slight film, but drily amusing, short and sweet.","The Book of Life was rather like a short snack, whetting the appetite for Hartley's next full length movie.This movie doesn't need to be seen on the big screen, watch it with a few friends who are Hal Hartley or Wayne Wang fans, or better still, try to convert some newbies.","While the camerawork was certainly \"funky\" - perhaps one dutch-roll short of \"stoned\" - the premise of the film was fantastic. It really took a scathingly satirical (in the true traditional of Hal Hartley) look at God, Jesus and Devil. The interaction of Jesus and Satan provides some hilarious scenes... Even the monologues of Jesus were great - this was by far the best Jesus I've even seen. So laidback, Zen-like, Son-of-God-ish but still such a nice guy. On one level this is a very general look on the paradoxes of Christianity, but yet there is still a personal level, where you can relate to Jesus Christ without having a God-Complex (thanx to Martin Donovan and Hal Hartley).","Hal Hartley has been likened to a modern day William Shakespeare, by virtue of the fact that he gets his actors to deliver their lines in an iambic pentameter.  He certainly knows how to assemble a cast and once again Martin Donovan is sensational, whilst Thomas Jay Ryan plays his role with an intensity that is unforgettable.  Although the film is only 1 hour, the time frame works wonderfully and keeps the audience on a fast tracked race right till the very end.  Without a doubt Hal Hartley is one of the best directors to come out of America in the last 20 years, with a vision that is unique, funny and heart warming.","The promise of Martin Donovan playing Jesus was, quite honestly, enough to get me to see the film.  Definitely worthwhile; clever and funny without overdoing it.  The low-quality filming was probably an appropriate effect but ended up being a little too jarring, and the ending sounded more like a PBS program than Hartley.  Still, too many memorable lines and great moments for me to judge it harshly.","Hilarious film about divine retribution. Camera work stinks (shot on digital video) and looks like early MTV videos. Turn the other cheek by looking past the visual and concentrate on the story. Laughs galore for those with a well-developed sense of irony.","This movie was shot using a digital camera, and it shows. There were enough annoying digital tricks used to alienate the viewer, also with the help of a terrible score. As if that weren't enough, the acting was also terrible. Now in Hartley's movies the acting is always peculiar, but here it was just BAD, especially by Satan (Thomas Jay Ryan)and Harvey, who (thank god) doesn't get to say much. After all these external problems it is also very unfortunate that the story itself is not that good, either. The jokes are predictable and unbelievably straightforward, and the events just rumble on from one incident to the next. The so-called book of life with Armageddon inside isn't much more than an excuse to see actors struggle to say their lines. All in all this movie is a waste of time and money and effort. Thumbs down.","This film was made at a point when perceived walls between the real and the virtual were starting more obviously to crumble; and it titrates some of Hartley's continuing substantive and stylistic concerns into old and new archetypes. I haven't seen it for a while, need to watch again; I expect it would feel prescient. PJ Harvey as Mary Magdalene is, for me, a significant bonus (but all the acting's great).OK IMDb requires me to add 4 more lines. The visuals are great. The dialogue is great. The details are significant. Time in the abstract as well as history and what we tell ourselves about them are substantive concerns, among others. The perhaps ineluctable connection between creation and destruction. P.S.: I personally do not read this as being particularly about Christianity per se.Let's see if that's enough.","The Devil and Jesus discuss the end of the world on the eve of the new millennium. It's like a more humanistic and clever version of \"Dogma\" with lots of shaky, blur streaked Wang Kar Wai-ish digital camera work. An enjoyable experiment, but not as effortless as Hartley's earlier films. I still haven't a movie by him I haven't enjoyed. Martin Donovan as always delivers the deadpan dialog and rock starlet P.J. Harvey backs him as Magdalena his assistant (completely platonic). I think the woman whose soul get's sold is Hartley's wife. It does however benefit from a short time, never lingering longer than it needs to or wasting any time. I give it an extra half star for knowing when to close shop. A good sense of timing is important.","I happened to quite enjoy this film.  I wouldn't call it a great film, but I liked it all the same.  The religious imagery and blatant biblical references only made this film more funny.  The film was clearly showing what was in essence a secret war.  The jokes are something else.  Mormons in a shootout with a law firm.  Lawyers as Gods personal favourites.  Satan winning a womans soul by a lottery ticket with the numbers 12 31 19 99 (the millennial eve for those who don't know).  Ok, the camerawork leaves a lot to be desired, but hey, the film is still a good'un.  The soundtrack is something I happened to enjoy, and PJ Harvey as Mary Magdalena highlights exactly why she should stick with music (her singing scene is better than the rest of her role).  So if you want an off-beat film about the millennium without the what-if boll***s you often get with it, see this film.  I would","It opens - and for half an hour, runs - like an educational programme on the Old Testament, although not without humour. The movie finally begins to grow wings when the biblical cant gets dropped. In a scene of mixed success Martin Donovan (Jesus) decides to renege on kicking off the Apocalypse and the final quarter of an hour is a sort of humanist 'what's all the fuss about?' play-out, gilded with optimistic conjecture against a (retrospectively, miserably ironic) long shot of the WTC twin towers.Apart from Donovan's authority, the acting is split. There's the thespian melodrama of the rest of the cast: this, though formally contrived for biblical presentation, is appropriate for the modern, paranoid comedy that Hartley's aiming at. But I was also pleasantly surprised at the contribution of PJ Harvey (credited thus, and in danger of existing within the film solely as the pop star entity she is, not least in a set piece scene in a record store and a perilously patchy soundtrack to which contributes). She remained cool - a sort of disingenuous lack of focus - in the manner of many pop icons who have taken to film (I'm thinking the Jagger of Performance here) but nonetheless maintained a convincing integration with both cast and project.Ultimately affirmative, but this bittersweet essay is a bit too much like one and relies more on the perseverance than the imagination of its audience. 4/10"],"review-user":["dmagidor","Arcana13","deedee2005","jhclues","notatallmike","meanmrugly","Autonome","Miami-4","b.p.gardiner","lyberty","hurkeybyrd","Sam-240","deckard-19","baskerville-2","paul2001sw-1","jaston","Gisarme","Avi-5","calvarez","spike2-2","D Throat","carolyn-158","loganx-2","tamanui","Framescourer"],"review-date":["13 November 1999","6 May 2001","2 May 2001","5 March 2001","14 November 2001","7 November 2001","9 August 1999","24 March 1999","28 January 2000","30 September 2003","4 November 2001","28 January 2000","9 September 2008","16 August 2005","8 December 2002","11 November 1999","27 July 1999","26 July 1999","3 April 1999","20 December 1999","16 February 1999","19 November 2015","9 May 2010","19 July 1999","20 October 2004"],"review-rating":["10","9","10","7","10","9","8","8","7","8","9","10","10","10","1","10","7","4"],"review-title":[" Excellent!!!!\n"," Excellent, almost made me like Christianity\n"," Provocative and funny\n"," The Gospel According To Hartley\n"," The previous review does a disservice\n"," Hal's finest\n"," Cute and Hip\n"," Another amazing Hartley film ...\n"," Hey, Hal Hartley got a whole family as new fans 'cause of this one.\n"," Much better than \"Dogma\"\n"," Hal Hartley can do no wrong!\n"," Jesus comes down on earth to renegotiate the Apocalypse terms... A masterpiece!\n"," The Year 2000 as seen by Hal, his upbringing & a few fellow travelers\n"," Well worth searching out.\n"," Born to play Jesus\n"," We've had Hartley at length, here he is now in short.\n"," I luv Jesus (And I'm not even a Christian)!\n"," Another masterpiece from a brilliant mind\n"," Typical Hartley clever\n"," It's the second coming and god is p***ed\n"," Hal should have known better\n"," One of my all-time favorite movies.\n"," Closing Time\n"," Pretty good for a religious piece\n"," It's a dry read\n"]}