{"review-url":["http://www.imdb.com/title/tt0117038/reviews"],"review-text":["It has been quite some time since I last saw this film. However, the amazingly low IMDB score has prompted me to jot down a few thoughts and memories I have regarding this under-appreciated masterpiece.I find it appalling that this film would score so poorly in this arena. It is a wonderful, life affirming story with a positive message. Perhaps this is what we have come to. The comedy is not gross enough, the message too sentimental and the meaning too simple for modern \"sophisticated\" audiences. Well, I for one, absolutely loved every minute of it. It is easily Andie MacDowell's best performance. William Hurt is fantastic as the cynic who comes around in the end and the whole supporting cast does a wonderful job. Of course, John Travolta is superb. This is one of my favorite roles Travolta has played and it is simply resplendent. I would have to say this is in my top twenty of comedy-dramas ever. I just happen to love the way the film unapologetically illustrates how wonderful life is. How even the little things that we take for granted, like pie, are fantastic and how we should enjoy every minute like it was our last.For a much more detailed and well written review see the fine work of jhclues who echoes my feelings about the movie so much that I feel it would be redundant of me to restate, probably poorly, all that they have already committed to page.It is also interesting that so many people really hated it. I wonder if they weren't just put off by the \"less than traditional\" view of a religious subject.","Possibly the best John Travolta role ever. Saturday Night Fever was a great movie & role, but a LONG time ago. I can't think of many of his movies or roles I've even liked, and it's easy to think of rotten ones. He can do meanies like in Pulp Fiction, but he makes the perfect funky angel, and it's hard to imagine anyone doing a better (equally slobby) job with it. Plot summaries are available everywhere, but the plot isn't the point. Just go for the ride and enjoy the cleverness of the little funnies along the way. There is nothing to dislike about this movie, unless one is searching for something profound. I wish there were more movies like this. We need a break from deep or awesome or grisly or complex or hysterical.","I really enjoyed this movie for what it is: A funny little film that doesn't take itself too seriously. Plot summaries are available everywhere so I won't go into details. Michael isn't about a complex plot anyway. It just builds on a great premise and takes the viewer on a wonderful road trip.John Travolta's performance as a chain-smoking, lady-loving, bar-brawling, pie-eating angel is just perfect. And who doesn't love Sparky?Watch this if you want to have a few laughs and a overall good time. Highly recommended.","1996's MICHAEL is warm and winning comedy-fantasy that features one of my favorite performances from the John Travolta library. Travolta gives one of his breeziest and most likable performances as Michael, an archangel whose quiet existence at the home of a lonely innkeeper named Pansy (Jean Stapleton) is disrupted when Pansy reports Michael's presence in her home to a \"National Enquirer\"-like newspaper and the editor (Bob Hoskins) sends reporters (William Hurt, Andie McDowell, Robert Pastorelli) to the motel to check it out. Hurt, McDowell, and Pastorelli are quite good as the jaded news staffers who have a hard time accepting they've met an angel but this is Travolta's show and he rules as the pot-bellied, sugar-eating, cookie-smelling, pie-loving, Aretha-loving, bull-chasing Michael, an angel who just isn't what you think you of when you think of angels. And you have to love the scene in the bar when he and the ladies dance to \"Chain of Fools\". I love this movie more and more every time I watch it and it's mainly because of the completely winning performance from John Travolta.","Angels are a bit of an American obsession, but are often rather boring. They are the messengers of God, and also the arc angels are great warriors (Lucifer being the toughest and best looking until he was kicked out of heaven).So what happens if you don't believe in anything, let alone angels and you are sent to investigate an angel story, only to meet one with wings and less than angelic attitude.Maybe that is what America needs, being a puritan is different from being good. Michael is a rude, obnoxious, womanizing messenger of heaven who will fulfill your wishes, and make you care enough about the world that you will be touched.Funny, but not greatly so, touching but not overly sentimental, intelligent without being clever...it is just a good simple, small comedy. Watch on a lazy Sunday afternoon.","Wow, I think the overall average rating of this film on this site is incredibly low. There's really no reason to dislike this film. \"Michael\" is a simple, but fairly original, and easily enjoyable romantic comedy. The plot involves a group of reporters/experts going to examine the mysterious appearance of an angel (John Travolta) in the midwest. The angel proves to be less saintly and more worldly than we would expect, and that's what makes it entertaining. His interest in women and the Beatles takes a new spin on the angel thing. The romantic side of this film involves Michael the angel trying to get Andie MacDowell and William Hurt together. The two of them may not have the all-time greatest on-screen chemistry, but they certainly have enough to make it work well. Everyone who has rated this film so low (a 5.4??), come on! The film is not that bad. In fact, I found it quite funny and memorable. Sure, it's not the best thing you'll ever see, but it's still good. This is a film I feel has been remarkably underrated. It's fun, romantic, and recommended by me.*** out of ****","John Travolta was excellent as \"Michael\" in the movie by the same name. I don't think a better portrayal could have been done. The movie was funny, yet touching. Michael is a very \"human angel\" (If their is such). Andie MacDowell is superb in her role as a reporter, as she goes from disbelief to belief. Bill Hurt and Robert Pastorelli are great as fellow reporters, each bent on proving the hoax of the angel on earth. Each of the supporting cast is wonderful, especially the older woman (I do not know her screen name), who plays Michael's mother! One of the cutest movies I have seen in years... I could watch this movie dozens of times!","in this, yet again, Nora Ephron pleaser. How can you not sniggle, laugh, guffaw and even cheer for a love-handled, smoking, suger-eating, beer-drinking, bull-charging, bar-dancing Archangel who sloops cereal and pie with his whole left-hand wrapped around a spoon-handle while outfitted in Vinnie Barbarino's middle-aged body with wings? It's one of the most ludicrous, classic, side-splitting images available on the silver screen. And if you don't 'get' that image, here's a quarter --- go buy yourself a life.I found the supporting cast, well -- well-cast. Hurt, MacDowell, Pastorelli, Hoskins, Stapleton et al played the characters they were given to a 'T.\" And despite Travolta stealing the show, those characters are quintessential to the storyline  you'll see. Though this is a simple feel-good story (nothing complicated to follow, just out of the ordinary) with laughs, sniffles and a touch of heart, you can't get out of this without some introspection into your own life. Maybe that's why the IMDb nay-sayers of this film have such a problem with it (you poor, sad people).Please  do yourself a favor, ignore the 'lifeless' and treat yourself to something GOOD. Lord knows, we can't get enough of that","Warm hearted flic depicting arch-angel Michael as a brawling, overweight, cigarette smoking slob who loves to dance and cavort with the opposite sex. He does have a good side, however, as he strives to set things right in the lives of a couple of burnt out losers before being recalled to heaven. Funny, well played out film; very enjoyable although somewhat irreverent.","This is one of my favorite \"Capra-esque\" comedies. This movie is just meant to be enjoyed, not deconstructed, microscopically analyzed. It's not religious commentary. It's fun. It's fantasy. The surprisingly negative comments (IMHO) reflect a level of expectation that professional film critics have led us to think must be a part of every movie.Others have described Travolta's role (it's the reason you'll watch the movie over and over) and the excellent supporting cast (including Sparky!).Sometimes a cigar is just a cigar; sometimes a movie is just fun.Enjoy!","Director Nora Ephron, whose forte is romantic comedy, takes a slightly different tack with this comedy/drama, which is certainly romantic, but with a bit of a twist; because this one relies somewhat on divine intervention as the means by which some people who have seemingly lost their way are finally steered in the right direction.  Or `a' direction, at least; for when it comes to life and love, who really knows?  And the real question is, does it make a difference if you believe in angels?  A possible answer lies in Ephron's entertaining and ultimately touching film, `Michael,' in which she asks you to be a believer; and if you can, it'll loose the magic upon the screen and you'll be treated to a satisfying cinematic experience, courtesy of Ephron's insights into human nature and a guy who just may or may not be one of those most ecclesiastical of creatures, an angel.\tWhen Frank Quinlan (William Hurt), a reporter for a national tabloid based in Chicago, gets a letter from a woman in Iowa named Pansy Milbank (Jean Stapleton), who claims that an angel has been living with her for the past six months, Frank's editor, Vartan Malt (Bob Hoskins), dispatches him forthwith to the woman's residence, the Milk Bottle Inn (which she owns), to check it out.  Accompanying him is fellow reporter Huey Driscoll (Robert Pastorelli), and a newcomer to the team, Dorothy Winters (Andie MacDowell), who is supposedly an `expert' on angels.  What they expect to find when they get there is anybody's guess, but if it's someone with a halo and the proverbial `inner light,' they are about to be sorely disappointed; because when they finally meet Michael (John Travolta, complete with wings-- but are they real?), he's, well, as Michael tells them right off, himself, `I'm not that kind of angel--'  And for Frank, Dorothy and Huey, it's the beginning of a journey of sorts, as they endeavor to take Michael back to Chicago with them, hoping to learn all they can about him along the way.  But, more importantly, learning some things about themselves-- and each other-- at the same time.\tBy due process and by citing previous works of excellence-- like `Sleepless In Seattle' and `You've Got Mail'-- Ephron can stake a claim to the territorial rights of Matters-of-the-Heart stories and win, hands down.  Wry and subtle observations on love and relationships are her trademark; she knows how to make her characters and situations credible, and moreover, how to present it all in such a way that it makes a real connection with her audience.  She makes it look easy, but make no mistake, there's a fine art to what she does.  The fact that she can not only entertain, but touch her audiences in film after film, clearly demonstrates that she's got what it takes to create and deliver a movie with some real substance, coated as it may be with some light-hearted sentiment (just call it the icing on the cake, if you will).  And a big part of her success comes from knowing what makes her characters tick, and making them people with whom the audience can identify and relate.  Even when the story is a little bit quirky and just slightly off-center, as is the case with this film.\tJohn Travolta as an angel?  Well, make that an `Arch'angel, and not just any old Archangel; this is Michael, the very same angel who fought Beelzebub and cast him (so he claims) from Heaven.  And, as embodied by Travolta, this is Michael, the warrior, who exists to do battle with any enemy and put matters to right-- and Travolta makes it work by creating an `angel' like none you've ever seen before.  His Michael is rather unkempt and slovenly, he smokes and has a penchant for sugar.  He also likes to laugh and dance, and he appreciates the wonders and the beauty of the earth.  Whoever he is, there's a depth of humanity there, which Travolta manages to bring to the fore of what turns out to be a rather complex and challenging character. It's a solid performance by the charismatic Travolta, who makes Michael a truly memorable character, and in turn, a memorable film.\tHurt does a good job, as well, as the jaded Frank Quinlan, a guy obviously looking for something, but unaware of what it is, or even that he is, in fact, searching.  Hurt successfully captures the laconic essence at the heart of his character, but tempers him with just enough spirit to keep him interesting, and a person who, though not necessarily likable, is one you come to feel is at least salvageable as a human being.  In the end, he actually becomes someone you can root for, though initially Frank is rather off-putting.  The important thing is, Hurt presents Frank in a way that touches a nerve, and it demonstrates that connection Ephron makes with the audience through her characters.\tMacDowell gives a strong performance, too, though rather retiring and less than spirited; but then again, that's who her character is, and she plays it quite well.  Dorothy, like Frank, is a person at a crossroads; the difference is, she's lost and she knows it-- and it gives her an endearing quality that gains the sympathy of the audience, and makes her someone for whom you want to see things work out.\tThe supporting cast includes Teri Garr (Judge Newberg), Joey Lauren Adams (Anita), Carla Gugino (Bride), Tom Hodges (Groom) and Wallace Langham (Bruce).  In the end, whether or not this film makes you believe in angels is a moot point, because `Michael' is an engaging film that reaffirms the indomitability of the human spirit.  And, if not angels, that is something everyone can believe in, or at least hope for.  It's Nora Ephron's way of saying that this old world is going to be around for awhile.  And it's good. It is, in fact, the magic of the movies.  I rate this one 8/10.","This movie is severely underrated. It has tons of charm and sincerity. There are many quiet details that make this movie worth watching -- enjoying, really. I have very high standards, and occasionally a movie is worthy in its heartfelt simplicity. This is really an enjoyable film, and if a viewer can just give one's inner critic the night off, it's truly an enjoyable ride.Watch it (again perhaps, with kinder eyes). It's worth it.Below is a repeat of the lines I've written above. I really don't feel like I need to say more, but IMDb requires at least 10 lines, so here you go...This movie is severely underrated. It has tons of charm and sincerity. There are many quiet details that make this movie worth watching -- enjoying, really. I have very high standards, and occasionally a movie is worthy in its heartfelt simplicity. This is really an enjoyable film, and if a viewer can just give one's inner critic the night off, it's truly an enjoyable ride.Watch it (again perhaps, with kinder eyes). It's worth it.","An off beat but very delightful performance by John Travolta sets off this very funny comedy.  His interpretation of the archangel is as a scuffy, womanizing, overweight, ladies man.  And, he certainly has a mesmerizing effect on the women he encounters on his trip to Chicago.  John Hurt is very low keyed in his role as chief reporter for Chicago Tabloid owner, Bob Hoskins.  Angie MacDowell plays role much as she did her role in \"Four Weddings and a Funeral.\"  Maureen Stapleton is neat in a cameo.  Her comment, \"Michael doesn't suffer fools,\" is just one of many memorable moments.  Bob Hoskins is the only one of the lead performers who fails to connect, a little to off the wall. Mainly you're there to see Michael take on a bull, mesmerize the waitresses and lady dancers at a western style restaurant, and fully demonstrate that he is complete free soul.  It is a memorable comedy that is worth more than one viewing.","Frank Quinlan and Huey Driscoll are reporters for a trashy tabloid paper who are on a bad run of bad stories. When their editor lays down an ultimatum to them, they bring him a potentially great story  a real life angel. They are accompanied by a supposed angel expert, Dorothy Winters who has really been sent to keep an eye on the reporters for editor Vartan Malt. When they arrive they find the 'angel' to appear to be genuine but to be a lot less, well, angelic than they expected him to be  smoking, drinking and womanising. Michael agrees to go back to Chicago and be in the papers but only if they can travel back by road and make stops along the way. As Michael gets his traveling companions in and out of trouble it begins to seem that he may actually have a bigger aim to achieve than just getting into the papers.In the UK it is not the 'done thing' to cheer, clap or deride films or trailers in a very public way in the same manner as US audiences will do as the norm (my first time in a US cinema was a surprise when the audience applauded), but it is the reason I will always remember this film. When the trailer was shown in the UK, the audience I was with actually jeered and booed it (myself included) because it just looked so damn lame and stupid. So I skipped it in the cinema (as many did) but then caught it on TV a few years later. Although it is far from a perfect film and its mood and tone are poorly matched it is actually nowhere near as bad as it looked. The story is the usual earthbound angel stuff that Hollywood seems to quite like and it meanders along rather aimlessly, turning into a very vague road movie of sorts. The romance is obvious and uninspiring but generally the film is fun when it manages to have it's tongue in its cheek.The problem is that it can't decide if it wants to be sappy and romantic or daffy fun. When it tries to be more of a traditional Hollywood romance it doesn't really work that well and indeed is rather laboured. However when it just gets silly and focuses on a really tongue in cheek Michael then it is much more enjoyable as long as you can buy into the sense of humour that it is selling. These two styles don't really come together and they give the film a rather fragmented feel that takes away from the fun (if silly) aspect that stood a good chance of really working if given a little bit more dominance in the film. Sadly the film falls back too much on sentimentality and it sours the mix because it is manufactured, processed, unengaging and quite forced.For the same reason the performances are mixed. For the most part Travolta is quite funny and just appears to be taking the p*ss and enjoying himself  the way he doesn't seem to take it seriously helped me enjoy the film a lot more. He is silly of course but I found this to be enjoyable in light of the more ponderous 'worthy' roles he has played in the years since his Pulp Fiction comeback. Lumbered with the promise of romance, Hurt is not that good but is nicely cynical for the majority of the movie; MacDowell is painfully lame at times and her character is pretty poor, she is a big part of the reason why it is hard to really care about the romance in the story. Both Pastorelli and Hoskins seem to have fun and share a handful of good lines throughout the movie while little roles for other well known faces vary between the effective (Joey Lauren Adams) and the simply pointless (did Richard Schiff really need work this badly?).Anyway, the film is not great but it is not awful either. It's mix of the sappy and the silly is pretty badly done and I was left wanting a more engaging romance and a lot more of Travolta's mockingly silly performance. All told it is maybe worth a watch once but it is far from being a good film and, if you don't like John Travolta's performance then there isn't a great deal else to watch it for.","This was more of a love story than one about an angel who comes down here to earth, although both angles of that story are given a good share of the movie.If I took this movie to heart, as someone who knows and believes the Bible, I would have canned it pretty quick, but I don't think the general atmosphere was either mean-spirited or blasphemous. It was just ludicrous or just plain stupid.I mean, John Travolta as a grubby angel? Smoking? Scratching his groin? Quoting the Beatles? A \"warring angel\" who knows nothing about Heaven? An angel who flirts with all the women? Yes, it's all absurd and certainly Biblically- incorrect. I could tolerate all that but I don't know how many people, whatever beliefs they hold, who could stand a boring film which this turned out to be during the second half of it. It begins to drag when the romance begins between William Hurt and Andie MacDowell. Some of the dialog during that romance is so stupid it's insulting to any discriminating viewer.This is another Nora Ephron-directed film. Man, I can't believe how many incredibly stupid movies this woman has either written or directed. At least she's consistent.","I remember when this film came out, the reviews were marginal. But after seeing it, I think this is one of the most original, well-rounded movies I have seen. I think Nora Ephron and the cast deserve a lot more credit.  Yes- he's an angel, and on the surface- the plot will sound corny, as some have mentioned. But once yousee it- you realize the real depth of the movie is their entire journey in the car together and how they learn to experience joy.  Ephron captures the 'slice of Americana' hilariously- as they make stops at the world's largest ball of yarn and non-stick frying pan. The best scenes of all are of John Travolta in the backseat of the car- laughing and truly enjoying himself. He is fantastic in this- when he waltzes to the 'sound of the Earth'  and his dance scene at Joe's diner. William Hurt and Robert Pastorelli are also very funny and natural together - evenbefore they meet Michael. Bob Hoskins adds a wonderful comedic element asMalt- their boss at the tabloid. The soundtrack is also well chosen.  If you haven't seen it- give it a chance. It's not your typical 'man sees the light' story.","This movie is so funny and smart. A unique movie with unique characters. Travolta plays a not so perfect angel, and I think what this movie showes is that who are we to tell how angels look like. Its not like we ever seen one. Watch this movie and your picture of an angel will change.","I liked this movie more than I thought I would, and after I realized what it was all about, I liked it even more. The movie wasn't about an angel, it was about learning to love, and that love when it's true can be angelic. And William Hurt portrayed this discovery in a very believable way.","\"Michael\" is a great film! John Travolta and Andie McDowall are superb! This is a funny and touching movie. John Travolta did a great job as being the angel \"Michael\". This is very good film! I give this film a 9 out of 10!!! :)","honestly, i loved Michael. although there were \"give me a pillow i need to take a nap\" parts, it was cool. i think everyone did a great job in this film. and nora ephron is in my \"ok\" list of directors.it's nice to see John Travolta as a pot-bellied angel. it's not very often i see one in a movie. some people might call this a boring movie, but for me i loved it. angels and all.","I've seen previous movies of Nora Ephron and I say she has a clever understanding and knows how to touch our deeper strings. Yes, Michael is an unusual angel, but what the hell!. It doesn't matter. What she tells us throughout all her filmography is that we all own the keys to live a joyful life, one based on our simple and primary feelings: the warmth of friendship, the joy of nature, the joy and sharing of every little moment, and the respect and caring for every other person outside us. I think this is an outstanding movie. Try it. You'll love it.","It's sweet and entertaining, and I really enjoy the scene where he eats breakfast and the one where he tells the dog \"Now remember, Sparky, no matter what they tell you, you can never eat too much sugar\" -- this being a maxim that I live by...It is a fairly typical Nora Ephron movie. She's not an very good director, more of an accomplished hack I think, but she does a workmanlike job and the movie has a much better cast than the script deserves. It's low-key fun.","I wanted to like this movie, but there is very little to like about it. It starts out with Jean Stapleton and a Randy Newman song in Iowa (Northwest Iowa, I guess), reminiscent of Norman Lear's Cold Turkey, which was one of the best movies ever made, according to people on IMDb. So far, so good. And the idea of the archangel Michael living at Pansy Milbank's motel on earth? Well, give it a chance, it's supposed to be a comedy. Okay, so far, so good. But Michael does things that an angel not fallen would never do, and that completely blows any credibility the movie might have had. The other characters in the movie don't have much appeal, either. Michael brings a dog back to life, and we're supposed to be in awe of that. The people make up corny country songs. In the end, Stapleton dances with Travolta. Big deal. If she was smart, she wouldn't even be in this movie. When it was over, I thought, \"Gee, what a stupid, tasteless, boring, corny, sacrilegious movie!\" It's not fit to be seen by children or anyone else.","\"Michael\" was made back to back with Travolta's 1996 picture \"Phenomenon\", and if you liked one, you probably like the other. Both offer John Travolta in offbeat kind of roles while still trading on his leading man sex appeal. I'm kind of surprised by the relatively low rating this picture has here (5.6 as I write this), because I thought the writers provided some fairly clever elements to Travolta's character. After all, how often do you come across the angel who kicked Lucifer out of heaven? And how can you miss with a canine co-star like Sparky? Well I guess the things that entertain some movie fans will turn off others. Some of the reviews here feel the picture denigrated the whole idea of 'angelic' angels, but then again, who wrote that rule book? I found it kind of cool that Michael (Travolta) remained true to a personal (if I may be allowed to use the word personal referring to a heavenly host) code of honor and sense of duty while accompanying Frank (William Hurt), Huey (Robert Pastorelli) and Dorothy (Andie MacDowell) on their quixotic journey. If one didn't know better, you'd really believe there's such a thing as the world's biggest ball of twine and largest non-stick frying pan.I guess you can tell I liked this picture, even if it's not in the same ballpark as say \"Casablanca\" or any other Top 100 film out there. I dig the quirky stuff along with the clever set-ups and unusual situations. If you think about it, John and Paul had to get their inspiration somewhere, and in my book, you can never have too much sugar."],"review-user":["bigbillyt","john-herbert22","sirlovealot","ijonesiii","flingebunt","kyle-cruse","jokoco","Missileman1","helpless_dancer","lensman19067","jhclues","gpickles","RickofL","bob the moo","ccthemovieman-1","juliechristine712","ivana-7","DeeDee-10","movies2u","sourapple","ausum","hbs","lightninboy","classicsoncall"],"review-date":["21 February 2004","28 October 2005","24 June 2006","9 January 2006","13 June 2005","30 May 2009","16 September 2006","14 May 2006","27 November 2000","12 December 2006","5 December 2001","19 November 2011","24 April 2000","21 June 2004","27 October 2006","23 January 2004","10 October 1999","13 January 1999","13 July 2001","19 January 2001","5 December 1999","25 October 1998","21 April 2005","6 December 2014"],"review-rating":["8","8","8","7","8","10","7","8","8","8","9","3","9","10","10","7","1","7"],"review-title":[" Lovely Capraesque Comedy Drama\n"," charming, quirky, offbeat, light, fun ... do not take too seriously\n"," Funny and heartwarming little movie\n"," Just Loving Travolta in this Movie...\n"," He is an angel, not a saint.\n"," Easily enjoyable\n"," \"Michael\" ... the most human angel\n"," John Travolta will 'ruffle your feathers'\n"," Angel comes to earth to help out\n"," Sometimes a movie is just meant to be enjoyed!\n"," He's Not \"That Kind\" Of Angel\n"," Very sweet.\n"," A very delightful, out of character performance by Travolta.\n"," Fairly meandering and aimless but quite inoffensive and certainly not as bad as it looked in it's trailers\n"," Another Sappy Ephron Film\n"," misunderstood, delightful film\n"," one of my fave movies\n"," . . . all you need is love!\n"," A Great Film!\n"," i loved it!\n"," How to live a joyful life\n"," mildly humorous\n"," One of the worst movies ever made.\n"," \"Well we don't exactly know how it works with angels.\"\n"]}