{"review-url":["http://www.imdb.com/title/tt0063049/reviews"],"review-text":["This is one of those films where it is easy to see how some people wouldn't like it. My wife has never seen it, and when I just rewatched it last night, I waited until after she went to bed. She might have been amused by a couple small snippets, but I know she would have had enough within ten minutes.Head has nothing like a conventional story. The film is firmly mired in the psychedelic era. It could be seen as filmic surrealism in a nutshell, or as something of a postmodern acid trip through film genres. If you're not a big fan of those things--psychedelia, surrealism, postmodernism and the \"acid trip aesthetic\" (assuming there's a difference between them), you should probably stay away from this film. On the other hand if you are a fan of that stuff, you need to run out and buy Head now if you haven't already.Oddly, the film has never received much respect. That probably has a lot to do with preconceptions. After all, it does star The Monkees--Micky Dolenz, Davy Jones, Michael Nesmith and Peter Tork--and The Monkees were a musical group of actors put together by producers Bob Rafelson and Bert Schneider to be a kid-friendly, bubble-gummy Beatles for a television series. In their era, they had as much respect as, say, Menudo, New Kids on the Block, The Spice Girls, and so on. As a fellow IMDb reviewer rightly notes--\"Perhaps people in 1968, thinking of the Monkees as a silly factory-made pop band rip-off of the Beatles, refused to see (Head)\".The Monkees and Head have never been quite able to shed that negative public perception. It's a shame, because there was a lot of talent, both musically and otherwise, in The Monkees. It's probably odder that Rafelson, who directs here and co-produces with Schneider, and Jack Nicholson (yes, _that_ Jack Nicholson), who wrote the script and also co-produces, decided to take The Monkees in this unusual direction. It's as if New Kids on the Block suddenly put out an album equivalent to Pink Floyd's Ummagumma (1969) or Atom Heart Mother (1970). In fact, the songs in Head, written by The Monkees and frequent collaborators such as Carole King and Harry Nilsson, have a Floyd-like quality, somewhere between the Syd Barrett era and the immediate post-Barrett era. This is much more prominent than any Beatles similarity. Some people have complained about the music in the film, but to me, all the songs are gems. For that matter, some people dislike Barrett era (or other) Floyd, which is just as difficult for me to empathize with.But what _is_ Head about? The basic gist is just that The Monkees are taking a trip through various film genres--there are war scenes, adventure scenes, horror scenes, comedy scenes, drama scenes, western scenes, sci-fi scenes, romance scenes, and on and on. Except, in the film's reality, this turns out to be happening primarily (if not exclusively) on a studio lot. At root, we're watching The Monkees shoot a film. Of course all of the scenes in the various genres have something surreal and self-referential about them, and they, and individual shots within a scene, tend to lead to one another using dream logic not dissimilar to the Monty Python television show. As a dream, Head tends to vacillate between a good dream and a nightmare, while often being one that would cause you to laugh in your sleep (something that I frequently do, by the way).Technically, Rafelson uses a wide variety of techniques to realize the above. There are scenes with extensive negative images, there are a lot of very fast cuts (including a great sequence that features Davy Jones and Tony Basil dancing alternately in a white and a black room, wearing a combination of white and black reversed in each, that occasionally toggles back and forth as quickly as two frames at a time), there are a lot of bizarre segues, there is an animated cow mouth, there are odd editing devices, and so on. For my money, I wish this stuff wasn't just a relic of the psychedelic era. This is the kind of artistic approach I relish. It seemed like a good idea back then and I still think it's a good idea. I'd like to see films like The Life Aquatic with Steve Zissou using (2004) using these types of extended techniques. Now that would make that film surreal.Interpretationally, some folks who aren't so in tune with the acid trip aesthetic have complained that it's basically b.s. to offer meanings for something intended to not have any. I disagree with such a pessimistic/nihilistic view; Head was intended to have a lot of meaning(s), and it's not just films without conventional plots that have multiple interpretations. Nicholson, Rafelson and Schneider have a lot of interesting things to say about The Monkees--the film postmodernistically comments on their manufactured status; pop stardom--way before Pink Floyd, Head conflates pop stardom and violence, from images of war to images of fans cannibalistically dismantling their idols; and naïve U.S.-oriented ideas of international perceptions and respect--well-armed foreigners in a desert surrender to Micky Dolenz just because he's an American, then later they blow up a Coke machine (again in the desert) for him because he's thirsty and can't gain access. The film comments on many other topics--from big Industry to police, surveys, spectatorship (especially in relation to tragedies), and on and on. Head is full of ideas, appropriately enough, with intelligent, multifaceted things to say about them.Head deserves to be considered a classic--it's basically shooting for the same vibe as The Beatles' Yellow Submarine. Both premiered in November of 1968, interestingly enough, and both were intended as something of a summation of the psychedelic aesthetic. Yellow Submarine wasn't quite successful. Head is everything Yellow Submarine should have been.","\"I am ... proud of 'Head',\" Mike Nesmith has said. He should be, because this film, which either has been derided by many of us or studied and scrutinized by film professors, works on many levels.Yes, it's unconventional. To many, frustrating. It's almost as if the producers hand you the film and tempt: \"You figure it out.\"You probably already know that The Monkees TV show was a runaway marketing success that depended upon business acumen and no small serving of public deception. TV shows are about selling soap and toothpaste first, than to entertain. That The Monkees broke out of the box for a short time to make \"Head\" is a testament to the group's popularity and importance in pop culture, despite where your head's at. Get one thing straight: \"Head\" is not The Monkees TV show.So what we have here is a \"psychedelic documentary\" about Western pop culture from a source that has authority on the subject. \"Head\" is a movie that could only come from those \"inside the box\". By 1968, The Monkees' cast and crew were seasoned and weary professionals who had seen their share of promise and disappointment. The movie was a deliberate attempt at market repositioning. So, it did three things: Make a film the way The Monkees envisioned. Most importantly, reinvent the group to one not subservient to it's old bosses - and yas, hipper than before. Make a film that exposed American attitudes of information dissemination.\"Head\", therefore, really is about media manipulation and its net result: deception. The mass media is supposed to inform, educate us on the happenings in the world at large, and ultimately asks us to form opinions of these events that can shape thought into positive action. Thus we assume the information we absorb to be complete and unbiased - otherwise, how can one establish a valued conclusion on any one idea presented by a book, newspaper or TV show? In one of the street interviews in \"Head\", a guy admits, \"I haven't looked at a newspaper or TV in years.\" Is he lesser or better the man? Even the drug parallels are a soft veiling of \"Things are not as they seem.\" Remember the old joke, \"Everything you know is wrong\"? The screenplay starts with The Monkees' public admission of it's own \"manufactured image\" and runs with the football - literally. Is the football scene in the movie a visual manifestation of the whole idea behind \"Head\"? Is the film a stream-of-consciousness exercise? Is the film the culmination of pot smoking marathons? There are too many coincidences that occur in the film that suggest otherwise. My guess is that \"Head\" is the culmination of motivations somewhere between intended and unintended.Largely, the insiders responsible for \"Head\" seem to enjoy themselves in the revelries that take place in the film, but there is anger - anger at the chaos that characterized the late '60s and anger at the way the media, television especially, had changed culture in negative ways. Drugs and violence were strong negative forces in the late '60s and still are, but the producers of \"Head\" want you to know that poor \"information\" is a far greater danger.Wars have been attributed to hoaxes and lies. What perfect way to spread disinformation than through TV? Repeatedly, the mysterious black box is seen as an obstacle to The Monkees and seemingly, all of us as well. In one scene, Peter is sullenly sitting in a saloon holding a melting ice cream cone, and is asked by a fellow Monkey, \"What's wrong?\" \"I bought this ice cream cone and I don't want it.\" The movie suggests that the first purpose of the media is NOT to inform, but to sell en mass blindly. \"Head\" goes further: put any idea into someone's head, and merrily goes he.The filmmakers know this, and the danger is real. \"Head\" is either a movie that creates itself \"as we go along\", or is a deliberate statement. Perhaps, perhaps not. Maybe it is just \"Pot meets advertising\", as critics scathed in 1968. The jokes are on The Monkees and us. Be careful what you ask for, you may get it.Cheers: A true guilty pleasure. Very funny. Intelligent. Will please the fans. Find the substance, it's there. Unabashedly weird. Bizarre collection of characters. Good tunage. Length is appropriate. Lots of great one liners, including my all time prophetic favorite: \"The tragedy of your times, my young friends, is that you may get exactly what you want.\"Caveats: Dated. Drugs. No plot. No linear delivery of any thought in particular. At least twenty-five stories that interweave in stop-and- go fashion. So, may easily frustrate. May seem pretentious to some. People who can't stand The Monkees need not watch, though that in itself is no reason to avoid it. The psychedelic special effects may kill your ailing picture tube or your acid burnt- out eyeballs.Match, cut.","This all-but-ignored masterpiece is about the Monkees becoming aware that they are fictional characters in a movie (Head), and that everything they do or say had already been written in an (unseen) script they seem to be following. Head was written by Jack Nicholson, Rafelson, and Peter Tork during a three-day LSD trip in a suite at an expensive Hollywood hotel. The other three Monkees only acted in it.They fight this every way they can by doing things not in the script. They deliberately flub their lines, walk off sets, tear up scenery, punch other actors for no reason; and ultimately, commit suicide by jumping off a bridge. For instance, in the rapid flashes of a psychedelic party scene, if you watch frame-by-frame, you can see Rafelson sitting next to the camera and cameraman, very deliberately shooting into a mirror. He is revealing that the party is actually fake and is being shot in a studio with actors who suddenly drop out of character and walk away in the middle of a conversation when the Director yells \"cut!\"The Monkees, however, never drop out of character because those characters are also who they really are. That ends up being the core of the Revelation soon to come.At every turn, they realize their increasingly-bizarre actions were exactly what they were supposed to do in the scripted film they can't escape being in. You say they went crazy and walked through the sky (which turns out to be painted on paper and hung from the ceiling as the set's background)? No problem! Hey, hey, they're the Monkees, and those wacky guys just keep monkeying around! In the end, even their deaths did not set them free. That was how the movie was supposed to end, and their motionless, waterlogged bodies are fished out of the river, put in another box, and stacked in a film studio warehouse until the characters are needed again for another studio production.This is made all the more poignant by the fact that the Monkees really ARE fictional characters who forced themselves into the real world. They did it through the power of their music.Ironically, near the end, Peter Tork has what he rightly sees as a hugely profound revelation that solves their problem, but unfortunately, no one listens. Peter realizes: \"It doesn't MATTER if we're in the box (the film)\". He means that it doesn't matter if will is free or illusory, and that \"the only important thing is that you just let the present moment occur and occur... You need to just let 'now' HAPPEN, as it happens\", without analyzing or evaluating or judging whether the experience is \"valid\" by some abstract definition.When you can't even tell the difference, will being free or not doesn't matter--tying to figure out if you are the \"real\" you is just a pointless waste of time.I saw this film at a very important time in my life. I was trying to figure out how to escape being just \"that geeky, creepy nerd girl\" by thinking about it intensely instead of just having fun (i.e., sex) like everyone else did. But the revelation in Head broke my self-imposed recursive trap and helped me more than Rafelson or Nicholson or Tork will ever know.For decades, I've watched \"Head\" and wished I could thank Pete.Was this a good movie?Uhh, how about, like...==< YES >==","\"Head\" is one of those films you'll have a lot of trouble convincing your friends to see, but once they do they'll fall in love with it.  I don't know how many times this has happened to me.  This film is just so funny and bizarre, really a deconstruction of everything the Monkees had been up to this point in their career.  A lot the credit goes to Bob Rafelson who pretty much ended the Monkee's career with this film.  My guess is he wanted to get out of directing the TV show and get into features, which he did in a big way after this one.  Micky Dolenz is absolutely hilarious.  I can't believe he didn't have a second life as a comic actor after this film. This film has a lot of great cameos and a lot of wonderful psychedelic nonsense.  I feel like the reputation of this film is continuing to build and it wouldn't surprise me if it eventually becomes a full on cult classic","You would really need to remember the Monkees and have a clear understanding as to where and how they fitted into the second half of the 1960s in order to fully appreciate this movie.There is no plot as such. Basically, it's a crazy, mixed up pastiche of various, unrelated sequences. But, it IS interesting AND entertaining in its own peculiar way once you get onto its wavelength. In short, it was a classic, cleverly conceived and well crafted example of late '60s experimental cinema. It contains some good songs, some ultra-groovy cinematography and plenty of other worthwhile ideas in terms of film technique.I give it 8 out of 10 for several reasons. First, it took a lot of courage to make such an unorthodox movie in the commercial mainstream where both its stars and its producers were firmly ensconced at the time (whether they liked it or not). It seems that almost everyone who was associated with the project (with the exception of Columbia who paid for it) knew that it was probably not going to be a big money maker. Their reasons for wanting to do it were as unorthodox as the film itself. Secondly, it was, for the most part, a creative success. And, finally, as already mentioned, it is, unquestionably, a classic of the genre and, as such, it is now historically important.Unfortunately, \"Head\" came too late in the Monkees career. But, there again, they wouldn't have been allowed to make it earlier on because it was essentially a very pointed and cynical satire of their own image. Clearly, the members of the group knew, only too well, that the whole Monkeemania thing had pretty well run its course when they started work on this movie. In a way, it was to be their swan song and they were determined to let it all hang out. They were tired of being treated like mere pawns in the high powered corporate game in which they had been manipulated and exploited over the preceding few years. In short, they \"wanted out\" and they were going to say a few things before they left.History, however, has vindicated the band. Let the critics be damned. The Monkees, left behind some of the best, most polished and successful pop records of the decade. Yes, they had plenty of help. But at the end of the day, THEY stood in front of the studio mikes, THEY fronted the movie and TV cameras and THEY did the concerts. They were fun and just a little bit crazy. But, unlike some of their contemporaries, they were never threatening. You could safely introduce a Monkey to your elderly aunt.\"Head\" probably borrows a bit too heavily from the Beatles \"Hard Day's Night\" but it's still worth another look for those who were around at the time or for younger retro fans who can appreciate its significance.Enjoy!","To experience Head you really need to understand where the Monkees were when they filmed it.This was as their series was coming to a close and the group was near break up. Their inventive and comedic series (sort of an American Idol of their day) took four unknown actors and formed a manufactured supergroup around them.This is their take on their \"manufactured image\" and status as the 2nd tier Beatles. They always felt they were in a box, trapped, and unable to find credibility despite their talents.It is also a hell of a musical-trippy, inventive (I have the soundtrack) and full of surprises.See it with an open mind.","The Beatles had just done 'Magical Mystery Tour.' There was the general feel that performance, peace and drugs went together naturally. In LA, there was a film subculture that knew something was up. Nicholson was in several of these gangs.Before he decided to seriously become an actor, before 'Easy Rider,' before 'Pink Flamingos,' before 'Day for Night,' there were several experiments with what to do about this. An important one is 'Saragossa Manuscript.' This is another.Jack writes. He plays with circular narrative, self-reference, film reference, performance self-loathing, the pain of creation, all on the outskirts of safe kiddiepop. You must see this, if only to know something about Jack.Certain actors act by digging into themselves. It is a common technique. Some dig deep, but after a while, they become boring because they are incredibly shallow people. There isn't just enough stuff in there to sustain a career. Think of DeNiro and Hackman.Others are pretty interesting people, who seem to become more interesting over time. When they dig into the barrel, they put stuff back in because of the pain of the digging. Think Sean Penn and Jack. At the bottom of Jack's barrel, at the end of the thread he spins, as the base of every character is this experimental, risky writer/filmmaker.Who cares if it is a bad movie? It is bad because it took risks. Watch when a tear is wiped from Annette's cheek by the director. It is a loving goof on the whole Brando thing, something that I heard Marlon laughed about. That is one of the richest moments in Hollywood film history.There's another reason to watch this. Music in film is has a strong root in dance. Revolution in film often relies on music. Whole cultures are thus swept along.An unsung giantess in inventing how billions now dance is Toni Basil. She was as influential in pop choreography as the Beatles were in music. She was already well into her career when called upon to work on this. But this is one of her earliest screen appearances. You can see her work throughout and she herself in the pretty cool 'Daddy's Girl' segment, over one of Nilsson's better songs. (Followed by the Frank Zappa cameo.) McCartney would reference this scene in his TeeVee special years later.A third reason to watch is early (about 6 1/2 minutes) in the film: a character named 'Lady Pleasure' kisses each Monkey in a long continuous shot and then dismissively departs. She is credited as I. J. Jefferson but is really Mimi Manchu, Nicholson's lover at the time and LSD partner. Red hair, psychedelic demeanor. Lovely. That scene says it all for me, about how Jack feels about the boys.Ted's Evaluation -- 3 of 3: Worth watching.","I can't believe this isn't a huge cult hit. Perhaps people in 1968, thinking of the Monkees as a silly factory-made pop band rip-off of the Beatles, refused to see it. That cynicism probably covered it from sight ever since. Don't make this mistake. _Head_ is an amazing film that most open minded people will appreciate. It is very funny and very intelligent (and very trippy).","I will admit, I had the opportunity in the past to watch this film, and after about 5 - 10 minutes into it, I felt like many did. I was expecting a Monkey movie that was similar to the television show, but instead I was given... well, I didn't know what I was given to be honest.However, after finally watching this film, I realized that not only had I had a closed mind to the brilliance it depicts, I also found myself watching it over and over again. It's the one movie that never ceases to interest me, simply because it keeps me alert, as I try to attempt to decipher it's meanings. And just when I think I've figured out something in the film, it's answer is destroyed once I watch the film again. Brilliance indeed.It seems that most people who disliked this film are wanting to watch a film with primarily a clear plot. They want everything explained and all questions answered in the finale. Well sorry, if that's what you're wanting, this is not the movie for you. But if you liked movies like The Matrix (and better yet, their sequels) I think you'll appreciate the thought provoking, mindblowing experience this film will give you.Think of the film being like a dream. In our dreams, things make no sense, things we expect to happen don't, people places and things don't speak, act or function in the same way they do in reality. To complain about \"Head\" is like complaining about a dream you've had that you felt you could not understand. The mind is a complex system, and being that a film titled \"Head\" is just as complex, is it that difficult to relate the two?The music (and musical numbers) really stand out, especially Peter Tork's two compositions, which remain the best tracks in the film, \"Can You Dig It?\" and \"Long Title: Do I Have To Do This All Over Again?\"This film proves that The Monkees were much more than just four zanny guys in a 'pre-fab' group (as their critics called them) on a television show, but that they are actually much more intelligent and talented than the world would give them credit for. There's so many messages that can be derived from the film, both in regards to The Monkees and to the 'entertainment industry' in general, that it stands as a masterpiece of film-making that was far ahead of it's time.I feel, had this film been released as an independent piece at this point and time, it would actually garner the respect and admiration it deserves.And one finale note:One could compare this to The Beatles \"Magical Mystery Tour\" film, since The Beatles film appeared to be just as strange and bizarre. However, in my opinion, \"Head\" stands far above anything The Beatles put on celluloid.","I just can't understand why people are surprised this movie makes no sense. It was never supposed to make sense. (Duh! The writers were completely wasted on Frodis at the time.) It was just supposed to entertain and mock, and it does both wonderfully.The Monkees are good actors. They wouldn't have been hired if they weren't good actors. Mike has a thing for deadpan and darkness, Micky is the best at sheer psychotic comedy, Davy is a Broadway veteran, and Peter actually had people believing he was that dumb in real life. Don't tell me they can't act, because they most definitely can.They can also write. Sure, Jack & Bob get the sole credits, but in reality, they got a big helping hand on that script from the Monkees, who were also in that smoke-filled room.(it is absolutely impossible to spoil this film) Head is very highly symbolic. Among the more memorable elements is the black box, which was actually based on 2 things: the Monkee image that the boys were bound to, and the real black box on the Screen Gems lot where the band was kept between takes. There's so much more symbolism in the movie that I'll just let you watch it and figure it out.The music is awesome. \"Circle Sky\" is one of Papa Nez's best tunes ever, and \"Porpoise Song\" & \"As We Go Along\" will have you enthralled. If you'd rather be weirded out, then \"Ditty Diego\", \"Can You Dig It?\", and \"Long Title\" should be satisfactory, great songs that they are. And then there's \"Daddy's Song\", without a doubt a homage to Davy's Broadway days, and the editing/color scheming for that sequence is superb. (At least for '68.)Oh, For those of you who won't watch a 'PG' film, you're missing out. Especially since Head was originally rated R in 1968. The rating was lowered about TWENTY years later!Now where was I? Ah, yes: \"We were speaking of beliefs. Beliefs and conditioning....\"","A very weird, psychedelic, esoteric, (and did I say weird? :) experience.But on at least on one level - it did exactly what it was supposed to do. It bridged the gap between the silly, manufactured, Hollywood look at teen pop idols that was the Monkees TV program and the adult, musically growing and evolving, and yet still a little silly Monkees of the '70s and beyond.The most important line in the film is Mike Nesmith's, \"If they think we are plastic now, wait till they see how we do it.\" That the Monkees were tired of all of the negative comments about their image and their work is a matter of record. They said it over and over in interviews. They needed to re-make themselves, and what better way that to de-bunk and hilariously lampoon the very machine that created them. And at the same time, they commented on our whole society (news, movies, art, everything) and said, \"Hey, why pick on us - isn't all of this stuff manufactured on one point or another.\" These are the Orwellian \"proles\" (the Monkees represented the persecuted \"everyman\" even at their silliest in the TV series)pulling down \"Big Brother's\" pants and kicking him in his very deserving butt.Loved the ideas, loved the music, loved the effects, loved the movie! But then, as Peter Tork says in the movie, \"But then, why should I speak, since I know nothing?\" :)","Forget Easy Rider - Head is THE film about the 1960s.Almost laugh: as the Monkees reduce their entire career to a one-minute TV commercial about dandruff! See: the 50 foot Victor Mature try to figure out what the heck he's doing in this film! Hear: Frank Zappa (with his pet cow on leash) tell Davey Jones \"Your music is awfully white\"! Experience: the Monkees' only live performance as a real rock band play the honest-to-gosh first-ever real punk-rock song (Circle Sky)! Listen: as Davey Jones sings a Harry Nielsen song about having a transsexual father! Be confused: be very confused, as confused as Terri Garr is when Mickey Dolenz makes sexual innuendos about her in her film debut! Witness: futile protests against the Vietnam War leap out of nowhere and just as quickly disappear! Watch: Mike Nesmith spit on Christmas while wearing a velvet Victorian smoking jacket in a cobwebbed Gothic horror-movie sound-stage! Let yourself drift: into the karmic bliss inspired by a comic-book version of Indian mysticism delivered by a hammy white character-actor in black-face, while Peter Tork pretends that he knows how to play a guitar! Discover: Academy Award winning director Bob Rafelson's first feature length film, as written by Academy Award winning actor Jack Nicholson! Pretend it's not happening: when the Monkees commit group suicide by jumping off the Golden Gate Bridge! Take drugs - take a lot of drugs: take as many drugs as the cast and crew evidently did while making this film!With Head, the Monkees revealed themselves as the angriest, snottiest entertainers in Hollywood history, bar none. It is bewildering to discover that they blamed the failure of this film on bad promo. To be sure, the promotion was virtually non-existent; but did they not recognize how angry, how down-right depressing, how self-destructive this film actually is?! I mean, this film is a trip - on bad acid - to the suicide ward of a mental hospital. The only film I know to be this depressing is Terry Gilliam's Brazil; and like Brazil, this film reveals why life in the later 20th Century was almost unbearable - if you were lucky. It's not simply that Western culture was suffering from serious information-overload, but the information itself was just bad, bad, more bad, and dismal. In fact, it was the overload effect itself that kept people going, since this allowed people to keep distracting themselves with one crisis or another - if news from Vietnam became too much to bear, they could turn the channel and watch a documentary on the rising unemployment rate.The \"positive\" response to the reality revealed in Head was Woodstock - three days of peace and love and nudity and mud and bugs and bad food and dirty drink and poop and pee and bad acid and Peter Townsend almost killing Abbie Hoffman. All taking place behind a steel fence, under the lovingly watchful eyes of a veritable army of NY State Troopers - meaning that the \"freedom\" of Woodstock Nation was as illusory as the song John Sebastion thought he was singing while so strung out he could barely speak. \"500,000 assholes too stupid to come in out of the rain,\" was one critic's judgment on Woodstock (I think it was Andy Warhol). The one good thing occurring there was Jimi Hendrix's Star Spangled Banner. Two years previously, the Jimi Hendrix Experience had gone on their first National tour of America, as the warm-up band opening for - the Monkees. See, it's all connected somehow.You owe it to yourself - nay, you owe it to your unborn children - to see the real 1960s, only to be found on film in this bizarre, miraculous, and utterly absurd tribute to one of the more interesting capitalist scams of the later 20th Century.","I had read where this is a wild-and-crazy movie that was a lot of fun to watch and nostalgic for the period of the late '60, with decent songs thrown in. I agree with some of that but disagree about the overall presentation.I found the songs were the highlight: excellent stuff. These guys were not just \"fluff.\" they could sing and sing well, and their instrumentation isn't bad, either. They are definitely underrated in the music department.In the humor department, I would say the opposite. This film is a compilation of small comedy bits. There really is no story, which I knew before I saw it. I didn't mind that, but I was expecting some things that would really make me laugh. I wound laughing very little as most of it is just dumb humor....almost embarrassingly bad.This 1968 movie which wasn't released for three years, which wasn't fair to the guys. Their TV program had been off the air, so their popularity was waning. I don't know why the delay as there is nothing controversial in here. There is no profanity, either. It's pretty clean stuff....just not that entertaining.","Forget trying to make sense of this film, you missed the point. Yes it's surreal '60s cheese, but it's well made, thanks to Rafelson and a hefty budget which the monkees were never denied of funding. There are priceless moments like the part where Peter storms off screen trying to voice his complaint to Rafelson while the likes of Jack Nicholson and dennis Hopper also try to grab BR's attention.The songs by King/ Mann/Weill and the Monkees themselves are fantastic, and the visuals are MTV-transcended and utterly groundbreaking. Gorgeous stuff. Can you Dig it features an incredible fusion of Bellydance and Psychedelic dance. I think Zappa is somehow shortchanged in the mix...the cow is given the punchline (?)","I grew up watching the Monkees on TV, and when I was old enough to own my own stereo, I got both of their Greatest Hits albums. On vinyl. To say that I eagerly awaited the VHS release of their single long lost feature, HEAD, back in the mid-80s is an understatement. I was pestering video clerks for a solid year until it appeared on the shelves. And when I finally watched it... I found myself confused, disappointed and bored. The music was different from the more familiar pop-friendly tunes on the show - darker lyrically and musically - but that was okay. Musical groups evolve and change. The movie lacks a coherent story line and often makes no sense whatsoever, but part of the appeal of their show was its scatter-shot approach to anarchic comedy. The individual vignettes which often spoof classic Hollywood warhorses and which make up most of the movie's length are silly and don't really go anywhere, but then the show was not exactly a story-driven affair either. Ultimately, what made the show irresistible was the individual appeal of the four Monkees themselves and their chemistry as a group, and the movie simply doesn't give us any of that, substituting instead a bizarre parade of unrelated images and events that lacks for any coherent or unifying viewpoint. It's much ado about nothing and when it's over, the viewer finds himself wondering, Is that it? Was that the best they could come up with, given Bob Rafelson as director, Jack Nicholson as head screenwriter and two months of studio time? Ultimately, HEAD's a harmless trifle, but it's one of those late 60s movies like CHE or HIERONYMUS MERKIN that just leave you wondering when the clowns took over the circus. These movies came out while the Hollywood old guard who were still in charge of the studios were green-lighting stuff that they hoped would appeal to a youth audience whose tastes were beyond their understanding. The movie might appeal to Monkey fans or maybe not, but keep your expectations low.","Well, after viewing this film dozens of times (I am a huge fan of the Monkees) I believe I have finally come to grips with it. The film can be taken on several levels. It is, on its face, a psychedelic romp with the Monkees in an endless cascade of set pieces in a seemingly plot less melange, with time out for six new songs/music videos. It is on that basis that first-time viewers should approach it, letting the fun sights, groovy music, and seemingly non-sequitor humor wash over them.But really, Head is so much more than a colorful, drug-fueled weirdness. At its core, Head exposes the price of fame, the vacuousness of pop culture and the isolation of the individual in modern society. Do you think I'm overreaching here, reading in meaning where there really is none? I believe that Jack Nicholson and The Monkees (writers of the film, though only Jack was credited) took a carefully-applied scalpel to their situation in particular and society in general, dissecting and laying bare their frustrations in an artful manner. Ultimately HEAD is an allegorical tragedy that metaphorically, and with panache, tells the story of the Monkees' rise and their ultimate disillusionment with and revolt against, the star-making machinery that gave them fame and fortune. But what did it take away from them?I can hear your objection now: where's the tragedy? What could be worse than famous rich people complaining about their situation?Well, at the end of the whole affair, the group realizes that they have entered into a Faustian bargain where there is no winning. Ultimately, they are not Free Men, they are merely human puppets. Their roles as Monkees have them trapped in a locked, black box from which there is no escape. Even their decision to kill themselves cannot give them succor and release. They remain trapped in a sealed box, never to see light again, carted away at the end of the day like some giant studio prop. A dark, brooding existential fate to be sure, trapped beneath a psychedelic candy- coating. The 1960's countercultural views informing this modern fairy tale may have been, by this time, largely discredited, and perhaps almost seem quaint. But there can be no doubt that in HEAD these views are expressed artistically and subtly, and with great songs to boot, which is an achievement that not every film can boast of. In spite of the scoffing of others, I firmly believe that repeated viewings of this film will provide ongoing rewards for the thinking viewer.","Sadly, this movie is relegated to 'curio' status it seems. Many people that I've asked \"Did you know the Monkees made a movie?\" usually answer 'No.' That being said, if you are one of that large number, I recommend you see it, but with the following caveat(s): If you expect Monkey style humor, it is in there. It's just not all over the place like the TV shows.Yes, they are trying to break their TV mold a bit by poking fun at it like a bunch of no-longer-teenagers who have been on the short end of a lot of sticks.No, you don't have to be inebriated to enjoy it.No, you don't have to be inebriated to understand it.If you like classics, you'll love the interspersed clips throughout.If you like the psychedelic era, you'll love some of the cameos.If you are a Monkees fan, you might recognize some of the jabs they are taking at the heavy commercializing of the band.In the nigh-immortal words of one of my best friends after seeing 5 minutes of it: \"This is a weird movie, man.\" In fact it might be better if you don't try to understand it, just sit back and react to it. It's weird, it's funny, it's a bit surreal, it's experimental (still)...it is many things. Overall, it is an experience.ADDITIONAL - Not too terribly long ago I was given the following link for a fantastic article that revolves around Head, and the context of the time. If permitted, at the end of this I will copy the link. If not, then just do a search for Monkees Subversive Masterpiece (published 04/01/2013on a zeitgeist-y report site) and that ought to come up with the article I am referencing. The jewel of the article is towards the end:\"This leads to the question, \"Where has the art gone in our art?\"Sad to say it's nowhere to be found. Today's starry-eyed (ed. teens) aspire to become scripted. They dream to someday become unreal. They'd sell their souls to sell their souls.\" OK it doesn't like the link, so do the search and it shouldn't be hard to find, if not on the top of the search results.","Rumor has it that this movie was pieced together by the Monkees while they were in a stoned out trip. First off, I could never believe from looking at the guys that they would be stupid enough to fool around with any illegal substance, and second, after seeing this movie, I guess I have to believe it. This \"movie\" is really nothing more than a series of half-finished sketches which are thread together incoherently. None of them seem to have endings or make any sense. I would rather the movie be more like their series: the struggles of a band trying to make it big with the same Marx Brothers/Three Stooges slapstick that made them such a hit. Instead, we are subjected to the acid trip that nightmares are made of. This movie serves best as a commercial for \"Say No To Drugs\" than anything else.","If I could select one movie that seems out of place, out of time, and out of any category it could be placed in, it would be Head. But then that is the entire point of Head, as much as I am able to understand it. The \"boys\" (the Monkees) were continually trying to break out of the box they had been placed in, by the studios, their fans, their relentless critics and everyone else - only to find themselves stuffed back into the box again. The movie is like a metaphor of their entire experience with the show and their identity. The problem is that no-one understood the inside story of their struggle, or much cared. The movie baffled and angered audiences. But the movie didn't stop there. After shredding their own manufactured image in a sharply cynical and extremely funny way, the group proceeds to demolish everything else phony about America in the 60s; it's grasping materialism, our obsession with security, our identity with name brands (literally blown up in the movie), the country's need to be insulated from the world despite the ongoing war and protests at home, and the deepening cynicism the average American had towards just about everything at the end of the 60s. The movie was inaccessible to its young fans because it was rated R (probably because of violent images edited in from the war), who would have hated it if they saw it because it made fun of their heroes. It was equally inaccessible to older audiences who weren't fans and didn't understand the Monkees or their history. The only ones who \"got\" the movie were the ones who made it! And eventually, the next generation who stumbled across it and saw it in the context of the 60s. There were to be fair a few people at the time who saw it and understood its brilliant lampooning of the times, but those few people were probably from the counterculture and weren't films critics. The movie is at once a distorted reflection of the 60s and the 60s itself. I do have one quibble with the director, Bob Rafelson, who also produced the t.v. series: After the movie bombed, he has repeatedly stated (I am paraphrasing) that he made the movie to 'bury the Monkees\". He wasn't talking about their image, he was talking about the performers themselves. By this point, the honeymoon (if there ever was one) between him and the Monkees was over. He actually stated that he intended the movie to bomb so it would bury their career. Really? Bob Rafelson was not a pleasant man to work with, as many performers (including the Monkees) have attested to many times. However, he was a shrewd producer, and went on to be very successful. Would he really put his name on something he planned to not just fail, but bomb? I don't think so. It was his way of covering his professional rear when the movie tanked. However, despite his demeanor, Rafelson produced a success, not a failure. Its problem is that it was too successful, and ten years ahead of its time. The movie is not a coherent storyline; it's a collage of images, sounds and feelings from the 60s, both innocent and deeply bitter, dark and cynical. It is a real oddity out of time, space, and cannot be categorized. The ending leaves me feeling strangely sad, probably because of the comments it makes, and because of the promise left unfulfilled of four very funny, very talented performers and musicians. Who knows how far they could have gone? Ten stars, as it is in a category by itself..\"Oh no! We're back in the box!\"","I thought this G-rated movie would be fun to share with my child, as an introduction of sorts to the beginnings of music videos. What I didn't expect was the Vietnam War newsreel footage spliced into the Monkees' soundstage skit. The unedited news footage included the (in)famous execution of a Vietnamese soldier: we see a close-up of his fearful face as he is held with a gun to his head, the trigger is pulled, he is killed and falls down dead. How this movie got a \"G\" rating is hard to understand. Beware, it's not what you would expect a \"G\" movie to be.","As their entire career was a pale impersonation of The Beatles, it is no surprise that, shortly after the great fiasco of the Beatles \"Magical Mystery Tour,\" the Monkees would follow up with their own insipid and creative morass of a movie, called \"Head.\" Both movies are not so much a true story with a plot (though MMT attempted to define a plot) as they are a hodge-podge of skits and snippets, interspersed with music and songs and out-takes.\"Head\" has no plot, other than the pre-fab-four trying to break free of \"the box\" they are in (i.e. the type-casting of being \"Monkees\" and the surrounding commercialism) and yet, always finding themselves back in the box. Most skits involve breaks in the \"fourth wall\" and crossing over into other, seemingly unrelated scenes. Filled with anti-Vietnam war messages and attempts by the group to show their other talents, the film bounces around haphazardly- also to be blamed on the multiple directors.The film, like Magical Mystery Tour, is now excused by some fans as \"wonderful symbolism and misunderstood artistic statements.\" Phooey. Like MMT, it is too many guys with access to too many drugs all trying to make something artsy and making crap.Like MMT, \"Head\" has some clever moments and offers some relatively unknown Monkees songs that are quite decent. It does develop a bit more charm than MMT and is a bit easier to sit through, but it is not ironic at all that, like everything else the Monkees did, this was just a mimicry of something the Beatles did first... even when it comes to laying an egg.","\"Head\" (1968, Bob Rafelson) If there was a literal cinematic dictionary, (and it was the first dictionary to ever have pictures, and thus, to finally make the saying actually work as an idiom), under the entry for \"trying to hard\", there would be a picture from Bob Rafelson's \"Head\".In an apparent response to waning popularity and coolness, and the burgeoning American independent movement, famous television-formed singing group the Monkees decided, instead of making a piece of fluff that would please their loyal fan base, they instead decided to go in the complete opposite direction, and made a piece of fluff that satisfied...pretty much no one.As a film reviewer, I have cultivated a notorious pass/fail opinion of surrealist films, because for me, they're either a complete bullseye or a pathetic miss. If you succeed, it's a wondrous, hilarious, terrifying, amazing experience that supersedes most anything else in film. If you fail, it just becomes painful because it's not fun and it makes no sense. Surrealism and absurdism, as styles, are not difficult to do. Anyone can think up some random images, jokes and bullsh-t, film them, and call it surrealism. The trick is in doing it well, either making it mean something, or making it enjoyable enough to be able to ignore the lack of meaning. The Monkees, and thus, \"Head\", fail in this. It's merely a string of nonsense, and it's frequently painful to watch them flail about so desperately.The other thing that sinks the film are the Monkees themselves. They're not great actors, they're not great comedians, and they're certainly not great musicians, so the fact that the entire movie is the Monkees doing those three things, it's just no good. They all sort of look like they could be funny, but Davy Jones is the only one that has even an ounce of charisma, and he's relegated to lame physical humor, puns and compared with its main inspiration, \"A Hard Day's Night\", sub-Ringo blasé. As for the rest of them, you can tell Micky Dolenz REALLY *thinks* he's funny, which makes it more painful when he's not. The other two both have sort of vague penis-shaped haircuts, and I think one of them had sideburns, but that was the only thing that distinguished them.The film has absolutely zero structure, and seems like it's both passing quickly and taking forever. It's akin to taking a nap and having a dream on a car trip: You have no sense of time or distance, it makes no sense and you can't even remember it to tell anybody about it. All in all, \"Head\" is like watching a documentary about great movies instead of actually watching a great movie; this movie just made me want to round up a bunch of friends and make my own silly nonsense flick, but unlike Bob Rafelson & the Monkees, I know that my movie would be of no interest to anyone not in on the joke, something of which the Monkees could take note, as they needed to make this, and then Jerry-Lewis it into their own personal vaults.{Grade: 4/10 (C-) / #24 (of 28) of 1968}","I guess I'll have to disagree with every other post here (at least the ones I read). I thought the film made perfect sense. It seems to me to be an attempt for the Mickey, Mike, Peter and Davy to convey their desire to burst out of the bubble of Hollywood irrelevance the extremely talented guys had been forced into during a time when the entire world seemed to be changing and while they were being forced to not participate. The only people they could trust were each other and only together could they overcome the extreme pressures placed on them to submit. Alone they would lose their way and mistrust their own judgment and instincts.","Pity the Monkees. People always accused them of being manufactured (which they were) or being nothing more than a American knock-off of the Beatles (Again, which they were) but to the kids of the time they were real, they were important, they were legitimate. Discussions about who were better The Monkees or The Beatles were common on school yards but the critics, well they never quite bought into it. Despite recording some very catchy, classic pop tunes, the Monkess did not receive much respect for their albums. Sadly a similar fate was met by their one movie vehicle despite the fact that it stands as the best band film ever. Beatle fans may argue that \"Hard Days Night\" was better and I am sure that many of the kids think \"8 Mile\" was superior but none of these films were as daring and inventive as \"Head\" and that is probably why it failed.If Head had told a direct A to B type story perhaps it would have appealed to the bands young fans but by pushing the envelope and using the movie opportunity to mock their own image they really sabotaged the film with their fans. Could you imagine Eminem turning to the camera and actually talking about how sad it is that he is the best selling guy in a genre in which only 5% (and I am being generous) of the acts are white. If you can picture that than you have an idea how daring it was for the Monkess to sing \"Hey, Hey we are the Monkees. You know we like to please. A manufactured image, with no philosophy\". When you have a film in which Frank Zappa tells Davy that he should focus less on the dancing, and more on the music its clear that there is a lot more going on then you expected.The story, what there is, concerns the boys trying to flee their manager, who at one point forces them to play dandruff in a commercial, but every time they run away they end up inside a box. I don't think you need to be Fellini to figure out the symbolism of that bit. Some neat little comedy bits follow with Davy as a boxer who has to give up playing the violin to take a dive in the big match and Peter refusing to throw away a ice cream cone he does not want because there are starving children so its wrong to waste food but the real selling point to this film is the music and its some of the best the band ever recorded. Even if you are put off by the story, you can sit back and enjoy some terrific music.Any film that begins and ends with Mickey attempting suicide by jumping off a bridge (at the end the band follows him) is never going to be a mainstream classic but if you are a fan of either the band or experimental cinema of the era than you will enjoy this film."],"review-user":["BrandtSponseller","Saturday8pm","Luxi_Turna","agapejournal","BruceCorneil","jlarkin5","tedg","zetes","cornelius-7","CaptHayfever","jwhite-45","winner55","ccthemovieman-1","murking","dave13-1","Scott_Mercer","larry.launders","aesgaard41","mercuryix2003","jean-linn","asdodge","theskulI42","b52beast","deheor"],"review-date":["25 June 2005","29 September 2002","14 January 2007","30 May 2003","23 March 2003","26 May 2007","2 October 2003","4 July 2000","12 October 2004","31 October 2002","16 January 2006","27 July 2006","24 September 2007","7 July 2004","15 April 2012","20 March 2003","30 August 2005","26 August 2001","7 February 2006","10 August 2004","10 March 2009","1 July 2008","22 February 2006","5 December 2005"],"review-rating":["10","8","10","10","8","10","9","10","10","10","10","5","5","10","7","3","10","4","4","9"],"review-title":[" Everything that The Beatles' Yellow Submarine should have been\n"," A Psychedelic Documentary\n"," Head was like an AMAZING twilight zone episode exploring whether fictional characters have free will\n"," Perfect 60's oddity\n"," Historically important\n"," A Triumph\n"," Toni, Mimi, Acid Dance\n"," Why isn't this more well known?\n"," Truly one of the most underrated masterpieces in film-making.\n"," \"For those who look for meaning, and form as they do fact...\" get a life.\n"," HEAD is a DE-Monkeey-fying experience.\n"," Accidental Masterpiece\n"," Thumbs Up For The Music; Thumbs Down For The Gags\n"," Forget Rocky Horror-this is the best midnight movie\n"," I really wanted to like this movie, but mostly I didn't.\n"," Actually, a film with a lot to say...\n"," A Movie With A Porpoise. :-)\n"," A Warning Against Drugs\n"," A Movie Apart\n"," Parents Beware\n"," Hey hey, it's the Monkees... and yet, not.\n"," The definition of \"trying too hard\".\n"," Not confused\n"," Good Head\n"]}