{"review-url":["http://www.imdb.com/title/tt0107065/reviews"],"review-text":["If you want to see what could be classed as the 'stage' version of GYPSY this is the film for you.If you enjoy(ed) listing to the MERMAN recording of GYPSY then you really enjoy watching MIDLER as Gypsy's mother, ROSE. It's my opinion that Midler has the volume, vibrato and presents that Merman once had.It's not often these days, when listening to update versions of musicals, that I get that tingling sensation that makes the hair on my neck tingle but Bette Midler certainly shows her talents in this movie -see how you like them apples.....I know you may not like it, but for me Ms. Midler is the definitive \"Gypsy\".","This is one of the best TV productions of a musical ever. I have heard the Merman cast album, the Angela Lansbury album, I have seen Tyne Daly live, and I've seen the Rosalind Russell movie countless times. I think Bette is if not the best, then tied with the best. She captures not just the bravura, but also the pathos of Mama Rose. I was never a Natalie Wood fan, so I really enjoyed Cynthia Gibb, in what is arguably her best role. Everything from the costumes to the sets to the supporting performances is wonderful. The three strippers, led by the always-dependable Christine Ebersole are hard to top. There was supposed to be a TV production of Mame a few years back, with Cher, but I think Bette would be the best bet (pun intended) for Auntie Mame.","This is easily one of my favorite musicals of all time. Bette Midler comes as close to real magic on screen as anyone has in her turn as Gypsy Lee's blustery, bosomy, brave and very scary mother. She evokes a sense of desperation that is at times both comic and tragic but always genuine and quite beautiful. Such charm and grit she is indeed a pioneer woman without a frontier. That frontier is discovered for the children. Who in turn must forge their own in a world ruled by their domineering mother.This particular version is, as I understand it, in it's entirety including the brilliant choreography of Jerome Robbins, as well as the original stage directions.","Outstanding interpretation of Bette Midler as domineering mother Rose Hovick marks this excellent 1993 production.Surprisingly, Midler won the Golden Globe Award for best actress and it was certainly well-deserved. She is bossy, sincere and forever endearing in the part. She belts out the songs, not exactly in the tradition of Ethel Merman, but with her own style-she reached new heights herself. Her facial contortions are excellent. At times, in her face, I saw her characters in \"Hocus Pocus,\" and when she sings \"Everything is coming up roses,\" at the train station, I thought I was seeing Gloria Swanson of \"Sunset Boulevard\" memory.Peter Riegert was most suitable in the role of her manager, the guy she loved dearly, but couldn't marry due to her stubborn belief that the careers of her girls came first.The woman who played Louise, who is eventually drawn into the burlesque world, reminded me of the late Natalie Wood. Ironically, Wood played her part in the memorable 1962 film with the late Roz Russell.A marvelous, endearing show with great performances by all concerned.","Too often screen adaptations of musicals compromise,  but this is one of those rare occasions when every ingredient, perfect in itself, comes together and harmonizes perfectly.  Midler was born to play this role, and her performance will most likely be remembered as definitive.  She is supported by an ideal cast, and the direction and design are tops.  It doesn't get any better than this.","The '90s was such a wasteland for musicals--with Disney animation at least restoring some luster by way of BEAUTY AND THE BEAST, THE LION KING etc. But live-action? Not a prayer. Yet with GYPSY, a modestly budgeted TV-movie version of the Broadway show, with a first rate cast and crew, did an exceptional job showing how such things can still happen. Midler was the necessary powerhouse as Mama Rose, and the entire cast held their own just fine. A musical shouldn't have to be bogged down with socio-political baggage to make it relevant nowadays--a production like this shows what sheer showmanship and celebration of music and dance can still be all about, albeit derived from a forty year-old source. To see a renewal of this kind of exuberant entertainment would be a wonderful thing; at least this GYPSY shows how it can still work.","\"Gypsy\" is possibly the greatest musical ever written, so it's too bad that it's film version was such a disappointment. To make up for that, we have this re-make which, if not flawless, is an enjoyable and well done adaption of the musical. The script is completely accurate, all the songs included, and the staging remains close to the original Jerome Robbins' staging. Bette Midler is a deft choice for Rose, her singing and personality Merman-esquire, and her acting splendid. Peter Reigert is a fine Herby, if not a great singer, and Cynthia Gibb is a straight forward, natural Louise. In truth, a live taping of the 1989 revival with Tyne Daly might have been a better idea, if only because \"Gypsy\" is simply more exciting on stage, But this film is a fine translation of a great musical.","Really, I must say that this is better than the 1962 screen production with Natlie Wood.  And the role of Gypsy had humor in her acts.  Also, the language was less restrained, making the movie seem very real.  Midler can do so much with this.  She had the emotion, she had the ongoing talent to switch gears to being Rose with all her best.","Based on the memoirs of Gypsy Rose Lee, who painted a much more affectionate picture of their mother than did her sister, actress \"Baby\" June Havoc, in her autobiography, \"Early Havoc\" on which \"They Shoot Horses, Don't They?\" was loosely based. I saw Ethyl Merman in the original Broadway production of Gypsy, and she was great as \"Mama Rose\" but certainly more \"Merman\" than Rose. I was disappointed with Rosalind Russell's portrayal in the 1962 movie version. An otherwise excellent actress, Russell was a very wooden substitute for Merman. Bette Midler, by contrast, was better and more believable than Merman and I'd recommend her performance as the definitive one.","I loved this production of \"Gypsy\" so much that when my audiocassette of the Ethel Merman production got ruined I replaced it with a CD of the Midler \"Gypsy.\"  Bette Midler has the fire to do justice to this demanding role, and her supporting cast seemed agreeable to let her shine.  But the highlight of the film for me was \"You Gotta Have a Gimmick.\"  The three strip women as a group are a comic delight.","Watching this on Comcast On-Demand.Every time I see this musical, I am amazed at the songs...one show-stopper after another.This interpretation is, for me, magical. The songs sparkle...the vocals, orchestrations, and choreography are amazing for a \"made-for-TV\" movie...better than many stage versions I have seen.The debate over Bette just doesn't make sense. She is Mamma. Her voice is brilliant and yet full of the pathos of the stage mother living through her daughters. I still get tears at the end when she finally has her moment of glory, no matter how faded that glory is.The Tulsa/Louise duet/dance is on now. Fabulous.Stephen Sondheim is the King of musical theatre. His lyrics just roll off the tongue like silk...Styne's music is perhaps the best ever penned for the stage/screen.Thank God we have this masterpiece of the American Musical Theatre captured on DVD.","While It was great to see Gypsy uncut from stage to screen with the fine \"Together\" number back in (it was cut from the 1962 version), Bette Mildler peaks too early in the film.Her Mama Rose builds until she sings \"Everthings coming up roses\" then she has nowhere to go but up. Mildler overacts the second half of the film dreadfully. Roz Russell correctly built her emotional level to peak at the finale, \"Rose's Turn\" and in so doing she has wonderful depth of character.True Midler sings better than Russell but with less emotion.Peter Reigert is in fine form as Herbie and plays it with more energy than Malden,however lacking Malden's depth of character. in the 1962 film,Cynthia Gibb is a charming Louise and a Gutsy Gypsy. Other high points are Ed Asner's cameo as Pop and the show stopping you gotta get a gimmick song lead by Christine Ebersole. Its a good film that would have benifited from a different leading lady (or one that could take direction?).","I'm not a big fan of movie musicals. \"Annie\" was a stage show I loved but the movie was a flop. The \"Phantom Of The Opera movies\" (and I believe there were three) failed to match the Weber staging. But I LOVED this. The DVD will take a place of honour among my \"keepers.\" Even though it's a movie adaptation, it somehow captures the flavour and the atmosphere of live theatre. Bette Midler, always a treat, is just exceptional in this role. There's great music, lots of laughs and even a tear or two. I've seen most of the big musicals of the eighties and nineties. Somehow I missed this one so there's no comparison to make. But if it gets revived I shall be first in line for tickets! But this movie is so good, I'll be in the odd position of wondering if the stage production will measure up to the movie.","and I for one think that is a good thing. I've just never been a Rosalind Russell fan although the original was my favorite RR movie. But I love Bette and was thrilled to hear she was making this.As for the rest of the production, I think it was slightly less than the original movie. One of my favorite minor characters in the original was Mazeppa with her scratchy fingernails-on-the-blackboard voice belting out \"HEY! It takes a lot more than no talent to be a strippah!\" and although I missed it, I was glad to see the producers had the guts not to do a carbon copy.I also liked the fact there are large portions of this movie which were filmed as if you are looking at a stage, it gives a feeling that you are in the theatre, not just at the movies.I think the other thing I liked about this production was that there seemed to be slightly less repetition of the song \"Let me entertain you\", which becomes completely annoying after about the 5th time you hear it.","I like the Rosalind Russell version a lot(I perhaps prefer it just a tad) and Russell in it, but this Gypsy has a lot to recommend. It is not quite on par with the musical itself(neither film version is) which is a masterpiece of character and music, but it has its spirit, heart and charm. The spirit is droll and sincere and the story has so much heart to it. The music is wonderful and the lyrics positively delight. The production values are kitsch, bright and colourful. While I prefer Malden and Wood in their respective roles in the 1962 film, Peter Reigert(though his singing leaves a lot to be desired) and Cynthia Gibb are truly charming and entertaining, and Christine Ebersole steals all her scenes. If there are any preferences I have at all over the 1962 film, it is the staging and choreography, which is less clunky and moves more effortlessly, and Bette Midler's singing, Russell's was raspy and off-key sometimes whereas Midler's is big and brassy. Midler is just superb as Mama Rose, although Russell was superb also Midler's Mama Rose is truer to what Mama Rose should be like. Overall, a fine Gypsy. 8/10 Bethany Cox","Bette Midler is the best thing about this movie. It is a POOR second to the original from 1962 with Natalie Wood as Gypsy. The songs were done much better in the original and the costumes were better. Bette's voice was great and she looked better in most of the costumes compared to Cynthia Gibb. Only someone who has not seen the original would think this a good movie.There was not enough of a change between ugly duckling to beautiful girl. When Natalie Wood was Gypsy she only was seen as beautiful when she got into the dress with her gloves for the first time to perform in the burlesque show. When she has her hair down and then magically it is all done up beautifully and she looks so elegant, it is an important aspect to the movie because it is also the first time Gypsy sees herself as something special and that she might actually be a star, not just a poor substitute to her sister. And the scenes where she slowly becomes more famous were rushed through. It was an important part of the movie and they butchered it. It is critical to show her becoming more comfortable with her future as a stripper and the costumes are amazing in these scenes in the original. It was a huge let down to watch it unfold in this movie. I was completely disappointed and had it not been for Bette Midler I would have shut the movie off.","Despite stellar orchestrations and a more faithful screenplay to the original Broadway production, this version of Gypsy suffers from a not-so-solid leading lady and a super cheap, dull production. On paper, Bette Midler seems ideal. She's loud, brassy, fun, can sing like an angel, and is a pretty great actress. Well, I don't know what went wrong, but Midler is terribly uneven. Don't get me wrong, she has her moments (the quieter scenes between Rose and Herbie, the songs \"small World\", \"You'll Never Get Away From Me\", and \"Small World (reprise)\", etc.), but all in all, she butchers her two biggest numbers (\"Everything's Coming Up Roses\" and \"Rose's Turn\") by over telegraphing and hamming them up. During the film's finale, it's actually pretty embarrassing to see such a talented actress deliver such a wonderfully written monologue in such a one note and goofy fashion. She reads more like a cartoon than a human being. Is it Bette's fault or the directors? Apparently, the director was dying during production and wasn't able to be as present as he'd hoped, so that left Bette to essentially direct herself, which is never a good idea given the heft of her role. This leaves us with one hell of a strange, over the top, and campy performance that isn't even enjoyable on a \"so bad, it's good\" level. Without a solid Madame Rose to lead the cast, poor Peter Reigert and Cynthia Gibb have very little to play off of. They both have their moments as well, but they can only do so much without a strong Rose to back them up. The production values are cheap and tacky, not to mention overly colorful for a tale about parental neglect and lost dreams. It's just a huge missed opportunity. The sets and furnishing would have probably been more at home in a Tim Burton movie than a fairly realistic musical. One wishes the marvelous Tyne Daly had been able to recreate her brilliant performance in this TV version. While not possessing the strongest voice, she gave Rose more pathos than anyone else I've ever seen. It's not all bad, though. The orchestrations are lovely and brassy and the screenplay is much more faithful to the stage version than the equally disappointing 1962 movie version starring Rosalind Russell and Natalie Wood. Worth a look for more forgiving Bette Midler fans.","I saw Tyne Daly in the 1991 Broadway revival of this classic and timeless musical. Tyne was fantastic so I hesitated to see the television movie with Bette Midler. Every actress has interpreted Mama Rose in their own way. Bette Midler won a Golden Globe and was nominated for an Emmy Award for her performance. This television adaptation is faithful to the musical production. I don't recall any outdoor scenes here and that's the only flaw. Bette Midler soars in the role. Cynthia Gibb is marvelous as Louise who becomes Gypsy Rose Lee. Peter Riegert was perfect as Herbie. It has a terrific supporting cast including Tony Shaloub, Michael Jeter, Ed Asner, Christine Ebersole and Andrea Martin. The director was the late Emile Ardolino (Dirty Dancing) and this film is dedicated in his memory. Bette Midler should have played this role on Broadway as well. She is electrifying and horrifying as the ultimate stage mother. Thankfully this version of Gypsy is on DVD and will be preserved forever as the faithful version to the musical.","Show queens will be arguing in 2059 when \"Gypsy\", the Broadway musical, turns 100. In the meantime, there probably will have been umpteen revivals on Broadway (one for next year is already rumored), and maybe even several more movie versions as has recently been announced as well with the legendary, if now too old Barbra Streisand. I have heard every recording of \"Gypsy\", from Merman, Lansbury, Tyne, Daly, Bernadette Peters, Patti LuPone, and two movie soundtracks with Rosalind Russell/Lisa Kirk and this version, featuring the phenomenal Bette Midler. When this first aired in 1993, I was working as a v.j. at a gay bar in West Hollywood, and was told to play this in a small portion of the bar, which got instant boo's from the crowd. Needless to say, within five minutes, it was back on in the entire bar.More than 20 years have gone by, and in comparing this to the 50+ year old Rosalind Russell movie, I have to say that this version outshines it. Bette is much more believable as the mother of youngsters, teenagers and eventually a young lady, and her devotion to her children is more believable than some of the older women who have played this part. Singing wonderfully with the dramatic flair that only Bette can, she truly is coming up Roses.Supported by a sweet Peter Riegert as the long-suffering Herbie and Cindy Gibbb as the initially shy Louise who ends up becoming the legendary Gypsy Rose Lee. Familiar stage, film and T.V. stars appear in bit parts, giving this T.V. version a friendly appeal. Even without saying a word, Michael Jeter's expressions say it all. Funny lady Andrea Martin adds flair in a bit as a secretary, while Christine Ebersole is a great headliner of the three strippers. All those bits include five Tony wins, not to mention Bette, soon to attack Dolly Levi. But any version of this classic musical is going to be judged by how the perfect score is performed, and it is without a doubt flawless. Colorful and perfect in period detail, this helped bring the T.V. musical back. Not live like recent entries, it is an amazing feat. Movie musicals have made a slight comeback on the big screen, but it took the step that the producers of this T.V. special did to speed that up. This is one musical that is fine with the gimmick it has. It doesn't need to add to the huge pot of paradise it is.","Bette, a talented performer and actress --(see the Rose, See Beaches) decides she doesn't have to act or do any character work at all  and merely prances about playing herself ruining what could have been a perfect opportunity to shine.Bette please stop being lazy and resting on your laurels;  a fault which many stars and actresses fall into  in their later careers and go back to square one and do your acting  homework. See the Roz Russell Version. One merely needs to compare any scene and the difference is obvious.","Such a highly-anticipated remake of a cherished musical classic and such a bitter pill it was to have to take.  Very, very hard to swallow...all of it. It didn't have an ounce of believability anywhere.  And when you don't have a Rose, you don't have a show.Bette Midler seemed born to play this part.  Yet, all she was able to produce was a cute, funny, glitzy, trademark Bette Midler...weighed down with all the familiar Midlerisms.  Roz Russell has nothing to worry about. She can rest in her grave knowing she is still the definitive Mama Rose (of film, anyway).I thought Midler was really going to put it across this time...to throw herself into what is one of the greatest musical roles of all time...like she did in \"The Rose.\"  But, no, she played it safe.  She played herself. She made Rose a total dinner-theatre cartoon.  Even her songs were uninspired. It was maddening to watch, knowing Midler has the talent to rise above her money-making schtick.  She showed promise only once in this \"Gypsy\" and that was with \"Rose's Turn.\"  But, by then it was too little, too late.A sincere Cynthia Gibb as the titular heroine gave the film its only true spark and when the role of Gypsy outshines that of Rose, you know there's trouble in River City.A huge, huge letdown.","Honestly I think Bette Midler was not the person to play this role. Her voice isn't right to portray a part like Mama Rose. Mama Rose has to have a forceful voice and powerful. Don't get me wrong, Bette Midler is a wonderful actress and amazing singer. It's just some people are right for certain roles and others aren't. Mrs. Midler acted to part extremely well and showed a side of Mama we've never seen before and thats the reason for her Golden Globe award acceptance.Before even taking upon myself to seeing this version, I took a trip to New York and attend a performance of the 2004 revival starring Bernie Peters and Tammy Blanchard. The entire show was amazing to perfection. Astounding performances form Mrs. Peters and Mrs. Blanchard, caring the show every step of the way.In comparison to the supporting casts in the T.V movie version, Mrs. Cynthia Gibbs (in the title role) gave an equally good performance and sang the part very well as well as Jennifer Rae Beck (Dainty June).*** out of ****","*The whereabouts of Al Capone*Who shot JFK?*Cynthia Gibb lands the part of \"Gypsy\" in the TV remakeThese are some of the great unsolved mysteries of the 20th century.  How else can I say it, except, I thought she was unredeemingly awful. Mannequin mannerisms, poor reactionary acting (ie: that blank, stoic stare while he co-star in the scene speaks)and a singing voice that most voice coaches would rate \"mediocre\".  But she is stunningly gorgeous and after all, wasn't that what the Gypsy character is all about?  Cashing in on her looks cuz' she didn't cut the mustard in the talent department?As for the rest... Bette is fantastic.  Whether or not she's playing herself or playing Mama Rose, it works either way, and I for one thought Rosalind Russell was as exciting as drywall in the original.  Peter Riegart as \"Herbie\" is the perfect understated foil to Bette's over-the-top Mama, and he's the medium-temperature porridge between Midler's hot dish and Gibb's stone cold mush.  Riegart is juuuust right.One final holler to the man responsible for decades to come of Cher jokes: Bob Mackie. Drag queens would kill for the glitz and glamour on display here.  Everything's coming up sequins and bugle beads!","The film was disappointing. I saw it on Broadway with Bernadette Peters and she was outstanding. Maybe as she, herself graps on to the end of her musical career, her condtion of desperatation lands her in role that she flaunts, re-invents and triumps as her own. Bette's singing is always belted, always flat and lacking to show her ability as an actress. To be entertaining, this performance was dying for a stronger lead and a stronger cast, so that the others would be memorable in Bette's absence. Another criticism: she smiles directly into the camera every time she start singing! I know it is musical theater, but please leave some grace sociale-- Middler cannot perform like Liza or Streisand might in a retrospective tour - out of character and out of context.","Bette Midler, Should have been given an Oscar for her role as the annoying but loverble starmum Rose, her portrayal of this larger than life character, was out of this world, to the degree of thinking she would cause herself an accident by bashing into one of the cameras, im sure she forgot they were there, also her daughter gypsy rose lee, was fantastic, and what a transformation from shy withdrawn girl, to mega confident star, it's just a shame i had never heard of this film untill i bought it 10 years after it was made."],"review-user":["terry-whittaker","sschimel","inmemoryofdivine","edwagreen","valmont7","westegg","Jvbway","JennLynn","Acapulqueno","sroimoi","mwp2paris","peacham","rps-2","HankyP","TheLittleSongbird","canslow_4","HorrorCreepshow","Syl","mark.waltz","Dgoldyn","gbrumburgh","evanmartin411","JZvezda","sbowersox1","trvwatson"],"review-date":["24 August 2005","15 December 2005","23 June 2006","27 December 2011","19 July 1999","10 May 2000","23 February 2006","8 August 1999","11 June 2005","29 March 2000","16 February 2008","30 November 1999","9 August 2007","20 June 2006","25 August 2011","25 November 2006","3 January 2012","18 February 2017","12 April 2016","13 March 2002","25 April 2001","6 June 2006","28 February 2003","17 August 2006","24 April 2003"],"review-rating":["8","9","10","10","10","7","7","10","9","9","8","3","6","9","10","5","3","7","4"],"review-title":[" Midler -v- Merman\n"," One of the Best...\n"," Bette Midler IS Mama Rose\n"," This Gypsy is Another Great Show ****\n"," It doesn't get any better\n"," Absolutely On Target\n"," A vast improvement from the first film\n"," The best there is to see\n"," Definitive\n"," Bette Midler is a Rose in full bloom\n"," An amazing interpretation of the ultimate musical\n"," Midler misses the Boat.\n"," Superb!\n"," Bette is NOT Rosalind Russell...\n"," A mighty fine Gysy\n"," This is a movie you should skip and instead show watch the original from 1962 with Natalie Wood.\n"," Midler nearly sinks this TV musical!\n"," Everything is Coming Roses for Me and For You!\n"," The arguments over who is the best Mama Rose will never die.\n"," Bette Sleep walks through Gypsy.\n"," Inferior in quality and talent - a big disappointment.\n"," Well My Opinion is..........!\n"," Butcha' gotta have a Gypsy, if ya' wanna' get applause\n"," A mother takes her two daughters on quest to find stardom\n"," WOW what performances.\n"]}