{"review-url":["http://www.imdb.com/title/tt0110657/reviews"],"review-text":["This is one of those harmless sequels that seems to draw unnecessary ire. This is a \"rip-off\" sequel, but the cast plays it well, and it's true to its formula.  Michael Ironside is a fine villain.  And Hillary Swank, who went on to win a Best Actress Oscar, shows sparkle and potential in the lead. There are many worse movies to rent to watch with your niece.  My score -- 6/10.","Here is introduced a new kid , girl , with the subsequently two times Oscarized Hilary Swank . This is an entertaining martial arts movie with the intimate Pat Morita (his final appearance as Keisake Miyagi) , and , as always , the show belongs to Noriyuki-Miyagi . The story deals with a troublesome teenage named Julie (a newcomer Hilary Swank) , thanks to Miyagi she aware that Karate is his salvation , as she battles an evil nemesis , facing off a violent young group trained by an expert fighter (Michael Ironside) . The Japanese Miyagi (Noriyuki, Pat Morita) born in Okinawa teaches his martial arts and to combat at a Zen temple along with some sympathetic monks . Meanwhile , Julie falls in love with a youngster (Chris Conrad) .This enjoyable movie , a sort of junior version of 'Rocky' , develops a sincere and deep friendship between two protagonists , the rookie young girl and the wise old man . Using more than his fists , Julie learns about herself and the sense of life . Agreeable and likable acting by main actors : Pat Morita and Hilary Swank . Furthermore , it appears as secondaries , the ordinary baddie : Michael Ironside , and the veteran Constance Towers who formerly worked in various films directed by John Ford . The picture contains adequate cinematography by Laszlo Kovacs and long-standing musical score , though with some disco-music , by Bill Conti , trilogy's usual . This feel-good message picture was professionally directed by Christopher Cain , though John G. Avildsen was originally slated to direct his fourth Karate Kid film but dropped out in order to make 8 seconds (1994) . The three previous films , all of them produced by Jerry Weintraub and directed by John G Avildsen , are the followings : original Karate Kid I (1984) in which are presented the classic characters , Karate Kid II (1986) where the protagonists travel to Okinawa and Part III(1989) where Daniel again battling nasty enemies . Rating : Acceptable and passable following , worthwhile seeing . This heartwarming will appeal to Karate Kid trilogy fans .","I remember watching this movie at the age of nine and being completely smitten by Hilary Swank as the feisty Julie. Now years on, the film seems to be unable to match the greatness of it three predecessors, but I am trying to re-collect the feelings I felt as a child, being mesmerised by the film, the characters, the build-up to fight scenes.The film is still fun to this day and it generally has some great moments that make it definitely worth ones time. The character Miyagi is still cool, I felt that we needed to see Julie learn a bit more Karate...But still it's a film that tries to journey into a new area...About finding one self and to a child this film genuinely excites.","Personally i have seen this movie about half a dozen times.I think it is great.Do not get me wrong,in my humble opinion the original karate kid(1984)with Ralph Macchio was better but Hilary Swank gets the job done nevertheless.An exciting story,a lot of action,a little bit of drama and sentimentality when it was required and exceptional acting;What is not to love?All that hate does not make any sense.Someone who liked the first movie should like this one too and even if you were not a big fan of the first movie you absolutely have to give it a try.Mr Miyagki for once more turns out to be an excellent teacher that every (karate)kid would want to have.This is a must see and it goes in my personal top 25 movies.","I thought this movie was going to be a disgrace to the series. After all, part 3 didn't measure up to part 2, and this one doesn't have Daniel Sawn. Miyagi's humour wasn't quite as witty in this one as in part 3, but it was funny enough to make the movie worth watching.The girl's part was pretty good. She's a lost teenager who needs direction. I find the plot a little hard to believe. That the aunt would simply agree to leave her home and her niece under the care of Mr. Miyagi, a man she just met. Of course, he was a friend of her brother.I did appreciate the monastery. One might think from some of my other reviews that I wouldn't have liked the dancing monks, but I thought it was amusing. It showed that they know how to have some fun. Now if these were monks in ancient China dancing to pop-music, that would have been another matter.Probably the most intelligent part of the movie was when the girl thought it was stupid that the monks wouldn't kill a bug. Miyagi told her that street gangs killing each other is stupid, nations trying to destroy each other is stupid, but having respect for all life is not stupid. Miyagi has expressed such wisdom in the other films as well.I give this movie a 4 out of 10. Sure, there were some things I liked about it. It wasn't as funny as part three, and no character could ever live up to Sato in part 2. This movie has no re-watch value. I can't imagine watching it again, but it is worth seeing once.","I cant believe that some people gave this such high marks! First off, I have a hard time believing that this group of thugs would be allowed to go around tormenting students, and sexually harassing girls. The principal OVERHEARS the head thug bullying Julie into meeting him \"at the docks...most girls have to BEG me for an invitation, and you're turning Me down?!?!\" Yet, even though he OVERHEARS this and SEES the girl trying to pull herself away from this dork, the Principal STILL sends HER to the office?!? Yea, right. You cant tell me she is the FIRST girl he has tormented, and you cant tell me that no girls went home and told their parents.It appears that the football coach (?) has his own private gang/ army and he allows them, encourages even, to torture others. He says \"If a student throws a piece of paper on the floor, you make them eat it\" Yea, RIGHT! This gang walks the halls together, dressed like a bunch of 1950 throw-back thugs, in their tight jeans and tight, matching black t-shirts, and black leather belts. GET REAL! And apparently, they also have the right to wander the halls of the school in the middle of the night. No parent would put up with this crap going on in their child's school. If MY kid came home, told me this crap was going on, you can bet Id be on the phone with state superintendent.The coach (?) beats up his students outside, on the field, in broad daylight. This is okay? My FAVORITE, though, was the coach telling his \"gang\" to blow up that dudes car.This whole thing was a joke. The thug busts out the guys windows on prom night and says \"MEET ME AT THE DOCKS\" OK, see, Id go inside Julies house, pick up the phone, call the cops and SAY\" Some crazy dude in a jeep just busted out my windows and told me to meet him at the docks if I was brave enough\" Then, let the cops go to the docks and find his jeep, and arrest his butt. This movie was just lame.","I really didn't think The Next Karate Kid was THAT bad. Flawed yes, but it is not terrible I don't think.As I have said, the film does have its flaws. The story is quite predictable and formulaic, though in its defence, the story wasn't necessarily a strong point in the previous three either. Second, the script has its weak spots, it did have its moments such as with Miyagi's humour. Third, there are some unrealistic moments here, the ending especially. Fourth, it isn't as efficiently paced as the first or third films.However, it is nicely filmed, the cinematography is good and the scenery is very nice. The soundtrack is pleasant, and the karate is good. The direction is good enough, and the characters are still at least engaging. The acting is decent, Hilary Swank is a worthy replacement for Ralph Macchio, while Pat Morita elevates this movie to a better level acting who is arguably the best character of the film and giving a strong performance in the process.Overall, it was pretty decent, and better than its reputation. It could have been better, but I have seen much worse movies. 6/10 Bethany Cox","Having seen the other Karate Kids, I was curious about this film, though I had never seen or even heard of it. The usual elements are back. New kid in town that struggles to adjust; a Mr. Miyagi that helps to instill self-confidence in the teen; and the climax of needing to use the recently learned karate in a pivotal fight scene. I was taken in both by Hilary Swank's character, expressing the range of emotions and soon willing to be positively formed (the Karate Kid characters are always so kinetic, aren't they?) and Mr. Miyagi as the walking book of Oriental proverbs. I loved it! Slow in some parts, but some intriguing scenes.","\"The Next Karate Kid\" is not a very impressive film.  However, it introduces a young actress named Hilary Swank to the mainstream audience.  Amazingly, just five short years after this film Swank would be holding the Oscar for her gender-bending role in \"Boys Don't Cry\".  In this film she takes Macchio's role and does an admirable job even though the material is just not there.  2.5 out of 5 stars.","I really like this movie and find it to be underrated. I like that this movie had new dynamic in some ways.Hilary Swank was really good as Julie. She portrayed a troubled adolescent really well and has an interesting relationship with Mr. Miyagi. Pat Morita is his usual amazing self.Eric made for a pretty cool supporting character and a nice love interest for Julie. I also loved getting to know Miyagi's friends.The training scenes and fight at the end were pretty well done. \"You Gotta Be\" by Des'ree is a fantastic song, too.The movie was not without it's silly moments and questionable elements of the plot, but overall I enjoyed it. Like I said, I found it refreshing that they tried something new with this.I wouldn't say it's anywhere near as good as the original Karate Kid or Part II, but I enjoyed it more than part III.RATING: B","Hillary Swank is an unattractive piece of work in this unattractive piece of work of a film. Pat Morita, desperate for work, any kind of work, agreed to reprise his role as the \"Karate teacher\" and bring his brand of Karate to the silver screen once again, except this time, Hillary \"skank\" Swank is the student.I can just see the Hollywood writers getting excited about the idea of having a \"tormented, spoiled brat\" female take the role from Ralph. The film does not work on any level and it's boring on every level. There's nothing interesting here and not even a lesson for anyone to hold on to. The film was made without any thought of making money because it's just so bad.I would gladly spit on all the actors in this film for having been involved with it and have the writers black-listed for their miserable and insulting efforts.","When I first saw this movie was included in the Karate Kid DVD Set, I almost thought about just buying Karate Kid by itself. But after watching it, I really enjoyed it. It was really cheesy at parts, but other parts were enjoyable and funny.Miyagi is great as usual, which is the main reason I even bothered to watch the movie in the first place. This movie is worth at least a one-time viewing if you really liked the Karate Kid movies.Hillary Swank did a pretty good job too. The plot was pretty hoaky, and it was similar to the first Karate Kid, but there was a different dynamic since the hero was a girl this time.","While I totally objected to this chapter ever being made, at least it had a young Hilary Swank (I seem to be her only male fan). While this film was kind of hokie and predictable, at least it accurately portrayed the horrors of men trying to shop for women. Pat Morita's performance in that scene alone was priceless. While this proved to be nothing more than a spin-off grasping at straws, at least no one completely embarrassed themselves. Also, where the heck was Ralph Macchio! Couldn't he have made a guest appearance. It's not like he had anything to do at the time.","Growing up as of child of the movies, one of the trilogies I shall not soon forget is that of the Karate Kid.  You can put down Ralph / Daniel all you want, but its the message behind the movies that are important, that its important to be respectful to all creatures great and small, but stand up for yourself when the time calls for it.  Getting back to the movie at hand, its rather funny because, I saw Boys Don't Cry and was really impressed with the performance of Hillary Swank, and in flipping through the sea of channels the other night, I came across the showing of this film and I hadn't realized at the time of my first viewing of this movie that she was in it. The story centers around Julie, just like Daniel, not knowing where to fit in or if she even wants to fit in and the master teacher is brought in to help straighten her out and guide her.  I really liked this addition to the series as it gave a good feminine side to the story and yes, even some outfits that Hillary were in kept me, shall we say stimulated.Overall 3.5 out of 5","After several referrals from friends and hearing their incessant quoting, I decided to see this film. I grew up with the Macchio movies, but never had the pleasure of watching this train wreck of a movie.We meet Swank's character, and with no regard for subtlety, we learn her story: teenage girl, parents died, mad at life, no respect, looks like a dude. To show her defiance, she sneaks out a lot. Where does she go? That's right. Swank visits an injured hawk on the top of her school building that she feeds raw meat to every other day. Genius.Jester from Top Gun is the Faux Cobra Kai's sensai. It's depressing to watch Michael Ironside's career take a nose dive (get it) with each of his scenes. \"Absolutely.\" The FBK is pretty ridiculous. Somehow they get away with trespassing, vandalism, arson, property damage and assault because they are some sort of pseudo-ROTC. And what was with the prom-night bungee-jump scene? The love connection between the two homosexuals (Swank and Conrad) is entertaining. As is the first fight scene at the gas station. Miyagi taming a vicious Doberman, and the owner of the dog picking a fight with him because of it? . And of course, watching Swank perform Karate moves is nothing short of hysterical.Best Line of the Movie: Miyagi explains to Swank, \"Your Grandpa saved Miyagi life... a long time ago... so Miyagi tried to say thank you... teach him karate. He love Karate. He teach your father. Your father teach you.\" To which Swank replies, \"And then they died. Everybody died.\" Awesome. It was this scene and the delivery of that line that I learned the real range of Swank's talents. I also projected what I was drinking out of my mouth across the room. How this was the jump-off to Swank's career, I have no idea.It's just sad this movie was the last thing we will remember from Pat Morita's acting career. I understand he needed the money, but this is a travesty towards his memory. RIP, Morita. We forgive you.","When the third came out, I knew they would soon run out of steam. But then I saw the fourth and changed my mind just a little. The Karate Kid 2 managed to entertain me enough without making it seem like the fourth attempt to keep milking the original.In this fourth installment, the boy has left and in place is a girl. She's a teenager and has lost her parents so her attitude and mood are affected by that. However, when the great karate master in the past three films comes to \"babysit\" for a while, things get tense.At first the girl is annoyed by him as she was her aunt (I believe), however after much time and a trip to see Monks, the girl soon becomes happy. Soon she gets a date to prom and then of course, things get crazy! But that's for you to find out!Anyway, I rate this 7/10.","For once a sequel to \"The Karate Kid\" without Ralph Macchio! Hilary Swank did an excellent job playing the orphan Julie Pierce. Pat Morita, the one who plays Mr. Miyagi worked his way with Julie quite different from Daniel. Both Daniel and Julie favored karate. Unlike Daniel, Julie was the most surly person Miyagi ever challenged. And there was no tournament to compete in. And there's gonna be some humor in this movie as well. I liked the part where when Julie came home from school, Miyagi went to check on her, and saw her change clothes in the process. That was very funny! And the classic \"Wax on, Wax off\" scene was different as well. It was funny when Miyagi tells Julie, \"Uh-oh, missed spot\". The set in Boston was a far cry from California. The Militant group in that group, was like the \"Cobra Kai\" in Boston. And Michael Ironside's Col. Dugan was no John Kreese. His group practically deserted him when Julie kicked some serious butt. They all paid the price when they blew up that classic Oldsmoblie. What a cowardly act. At least they'll find redemption from Dugan's poison. This Karate Kid sets some morals, unlike the last three, which talked about \"Honor\" and \"Respect\". Hilary Swank is outstandingly hot in any movie and everything else she does. Movie 9, Hilary Swank 10!","\"The Next Karate Kid\" is a thoroughly predictable movie, just like its predecessors. Its predictability often results in a feeling of impatience on the viewer's part, who often wishes the story could move a little faster. Despite its lulls and its extreme familiarity, however, this fourth entry in the series is painless, almost exclusively because of the presence of Morita. He doesn't seem tired of his role, and he does inject some life and humor into the film, becoming the best reason for you to see it. Not awful, but nothing much, either.","I thought this movie was great, if you didn't take it too seriously.  Just sit back and enjoy Hilary Swank in all her greatness and laugh when the monks go to Boston, MA.  I also think this movie has a great message about self control and inner strength.  Plus Mr. Myagi was so sweet, I wish he'd teach me karate!","I had been avoiding this movie for sometime...because I viewed it as an unneccesary installment to a series that should have only had 2 parts. But, after reading some fairly favorable reviews...from some IMDB watchers...I spent $1.50 and rented it at my local video store. Need I go further...when I say....this was a buck-50 lost. This movie is one of the 10 worst movies I have ever seen. First off....I realize that noone wanted to see a 33 year old Macchio in this film.....But, why could'nt they have had Miyagi read a letter or something from Daniel-san...maybe explaining what happened to Daniel...hell, they could have at least made a quick mention of daniel or something. But, no...and to compund the already bad script....they added those stupid monks...I thought monks take a vow of silence...guess these yapping monks don't take their vows seriously...hehehe. The training the girl went through in the movie was hurried and stupid...and the paramilitary group of young males....were a confusing concept to say the least....this was far from even being a martial arts movie...with the girl only fighting briefly in the final scene....and then she didn't even come close to getting hit even once...by the male fighting her....give me a break...she would have gotten hit at least once....I guess the writers and directors thought it would be to shocking to see a girl get punched by a male in this one. I could go on and on...but, basically...I'll end by saying that this movie was just so bad....even the girl they chose wasn't nice to even look at(she was sorta \"butch\" looking)....I can only think of a handful of movies that I have sit through...that compare to just how bad this flick was.....DON\"T WASTE YOUR TIME ON THIS ONE..........","This film is so bad. I mean, who commissions this stuff? And the costume designer deserves an award for making everyone look like they had just stepped out of 1983. A bloke puts a female wig on and fights....nuff said.","A Mr.Miyagi is done in the fourth Karate Kid when the sexy female actor is befriended by Miyagi-san. He is god-father to her. Her dad died for some reason.Miyagi-san decided to train her because of the really unreal segment where she jumps onto the hood of a car to escape being dusted by it.In the scene mentioned in my proposed Mr.Miyagi move, Miyagi-san tweaks the nose of the bad guy.Am I remembering the right movie here? i rate this movie 10/10 especially the scene where Miyagi sees his new pupil in underwear.not a problem with the boy, but see girl half naked bad.","The IMDb voters have been unusually cruel to this film. While it isn't by any means great, I like it and find the 95 minutes or so to be very enjoyable. We now know that then 19-year-old Hilary Swank later won an Oscar for her performance in BOYS DON'T CRY, and here she was already a beautiful young woman and a credible actress. As usual, Pat Morita is perfect as the gentle, stoic martial arts expert who always prefers avoiding a fight, but says, \"If you must fight, then win. (wink and smile).\"some SPOILERS follow, read at your considered discretion...Young Julie lost both parents in an accident and is mad at the world, her only connection seems to be an injured hawk that she cares for on the roof of the school building. Mr Miyagi was her grandfather's pal in the war, and offers to help young Julie cope with life and school. She gets expelled for two weeks on bogus grounds, but she and Miyagi use the time to visit monks and there she perfects her Karate skills.Back at school, she gets a prom date, Miyagi buys her a pretty dress, teaches her how to waltz, but the mean kids hassle them, leads to a showdown on the piers, they burn his car, Miyagi and Julie show up, she kicks the bad kid's butt, Miyagi subdues the teacher, martial arts instructor, and everyone lives happily thereafter.OK, it is greatly contrived. You can't become that good in two weeks at a monastery. Julie just too easily falls under the guidance of Mr Miyagi. The tough kids at school are too much of a cliche'. But the overall message is good, the need to find yourself, to look for the good in yourself and others, to respect all life, even the cockroach. Most of us like a story where the bad guys get put in their places. And the pretty but sad young girl becomes happy. Swank and Morita are a joy to watch, and I will watch it again.The DVD picture and sound are fine, nothing special. No meaningful extras.","Pat Morita, Hilary Swank, Chris Conrad, Constance Towers, and Michael Ironside star in this 1994 drama sequel. In this chapter, Mr. Miyagi (Morita) attends a WWII ceremony in Boston, MA honoring him and his late friend. He visits his friend's widow, Louisa (Towers) and meets her granddaughter, Julie (Swank). He notices that Julie is angry because her parents are dead and takes her anger out on Louisa. He asks Louisa to spend time in his house in California while he helps Julie. He takes Julie under his wing teaching her karate to defend herself against bullies in school and regain her self-confidence. Julie also meets Eric (Conrad), a boy in school who's a cadet for the air force and they fall for each other. Eric and Julie face the same bullies in league with Col. Dugan (Ironside) who's a war nut. This is a pretty good sequel, Morita and Swank are great together and Bill Conti's score is excellent as usual. I recommend this.","THE NEXT KARATE KID, in my opinion, is an excellent martial arts flick. I thought that Eric (Chris Conrad) and Julie (Hilary Swank) looked good in their prom attire. To me, Ned (Michael Cavalieri) was a real bully. This was because he got Julie in trouble with Principal Wilkes (Eugene Boles). If you ask me, Colonel Dugan (Michael Ironside) was a pure a******! This was because he was a very harsh man who wouldn't tolerate mistakes. My favorite parts were the prom and the showdown between Julie and the Alpha Elite. In conclusion, I highly recommend this smash hit to all of you who like martial-arts flicks or are fans of Hilary Swank."],"review-user":["aromatic-2","ma-cortes","Angelus2","Chamilakisgeorgios","thewag777","jana_obrien","TheLittleSongbird","regahsof","tfrizzell","carologletree","jtpaladin","ckhosra1","Agent10","DaWeas007","jmderham-1","robert-710-767167","GOWBTW","gridoon","brownmonky","mag7_1","argostemp","shkawamoto-1","TxMike","gwnightscream","Catherine_Grace_Zeh"],"review-date":["8 January 2001","7 March 2010","13 June 2010","21 April 2014","24 February 2005","12 June 2011","13 July 2010","16 January 2013","3 August 2000","10 January 2016","19 December 2004","22 October 2005","8 August 2002","17 August 2000","25 August 2010","2 April 2012","9 February 2005","15 January 2000","29 March 2000","11 June 2003","26 October 2003","1 March 2005","15 May 2003","4 March 2012","18 November 2005"],"review-rating":["6","6","8","9","4","2","6","7","7","1","6","5","8","1","7","9","4","8","2","1","5","10"],"review-title":[" Harmless fun\n"," This fourth part is a remake with a sensational actress , Hilary Swank and the usual, Pat Morita\n"," Not a lot of Karate but still rocks!\n"," The Next Karate Kid,Why so much hate?\n"," It doesn't completely suck\n"," Give Me a Break\n"," Better than its reputation, but it could have been better as well\n"," Rather delightful\n"," The Film That Introduced Hilary Swank to the Mainstream Audience\n"," I Actually Enjoyed This One\n"," Swank stank\n"," Not as bad as I expected\n"," Could have been better\n"," Held up to the legend.....\n"," Abomination\n"," Almost better than the third\n"," It should be called Karate Kid: The Next Generation\n"," Oh, so familiar....\n"," Lighten up, it was a fun movie!\n"," Oh well,I could've just flushed that $1.50...*minor Spoilers*\n"," Really Bad\n"," Mr Miyagi tweaks nose of bad guy\n"," Pygmalion, with a Karate twist.\n"," Pretty Good Sequel!\n"," Excellent martial arts flick!\n"]}