{"review-url":["http://www.imdb.com/title/tt0126568/reviews"],"review-text":["Having sat through several Casper Van Dien movies in the past, and not being very impressed by them (except for STARSHIP TROOPERS) from both Van Dien's acting style to the quality of the rest of the movies, I put off seeing this movie. The only reason why I watched it was that I bought this movie as part of a double feature DVD (with the other movie being the excellent Dolph Lundgren actioner THE PEACEKEEPER).There are a few positive things I found in this movie. The movie has good production values, a trademark of Millennium Films/Nu Image film companies. The cinematography is good, and the movie doesn't look really cheap at any moment. (And it was nice to see a movie from these guys that wasn't shot in Bulgaria.) There is some nice gratuitous nudity, and the story has multiple plot threads that get you curious as to how they will all be resolved at the end.But I didn't think that the movie worked overall for several reasons. There is a lack of sympathetic characters, for one thing - you'll wish they will all end up dead. The script also moves very slowly after a while - there should have been more action or big plot turns throughout the narrative. You have to wait for the last twenty minutes before things start to seriously move and things start resolving themselves.Still, it could have been worse. I've seen worse Van Dien movies (and worse Van Dien performances.) If you are pressed to watch a Van Dien movie that's not STARSHIP TROOPERS, this is probably the one to watch.","My tolerance for shlocky direction was overwhelmed by some of the choices in this could-be-really-good time-waster.When the \"romantic\" intervals were of a nature to take me out of the story and into \"How-and-why-did-the-movie-maker-do-/that/?\" mode, you got to figure something is missing in there; restraint and tastefulness, I think.Brian Brown is a capable, empathetic actor - usually. I think he didn't like the project or the people, and it shows. I don't remember anything the other guy did. Can't even picture his face.On the other hand, it doesn't have to be any good to be entertaining; some of the vignettes and twists are fun and even ingenious.I watched this movie ($2.00 purchase at the vid rental place) against the advice of the screenwriter; I understand he was tempted to remove his name from the credits. Matter of pride, I bet.","I had mixed feelings about this movie. It started off slowly and I almost quit watching. But after the first 30 minutes, the plot became a little more clear and the movie improved. Still, the acting was not very good. I had some trouble making out the dialogue. And the \"love scenes\" bordered on porn. Interesting ending. Men will like this movie better than women. It's definitely a guys' flick.","This film starts out with all the moody promise of a great contemporary noir Western - after the ill-conceived opening flashback sequence anyway.  The scenery is beautifully desolate, the characters achingly isolated. While some of the acting is less than believable, the plot ultimately delivers enough tension and twists to make this movie worth a look.","This movie was actually quite engrossing most of the time. It was a pretty dime-a-dozen standard story, but it had an attractive cast (Van Dien's Jake and the two females in particular - man, that Rosie has got breasts to kill for!), very decent acting, and a very well told story, at least until the sadly disappointing end. The plot keeps you guessing, because it can go in many different directions and there're lots of different motivations involved (money, love, friendship, loyalty). Ultimately, however, it fails to show us what the characters are thinking (like, why didn't Jake confide in Rosie?), and the end, where almost everybody doublecrosses everybody, was not satisfying to me. It is unclear if Jake was on the mafia boss' (Lazarco, or whatever his name was) payroll all along; if he were, it would make sense (and make the movie better), but we should have gotten some clues to that effect in the course of the story. As it were, the writing failed to add coherency to an otherwise very promising little story about the basic hopes and desires of the people on the moral underbelly of society.5 out of 10.","I first saw this movie in the night program of one of my favourite TV channels.... I was hooked from the very first minute. Nothing is as it first seems, lots of suspense, great acting from Mr. van Dien, and I did not mind the \"heat\" in it one bit ;-) ... and, best of all: You are in for a surprise ending!!!","I bought this for £1 and was not sure what to expect. There are some fairly recognisable names but strictly B-C grade actors at best.Casper Van Dien is the likable guy called Jake who happens to work in a bank as a security guard. He has some criminal history which is revealed in the poorly staged opening sequence. Camilla Overbye Roos (whom I have never heard of before) plays Kristen an attractive femme fatale, who is part of a plot to trap Jake and coerce him into stealing money from the Bank.Australian actor Bryan Brown plays Barry, he has been planning a bank job and coerced Kristen into ensnaring Jake. He is a violent man and believes he has control over Kristen and owns her, but all is not as it seems.Then we have Daniel Baldwin as Ed the owner of the bank who deals with some shady characters and occasionally launders Money.We also have Jakes former partner in crime Sykes played by Bentley Mitchum (also a new face to me). A psychotic redneck type who is not too bright and has come looking for payback.Then last but most definitely not least is Rosalita played by the incredibly well endowed Rochelle Swanson. A fiery Mexican Brunette who is so hot she positively sizzles. She is the wife of Ed (the Bank Owner) and is having an affair with Jake whilst also planning to rob the bank with him.This movie is styled along the lines of U-Turn, Red Rock West etc. Most of the Characters are in a situation they are looking for a way out of and deception and double-crosses are never far from their minds.The acting from Casper Van dien was okay, Rochelle Swanson was good. The rest of the cast ranged from passable to not so convincing. Still I found this movie to be a quite enjoyable and very watchable experience. For the price it was certainly worth it and past the time quite efficiently. 6/10","classic Western script , full of usual tricks, few sex scenes slices, Casper Van Dien in common role and not bad and not surprising ball of stories. tension is guaranteed and, for large number of viewers , that fact is the essence. a fake show if the expectations are too high. but not too far for to seem be a decent movie. because the recipes is respected, the acting is nice exercise to convince, the waterfall of events , predictable,represents a good choice. bad guys, good guy, victims from/of past. action, delicate flavor from classic films noir, and the impression, after its end, than it could be better but , for a TV film, is enough to be easy entertainment.","I really enjoyed this film,  I thought Bryan Brown and Danial Baldwin were great in this film.  It would have to be Casper Van dien's only good movie. I thought this movie had a great story with a hole lot of really excellent twists.  All and all a very good thriller that I would recommend you see.9/10","Border of El Paso with Juarez City must be very hot area. Americans may use to cross the border to find sexy entertainment, and this is shown in this film. In the other US side there is a bank that everybody wants to rob, including his guard, who is living a romance with the wife's owner of the bank. The end of the film is really funny and interesting, some scenes are unexpected by film watchers.","On the Border is only one of films who use pieces from the film noire and western for a not surprise cocktail of love, secrets, revenge and money. far to be a bad movie, it is one with precise target. so, the recipes is the same for low cost productions with similar theme. the good guy who is almost gray, the bad guy, the woman between them. and few scenes of sex, as spice. short, a film with Casper Van Dien and Daniel Baldwin. nothing more. characters as old clothes, dialogues as sketches of confrontations, ambiguous plans and intentions.a nice film who preserves rules of genre and could be a kind of copy of many other classic thrillers.","Casper Van Dien... what can I say? I enjoy the guy! His movies bring a certain flair to them that is actually not brought on by the director or producer, but by him! Recycled plots... check. Rip-offs of better movies... check. Wooden acting... check. It's not that Van Dien is a bad actor (he has been effective in Hollywood gloss as Starship Troopers and Sleepy Hollow) he just really has not been offered a script worthy of his talents; and yes, he does have acting talent other than being eye-candy. This movie offers a slight hint of what Van Dien can offer but is bogged down by the production of it all. The script can be better developed (see Oliver Stone's U-Turn). The directing can be better utilized (see Robert Rodriguez's From Dusk Til Dawn). The DP could've made the desert more exotic (see Russ Meyer's Faster Pussycat Faster Kill!). This script is weak because this is something we have seen before many other times so the double/triple-crosses are expected. The direction is weak because it is not offering anything new and telegraphs many of the weak script moments. The cinematography at times paints a lovely autumn desert flavor to it, but at other times it doesn't take advantage of the scorching light and the beginning sequence is horrible in cornflower blue.Now to the acting... Van Dien shows some grace and charisma to his Jake. He neither gets too methodical nor too campy in his role. A nice balance especially since the rest of the cast seems too distracted as to how they should be acting in this film (bad script or bad direction... you make your opinion). The only other person worth mentioning is Bryan Brown's villain as it provides the only real credit for acting in this film... aspiring actors forget trying to learn how to act in green screen, try learning how to act in a horrendous script and take notes on Bryan Brown in this film. He adds extra depth to his role and is a nice counter part to Van Dien's character. Jake always seem to either be one step ahead or control of any situation whether if it is out of his control. The femme fatale is weak (this is a desert noir after all) and is another nail in this film's coffin (you decide... script or direction). The Rosalita character should've been thrusted forward in the movie instead of being pushed into the back ground later on to make room for the real femme fatale. So watch the film for Van Dien and Brown; and for fun, try to skip a rock across the plot holes laced within the film.","This movie is a compilation of many others.  Studly loser from the big city is tagging the boss' wife/high society type and local beauty while planning bank robbery in a dusty town and winds up w/o the dough.(Don Johnson from The Hot Spot)  New babe moves in and cleans the desert outpost. (Lone Wolf McQuade) How can we double cross the double-crossers? (Sharkey's Machine, Sunset, and the best of them all: Charley Varrick)  The women (both) must be on top to writhe on Casper Van Dien in what I now call the \"Sharon Stone Position\" based upon the bronco riding style used in Basic Instinct.  Oh, the list goes on.  Did you notice the goof where they leave in Van Dien's blue Suburban to rob the bank but pull up in the new SUV? Read John D. MacDonald's \"Bordertown Girl\" for a better evening.","This film is one of those that can't be regarded by its outwardness. Indeed, at a first sight, it seems that the story simply focus the desire of have more money. But..let's take a look on the other side...What do you see? You see that the money is only a metaphor for the ambiguous feelings the human being have:Should I do the right thing, or should't I? And... what's the \"right thing\"? Le's make a deeper analyses... -What does it mean a little town in the border? - It means that sometimes we can go too close to the border of  doing something we thought we couldn't... - What does it mean the arid soil shown in this picture? - It means the dryness that sometimes take possession ot our offensed hearts... - What does it mean the phrase of the character (KRISTEN) :\"Now I belong to him\"? - It means the loss of our free will, due to our unpremeditated deeds. In MY OPINION that's the writer of the story and the director tried to \"tell\" us. By the way...do you remember what another character (JACK BARNES)said:\"Nothing is so simple...\"","This was a crappy, miserably acted movie based on sublimated male fantasies. A shame that it was based in Texas, an otherwise excellent state.  I would recommend this movie to no-one, and wish that it had never entered my consciousness as I am now so irritated that I wasted my brain cells even paying the slightest attention to it.","This movie was absolutely one of the worst movies I have ever seen. The plot could have been made to work, had the movie been written better. The acting was some of the worst I have ever seen. I was very slow and made me want to leave/turn off the movie several times. I watched the entire movie in the hopes that the ending would make it worthwhile but it didn't. this movie I think should be rated in the negative numbers. (In my humble opinion)"],"review-user":["Wizard-8","frank-1132","tpendleton","coyote1","sarastro7","not4sale2you","med_1978","Vincentiu","mr_pivac1985","esteban1747","Kirpianuscus","pistolaro_amigo","Brewski-2","shatguintruo","sis-11","shreddly"],"review-date":["14 December 2009","14 July 2008","22 January 2000","16 November 1999","19 July 2004","10 May 2003","9 August 2009","12 June 2014","1 March 2003","2 July 2002","1 June 2016","26 August 2009","29 June 2000","12 February 2000","27 November 1999","18 October 1999"],"review-rating":["4","5","10","5","10","6","5","4","9","1","1"],"review-title":[" A bit above average for a Van Dien movie\n"," The sum is much, much less than the total of its parts.\n"," Mixed feelings\n"," An enjoyably moody, though ultimately flawed, action drama.\n"," Pleasant enough\n"," Great movie - good acting!\n"," An enjoyable low budget Neo-Noir, with a desolate setting, the acting sometimes fails to convince though,\n"," fake. but not at whole\n"," Enjoyable.\n"," A mixed robbery of a bank\n"," nice\n"," Staying on the DVD shelf\n"," It is better than pounding on your thumb with a hammer\n"," A COIN HAS TWO FACES...\n"," annoyed criticism\n"," Worse than porn quality\n"]}