{"review-url":["http://www.imdb.com/title/tt0108211/reviews"],"review-text":["I can believe this movie will be a serious disappointment for a person, who is used to and likes to watch Hollywood war movies. Four reasons: 1. It's made in a world, where movie makers tries to have some personality. If you think 'When We Were Soldiers'... well, there are hundreds of directors who you can imagine making a similar war movie with personality and values of a hamburger.2. Screenplay has a different structure. There's no shocking opening scene like in 'Saving Private Ryan'. This movie starts slowly in a very nice place and ends slowly in a very bad place, without hope or feeling that the characters have achieved something by their heroic actions.3. It is first a movie about lost causes in the world of war, and only secondly a war movie which takes place in Stalingrad.4. War scenes portray the horror, insecurity and confusion of a battle, instead of how cool, heroic and exciting fighting looks like. In this sense, this movie is closer to reality than most of the war movies you will ever see. 'Thin Red Line' also had similar \"I would probably crap in my pants in that situation\"-feeling.Stalingrad, whether you think it as a movie or a war movie has so many good things in it... like honesty. Even the ordinary German soldiers were dreaming about farms in Russia when they were advancing. What a disappointment they must have had in Stalingrad! If you like to watch war movies, meaning also other war movies than When We Were Soldiers or Saving Private Ryan, you should see this one. (9/10)","This film affected me on many emotional levels. I saw the results of the war in East and West Berlin in 1957. While in Berlin I lived with a girl my age who lost her father in the battle for Stalingrad. Her tales made my hair stand on end as he was one of the many young Germans send there to fight as a punishment for errors,(read that as failure to win), in other battle zones.It isn't well understood, but the Eastern Front was used as a threat and as a punishment by Hitler. Even Schindler in the film Schindler's List used that threat on the train station in order to get his bookkeeper released from the death train.There are two scenes that will haunt be for the rest of my life:The scene where Lt. Hans von Witzland, played by a very young and splendid Thomas Kretschmann, and the Russian actress Dana Vavrova who plays Irina.That scene is so emotionally charged that it left both actors physically shaking. I can't imagine having to repeat that scene more than once. To have to hold that raw, totally exposed feeling/expression and body language while lights are adjusted and a different angle is used must have been physically and mentally exhausting for these two brilliant actors. They perform a brutal Dance Macabre that is both horrific and fascinating. This scene is no longer about an enemy and the one who has been conquered. It is about a young man desperate to find one moment of humanity on an endless nightmare and a young woman who hates him and herself and yet can not resolve her situation. That he is a German and she is Russian is not as important as that they are both souls in torment with no way out.The human agony of that scene is superior to anything I have seen in over 60 years of watching movies.The other is the final scene between Dominique Horwitz and Kretschmann as Fritz and Hans clinging to each other overwhelmed and miniaturized by the vast Russian winter.That final scene reminds me of Napoleon's death march from Moscow in 1812. The results were to same. No enemy can come marching into Russia and live to march out again.I began watching this film firmly committed to cheering the Russians and hating the Germans.By the end I was crying for them all.That is the message of this fine film. War is a waste...a waste of human lives, of property, and of moral and religious focus.This is a classic anti-war film not unlike All Quiet on the Western Front or What Price Glory.","I first saw Stalingrad about 7 years ago and to this day it still hits me as hard as the first time I watched it. It is the story of Leutnant von Witzland, Unteroffizier Rohleder, Obergefreiter Reiser, and Oberschütze Müller and their desperate fight for survival in the deadliest battle in the history of war: STALINGRAD. The film starts off in Italy in the summer of 1942 where their platoon is resting following heavy combat in North Africa. Soon they are on a train heading for the Eastern Front. The men of 1st Platoon laugh and joke, play games, write letters home, and enjoy the view of western Russia as they head for the Ukraine. This is as light-hearted as the film gets. What follows is a very accurate and graphic portrayal of the infamous battle. It pulls no punches. It's main antagonist is Hauptmann Haller, a field police officer who thinks nothing of allowing his men to abuse and murder Russian and Ukrainian prisoners. At one point he lines up a group of civilians and has them shot saying they were partisans.The combat scenes themselves are even more horrific. In one scene a German soldier hits a Russian over the head with a shovel as the Russian is trying to kill Ltn. von Witzland. In another scene a German soldier is cut in half by a Russian tank shell. There are many other gruesome scenes in the film, but they are necessary. The world has to see what happened in the Battle of Stalingrad. To see its brutality. To have its heart broken at the horrendous waste of the soldiers' lives. Over 2 million people lost there lives. Only 6000 of Field Marshal Paulus' 250,000-man 6th Army survived the battle. As with the battle, the film itself does not have a happy ending. And that's the way it should be. And as you watch this film, remember one thing, not every German soldier who fought in the war was a criminal. They were mostly decent people caught up in events well beyond their control.","'The Finest Ambition of the Solider is to prevent war from ever  happening, but it has always been out of their hands. It is in the  hands of men whom they do not even know.'  Saving Private Ryan, Das Boots, Thin Red Line, When We Were soldiers.  then there is Stalingrad! A perfect masterpiece. The acting and filming  in this movie is top notch! I also think the music in this movie is  great and fits the movie perfectly. Stalingrad holds no punches back in  depicting the siege of Stalingrad by the German Army and ultimately  their defeat in the cold bitter Russian winter! As far as a 'war' movie  goes, I would give honors to Stalingrad over Saving Private Ryan and  even Liberal Hollywood's take on the siege of Stalingrad (from the  Soviet point of view): Enemy At The Gates. Saving Private Ryan, though  a great film, just doesn't bring the horror of war down to the common  foot solider as accurately as Stalingrad. Enemy At The Gates is simply  an awful movie.  Of course with such a movie will come a lot of political overtones.  I'll make just a few comments here. One, I am very thankful the allies  won World War II. Secondly, when I think of 'Nazis', I think of Hitler  and all of his cronies and all the evil villains who executed the  millions of innocent Jews in the concentration camps. I believe a  majority of Americans believe this way. The German soldiers fighting on  the front(s) were simply following orders and bravely fought in this  War as did the American, Russians and British soldiers and to each was  their own personal Hell. The sad fact about Stalingrad, in watching  this movie, is that all of this really happened. Men froze and starve  to death millions of people were killed and generations were lost.  Basically, this is a good War movie that ends with no heroism and  accurately portrays the horror of war for the common man regardless of  witch uniform they are wearing.  'Freedom is just a word until you lose it.'","This is a film that I keep coming back to, for a variety of reasons. As a testament to the suffering of the ordinary soldier on the Eastern Front in the Second World War, it is a powerful one. There are a number of very powerful scenes in the film which help to capture the horror of war, such as the tank battle for instance. Furthermore, from what I can see the experiences documented in the film are by and large 'true' - if you read A. Beevor's book 'Stalingrad' you will know what I mean. The film is also successful in the sense that it doesn't allow character or plot to dominate it - it is simply a tale of survival, that attempts to depict the battle mainly from the ordinary (German) soldier's point of view. I've read somewhere that the original screenplay had to be toned down, which doesn't surprise me at all - if they tried to really show what the battle was like, it would have been almost impossible to make I'm sure. Even so, there are still some moments that are difficult to watch - this was made before Private Ryan but is possibly even harder-hitting in places. Just one word of caution - don't buy the dubbed 'English' version, it's pretty awful and spoils the film - try to get a copy in the original (German) version with English subtitles, it's far more powerful. You may need to buy a Region 1 DVD of the film in this case, as I did.","Absorbing, horrendous descent into the nightmare of combat. Focusing on the invading German army (into the Soviet Union) in the second world war, the impact no less awful. These men are enlisted men, who had no more control over their government's criminal actions, than US troops had over their government during the Vietnam War. Or any government sending their military in any war, for that matter. To assume they could belies a certain lack of acquaintance or experience, with the structure of a military organization.These men are trapped like rats, and survival at any cost, to preserve ones life is paramount. Politics and lofty notions fly out the window, as the veneer of civilized behavior is stripped off.STALINGRAD is gripping, grotesque, poignant and pitiful in its graphic presentation of war time experience. Highly recommended.","Stalingrad should be ranked right up there among the top World War II movies ever made. I can't say it's the best but it certainly is a great film and is under rated in its importance. What the movie is about is simple. It shows the German soldiers war on the Russian front, in Stalingrad from the point of view of a few German soldiers. It should not be viewed with the intentions of seeing the battle of Stalingrad or any strategic view of the Russian Front. This is from the eyes of a select few. You won't see the broad picture. Just like the average soldier doesn't see it. He knows and sees the part of the war that is directly around him. That is his world and that is how you will see it. It's often very graphic and brutally honest in its depictions. The cold and the feeling of hopelessness were excellently portrayed. You could just feel it. I did have one major problem with the German English barrier. I watched this on DVD. It was dubbed in English and I chose to also play it with English subtitles. I started to see that frequently the subtitles and the dubbing were different. That was annoying hearing one thing and reading different words for the same lines. I soon shut off the subtitles and started watching it over again from the beginning without the subtitles. I have no idea if the subtitles or the dubbing was the more accurate translation. I'm very glad I viewed this film and I'm sure that I will watch it a second time. Highly recommended. A must see for the historian and war movie fan.","The people of my generation and those who are older know about the WW II (or as it is called in Russia – the Great Patriotic War) not only from the school textbooks, but from the witnesses and participants of the event. My granddad was a soldier at Stalingrad and when I was a small girl I used to listen to his stories of how he defeated the Germans. He also told me some anecdotes, not all he told me was gloomy. But it was long ago, and no when I have a conscious interest for what happened there in the battle of Stalingrad, I have to turn to books and movies for information. Somehow most films I saw were made in the Soviet Union, only a few in present day Russia. And “Stalingrad” is an exception. In the movie the war is described from the opposite side, and the fact in itself is interesting. All that is shown in the film is quite different from what I’m used to.The film reminds me a great deal of Remarque’s “Zeit zu leben und Zeit zu sterben”, because the war is shown through an ordinary German soldier perception. And this soldier or lieutenant is rather obsessed by repeating he is by no means a fascist. The movie heroes right from neat and enthusiastic Europe, from the Italian coast arrive in the snow-covered hungry Soviet Union. They are doomed to die; it is clear from the very beginning.After the elite detachment had taken part in their first fight at Stalingrad, one of the soldiers said the phrase which reflected the whole idea for me; he said “If you start thinking, you will go mad”. And to my mind it is true for spectators as well. From the one hand, one may think, OK, I’ll just watch this movie and it won’t dissipate me, I needn’t feel sorry for the people on the screen as it were they who attacked my country and not vice versa. However sooner or later but inevitably one starts sympathizing with the characters. Probably when the lieutenant chokes back his tears at seeing Kolya’s execution.“Stalingrad” is hard to watch, all these frostbitten legs, dirt, executions, snow, famine, destroyed illusions.As far as I know, Lt. Hans von Witzland is one of the few films where Thomas Kretschmann played his star roles. I watched quite many Hollywood movies where he was given unimportant parts of small fries, such as “Next” or “Transsiberian” (why did he do it?!). And after I had watched “Stalingrad”, I cannot make out the European actors desire to appear in American movies, even second-rated at any cost. The fact puzzles me deeply. I believe Thomas Kretschmann deserves better parts and much better screenplays than those he is given in Hollywood. And out of what I saw with him, “Stalingrad” is the best, beyond the doubt.In my opinion the worst “Stalingrad” drawback is the way they speak Russian in the movie. I mean of course those who are supposed to be Russian. Say, the boy who spent some time with the Germans or the girl with whom they planned to escape. Was it really so difficult to find actors able to pronounce a couple of phrases without that horrible accent? Initially I set down to watch “Stalingrad” just to listen to native German-speakers because I’m studying the language. I did not expect anything extraordinary of the film. But it impressed me, made me cry when I wasn’t going to at all. I know I’m 15 years late to watch it, but “Stalingrad” is not a run-of-the-mill movie, and after 15 years it is still watchable and shocking.","For the main criticisms of the movie... The love story: that wasn't a love story. Those were two people distraught coming together trying to find humanity in ANYone. The same thing happened with soldiers and the Russian boy. It added a feminine touch, but come on look at American movies...no where close to love story. There was no storyline: does war have a storyline? I think that is a silly criticism. The storyline is this. They start with 400 men and the movie narrowed down to show the lives of about 10 men and how each did their part and died. Death is the ultimate end to any story. Just because there was no happy ending doesn't mean it has no storyline. There was a horrid truth in this movie. I wouldn't necessarily call it \"anti-war\". It had a political statement of course, but the movie wasn't all about the politics. In fact, except for a few occurrences when the Captain? showed up, there was never a stifling air of Nazi Germany. They were far enough out of the reach of the main Nazi party. The fat cats weren't gonna go into Russia!Maybe not completely accurate and not a Hollywood hit, but it exhibits a fine knowledge of the common soldier (I'd say exactly of almost any nationality and war)and what they must go through. It was a losing battle, of course the movie is going to be depressing. And to the person who said that it was gutsy (and silly) to even portray Germans as victims: there are victims on all sides in every war (any real soldier will tell you that).This movie is a fine balance between movie and documentary. A few problems with it when arguing for just one, but it instills the best of both worlds. Watch it as such. Beware however because it is a hard movie to watch if not graphically, emotionally.I'm waiting til they make a movie about Iraq. It will probably have many of the same themes and will be very controversial, I want to see who has the guts to do it first. (Jarhead doesn't count)","There can be no real victors in war if we value human life at all.  That so many German and Russian boys should die in the snow-bound wilderness around Stalingrad is a tragedy beyond comprehension.  The camera crew did a great job in bringing to the screen the vastness of Russia with soldiers camouflaged in white struggling on the point of death across frozen landscapes.  Far from home and missing their loved ones the German soldiers are depicted as rough diamonds with kind hearts sharing their last crust of bread with starving Russian children.  The over-all German plan is to take certain cities important in the flow of oil and supply of food to the Russian enemy, but their plans are thwarted when the Russian armies encircle them.  The close fighting is well filmed with lots of explosions, flames and shattered bodies among fallen masonry.  I liked particularly the contrast of the opening scenes in sunny Porto Cervo (where the Germans are celebrating their recent victories) with the tragic scenes which followed when calamity overtakes them.I thought too that the three struggling figures exhausted in defeat symbolised the horrific loss of human life and the futility of war. While none of the actors shone above the others, their characterisations were adequate enough though I got somewhat confused with such a large cast and all the same uniforms.  The lasting impression is not with individual performances but with the over-all mood of this tragic event captured superbly under expert direction.  One soldier says to another:\"This will give us the Iron Cross\" The reply:\"Yes...it will look good on your coffin!\"","This film is one of the historically most accurate war films ever made in that it displays the reality of soldiers in a battle situation as well as the particular circumstances of the Battle of Stalingrad, obvious when one compares this film to works such as Anthony Beevor's book \"Stalingrad\".Unlike the better known \"Enemy at the Gates\" where the plot diverts into a sniper/hunting story, this film shows what war can do to individuals. Although filmed by Germans, \"Stalingrad\" is anything but a nationalistic apologetic film. It shows that war films can be something beyond flag-waving, jingoistic distortions of the grim truth of war, like so many Hollywood \"war\" products seem to be.The scripting, acting, direction and other film techniques in \"Stlingrad\" are of the highest caliber.It's a must-see film for anyone contemplating to join an army and to obey orders from any type of \"Fuehrer\".","Well-meant attempt to depict the events concerning the battle of Stalingrad, though the individuals Vilsmaier concentrates on, remain - due to his direction - too far away from the viewer to have him/her really involved and the result is that the drama of the war is never really felt. Thus the film's last and symbolic shot is devoid of a deeper meaning, Thè anti-war film based on the Stalingrad event - as Vilsmaier has clearly given himself as task - is never established. An anti-war film it may be, but \"die Brücke\" by Bernhard Wicki still has far more impact. It also noteworthy that the film concentrates on the German soldiers only and hardly shows anything on the Russian side.Moreover as far as the political side is concerned the film never surpasses the level of the 08/15 films by Paul May: it is simple in its division between the politically \"good\" and \"bad\" soldier, finding the latter in the higher ranks only, while the lower and lowest in rank are basically decent people;  the soldier is just another victim of the regime. Compare this, if you have ever the opportunity, to what 6 German ex-soldiers tell about their experiences at the Russian front in the documentary \"Mein Krieg\" by Harriet Eder and Thomas Kufus (q.v.). I certainly do not want to suggest that Vilsmaier excuses the war (or worse), but he does not succeed in incorporating the socio-political situation, if he had ever the intention to do so..There are surely impressive scenes (short truce in the plant; attack of Russian tanks, shooting of Russian civilians e.g.) and the battle scenes ar extremely well choreographed; the cinematography is sometimes stunning. But on the minus side: the cast is never more than average and the music is heavy handed.In short: despite elementary shortcomings, certainly worth a view.","If we compare the movie industry with an ocean, we have the tendencies to observe only the surface. Driven by the strong Hollywood marketing force, we all saw war movies like Saving Private Ryan, The Thin Red Line, Apocalypse Now or Full Metal Jacket. But underneath the splashy waves grow in silence, from time to time, less known pearls. When you pick one and look carefully at it, you wonder why this pearl lie almost unknown and why it's not already on the crown.\"Stalingrad\" is such a gem. Why, it has a bunch of multi-million dollars rated actors? No. It have thousand of extras? No. It have breathtaking, spectacular, shiny computerized visual effects?. Not at all. So, what's so special? Well, in one word, it's pure past reality recreated and transposed to celluloid fifty years later. The tragedy of the most bloody battle in the history is here. Filthy, wounded soldiers, Russian civilians who lost everything during the invasion, burning villages, collapsing buildings, decayed suburbs, gunfires, explosions, tanks in flames, soldiers shot, burned alive, ground by tanks in their pits or shred to pieces - you got all. But the real horror is elsewhere. People are reduced to simple pawns, without the power to change anything. The soldiers we follow in film try to leave the combat zone and they fail. The civilians stay in prostration in the middle of nowhere, only crying for their children killed. Mercyless, the huge grinding machine of war melt together humans, equipment, villages, cities - and ask for more victims and destruction, over and over.In all this collective insanity a group of German soldiers struggle to survive and to keep at least a minimum level of normality. They do their duty and fight bravely. But, as everyone know, a battle is almost lost when people start to loose confidence and faith. We see how all those people are abandoned, how they plan to desert, how they struggle to catch the very last plane to Berlin (full of wounded), how some very bad injured soldiers were treated as simulants and shot, how they were forced to execute a small group of Russian civilians, including a young boy, how they later discovered a place literally full up to the ceiling of food and drinks - destined only for some \"superior\" officers, of course. One by one, they drop dead. The end of the movie is one of the most bitter, depressing and touching ending I ever saw, all on the magnificent score of The Munich Philarmonic Orchestra. The war destroyed everything in its path.This movie is a must-see for everyone. A true movie-lover should have it in his/her collection. The strong anti-war message must be a warning for all of us. Unfortunately, the mankind never learn, nor the politicians. Self-destruction is in our DNA and the human pain seem to last forever. Can we be enough reasonable to stop THE WAR?","The movie's essence was delivered by one of the German soldier's comments after taking the building [in Stalingrad], \"....62 men left out of 400.\" Expensive real estate which, as in so many other conflicts regardless of uniform, has its costs in blood. Stalingrad shows the gut wrenching non-glory side of the nitty-gritty of combat and brings home to those who have been there the non guffaw when you hear, and see, how one soldier loads both his weapon...and his pants. Stalingrad shows well the realities of close combat and what the cumulative experience can do and often does to the human psyche. I would concur with the other reviewers in terms of Stalingrad incorporating the best, that is to say, the reality of Das Boot and Platoon 'sans' the hype when the business at hand becomes one of your basic kill or be killed. 'Side' aside as it were.","Many of the criticisms levied at this film by other IMDb users take issue with conventional aspects of film-making - and I agree with them. It's true, Stalingrad does offer little that's new in terms of character, screenplay, visuals. And yes, any war buffs coming to this film in hope of some depiction of the battle's broader strategic context will be disappointed. To those people I recommend Antony Beevor's highly readable book, 'Stalingrad'.Viewed from a straightforward standpoint, Stalingrad is a pretty compelling war film that is nevertheless a league below US celluloid depictions of the battlefield: when it comes to depicting the fate of the 'poor bloody infantry', the second half of Full Metal Jacket, the first quarter-hour of Saving Private Ryan, or much of Black Hawk Down is infinitely superior. And yes, its ending is something of a wimp-out. Consider, however, that many people compare Stalingrad to FMJ, Ryan, or BHD at all, however unfavourably, and you see something of the revolution of Vilsmaier's flick. What he achieves is a pretty conventional squad-level war flick - ABOUT THE WEHRMACHT. A film about the German armed forces in WWII which invites sympathy. This, don't underestimate it, is important. At no stage is this a Nazi-apologist film. In fact, its over-willingness to be Nazi-condemnatory is what makes much of its dialogue and scenes weak. But no matter whether you find it tame or not, you do eject this one from the VHS or DVD tray thinking \"poor b--tards\". As the Holocaust, through the global ceremony of Holocaust Day on January 27 and through the power of global films like Spielberg's Schindler's List, becomes transported away from a specific time and place into a world parable of evil, so we are able to reappraise the role of the German soldier as victim. What attitude you take to this question is your affair - Vilsmaier's film is important for daring to raise it in the first place.","The film is about the battle of Stalingrad. For those of you who don't know anything about it, it was the worst battle in the Second World War. Over 1 million people died in the course of the battle. This is the only film that I've seen that seems to have actually captured how bad things were in the war between Russia and Germany. What I really liked about it is that the two ideologies (Nazism and Communism) were nowhere in the film. Unlike most American films, the Germans are not seen as blood thirsty murderers, but what the average German foot soldier was, a person.The film revolves around four soldiers fighting in Stalingrad. They were transferred there to try and take the city. The film follows these men from August of 1942 to early 1943. During this time, they learn about the horrors of war and try to find a way out of the battle.Through the entire film, one feels the desperation of the entire battle. Unlike \"Enemy at the Gates\" the film makers didn't try to put some sappy love story or dress up factual occurrences of the battle. This film may be fiction, but it conveys what happened in the bloodiest battle in World War II.","From a military historian's standpoint, nearly everything in this movie is historically accurate.  Beyond that, it is an enthralling story that leaves you depressed at the end but quite glad you took the time to watch.","I would daresay this is a better war film than 'The Schindler's list'. We have seen many war films from the point of views of Russians, Jews, Poles etc. But this was my first world war 2 movie seen from a German soldier's point of view. The film starts when a battalion of German soldiers are ordered to go to Stalingrad. When they think about going to Stalingrad, they think of farms and greenery but when they reach Stalingrad, the truth is far different than the reality.The German soldiers think they could win Russia within a month, their very notion turns into disbelief as they enter Stalingrad, and see thousands of wounded German soldiers. Stalingrad war was indeed the biggest mistake of Germany, and it proved the beginning of the end for Germany, and resurrection of Russia. One thing I always wondered as a child, when a war is waged why there is no confusion, how always a particular army perfectly distinguishes its soldiers from the opponents'.In the very beginning, when Germans invade Stalingrad, we see a massive confusion within the battalion and a German soldier inadvertently kills his fellow soldier. As you may do research, you will find that there was a huge chaos during the world war 2 and such incidents occurred. One thing that the director wants to convey is that all the German soldiers were not blood grubbing monsters, even they were tired of killing other people, even they wanted to go home. But they had no options, if they didn't kill , they would have been killed by their superiors.This thing is evident when a young Russian boy is captured by the German army, and the soldiers who are protagonists in the movie are told to shoot the boy with dozens of other people. They are reluctant to shoot the boy, but their fascist superior warns them that if they didn't shoot those civilians, they would be next in queue. Stalingrad is an attempt by the director to earn some sympathy for the German soldiers, who were always seen as culprits, but this film shows they were victims too.I don't want to get into the war crimes that Germans committed in Russia and other nations, but when you view a film you have to see it impartially. At the very outset of the film, it is very much clear that you are not going to see a happy end as you see in Hollywood. This film makes 'Enemy at the gates' look a very cheap film which is far from reality, as it creates Rachel Weisz's character in the film. This film is not for the people who want to see war films just for the sake of explosions and killings of people.We see scenes in the film where a German soldier shares his bread with a civilian, and also in the end when the Hans Von Witzland refuses to rape a helpless Russian female soldier. This film tells us about the fate of the soldiers who were stuck there and knew what was coming to them. In fact, this movie tells us about the harsh reality of war and it tells that the war is always bad, and there is no winner in a war. This film doesn't show that Russians were bad despite being a German film, nor it shows that Germans were heroes, but still makes its point of earning sympathy for all the soldiers who lost their lives in the battle of Stalingrad.","Describing Stalingrad as a war film may be a bit inaccurate. Sure it centers on the longest and bloodiest battle in world history, in the most expansive theater of the most costly war in terms of lives, money, and matériel that has ever occurred. Yes it contains action scenes depicting bitter battles and terrible destruction. The visceral storytelling and harsh images though make it something more than a war film, even more than an anti-war film. Stalingrad is instead a film about absolute and undeniable hell.The film is fraught with visual descriptions of the worst kind of war, one that is intensely personal and close, where days are spent in taking one city block, only to have it re-taken in a surprise assault. The early form of modern urban warfare that the Germans came to call Rattenkrieg (Rat Warfare) is depicted in brutal and uncompromising terms. The characters war in sewer tunnels, rail yards, and from building to building in the hellish bomb-scape of ruined Stalingrad, only to be defeated by the unforgiving Russian winter.The film deals with the issue of Nazism and the vilification of Germans in that period in the way that many other films from both Germany and the rest of the world do. Its characters are a group of soldiers swept along by the winds of war and simply attempting to make it out with themselves and as many of their comrades as possible alive. The characters do not fight the Soviets out of any ideological hatred between National Socialism and Soviet Communism, not for any grand dream of Grossdeutschland or racial superiority. They fight only because if they do not the enemy will kill them, and if the enemy does not then their own officers certainly will for refusing to fight. This portrayal adds another layer to the suffocating envelope of trapped hopelessness that pervades the film.A sort of ground based companion to Das Boot, Stalingrad frames the epic struggle of World War Two in a personal light and from the unexpected perspective of the ordinary German soldier as a sort of hero made tragic by circumstance and a brutal government that would pervert his sacrifice.","Apart from the low budget, there never seems to be more than 50 Germans in one scene at any one time, plus the same 2 half tracks, this film is absolute top class. Everything is accurate. That is the point, I think, from the uniforms to to the horror and the disillusionment.Everyone is as grey as the field grey uniforms. Grey men with the life drained out of them. Forget US made Gung ho rubbish like Blackhawk down and Private Ryan. This is one of the best war films ever. Only Cross of Iron beats this for tension and story. Please could we have a proper Un-dubbed German language with English subtitles version in the UK ? Without having to pay ridiculous import charges from Europe. Most other DVD's are multilingual. Why not this one ?","A battalion of German soldiers from the Afrika Corps are spending some time at an Italian port during the summer of 1942. At that particular time their spirits were high as the German army was in the process of advancing victoriously into Russia. But all that was subject to change as their next assignment would be: Stalingrad. And they had no idea what was in store for them. At any rate, told from the German perspective, this film does a remarkable job of showing the hardships and tragedy these soldiers had to endure. Despite proving themselves in battle, their courage and discipline was being tested as much by the Russian winter as it was their Russian foes. And yet they continued on all the same. Now, while everybody knows how this battle eventually played out, this movie allows the viewer to gain a unique understanding of how it may have appeared through the eyes of the German soldier. Definitely worth a watch for those who can appreciate a film of this type.","STALINGRAD , released in 1993, remains one of the most brutally honest depictions of war on film. A brief history of the facts behind this film have been well stated: 'The Battle of Stalingrad was a major battle of World War II in which Nazi Germany and its allies fought the Soviet Union for control of the city of Stalingrad (now Volgograd) in southwestern Russia. It took place between 17 July 1942 and 2 February 1943, and is often cited as the turning point of the war in Europe. The German offensive to take Stalingrad, the battle inside the city and the Soviet counter-offensive--which eventually trapped and destroyed the German 6th Army and other Axis forces around the city--was the first substantial German land defeat of the war. The battle involved more participants than any other on the Eastern Front, and was marked by its brutality and disregard for military and civilian casualties by both sides. It was amongst the bloodiest in the history of warfare, with the upper estimates of combined casualties coming to nearly two million.' The horror of this battle as written by Jürgen Büscher, Christoph Fromm, Johannes Heide, and director Joseph Vilsmaier manages to allow us to see the 'other side' of the German forces, those not committed to the Nazi hunger for world domination, but instead were simply men serving their required time in the army, hoping to return to their families. The film opens with a prelude: German troops of the 6th Army are languishing in Italy after their successful mission in North Africa. They are soon assigned to attack a port in Russia - a place called Stalingrad - and off they go to what is perceived to be another quick victory. The unit is directed by Lt. Hans von Witzland (Thomas Kretschmann, in a role that should have won him every award possible, so fine is his performance): he is a man who appears more human than soldier and indeed when his troop arrives in Russian territory he is appalled by the treatment of Russian POWs by German officers, a response that places him in a negative light with the Nazis. But Witzland is assigned to take a Russian strong hold with the close help of his group of fellow soldiers (played with extraordinary humanity by Dominique Horwitz, Sebastian Rudolph, Oliver Broumis et al). For a moment in time they are successful heroes but their commitment to the war is rapidly and fully eroded by the slaughter around them and the orders from the heinous Nazi officers to treat the Russians with less than dignity. They are threatened with death by firing squad for their humanity in attempting to give aid to the Russians being constantly attacked and only released form their prisoner status when the war appears to be aimed toward loss. There are many very tender moments between the 6th army and the Russians trapped by the siege of Stalingrad and as the bitter winter sets in the battle-weary soldiers are dying, committing suicide or attempting to escape and find their way back home. The over two hour study of the cruelty of war ends with a solemn statement, both emotionally and visually and the Battle of Stalingrad, a victory of the Russians, shows the defeat of the minds (and lives) of the Germans. The film is brave in its commitment to address the fact that the universal 'German image' of World War II is a negative one. This film focuses on individual ideals and the scarring that war, on both sides, leaves on the soldiers and people who survive it. Highly recommended. Grady Harp","An excellent alternative movie demonstrating the horrors of war, in which there are never any heroes. Although Stalingrad was made with a much smaller budget than comparable Hollywood WWII movies, the outcome is touching. However, there is some cliché clumsiness in the outline of the main characters. There are not many movies about the WWII in Eastern Europe & Russia, where the war was the most brutal and where the outcome of the entire second world war was to a large extent settled (something which is often forgotten in the Anglo Saxon world). Stalingrad achieves to large extent in what it tries to describe. The tragic dark faith of over 1 million people would deserve more movies.","Stalingrad is a jewel among the war movies as it manages to portrait the highly dramatic events in the decisive battle of the second World War in a credible way and without any Hollywood-style heroism or pathos. And this primarily from a German perspective, which unfortunately is a rarity.The plot follows the actions and events of a platoon of war proved \"Sturmpioniere\", an elite Wehrmacht unit similar to Army Rangers. But unlike shown in weekly propaganda news films, the German soldiers are neither depicted as heroes nor as Nazis, but simply as fathers, abandoned husbands and football fans, which share one common will: to somehow survive and return home.This movie may not be taken light hearted as there is a lot of fighting and dieing and the effects of weapons and ammunition are presented in a rather impressive and authentic way. Yet Stalingrad is not about the battle action but about feeling the madness of war and having empathy for the protagonists' small hopes of escaping the horrors of winter hell. A movies that goes deep under your skin, moving, gripping, thoughtful and making you angry. And, perhaps typically German: a happy ending can not exist.Finally a big thank you to Mr. Vilsmaier for having the courage to realize this movie. And a request to EuroVideo: please bring this movie to the Blu Ray format in a worthy picture and sound quality!","I just recently saw this movie in hopes of seeing an accurate portrayal of the bloodiest battle of the 20th Century. I got what I had expected and so much more. Just to think I came across this movie by luck, before I had never even heard of it. It's a German film made in 1993 so I suppose I can't be surprised that it's almost completely unknown to the modern American audience. It's a shame cause this really is a remarkable film, I dare say that its as good if not better then Platoon, Full metal jacket, Apocalypse now, and All quiet on the western front; all of which are iconic war movies.1942: World War II is in full swing. Nazi Germany has over run Mainland Europe and parts of North Africa, then Adolf Hitler orders the full scale invasion of the Soviet Union. A fateful move that ultimately dooms Nazi Germany to defeat. In the early stages the invasion goes well and the German Armies conquer large sections of Soviet territory, but a critical battle ensues at Stalingrad, A city that hold great symbolic & strategic value. The battle soon turns into a blood bath of epic proportions, a nightmare for both the German & Russian soldiers fighting. On the verge of taking the city the Germans are suddenly counter attacked by the Russians who end up cutting off the entire German 6th Army inside Stalingrad. To make matters worse, the Russian winter arrives causing incredible suffering for the Germans. This entire battle is seen through the eyes of a few young German soldiers fighting for survival not only against the Russians and the harsh winter conditions but also against their own Sadistic officers who care only about medals & glory and the generals who have little regard for the average foot soldier.This film is going to haunt me for a while. The German Soldiers the film concentrates on are so young and naive, then their humanity & sanity are stripped from them and you really do feel sorry for them cause their not the demonic Nazi's often portrayed in film. Everything they were fighting for is no longer important, and everything they believed in was shattered, and after fighting a gruesome battle against the Russians inside Stalingrad we see them further deteriorate with the onset of Winter causing many to freeze to death. The Battle & Winter scenes were like a horrible nightmare but it also felt so real. It's amazing, in the beginning we see strapping young men in the prime of their life, and at the end they a shells of their former selves stripped of everything. After witnessing so much carnage these men just loose their will to live on, it was really sad. When there is finally a moment of hope they are betrayed by Hitler who ultimately abandons these men to a horrible death, which is just another one of Hitler's crimes abandoning the men who fought for him to be slaughtered by the Russians. A good Anti-War film depicts the horrors of war and that's what this movie does. The battle for the tractor factory sequence Is the closest thing that comes to hell on earth, but that's really what The Battle for Stalingrad was like. The German & Russian soldiers were depicted with humanity, it was only the bad apples (specifically on the German side) that doomed the men. Bottom line is this film is amazing cause we see how men breakdown physically & emotionally during war. We all have our limits and these men were pushed far beyond their limits in the most deadly battle of our time. What the average foot soldier endured at Stalingrad was beyond imagination. Even if they had survived everything they had seen & done would have scarred them for life.Stalingrad shows us why War is Hell, and what exactly hell looks like."],"review-user":["xaggurat","countryway_48864","ItemCo16527","tgs333","prunders","Mitch-38","ChuckStraub","Tatiana_G","athena13005","raymond-15","bernhard-18","J. Steed","nose_smasher","Doc Tony","jcf30","bergma15@msu.edu","Manstein","varun_120","Dwolvesbane","graestella","Uriah43","gradyharp","eenbom","Heimkineast","Danielramos16"],"review-date":["25 January 2005","9 January 2006","27 March 2003","12 November 2004","4 February 2007","30 January 2001","14 December 2004","29 November 2008","29 November 2006","2 July 2001","24 August 2006","3 September 1999","23 May 2008","17 December 1998","13 December 2004","24 February 2006","10 October 1998","2 November 2012","15 December 2008","3 November 2005","17 April 2013","26 June 2010","28 January 2007","8 May 2010","24 July 2008"],"review-rating":["9","9","10","10","8","8","9","10","10","8","10","10","8","10","10","10","10","8","10","9","10","9"],"review-title":[" Top Ten war movie in my list\n"," A harrowing tale of young men being betrayed and slaughtered\n"," Brutal, heartbreaking, & realistic portrayal of the bloodiest battle ever fought.\n"," Glad I wasn't there!\n"," Stalingrad\n"," Hell Frozen Over\n"," Very graphic and brutally honest. A must see.\n"," “If you start thinking, you’ll go mad”\n"," To the criticisms\n"," An epic drama that impresses\n"," One of the historically most accurate war films ever made\n"," 90'S VERSION OF 08/15, BUT WORTH A VIEW\n"," It let you with tears in the eyes\n"," The realities of loading both weapons...and one's pants! Never jocular when close combat 'is' the reality.\n"," More than a war flick\n"," The filmmakers of \"Enemy at the Gates\" should have seen this.\n"," Excellent movie; the German \"Platoon\"\n"," Perfect portrayal of reality\n"," A film of Hell\n"," Excellent\n"," The German Perspective\n"," '...62 men left out of 400': Realities from the German Stance\n"," The dark side of man\n"," An authentic view on the horrors of the most tragic and meaningful battle of World War 2 - just like \"Das Boot\" this is a masterpiece which could never come out of Hollywood.\n"," Truly Haunting\n"]}