{"review-url":["http://www.imdb.com/title/tt0111237/reviews"],"review-text":["I didn't really mean to watch it. I really stumbled over it, saw Keitel's name and thought \"This must be interesting!\". And Keitel, as usual, doesn't fail you. Surprisingly, Perez does very well on her own, and the cute ex-Kid from Fame Michael DeLorenzo is really good, in a role that demands that he doesn't know how to dance... Ironic, considering he was one of the lead dancers in that 80's series. Anyway, these 3 characters go through the he-loves-her-who-loves-another routine, through very unusual twist or events (for one - a Hollywood rich producer has a car accident right after Perez has left Keitel's house - well, he threw her out - and after making Perez think that he IS the dream she always waited for - that rich guy dies on her - is that a normal plot-driving scene or what?)and quite a few \"moments\", as the Biscuit from Aly Mcbeal's would say. This is one to watch, just so you really get into the very thought provoking scenes. I recommend this for every movie lover. It's not an action flick, it's not a normal washy-washy picture either. It's a harsh look at people's despair and how in the end, when all the chips are down, we are left to deal with things on our own... Tarantino and Rockwell went on to do Four Rooms, yet another psycho fun-and-deep black comedy. Take that out as long as you're in the video store.","The three main characters are all hopeless, and yet you only feel sorry for one of them: Ernesto, hopelessly devoted to Mercedes. This was part of the frustration: screaming at Mercedes to get a clue and ditch the no-good Harry, to no avail.Then there's the satisfaction: Steve Buscemi has a great part as a transvestite, and Harvey Keitel's moving story of his indignity playing a gorilla for a cheap TV movie is incredible. When you least expect it, Quentin Tarintino is doing half a monologue, and Anthony Quinn turns Ernesto into a wealthy man.Time and again great moments appear in the story, but in the end it's hard to know what to feel about this movie. It doesn't have a happy ending, or even a complete one, but it somehow feels right.This movie is strange, but then so am I; no wonder I liked it.","Rosie Perez is the lead in this very engaging affair, cast as Mercedes, a young woman from Brooklyn who has resolved to become a film actress although not favoured by her circumstances, living in East Los Angeles and struggling with a series of fruitless auditions for any sort of part at all. Mercedes has hooked up with a married and washed-up actor, Harry Harrelson (Harvey Keitel), who at one time had performed in a television Western series during the 1970s, and seldom since, accepting him as her lover, in part from loneliness, and as well from a hope that film parts will be coming her way because of his \"contacts\", but these latter are of small consequence as Harry is simply self-delusional in his attempts at recovering what he perceives as past cinematic renown. In order to adequately support herself financially, Mercedes toils as a taxi dancer in a downtown Los Angeles Skid Row dance hall/bar while she continues carrying on her efforts to succeed at the motion picture business, and it is while there at the dance palace that a young immigrant from Mexico, Ernesto (Michael DeLorenzo), falls in love with her and the largest portion of the narrative depicts his efforts to please the object of his affections, even if they may mean losing her altogether. This essentially tradition rooted melodrama is given only a moderate budget, despite the presence of a goodly number of well-known players, including Steve Buscemi, Anthony Quinn, and Stanley Tucci, and was kept in the can for about a year before its rather desultory distribution and leaden marketing efforts on its behalf, more's the pity as its solid production characteristics are firmly complemented by Alexandre Rockwell's admirably controlled direction, a consistent virtue of his work, and on display in this film from its very opening scene, frames that form a montage behind the credits, featuring Perez at Skid Row's Fifth and Main Streets. Rockwell has often demonstrated that he operates very closely indeed with his cast, and this holds true in this instance as he allows his actors to create their roles while any ad libbing is neatened nicely via the editing process, resulting in an artistic success for the director, despite negative comments from some mainstream evaluators. The film's scoring is aesthetically spot on with a good deal of it contributed by Tito Larriva, who also plays as band boss for the taxi dancers. Acting honours here must go to the ever vital Perez, although nary a sub-par performance is turned in. A fair test for any film's quality is given when a viewer will watch it twice within a brief period. Sitting through this undervalued work will be considered a keen pleasure for many.","I'm sorry, but this movie is just way to shallow for me. In it, Perez is a taxi dancer with boyfriend Keitel trying to make it as an actress. First of all, what the hell is a taxi dancer? Even after sitting through this, I still don't know. Oh yeah, Perez also inspires DeLorenzo to follow her like a lovesick puppy. There's no reason behind the love, it just kind of happens. There are times when the characters and events really try to pull at your heartstrings, but it rarely works. The only character you really do feel anything for or with is Keitel's character, and that's only because he does such a good job with it. Any other actor and the character would have been just like the others.The script is basically an uninspired rehashing about how hard it is to make it as an actor/actress. It's been done and said before, the language and dialog sounds like it was written by a street pimp. The ending is...well, I don't want to spoil it. Let's just say it feels unsatisfying. I'd be more upset if the story was any good to begin with. The directing is average with nothing truly wonderful, but nothing that is really painful to watch either. To reiterate the acting, the only one that does anything worth watching is Keitel. Though I could have lived on without seeing him in tiger print bikini underwear.Oh yeah, Eddie Bunker shows up. As random as that mention is, that's how random it is in the film. And Tarantino does his director buddy a favor by showing up for about 20 seconds.","Yes, it's an okay film, somewhat formulaic (as some reviewers have pointed out) and well-acted (as other reviewers have pointed out). The real gem here, for people in the know, is the cameo by the late, great director Sam Fuller, as a man injured in a car accident (which has virtually nothing to do with the main plot). Fuller is totally himself, as he rants his way through all of his complaints about Hollywood, in his own inimitable style. It's great having him on screen and those who may know the man's films (including THE BIG RED ONE, SHOCK CORRIDOR, THE NAKED KISS, STEEL HELMET, 40 GUNS, and many others) will enjoy seeing the man behind the camera -- one of the great Hollywood personalities."],"review-user":["eroka","labcoatman","rsoonsa","VonCouch","Kenn-15"],"review-date":["4 November 1999","9 November 1998","21 February 2008","12 February 2005","16 March 2009"],"review-rating":["8","9","3"],"review-title":[" Innovative and often somber tale of 3 lonely characters\n"," An odd, frustrating and satisfying ride\n"," Top-Flight Direction Results In A Highly Enjoyable Film.\n"," Dull and Annoying\n"," Sam Fuller is the best part\n"]}