{"review-url":["http://www.imdb.com/title/tt0112519/reviews"],"review-text":["Black Scorpion is a fun flick about a groovy female super heroine who wears leather tights and drives a car that can morph into her snazzy armored Scorpion Mobile. She battles the evil Breathtaker and all of this is an excellent recipe for a good time IMHO. I loved the bit about her having to say \"Yo\" to get the car's computer to take orders! Breathtaker is so evil he wants to give the entire city asthma! It's all so over the top and that's the beauty of it! The scene where Black Scorpion \"attacks\" her partner steals the show. You'll know it when you see it. This DVD also has a fun interview with Joan Severance. She's a doll. Black Scorpion is a fun DVD. Loved it!","I really didn't know much about this film before I watched it... just that it was a female Batman and that Roger Corman was an executive producer on it(and I'm trying to watch every last one of the films he has collaborated on that I can find). I was pleasantly surprised with the film. It's very campy and entertaining. There's no pretense here. The film knows that it's corny comic-book entertainment, and it never acts like anything else. We've got a pair of retired female pro-wrestlers as minor villains. We've got a police captain who is never seen without a lit cigarette in his hand or mouth. We've even got a shape-shifting Batmobile which only responds if you end each request with a \"yo\". Just about every single opportunity for campiness is put to good use. The plot is quite good, though it is somewhat predictable, in that it follows comic-book formula all the way, from start to finish. Of course, that only adds to the entertainment. The pacing is great. I wasn't bored for a second. The acting is as corny as the rest of the film. The characters are all comic-book clichés, but the main characters are surprisingly fleshed out and well-developed. There's plenty of alluring shots of females showing off a fair bit of skin, most of them being of the Black Scorpion herself. The action is highly entertaining, and very comic-book-like. There's plenty of fun one-liners in there as well... Arnold would be proud. This film won't change any lives, but it will entertain most viewers, particularly those who enjoy comic books and campiness in films. It's a stylish comic book film, no more, no less. Something that deserves a mention is that there's a sex scene with the Black Scorpion, which any man who is into S/M and/or attracted to aggressive women should see. I recommend this to fans of comic books and campy films. 6/10","A cop watches the city attorney shoot her father with no apparent motive. She's thrown off the force for police brutality after confronting him in his jail cell, and vows to continue fighting crime by donning a dominatrix outfit and becoming a vigilante superhero.Given this premise, the film wisely doesn't take itself too seriously, which makes its many glaring shortcomings more forgivable. Statuesque Joan Severance is appropriately amazonian as the title character. There are plenty of fight scenes; also a bit of nudity courtesy of a strip bar and an all-too-brief sex scene with Scorpion in costume.Overall this is only an average comedy/action/thriller, even by b-grade standards. However, if you're a) a fan of Severance, or b) looking for a video with some intentional and unintentional laughs, a bit of softcore action and some butt-kicking scenes -- you won't be disappointed. My rating: 6/10.","This movie will not be considered for an academy award, but if you enjoy a movie that doesn't take itself seriously and just wants the viewer to enjoy for ninety mins it is not a disappointment. You'll enjoy a send up of Darth Vader for the villain (the breather), a female Batman for the heroine (but much cuter with much less costume), and a running joke that involves cigarettes and the police captain that's very funny. Not by any means a great cinematic achievement. But if you enjoy campy fun it was worth a viewing. God help me, I liked it.","I was pleasantly surprised when I watched this movie. I rented it with no idea what it was about and really was`nt expecting much. Joan Severance plays a detective who after her father is murdered and she is kicked off the force dons a costume and becomes the Black Scorpion, the protector of the City of Angels. Sounds very Batman, right? Well, it is and it gets even more so as the movie goes by. She has her Batmobile, a red corvette that has been equipped with all sorts of gadgets including the ability to re-form its molecules to change color and model. The villain is the Breathtaker who runs an organization called B.R.E.A.T.H...watch the movie to find out his origin and why he turned to crime. I admit that it`s campy and it`s hokey but if nothing else you get to see Joan nekkid....now that`s something you won`t see in a Batman movie...at least not up to this point.","Black Scorpion is Roger Cormen's Batman. Which is cool and there is a lot of cool stuff in this movie. Like the Breathtaker being a cross between Doctor Doom and Darth Vader, that's kind of cool. The mind control gas in the inhalers was worthy of the Mad Hatter. The Cormen B-movie style is all over this puppy which is not always a good thing. There are plenty of stunts and hot babes to make any action fan happy. This movie, the good out weighs the bad. But if you aren't one for comic book movies, then I would advise not watching Black Scorpion, however if you like comic book like movies and don't care if it was ever a comic before. Then check out BLACK SCORPION, as for me I give it 8 STARS.","I'm a sucker for a decent superhero movie. (I'm not counting super bug budget, no storyline Batman's either)A couple of my favorites are The Phantom and a budget movie called The Demolitionist. The Black Scorpion can be added to that collection.If you've seen the Demolitionist then get this movie. It's basically a copy of that heroine. (It even stars the same guy in both movies)If you haven't, then let me explain...a cop's father is murdered and she seeks vengeance. She laces up the black outfit (a sexy catwomanish, skimpy outfit that looks absolutely great on Joan Severance) and goes out to kick some booty.It's a fun, action packed movie, mind you, you may not wish the kids to see it...without screening it first to see if you approve of the pretty graphic sex scene Severance has in it. Which in my opinion, was a bonus (alright, give it an extra star <grin>)","The Batman-style story of the super heroine (with the difference that she is originally a cop, not a millionaire) is nice and it is well done, especially if you consider the TV B-movie budget.The action scenes are not always the best and the special effects are generally poor, but these are not major problems either. The serious flaw is that most of the villains (precisely the most important ones) are ridiculous, badly developed and portrayed by bad actors.It is worth mentioning that there is a strong influence of Tim Burton's Batman movies over this film, with scenes that are clearly inspired/copied, such as the one similar to Michele Pfeiffer's kiss/lick in \"Batman Returns\" and the one in which we can see an acid pool like that from \"Batman\" (besides, off course, the black mask, the gadgets, the father's murder, the customized car...). Though, there is at least one unforgettable scene which you cannot see in \"Batman\": what happens a little bit after the first hour of the film is amazing... She is perhaps the most beautiful and sexiest super heroine ever.","Black Scorpion is a descent straight to video movie as long as you do not think about it too much. Joan Severance plays the title character who resorts to vigilante tactics when the law does not work. Its good timing to go the mask super hero route especially since a new evil known as The Breathtaker is about to terrorize the city. Is it cheesy? Yes it is but in a good way. Its a B movie and it does not pretend to be anything else. Also Severance is good and its a fun movie, just don't expect anything too serious. The plot has several holes and some things make no sense (the jumping ability comes to mind) but what do you expect from Roger Corman? In the end its a good time killer that is some what entertaining.","Black Scorpion is set in the City of Angels where Darcy Walker (Joan Severance) works as a cop, Darcy & her partner Michael Russo (Bruce Abbott) screw up during a bust & a suspect goes free. Darcy talks to her ex-cop father (Rick Rossovich) about it, while they chat in a bar the district attorney Thomas Aldridge (John Sanderford) walks in & shoots Stan dead for no apparent reason, Darcy is shocked & in an attempt to get some answers threatens the DA at gunpoint which gets her fired. Angry about the injustice she sees Darcy decides to take the law into her own hands & dresses in black latex to resemble a Scorpion & becomes a vigilante as Darcy dishes out her brand of justice to the criminals of Angel City. Dubbed the Black Scorpion by the media Darcy soon finds herself up against a mysterious madman named the Breathtaker who has devised a plan to poison Angel City...Directed by Jonathan Winfrey this made for telly superhero comic book flick is a poor mans cross between Batman (1989) & Barb Wire (1996) with both featuring comic book style superheroes & female character's who wear very fetishistic clothing, to be honest Black Scorpion is fun on a dumb sort of level but I couldn't really say it was particularly good. At 90 odd minutes the film moves along at a fair pace although the tone is maybe a bit uneven as the the superhero crime fighting bits are silly (Darcy having to say 'Yo!' to her car to get it to do anything) the serious moments about deep personal loss come across as misplaced. The plot isn't very good & if you think about the plot it falls apart, how can an ordinary cop suddenly become a electrical genius & invent those things which make her jump about 30 feet in the air or if the cops know that the Breathtaker is going to release deadly gas from various towers around Angel City (he went on TV & announced it) why didn't they just destroy the towers?The action scenes are rather forgettable, there's a couple of basic car chases (one car chases another, that's it) & some martial arts fights as the Black Scorpion kicks ass. The costumes look cheap, the Black Scorpion costume looks to have been inspired by Catwoman in Batman Returns (1992) & is all black vinyl, high heeled boots, long gloves & a half face mask that is very fetish in style & I will admit even at 37 when she made Black Scorpion leading lady Joan Severance looks good in the outfit. The fight between the Black Scorpion & a cop on a rooftop when they end up kissing with one unaware of the other's identity is lifted straight from a very similar scene in Batman Returns. Like all good superheros the Black Scoirpion has her own car which can change shape courtesy of some cheap CGI effects & she has her own equally larger than life enemy in the Breathtaker who uses asthmatics as his henchmen, the instance of having the main villain personally & emotionally tied to the hero is also standard comic book superhero fare & here it comes across as contrived. Considering this was made for telly it quite violent & there's a fair bit of nudity too.Filmed on what looks to be a low budget the production values are cheap & the whole thing feels cheap. The acting isn't great, Severance looks good in latex & boots but has no real screen presence & the one-liners fall flat although Stephen Lee is amusing as the stressed out chain smoking police Captain & as usual Bruce Abbott turns in a good performance.Black Scorpion is an OK camp superhero comic book adventure film, it's watchable in a mindless way & Severance in latex looks great but overall there's not much here to get excited about. Has no connection to the giant bug film The Black Scorpion (1957) & was followed by Black Scorpion II: Aftershock (1997) & a Black Scorpion (2001) TV series that ran for twenty-two episodes.","I watched this movie as a teen and thought it was so bad (acting/story/characters) that it was actually great fun to watch. The black scorpion herself can get away with her super heroine/vigilante outfit but the main villain? His outfit was so poor lol! Overall a lot of good fun if you don't take it seriously!","Ever since the original \"Superman\" film from the late seventies, Hollywood has been conducting a long-running love-affair with the comic book superhero. Most of the well-known figures from the Marvel and DC comics stables have been given their own film franchises- Superman, Batman, Spiderman, The Hulk, Captain America, The Fantastic Four, X-Men, etc. Indeed, many more obscure figures have also been adapted for the cinema; until the recent film came out, for example, I had no idea that Thor was a crime-fighting superhero as well as a Norse god. One curious exception to the rush to turn superheroes and superheroines into film stars is Wonder Woman, even though she was given her own long- running TV series, starring Lynda Carter, in the seventies. One explanation I have heard for this omission is that, although Wonder Woman was originally conceived as a symbol of female empowerment, her skimpy costume makes her today more of a male fantasy-figure. Hollywood producers are therefore worried that they will be accused of sexism if she keeps her original costume and of cowardly political correctness if she is forced to change it for something less revealing. Far safer, therefore, to steer clear of her altogether. Roger Corman, however, appears to be quite unworried about allegations of either sexism or political correctness, because he acted as the producer of \"Black Scorpion\", a film whose eponymous heroine wears a costume quite as scanty as Wonder Woman's. Unlike most of the other superheroes who have become the subject of films she was an original creation, not derived from a comic book. (A \"Black Scorpion\" comic book came later). Actually, the word \"original\" might not be entirely appropriate in this context as the Black Scorpion shares many traits with other crime fighters, especially Batman. Like Batman, but unlike Superman or Spiderman, she does not actually possess any super powers, so has to rely upon strength, agility and technology, including a Batmobile-style car, to overcome the bad guys. Like all self-respecting superheroes, the Black Scorpion keeps her real identity a close secret. Batman hid behind the millionaire playboy Bruce Wayne and Superman the mild-mannered, bespectacled journalist Clark Kent, and the Black Scorpion's alter ego is Darcy Walker, whose day job is that of a police detective. Darcy, however, finds herself frustrated by the limitations of police procedure, especially after her own father is murdered, and therefore moonlights as a freelance vigilante, a role in which she need not bother with all that civil liberties stuff about not beating suspects up or reading them their Miranda rights. If this scenario were taken at all seriously, it could have formed the basis for an intriguing \"Dirty Harry\"- style thriller about the ethics of law enforcement, but \"Black Scorpion\" is not a film that takes itself seriously at all. Darcy is not so much a Dirty Harriet as a Batwoman, the model for the film being the camp \"Batman\" TV series of the 1960s rather than Tim Burton's rather brooding, Gothic interpretation of the Batman mythos. There are, however, certain parallels with Joel Schumacher's two Batman films which also came out during the mid nineties. Both the storyline and the characters are deliberately exaggerated and unrealistic, the whole thing being played more for laughs than for thrills. We need not bother too much with the plot, standard superhero stuff in which the Black Scorpion thwarts a supervillain known as the Breathtaker, who has a particularly complex scheme for seizing power in the \"City of Angels (for which, presumably, read Los Angeles) and who turns out to have been responsible for killing Darcy's father. The heroine is played by the former supermodel Joan Severance, clearly cast more on the basis of her ability to look good in a revealing costume than on the basis of any acting talents, but in the context of a film like this acting talents do not really matter very much. One thing that does matter is that, although the Black Scorpion relies heavily on her martial arts prowess, Severance does not seem to possess any great fighting skills herself, and the fight sequences seem obviously staged. There is a contrast here with the work of other action heroes and heroines like Steven Segal, Jean-Claude van Damme or Cynthia Rothrock; they may not possess much in the way of acting skills, but at least they do know how to fight. The producers are never quite brave enough to turn the fight scenes into part of the joke, in the way that the \"Batman\" television series did , complete with captions reading \"BIFF!\", \"WHAM!!\" or \"KERPOW!!!\" The problem with camp, self-mocking action films like this one is that they are essentially one-joke comedies, a joke which is forced to stretch a long way. The Adam West \"Batman\" was tolerable on TV in half- hour doses; indeed, if you were a child during the sixties (as I was), it was great fun. When the concept was extended into a standard-length feature film it became a bit tedious. \"Black Scorpion\" suffers from the same drawback, it is just one long, over-extended joke. 4/10","Ah a Roger Corman epic that actually spawned its own comicbook and TV series which would indicate that the film is quite good...wouldn't it. Well I'm pleased to say that the film is actually pretty good IF you're interested in incredibly cheesy clichéd trashy low budget superhero flicks that combine the camp of the 60's Batman and Robin series and the sleazy visuals of something like Barb Wire. Yep its an all round winner for meeee!The plot is an unbelievably stereotypical comicbook setup. A young woman's father is shot dead in front of her eyes which leads her to reinvent herself as the superheroine vigilante Black Scorpion. This happens just in the neck of time as a super villain who was once a hospital doctor that was accidentally shot dead by the Black Scorpions cop father when she was a child, has come back to wreak revenge on the city by using a toxic gas in the air supply (the cities air supply?). This villain is now encased within a metallic suit because he has major asthma...and facial deformities for some reason, from the injuries suffered from his near death experience. So naturally he has lots of henchmen and equipment to plunge the city into despair.So like Batman the Black Scorpion fights crime and stands up for justice...especially justice for women naturally. At first she merely ekes out an existence on her own taking down pimps and muggers with martial arts in her tight scantily clad outfit and surprisingly expensive hot rod. But as the film goes on she picks up a cool cat sidekick that just happens to be able to supply her with neat gadgets and revamp her car. From there on the Black Scorpion flies around the city in a transforming American muscle car which is decked out with all sorts of hi-tech equipment...just like the Batmobile. When I say transforming I mean the car morphs into a completely different car in a dreadfully bad CGI/effects sequence, its impossible and makes no sense at all but I don't think that's a concern here.The bad guy in his robot suit looks like something from an old Dr Who episode, its laughably stupid looking and still makes me wonder how a bullet hit to the chest would equal the need for this suit...and give him chronic asthma. The bloke inside this thing can hardly move which makes it even more amusing, lots of quick cut edits when he's involved in the action, but as I said luckily he has lots of expendable henchmen just waiting to have their asses kicked by a female in fishnets. As for the Black Scorpion played devilishly by Joan Severance, her outfit is bordering on softcore S&M with black thigh high boots, fishnets, long black elbow length PVC gloves, a nice black shiny PVC cleavage and a Catwoman style mask. I won't deny it looked good if a little vanilla for my tastes, no way she could do half the stuff she does in those boots though.The actual film is an odd creation, like I said already it plays like a camp pantomime, like the famous Adam West/Burt Ward TV series. Yet at the same time its a very adult film in places, there are strippers and hookers with tits n ass and on show, a few revealing outfits, clear cut male fantasy sequences of blokes getting beaten up by a woman in BDSM gear and even a simulated oral sex scene which is pretty darn good. It may be a silly childish exaggerated homage to the comicbook genre but it certainly isn't for the kids. There isn't really any blood and gore though, the violence is pretty much on par with The A-Team. You don't see much, no squibs or bullet holes...just men throwing themselves around.In the end the film is clearly meant to be a true over the top comicbook flick with larger than life characters and unrealistic scenarios. In no way is it meant to be taken seriously, the superheroine is not a realistic believable character in any sense even though she has no super powers and no bottomless bank account...just the muscle car. In a sense she is more akin to a character from the Kick-Ass universe I guess, being a vigilante with a ridiculous outfit. This film does remind me of the recent Green Hornet movie actually, the ethnic sidekick and muscle car loaded with gadgets that is. A cool little mishmash of sordid tacky fun and camp goofiness with ass...well worth it.6.5/10","This movie was mentioned in one of my favorite guides to fringe media, \"DVD Delirium\", and while the review made it sound pretty lightweight and cheesy (while still being better than its sequel and the spin- off TV series), I have a weakness for cheesy and inane superheroics, and managed to track down a copy on \"streamdor.com\" one slow night when I was reduced to a Chromebook and a phone mobile \"hotspot\" for my movie fix. My first reaction:\"Uhhhhh...Okay...? They're really going to try to pass this off as a FEATURE?!\" And it didn't get much better after that. But I sort adjusted my expectations downward (to TV movie of the week level), and found enough entertainment to watch it through to the end, Joan Severance is a pleasure to look at in both her civilian/cop identity and in her \"Black Scorpion\" duds, so this has that going for it. No, She's not a very convincing fighter, so the fight scenes are mostly jump cuts and stuntmen falling down when she waves a leg in their direction. But she has a nice, crazy gleam in her eye when the mask is on, and she's able to at least give most of her lines of dialog a decent delivery. Bruce Abbott and Garrett Morris are also in here, trying to maintain their respective dignities in thankless parts, and they don't stink or anything, either. The plot...well, the plot and dialog appear to have been cobbled together by 10th graders who think they are funny. Roger Corman was involved in this at some executive level, which explains a lot...Corman projects almost always have a germ of something interesting or intriguing, something that keeps you watching even when the screenplay leaves plot holes big enough to drive the Scorpionmobile through and the jokes fall flat. (At least there ARE jokes). And such is the case here. I wanted to see how things came out, and so I stuck around until the end.And in the end, I think, that's all the creators wanted. \"DVD Delirum\" mentioned some sequels, but apparently at some point Severance was replaced by another hapless model/actress who didn't have her mojo, so I don't know if I'll bother to watch any more in the series. But this? This was...Okay.","Well, for a super hero movie it had potential, but it lost it somewhere.Joan Severance is a hottie and surely fit well into the skimpy outfit she wore, however the lame script, lousy effect, uninteresting action and over all production made this a go nowhere film.For the rest of the costumes were pretty hooky - bad to say the least.Also the strip bar scene - even though I liked it, really had no place in the entire movie - as well as the opening scene of her and a hooker on the stroll. Not that I am against anything with hookers or sexy women, but somehow, it just didn't fit. Neither did the love story, neither did the overdone jokes about smoking, neither did the swearing.Maybe a rework and a larger budget would have done this some justice, but it failed several minutes after the credits opened.","Of the 25 movies that Roger Corman produced in 1995, BLACK SCORPION edges towards both the best and worst of what the man has to offer. This results in only an average rating for this review, though you should know that it's an enthusiastic score nonetheless. This is a very entertaining adventure flick, made during a time before DC and Marvel monopolized superhero pictures. I would never think to directly compare it to those blockbusters, but for B-movie lovers, there is a lot to like, here.The story: Frustrated with the ineffectual law enforcement system, a Los Angeles policewoman (Joan Severance) dons a secret identity and takes the fight to a super villain seeking to take control of the city (Casey Siemaszko).The film could not have had a huge budget, give the flimsy costumes, weak effects, and action scenes that look like they were shot under time constraints. Luckily, these limitations bring out the talent in producer Corman and director Jonathan Winfrey, and they make the absolutely most of what they have to work with. The screenplay is polished, completely avoiding the narrative pitfalls of other low-budget productions. The cast as a whole is enthusiastic, and you can look forward to some particularly entertaining performances from Terri Vaughn and Garrett Morris. Most important of all, the movie has that infectious enthusiasm that can turn schlock into classics: the hammy personalities, the bubbly chemistry between the cast, and the filmmakers' knack for enjoyable absurdity make it clear that the movie's foremost goal is to have fun, and it's hard not to be at least somewhat entertained.However, enthusiasm by itself does not make a great action movie, and this one's action content is in trouble. For all her dramatic talent, Joan Severance is clearly no martial artist and the handful of fight scenes are lucky to reach mediocrity. Equally displeasing is the film's use of sexuality, which seems determined to denigrate the heroine. Yes, the movie is aware of its exploitive nature and gets all it can out of the Black Scorpion's BDSM-inspired outfit, but at the same time, it tries to win points for simply having a mighty female hero. Corman is trying to have it both ways: he wants the heroine to be a strong, independent woman but also wants to titillate the audience by having her engage in a topless sex scene while in costume. Trying to fulfill both objectives seems mutually denigrating and cheapens the value of a rare female superhero flick.Nevertheless, Joan Severance in particular ought to be proud of her work, here. She shines in one of the few productions for which she landed top billing, and while she may not be the action hero I was hoping for, her adeptness at headlining a comic book movie says much about her range as a performer. It's hard to say whether Roger Corman has permanently retired the Black Scorpion character, but I'd be happy to see Severance take up the role again, especially if it's for a feature as fun as this one.","Joan Severance is a pretty good actress, and WOW does she look good in a skin tight PVC superhero costume, but anybody watching her try to do a fight scene for more than six seconds should realize that she's no action star. Nevertheless, this movie's director insists on shooting every moment of every fight scene in a medium two-shot. This sort of approach works with outstanding martial artists like Jet Li or Jackie Chan, as it allows the audience to observe the artistry of their fight moves as their bodies generate them. With an ordinary person, however, this approach shows off only the fact that this is an ordinary person who can't fight. Presented with this obvious fact, director Jonathon Winfrey should have gotten creative with wires, stunt doubles, camera movement and close-ups to energize the action, rather than leaving it up to attractive non-athlete Severance to carry every scene. Winfrey didn't. The resulting movie features leaden action scenes broken up by unconvincing drama, little character interest, dull dialogue, boring visuals and a rather downbeat tone. Did its creators think there was a market for a lethargic actioner about a costumed vigilante who literally couldn't fight her way out of a paper bag? It's not even imaginative or outrageous or silly enough to be entertaining as camp. Avoid.","A masked woman, dressed in a revealing black outfit, beats up bad guys and drives around in a car specifically designed to fight crime. The idea has an irresistible voyeuristic / fetishistic appeal, but the result here is an utter disappointment. The first mistake was the overly serious tone, which doesn't really serve the ludicrous material very well. The second was the miscasting of Joan Severance in the title role. Sure, she has a good body, but they could have picked a woman with an even better body AND a more attractive face, or a less wooden actress, or someone more adept at martial arts (they made a far better choice for the \"Black Scorpion\" TV series: Michelle Lintel). The insulting script (one minute, she hears the crime on the police radio; the next minute, she's right there to stop it!) and the low production values are no help, either. I have never actually watched the TV series so far, but judging from \"Sting Of The Black Scorpion\", which was a compilation of three episodes from it, it seems to be a vast improvement on this feature. (**)","I had just seen another Roger Corman film, \"The Death Artist\" less than a week before this was on, and I found that film very funny and entertaining. I have also seen another Corman film, \"Sawbones,\" which was quite entertaining in itself, so I had high hopes for this one and it very, very much let me down.The only \"good\" part of \"Black Scorpion\" is a cheesy villian called \"the Breathtaker,\" who looks and acts about a serious as the villians in \"The Power Rangers,\" and I guess is supposed to want to take over the city by spraying toxic chemicals or something silly like that. It sounds dumb, and is, and even \"The Breathtaker\" had his dull moments(like what was with all of his bumbling villian apprentices, especially two annoying female wrestlers, and where, by the way, did he get the power to fly?), but he was better than anything else in the movie. My only major problem with him was not even necessarily related to the character itself, but I must wonder why different actors were used to play The Breathtaker and the, uh, person behind the Breathtaker's mask? Did whomever was in charge of casting think that one or the other of them couldn't pull off the effect by themself? Was the voice of the Breathtaker too \"ugly\" to have his face revealed, which more or less makes his human counterpart some himbo cast only for his looks? Because that's not very fair to either of them, but I suppose even that discrepancy with \"Black Scorpion\" did not TOTALLY ruin the film for me...\nWhat ruins \"Black Scorpion\" is its stupid title character, some bimboey \"police officer\" named Darcy, (Joan Severance) who, as a cop seems to masquerade as a prostitute with some...\"real\" prostitute until her daddy(Rick Rossovich, who, as a result of utterly cheap casting looks about the SAME AGE as Severance)is for some reason gunned down by the local DA, and Darcy gets canned(or suspended?) for police brutality after she goes to confront him in jail. A combination of seeking justice for her father's death and letting down her dull prostitute friend inspires Darcy to become the \"Black Scorpion,\" a female superhero that goes around saving...other prostitutes, or at least not-very-properly-dressed people from bad folks, who all seem to somehow be connected to the Breathtaker. I really didn't know how the Black Scorpion's saving the world connected to the Breathtaker, except somewhere in the middle half, Darcy/The Black Scorpion suddenly realizes that he must have been involved in her father's death. Abruptly after that, it suddenly jumps to \"who is the Breathtaker?,\" so what was the point of all of that other junk? Who knows and the character of \"Darcy,\" her charisma-free boyfriend and prostitute friend, and pretty much everyone else were not interested enough for me to make any kind of exceptions to not-very-well developed writing. If people want to make a stupid, intentionally campy film, they can at least make it a WELL-WRITTEN stupid, intentionally campy film, as \"Sawbones\" and \"The Death Artist\" proved to be. What went wrong with this one?","This is really a terrible film by any of the regular yardsticks. Plot, storyline, acting, effects, direction - I could go on. Suffice to say it's poor. However, it has a certain appeal. Many totally out of context sex scenes appear, it's fun looking for the Batman references. Umm - that's it. Poor really, don't bother."],"review-user":["lotsafun","TBJCSKCNRRQTreviews","Ebenezer Beelzebub","vamp88","matoolz2","lordzedd-3","Shaithis","guisreis","lone-wolf-007","poolandrews","savasmert25","JamesHitchcock","phubbs","lemon_magic","vampyrecowboy","The_Phantom_Projectionist","dave13-1","gridoon","Goon-2","seamanm"],"review-date":["23 July 2004","7 July 2005","17 December 2000","20 March 2003","8 June 2001","23 June 2007","14 January 2000","21 May 2014","20 January 2010","28 April 2010","26 August 2018","6 February 2013","10 June 2014","20 March 2017","14 May 2010","11 December 2015","27 December 2011","7 September 2005","13 November 2001","5 October 1999"],"review-rating":["10","6","6","7","8","9","7","5","5","5","4","6","5","5","6","3","5","1"],"review-title":[" Fun!\n"," Campy Batman-like entertainment\n"," Yo, Computer!\n"," High camp good fun\n"," A campy Batmanesque funfest\n"," Roger Cormen's comic fantasies come true\n"," Super Heroine To The Rescue!\n"," Copying Tim Burton's Batman but with a beautiful actress and in a B-movie: the result was not bad as you may expect\n"," Feel the Sting\n"," Silly & cheap but sort of watchable.\n"," So bad it's good!!\n"," One Long Over-Extended Joke\n"," Black Scorpion\n"," Lame and inane, but relatively harmless and fun\n"," There's a reason that you never saw this in the theatres\n"," \"Turn off the radio and go to bed - that's an order\"\n"," A lesson in how NOT to make a superhero movie\n"," Disappointing; Joan Severance has nothing on Michelle Lintel!\n"," Not that funny or moving, \"Black Scorpion\" was instead a rather disappointing film\n"," Appalling film - candidate for 'so bad it's good'.\n"]}