{"review-url":["http://www.imdb.com/title/tt0108186/reviews"],"review-text":["People rag on Pauley Shore for being a bad actor. On the contrary, he wasn't an actor at all, but a swell entertainer. You could stick him in a dumb situation and he could just jump in, act naturally, and have a whole lot of fun doing lots of stupid things. That's what makes his movies so damned funny.The story isn't anything new. A city boy is planted in a rural South Dakota farm town. He's an outcast at first (and likewise they're alien to him), but eventually they mesh and he rubs off a bit on them and vice versa. But, here, Pauley (as Crawl) follows his college friend to her home in the boonies for Thanksgiving break. Trying to avoid her boyfriend who just insists on getting married, she comes up with some story that they're actually engaged. Her parents are blown away by it because obviously they'd rather see her settle down with the townie than with the very strange Crawl. In the end, everything works out fine, obviously. The actors are swell. I particularly enjoyed Patrick Renna as the once-obnoxious little brother with a rad sense of humor. And of course, Pauley Shore was good at what he does: making people laugh.\nThumbs up.","Despite myself, I really kinda like this movie. Pauley Shore is invariably laugh-out-loud funny, and here is no exception. He is just excellent at playing the weirdo with a heart of gold.His performance in this, although nothing out of the ordinary for him, is so good, it seems to lift other cast members' performances. Perhaps this is because he's the kind of guy it's easy to bounce off of.The clichés about country life in this movie are hilarious and the way Shore's \"city boy\", Crawl is so at odds with the way of life, is funny too, but it's not only he who's a fish out of water; comedy also comes from the fact, that to any \"ordinary\" person or people, Crawl is a freakish nightmare of a person. That's why this movie works in such a great way: we love Crawl, he's a breath of fresh air, but we can also sympathise with the Warners. He is one hell of a culture shock.Although this movie is classic Pauley Shore, so there's no great brain power needed to enjoy the movie, enjoy it you do, and there's even a \"never judge a book by it's cover\" type moral here somewhere. Not bad, not bad at all.","One of our all time family favorites. When we need a laugh...we just put this one in and laugh all way thru like it is the first time we've seen it. This film has good, clean family humor. Pauly Shore is brilliant! With no plans for the thanksgiving holiday, Crawl (Shore) is invited to spend the holiday with a conservative coed, Becca. Crawl, being a big city boy, must adjust to the farm life if he is to fall in love with Becca. But, Crawl isn't the only one who is learning new things. Crawl teaches Becca and her parents how to be more open about their feelings and accepting others. This is fun for viewers of all ages.","Son In Law didn't do so hot in the box office, but that only means the masses were wrong. This movie is one of the few movies that Pauly Shore really excels in, with some of the funniest lines I've ever heard. Although the ending is sub-par, the antics of Shore carries the movie.","Along with In the Army!, this ranks as one of Pauly Shore's best movies, if there is such a thing. While the whole West Coast-meets- Midwest-culture-clash isn't anything new, this film proves to make the story a little more entertaining with the wild and unpredictable antics of a then fresh Shore. While the change in values probably would have gone in the other direction, the whole concept was rather entertaining. Not only was Shore's interaction with the family hilarious, it also had Carla Gugino and Tiffani- Amber Theissen (she'll always have the Amber in my book) in two ravishing and early roles. One of those films I have no problem watching when it is on TV.","Before I saw \"Son In Law\" I only had a vague idea who Pauly Shore was. Now I know. He is a superb comedic actor. In this movie he plays \"Crawl\", an upperclassman dorm counselor, who is a bit eccentric. He meets freshman \"Becka\" from South Dakota and they become fast friends. He helps her break out of her small town mold. In a Thanksgiving visit to her parents' home, he pretends to be her fiancee to save her embarassment of a sort with an old boyfriend.I loved two things about this movie. Pauly Shore and the comedic situations are the first. The second is the message. How generations of \"men\" had perpetrated the same offenses against each other, and \"Crawl\" helps them see a better way to treat each other. He gets Becka's mom also to feel \"alive\" again, and rekindles romance between the parents. The whole movie is a fresh approach to comedy, is a joy to watch. I rate it a strong 7 of 10.","I love it! I love Pauly Shore. It seems some people don't agree. It's humor, and he's not like everyone else. The movie is great. I love the story line and most of the people in the movie. It's funny from the first time she meets him at school. I like the fact that she chooses him over the guy back home. I like that Tiffani Theissan isn't a bad girl in the end. All the secrets are let out. Only the people you want to see are left in the end. (except for those of you who don't like Pauly Shore.) Even if you don't like him, there are funny parts, and her family tortures him through most of the movie. She's country girl gone wild and needs to be heard. She finally makes it. It's got just the right amount of love and romance. I give it an 8 out of 10.","I didn't expect much when I decided to watch this movie, so I was surprised to find myself thoroughly enjoying it. A couple of scenes had me laughing almost uncontrollably. The characters were engaging (no pun intended); however, the story is predictable. The fun of it comes from watching Crawl (Shore's character), a ditzy-yet-wise California dude a country college girl brings home for Thanksgiving, trying in his awkward (yet endearing) way to fit in to their lifestyle. I was also surprised that in all this there was a message. If you have a chance, see this movie!","It amazes me that anyone would find Pauly Shore entertaining: he is basically one joke that gets stale *real* fast. He has his little \"California\" jerk vocabulary and a basic stock of lame jokes. Mainly, he is just obnoxious.That said, I watched this movie because I was up sick and there was literally nothing else on but infomercials, otherwise I would have turned it off after 30 minutes. Anyway, the film could have been OK if Pauly could have just turned off his spiel and just played it as a comic actor instead of, well, Pauly. Anyway, I'm sure Pauly fans will like it anyway - but if you are not a Pauly fan, stay away from this crock of manure.I had to leave this comment after seeing that another user actually gave this film a 10/10! (Maybe it was Pauly!!) Personally, I gave it a 3/10 because they didn't have any mike-in-frame shots, didn't drop the camera, and the supporting cast was pretty good.","Here's another of these modern-day ultra-sleaze comedies in which dysfunctional families are supposedly hilarious. Know wonder people once asked, \"What ever happened to Pauly Shore?\" Well, Shore didn't disappear, but his career took a nose-dive, that's for sure. Movies like this one, didn't help.In \"Son-In-Law,\" Shore plays an incredibly-obnoxious character called \"Crawl,\" and yet he's the most likable of the family! His father is a profane idiot; his mother is totally incompetent, his young brother is a sex maniac and his college-age sister is a real snot.Watching an hour and a half of totally-unlikeable people was tough to do. I certainly wouldn't watch this again, or recommend it to anyone but die-hard Shore fans. Adam Sandler took Pauley's shtick and went a lot further with it.The following is an excerpt from the IMDb title page here under \"biography\" and it explains why I am not the only one who was disgusted with this movie.\"........but his lunacy was dismissed as crude, dumb and, for the most part, unfunny. His film career quickly tanked. This downhill spiral was not helped by the failure of his failed Fox sitcom \"Pauly\" (1997) in 1997. Lambasted unmercifully by both critics and media alike, he was soon becoming a running joke and forced to lie low and ride out the storm....\"","This is the only Pauly Shore movie you should ever see. O.K., it's the only one I've ever seen, and I think I've made good choices. I normally find Shore's shtick kind of tired, but he is very funny in this movie. Actually, the script is pretty funny, and Shore doesn't overwhelm the other actors with his ... what do you call it? Tomfoolery? Anyway, this is a funny, if ultimately forgettable film. --Frink-3","this is pauly shore's best,and funniest movie. it has some funny jokes,but the movie is more entertaining than it is funny. pauly shore is funny,but not real,real funny. as long as the movie is entertaining,pauly shore doesn't have to be real funny. i give son in law *** out of ****","I've sat through several Pauly Shore movies, but this is the only one that I've liked.  Of course, it helps that he is far less irritating than usual, perhaps even a little likeable.  The rest of the cast does a fine job, especially underrated Carla Gugino.  The film itself is basically a harmless and silly comedy, and although few of the jokes are especially funny, the film is quite entertaining overall.","Country-girl, Gugino meets rock 'n' roller, surfer-dude (comedian Pauly Shore) while attending college in California; they fall in love (for reasons that remain a mystery to the audience) and she brings him back to the farm to meet his future in-laws. Shore spends most of the film's running-time making animal noises and pronouncing words in a slightly unconventional manner because the writers couldn't be bothered to come up with any jokes. To top it off, the leading lady is also a bitch who heartlessly dumps her boyfriend for the sake of our \"charming\" genetic- defect, and while this movie does try to justify this by making him a cheater. The problem is, she doesn't find out until the end, so for all she knew, she could have been breaking the heart of an innocent man. Let me tell help you out here movie; merely making one character an ass doesn't exempt the other from being a bitch. Also, merely exaggerating the length of a word (buuuuuuuudy) isn't funny. Lazy humor at it's, err, laziest.","The cast was well picked.  Pauly Shore is hilarious and does a good job of bringing the plot of the movie together.  However, Tiffani Amber Thiessan is who really makes this movie special.  Her talented acting combined with her great looks makes this movie a definite see.","\"Son In Law\" is the best Pauly Shore movie made.\"Son In Law\" combines comedy from Shore as well as the rest of the cast to moments that will just say wow I didn't know Pauly Shore could do that: I wish his other movies were as good as this one because his comedic talent is great.The biggest highlight of \"Son In Law\" came by way of the performance of an actress named Carla Gugino. Watching \"Son In Law\" years after it was released, it is something special to watch her because she brings her beauty and electricity to a movie; most of which she has brought to future films.","Shore remains one of the mysteries of film history.  Looking like what would result if Richard Simmons and Weird Al Yankovic had a child together, he is the unlikeliest of movie stars.  Yet somehow, for a time at least, he managed to carve out a career for himself as a comic leading man.  This film is often cited as one of his least annoying, but even here he is sometimes hard to take.  He plays a way-out, overaged college student who winds up coming home for the Thanksgiving holiday with a pretty freshman from the country.  Once there he offends, then predictably wins over, her family and friends......most of them anyway.  The film is undeniably predictable and familiar and the material is very slight.  Yet somehow, in spite of its hurdles, it manages to entertain to a certain point and actually contains a few laughs.  Shore, as agonizing as he is, does occasionally score a thoughtful moment or two among all the slapstick and crude language.  Gugino is lovely.  Her presence adds immeasurably to the overall geniality of the film.  The actors portraying her family do a very nice job as well.  Smith as the father is suitably outraged by Shore.  Pickett adds dimension to a pretty standard role.  The best are Renna and Adams.  Renna plays the obnoxious younger brother role to the hilt.  It would be hard to come up with a brattier persona, but he puts a fun spin on it.  Adams get a late career gem of a part as the cantankerous grandfather and steals many of the scenes he is in.  To the director's credit, none of these characters get shorted in their opportunity to present themselves.  (In other words, Shore isn't the ENTIRE show here.  The supporting cast gets to shine as well.) Also present are hunky Gauthier as Gugino's former boyfriend (often looking like Tom Cruise in \"All the Right Moves\") and sexy Thiessen as the local easy mark.  The movie is already dated in terms of its clothing and other aspects.  Shore gives Pickett a makeover and it's hard to see why anyone thinks she looks better than before!  Fortunately, the thing doesn't drag on for too long.  It's just a short, sometimes funny, sometimes sweet, sometimes stupid movie that is blessed with a few enjoyable performers and a refreshing lack of undue sex and drugs.","The annoying Pauly Shore befriends college freshman Carla Gugino in Los Angeles and then goes back to the country with her for Thanksgiving (he was invited because he had no one to spend the holiday with). Gugino's home-town boyfriend proposes marriage and she tries to discourage him by saying she is really engaged to Shore (a complete lie of course). Naturally the family is not crazy about Shore to begin with, but slowly they start to accept him and his strange California ways. Another one of those endless fish-out-of-water films that is more tedious than entertaining. Still probably the best Pauly Shore film yet (that is not saying much at all though). 2 stars out of 5.","If you like Pauly Shore, you'll love Son in Law. If you hate Pauly Shore, then, well...I liked it!","This movie is extremely funny and it also contains the best looking girl, this young man has ever seen.  Tiffani-Amber Thiessan is a great actress and she has the looks that stop traffic.  Tiffani completes this movie, which contains funny scenes put on by Shore.","On his recent maligned reality-show, Mr. Shore conceded his filmic oeuvre is best enjoyed stoned. No, he must have said \"best watched.\" While a healthy toke might see you through the end credits, there is little pleasure to be found, save some sporadic chuckling at the picture, not with it. Titular hyphenate absence is the least grievance. Other hyphenate, wholesome Tiffani-Amber Thiessen (I dare you to rub out that \"Saved by the Bell\" patina of purity) is miscast as a rural vamp; she's too round of face for treachery. Mr. Shore, himself occasionally displays the odd talent for mimicry (I thought I recognized a Jimmy Stewart in there), however it is never aptly used. The trite fish-out-of-water formula has yet to be rendered with less grace. Our hero, Crawl has precious little wit to account for expeditiously charming his agrarian antagonists. Ultimately, I had to announce it's been ascertained: THE WORST MOVIE EVER. P.S. As another fish, Adam Sandler fared better with \"Mr. Deeds.\" It may take a Shore to appreciate a Sandler.","This movie is one of the worse movies of all time. I'm kind of upset this movie isn't on the bottom 100; it deserves a spot at least number 60 or 70 on that list. This isn't just a film I think is bad in a campy-fun sort of MST3K way; it's just bad. This is one of the few films that I really, really HATE. Freddy Got Fingered is in the same category of bad.So the story in this one goes that the daughter (Gugino) goes to California to go to school and comes back with Crawl (Shore) and he tries to learn to be a farmer. Then the boyfriend tries to set Shore up so that the girl will leave Crawl and go back to him. It ends and what's left of the audience can leave.The main purpose of this movie is for Pauly Shore to mug for the camera and try to be funny; but I'd say about 100% of the time he fails at that. Their horrible inaccurate and out of date view of farms and farming is offensive and there's nothing in this movie worth seeing. If you think of seeing it: don't. The one time I saw the movie it felt like I was watching it for 5 or 6 hours. If you've already seen it; you have my sympathy.","\"Son In Law\" is the best Pauly Shore and the only Pauly Shore movie I recommend.\"Son In Law\" combines comedy from Shore as well as the rest of the cast to moments that will just say wow I didn't know Pauly Shore could do that: I wish his other movies were as good as this one because his comedic talent is great.The biggest highlight of \"Son In Law\" came by way of the performance of an actress named Carla Gugino. Watching \"Son In Law\" years after it was released, it is something special to watch her because she brings her beauty and electricity to a movie; most of which she has brought to future films.\n\"Son In Law\" will make you laugh, cry and scowl; it is worth watching.","I have to say this movie puts Star Wars, Lord of the Rings and even the Godfather movies to shame, this is one of the best movies ever, and I am astonished that Pauly did not receive at least an Oscar nomination. This was a well-written movie, with great performances(especially Patrick Renna, who was outstanding in his role as Zack). I highly suggest people to watch this movie. Thank you Steve Rash and the whole crew who made this movie possible.I believe that it was from this movie that Patrick Renna's career took off. His acting performance was incredible in the recent Sobe commercials, and I think he got the part because of this movie.So I definetely recommend this movie to everyone who wants to see a ground-breaking movement in the movie business.","Good work by Pauly Shore.  See it, I`m sure you´ll laugh. A quite nice comedy."],"review-user":["vertigo_14","john-mitchell77","deidrevest","Apostle","Agent10","TxMike","lavender8787","siler","pluto-11","ccthemovieman-1","frink-3","jaws!","Tito-8","dalldorfw","clintos","michaelsibley416","Poseidon-3","tfrizzell","evanave","clintos","Chewbacca_42","SilentJerry","MichaelOates","Sintelin","RAI-5"],"review-date":["31 December 2003","12 December 2006","4 September 2005","20 May 2000","9 July 2002","17 July 2000","27 February 2005","16 January 2001","22 December 2002","30 July 2008","13 July 1999","6 October 1999","28 April 2000","23 June 2012","10 December 1998","26 August 2004","4 September 2003","30 October 2002","8 February 1999","9 December 1998","18 October 2005","22 December 2002","19 May 2004","22 March 2003","3 January 1999"],"review-rating":["7","10","8","7","8","7","3","2","7","8","2","7","10","7","1","1","6"],"review-title":[" Green Acres Goes Grunge\n"," \"Cheek chillers. You likes?\"\n"," It will keep you laughing!\n"," Destined to be a cult classic!\n"," Pauly Shore deserved an Oscar\n"," Funny, offbeat movie with a real message, 7 of 10.\n"," I loved it! Pauly Shore is hilarious!\n"," cute, fun movie\n"," Unbelievably Bad. This deserves a big Bronx Cheer!\n"," This Movie A Good Example Of Why Shore's Career Went Downhill\n"," Not Terrible\n"," shore's best\n"," Surprisingly good\n"," Gaaa! Crap!\n"," Thoughts on the Acting Performances\n"," entertaining\n"," Not great, not horrible.\n"," If You Have Seen One Pauly Shore Film, You've Seen Them All.\n"," Pauly Shore at his best\n"," Description of Actress\n"," Swim Away from Shore\n"," It's bad.\n"," entertaining and funny\n"," The Best of the Best\n"," Worth to see\n"]}