{"review-url":["http://www.imdb.com/title/tt0111212/reviews"],"review-text":["Anyone here like cheese? Look no further than Gang Boys. You won't be disappointed. Washed out alcoholic ex-cop Joe Joiner,(Wings Hauser, who also writes and directs) is contacted by his ex wife Maggie(Linda Blair) after their 15 year old gay son is beaten and sexually abused by a gang of evil Neo Nazi skinheads, led with relish by Wings' son Cole. It's up to Wings to remember his responsibilities as a father, and kick skinhead ass, which he does with gusto. Critically, Gang Boys is atrocious, but in the sheer cheesy entertainment stakes it's awesome. It has wild overacting by Cole Hauser, and illogical scenarios such as a bunch of street skins having a rather spiffy lair, complete with sinister strategic mood lighting, and an honest to god swastika for a floor. It also has about 57 montage sequences, the funniest being Wings getting back in shape.(think of a flabby, sweaty alcoholic Rocky and you're halfway there) It's also surprisingly sleazy, with rape scenes and Hauser getting peed on. Basically it's a hoot, and a great beer-or-whatever-your-vice-flick. Besides, Wings Hauser + Linda Blair + montages vs skinheads = entertainment.","As a contribution to the world of film this is little more than an over the top exploitation of after school special styled themes, which is what actually makes this film so entertaining. It's lewd, raunchy, violent, ridiculous and completely out of control, with a neo nazi skinhead gang beating on a gay teen, raping random women, and generally terrorizing Hollywood Boulevard in an effort to impress upon the world the true white man's definition of freedom; a survival of the fittest type dogma set to the soundtrack of really bad eighties sounding Top Gun rock music. The father is a pitiful drunk at the start of the film, in exile in Mexico(there is hilarious shaky drunk hands and alcoholic bad behavior by Wings Hauser) for some murder he'd committed as a cop a year earlier, his guilt over the incident haunting him. Eventually a revenge plot is hatched as the entire family experiences violence on all fronts by the skinhead gang, and then the hunt is on. This one is so worth your time if you are into good, solid trashed out B movie street gang blowouts. The family even recruits the crips and bloods for a full scale riot meltdown against the skins.","I forgot the film once it was over but I will never forget Cole Hauser's monologue at the beginning of the movie. I don't know how much was adlibbed etc. But the calm controlled delivery and the crystal clear precision of his intent makes this movie worth watching. I find it interesting that Ed Norton received so much hype for History X I understand the mechanics of empathy and that is what it is. Hauser's Skinhead had no redeeming qualities and so it passed by the wayside. But... just for a moment forget the politics of dancing and just take the delivery of the words into account. Professional. Professional. Professional.","Wings Hauser and son, Cole Hauser team up to make a film about Neo-nazi thugs targeting a gay man, and terrorising a city. Wings plays the hero, and his real-life son is the villain. Fairly low-budget film that has not many redeeming features, and for some reason, no one has seen it! Perhaps because it is quite a laughable and ridiculous film, and the studio realised this! Maybe Wings Hauser himself prevented the distribution of 'Skins', after seeing it himself! Maybe people just didn't want to comment on such a bad film! Oh well! I generally like Wings and Cole as actors, but this was a film that they both should have skipped. Wings directed, wrote and was the lead actor in 'Skins'! An extremely bad and stupid film! 1/2 out of *****!","I watched this film awhile ago and the only thing i can remember about the film is how absolutely horribly outstandingly bad it was its definitely in my top 5 worst films i have ever seen.And to think i had to persuade my mates to get this film out at the video shop,my reputation has been shot to bits because of this film will my mates ever trust me again?i doubt it,they always say don't judge something by its cover,they were right when i saw the cover to skins/gang boys i thought wow this looks great as it had a load of skin heads on the front cover running riot with metal bars.Don't WATCH THIS FILM.i can't think of anything else to say the acting is bad the story is bad its just bad."],"review-user":["Corpus_Vile","frankie-65","calussed","the amorphousmachine","Bill_Hicks_Ghost"],"review-date":["8 September 2009","3 January 2006","6 July 2004","16 January 2002","2 January 2006"],"review-rating":["6","1","1"],"review-title":[" Wings vs Nazis!!\n"," crazy genre trash.\n"," Cole Hauser delivers one of the most solid monologues in the history of film. Period.\n"," If you manage to find this film, don't bother watching it!\n"," bad bad bad\n"]}