{"review-url":["http://www.imdb.com/title/tt0114559/reviews"],"review-text":["When I saw the preview for this movie, I figured to myself, \"here's another dumb TV movie that's written with the thought and complexity of a soap opera,\" but when I saw it I was surprised. Tiffany-Amber Thiessen stars (and proves that she can indeed act if given the chance) as a woman who falls in love with and marries a man (Now and Again's Eric Close) but begins to lose trust in him when a series of rapes begin to take place in her community. At first, she is blinded by his assurances that he is innocent and her love for him, but as time passes she continues to be suspicious of him.While this sounds like the set-up for another boring melodramatic TV-movie, it is really much better than that, because the characters are well-acted by Thiessen and Close, and the movie's script allows them to be much more complicated and intelligent than you'd expect; these aren't just caricatures or cardboard characters that exist only to move the plot along but real, three-dimensional people, and we find ourselves really caring about them. And the movie is smart enough that it is able to provide an exciting, involving climax to the story without resorting to dumb action scenes, mindless cliches or cheap melodrama. Instead we share in the main character's inner conflicts and fears, and are given a realistic portrayal of how she might be able to resolve them and do the right thing.If you get a chance to give this one a look, please do so. It's production values are not exactly top-notch (it is a TV movie, after all), but if you can look past that, there is an excellent story to enjoy.","Surprisingly good made for T.V. Thriller. I wasn't expecting too much from this one but I'm glad to say that this is one of the best of it's kind. It's fast paced and features solid acting and interesting events. The story gets you hooked on since the beginning and with many hits, you can't help but find the movie very interesting.The background story of Thiessen's character is hard but it turns into a nightmare when her husband is something much worse than her childhood friend's step father.The \"stranger\" concept and his actions are disturbing if you consider that it is a common disease in society. A serial rapist does not respect society or even his own family and this movie displays the sickness and crime in a perfect way. My beef with the movie was the non sense situation when Thiessen's character returns home with her deranged husband after he's released on bail. By that moment she knew what he did to his young relative (played by the cute Allyson Hannigan). But that's just the typical Hollywood scene that provokes more trouble. The climax scene shows Thiessen following her husband when he's about to commit another rape, then she calls the cops who come in time just to capture him. The ending tells us that the husband was sentenced for 99 years in prison in real life. The acting is also pretty good, and Tiffany is great and gorgeous as always. The direction is also very good.","Gerald McRaney,(Dave Morgan),\"War Crimes\",'01 TV Series, was like a father to Tiffani Thiessen,(Jennifer Gallagher),\"A Kiss Before Lying\",'03, who experience a very bad situation in her life and it caused Jennifer to be withdrawn with people and young men. Dave Morgan tries desperately to get her out of the house and manages to introduce Jennifer to Chris (Gallagher) who falls madly in love with her at their very first meeting. In almost one or two dates later, Chris asks Jennifer if she will marry him and she agrees. It is not very long after the Wedding that things start to happen, Chris is in the Navy and does not like working in submarines and things start happening to young gals in the neighborhood. This is a very excellent TV film and it sometimes makes you wonder if the guy or gal I want as a Soul Mate is the Perfect PERSON !","The characters do ridiculous things that no one in real life would ever do, but if it saves me from a boring second act, realism shmealism. This one is about a woman who has been raped, who marries a guy who is peeping tom! (He is also briefly a gorilla.) When he is arrested for peeping, he and Tiffani start keeping a journal together of where he should be every day, to keep him on track so that he won't peep again, but instead he turns into a rapist, as they all do on Lifetime. While I was a little disappointed to lose the unique peeping plot, I was thrilled when he basically kisses her on the cheek and tells her he's dashing out for a jog and a rape. Be back in a jiff, hon! She knows he's the rapist, he knows she knows, and he keeps rubbing her face in it by, for instance, laying his gun and rope on the table in front of her. It got a little dark when Alyson Hannigan confesses that he molested her when she was a kid and warns Tiffani to protect her new-born daughter from him (!), but it was played for suspense instead of misery. Gerald McRaney is quite likable as a paraplegic, and country music singer Lorrie Morgan plays one of the navy-men's wives. If you want a true-story message Lifetime movie, this one won't butter your bread, but if you like 'em fluffy like I do, give this one a shot.","This movie is based on the book \"Evil Beside Her\" by Kathryn Casey. It is the true story of a Texas woman's marriage to a dangerous Psychopath. Most everything in the movie really did happen, although a few small things are fictional (names and some fictional characters etc...)and of course the more graphic things and other details were left out of the script. I myself thought this was a very good movie and Tiffany Amber Thiessen did a great job, as did Eric Close. Casey is a very good crime writer and this book is a good one. I watch this movie every chance I get because I did read the book. Most movies you watch on the Lifetime Movie Network are true stories and a lot of them did not make the news nation wide.","**SPOILERS** You begin to wonder just how true the events that inspired this movie were within the first ten minutes. We get to see this kooky but nice guy wearing a guerrilla suit, when he's first unreduced in the film, Chris Gallagher (Eric Close) making a monkey out of himself as he goes completely ape sh*t over Jenniffer or Jen, Tiffani Thiasen, whom he met at a Memorial Day picnic.Not wasting any time Chris gets in tight with Jen's crippled landlord Dave Morgan, Gerald McRaney, who set both him and Jen's up on a date. Moving at breakneck speed Chris get Jen to quickly fall in love with and then marry him in what looks like less then 24 hours. It's at her wedding reception that Jen's get some disturbing vibes from Chris 17 year-old cousin Dana, ALyson Harrigan, that there's something very screwy about him that has to do with his very overactive libido. That fact about Chris should have been very obvious to Jen from his very strange and unorthodox, to say th least, love making habits!It also turns out that Chris a nut about being in the Navy washes out of the service in his fear of being in an atomic sub for three months at a time without shore leave as well as without his gorgeous wife Jen. What really comes to the surface about the boyish and lovable, when his manic depression doesn't set in, Chris is that he's a triple \"A\" sickola in his behavior when he comes in contact with beautiful but unsuspecting, in what he has in store for them, women. Chris is not only suspected by the cops of spending his free time, when he's not with his wife Jen, snooping around the neighborhood spying, through their bedroom windows, on women undressing but even at times breaking into their homes and raping them! When these mental aberrations about Chris become known to Jen she's already pregnant with his, and her, child and leaving him isn't an option! Especially when the guy, who's also a hyped up control freak, threatens to murder her if she does. It's hard to take the action that Jen at first does, which is next to nothing, in her knowing that she's living and sleeping with a man who's at least four cans short of a six pack upstairs in his head. When the couples, Jen & Chris, child is born Dana lays it on Jen about how her older cousin Chris molested her as a young girl and what he's now capable of doing to their new born daughter, when she grows out of her diapers, Molly. Meanwhile there's this rapist running around town attacking women at gun point that not only fits the description of Chris but does his \"thing\", raping and robing women, when Chris is not at work or at home making him, in Jen's mind, the number #1 suspect.With no one believing Jen that her husband is a psycho rapist and can very well graduate to murdering his victims Jen's has no choice but turn him over to the police and let justice, in the fact that he's is the \"Woolcap Rapist\", decide his fate. Having no evidence to have her sick but very clever, in knowing how to cover his tracks, husband brought to justice Jen plans to catch him in the act and then get the cops to put the pinch on him. That was very brave on Jen's part but the big question is what if her suspicions about Chris are wrong and backfire on her! That would not only break up her marriage but have Chris get custody of Molly with Jen being, by the court, declared an unfit mother! But if in fact Jen is right about Chris how could she not be sure that he'll turn on her, before the cops can come to her rescue, knowing that he's not only a danger to all the young women in town but also to her and her infant daughter Molly as well!","At a picnic, exceptionally beautiful Tiffani Amber Thiessen (as Jennifer \"Jen\" Moore) meets exceptionally handsome Eric Close (as Chris Gallagher). He wants to go out with Ms. Thiessen, but she's not dating. Encouraged by fatherly friend Gerald McRaney (as Dave Morgan), Thiessen changes her mind quickly. Their first sexual encounter doesn't work out very well. Thiessen lets Mr. Close know she was raped two years ago. Close seems very understanding. He proposes and she accepts. They are an exceptionally beautiful and handsome couple. But, if you didn't catch the foreshadowing, there is trouble a-brewing...The community is shocked by a \"Peeping Tom\" and Close becomes a prime suspect. Thiessen defends her husband. Things get more serious when a serial rapist starts sneaking around. Thiessen begins to wonder if Close might be \"The Stranger Beside Me\". This is supposed to be based on a true story. It doesn't impress as very realistic, but writer Bruce Miller and director Sandor Stern were probably not focused on realism. This TV movie is more about chests than rape, and the co-stars certainly have nice ones. Since he's a guy, the camera are more generous in showing Close's chest. Thiessen is way too pretty for her part.***** The Stranger Beside Me (9/17/95) Sandor Stern ~ Tiffani Thiessen, Eric Close, Gerald McRaney, Steven Eckholdt","The movie is good and I think Tiffany Amber is very beautiful. I liked the movie. Can anyone tell me how I can get hold of the songs from this movie? Even the soundtrack will do. If that's not possible, can I at least get the names of the songs with their respective singers? I tried to look up amazon.com but its not there. I tried CD baby, not there either. I browsed through Google to get some details but there weren't any. I would appreciate it if someone could give me the answer to my question. I know that the songs belong to Country Music and is sung by a country artist. I just need the title names along with the singer. I would recommend this movie or rather the songs to any country loving person.","After watching this movie on tv, I looked it up in the IMDB and imagine to my surprise a user rating of 7.6!  This is not a good film.  Especially bad is the editing; the poor way the story jumps from one point to another was amateurish and a huge distraction.  It's not very fluently done.  I do agree that the acting was fairly decent, especially Kelly Kapowski, and that the story was intriguing enough.","Eric Close was the only good actor in this. Playing the rapist husband of Tiffani Thiessen, a not so good actress. She bothered me with her vacant looks, her boring expressions, always pouting and whimpering like a loser. It's obvious in this clinker, that he'll get caught and you don't want him to. That's how likable Close is in this. A good looking guy with personality, you wonder why he needs to be a rapist. Also good to see another good actor, Gerald McRaney in this as the girl's father. Not much he can do in a ridiculous script. Her phony crying at the end didn't impress me.There are no surprises and again you route for Close to win. But that's show business. And once more the women in these LMN movies come off worse than the men do. And Thiessen should get out of the acting business.","Also agree with reviewers on Eric Close. It's his movie from beginning to end. And you get furious when he is dumped on by Tiffani Thiessen as his bimbo wife. Theissen is about the worst actress ever. Can't believe they paid her money for what she does. She's that bad in this. Constantly with a smirk and stuck up look on her face. I wanted him to do her in.Then we have another fine actor, Gerald McRaney wasted in this trivial crap. Both these actors give this stupid film the only interesting performances. All others are nonsense.But worst is watching this so-called actress give the God-awful performance that she does. I just couldn't watch her. Not even attractive, although she walks around like she thinks she is. Argghhh! So here's to no more Theisssen in films and Close and McRaney better leading ladies in the future.","***SPOILERS***Were shown here how the unregulated use of metabolic steroids can turn into spousal as well as, in the case of Patty Yuklich played by Hoilary Swank,child abuse. It's the man of the house decorated undercover policeman Dennis Yaklich,Brad Johnson, a body building freak who went hog wild into pumping himself up on steroids that eventually lead to his demise. His wife Donna, Jaclyn Smith, after taking all she could take from him hired these two mentally challenged, instead of processional Mafia hit-men, neighbors to do her husband in and ended up getting a 20 to 40 years sentence for her effort.Dennis who at first was a perfect gentleman towards Donna later turned into a Frankenstein monster when the steroids, that he took by the handful, took control of his brain. It's also hinted that his first wife who died from an overreaction to her medication was herself murdered by him who, with the help of the local police department, had it covered up. As for Donna here biggest mistake was in hiring these two goof-balls the Greenwell brothers Eddie & Cjharlie,Ramsey Midwood & Jason Kristofer, to do her husband Dennis in. And do it on the cheap, for beer and hamburger money, that made it, Dennis death, a case of premeditated murder not a crime of passion thus having the book thrown at her by the judge.***SPOILERS**** Whatever feeling you have for Donna you have to remember the story or movie is told from her point of view not her husband who's not around to tell it. The guy was an exercise freak but his mind being warped due to the use of steroids and being abusive to Donna and his step daughter Patty is to be taken with a grain of salt. Still Donna going so far as to hire someone to do the guy in instead of just leaving him makes his case, in being innocent, not hers, in being abused by him, that much more believable. That with the fact that Donna's lawyer John Giduck was suspected of having an affair with Donna while at the same time he was defending her for her husband's murder!"],"review-user":["Verbal-17","insomniac_rod","whpratt1","ksmacy-2","sassysweethart64","sol-kay","wes-connors","kurt-324","rowboat","guilfisher-1","geoffox-766-418467","kapelusznik18"],"review-date":["8 July 2000","19 November 2006","8 May 2006","3 October 2005","19 September 2011","16 December 2008","12 September 2014","30 March 2009","22 May 2001","4 October 2008","14 May 2011","30 November 2015"],"review-rating":["10","9","10","5","5","5","7","4","5"],"review-title":[" A surprisingly intelligent and well-acted TV movie\n"," Effective well done Thriller. Worths the watch.\n"," Eric Close Gave a Great Performance\n"," Amazing\n"," This movie was based on a true story----just the names changed.\n"," This film although fictionalized was inspired by actual events\n"," Tiffani Gets Too Close\n"," soundtrack\n"," Riveting Crap\n"," Eric Close excellent in this not so good movie\n"," Agree on crappy film\n"," When I get through with you I'll have this whorehouse turned into a parking lot!\n"]}