{"review-url":["http://www.imdb.com/title/tt0181288/reviews"],"review-text":["I just watched this again the other night.  It's probably the ninth or tenth time I've seen it, and I think it gets better every time.  Contrary to what some people are saying, I don't think the makers of this film are laughing at and ridiculing Mark.  Sure, some of the humor in the film is of the car-crash can't look away variety, but I feel underneath that they really admire the guy and his dogged tenacity. Another thing is I think Mark does show some skill as a director. Remember he has zero money shooting this stuff, and Coven was conceived as a money-making venture so he could make Northwestern.  I think some of the samples they were showing from Northwestern actually looked very good.  Now I don't think Mark writes the best dialogue in the world, but looking just at his photographic eye I'd say if the guy had any kind of schooling he might be shooting movies for someone right now. And finally, I think some of the people making negative comments about this movie need to look in the mirror and think about themselves a bit.  OK, you don't like the movie, that's fine.  But I've seen enough smug, superior, comments on here to make me want to puke.  I love how as long as you're a poor, lower middle-class white in America people love to throw around terms like \"white trash\", \"redneck\", and other such pleasantries.  I believe some scribe from Orange County at the beginning of the reviews even called them \"inferior\".  I'm sure most of the people making the comments consider themselves liberals too; as if they have any concept of what that word means.","At several points in \"American Movie,\" would-be filmmaker Mark Borchadt is forced to confront what compels him on a trail with seemingly few rewards. A constant refrain is heard in his answers. He doesn't want to work the forgettable life of a newspaper boy; he wants to achieve celebrity. Why? Though Mark doesn't quite know, his volumnious collection of scripts and tomes underscores his simple love of film.Yet \"American Movie\" is brutally honest in its treatment of Mark. While it allows his dreams of making \"the great American film\" to fly free on film, it also captures a life filled with lower-class constraints and realities. Despite all of Mark's desire, his motivation is frequently lost in a life gush with alcohol. Hence, the making of Borchadt's film, \"Coven\", goes from 6 months to 3 years and the movie suffers a bit from being drawn out.\"American Movie\" is rife with memorable supporting characters and Mark is an able lead. This film is really the story of two filmmakers, the one in front of the camera and the one behind. Director Chris Smith has already received his plaudits, and once \"American Movie\" makes the rounds of the indy circuit, Mark Borchadt will also have his share of fame. Maybe then he'll know what to do with it.","Okay, so I'm a sucker for a good documentary, particularly where it tells a modern-day Don Quixote story.  A caveat:  I met Mark Borchardt in the winter of 1995/96 while he was still working on Coven.  But I'll save that story for later.  American Movie, which commenced production not long after, accurately portrays the person that I knew, although in greater depth than I expected or believed existed. This is simultaneously a very funny and very sad film, and is brilliantly executed.  Mark comes across as his own worse enemy: his childlike ambition and optimism -- which I admire -- is undermined by his apparent artistic ineptitude as well as his bizarre fiscal expectations. But he's also a charismatic guy.  His loyal Sancho Panza sidekick is equally likeable: loyal, if frazzled, to the core.  Like Don Quixote, American Movie presents an often-ignored inefficient aspect of freedom -- that people will be drawn toward professions to which they are not particularly well-suited, irrespective of repeated failure.  It is a great film.","This documentary is the most hypnotizing film I have seen in a long while.   I must have had it on for an entire day.  The selected material included in the piece flow amazingly well and develop three characters that are impossible to ever forget.  The different layers of these people peel back to make an oddly moving film about perseverance, loyalty and determination.  These characters ended up suprisingly fascinating and the film is unforgettable.","Praised by some, loathed by others, this Chris Smith documentary tells the real-life story of a twenty-something, amateur filmmaker named Mark Borchardt who sets out to complete his thirty minute film \"Coven\", as a first step toward what he hopes will be a lifelong career in feature film-making. Working menial jobs, Mark lives at home in his parent's basement. He's deep in debt. And he has no professional experience. What he does have is idealism, enthusiasm, supreme confidence, and enormous determination and zeal. The question in my mind was: does Mark have ... talent?Reminiscent of Michael Moore's \"Roger & Me\" (1989), \"American Movie\" is both funny and depressing. We watch Mark: write a script, cast players, direct, edit, and especially crucial in Mark's case, find funding. With every one of these tasks Mark plods along frustrated, but determined. All of these activities involve other people, including his mom, his spaced-out friend Mike, and other locals. One of these locals is his real-life Uncle Bill who looks to be in his eighties.At one point Uncle Bill, sitting in his cluttered trailer, demands to be fed before he will consent to being filmed. Later, Mark, being a perfectionist, requires more \"takes\" since Uncle Bill can't seem to get it right. Mark to Uncle Bill: \"You have to believe in what you're saying\", to which Uncle Bill responds: \"Well, I don't; I don't believe in nothing you're doing\". After \"take\" 31, Uncle Bill rebels: \"Isn't that enough now? That's all for me\".Some reviewers of \"American Movie\" have criticized it as pointless voyeurism into the life of a no-talent loser. They refer to Mark and his cohorts as \"trailer park white trash\". Certainly, that is one interpretation, and along with it the conclusion that the film is a sad commentary on the impossibility of achieving Hollywood's idea of the American Dream, when you have no money to work with.But other reviewers find the film to be inspiring, a cinematic pep talk for the underdog, and brutally honest about the realities of indie film-making. These viewers point out that despite the fact that Mark had no money to speak of, he still completed his film \"Coven\", and got it shown at the local theater.My own conclusion is that \"American Movie\" is a well-crafted documentary useful for first time indie filmmakers. It's similar to a TV reality show, but without the competition. The cinematography and the editing are excellent. Although I found Mark to be irritating at times and overconfident of his skills, I admired his optimism and determination. \"Coven\", included as an extra on the DVD, may be a cinematic train wreck. But Mark's overall experience is no less valid as a guide to others. In essence, the message of \"American Movie\" is: don't let this happen to you.","I have mixed feelings towards this movie. I found the movie fascinating in the way people are fascinated by car wrecks, and I found it funny in the way one might uncontrollably burst out a laugh at the sight of an eldelry person slipping on an icy sidewalk. It's a sick and guilt ridden enjoyment. The lives of most of the people this movie brings you in contact with are so pathetic that you can't help being intrigued. But lives hardly worth living do not a good movie make. No; there was more to it than that. What sucked me in to this documentary was the perserverence and tenacity of the characters that carry on day after day in an existence that would drive most people to jump off the nearest bridge. People standing around in robes in  a forst in the dead of winter for hours on end to help a friend that will no doubt produce a film only 400 locals would pay to see. A barely coherent old man who's too cheap to use the phone for local calls lends $3,000 to his nephew for a project he is certain is doomed. A mother who is as clueless as her heart is big sticks by her son through thick and thin. These things tug at the heart and, despite all the pity and head shaking they provoke, reveal a humanity that one can't help but be in awe of.Oh, and the comedic moments are priceless. Uncle Bill steals the show in that department, but many others contribute. (The kitchen cabinet door scene nearly rolled me off the couch.) Yep; there are some priceless laugh spots in this film that almost make you wonder whether this isn't truly a mockumentary in the style Christofer Guest (Spinal Tap, Best In Show). But it's not; it's real life making you laugh, and that makes it funnier.Yes; I enjoyed the movie quite a bit, but probably for the wrong reasons. But so did countless others. In the end, it doesn't matter. A good movie is a good movie.","Looking for proof that real life is more entertaining than fiction? You just found it. This superb documentary about an aspiring feature filmmaker (Mark Bortchart) who refuses to admit defeat is the funniest film I have ever seen -- probably because it's also one of the most tragic. Oddly enough, the more I watch the film the more inspired I become.","This movie, about supremely untalented American film-maker Mark Borchardt and his attempts to make a short film in order to make a small amount of money which will launch him into fame and fortune as a film-maker, is riveting. As they say, fact is stranger than fiction. That is certainly borne out by this picture. Borchardt uses his friends, family, and assorted local actors to try and complete this picture.Borchardt is a character who could drive a novel or inspire cult members. One sometimes wonders why so many of the folks who people his film work for as long as they do, with him. But in truth, it's not hard to tell. Borchardt, however misguided, has vision. He doesn't have much talent and he has a drinking problem, but he has a vision. He has determination and perseverance that others can only dream of. He has charisma. It makes him a compelling leader, but unfortunately he is devoid of many great ideas. His lack of focus and alcoholism extend the length of the production almost indefinitely. He does complete \"Coven\" and even gets a premiere in his hometown theater, but it takes him a long time.He never makes the movie \"Northwestern\" which he dreams of making. Perhaps he didn't have the vision to bring that movie to fruition, but he did want to make epic films and leave the everyday grind of life in the US. He had his dream. Unfortunately, he didn't have the vision to bring his dreams to life but he had an awful lot of determination. If people take potshots at Borchardt for his supposedly being \"white trash\" then I hope they are living lives of total sophistication and order because if they aren't, they're total hypocrites. Yes, Borchardt might exhibit characteristics of being \"white-trash\", but the purity of his belief in getting out from under the life he had, is absolutely inspiring.","For me, the best & most memorable movies are often those which on first viewing I know nothing about. American Movie is a perfect example of just such a gem. Watching TV late one evening, I spotted the one & only good review among the dross - thankfully I settled in for a real treat. American Movie is a documentary following the unforgettable Mark Borchardt (pronounced \"orchard\", I believe), a highly articulate & charismatic Wisconson lad, as he struggles to write, direct and produce \"MidWestern\", a gritty, low-budget Horror movie on which he has been working for years. In Mark we discover a young man filled with contrast. His appearance is of the classic trailer-trash stereotype - skinny, bum-fluff mustache, '80s heavy metal styling, mullet hairdo, etc. To camera however, Mark reveals startling wit & insight as he philosophizes upon life, love, movies & the American way. As the movie unfolds, it sadly becomes clear that Mark's lack of discipline & heavy drinking are relentlessly sabotaging his creative efforts. American Movie is a charming watch, filled with hilarious moments & vivid characters. Chief among these is Mark's lovable buddy Mike Schank, a soft-spoken reformed stoner who, having conquered an addiction to scratch cards, is now dependent on soda pop. I absolutely loved American Movie. It generates real empathy between the viewer & principal characters, and provides hilarity without feeling exploitative. I would wholeheartedly recommend it to anyone.","This is a very well made documentary. I read some of the other comments and I get a feeling that a few of these viewers don't watch too many documentaries (and all the reality TV crap doesn't count). Yes, this movie is painful at times because of the ineptness of the horro film director struggling to get his pals and relatives to help him make his demonic movie. But it shows someone (however debatable his talent)following a dream, a passion, a desire to do something. To break out of his hellish life of debts, and child out of wedlock and dreary 9-5 job. The camera captures wonderful moments of human behavior and just like project Greenlight, it shows what happens when people get in over their heads with trying to just film a simple scene (or a scene where someone's head has to go through a cabinet, or an old man has to clearly say ONE line and can't, etc.) BUT, a much better documentary about the same world is the much earlier 1975 documentary Demon Lover Diary - where someone tagged along as these Michigan guys tried to make their horror film. Hard to track down but highly recommended.","What gives this movie its personality is the knowledge, in the end, that it is all true. While it is a compelling and humorous documentary that does border on mockumentary in some parts (are they staged or is it really happening humorously?), it does seem to get a bit long towards the end.This movie is funny in places it needs to be, and flows relatively well. Reminiscent of Christopher Guest's movies, if you liked those or Adaptation then I recommend you keep a look out for this one.B+","After seeing American Movie, you either hate Mark Borchardt or you understand him. If you are a struggling film maker trying to be the next George Romero, John Cassavetes or Alfred Hitchcock, you will understand Mark's determination and where he gets his talentless motivation. The audience that makes up American Movie is just that. Struggling film makers or die hard fans of Troma. Either way, they are all members of the club of hard knocks and non-union independent feature film. The moral of Mark's story is something short of following your dream. It's more and less than that. Whether you relate with Mark in more ways that one, Mark is living a lot of people's reality. Because of that, American Movie is important and should be watched by every film student in America.","Before I comment on the movie's subject matter, I'll say a few things about the movie itself.It's a great piece of filmmaking. I felt like a fly on the wall, like the people being filmed somehow didn't know the camer was there much of the time. And when they did, they were able to be honest and direct. The editing job is first-rate, with much of the comedy coming from the editing.It is a comedy, albeit a dark comedy. Without the humor, the film would be too depressing to watch. Mark's misoginy and neglect of his children is chilling, as is Mike's drug and alcohol abuse. But these people care about each other in their own ways, and they are very passionate about making movies. The interactions betwen Mark and his Uncle Bill are both the funniest and the saddest parts of the film.The DVD includes \"Coven,\" and it's much better than I thought it would be. Interesting film angles, competent editing, and passable acting--better than any Roland Emmerich film.The title tells the story: This is about the heart of America, and it doesn't matter that it's in the supposed \"heartland.\" There are people all over this land with the same dreams as these people--and the same obstacles to those dreams. ...OK. That was pretty corny. Sorry. I really liked this movie.","I enjoyed this one, because I can relate to it. At one time in my life I was trying to make films, and experienced many of the same problems Mark Borchardt did in trying to make HIS film. And I also went through a protracted period of self-absorbed arrested development, where I refused to grow. But then, miraculously, I got married, and had kids. I realized that being a struggling filmmaker was, in all likelihood, not going to feed my family. So I got a decent job and did what I felt I needed to do to make that happen. That is what an mature, responsible adult does. Mark hasn't faced up to that reality as yet, and so, in that sense, he is a retarded adolescent. For this reason, there is a hopelessness about him. Like Don Quixote, he seems so inept and self-deluded that he doesn't realize how bad off he really is. The viewer feels a sense of superiority and pity for him and his circle. Mark has kids and an ex-wife and bills to pay, but the film depicts him caring basically only about pursuing his \"artistic vision\". Despite this, Mark comes across in the film as a likeable individual, surrounded by a very interesting family and group of friends. Unfortunately, Mark lacks many of the things necessary to be successful both in life and in a career: maturity, responsibility, education, knowledge, life experience, prioritization, financial clout, etc.. Yet he trudges on, much like Ed Wood, apparently without any semblance of a clue. I guess we are supposed to feel encouraged by the spectacle of the \"never say die\" attitude of this noble individual, struggling against the odds. And man, what odds there are! Kiefer Sutherland, Colin Hanks, Tori Spelling and Angelina Jolie are all offspring of big-time film or TV people; no doubt, they will all want to direct some day, if they aren't already. How much room is there for an independent like Mark? It's like watching a guy hit himself in the head with a board, over and over again. Come to think of it, that is pretty close to what happens to one of Mark's actors, with the kitchen cabinet door, in one of the funniest scenes I have ever seen in any movie.Despite these misgivings and seeming criticisms, I truly enjoyed this movie, and would heartily recommend it to anyone. Uncle Bill is amazing. I have a friend who met both Mike and Mark and he told me that, in real life, these guys are just exactly the way they appeared in the movie.","This movie is a work of art. At first I thought it was like a spinal tap look at a hopeless film maker and that Mark was the butt of his own joke but then the other layers of this film came through. Mark's admirable drive to make something of himself, regardless of his talent, at least he tried with all he was capable of. And he's not without skill and knowledge, be it half known knowledge at times. It was inspiring to see him clawing his way to the finish line using everything he could to achieve his goal, getting his mum, friends, his girlfriend and his kids to be the camera operator, sound, actors etc. The stuff with his uncle Bill were complex too. Firstly it seemed he was just trying to milk his aging uncle for cash for his project but then there was a real affection and caring, and wanting to include him, draw him out of his trailer. And that's one of the things that inspires most about Mark. He is a catalyst a hapless doer that motivates his dead end world to something more. On one level you can laugh at this guy and his friends, but there's so much more in this story than incompetent nobodies. This is an uplifting film about struggle. I love it and am moved by it.","This is a film which people seem to either love or hate, the same as it's subject wannabe-film-maker Mark Borchardt. The film follows Mark as he attempts to make his first feature film (called \"Northwestern\") and complete a short horror film called \"Coven\". He makes films with his friends and family using any equipment and money that he managed to get his hands on, in particular from his elderly Uncle Bill.The thing about Mark is that he is certain that he is one of the great film-makers of our time. He is also certain that he will be successful. However, the chances are that he won't be. This is what makes the film moving. The thing is that, judging by the clips from \"Coven\", the man is not without talent. He certainly has a good eye, and could probably make a career in film-making, if he gets the chance. He certainly appears genuine in his desire for success.there are some hilarious scenes though, for example, where they are trying to get an actor's head to come through a cupboard door. Also Mark's friend, Mike Schank, is hilarious.","When we are young, we all pick out an ideal occupation for ourselves: artist, actor, writer, rocket scientist, etc..  While most of us grow out of our pipe dreams, the main character of American Movie, Mark, has yet to let go of his(and at a thirty-something age too): to become a wealthy acclaimed director.  Despite the fact that Murphy's Law won't leave Mark alone and something always seems to go wrong, Mark is able to persevere during each deterring incident with an even greater drive to reach his goals.  His desire to be a director so controls his character that he sees any person or thing in his life as something to exploit to reach the goal.  While I noticed other IMDB commenters are lambasting Mark's selfishness, I think it's an almost justified sort-of selfishness because for Mark, not becoming a famous director is equivalent to death.  He talks incessantly about leaving some kind of mark on the world, and he sees filmmaking as a way to do this.Unfortunately any viewer of this movie picks up early on the fact that Mark has a near-zero chance of ever achieving his dream.  Is he aware of this? No, not in the slightest, and none of his family or friends want to let him in on the secret(in fact even some of them believe in him).  Strangely enough though, the disappointing future the viewer feels is sure to occur for Mark doesn't impede the ability to find humor in the film.  This is a very very funny documentary.  Most of the laughs come from when Mark is filming scenes for \"Coven\". There's a scene where an actor has to have his head break a cupboard, and it's just not working.  Another scene has Mark's very old uncle Bill saying a few lines to the camera; needless to say, after 20 takes of a lot of headscratching and line-stumbling Bill finally decides he's had enough.  A lot of humor sadly comes from Mark himself.  His screenwriting, which he seems to think is worthy of a Pulitzer, is laughingly bad: \"It's alright, it's ok, there is something to live for; Jesus told me so.\"\"American Movie\" is, contrary to what people might think, a documentary that anyone can enjoy(even though my sister, who watched some scenes, seemed to think it was downright bizarre).  The fact that Chris Smith can successfully bring to the screen a film that inspires both sadness from Mark's depressing lifestyle to hilarity with scenes with Bill(who unfortunately passed away before the film was released) says quite a lot about him.  I wonder how the dreamer Mark regards this documentary.  Does he realize that it casts him in a bad light?  Or that it sets up to show him as a fool in many scenes of the film?  Or does he see it as something that will be shown prior to his own A&E Biography segment?  It's an intriguing subject of wonder, and I hope the latter comes true for him some day.I highly recommend this movie: 9/10.","\"American Movie\" blew me away on first viewing! This movie works on so many levels. It's funny, sure, but also sad, frustrating, depressing AND uplifting. The term 'feel-good movie' usually makes me run away screaming, but this movie DOES make you feel good, and not in your simplistic tree-hugging Oprah/Highway To Heaven way either. I believe in Mark Borchardt. I believe he's got the raw talent to do something worthwhile. He's certainly got the drive and motivation! I wish him luck in the future, and I hope he succeeds. \"American Movie\" also makes a star out of Mike Schank. His sheer good humour in the face of hard times is a wonderful thing to behold. Mike is also responsible for the unique acoustic guitar soundtrack of Bach, Metallica, and Mr. Bojangles which complements this movie perfectly.One of my favourite movies of the decade.","After watching this documentary I felt like a new person. I always wanted to be a film maker. This documentary pushed me to the next level. I have been making short films with a friend of mine since I bought my first camera. It was a Tyco kids cam which only shoots black and white video with sound. Watching this documentary gives you the charge you need to do anything. It's pure inspiration. I highly recommend it to all.","I deeply enjoyed the first 45-minutes-or-so, because I'm an aspiring filmmaker and it's both amusing and insightful to behold the mishaps that go on when making a low, low-budget film.  But past that point, the movie drifts off, fixating on Mark Borchardt's family life, which isn't very interesting.  Hell, neither is my family life, but you don't see me releasing my home videos for the whole viewing public to see.  Borchardt's rantings are often funny (sometimes you're laughing with him, other times at him), but sometimes they get annoying.  I would compare Mark to Ed Wood in his perseverance, but other than that (and the fact that both their films are beyond terrible) they're quite different.  Mark is very paranoid, and if he doesn't get the shot the way he likes it, he throws a fit.  Ed was very confident and if the first take would turn out halfway decent, he'd yell \"Cut and print!\"  I mean, if you're gonna be a bad filmmaker, act like a bad filmmaker.  Don't pretend like you're Stanley Kubrick.  But those are my criticisms about Mark, and not the movie.  The movie isn't bad, but the first 45 minutes are the best and the rest is pretty much downhill.  I don't care about Mark passing out on the couch watching the Oscars or watching the Green Bay Packers play on television while he sips beer like no tomorrow.  In a way, documentaries are good, because they hold a mirror up to reality, and we don't see enough reality in mainstream film.  But reality isn't always interesting.  If you want to see a consistently interesting documentary, watch \"Roger and Me,\" which contains a wide variety of characters who are each quirky and amusing in their own ways.  All I really cared about was Mark's pursuit in making the great American movie, no matter how far from great it really is.  So if the movie concentrated on that, and the running time was trimmed, I would've found it much more fascinating.  My score:  6 (out of 10)","No Hollywood hasn't got this lazy yet that they just tell you what it is and where it was made, American Movie is a documentary about a man with perhaps the greatest divide between ambition and ability currently working in film, and his efforts to make his debut film.As a digression though I have found altogether too many films that just say \"whack American in front of something and there's your title!\", maybe it's familiarity, maybe misplaced nationalism, but these films always seem to make a few bucks, leading to more and more.So we have \"American Pie / Gangster / Psycho / Beauty / History X / Splendor / Dreamz All in the last decade off the top of my head, with dozens more out there.Back to Mark Borchardt the subject of this American Movie. Mark is a movie devotee who clearly has at least put in the time watching and studying film. He has grand plans to become an established filmmaker in his own right, he just needs to make his debut short film to drum up some money so that he can make his name with a full length feature.The film will be called NorthWestern, and while early goings of this documentary introduce us to many people already associated and indoctrinated into the process it is clear early that this won't be a tale of cinematic triumph against the odds.Even Mark's most ardent supporters admit that years have passed with little or no progress. Mark is idealistic, ambitious, passionate and sincere. But he is also delusional at times, ill equipped and has a chasm between his ideas and capabilities.Low budget is low budget, and it worked for Sam Raimi and Bruce Campbell, but Mark is an ideas man without a clue. In any case the intrigue isn't what the film will be like or even if it will be finished, it is the people dragged into Mark's life because or at times despite the film.Mark's Mum is his biggest supporter, his Dad seems to be hopeful but doubting, and resentful of Mark's open animosity and hatred of a 9 – 5 existence, seeing as that is what his Dad himself did. Mark has kids, exes, a girlfriend, cast and crew to deal with day by day. But it seems only one true friend in Mike Shenk (who deserves his own movie – I'll get to him) and dear old Uncle Bill.Bill is an elderly man who Mark nags incessantly for money *ahem* film financing capital, with tales of future Scorcese style glory and Snyder sized box office returns until poor old Uncle Bill gets exhausted and relents again fully expecting never to see a penny for his outlay.It seems Mark's unerring sense of self belief and endless optimism convinces others to get involved without the slightest assurance or inkling that anything will ever eventuate.But even Mark has doubt at times, it is obvious to all that when he drinks his resentment of authority and a more hardworking existence rise quickly to the surface, and he lacks the ability to say \"no\" to alcohol, allowing it to set himself further and further behind, both financially and cinematically.But enough with the serious stuff. American Movie is a well made doco about a man trying to make his own personal Citizen Cain with a Troll 2 budget and skillset. Mark is enigmatic and at times compelling but it is Mike Shenk who provides the reason to watch American Movie.Mike is a self confessed unemployed former habitual drug user. He never seems \"there\" even though he is right there. His dazed expression and half breathed high pitched voice continually suggest a room with the \"Vacant\" signs up, and his bizarre stories to nowhere only provide further assurance.In limited screen time Mike steals the film with his rambling stories, acoustic guitar noodlings and tales of personal punishment suffered through his previous drug abuse, all laced with a familiar blank smile and a shrill girlish laugh.When Mike steps to the mic (Beastie Boys style) late in the film and lets loose with the most blood-curdling scream I can recall on film for audio looping it is simultaneously incredible, bewildering and hilarious that this deathwail can come from such an unassuming stoner.Final Rating – 6 / 10. Mark Borchardt is a walking, drinking, profane, bespectacled dichotomy, and evidence that film smarts don't necessarily mean smart films. On this occasion it does make for compelling viewing – albeit perhaps more about a man triumphing over his limited abilities.","'American Movie' is a documentary about Mark Borchardt and his attempt to make a movie about growing up in Milwaukee ('Northwestern'). Filming isn't going so well, and he's strapped for cash, so he returns to his old horror movie project, called \"Coven\". His plan is to hit the independent horror market, sell a bunch of videotapes and then sink the money into finishing 'Northwestern'.The director, Chris Smith, could have just played the movie for laughs. And there are moments when the movie is laugh out-loud funny. Borchardt isn't the brightest guy in the world, and it's quickly obvious he's not much of a filmmaker. Borchardt's got the Milwaukee drawl they play off in 'Fargo', and he refuses to accept that \"Coven\" isn't pronounced \"Cove-Ann\". His best friend Mike is a more friendly version of Beavis complete with \"huh, huh, huh\" laugh. It's hilarious when Borchardt tries to ram his lead actor's - Tom's - head through a cupboard door. It takes a lot of attempts to get this money shot for 'Coven', while Tom's head steadily gets softer on top.Yet that cupboard scene moment is actually a good indication of why 'American Movie' is a real good 'un. Tom takes the repeated bashes on his head with good humour. There's a real sense in the movie that people are pulling together to try to make a film. Borchardt is a bit of a jerk when he's drunk, but he's got a dream and he's going for it.But the star of the movie is Uncle Bill, a curmudgeonly 83 year old who fronts the money for 'Coven' and occasionally busts into a song about his life: \"Goodbye dear, hope you're in heaven where you belong / I was wondering if they had cigarettes in heaven, I don't think so / I still love you, I'll visit your grave every day / Not every day, but I'll visit it sometimes if I ever find it\".And... you know what... Borchardt tries to look after Bill too. He cooks Thanksgiving dinner for Bill and washes his clothes, and behind all that bravura he seems like a nice guy. And, maybe off the back of that deep-seated charm, 'American Movie' is a great, fascinating documentary. Sadly, 'Coven' is terrible... but please don't let that put you off 'American Movie'.","Menomonee Falls, Wisconsin.  Mark Borchardt dreams about becoming a famous film maker.  He is trying to produce a low budget horror flic, using whatever he can at his disposal (friends, frustrated family members, etc..). Problem is Mark, has great ideas but can't seem to focus on one thing as his mind races at 500 miles an hour.  Enlisting his zombie druggie friend he tries to produce 'Coven' (which Mark continualy pronounces KO-VEN instead of CU-VEN), in order to make his dream.This documentary is BIZARRE!  Mark's ambition is totaly blind to the fact that he is totaly in debt, has 3 kids to support, trying to make a film to get him on the road to the 'American dream'.  His family and his zombie friend in particular, produce a lot of laughs, but the film is also sharp in showing the problems Mark faces.  The camera is there when he's fighting with his ex-girlfriend, when he's trying to borrow money (again) from his uncle, and so on.A lot of reviews have called this a riot of a film, but even though it has some very funny moments, most of the film is bleak.  It's funny seeing Mark taking one of his actors and slamming his head through a cupboard door, over and OVER again, then realising he's actualy broken his moms kitchen and has to repair it, yet, I kept feeling really bad for Mark and at times became very depressed watching his failures.  But the movie is full of hope, as he is DETERMINED to get this film done so he can get make something better of his life.  But that's what the chase for the American dream is all about. As a documentary its pretty slow paced compared to others I have seen, but it is OK.Funny Note:  Mark's zombie friend, plays guitar, and a lot of times the film has his music playing in the documentary.  The key one that keeps playing over and over is his rendition of Metalica's 'Fight fire with fire' acousticaly.  That was a riot.Rating 6 out of 10.","Compelling documentary by Chris Smith and Sarah Price of a man whose reach may have exceeded his grasp. Set in the confines of Wisconsin, Mark Borchardt sets out to capture the American Dream, by filming his movie \"Northwestern.\" But sidetracked instead to film a short subject named \"Coven\", pronounced long o, not like oven, this is an important distinction. Aided by the love of his family, he secures financing from his Uncle Bill Borchardt, who becomes Executive Producer. Over a 3 year period , Mark Borchardt overcomes tremendous obstacles, technical problems, casting logistics, weather changes, personal finances,private battles with his ex-significant other, child custody arrangements, script changes, and growing pains. Chris Smith wonderfully blends the turmoil of Mark's triumphs and pitfalls, with sentimental touches and engaging realism, which provoke the viewer to question the direction of their own reality. Ken Keen gets honorable mention for his relentless work ethics and optimism. Mike Schank, a talented musician, and Friend to Mark, gives unwavering support and comic relief to the ensuing chaos and turbulence, Mark must endure to realize his dream. Ultimately, the triumph of the would-be Director, comes in the form of lessons learned and achievements earned. The crowning moment of the film is the premiere of \"Coven\" at the local theater, where Uncle Bill and Mark share a moment of truth.What could be better when an exhausted Mark , helps his Uncle to the movie theater , surrounded by admirers , and see the culmination of his and his families efforts. Very inspiring !!!The underlying foundation of the movie is the love and support of the Borchardt family and friends, in spite of some dysfunction, they conquer the elements,and provide true inspiration for anyone who has aspirations...Get the DVD of \"American Movie\", which has \"Coven\" on it.The name \"Coven\", gives the film the Directors signature ! of ownership. A great winter movie, for viewing on cold nights, where your soul is exposed , to a warm fire , it will fill your heart..... \"American Movie\" gets an 8, for everyone who has a dream.....","Some other reviewers have slighted Mark Borchardt's vision in their reviews. There is no doubt there is humour in American Movie but there is also great passion shown by Mark B. Do those who scoff at his efforts really think Coven or his other films are so far away from the initial efforts of John Waters or other cult film makers?I'd like to see the next 10 films he would make as he learns the process. Too many films are made by people who have no passion but some (learned) ability.Rock on Mark...you are an inspiration to people in any walk of life...all the best!"],"review-user":["RCamp48845","Dubs","Jared X","TiffanyBartok","Lechuguilla","cortell","josephpace","tnrcooper","rooneyterence","shark-43","myrrth_sicopath","caspian1978","Shabadoo-2","givnaw","Rob-O-Cop","RobertF87","DarkCity","Infofreak","MrNefarious","mattymatt4ever","oneguyrambling","MurderSlimPress","smakawhat","cshep","Stoned_circle"],"review-date":["29 April 2004","16 November 1999","17 November 1999","23 August 2003","24 December 2006","13 October 2003","9 January 2002","22 March 2011","17 April 2006","6 August 2003","28 October 2003","12 December 2003","21 May 2004","7 October 2002","29 March 2010","23 May 2005","6 January 2001","27 June 2001","26 February 2003","21 January 2003","28 December 2011","27 August 2010","18 November 2000","3 March 2005","25 March 2001"],"review-rating":["9","10","10","9","8","8","8","8","9","6","9","10","6","7","6","8"],"review-title":[" Just watched it again.\n"," American tale\n"," A great film\n"," This is the best documentary ever made.\n"," Don't Let This Happen To You\n"," So sad, it's good\n"," My all-time favourite film.\n"," Fascinating, hilarious, sad, inspiring documentary about the American dream\n"," Life, but not as we know it...\n"," Well Made Documentary; Heartbreaking\n"," The Untold Story, Here For The Telling!\n"," Mark Borchardt: Independent Wanna Be\n"," A Brilliant Movie\n"," Painful Realities\n"," Multilayed, complex and simple.\n"," Sad, but Frequently Funny\n"," The Intriguing Story of Someone Who Refuses to Let Go of a Pipe Dream\n"," Inspired and inspiring!\n"," Inspiration in it's purest form.\n"," Could've been more fascinating\n"," Hilarious proof Michael Bay might not be the dumbest guy working in film.\n"," Strangely heartwarming documentary\n"," More depressing and long, than funny and enjoyable\n"," Wonderful and Loving Look to Achieve the American Dream !!!\n"," Great Film about Making Film!\n"]}