{"review-url":["http://www.imdb.com/title/tt0109576/reviews"],"review-text":["This is a decent effort for a B-Movie Martial Arts actioner. Ian Jacklin, a former North American cruiser weight Kickboxing champion, is the lead and acquits himself well in the action scenes. The muscular Matthias Hues gets a chance to add more to his Martial Arts bad guy persona in this film than in all of his many others and if you are a fan of The Teutonic Titan, rent this movie now!Renee Griffin is also noteworthy as the romantic interest in this film. She starts off with attitude but soon warms up to the hero and they make \"The beast with two backs\" in a very stylish fashion.The fight scenes are good in the American tradition (NO Hong Kong acrobatics here!) with added realism from having Benny \"The Jet\" Urquidez playing himself as John Larson's (Jacklin) trainer.All in all this film seems to have more sub plots than most in its genre so you get MORE of a story.","Don't get me wrong. I really love the \"arena-martial arts genre\", and I get more and more surprised over how many films like this there are out there. This one is one of those, and it's not even close to be one of the best. With Mathias Hues in it, I thought it would be good. He can't save this movie though, and to be honest, he wasn't very good either. Just don't pay attention to what other people say; The fighting scenes in this movie are NOT good at all. I really know what I'm talking about, since I have seen so many movies like this. There are also a bunch of scenes that have absolutely nothing to do with the plot whatsoever. I guess they added these only to make the movie last a little bit longer, in addition to manifest the bad guy as,uuuuuuh.......bad (like we didn't know that already).","For our 400th review celebration, we thought we'd invite a few friends over - namely, Matthias Hues, Richard Lynch, Jorge Rivero, Ian Jacklin, Renee Ammann, Martin Kove, Benny The Jet, Eric Lee and the rest of the large cast of Death Match. A special effort seems to have been made to get as many of the DTV actors of the time as possible in this production. Casting-wise, it truly was The Expendables (2010) of its day, and, inevitably it means that some cast members can only receive small roles. Due to time restrictions of course. Unless you think Death Match should be a four-hour-plus epic.John Larson (Jacklin) and Nick Wallace (Hill) are just two blue-collar dock workers trying to make their living the old-fashioned way - by working hard. Their longshoreman jobs take them all around the country, and they end up in L.A. where Nick tries to make some extra bucks fighting in...wait for it...illegal, underground punch/kickfighting cage matches to the death! Did you think it would be some sort of computer game contest? Anyway, Nick starts fighting for the evil, unscrupulous fight promoter/gangster/gunrunner/lover of geodes and Twizzlers Paul Landis (Kove) and his associate/main fighter Mark Vanik (Hues). Unbeknownst to Nick, these guys are, well, evil and unscrupulous, and they expect the winners of their fights to kill, and the losers of their fights to die. Seeing as Nick is a nice guy and doesn't have that killer instinct, he refuses to kill his opponent in the ring. So naturally, after a brutal punch to the face by Vanik, they imprison him on their personal boat.Seeing as how Larson and Wallace are best friends to the end, when Larson gets word that his buddy hooked up with Landis' organization and is now missing, he goes on the hunt for him. Of course this means that he has to join Landis' group and fight in order to get closer to the truth. Luckily, he was a former kickboxing champion that gave it up years ago. With help from reporter/love interest/eye candy Danielle Richardson (Ammann), scrappy street kid Tommy (Michele Krasnoo), and of course his Cosmo Kramer-like manager Lionel P. Bigman AKA \"Big Man\" (Bob Wyatt), will Larson find and rescue his friend? Death Match is one of the better punchfighters out there, and has a little more substance than most. Thanks to the sprawling cast - there are even more B-movie names we didn't mention - Lisa London, John Sjogren, Brick Bronsky, Marcus Aurelius, Sheila Redgate and more - as well as the fast pace of the film, things never get boring. Also in the good news department, this is by far Ian Jacklin's best role we've seen. He actually does a good job carrying the movie, and as the lead role must have the usual barfights and torture scenes, and you care about him and his friend. Despite all we've seen before, we really liked Jacklin here.But the real \"Big Man\" in this production isn't Lionel, it's the great Matthias Hues. He turns on his typical charm and wears a gigantic suit with a bolo tie. If he starts to take off his shirt/bolo tie - watch out. You are in trouble. Also, whatever you do, don't call him \"goldilocks\". Lynch steals the one scene he's in as the gangster Jimmy. Benny The Jet appears as himself, in one of his own gyms, as Larson's trainer. His advice comes in handy. Interestingly, in the female reporter wanting a story/hero teaming up with an L.A. street kid angle, Death Match resembles Streets of Rage (1994) of all things. Weird.We really can't go through all the many characters and their ups and downs due to space restrictions, and there are some of the prerequisite silly moments, such as the \"Chicanos with nunchuks\" scene, but honestly this is an action B-movie fan's dream come true - and one of the better killfighting movies we've seen to date.Note: Death Match is available in the U.K. on a two-for-one DVD with, strangely, The Robert Chapin classic Ring Of Steel (1994)! Go Figure.","I laughed so much when I saw this film I nearly soiled myself !. Awful acting, laughable effects (super imposed explosions), and dodgy slow motion fighting.One of the worst films I've ever seen !.","When his friend (Nick Hill) goes missing, former combat fighter John Larson (Ian Jacklin) heads into - get this - an underworld where promoter Landis (Martin Kove) and his top fighter Mark (Matthias Hues) hold \"to the death\" fights to amuse the bloodthirsty rich. This by-the- numbers martial arts flick came at the end of the \"underground death match\" cycle. The stale script should have \"Do not produce after 1990\" stamped on it and features some baffling choices (would a guy hosting death matches really do up contracts for them?). Jacklin, who looks like Craig Sheffer with more Cro-Magnon features, is a former professional kickboxer and supported Don \"The Dragon\" Wilson in several features (RING OF FIRE 1 & 2, BLACK BELT). He is actually decent in his first leading role and, naturally, his fights are well done. Female lead Renee Ammann is really lousy as the tough female reporter looking for her big break. The real surprises are Kove and Hues as the baddies, with Kove's character having an eccentric love of crystals. Richard Lynch and Jorge Rivero each have one scene as rival bosses who get killed. Lynch's bit - where he tells the story of his Italian mob grandfather \"Pretty Boy\" O'Brien - is actually really well done and could be in a Tarantino flick."],"review-user":["ali6969uk","sveknu","tarbosh22000","sean.connolly","udar55"],"review-date":["10 July 2002","27 November 2005","3 November 2010","7 March 2003","10 January 2010"],"review-rating":["8","4","6","1","6"],"review-title":[" Splendid B-Movie Kicker!\n"," Just another arena fighting movie\n"," What A Cast!\n"," Perms and kickboxing\n"," 80s movie produced in 1994\n"]}