{"review-url":["http://www.imdb.com/title/tt0106639/reviews"],"review-text":["In year 2074, a technological, deathly planet earth, in an urban, dirty post holocaust world, Cyborgs have replaced humans and the earth is caught in the grip of high powered corporate warfare . Kobayashi Electronics (Japan) and Pinwheel (USA) struggle to control the software programming and manufacture of Cyborgs . Cyborgs have substituted humans in every respect from the soldier in the field to the prostitute in the brothel . Billions of dollars are at stake and as usual the love of money proves to be the root of all evil . A mean enterprise (ruled by Allen Garfield) which makes Cyborgs orders to get rid of his competitors by means of murdering them . They plan introduce to Cyborg ¨Cash¨ (Angelina Jolie) , a liquid explosive, a McGuffin denominated ¨The glass shadow¨ that blow up . Technology specialist (Jack Palance) clues to Cash and she flees with the help of the human ¨Colt¨ and they have converted prey for a band of nasty bounty hunters (Billy Drago and Ric Young).It's an old fashioned B movie with lots of fights , stunts , struggles and chases among protagonists and their pursuers . The film has some visual sophistication along with a ridiculous plot and even a minor romantic subplot between machine-cyborg and man . Despite a few nice touches is average and this is strictly fodder . ¨Cyborg I¨ (Albert Pyun) was a poorly made action movie , it was only known by Jean Claude Van Damme acting , however ¨Cyborg II¨ has much better casting . It stars Angelina Jolie , she told The New York Times about this movie : \"After I saw it, I went home and got sick¨ . The motion picture was regularly directed by Michael Schroeder who at least tries some spectacular scenes . He also directed ¨CyborgIII¨ with Malcolm McDowell , Zach Calligan and Richard Lynch . Rating : Mediocre but entertaining .","Seems this movie had a very low budget hence the reason it looks like it was filmed in someones' garage. I loved the looks of the younger Angelina Jolie - I'd never have known if I hadn't seen this!!!!!!!!Michael Shroeder also included (about 5 seconds)footage of Van Damme and Dayle Haddon from the original 'Cyborg' which was a nice touch.  It's a bit of honesty on his part as well I think, because Shroeder is acknowledging the pre existing story line. Not that this matters at all.Jack Palance is the highlight though because of the way he says his lines - it is hilarious.  No one ever speaks that way, (even though he's not a human character) but it sounds so cool.  Even Angelina Jolie smiles at some of Palances' lines (Ie: The scene in the lab with the 'cyborg monkey'.)Good as a diversion - nothing more.  Thinking more about it, it's one of the few movies I've seen where the actors seemed to be having a fun time with the 'out there' script and plot.","There are 3 different kinds of B-movies.  Most of them are just bad. Horribly, painfully bad.  Some are just the right kind of bad to be fun to watch.  And a select few are surprisingly well done.Cyborg 2, like the original, falls into the third category.  Yes, it has uneven fight scenes and some terrible dialogue, but it also has involving moments.  You probably wouldn't want to pay a lot of money to see it, but it's good to watch on TV, especially late at night.And of course, it feature Angelina Jolie in her debut performance, not counting Looking to Get Out.  She does very well with the sometimes spare material, as does Elias Koteas.  Both of them always manage good performances with even the worst scripts, and this script is actually decent.Non B-movie fans should avoid this, but the rest, and I know you're out there, might actually like it.","I'd like to point out these excellent points in favor of this movie:#1 Angelina Jolie sex scene #2 Foley artist outdid themselves #3 plot was quite thick #4 DVD does includes trailers and chapter stops#5 no animals were harmed in the making of the movie #6 homages to blade runner through out the film #7 burning trash cans #8 funny guy with no legs #9 Voice overs by Jack Palance added a real dynamic element to the film. #10 Sage advise, for example \"When you dine with the devil bring a long spoon\". #11 Angelina Jolie was only 18! To sum it up: an evening of entertainment was provided.","I caught this movie late night on TV, and was expecting a low-budget campy \"masterpiece\", I was surprised with a pretty decent movie.  Angelina Jolie's unique acting capabilities (or should I say lack thereof?) make her perfect as an android, and the other actors, while terribly average, are at least not terrible.There is a plot; a fairly intricate plot at that, involving conspiracies and the lengths a couple (one human, one android) will go to pursue their illegal romance, with a \"big brother\"-type figure and android assassin thrown in the mix.  The production and sets, also, were much better than I expected.  I haven't seen the original Cyborg, so I can't really compare it to much else; granted this film is no Blade Runner, but as a late-night, futuristic guilty pleasure, its worth a watch.","I was just looking at the 100 bottom movies according to IMDb users seeing if there was anything to review that I haven't yet and I found this little screen gem. One of those occasions when you see a movie ranked as one of the worst and you just have to be one of the few that actually likes it. Darn, well I guess I will get ridiculed and spat upon here, but for me this was a pretty good flick when I saw it. It has been awhile however, I remember it used to come on HBO late at night and I watched it two or three times and I haven't seen it really since and I would love to watch it again now knowing Jolie was in it. The story follows a cyborg and a guy trying to escape the clutches of this corporation and some bounty hunters after them. I think that is basically all there is to it, throw in a few scenes with Jack Palance and we have our movie. Some good action here and there, and some blood and violence as well. There is also a love story at play as well as the female cyborg and the guy who trained her to fight kind of fall in love with each other. The dialog sometimes becomes rather bad at times and it is by far not a top notch film, but for a b-movie it is really good. I don't know if it was a theatrical release though because it does not seem high quality enough for that, but it does make for one of the better direct to videos if it was one of those.","How many sci-fi/action B-movies from the '90s featuring cyborgs do you know of that are actually any good? \"Cyborg 2\" is a shamefully underrated sequel to Albert Pyun's original from 1989 and it actually succeeds in surpassing its predecessor. The story has more heart & thought put into it (you get a little bit less action sequences because of this), the production values were decent and the special effects quite impressive for this type of production (especially the wide shots of a futuristic, post-apocalyptic city are well-crafted, echoing some of the visuals seen previously in Ridley Scott's \"Blade Runner\"). It wasn't until producers read the script of \"Glass Shadow\", they decided to turn it into a sequel to Pyun's film. But \"Cyborg 2\" is pretty much a standalone film, merely just referencing the first film by adding some footage of it. A female cyborg (Angelina Jolie) and her trainer (Elias Koteas) form a leading duo we actually care about, while they're on the run from the corporation that employed them. Being hunted down by a bounty hunter (Billy Drago) and another female cyborg assassin (Karen Sheperd), the mysterious entity Mercy (Jack Palance) guides them through the city. There are many far worse cyborg movies out there, which usually revolve around showcasing some martial arts & blowing things up. \"Cyborg 2\" has some of that too, but still manages to be a little different.","This was a pretty good movie that was overall done quite well. The idea about Mercy (won't spoil) was original also. I think Angelina did a good job as one of her first movies. The only things I frowned upon were some of the corny fight scenes (won't spoil either). I liked the first movie and I liked this one as well.  7/10","I read a bunch of the other reviews on this site for this film and at first I was a bit shocked that people liked this film better than the original \"Cyborg\".  But, the more I thought about I guess I might have to agree, the special effects are better, Angelina Jolie is in this one (need I say more?), the fights scenes are about the same, the acting is about the same and the story is equally bad.  So, I guess I'd agree that this film is a little better than the original, but they're both pretty bad movies.I think it's safe to say that Sci-Fi is my favorite genre and I think this movie was just awful.  It had some cool things here and there, but overall was not very good.  The only reason I can see to sit through this movie is to see the beautiful Angelina Jolie (she looks incredible in this film!)!!! The rest of the cast was ok, but definitely nothing special.  I did enjoy seeing Sven-Ole Thorsen  in the film though (from \"Gladiator\" and a good amount of Arnold Schwarzenegger films).Unless you're a die-hard sci-fi fan and/or an Angelina Jolie fan, I wouldn't recommend going out of your way to see this film.  But, if you do end up seeing this movie, I hope you enjoy it.  Thanks for reading,-Chris","When I heard about a sequel for Van Damme's absolute worst film \"Cyborg,\" I rolled my eyes and thought, \"Oh no....Why did they make this? To cash in on the success of a movie that WASN'T a success? There's no way this will be good....\"Well....I was eating my words about fifteen minutes into it.\"Cyborg 2: Glass Shadow\" is by no means a masterpiece, nor is it an especially inspiring thriller, but I was surprised how entertaining it was. This might be due to the fact that it completely abandoned the plot of the first film and started from scratch, thus it can be viewed as a completely original motion picture. The plot is pretty standard: late into the 21st century, a company calls PINWHEEL have developed cyborgs that look and act just like real humans, even down to emotions. \"If God didn't make you, we did,\" one of the big business men quotes.But what if one of the cyborgs begins to recognize independence, as Cash (a beautiful Angelina Jolie) does? That's when Mercy comes in. Mercy is a freelance cyborg who, after the death of his wife, has dedicated his life to helping renegade cyborgs beat the system and flee to another country. The part is played by Jack Palance, who actually does a good job, though he spends most of the time on a computer screen with closeups of his mouth.At any rate, Cash decides to flee, and she takes along a human to guide her (and he also happens to be in love with her...). His name is Colt, a skilled warrior (Elias Corteas, who bears a close resemblance to Robert DeNiro). Pinwheel sends two people to track them, Danny (a chilling Billy Drago) and Chan (the standard oriental-warrior-cyborg chick). So it's a desparate race for the two to survive in an odd, futuristic city.It's pretty much a standard plot from there, which is predictable and easy to figure out. But at least it HAS a plot, something the first film can't claim. And this film has good qualities in other areas. The special effects are above average, including the awesome shots of a battery-charged city of 2170! The characters are also well drawn out and defined, with nice chemistry between the two leads and a chilling performance by Drago....That man is evil incarnate. Good score, too.... Does anyone know if the soundtrack is available? Lastly, the action is well-choreographed with some nice settings.Summing it up, the director knows what he's doing, and he managed to make a so-so plot get lifted by an excellent cast, great, memorable characters, top-of-the-drawer dialogue, okay special effects, and good stunts. Recommended if you're like me: I hated the first film. It's worth taping if it ever comes on TV again...I know I will....**1/2 out of ****","It's a kinder, gentler Cyborg movie with a love story. Awww. It's not as bad as it sounds. The action, when it is there, is decent and Jack Palance, Elias Koteas, and Angelina Jolie are always dependable. It's the fact that this is a sequel to the terrible Jean Claude Van Damme film, or is that the capper to the Masters of the Universe trilogy? I'm still confused about that. Either way, there was really no need for this movie. What was there a need for? Angelina Jolie. She may play an assassin robot that can explodes mid-coitus, but, what a way to go and even though this is her first movie, she still has the presence that made her an award winner.","Earth, 2074. The field of cybernetics is dominated by two corporations – Kobayashi Electronics & Pinwheel Robotics. The execs over at Pinwheel plan to destroy Kobayashi by sending in Casella 'Cash' Reese, a female cyborg containing 'Glass Shadow' (a powerful plastic explosive), to a conference & detonating her. With the help of Mercy, a mysterious cyborg who projects himself onto TV screens, Cash & her human combat trainer Colton Ricks escape the compound & flee across the city. With Pinwheel troopers & a psychotic bounty hunter after them, they attempt to make it to freedom.CYBORG was a low-budget, mindless post-apocalyptic martial-arts flick that featured Jean-Claude Van Damme taking on numerous thugs & trying to rescue a female cyborg. It became a cult film & inspired two sequels.While the first film was nothing more than a series of watered-down heroics that had almost no plot, \"Cyborg 2: Glass Shadow\" is the complete opposite, a futuristic sci-fi film with an intelligent storyline & a Cyberpunk atmosphere. It is also the rare occasion where a sequel proves to be better than the original.\"Glass Shadow\" is set sometime after the events of the first film, although the continuity is somewhat screwed up (society had collapsed in the original & a nasty plague had swept through the world). The society here is akin to a corporate-run city, nothing like the original (there are a few clips taken from the original shown on TV screens). The storyline is quite simple – female cyborg is created as a walking bomb, said cyborg tries to flee her fate, her creators send in bounty hunters to catch her – but done in an intelligent manner.The acting is superb, with due credit given to Jack Palance, who gives one of his best performances, as the cyborg warrior / poet who appears on TV screens like a ghost; Elias Koteas, who plays his role in deadpan fashion & Tracy Walter shines in a cameo as a doctor. Angelina Jolie, in the days before she became a superstar, gives a robotic performance as the cyborg Cash, although this fits in with the rest of the film. The visual effects in this film are excellent, most notably the opening scene with a cyborg being built, some prosthetics work & an exquisite model city.","This sci-fi great fortunately has little to do with the  first one. Elias Koteas,Jack Palance play good roles Angelina is hot and gets naked.Billy Drago appears in this and is cool as usual + a cameo by Sven ole Thorsen helps make this a very enjoyable movie with good acting and a decent budget.","Is this a good movie? No, certainly not. But for Jolie lovers it's must-have. Her non-polished acting and semi-nudity scene will please her fans for ages to come. The current rating however (3.2) is too low. The movie might lack a good storyline, and isn't a great sf-movie altogether but the acting is good enough (and like mentioned before, Jolie's acting is nice and raw), the movie is shot very direct, with a lot of close-ups. The scenery is bizarre. And last but not least, leaving van Damme out was a very good choice. Presumably, non of the Jolie lovers would like to see her having sex with him. This movie has all the potential of becoming a cult movie.","Cyborg II, sounds like some 2nd-rate movie. Is not. Not at all! I was surprised the very, very nice 'ambiance' this movie has. Good looking, convincing effects and surroundings, very good sound. It has even a nice (though somewhat unsurprising) story with nice characters. For me, 'Blade Runner' sets the standard for this kind of movies. But in some aspects, most notably the overall ambiance and 'sadness' this movie comes close. Let's call this movie very, very acceptable...","Cyborg 2:Glass Shadow**1/2[2 1/2 Stars]-This movie turns out to be a good action movie. It has some pretty cool action but a bit of an annoying plot. This movie cannot decide whether its an action movie or a romance story. Personally I thought the whole cyborg romance story was a bit ridiculous. Another thing is that this movie is missing Van Damme. I'm sorry but I felt that a sequel to CYBORG***[3 Stars] should have him in it. This movie just doesn't work well enough without him. If your just looking for some action and don't really care about anything else than this movie is for you.","As a sci-fi and casual Angelina Jolie fan, I thought this obviously low-budget movie might be worth a look... maybe it had a few scenes or a storyline that would make up for all its other faults. Plus, it might be interesting to watch Angelina as she was embarking on her star-bound career.Oh how wrong I was. One thing I learned -- at 18, Angelina Jolie couldn't act. So, to make her comfortable, the producers cast this entire movie with people who couldn't act. Seeing this, Jack Palance (who can actually act) decided to overact. Watching 10 minutes of this happen is enough to burn your eyes out.To the horrible acting and overacting add a nonsensical script, insipid dialog, bottom-of-the-barrel cinematography... in fact add bottom-of-the-barrel everything.The story features Angelina as a cyborg programmed by her corporate overlords as an assassin. She escapes the corporate HQ with the help of her combat instructor. The corporation sends bounty hunters after them. Stupid stuff happens. The end. I would tell you more but I didn't want to waste my life watching this dreck.I implore you -- this is not worth watching. Its not even worth thinking about watching. Save yourself the pain and move on.","Jack Palance has absolutely the best lines in any movie, and this is one of them... He's like City Slicker's Curly, only in Cyborg2 he's Curly the Cyber Cowboy. Plus a chance to see svelte Angelina Jolie -15 pounds B.O. (Before Oscar).Previous review is on target.","The VERY beautiful Angelina Jolie stars as an android named \"Cash\" in this exciting, futuristic and fast moving movie. Her \"makers\" or \"god\", of course is the famous Pinwheel Corporation; one of the largest android making concerns in the world. Things are very competitive in the future; especially in the artificial human business. Everything seems to be fine until one of Cash's female android friends reveals a  sinister plan to eliminate rival corporate leadership; the plan involves injecting an undetectable explosive in her and then detonating it at the appropriate time. Terrified by this knowledge , she enlists the aid of her human martial arts trainer named \"Colt\". With his help, she battles past armed guards and escapes to the outside world. Jack Palance stars as \"Mercy\", a renegade android who assists other androids seeking freedom and appears mostly as a mouth on a television screen throughout most of the movie. Billy Drago gives his typically good performance as the tough, greedy and antagonistic bounty hunter sent after Cash and Colt. This movie, while limited in budget, has nevertheless earned a respectable place on my shelf along with the other great \"B\" movies. Add this one to your collection of fine science fiction films! Two thumbs up!","This movie is a cyborg in and of itself: half nonsense/half Lifetime Original Movie.As a cyborg, this movie has but one objective: to make you wish that you had spent the duration of the film in a dark room punching yourself in the testicles.Unlike many people, I did not rent this movie because of Angelina Jolie(I'll explain why I rented it shortly). I am not a big fan of Ms. Jolie's, though I will say that her performance was stellar! Her blank stare and robotic acting really did have me believing that she was an android hooker. If anyone has a clip of her on 'Inside the Actor's Studio' explaining how she prepared for this role, please send it my way. I'll make sure to use it when I try James Lipton for Crimes against Integrity.So what drove me to rent this movie? One would think that it was the hope of seeing Angelina Jolie's nipples, but it wasn't. No, the reason behind this rental rested solely on one of the images on the cover of the DVD; that of Jack Palance's face! HALF OF HIS FACE WAS ROBOTIC! When I saw that, I imagined legions of \"Palances\" slowly marching through a fiery wasteland, laying waste to any humans that were foolish enough to resist. In my mind's eye, every member of this Unholy Army of Palances had a red, glowing eye; a red, glowing eye that looked at humans and saw only \"meat\". They were to be the Architects of Oblivion...a cold, steely Apocalypse...a Nightmare from which Humanity would never awaken. It's a beautiful image that I will cherish till the end of my years.Like most things in my life, the actual movie did not live up to my expectations. No, there was only 'one' Jack Palance, and the only visible cybernetic enhancements that he had were located on his legs. Sadly, those enhancements didn't really \"enhance\" anything. That is unless, you count WALKING LIKE A POLIO VICTIM as a super power. At least their was a scene where Jack--grinning like a trigger-happy Alzheimer's patient--got to shoot the hell out of some people. I was waiting for him to yell, \"I'm damn tired of paying too much for prescription medication!\" Unfortunately, any outbursts of geriatric rage were few and far between.What the movie did have an abundance of was a poorly developed love story about a man(Elias Koteas, a.k.a. poor man's De Niro) and a cyborg(Angelina Jolie, a.k.a. Demon Spawn of John Voigt). Oh man, can the love between a Romeo of Flesh and a Juliet of Silicon ever be able to last?!?!?! It can if you follow Jack Palance's simple advice: \"You have to TASTE each other's TIME\".Yeah, I'm not sure what that means. However, I am sure that I do not want Jack Palance to be the one to explain it to me. I sure as heck don't want him to show me! As an experiment, I suggest that you ask your significant other if he/she \"thinks that we have reached a level in our relationship where we can begin to TASTE each other's TIME?\"","Not too bad of a film, though not as stylish, edgy or fresh as Bladerunner was in its time. Jolie does a good job, especially for a kid! More could have been done with her character's development, since these cyborgs supposedly have the full range of human emotion to draw upon. But with a complicated plot, I guess something had to be sacrificed. It's easy to forget how young Jolie was when she made this movie. I personally think the woman has talent and intelligence, not just looks and name recognition, but I know many disagree... She just needs some help selecting scripts. I liked the plot intricacy and the editing, as well as the Max Headroom-like character. There were definitely a few nice twists and turns in the storyline, though overall it was predictable. Worth renting if you're a sci-fi fan.","Not seen the first one and as this is a standalone movie set decades later I didn't feel I needed to either.The only reason I watched it really is because Angelina Jolie was in it, who is one of my very favorite actresses.She doesn't show much acting-talent in this though I have to admit, but she was 17 when she did it with extremely little acting experience previously so she's forgiven.There have been a lot of talk about her love scene in it but frankly by today's (and Angelina Jolie's later movies) standards it's a pretty mild one, that's also frequently interrupted by a old man crying over his dead daughter (which takes away any sexiness that scene could have had otherwise).Anywayssss... The movie boasts of awful dialogue throughout, with some exceptions \"If you want to dine with the devil, you need a looong spoon\" made me laugh so there was always that.Storywise meh, acting wise oh lord no. So yeah overall give this a big pass, unless you really enjoy poorly written lowbudget sci fi flicks from the 90's with bad acting etc.","i love sci-fi but this is totally ridiculous! the movie was predictable and bo-ring to the max!  if it wasn't for Angelina Jolie and her martial-arts-superb-action sequences, i would have slept throughout the movie. if you just want to see a young Angelina, this is it. forget about the story line. two thumbs down! =o(","STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsNow that Angelina Jolie's such a mega-star,I wonder if this sequel to the 1989 Jean Claude Van Damme original (which this features some borrowed footage from),would be something she'd be proud to boast on her CV.As it is,it's kind of a more involving experience than the original,with,er,better dialogue and much more character depth (maybe all this is because it wasn't directed by Albert Pyun!!!).It wouldn't be fair not to mention,however,some shoddy,cheap production values and a rather too complicated plot.**","The fact that Cyborg 2: Glass Shadow has almost nothing to do with the first Cyborg is probably a good thing. I've seen both, and the first one is an ugly, grimy early starring vehicle for Jean Claude Van Damme that plays like an episode of American Gladiators on PCP. This sequel, however, is a scrappy little sci fi delight. It takes plays in a futuristic B- Movie realm where maniacal corporations wage war on each other for the control of lucrative artificial intelligence, cyborgs who can be programmed to be slaves, soldiers or whatever you want. Angelina Jolie is Casella 'Cash' Reese, a gorgeous warrior Cyborg held under the watchful eye of the Pinwheel corporation, ruled by a hammy Allen Garfield. Her trainer, a mercenary named Colton Hicks (Elias Koteas) starts to fall in love with her. In this particular B movie universe, it's implied that there are fragments of what may resemble a soul that begin to grow inside the cyborgs, and gradually Cash falls for him as well. They plan their escape, and embark into a delightfully cheap looking metropolis of the future, seeking an oasis far away that's basically a non extradition zone for robots. Pinwheel sends some dangerous bounty hunters after them. There's fighting. And running. And shooting. And Cyborg sex including a 17 year old Angelina going fully topless, which makes me wonder how the filmmakers ducked the authorities on that one. Not that I'm complaining. Aside from baring her chesticles, she makes a pretty solid action heroine at that age, and even before making a name for herself she carries the film pretty well. Koteas is pretty much capable of anything as far as acting goes, breezing through this one in his sleep whilst still keeping one eye open to give Hicks a vulnerability and desperation that the film hardly deserves. Character actor Billy Drago gives a scene stealing performance of sheer unbridled lunacy as Danny Bench, a terrifyingly unhinged contract killer who pursues the pair and has an absolute smackdown of a fight sequence with Koteas. That old salty dog Jack Palance even shows up for an amusing, warmhearted supporting role as a mysterious hacker who helps the duo out and in turn gets his own retribution. Get one thing straight right now: this a B movie. If you go into one of these with your critic's brain shovelling coal into the fires of cynicism, you're gonna have a bad time. These films are overtly cheap, chock full of deliberate plot holes and speckled with acting that could wilt flowers. But I love them anyway. I grew up watching an endless stream of direct to video horror, sci fi and thriller flicks that maybe ten people on planet earth besides me have seen. I love them, they are amazing and they exist in a realm far, far outside film 'criticism'. It's best to gear your brain into fun mode before hitting play, then just relax and enjoy. If you're the type of person that can do that, you'll love this kind of stuff. If not, steer well clear. Cyborg 2 is the perfect example of a B movie done right, and I'll be the first to admit that there's plenty that are made with the kind of lifeless ineptitude that doesn't even deserve a place in the genre. This one's cheaply made, doesn't have much of a budget to its name, yet admirably creates it's own little world with what it has, spinning a story of action, romance, robots and Angelina Jolie. Honestly, who can say no to those things? You, that's who."],"review-user":["ma-cortes","strongman6","quincy-white","awood-24","EdYerkeRobins","Aaron1375","Vomitron_G","the_Iced_Earth","LebowskiT1000","Tin Man-5","Son_of_Mansfield","DigitalRevenantX7","slayerdave","jorisu","Lampje","killer13","jack_thursby","hendu-2","brian james","Sgt_Feelings","sshahan1","Seth_Rogue_One","murphy-21","davideo-2","NateWatchesCoolMovies"],"review-date":["11 November 2005","11 January 2004","28 June 2003","17 February 2007","17 July 2001","7 June 2005","5 September 2011","31 January 2004","15 August 2002","6 September 1999","4 June 2007","17 April 2009","18 October 2001","4 March 2005","16 October 1999","19 August 2000","11 November 2005","22 October 2000","1 April 2002","19 May 2005","11 July 2004","16 October 2016","16 February 2000","28 November 2003","8 March 2016"],"review-rating":["5","7","10","7","8","6","7","5","4","6","7","7","6","1","6","3","2","8"],"review-title":[" Second part with most known and the best cast of the trilogy\n"," Jack Palance (voice) is put to good use.\n"," Surprising B-Movie\n"," 3.1 with Angelina Jolie sex scenes? Are you CRAZY!?\n"," Surprisingly Decent\n"," I like it quite a bit...a lot more than the first Cyborg.\n"," Underrated, interesting sequel\n"," Good movie, some cheesiness\n"," Nothing great here\n"," HUGE improvement over the first film\n"," Cyborger.\n"," Better than the original.\n"," Angelina Jolies best movie\n"," Cult potential\n"," Surprisingly nice picture\n"," Good Action but its missing Van Damme and turns too much into a romance story!\n"," Not even Angelina Jolie can save this disaster\n"," Don't forget your spoon!\n"," Angelina Jolie ROCKS the house in \"Cyborg 2\"!!\n"," Cyborg 2: Get Ready for Feelings\n"," Bladerunner-like, but from the replicant perspective\n"," Cyborg 2, more like Cybore 2\n"," only for Angelina Jolie fans!\n"," We all gotta start somewhere\n"," Great stuff. Jolie kicks ass. Very underrated\n"]}