{"review-url":["http://www.imdb.com/title/tt0100924/reviews"],"review-text":["A film that doen't get mentioned with the best of John Boorman is this sweet and poignant motion picture about the rise and fall and rise of a whalthy family.  The family is made up of eccentric characters that are memorable in their individual characterizations.  Where the Heart Is(1990) is a bright and wonderful movie that is one of Boorman's overlooked and underrated. The performance of Dabney Coleman is probably the best he has given in a long career of making motion pictures.  One of the best films of the 1990s which I would love to see on DVD.","This is quite honestly a beautiful film. The women and men are gorgeous and there is eye-candy here for many and charm and grace for other's. I don't agree with the \"comedy\" classification. This is a film that stretches social boundaries. Maybe the biggest problem with this film was it tried to say too much in far to many areas, thus leaving holes or unfinished plot lines.In the late eighties and early 90's the impact of computers (and internet) on business made a mint for some and lost a mint for other's. Those that fought the old ways, no found themselves to be the outsiders in society. Not the artists, gay males, old homeless men, etc. It was and still is a time to reaccess priorities.I liked there was a gay male character shown in such a positive light. The ending is a bit of a sell out for his story line, but should not impact the importance of the role during the time it was filmed. There was interracial dating, the realization that homelessness could happen to anyone at any time.I also understood the main character's motivation for \"tossing\" his college educated children out of their wealthy home ..... he didn't exactly leave them on the street. As was mentioned briefly, most of the parents in this super wealthy world were more then ready for their children to leave the nest.The way the adult children adjusted to a new lifestyle and fending for themselves (or not) and the strange yet strikingly beautiful life they built with friends and new friends, was IMO well developed. The movie also covers the territory of the empty nest syndrome and the parents realizing after 26 years they are \"strangers.\" The reawakening and strengthening of family values was very inspiring.Final note .... students of art and art lovers, or those that enjoy beautifully filmed movies should not miss it.","The ending ties things up a  bit too neatly, but this is a ravishingly beautiful film. Good ensemble work by all the cast (although the lovely Uma has obviously had some acting classes since this role)...However, the art direction is the true star - it's definitely worth checking out for that alone. This may not be Boorman's best work, but it didn't deserve the panning it got from the mainstream media when it came out.","Pity the poor reviewer who disliked / didn't understand this wonderful film. What a sad life he must lead!This movie has more to say about life and relationships than most I've ever seen, yet it's not dark or preachy like the \"ordinary people\" type of film. It is mostly humorous, though not technically a comedy.The whole thing feels a little like a fantasy, perhaps Shakespear's \"Midsummer Nights' Dream.\"  Beautiful, intelligent women abound,  with wonderful cinematography and a non-insulting screenplay that doesn't miss a beat.I look forward to seeing it every time this film is re-run on cable.  It's like re-reading a favorite, treasured book.","This film brought out the barracuda in most of the major critics. And did the public take one bit of notion? It did and flocked elsewhere.\nBut I still remember the overall impact this forgotten little gem had on me when I watched it some 14 odd years ago in one of these little arthouse cinemas that had all but vanished as multiplexes became the latest rage. 'Breathtaking' was the word for it. This reaction was caused by the picture's extraordinary visual beauty: cinematography as an art form has never been more ravishingly demonstrated as in the composition of light, shade and colour. I remember a series of scenes so beautiful I wanted to stop the moving pictures occasionally and just be a picture.\nBut like other visual masterpieces, its triumph did not extend to the screenplay and dialogues that were often boring, sometimes even downright foolish.","One of John Boorman's finest films.  Dabney Coleman rises above his paper-cutout character status of the \"bad guy\" to become a basic family man with real family problems and the \"kids\" played by Hannah, Glover and Amis are really fun characters.  The plot actually has twists in it that make the whole thing fun to watch and the ending has a \"rightness\" to it which lets you come away from the film with a good feeling about life and people.  A really good way to spend a couple of hours.","This movie has a lot to recommend it. The paintings, the music, and David Hewlett's naked butt are all gorgeous! The plot, a story of redemption, forgiveness, and courage in the face of adversity is also very interesting and touching -- and it's not predictable, which is saying quite a lot about a movie in this day and age. But, the acting is mediocre, the direction is confusing, and the script is just odd. It often felt like it was trying to be a parody, but I never figured out what it was trying to be parody *of*. And if it's not a parody, well, it remains a movie with great potential that it didn't live up to.","This movie is great--especially if you enjoy visual arts. The scenery that the two daughters paint and photograph are beautiful. The story is also both funny and poignant at times.People who like European films  and \"art movies\" will like this movie. This is truly an art movie--it actually has a lot of art in it. Go rent it.","This movie includes one of the best characters and dialog that Crispin Glover has ever played. Uma Thurman and Suzy Amis are also great in this movie, but Crispin makes it a great depiction of young people trying to make it in New York.","In this day and age, many people have forgotten what really matters in their lives. Materialism is fleeting, and trying economic times are shining new light on this wonderful cautionary tale of twenty years ago.The McBains are, like most of us, a product of their times. Not merely a dysfunctional family, but one so immersed in the material world that they've lost sight of what truly matters in their lives. But when it all comes crashing down around their feet, they discover that the loyalty of family and friends reigns supreme.I consider it wrong to classify this wonderful story as a comedy - it is a drama through and through, despite comedic moments. Though there are moments of coarse language and nudity, they are done tactfully and the movie should probably be re-rated to PG-13. The family learns a hard lesson on what it is to be a family, and people shouldn't be so quick to dismiss it due to its R rating.The themes are hardly suitable for pre-teens but, all-in-all, a wonderful movie for the entire family.","I've seen a few of Mr. Boorman's movies and didn't like much of them. Not that they are bad movies, quite the contrary are good movies, but not content I personally found entertaining. However I think Where the Heart Is, although made to cater to the less than art savvy American audience, is masterful as satire, and as social commentary of the times it was made in. I've had to replace this movie in my collection at least a half a dozen times, since every time I loan it out to someone I know could appreciate it's artistry on all its levels, my copy fails to come back home to me, lol. The last time took 7 years to replace it since it was out of print for VHS sales, has never been made as a DVD that I know of, and had to wait till one of the premium cable channels ran it before I could tape it again.My favorite aspect after the nail-on-the-head social commentary is the paintings by Timna Woollard. I've searched for 15 years to find anyone or anywhere that could lead me to where her work is available for sale. Or better yet a copy of the paintings in the movie without the ending credits rolling over them. I have a room in my house that I dedicated to putting copies of her paintings in, and no one seems to know if it ever was released as a coffee table book, or video aquarium, or as a documentary of her work. If anyone does know of where I can acquire any sort of copy of Timna's work or where her studio is in England, please do not hesitate to contact me via email.","This \"farce\" about a wealthy millionaire who puts his spoiled children out of their plush lifestyle, forcing them to live in a Brooklyn slum building he owns is a strange little item. There was possibilities in the storyline but Coleman's children (which include Uma Thurman) are so flighty they get on your nerves quickly. Circumstances occur that force Coleman to enlist his children's help and the movie gets unglued at the end. Both Dabney Coleman and Joanna Cassidy, both fondly remembered from the \"Buffalo Bill\" tv series of the mid 80's, deserve better.","Family is where the heart is. Where the Heart Is is an intelligent and friendly show with much bravado and a real understanding of the heart. The characters feel realer to the people you know in your real life than most other movies you come across. Dabney Coleman and Uma Thurman star terrifically. Dabney becomes his character giving him identity. Uma soars and is obviously the sexiest woman ever. Uma also gives Where the Heart Is real heart. Crispin Clover appears in his youth. Clover has a true passion for the art of acting. Where the Heart Is is so poetic and really beautiful. I love Where the Heart Is. It's a real must-see!","I say this. If you want to see art, you go to an art gallery. If you want to see a movie, you go to a theater. Trying to intertwine art and film proves disastrous in \"Where the Heart Is\". An interesting cast is totally wasted in this embarrassment. You like Dabney Coleman, see \"Short Time\". You like Crispin Glover, see \"Bartleby\". You like Uma Thurman, see \"Kill Bill\". Above all, if you like Christopher Plummer, see \"The Silent Partner\", because his character here, is a terrible embarrassment. In fact this entire production is an embarrassment. Sure the human artwork is intriguing for a few minutes, so make a short, but do not subject an audience to pointless nonsense, masquerading as filmed entertainment. - MERK","A very good film, with very inspired art direction. Enough different than all the other movies Hollywood produces. A surprise from West side stories... It is the first time that black humor is colored...We are sure that Van would be proud...","Hard to imagine what they were thinking of when they made this movie (i.e., the writers, directors, producers, actors, editors, etc.).  Christopher Plummer, veteran of 129 movies, frolics along among scores of other actors with apparently no more motivation than to collect a paycheck.  I guess there is nothing wrong with that, but once they are paid that doesn't mean anyone has to watch it.It bugs me that there are actually good reviews for this movie here at imdb. Art?  If you want to see art go to an art gallery, don't watch this movie. Comedy?  Watch a re-run of the Flintstones, about the same plot with less time wasted.Dabney Coleman gives his usual performance, for better or worse.  And some of the young actors may have gotten some good experience from doing this movie.  But Plummer????  It was embarrassing to watch his performance, in fact I was positively transfixed on him throughout the movie, knowing this was Plummer of Sound of Music fame!  I see from his bio that he called Sound of Music \"sound of mucus\", so guess he didn't like it as much as the 100's of millions who liked him in it.I wonder if today he was asked, how do you rate Sound of Music compared to Where the Heart Is, what would he say.....?Probably something like \"Where the Money Is\"...."],"review-user":["eibon04","savanna-2","Lanwench","cableaddict","jandewitt","samiyam","green-29","drdancm-2","elspethm","TwylaFox","dreamsculpter","barahona","tbills2","merklekranz","sat3sat","glentom1"],"review-date":["23 August 2001","11 September 2000","22 July 2001","1 March 2004","10 August 2004","15 August 2003","15 November 2004","17 April 2001","15 August 2000","25 April 2010","13 July 2005","3 October 1999","16 April 2015","15 December 2009","20 April 2001","15 November 2003"],"review-rating":["9","7","10","10","9","10","7","1","3"],"review-title":[" Depression-Era Story Transported to Early 1990s\n"," Captivating Film\n"," Beautiful\n"," A heartwarming masterpiece.\n"," Ravishing to the eye or as Suzy Amis put it: Menschen malen Illusionen\n"," Finally! A comedy which is funny and well acted\n"," Not bad, could have been much better\n"," Superb, Unique little gem\n"," Great movie\n"," \"Stone Soup\" for the Soul\n"," Where the Heart Is strikes home\n"," disappointing and strange\n"," The Heart is an Art\n"," Pointless embarrassment .............\n"," The heart is in the movie\n"," Not a good movie\n"]}