{"review-url":["http://www.imdb.com/title/tt0124102/reviews"],"review-text":["As a simple but interesting story, Strangeland is in the middle of good and bad. It borrows too much from other flicks, like Buffalo Bill from Silence of the Lambs. Some lines (\"What a rush?\") are kind of terrible. And the Twisted Sister references that no one picks up on are laughable: the \"we're not gonna take it\" sign that the angry mob is holding and Dee's character \"Capt. Howdy\". Yes, it's in the Exorcist, but it is also a Sister song. On a good note, Dee Snider is a creepy looking character. The first time you really get a good look at him he's intense. And there are a few gross sadist scenes, one involving piercing an unwilling man in the most dreaded of all places. That part made me wince. And that's fairly hard to do. Also, I loved the fact that Robert Englund plays a character that is the exact opposite of his role in A Nightmare on Elm Street. Instead of playing the killer, he is the leader of the mob going to find the killer. Krueger fans will know what I'm talking about. It's a brilliant and appropriate piece of casting that genre fans should appreciate. Overall, the good outweighs the bad, and I would recommend watching it (at least once). You have to give Dee some credit, there are a lot worse movies out there.","\"Strangeland\" isn't that bad if it features fears of yours.**SPOILERS**Genevieve Gage, (Linda Cardellini) is just the latest in a series of disappearances plaguing a small town. Her father Mike (Kevin Gage) just happens to be the detective on the case, and his partner Steve Christian, (Brett Harrelson) convinces him to check out a club that specializes in piercing and scarification, which is also the secret hideout for Captain Howdy, (Dee Snider) also known as Carleton Hendricks, who is the suspected cause of the disappearances. With the help of his cousin Angela Stravelli, (Amy Smart) Captain Howdy is caught and brought to justice. After a couple years in an insane asylum, he gets released back into the community, and a local militia group led by Jackson Roth, (Robert Englund) kidnap him and leave him for dead. When new evidence confirms that he may not be dead, Detective Gage tries harder than before to stop him.The Good News: As it gets more and more commonplace for people to chat online and in instant messaging, the fact that this one was the first out of the gate to show the potential evils and dangers of the situation is a nice and original approach. Even though it deviates from it towards the end, the original set-up is pretty great. The ending is also pretty great and pretty exciting, with a great bit of action in there as well. Most of the focus on this film is the discomfort one gets when exposed to extreme forms of scaring and skin piercing, and it is a subject most get uncomfortable viewing. This is mostly played out in the psychical form of Captain Howdy, who does look pretty creepy. His look, though, drives the film, so I won't spoil it, but it is a really disturbing and shocking look that will definitely get you a little crept out the first time his full appearance is shown.The Bad News: This film basically relies on the belief that extreme piercing, full-body tattoos and scaring are scary images for the average person. If none of them are scary or frightening, then most of the film's power will be lost. Besides that, there really isn't a whole else in the film. It's not a traditional horror film in the slasher sense, so for some it can be quite boring, as there's no real jumps, suspense or anything similar.The Final Verdict: If any of the acts or ideas featured in this one are fears of yours, this could be a pretty scary film. If not, this can be a pretty dull experience. Otherwise, it's pretty middle of he road and pretty forgettable. Use your own judgment to determine if you will like this one or not.Rated R: Graphic Violence, Nudity, some Language, a brief sex scene, scenes of torture and extreme images of body modification","I first rented this movie on the infamous day of September 11, 2001. Since then I've seen it a number of times. My only complaint is that it's too short. \"Strangeland\" would've be a complete piece of horror art at two hours. As it stands, the running time is only an hour and a half.Ex-Twisted Sister member Dee Snider wrote, produced and stars in this 1998 shockfest set in a small Colorado town. He plays Carleton Hendricks, a crazed sadist who has psychotic ideologies on human evolution and a love for near-death experiences. Hendricks is no pushover, he's a pumped up six-foot \"modern primitive\". Someone who has tattooed and pierced their body to the very extreme. When he makes his first full appearance in the film, it is a truly terrifying sight.Hendricks' main hobby in life is to share his \"spiritual awakenings\" with his kidnapped victims. He visits Internet chatrooms under the name \"Capt. Howdy\" and then invites people over to his house. They believe they're going to a party. Instead, they find themselves in a house of pain and suffering. Hendricks sows their eyes and mouths shut and tortures them by sticking blades and hooks in numerous parts of their body. If it sounds sick, it's because it is.One of Hendrick's victims is Genevieve, the teenaged daughter of detective Michael Gage. Gage not only manages to save her, but arrests Hendricks as well. Four years later, Hendricks is released from a mental institution completely rehabilitated to the disapproval of the community. A group of rednecks led by Freddy Krueger himself, actor Robert Englund, decide to kill him. They fail and Hendricks reverts back to his old self.The rest of the film I'll leave to you, only to say the conclusion is satisfying and will leave you in shivers. With the exception of Snider, the acting isn't too good, but it's serviceable. The direction is okay, too. There are some humorous parts in \"Strangeland\" and they are very funny. I also loved the soundtrack, it's awesome and worth buying if you love rock. Overall, this is a movie worth watching. If you love low-budget horror films with a sense of humor, check it out. You'll probably like it.","Wholly wow, never thought I would see a horror movie that would have a story that would stagger around as badly as it happened in 1987's Grotesque. But here it is. A torture-loving maniac who seeks victims in chat-rooms and calls himself Captain Howdy (yep, The Exorcist) torments a detective when he takes his daughter. Then, the maniac is arrested, rehabilitated, let loose after four years (huh?) in a nuthouse, picked on by Robert England, hung by Freddy and his hick buddies, but then- he's not really dead. So maniac goes back to terrorizing said detective who arrested him in the first place, and promptly re-kidnaps his daughter. Yow. I enjoyed this movie. The pace is all over the place, but it never leaves you bored. Dee Snider (Twisted Sister, remember I Wanna Rock, or We're Not Gonna Take It? Hell, he was in Pee-Wee's Big Adventure) is the loon, who is obsessed with torture and flesh ripping, and you don't get to see him for the first 45 minutes, but when he does finally show his face, you say to yourself \"oh yeah, Dee Snider\". The first 45 minutes plays like a freaky detective horror thriller with main characters, then Robert England comes out of nowhere for about 20 minutes in a starring role-of-sorts. The movie is fun for the average fan. It's an assault on the senses, blended with cheese. Two good things at once. Features breasts punctured with torture devices, flesh hanging by hooks, and of course the Twistedest Sister of them all. Three stars.","That Twisted Sister's Dee Snyder wrote and produced this may have turned some people off from even giving it a try. It's also in no small part inspired by The Silence of the Lambs (from which it steals at least one scene) and Se7en, and as with other movies that have taken inspiration from those movies, such as 8mm, Feardotcom and Saw, took some flak for that too. The title is a stumper, I don't know what it means and it doesn't seem to suit the movie well. The shocking cover image is well chosen, though it might surprise some that a person's mouth sewn shut could be found in the opening scene of a movie from the early 1930s, Murders in the Zoo.In truth, it's not all that bad. A young woman is lured to a party through an online chatroom and an IM from \"Captain Howdy,\" and her friend turns up dead with signs of body modification-inspired torture. A large septum piercing found in the trunk of her car provides a clue (I didn't understand how it could have been accidentally left, or why it would have been planted). The cop learns a bit about \"modern primitives\" (I think there's a shot from the RE/ Search book of that name) and online chatrooms, still a danger to the unwary today.Somewhat surprisingly, partway into the movie we get a \"four years later\" intertitle, and the discovery of a second set of victims seems awfully convenient. The ending confrontation is disappointing.There are nods to other movies as well, as when a group of neighbors tries to lynch the bad guy, led by Jack (Robert Englund). This is quite reminiscent of the lynching of Freddie Krueger (Robert Englund again) by his neighbors in the Nightmare on Elm Street backstory.I saw the version on video, and am not sure how the unrated DVD might differ.","Tried to contact Scott to state that this movie is dull. IMDB won't let me though. I am way over the age of twelve. Over twice that even and I LOVE movies. I was nervous to see this movie for a long time because I thought the acts towards women might be too brutal and frightening. I finally forced myself to watch it with a friend. I had to apologize for how lame it was. No suspense. Nothing scary. Boring. The trailer and movie cover will kick your ass. Go no further though. it is a waste of your time. maybe someday it will be a famous cult film of some the the worst, famous cult films ever made. Either that or just watch it cause that 'Twisted Sister' guy is in it and you're curious.","A lot of people give this movie a lot of crap, and all of it's really undeserved. People give this movie a hard time either because it's such a sick subject or they harp on some technical aspect of the movie no one else observes when they watch it. If, just by looking at the cover, you think this movie will make you uncomfortable...DON'T WATCH IT! However, you'd be missing out on one of the better cinematic experiences of the late 1990's, despite what anyone else says.Dee Snider is wonderful here as Captain Howdy, the depths of insanity he plumbs to play this character has to be beyond words, and is much farther than any one of us would have to be willing to go. The acting here is wonderful. The film itself beautifully shot. The subject may be a bit too much for many to swallow, but it's still well worth your time. If you haven't seen this movie, check it out.","Unbelievable. Great cast, fair acting, interesting plot.But this movie has such graphic cruelties that are not tense or giving thrills, just pure disturbing unruhe.*SPOILER*Everyone could see coming the freak returns to his habits. And that Robert Englund was acting (was he?) like an idiot; forbidding your daughter to sleep with a football player, but him trying to kill an idiot and liking kiddypr0n is alright?! The policeman who's daughter was kidnapped - anyone felt he was a cop and not an actor? Not me. This movie drags on and on with an ending that we see in other horror movies: if the returns were alright a part 2 could be made. Bad, really bad stuff. Might give creeps some inspiration...","Wow...This movie really really sucks...'Nuff said.The Story: A psychopathic internet predator stalks and lures young men and women into torturous traps...It goes like this, kidnaps people, they find him, he becomes a changed man and is released on the world yet again, reverts back to his old ways and starts the torture again....The story is stupid, it's implausible. The characters are stupid, they're implausible...Or at the very least way over the top. It's got some very violent imagery, and if you have a week stomach you might just want to stay away...But than again, even if you don't have a week stomach, you might want to stay away...It's that stupid.The Cast: Dee Snider, Kevin Gage...If you're a die hard fan of Twisted Sister and Dee Snider, you might find this one interesting, since he's the writer and star of this film. His acting is laughably bad, and you can tell that he's the one that wrote the God-awful script. Kevin Gage...Well they say he's been in numerous other movies that I've seen, but I don't remember him from any of them...And you won't remember him from this...These two sadly, make the film...They don't make it good mind you...They just make it...One to Five Scale: 1 It's bad...It's very very very bad...In fact it's so bad, that this movie should come with a clip loading pistol to play Russian Rullet with...","Put this movie out of it's misery and burn the negatives.  What am I saying? The whole movie was negative.  Fortunately, only a very few would find this movie the least bit appealing.  This is what the vast American majority would call too much sex and violence.  It will probably show up on some non-premium cable channel someday just for the shock value, but after editing out the nudity (most of the violence will stay) all that will be left is 45 minutes of really bad acting interspersed with 45 minutes of commercials.  There are just too many starving actors in Hollywood.","There are about ten minutes about half way through Strangeland when one suddenly sees the glimmer of an interesting idea. Themes of revenge and rehabilitation come into focus during Robert Englund's brief screen time. Sadly Strangeland then resumes its course as a thoroughly predictable and boring slasher film.","Next to Milo and The Killer Eye, Strangeland was the worst movie of the year. Dee Snider wrote the script to this boring, dull horror with bad acting and a slow pace. Nothing interesting happens here and the movie looks like it was actually TWO movies condensed together. The first half could've been shorter...waaaaay shorter. And the second half could have been more longer and stronger. This film is utterly obscure, limited, wandering and absolutely pointless. Whoever had to like it is probably a sadomasochistic person who has nothing better to do than watch this junk. It's even more insane when the filmmakers are actually planning a sequel...they are seriously.","Sometimes I wonder if today's horror movies rely on human torturing to make people scared. If so, then there's a sad future for horror movies. Dee Snyder tries to make you feel scared and terrified, this movie does exactly this but not in a good way. Now there are some moments in the film where that there is a chance that Snyder is saving this film from falling into a hole but let's be frank, this movie didn't fall into a hole, it was already in a hole and Synder makes no attempt whatsoever to bring itself out of it. When you finish watching this movie, you are left sick, depressed, dirty, and insane. I have a feeling that was the intention of this movie. What is lower than dirt?","This movie looked pretty good a first. A somewhat original idea for a horror movie, I was looking forward to this movie to come out.  I rented it on DVD, and I just had to laugh.  Dee Snyder needs to stay out of the horror movie business!  Probably the movie business altogether.  The movie starts out promising, but goes downhill from there.  The \"bad guy,\" Captain Howdy is laughable, and the piercings and tattoos make you laugh, instead of making you scared!  The actors in this movie are horrible, and I'm shocked they ever landed parts in their lives.  I just found out the girl from Freaks and Geeks is the young girl who is tormented by Howdy, and I think she was awesome in Freaks and Geeks, but here, she's just like the rest of them.  When it comes down to it, she doesn't even have any lines in the entire film, and her part is just a tiny piece of the puzzle.  The detectives in this movie are fake, and both of them can't act for nothing. Like I said, the start of the film is ok with an internet stalker/murderer played by Snyder, but his character just isn't scary.  Not much in the movie is scary, and most of it is just a way for Snyder to try to freak you out with horrible scenes of girls tied up naked with hooks going into their bodies, etc.  I wouldn't waste my time on this movie.  It's a bad movie, and an even worse horror movie.","I don't recommend you watching this movie if you are easily offended. I'm not even easily offended and this movie made me frustrated. It's so disgusting. And it doesn't make sense. All the internet thing is so cliché, and the producer obviously didn't understand all the \"internet rules\". When you chat with someone you CAN track their IP address. Really? (see the sarcasm here). It was dumb. Pointless. And I didn't even watch the end. I could always say \"this doesn't make sense, this neither...\" This movie is pure crap at his best. Nice comment right?","The most worthless film of the decade. The responsible parties should never be allowed to film again.  I have no words to describe the lack of entertainment this film provides.  You couldn't PAY me to watch this film again. Quite honestly, I think  I would be a better person had I not seen it. If I called it offensive, I would fall into a category of emotionally frail extremists.  I would say this film goes so far as to damage the industry.  There are films that I refuse to watch, now that I feel they might be this tasteless.  I feel like an idiot that I didn't have the good sense to walk out during any one of MANY moments I was compelled to do so. Yes, I saw the end and am ashamed for it, as should anyone else, including the writer. I am in awe...","As a horror movie buff, I am most horrified that this \"film\" made me feel like Tipper Gore. Strangeland has no redeeming qualities, it is at once dull as dishwater and depraved and nauseating. This movie should never have been made, much less released as legitimate cinema.","1/2 out of ****This film has officially taken the beauty of a human body, and made it something ugly. It's really too bad. This film is very stupid and really quite unpleasant. Sure, it may not be no CHAOS(2005), but it is certainly very cheap and dumb. At least it actually has a real message though. Beware of strangers on the internet. This is a good lesson and a good message, so for that, the film at least has something to be proud of. But otherwise, i feel that the film is a waste of time and money.The plot revolves around Captain Howdy, a foolish goofy looking man who enjoys kidnapping young people, tying them up, and... piercing them?!?! now obviously, this guy is a sadist, but not in the traditional sense. You see, this is all he does. He doesn't kill them(at least on purpose as it seems), he doesn't appear to sexually violate them, he doesn't even really threaten them all that much. At least at first! There comes a point in the film where a particular thing happens to him for a particular reason by some particular people. I don't dare to reveal what, but somehow this causing him to not only pierce, but rape and kill. It doesn't really make much sense.Listen, if you are a fan of horror movies or Dee Snyder, you deserve better. I just happen to think that one of the most attractive people in the movie making business is Linda Cardellini, and she is in this film. But she is wasted and used and her body is shown being distorted and destroyed in this terrible film. I think that it is awful that she was used that way in a film like this. I find this film to be very boring and ponderous and not at all scary. don't watch it.Rated R for strong graphic torture/violence, language, nudity and sexuality.","If you want to see a Horror Film which is Horrible and in very bad taste, this is definitely the film to view. This films starts out with two young teenagers getting wild ideas about going into a chat room and going out on blind dates, and quite possibly they will wind up like a little lamb to the slaughter house. Plenty of blood, gore, nudity, handcuffs and all kinds of blood draining hooks and things you will never dream a person is capable of performing on men and women. If you like piercing, well this kind of piercing deals with heavy heavy hooks and plenty of tattoo's; besides, lots of needles and thread to seal up things on the human body. I really hope that this film does not give some sick person in this world, the idea to act out these horrors in real LIFE.","I kinda had high hopes for Dee's new horror film. Then when the film came out and wasn't screened for the critics, I had a feeling it'd be junk, but after sitting through garbage like HOLY MAN and URBAN LEGEND, I figured I could take STRANGELAND, too bad I was wrong. This is on my top ten worst films, it's awful, not even fun on a campy level. The audience I saw it, two other teens, hated it obviously worse than my friend and I did, and they wisely walked out of it. I have no idea why we didn't. From the acting to the gore, everything about this movie was terrible, the pacing being the worst. Avoid this movie like the plague!","What can I say about this movie that hasn't already been said... If anyone suggests seeing it, run as far away as you can as fast as you can. There were some moments that I enjoyed, for example, the various pop culture references. Well, that's really about it. I found myself compelled to count Captain Howdy's piercings, and asked at regular intervals, \"Is it over yet? Why isn't it over yet? Do we have to watch the rest?\" At the end, I was smiling from ear to ear because, yes, it was FINALLY over, and I knew that (as the body mod aspect of this movie disgusted my boyfriend) that I would never have to sit through it again.Just how bad is it? It made Campfire Stories look like an Oscar-worthy piece of fine cinema.","For those of you who don't know, or maybe just don't remember Dee Snider was the head of the famous old school metal band Twisted Sister. Snider brought us such great anthems as \"We're Not Gonna Take It\" and \"I Wanna Rock\". Now brings us to 1998 where Snider has began to write again. But he has shifted gear, this time he is writing a movie. \"Dee Snider's Strangeland\" a movie he not only wrote but produced  and starred in as well. This is a fairly unknown movie because the NC-17  rating didn't give it much help at the box office and lets admit it people, S&M doesn't exactly make for good clean family entertainment. But all that aside it is the story of two girls who one night meet our antagonist, Captain Howdy ( played here by Snider himself).  Well of course Howdy being the strange and sick person he is invite's the two girl's to a party where he later inflicts all kinds of disturbing pain and torment. Well after the girls go missing the one girls father, Inspector Gage (played by Kevin Gage) goes on a search for his daughter. Through the help of his niece (Amy Smart) he tracks down Howdy and takes him into custody. Four years later Howdy is released a new man. But the towns folk want nothing to do with him and want to see him dead. Along comes Robert Englund as a redneck beer drinking slob who decides to take matters into his own hands. Wanting to see the demise of Howdy an angry mob breaks into his house and take him away. As fate would have it Gage sees the whole thing happen. Well the death of Howdy is unsuccessful and Howdy becomes his same old self again. Target #1 for Howdy, seek revenge on Gage who could have stopped the whole thing but decided to just sit back and watch. So again Howdy goes after Gages daughter and Englund. What we have here is a trip through Sniders sick and twisted mind. There is something here to make just about everyone turn there head in disgust. Some may not even make it past the movie's box which features a picture of a girl with her mouth sewn shut. Definitely not for the faint of heart of the squeamish. With every good horror movie comes a good soundtrack and this is no acceptation. The soundtrack combines today's great metal acts with yesterdays classic styling. The soundtrack and movie starts with a dark and dim solo outing from Snider that sets the mood of the movie. It ends with the first new Twisted Sister song in a long time with all the original members. If you are a fan of the music or just looking for a good horror movie ( a thing quite hard to come about these days) this movie is for you. We ask the question: does it have a cast of top notch actor? No. Will everyone enjoy it? No. Is it an entertaining ride. that is sure to keep you on the edge of your seat? Yes.","An obscenely bad movie. Devoid of everything that makes a good, let alone mediocre film.  The acting is amazingly subpar, with some actors coming across as if they just woke up from a nap and found they were on camera. And the worst part, it wasn't even scary, not even in the slightest. Crap.","Anybody who first claims here he/she is 'a true horror fan' and than starts a story about this being a good film, should be taken out of their misery. People, this must definately be one of the most boring films ever made. I think I saw the r-rated version, since I can't remember seeing any of the \"stomic turning torture\" some folks mention here, but even if it had been there, this movie would suck harder than a Swedish pornstar. bad acting, no story, bad acting. Did I mention the terrible story? Listening to Dee Snider babbling a lot of semi-philisofical mumbujumbu about piercing and old rituals is the only real torture in this film...Only thing good about this film is the remotely cool rock-soundtrack. Another 90 minutes scaringly well wasted. Avoid at all cost...","This gets my vote for \"I'd rather clean the cat box\" because it would be scarier and a more productive use of my time. The only redeeming feature is that the nasty- gory -torture bits are glossed over by the camera in comparison to more recent \"cat box\" worthy outings, which tend to dwell and dwell on the gore (e.g. Hostel).I gave up at least 1/2 hour before the end since it was on TV and I could not fast forward through the boring bloody bits. The hunt by police detectives in the first half keeps the interest, particularly because the use of the internet is now so dated and yet so current in light of recent news. Finally, however, Strangeland is reminiscent of the most hackneyed and strained elements of old monster movies and appears to rely on solely on gory visuals to keep the viewer's interest. Strictly for those who enjoy human- on- human nastiness without much background."],"review-user":["Backlash007","slayrrr666","practiced_bravado","drhackenstine","FieCrier","walker_eve","i_undertaker1313","ofjeworstlust","OrdinarySun","davphv","JohnSeal","Dev-7","drummer8000","JBoze313","celebrity_skin15","annie-28","ksberzine","tonymurphylee","whpratt1","Adam E","Fairies__wear_boots","casey_choas66","Cass25","Beerdrinking Dog","Geshtinana"],"review-date":["25 October 2001","6 April 2006","19 December 2004","10 September 2005","4 November 2006","29 September 2001","3 October 2005","23 March 2004","12 November 2005","31 August 2003","2 June 2000","21 March 1999","29 June 2006","6 October 2000","30 August 2000","11 October 1998","24 January 2001","17 July 2007","25 August 2006","14 February 1999","11 August 2005","26 June 2002","17 April 2002","12 October 2001","30 May 2006"],"review-rating":["7","4","10","2","1","1","3","2","1","1","1","1","1","1","1","1","1","2"],"review-title":[" \"So much flesh, so little time.\"\n"," There's worse ones out there\n"," A sick low-budget horror film well worth seeing. I liked it.\n"," I Was Almost There\n"," tolerable Silence of the Lambs and Se7en knockoff\n"," Boring........\n"," There, that's better...try not to speak...\n"," sucking sick\n"," If you sew your eyes shut you don't have to watch this...\n"," they shoot horses don't they\n"," Should be called Dee Snider's Predictable Vanity Project\n"," The worst horror movie of the year\n"," Here's a depressing little picture!\n"," Snyder must be kidding with this garbage....\n"," How can someone even think about this?\n"," The most worthless film of the decade. The responsible parties should never be allowed to film again.\n"," Sadistic trash that should be rated xxx.\n"," A Disgusting Bore.\n"," Might Give Somebody Ideas\n"," One of the worst movies ever made!\n"," My dog's poop is less crappy than this...\n"," Dee Snider knows how to do horror\n"," An amazing waste.\n"," Pardon my French: PIECE DE LA CRAP!!!\n"," I'd rather clean the cat box\n"]}