{"review-url":["http://www.imdb.com/title/tt0191242/reviews"],"review-text":["What makes this low budget production one of my favorite movies? Not kidding, i was watching it already 10 times or so and did not get tired. Is it the tender melancholia throughout the whole thing? Is it the similarity to classics like \"Niagara\"? I was thinking a long time about that. And figured it out: I guess it is: there is no hero, there are only people. Some try to be good. Some gave up trying to be good. Some are hopeless cases but carry still the spunk of being human inside. It is the story of a catastrophic night in a motel at the end of the world. One way the catastrophe is nothing but the end of a chain of coincidences. The other way this night reveals the logical consequents of this peoples lives because they are in a certain constellation cut off the rest of the world. It has something of a Dostoevsky tale.","I bought this on DVD without actually seeing it before. Just, boom, bought it just like that. I wanted to know if this film had originality with its \"thriller\" genre. It's not too far off either...We have a set of \"typical-stereotype\" characters here, but if you expect that, then you can enjoy the characters to their full potential. Callum Keith Rennie has a small role, but as usual is quite phenomenal on screen, capturing your eye at all times. Winston Rekert is a good actor too in this dark film. The location and sets are brilliant and the imagery is interesting and different. But as for the story line, it is reasonably un-original, but it does hold your interest from begining to finish. The only downer is Rose McGowan's performance which can only be said to be a little \"wooden\" but perhaps this is what she intended for her character. Who knows. All I know, is that I did enjoy this film with the \"who done it\" theme and interesting quirky characters. Not half bad :)","I also saw The Last Stop at the Moving Pictures Film Festival in Prince George.  I have to confess, the only reason I went to see it is because I am a huge Callum Keith Rennie fan.  And he didn't let me down.  He gave a good performance of a rather unsympathetic character and provided about the only comic relief in the whole movie.The movie itself is the usual 'lots of bad people trapped in a snow storm together' storyline, but it did have a couple of twists that kept me guessing.  The characterizations were strong and the whole cast performed fairly well.  The only problems I had with the cast was Rose McGowan.  She was so cold throughout the movie that we didn't get any idea of her character's personality or motivations.  Other than her and a few small problems with continuity, this was a well-written, well acted thriller.","This isn't a perfect film, nor a great film. But it's completely entertaining nevertheless.\"The Last Stop\" has some mystery, some interesting characters, some good acting, some growling white wolves, and a huge amount of snow.\nThe same night I saw this movie, I watched \"The Skulls,\" a big studio production. \"The Last Stop\" was far more suspenseful.Rent it!","Being a self confessed slasher addict means that it's very rare that I get the chance to review many bigger budgeted movies with creditable casts. Aside from James Mangold's successful box office draw Identity; there have not been any big name entries since the Scream trilogy once again put Wes Craven's name back on the Hollywood map. That's why Mark Malone's The Last Stop  a mystery thriller with blatant slasher overtones, instantly intrigued me. With a decent line-up including Adam Beach and Jurgen Prochnow and an intriguing soundtrack that even finds space for Lynn Anderson's Rose Garden, I must admit that the initial signs were very positive for this claustrophobic feature. To the best of my knowledge there have only ever been three other snow-bound slashers, unless of course you consider Demon Possessed to fit in the category. The first slice and dice on the ice was the bone-dry Satan's Blade, then came the Lisa Loring cheese-feast that was Blizzard of Blood and the enjoyable Shredder followed some fourteen years later.During an extreme blizzard, state trooper Jason (Adam Beach) battles through the snow to reach a remote lodge in the Colorado Mountains. His task is to inform the guests that the road is closed and they must stay for at least one more night until a path can be cleared through the hazardous conditions. This news doesn't go down to well with the suspicious bunch, which includes two troublemaking brothers (Callum Keith Rennie and Peter Flemming), a truck driver that really doesn't want to hang around (William S. Taylor), a randy couple of lovers (Winston Rekert and Amy Adamson) and Jason's ex-girlfriend Nancy (Rose McGowan). The motel owners (Jurgen Prochnow and P. Lynn Johnson) aren't overjoyed by the news either, but they offer rooms to the stranded guests and attempt to calm the tense situation. Things take a turn for the worse when Jason finds a mutilated body and a bag full of stolen cash lying in the snow behind the cafe. Just like a chapter out of an Agatha Christie mystery, the lodgers begin dieing at the hands of a masked assailant that seems intent to re-claim the money. With so many dodgy characters to choose from and no way of leaving the crime scene, Jason has to attempt to stop the maniac before he kills again A good mystery needs at least a handful of shady suspects who each have a credible motive, a remote location that no one can escape from and a smart protagonist to help unravel the clues. Fortunately The Last Stop provides each of those essential ingredients in a thriller that has its equal moments of brilliance and downright stupidity. The film kicks off superbly as the dubious personalities clash in a claustrophobic environment that manages to keep the tension running high throughout the runtime. Malone keeps the interest levels raised as each character unveils their own reasons to attract some of the suspicion, and to be fair the essential twist isn't one that you'll guess easily. In fact I found myself watching the movie through once again to see if I could pick up on any hints that I missed first time around. Unfortunately when the maniac is revealed to be an over the top psycho that wisecracks like a comic book bad guy, The Last Stop forfeits a huge amount of credibility. Thankfully all is not lost when an unexpected and brilliantly orchestrated plot twist salvages the film's finale.Similarities can be drawn with the excellent Identity, as the two plots are almost interchangeable. James Mangold's effort has to be the better of the two mainly because of the star billing of John Cusack and the ever-reliable Ray Liotta. With that said though Adam Beach does a good enough job in the lead, while Jurgen Prochnow, Amy Adamson and the brilliant Callum Keith Rennie add some credible support. Rose McGowan acts as conceitedly in this role as she probably does from day to day in reality and Winston Rekert started fantastically before going completely overboard with the film's climax. If you're a die-hard slasher fan that's watching this for some bloody killings then you're going to be disappointed. The balaclava-wearing psychopath only pops up once and the rest of the murders are committed off-screen. But as I said earlier Malone's directorial talent means that the suspense is never too far off the boil and you can forgive the few flaws because the positives just about triumph.The Last Stop is well worth a look for slasher addicts and movie fans alike. Yes there are a handful of negatives, but overall this is a solid example of emerging Hollywood talents. If you liked Identity then certainly give this a try","After a snowstorm, the roads are blocked and the highway patrolman Jason (Adam Beach) comes to the diner of his friend Fritz (Jurgen Prochnow) and advises his clients that they will only be able to follow their trips on the next day. Among the weird strangers, Jason meets his former sweetheart Nancy (Rose McGowan), who has just left her husband in Los Angeles. Along the night, without any communication with his base, Jason faces distressful and suspicious situations with the clients, and finds some corpses, indicating that among them there is a killer.\"The Last Stop\" could be an average thriller, but the screenplay is simply awful. Most of the characters are despicable persons and the motives of the surprising serial killer are never disclosed, and the viewers have no further explanation why the killer decided to kill the guests. My vote is four.Title (Brazil): \"Encurralados\" (\"Trapped\")","I had never even heard of this movie when I started watching it.  I've always liked Adam Beach, so I figured I'd give it a try.  It did badly at the theaters and it got bad reviews.  So my expectations were low.  It was a pleasant surprise though.  Good job all around.  It's similar to the unfunny \"Fargo\", but done in good taste.When a winter storm comes on strong and forces the local police to close all the roads in the area, the guests at a Colorado restaurant/inn are trapped for the night.  Little do they know, a team of bank robbers is among them, having planned to rejoin at this very inn after their crime to settle up.  A double crosser makes a bad situation worse and people who have seen or know too much start dying.  Who's the killer?  Very nice mystery.  Well-written and suspenseful.","This movie is neither very good nor very bad.  It's good value for an undemanding evening's viewing from your nearest rental shop, but not the kind of thing you're likely to watch twice.  It was a pity that the characters walked around in the snowstorm without adequate clothing, and with only the odd puff on the hands to show they were cold but maybe they breed them tough in that neck of the woods.  The idea was a good one; a disparate collection of people trapped in a motel called 'The Last Stop' and slowly realising there is/are a crook(s) among them.  As the snow falls heavily so the body count rises, but unfortunately I worked out early on whodunnit and was right, which annoyed me.  I enjoyed it, but I think I was feeling lazy that night.  With a little more effort, this could have been a much better film than it was, and I'd lay the blame for that right at the director's door.  The actors all performed very competently.","To be honest, if this film didn't star Adam Beach I probably wouldn't have rented it in the first place.  He's a great actor and gives a fine performance, along with the rest of the cast, but I just didn't think much of the script.  It never really grabbed my attention, and by the end I didn't even care who it was that committed the crimes.  Though the acting was good, the characters weren't very interesting, you never found out anything about them than what was on the surface.  I'd say if you enjoy the actors in this film, and you have an hour and a half to kill, rent it. Otherwise...","I came across The Last Stop one day at a video store and they were selling it for only $2. I decided to  give it a try and bought it. It was pretty good, i enjoyed it. The story is about several people all caught in a cabin somewhere in nowhere because of a raging blizzard. There is a police officer, nancy,his ex girlfriend, two brothers that just got out of jail, a older man and his lover, a black man and the couple that owns the cabins and their retarted son that never speaks. Suddenly someone is found to be murdered and a bag full of cash is found. Everyone is a suspect. The Last Stop is a pretty good thriller, i would give it 8/10","I saw this movie while surfing through infomercials and late-night 80's sitcoms on tv one night at 2 in the morning.  I must say, I didn't expect much, and I didn't get much.  Although Rose McGowan is hot, her performance and the performance of the rest of the cast was not Oscar-worthy, to say the least.  This movie has its ups and downs, and does have a nice couple of twists at the end, but in all honesty it was awful.  Not even a typical slasher movie.  No gore, no sex, no nudity, no real violence.  Just bad acting.  I'd give it a 3 out of 10.","Agatha Christie takes a trip to the Pacific Northwest in The Last Stop, a chilly little indie B movie in which we have the pleasure of watching Adam Beach and Rose McGowan try to smoke out a killer amidst a group of people stranded in a remote motel during a blinding snowstorm. A welcome setup for intrigue indeed, if you're into cozying up to these actors for a tense little 90 minute guessing game packed with just the right amounts of cheesiness and tension. Beach plays a local Sheriff who is stuck at the establishment while its Proprietor (the great Jurgen Prochnow, refreshingly cast against type) struggles with a guest overload as the storm gathers steam. Beach's old flame (the ever alluring McGowan) has resurfaced in his life with little explanation. There's also an obnoxious hustler (Callum Keith Rennie) a sleazy would be cowboy (Winston Reckert) and other disconcerting weirdos lurking about. Some are red herrings, some simply filler for the narrative, and all are entertaining, whether intentionally or not. The plot meanders in snowy, typically nonsensical b-movie form until it pulls itself together for a very grounded finale that seems misplaced given what came before, but welcome all the same. McGowan could dub a Korean pop song and still be riveting, and it kills me she isn't in more stuff, but she's made it clear that acting was never her first love. Nevertheless she's great as both the most mysterious and fascinating character. Shades of The Hateful Eight, Eye See You with Stallone, and many a snowbound mystery. Fun stuff.","Put the film down and back slowly away.  The acting rivals a highschool play, the plot is treadworn, and the production values are slightly higher than community theater.  The goofs are so plentiful that it becomes a laugher.  Rooms are switched around, the dead move, dogs are used for wolves, men shot point blank with .45 caliber pistols are able to walk and ride snowmobiles, blouses button and unbutton without human touch... this is a baaaaaaaaaddddddd movie.  I nearly passed out when I saw the average rating.  There is no accounting for taste.  BTW, there is no nudity.","I must tell you the truth. The only reason I wanted to see this movie was because of Rose McGowan. I think that part definitely worked out...pretty well actually. However, the film was very good too. Some parts of this movie are really good.The film has great action also. The mystery is pretty hard to figure out and Rose [McGowan] does some \"Oscar-worthy\" acting towards the end of the film, but I don't want to give anything away. Adam Beach and Jurgen Prochnow are also great in the movie, along with some of the other stars.If you like mysteries, or action movies, or just like Rose...I totally think you would like this movie.","This movie was a real treat for me. Rose McGowan is my favourite actress of all time. She plays a great part in this movie as Nancy. Adam Beach also plays a good part here. The movie focuses on the dead of winter. It is freezing cold outside and everyone is becoming agressive. It doesn't help that their is a lunatic going about killing people. I reccomend this movie to anyone who likes suspence and light horror.","This movie is a little slow in the the beginning, for about the first 10 minutes or so. But once it kicks in you can't turn it off. Adam Beach and Rose McGowan play the best parts and are great at their acting job. You would never be able to guess who the killer is. I gave this movie a 9, because at some parts Adam Beach needs to speak up a little so you can hear what he's saying.9/10","I was fortunate enough to see The Last Stop here where I live at the Moving Pictures Film Festival (for those of you that don't know, the Moving Pictures Film Festival is a tour of Canadian made film in Canada). I was told just before the movie started that it was the world premiere and that it was on the verge of getting an American distribution deal which added to my excitement.I'm a big horror movie fan, and yes, I love the Scream trilogy as well. So when I found out that Rose McGowan was doing a Ten Little Indians type of movie I knew that I was in for a treat. Rose McGowan was the biggest name actor/actress at the entire festival.The best way I can describe it without giving away too much of the plot is that it's not quite like Scream. And it certainly is worth seeing. It's set in the middle of a snowstorm (it was filmed in Vancouver, B.C., Canada) at a mountaintop motel, which adds to the suspense. Rose McGowan puts in a great performance as the-girl-next-door(?!) along with the rest of the cast. And as for what happens at the end, well, the only thing I'll say is that you'll never guess the ending.Sadly, it probably won't make it into mainstream North American theatres because the only decent money maker in it is Rose McGowan. But if you get the chance to see it I would recommend you do. And if worse comes to worst, there's always video.I gave it a 9 out of 10.","At the time I posted this, 4 people in the comments section for \"The Last Stop\" saw the movie specifically because Rose McGowan was in it.Count me as the fifth.  Rose is a pleasure to watch in everything she does! The movie itself wasn't much to write home about.  Some posters complained that nobody in the production had any idea what a snowstorm was.  During the scene when they were attending to the injured Adam Beach character (who was shot and bleeding) all I could think about was ... close the door, it's freezing cold outside!Rose has a couple of good scenes in the film - one of them in which she has an entire dialog with herself completely wordlessly, but we know exactly what she's thinking - this demonstrates that she has talent (as do some of her better films such as Jawbreaker, Scream, Devil in the Flesh).  If she can get some better scripts, she'll go far.DVD Note:  For Rose McGowan fans, Rose's interview on the \"The Last Stop\" DVD is worth the price of renting/buying the DVD, even if you hate the movie.","I first wanted to see this movie because I am a huge Callum Keith Rennie fan. Rose slows this movie down with her really bad acting. The story line is good, although you can tell from the very begining that the snow is fake And they never act as though they actually are cold. Rennie of course does a good job, but the characters are never fully introduced and when the past does come up it is badly done. They never make you actually feel for the characters because you dont actually know anything about them, even the main character. All you really know about him is he is a cop and dated Rose's character. If you are a Rennie fan you should watch it.","I own this movie and I love Canadian Movies but hire an actress like Rose I don't understand.She is completly useless in this movie just a name that's all.The rest of the cast is good,good enough to make this little thriller work.I was surprise  by the plot which is not the first time it was used.But those unknown actors did very well even Jergen,I'm not a big fan of his but I liked him in this movie.If you got the chance to see it go for it.","this attempt at a \"thriller\" would have no substance at all! Some may state that this movie \"has it all?\" Autism, arson, robbery, lost love, a bag of money, cut throats, murder, blood, a snub nosed revolver, clenched teeth groaning, boobs (various definitions can be used), large flashlights, tribal people, a brother duo attempting to out-portray \"dumb and dumber,\" white wolves, fight scenes that resemble \"happy slapping,\" snow mobile(s), a large tracked vehicle, and a motel under renovation? All this, with an \"Enyanesque\" melody toward the end ...Perhaps my rating is a bit harsh, but one viewing will certainly be enough for the sane cinemaphile with nothing else to do. Yeowza!","I only got this movie for Rose McGowan and, as usual, she does not disappoint.  The rest of the movie was eh, but for a Rose fan, she is good enough to make the dvd well worth the price.  There is this wonderful scene where she has an entire conversation with herself that is just priceless to watch.  THAT alone was worth the money to me.","The plot starts out interesting, however, towards the end too many die in too short a time, turning the thriller-mystery aspect of the story into a slaughter.The only true highlights were Adam Beach and Jürgen Prochnow, who were once again their excellent selves. Nice try with an inappropriate last third, though a good ending.","Please, do not watch this movie based on the comments of others on this site.  Two of them are biased(and rightly admit it) because the movie was filmed in their neck of the woods.  The others are from California and Texas and have no clue as to what a snowstorm is.The acting is just down right horrible, half of the characters are just fill ins added for supposed suspense purposes and none of them have any knowledge about snow.  The main character, who we are led to believe has lived in Colorado his whole life, spends the majority of the movie outside, in a blizzard, WITHOUT A HAT including a ride on a snowmachine.  Now, anyone who has lived, or even been involved in any type of snow related incident, knows that you can not survive outside without proper attire.  Proper attire being a hat.  Obiviously, the staff of this movie has never heard of hypothermia. And to take off at top speed on a snowmobile without proper head gear? The only one who does where a hat, is the mentally handicapped character. Tell you something.The director then creates the main character as being superhuman.  He gets shot,(to me it looked like in the ass) gets hit by a snowmachine, the whole hat fiasco and at the end gets told, \"You'll be fine in a couple of days.\"Granted, this movie did have me guessing but my guesses were of the intelligent nature.  It will leave you asking questions till the end but then make you question just why you bothered to watch this in the first place.  If there's one thing I remember learning in highschool drama it's don't insult the intelligence of your audience.   Something people involved with this picture never bothered to learn.","The Last Stop is a Fun and Thrilling movie.  It's about a group of people that get trapped in a motel in a snowstorm.  And one of them is a killer and he or she will kill to get out of the motel and get away.  I give the movie 10 out of a 10.  The movie stars Rose Mcgowan & Adam Beach."],"review-user":["Elynitthria","Eyeliner","movigrrl","Memlets","LuisitoJoaquinGonzalez","claudio_carvalho","maitreg","maralex","Sprites","Darkest_Rose","uncmisterpink","NateWatchesCoolMovies","dmerrim","rmobsessed","Juderio","Sirena_88","10 96","jtamburi","Windhover","zoltar55","THX-1138-2","anyasnecklace","epevae","misc76","grampa-3"],"review-date":["29 June 2008","2 November 2002","22 March 2000","12 October 2000","27 February 2005","9 February 2007","4 April 2001","16 May 2001","24 June 2000","11 December 2002","6 February 2002","12 May 2016","19 June 2000","31 October 2000","18 March 2002","10 August 2001","5 March 2000","27 November 2002","10 October 2002","18 June 2001","12 March 2007","9 August 2003","10 December 2002","24 March 2001","6 June 2000"],"review-rating":["9","9","7","4","6","6","8","2","8","1","10","9","9","7","1","8"],"review-title":[" sort of beautiful\n"," The Last Stop... welcome to the dead of winter\n"," My biased comments\n"," A good little mystery\n"," If you liked Identity this should be right up your street...\n"," Awful Screenplay\n"," Pleasant surprise\n"," A nice way to pass the time\n"," Adam's great, but the movie itself....\n"," Quite a Good Thriller\n"," Pretty awful, even for 2 am television\n"," Agatha Christie in a snowdrift\n"," Who financed this mess???\n"," Just An Amazing Mystery Flick -- With A Bite!\n"," A great film with suspense and excitement.\n"," Surprisingly Good\n"," A fun mystery movie.\n"," Rose McGowan\n"," it was ok\n"," Good thriller\n"," If it wasn't for the snow ...\n"," Rose, Rose, and Rose\n"," A last stop indeed\n"," Stupidity in a snowstorm\n"," Fun & Thrilling\n"]}