{"review-url":["http://www.imdb.com/title/tt0174163/reviews"],"review-text":["\"The Restless Ones\" was one of the films produced by the Billy Graham Organization. It still occasionally plays on TV. Though it may seem easy to laugh at it, it's a sincere effort for it's time. The acting by Johnny Crawford, Kim Darby, and the rest of the cast is good. The religion issue is first and foremost here, but again, this IS a Billy Graham production. He makes one of his customary appearances at a rally in the story. One problem though, the fate of Kim's character is left up in the air. This seems more like a film these days would end--but not one from 1965. Maybe it was the first of the \"Draw-your-own-conclusions\" school of film-making.","Johnny Crawford is great in this movie of a troubled teen coming of age in a generation that was in the middle of a cultural and spiritual upheaval. Billy Graham does a good job of portraying life in this sweet, sometimes corny, but all the way sincere flick. He gives us a look at not only the social scene but gives good, solid advice that holds true today about morals, decisions, the generation gap, teen dating, (some of the statistics that are given in this movie are astounding. They sound like today's stats). Just to see Billy in his younger days is worth seeing. It's an awesome movie. It made me realize that human nature does not change, even though hair, fashion and language may change, humans are still struggling with the same issues they have been struggling with for thousands of years.","On November 21, 1969, I accepted Christ as Savior after seeing this film. The incredible thing is, I don't think it is a good film. I was unable to figure out the plot, but I went forward when they gave an invitation at the end. Fortunately, the need for Christ was made clear enough for me to understand, and I was moved by Billy Graham's preaching in the film.Later, I bought the book, and then I was able to figure out what they were trying to say. We showed the film at my church, and I was surrounded during the showing by a crowd of teen-agers who needed me to explain the plot.The fact that I got saved at a film like this shows that God can do anything.","I saw this movie as part of a Billy Graham program. The church I attend was part of a community wide outreach to present God and Christianity to our community (Hartford, Ct. USA). I was one of the counselors who helped attendees (who were invited to come forward and make whatever kind of religious profession they wanted...and to follow up on them after the movie. As such, it did what it was supposed to do, and I personally found it to be a medium to strengthen my faith in God.I also found it to be very helpful to those I counseled. I especially like the work of Kim Darby in this movie. And the parents (the Wintons?) were , in a way, a little overdrawn....no one says to their child if they think that he or she may be the parent of an illegitimate child something like the Wintons did \"oh, no, no, not thaaat.\" That isn't exactly what they said, but the sympaathetic audience I saw had a laugh at whatever it was they did say, and also at the son's emphatic \"No, MOm, not me.\" Don Berghuis","Hilarious, totally campy Christian gem produced by the Rev. Billy Graham himself -- I can't believe this isn't a classic. Like a tract committed to celluloid. The Wintons praying in the car has to be among cinema's most unintentionally hilarious scenes.","Billy Graham's World Wide Pictures adroitly tailors its message to the restless 1960s with this drama about delinquent youth in stark black & white with a feverish bongo jazz score by Ralph Carmichael (which later largely gives way to wholesome gospel songs) patterned after 'Blackboard Jungle' and 'Rebel Without a Cause' (and actually shot by the latter's veteran director of photography, Ernest Haller). Some of the dialogue is in places pretty sharp; but the basic message remains entirely unchanged from World Wide's fifties films.Billy Graham is as usual eloquent while actually saying very little. Far and away the best acting in the film comes from Robert Sampson, who manages to deliver with real conviction two potentially excruciatingly pious speeches (the first of which is a one to one with God Himself with a tear rolling down his cheek); although he and Georgia Lee resemble Johnny Crawford's elder siblings rather than his parents. The film's other outstanding performance is by a very young Kim Darby, whose character - and even her eventual fate - remains strangely undeveloped; as if the film's makers decided she was beyond redemption and just discarded her."],"review-user":["phillindholm","freeone77","Threeofu","dl-berghuis13","Nameless_Numberhead_Man","richardchatten"],"review-date":["22 August 2005","8 January 2005","22 April 2006","20 April 2004","25 March 2001","15 June 2017"],"review-rating":["6","7","5","4","8"],"review-title":[" Sincere, if dated melodrama.\n"," This is a sweet little classic\n"," I accepted Christ at this film\n"," This was not intended to be a classic, but a medium for God\n"," The 'Reefer Madness' of Christianity\n"," That Age Old Battle Between Christ and Self\n"]}