{"review-url":["http://www.imdb.com/title/tt0166219/reviews"],"review-text":["\"Hoods\" doesn't deliver the goods. This half-baked mafia comedy boasts a stellar cast, including Joe Mantegna, Kevin Pollack, Joe Pantoliano, Jennifer Tilly, and Seymour Cassel, along with a number of faces familiar to those who watch crime movies, but it is truly a misfire if there ever was one. Writer & director Mark Malone, best known for writing \"Dead of Winter\" for \"Bonnie & Clyde\" director Arthur Penn, has penned up a pedestrian potboiler that has an ailing but vengeful mob boss Louie Martinelli (Seymour Cassel) dispatching his son Angelo (Joe Mantegna of \"House of Games\") to whack Carmine DellaRosa. It seems that a rival mob fire-bombed one of Pop's warehouses (in the opening scene) and Martinelli wants payback. Trouble is that nobody has a clue as to who Carmine DellaRosa is. In any other mob comedy, such a complication might be amusing, but here is just plain flat. Angelo and a carload of wiseguys, including his best pal Rudy (Kevin Pollack of \"Deterrence\") spend half of the time trying to find out who Carmine is. Neither Rudy nor Angelo want to perform the hit, so they track down a crazy mob hit-man Charlie (Joe Pantoliano of \"Bad Boys\") to do the dirty deed. Before they can convince Charlie to make the hit, they have to locate him, and Charlie's slutty wife Mary (Jennifer Tilly of \"Bound\") reveals that he is locked up in a mental hospital. Our misfit heroes cruise out to the mental hospital and break Charlie out. About half of the movie is over before they discover that Carmine is a kid in short pants (Vincent Berry) who is bland and harmless. Indeed, Carmine has the only decent line in the movie. As our brainless bunch of heroes wheel away from his house with him in the backseat to take care of business, Carmine warns them that they need to get him home in time or his father will kill him. Charlie tries to ice the urchin but he cannot. Instead, he reconnects with his feelings and wants to go back to the mental hospital so he can report the good news to his doctor. Meanwhile, after Charlie decides not to shoot Carmine, the kid gets his paws on the pistol and pops off several aimless rounds. Angelo and he struggle over the automatic. The pistol slips out of their collective hands and hits the ground, goes off, and blows a hole in Rudy's chest. Now, keep in mind that Rudy never wanted to shoot the kid in the first place, and Angelo and he argued over the wrong-headedness of the hit. So Rudy winds up on the ground with a fatal wound, while Angelo struggles to stop the bleeding. Talk about a dull death scene. Angelo is conflicted himself because his father ordered the hit and Angelo fears that dad will do him in if he doesn't execute orders. There is a flashback subplot about Angelo's father teaching him how to handle a gun that provides some insight into Angelo's reluctance to pack a gun.There is nothing remotely redeeming about this depressing comedy with a downer of an ending. Things gets worse, and if you last through this 90 minute nonsense, you'll see what I mean. The comedy is largely laugh-less. Good actors wallow in sketchy roles that aren't even funny. Perhaps director Malone was trying to do another comedy like \"The Gang That Couldn't Shoot Straight.\" If he was, he missed by a mile. Big-breasted Jennifer Tilly shows cleavage and snarls through a couple of scenes with Mantegna, but she doesn't do much of anything else. She's the stereotypical slut who doesn't even get naked. A paycheck is the only way to explain the presence of such a talented cast, otherwise this picture is pathetic from start to finish. Initially, I had hoped that this might be a \"Ransom of Red Chief\" knockoff where the kid drives the wiseguys nuts, but no such luck here. Of course, the biggest surprise is that they have to kill a kid, but it's not the kind of a surprise that makes you want to watch it up to its resolution.I actually bought this movie on a Canadian DVD labelSevilleand it contains only the most basic special features. If you hate previews that give away the plot, don't watch the trailer. If you ever meet Joe Mantegna, one of your first questions should be why he helped to produce this yawner. It is neither hilarious nor dramatic. There are no quotable lines, and none of the characters stand out as either interesting or sympathetic. The Seville DVD presents the movie in full frame with no subtitles or closed captioning.","I happened to stumble upon this movie by accident one night while I was flipping through the channels and I got caught up in the film right from the very beginning. It looked like it was going to be a good mafia/comedy film full of surprises and humorous plot twists and I got what I expected for the first hour. Then, the film went totally downward and decided to change from an entertaining and interesting comedy to a tragic drama filled with sorrow and a few un-answered questions. The acting was fantastic. Kevin Pollak was the scene-stealer as a mafia hitman opposite Joe Mantegna, who was equally good. You can't blame the actors because they all were good. Joe Pantoliano portrays an insane hitman who \"HATES FRENCH CIGARETTES AND FRENCH MODEL AIRPLANES\" and it is a remarkable performance. However, the last half hour began to get worse and worse every minute because it never got back to the subplots of the coffee shop owner who wanted to \"trouble\" his competitor by using his mafia pals and the tobacco shop owner's son who was brutally assaulted by a hitman because the son accidentally bit the hitman's crotch. What happens? You never find out. Maybe in a sequel? I doubt one will ever exist because no one really cares about this movie. After seeing the whole thing, I can understand why. Best Scene: A hitman walks up to the godfather and says \"I quit\" and the godfather begins to swing his arms around in a circle and pushes them in the hitman's face and says \"OOOH, The hitman burns!!!\"","is forced to conform to 90 minutes TV time. Marvelous cast of tremendous talent and a script that starts out with great potential. I really enjoyed the first 65 minutes and then someone fired the writers and a very engaging member of the cast was bumped off by a dropped gun. Cm'on, H-wood, you don't get that many good scripts so don't screw up a rare one that has quality possibilities.","I just called my brother Paulie on the phone and he said he was watching Hoods and it was funny. So, like I said, never go against the family! The demand for more lines is OK since I like to express my own opinions quite frequently. If something is misspelled it's most likely my eyesight and not my brain. This gives me yet another chance to take my shots at \"The Departed\". When one knows exactly what is going to happen in the last scene with no prior knowledge, that usually means it wasn't all that suspenseful. All you need is a good directer,the same guy I believe who did my favorite mob movie, \"Goodfellows), but in a completely different way.And then just throw in Jack the great and you got yourself an Oscar. Easy as pie. I have to see hoods to make sure it wasn't better than \"The Departed\" Gibbs"],"review-user":["zardoz-13","MovieMan-112","wheels-2","Gibbs52"],"review-date":["18 February 2005","28 May 1999","1 March 2001","4 February 2008"],"review-rating":["1","10"],"review-title":[" \"Hoods\" doesn't deliver the goods.\n"," A film that builds itself up for greatness only to become a BIGTIME disappointment\n"," This is what happens when a potentially GREAT flick....\n"," Don't mess with the Family\n"]}