{"review-url":["http://www.imdb.com/title/tt0107206/reviews"],"review-text":["'In the Line of Fire' is one of those Hollywood films that shows up on tv quite a bit, but although I've seen it a few times, I usually end up sitting through the whole thing again. Why? - It's GOOD!   Clint Eastwood is great as usual, and the character he plays is interesting and more fleshed out than usual. The character, Secret Service agent Frank Horrigan, is haunted by the fact that he was on the detail that failed to protect President Kennedy in Dallas, and now he's forced to match wits with a professional assassin that is openly declaring that he will kill the president. However, the film doesn't make him a depressed, brooding, and obsessed character. He's charming and personable, and is realistic as a guy that has experienced a lot in life and is comfortable in his own skin. He's even quite convincing when he flirts with the pretty younger agent played by Rene Russo. The killer, played by John Malkovich at his best, is cerebral, deliberate, and enjoys playing high stakes games of life and death. He even goes by the name of another presidential assassin, John Booth.  The film is consistently enjoyable, and it delivers all the goods - suspense, action, romance, and drama - all in their proper amounts. It's a fun film that is really helped by the great actors in it!","Clint Eastwood scores big in this thriller from 1993.Teamed with an absolute master of edge of your seat suspense,Wolfgang Peterson, Eastwood delivers as only he can.Also,John Malkovich goes on my list of most effective screen villains in the history of cinema as the demented assassin.As for Rene Russo as Clint's love interest,I think Kirk Douglas said it best when he said,referring to his own career,\"I keep getting older,and my leading ladies keep getting younger\".This film is a very effective thriller with enough plot twists and surprises to keep you going.Eastwood and Peterson should team together more often. Top notch movie.","Quite simply a well-made, well-written and wonderfully acted movie. Eastwood is classic as grizzled Secret Service Agent Frank Horrigan and Rene Russoholds her own as partner (and love interest) Lilly Raines. But the movie'sgreatness rests on the shoulders of John Malkovich as \"Booth\". He capturesthis character's rage and hatred, as well as his humanity oddly enough. Personally I think this was his best performance and should have received anOscar for it (But I loved Tommy Lee Jones in The Fugitive as well that year). Overall a great movie to see you want to peek into an assassin's mind and beon the edge of your seat the whole way through. Enjoy!!","In The Line of Fire gives us a great game of cat and mouse.  Clint Eastwood is plagued by John Malkovich in this riveting film.  Malkovich says he's going to kill the president, and he purposely calls Eastwood, and pushes his buttons.  He questions Eastwood's ability to protect someone.  Malkovich brings a cold, but very intelligent mindset to his character.  Everything he does, he does for a reason, and he's not shy about killing.  Eastwood has to overcome the suspicions of his superiors in order to catch Malkovich, but no one wants to listen to him.  The result is a film that crackles with suspense that escalates to a tense scene in a ballroom at the Bonneventure Hotel.  Wolfgang Peterson ratchets up the tension and we feel every turn.","This is another of Eastwood's many movies mixing intrigue, action, and a dollop of romance, along with \"The Gauntlet,\" \"Firefox,\" and so forth. Clint's acting range by now is pretty familiar. In this one, he's taciturn and a bit outrageous, especially with women and superiors. There are no surprises in his performance. But the film itself is something of a surprise; it's above average. Clint is Frank, a Secret Service agent who, perhaps in a moment of doubt, failed to catch the bullet that killed JFK. He then took to drink, which drove his family away, and now plods along in the bureaucracy until he is contacted by John Malkovitch, calling himself \"Booth,\" who strikes up a sort of skewed relationship with him based on their shared, disillusioned conviction that everything is meaningless except the impulse to escape dreariness and predictability. Now, this is rather an anfractuous set of attitudes for a performer like Clint to project, but he does rather well, less robotic than usual. And he does seem to carry around with him, like a burden of stone, the memory of that moment in Dallas. He's tested again halfway through this movie. He is hanging from the roof of a tall building, grasping Booth's hand, and he pulls his pistol and points it at Booth, who asks him if he is really willing to shoot. If he does, of course, he saves the president from an attempted assassination by a CIA-trained murderer, but he does so at the cost of his own life. Booth twits him about the situation as they hold hands in midair. Later Clint even has a short speech, talking to Renee Russo, about his failure to save the president in Dallas. \"If I'd have reacted quickly enough, I could have taken that shot . . . and that would have been alright with me.\" It's underplayed, but his voice chokes slightly, his eyes water, and his lip trembles. It's one of the few scenes in any of Clint's films that might properly be called \"moving.\" We know from his newfound resolve that given another chance he would take the bullet this time. (The irony is that he doesn't like the current president. Who could? He gives pompous speeches in Colorado about how they \"carved a nation out of the wilderness.\" Didn't they do the same thing in Las Vegas?)It's often said that a movie is only as good as its villain. It isn't true, nothing is that simple, but an argument could be made for its truth value in this case. The reptilian John Malkovitch with his Tartar eyes is marvelous.Talk about disillusioned. Okay, he can ham it up a little, sniffing with disdain even as he plugs two innocent hunters between the eyes, but he's fascinating on the screen. Renee Russo has little do to. Fred Thompson, as the chief White House aid, is now back in politics, a relief for movie-goers. If Clint's acting range is limited, Thompson's is something less. In every film he's been in, he wears the same solemn and dissatisfied expression, as if constantly plagued by some form of volcanic digestive disorder.The direction by Wolfgang Peterson is as good as it was in \"Das Boot,\" which is pretty good. There is a great deal of the usual suspenseful cross-cutting in the final shootout. And when Clint and Russo fall into an impassioned embrace in her hotel room and scuttle backwards towards the bed like two weasels in heat, Peterson playfully shows us their feet along with a succession of objects dropping to the floor -- not only the usual garments but handcuffs, guns, beepers, palm pilots, Dick Tracy wrist watches and other impedimenta. Interrupted, Clint lies back on the bed and sighs, \"Now I have to put all that stuff back on again.\"Well written and worth watching.","Frank Horrigan (Clint Eastwood) is a secret service agent plagued with guilt over the assassination of President John F. Kennedy, while he was on duty. Thirty years later and the current president is entering a re-election campaign, but he is receiving death threats; and Horrigan has been called in to assist in what should be a routine research operation. John Malkovich plays the professional assassin and master of disguise who is tracking the president, and using the past he begins to torture Horrigan in a psychological duel of cat and mouse.Malkovich, Eastwood and Rene Russo all give wonderful performances in this top notch thriller. The direction is excellent and the entire picture is charged with tension and intrigue throughout.A must see for thriller fans 8/10","Clint Eastwood could do no wrong in the early Nineties.\nHot on the heels of Unforgiven, he teamed up with The Perfect Storm director Wolfgang Petersen for one of the best thrillers of the decade - In the Line of Fire.Imagine a cross between The Day of the Jackal and The Bodyguard and you get the idea. Hollywood's craggiest leading man plays Frank Horrigan, a troubled bodyguard assigned to protect the US president against a psychopathic assassin.\nJohn Malkovich delivers a stunning performance as the man on the end of the trigger and acclaimed German director Petersen directs with such skill, Eastwood even asked his advice when he came to direct A Perfect World.\nClint was 63 when he made this and brought a lifetime of experience to the role of a world weary Secret Service agent haunted by the fact he failed to save President Kennedy from the fatal bullet. The clever use of a doctored photo by Hollywood whiz kids shows the actor/director stood at the side of JFK. A nice touch which is well worth looking out for.To be honest, ITLOF is a cliched thriller, the sort of story which crops up most weeks as a glossy, no brain offering on Channel 5.\nHowever, both director and stars took the well worn material and gave it a fresh spin, upping the tension several notches with each passing scene, resulting in a spectacular finale which is great value for money.Rene Russo is so good she could play the part in her sleep. The former model adds a degree of mature charm to her role of an agent who Horrigan believes is mere `window dressing' for the department.As with all of Wolfgang's movies, believability is everything. A rare degree of authenticity was achieved during the crowd scenes when the German film-maker integrated his fictitious President with the crowds from the Clinton and Bush election campaign. The cost? A cool $4million.The script had been knocking around Hollywood for a decade before it was dusted down and given a green light. It was originally to star Dustin Hoffman (who signed up for Petersen's follow up, Outbreak). British director Michael Apted (The World is Not Enough) was due to direct the Hoffman version, but when David Puttnam took over as the head of Columbia in 1987, the movie was put on hold.Producer Jeff Apple (a man more known in the trade for his interactive shopping shows than films) brought in Jeff Maguire to polish up the script.The idea of Horrigan as an agent who failed to stop JFK's untimely death gave the movie a twist that Hollywood execs found delicious.Before long, there was a feeding frenzy over the new, improved script and eventually, Rob Reiner's Castle Rock company snapped it up for a million dollars with Clint Eastwood on board.Petersen had wanted Harrison Ford, but eventually cast him as the President in Air Force One (which you may remember was the film of the week a couple of weeks ago).As any Clint fan knows, he's a jazz fan - a passion shared by Horrigan in what seemed to be a tailor made role adapted for old Mr Squinty after he signed on the dotted line.However, Frank's love of piano and jazz was already on the page - a happy accident which helped turn Horrigan into one of Clint's most likeable big screen characters.Top drawer stuff.","A great performance by Clint Eastwood and particularly John Malkovich in my opinion his finest one to date. Malkovich had this one nailed right down to the floor it's incredible. Eastwood is Agent Mike Horrigan, an aged and cynical Secret Service Agent who is finishing out his career busting counterfeiters and chasing down routine assignments. But one assignment which appears to be run of the mill at first turns complicated and deadly serious. Horrigan and his new partner Al are sent to investigate a threat on the President by a \"wacko\". As fate would have it Horrigan has stumbled not upon a delusional nut but a professional lone wolf who has a big bone to pick with the White House. As Horrigan dives deeper into \"Booth's\" world he attracts the bad guy's unwanted attention and unbridled admiration for him. Horrigan was JFK's top agent and present in Dallas, Texas when he was assassinated and blames himself for what happened. Now he feels it's up to him to stop the current Head of State from joining the list of dead Presidents. But this killer has turned the tables on Horrigan and now he's the hunted one in a life or death cat and mouse game. Who will win? Who will die? It's a race against time to save the Pres from a chameleon-like enemy who can get to anyone. My favorite Secret Service movie and as good a nail biter as any.","\"In the Line Of Fire\" is an expertly crafted thriller that has a fantastic climax. The film starts building suspense a half hour into the movie and it doesn't let up until the final scene. Clint Eastwood does exceptional work as does John Malkovich as the villian, the rest of the cast turns in good performances as well. Director Wolfgang Peterson knows how to build suspense and he does it extremely well, he also directed another top notch suspense thriller \"Air Force One.\"","'In The Line Of Fire' tells the story of the game between an old presidential bodyguard and a former-government assassin turned psycho. The secret service agent/bodyguard (Eastwood) is on defense and the assassin (Malkovich)is on offense. The stakes? The president's live.I really like this movie...I've seen it numerous times on TV and have recently bought it on DVD. Yet, it's not an excellent movie. The plot is way too thin and the attempts to thicken it are downright ridiculous. The whole love-story isn't very plausible and the way they brought an extra character into the story, just to be able to kill it off is kind of insulting to the more or less intelligent viewer. Though I feel these mistakes can't be forgiven, I can easily look past them to Mr. Malkovich exquisite performance. I've always deemed him to be a great actor but in this movie he's really on fire. There's a reason why he got an Academy Award nomination. Rene Russo and Clint Eastwood were okay, but I don't deem their performance to be memorable. They're never at the best of their abilities.If you don't expect too much, you'll certainly like this movie. It's no masterpiece but John Malkovich is really extraordinary and I don't think anyone can't enjoy his performance. Really worth the watch...","Back when I was working person, I remember having a really obnoxious client to deal with who insisted on making everything on a personal basis. I was telling him things that my agency could do and could not do and he firmly believed I was personally out to do him out of what was rightfully his. I swear but I was thinking of this guy as I watched John Malkovich and Clint Eastwood in their battle of wits.In The Line Of Fire casts Clint Eastwood as a veteran Secret Service Agent who was on the job in Dallas as a young man when John F. Kennedy was assassinated. He's had his doubts ever since and been given to drink and his life at one time was a real shambles. He's gotten back on the White House detail now and when a potential assassin's landlady rats on her tenant to the Secret Service, it's Eastwood and partner Dylan McDermott who draw the case.But the assassin is no ordinary crank case. He's a professional at his job, trained by and used by the Central Intelligence Agency. John Malkovich earned a deserved Academy Award nomination for Best Supporting Actor. He lost that year to Tommy Lee Jones for The Fugitive and I'm not sure, but that I thought Malkovich was better.Oddly enough Malkovich might have been better off, but he saw Eastwood as the agent in charge breaking into his apartment while on the job and he insisted on making the whole thing personal. He calls Eastwood throughout the film and taunts him. And after a while what Malkovich says and does causes Clint to get real personal. The presidential assassins we've had in our history have been lucky amateurs, unless you believe in some of the conspiracy theories about some of the assassinations. A guy like Malkovich, a professional with a real or imagined grudge, is the most dangerous kind of foe.Others to note in the cast are Fred Dalton Thompson as the White House chief of staff (and would be president in real life), Rene Russo as another agent who falls for the Eastwood masculine charm, John Mahoney as the Secret Service head, Gary Cole as the White House head Secret Service guy, Gregory-Alan Williams as another agent and Jim Curley and Sally Hughes as the President and First Lady.But when Malkovich is on he owns In The Line Of Fire. The climax with him and Eastwood is unforgettable.","Here's another entertaining Clint Eastwood action-suspense film. I am not a particularly fan of his but I have to hand to him: he knows how to make entertaining movies. This is one more example. It didn't hurt, either, to have John Malkovich as his co-star. Now there is an intense actor! In this story, Malkovich plays an assassin, and he is fascinating to watch, thanks to his different disguises and the terrific dialog he was given. He also has a interesting voice.Rene Russo is fairly low-key (for her), but that's fine and Eastwood plays the usual loner-cop role, not appreciated by his superiors but showing them all up in the end. I guess he couldn't stop playing the \"Dirty Harry\"-type figures, but he played them well.There were some negatives this film, however, namely: credibility in parts as there were a couple of times, had this been real-life, the killer would have done away with Eastwood. The climatic scene, in particularly, had too many holes in it. There also were too many abuses of Lord's name in vain in here.Overall, however, this is good, escapist fare.","IN THE LINE OF FIRE, in my opinion, is an excellent, suspenseful, and edge-of-your-seat action/drama/thriller! I thought that Agent Horrigan (Clint Eastwood) and Agent Raines (Rene Russo) looked good in the attire they wore at the presidential dinner. As for Leary (John Malkovich), he was a sick man who loved to toy with Frank by phone. He looked good in the tuxedo he wore near the end of the film, though. One thing that surprised me was the growing attraction between Agent Horrigan and Agent Raines. Before I wrap this up, I'd like to say that the entire cast and crew did an outstanding job, I loved the setting, and I couldn't get enough of it. Now, in conclusion, to all you Clint Eastwood fans who haven't seen this excellent, suspenseful, and edge-of-your-seat action/drama/thriller, I highly recommend it.","IN THE LINE OF FIRE (1993) ***1/2 Clint Eastwood, John Malkovich, Rene Russo, Dylan McDermott, John Mahoney, Gary Cole, Fred Dalton Thompson. Absorbing cat-and-mouse psychological action/thriller with Secret Service agent Eastwood tormented by sociopath Malkovich who plans to assassinate The President of The United States.  Swiftly directed by Wolfgang Petersen and compelling performances by the leads makes for an affectively entertaining experience.","\"In the Line of Fire\" is a taut thriller, featuring performances by two different types of great actors.Clint Eastwood is the seasoned star of action vehicles, working his screen image in a way that makes it seem impossible that anyone else could have played crusty Secret Service Agent Frank Horrigan. (Yet several other actors were considered for the part before him, including Robert Redford.) Eastwood, who is now in his late 80s, was a virile 63 when this picture was released, and still believable as the love interest of younger co-star Rene Russo.The biggest plot hole – if one can call it that – is that everybody wants Frank off the case because he is, as his boss says, \"too old for this sh*t\". Even his girlfriend seems only to want to keep him around because she feels sorry for him. Nobody except for the wiretapping technicians seems to recognize the fact that since the self- proclaimed assassin keeps calling Frank, his presence somewhere in the vicinity is indispensable to protecting the president.In one of his more accessible and memorable screen performances, veteran actor John Malkovich plays Mitch, a villain whose intensity makes you believe he is capable of anything. Although he has been in over sixty movies and TV productions, most moviegoers have probably seen Malkovich rarely, usually in supporting or even cameo roles. He is almost anonymous despite having appeared in such popular movies as \"Con Air\" (1997) and the eponymous cult film \"Being John Malkovich\" (1999).There is a scene in which Mitch meets two hunters who see too much, and right before he kills them Mitch confesses that he plans to assassinate the president. \"Why would you want to do that?\" asks one of the hunters in stunned horror. It does not matter what these men think of the president, who is portrayed as a vapid chameleon. This movie belongs to a quaint time when the idea of assassinating any president of the United States struck the overwhelming majority of Americans as plain wrong even if you thought the occupant of the White House was an execrable son of a bitch.","Yes, an excellent thriller, with Malkovich absolutely brilliant again.Yet again though Hollywood have plonked in an unnecessary romance storyline, which although doesn't ruin the film, doesn't do it any favours at all.Like 'Good Will Hunting' & 'Sphere' this has a romantic sub plot which lessens the quality of the film, but also is almost laughable with the age gap.Yes Clint is cool and an icon for anyone. But I promise you, any girl in her 20's or 30's, may have at the most, thought him attractive a few years ago, but is repulsed by the thought of sleeping with him. The bedroom scene was almost cruel to watch & reminded me of a wildlife documentary, it was that embarassing to view.Despite that, 'In The Line Of Fire' is a very good film, and one of the few, where every single scene in it, contributes to the storyline & quality.7/10","This movie kept my interest but in the end there was no heart in it.  Going through the motions. Immorality of trained government assassins versus morality of \"just doing my job\" to protect life. Impressively evil character.","As much as I like Clint Eastwood I have to say this was not his finest hour. This film was filled with way too many mistakes that also took one too many liberties with the facts. Clint Eastwood plays Frank Harrigan a Secret Service agent that at one time was assigned to protect President Kennedy. When President Kennedy was assassinated frank felt he did not do his duty by protecting the President and has carried the guilt ever since. Now 30 years have passed and Frank Harrigan is still a Secret Service agent again assigned to protect the President, and this time he will not make the same mistakes. Here is the first problem I have with this film. Frank had a lot of health problems being an old man now, and at one point while running along the President's Limo he can be seen coughing and gagging barely able to keep up. Now do you really think that such an old tired sick man would be allowed to protect the president? I don't think so. The second problem is Rene Russo's character as Special Agent Lilly Raines. She serves no useful purpose except to look sexy for the camera, and there is even an absurd scene where she is on duty in a tight dress (which the secret service would have never allowed) and Frank asked here where her gun is hidden and she replies, \" Wouldn't you like to know.\" Give me a break. Of course we know there will be an attempt on the President life in which sick tired old man frank with redeem himself.The only standout in this film was the performance of John Malkovich as the would be assassin. Other than that avoid this mess...","A solid if predictable presidential assassin thriller boasting a typically strong performance from star Clint Eastwood. Eastwood plays an old-timer who finds himself in a battle of wits with a much younger man, a psychopath who's planning to kill the president. The running time is overlong but the film plays out in a serviceable, entertaining manner even if it sticks entirely to Hollywood convention throughout. Wolfgang Petersen, a director always more at home at sea rather than on land, displays little enthusiasm for the material but wrings the usual thrills out of the premise, only failing in some ludicrously cheesy slow-motion shots.There are roles for a whole bunch of familiar faces and John Malkovich is allowed to get his teeth into his turn as a psychopath, although it has to be said this is one of the less memorable villains that Hollywood's thrown our way. Watch out for a memorable rooftop encounter and some vintage tough-guy moments from Eastwood.","In the cinema, as in most areas of life, one occasionally comes across some strange coincidences. Two years after \"Dances with Wolves\", one of the two great Westerns of the early nineties, Kevin Costner, its director and star, appeared in \"The Bodyguard\", a film about a former Secret Service agent named Frank who is haunted by guilt following the assassination attempt on President Reagan and who now has to try and prevent another assassination. A year after the other great Western of the early nineties, \"Unforgiven\", its director and star Clint Eastwood appeared in \"In the Line of Fire\", a film about a Secret Service agent named Frank who is haunted by guilt following the assassination of President Kennedy and who now has to try and prevent another assassination.There are, of course, differences between the two films. In \"The Bodyguard\" Costner's character, Frank Farmer, has left the Secret Service and now works as a private bodyguard for a female showbiz star. Eastwood's character, Frank Horrigan, still works for the Service. Whereas Farmer is still a comparatively young man, Horrigan is an elderly man approaching retirement, worried about whether he is still physically fit enough to cope with the demands of the job. (Eastwood was sixty-three at the time). Just as \"Unforgiven\" was Eastwood's final entry in the Western genre in which he made his name in the fifties and sixties, so he seemed to be using \"In the Line of Fire\" and \"A Perfect World\" (made in the same year) as his farewell to the cop thriller, another genre which he had come to make his own in the seventies and eighties.In \"In the Line of Fire\", Horrigan must thwart a plot to murder the current President by an assassin. There is also a sub-plot about a growing romance between Horrigan and a younger female colleague, Lilly Raines. (Rene Russo, thirty-nine at the time the film was made, was often regarded in the nineties as one of Hollywood's \"glamorous older women\", but this did not prevent her from being cast here as the love-interest of a man old enough to be her father).This may seem like the plot of an ordinary political thriller. Although there is plenty in the way of thrills and excitement, it is raised above the level of the ordinary by Wolfgang Petersen's taut direction and by the standards of acting, particularly the duel between Eastwood and John Malkovich as the assassin, who calls himself \"Booth\", after the murderer of President Lincoln. Unlike the real John Wilkes Booth, however, this man is no political fanatic. He is a psychopathic former CIA operative named Leary with no ideological motive for killing the President, who always remains an anonymous figure. (We never learn whether he is a Republican or Democrat, or even his name). Leary's motivation seems to be taedium vitae, a belief in the purposelessness of life and a desire for notoriety at all costs, even the cost of his own life, and he gets a thrill out of taunting Horrigan (to whom he has announced his intention to assassinate the President) and playing psychological mind-games with him. He knows that Horrigan's weakness is his sense of guilt stemming from the Kennedy assassination, and plays on it ruthlessly. Malkovich plays him as intelligent but unhinged, at times insinuating, at others raving, and he contrasts strongly with Eastwood's decent but haunted Horrigan. The result is one of the more intelligent political thrillers of the nineties, on a par with Eastwood's later effort, \"Absolute Power\". 7/10","'In The Line Of Fire' is a film that sounds better than it really is. It has all the prerequisites for an exciting thriller- an oddball assassin planning to kill the President, a Secret Service agent determined to stop him, a long cat & mouse game between them, a beautiful woman the agent has an affair with... all tried and true plot devices. The Secret Service agent, Frank Horrigan, is a hard-headed loner, the last surviving member of the detail that guarded John Kennedy when he was shot and killed. All these potentially exciting elements never really come together, and the film has a cut-and-dried, paint-by-the-numbers feel to it. The various subplots come across as clichéd; for instance, we instinctively know, early on, that Horrigan (Clint Eastwood) will fall out of favor with his superiors. We know he and the beautiful Secret Service agent Lily Raines (Rene Russo), even though she apparently can't stand him, will have an affair. We know the nutcase assassin (John Malkovich) will come within a hair's breadth of killing the President. And of course we know Horrigan will prevent it, on duty or not. Granted, the movie delivers all this competently; Eastwood, as always, is fun to watch and some of his dry dialogue is effective. But an air of the routine permeates the film. There is nothing particularly scary about Mitch Leary; he's more annoying than anything in his phone calls to Horrigan, when he taunts the agent for failing to protect Kennedy all those years ago. Nothing in the film is very subtle or mysterious. It is suggested that Horrigan is too old for his job and sure enough in the next scene, he is running alongside the presidential limo, obligingly huffing and puffing to show his age. The film wants to be a cross between 'Silence of the Lambs' and 'The Manchurian Candidate' but has none of those films' layered textures or rich characterizations. It plays like a decently produced TV movie and, taken on that level, is moderately entertaining.","Wolfgang Peterson's In the Line of Fire is cunning and occasionally a truly white-knuckled ride, even if once or twice we might feel like we've been down similar roads before. How could one not when Clint Eastwood, right after (allegedly) closing the book on his western legacy, likely closes the one on his gritty detective pictures (don't count Blood Work in there). But there's more than that because Eastwood's character, here a hard-bitten, demon-ridden and hard as nails secret service agent, has a slightly charming side to him, even the more romantic side that one never got to see in the pictures where he spouted his trademark lines. There is some complexities going on here that don't rely on just the usual swagger, and it's note-worthy for how such a possibly contrived back story (didn't save Kennedy from being assassinated in 63) is made somewhat believable amidst the rest of his persona, which more than likely hides his wounds- most of the time. Eastwood goes to town to make himself a great presence in the film, however, and under the circumstances the character seems tailor made for him.But there would be the risk of his part in the movie being slightly conventional (we still get the 'Harry' type scenes of him being smarter- and as smart-ass- over everyone else in the room, and being scolded and told to back off by the top brass, here a chief of staff), including here protecting a president that (wisely) we never really see or know at all. Even the romantic sub-plot, which is sort of undercooked if there for some machismo laughs, would make the picture a little sub-par if the other quasi-Dirty Harry aspect didn't come into the picture: an indelible villain. This time there's some extra Hollywood suspense, however brillaintly intelligent suspense (almost smarter than the rest of the movie deserves), with the \"John Booth\" character, played in an Oscar nominated performance by John Malkovich, as someone who's described more as a predator than an assassin. There's ways this could go wrong with the Eastwood character, but Malkovich possibly trumps some of his former villain counterparts by being extremely cool and un-collected (there's that devastating, cringe-worthy scene where he kills the bank teller and her roommate), and as his past is revealed, there's still that element of 'what the hell is with this guy' that keeps the audience and Eastwood's agent guessing and extra paranoid. It's a classic Malkovich performance, quintessentially creepy and always measured in the level of insanity and professionalism.It's also, aside from the conventional points, just a sleekly made picture from Peterson and company, and they come pretty close to the spunky pulp realism of Don Siegel. But Peterson also has a couple of cinematic tricks up his sleeve that had me grinning at times; anytime someone puts in such a blatant but exciting homage to Vertigo- jumping from rooftop to rooftop, hero dangling from the ledge, the 'twist'- it still provides some shivers down my spine. There's also the phone conversations between Eastwood and Malkovich, where we see the depths of the cat and mouse game, probably another kick in the ribs to Hithcock. But in the end, even with all the excitement and brutal danger and crisp formalism in the climax, it's also a characters picture in some ways throughout, and everything is fairly realized to give the audience a fine amount to ponder over, at least in the suspense-movie sense. Eastwod's a great lead, Russo plays the female possible love-interest sincere and mature, and Malkovich is top of the pops. There's also a few notable supporting roles too, and a fine studio score in there. One of the better films of 1993.","There is so much wrong with this movie, I hardly know where to begin! We are supposed to believe that an agent too old for his job, and easily winded, would be employed by the secret service in the first place. After that.....the \"super cop\" stereotypes come fast and furious. Of course Eastwoods character once guarded JFK....and of course, we are told how he was JFK's \"favorite agent\", and we are told how he...of course, took the blame when JFK was found with a girl in the white house. Everyone is here....the psycho ex CIA assassin over acted by John Malkovitch......the \"asshole\" Chief Of Staff who seems to be more concerned with poll numbers than a threat to the presidents life, the lead agent who we are supposed to believe thinks that Eastwoods character is \"over reacting\" to a threat to the presidents life...AFTER he and every other agent have already listened to the psycho's threat on a tapped phone call. And finally......as if we hadn't already figured out the ending 5 minutes into the movie, Eastwoods character ends up saving the Presidents life! By that time, you won't care anyway, because you will be too busy shouting \"bullshit\" at the screen as one unrealistic scene after the other flashes by. Take a Pass...you'll thank me for it.","Even at 62 years of age, Clint Eastwood still has what it takes to be in a successful action thriller such as this. Not only was he in an action movie, he did very well. I really enjoyed the film from start to finish because of Eastwood and the villain played by John Malkovich.This is about an aging Secret Service guy who is haunted by his past. That past urges him to keep the current President safe at all costs with election nearing. Even if that means playing a cat-and-mouse game with someone who wants to kill the President.As I said previously, Eastwood did very well. Even better is John Malkovich. I can't decide on who plays the better villain, Malkovich or Gary Oldman. But anyway, Malkovich is very creepy as the villain.Overall, this is a top-notch thriller. There are plenty of action, thrills, and even a little romance. I rate this film 9/10.","In the Line of FireIt never fails to astound me how a decent premise for a film can be ruined upon execution of it. (pun not intended) This was what struck me about 'In the Line of Fire'. The concept sounded excellent - a grizzled secret service agent (Clint Eastwood), still haunted by memories of his inability to prevent the assassination of President Kennedy is now confronted by another madman (John Malkovich) who also claims he intends to dispatch the current president by force. But of course Clint isn't willing to let Malkovich off the president so easily this time, and becomes even more determined to track down the madman and stop him.But unfortunately, the interesting story didn't turn out nearly as well as an actual film. The film is frequently far too obvious when it should have been much more subtle, when explaining things such as how Eastwood's character reflects on whether he would have been willing to die for Kennedy and Malkovich's character's backstory as to why he wants the president dead so much. These would have worked much better if the filmmakers hadn't tried to beat the audience over the head with these plot points, making them much less interesting. Also, whoever decided to put 63 year old Clint Eastwood in a love scene with 39 year old Renne Russo can only be described as sick and twisted, not to mention the two of them falling in love seems ridiculous due to their age gap. (Clint's best seduction technique seems to be winking every 5 seconds, which gets extremely annoying after a brief while) But apart from the terrible script and oversimplified characters, I was also astonished at for a suspense film how little suspense 'In the Line of Fire' actually contained. Again, the concept of the killer constantly phoning the hero, taunting him with clues and hints as to what he's going to do next must have seemed more original when the film was released in 1993, but for today's audiences, who have seen the concept executed much better in films such as 'Speed' and later 'Phone Booth', it really isn't as interesting as the filmmakers seem to think. And the fight scene at the end between Malkovich and Eastwood was one of the film's greatest letdowns, and seems to mainly consist of rude pushing back and forth. Of course, the absurdly predictable plot leads up to the required happy ending, another eye-roller. Eastwood is completely wasted in the role of aged secret service agent Frank Horrigan, playing off his patented tough guy persona and nothing else. He isn't a complete letdown, but it isn't at all difficult to imagine a more enthusiastic lead for the film. Renee Russo is also given almost nothing to do as the far too young love interest for Eastwood's character, complete with cheesy dialogue (\"I can't believe I'm doing this!\") and all. Dylan McDermott also has almost nothing to do other than yell a lot and look frightened as the necessary young naive partner to Eastwood's grizzled old mentor figure. It's Malkovich as the psychotic assassin who easily steals the film, coming across as genuinely creepy and chilling - his silky voice over the telephone was surprisingly off-putting. Overall, 'In the Line of Fire' comes across as a far too clichéd and predictable weak Hollywood action film and nothing more. There is almost no suspense created in the \"suspenseful\" sequences, and all the \"plot twists\" are far too predictable to ever be enjoyable. There is the occasional good element present (Malkovich's villain is a plus) but overall, there's no real reason to see \"In the Line of Fire\" - there are several other very very similar action movies that turned out much better.-5/10"],"review-user":["mattymatt30","SmileysWorld","RChatterjee81","bat-5","rmax304823","mjw2305","Dodger-9","arthurclay","claudonio","Panterken","bkoganbing","ccthemovieman-1","Catherine_Grace_Zeh","george.schmidt","Miles-10","Gubby-Allen","JoeyDag","darin-wissbaum","Leofwine_draca","JamesHitchcock","HelloTexas11","MisterWhiplash","pacinofan58","g-bodyl","pyrocitor"],"review-date":["26 March 2004","11 January 2002","14 October 2004","31 July 1999","28 April 2002","14 January 2007","8 November 2000","25 May 2005","26 January 2000","18 October 2007","10 June 2009","9 October 2006","17 November 2005","10 April 2003","18 June 2017","16 January 2002","5 January 1999","8 December 2009","6 May 2011","29 December 2006","1 December 2007","9 February 2007","21 May 2007","19 December 2011","26 January 2006"],"review-rating":["9","8","9","8","7","8","10","7","8","8","10","7","7","7","3","6","7","5","8","2","9","5"],"review-title":[" I Can't Look Away\n"," Peterson and Eastwood make a great team\n"," Underrated Thriller\n"," Crackling excitement!\n"," Satisfactory Condition\n"," Top Thriller\n"," Right on target\n"," It's fannntastic!\n"," A Crackling Thriller!!\n"," Malkovich makes this an above-average thriller\n"," Making It Personal\n"," Malkovich Steals The Show\n"," Excellent, suspenseful, and edge-of-your-seat action/drama/thriller!\n"," Top notch Eastwood & unforgettably venal Malkovich\n"," Thriller from a more innocent time\n"," Excellent Thriller\n"," above average genre flick\n"," In the line of fire misses the mark...\n"," Moderately good\n"," One of the more intelligent political thrillers of the nineties\n"," strictly average\n"," the not-quite Dirty Harry for the 90s; a sinister blockbuster\n"," Even Clint Eastwood Makes A Bomb Now And Then\n"," Great Thriller!\n"," It's all in the execution (in more ways than one)\n"]}