{"review-url":["http://www.imdb.com/title/tt0106112/reviews"],"review-text":["The first time around, I was so shocked not to see Robert and Tommy, all that could go through my mind was how bad this production must be.The second time around, after i had had a little talk with myself, i snapped on reality.  If i wanted to watch Lonesome Dove, all i had to do was go buy the video.  (strangely, i had already bought the video and worn the cassette out, but guys can get so focused on trivia).This is not Lonesome Dove, this is a new story with new actors and actresses faced with a chore greater than good acting.  They have to live with Lonesome Dove, the greatest mini in history.  And they have to tell us a new story.Now, I don't have the nerve of Jon or Barbara, i would never have tried it, but they did.  And they did a damn fine job.The second time i watched this mini, i enjoyed it a lot.  As well as a chance to think of old friends, i got to meet new ones.  And it was a good tale, told in a good way.  It may not totally get to Lonesome Dove standards, BUT WHAT DOES??  If we measure everything against Lonesome Dove, we could throw away our tv's.  And to be fair, if we measure everything else against Return to Lonesome Dove, we might not throw our tv's away, we would just unplug them for the evening.I liked it.  It is a good mini.  I hope you each will watch it twice.  The second time, you might just enjoy it.  Robert and Tommy will not mind,  I promise.","Let me say first off that I am a huge fan of the original series Lonesome Dove and the book it was based from. I have put off watching this sequel for the better part of 10 years due to the bad reviews I'd heard about it. If Tommy Lee Jones wasn't playing Capt. Call I didn't see the point. If Larry McMurtry wasn't involved why should I care? How wrong I was.This is in so many ways a worthy sequel to Lonesome Dove, maybe even more so than the dark mood of Streets Of Laredo. The story, acting, production, cinematography are all top-notch. Of course the script isn't as colorful as Lonesome Dove but it has it's moments. And, much to my surprise, there are bits of Lonesome Done in this series; the relationship between July and Clara, completely dismissed in the prequel, is brought up here almost identical to the book, a most welcome surprise. The story isn't all roses, it has it's surprises too. By far the biggest surprise is Jon Voight's interpretation of Capt. Call. While not a direct copy of Tommy Lee Jones' his is both faithful and unique to Voight's credit. The cast is fantastic all across the board, and I don't think Rick Schroeder has done a better job of acting than in this series. Oliver Reed practically steals the show here, he is superb in a role that makes you care for his character as equally as you hate him.It is worth it to watch this if you haven't due to bad criticisms, especially that the DVD is so affordable (I got the 2-disc set for $10.99, you can probably find it cheaper). It is in no way the disappointment that Dead Man's Walk turned out (well, it was for me). And MCMurtry was involved with that one!","I agree with the above that this is not the original.  But it is a well made and well acted sequel.  There are many fine parts to this story that deserve comment.  Not the least of these are the fine performances put in by Louis Gossett, jr, Nia Peeples and Reese Witherspoon.  Barbara Hershey is outstanding as the former and now disappointed love of Gus McCall from the original. The fire at her homestead stands out in my mind as an exceptional piece of drama - well staged and filmed. Rick Schroder brings real talent to his performance as Capt'n Call's unacknowled son.  Jon Voight brings drive and at times a bit more life to the part of Capt'n Call than Tommy Lee Jones.  His performance in the 'flight of arrows' chapter is outstanding.Well worth the viewing.","If your a true Dove fan, this is a must see movie. Out of all the sequel this is the best one and stays true to the characters. McMurtry destroyed Gus and Call with Dead Man's Walk and Comanche Moon. He made Gus and Call into bubbling idiots.Barbara Hershey was magnificent as Clara Allen and in my opinion stole the character away from Houston who I thought was miscast in the first place. Jon Voight was also a great choice for Call.It was great to get Schroder and Cooper back to play there original parts. And Lou Gossett and William Peterson were just perfect as replacements characters for Gus and Deets.This is a very well written story of what awaits call after his historic cattle drive to Montana.","I've seen Lonesome Dove, Dead Man's Walk, and The Streets of Laredo, and now The Return to Lonesome Dove. If you are hungry for more after watching Lonesome Dove, this'll fill yer belly. Great cast, great story. Most definitely a close second to Lonesome Dove. I will be purchasing this movie to add to my collection. This is the best, or at least my favorite performance by Jon Voight. He is Captain Call. Lou Gossett Jr. playing Isom Pickett is not somebody I'd mess with, he is a bad ass with perspective. William Peterson does a great job as well. Rick Schroder is back as Newt with an angst filled performance that reminds me of his stint on NYPD Blue. My only problem with this film (and it's really picking nits) is that I had the impression that Call wanted to be \"the first man to graze cattle in Montana\", and it's obvious that Dunnigan had already been there a while. A little inconsistent, but easily overlooked as you lose yourself in the fantastic tale. I especially love the apparent character growth of Jasper Fant and July Johnson. I've watched this movie several times and am ready for another sequel.","This a wonderful sequel to the award winning Lonesome Dove miniseries in the 1980's. This sequel is perhaps, better than the original. It is definitely more family friendly. The language is more subdued. There is plenty of violence and one particular scene with Cherokee Jack is particularly gruesome. However, overall a great movie. The acting is superb. William Peterson is fantastic. Such a great dramatic actor with a quick sense of wit and comic timing. Jon Voight aptly fills Tommy Lee Jones' shoes as Captain Call. Ricky Shroder gives a great heart-filled performance as the young boy who grew up with no family to claim him. Highly recommended.","not a Larry Mcmurty masterpiece but it stands on its own as a good western, any of the lonesome doves do. who ever takes on the role of Woodrow call, does a great portrayal in their own style. It's also easy to see that they were looking to use this as a stepping stone to the t.V series (both version of it) and that the writers knew how to keep the flavor alive William Peterson was awesome in this, the geeky C.S.I guy is not the character he plays in this - this guy can do it all it seemsit's deserve to be enjoyed by those who enjoy westerns4out5 stars","I just watched \"return from lonesome dove\" and it was very good! I've seen a lot of negative comments about it and I don't think the Viewers are being real about it! In the television/ movie business it is hard to get all the actors back for a 2nd sequel or 3rd part. WE ARE LUCKY TO HAVE ANOTHER MINISERIES THAT TIES INTO LONE D. FAITHFULLY!! This production was top notch with the original music score, and the actors put their hearts into it(you can tell). If you want to watch lonesome d. with Robert Duvall and tommy L. J. then watch the original. Return to L.D. didn't have as much wit and takes on a more serious tone but is totally captivating none the less. From the touching moments to the villains, this one is a winner! \"Wonderful!!!\"","Let me begin by saying that there is no bigger fan of the original \"Lonesome Dove\" than I. Both the Pulitzer Prize-winning book and the towering mini-series adapted from it stand alone in my experience as moving, dramatic, believable, and engrossing works. There is no comparison between \"Lonesome Dove\" and any Western film- at least not since the legendary collaborations of John Ford and John Wayne. It was with real reservations that I sat down to watch this new mini-series, what with McMurtry's non-participation, and the missing original cast members. After watching the first episode it was clear that this is no \"Lonesome Dove\". In almost every measurable way this sequel falls short of the original. But so what? I wasn't expecting it to measure up. Taken as an effort of it's own this film is engaging, entertaining and of a very good quality. If it were done as a new story, not as a sequel to \"Lonesome Dove\", there is no question in my mind that it would not have received as many negative ratings. Jon Voight did a creditable job as Call, Barbara Hershey was a terrific Clara, and the new characters like Gideon Walker and Agostina Vega were well rendered and believable. Louis Gossett jr. deserves special mention as the horse wrangler Isom Pickett. The film made me care about the characters, and I don't ask any more than that from an actor. it is unfortunate that this worthy effort stands in the shadow of it's predecessor- it is worth viewing in it's own right.","I had my reservations about watching The Return to Lonesome Dove after seeing and enjoying the original so much. Without Tommy Lee Jones reprising his role as Woodrow Call or Anjelica Huston as Clara, I figured it just wouldn't seem authentic enough. Upon viewing 'return' I can honestly say it's a worthy successor. The actors really make the show with Jon Voight, Rick Schroder, and Oliver Reed all preforming at their very best. I admit the story might not be quite as engrossing as the first, but 'return' definitely has it's share of excitement and captures the romance of the old west in a way that few other films have. Anyone who still has reservations can rest assured that The Return to Lonesome Dove succeeds in capturing the 'feel' of the original and will not disappoint. Do yourself a favor and check it out, Ol' Gus would be proud!","When you get right down to it, could a mini series really have worse circumstances surrounding it and carry the burdens Return to Lonesome Dove does? Not only is it a sequel to a timeless classic like Lonesome Dove thus having a hard act like that to follow, but its also not written by the original author and is disliked by the original author to boot. That's a tall order for any story.But amazingly, Return to Lonesome Dove is up to that challenge. That is if you look past all the controversy and the fact that its not written by McMurtry, if you do you will see a very rich and entertaining mini series. It stays true to McMurtry's characters, Captain Call, Clara Allen, and Pea Eye are all the same. Newt's growth as a character evolves nicely and believably for a young man growing up on his own. The new characters are compelling and believable and they interact seamlessly with the familiar ones from Lonesome Dove. The storyline itself is believable and riveting as well. Its not Lonesome Dove, but its well worth watching and a worthy successor.Its a great pity that McMurtry denounced this movie as being non canon, for in my humble opinion it is superior to his own sequel offering of Streets of Laredo, a book that was depressing almost to the point of being unreadable. Don't get me wrong, I'll always be grateful to McMurtry for Lonesome Dove and have the utmost respect for him, great author, but he does the fans of his story something of a disservice by denouncing the sequel mini series. I suggest overlooking him just this once. You will miss out on another great story if you don't.","As a huge fan of he original Lonesome Dove, I was very disappointed with this bland sequel. The casting is way off: Voight does not have the steely resolve of Tommy Lee, sighs way too much to be a man of action, and gets way too excited when faced with danger. The director needed to say, 'Woodrow can handle things, or at least doesn't let others know he can't.' Barbara Hershey instead of Anjelica Houston? Need I say more. This is a woman who was on her own on the prairie for years and learned how to cope. Very well. Hershey spends most of her time looking down or away from what or who, ever, is in front of her. Suggesting the insecurity and neediness that she displayed in Hannah and her Sisters. But this is an entirely different woman. And, they completely lost all the wonderful weathered faces of the original, save for Oliver Reed, and the character, 'Pea.' The writing is mediocre at best, and as one other suggests, smack of soap opera style events. Either watch the original and then try to get thru this, or watch this and don't watch the original, as you will find yourself nodding off during this one.","At first glance of this mini... I was a bit disappointed that Tommy Lee Jones and Anjelica Huston didn't return to the cast. Both John Voight and Barbara Hershey did commendable jobs replacing very important characters for the continuing saga of this legendary Epic Western. Cherokee Jack Jackson (Haysbert) played an excellent bad guy, and Louis Gossett Jr. was, as always, true to form with his excellent acting skills.The drama that seemed true to life in many scenes, including one of the best, where the valiant shoot-out ended with Ranger Walker being killed made me feel that I was actually in the film. Return to Lonesome Dove was to me, almost up to the quality of the first of the series. The next 2 follow ups with James Garner as Call just didn't make it for me. And that Lorena marries Pea Eye? How the heck did that get in their? That was a total mismatch of characters. The first 2 of the series made the Epic story, the next 2 in no way were of the same quality.Now, if the first 2 could be remastered in Dolby Digital and an Anamorphic presentation, the films could be where they should have been like the movies of today.","As soon as I heard that this show was being made I found out that the author of Lonesome Dove had no connection to this one and warning flags came up in my mind. Lonesome Dove is one of the most beloved mini-series in television history and folks this network sequel will never have that distinction.Picking up right where Lonesome Dove left off and finding Jon Voight in the role played by Tommy Lee Jones in the original, I found it very hard to get into this show. While Voight is actually very good in this show, it just is not the same without Jones, Duvall and the others. The only big name from the original to appear in this turkey is Rick Schroder as Newt.While featuring some good visuals and great work from William L. Peterson in a role that is supposed to be a Gus Macrae type but never really comes close, on the flip side, the story is ludicrous and Oliver Reed turns in one of the worst acting performances I have ever seen. I don't fault Mr. Reed, I fault the writers who have given him some of the worst lines you will hear in television history.This is no return to Lonesome Dove but rather a full fledged stampede away from Lonesome Dove and should not be confused with Larry McMurtry's official sequel \"Streets Of Laredo\" which has been turned into a two-part mini-series and is much better than this offering.","If you're new to the Lonesome Dove series I'd recommend giving this one a miss for a while. It's not canon and doesn't follow the same narrative line as the genuine McMurtry titles. I don't want to drop in any spoilers, but suffice to say some of the characters are given very different futures here, information that is completely contradicted in Streets Of Laredo. The villains in this title also can't match characters such as Mox Mox, Blue Duck or Joey Garza. Return To Lonesome Dove has, in my opinion at least, a weak first act as it struggles (and fails) to capture some of Lonesome Dove's magic, however the writing improves and maintains a higher standard from act 2. Ultimately it's a worthy mini series in its own right, not on the same level as Lonesome Dove or Streets Of Laredo, but enjoyable none the less. Worth a look once you have some distance from the 'real thing' and can judge it own its own merits. ...","\"Lonesome Dove\", which originally debuted on television in 1989, although a television miniseries, remains the finest Western to ever hit the medium in my opinion. Despite a really long running time of six hours, the miniseries had fantastic acting, great writing, beautiful cinematography and scenery, and some of the most likable characters you could imagine in a Western film. It was deservedly a huge success with audiences and critics, and many miniseries which followed tried to imitate its success and all of them failed. Due to it's popularity a sequel was almost obvious, but this sequel seems like it was a very rushed production, and seems to forget about everything that made the original so exceptional, especially the exclusion of Larry McMurtry and Tommy Lee Jones. That's right Jones does not return as Call here. He instead decided to star in \"The Fugitive\" the same year, a smart decision as that film won him an Oscar, and he is replaced by John Voight this time around. (Voight was also offered Jones role in The Fugitive, but when he found out Jones declined to reprise his role here he quickly accepted, turning the other part down, the actors basically switched roles.) The story picks up where the original ended, and after that it's a basic, and basically boring retread of the original. If you want to see a few familiar faces from the original miniseries rest assured a few do return. Ricky Schroder is back as Newt, though his character here is more irritating and uninteresting, whereas he was likable with Gus and Woodrow in the original. Chris Cooper returns as July, and his role should have really been an un-credited cameo, as he is given very little to do over a six-hour period. William Sanderson and Barry Tubb also reprise their roles from the original. Replacements or substitutes for the original's characters are Barbara Hershey, replacing Anjelica Huston as Clara. Though she does give it her best, Huston nailed the part to perfection the first time around, and the chemistry between her and the original cast could not be beat. Hershey and Voight are OK together, but she seems more like she is doing a poor imitation of Huston rather than putting a fresh, new spin on the character and it just doesn't work. Oscar-winner Lou Gossett Jr. goes along for the ride, I guess as a substitute for Danny Glover's Deets in the original. Gossett never seemed to find anything worthy of his talent after winning the Oscar for \"An Officer and a Gentleman\", and that is also evident here. It's a sad waste of his fine talent, and even though he tries, he cannot compare with Glover from the original. Voight does OK as Woodrow but Tommy Lee perfected the role, giving a miraculous performance. Voight pales in comparison, despite good effort. Reese Witherspoon also gives one of her earliest performances here, and her character is so bland an underdeveloped she is essentially wasted. The cinematography and scenery is OK here, but nowhere near as good as the first, which is what made it, I think the finest Western of our time. The story lags and never really gains any momentum, whereas the original in spite of being six-hours never made me wonder when it was going to end because I loved every single minute of it. This is really an unofficial sequel because at the time, Larry McMurtry was writing a novel sequel to the original entitled \"Streets of Laredo\", which would also be adapted as a miniseries two years later. By not having his involvement this sequel suffers tremendously, and totally contradicts the entire Lonesome Dove series in general, as according to McMurtry none of these events ever really happened in accordance to the time-line of his book series. Overall despite good efforts from the cast, some fine cinematography and scenery, this miniseries is way too slow, and suffers in comparison with its fine predecessor. Of course I am sure they knew it would be nowhere near as good as the first when they made it, but the end result could have been much better than this.","After watching this so called movie one is left with the impression that some will go to no end to change in entertainment what they can not change in history.This film should have aired as a day time soap opera as it seems to hold to the same criteria which to a day time soap is normally, if its to good to be true its probably someones fantasy.Rating this a 5 out of 10 is only to give credibility to the main stars John Voight who did a good job in the roll as Capt. Call, Tim Scott who continued his great performance as Pea Eye and Rick Schroder for his role as Newt.","Lonesome Dove was one of he greatest cowboy movies ever made.. Pulitzer Prize winning novel, 17 nominations, 15 awards... Return to Lonesome Dove,,, hmmmm??? I'm sure I could have watched this (I watched Bad Girls) had it not had Lonesome Dove in the title but I was expecting to see \"something\" like Lonesome Dove.. This ain't it....The original,,, LD,,, was written in Pulitzer Prize winning language.. RTLD was written by the same people who brought you \"Spencer for Hire\". The original had a dark, serious, no nonsense feel.. RTLD had the made for TV,, let's get the 18 to 45 crowd,, don't want to confuse anyone,, PC, touchy, feely, family entertainment feel.. And by all means,, start the movie with (eye candy) a beautiful,, young,,, female,, pistolero,, in form fitting clothes,, blowing holes in Gus McCrae's grave marker... What could this possibly mean???? Dah...And by all means,, change the laconic Capt Call character,,, completely.. Make him more like Gus this time.. Lots of body language, jovial, friendly, more smiles,,, an all around more likable guy... And by all means,,, make sure he is inebriated with verbosity... Looks alone don't do it anymore,, people may be given to thought if a character isn't moving his lips... All \"seemingly\" empty spaces must be filled with dialogue,,,, or music..I could go on and on about the shallow, generic characters, weak acting and the unbelievability of the situations but,,,, I watched only 30 minutes of the first installment... My time would have been better spent watching paint dry....This Mesterpiece is proof that diamonds can indeed be turned back into coal....","Tommy Lee Jones was the best Woodroe and no one can play Woodroe F. Call better than he. Not only was he the first and best, he was the only person that could portray his grief and confusion. It was a bad let-down and I'm surprised I even made myself watch it. I can even begin how how pitiful they made Woodroe. I understand he would be old by that time, but everyone knows that he would NEVER let that pull him down. The first movie was the best and the only one that I'll ever watch. I hope to God that no more directors plan on continuing or remaking the wonderful classic without Tommy or Duval. Without them, the movies are pointless wastes of time and money for everyone, including the director. IF YOU PLAN ON MAKING ANOTHER LONESOME DOVE MOVIE OF ANY KIND, take mine and billions of others, don't waste time. Continuing the movies is just grinding the first one into the ground. Thanks."],"review-user":["dana-27","IvoryCamaro","georgepark","lee1888","super-roofer","jmfjbf","mdurkin93","ringling123","Captain_Augustus_McCrae","dgroesbeck","star_in_the_zenith_79","dminkster","jazbone2003","Robert-87","it_lives","spencer-w-hensley","sirconrads","tbssic","rupert_rawr"],"review-date":["7 August 1999","17 December 2005","1 December 2002","8 December 2012","8 January 2009","27 August 2007","2 February 2006","11 February 2008","11 January 2008","9 June 2006","1 August 2013","2 August 2013","2 February 2006","27 January 1999","9 July 2011","21 July 2016","31 January 2008","26 November 2012","7 July 2005"],"review-rating":["8","9","10","9","8","9","9","8","9","4","9","6","5","5","2","2"],"review-title":[" on a second viewing, not so disappointing after all\n"," Much better than you'd think.\n"," excellent production\n"," Must See\n"," Excellent, like coming in from the cold.\n"," wonderful sequel\n"," good one\n"," \"Take all things into consideration\"\n"," Worth watching in it's own right\n"," the return is worth it!\n"," Look past the controversy and see a great mini series\n"," see the original\n"," Return to Lonesome Dove\n"," Disappointing Network Sequel\n"," starts slow, but worth sticking it out\n"," OK as it's own Western but a tremendous letdown being called a sequel to the finest Western of all time\n"," A Day Time Soap Opera\n"," Waste 30 minutes and see...\n"," Total Letdown...\n"]}