{"review-url":["http://www.imdb.com/title/tt0104926/reviews"],"review-text":["Tom Selleck has been for most of his career a box office bust. Even though this movie did not score a home run with movie goers, it is still a nicely done film. It doesn't play down Japanese stereotypes, as the writers of this film did their homework on life in Japan. I used to watch Japanese baseball, and I can tell you that the film does a pretty good interpretation. In Japan, the manager of a ball club is more of a nurturing father. It's also more like work than sport. Players run fundamental drills all day and talent takes a backseat to skill. The movie is nicely done and Selleck does a good job as selfish, self-centered Jack Elliot. Dennis Haysbert is also nice in the supporting role of Max DuBois (He had enough practice being in baseball movies after being in Major League). Ken Takakura is good as the no-nonsense manager of the club. It's a shame he hasn't done any other American films after this one. Aya Takanashi is also nice as Jack's love interest. If you can, get the video or DVD because the TV version makes some of the most absurd edits and cuts I have seen.","A lot of the comments seem to treat this film as a baseball movie, but I feel this is only secondary.  It's really about living in Japan, and it really succeeds.I spent a few years living in Japan, and I suppose the reason that this movie didn't do too well is that you sort of have to have experienced Japan to get it.  I was watching this with a well-travelled friend who's never been to Japan, and he noted that many of the events in the movie were so ludicrous that they destroyed the suspension of disbelief.  My reply was that those events were the absolute unvarnished truth about life in Japan!I think that this movie is definitely worth watching, especially if you've lived in Japan or are interested in it.","I lived in Japan at around the period in which this film is set, and I must say--this film does an OUTSTANDING job of capturing the \"feel\" of what Japan was like.  Unfortunately, the accuracy of this is not appreciated by most viewers.  Whoever chose the shots and locations really understood Japan well.The movie itself should rate among the best baseball movies EVER, but doesn't because it's not about American baseball.  Take \"field of dreams\" or whatever.  That basically boils down to some plot contrivance about ghosts and whatnot and is only REALLY about the game at a very superficial level (despite pretentions otherwise).  This one has an intelligent and realistic view of many aspects of the game--clubhouse behavior, on-field action, player-manager interactions, the business of sports, and so on.  If you're into baseball movies, view this one--and if you don't like it, I challenge you to find ONE other baseball movie that does as well as capturing so many aspects of the game intelligently with a minimum of sap.Characterizations in this movie:  yes, we all know that by the end of the movie the Tom Selleck character will do something to redeem himself.  In this regard, except for one interesting plot nuance (not really a twist), the plot itself is straightforward.  But the characters all stand on their own--I dont think there is a single bad characterization there with the possible over-stereotyped American agent.  From Yoji the interpreter through the teammates who are Japanese jocks to the strong female love interest.. well.. let's put it this way.. if you still think all Japanese look and act alike, see this movie.Clearly this isn't the best movie ever made, but I really like it on a lot of levels enough that on a scale of one to ten, I honestly have to give it a 10 (and I rate a lot of movies poorly).  You probably won't like it quite that much, but I think you will enjoy it--whether you are male OR female, by the way.  Definately a good rent.","MR. BASEBALL is a film of paradoxes. Written and filmed as a \"light, sports comedy\" it truly has a heartwarming core as human and universal as some of Capra's finest. At the plot level, you have the paradox of baseball, a fine old American game, as it is played in Japan - turned around, with American values cast off and Japanese values imprinted upon the game. (Some of the superficial \"sports comedy\" results from Jack's uncomprehending disbelief at how \"basa-boru\" is played in Japan.) You also have a lead character who's presented as an over-the-hill, aging baseball star, but who is actually quite immature - pro ball allowed him to postpone growing up. And you have a lead character who is rudely resistant to the changes in his life that are being forced upon him, refusing to accept the curveball that life has given him, in the midst of a new country, a new manager, a new team, and a new girlfriend, who have all welcomed him and try to accept him. Sound like heavy stuff? Not really. It's a charming \"clash of cultures\" comedy that takes place on the national, sports, romantic, and professional levels. But if you watch it sensitively enough, you will also find a great story about a man who has to abandon his immaturity and grow up way too late in life (causing some amount of personal pain), and finds success in places he never expected it. I love the story, but I also have great respect for Selleck's performance; he bares his tush (literally) to portray an ugly American, insulting people and throwing tantrums in public, then lets us inside this character to understand his dismay. It also doesn't hurt if you're a big fan of Takakura Ken like I am. MR. BASEBALL is a surprising \"loss of innocence\" tale.","You have to have lived in Japan for awhile to enjoy the beauty of this movie!  I lived on Okinawa for over 2 years, and northern Honshu for 4. Believe it or not, what you see paints a very good and accurate picture of contrasting east/west mentalities, both from a sports as well as personal relationships perspective.  A funny, funny, and heartwarming movie that deserves better than Americans viewing it can ever judge.  8+ out of 10!","I agree with BigAlC - this movie actually prepared me for a lot of the cultural differences and practices before I went to live in Japan for a year in 1993. Tom Selleck does a fantastic job here, as always, and the movie is greatly humorous and educational. I'm a big fan of Tom Selleck's, and he blesses this part with his usual charm and charisma to this part, bringing the film to life in a way I can't imagine any other actor being able to pull off. This film featured some first-rate Japanese actors, and it was highly entertaining to watch them as they interacted with Selleck - I can imagine the fun he had during the actual filming of the movie - Japan's an awesome place to go, whether you want to party, sight-see or just try to take everything in.","I liked this movie, not because Tom Selleck was in it, but because it was a good story about baseball and it also had a semi-over dramatized view of some of the issues that a BASEBALL player coming to the end of their time in Major League sports must face. I also greatly enjoyed the cultural differences in American and Japanese baseball and the small facts on how the games are played differently.Overall, it is a good movie to watch on Cable TV or rent on a cold winter's night and watch about the \"Dog Day's\" of summer and know that spring training is only a few months away. A good movie for a baseball fan as well as a good \"DATE\" movie  Trust me on that one! *Wink*","I generally agree with the overall user ratings at this site, or at least find them plausible, but I find the 5.7 rating for \"Mr. Baseball\" (1992) even more ludicrous that the 7.8 accorded to it's imitator, Bill Murray's \"Lost in Translation\" (2002).I call the latter Bill Murray's movie, because like most of his movies it is at bottom little more than a situation comedy contrived to create funny scenes, with deadpan Murray as the straight man. The situation, of course - the essential culture clash that all gaijin cultures have with the Japanese - is inherently funny, so \"Lost in Translation\" is undeniably a funny movie, but it has virtually no plot, and the other characters, though played adequately by Scarlett Johanson, and Giovanni Ribisi, are little more than props for Mr. Murray. However, the movie (Dir: Sophia Coppola) is finely crafted and that counts for something. And I suppose that artful cinematography and other cinematic esoterica have impressed the critics, and that their views have bled off into those of the hoi polloi, and given them cover for their racist guffaws at the silly Japanese.Meanwhile, the standard sports movie plot of \"Mr. Baseball\" has provided its critics with an excuse to dismiss the movie because it annoyingly succeeds in actually bridging the cultural gap, without in any way sidelining the inherent humor in the situation - which doesn't, as it turns out, need any kind of exaggerated boost from Mr. Murray's brand of snide. \"Mr. Baseball\" actually provides insight into the Japanese culture, and thereby also into our own American culture, which IMO is the chief benefit of foreign travel, and it manages to stop just short, at the end, from the improbable contrived Hollywood ending. All in all, \"Mr. Baseball\" manages to artfully and plausibly traverse the tightrope of our expectations, and on my own subjective \"rewatchable\" scale, it beats \"Lost in Translation\" all hollow.","Even if you are not a baseball fan, you will enjoy MR. BASEBALL. An aging Major League home run slugger Jack Elliot(Tom Selleck)is traded to the Dragons, a favorite ball team in Japan. American ballplayers are treated like rock 'n' roll stars in Japan and Jack is no exception. The American slugger has trouble fitting into the eastern society and thanks to his interpreter(Kosuke Toyohara)he doesn't completely alienate himself. Another American player \"Hammer\" Dubois(Dennis Haysbert)tries to help big Jack fit in, but of course the Dragon's new home run hitter is pretty hard headed.\nElliot finds himself in his coach's(Ken Takakura)doghouse more often than not. The team finds him easy to dislike. Unknowingly he finds romance with the coach's daughter(Aya Takanashi)and that is just part of the humor found in this likable and short of heartwarming movie. Most of the humor comes from Jack's interpreter. Selleck fits the role pretty well. Ted Danson would have been another good choice for the role, but Selleck provides enough arrogance to carry it off. Not a total waste of time, but there is doubts about a double header. Twice is enough for me.","If you like baseball, you'll dig this movie. It's kinda cheesy and it's not exactly Oscar-worthy, but Tom Selleck is pretty convincing as a struggling major leaguer who is traded to a Japanese team. If you've seen all the new releases (except Thin Red Line, which you should avoid like the plague) and you're looking for something light-hearted and entertaining, this movie is a safe bet. Enjoy.. and GO DODGERS!!! (yes they're struggling now, but i can feel a comeback)","Many believe this movie is a baseball movie. Such people are disappointed because it's about a baseball player, but the movie isn't about baseball.Some think this movie is a romantic comedy and are disappointed because the relationship isn't really developed. This movie is not a romantic comedy.This movie is about culture. An arrogant American Major Leaguer and a stern traditional Japanese baseball manager cannot succeed because they can't, indeed, won't understand one another. It's after they manage to break through the cultural barrier that they have success. The ballplayer becomes more Japanese in his team mentality and the manager more American in allowing individual achievement, and they meet in the middle.Baseball and the romance is subordinate to this critique of the two cultures. Many who have no understanding of the Japanese mindset miss this and think it's a movie on baseball or romance and see the culture clash as mild comedy relief. It's not---the culture clash is the gravamen of the movie. Based on my own experience and understanding of the Japanese culture, I think this movie did quite well in that it didn't overly romanticize the Japanese culture nor overdo it in its portrayal.Overall, I believe this is an enjoyable and relaxing movie if one understands what it is really about.","This has always been a favorite movie of mine. I've owned a VHS copy, and a couple of months ago I found a DVD release which is also part of my video collection. I also happen to be a huge baseball fan, and as part of my off-season reading, I picked up a copy of Robert Whiting's excellent book \"You Gotta Have WA\", that profiles the ins and outs of Japanese baseball, and the challenges that foreign players have encountered playing in Japan. As I began to read yesterday, it made me think of this movie, because it appears the screenplay was based almost verbatim on this book. The parallels are uncanny. The Jack Elliot character closely resembles Bob Horner, an aging MLB slugger whose best days were behind him. Horner's teammate Leon Lee is also depicted in the character Max \"Hammer\" Dubois, a veteran in the Japanese league who has made his peace with the frustrations of the Japanese game, and helps keeps his teammate sane. The Elliot character goes through the same sequence of encounters as Horner, from big fanfare signing, early success that fuels an already ravenous sports media, and the ensuing slump that spurs frustration, alienation from teammates, fans and media, and the resulting disillusionment that prompts a desire to go back home to the US. The only difference is that the movie adds such Hollywood touches as a love interest and a happy ending. Speaking of love interests, I'm sure many viewers have come to this site (as I did) to look up the actress who played \"Hiroko\" (the beautiful Aya Takanashi), and what other work she has done. It only lists this movie. It turns out, based on an article I read, that the brief love scene she has with Tom Selleck (a foreigner) in this movie (mild by our standards - basically they kiss while he's in the bath and she's wearing a towel) caused such an outrage on the part of the Japanese public (males in particular) that she has never been offered another role of any kind, in Movies or television - essentially blackballed by the Japanese movie industry. It's a real shame, as she is(was) quite a talented actress in this movie. If you like this movie as much for the baseball elements and cultural differences as I did -- go find a copy of \"You Gotta Have WA\" by Robert Whiting. A good read and a great companion book to this movie.","An egotistic major league baseball player is forced to continue his career in Japan, he contends with a culture that is alien to him, an apparently humorless manager, an attractive Japanese woman and his own professional and social insecurities.  There is a certain subtle charm that flows through Tom Selleck's performances. There is humor, sometimes softly understated, as in this film, sometimes slapstick as in \"Folks!\", but always there seems to be some higher purpose involved. Throw in an individual full of self doubts who struggles to solve his personal difficulties while holding fast to \"doing the right thing,\" and you end up with a film both funny as well as thought-provoking. The cast fits together like a championship team, and even if neither cast nor film win awards for their efforts, they will leave the viewers feeling good (and maybe that's the best results after all). You'll want to watch this film more than once, and each time, Mr. Baseball hits a home run.","it's a silly movie.  ridiculous jokes abound.  but for some reason, i can't help but like jack elliot, nor can i help but enjoying his misadventures in japanese baseball.  yes, it's a cheesy love story, and a cheesy inspirational sports story, but it's more than that: it's a story full of ridiculous and funny jokes.  from tall men walking through too-small doors to inaccurate translators, this movie has it all for the average comedy fan. don't bother bringing your brain (to be cliche), but be prepared to be taken to the pit of ultimate darkness.  i've seen this movie over 50 times.","I am very impressed by the reviews I've read of this film - generally well-read, thoughtful and informed - obviously by people who like and think hard about films. I couldn't add a thing to the excellent reviewing job that IMDb members have already done. If I may, I'd like to correct a small but widespread misunderstanding that appears in many of the reviews: Mr Baseball was American and behaved in an ugly fashion but he was NOT an Ugly American. The original Ugly American was Homer Atkins, one of the heroes of the eponymous 1958 novel by Burdick and Lederer, and the exact opposite of Mr Baseball. Homer was an archetypal American, and an archetypal engineer - he went to Vietnam to work with people, he respected and liked the people he met, he used appropriate, sustainable technology in cooperation with his hosts, and he was liked and respected by them precisely because he exemplified democratic values and American virtues. His ugliness was purely facial, merely skin-deep; his personality and his humanity were deep and genuine.Mr Baseball exemplifies all the crass, ignorant, insecure boorishness that we Europeans and Americans so often inflict on other cultures; Homer Atkins, the Ugly American, was the other side of our coin, representing our humanity and decency. I believe that the Ugly Americans still far outnumber the Mr Baseballs; they are still our last, best hope.","Redo the Oscars from 1992, and this film might get nominated, or even win. It was SO good at capturing its era and dual cultures that it belongs in American and Japanese time capsules. If you wanted to know what living here or there was like back then, this film will show you. As an American, you'll feel like you tagged along for an extended Japanese vacation, and by the end of the film, you'll be a die-hard Dragons fan, as you accept the injection of Japanese tradition and culture into their baseball, much as we have done with our culture in our own game.Jack Elliot (Tom Selleck) is a slumping, aging Detroit Tigers' slugger who is traded to the Dragons, perennial runners-up to the dynastic Yomuri Giants, Japan's answer to the Yankees. The Giants are admired for their success, yet that success also has everyone wanting to surpass them, something which is rarely done. The Dragons' manager recruits Jack as the final piece of the pennant-winning puzzle, and we're left with what could have been Gung Ho on a baseball field, but instead was much more.The casting was outstanding: Selleck proved that with a good script and a character that suits him, he can carry a film as well as he did his television show, and the Japanese cast was equally good, down to Mr. Takagi from Die Hard back as the image-conscious owner. The other actors, including the one who plays the love interest (also the manager's daughter), strong and independent yet simultaneously a believer in Japanese traditions, beyond what was forced on her. She is a proper and supportive girlfriend for Jack. Even her father never tells her not to see him, almost sympathizing with Jack for what he endures from her, and a bit relieved he at least knows the man she has chosen to love.The baseball scenes are great, bolstered immensely by a pre-fame Dennis Haysbert as another American ex-patriate and Jack's western mentor. The usual fish-out-of-water elements are there, and you can almost feel yourself stumbling right along with Jack to fit into a country that doesn't speak our language, and doesn't practice our ways, yet copies everything we do, including our national pastime. one of the funnier scenes occurs when Jack, clutching a magazine, informs his manager that he has learned of the tradition in Japan where you can get drunk and tell off your boss, and it can't be used against you, and exercises that right very humorously. The plots and subplots are tied up neatly at the end, but not too neatly, and nothing concludes unrealistically.To call this a comedy is misguided: it's a pure comedy-drama, or even a drama with good humor. The plot is too deep to dismiss it the way it was by critics as an actor out of his league trying to carry a lightweight film. The situations were amusing, but in their place against a far more serious, profound, and precisely detailed backdrop that results in one of the best films I've ever seen. The baseball cinematography rivals that of For Love Of The Game, for realism.Some say the film is about baseball, or about Japan, but more than anything it seems to be about the workplace, and how people arrive at work from totally different origins, with different agendas, and somehow have to put their differences aside for the good of the company, or the team.A truly great film that never should have had to apologize for itself the way it did when it was in theaters.","If you want a movie that makes you think differently or leaves a lasting impression on you, you're not looking for Mr. Baseball. If you're looking for a light and fun romp through the land of Japanese baseball hosted by Magnum, P.I. himself... this is the film you've been searching for.That's it. Tom Selleck, playing baseball... in Japan. Nothing shocking here. I mean, I could try to say it was like the humorous, less dramatic version of \"Lost in Translation\"... but that would be giving it too much credit.If you see this film on the USA Network, it might be worth the trouble to stay on the couch a while. It pokes fun at how different Japan is from America (see, now I'm segueing into that \"Lost in Translation\" bit...) with little men living in little showers eating little meals.And, um, if you don't catch on to the \"twist\" before it happens, you're incredibly dense or haven't seen one of the ten thousand other films that use the same gimmick.","I agree with the guy above, It is so funny I understand it all, but my friends just don't get it. Go to Japan and you will see a different movie after being there. When I met my girlfriends dad, at his home in Kanagawa. I swear I felt the same as Jack,. scared, but by the end of the day it was all good, so I give this movie a 10 out 10.I have watched it at least 30 times, taking it with me to watch on the plane flying to Japan next month. One thing that is real good is the ball game scenes. Makes me feel like I am there again. This is a must see if you have any interest in Japan and Baseball. Too bad they don't make a sequel. Does anyone know where the temple scenes were filmed and the argument with hirko in the walkway with a roof on it???? need to know so I can win an argumrnt with me Japanese ex-wife. thanks","I saw this 15 years ago in the theater and while I never had the desire to see it again, it always stuck with me. Maybe that's because (1) I love baseball; (2) hate to see arrogant ballplayers; and (3) cringe if I see someone not representing my country in a positive light. That's what you get in this film as Tom Selleck plays a crude, profane, \"ugly American\" ballplayer who's talents have been outlived in the Major Leagues and he's now relegated to play in Japan. (Ironically, Japan is just starting to make some inroads the other way around, especially with Daisuke Matsuzaka and the Red Sox.)Anyway, \"Jack Elliott\" (Selleck) pouts his way around Japan until he gets involved in a romance, which is portrayed somewhat stupidly and leads to a predictable ending. Other characters in here were interesting to watch, such as the stern manager, played by Ken Takakura. One of the other American players has turned out to be a star in his own right, acting-wise: Dennis Haybert of \"24\" and now \"The Unit.\"There are a lot better baseball movies out there, but you could do worse, too. It was okay, but as an American, I get to see enough arrogant pro athletes play here every day. All I have to do is turn on the TV.","This is an excellent, little known movie. Tom Selleck does an outstanding job of acting in this movie, with the Japanese 'Clint Eastwood'. I'd love to see if this movie has come out on DVD yet, there are some spots that clearly have been cut. Hiroku (Tom's love interest) has clearly had some parts chopped. It would be interesting to see more of Japan in the film. The baseball sequences are far and away the most realistic of any baseball movie, I'm quite sure most of the actors were current or former baseball players. I love loading the tape of this movie at least once a year. Best scenes involve the lack of hat tipping after Tom gets beaned in the big game, and an intensely sensual scene of Tom having a hot bath with Hiroku. Dennis Haysbert also does a great job, it's good to see he's finally getting some recognition, not just in baseball movies(he was also in Major League).","Mr. Baseball is a unique little film about the Great Game. This is because it takes place in Japan and the plot not only deals with the trials and tribulations of an over-the-hill American legend seeking to extend his career, but also with his problems adjusting to Japan and its life philosophy, its manners and customs - and the different way they play ball over there. It's well known that star Tom Selleck is a life-long baseball nut and a die-hard Detroit Tigers fan. This helped considerably in his portrayal of the selfish, inpatient expat ball player. He knows the game. Watching his clashes with all things Japanese is entertaining, informative and thought-provoking. His antagonist, Ken Takakura, as Chief, the Manager of the Dragons, is a perfect foil as the two butt heads over literally everything. Eventually, Selleck's Jack Elliot is forced to change and that change is what gives this films it's real entertainment. After what seems an eternity, he finally understands and the result is a beautiful thing. Selleck's Japanese girlfriend is Aya Takanashi, a real beauty who can convey independence, hurt, pride, love and joy all within a few moments, was a real find. I was both surprised and disappointed to discover that this is her one and only screen appearance. She never appeared before the camera before Mr. Baseball - and never again afterward. I am bummed. What a waste; she has talent. Anyway, Mr. Baseball is recommended for all fans of baseball movies AND ALSO for those who enjoy light and enlightening love stories. As for mixing baseball and romance, while I grew up adoring Coop and Teresa Wright in Pride Of The Yankees (1942), after a thousand viewings of Pride, I'll now take Mr. Baseball.","Most of the comments here have talked about how this movie is a good one for baseball fans, which is true, but it's also a fantastic film for Japanese culture buffs.  I picked this up on DVD for just under $8 at K-Mart, and, even as someone who is not a big baseball fan, I found it charming.  This may well be Tom Selleck's best role ever, and the other characters are very engaging and funny as well.  The music is quite good too.","Jack Elliot (Tom Selleck), former World Series MVP for the New York Yankees, is traded to the Chunichi (Nagoya) Dragons of Japan. Although Elliot is on the downside of his career, he has not lost all of his playing skills. Now the trade doesn't stir well with the drinking, smoking, and womanizing egomaniac. Knowing little about Japanese culture, cuisine, and mannerisms, the gaijin (foreign) Elliot's awful attitudes form the basic plot of this not unlikeable movie. You just know that the American will quickly butt heads with unflappable Dragon manager Uchiyama (Ken Takakura). Meanwhile, as athletes attract attractive woman, Hiroko Uchiyama (Aya Takanashi) will become Elliot's love interest. But Hiroko, who is no bimbo, is an advertising professional who makes commercials for Japanese television. So can the love interest last? Along the way Elliot would do well to heed the advice of new Dragon teammate Max \"Hammer\" Dubois (Dennis Haysbert), not a Frenchmen but an African-American. Dubois, earlier traded to the Dragons, had the gumption to learn Japanese ways and some of the language. Fitting in as well as he can, Dubois is resigned to his challenging situation. Conversely, as Elliot is green in Japan, he is accompanied by an interpreter, Yoji Nishimura (Toshi Shioya), who is wise enough to clean up the American's sardonic comments for the Japanese press. Overall, the movie does well in depicting the Japanese sports culture: manager-player interaction, the fanfare of the large crowds (which appear genuine), umpire esteem, corporate pressure on the managers, and the voracious sports media. Also note the importance placed on saving face, which means that certain on-field events are sometimes compromised. The climax involves the big game between the Dragons and their traditional rivals who always seem to beat them, the Yomiuri Giants. Will Elliot find redemption? Watch and find out! PS: Know that the Japanese certainly love their baseball, and have played it a long time. The sport was introduced in Japan in the late 19th century! In 1934 Manager Connie Mack, Babe Ruth (called \"Beibu Rusu\"), Lou Gehrig, Charlie Gehringer, Jimmie Foxx, OSS spy Moe Berg, and other Major League Baseball all-stars visited and were greeted by huge and enthusiastic crowds.","Jack Elliott (Tom Selleck) used to be a great baseball player. Now he's an apathetic over the hill slugger who's bigger in his own mind. One day he's dumped onto the Chunichi Dragons of the Japanese Central baseball league. There he falls for his liaison Aya Takahashi, and learns from her father the coach (Ken Takakura). Dennis Haysbert plays the only other American on the team.It's a well done rom-com. Plus it's a well done redemption film. The clichés and the formulas are all here. And they're all expertly done by Fred Schepisi.Tom Selleck is perfect as the aging baseball player. Not only does he look the part, he projects that sense of entitlement and was able to grow the character to his redemption. This has all the elements of a feel good movie.","After not watching this movie for over 10 years, I happened to buy the DVD on a good sale. I haven't stopped watching it since! I'd forgotten how enjoyable this film is! Those negative or low reviews generally do so since they think many parts are predictable. SO WHAT!! Very few movies can more can be unpredictable anyway! This is one of those fun movies you can watch and enjoy over and over. The formula really works in this movie. If you like baseball, you'll like it even more. It's about a clash in cultures and the cast is excellent! Roger Ebert even liked it, predictability and all. I can't believe this only gets a 5.5 overall rating by the members! Tom Selleck is perfectly cast as the aging pro ballplayer who's contract gets sold to a Japanese baseball team and is not thrilled about playing in Japan. All of the supporting cast, especially Dennis Haysbert are also perfect for their roles. Anyone who follows baseball or has lived in Japan can confirm how the foreign ballplayers \"gaigin\" are treated differently. This film covers this area perfectly. Again, a truly enjoyable movie that's fun to watch over and over."],"review-user":["MichaelMovieLoft","lethalweasel","LydiaOLydia","David Spalding","bigalc54","shadowblade13","smacdon630","gimlet_eye","michaelRokeefe","Lintjello","CShippee","gwilliams-10","Mattman-2","bobdicks","BrianRMorris","ray-280","gavin6942","dave6688","ccthemovieman-1","jlease-1","estabansmythe","eyedunno-2","romanorum1","SnoopyStyle","charlieh14"],"review-date":["15 April 2003","10 November 2001","26 June 2001","5 January 2002","5 January 2003","11 April 2006","22 September 2005","9 December 2013","1 April 2004","6 July 1999","28 June 2007","14 October 2005","19 June 2000","29 April 2000","10 March 2008","18 February 2008","7 August 2006","22 March 2005","11 April 2007","8 February 2005","23 May 2004","21 October 2000","6 July 2015","30 September 2013","3 August 2011"],"review-rating":["7","9","8","8","9","8","8","6","8","8","8","8","10","5","10","5","10","6","6","7","9"],"review-title":[" This film is a grand slam\n"," Really enjoyable.\n"," Actually, a very very good film.\n"," Heartwarming drama hiding within sports comedy \"lite\"\n"," Just like being there\n"," Great movie\n"," I liked this movie\n"," Bridging the culture gap, with humor and warmth\n"," A slugger can hit anywhere.\n"," A pretty good baseball movie\n"," Culture\n"," Based on the book \"You Gotta Have WA\"\n"," \"Baseball is a game, and it's supposed to be fun\" ... this film is a hit.\n"," big hit, happy body!\n"," Excellent reviews of a worthy film; please check your literary references before you use them.\n"," This film stands the test of time for the very reasons it was overlooked\n"," A Predicable, Disposable yet Fun Film\n"," So funny I am still laughing\n"," Memorable, But 'Ugly'\n"," A great movie!\n"," A unique baseball film\n"," Well worth the 8 bucks I paid for it\n"," A \"Gaijin\" Baseball Player in Japan\n"," Feel good movie\n"," A fun and enjoyable film!\n"]}