{"review-url":["http://www.imdb.com/title/tt0117912/reviews"],"review-text":["The premise is rather original and well thought-of, but unfortunately, siding a good story is very low budget that doesn't even allow for decent special effects.  Jeff Fahey does his best amongst a poor cast, as does the always beautiful Linda Hoffman.  They should make more movies together.  The movie, while not worth much praise, warrants at least one viewing.","Drab, dreary and a total waste of my time. The plot is incomprehensible (so don't think about it too much). The acting is odd and wooden - I would have sworn that they were all professional body builders trying their luck at acting, but that might be an insult to body builders. There are no interesting special effects to redeem this disaster, but lots of fires, explosions, a gratuitous sex scene, etc. The only thing that caught my attention was that it takes place after a war between the US and Iraq that somehow goes nuclear...hmmm. Is Roger Corman psychic? Let's hope that \"Iraq\" was just a lucky choice for Corman and that the rest of his scenario doesn't come true.","This movie is a fantastic passtime if you watch it as it's supposed to be watched (a parody). High entertainment factor. The acting, plot, costumes and special effects keep you laughing till the end! No surprises or twists. A total no brainer. I've blown more interesting and exciting material out of my nose (or any other opening in my body for that matter).Go see this movie! Rent it steal it or watch it on NBC.","This must be the first movie I've rented and not seen to the end. Complete garbage! The acting, the plot, set and wardrobe looked like it came from a porno movie with a plot. Not even a B move.","Where do I begin? The story was so bad, it must have been written in a high school film club! The acting was so wooden I felt sorry for the actors! One actor even reminded me of what a deer must look like when staring into a car's headlights! Another actor has this constant look of being constipated! But it was the dialog that takes the cake! Our hero says to his captors - all holding submachine guns - if you lay a finger on a female prisoner you will be dead. Moments later, the strongest guard, built like a truck, and the only women prisoner go at it. When our fearless leader, who has this very annoying raspy gangster voice catches wind of this transgression, he calmly walks up to the guard, while machine guns are trained on him, and in a split-second snaps this giant guy's neck like he was breaking a tooth pick! He then gets back in line while all the villains with their machine guns do absolutely nothing, but essentially yell at him!I could go on and on! This movie is camp gem; and if you have any sense of humor, it's guaranteed to make you laugh so hard your eyes will tear!","Without being really the worst science fiction film ever made, or the worst I have seen, 'Time Under Fire' is still much under average. The premises and the first 10-15 minutes are not that bad, it starts as a X-Files story, combining Bermuda triangle mysteries with time travel. Pretty soon elements of other genres (too many) mix together, but the story never takes off beyond the level of interest of a TV series. Soon, 'Time Under Fire' quickly degenerates into a series of clichés, not only mixing altogether too many genres but also being unable to create anything memorable in suspense or special effects that would help viewers remember the movie until tomorrow. Acting is bad, and the rhetoric lines in the script do not help at all.","To paraphrase Danny Zucco, when he first saw \"Greased Lighting\", in the movie Grease: \"What a hunk of sci-fi junk!\" We've got a time-traveling submarine, powered by baking soda, that somehow time warps through the Bermuda Triangle and emerges in the year 2077--just in time for the Centenary of Elvis's death. The intrepid sub crew is immediately captured by futuristic totalitarian storm troopers and imprisioned in an abandoned rust-belt factory, which doubles as the new Imperial Headquarters of the Holocausted United States of Amerika. The storm troopers that enforce that \"duh law\" are all dressed in ill-fitting Fahrenheit 451 costumes and seem to bump into each other every few minutes.How did our future come to this? Well children, in the beginning of the 21st century, an incompetent United States President, with a hidden agenda, orders his military to invade and occupy Iraq--with disastrous results. Have you ever heard of anything more ridiculous that than?","It's not that bad of a movie I liked it. granted it is poorly done and the acting isn't so great. for a cheap B-movie the special effects aren't bad. and for a Roger Corman movie it's better than some of his he's either produced or ex-produced. you want to see a BAD MOVIE?  rent CLUB VAMPIRE you will laugh till you cry the movie is so bad. John Savage is in it an it's 10 times worse than this. anyways it was different the plot has been done before an better  and the ending is predictable. Jeff Fahey isn't one of the most talented actors of our time to begin with. he's OK but he need to go back to acting school. out of five a 2 and a half which is fair. I have seen better movies true but i have seen worse also.","Saw this one as a rental film, and I just have to say it's about the worst beyond-even-b scifi film I've ever seen... The whole submarine/time portal plot is just so unrealistic and the \"poor man's Emperor Palpatine\" as The Ultimate Evil so ridicilous this thing goes down more as a b-scifi parody than anything else... If you think of renting/buying the pitiful movie, I suggest you forget it and go for Spaceballs (or something like that) instead.","This might have been on the Sci-fi channel they seem to use a lot of new and upcoming actors so don't expect the acting to be first rate. If you're a fan of B movies and like time travel stories this is worth watching. The crew of a Submarine\ngoes through a time portal and ends up 100 years in the future.\nThey are taken prisoner by some creepy bad guys and there's some good fight scenes.And some strange things as the Commander of the Sub meets his double in the future, a leader of a band of Rebels.","This is a complete turkey of a movie. Complete rip off of other movies.. footage of land chase ripped from BARB WIRE, the warehouse still has HAMMERHEAD on the front, military uniforms ripped from V, and an evil Emperor rip off from Star Wars... Completely predictable, Complete crap... Avoid ,a total waste....","TIME UNDER FIRE is a cheesy straight-to-video sci-fi thriller of the late 1990s, unsurprisingly starring Jeff Fahey as the square-jawed hero. It's an amalgamation of many films which have come previously, a 'greatest hits' package if you will for sci-fi movie buffs.Fahey plays a submarine captain whose ship goes through a portal in time, just like in THE PHILADELPHIA EXPERIMENT. When he returns he's treated like a crazy and incarcerated in a mental hospital in scenes copied from TERMINATOR 2: JUDGMENT DAY. Eventually the authorities believe his story and take him back through the portal as part of a commando team; the guys end up in an alternate reality future which has become a dictatorship ruled over by a guy who looks like Emperor Palpatine in RETURN OF THE JEDI.Elsewhere, Bryan Cranston (credited here as Brian) gives a sleepwalking performance as a suit, while Richard Tyson (KINDERGARTEN COP) is the wooden main villain. The film boasts some frankly ludicrous scenes, like the bit where Fahey kills a guard but isn't punished because, you know, he is the hero and all. The ending descends into cheesy sci-fi territory with bits of FORTRESS and STARGATE copied in. The result? Light and laughable, although it's not the worst of its type and at least it isn't boring.","I know it is an old movie and maybe this comment is out of date but here goes anyway. A waste of time and it pains me to see this sad imitation of Ian McDiarmid's portrayal of Emperor Palpatine in 'Return of the Jedi'. Lousy plot, awesomely horrible acting, and no visual effects to make it worth watching. I had more fun sitting through 'Red Sonja' and 'Hercules Goes to New York'. I would much rather sit through a whole evening of Danielle Steel movies than watch this movie ever again. We have here yet another movie which should never have been made. Just like the new King Arthur movie. Although the latter wasn't even half as bad as this movie. Whatever you do, do NOT see this!"],"review-user":["mauro-12","m.p.","barchus","guggen","liberalgems","dromasca","stephenwillyamz-1","stimpy-13","sus_elikko","briangetmail-70510","entlim-47366","Leofwine_draca","darkmoonnetwork375"],"review-date":["29 February 2000","23 August 2003","21 February 2002","27 November 1998","17 March 2009","25 November 2006","11 September 2007","6 October 2002","28 April 2001","8 September 2018","11 May 2017","24 March 2017","12 December 2004"],"review-rating":["8","1","1","1","3","6","1","4"],"review-title":[" Good premise, bad development\n"," Takes Place after a War with Iraq!\n"," So bad I had to watch it till the end\n"," Simply a terribly bad movie, avoid it!\n"," Amazingly Hilarious! I Laughed So Hard I Thought I Would Wake My Neighbors!\n"," bad sci-fi\n"," What A Hunk Of Sci-Fi Junk\n"," not as bad as they say. it's ok to watch only once\n"," Basically, it goes down as a (non-intentional) B-movie parody.\n"," Good B Sci-fi Movie\n"," Awful\n"," 'Greatest hits' sci-fi package\n"," It pains me!\n"]}