{"review-url":["http://www.imdb.com/title/tt0196516/reviews"],"review-text":["The Duke is a very silly film--a dog becoming a duke! But it's a very fun movie. It has some of those corny pranks that many kids movies have, but (thankfully!) no bodily function jokes, as so many animal movies feel compelled to have! Mostly, it's just dogs being dogs and people being. . . well, people. The 'good guys' are likeable and appealing. The 'bad guys' are ridiculous, and of course, the pun of many jokes. But there is something dignified about this movie, for even though it is silly, it's not out for every cheap laugh like \"Home Alone\" and others.Crocket, Simon and Copper do an excellent job playing Black and Tan Coonhound \"Hubert\" who becomes the Duke after his beloved owner, a real Duke, dies. For the most part, they just act like dogs, no 'talking,' or human-like emotions and attitudes. However, they do stereotype poodles, and Hubert does fall for her, just because she's a poodle. Come on! These are dogs--they have a different view of beauty!!!Overall, charming, fun and enjoyable.","In case anyone was wondering what kind of dog Hubert is, he is a Black & Tan Coonhound; the only one of six subspecies of coonhound recognized by the American Kennel Club.  Although they were bred to hunt racoons, they are also used for hunting bear and cougar.  They have a sweet disposition and make excellent family pets.","\"The Duke\" is a film based in the heart of the British aristocracy where an old Duke (John Neville) dies and to avoid his large property and the vast riches to be taken from him after death by 2 devious aristocrats (Oliver Muirhead and Sophie Heyman); he passes his Dukeship down to his dog. The dog's \"best friend\", an American girl named Charlotte (played by Courtnee Draper) whose parents die becomes orphaned by the former Duke due to him being her great uncle. A young chef named Florian arrives, with him and Charlotte instantly connecting creating a romantic sub-plot which in its own way, acts as the under tone for the main plot line being the activities of Hubert, The 'Duke' and his many activities and love interests with other dogs. All this is watched over by James Doohan who plays a Butler who is determined to try and serve his old Duke by doing his best to serve his new master, Hubert. Doohan acts as the older character there to comfort and advise the younger ones whilst he over looks and performs various ridiculous tasks under his new master. A fine comedic performance mixed with elements of drama to end the career of a fine and influential actor.Though from the technical viewpoint, I dislike this film as I only watched upon discovering James Doohan's role. Though the plot is good, elements of the writing and directing have to be obscured. Ignoring the absurdity of a \"Doggie Duke\", I personally dislike the over use of comedic and outrageous jokes upon the 'bad' characters due to their ludicrousness. The dependence on hygiene related humour as you like is much too apparent and general silliness of many characters doesn't appeal to me. The director, Phillip Spink uses mid-long shots too often with either an overdubbed voice or affecting the overall sound quality. Plus, the acting of Muirhead and Heyman, whilst good at the dramatic and romantic sequences, fall drastically short fulfilling the wholesale requirements regarding the role.But, as a mature movie fan, I find it easy to be over critical of a simple family film designed to make you laugh. I can admit I found certain bits funny and other bits touching along with a plot that may be far-fetched, but has definite connections. I do not recommend this film to mature movie fans but I do highly recommend it to Dog lovers, families who wish to enjoy a funny film for their child and James Doohan fans who wish to see 'Scotty' in his final role.","The Duke is about a real duke and his slobbering hound Hubert.  The Duke is a sensitive man who sells all his priceless painting and furniture to raise money for the poor.  Everyone in Dingwall adores them. However there is an evil-doer amongst them who wants everything for himself. On the Duke's deathbed, he overhears what is planned and in his will, the Duke leaves everything he owns to Hubert.  Now Hubert has to rule Dingwall. There are weddings, robberies, mad dog chases and true love in this gorgeous little tale.","I really enjoyed this movie about a dog who becomes a Duke.  It would have been very easy to mess this one up, but along with the humor, the script was filled with warmth and even some profundity about nobility and class.  It's a feel good movie that the whole family can watch.. even the adults!","I hate to say it but there are way too many Brits caught up in class that just don't think. Barnes Wallace has to put up with one of them in a general who won't let him create his dam busting bombs until somebody higher up puts the general in his place. The Enigma crackers have to put up with General Montgomery not using their excellent information because Montgomery is too pompous which extended the war by months. I could go on and on and on with more examples like these where they do this. This film parodies all of it. Is it a silly movie? YES! I can appreciate Key Largo, The Nun's Story, Casablanca and many other serious movies. But there is room on my plate for some silly comedies that don't go overboard. If you like movies like Blazing Saddles, the original Producers with Gene Wilder and Zero Mostel, and Being There, this movie is of the same genre. If you liked those movies then you will probably like this one, but if you didn't like those movies avoid this one. The first ten minutes alone made the movie worthwhile. Comedy can be overplayed or underplayed. This one was done to my taste but may be over-blown for other viewers.","I didn't hate it but the plot was so stupid. It was about a dog who became king after the king named him heir! How does that even work! I watched this with my Grandma who loves dog movies. It's more for these people than me. If that's you, enjoy. if not, there's better movies you could be watching instead.","In Olde England, there is an aging Duke. His beloved wife is deceased and his closest relatives are snooty grifters. Therefore, his dearest friends are a grand-niece and a beloved dog. He is blessed with a most loyal butler, too (James Doohan). One day, when he and his niece are out riding horses, the Duke suffers what may be a heart attack and goes home to bed, never getting up again. As he lays dying, he makes a new will to leave most everything to his dog, with his niece as the caretaker. After the funeral, all interested parties show up for the reading of the last will and testament. The grifters, already gleeful at their anticipated inheritance and titles, give the staff pink ships and lock the dog in the attic, for he annoys them. But, ha ha! Duke breaks out of the upstairs and arrives just in time to hear of his own rise to aristocracy! Advantage, doggie! The niece is delighted as well, for she loves the dog, now named The Duke. She has a new admirer, too, a lad who comes to work in the kitchen. But, as one might guess, the dastardly disinheritors comb the laws of royalty to find loopholes. At first, they discover the new duke must have a ball and gain the queen's approval to get the title. Foiled again! The niece hires an etiquette expert, the Duke learns how to act in high society, and the queen boogies at the ball before bestowing the title. But, as this Canine Royal has long had an affection for another dog named Daisy, the grifters decide to entice Duke with a spiffy poodle, ending in \"dog marriage\", so that they can control the Duke's little fiefdom. Will they succeed at last? This darling bit of silliness is greatly enjoyable. Most families will love the story, cast, settings, costumes, and beloved canines. What a stitch to see dogs join a conga line and wear fancy dress. In fact, the dog playing Duke is one talented pooch. So, this Duke's no fluke, seek it out soon.","Even those of us who like cute animal pictures --- and I abhor them ---would be hard pressed to find any merit in this abysmally bad travesty of a film. Perhaps inspired by \"101 Dalmatians\" with its smart and loyal dogs, its dumb and devious humans and its absurdly \"happy\" and predictable ending, the alternate title \"101 Turkeys\" springs to mind. That would just about cover everyone involved in its unfortunate production. I dismissed it as some inane Hollywood perversion of British customs before learning, to my horror, that it actually is a Canadian film, done in Victoria BC, that phony British theme park of a town, while sucking tax dollars out of Ottawa ON, that equally phony pit of Canadian mediocrity. Let me count the ways it is bad. The dizzy plot? The asinine script? The dismal performances and sophomoric direction? The cloyingly clever animals? The endless clichés and predictable slapstick? On second thought, neither I nor those browsing the IMDb have time for a complete catalogue of its failings. Yet were I to detail its merits, this space would remain blank. Trust me, it is bad; a signal monument in the vast pantheon of truly terrible (Canadian) cinema. If you have seen it already, my condolences. If you have not, stay away from it as you would SARS or bubonic plague. Or other movies with cute animals. Don't even let your children see it lest their tiny minds be warped by the even tinier minds of those who financed, fabricated and filmed this frightful folly. Perhaps tonight, when I retire, I will have a nightmare with ghastly fanged beasts springing from the bed table as I flee in frantic flight. I hope so. It will be a far far better thing I do than watch this beastly banal boondoggle. But then, I might dream that I had to watch it a second time and the sheer terror and cold sweat of that makes me want to stay up all night, trembling at the very possibility of seeing it again even as a bad dream. I might even find something worthwhile to watch in its stead. Maybe \"Godzilla\" or \"Attack Of The Killer Tomatoes\" Perhaps the instruction video for my built in vacuum cleaner.","Friends, beware. This movie is bad. Really bad. Like there are no ways in which this film is not bad. Where shall I begin?Perhaps the camera work? To put it bluntly, the whole movie seems as if it were filmed by a cheap Dollar Tree Kodak smashed to the wall with a piece of moist bubble gum. I got a crick in my neck trying to understand the bizarre angles that these directors evidently thought were \"artistic.\" The acting? Horrific. What back alley did they scour to find these wretched excuses for thespians? If any one of them found a penny on their way to the set, they'd be grossly overpaid. The plot? What plot? The plot had as many holes as the inexplicably pot-hole filled, overused driveway \"joke\" from the film. It seems as if the directors picked up a cheap copy of The Idiots Guide to Movie Clichés (much of which would have gone over their heads) and utilized every page. Twice. The movie has about as much continuity and clarity as an ADD 5-year-old in a crayon shop. The whole movie makes you feel as if you have just missed a previous scene.I've never witnessed a film where every single character elicited such disgust and revulsion. It's like it didn't let up. They failed at even playing normal human beings. It might as well have been filmed with Martians. I mean, a dog is crowned the Duke of Dingwall. (A fitting name...) And what do the inhabitants of this bizarre little town do (who are so often mentioned and yet so rarely seen, except when portrayed by repeat actors from previous scenes...)? They applaud the whole way!I won't even venture into the awful \"sloppy-joe\" sequence. Such a banal and iniquitous perversion of the art of cinema should never even have been thought of.In sum, this movie was not worth the 8 seconds it takes to put the DVD into the player. It is a monument to how far a few desperate actors and \"filmmakers\" will go to make a buck or two. Which is evidently pretty far. Pretty much, the only difference between this film and a bucket of garbage is the bucket."],"review-user":["remobec","IRD","PrivateBits","oscar","Susan G","henryhertzhobbit","cinephile-27690","inkblot11","rps-2","braden-jacquot"],"review-date":["9 July 2002","16 February 2001","13 July 2008","14 August 2000","4 October 2001","7 May 2012","29 May 2018","26 July 2013","30 March 2005","22 December 2013"],"review-rating":["8","4","10","9","8","7","1","1"],"review-title":[" Silly but Fun\n"," A little on the corny side, but endearing...\n"," Not recommended for mature movie fans\n"," Fantasy Fairytale for the whole family to enjoy\n"," A classy script!\n"," There is more truth in comedy than fiction\n"," Not bad, but...\n"," Cute-as-a-button silliness, families will enjoy it\n"," A truly awful movie.\n"," A Royal Sucking\n"]}