{"review-url":["http://www.imdb.com/title/tt0107863/reviews"],"review-text":["This movie has some great character actors, Isaac Hayes, Woody Strode, Pam Grier, Paul Bartel, and unfortunately they are mostly wasted. The development of the main characters is too rushed, and the story races on at a breakneck pace. \"Posse' borrowed liberally from the \"spaghetti westerns\" ( revenge flashbacks as in \"For a Few Dollars More\", gattling gun as in \"A Fistful of Dollars\", coming of the railroad as in \"Once Upon a Time in the West\") The movie tries to accomplish too much too quickly, and makes one wish that the deliberate pace of the \"spaghetti westerns\" had also been \"borrowed\". I rate it a 5.0, very average, and a missed opportunity. - MERK","An awful film; badly written, badly acted, cliched, hackneyed, dross. The premise is such a good one and a chance to educate about black cowboys but the film is truly dire. It is a curious mix of a bad 1950's Randolph Scott B movie and a bad 1970's spaghetti western. The villains are cardboard, the flashbacks laughable, the dialogue excruciating.The deliberate anachronisms (such as 'Victorian' rap singers and modern swear words like \"motherf****er\"), are irritating to the extreme.A Frankenstein monster that died on the lab table.","\"Posse\" is a great movie!! It's basically something nobody has tried before: telling the tales of the first great black cowboys. Mario Van Peebles wears both hats as he works as both an actor and director for this film, about a black infantrymen named Jessie Lee leading his fellow troopers into battling white supremacists and his former commanding officer (played with slimy exception by Billy Zane). \"Posse\" has everything a good western should have: great gun-fights, cool performances (especially by Van Peebles, Stephen Baldwin, and Big Daddy Kane) and a triumphant ending.","Ok, maybe Posse can't compare to other popular cowboy/western movies.  But that's because it didn't have the FUNDING those movies had.  Obviously, whenever you want to produce a story such as this one, focusing on African American historical involvement (and NO, servants and 'mammies' are not historical involvement), Hollywood isn't going to be too supportive.  And believe me they weren't.  The producers and actors sacrificed a lot of 'out of pocket' expenses to make \"Posse\", just so that the story could be told. I think that alone is commendable.  Posse may not be Oscar material (and they don't like Black media too much either), but it is a start.  It is entertaining, and it introduces us to the black cowboy, a character most of us are unfamiliar with.","Visually stunning, extremely rich in detail, fast action sequences, innovative camera movements, and an historic interpretation of afro-americans settling in the west in the late 800's, this movie is highly unconventional.  The more recent \"Wild Wild West\" has some similarities, \"The Ballad of Cable Houge\" comes to mind.  Using comedy, fantasy, surrealism, the plot has a group of afro-americans traveling with a case of gold, chased by a posse.  They join a settlement of afro-americans in the West, which while free by law, are reminded by the neighboring white towns that their liberty of action does not border out of their free town, and their law does not apply to white people.  In a poignant scene, the only white man, who was in the original group of afro-americans with the case of gold, is brutally killed in public view by the white neighbors, almost to demonstrate that a white folk that joins the black folks has reached his lowest social status, lower that simply a black man, which by law cannot be killed without reason.","This move is bad on so many levels I don't even know where to start. OK - the good points - Peebles is beautiful as a dirty outlaw in black leather. Some of the landscape photography was stunning. That's about it. Oh, and it was a nice touch having the buffalo head above the bar door in Freemanville, I figure it was a nod to the Buffalo Soldiers. The movie starts sort of OK but the characters are so flat, so comic book, so 'much', the bad guys are just over the top bad, I choke trying to describe them further. The Spanish-Cuban-American war was 1895-1898 with America being involved only in April to August of '98. I think the movie said it took place in 1893 (I could be wrong but I don't want to look at it again to check). A big part of this movie hinged on the KKK killing Jessie's daddy. Well boys, the original KKK started in 1865 and was destroyed by President Andrew Johnson in 1871. The Klan wasn't even around during the time period of this movie. Of course the nasty bas**rds got busy again in 1915 and we know the rest of that. BUT for the purpose of the movie it is historically incorrect and that was a major part of the plot. I think I could make myself crazy going into it a lot more so here a few jabs and I'm done. I didn't know that Boyz2Men and other bands like that got their inspiration from New Orleans street singers from the 1890's. I also didn't know that fetish necklaces were all the rage for Sioux women in the 1890's...but then I was surprised to see a bar singer doing jazz while wearing acrylic 1\" nails... We just about died laughing and I like a cheesy western more than most people do. Such a waste of talent and money - this really had the chance to show a part of American history that isn't well known. http://www.coax.net/people/lwf/bkcwboy2.htm for some more information. This could have been so good but it was just....bad from 1-10 this gets a 1 instead of a zero because Mario looks good in his hat and there was an Appaloosa horse in the film.","I'm not the biggest fan of westerns. My two personal favorites though are Unforgiven, and Tombstone. This movie though, I loved! It was great! The plot was well done, and it was a fun movie. Everybody who had a part in this movie did excellent! I even think it beat out both movies in someway. Well, not really Unforgiven because that was a superb movie that these two can't compare with in the long run. I do think it beat out Tombstone though. Both had there strong points. For instance, they both had excellent well known casts, very good plots, and very good filming. But Posse beat out Tombstone in four ways in my opinion. First, the characters were more unique in Posse. The music was better in Posse. The idea was original in Posse, unlike Wyatt Earp. And the biggest difference, the action sequences! Oh my gosh! Posse was a western with really good action sequences. I mean really good! The action was fast paced. Like modern day based shoot'em up movies. The action had big budget explosions too! The fistfights were pretty good also. Mario Van Pebbles was great in this movie! I suggest buying this excellent movie!","I think that Mario Van Peebles movie Posse is a very important film. It is an excellent entry point film to a side of history many are not aware of. This is a story of early black settlers, cow boys and infantrymen returning from the Spanish-American War with a cache of gold. The main character Peebles is haunted by memories of his murdered father. The racism applied to the new black settlers and infantryman is explored in this film with excellent casting including Melvin Van Peebles (Marios father), Billy Zane, Stephen Baldwin and a wonderful performance by Big Daddy Kane. One senses that Peeples strived to use as many notable black (and some not so notable - smile) actors as possible : ) Perhaps too many, some notable persons (Issac Hayes, Pamela Grier) are only scene in cameo, others briefly such as Tone Loc. The sentiment and efforts of Peebles efforts to expose these actors will be understood by some. The large cast (a feat for any director) work well and do a good job of telling the story in the classic \"revenge and fight vs justice\" western.Most noteworthy was the wonderful narrative role of veteran actor Woody Strode (from Once Upon A Time In The West), who's own life was a barrier-breaker, within the context of a previous era not yet completed faded from memory. No other actor could have done this role better. Read the mini-bio on Woody Strode here as a primer: http://imdb.com/name/nm0834754/bio The film does a good job of balancing action with a bit of sardonic humour. The dialog was excellent if a bit contemporary! And as others have mentioned the profanity was not accurate to that period. The sex scene was a bit much -- not really needed. There are some historical inaccuracies such as the seeming electronic branding of the cattle etc. But Posse is a good effort to hopefully open the door for more historical and creative works reflective of other untold stories and events. The actual photos of real cowboys at the end credits was very nice touch.","So a great concept, such great actors, and what do we get nada, zip, zippo, caput, no more, out the door, so long, good bye, mierda. This film has its good points but the script just did not go anywhere. Alot of the characters just went back and forth in their personalities, others just never really made a difference. Some talked like they were time travelers from the future (hint, hint Tone Loc). Others just wouldnt shut up (Weezie). One thing i just couldnt wrap my mind around was this if in the future the old man is holding a picture of the cast. How could that be possible if most of them died before they could all meet? Its like one of those time paradoxes that gives you a head ache. Not to mention the ending was a bit melodramatic to say the least. All in all i give Posse a \"A\" for effort but \"F\" on delivery.","Thank you Mario Van Peebles for informing us of not only the existence of black cowboys, but providing a compelling story that was easy to follow.The plot, backdrop, music and talent were all top notch. It was great that you used so many African-American artists to tell the tale of the black cowboy. It was also good to see Billy Zane in this movie. Does he ever play a good guy?I would highly recommend this film to anyone who wants to broaden their way of thinking. This is an excellent movie and I feel privileged to have seen it. Hopefully, you'll feel the same.","The best and greatest thing about this film, the only thing, is an opening narrative by the great Woody Strode, who was a unique and ground breaking African American actor, who was also 75 per cent Native American. He sets us up with the premise that there are many great stories of the African Americans who moved west, built towns, became cowboys, and whose stories are never told. From this magical and promising beginning we enter a cartoon, clichéd, pointless parody of parody and what could have been a great and serious tale is just another really bad movie. Casting, one note comic actors like Mario Van Peebles as the lead is the first sign that no one here wanted to make a serious film. He is the type of actor that makes one praise the on and off switch on the video player. As many other commentators have noted, this was such a great idea for a film, yet the actors and the director failed, and failed absolutely.","Wow, what a racist, profane piece of celluloid garbage, and what an insult to the great genre of Westerns.Exploitive? Sex scenes abound, profanity abounds, violence and gore abounds.....everything that gives modern movies such a good name, especially among those who prefer classic-era movies. This is the kind of sleaze that gives the old folks ammunition against today's films. Somehow I just can't picture nude male bathing scenes in Randolph Scott or Gene Autrey films. Nor can I picture hearing \"motherf---er!\" exclaimed here and there. I sincerely doubt that word was even around over 100 years ago. Yet, the f-word is so prevalent here you'd think you were watching a story centered in today's urban areas, not the old west of the 1800s.Prejudice? Well, what if all the white characters were good guys and every black person was the nasty, brutal villain? Do you think someone might complain about a racist movie? Home come we don't hear an outcry when the reverse - as demonstrated in this film - is shown in hundreds of theaters across the country?Mario Van Peeples wrote, directed and starred in this bomb. Remember that name. Apparently, he is the \"Ed Wood\" of today's filmmakers. Even Spike Lee wouldn't be this racist. You can't get much worse than this movie.","With Posse I believe they had a great IDEA for a movie, but unfortunately great ideas is only where it starts. Poor acting, bad direction, and unbelievable characters all added to this flop. It seems the director was torn between screening a serious look at blacks in the wild west or a parody of a western. Either of which, he failed miserably at.","I rarely give a 1 star rating because I try real hard not to. I look for any reason I can to give higher than a 1 rating because this is someone's work. Someone or someones took the time to put this movie together. Sure, it may not be the best movie but they took the time to make it so that has to account for something.Not today.Posse was bad on multiple levels: the story, the script, the acting, the camerawork. I can't believe it's considered a western. Western is one of my favorite genres and this does not belong amongst westerns. This movie was to westerns what Donald Trump is to diplomacy.I suffered through this movie until a certain scene. This scene had me laughing out loud which was somewhat miraculous considering how royally upset I was with the film til this point. It was a showdown in the town of Freemanville and a corrupt unit of the army had brought in a Gatling gun. Jesse Lee (Mario Van Peebles), the hero, has a genius plan to disable the gun. He's going to use dynamite. Not a bad idea Jesse. How are you going to get close enough with the dynamite to light it and toss it near the Gatling gun without getting shot up? Strap it to an arrow? No. He lights the dynamite wick, puts the lit dynamite stick in his mouth (yes his mouth), shoots a man, mounts a horse using the dead man as a human shield, then gallops towards the men reloading the Gatling gun, shoots the two stooges at the Gatling gun, and as his horse leaps in the air he tosses the dynamite on the platform with the gun just in time for the dynamite to blow.ROFL. Are you kidding me? Are you kidding me right now? You've got to be kidding me.At that point I decided that I could no longer fight the one rating. Mario Van Peebles was dead set on getting a one star rating from me no matter how hard I tried to grade on a curve. So I will oblige.","When I heard about and saw the trailers for \"Posse\" I was eagerly waiting for the film's release. African-Americans made up fully a third of all cowboys in the Old West, but were virtually non-existent in Hollywood's Old West, except as train porters or mammies. The only real black cowboy seen by most Americans was Woody Strode, thanks to John Ford (\"Sergeant Rutledge,\" \"The Man Who Shot Liberty Valance, \"How the West Was Won\"), Richard Brooks (\"The Professionals\") and Italian filmmakers (\"Once Upon a Time in the West,\" \"The Revengers,\" \"The Unholy Four\").\"Posse,\" written, produced and directed by Mario Van Peebles, had promise. Unfortunately, it gets bogged down by cliches and a tired storyline. A rousing climax almost saves the film, though.The movie begins with a stark history lesson about the true accomplishments of blacks in the Old West, as told to Reginald and Warren Hudlin by an old man (the legendary Woody Strode). He then segues into the fictitious story of Jesse Lee...Lee (Mario Van Peebles) and his men are getting cut to pieces by the Spanish during the Spanish-American War while their commanding officer (a slimy, but effective Billy Zane) drinks Cognac miles away. Lee complains about the conditions and is arrested. Zane later promises to exonerate him and his men if they will pull off a mission for him -- namely to steal valuable documents from the Spanish. Stephen Baldwin is thrown in with Lee's gang because he's a troublemaker Zane wants to get rid of.    The group pulls off the mission, but, instead of finding documents, they find gold bullion. They also find Zane and his cohorts waiting at the rendezvous point with guns to finish them off. Unfortunately for Zane, his men are like Teddy Roosevelt's Rough Riders -- long on bravado, short on skill. Lee's men, having been in combat, get the drop on Zane, kill most of his men and flee back to America as wanted men. (By the way, the method they use to get out of Cuba and back to America is original, but very creepy).The middle part of the film is spent showing Lee and his men (rapper Tone Loc, Baldwin, a whiny aide and a few spares) heading to New Orleans, where they meet up with Big Daddy Kane. They also run into Zane, who has been tracking them. The whole tracking plotline is hard to believe (remember how long it took John Wayne to track down Natalie Wood in \"The Searchers\"?), but it makes for good shootouts.Eventually, Lee and his men make it back to Lee's hometown, a black township full of freedmen. Such townships were numerous in the Old West, but survived only at the whim of white county officials (watch \"Rosewood\" for an example of what they often suffered from). The town is run by Richard Jordan as a greedy sheriff in cahoots with some crooked county officials. Throw in Zane and his own posse, along with a Gatling gun and you get the rousing climax.Mario Van Peebles is not much of an actor, but he has enough range and skill to carry the burden of being Jesse Lee. Baldwin is not quite up to par with brothers Alec and Daniel, but he holds his own, especially when he meets his demise at the hands of fellow whites. I liked Big Daddy Kane's soft-spoken, but proud and defiant, role as Father Time and the way he kept looking at his pocket watch before doing anything. Tone Loc was a waste, though, since he kept rapping like it was 1998 instead of 1898.The town basically had one purpose and that was to show off an impressive cast of black stars -- Melvin Van Peebles, Pam Grier, Reginald Vel Johnson and Nipsey Russell, among others. Of course, having a cameo meant biting the bullet (literally) in the finale.By the way, another problem for \"Posse\" was its setting. Many contributions and accomplishments by African-Americans came during the years following the Civil War, from 1865-1890. Black soldiers became the vaunted Buffalo Soldiers who protected white settlers and tracked down Geronimo. Freed blacks moved west in droves as homesteaders and as cowboys on cattle drives because many white men had been killed or maimed during the war. Black townships sprang up in Oklahoma and Arkansas. Black lawmen like the legendary Bass Reeves were in abundance, especially in Oklahoma and Texas. By 1898, blacks were in a decline (despite their bravery in the Spanish-American War) that would not be reversed until World War I. Surely, Van Peebles could have drawn up a storyline set between 1865 and 1890.\"Posse\" has a lot going for it. It's too bad Mario Van Peebles went for cliches, shootouts and tired storylines meant to sell tickets rather than tell a good story. \"Unforgiven\" and \"Tombstone\" showed you can do both.","I saw this film not too long ago, nd I must say it was enjoyable.  The Posse of the title is quite an impressive grouping and Mario Van Peebles as their leader turns in an impressive performance as he turns against his cruel commanding officer and sets out on a revenge quest.It's been known for a while now that there were black cowboys and this film shows exactly what they had to put up with.  As for the film's villains, Billy Zane is very good as a chew-the-scenery camp villain, but the really hateful one is Richard Jordan as a corrupt white sheriff. \nThe action sequences are handled brilliantly.  Things could have been improved about the movie, however.  For instance, capable performers like Pam Grier, Isaac Hayes and DIE HARD's Reginald Veljohnson appear but are given a set of thankless cameos (I don't think Grier even has any lines.). \nSPOILER POSSIBILITYAlso, Tone Loc as Angel, the sixth member of the Posse is killed off incredibly early in the film.  Strangely, at the start of the film, we are shown a picture of the Posse which includes him and Father Time.  But the thing is, Angel is killed before Father Time actually hooks up with the posse.  In addition, although he comes good in the end, Charles Lane's character is a real creep at first.  It's only the sacrifice of Stephen Baldwin's Little J that he comes good.These gripes aside, POSSE is a very enjoyable film and worth spending time viewing.","I wanted very much to enjoy this film. When it was released I wasn't interested in watching any westerns. I'd come back to it because I believe Mario Van Peebles has a great film in him. Unfortunately, this one is not it. It is ambitious and the multi-racial cast gives it a good go. The various skill and talent levels aren't blended correctly to make an organic, cohesive whole. A shame because its clear that Robert Hooks is trying really hard as is Billy Zane. Seeing old school players like Lawrence Cook and Pam Grier trying to make sense out of their brief story arcs was a chore. The biggest problem for me was Mario at some point decided to make it a vanity project because it started out a decent, 40's style western(albeit with nudity and some extreme violence)that morphed into a weak Clint Eastwood imitation. The contributions of rap star Tone Loc were pitiful at best but Big Daddy Kane worked harder and his work was credible. Richard Jordan and Blair Underwood are so intriguing together that they are almost in a different, better movie. There are a lot of moments like that in this film where you sit frustrated at the editing and continuity decisions made by the director and the cinematographer. What is clear is that the script is pointing to a much, much better film than what is being delivered. Oh, BTW, the word 'motherfucker' has its origins in the antebellum slave culture of North America. I've seen many complaints here about the usage of that epithet and how it shouldn't have been used during that era(1898). Research the word and you will discover its bleak and stark history. If you were a fan of the show DEADWOOD you would have noticed that the character Swearingen peppered his remarks with the word and it even popped up in the film Heaven's Gate. I have to give it up again to the Billy Zane for his spectacular death scene. I didn't have that big of a problem with the New Jack Swing musical stylings imposed on the film's soundtrack but I did take issue with the lack of banjos and fiddles.A blown opportunity for greatness.","spoiler--In 1993, African-American director/actor Mario Van Peebles followed up the tremendously popular urban-action film New Jack City with \"Posse\". The film was co-written and directed by Van Peebles, who also stars as the main character, Jessie Lee.Plot: The film begins at the turn of the 20th century, when the United States was embroiled in the Spanish-American war. Apparently a time when the U.S. justice system could send convicts into military service, Jessie Lee finds himself an unwilling enlisted man, serving with an all-black cavalry troop in Cuba. Some of his compatriots include Little J (Stephen Baldwin), fast-talking Weezie (Charles Lane) and the towering-but-simple Obobo (Tiny Lister). They find a hidden chest of gold on a reconnaissance run and decide to keep it. However, the ambitious, bigoted Colonel Graham (Zane) finds out about the gold, and is apparently willing to kill Jessie Lee and company for it. A shootout between the Graham's forces and Jessie Lee's leaves the colonel blind in one eye, and his forces retreat. Jessie Lee's ragtag crew manage to smuggle themselves (and the gold) back to New Orleans, but it turns out that Graham isn't far behind. Jessie Lee and his allies are forced to go on the run, heading west, to a town called Freemanville. Apparently, Freemanville was founded by blacks in the years following the Civil War. Jessie Lee's father, \"King David\", was the charismatic preacher who co-founded the town. However, as is revealed in intermittent flashbacks, King David was soon brutally murdered by a white mob, in a parallel of the Ku Klux Klan terror campaigns that began around the same time. Jessie Lee and company eventually find their way to Freemanville, only to find that the townsfolk aren't exactly glad to see himespecially when Sheriff Bates (Richard Jordan) of a nearby white township makes it clear that he wants Jessie Lee and his partnersdead or alive. Carver (Blair Underwood) is the sheriff and de facto mayor of Freemanvilleand his own agenda may not square with having Jessie Lee around.Analysis The action sequences are all very credible, and Mario Van Peebles turns in a good performance as the brooding hero. In the aftermath of the success of New Jack City, it was almost expected Van Peebles would helm a sequel, or at least a similar urban-action follow-up. Instead, Van Peebles looked 100 years into the past, creating a mostly-black Western (effectively 'updating' the black-themed Westerns of the 1970's), and continuing the legacy of largely-forgotten black-themed cowboy films from the early 20th century. Unlike New Jack City, the film was independently financed, and originally released through Gramercy/Polygram Entertainment. Allegedly, execs at the major studios balked when Van Peebles pitched 'Posse' to them. Some of the more \"curious\" casting at the time involved rappers Big Daddy Kane and Tone Loc as Father Time and Angel, respectively. In certain interviews, Mario Van Peebles has said that he often likes to cast against type; in the years since, the trend of casting rap singers in non-musical films would become almost commonplace. Keen viewers will notice several cameos by various entertainment personalities: Black-action film veterans like Isaac Hayes (\"Truck Turner\"), Pam Grier (\"Foxy Brown\") and Larry Cook (\"The Spook who Sat by the Door\") show up, as does stand-up legend Nipsey Russell, not to mention TV producer Stephen J. Cannell (who hired the junior Van Peebles to star in \"Sonny Spoon\" years earlier). The film is bookended with Woody Strode (\"Spartacus\") in a key role.","I'm not the biggest fan of westerns. My two personal favorites though are Unforgiven, and Tombstone. This movie though, I loved! It was great! The plot was well done, and it was a fun movie. Everybody who had a part in this movie did excellent! I even think it beat out both movies in someway. Well, not really Unforgiven because that was a superb movie that these two can't compare with in the long run. I do think it beat out Tombstone though. Both had its strong points. For instance, they both had excellent well known casts, very good plots, and very good filming. But Posse beat out Tombstone in four ways in my opinion. First, the characters were more unique in Posse. The music was better in Posse. The idea was original in Posse, unlike Wyatt Earp. And the biggest difference, the action sequences! Oh my gosh! Posse was a western with really good action sequences. I mean really good! The action was fast paced. Like modern day based shoot'em up movies. The action had big budget explosions too! The fistfights were pretty good also. Mario Van Pebbles was great in this movie! I suggest buying this excellent movie!","\"New Jack City\" director Mario Van Peebles and scenarists Sy Richardson and Dario Scardapane pay homage to virtually every memorable Hollywood western with \"Posse,\" an elegant inventory of clichés ranging from \"Butch Cassidy and the Sundance Kid\" to \"Once Upon a Time in the West.\" Derivative as all get-out, this R-rated horse opera delivers a little bit of everything, from a search for gold in Cuba to a desperate flight across the mountainous badlands of the American west. Although it borrows from every iconic oater, \"Posse\" qualifies as one of the best African-American westerns, with a distinguished cast. \"White Sands\" lenser Peter Menzies Jr.'s stylistic cinematography endows this adventure a mythic, larger-than-life grandeur. Aside from the atmospheric settings, \"Posse\" benefits from Van Peebles's muscular helming and charismatic performance as the protagonist. He wears a flat-brimmed black hat, has a couple of six-guns holstered in belts crisscrossing his waist. Of course, he can brandish them like chained lightning and plug his adversaries dead-center with every shot. Peebles surrounds himself with a first-rate cast, including Woody Strode, Stephen Baldwin, Tommy 'Tiny' Lister, Blair Underwood, Billy Zane, and Richard Jordan. This rugged, hard-riding horse opera unfolds initially in Cuba during the Spanish-American War in the 1890s. Arrogant U.S. Army Colonel Graham (Billy Zane of \"Titanic\") orders Jesse Lee (Mario Van Peebles of \"Heartbreak Ridge\") to take a group of predominantly African-Americans in civilian clothes, infiltrate enemy lines, and bring back whatever he can find. Jesse Lee, Jimmy J. 'Little J' Teeters (Stephen Baldwin of \"The Usual Suspects\"), and Obobo (Tommy Lister of \"Friday\") stumble upon a chest of gold coins. When Colonel Graham happens upon them-prepared to shoot them as deserters and confiscate the loot for himself-Jesse shoots him in the eye and escapes with the loot. One of Graham's disgraced African-American troopers, Weezie (Charles Lane of \"True Identity\") turns against Graham and helps Jesse and company get away from Cuba. They are shipped out in coffins and taken to the mainland in Florida. From there our heroes light out for the Wild West. Graham follows them in hot pursuit with a patch over one eye and greed pumping through his veins. Graham is every inch a dastard, and he maintains his own 'posse' that has earned the name 'the Iron Brigade.' Tirelessly, they track our heroes across the west to an African-American town, Freemanville, fears the angry, racist whites in the nearby town of Cutterstown. Sheriff Bates (Richard Jordan of \"Lawman\") is one of several men who killed Jesse's father, King David (Robert Hooks of \"Trouble Man\"), and Jesse has vengeance loaded into his six-shooters. Incredibly enough, the scene that sticks in the memory is the death of Jimmy J. 'Little J' Teeters (Stephen Baldwin) because a gang of angry whites beat 'Little J' to death in front of a crowd of African-Americans. The irony here is revelatory. \"Posse\" proclaims proudly the exploits of African-Americans on the frontier. Specifically, Jesse's unit Buffalo Soldiers of the U.S. Army's 10th Cavalry Regiment. Similarly, the legendary but largely forgotten Hollywood actor Woody Strode serves as the anonymous narrator who introduces and concludes the movie. Much of what he utters is designed to challenge audiences with a limited acquaintance with African-American history. Indeed, the other thing that sets \"Posse\" apart from every other western is its theatrical celebration of African-Americans and African-American History. Van Peebles orchestrates some slam-bang action scenes with lots of gunplay and explosions. The explosion that destroys the Gatlin gun in town looks like a napalm strike. As symbols of rank and authority, Zane and Jordan constitute two truly slimy villains. Zane's creepy Graham howls \"rewards and retributions\" throughout \"Posse.\" Rounding out the cast are Pam Grier, Isaac Hayes, and his own father Melvin Van Peebles. Although its message gets heavy-handed at time, \"Posse\" ranks as a landmark African-American movie, a solid western, and an entertaining shoot'em up with a touch of inevitable romance.","In many Western lore, cowboy legends about lawmen, outlaws, and life in the Old Frontier period have been mostly centered around Caucasians. Very obscure do we ever examine the Wild West where African-Americans have the chance to tell their own tales about them running their own cities, laying down their own laws and fighting off against outlaws who want to stir trouble in their neck of the woods. There's not much reading material about this subject and very little Hollywood movies are ever made about African-Americans striving in the rough scenery in the Old Frontier.\"Posse\" was a pivotal step to tell a great story in this compelling and refreshing story that is loaded with originality. It had potential to be a really good story, sadly director Mario Van Peebles tends to go overboard by practically rubbing the story right in-your-face to get his message across. At times the historical references become so overly done, the actual story becomes secondary which can be very distracting and disjointed. It may look good for a documentary, but for a movie, it makes the entire story very thin. Aside from that the quick-cuts from scenes are very distracting and the noisy backgrounds are also too loud that it upstages the dialogue provided.Van Peebles is without a doubt an excellent director. He was outstanding in the 1991 film \"New Jack City.\" So where are the flaws in \"Posse\"? Did he feel that the dryness from the basic story needed some much-needed tweaking on the visual references? Did he just lean towards the style and forgot that a story to develop we also need substancebecause were weren't getting any here? Set after the Spanish-American War U.S. Army 10th Calvary Regiment led by Jessie Lee (Van Peebles)joins forces with Weezie (Charles Lane), Angel (Tone Loc), Obobo (TinyLister) and Caucasian ally Little J (Stephen Baldwin) courageously step up to winback their city from the corruption from racist outlaw Colonel Graham (Billy Zane). The fight scenes feel very anti-climactic and the soundtrack just carries on like it's a an overlong music video.Once the war is over, the Calvary heads home to Freemanville, where Jessie grew up. Only to realize that his community has changed and is now been taken over by racist neighbors and a law enforcement that caters to white people. Therefore, the posse joins forces to restore their town and to wipe out the corruption.For a story of this magnitude, it had a lot of great material for a an interesting and provocative Western story that has never been looked upon. But instead we get a simplified, lazily scripted visually-laden shoot-em-up fight between good against evil. The story line is never in full focus and the characters are not that easy to care about because the development is poorly structured. It's just too dependent on action but it's all without purpose.You've heard of the quote, \"too many cooks spoil the broth\". Well Van Peebles casts a plethora of big name stars from Isaac Hayes to Blair Underwood from Pam Grier to Nipsy Russell. Well as big as those names are, they don't really have much to do here and that an extra would've been better cast in their roles.When all the dust settles all the message we get is that white people then and now continually deprive the black man from equal opportunity, no matter how much they have succeeded over years. The freely utilized preachy ways were handed out to what the story failed to offer. If these closing messages were with us the whole time, \"Posse\" would've been a better film instead of succumbing to an endless array of sloganeering.","I enjoyed this movie extremely. It was the last great Mario Van Peebles movie I know of. It had a hip-hop old west flavor to it.  Big Daddy Kane and Tone Loc had major parts. It shouldn't have won any Oscars, but it was enjoyable all the same.","A good old-fashioned flight-and-revenge western, given a twist and a touch of gravitas by injecting a little black social history into its plot. Lead by Mario Van Peebles, who does OK, the gang of misfits on the run from Billy Zane's (seemingly unstoppable) army bigwig all acquit themselves well, their adventures plausible yet fun and exciting. There're some nice moody flashback scenes setting up the hero's character and backstory, a good shoot-out ending as our heroes defend the town from greedy white landgrabbers, and even Stephen Baldwin isn't bad in this enjoyable, quite powerful western.","Not overly dramatic; most westerns aren't. Honestly, I thought it was better than Tombstone. Don't be a fuddy-duddy bigot and think all westerns have to be Caucasian-- if it's a good movie say so. Colonel Graham(Billy Zane, I think) is hyper funny in this movie--keeping your interest all the way. His bantering back and forth with Jesse(MarioVP), Lil Jay(Baldwin), and the others was something else! If you don't like Mario Van Peebles' movies, don't let that keep you from seeing this movie! I don't remember liking any other role that he does in any other movie(except possibly Mama Flora's Family), but I do give him an A for this. He acted \"seriously\" as a leader of men. If you only looked at Jesse Lee in this movie, you would be thinking that he's a Denzel or Hanks type actor. Then, add in Blair Underwood(He is the main Uncle Tom: Carver), Mario's real life dad(Melvin, I believe), Big Daddy Kane(father Time), Sheriff Bates, and \"Denzel's wife\" in Antwone Fisher/FBI agent in Ransom(Jesse Lee's lover). There are also other famous stars(Grier, VelJohnson, Hayes, etc.) in minor roles. Meteor Man once tried to do a similar thing(a lot of good to very good actors in one place), but that movie has nothing at all on this! It seems like everyone did a pretty good or better job. What's under the hood? It's a western that has humor, harmonious characters, and war between people just trying to survive(with only agility, amateur gun, and a few fast guns and able fighters on their side), and extremely racist people and their allies(with military weapons on their side). A few gunfighting scene seems a little surreal; most of them seems at least good. It also was well written. That being said, tiny parts appear to be illumatic in nature: the alternate religion and calling its doctrine the good book(bible has been called that) and crafting a king David(who had moralistic, but antibiblical beliefs). There are also 2 scenes of nudity(confined to the same area of the movie at about 1/2-2/3 way in): bathing in water and sex scene."],"review-user":["merklekranz","mfrost71w","Vice-5","XavierLA","camel-9","dog_lady00","Martialartsfanatic","Juststand","Hypno-2","hopelex1","NanoFrog","ccthemovieman-1","davron2000","view_and_review","pv71989","bannonanthony","mozli","hypestyle","Martialartsfanatic","zardoz-13","eric262003","Corey_B","thehumanduvet","marsmitchell79"],"review-date":["6 March 2007","7 July 2001","28 December 1999","14 March 1999","21 September 1999","30 November 2008","12 June 2001","22 November 2003","5 November 2000","7 January 2006","19 June 2011","2 February 2008","12 September 2000","1 September 2018","2 July 2002","12 October 2003","11 October 2008","8 May 2007","12 June 2001","14 March 2018","11 February 2017","9 December 2000","16 April 2002","18 April 2016"],"review-rating":["5","1","8","1","10","10","9","2","1","1","6","9","10","7","6","7","7","8"],"review-title":[" Some good, some bad, and mostly ugly..\n"," Good idea badly executed\n"," Finally, a western with originality!!\n"," Not the best - but it's a start.....\n"," surreal unconventional Afro-American western\n"," Shoot me now - I cant believe I watched the whole thing\n"," How could you not like this movie?\n"," An important film despite flaws...\n"," Needs so much work.....\n"," Great history lesson\n"," Great History made into a pointless cartoon\n"," Vile, Racist Rubbish\n"," Good idea, BAD OUTCOME!\n"," Absolute Joke\n"," Good Concept, but it falls short\n"," Excellent, but could have been better\n"," Where are the fiddles? Where are the banjos? Anachronisms and vanity keep this from being a good film.\n"," Good Western Action by Van Peebles\n"," How could you not like this movie?\n"," A Landmark African-American Horse Opera!!!\n"," Great Action That Needed a Better Narration\n"," Critique of Posse\n"," Good formula western with twist\n"," Very Good movie--if you leave your stereotypes, western biases, and prejudices at the door!\n"]}