{"review-url":["http://www.imdb.com/title/tt0156610/reviews"],"review-text":["In the final days of the year 1999, most everyone in Taiwan has died. A strange plague has ravished the island. Supposedly spread by cockroaches, the disease sends its victims into a psychosis where they act like the insects. Eventually, they die. The Hole takes place in a crumbling apartment building (which is especially well created; kudos to the set designer!). Its two protagonists live right above and below each other. The woman is on the lower floor, and the pipes above her apartment are leaking fiercely, threatening to destroy her food supply, not to mention her sanity. She calls a plumber to go check it out, and he accidentally pokes a hole through the floor of the man's apartment. The two have never met before, and they come into contact through the hole.The script is quite brilliant. Few films are simultaneously this funny while remaining completely human, deeply exploring the human condition, especially feelings of loneliness and despair. Tsai's direction is simply beautiful. Like a lot of other Taiwanese directors, he uses a lot of long takes. But unlike, say, Hou Hsiao-Hsien, Tsai doesn't overuse them. In fact, I don't know if I've ever seen them used better. They're always effective and never tedious. It would be wrong to review this film without mentioning the musical numbers. Yes, The Hole is also a musical, and a great one, at that. In the film's best scenes - which is saying something, considering how good all the other scenes are - the man imagines that the woman is a singer, almost a cabaret singer. These numbers are fully choreographed, often with backup dancers and singers. In a stroke of genius, Tsai has these elaborately produced numbers take place in the crumbling building, the signs of apocalypse and decay unhidden. This provides both a sense of pathos and absurdity.The Hole is a film that begs to be seen. It ought to be a cult classic, if nothing else. Before I went to see this, I was told that it was a decent film, but probably Tsai Ming-liang's least good one. Well, if that is true, I just cannot wait to see another one! 10/10.","*MINOR SPOILERS*Need any further proof that Tsai Ming-liang ranks among the most original and provocative filmmakers working anywhere today? See this film.Working from slight variations of a theme running through most of his work, THE HOLE represents a study in alienation and loneliness - in this case between a man and woman who are upstairs/downstairs neighbors - and how varied structures (real or psychological) of modernity wall people off from one another. Here, the woman (the downstairs neighbor) attempts to endure as her apartment is flooded by a prodigious leak from upstairs. A plumber attempts to locate the source of the problem, then disappears after creating a large hole in the floor. Already isolated and desperate (both characters are among the few residents of a housing project who haven't fled in advance of a mysterious, near-apocalyptic epidemic). The hole linking the two apartments functions first as yet another in a long line of indignities, but soon begins to take on a significance of near-mythic proportions.Tsai's sense of humor, and sense of cinematic history is displayed with a bit more overtness than usual - as the woman's occasional daydreams revolving around her upstairs neighbor are visualized as musical numbers (set to the music of Grace Chang) which explode from the screen in brief bits of sensualistic, surreal romance and humor - quite reminiscent of the big-screen PENNIES FROM HEAVEN. And for all of the ennui and alienation on display here, Tsai's skewering of late 90s pre-millennial tensions is funny, absurd, and gives this film a very appealing strageness. The final scene is extraordinary.Meanwhile Tsai - in typical fashion - subverts most of the usual expectations or preconceptions Westerners bring to Asian cinema with a nonchalant, casually-revealed directness, focusing on both the absurdist tendencies of the human mind, and the most absolute of mundanities. There's an utter, nonchalant demystification of almost everything about his characters, sidestepping backstory or most cultural signifiers (which does amplify the isolation of the characters), making THE HOLE - and his other films - rather disorienting, but also always fascinating and insightful.","This is the movie I really like very much ,which was seen recently.Maybe,the tempo is a litter slow,and no dazing edit.But this film has its own flavor,tasting special and a litter bitter.Main scenes are just two apartment,downstairs and upstairs.But thanks to the hole,which makes this film so wonderful.It connects the whole space and characters' activities.I think this is very smart and intelligent plot design.so many things,which later happened to the man upstairs and the woman downstairs,are the sensible surprises given by the hole! Disease,which is called Taiwan fever something, is spreading in this district.Government orders all the residents live in that district to move out and to other places the sooner the better.So some people who do not want to move out live a shady and restricted life like rats.They are limited in their narrow spaces.Even in this case,but for there is a hole leaking water,two neighbors will not say a single word to each other.And even in this case,the communications between the man and the woman are merely about leaking water.Tsai ming-Lang utilizes a litter hole to break out the limitation of space and stimulate two people's relation.But he has no idea to make two people dispel the strangeness feeling hidden in the button of the heart.In modern society,not only are there walls that are used for buildings not easily being flying over,but also there are obstacles existing in people's hearts preventing them helping and communicating with each other.","Let me start off by informing the reader that I enjoy art-house films but refuse to conform to generic art-house sentiments. In other words, I am objective to the extent that I can admit when an apparent art-house film sucks. The Hole is one of these sucky films.Tsai Ming-liang directs this film about a small hole between two apartments. Unfortunately, the film tediously shows the guy in the above apartment doing everyday things very slowly, while the woman in the place below constantly cleans her waterlogged residence. This encapsulates their entire existence, and summarizes quite thoroughly the uninspired actions of both participants.This monotony is broken up by inexplicable, random musical numbers that are neither catchy nor entertaining. Any romantic sentiments expressed through these songs are entirely superficial and seemingly come from nowhere.Which brings us to the very heart of the film - the hole itself. This is an interesting concept to use in a movie, with a plethora of options available to the filmmakers. Unfortunately, very little interaction occurs between the characters via the hole, and what little does is only juvenile (e.g., vomit, bug spray, etc.). The situational state of affairs is what enticed me to see this film in the first place, so the fact that Tsai Ming-liang failed miserably in his execution here is quite disappointing. I keep hearing all sorts of great things about Tsai, but after the totally forgettable \"Rebels of the Neon God\" and this debacle, he has a long way to go before impressing me.Not recommended. Art-house directors need to learn that making a film artsy - in and of itself - does not make a good or entertaining film, and should consider adding a few interesting events/concepts along the way.","This movie, one of the best I've ever seen, talks about incommunicability. It does it plunging ourselves in a livid Taipei, stained in cold colors, where the rain falls incessantly; a DAMP world. It does it displaying us the story of two persons living in this world, a man and a woman. a coincidence, or the fate,links their existences, but they're not able to open one to the other with words. Characters are the mirror of the difficulty of our society concerning interpersonal relationships. An incommunicability that here is taken to the extreme limits. all the characters exchange only a few words during the movie, dialogues are nearly absent, and when some words are spoken they're often weak and empty, far away from describing people's real feelings. So, the progression of the story, the revelation of character's feelings is developed (brilliant idea!) by the musical digressions, only apparently meaningless, that speckle the movie. The proceeding of the sentimental event, and the drama of female protagonist, lead us to a splendid ending, heavily symbolic. A movie totally different from the usual, a clever realization by a great-talented director. PS. Forgive me for my bad grammar!!","\"You cannot survive on rainwater alone.\"So intones an unnamed government official at the beginning of The Hole, addressing the obstinate residents of an unnamed apartment building, who refuse to move out of their homes even though their area has become overrun by a mysterious plague that causes people to behave like cockroaches (and then die off, of course). The words take on an irony when we see that, in this apocalyptic world, rain never stops falling and the apartments' residents struggle to keep leaks from destroying their remaining possessions.There's not much to be said about plot here - a plumber visits a man because the woman below is complaining about leaks, and leaves a hole in the floor behind. The man above and the woman below take turns blocking up the hole and tearing away the other person's efforts to do the same - both of them seem loath to give up this one human connection.It IS their only human connection. The woman below lives in utter seclusion, mopping up the floor and stopping up leaks in a pale imitation of a life. For all intents and purposes, she's a cockroach already, hiding in a dark, dank hole. The man above goes to his store every day, although his only customers are a starving cat and a confused old man whose favourite brands no longer exist. They go about their lives as though nothing were amiss, living quite apart. The rest of the apartment seems inhabited, but nobody stirs. Doubtless they're all also sitting in their little holes and trying to live their little lives. Here, Tsai is brutally satirizing the increasing lack of communication between human beings; even in the face of the end of the world, people remain isolated in their own little bubbles. This message was clearly prophetic, because the 2000s have come and people are living more apart than ever before; The Hole aims to unveil the absurdity of day-to-day life.It's also worth noting that there are four musical numbers that begin at unexpected moments. A woman dances and sings in gaudy clothes and with loud instrumentals playing in the background. In one such scene, she and the man she pursues dance around and around as the traces of a fumigation rise up from the stairs and envelop them. These moments alone in the film do not resemble human behaviour; ironically, they're the only ones that make sense. The roaches' compulsion to hide, too, makes sense. It's human nature that's the absurdity.","This Taiwanese film interleaves two worlds: the external and prosaic existence of its two central characters, a man and a woman who inhabit a bleak urban landscape of decaying apartment buildings; and their internal thoughts and feelings which take the cinematic form of Hollywood-style song-and-dance numbers.  A hole which is created in the ceiling between two apartments becomes a means for communication between the apartments' solitary occupants - conventional methods of contact are available, but are not utilised, for reasons never fully explained.  The action unfolds with an almost unbearable slowness, reflecting the characters' lack of any sense of purpose or direction.  In spite of (perhaps because of) this, it remains a rewarding and, at times, amusing tale, which is worth looking out for.","Compared to this, Tarkovsky is a speed freak.Compared to this, Bela Tarr is MTV.Compared to this, the movie \"Russian Ark\" is a roller-coaster ride.I've just described 3 of the sllllowwwwwesssstttt experiences I've ever known, and this one tops them all. But that's not saying it's bad. On the contrary, I really liked it. But it was a chore.I won't describe the plot, because you can easily find that elsewhere. Suffice it to say that the plot is INSANE. It's one of the most creative and bizarre ideas since \"Becoming John Malkovich\". I believe the interesting plot is the main reason I kept from nodding off (also, the humour was nice. That's something we rarely see in slow, artsy films).Here we see a bizarre reversal of the norm. Most movies have little plot & little substance; yet they fill 90 mins with a lot of eyecatching images to keep us enthralled. But \"The Hole\" has 100% plot/theme without much to please the eyes. In that respect, I suppose it's a truly intellectual experience, much like reading a painfully verbose novel like Thackaray's \"Vanity Fair\" (which I've NEVER been able to finish!).If you have a tremendous attention span, I think you'll really like this film. Despite its molassessy pace, it's highly creative and imaginative. It's like Jean-Pierre Jeunet on quaaludes and with a drab, dusty camera lens. Best of luck.","The whole world is falling prey to a lethal disease, and rain never stops pouring down : nevertheless, in this atmosphere of nightmare, a man and a woman discover that they are neighbors, thanks to a hole in the floor of the man's apartment. They fall in love : at least, all would not have been lost. Although this wonderful film expresses the loneliness and the weakness of human being, there is also some room for hope, in the shiny singing scenes.","(the description of the mood of the movie may be considered as a spoiler - because there is not much action in fact)Great one...Is it for my peculiar interest for the dystopias and utopias? Is it for the atmosphere of the movie. Or is there some more magic? If yes, it is for sure the utmost human one...This film is, no doubt, extremely artistic/artificial (depends on taste). I can imagine most of the people who hate to watch slow movies (and those of Tsai Ming Liang (who I didn't enjoy other times) are one of the slowest that I know), suffering during the movie. Yes, people are unable to slow down and to let time pass - and to watch it without feeling they waste it. One can take this piece as torture or as a therapy...The topic at the surface? The lack of communication - even if we live in rabbit cages - one next to each other - but not really together? People are tired, sick of something and unable to describe it - just don't want to meet, touch, talk, confront the others... like if they had disappeared. The big block of flats looks void and the rain falling constantly evokes the strange melancholy inside. And sometimes it must be something abnormal, unexpected, some unwanted decay as a hole in the floor of concrete - that allows us to reach each other.One of the possible ways to look at it is this: Don't survey the inner world of the characters - consider the whole movie-space to be inside of yourself. And ask - why is it there? Where could these depressive states and moods come form? Is there a place for them, they don't have a right to be here? And search for the answers (if you need them) among the walls and halls of the block - instead of inside hardly transparent mind of a man.The key to understand is not-to-understand - to let a movie borrow us - as a subject of study - inside itself - and at the end safely return us to our more colorful and \"normal\" looking reality.Then, maybe, you will reach - like me - the feeling of real, possible, non-pathetic hope, that in core we are still humans... and this state of mind can help one much to live in this world.","This bizarre surreal piece of madness occurs in a run down building where water and a hole between two apartments slowly drive the residents crazy as they approach the year 2000. Thrown into the kettle of madness are musical numbers, an escape root from reality for our two protagonist.","This film is like a dirge. UNTIL it gets to musical numbers which are like MIND F*CK, but gentler, like a mind caress. MIND FOREPLAY. The depressing vibe given from the speed & desperateness of the characters can be pretty Kill-Yourself-Awesome UNTIL you get to the musical numbers. It's a great film. Optimistic. Weird. Manic-depressive(Bipolar). That's it! THIS MOVIE IS BIPOLAR. anyway see it. IT'S A MUSICAL!!! WITH DEPTH!!!! If you like the existential dross like The Stranger, or Waiting for Godot, Then your probably get a real kick out of this one. I had to get the DVD through Amazon.com for like 12$. OH & the songs rock. well they rock but they aren't rock, there like calypso, jazz, Broadway, but by Grace Chung, & I can't find the soundtrack NOWHERE< but i wanna the songs are great, & the dances are so fun.","This film is a must see if it comes to your city.  It doesn't have much dialogue and the subject matter is very dark.  I was very surprised with how the story progressed.  Also, there is a lot of tongue in cheek humor sprinkled throughout.","This is a painfully slow story about the last days of 1999 when a strange disease breaks out and... I stopped caring. This is suppose to be about two people who live over or under each other in an apartment complex. There's a leak and a plumber put a hole in the man's floor so you can see into the woman's below apartment. Also since there is a crisis going on much of the dialog is actually news reports...Sounds promising?Not really.I became distracted and started doing other things which is deadly in a subtitled film. Basically I started not watching, which made events seem even more surreal when I did look up.It may work for you, it didn't for me.","In the middle of The Hole I e-mailed a friend of mine to summarize it. Not sure if the film would break down into a series of submissive gestures, I felt a little un-easy recommending it, but then I saw the ending. It's perfect. I've been living in Korea for 6 months, and this film could just as easily summarize the strange ennui and frustration of any Asian metropolis as it takes on Taiwin here. It uses the myth of Hong Kong musicals the same way Godard or Hartley use Western musicals, but takes it to an extreme, it's gritty world and occasionally Kafka-esquire logic make it all the better. I really feel like The Hole's closest comparison is Hal Hartley's Surviving Desire, but have a kinda bleak edge to what are ultimately hopefully and strangely metaphorical films. Anyway, this is what I wrote to Esther. Hope you like The Hole too.Hey,watching a move called the hole. Taiwanese I think seems a bit to weird for china unless it's hong Kong. it's worth seeing so far. it's about a guy and a girl in an apartment complex. the guy's ceiling caves in and the girl starts to get annoyed and well it's kinda a weird metaphor for the simultaneous pleasure ,degregation, and pain of a rather intense crush. there's also a kinda zombie-virus-sub-plot too and a lot of weird little scenes where the girl acts out her desires through rather innocent and kinda fun 50's doo-wop sequences. worth a look.","A genre-bending, meditative experience.. if that even makes sense. The rainy soundtrack almost puts you to sleep, and I mean that sincerely in the best way possible. But the major downside to this is the corny, flashy musical numbers that amount to nothing. I understand that it was done for experimental purposes, but it completely took me out of it.","It's less visceral than the only other Tsai film I've seen (\"Vive L'amour\"), but the idea of doorways (holes) into others' emotions and existences is vividly portrayed here, as Tsai sets up long shot after long shot, usually with long takes, suggesting a sense of alienation in Taipei.  The musical interludes, inspired by Grace Chang, are perplexing but welcome mile-markers that add new dimensions to the slowly evolving relationship between the young man upstairs and the woman downstairs.  It's not necessarily an easy film to watch (although it's not heavy-handed by any means), so I'd warn any casual viewers who are looking for some \"indie\" entertainment (like Tarantino or Guy Ritchie).  But if you'd like to know something about isolation among city-dwellers in Taiwan, and something more universal about city alienation and romantic yearning, then watch this film immediately."],"review-user":["zetes","davidals","cuckoodu","ebossert","erciumachella","propast","Dave-854","rooprect","Tos","khaktus","mifunesamurai","jessecooperlevy","Tony-130","dbborroughs","aljones15","aciessi","Zach Campbell"],"review-date":["11 March 2002","9 December 2003","5 May 2005","19 February 2007","22 January 2002","16 May 2010","26 April 2000","15 September 2006","6 May 1999","6 December 2006","22 February 2003","13 August 2005","26 April 1999","1 May 2004","17 October 2005","9 April 2017","7 January 2001"],"review-rating":["10","8","5","10","9","7","8","9","5","10","4","8","6","8"],"review-title":[" Very creative; a masterpiece\n"," A masterpiece - among the most inventive films in recent memory\n"," touch to the heart\n"," Overrated\n"," Feelings,sometimes, can overcome silence\n"," A little gem of an absurdist film\n"," A downbeat study of urban isolation and the search for love.\n"," Good but ... pain ....ful .....ly .... S.... L..... O..... W\n"," \"When the world is running down, you make the best of what's still around.\"\n"," Surprising way to reach each-other...\n"," This would have made a wonderful short film.\n"," Slow & beautiful (one of my favorites)\n"," The pace is slow, but this film is well worth it\n"," Slow doesn't begin to tell it\n"," amazing\n"," Not Entirely Empty\n"," More difficult than \"Vive L'amour,\" but also more complex\n"]}