{"review-url":["http://www.imdb.com/title/tt0138992/reviews"],"review-text":["Now, I loved \"Lethal Weapon\" and \"Kiss Kiss Bang Bang\", but I cannot believe Shane Black wrote this pile...or that David Morse and John C. McGinley are in it. I screened it for a film festival. Awful. Everyone was laughing. It's preachy and heavy handed...not to mention stupid. Also, it's surprising how little L.A. looks like Cambodia. The entire idea of time traveling through post-traumatic stress disorder is kinda dumb. Imagine \"Born on the Fourth of July\" mixed with \"The Butterfly Effect 2\" (I used to sequel as the example to really show how bad this movie is) but directed by Michael Bay's 2nd unit director. That bad. The 2 stars are purely based on the production value.","I too saw this film at a film festival, but unlike the previous poster I found it both interesting and original. In a sea of terrible features, shorts are often twice as bad do to small budgets and poor acting, A.W.O.L however is a taut little thriller that hearkens back to \"The Outer Limits.\" The performances are solid, not that one would expect otherwise from Morse or McGinley, and the directing is sharp and on the money. I personally find it difficult to reconcile the previous poster's comments with the film I saw. A.W.O.L is quite aptly written by Shane Black, who, as is usually the case, plays with the genre both paying homage to the stories pulp sensibilities, while simultaneously winking at the audience and never taking itself too seriously. All in all A.W.O.L proves to be an extremely well executed and fun film.","Excellent story, wonderful acting, amazing production values and a cool, action-packed short with a perfect twist at the end. What a great short film! I saw this film in Vail or Aspen at a film festival and was wowed by it. Then I saw it again at another festival (where it won again) and I was even more impressed because subtle touches become evident the second time around - for a short film, this packs a lot of clever layers into a short time.AWOL is not for the faint of heart, but it is very well done and completely impressive for a short film - for any film actually. It's an interesting story told very well, and every scene moves the story, which reveals good film-making instincts went into making this film. The film looks gorgeous and David Morse is also stunning, with a dynamic performance delivered in every scene. Watching his character attempt to defeat the curveballs life is throwing him makes a great viewing experience.It also should be noted, that when tortures of war are in the headlines everyday, the lines between reality, good and evil, can get very gray while the rhetoric gets loud and attempts to make things black and white. AWOL smartly allows the audience to decide for themselves what they think the message is, what is real and what is not, which adds to the mystery.Both times I've seen it, the audience was WAY more into this movie than the others playing with it, which is saying a lot. There are a lot of shorts out there right now, but few deliver the kind of all around excellence and complex subject matter that AWOL does.It sounds to me like the previous reviewer is off his or her rocker, or has some personal agenda, because this really is a great example of short independent film-making. I see a LOT of short films, and I must say if only ALL the shorts making the festival rounds were this good, THEN the shorts business would have some serious legs.","If you're into alternate realities, contemplating what's real and what's just a fantasy, this is an edge-of-your-seat thriller that'll keep you guessing and really make you think. Try to get a copy of it and see for yourself! I watched it at an L.A. film festival recently and it was by far the best one in the group that I saw. It helped that it was actually about something, unlike the others that were screened. It's very well directed and the production value is top notch. I would compare it to Jacob's Ladder in that it keeps you guessing as to what the true reality is of the world that we're in. You should definitely try to hunt this film down and if it's screening at any festivals near you, try to check it out.","This movie takes the psychological thriller to new depths. Well written by Shane Black, the film is executed phenomenally by the cast under the watchful eye of Director Jack Swanstrom. Clearly, Swanstrom is a director that we should look out for in the future. His strength lies in his adaptation of personal experiences both on screen and in the classroom.This thought-provoking film is a must see for anyone who can appreciate action, drama, suspense, and mystery. As with all good films, the viewer goes on a journey of their own to find their individual interpretation of the movie. The mystical aspect of the film is intriguing and adds to the suspense. You find your self looking for the answers along with Marquette. Audiences have liked the movie on the festival circuit - with many awards received, they must have agreed that A.W.O.L. (2006) is well worth watching. I'd love to own a copy - how do I go about getting one?"],"review-user":["axel_53","machinegun_buddha","FilmRover","BJohns99","eriu27"],"review-date":["18 October 2007","4 November 2007","4 November 2007","4 November 2007","6 November 2007"],"review-rating":["2","8","10","10","10"],"review-title":[" This movie was done by professional?!\n"," A short worth seeing\n"," A definite WOW short film. Excellent story with superb performances & production value.\n"," Great flick!\n"," It's worth seeing on production value alone!\n"]}