{"review-url":["http://www.imdb.com/title/tt0106877/reviews"],"review-text":["\"Father Hood\" is an overlooked little gem of a \"road movie\".  Fine performances by Halle Berry, Sabina Lloyd and Brian Bonsall, two really fun \"over-the-top\" ones by Diane Ladd and Michael Ironside,and a downright outstanding one from Patrick Swayze. The movie is helped by an unconventional storyline, but badly undercut by it's flashback framing which results in a formulamatic, abrupt ending.  \"Father Hood\" would have worked MUCH better without these \"bookends\".  Nevertheless, the movie brings up important issues of \"family responsibilities\" and the consequences of state intervention. As long as the foster system rewards state institutions for NOT placing children, such abuses will exist.Pick this one up.  It's worth the \"ride.\"","Patrick Swayze stars as a father who is lost to beer, woman and the bad boy life. One day, out of the blue, his children find him but are ripped away by the system. In typical character, after seeing his children handcuffed to a waist belt into the bus back to the home for disturbed children, Swayze decides enough is enough and hijacks the bus, which leads to a cannon ball run trek across America to New Orleans, where the next heist of money will get Swayze the good life.On the way there, he starts to fall in love with his kids and helped by Halle Berry, the reporter who has tried to stop the home molesting children and billing for trips out with the kids that never really took place, Swayze has to decide whether he should take the money and run or look out for his new found family's interests. I really enjoyed this film and recommend watching it, if you missed it back in '93, and the music played during the chases is soulful and funky throughout, which gelled nicely with the plot, especially the last track (wonderful one, if thats its name) which took me right to the end of the credits. I just hope in the next few years we get another version of 'Father Hood' and they stick to the northern soul tracks that blessed this version. Just please please please shut the blonde loud mouth kid up, his character played too well and was as annoying as he was paid to be!!!!!","Alright, so 'Father Hood' is not the perfect movie. There have been many of its kind. It isn't devoid of plot holes and is predictable. However, it's also an entertaining road movie about an ex-con, Jack, on the run with his kids (Sabrina Lloyd) who were treated harshly (their hands were cuffed and they were abused) in a detention center). The only person on their side is feisty journalist Kathleen Mercer (Halle Berry) who tries to convince Jack to give her an interview (providing information against the youth detention center) and she'll work out a deal for him so that his sentence is reduced. Jack also drops by his mother's (Diane Ladd) in Las Vegas.Okay, so it's not anything new but that doesn't mean it can't be fun. Shot in a typical early 90's style, Darrell Roodt catches the cross country landscape effectively. The performances are good too. The late Patrick Swayze is brilliant as the reluctant dad. Sabrina Lloyd is cute and vivacious. Brian Bonsall can be annoying at times (but then again his character was a cliché). Halle Berry is charming in her limited screen time.'Father Hood' holds some nostalgic value for me and it was nice to go back to memory lane for a while. The way to enjoy this one it to take it for what it is.","Father Hood is an entertaining tale of an unwilling Father who is definitely a HOOD! Patrick Swayze plays Jack Charles who is a hood always on the look-out for the one big \"score\" that is going to put him on easy street. His wife died while he was is prison and his two kids were put in foster care. When he \"got out\" he thought they were probably better off in foster care  besides he still had to score his fortune. His daughter Kathleen Charles (played wonderfully by Sabrina Lloyd) breaks out of a foster care institution that is abusing the kids and misappropriating money that is suppose to be being spent on the kids. She hunts down her father; tells him about how bad the place was and that her brother, Eddie Charles (played by Brian Bonsall) , \"just a little 7-year-old kid\" was being moved to the institution that she had just broken out of and convinces her father to kidnap him. The three start off on an adventure across country, all the while Jack keeps telling himself that he has to get rid of the kids! Patrick Swayze is really good in this comedy, playing a \"hood\" (probably a little understatement for this criminal character) who is similar to his Johnny Castle character of Dirty Dancing except Jack is appropriately funnier in this comedy and more optimistic than Johnny Castle. Swayze is funny and rally does comedy pretty well! Halle Berry plays Kathleen Mercer who is a reporter trying to get at the truth of the foster care system who becomes Sawyer's ally. Diane Ladd plays Rita the con-artist mother of Jack Charles.","Patrick Swayse has always been good at playing a tough guy, such as his other movies such as \"Roadhouse\". He does a good job as the tough guy here too, actually as an outlaw who's about to do a big illegal deal in New Orleans in a few days. But, as he is still in L.A., he is already facing court on other charges of his already pending. So the last thing he needs is his bratty kids suddenly bothering him now. But that is just what they do, and they are bratty. Swayse thinks that they've been in foster care, but in reality, they've been in an institution that the kids claim is very tough and corrupt. That the staff there are being physically abusive to the kids and handcuffing them. However, Swayze starts to see that the kids are really telling the truth on this one, so he kidnaps them and takes them cross country with him to New Orleans. Now for the kids though, they are bratty. The seven year old boy is whiney and annoying, and the fourteen year old daughter has an attitude problem and is bitchy. Her attitude makes her not very likable. Now for the story. The set up in the first part of film was good but the road story has some very implausible moments. Moments that anyone with half a brain would never believe the situations they're watching, and the kids really get annoying fast. Numerous implausible moments include Swayze making a car run over the edge at Hover Dam and no one seeing him do it. Swayze and the kids outrunning the police in several different scenes where in real life, they would've never been able to do it that way, especially the scene where they manage to jump from a speeding boat with helicopters overhead and no one seeing them do it. But my favorite implausibility is when they jump on to the back of a boat attached to a moving car, talk and yell loudly, and even cook a turkey dinner on the back of the boat without the driver ever knowing it. Yeh, right. They even at one point, after stopping at a gas station, where Swayze goes to use the phone, Swayze has another car drive up to the back of the boat (cause the driver left without him), and Swayze jumps from the front of that car onto the boat, with them all yelling, and the driver of the car hauling the boat still doesn't notice any if it! I mean come on, how can anyone believe that the driver would be that deaf and dumb. The owner of the boat finally notices them when he's luring the boat into a river and Swayze and the kids start up the boat and drive away in it. I did however, sort of like the little rendezvous between Swayze and the TV reporter Hally Berry, who also already had some ideas about the institution being corrupt and needed Swayze, who could've gotten information from the kids about the place, to fill her in with more info about it. Swayze, who was still more interested in his deal in New Orleans, kept giving Berry the runaround. This was a sort of good film in some ways, if it wasn't for those implausibilities and those bratty kids.","his movie was great. I was 9 years old when this movie first came out. I can't tell you how many times I watched it. I have always loved it (and not just because Patrick Swayze is in it). I love the plot and it is typical 90's style. To judge this movie by modern standards would be horrible. It's sweet. It really makes you think too (I can say that having worked for under aged victims of the state before). In all, the movie is great, and I mean for all ages. Take it for what it is and not what you want it to be. I think it would be a great idea for a remake, but keeping to the original theme and plot as close as possible.","Like most action movies, this one has an improbable plot and some impossible sequences.  But this can be forgiven, since the movie is primarily a comedy. Patrick Swayze strikes the right note of comic, underclass insouciance, but the film does attempt to say something about parental responsibility and father/child bonding.  It also raises some disturbing questions about the predicament of children in state foster care.There are no love scenes, and little violence.  With some language dubbing, this might be suitable for family viewing.Note to Patrick Swayze fans: Even in his goofy rayon shirts, he's still gorgeous. And we never have to see him in prison clothes.","This is one of those rare comedies that would've worked better as a drama. Possibly that's because, as a comedy, there isn't a single laugh, but the movie had a good dramatic premise, along the lines of Rain Man almost. The film's biggest fault, besides the dreaful, unfocused script, is the mediocre acting. Swayze is decidedly wooden, a sign that even he knew the film had little hope, and doesn't even attempt to breath any life into the bland film. The two actors who played his kids, Sabrina Lloyd (a 23 year old playing a 10 year old) and Brian Bonsall, don't fare much better. Though neither of them had roles that had any sense of depth, they still manage to disappoint, though at times Bonsall does hint that he has the makings of a Culkin like star. The film's sole redeeming performance comes from then-unknown Halle Berry, playing a reporter. Though her role is a small one, it is pivotal to the story, and it's clear why she became such a big star afterward.Another problem with 'Father Hood', is that the lead character, played by Swayze, isn't the least bit likeable. If their intentions for the movie were for it to be a family film, it's unneccesarily dark and violent, but as a serious action/comedy, it's just too bland and boring. Pass on this one, it isn't entirely bad, but it's pretty close. For serious Swayze fans only.","Siblings Kelly (Sabrina Lloyd) and Eddie Charles (Brian Bonsall) eagerly wait for the release of their father Jack Charles (Patrick Swayze) from prison along with Kathleen Mercer (Hallee Berry). Fifteen months earlier, Kelly escapes from the Dickensian Bigelow Hall. Jack is a petty criminal facing prison time. He robbed drug dealers until he robbed an uncover cop pretending to be a drug dealer. He's also waiting for a large deal to come in. With their mother dead, the kids were left in the foster system. Kelly tells Jack that Eddie is about to be placed in Bigelow Hall. After witnessing director Lazzaro lying to the court, Jack takes matters into his own hands and breaks Eddie out. Jack intends to leave the kids with his grifter mother Rita (Diane Ladd) but their case has become big news. Jack confronts Mercer for her flawed reporting but she's actually investigating the Hall for fraud.The filmmaker may be attempting for comedy but there are no laughs to be had. This is a somewhat functional road movie of sorts. The little one is a bit annoying. Swayze is caught failing to be funny but his ample charms keep the movie from completely failing. This really doesn't work but the basic premise with Swayze almost works anyways.","Father HoodI can understand why a lot of people hate this tale of a father kidnapping his two children and carrying them across America, but I've seen much worse, and--when I saw this years ago--I didn't think it was particularly awful. Patrick Swayze is the worried father who takes his kids on the run with him for personal reasons, and Halle Berry is the cop chasing them down.Overall a decent way to spend a couple hours of your life. You could certainly do worse--ever hear of the film \"Pod People\"?** 1/2 out of *****Rated PG-13 for some traumatic scenes, adult content matter, violence and language.","This movie was OK with some flaws the movies about how a man is on the run from the police with his kids who have escaped from a foster home.This movie was better then i thought it would be but it still was a little bit crap and the film stars actors and actresses like Patrick Swayze,Halle Berry,Sabrina Lloyd,Michael Ironside and Brian Bonsall.The movie has an OK plot but at times it got a little bit stupid and Patrick Swayze and Halle berry both done a good job at acting in this movie and if u liked Halle berry in this movie u should see her in the movies monsters ball and x-men 2.Over all this film was OK and my rating is 5 and a half out of 10.","Whoever marketed this film must have never seen it. It's hardly a comedy-drama, nor is it \"hilarious\" or \"action packed\". I don't recall any part of the movie that would suggest it. It's straight-up drama. And a dark one at that.I don't know if it was meant to be a more family-oriented movie or not. I know that it's one of the tapes my mom brought home from Gibraltar Trade Center for us kids to watch, so it certainly appeared that way. And again being branded with the \"comedy-drama\" bit. But it's just a dark film. Much darker than I would expect of a family-oriented film. Like the obviously implied sexual abuse taking place at the hands of the group home administrators. Or the pregnant girl being forcefully removed from her grandmother's house by the group home goons. And then another goon being shot to death in his car. Not that family films can't contain death or drama. But this was a film that likely would have been granted a TV-14 rating had it been an episode of a drama series. Maybe even TV-M.All in all, is it a bad movie? I don't particularly think so. It's not wretched by any means. It's mediocre, but watchable. It's kind of an interesting display of youths that are forced to grow up fast amid shattered families and corruption, I'll say that much. Probably one thing that I do happen to like about this film, which is supposedly based on a true story. Just don't go in to it expecting comedy in any capacity. It's simply not there.","This is, in simple terms, one of the worst films ever made.  The story goes way beyond being tasteless and judging by the actors performance, they know it.  There just in not one single redemming quality of this film. Patrick Swayze will have to overcome some major obstacles in his career, before people forget about this turkey."],"review-user":["Bob-45","nd-electrical","Chrysanthepop","reblit","richspenc","mrs-renee-jones","Pat-118","millennia-2","SnoopyStyle","MovieAddict2016","monkey-man","horrorflicklover","gregorykootstra426"],"review-date":["5 April 2002","25 September 2004","5 February 2012","13 April 2005","4 February 2016","4 January 2010","30 March 1999","15 April 2001","12 March 2017","12 February 2004","11 July 2005","24 October 2013","10 January 2003"],"review-rating":["7","7","5","6","5","10","5","5","1"],"review-title":[" Overlooked Little Gem\n"," When your kids find you its time to find yourself!\n"," Being A Dad On The Run On The Road\n"," Entertaining Tale of an unwilling Father who is a HOOD!\n"," Good setup but becomes implausible and with annoying kids\n"," Loved it\n"," Not an easy film to classify, but Patrick is gorgeous.\n"," A good premise in the wrong hands, the film ultimately fails\n"," comedy not funny\n"," Bad, but not one of the worst films of all time...\n"," OK movie\n"," Identity crisis says it best\n"," Absolutely Terrible\n"]}