{"review-url":["http://www.imdb.com/title/tt0107824/reviews"],"review-text":["This is a great off-the-wall romantic comedy about love, work, pandering to the public taste, and midlife crises. The main character is a talented movie director who decides to make a silly PG-13 movie to get himself out of hock with the IRS. It has an excellent cast, a wide range of humor (from deadpan to slapstick), and fine writing. It's also a wry send-up of the movie industry. The metacommentary includes several excellent cuts between reality and the movie that's being made, and in some places the film departs from strict realism. The result is a multi-dimensional masterpiece of wry midlife humor.","The story to this movie was very different and creative. It's dumb, loud and spectacular when it needed some wit and a better leading man. Everything about this film could make anyone laugh. An intelligent script, with direction that does it justice. It's a film that fails to take advantage of its cool premise, that makes you wish they had done better rather than spoiling a good idea. The editing lets the actors breathe and the music lets the atmosphere live. Still, I thought this was cute and not bad at all. There are slow spots, but to me the movie is too good to dismiss based on them. As a final rating, I receives 7 out of 10.","Clearly made by veterans of the business, this is the story of the twilight years in a film-makers life. Well... a successful, famous one, anyway. Numerous luminaries just off the Highest Paid rack appear: Ally Sheedy, Isabella Rossellini, Dudley Moore, and the ever-willing-to-make-a-fool-of-himself Little Richard in a hysterical turn as the President of Cleveland (don't worry, it doesn't make much more sense if you've seen the film).I love Danny Aiello, and it isn't often I get to see him in a lead role, so I was inclined to like this movie from the get-go. Danny's great as an aging director who's reviewing his life, and his work, and finding himself coming up short from his childhood expectations. We follow the two days leading up to the premiere of Harry Stone's new movie, \"The Pickle.\" It doesn't make it any easier to write this review that the films both bear the same name, so for now, I will refer to this movie-within-a-movie Pickle as \"The Pickle Within\". The Human Pickle comes later.\"The Pickle Within\" is atrocious. On every level. And this is plaguing Harry Stone to no end. He reassesses each of his relationships; with his first wife, played nicely by Dyan Cannon; his current girlfriend, an English-language debut by the stunning Clotilde Courau; his daughter and her husband, both perpetually short of cash after growing accustomed to their father's celebrity lifestyle; even one of his many brief ex-wives Patti, whose Chinese accent is hysterically strong when she talks, but disappears when she sings.The people in Harry's life are truly funny stereotypes, exclusively played by talented people who happen to fall outside Hollywood's A-List (though a few have been there in the past).Ultimately, the path of Harry's life leads him to realize that yes, indeed, he himself is the Pickle (there it is... the Human Pickle), who, with warts, age, sourness, and all, is still a valuable person (cue inspirational music).","A bad movie ABOUT a bad movie. Is that original, or what? If it is, then that's the only good thing about it. The lovely Ally Sheedy couldn't stop this bomb from destroying movie theaters and VCR's everywhere. It should also be noted, that she, and the other actors hired by Danny Aiello's character were billed as themselves, as well as the characters they played in his D-rated film. Calling it a B-rated film, is too much of a compliment, and would lead to delusions of grandeur.","It's hard to decide what to say about this one. It isn't totally, one hundred percent bad. Although the movie-in-a-movie is unspeakably bad, meant to be campy, but missing by a mile. I'm pretty sure that this is intentional, however. Danny Aiello is perfectly adequate here, and more or less nails his pathetic character. Dyan Cannon was good in a small role. Clotilde Courau was impressive as the latest twenty-something girlfriend. And Linda Carlson had a brave topless scene that she pulled off very well.So, it's not totally bad, but I don't believe that this one accomplishes its goals. All in all, it's probably worth passing on.","The Pickle. About a director, and written by a director. Danny Aiello is Harry Stone, about to release \"The Pickle\", which he fears will be another bomb. A fun supporting cast. Dyan Cannon, Jerry Stiller, Shelley Winters. Stephen Tobolowsky (Ned, from Groundhog Day!) Lots of little sight gags... the film crew is wearing \"pickle\" T shirts. Stone even has his own stalker, Bernadette. I think this story is a drama with comedy bits thrown in here and there. Unfortunately, the title and the summaries all lead you to think its going to be a comedy with some drama thrown in. It's also a little confusing, since we keep flashing back and forward... sometimes it's back to Stone's childhood, and sometimes it's back to when he was filming the movie. The film within a film is pretty funny, and has some GREAT people in it... Little Richard is the singing President, Isabella Rossellini, and Dudley Moore. Some funny one-liners \"Pickle juice is now pressurized.\" and \"Let's get this pickle off the ground!\" My personal favorite is: \"It's a bird. It's a plane. It's a pickle!\" The bible on VCR tape has some funny updates! Shelley Winters is Stone's mom, in some type of nursing home, and still has faith in her son, but calls him out for selling out to pay his bills. That seems to be the point of the film -- coming to terms with himself, kind of a mid-life crisis. People keep telling him how they liked his older films. He also has (or had) big plans for the films that he never made. Stone has a strange relationship with his (much younger) girlfriend; Sometimes they are lovey-dovey, but every now and then he lashes out and yells at her to go back to France. Odd scene in the nightclub where he visits yet ANOTHER one of his ex wives, and she sings Goodbye Heartache. or someone does. Visiting all these ex-es is one of the running gags. Like everyone he meets wishing him good luck on the movie preview when it was supposed to be a big secret. He seems to learn little life-lessons from all the ex wives and friends he bumps into. Has an upbeat ending. Not sure why it got such a low rating. It IS a little offbeat, but some funny stuff in here. Similar to Funny Bones, with Jerry Lewis. another offbeat drama, with lots of humor. If you liked that one, you'll like this one! Written and directed by Paul Mazursky, who was nominated FIVE times, four for writing, one for Best Picture. Dead, you know. but still has two projects in post-production, as of February 2016.","Harry Stone (Danny Aiello) is a well-known director who has built his reputation on doing films of depth and biting satire. When he finds himself in a financial bind, however, the lure of a big check seduces him into compromising his artistic values and directing a script that no self-respecting professional would associate his name with. The Pickle (the movie- within-the-movie) is a terrible story about a giant cucumber that's actually a space ship. As the film's premiere approaches, Harry goes through twenty-four hours of intense anxiety. Paul Mazursky's The Pickle is in the tradition of The Big Picture and The Player, and, like those films, elements of this quirky, satirical farce are not ideal for general consumption. However, for those who like to laugh, The Pickle offers plenty of opportunities.","It's very interesting to think of how very much this movie could have achieved and didn't.  It was supposed to be a look at humanity versus consumerism and art versus marketability.  The Pickle is actually three movies in one- we have the story of the director, the movie he has made, and the movie he wants to make.  It's a good idea...but something got lost in the transition from idea to film.  The story of the director is pretty depressing and largely painful to watch.  Aiello's performance is merely adequate, and the relationships he rediscovers with his family and annoying girlfriend seem preachy and cliched.  The movie he is about to release, about a giant pickle from outer space, is meant to be amusing high camp, but it's just plain weird.  And the movie he dreams of making, based on his childhood, doesn't seem to have a real purpose.  THIS moviegoer certainly wouldn't pick it over the space pickle movie.In a nutshell, I don't think I'd pay money to see this film again, though if you bribed me with some of Little Richard's liver-flavored jelly beans I might give it a shot."],"review-user":["converse751","manitobaman81","jeremyemmet","Ddey65","smatysia","ksf-2","jimjohnson-57331","Jadzia79"],"review-date":["3 October 2003","5 September 2014","19 September 2005","25 October 1999","9 April 2007","3 February 2016","22 October 2018","7 January 1999"],"review-rating":["8","7","6","2","4","7","7","5"],"review-title":[" Great midlife crisis fantasy\n"," Good\n"," A pickle... within a pickle... within... Danny Aiello?\n"," A bad movie ABOUT a bad movie\n"," Not totally bad...\n"," Film within a film... a little offbeat but fun.\n"," Great early 90s comedy-satire.\n"," Generally fails to achieve its cinematic goal\n"]}