{"review-url":["http://www.imdb.com/title/tt0165581/reviews"],"review-text":["I am from England and have only been watching KOQ for the past 4 months, yet already i am hooked. This show has two things that other great sitcoms don't or didn't, Kevin James and Jerry Stiller. Kevin must be one of the most underrated comedy actors there is, his comedy timing is perfect, he is insensitive yet endearing and basically just damn funny, the scenes between him and Leah Remini are just fantastic. But the scene steeler every time for me is Jerry, he is just amazingly funny and his unpredictability is comic genius. I was a huge fan of friends and was bitterly disappointed when it finished but now i think i have found a sitcom which surpasses it. Well done America this is a comedy gem. 5/5","I consider myself to be a connoisseur of sitcoms, and used to spend many long hours wasting my life watching them all. Sense Seinfeld, Friends and many other great sitcoms have left the scene I am left with wasting my life on the one great series that is left, \"The King of Queens\", and in my humble opinion beats them all. I have to admit, as has been mentioned before, it takes a couple of shows before you get hooked but it doesn't take long before you start realizing the brilliant comedic performance and timing of Kevin James, Patton Oswalt, Jerry Stiller and Leah Remini. I don't think the few people criticizing the show realize just how much talent it takes to make the world laugh, they really don't. However, I'm puzzled only about one thing, \"Everybody Loves Raymond,\" but I don't, and it is hovering around #5 in the ratings but The King of Queens, which totally kicks ass on Raymond isn't even showing up in the top 20, what's up with that? Don't get me wrong because I've watched Raymond and I think it is \"okay\" funny but not nearly the caliber that KoQ's is. CBS needs to give a little more respect and focus some PR on the show and especially Kevin James because when movie goers get finally get tired of the very funny Adam Sandler I predict Kevin is next in line (or at least I secretly hope).","I never thought I would ever say this, but...the funniest sitcoms out right now (2002) are on CBS!  The network used to broadcast only shows that the 65 and over crowd would enjoy.  This is a very, very funny show! \nNow, most sitcoms depend a lot on forced humor.  This show doesn't.  The writing and performances are very natural.  And I never watch the show without getting at least 10 good laughs.  Kevin James is a great, underrated comedian.  He should really get more recognition for his talent.  He always cracks me up.  Kevin's not a bland comic, yet he doesn't go over-the-top.  He has just the right anecdote to produce big laughs.  By the way, he hosted the \"People's Choice Awards\" and he was great!  It was hilarious when he walked off stage in his boxers. \nJerry Stiller, thankfully, gets the chance to once again display his incredible talent.  He was memorable as Frank Costanza on \"Seinfeld\" and he's actually given a role that lives up to it.  I guess you can say he's the one \"Seinfeld\" cast member, as of now, who's still a television success. Leah Remini is a beautiful actress.  She is great to look at, and has a superb sense of timing.  She holds her own, not getting upstaged by the two professional comedians.  If you haven't checked out the show as of yet, I really suggest you do. It's one of the few funny shows on television.  I'm really discerning when it comes to sitcoms, so take my word for it--it's great! \nMy score:  8 (out of 10)","This show is hilarious. You've got Doug played by Kevin James who is the loving and sometimes self-centered husband to Carrie played by Leah Remini. Now Carrie her character is witty and somewhat high-strung. Living with them is Carrie's father Arthur who appears to be one of the highlights of the show. This show was released in 1998 and I didn't start watching it until about a year ago and found it interestingly funny. Out of mostly all the sitcoms on TV this show has a realistic quality about it. King of Queens is a show focus on everyday life of a middle working-class couple. It's very rare to see a sitcom like this within the past decade. The humor is full of satire which makes the show catchable to enjoy. Arthur played Jerry Stiller is a well-known comic and as a supporting cast member he is terrific. King of Queens is definitely a show to watch week nights after a days work. Even the repeats are still enjoyable.","When this show first came on the air, I saw it once or twice and thought it was another \"fat guy, skinny wife\" show that seemed to populate the networks at the time. It was just \"okay\" upon initial viewings and I didn't watch it again; however, once it went into syndication, I caught several episodes (simply because it was on twice a night), and I'm telling you, the more you watch this show, the funnier it is. Once you see how all of the great supporting characters are connected, this show makes you laugh out loud. Every new episode I watch is more creative than the one before--people who only watch this a couple of times will not notice this. The writing and story lines are much more sophisticated than they appear at first (this is far from \"According to Jim\"). First of all, Kevin James is hysterical, incredibly charming, and a talented comedic actor, as is the supporting cast. Leah Remini has excellent timing, and Patton Oswalt's Spence is one of the funnier characters on the show. And of course, Jerry Stiller is brilliant as Arthur. I was shocked to read comments that he was the worst part of the show--he's a gigantic part of why this show is so great--his delivery of these ridiculous schemes (rounding out the crazy dad character) are beyond hilarious. And the yelling--the best episode is when they show him as a kid yelling \"Lemon Icee!!\". That episode, during which Carrie takes him to a therapist in hopes to get him medicated (to make Doug less stressed out), guest star William Hurt decides that Arthur yells because he's never been validated. The latter part of the episode where Doug beats up his childhood self in a therapy session is beyond funny, it's one of the most creative scenes I've seen on a sitcom. I feel the strange need to defend this show, because it is severely underrated--while \"Friends\" was sometimes amusing, and \"Raymond\" has some great episodes and characters, they both lacked the creative touch that \"King of Queens\" has. In an era where most sitcoms have canned jokes and are on the whole mediocre, \"King of Queens\" continues to push the sitcom envelope and show real comic genius. Critics of this show obviously don't get it--or haven't watched the show enough to give it a chance, because anyone with real comic and creative sensibility has to laugh out loud while watching. It's certainly on par with my other two favorites, \"Seinfeld\" and \"The Office\" in its ridiculous tone. It's the Arthurs, Kramers, and Michael Scotts of TV that keep us watching, and laughing out loud.","I have not seen a better comedy than the King of Queens for many years. I rate it one of the best ever. I've just returned to Ireland from Arizona on American Airlines from a biz trip and by chance they showed several episodes. I laughed my head off and later I asked the stewards to play again and they did. Thank you AA. The acting from all the team is first rate and especially from Kevin James, Leah Remini and Gerry Stiller, but from all of the cast in fact the acting is superb. I love all the cast, they are so funny. There is a hard edge in the King of Queens that I love and is seldom seen in today's TV comedy. Both Leah and Kevin play off each other so well that every situation is believable and hilariously funny. I have just purchased the 2nd season while I was in Az this week and I intend buying the full set the next time I am in the US. My son who is 20yrs old also loves this show and its brilliance is that it has the magic to reach out to different generations. I would like to thank all those involved with this amazing show - it's so appreciated to see this kind of TV show in what is in my opinion an era of poor TV fair in general these days with the exception of re-runs of Seinfeld and such like... Thanks for a great show..","The King of Queens is a very funny show especially since Jerry Stiller (Ben Stiller's dad) is in this series and I think Jerry Stiller is hilarious! This series is about a blue-collar couple, Douglas and Carrie Heffernan (Kevin James and Leah Remini) share their home in Queens, New York (suburb of New York City) with Carrie's crazy dad, Arthur (played the hilarious, Jerry Stiller). Burly Doug, who makes a living as a parcel deliveryman, often has to scheme to find time alone with Carrie, as Arthur can be quiet a handful -- so much so that they a dog-walker, Holly, to look after him. When he's not working, clashing with Arthur, or nesting with Carrie, Doug hangs with his advice-giving buddies Deacon (Victor Williams) and Spence (Patton Oswalt), as well as his cousin Danny (Gary Valentine). This series premiered on CBS in September 1998. This series is so funny and I think all the jokes are funny and I think Leah Remini kind of reminds me of Jennifer Aniston from \"Friends\".User Rating: 9/10BOTTOM LINE: VERY FUNNY!","I have been watching King of Queens from the beginning, and have felt it is overlooked at the award shows. This show has the best humor, you can identify with the characters, we talk about it at work a lot, because I work at a company a lot like IPS, (DHL) and we just love the Teamster plugs!! Carrie is my hero, she is the best, she just puts it out there, no matter what the subject is. Arthur well what can you say? He just cracks you up, and really puts a spin on things. Doug, well he is just so lovable, and funny, the three characters, plus all the friends just make the show complete. This is the best comedy on TV!! I would say up there with Seinfeld, and hey, there's nothing wrong with that .... Excellente!! as Doug would say.","This show is hilarious. I actually didn't watch it that much until I got really interested in it. Kevin James gets you sucked into the show.I actually thought it would have been off the air right now but now I love it. It captured me for one reason and that is Arthur.Arther plays Carrie's father who is Jerry Stiller. I thought it would be like Seinfeld with Festaval thingy. But it actually isn't.I think everyone should see at least one episode to see if you like especially Carrie's 30th Birthday or the one where Deacon and his wife go some where cause of a family crisis and Doug and Carrie watch Deacon's kids. It is a very addicting show. I give it probably an A+Or as I say 10/10","Can't understand why this is called The \"King\" of Queens when it is quite clear Doug is not the King of his own home let alone Queens, a more realistic title would be \"Carrie is always right\" because everything has to be her way or no way which can be quite annoying, Arthur Spooner is Frank Costanza imported from Seinfeld which makes Jerry Stiller look like a one trick pony who can only play eccentric angry old men which I am sure is not true, some of the episodes are quite entertaining but some others are bordering on farce and leave you feeling embarrassed on the characters behalf, I sometimes quite like the show but can't help thinking it is a poor man's Everybody Loves Raymond.","Every night after Malcolm in the Middle, I watch a double dose of this show on UPN 9 at 7. There are some problems with the show, but the rest is just pure hilarity. The problems are mostly that often in the episodes Doug might start up a topic and he and Carrie fight about the topic throughout the whole episode. Despite the topics, the show has great characters with original personalities. Arthur is a hilarious character that I think the show couldn't do without. This show reminds me of Everybody Loves Raymond, which is just as funny, but King of Queens' comedic jokes are easier to figure out than Raymond's. This is a good way to spend an hour of your time, because you'll love it.","In a time of bad, if not plain awful, comedies, King of Queens is more than just a breath of fresh air, it's a complete oxygen tank! It is in my opinion one of the 5 best comedy shows of all times. Nothing has been this good since Married with Children. Kevin James and Jerry Stiller are comic geniuses! And believe me, it takes a lot to make me label someone as comic genius. These guys truly understand what is funny. I could watch ten episodes of Seinfeld and wouldn't get half the laughs from seeing KOQ just once. Other funny people in this show are Carrie, Janet Heffernan, Spence and Doug Pruzan (Carrie's boss). I'm so happy they managed to get so many seasons from this gem. The show has been a hilarious winner in a time of mostly comic losers. Check it out if you haven't!!","The King of Queens is a fantastic show! I think the concept is brilliant, the script was hilarious, and the acting was amazing. I am truly saddened that this show is no longer producing new episodes. The King of Queens is one of those shows you can't get enough of. It is a dearly loved program in my household. Every actor in this show was absolutely perfect for their role! Not only is The King of Queens hilarious, but totally relate able. I will forever love this show. Even to this day, I have yet to find another television comedy like this one. Anyone who enjoys a funny yet well put-together show should certainly watch this!","\"The King of Queens\" could be divided into two eras.The first era, constituted of the first few seasons portrayed the issues of everyday life of a man and his wife making it through life in the city paycheck by paycheck.The second era, increased the scope of the show, addressing current popular culture and marital issues with a humorous spin.But besides all of that...This show was freaking hilarious.Kevin James, when not doing crap comedy films with Adam Sandler, is a genius of laughter, and his chemistry with Leah Remini was unparalleled on TV.Jerry Stiller as the psychotic live-in father in law added his own unique style of quirky humor, and Patton Oswalt as the \"man-child\" Spence Ulchin was amazing, (he's a great comedian too) \"The King of Queens\" was the final sitcom of the 1990s to go off the air, and it's a damn shame. Now, all we have to watch are the idiotic sitcoms full of untalented actors and actresses whose only appeal is their physical appearance. I like many fans of actually funny TV shows am now in a state of mourning","It's a sad day when a great, quality sitcom such as The King Of Queens goes out with a whimper (ratings-wise) and moronic ones such as Two And A Half Men continue to go strong. KoQ, for nine great seasons, brought us hilarious plot lines, colorful characters, and witty dialogue led by the anchoring performance of Kevin James. Too bad the next great sitcom seems billions of years away...The absolute greatest things about this show is that it didn't treat it's audience like four year olds. Unlike other sitcoms that attempt to cram a moral message down your throat (Home Improvement anyone?), this show told it how it is. Life is tough, crazy, and unpredictable. Rarely did the story lines come out perfect for all of the characters, but the world kept on spinning and the laughs kept on coming...However, what I've forgotten to mention is that The King Of Queens was also a tremendously funny show. Kevin James always found a way to make his laughably pathetic Doug into a lovable man as well. And Leah Remini proved to be a perfect co-star as the forceful Carrie. But how could anyone forget Jerry Stiller's amazing follow-up to his role on Seinfeld? In one way, Arthur Spooner is very comparable to Frank Costanza, but he also brings something new to the table.Well, that ends my tribute to one of the greatest sitcoms of the 21st century. May The King Of Queens continue to rule in the land of syndication!","There is not one character on this sitcom with any redeeming qualities. They are all self-centered, obnoxious or two dimensional. My husband watches it, claiming that there is nothing else on, but I would rather watch nothing.The only sitcom that I can think of that was worse was Yes, Dear. At least that one didn't get 9 seasons.Being overweight does not make a comic genius, and Kevin James does not have the talent of John Goodman, Jackie Gleason or John Belushi. Leah Remini may have talent, but if so, she is wasted on the shrewish wife. Jerry Stiller is convincing as an annoying old man. Maybe there is a reason for that.This is a perfect example of why sitcoms are derided.","This show uses a rather tired sitcom formula of the fat idiot blue collar slob with the pretty (and sometimes shrewish-seeming) wife and crazy in-law(s). With this show, it's fat unfunny comedian Kevin James as Doug Hefferman who works as a delivery driver for a parcel service. He has a pretty wife, Carrie (Leah Remini), who works as a legal assistant, and senile father-in-law, Arthur Spooner (Jerry Stiller), who lives in his daughter and son-in-law's basement. Kevin James' Doug is your typical beer drinking, sports loving, TV watching slob of a sitcom husband who would rather watch the tube than deal with his marital issues. He also has a couple of idiot friends who lend extra stupidity to the problems encountered by this show's couple. Beyond the few laughs supplied by Jerry Stiller's crazy old man character this show was generally unfunny. Kevin James' imbecilic behavior usually caused the show's problems that usually had to be resolved by his wife.","This is by far the funniest sitcom that has ever aired on TV. I own all 9 seasons on DVD and literally could watch them over and over. Anyone who does not find this show hilarious, heartwarming, entertaining, and laugh out loud hysterical, is crazy! Kevin James is absolutely one of the most talented comedians out there. My boyfriend and I love going to stand up comedy shows in Boston (where we live) and have seen Kevin James twice and his brother Gary Valentine (Danny) once. They are both so unbelievably talented and just plan smart with their work. There are so many comedians out there that are just awful and Kevin and Gary really show the true side of real comedy. Leah Remini, although a snob and bitch in real life (so I have read) is an amazing actress and deserves more credit than any other woman in sitcoms. She truly makes the show...along with Jerry Stiller! This show is a must see and you will get addicted within one to two episodes!","I love the King of Queens. It's a really good show for someone just to watch even when there are other things showing on TV. Even though this show is no longer airing I still watch the re-runs (most viewers do). My routine is come home from work and then watch some King of Queens. This show always has a great storyline. Some comedy shows lack a storyline, and are filled with the same old, same old. King of Queens is different, if you are flipping through the channels and don't have anything else on just go to King of Queens. I guarantee that you will love it, and will be hooked on the show. That is why I gave this show a perfect score of 10 out of 10!!!! WATCH THE SHOW!!!!!","Here in Germany \"King of Queens\" has a big big cult status! Nearly every teenager (and adults) watch this sitcom. It's really awesome!! Better than the other horrible American sitcoms like \"Full House\" or \"Set by Step\" (the only series, who is still OK, is \"Al Bundy\"). There haven't been an Amercian sitcom in Europe who was as effective as this really funny show!! Kevin James and Leah Remini as Doug & Carrie Haffernan are the craziest couple I know, Jerry Stiller as Arthur is the funniest \"grandpa\" I know, and Victor Williams and (especially) Patton Oswalt as Deacon & Spence are the most different, but funny guys I know. I watch it as often as I could, and I still haven't enough, good humor!","If you put Seinfeld aside, this is The Best Comedy ever, no doubt! Just Great!\"The King Of Queens\" just finished its eighth season of domestic bliss. Set in the working-class suburb of Queens, New York, the show follows Doug Heffernan (Kevin James), an amiable delivery man, and his wife, spitfire legal secretary Carrie Heffernan (Leah Remini), as they explore the everyday challenges of love, life, family and marriage. Doug and Carrie deal with day-to-day domestic realities that reflect our times and enable us to laugh at ourselves. Their love for each other ultimately carries them through each dilemma they face, whether it's Doug's fixation with food or Carrie's obsession with expensive clothing. Doug and Carrie also have to deal with the third, high-maintenance member of the Heffernan household 足 Carrie's twice-widowed father, Arthur Spooner (Jerry Stiller), who lives in their basement. His constant presence and often bizarre behavior add to their daily adventures. Doug and Carrie have stumbled upon an unorthodox solution to reduce their burden and keep Arthur happy 足 his regular excursions with gullible dog walker Holly (Nicole Sullivan). Doug's friends Deacon Palmer (Victor Williams), Spence Olchin (Patton Oswalt) and cousin Danny Heffernan (Gary Valentine) round out the cast with their \"guy\" humor and diverse perspectives.In a manner that evokes \"The Honeymooners,\" THE KING OF QUEENS finds inspiration in life's everyday situations. Last season alone saw Doug \"loaning\" Carrie to a wifeless Deacon for help with Thanksgiving dinner; the Heffernans suffering through the annoyance and financial strain of mold damage to their house; and Doug and Carrie striving to copy a couple whose photos 足 of a more adventurous life than Doug and Carrie's 足 they accidentally took home. We also watched Arthur grow jealous of a new dog that Holly added to her route, and Doug finding out that his overprotective parents replaced his childhood dog Rocky three times behind his back. Throughout, the series showcases James' incredible physical comedy, Remini's hard-edged wit, and Stiller's unique comic presence.You can't... You shoulden't Miss it!","I don't like this show.First of all, I don't like that in every episode the husband represented as a brainless child while the wife is the adult mature person in the house.I'm for equality of sex, don't represent the male as stupid in every show, it's pathetic, man or women, we are all humans, and as humans some of us are good and some are bad.Also, it's always in the same set, most of the show is in their house, sometimes.The acting is bad, the show repeats itself, and the characters are not special or interesting to watch.Annoying show.","Ever since I heard people say, \"This show is so funny!\" and \"It's possibly the funniest show I've ever seen!\", I thought, \"Hey, maybe they're right.\" So, I decided to give it a try myself.Now, I wish that I hadn't. I'm even amazed to see how people can possibly consider this show to be a \"comedy\". People ignore the fact that when people watch a funny show, they expect to laugh, while watching it. This so-called \"show\", in my opinion, is not funny, but crude, disgusting, stupid and horrendous. Let me begin, shall I:1) Kevin James You know, it still amazes me to see how so many people consider Kevin James to be a funny comedian. Well, he's not in my opinion. Kevin James stars as \"Doug Heffernan\", an overweight lazy slug who has a job at IPS delivering packages and only shows affection for one thing and one thing only: food. That's it. His character is so stupid that I'm so sick and tired of watching him doing such stupid things on this show. pretending to be injured just to get whatever you want from your wife: that's not funny. taking a disgusting, disturbing, inappropriate picture of his private with a tiny Abraham Lincoln hat at a wedding and then assigning the blame to his cousin: that's crude. going to get a new \"double-stuffed chocolate filled apple pie\" or whatever they call it at a fast-food place and leaving your wife waiting for you in the pouring rain: that's disgraceful. just because a new IPS worker didn't invite you to his BBQ means you have to go at great lengths to try and get him to invite you: that's mean. you're nervous about telling your wife your new trainee is a hot blonde, but then when she says, \"Don't worry about it. I'm not mad.\", you become disappointed that she's not jealous of your new trainee: that's absolutely immature.Let's continue:2) Leah Remini plays as \"Carrie Heffernan\" in this show. Oh, my God! I just cannot stand her. Her attitude, what she does to Doug, to their friends, just makes me want to march right down to that studio and slug her right in the face. Why, it's absolutely unfunny of the way she acts so selfishly and sarcastically. a barking dog from your neighbor's house is keeping you awake all night. okay, here's a tip for you, just go down there and tell them nicely to stop their dog from barking, not, \"I'm gonna call 911 and tell them there are two murderers next door!\" or, \"Oh, but you're gonna be nice. Let me just punch them once in the face and they're all yours!\": that is crude. you join your husband in the kitchen to color some designs on a piece of paper, but your husband has a crayon that you want, so here's a tip for you, wait 'til he's done, then you can use the crayon, not tattletale on him to your father (this is a freaking' crayon we're talking about here!): that is so childish. you've donated money to a charity fund. that's good. but just because you're not on the \"Patrons\" list, you have to constantly and constantly urge the poor elder woman who runs it to put your name up there and it results in her getting fired, and you still suggest, \"Can we still keep our names on the library as 'The Doug and Carrie Heffernan Library'?\": that is disrespectful. you got a speeding ticket for driving around a stopped school bus, how on earth can you even say, \"Okay, Officer just give me the ticket.\" or, \"I got a speeding ticket, and blah, blah, blah...\", that Officer should've arrested you and taken you down to prison for those replies: that is horrid. you find out that someone that lived in your neighborhood passed away and you plan to sell off his house for profit? not even caring about your husband's say in the matter and you just wanna get all the money for it: that is horrendous.I could keep going on about these two completely unattractive, unnecessary, unfunny characters. I am sorry, but anybody who finds them to be funny or hilarious is just beyond my comprehension.The whole idea for a good comedy show is to make the people who are watching it laugh and find it to be very entertaining. And you know something? That's nearly impossible to happen with this show, especially when the wife and the husband are arguing with each other 24/7, hitting or abusing each other, treating their friend's badly and even treating their family relatives badly. This is how I truly feel about \"The King of Queens\". Unfortunately, I am aware that this review will find its way all the way in the back because a lot of people will disagree with me, but you wanna know something. I don't care.Putting absolute stupidness and unbelievable selfishness does not make a good comedy. Just a cruel, offensive, disrespectful and horrendous piece of crap.","I can't help but be completely annoyed by this sitcom. It's like they didn't even bothered trying ro write good comedy, just rehash third rate jokes and hope it sticks. The worst of all this is that it's all so damm uninteresting and lacking in every way.To make things worse leading man Kevin James has a permanent \"I'm so funny\" smug grin on his face that would be tolerable if only he once delivered in the comedy department, which he doesn't, he just lies there doing nothing like a big unfunny baby. Which takes me to the relationship between the Heffernan's- easily the most insincere and poor representation of a married couple on any TV show, really headache inducingly obnoxious Remini spends the whole show as if it where a violent chore to even be around her own husband. Jerry Stiller yanking the few laughs on the show is doing a 100% repetition of his role as Frank Costanza in Seinfeld only this time his hints mostly tread on water due to the inability of the central duo in recognizing a joke even if it flew by them. The episodes just drift along in a stream of nothingness, their jobs add nothing and their interaction is even worse.This is not even a waste of talent, there is no talent here, this is a laughless creative desert.","The 'King of Queens' is your basic simplistic American sitcom. A few corny jokes here and there, stupid situations, and your typical, formulaic character arrangement. The show is basically about Doug, (Kevin James) a crude, fat delivery guy who is your typical pretentious chauvinist, a staple of male characters in American sitcoms these days. Ray Romano ('Everybody Loves Raymond') and Hank Hill ('King of the Hill') are similar types. He is the self-indulgent kind of guy who lives according to the assumptions of what a guy is supposed to do. He shares a house in Queens with annoying and sometimes temperamental wife, Carrie (Leah Remini). She is the typical wife character, similar to the wife on 'Everybody Loves Raymond' (only Carrie is funny), which is not surprising since they're both on CBS. She is the staple of sitcom wives (especially CBS and ABC sitcoms) as the guiding figure who tries to get her impulsive, stupid husband to see the err in his ways. A more sophisticated version of 'Home Improvement.' To be fair, these shows often portray the husband as the idiot and the wife as the all-knowing figure, and as such, the husband comes off funny and the wife just comes off as painstakingly annoying.The other characters in the show is the terrific Jerry Stiller (who deserves better material), perhaps the more interesting subject of the show, as the father-in-law. He often has some really oddball ideas, some of which tend to get Doug in trouble with his wife. Then, like all of these sitcoms of it's kind, there are Doug's stupid friends who are so miserably stupid, it's often a pain to watch them. Darhma and Greg had this kind of character on the show, the \"man's man\" guy who worked with Greg at the law firm. At least Darhma's friend were weird, but they were funny, and not so completely brain dead. Basically, 'King of Queens' makes your male characters to be complete and utter idiots, and the situations aren't so funny as realizing how stupid these people are. And what do you know, they've become pop culture icons? It's no surprise, really.'King of Queens' is not all that funny. The jokes are pretty stupid. But Doug, as one of those \"man's man\" types, who have to double check with the book on how men are supposed to behave in order to avoid all appearances of giving in to the woman or worse, probably being accused of being homosexual. And it happens with the slightest, most stupid things, too, like how a person stands, or what kind of things they may stand next too. Shallow characters are pretty much all that invade our sitcoms anymore, and is likely more reflective of American culture overall. Would this, and other shows like it, be so popular if it weren't? Doug and Carrie, and the relationship with the father-in-law and friends hardly seem normal. Like the characters of 'Everybody Loves Raymond' where none of the family members seem to be able to tolerate one another, it's a wonder why Doug and Carrie would even want to be married to each other. They often seem quite intolerant of each other's habits and so forth, at least before the final credits call. The jokes are stupid, the characters are formulaic, and the entire show is just ridiculous. American sitcoms (should the networks decide to put money in anything than worthless \"reality TV\" shows) are in desperate need of good material. King of Queens just ain't cutting it."],"review-user":["chrisoutram","danlman447","mattymatt4ever","IrockGswift","creativetv","vinny_styles","SonicStuart","pattycake99","Drew-Barrymore-Obsessed","feeney_martin","theguys1","justiceforall272","rainbowsprinkles27","topdyke-1","brad_2534","sferg62","HawkHerald","liz-leclerc","dafoodcritic","TheUltimateMovieFreak","danortal","PeteRoy","siliconx5","KingofCarrotFlowers","vertigo_14"],"review-date":["28 March 2006","19 October 2004","27 February 2002","24 November 2005","3 September 2006","1 October 2006","8 August 2004","7 October 2006","20 June 2004","30 December 2006","1 July 2005","9 November 2006","15 August 2014","17 June 2008","2 July 2007","9 April 2007","3 September 2009","1 January 2009","14 February 2011","15 December 2006","28 August 2006","9 July 2004","8 March 2010","20 June 2006","29 July 2004"],"review-rating":["9","10","10","6","10","10","9","10","1","1","10","10","8","10","1","1"],"review-title":[" King of comedy\n"," Could it be anymore under rated?\n"," A damn funny show!!!\n"," Comedy from the New York suburbs\n"," One of the most creative sitcoms on TV\n"," The King of Queens is the best ever\n"," Very Funny!\n"," Best Comedy On TV\n"," Great Show!!!!!!!\n"," Misleading title\n"," this is a hilarious show\n"," Funny Funny Funny Show!!!!!!!\n"," Best Show EVER\n"," Genius with a blue-collar spin, the last great television sitcom\n"," The end of this show marks the the end of a great sitcom era....\n"," I absolutely hate this show\n"," King of the Idiots\n"," Best show there ever was.......\n"," King of Queens is a great, excellent show!!\n"," Best American sitcom ever!!\n"," The Best!!!\n"," Annoying show\n"," This is how I truly feel about \"The King of Queens\"\n"," Awful\n"," The state of American television: More dimwitted prime-time sitcoms.\n"]}