{"review-url":["http://www.imdb.com/title/tt0107208/reviews"],"review-text":["Chris Noth plays a maniac who wrote a children's book as a young lad, posing as a doctor who menaces a community in order to push his sister's son into the position as his school's genius. The only man that can stop him is a cop who plays by his own rules, and is forced to go undercover with the help of his mute father who communicates via oujii board. Will Rick Springfield find out whats up? Or will somebody sabotage his recording studio! Does the mentally retarded boy who operates the book mobile have clues? Watch to find out! I'm not making this up!","Well,  I notice IMDB has not offered any plot info...that's because it's not possible to do that without sounding vile and disgusting...because that's what this movie is...VILE AND DISGUSTING !!  I watched it because I am a humongous Fan of Chris Noth, whom I have met in person and he is a great guy...but if I ever meet him again,  I will have no qualms about asking him whatever posessed him to star in something so awful.  He plays a former child prodigy who is now a brilliant doctor, who spends his spare time running over small children  with his car, with the intent of maiming and crippling them...this is not a \"spoiler\", because all this is made very clear from the begining...sickening enough??  Oh, it gets better...he is manipulated into doing this, by his incestuous sister, who threatens to with-hold sexual favors from him if their latest victim fails to die...even Clive Barker couldn't write anything so hideous.  Please, if you want to see Chris Noth in something worthy of his talent, rent \"Teddy Roosevelt and The Roughriders\"","Awful in a bad/good way...this movie has officially become the worst \"made for TV movie\" in my book...except for the camp value it offers, I give it a 1 in quality and a 10 for the camp value. Suggestion: Watch with friends, champagne and plenty of popcorn...you'll want to throw some at the screen! Preferably friends who like Chris Noth from his 'Sex in the City days'...this movie is dreadfully funny. This is definitely the lowest point in the careers of all cast members...honestly, I don't know how they controlled the laughter as the lines were delivered! Daniel J. Travanti is absolutely pathetic. EVERYONE participated in the school of over acting; and poor Joan Van Ark, I believe she was the only one taking this theater of the absurd seriously...she is credited as a producer though. Her \"Mom\" jeans and bad plastic surgery are scene stealer's. This movie also crosses the oh so delicate line of social incorrectness when they introduce a mentally challenged character into the plot. This is an obscure movie showing on Lifetime listed as {With Harmful Intent}....has anyone else had the pleasure?","Disgusting movie, but you should watch anyway! First the plot of this movie is disgusting and weird! Joan van ark is credited as producer, I don't know what part she had in the disgusting script, but I'd be curious to find out. The film has some good actors who were once again I guess desperate for a role. Joan van Ark looks very beautiful, cute and sexy in this movie and she wears a ponytail and sexy jeans in almost every scene. They are lots of great shots of Joan's butt, which is the highlight of the whole movie. Joan's acting is great, especially given the weird script! Daniel J Travanti and Joan are the only people in the film who are not a bunch or either creeps, weirdos or freaks. Joan's husband, played by Rick Springfield looks and acts like a total bum and looks like a drug addict bum in the first scene and as for the rest of the freaks, you'll have to watch and see. Watch for the entertainment of the weirdness and shots of Joan's butt. I give it a 5.","We have given this film one star for awful, however, it really depends on how you look at it. We are currently watching this on Channel 5 at 3.30am, and we haven't stopped laughing, so perhaps we could give it a 10, just for the entertainment value. Right from the outset, with the 'manic' thoughts of the stalker being relayed in comic fashion, we were laughing. Is it me or does that chick from Knott's Landing look like one of the characters from the Dark Crystal.I'm not going to spoil it for you, however, you would have to be pretty stupid not to see it coming, i don't think its clever enough for double bluffs.This has to be the worst/best film we have ever seen, if we'd been playing the 'spot the cliché' drinking game, then we be wasted by now.","Given the loony material he's got to work with, Noth does a very good job in his part.  I came away from this movie appreciating him as an actor much more than before, and I've always enjoyed watching him act.  I'd like to see him play Frankenstein.  Or Dr. Jekyll & Mr. Hyde.  Or a vampire.  To me this is a sign of an excellent actor.  He's still very interesting to watch despite the outlandish material.  (\"Grand Guignol\" is too tame a description.)  The plot may have been too over the top to forget what I was watching, but Noth was still interesting to watch anyway.  He managed to add some dimension even to that character.  Give this man a film and a script with a compelling villain in it. Please!Gee, I picked a good date to do this review, didn't I?","This was the saddest excuse for entertainment I've ever seen. I can't say enough bad things about his ridiculous movie.Was Joan Van Ark playing the part of a scarecrow or what? She was the scariest thing I've ever seen!Don't watch this movie it will only turn your stomach. Cindy Kelley Dallas, TX"],"review-user":["moteinmyeye","smurky","alexisv-1","Knotslanding1993","claire-simpson","blissfilm","ckelley521"],"review-date":["17 September 2002","18 November 2000","6 June 2005","18 December 2013","18 February 2005","31 October 2003","8 November 2002"],"review-rating":["10","1","1","5","1"],"review-title":[" Brilliant.\n"," Watching ?? Not this trash ! !\n"," How low will they go?\n"," Disgusting movie, but you should watch anyway!\n"," only 20mins to go!\n"," Noth does a great job even with this material\n"," This movie made me sick to my stomach\n"]}