{"review-url":["http://www.imdb.com/title/tt0116209/reviews"],"review-text":["It is a strangely powerful and moving experience to see \"The English Patient\" again after Anthony Minghella's death. Most of his body of work is dedicated to one shattering point. The endless moral struggle of those who, consciously, walk a very thin line. In \"The Talented Mr Ripley\" Minghella moves away from Patricia Highsmith's amoral Tom Ripley to give the murderer a conscience. In \"Breaking And Entering\" Minghella gives Jude Law's character the need to confess and the rewards are chillingly moving. Here, in \"The English Patient\", the characters in love are never too far away from their corroding feeling of guilt. Ralph Finnes and Kristin Scott Thomas are extraordinary. They strip their characters from every pretense in a compelling complicity with us, the audience. Juliette Binoche is, quite simply, spectacular and her scenes with the wonderful Naveen Andrews are filled with a \"Minghellian\" sensual innocence. Anthony Minghella gave us films that were,one way or another, that elusive mix of art and commerce. He was true to himself but thought about his audience. He knew how to push our buttons without betraying his own. There is something clear, honest and startling about Minghella's opus. I miss him already but I'm grateful for the reflection of his soul he left behind.","'The English Patient' is a love story set in Europe as World War II ends... It is a wartime romance mystery epic, like 'Hiroshima, Mon Amour,' 'The Sweet Hereafter,' and 'After Life.' Anthony Minghella weaves extravagant beauty around a central character whose condition is grotesque, and puts emotional barriers between the characters and the audience...This adult love story is an intimate portrait in the tradition of 'Casablanca' and 'Dr. Zhivago.' The film sweeps gracefully attaining a level of eroticism and emotional connection that many similar films had missed... Told in flashback, it is a masterpiece of intimate moment and spectacular largesse...Ralph Fiennes plays the English patient, Count Laszlo de Almasy, a Hungarian cartographer of few words, who works for the British government, and is stationed in the North African desert...Count Laszlo is the unidentified survivor of a plane crash turned over to the Allies, taken into custody by a medical convoy in Italy, and essentially left to die in peace, in an isolated monastery in Tuscany, under the care of an inspiring pretty nurse who injects him with morphine, and reads to him a book, considered his great treasure, and his one surviving possession...Hana seeks to stimulate his touching memories, wrapped up in his head, released in lost pieces from his disturbed mind...Fiennes gives a haunted, pained performance, playing the young man whose veneer of charm cannot plainly cover his heart's capacity for passion... He makes us sympathize with the character in showing self-doubt and weakness... As a badly burned man, he has only cherished memories... His joy and heartbreak are completely clear and visible in his eyes... He remembers falling under the spell of an attractive English married woman... He remembers the way this turns him from a harsh abrupt wanderer into a man willing to betray everything for love... His tragic love affair forms the heart of the motion picture...Kristin Scott Thomas matches Fiennes' work with a radiant sensuality... She is captivating as the married European woman, conveying the audience with the energy and enthusiasm for life that the Count finds irresistible... Their different world, despairing and hopeful, menacing and resilient, is simply beautiful... With intense passion and intelligence, this attractive blonde burns the screen as the different wife...Juliette Binoche seems to shine as the French-Canadian nurse full of life and energy... This vibrant young woman has a heart of gold, kissing wounded soldiers, but she thinks that she is a curse as anybody she ever loved tends to die on her...Colin Firth is good as Katherine's husband... He is a British spy flying into the tough desert in a yellow biplane to take aerial maps of the whole North African continent... He quickly becomes friend of the Count, yet when he realizes that his wife has committed adultery, his face reflected a peaceful fury...William Dafoe plays a double-agent spy who covers his anger with a strange charm... He is a crippled war veteran who has a hidden agenda... This cunning Canadian man seems to know of some dark secret in Almasy's past... He believes the 'English patient' is partially responsible for the mutilation of his hands, and is busy seeking revenge on everyone even remotely involved...Naveen Andrews is Hana's ardent lover He is a handsome Sikh, and an explosives expert with a dangerous job There's a scene that is stuck in my head because it literally had me on the edge of my seat for what seemed an eternity In this particular scene, the military sapper has to cut the wires on a bomb that has been hidden on a bridge It's on a timer and he only has a few minutes left The scene cuts back and forth between his tense face, the wires and his dirty fingers as they try madly to figure out how to untangle and cut the wires without detonating the bomb All the conventional elements of the genre are at peaks of excellence in \"The English Patient.\" John Seale's cinematography is breathtaking, and Gabriel Yared's majestic music is dreamy, and romantic This is a rich motion picture with ambition and style, a fever dream, lyrical and complex We are almost able to feel the heat of the desert, the pain of the burnings, the intimate flush of humanity that becomes the most haunting element of this epic love story...","In a style reminiscent of the best of David Lean, this romantic love story sweeps across the screen with epic proportions equal to the vast desert regions against which it is set.  It's a film which purports that one does not choose love, but rather that it's love that does the choosing, regardless of who, where or when; and furthermore, that it's a matter of the heart often contingent upon prevailing conditions and circumstances.  And thus is the situation in `The English Patient,' directed by Anthony Minghella, the story of two people who discover passion and true love in the most inopportune of places and times, proving that when it is predestined, love will find a way.It's WWII; flying above the African desert, Hungarian Count Laszlo de Almasy (Ralph Fiennes) is shot down, his biplane mistaken for an enemy aircraft. And though he survives the crash, he is severely burned.  To his great good fortune, however, he is rescued by a tribe of nomads and winds up in a hospital.  But existing conditions are governed by circumstances of war, and Almasy soon becomes one of many patients being transported via convoy to a different facility.  Upon reaching Italy, he is too weak and ill to continue on, and a Canadian nurse, Hana (Juliette Binoche), volunteers to stay behind with him at an abandoned monastery.Hana soon discovers that her charge is something of a man of mystery, as Almasy remembers nothing of his past, and not even his own name.  Thought to be English, the only clues pointing to who he is are contained in a book found in his possession after the crash, but even they are as cryptic as Hana's patient.  Slowly, however, under prompting from Hana, Almasy begins to remember bits and pieces of his life, and his story begins to unfold. And his memory is helped along even more by the appearance of a mysterious stranger named Caravaggio (Willem Dafoe), who suspects that Almasy is the man he's been looking for-- a man with whom he wants to settle a score. But, burned beyond recognition, Almasy may or may not be that man. Meanwhile, Almasy's memories continue to surface; memories of a woman he loved, Katherine Clifton (Kristin Scott Thomas)-- as well as memories of Katherine's husband, Geoffrey (Colin Firth).  And, crippled in mind and body as he is, those memories become the only thing left to which he can cling with any hope at all, even as his life seems to be slipping farther away with each passing moment.In addition to directing, Anthony Minghella also wrote the screenplay for this film, which he adapted from the novel by Michael Ondaatje.  The result is an epic saga presented in the tradition of Lean's `Doctor Zhivago' and `Lawrence of Arabia'; a magnificent film that fills the screen and the senses with unprecedented grandeur and beauty.  Simply put, Minghella's film is genius realized; crafted and delivered with a poetic perfection, watching it is like watching a Monet come to life.  From the opening frames, Minghella casts a hypnotic spell over his audience that is binding and transporting, with a story that has an emotional beauty that equals the engagingly stunning and vibrant images brought to life by John Seale's remarkable cinematography; images that virtually fill the screen as well as the soul of the viewer.  In every sense, this is a film of rare eloquence, with a striking emotional capacity that facilitates an experience that is truly transcendental.  Nominated in twelve categories, it deservedly received a total of nine Oscars, including Best Picture, Director, Supporting Actress (Binoche) and Cinematography.If one had to choose a single word to describe the `essence' of this film, it would be `excellence.'  Even an extraordinary film, however, does not receive nine Oscars without performances that are extraordinary in kind; and the performances given by Ralph Fiennes and Kristin Scott Thomas here transcend the term `Oscar worthy.'  Nominated for Best Actor for his portrayal of Almasy (Geoffrey Rush was awarded the gold for `Shine'), Fiennes has never been better, achieving an emotional depth with his character that is nearly palpable.  Private and introspective, Almasy is not by his very nature an individual to whom the audience will be able to form an intimate connection; Fiennes, however, finds a way to open that emotional door just enough to let you in, enough so that you taste the honest passion welling up within him.  And it works.  Almasy does not seek your friendship; he will, however, gain your compassion.Kristen Scott Thomas, too, received an Oscar nomination for Best Actress (Frances McDormand received the award for `Fargo') for her portrayal of Katherine, a woman whose stoic countenance masks the emotional conflict raging within her, born of the forbidden passion that enslaves her and yet to which she gives herself willingly, casting off her shackles of repression to embrace a love so strong it threatens to consume her.  The reserve Katherine must maintain evokes the empathy of the audience, as Scott Thomas successfully mines the emotional depths of her character to the greatest possible effect.  It's the kind of performance that draws you in and holds you fast, taking you as it does beyond that curtain of hypocrisy that dictates what must be if only for the sake of appearances, and allows you to experience a true sense of unbridled passion.  Understated and shaded with subtlety, it's terrific work by Kristin Scott Thomas.Binoche gives a stunning, affecting performance, as well, as the kindhearted nurse, Hana; it is her humanity, in fact, which defines love in it's purest sense and offers a balanced perspective of it within the context of the film.  Her relationship with Kip (Naveen Andrews) affords us a glimpse of passion of another kind, which contrasts effectively with the intensity of that between Almasy and Katherine.  `The English Patient' is a film that will move you and fill you emotionally; one you will not want to see end. 10/10.","I can understand why some people think this movie is boring. I think it appeals much more to people who are used to the pacing of classic books.I'm sure many of those who hated it are much like a co-worker of mine who said \"Books? I haven't a book since I had to in high school.\" I checked some of the names of the people who reviled this movie and sure enough it seems many of them think Armaggedon was an \"awesome\" movie and Chris Farley was a \"Comic genius\". And that's O.K. Taste is an individual thing.My sensibilities tell me that the english patient is a very good movie that takes effort to appreciate. Much in this movie is very subtle. It is not a vacation for the brain.(Hey, sometimes the brain NEEDS a vacation, and stupid movies provide that!) Also, it is not a cynic's movie. It's about idealism, tragedy and regret. About how people can want the best but have it all fall apart because of bad choices, and have to go on with the regret of never being able to remedy the situation. Not so much a love story as a tragic one. So many people destroyed because of the selfishness of two people couldn't(wouldn't?) control themselves.I would ask those who thought the movie boring to watch it again when you feel able to pay full attention to what's going on in the film and how different bits of dialogue dovetail into subtle suggestions of how the characters are feeling and thinking. This movie takes an investment of time, thought and emotion. If this investment is made, I think most people who watch it will feel rewarded.","I like this movie above all others. It is \"multi-layered\"; there is so much to see and appreciate. Every viewing brings a new appreciation of the story-line, the plot and the characters. Faultlessly acted and extremely enjoyable if you take the time to watch it and appreciate it. I love the interaction between the players; the subtle relationships; the period atmosphere. Ralph Fiennes is perfectly cast as the brooding lover and Geoffrey the wronged husband is beautifully underplayed by Colin Firth. The scene in the sand storm where Catherine & El-masy are discussing the different types of sand storms is one of the high-lights of the film and where the affair really starts. The other relationship between Hanna & El-masy is yet another \"layer\" of the movie which is totally enchanting (and heart-rending). A worthy winner of so many awards.","'The English Patient' can rightly be compared to the films of David Lean, whose sweeping epics such as 'Lawrence of Arabia' and 'Bridge on the River Kwai' must have inspired the director Anthony Minghella. The film is beautifully photographed, and like 'Lawrence', is set in Northern Africa, but during the second world war.  The story is complex, but it boils down to a forbidden love between an opinionated and often difficult archeologist played by Ralph Fiennes and a married woman played by Kristin Scott Thomas.\n  The story, based on a novel by Michael Ondaatje, is told in flashbacks by Fiennes' Count Laszlo de Almasy  - the titular character.  The fact that his name does not sound like he's English plays a key role in what unfolds. He has been badly burned in a plane crash, occurring just as the film opens, and is being cared for back in Europe by Hana, an army nurse played by Juliette Binoche. What makes this story epic is the vast sweep across place and time, and the development of characters beyond that of the two ill-fated lovers.     The film makes clear that true love and passion, even with dreaded consequences, can make life worth living, or worth dying for. If you're a romantic at heart, and can appreciate a film without the standard happy endings and simple moral codes, you may find that 'The English Patient' speaks directly to you.","as can be read in many reviews here it is a movie you love or hate - apparently not so much space for opinions in between. I for one think that is a good sign. I always appreciated this movie, although the genre is not my typical style (I never watched Titanic for instance, and am not planning to).The English Patient grips because it shows how people can be different when they are in an exotic environment as opposed when they are 'home' (Katherine), it shows how destructive love can be in a slow, strong and utterly painful way, it excites because of the extremely passionate affair, the pain of the one(s) who leave behind, how pointless one can feel to move on. The photography is just stunning, not to mention the play of the actors. The pace is slow, but timely, and that does justice to the book, the timeline, and the depth/development of the characters. To put this in 110 minutes (as some seem to suggest here) would amputate the multi-layeredness of this movie. People tend to have difficulties with the pace of movies... as if they are in a rush to get to work.. hey - get a life ! ;-) enjoy...I give this movie 4.5 out of 5.","Tuscany WW2.  Traumatised by the loss of anyone she cared for or loved, Canadian nurse Hana stays behind her unit with a dying patient, Count Laszlo de Almásy.  de Almásy is burnt all over and has lost his memory.  When a vengeful, mysterious thief arrives at their abandoned monastery with a past that seems to include de Almásy , and as Hana reads from his book, memories return regarding his past.  He relives his story of lust and love and the destructive force that forbidden passion unleashed upon his life.This is quite a modern epic.  It has the running time of an epic, it has the gorgeous cinematography of an epic, it has the acting of an epic and it has a story of love (lust) against the backdrop of major events in history. Even though it changes or leaves out a significant amount of the original novel it still manages to be a great mix of passionate desire and mystery. The mystery of the story is represented by the thief Caravaggio who casts light on what he knows of de Almásy's past (as he sees it) while the love story is unfolded as it develops in a passionate affair between him and Katherine, a colleagues' wife.  The story is compelling enough to carry the long running time, at times the pace seems a little slow and when I saw it in my local multiplex there were some moments where large portions of the audience seemed to be shifting in their seats.The love' of the story was interesting as it seems to be contrasted with Hana's relationship with Kip the bomb disposal expert.  While de Almásy's relationship with Katherine starts as lust and desire before growing into what seems to be love (or could be grief at the result of their affair), Hana's is portrayed as purer and more careful as she fears those she loves will die.  This difference helped me see that the film did want to show the destructive power of lust and affairs, however the fact that the central relationship was based more on lust than love took away from the emotional core of the story.The acting is almost impeccable.  Fiennes is excellent even when he is lost behind an unrecognisable mask of burnt flesh.  Thomas is actually very good, I find she tends to be very wooden in some things but this type of very English character brings the best out of her.  Binoche is excellent as Hana and carries the heart of the film.  Dafoe is truly excellent - his element of the story is the mystery and he does it well.  He is a great actor and deserves to be in things this good.  The support cast include plenty of good actors including Colin Firth, Jurgen Prochnow and Naveem Andrews.The film is beautifully shot - even though it's all a bit too picturesque to be real!  However the director can handle himself well with many different scenes - a tense bomb diffusal, a passionate love scene, a dangerous sand storm etc.  Overall the slow pace may frustrate some younger audiences but this is a really good film that draws it's values from classy sources.","Count Laszlo (Ralph Fiennes) has just been transferred to a hospital in Italy during World War II. He is horrifically burned from an ambush. His nurse Hana (Juliette Binoche) tends to him, body and mind, for she fears, quite rightly, that he may be a very troubled soul. In the course of his care, the Count starts to tell Hana of his recent past. It seems he worked in a government capacity in Africa, where he met a beautiful married lady named Katherine (Kristin Scott Thomas). Although they tried to avoid each other, they fell in love. After a brief affair, Katherine called it quits, leaving the Count desolate. Even so, the two would meet again, under heart-wrenching circumstances. Meanwhile, Hana herself falls for a Sihk man in the British bomb squad. Yet, the war is raging relentlessly. Can love exist when the world is in turmoil? This is a tremendous film, based on an equally fine but complex novel. The plot has many story lines that are woven together beautifully, each of them poignant beyond description. The script itself is elegant and contains many memorable lines. Fiennes is magnificent, both as the burn victim and as the man who thought love was a myth. Scott Thomas is also quite fine as the woman who fights against her passions. As for Binoche, she richly deserved the Oscar that she was presented, as her nurse is a shining example of hope in a hopeless situation. The scenery is utterly gorgeous, as are the costumes, the direction, and the production. If you have missed out on viewing this film, rectify that soon, very soon. The English Patient will remain one of the greatest achievements in film for centuries to come.","I've seen a few movies in my time, but this one is exceptional. You'll have to watch it more than once to truly appreciate it, it is emotionally very complex, it explores love and passion at it's most extreme and it's cinematography is just breathtaking. The character of the Count is intensely passionate and tragic without him having to raise his voice or indeed leave his bed, the film is perfectly cast and perfectly acted. The film has a sort of mathematical precision and perfection to it which is rare these days. It combines action, love, tragedy, drama and politics all in one. This movie is unmissable, all the hype surrounding it and all the awards cannot begin to do it any justice. Hats off to Michael Ondaatje for writing the incredible book on which it is based.","TEP is like a long cool drink of water after crawling across the Sahara to classic film buffs who have been too long deprived of that certain cinematic magic!  Not only is it beautifully photographed, but the characters are perfectly portrayed.  If you're looking for the film to be a mirror of the book, you will be seriously disappointed.  Instead, it is an excellent \"companion\" to the book, and I think that is what Anthony Minghella intended.  Ralph Fiennes is probably the most beautiful man in the world; not to mention a brilliant actor.  Juliette Binoche is the posterchild for vulnerability and childlike enthusiasm.  And, of course, I'll go see any film in which Kristin Scott Thomas is featured.  She simply must be THE best actress since the likes of Deborah Kerr.  So much was promised with this film, and so much is delivered!","Anthony Minghella's 'The English Patient' is a film that takes us back to the golden years of Hollywood. It is grand and impressive in scale, and yet so heartbreakingly intimate in its portrayal of human love and suffering. At the 1997 Academy Awards, the film owned the night, taking home nine awards from twelve nominations, the most decisive cleansweep since Bernardo Bertolucci's 'The Last Emperor' in 1988. Based on Canadian author Michael Ondaatje's 1992 Booker Prize-winning novel of the same name, 'The English Patient' is a touching meditation on life, love and loss, tracing the history of a critically-burnt man in the aftermath of World War Two.During the war, a man (Ralph Fiennes) is discovered in the burning remnants of a crashed plane. With his face scarred beyond recognition, and with the man seemingly suffering from amnesia, he is assumed to be an Allied soldier, and is simply referred to as \"the English patient.\" After the war, in the mine-ridden hills of Italy, a kind nurse, Hana (Juliette Binoche), who has apparently lost everybody close to her, remains in a ruined monastery to look after the dying man. Over time, she comes to learn more and more about her \"English patient,\" who is actually revealed to be a Hungarian geographer, Count Laszlo de Almásy. Rather than losing his memory in the plane crash, we learn that this scar-ridden man has perhaps chosen to forget his past, both to protect himself from persecution and to cure himself of the tragic memories of his past love. Via numerous flashbacks, we learn of Almásy's former exploits in the Sahara desert, and his romantic liaison with a married woman, Katharine Clifton (Kristin Scott Thomas).It's certainly easy to see why 'The English Patient' was so successful at the Oscars. It is such a beautiful film, blending the quiet beauty of the Italian countryside with the endless golden sands of the desert. Cinematographer John Seale captures the landscape to perfection; not since David Lean's magnificent 'Lawrence of Arabia' has a film shown the desert with such beauty and grandeur, making particularly good use of sweeping aerial shots from Almásy's plane. Even in the film's more intimate moments, excellent use of close-ups and lighting capture the emotion of the scene, coupled, of course, with the brilliant performances from all the cast members.A long-time favourite actor of mine, 'The English Patient' might just contain Ralph Fiennes' finest performance, and, considering his history includes such films as 'Schindler's List' and 'The Constant Gardener,' this is not a complement that is to be taken lightly. His Count Laszlo de Almásy is initially a very sympathetic character, but, as we slowly learn more about his past, his likable qualities are eroded by his less-admirable tendencies towards others. \"Ownership\" is a major theme of the film. When asked by Katherine what he hates most, Almásy replies with \"Ownership. Being owned. When you leave you should forget me.\" However, as the relationship progresses, and Katherine perhaps tries to distance herself from him, Almásy reveals a hint of arrogance, insisting that his love for her somehow entitles him to have her whenever he likes: \"I want to touch you. I want the things which are mine, which belong to me.\"Juliette Binoche, who received an Oscar for her performance here, is excellent as Hana, the lonesome nurse who fears to love because of the tragedies that have always harmed those close to her. After some time of caring for Almásy alone, she is joined by a dubious Canadian thief, David Caravaggio (Willem Dafoe), who lost his thumbs during the war, and who suspects that it was Almásy who betrayed him to the Germans. Hana also strikes up a tentative romantic relationship with Kip (Naveen Andrews), an Indian bomb-diffuser in the British Army. However, due to her past history, Hana is afraid that becoming involved with Kip will doom him to death, particularly considering his very dangerous line of work.At 160 minutes in length, 'The English Patient' wonderfully evokes memories of the classic romantic epics of old, successfully finding a balance of mystery, love, joy and tragedy. The ending of the film is heartbreaking and sorrowful, but also uplifting in its own way. Whilst some romantic relationships are doomed from the very beginning, others have a very good chance of bringing happiness. Nevertheless, in every case, it is always better to have loved and lost, than never to have loved at all.","Sometimes I just don't get it with the ratings of the IMDb. I'm writing this review because I'm shocked to see this film at a 7.3 rating. This is so ridiculous. It is really hard to point out a film which is better told, better crafted, having a more deeply love-story and such a overall fascinating aura. I do understand that everything is a question of taste but this masterpiece is so full of beauty and drama that you simply can not rate it under 8. If you do not like it so much = 8 , if you like it = 9 and if you love it's pure beauty = 10 And now go and watch this movie. You wont regret it if you like romance and love story's and beautifully crafted films.","I felt I must add a comment because it is simply beyond my comprehension why some people did not understand or like this film. This is one of the greatest stories about love and passion I have ever seen.One of my friends said that the beahvior of those two people was despicable. But,who are we to judge or despise them? Are any explanations given in Wuthering Heights for the case of mad passion Heatcliff and Catherine had for each other?(who were,BTW,played in one of the many on-screen adaptations of this exceptional novel,by the same outstanding actors Binoche & Fiennes).My friend also saw the count as a snobbish, cold, unlikable bastard. Those characters are not unlikable-the Count has never asked for anyone's sympathy or understanding.He had died long ago,along with his love, and is nothing but a human wreck,a shell containing broken bits & pieces of memories of a shattered life.And, the story is narrated by him, in many flash-backs & digressions, to match the structure of his memories.Everybody is concentrating only on the two parallel love stories inside the plot. But, they are just the means to deliver many themes,such as the question of nationality Vs. identity, love and its ability to overcome borders-the film is NOT about map-making! Count Almasy and Catherine are very complicated characters, and we are allowed to take but a glimpse inside of their intricate souls. I cannot help but feel attracted to them. His rather clear-minded,rational points of view of history, the world, life in general, are deeply shaken by the sudden passion for this intelligent, sensuous, married woman.You can see the change in him happening in front of your eyes-remember if you were surprised when he wanted to know the name of the base of a woman's neck in the middle of the fuss before having been forced to flight Cairo. Yes,they both may have done some despicable things,like lying, cheating etc. from an objective point of view. He has even helped the Germans by giving them the maps and thus broken his friend's heart.But, in his mind, where such abstractions like nationality & citizenship were not enough to define a person, a promise given to Catherine, that he would return to fetch her, has become his only purpose. Their love was so strong that has transcended time, place, every single of the many imposed boundaries of human civilization-like the sanctity of marriage, friendship, and transcended even death itself. And, then comes the greatest irony in this film:Almasy, a Hungarin count, a devoted servant of his majesty the Queen,an international bastard,captured in the desert by a British soldier, accused to be a German,helps the Germans by giving them the British maps, becomes, at the end, The English Patient-defined entirely by a nationality not his own. I could not help but feel sympathetic with this extraordinary character portrayed beautifully by Ralph Fiennes, even though I knew that the story was told completely from his point of view, and that he has let me see only a small portion of his rich inner world. I could go on for hours praising this film.All I wanted to say is that from its opening scene, with the lovely image of a brush painting something ,we cannot make out what at first, with that haunting melody of a beautiful androgynous voice lamenting a Hungarian lullaby in the background, to the breathtaking scenery, exceptional acting, outstanding directing-to the very end, is, to put it simply- PERFECT. Period.","A passionate tale of determination and romance. Like with all of Minghella's work, every single character is so layered and complex. He takes time and devotion to give each character a sufficient amount of intricacy that we truly feel like we know these people and when one of them feels pain, we do as well. When one of them is joyous (the rain scene, for instance) our faces light up with glee.There's Hana, the caring nurse who is too afraid of love to let anyone near her since right from the start the two closest people to her are destroyed by the war. Slowly her friendship with Almasy becomes stronger and stronger and it gives her the courage and determination to pursue a sexual relationship with Kip, who is also a very complex character. On the surface we see him as a kind man, who is very spiritual and loving. But near the end he realizes how isolated he is and the fact that he barely even knew his best friend whom he worked side by side with for years sends him into a complete breakdown. This leads to a very emotional scene, where Binoche really shines. Next up there is David Caravaggio, a spy who eventually gets captured and loses his thumbs while being tortured for information. He sets out on a vengeance to murder everyone connected to his capture, which leads him to Almasy, his final target. But being around Almasy and realizing the pain and suffering that he has been through leads him to look deep inside himself and realize that he doesn't need his revenge. He relieves himself of all this pain and anguish and in the end we see him with a bright grin, just happy to be alive, thumbs or not.Katharine Clifton is a character very similar to those in the past, but she has an extra spark that makes her very unique. As her husband spends less and less attention to her, she becomes involved in a tumultuous love affair with Almasy which leads to some of the most beautifully romantic scenes ever brought to cinema. Minghella easily could have made her another whiny, confused housewife who just passed in and out of the film with no real connection the audience but he bestowed her with a certain grace and dignity which made us want her to have a happy ending and made us adore seeing her and Almasy enjoying each other's company. Even Geoffrey Clifton becomes a layered character when we learn that he isn't venturing off to do photographs, but is instead helping the army explore territory. So while he could have just been another ignorant husband to an adulterous wife, Minghella adds intricacy to him. And of course the entire story all revolves around Almasy, the man who would do anything, even sell out his country to the enemy, just to be with the woman he loved. A truly romantic and beautiful tale.What I found very interesting, though, was how Minghella subtly displays the horrors and terrible effects that war has on the people that aren't even physically fighting it. Through Hana we see a woman who is permanently destroyed and almost unable to love due to the fact that this awful war took away everyone who became close to her. In Kip we see a man who is so blinded by his job and duty to his country that he never even takes the time to appreciate the man he considers his best friend. Caravaggio takes abuse after abuse, with unimaginable pain being inflicted on him as a result of the war. The Cliftons are a loving couple, who have no troubles whatsoever until the war starts and Geoffrey is off helping his country while Katharine becomes involved in an affair. But the most horrific effect of war is shown constantly through Almasy's story. All he wanted was love and companionship, but the war wouldn't allow him that. He only gets his love because of the war, and due to it's changing seriousness his love is ripped away from him and he falls into complete heartache. Then we see him reclaim this love, and he does whatever he can to save her life. But, as Binoche mentions early on the film, when war times come even your name means a great deal. We see this terribly through Almasy who is beaten, dragged away and arrested merely due to his name when all he was trying to do was save the woman he loved. Of course we see the effect of war physically through Almasy in the horrific burning of his entire body. This film shows no huge war scenes and terrible travesties that blow off limbs and open chest cavities, but it manages to send an anti-war message stronger than I've ever seen before. No physical battle is shown, whatsoever, yet it makes me absolutely detest war due to the effect that it has on those who aren't even directly involved.As always for a Minghella work, the performances are absolutely brilliant. Fiennes, Binoche, Thomas and Dafoe deliver some of the best work of the decade. Simply through their eyes we can see all of the pain and emotion searing through them. The right actors were definitely cast in this one. We never hear them shout or break down into a ten minute fit of crying and throwing objects across the room, but we see all of their anguish and torture simply through their eyes and facial expressions. It's a beautifully subtle way of showing emotion and really helped make the film the brilliant masterpiece that it is. I highly doubt that any other cast could have pulled it off so seamlessly.","I won't go to a generalization, and say it's the best love story of all time, as some have said. That's fine, people feel very deeply about this film, you either love it I believe...or you simply hate it. I don't want to say, the best of all,because that is simply too 'broad' for me to make a statement like that. However, I feel very passionately about The English Patient, as well as millions of other people do. The awards say it all. I don't agree with critics, on many levels, however, the ones that picked this one, I couldn't agree more.9-Oscars. 41-wins.37-other nominations, makes this love story,on the top of the bunch. From the director, Anthony Minghella, the story that bursts onto the screen and as Mr. Peterman (from T.V.s Seinfeld) said, \"Elaine, I simply can't take my eyes off of it!\" In this instance, I don't agree with Elaine's response. But the story builds and takes the right time, needed to make it's case beautifully. The cinematography,(John Seale) won multiple awards as well, as it ought too. I have not really paid much attention to Juliette Binoche, until now. Well, not entirely true I loved her performance in \"Sabrina\" Lovely story of a somewhat complicated relationship, next to Harrison Ford. But this was simply an incredibly differing character for her, and as deeply talented as she is, she simply shined in her own subtle and graceful way, she was just what this film was looking for, I'm truly glad that it was her performance and not another actress. Ralph Fiennes, was also spectacular in portraying Count Laszlo De Almasy. I had a new respect for his ability, after seeing this one! What can you say except, see this picture again. (*****)","Not in the top 250? Slow and broing?When I heard that this movie was \"slow and boring\" I thought I'd see for myself; so when I finally did last Saturday, there was not one moment when I was bored. The entire time I was watching, I just felt so...captivated and amazed at how amazing not only the story was but the acting was just perfect! I seriously do not understand why this is not in the top 250, it's one of the BEST romance movies, one of the best WWII movies, and a Best Picture win deserved 250%. All of the casting in this movie was just absolutely perfect, even if Fox would've preferred to cast \"well-known, American actors\" but they wouldn't have been anywhere near as good as Ralph Fiennes, Kristin Scott Thomas, Juliette Binoche or Willem Dafoe. Seeing Fiennes as this damaged, burn victim dying, and then seeing him before all of it shows how great and underrated of an actor he truly is, showing diversity right there but not only resting on the makeup. The story might seem like a \"typical love story\" but it's much more than that. Sure, there are tons of movies with this similar storyline, but the main reason this one stands out to me is because of how much passion is really told through it; how Almasy had to leave Katherine's body in the cave and let her die was the most heart-breaking scene from a movie that I'd seen in such a long time. A true masterpiece, even if it has been forgotten about now, this is a movie that I certainly will never forget, and Anthony Minghella, will never be forgotten either.","This is the dreary tale of the self absorbed affair between two unlikable people, one of whom is married to someone else. It ranks high on my list of most boring movies ever, and I'm a die hard romantic. My husband opted out after the first hour of its three, by which time little had transpired. The desert scenery is spectacular, with the endless sand and the sunshine on Katharine's golden hair. However, cinematography does not a brilliant film make, unless it's a National Geographic travelogue. The magnificent Saharan scenery in this ill conceived tale is like putting perfume on a pig.The movie revolves around a badly burned, dying pilot named Count Laszlo de Almasy, who is left in the care of a Canadian army nurse, Hana, during World War II Italy. He appears to remember little of his life but through a book in his possession, his story is VERY SLOWLY revealed, with the help of a man from his past named Caravaggio, who mysteriously appears at his deathbed. Almasy was a Hungarian cartographer employed by the Royal Geographical Society to chart the Sahara Desert. He entered into an affair with the wife, Katherine, of a fellow explorer who proved to be a British spy. Meanwhile in the present, Laszlo's nurse has her own affair with a Sikh nicknamed Kip, who is involved in the dangerous work of disarming mines.My quarrels with this movie are many, length and tedium for starters. I don't fault the acting in particular, it simply isn't a good story. Caravaggio seems unnecessary, his connection to Almasy sketchy. He provides a torture scene but appears to serve no essential purpose in the film.The core problem is that the two parties of this affair, Almasy and Katharine, are woefully unsympathetic characters, shallow and dull. They simply aren't very nice, thus there is no one to cheer for. Almasy is cool, aloof, haughty, and eventually disgustingly possessive of another man's wife. Katharine is likewise detached and nasty, not to mention having a deplorable lack of guilt or feeling whatsoever for her imperfect but loving husband...apart from managing one minuscule tear at the corner of her eye when he dies. This is a tale of LUST rather than love, with such pearls as 'I can still taste you'. Almasy ridiculously vocalizes to a colleague his erotic obsession with the indentation in his beloved's neck, surely more indicative of a focus on Katharine's body. The victim of this unrepentant adultery is the hapless husband, Geoffrey, who is treated as little more than an unpleasant nuisance. It's all quite sordid and disgusting, Katharine's charade of feeling faint so that these lovers can indulge in their much vaunted unbridled passion, all as Silent Night is being sung in the background. I'm not sure whether the intent was to contrast the carol's purity with their selfish lust, but I definitely was not impressed by the sacrilegious undertone. We have full frontal nudity with Katharine, but their sex scenes come across as cold, selfish, lustful, and sometimes downright hateful...not warm, loving, giving, nor even truly passionate. If either of these two feels any emotion for the other, it is a totally selfish one and definitely NOT love, as I define the word.Almasy's return to the Cave of the Swimmers to retrieve the body of his beloved comes across as contrived rather than moving. Katharine must have expired only moments earlier as she shows excellent colour and barely appears dozing, not at all corpse like. Of course this is all for dramatic effect, as the romantics watching this tale (normally I'd be one of them) would not appreciate a decaying, putrid corpse. In order to retrieve his adulterous lover's body, he has betrayed his comrades & the Allies by giving his maps to the Nazis, the English being cast as the villains of the piece. Regardless of whether or not he's keeping his final promise to Katharine, his traitorous act is not something I admire much. Kip seems a pleasant fellow and Hana generally likable, but their romance is not in the least engaging, merely a brief wartime fling with the parties indicating little trauma upon parting. Moving back and forth between the two settings (past Sahara Desert and present Italy) proved distracting and unpleasant but really, both stories were dull as dishwater. The only spark of interest in the whole picture was Kip's tense mine disarming scene.Not being totally heartless, I did have some sympathy for the current Almasy's severely burned and dying state. However, perhaps my major complaint with this film is the euthanasia at the end when Hana obliges her patient by giving him a morphine overdose. We are supposed to feel that this is justified and morally acceptable because she obviously has affection for Almasy, cries while she is preparing the deadly syringe, and reads aloud from his allegedly passionate Herodotus book to console him as he's dying. The amazing director David Lean's masterpieces should not be insulted by comparison with this pathetic, immoral tale. Yes, Lawrence of Arabia also has a desert, but in Lean films (Doctor Zhivago, Brief Encounter), those engaging in affairs are sympathetic characters exhibiting admirable restraint, guilt, and some regard for the betrayed spouse, as opposed to the total self absorption of this pair. In Ryan's Daughter, the cuckold husband displays touching loyalty and forgiveness. This movie is a supposedly intellectual, enormously over rated bit of boring and disgusting drivel that unfortunately passes itself off as a great love story. Its Best Picture Oscar does not speak well for the Academy. For those who wonder why people are so hard on this movie, the answer is simple. It's awful.","I am not surprised to find user comments for this film full of gushy nonsense, such as that this film \"[proves] that when it is predestined, love will find a way.\"  I begin in this way, not to criticize a specific reviewer, but because this citation so typifies the hyperbolic, uncritical treacle that was poured out over this film, even before it hit the theaters. Even the best of films do not \"prove\" anything, nor are they intended to. The best films entertain and move the viewer, and \"The English Patient\" fails on both criteria.I remember the studio's promotion of \"The English Patient\" very clearly: \"From the producers of 'Amadeus' and 'One Flew Over the Cuckoo's Nest,'\" it grandly announced.  An ignorant or careless listener might miss the crucial word, \"producers,\" in this disingenuous statement and mistakenly associate the director of \"The English Patient,\" so very inappropriately, with the truly great director, Milos Forman.  Such a comparison is offensive to the memory of Mr. Forman.While the novel by Michael Ondaatje upon which the film was based, is a good one, it is unfortunate that the film failed to capture any quality of the book in any way whatsoever.  Aside from plot elements that seem only coincidentally similar, the film bears little resemblance to the novel.\nDespite misgivings which began when I heard that shamelessly misleading promotion, I went to see this film in the theater.  As it began to unfold, I realized that the rendering of the novel's peculiar magic had failed, that the actors knew their words but not their characters, and that their characters were flat, dull, and unengaging.  The film was a complete travesty of Ondaatje's novel and a completely still-born cinematic artifact of the worst description.Those who gush over this film are very apt to speak with adjectives like, \"sweeping,\" and \"grand,\" and \"hypnotic.\"  Well, it is none of those.  In fact, not even Ondaatje's fine novel could be described as \"sweeping\" or \"grand.\"  It could be described as \"magical\" and \"hypnotic\" -- yet these are precisely the qualities that the film so utterly failed to deliver.  It is almost as if Minghella had, as a reader, entirely missed what was valuable in the novel and could grind out on celluloid only a pale, skeletal version, a version that not only missed the spirit of the story, but that focused on the wrong characters.  He produced a filmic transliteration that not only had no respect for story's metaphors but no apparent cognizance of them, as well.Minghella took the central focus away from Hana and Kip and put it on the Patient and Katherine Clifton, thereby missing the narrative trail of the novel as well as the \"essence\" of it.Ralph Fiennes and Kristen Scott Thomas put in unengaging, uninspiring, uninvolving, unemotional performances that were obviously intended to convey a great, driving, passionate love-affair to the viewer, but which in fact delivered only an inexplicable, perfunctory liaison between two flat, shallow, uninteresting adulterers.  Both actors are physically and emotionally inadequate and unexciting, and neither performance provided the viewer with the great emotional response obviously intended by Minghella's grandiose and overblown presentation.The \"grand, sweeping, David-Lean-like\" qualities to which the many undiscriminating reviewers of this goofy film love to refer simply is not there. The comparison to David Lean (\"Dr. Zhivago\") is positively insulting to yet another great director.  Take, for example, the \"Patient's\" sandstorm scene, which is no doubt one wherein these \"grand, sweeping\" qualities are believed to have resided (or should have resided): the sandstorm is not grand -- it is not even convincing.  The subsequent burying of the characters in the automobile and their emergence after the storm, which no doubt was supposed to affect the viewer dramatically and emotionally, completely lacked either drama or emotion --in fact, because it was so patently weak, it had an air of comedy about it where comedy was clearly out of place.This film failed.  It failed as a rendering of the novel, and it failed as a film.  It seems to have been the \"anointed Oscar vehicle\" of the year (joining such over-trumpeted filmic slosh as \"Kramer vs. Kramer\" or \"Terms of Endearment\").  One can only thank God that even the hype-driven Acadamyhad the good sense to present the Best Actress award to Frances McDormand for her truly deserving performance in the truly excellent film, \"Fargo.\" There was not a single performance in the execrable \"English Patient\" that was not either embarrassingly horrid over-acting (Willem Dafoe) or truly forgettable, mediocre acting (Fiennes and Scott Thomas).\nWhy this non-entity of a film retains a coven of fanatical (and clearly tasteless) devotees will remain a mystery.  Fortunately, the sands of time will bury this mediocrity of a film permanently, and it will not, thankfully, have the strength ever to dig itself out.","I watched this movie when it was released and being really young and not too much into cinema it was one of the most fascinating cinematic experiences I ever had and it really left a mark inside me.At first I didn't quite understand the story and probably failed to make the necessary correlations between past and present as the movie presents them to the viewer.Years after I first watched I managed to watch it again and this was the time that I fell in love with 'The English Patient', it touched me so deeply and for me it became the best film ever made.Anthony Minghella made an absolutely stunning film, all the locations are amazing and through his camera he manages to create unbelievable emotions inside you.Of course, the music of the film is such a big part of the whole emotional journey of the characters and the film would not be the same without it.But personally the best thing was the fragile performance that Ralph Fiennes gave in this masterpiece. He plays so well the man that falls in love slowly but so deeply with Katherine Clifton,opens up his heart and dives into this prohibited affair.The most heart-breaking scene for me will always be the one where hurt Katherine is carried by Almasy towards the Cave of Swimmers and she wears the thimble that he bought her.She says 'I always wore it.I always loved you' and at that moment he starts crying with such pain flowing from inside him.Juliette Binoche is also amazing in her performance and really deserved the Oscar she won.Overall, this is a film that anybody who proclaims himself a cinema lover should watch in their lives.","Here's an interesting point: Almost every picture that ever won the best picture Oscar has a place in the IMDb top 250. Except one. You know which one that is? It shouldn't be hard to guess. Right now, it has an average 7.1 in it's scale. That's much closer to 6 than it is to 8. If this movie is so good, then why does it have such a rank, and why is it isolated from the other \"Best Pictures\"? Simple. It is a mediocre movie, lavished by critics and audience alike because of the \"love story.\" Not all love stories are good, which is unarguable, yet the only reason people say they love this movie is because it was a \"beautiful love story.\" Beautiful it was not. The characters were cold, calculated, and the love story in it is  an affair between two amoral people. The woman is cheating on her husband, and her lover is a German allied spy during WWII. But that's not all. He turns an entire town over to Nazis. When people ask \"what's to hate about this movie,\" the film really speaks for itself. Either that, or the people who rave about this movie are just liking it based on the good reviews. This is a Hollywood movie, covered in a false glaze that gives it the apperance of an \"art house\" film. If you're going to like this movie, at least give a good reason. In my opinion this movie was boring, scornful, with only two saving graces, which is Juliette Binoche and Naveen Andrews' very touching performances. But that's as far as I'll go.A lobotomy without painkillers is preferrable compared to watching this trash.","Not everything was awful about the film; however, the sum of all the hard work and extraordinary talent was so flat and lifeless. I walked out of the theater wondering why I'd stayed to see all of it (and decided that I had because for all of the (deserved) awards it won, surely the story would get better. It didn't.) I know there are fine actors and actresses, photographers, musicians, etc., and this film did display their talent as individuals. When all was said, done, and viewed, unfortunately, the viewer was simply left with a void. I have to \"like\" the main characters to enjoy a film; there was so little to like in either of them.","I have nothing against love stories. I have nothing against epic movies. But this has to be the single most overrated film of the nineties. The story is one big cliche. The movie is dull and boring. All the performances are one-dimensional. the film is far too long and has a sort of fake depth that I hate. The landscapes are beautiful to make the film more impressive. But it fails.When you want a great love story, try casablanca.","Don't read this if you love this movie, or sentimental movies in general, as it would only make you angry. No offense intended, I just hate this movie. And it's not because I'm any prototype macho American male or something.The point is, you don't get to know any of the characters in this film. Yet you have to watch the many tragedies they suffer for a very, very long time.Why do we see so many suffering people without any message, without any point to their suffering, any reason for it? I already know the world is a hard place to be in, I don't go to a cinema and pay to see someone else make a statement to that effect.And why do these two characters suddenly start to sleep together? They don't even know each other and we have to believe their love is so strong and deep. It seemed perverse to me. Not that I have anything against sudden bouts of sex or against innocent perversion, but please if you're making a pretentious movie make sure that you don't depict it as True Love.Conclusion: The images are professional but the film is emotionally very twisted, and the music was disgusting. Vote: a 1. This is the worst kind: pretentious yet unhealthy and manipulative.","A grand, sweeping romance with more than a passing nod to the great epics like Lawrence of Arabia and Dr Zhivago, this is without doubt one of the best films of all time and deserved every one of it's 9 Oscars plus numerous other awards. At the core of this film is the doomed love affair between Almasy and Katharine. Their relationship is totally believable, the dashingly handsome Fiennes and the luminously beautiful Kristen Scott Thomas have great on screen chemistry, perfectly conveying the exquisite pain and passion of falling in love with the wrong person. The sex scenes stay on the right side of erotic desire rather than the gratuitous groping which unfortunately tends to be the default position for movies nowadays. The acting is universally excellent and the casting is flawless with everyone perfectly suited to their roles. Dafoe is a fine actor who has made some dire movies, but his role as David Caravaggio suits him perfectly. Colin Firth gives an understated and poignant performance as the slightly bumbling but desperately nice husband. Juliette Binoche, believable in every part she plays, gives a charmingly earthy performance as the caring nurse.Wonderful cinematography produces a picture perfect backdrop bathed in a golden glow - the desert scenes in particular are a visual feast. Even the music is perfect.It's rare for me to watch a film more than once - I've seen this one at least twenty times. I never tire of it and get something new from it every time I watch it."],"review-user":["littlemartinarocena","Nazi_Fighter_David","jhclues","bduguay","gordie02","mattymatt30","labrang","bob the moo","inkblot11","Mercedes-6","Fifi","ackstasis","orionschwert","t_ilcev","dead47548","buzznzipp1995","arilicious234","roghache","rdconger","hamomili","MovieAlien","booksbybigelow","egg-21","steven-3","lorraineesimpson"],"review-date":["19 May 2009","28 May 2001","29 July 2002","7 September 2003","20 January 2005","19 March 2004","8 November 2004","26 February 2002","7 March 2007","7 May 2001","8 December 1998","2 July 2007","1 December 2011","23 June 2008","9 January 2008","8 January 2007","14 March 2011","13 May 2006","9 March 2003","17 August 2006","1 April 2000","22 May 2006","12 April 2000","13 February 1999","23 May 2015"],"review-rating":["9","9","10","9","9","9","10","10","10","9","10","10","10","10","10","1","1","10","1","1","3","1","10"],"review-title":[" Anthony Minghella's Heart and Mind\n"," A masterpiece of intimate moment and spectacular largesse...\n"," A Magnificent Motion Picture\n"," A reader's movie.\n"," as below\n"," An epic tale of doomed love\n"," a patience taking movie.. ;)\n"," Epic story that mixes lust with a mystery story  worthy stuff but a touch too slow\n"," One of the greatest achievements in all of cinema, peerlessly beautiful\n"," The greatest romance movie of all time? Probably...\n"," Absolute Perfection!\n"," \"Every night I cut out my heart. But in the morning it was full again\"\n"," In my top 100 and will stay there forever\n"," PERFECT.Period\n"," An epic story of love.\n"," \"Enthralling\"...\n"," BEYOND underrated!\n"," Dreary, sordid tale of lust...though spectacular desert scenery\n"," Balderdash\n"," One of the best films ever made\n"," Disregard the good reviews...this movie was AWFUL.\n"," Huge letdown\n"," overrated\n"," Warning! Stressful kitsch! Avoid this movie!\n"," Perfection\n"]}