{"review-url":["http://www.imdb.com/title/tt0120765/reviews"],"review-text":["I'm surprised the ratings for this movie are so low. It's not a great movie by any stretch of the imagination, don't get me wrong, but it's not a terrible movie either. Billy Crystal plays a talent agent who gets fired by his client then almost drowns. Luckily two giant hands save him from the water, and they are of course attached to the \"giant\", George Muresan (spelling?) who he immediately tries to sign on as a client because there is obvious potential jobs for such a huge man. He brings him to the states under the pretense of reuniting him with the girl he used to like, only she doesn't want to see him at all. The movie has comedy at times but mostly it is a dramatic movie, which it wasn't marketed as, so I think that might be why a lot of people are disappointed. It's not a really deep story and the acting isn't great (Muresan is a basketball player and Billy Crystal is pretty much just going through the motions) but it's definitely worth seeing and is a good little movie.","I usually don't read others comments before I review a movie, but for this one I did.  Mixed feelings by others.  Some enjoyed it, some absolutely hated it.  Both were right to do so.  I liked it.  It definitely wasn't a \"great\" movie.  I think your reaction to this movie really depends on what you expect going in.  It's billed as a comedy, but really it's not very funny so don't expect too much laughter.  It is, however, mildly amusing and heart warming.  Most importantly, it's clean enough to be an entertaining family movie.  Don't expect a deep thought provoker, or a hysterical side splitter, but just watch it.  I believe someone else described it as \"predictable fluff\", which is true but that doesn't have to be a bad thing all the time.  It's a nice movie so don't end up hating it because you expected too much.","i totally disagree with the person who first commented about this movie. to me, this storyline is about a man with growth hormonal disorder trying his best to look for the love he is yearning for. Trying his very best to fit into the society who doesn't seemed to accept him.He then met someone who treats him with best friend's love and was shown the way to receiving the love he always wanted to have. the man who created all that happiness in returned received something important from the giant, which is family and spouse love.and the comedy, it's just part of making the audience feel some laughter bugs at certain part of the shows.and i must admit, it made me tear a little.","First off, I absolutely loved this movie. As a Billy Crystal fan, I must say that I was expecting more comedic situations than I actually got. However, it was nice to see him in a role with more depth and emotion. His portrayal of talent agent Sammy was brilliantly performed and uniquely him. In addition, Gheorghe Muresan (as Maximus) was superb in his first film role. When Sammy goes to Romania to visit his client on location he has his world turned upside down. He never expected that he would accidentally find the one person who could change his life. Sammy and Max's journey is unique and moving, and even humorous at times. Plus, the location in Czech Republic where parts of the film were shot, was absolutely beautiful. I have to say, this dramatic comedy had me feeling a variety of emotions. I thought it was excellent and I would recommend it to anyone and everyone.","This film broke my heart especially when his lost love (played bitchily by Joann Pacula)  disses him and actually gets nasty with Billy Crystal who is only trying to help.  I thought she would turn out to be a giant herself and that there would be a twist at the end but that was not to be.  George Muresan was a little difficult to understand but he brought a warmth to the role. I really enjoyed this heartwarming film and Billy Crystal always makes me laugh.  I recommend it highly","I always liked this movie, I have seen it so many times but I always enjoyed it :) the story is interesting and special. But the only thing I have to disagree with is that I don't think Max lived in a Romanian monastery or what was that :P They don't look that way in Romania.. Anyway, back to the story, Ghita Muresan played pretty well but as someone said before me, his English needs to improve. And there were some funny moments and some tragical/sad parts too. It worths being seen, I thought it was sweet that the giant wanted to find his love. I recommended to you all. It's not the best movie ever, but it was nice!","This is a brilliant film. The story starts off in Romania,where Billy Crystal stars as an agent who can talk anybody into doing anything. There is a really funny scene here, where Crystal is a child, and talks his father, who is a rabbi into eating pork (you filmophiles may know that this is a parody of Crystal's religion). He is mainly a talent scout, and he's trying to find a suitable villain for his latest movie. After finding out that the whole film has a terrible crew, he accidently falls into a small river. Believing he is dead, some huge hands come out to reach him. HE later thinks he is in heaven. He finds out that he isn't, but that he is in a monastery. Believing God saved him, he becomes a monk, searching for who saved him. He later finds a 7 ft 7 in man, who he casts as the perfect villain (he also recites Shakespeare!). See the film and find out the rest!","Acting agent Sammy Kamin travels to Romania to see his one (and only) client on the set of a low budget American film.  When he is fired by the actor he drives off in a rage and crashes his car only to be saved by a Romanian shepherd and taken to a monastery.  When he sees his saviour is 7ft10\" tall he realises the potential and gets him a job on the local movie.  Together the pair set out for America  Max wanting to find the only girl ever to care for him (25 years ago) and Sammy eyeing a key part for Max as a bad guy in the new Steven Seagal movie.I love Billy Crystal.  When he is on form he is very funny and can make even average romantic comedies worth watching.  He alone makes it worth sitting through an overlong Oscar ceremony when he comperes it.  However this film is beyond his saving grasp as it is simply just not funny enough.  The plot (and humour) is basically `oh look- here's a really tall guy'.  The worst thing is that it then goes into cloying sentimentality every five minutes as Sammy learns to love again through the spirit of his gentle giant.  And up comes the music that every Crystal film seems to use for `touching' moments.At the start of the film is a scene where Sammy as a child shows his ability of persuasion by sitting down to a roast pig dinner with a rabbi.  This I laughed at but that was the last time (only 100 more minutes to go!) because most of the film is just amusing and any rare good lines are lost in a sea of middling humour.  A cameo by Seagal is quite good but not as funny as it could have been if he'd made more fun of himself.  Even Crystal's dialogue (usually an oasis in the sea of sentimentality) is poor.He doesn't do a good job at all here and, although he is playing his usual character, it's difficult to care less what happens to him or why.  Muresan is an average basketball player who is good as a bench player but not as a starter.  I saw him play in San Antonio when he was with Washington Bullets (as was) and was surprised at how slow and uncoordinated he was on court. On the screen he has the same qualities  awkward, ungainly etc.  He makes a sympathetic character so it's not all bad but it doesn't seem to come naturally for him. The two don't have much chemistry and you wonder if there was much onset banter between them once Crystal had used up all his NBA questions.  The rest of the cast are Ok and there's a few well known faces in there but Seagal is probably the best bit of casting in the film and he is amusing if not funny.Overall this is a pretty average film that is just about passable but certainly not funny or enjoyable.  There are a few laughs and the rest of the film either falls into fake, cloying sentimentality or just goes for laughs by having the big and the small man beside each other.  I love Crystal even in poor films but I won't be watching My Giant again unless I'm tied to a chair a la `Clockwork Orange'.","This is beautiful film making. It did not recieve much publicity, but I found it to be one of the best movies that I had seen that year.*MINOR SPOILERS* Billy Crystal plays Sammy Kamin, a struggling movie producer who travels to Romania and stumbles upon a seven foot tall giant of a man who had saved his life after a car accident. A real life basketball player plays Max (Gheorge Muersan) a kind, gentle loving giant who wants people to respect and care for him. But instead, he is hated by people who feel he is possessed by the Devil because of how quickly he grew as a child. MY GIANT is a touching movie. Comedy beginning and then towards the end, we got into the dramatic moments of the film. Sammy tries numerous ways to make his giant famous, in order to try to score him a role in a movie. But, being famous is not what Max wanted. Steven Segal even plays himself in a ten minute cameo. This movie was great, definetly a winner......5/5.","This is a little film with a big heart. Excellent acting throughout and directed with love. If you missed it in theatres (and who didn't?), catch it with someone you love. Frankly, I cried! And I'm a guy, for cryin' out loud!","This so-so comedy kept me entertained most of the way through, but it got too soapy towards the end for my tastes.  Crystal is his usual likable self, but Muresan is the real find here.  Sure, he could use some brushing up on his English, but Gheorghe has a natural gift for acting, it seems. Unfortunately, the movie is only sporadically funny, and the more emotional scenes seemed forced and just didn't work they way they should have.  It's not bad, but the weak ending left me disappointed.","\"My Giant\" is a pleasant, gentle movie, with some defects, but also containing some original ideas. The plot is divided into two conflicting parts. The first part, located in Rumania, is comic, with Sam (Billy Crystal) trying to convince the giant Max (Gheorghe Muresan) to become an actor. The second part, in the States, is sentimental (sometimes over-sentimental) and touching. Needless to say, I prefer the first part, which offers some really funny moments (NOT the vomit scene, which is, fortunately, the only coarseness in the film).The sentimental part is a bit boring. Moreover, we find in it the cliche family troubles that (according to movies) any American male seems to have. But, in fairness, some developments of the story are original, unexpected and surprising, if not particularly cheerful.I like Billy Crystal and I'm always amused by him. The character of the giant Max is depicted with extreme sympathy: Gheorghe Muresan shows that he can act.A surprising peculiarity of \"My Giant\" is the great respect for Christian religion and priests (here monks), shown along the movie. This is really amazing. The trend in current movies is the exact contrary: Christian religious feelings are systematically scorned, and, in particular, priests are usually depicted as the hypocritical origin of all evil. Since I'm always fond of people swimming against the main stream, I heartily thank Billy Crystal and Gheorghe Muresan for having violated these annoying conventions.","I have really liked the movie. Not only because of the idea behind it, but I was very happy to see locations from The Czech Republic with castles, villages, and people (even actors), etc. What was my surprise, when I hear from the TV: \"Here I am, in Romania...\" Come on, if the filming locations in the Czech Republic are so good, why not to name it accordingly? Because of a story? Well, then go to Romania to shoot the movie and do not give wrong information to viewers (mainly American), who can finally learn something about Europe. As a Czech citizen I am really not very happy about this... But you guys probably do not care anyway, so sorry for bothering you.","I just wanted to say that. I love Gheorghe Muresan, so I automatically loved this movie. Everything else about it was so-so... Billy Crystal is a good actor, even if he is annoying. But the thing that made this movie was- at least, for a basketball fan- seeing Gheorghe Muresan act.","I could not believe \"My Giant.\"  It was not a movie.  Movies have actors. Billy Crystal was his usual annoying self.  I was not surprised by that.  It was big George that killed me.  I couldn't understand a word he said.  Not only can't he act, he can't frickin speak English! \"My Giant\" is a Giant pile of crap.","I'm still laughing- Not! I'm still asking my myself what the point was. I barely got a chuckle, this movie sucks. It tries to be charming and touching, but it turns out stupid. I do not recommend it.","Billy Crystal is not the funniest man in the world, and Gheorghe Muresan certainly isn't much of an actor.  But the Wizard was able to deliver a very good fragile, gentle giant.  The story line was very lame.  The highlight of this movie was the love an innocence that Muresan feels toward a girl he loved 23 years ago.  This movie is billed as a comedy, but feels quite dark at times.  **","This is the best movie I've seen for a long time.  It makes you laugh and cry at the same time, literally!!  I don't know about anyone else but I'm really tired of watching films about  'perfect' people, living 'perfect' lives. Max the big Giant is certainly no Tom Cruise but he's a really kind and normal guy with a heart of gold. Basically he is ridiculed for being a bit tall and having a funny accent and then Billy Crystal helps him become a Hollywood star.Everyone should see this film, then we might all stop being so prejudiced and bitchy.","Gheorghe Muresan is the best part of this movie. He was instantly likable and can actually act!The plot seemed a little sappy and contrived, and the ending was a little dissapointing. All in all though, it's good for a rainy day or for some mindless, fluffy entertainment.","This movie is supposed to be a comedy, but it isn't funny. When a comedy isn't funny, we know we have a problem. I'm not sure Crystal new exactly what he wanted to do with this movie, whether to tell the story of a failed agent of movie stars (played by himself), criticize the system governing show business, or...In any case, he starts on a couple of these endeavors in this movie, but only barely starts... There is nothing of consequence, the movie just seems to senselessly go from one scene to the next, until it finally reaches the (expected) ending. Nothing tragically bad about this film, but nothing good either.","This movie was pathetic.  I had trouble even finishing it, and so did my kids.  It was not the least big funny.  Billy Crystal played a real slime-ball character, who did not really make any big change in his attitude by the end of the movie.  Not worth watching.","This is the greatest movie ever.  If you have written it off with out ever seeing it.  You must give it a second try.","This is one of the most predictable movies I have ever seen. And this supposed to be funny..... Boring, boring, boring. Find the fast forward button at your remote and use it... I can`t say I laughed once, and the only good feeling this movie gave me was relief when it ended.","The most accurate description of how Billy Crystal fairs in \"My Giant\" is to say that this movie is to his career as \"Ishtar\" was to Warren Beaty's - it didn't ruin it, but it slowed it down.......a lot.  Crystal should know the three golden rules of Hollywood: 1) never play opposite a kid 2) never play opposite an animal 3) never play opposite someone that is almost 3 feet taller than you, is as innocent as a kid and \"acts\" like an animal.What is this story?  A comedy?  I guess, but I didn't laugh, except at the scenes where Crystal is on his own and not burdened with his (what-is-her-role-in-this-movie) ex-wife or the afore-mentioned Giant. Did I mention there's also a kid in this film?  Well, forget about him.  The son is brought in to make us feel sorry for Crystal, and we do, but for the actor, not the character.  Billy Crystal is a funny man.  If you don't believe me, watch him in old episodes of \"Soap\" or \"Saturday Night Live.\" Go rent \"City Slicker\" or \"Running Scared\" or \"When Harry Met Sally.\"\n\"Giant\" is more ho-hum than fee-fi-fo-fum.","My Giant (1998): Dir: Michael Lehman / Cast: Billy Crystal, Gheorghe Muresan, Kathleen Quinlan, Joanna Pacula, Steven Seagal: Advertized as a comedy but it is anything but. It does carry an interesting theme regarding human possession and discovery. Billy Crystal plays a filmmaker who is in a car accident in Albania and is rescued by an eight-foot man named Max. He is friendly and skilled in five languages. They come to a mutual agreement. He will star in Crystal's movies and in turn Crystal must locate Max's lost love, who broke his heart and has no desire to rekindle. The method in which Crystal handles this is a break in trust. Another poorly handled scene involves Crystal's son on the phone with Steven Seagal. Directed by Michael Lehman with beautiful photography. He previously made The Truth About Cats and Dogs. Gheorghe Muresan is likable as Max despite his despairing final scenes. Crystal is great with comic dialogue as he takes his discovery to new heights. Kathleen Quinlan as his wife is cardboard with a scene towards the end where she is used to solve a problem that is questionable. Joanna Pacula as Max's ex is not remotely likable. Seagal is either desperate or has a really good sense of humour to be the bunt of this joke as himself. Hardly funny but it does contain a strong theme regarding acceptance and abilities. Score: 6 / 10"],"review-user":["randycoates","mmrobins","chanhuisianamy","acidpluto-1","Melody-3","ScarletRose102","Doc Ali","bob the moo","Jack the Ripper1888","Mr. OpEd","Tito-8","pzanardo","PierreIX","kicking222","slipster-2","Mb19","Innsaane","e.stout","darwin-6","buiger","Ering","Mule-5","per.eide","vokar-2","anaconda-40658"],"review-date":["13 May 2008","8 September 2000","30 July 2005","13 August 2006","12 October 1998","2 January 2006","22 April 1999","19 January 2003","19 April 2002","17 June 1999","25 September 1999","6 November 2000","18 October 2001","11 March 2001","7 August 1999","2 January 1999","27 September 1998","10 October 2000","31 October 1999","8 March 2013","6 November 1998","6 March 1999","2 March 2000","31 August 1999","2 June 2015"],"review-rating":["6","7","10","8","9","10","5","6","10","3","5","3","1","10","1","3","6"],"review-title":[" A Good Movie\n"," Some good, some bad\n"," it's a good movie if you see in depth of it\n"," Funny & Moving...\n"," It's an adorable film\n"," a sweet movie\n"," A heart-warming film for all the family.\n"," You should know something is wrong when a Steven Seagal cameo is the high point of a movie\n"," Brilliant! Funny and heart-warming!\n"," Yes, they do make 'em like this...still.\n"," Decent, but nothing more\n"," A pleasant movie with some original ideas\n"," Location nonsense\n"," Gheorghe Muresan rules\n"," SUICIDE, OR 2 HOURS OF MY GIANT? TOUGH DECISION\n"," This Movie Stunk\n"," Not bad....\n"," A real tear jerker\n"," Big Gheorghe shines...\n"," Not good...\n"," One lame movie.\n"," A great movie that most people never give a chance.\n"," Awful\n"," Giant Loser for Crystal\n"," Crystal's Had Bigger Films.\n"]}