{"review-url":["http://www.imdb.com/title/tt0113449/reviews"],"review-text":["I bought this out of curiosity. How did John Carradine (who died in 1988) and Cameron Mitchell (who died in 1994) make appearances in a film released in 1995? Thanks to the miracle of unused film can footage that's probably been sitting on a shelf somewhere for ten years, that's how! You can tell because the film stock used to shoot their scenes doesn't match the film used for shooting \"Jack-O.\" The curse of Ed Wood lives on. The good thing for both Carradine and Mitchell is that this is exactly the kind of movie you'd expect to find on both of their filmographies. Same goes for Scream Queens Linnea Quigley, Brinke Stevens and Dawn Wildsmith.The setting is Oakmoor Crossing on Halloween, and some kind of curse is released when dumb, beer-guzzling teens disrupt a grave. The result: a hulking killer with a scythe and a big plastic pumpkin on his head! He (it?) goes after the wholesome Kelly family for revenge (and kills others who get in his way). The father opens a Haunted Garage for the neighborhood kiddies. The son (Ryan Latshaw, son of the director) has one continuous, perplexed facial expression for all his scenes and one hilariously badly acted dramatic scene lying in a grave. At least he's a kid. The mother's eyes about pop out of her head while she strains to read her dialogue. There is also an annoying woman who shows up to explain things who seems to be trying to phonetically pronounce all of her dialogue.So what about the name actors? You see Stevens, Wildsmith and Mitchell briefly on a TV screen (they're used to pad out the time). Linnea has a bigger role as a babysitter, and she does exactly what she can with it. Her enthusiastic performance helps a little bit. There's also one out-of-nowhere laugh when an ultra-conservative couple who watch a Rush Limbaugh clone on TV bite it. The woman slips on a rug and stabs a toaster with a knife. She's electrocuted and the end result looks like a flame-broiled Muppet.All and all, pretty entertaining stuff! I wasn't bored!","My buddies and I spent the majority of a Saturday afternoon watching a selection of \"bad\" movies. Among the flicks we watched, the strongest contender (for quality bad-movie fare) was easily Jack-O. It's ludicrous that movies such as \"Gigli\", \"Glitter\" and \"You Got Served\" are listed in IMDBs bottom 100. While they're certainly bad movies, they don't belong in the bottom 100. They're robbing \"Jack-O\", and \"Keeper of Time\", etc, of the Bad Movie Greatness they so richly deserve.So what makes Jack-O so great (in bad movie terms)? For starters, Steve Latshaw, the director, decided to cast his son, Ryan Latshaw, in the role of Sean Kelly. Unfortunately for Steve, Ryan Latshaw was dangerously close to being out-acted by a block of wood. The kid, seriously, has no ability to emote whatsoever. The end result: unintentional comic gold. The kid could be listening to a joke, or just moments away from getting his head smashed asunder, and his expression is one of stony \"emotionlessness\".The other aspect of the movie that we found awesome was the sheer number of \"double dreaming\" sequences. What is a double-dream? Well, it's when a character wakes up from a nightmare, and then something equally nightmarish happens, and then the character wakes up again. Basically: they wake up after dreaming about waking up from a nightmare. Clever device, no? I believe the character of Sean Kelly experienced no less than 3 double-dreaming sequences.Let's see... what else? Oh yeah! This movie has a veritable cast of thousands. It's truly stunning to see how many speaking roles are introduced throughout the course of the movie. Best of all: almost none of the characters have anything to do with the story. They're either killed by Jack-O, or they serve no purpose whatsoever.Jack-O himself was pretty sweet. Like most other B-movie monsters, Jack-O has the amazing ability to, seemingly, teleport over great distances. He's invariably hanging-out, somewhere in the background, whenever you're dealing with a major character. What's puzzling, however, is that when he's actually chasing someone he moves at a shambling/stumbling speed, and yet he's able to keep up with people who are sprinting.That's all for now. Closing remarks: if you're looking for a unintentionally hilarious bad movie, you can't go wrong by renting this beast.Bad Movie Score: 7/10 Good Movie Score: 3.5/10","I bought Jack-O a number of months ago at a Blockbuster video sale, and at the time I wasn't expecting anything outstanding from it. Upon watching it, I realized I not only got less than I could have ever bargained for, but a whole lot more as well. It seems, strange, I know. And it is. But it's perfectly fitting when you consider that the utter weirdness that is \"Jack-O\"The movie follows a young boy named Shawn Kelly. Somehow, thru ancestral ties, he is marked for death at the hands of a demented, scythe wielding Pumpkin man. This pumpkin man was killed by Shawn's Great-grandfather-uncle-cousin-etc, and now that the villain has been resurrected, Shawn's death is apparently crucial to his hell-bred mission of vengeance. Anyway, much \"horror\" ensues as Jack-O hacks his way thru various neighbors before battling Shawn to the finish.I'm not so much here to discuss the plot as I am to determine who may find any worth in this movie. I can honestly tell you that Jack-O is one of the most poorly made movies in the history of time. The acting is deadpan (except when it should be), the script is apparently a 1st grade group project, and the production budget must not have exceeded $150. Some of the most laughable death scenes are carried out in this anti-thriller, and they're all the more humorous when you realize director Steve Latshaw actually seems serious in his movie-making.And yet I heartily enjoyed the film. I can call it a terrible horror movie, yes. But I can also say I had a great time watching it with my friends, and have watched it several times since that fateful first viewing. Many people (including some of my friends) will find this movie intolerable and needlessly time-consuming, and that's understandable. If you're like me and enjoy ridiculously bad horror movies that take themselves seriously, you'll find Jack-O an instant classic, which is also understandable.That's why it's so hard to rate this movie. If I were rating Jack-O's quality as a film, I wouldn't give it anything. In fact, the studio would owe me stars. Yet if I were rating it's on the basis of pure enjoyment, I'd give it an 8 or a 9. I'll give it a 4, so to be somewhere in the middle. I recommend everyone go out, rent this, and form their own conclusion.","Jack-O is the type of movie you rent on a Friday night and enjoy with friends. I liked it not just because of the cheese factor. But also because It's has my two fav scream queens in it. Linnea Quigley and Brinke Stevens. Linnea did a bang up job in this movie. I was actually surprised because her acting so good. And it interesting to see Brinke in a cameo role as a witch. But there were some cool death scenes and I liked the way it was shot. 16mm. My favorite besides digital. Anyway, just rent this movie and eat some pizza. Make sure it's extra cheesy!!!","\"Jack-O\" was scripted by my good friend Brad Linaweaver, so I'm prejudiced in its favour. Low-budget film-maker Fred Olen Ray had a few minutes of footage of John Carradine sitting in a forest at night, and a bit more footage of Cameron Mitchell staring into a camera and telling a spooky story. Ray challenged Linaweaver to write a feature-length script using these snippets of footage. Carradine and Mitchell appear VERY briefly in \"Jack-O\", and not together.\"Jack-O\" is a bog-standard spookfest. Jack-O-Lantern is a homicidal maniac who died in arcane circumstances but who still comes back for one night every year: guess which night. Yes, Hallowe'en. The crucial (dual) role in this film is a small boy in modern times who's related to Jack-O's first victim (also a small boy) from more than a century earlier on. When I saw that the child actor cast in these roles (Ryan Latshaw) is the son of the film's director (Steve Latshaw), I expected a vanity production. But young Ryan is actually a decent actor: in this film at least, his performance is better than his dad's directing.I always expect zero production values in a film like this, so I was pleasantly astounded by the realistic 19th-century prologue. Brad told me that this was filmed in an historic village in Florida. Unfortunately, the first few minutes of the film look much, much better than anything afterwards.There are several very attractive actresses in this film, notably scream queen Linnea Quigley as the heroine, and Catherine Walsh as a \"bad girl\" who MIGHT have supernatural abilities. Untalented Helen Keeling is attractive, but she speaks her dialogue with one of the most bizarre accents I've ever heard.There are some REALLY grotty special effects: notably the lightning (why didn't they use a stock shot?) and the scene in which one character gets electrocuted. I've seen more realistic electrocutions in Tex Avery cartoons. The post-dubbing of the soundtrack is worse than it really needs to be for this low budget.\"Jack-O\" isn't very good, but it isn't nearly bad enough to be one of those Ed Wood-ish camp classics. I strongly recommend it as a study aid for those who want to learn \"Bowfinger\"-style film-making techniques. And some of the actresses are very watchable. Otherwise, \"Jack-O\" is a Joke-O. For thrills and chills, look elsewhere.","Man, this movies sucked.  It appeared to have like seven different plots going on at once and they all made little to no sense.  The special effects, costumes, and all that stuff were beyond awful.  The acting was particullary bad.  Everything seemed so forced, especially the lines from the woman with the huge eyes and the little kid (his \"Noooooo\" as he gets burried is so unenthusiastic it's laughable).  A good portion of this movie is rather funny anyway.  The one woman's death where she shoves a knife into a toaster, gets electrocuted, and magically turns into the crapiest skeleton dummy in the world had my friends and I laughing for a good ten minutes.Bottom line: If you're into watching really horrible movies, seek this one out.  If not, run for your life.","I've always loved horror flicks. From some of the usual well-known like \"The Exorcist\" to some of the more underrated like \"Black Christmas\" or \"Just Before Dawn\". But who are people kidding,even calling this trash a b-movie. It's straight up bottom-of-the-barrel Z-grade. The acting is the worst ever on film. Really,I've seen better on an episode of the \"Young and the Restless\"...SPOILER...Lookout for when the woman comes to tell them about the legend of Jack-o. She pauses sometimes for a matter of seconds as if someone is flashing her cue cards and she's struggling to read her lines. A RIOT! Oh,and besides the bad acting,absolutely no gore or F/X. And Jack-o looked like a plastic lit pumpkin. Watch Linnea Quigley in \"Night of the Demons\",or \"Silent Night,Deadly Night\",far superior flicks.","A bad horror flick requires certain components. A nice shot of a pair of breasts, with no relevance to the plot. A beheading, preferably one where the head rolls to someone who is in love with the recently deceased. An innocent loser who doesn't actually die in the movie, but you wish they would. At least one famous actor in a small and likely irrelevant role. A utility worker of similar individual who gets gored while one of the \"stars\" looks on. If you agree, Jack-o is the film for you. If not, rent Free Willy or something. If you feel plot is important, you're in the wrong genre, I'm afraid. Great for Halloween if you want to kill a few hours.","Ugh. Pretty awful.Linnea Quigley gets top billing, but her character doesn't have a big part. Who is her character supposed to be anyway, the little boy's aunt? Another user commented on her getting nude in a shower scene. While there was a shower scene in the movie, it was a head and shoulders shot. Perhaps there are some alternate versions of this movie.Quigley does have a bigger part than John Carradine, Cameron Mitchell, and Brinke Stevens, though. Carradine shows up briefly in a monkish robe reciting vague dialog. No other characters are in the scene with him, though he's sort of composited in, or else there are over-the-shoulder shots unquestionably belonging to someone else. There's also a really bad photo of him in a cameo locket (it looks like a bad photocopy), and a decent picture of him in a family bible. He conjured up Jack-O originally, or something like that.Cameron Mitchell briefly shows up on a TV as a TV horror host. Brinke Stevens is in the movie he's showing \"The Coven,\" in which she runs around a cemetery in a robe. Evidently there's more of the Brinke footage as a bonus feature on the Retromedia DVD double feature Mark of the Witch/The Brides Wore Blood.Jack-O: what's it about? Darn if I know. A little boy is told a story about a pumpkin-headed demon killer, and he and some other kids are scared by a woman they think is a witch for some reason. She follows him home and offers to help his family with their haunted garage for Halloween (put your hand through a hole and feel eyeballs that are actually grapes, etc.). The pumpkin-headed killer shows up several times to hold onto branches while he watches people, or hold his scythe in front of the camera and pose with it for a while. Sometimes he manages to do more than just stand around holding things, and actually kills people.There are also some flashbacks to a western or prairie family, with the little boy playing the little boy in that family too: ancestors of his, I think. I think they figure into Jack-O's backstory, but I'm not sure how.The little boy is ostensibly the main character, but we don't really learn anything about him except that he wears glasses, has nightmares, and will fight bullies even if he'll get beat up in the process. More time should have been spent establishing his character. I couldn't have cared less if he died.Not recommended, not even for Halloween.","There's something to be said for good movies. There's also something to be said for bad movies. But what about a bad movie that's sincere, very likable, very nostalgic in capturing the fall/Halloween season and full of energy and audience good will? Well that's exactly what is found in Jack-O, a movie with so many painfully bad, laughable elements that somehow mix with the fun elements and turn it into a very entertaining B level horror movie! The good stuff here is the breezy tone of the film and the story itself is enjoyable and fun. I liked some of the small touches like the Halloween garage spook show and the weird conservative neighbors who are killed. Also good to see is Linnea Quigley in a role that is probably too small but it's still Linnea and she brings an element of fun to the film, even if her role was almost useless. The cameos from John Carradine and Cameron Mitchell are from some unknown archive source, but still I liked seeing both of them here. The bad stuff. The plastic Jack-O pumpkin mask is really lame. And the acting is the cheesiest! Then again, that only adds to the fun. The little kid (son of the director) might be the worst child actor I've ever seen but it's hilarious to watch! The adults aren't much better. There's one woman in a flashback scene who you must see in all her monotone glory to believe. The woman who plays the psychic is also quite awful. You will be rolling on the floor in laughter! There is a bit of gore and one topless scene from Rachel Carter who plays the Quigley character's sister in the film. The gratuitous shower scene I see people talking about must have been cut from my tape because you only see Linnea from the shoulders up. There's no other way to rate a film like this than with a 5!","*SPOILER ALERT* *SPOILER ALERT* I bought this video for three bucks. My brother had told me about this one because he had actually met Jack-O. Yes, the dude in the pumpkin mask. B-movie giants walk amongst us. I had to behold the cinematic genius that was \"Jack-O\" so I could live vicariously through my brother.I can honestly say that \"Jack-O\" went exactly like I thought it would. There was not one thing that surprised me about this flick. Well, that's not completely true. I was surprised to see Linnea Quigley in this one. And everybody can relax, she does take a shower. Quigley and showers. Peanut butter and Jelly. So Jack-O comes back from the dead to kill a stoic boy for some reason or another. You'd think that the kid would get a little emotional about a pumpkin man trying to carve him up. Would a scream kill him now and then? Anyway, Quigley babysits him and Pumpkinhead trashes the party. \"Jack-O\" follows the B-movie playbook step by step. Blood, breasts, bad acting, repeat. If you're a B-movie fan, you'll find something to like.","The acting is so bad, the actors couldn't even make it in the porn industry. Z grade acting, bad effects. I mean come on. A garage of horrors for charity? Yeah right. The master copy needs to be stored in a nice hot, humid, radioactive cave so it can rot quickly and prevent anyone else from having to see this monstrosity.MST3K fans will have a field day with this one..","In Halloween, three friends seek an ancient cemetery in the suburb for fun and remove a cross from a tomb, where Jack-O was buried many years ago by the farmer Arthur Kelly. The evil creature is unleashed, kills the trio and seeks the descendants of the Kelly family for revenge.The cheesy \"Jack-O\" is a combination of a terrible story with awful acting. I was curious with the name of John Carradine in the credits and I can not imagine how a relative authorizes the use of archive footage in such a bad movie, showing a total lack of respect with the name of this great actor. It is impressive how bad the acting is, shifting the film to a comedy instead of the proposed horror genre. This is the type of movie good to see with a group of friends, drinking beer, making comments and laughing a lot. My vote is three.Title (Brazil): \"Jack-O  Demônio do Halloween\" (\"Jack-O  Demon of the Halloween\")","Contains nudity (Linnea Quigley, yum), next to no blood, gratuitous John Carradine. A family curse that has been handed down through the generations targets the youngest of the bloodline when a demon is awoken by a group of delinquents. - - - Talk about cockeyed, this movie switches tones like it's bipolar. What starts out as a low budget, family friendly horror picture suddenly is spiced up with a hard bodied Linnea Quigley and numerous other dubious themes. I'm not really sure who the target audience was for this one, but what passes for entertainment comes from some terrible acting, terrible writing, and an especially cheesy pumpkin monster. There was ample territory to succeed as either a gory slasher or a horror themed kid-vid; however, there the mixture here doesn't work. There's some nice work behind the scenes including Latshaw's direction (it looks some what professional)and some solid effects, but that just makes it even more grating when you realize it all went into a movie that wasn't worth it.*1/2 out of 4","Am I being sacrilegious for watching such an awful movie on Easter weekend? This weekend is used to reflect and celebrate the joys of our lives with the spirit of rebirth. And believe me, this movie couldn't have killed that spirit more. To save you from being bored silly with the plot, let's just go straight to the check list:-Awful plot. Check! The story layout appeals to a Friday night flick fan but has about as much emotional depth as dinner theatre. The film is disastrously long and dull. About 30% of the film is designated to Sean Kelly's dream sequences (don't ask), 25% to introducing people who have no effect on the plot, 15% to Sean's dad's haunted mansion, 10% to trick-or-treating with kids no one knows who the heck they are, another 10% to some moron, his girlfriend, and his Harley, and a remaining grand total of 5% to Jack-o. The remaining 5% is reserved for shots of nudity, storm clouds, and people talking about food. -Totally non-frightening antagonist. Check! I've screamed more in an episode of Murphy Brown than this. Jack-o himself is about as lame as a duck with one leg in front of a pack of hungry wolves. He kills a few but there are absolutely no tense and heart racing chase sequences, no real climax. His overall presence lacks fright and bite, something that Freddy Krueger in \"Elm Street\", Jason Vorhees in \"Friday the 13th\", and Ben Affleck in \"Gigli\" all achieved. -Awful F/X. Check! Normally in a standard slasher flick, a victim to the creature's blade will be shown being gutted in all it's bloody, disgusting glory. But of course we don't see this happen. That would require effort, something the crew of this film wern't ready to commit. However, they were generous enough to buy fire crackers and glue them to a crucifix and set it alight. Somebody call the KKK. This self-lighting cross idea could really takeoff.-Awful acting. Check! The boy who plays Sean Kelly is horrendous. At times, it seems like the director slipped him a sleeping pill just before shooting. This kid just mumbles out his lines with no care in the world. The director obviously could not give a damn whether the boy's acting was up to any kind of par. Ironically, the young actor is the directors son! That's nepotism is it's purest form, folks!-Obligatory shower girl. Check! I think no further comment is necessary.-Various other scenes of obligatory nudity. Check! (see above)All in all, Jack-o deserves a few points for making such a disaster and fooling some poor film company into distributing it. Other than that, this film deserves to be dead and buried, much like Jack-o himself.","Jack - 0.. where to start? from the outset its obvious what the tone of the film is, low buget not even good enough for tv values and an incoprehensible script....but that its good for a laugh, such storytelling! how jacko manages to cover miles in less than a minute is never clear niether is his victim values as it were....for random plotholes and poor acting .. go here....its \"class\" all the way watch the actors eyes as they react to a pumpkin as if its totally normal, see the tiny children have random visions in the middle of the floor...oh yes and the most random boob shot EVER! it comes out of the blue and carries on for a good 10 minutes .. perhaps it just felt that way...anyway its worth the price of the rental for a laugh! Go see it for fun and froclics of an eve.","A while back, my friend and I went to get a horror film of ghetto proportions, and found this gem in our local video store. We could not have been more delighted! This movie is the absolute best to make fun of, and just have a good clean laugh at! The acting is quite possibly worse than an elementary Christmas show (personal favorites: The pure \"terror\" when the little boy is being buried alive and the wife of the man in old times who goes off to kill Jack-O). The producers of this movie blew their budget on the opening lightening sequence, making the other effects laughably fake. If you're looking for a horror movie, keep moving on. But if you want to have some good fun laughing at and making fun of a movie so bad that the participants must hang their heads in shame to know it resides on their resumes? You have found it.","Ok...so one rainy night at blockbuster I found that all of the new release movies were out so I took a stroll down the horror aisle and somehow picked this heap of crap up.I dare you to watch this movie and not become infuriated when the father says his lines....","Wow! What a movie if you want to blow your budget on the title and have it look real bad ask the guys that made this movie on how to do that. They could have spent the money on a good rewrite or something else. Or they could have spent it on beer when they made this movie at least it would have come out better.","I had known Brad Linaweaver at Florida State U in the early 70's when he was an inspiring, inventive writer who I thought was headed for greater glory.And that is why I rented this video. Well, well, well, the time has not been kind to Mr Linaweaver. I suppose the pressures of making a living makes higher aspirations expendable. Another flower whose bloom has come and gone un-noticed in the summer breeze. Amen. There is nothing more to say. And nothing more to add. A sad epitaph to a once blossoming career as stated above. But it is the price one pays for chasing shadows without a firm foundation or goals for oneself in life. Because this movie has no goal, no purpose, and I kept telling myself, what happened to Brad's creativity, his once shining genius? Gone, gone, years of neglect has deteriorated his once shining mind.","This is B-Movie garbage at its finest. This film comes with the obligatory shower scene, random frontal nudity, and cartoonish death sequences. If you can find this thing at your local video store, rent it for a very cheap laugh. The sad part is that the movie was made in the 90's.","When you watch low budget horror movies as much as I do, you get to where you can tell who was involved in creating the movie, as each film-maker adds his own flavor to the cheese. Such is the case with Jack-O. When I watched this truly awful movie, I was left with the undeniable feeling that Fred Olen Ray was involved, maybe not as director but in some fashion, and as I researched, I found that I was correct. Only Fred and a handfull of others could write something this pathetic, and this movie just reeked of Fred Olen Ray. Unless you like Fred Olen Ray (and God only knows why anyone would)avoid this movie. If you're going to rent an Olen Ray pic, rent Hollywood Chainsaw Hookers, it's the only bright shining star in Olen Ray's dark cheesey universe of terrible movies.","Any film that has horror veterans Linnea Quigley, Cameron Mitchell and John Carradine all in the same feature must surely be worth its weight in gold. Jack-O is notorious for being the second to last movie to include a role for Mr. Carradine senior. He died in 1988 and this was released in 1995, which means that his performance was obviously lifted from stock-footage. It's ingenious how Steve Lathshaw made it work, really. I wish I knew more about where the scenes came from, but I have been unable to track down any information at all. If anyone knows anything further please let me know. The screenplay was adapted from a story by Fred Olen Ray, whom himself has helmed a host of B-movies.  He was behind slashers, Scalps and Final Examination and to the best of my knowledge; he's still working today. After this, Lathshaw went on to direct a couple more flicks, including Death Mask, before settling for a more lucrative career in writing. Unlike most American direct to video/cable horror films from the mid-nineties, this actually got unleashed in the United Kingdom. The Midnight Movies label that distributed it released so few, that original copies have now become somewhat of a rarity, selling for fairly good money at film fairs. Although it's by no means brilliant, the qualities lie in its utter trashy cheesiness, with comical characters and tongue in cheek horror. Many years ago, the families of Oakmoor Crossing tracked down a vicious murderer named Walter Machen (Carradine) and lynched him. He was a powerful warlock and just before he died, he summoned a demon from the depths of hell to seek revenge on the townsfolk. The assassin attacked and butchered lots of people, until a man called Arthur Kelly found a way to stop him for good. Now, present day, three rowdy teens accidentally revive the pumpkin headed fiend, much to their disadvantage. Armed with a decidedly nasty scythe, he heads back to the same town to continue where he left off his killing spree. He couldn't have picked a better night for murder, because it happens to be October the 31st, or in other words, Halloween. Arthur's great, great Grandson, Sean Kelly (Ryan Lathshaw) is only a young boy, but little does he know, that he is the only person alive with the power to stop the bloodthirsty killer. Will he realise his potential before the demon reaches his parents, or will he be too late?They don't come much cheesier than this lowest of the low' budget Halloween flick. Everything from the killer's laughable Jack-o-Lantern head (like they had them in the 1890s!) to the way they touted his rhyming urban legends (Mr Jack will break your back and chop off your head with a whack whack whack!) was certainly top-drawer entertainment. The most amusing thing, was the woefully out of date cool dude' character, that looked more like Fonzie than anyone from the present day. Complete with quiff, leather jacket and motor cycle, his dialogue alone wouldn't have sounded out of place in a Grease re-make! Over the years, since her debut in Psycho from Texas and inclusion in tonnes of cheapo flicks including Graduation Day and Fatal Games, Linnea Quigley has gained herself a devoted cult following. She doesn't disappoint here, taking a long gratuitous shower displaying at least two minutes of customary T&A, in her first scene alone! Her only real rival for the crown of queen of the schlock-horrors' is that other B-movie favourite, Debbie Rochon. Quigley is probably the better actress of the two, but really it's only down to weather you favour Blondes or Brunettes as to decide which you prefer. They've both done their fare share of trash!Unfortunately, the lesser-known faces were all mostly pitiful. Gary Doles was the only one that attempted to add a little life to his character and even though he wasn't exceptional, he scores ten out of ten for effort. If you blink, you'll miss Cameron Mitchell's brief cameo. He plays Dr.Cadaver, a creepy TV presenter that hosts a show filled with all things horror. His inclusion in flicks ranging from The Toolbox Murders to Memorial Valley Massacre made it a part that he was undoubtedly born to play. There were two anti-liberal toffs that were there to supply the comic relief, which really wasn't necessary, because the whole thing was little more than an inadvertent giggle in the first place. Their joint talks of people being blind to the Government and the like made them an instant cert for a gruesome demise. A grisly fate for the snub twosome was as predictable as death and taxes.The special effects were perhaps the lamest that I've ever seen. The lightening looked like it was drawn onto the negatives with a felt tip pen and the killer's lantern head was so blatantly a shoddy mask that it was ridiculous. It isn't really fair to criticise the lack of production though, because I'm sure that this was made with the best intentions from a shoestring budget. They at least manage to chuck in some gooey red-stuff and a fairly well modelled decapitation, which pushes the boundaries of the 15 certificate. Together with the fairly strong nudity, it acts as further proof that the censors must have been either from another planet or smoking an eighth of crack when they rated Christina's House as an 18! Lathshaw tries a few interesting camera angles and the woodland scenes are all surprisingly well lighted. You won't get bored whilst watching and it doesn't hang around to introduce cheesy horror as the central characteristic. Keep a look out for the director's son, Ryan in a starring role. You can't deny that he's an authentic actor', if nothing else!What did you actually expect from a movie called Jack-O' with a pumpkin-headed killer on the cover and Linnea Quigley in the cast? Of course it's going to be cumbersome, clumsy and misbegotten! But thankfully, it's bad in a good way and fans of mature cheddar circumstances, will find more than enough to fill their hunger. It's better than that other Halloween-based throwaway, Hack-o-Lantern, but I wouldn't expect any brilliance, because you'll be fairly disappointed. Come October the 31st, don't you dare forget that Mr. Jack will snap your spine and cut you in half with a scaly vine? Oooooooh!","This thing, it shouldn't be called a film, is almost worse than \"Manos\", but you just have to see it it's hilarious. If you see it at video store rent it, if you see the 10th anniversary edition, yes there is a special edition, for under $10 buy it, if your friend has it borrow it, you just have to see this. The acting is so bad, and the gore is is so fake. After viewing this you'll be asking yourself why did they make this insult of the art of film? That's assuming your face doesn't melt off like the Nazis's in \"Raiders\" . If you manage to see this, be sure to vote this movie as 1 (awful) so it can make the bottom 100, it really deserves a spot there. I'm surprised it's not number 1, right now.","Quick, cheapie horror film is a ripoff of far superior Pumpkinhead. Grave robbers accidently unleash a demon with a jack-o-lantern head who sets about searching for a young boy on Halloween night. Turns out that the young boy is the only one who can destroy him. Slow paced, dull, and with a recycled script and awful special effects. This film fails to entertain on a it's so bad, it's good level.Rated R; Nudity, Graphic Violence, and Profanity."],"review-user":["capkronos","Volstag","Lukeydude-1","bfan83","F Gwynplaine MacIntyre","TimeChaser","Nixshows","Neal-17","FieCrier","Charlotte_Kaye","Dr. Gore","Rattrap007","claudio_carvalho","stevencraigvankooten","Lady-of-Rohan","Oracle_Isley","bubelz","clubjimi","thelittletoe","shadgrin","jedgrey","demonchylde","RareSlashersReviewed","TheTallMan666","brandonsites1981"],"review-date":["29 January 2002","13 September 2004","24 February 2005","22 December 2003","26 September 2002","20 April 2003","18 April 2005","29 October 2000","23 April 2005","9 July 2006","15 January 2005","7 October 2001","21 March 2008","16 April 2007","25 March 2005","28 September 2003","2 November 2002","30 July 2001","29 May 2000","11 February 2005","25 July 2001","22 July 2001","6 March 2004","29 July 2005","2 June 2002"],"review-rating":["4","7","4","1","1","2","5","3","1","1","1","1"],"review-title":[" Good dumb fun!\n"," Unintentional Gold\n"," Jack-O offers strange enjoyment\n"," cheesy entertainment.\n"," Low budget? NO budget!\n"," Really bad.... but also really funny\n"," B-movie? More like Z-grade.....\n"," Recipe for B-movie satisfied\n"," a movie about Wacko Jacko would have been scarier; this is lame\n"," Absolutely hilarious! I LOVED it!\n"," Jack-o, oh Jack-o\n"," Horrid film\n"," Terrible Story Associated to Awful Acting\n"," Jack-O-Lantern (1995)\n"," It's harvest time!\n"," hiliarious!\n"," Looking for laughs??\n"," Characters made me angry\n"," Way to go, blow your budget on the title screen.\n"," Sad Epitaph for Once Aspiring Writer\n"," Worst Horror Movie I've Ever Seen\n"," Somehow I knew Fred Olen Ray had something to do with this.\n"," Mr. Jack will make you giggle, full of cheese and full of niggles...\n"," Horrible, but you have to see it.\n"," * out of 4.\n"]}