{"review-url":["http://www.imdb.com/title/tt0113048/reviews"],"review-text":["Well, I'll probably get pounded for giving this one a medium rating, but I was able to set through this one even though the writing is bad, and so is the direction and editing. I just can't totally rip a movie that has this much talent in the cast. Pity that a better job couldn't have been done in all other areas. Lance Henricksen and David Warner, as well as Joe Don Baker, are great character actors, and although it pained me to see them wasted in this, they at least tried their best to give it some vestige of dignity. Counting those three, you've got about 9 or ten people here that are at least capable actors and have a following, including Ashley 'Hellraiser' Lawrence and Corrina 'Corey' Everson, who gets my vote for one of the hottest babes of all time-and both women were, sadly, never utilized properly by the powers that be in Hollywood. How the makers of this thing EVER were able to assemble all this great group is totally beyond me, but as I said, there's no other reason to watch this.","When a \"Cops\"-like reality show films a drug bust, and said bust goes sideways, everyone in town wants the tape it was filmed on. The heinous massacre of twelve police officers caught on video was masterminded by arch-baddie Cooper (Warner), and the cameraman who barely made it out of there alive, a guy named Bill Knight (Combs) finds the next couple of days quite trying indeed. Everyone from Cooper's right-hand man Taft (Henriksen) to the mysterious Donovan (Baker) wants a piece of Knight. Meanwhile, Detectives Duke (Napier) and Kincade (Rossi) are working the case and trying to get to the truth of this tangled web. But when Knight meets an attractive nurse named Laura (Laurence), things seem to be looking up for Mr. Knight...but in this complicated web of twists, turns, and constantly changing allegiances, who can really tell? And who is going to commit the ultimate FELONY? David A. Prior, known to action fans all over as the AIP guy, here corrals an amazing B-movie cast for this non-AIP outing. It was 1995, video stores were booming, and with the right cast, they had a place for Felony on their shelves. With Jeffrey Combs as the main character, Ashley Laurence as the female lead and sidekick, and Lance Henriksen with an impressive array of multi-colored shirts, that was just the beginning. We get Joe Don Baker with a triumphant introduction to his character, with an alley rescue scene that is really a lot like the one in Ring of Steel, also with Baker. Maybe rescuing people in alleys is his \"thing\". And with his fringed jacket that he no doubt bought at the local buckskinnery, he gives Seagal a run for his money. Then there's Napier playing a guy named Duke, as he would right around the same time on The Critic, and Leo Rossi doing his best southern accent. Add to that David Warner with a grenade launcher and a small role from Cory Everson, and you have a recipe that raises Felony above the average dreck.Prior was surely going big-time with this one, indicated by not just the cast, and the fact that it was released by New Line, but also the level of stunt work, with PM-style car-flipping and blow-ups. Cooper even kills off a lot of cops just like baddies do in PM movies. And of course there is the standard pew-pew bullet shooting. He was aiming high, and it works for the most part. At least it's better-acted than usual, thanks to the experienced cast of familiar names. It's basically as dumb as an AIP movie (and we mean that in the best possible way, of course), with plot holes so big, Stephen Hawking has warned us all that they could potentially slow down the space-time continuum. But this time Mr. Prior has more resources at his disposal than usual. There are even some interesting contemporary references, like to the Tonya Harding-Nancy Kerrigan hoo-hah that everyone was talking about at the time. If only we could have heard David Warner utter the name \"Gillooly\", Felony would have shot up a few points.So go back to a time when strippers stripped to sleazy heavy metal (presumably this is the song \"Dynamite\" by a band called Psychic Underground listed in the end credits), and to a time when an array of B-movie stars such as this could assemble for a project like this.","Alright I'll start this off by saying the box cover is a lie, and a confusing lie at that. Leo Rossi is featured prominently there, but has about 12 minutes of screen time and is not the focus of this movie. Despite appearing nowhere on the front cover, this movie stars Jeffrey \"Re-Animator\" Combs as a reporter(?) who captured footage of a drug deal/political agenda killing(?) and is being chased by drug dealers/cops/crooked and/or non-crooked government agents(?) You'll notice there's a bit of uncertainty in this statement, and that's because despite having watched this movie in its' entirety I'm not quite sure what happened. This movie is either the greatest action movie spoof of all time, or the most clichéd attempt at a serious action film of all time, all I know for sure is that I loved it. This movie has a downright stellar cast, Ashley Laurence(Hellraiser series), Lance Henrickson(everything ever made), David Warner(everything else), Charles Napier(that guy that's played a general in everything for the past 30 years), and the man himself, Joe Don Baker. The strangest thing about this movie is its' focal point. For the first 30 minutes or so it's nearly impossible to figure out who our star is. The movie jumps from character to character almost desperately searching for someone to follow. It almost feels like this was supposed to be a vehicle for an 80's action star, but the filmmakers couldn't secure one so they just shot the movie based on the secondary characters from the script. It really does play out like the intended gun-toting catchphrase spouting protagonist just forgot to show up. The movie gives us shootouts, car chases, explosions and double crosses, and you'll be hard pressed to figure out what's going on even when they explain it. This may not be your cup of tea, but I was absolutely astounded.","Lance Henriksen has a knack for being the top name in a B-movie, even in this case starring along side Charles Napier, Master Control Program, and Joe Don Baker.  As always he does a great job of being the bad guy, but the plot is just bad (don't even get me started about the ending).  And the editing is so horrible it might actually be a thing of beauty.  Is it just me, or does it seem that Joe Don Baker was spliced into the movie at the last minute?  Also, anytime glass is broken in this movie, the editing is so anti-phenomenal.  Lastly, after watching this, I figure David Warner is dying for Tron 2.0 to finally get the green light.Unfortunately for Felony, this will be the third movie I give the rating of 1/10, joining Iron Eagle IV and No Mercy.","If you are a fan of low-low-budget action flicks, with semi-famous and once-famous stars, then you might allow yourself to enjoy this movie more than it deserves.  Only Joe Don Baker seems to have put any life into his performance at all.  The best David Warner could come up with was having his character chew gum loudly.  The action follows a crew of a \"Cops\"-type reality show involved in a huge nighttime shootout that leaves a dozen police officers dead, although the plots has more holes than they do. The two guys in the crew, one of whom is a pained-looking Jeffrey Combs, film the massacre unbeknownst to the killers even though the camera was about twenty feet from them with the spotlight shining merrily.  The rest of the movie has Combs being pursued by the killers who just happen to be a CIA splinter group, two bumbling cops, and a charismatic inter-agency spook mediator.  The ending of the movie, which I won't dare spoil, is so laughable and totally implausible that it completely invalidates the entire plot.  No exaggeration.","'Felony' is a B-movie. No doubt about it.Of course, if you take a look at the cast lineup you might have some high hopes for its entertainment potential. This film is stuffed with all of those wonderful character actors that you grew up with, the ones with the faces you immediately recognize even though you probably don't know their names. It's amazing that the filmmakers were able to get all of these people together on one project, almost like they decided to do a B-movie actor reunion. The cast even includes a couple of really first-rate actors: David Warner, who most people will recognize from 'Titanic' (although my favorite of his roles is Jack the Ripper in 'Time After Time') and Lance Henriksen, who many will remember as Bishop in 'Aliens'. These two actors have done some excellent work in their long careers and made some very fine films.However, as impressive as this collection of actors is, their talent is never fully manifested on the screen. The writers of 'Felony' spent a lot of money to assemble a dream-team cast and then missed their golden opportunity because of one important factor, the common denominator of all B-movies: a silly script.We start with a silly premise. The bad guys are caught on tape committing a gruesome murder and they relentlessly pursue the film crew in order to acquire the videotape and destroy the evidence. But honestly, why bother? In the time it takes them to track down the film crew, a thousand copies of that tape could be made and circulated to every law enforcement agency and media outlet. The criminals don't seem to realize how futile their effort is, and they talk as if stealing and destroying the one original videotape is going to solve the whole problem. Silly...but I suppose if the bad guys were so logical there would be no movie.Then there is the dialogue. It is at times silly, at times cliché, and at times unbelievable...everything you have come to expect from a B-movie. Of course, I have always believed that strong performances can overcome a lot of weaknesses in the material. This cast includes actors who are definitely capable of strong performances, and although a number of the cast members are not good actors at all and have achieved B-movie status quite deservedly, one still might be hopeful that the stronger part of the cast would be able to infuse some life into their parts. However, it's disappointing to see that few of the actors in this film really seem to take the movie seriously enough to give it their best shot. There's not much inspiration evident in these performances, but then again it's an uninspiring script. Now, I'll admit that some of the more colorful actors in the cast do manage to add a certain amount of pizazz into the delivery of their lines, but honestly, even the very fine actors I mentioned earlier seem mostly disinterested and uninvolved with the story.Speaking of the story...even if the acting had been of a high enough caliber that it made the dialogue seem a little less cheesy, it still would not redeem 'Felony' from the fact that its writer commits the ultimate faux pas of low budget action movie scripts: a plot with as many holes as a block of Swiss cheese. You can watch this movie a hundred times and you still won't figure out how everything adds up. In an effort to create suspense and always keep the viewer guessing, the writer throws in all kinds of surprises and unexpected twists into his script and ends up with a jigsaw puzzle, but when you get to the end you find there are a bunch of pieces that just don't fit anywhere and others that are missing. I admire a good thriller that keeps me guessing, but creating plot twists that exist just to confuse you and which are not consistent with the rest of the story is amateurish. There was so much that was never explained that I felt extremely frustrated at the end. If you decide to watch it, be prepared to be confused.I haven't even mentioned all kinds of other silly things about this movie, but I won't bother. The funny thing is that despite everything I've said, I have to admit that I can't give 'Felony' 1/10 stars. Although I can't exactly put my finger on why, I actually found this film to be somewhat likable. The silliness can actually be fun at times if you are in the mood for it. Plus, I really like some of these character actors, and even though their performances are somewhat lackluster considering their talents, I still got a kick out of seeing them.Now, I realize I have been rating this film from the standpoint of a serious moviegoer. It's entirely possible I have completely missed the point. It could be that the filmmakers' intention all along was to make a B-movie. Maybe the silliness is all completely intentional. If that's the case, and if I were to rate it on those terms, I would have to say that 'Felony' is a classic in the genre of tongue-in-cheek action flicks. B-movie fans will love seeing all of their favorite actors together in one film, will get some chuckles from the script, and will be entertained by the healthy dose of guns, explosions, and chases.","Whew, this movie tried but failed in my book.They seemed to try to make this a mind movie, twisting and turning characters in your head of who's who. seems everybodies not who they say they are, or are people who are all conniving without others knowing. They took shootings, chases and car chases into unbelievable situations.the acting is horrible, as they try to make everybody cool, but in fact, all woulda been killed if the situation was real. they made the cops look dumb and the crooks look like they were cool when in fact made it look fake. the ending was just so dumb on who the main character was. when he shoots the bad guy at the end, he does a summersault for no reason, it was like, why? you gotta be kidding!!SPOILER = the main character is shot, whacked over head repeatedly with tennis racket, jumps off a 50 foot bridge, jumps through a plate-glass window, then flies off car thru store window, punched etc.. and he goes on with no apparent injurythe only reason i finished this movie was because my remote controls battery died and i was too lazy to get up to turn off. id only recommend this movie if there was nothing but infomercials or romantic chick flicks onOK, OK, i know this was a little harsh, but its my review, take it or leave it. hehe i gave it a 5 only because they actually got it into theatres.Now, if they took the basic plot and rewrote it, it might actually be a better movie","I saw this film only because I really liked Combs in \"Re-Animator\" and \"The Frighteners\". \"Felony\", however is a low-budget, slow-moving and predictable film and Combs is its only saving grace, and even he can't make it work.For die hard Combs/action fans only.A 3 out of 10.","With several name actors (Lance Henrikson, David Warner, Joe Don Baker), why was Jeffery Combs given the lead?  Henrikson would have been a perfect fit for the lead, as would Warner, Baker or even others in the movie such as Charles Napier.  Combs was miscast in this, and did a poor job of it. Everything he did seemed fake or contrived.The script is poor.  Meaning that if Lance Henrikson (or another) had the lead role, he might have saved the film (removed it from my \"waste of time\" category), but it still would have been a bad movie.  The screen play was completely lacking.  The director should have recognized this and helped the movie along.","I can't believe that Henriksen did this film.  I have never, ever, EVER seen a \"film\" that is such a total, utter and incredible waste of time, energy, celluloid and brain cells than this atrocious piece of tripe.  The simple fact that I actually sat through this entire film makes me feel that maybe I need to re-evaluate the way I spend my time watching films.  If you ever have the time to watch this movie, do yourself a favor and go do something productive, like counting how many cigarette burns your friends have accidentally put into the carpet in your house, because you will feel much more useful doing this than you will watching this total waste of space. I'm going to go wash my eyes out with rubbing alcohol now, as I have to cleanse myself of this god-awful \"action film\" with some of the worst acting and scenarios that I have EVER seen."],"review-user":["themoviebuff2003","tarbosh22000","ZombieRanger","bsl05","Charlie Goose","briantrash","windtar","BastardBlob","tsmithjr","botkiller"],"review-date":["17 July 2006","26 December 2014","12 March 2010","25 February 2004","3 January 2004","31 January 2007","2 January 2008","1 October 2000","16 February 2004","24 August 2002"],"review-rating":["5","6","1","4","5","1"],"review-title":[" Mindless but fun, only due to the cast\n"," Prior was surely going big-time with this one!\n"," Baffling... but in a good way.\n"," Lacking in so many areas\n"," Cheese that does not please.\n"," B-movie with an all-star cast and a silly script....it's sort of likable if you're in the right mood\n"," They tried\n"," Jeffrey Combs carries mediocre action flick\n"," What a waste of time.\n"," this is one of the worst films EVER made\n"]}