{"review-url":["http://www.imdb.com/title/tt0120907/reviews"],"review-text":["I feel compelled to speak up for this film against the spoilt ravings of the it-said-it-was-like-the-Matrix-but-I-didn't-see-any-cool-computer-graphics-a nywhere crowd that have dominated these pages.There seem to be two schools of thought on the use of special effects in movies.  The prevalent theory - depressingly common among film goers and film-makers alike - seems to be that a good effect should stand out of a film and make the audience coo like a pigeon.  If you subscribe to that theory, fine, watch the Matrix and be happy.  If you think that a special effect is a means to an end, a way to portray a fictional vista as a believable realism, then watch eXistenZ and marvel at how a grotesque and visceral world can be made so engrossingly real and intriguing.  This film has its fair share of effects, but they are so well grafted into the ethos the film evokes that you just won't notice them on first viewing.  And in contrast with the current trend towards computer-generated effects, Cronenburg knows the value of his tactile world; the physical creativity involved in the gristle-gun building scene is a fantastic example.Okay, so virtual reality has been used many times as a concept - and by films that actually came BEFORE the Matrix too - but the totality with which this film portrays its own organic brand of VR is truly engrossing.  Jude Law and Jennifer Jason Leigh are utterly watch-able and the chemistry between them is the perfect vehicle to lead an audience through the admittedly gruesome situations the film describes.There is an element of old-fashioned escapist fantasy in this film that manages to be strangely endearing despite the gore and I suggest that this is where the film triumphs - a triumph that can be attributed to clever writing, intelligent acting and characterisation, a compelling story, charismatic leads, a vivid and disciplined imagination and the discerning use of effects and visual style.If the Matrix is an `oooh, aaah' sort of film, then this is more an `oooh, eeugh' movie - but don't allow the glare of the Matrix to dull your senses to the darker appeal of eXistenZ.","Everybody seems to compare this to The Matrix and The 13th Floor, and when I first saw it I would have agreed -- I was expecting The Matrix and was a little disappointed.  But upon repeated viewings my respect for this movie has grown immensely.The thing to keep in mind is that The Matrix is a great action movie with some philosophical mumbo-jumbo thrown in.  The 13th Floor is a passable action movie with some slightly more interesting philosophical mumbo-jumbo thrown in.  Existenz is not an action movie at all, and is not (as many seem to believe) about \"reality\" or any such \"deep\" concept.  It's about the human tendency to intentionally replace reality with an artificial (both in its origin and in its behavior) world of make-believe.The most chilling moment in the movie is when Allegra Geller repeats her \"scripted\" line.  It's at that point you realize that the people in the game have voluntarily surrendered their free will in order to participate in a story.  This is made even more frightening at the end when D'Arcy Nader (or rather his player) comments on the possibility of spending one's life in the game.  I sympathize completely with the \"realist\" philosophy, that providing interesting worlds in which people simply locate the correct predefined path to the end goal is ultimately a recipe for a soulless existence.  Living \"in the game\" is not living at all, but is a tempting way to spend one's time on earth.  As Allegra comments about the real world, \"there's nothing going on here.\"  Might as well jack into someone else's imagination, and pretend to be doing something interesting.  (Although I have to ask whether Cronenberg considers this a self-indictment, considering that he himself offers up worlds to be experienced in 90 minute snippets.)Upon leaving the theater after first watching this movie, I thought it was one of those movies that was watchable only to see how it ended.  But having seen it a couple more times (thank you SciFi Channel) I've realized how much deeper it goes.  Seriously, if you've only seen it once, it deserves another viewing.","David Cronenberg, much like colleague David Lynch, is an acquired taste. A director who plays with themes like reality, perversion, sex, insanity and death, is bound to get the most extreme reations from audiences. He proved this with films as The Fly, Naked Lunch, Crash and eXitenZ (capital X, capital Z) and more recently, Spider. It's best to see eXistenZ with a clear mind. Try not to read too much about the plot, or it'll be ruined for you. What I can tell you is that Cronenberg takes you on a trip down into the world of videogames that acts as a metaphor for any kind of escapist behaviour. Living out fantasies is something people always dream of, but how far can you go into it, before reality gets blurred and the fantasy takes over and turns into a nightmare? Those are the themes touched in eXistenZ, an exploration of identity, the human psyche, physical bodies being invaded by disease and most importantly, reality itself.The story and directing are excellent. Cronenberg knows his trade very well and succesfully brings to life an artificial world, avoiding the usual pitfalls and clichés linked to stories such as this. The film shows some pretty disgusting stuff, but is unusually low-key in the gore department in comparison to Cronenbergs other work. The shock effects he plays on are never over the top and the plot progression is very intelligent and creative. It's not the most intellectual movie ever, but it will leave you thinking about it, wondering and pretty confused.The acting gets two thumbs up as well. Both protagonists, Jennifer Jason Leigh and Jude Law, play their parts perfectly and cleverly portray their character's shifting moods and identities. The dialogue may seem a little stale and clinical at times, but that is part of the effect Cronenberg was going for, to create a disaffected and alien atmosphere that puts you quite at unease. Supporting actors as Ian Holm, Don McKellar and an especially creepy Willem Dafoe lift the movie even higher with their disturbingly familiar performances.This movie takes some getting used to, but if you can appreciate the dark tone, blood-curdeling imagery and existentially warping story, you'll love it.","By far the most bizarre and inventive films from David Cronenberg, and a film that is sure to become a cult classic. The story cannot easily be summarized in a small review without spoiling the movie completely, so you'll have to see it for yourself.The special effects are well done, but thankfully not overdone. The film relies mainly on the chemistry between Jennifer Jason Leigh and Jude Law, who plug in and out of the game throughout the movie, and what is actually the real world become less clear as the movie goes on. The violence and carnage, which Cronenberg has become famous for, certainly catches you off guard at times. In fact, some scenes will send a shiver up your spine. The acting is superb, with Jennifer Jason Leigh playing a convincing hero, while Jude Law is excellent as the uneasy, often unwilling participant in her mind-boggling game. Willem Dafoe is, as always, a treat to watch as the mysterious, intimidating, and off-the-wall characters he is so good at playing.eXistenZ is the most unusual Cronenberg film to date, and that is saying something when comparing to his earlier movies like Shivers, Scanners, and Videodrome. It has a great script, great direction, and the idea behind the film is pure gold. Cronenberg is definitely one of the most daring and original directors of our time.","\"We're both stumbling around together in this unformed world, whose rules and objectives are largely unknown, seemingly indecipherable or even possibly nonexistent, always on the verge of being killed by forces that we don't understand.\" So says Ted Pikul in the film. Which for some people sums up life and 'eXistenZ' probably is a film about existence. What is real and what is unreal and how you tell the difference. Or not. The last line of the film is superbly ambiguous.The film seems like a shaggy dog story (indeed it has a real shaggy dog in it) but it takes you along on an interesting ride, full of provocative Cronenberg touches that will make you look at amphibians, game pods, fish, spines and bones in a new light. Some bits are quite icky. It takes place in a rural setting where the gas station is called 'GAS STATION' and a Chinese restaurant is called 'CHINESE RESTAURANT.'The film has an engrossing texture that is leagues away from your usual big budget science fiction movie.You can read many things into the film and it repays watching more than once.The main actors are Jude Law who is OK and Jennifer Jason Leigh who is great. Some roles don't suit this very talented actor but when she has a good role like this she is unmatchable. Her unconventional beauty and fascinating voice suits the part of Allegra. (Looks great in a short black skirt too.) There are other familiar actors but they are not given much to do. It looks good, sounds good and a Howard Shore score complements the film very well. Cronenberg is possibly the Alfred Hitchcock of the sci-fi/horror genre. No matter what film he makes he is always worth watching.","'eXistenZ' sorts out the men from the boys. That is, your reaction to this marvellous movie will depend whether you are S.F. literate and familiar with Cronenberg's oeuvre, or a 'Matrix'-loving, Johnny-come-lately. Now I enjoy 'The Matrix' as a superior action movie, but no movie in recent years has been so overrated, and grossly exaggerated as intellectual fare! 'eXistenZ' and Alex Proyas' similarly overlooked 'Dark City' are everything 'The Matrix' claims to be - intelligent, thought provoking, CHALLENGING S.F. This movie is almost a summary of all the themes and motifs that Cronenberg has been obsessed about for the last 25 years or so. Especially the Burroughsian \"biological horror\" and the Phildickian questioning of reality. While it echoes many of his previous movies, it especially evokes his masterpiece 'Videodrome'. It may not reach the hallucinogenic heights of that movie - very few have - but it certainly takes you to places most contemporary S.F. and horror movies don't even try to reach.However this movie isn't just Cronenberg rehashing his \"greatest hits\". There are more than enough new and interesting touches, especially the Rushdie-like Fatwah theme, the odd sexual symbolism, and the witty touches such as the bone guns that fire teeth. Helping all this along is the interesting, carefully chosen cast. All are good, but I especially like Willem Dafoe's creepy garage mechanic, and it was also great to see Canadian cult star Don McKellar ('Highway 61', 'Twitch City',etc) as the enigmatic \"Russian\" Yevgeny.'Videodrome' has taken many years to find its real audience, and maybe 'eXistenz' will too. But I believe eventually it will be recognised for what it is - a work of great imagination and flair.","\"All reality is virtual. It's collaborative. It's invented.\" – David Cronenberg.In retrospect, \"Existenz\" is part of a group of films released between 1998 and 2001, all of which examine the fragile lines separating an illusory reality from a supposedly more authentic Real. These films, which include \"The Matrix\", \"Vanilla Sky\", \"Eyes Wide Shut\", \"Dark City\", \"Existenz\", \"Mulholland Drive\", \"The Truman Show\", \"Fight Club\" and \"A History of Violence\", all portray reality as a hyper-real simulation in possession of a dark and violent underside.But what separates \"Existenz\" from its big budget counterparts are it's biomechanical themes. Marshall McLuhan famously asserted that all technological advancements are merely extensions of the human body; clothing an extension of our skin, binoculars of our eyes, cars of our legs, media of our minds and desires. McLuhan believed that as media builds upon itself, it grows further and further away from our human skin until the limits of our bodies becomes less and less definable.This bodily alienation is highlighted in \"Existenz\". The film establishes a series of layered hyper-realities for the players of a virtual reality game to connect to. In order to enter each new layer of the game, the players must literally \"plug in\" using organic looking spinal grafts. These grafts let the players enter the computer generated landscape of the game whilst leaving their physical bodies behind. They are, essentially, wilfully disembodied from their physical reality.The irony of the film is apparent at the end, when we discover that the film's \"reality\" only exists when the characters decide to enter another reality (at the moment of plugging in). Since the movie begins at the second plugging in, without referencing the first, Cronenberg suspends all reality to imply that no reality is grounded. In other words, the audience's act of playing the film was the first \"plug in\" to an alternate reality. In this way, Cronenberg engages the disembodiment that technology offers and threatens us with. The audience embodies media because media becomes an escape from the body through its prosthetic extensions. These plug in extensions are themselves sexualised, implying that man's virtual escapes are themselves pleasure centric activities, man hiding in fantasy by mind humping his machines. (Importantly, the film's \"machines\" become less organic and more mechanical and rigid as we get closer to reality.)But though McLuhan suggests a \"re-fragmentation\" of the Self through extensions into media realities, other thinkers suggest less pessimistic models. For example, though our instruments have become detachable organs, they need not displace us entirely. Isn't it possible that our senses, no longer limited to our physical bodies, now become receptors to a wider variety of stimuli and perceptions? Cronenberg acknowledges this, but highlights the complications in returning to our real bodies. Recalibration to a pure reality is becoming increasingly impossible. One can imagine future generations thinking of their own brains as \"organic computers\" and not computers as \"imitations of the brain\". In other words, the machine becomes something that our body aspires to or increasingly enjoys being with.On yet another level, \"Existenz\" portrays a war between a group of \"game players\" and rebels known as \"The Realists\". The Realists want all game designers and games destroyed. They want the simulation to end, and all of humanity to re-enter reality. The great joke (which only Cronenberg and Kubrick seem to acknowledge) is that these Realists who delight in such demystification are operating under the most lamentable and unsupportable of assumptions: the idea that you can strip away all fantasy. The \"reality\" they defend is, in fact, the ontology of a depressive, shabbily empirical, nothing ever adding up to more than the sum of its parts, nothing worth getting worked up about, nothing connecting with nothing, existence. IE- post modern hyper-real hell. They're defending simply another fantasy level in a game, unable to face the fact that The Real is itself a cosmic ateleological event, completely without design. The Real is purposiveness without purpose. Think the giant conversation at the end of \"Eyes Wide Shut\", Tom Cruise standing over a pool board as \"everything is explained\" but \"nothing actually adds up\".Cronenberg is thus a kind of ontological existentialist, believing that the very nature of reality itself, the individual choices of subjects, is radically open. Watch how he has his lead character (played by Jude Law), confront the existential horror of abandonment and despair when he complains to the game designer (who is herself a mere player and not the actual game designer) that the game is without final purpose and that they are forever being assaulted by malevolent forces intent upon destroying them. It's a game that would be hard to market, he moans. And yet, as she smartly replies, it's a game that everyone is already playing.The Realists, however, want to defend their comfortable self-delusions. They want to believe that the particular world in which they find themselves, a mere consensual hallucination, is fixed and determined. What guarantees such pre-determination is of course the functioning of a transcended game designer whose role is basically a metaphor for God.Finally, \"Existenz\" makes a distinction between players who are capable of making choices and preprogrammed drones who are nevertheless also players. Unable to act unless triggered by specific lines of dialogue, these drones are reminiscent of so many interactions with \"real\" human beings in late Capitalism: robot announcers, telemarketers, call centre employees etc. These days, professionalization means becoming as much like a bureaucratically controlled drone as is humanly possible, man losing all signs of autonomy, unable to sensitively engage with situations or people around him.8.9/10 – This film has aged well. Briskly told, \"Existenz\" has an elegance and sexiness which lifts it above its big budget, more action oriented, brothers.","This is a movie which perfectly captures your state of mind as you slowly awake from a dream. What you thought were true realities while you were asleep become increasingly fraudulent the more you process them logically and consciousness rears its head, paradoxically there still remains a sense of legitimacy to the situations and ideas that had manifested themselves in your mind so abrasively as you slept. On one plain plane the players, like chronic somnambulists, know they are in a game yet their bodies and minds continue to act and think in ways that they cannot predict or control. They give in to the confusion because it offers a break from conscious thinking and inhibitions and opens up previously unknown avenues of imagination. What at first seems incoherent in this movie becomes more and more believable as images, characters, phrases, etc repeat themselves in fragments that you slowly begin to recognize subconsciously. Everything starts to make vague sense yet you won't be able to put your umbilical cord on exactly what it is the dream (or your own unconscious mind) is trying to tell you. The story operates in the same way that the plot of a dream does,gliding from one situation to another seemingly at random, you cannot remember exactly where you came from, how long you'd been there, or why you'd been there but you gain a sense of reverence for the places you've been and the people you've met because they all make strange cosmic sense to you, they embody all of your deepest fears and desires so honestly that you cannot help but be grateful to them. Forget any coherent message or intelligent thought when you experience this movie because they are unnecessary to dream with.For maximum harmonic understanding, ingest a handful of dubiously obtained Armenian sleeping pills, hang upside down from the ceiling of your lair whilst double fisting two bloated goat stomachs full of your great grandmother's long-frozen/now-thawed bReaSt miLk. Play the movie backwards with the sound going forwards on a loop for as long as it takes to you know what with you know who in you know where you tyrant demon basterd.","From the brilliantly twisted mind of director David Cronenberg comes \"eXistenZ.\" What is \"eXistenZ,\" exactly? A new male enhancement product? No, rather, it's a reality enhancement product; a new type of video-game/virtual reality experience, to be even more specific. Jennifer Jason Leigh plays the programmer of said video game, while Jude Law plays her hapless protector and our surrogate as the audience. The further down the rabbit-hole Law's character goes, so too do we, until we are left dizzy and without words to describe what we just saw.Early in the film, our characters are on the run from somebody who wants to do away with this ground-breaking technology. They'll have to deal with a creepy Willem DeFoe character and deadly spores along the way, while still finding time to explore their new reality and test their limitations. Cronenberg's film pretty much hits the ground running and doesn't allow us the chance to catch our breath as it levels up. Because this is vintage Cronenberg, of course there is plenty of gooey grossness to go around, the least of which are the \"portholes\" that allow would-be gamers to plug in. Those crushing on the lovely Leigh may find themselves feeling somewhat conflicted about whether the \"porthole\" exploring is sensual or nausea inducing. Plot-wise, the film draws comparisons to other late '90s tech- thrillers like \"Dark City\" and \"The Matrix.\" Heck, even the DVD box- art states that \"eXistenZ\" \"makes 'The Matrix' look like 'Child's Play.'\" Well, I don't know about all that, seeing as how I personally don't ever recall seeing a killer doll dodging bullets in that movie, but no matter. What sets \"eXistenZ\" apart is that it is less focused on its dystopian future and more focused on our present quandary in balancing technological advances with good old down-to- earth human experience. Like the best Cronenberg films, \"eXistenZ\" has a lot to say about that subject, but doesn't bludgeon or bore his audience with it. Trade the giant placenta-like sacks of skin in this film for the latest iPhone, and it's safe to say that \"eXistenZ\" was ahead of its time, to say the least.","Who should watch this film? Anyone who has ever taken acid, read Philip K. Dick, thought the premise of the Matrix was better then the special effects, has an interest in Philosophy, or likes having their sense of reality messed with. I laughed out loud at this film, just because it was so outrageous and so spot-on. This film is great. This film is cool. It is better than the Matrix, by a long shot (I didn't fall asleep in Existenz, for a kick off: action/special effects films bore me stupid, and despite a plausible philosophical gloss, that is exactly what the Matrix is). Existenz is gross, it is disturbing, and it is funny. David Cronenberg has done some shonky stuff (Rabid) and some works of genius too (Videodrome is another one worth checking out, as is Stephen King adaptation The Dead Zone). But this is one of my all-time favourites. I can't remember the ending- which is a good thing, cos it means I can watch it again. Or perhaps I never watched this film at all. Maybe it's an implanted memory. Or maybe it 'really' happened to me. I don't know. At any rate, it is now seamlessly stitched into my overall illusion of reality, and I'm glad.","David Cronenberg's `eXistenZ' is a well designed reflection of the philosophy of existentialism. It addresses the problems of a culture that is plugged into technology that it can no longer distinguish between fantasy and reality or between the organic and the mechanical. The movie shocks the audience with its replacement of mechanical technology with organic, metabolismic one. In this context the technology is able to be part of human body. After playing the virtual reality game of `eXistenZ', the real world feels like a game and as a result, human behavior change in order to apply violent game-urges even when the game is over. In eXistenZ, technology has evolved from machinery to biological organisms that plug directly into the human nervous system; an idea that reflects Marshall McLuhan's belief who is a well known media theorist, that computers are extensions of human consciousness. Like telephone is an extention of the ear, television is an extention of the eye, telegram is an extention of the central nervous system high-tech virtual reality is an extention of human consciousness. In eXistenZ, technology is biological and thus more human than it is in our world. But as technology becomes organic, humans become more mechanical and therefore less free, unable to resist their game-urges. eXistenZ is a virtual realty simulation of man's existence. Jean Baudrillard describes a mediated society in his book of Simulacra and Simulation, which all power to act has been transformed to appear. The world has passed into a pure simulation of itself. In eXistenZ it is obvious to see Baudrillard's mediated society with the themes of the invasion of the body, the loss of control and the transformation of the self into other.While you are in the eXistenZ, consciousness slowly replaces with another identity, your role in the game, which is a reflection each individual's real life subconscious. While you gain the control of your hyperreal life step by step, the aura of your real life disappers. For Baudrillard, `.simulations or simulacra, have become hyperreal, more than real.' Our hyperreality, like Cronenberg's world of computer simulation, `.now feels, and, for all intents and purposes is, more real than what we call the real world.' (Baudrillard) The purpose of the game which can basically be called 'experience' is quite metaphorical. Because you can not even know what is experience unless you experience it. As existentialists say that, life without an exact explanation is absurd, the game of eXistenZ is absurd too. Cronenberg, ironically reflects the absurdity of our lives. For instance, in the game, the other roles just stand still unless you ask them a pre-programmed question. And when you put their aimless funny looking state of being into the representation of our lifes, the exposed absurdity really shocks.The theme of the game is to understand what it is for? This hidden metaphorical question creates anguish over the people who play eXistenZ. They have no doubt about their existence, however they do not know the underlying reason of their existence. The essence.Existentialists have held that human beings do not have a fixed nature, or essence, as other animals and plants do; each human being makes choices that create his or her own nature. In the formulation of the 20th-century French philosopher Jean Paul Sartre, existence precedes essence. `Choice is therefore central to human existence, and it is inescapable; even the refusal to choose is a choice. Freedom of choice entails commitment and responsibility. Because individuals are free to choose their own path, existentialists have argued, they must accept the risk and responsibility of following their commitment wherever it leads.' Perhaps I should mention, `eXistenZ' deals with the concept of freedom of choice too. You achieve your final role in the game by taking right decisions. If you don't than the game becomes irrevelant and boring. So, you begin to interrogate the game, your existence rather than your essence. You suddenly become schzopfrenically alianated from the game and realize your position outside the game. Well as a last word, eXistenZ is a well designed reverse simulation of life thus existentialism.","Allegra (JJ Leigh) is the world's most totes-amazeballs games designer. Her complex, better-than-life VR games have the masses hooked - so much so that someone out there wants her dead, and is prepared to pay handsomely for the privilege. After a close-call assassination attempt, Allegra and PR Nerd Ted Pikul (Jude Law) go on the run - all the while attempting to 'port' back into Allegra's bio-creepy games console to test run her latest game - eXistenZ.I saw 'eXisteZ' at the cinema when it was released at the end of the 90s. Apart from a plot-based running gag with a friend ever since, I don't think I've spent much timing thinking about it since. After catching it on TV recently, though, I'm inclined to think this is one of those movies you really ought to evaluate over multiple viewings.The plot is brilliantly twisted. As Allegra and Ted port in and out of the game she's invented, it's hard for them - or us - to know what's real and what isn't. Playing the game along with them, and interacting with the characters, works exceptionally well considering some of these concepts are pretty far ahead of the movie's time. No spoiler here, but some of the plot concepts must have influenced some very big sci movies released since!There's a lot of freaky bio-horror-erotica on screen. It's not an overly violent film (and I wouldn't call it a horror movie at all), but some of the scenes are very 'fleshy'. It's more like overt eroticism runs throughout - even Allegra's bio 'pod' (the games machine) looks and reacts like some feisty, fleshy erogenous zone.The special effects aren't bad. Yes, some involving creatures are a bit Harryhausen, but others hold their own really well more than a decade later.There's a message - and, again, it's ahead of its time and doesn't shy away from asking the big questions. But then, the movie's called 'existence', after all.I've probably given this an extra star because I can't quite believe the lack of love here on IMDb. This is a good film that aims to do, say and stretch you more than most. That's gotta be worth a look.","I was attracted to this movie by the line \"Makes the Matrix look like child's play\" on the promotional flyer. What a misrepresentation. Matrix is a vastly superior movie to ExistenZ. In fact ExistenZ is simply a very ordinary movie, which looks like it was made on a shoestring budget.I have really enjoyed a few Cronenberg movies such as Scanners and Videodrome, but this was not even close to being as good as those movies. In fact there was clearly a great deal of influence from another awful Cronenberg movie, The Naked Lunch, in this movie.Jude Law and Jennifer Jason Leigh are both excellent actors, but they seemed lost in this movie, wandering around trying to work out what to do next. There are other heavyweights such as Ian Holm and William Dafoe whose roles are must have been intended to be caricatures. The scenes which depict the civil war are some of the least convincing and low budget efforts I have ever seen in a movie boasting such a good cast.Watch this one with your expectations set very low and, who knows, you may be pleasantly surprised!","Known for his great capacity to develop crazy cinema works, David Cronenberg is responsible for titles such as \"The Fly\", \"Videodrome\" and others. This time, from his weird and darkly prolific mind, comes a completely twisted version of a computed reality. Allegra Galler is a professional computer game designer, working for a huge company - Antenna Research. Her latest advanced software was named Existenz, probably because it allows the player to have total freedom INSIDE the game! So it was time to publish it, and nothing better to make it sell than a real demonstration of it in front of the public, and so it is done! However, to play Existenz, a Bioport is required. And you ask me  \"What the hell is a Bioport anyway?\". Well, have you ever heard of a hole in the base of your spine? No? Me neither, until I knew this wicked game! Only Antenna is legally authorized to implant a Bioport in every player who wants to be \"upgraded\" with the new invented interface, linking a person's body to the game and giving anyone a better and more realistic playability!In the presentation of Existenz, a few people have been selected to try the game and play it for the first time, along with the critically acclaimed Allegra Galler itself! And that's right here that the movie really starts, diving us into a strange world of a new reality, similar to a dream inside another dream! Confunsing? If you think so, wait until you see the movie! Inside the game the player can do everything in mind  talk to characters, kill them, pick up objects, use them and lots of other things. However, as the game goes far and far, we start doubting reality itself, since lots of apparently nonsense begin to happen. Is all this just a game, or is this a dream about an unreal game? Something is wrong with Existenz. Can it be a game bug or are the players true assassins and crazy characters forever lost inside a stupid software? - This was the idea David Cronenberg wanted to give us. A truly confusing and twisted vision of how dangerous can a computer game be. The film constantly takes us back to \"reality\" every time the game is paused, but by the way... where is the game, the REAL life and time? Creepy, isn't it? Now add some computed character representations and you'll then doubt of everything else!In my opinion, this is another disturbing cinematographic creation, with a fantastic resemblance to the characteristics of a computer game. The movie ends apparently in a normal way, but is it a real Game Over, or just the start of a New Game? - If you're interested in a weird ride to a computer game world, then give this film a try. Otherwise, forget it to avoid serious brain damages!","After his almost disastrous \"Crash\", Cronenberg returns to more familiar terrain with \"eXistenZ\". After \"Videodrome\" and \"Naked Lunch\", this is now his third movie featuring different levels of reality which gradually mix with each other until at the end, you don't know any more what reality is. Nowadays, you cannot say any more that this is a novel concept and, in addition, \"eXistenZ\" is much tamer, much more mainstream, and much weaker than \"Naked Lunch\" and, especially, Cronenberg's masterpiece \"Videodrome\". There simply isn't anything new which Cronenberg has to add to the subject.Moreover, the fact that the movie deals with computer gaming is misleading. First, the subject was probably chosen to attract a new audience (which isn't familiar with his previous movies). Second, Cronenberg's visions aren't very much based on what modern computer gaming really is, except, maybe, for adventure games. In Cronenberg's movie, the computer game allows you to enter another reality which, however, looks very much  like the reality you know, except that there seem to be other rules. Modern computer gaming, in turn, has already created a new reality which differs in its very characteristics from the world we know. This world is aggressive, fast paced, and the player as individual is reduced to its capability of reacting as fast as possible (this aspect is indeed captured much more appropriately in the - much weaker movie - \"The Matrix\"). Thus, Cronenberg's movie is more a surrealist dream than a serious discussion of the dangers of computer gaming. Of course, this is prefectly legal. The game console is a means of changing into another reality, just like the drugs were in \"Naked Lunch\" and video tapes were in \"Videodrome\". At other times, the console appears more like a sexual fetish.\"eXistenZ\" has some interesting and remarkable scenes such as the whole part in the \"Trout Farm\" and the Chinese restaurant, but there are also involuntarily ridicolous scenes such as the character being stuck in a game loop. Overall, the images which Cronenberg chooses do not have the strength and impact of his older movies: The central element, the organic console, just looks like what it is: a piece of rubber. It is directly hooked up to the spinal chord, an unpleasant idea, but how much more impressive was the scene when James Woods inserted the video tape into his own stomach in \"Videodrome\". All in all, \"eXistenZ\" is another trip into the weird world of David Cronenberg but into the more civilized regions which doesn't give you many surprises.","David Cronenberg's typically weird film is a multi-layered story of reality versus a virtual world, mixing the two so thoroughly that you'll no doubt end up being confused before the explanatory ending. Released at around the same time as THE MATRIX and exploring many of the same thoughts and ideas, EXISTENZ is less a crowd-pleaser and more of a low-key thoughtful affair which still manages to be packed with bizarre imagery and grotesque creations from Cronenberg's decidedly warped mind, except this time in a film more appealing to a larger audience than his older grue-fests like THE BROOD.In the end, EXISTENZ fails to become a great movie by being too annoyingly clever for its own good, and is flawed by being too cold in its depiction of characters and situations, a problem Cronenberg has felt throughout his career - he's just too detached (with the exception of DEAD RINGERS, I believe). As realities switch and characters change allegiances, the film does isolate itself from the audience, although the wealth of ideas and imagination keeps it totally interesting throughout. Here, Cronenberg's obsession with \"body horror\" crops up in weird games consoles which are plugged into sockets at the base of the human spine (once again Cronenberg dwells on the sexual subtleties of the act) and pulsate and cry as organic lifelike creations.There are a couple of very well-realised situations, particularly the restaurant scene where Jude Law's character assembles an organic gun (which shoots human teeth!) from the remains of his meal and uses it to shoot the waiter, or another scene near the end when a diseased console is burnt, releasing thousands of spores into the air. The diseases in the film hark back to earlier Cronenberg creations like RABID; although his films all look and feel a lot different, the same underlying obsessions and principles can be felt in each. The special effects are excellent and frequently disgusting, and there are brief flashes of the graphic gore and carnage which Cronenberg used to use so much.EXISTENZ also benefits from a strong cast of accomplished actors, although some only appear in cameo roles. Jennifer Jason Leigh is the strong-willed and powerful female lead, and her pairing with Jude Law (as the film's \"audience\" type character, a complete novice who is sucked into the virtual world) is an inspired one, with the two setting it off really well together. Ian Holm appears as a mad inventor, and Willem Dafoe shines in another of his demented turns as a gas station assistant who has ulterior motives. Christopher Eccleson also cameos as a teacher, sporting an American accent along with Law which was a bit disconcerting for me! Although not one of his best movies, EXISTENZ is a good introduction to Cronenberg's work as it covers most of the themes and ideas closest to his heart while providing enough thrills and spills (as well as an almost obligatory twist ending) for the modern audience.","Existenz is a bizarre film. Though thats probably the purpose the film maker was making it for. It leaves you thinking what you just spend time on. Wondering if you wasted on yet another movie you just watched because you were bored, or a movie that has deep undertones yet you could not figure them out. Itleaves you with a disturbing aftertaste, henceforth you think about, and tell other people about it, who then are intrigued and want to watch it, resulting it not necessarily being popular but often watched. The cast, the producer, directors and composer all give you the impression that this will be a bombastic film, that should be great. Well, its very graphic in its interpretations, and therefore it makes you disturbed, but the idea itself, of people loosing themselves in a game, and loosing the importance in things, is very interesting and one could say, is a delving into the human psychie, but nonetheless, once you have seen it, you wont be sure whether you just wasted time there or if you just saw a good movie, well, I'm doing the makers a favour here by saying, you'll just have to watch it for yourself.","David Cronenberg is doubtlessly one of the greatest directors alive and in activity (along with Lynch, Kiarostami, Kitano, Moretti, Oliveira, Rohmer, etc). Having seen almost all of his films (excluding \"Dead Zone\", \"The Fly\" and \"M.Butterfly\"), I have this somewhat rare opinion that \"eXistenZ\" is one of his masterpieces. It seems to me that this film was hugely misunderstood, culminating with the stupid idea of comparing this film to \"Matrix\", a rather worthless and meaningless piece of nonsense. Here in \"eXistenZ\", we have instead a very dense and deep meditation on the mystery of reality, of our inability to apprehend where do things come from. The characters appear and disappear as if moved by some mysterious agent, which remains inhapreenshible. Being Cronenberg a professed atheist, we can only arrive at the conclusion that each world which is presented to us and to the main characters comes from their own mind, which, nevertheless, only constitutes a part of the human body (it is now hazard that the characters have access to the game by means of something - a game pod - which is implanted into their bodies). Cronenberg stated many years ago that all reality is virtual; so, in this film, the use of the plot-device of virtual reality is a huge metaphor to the virtually of reality, as our director sees it.","I can't believe that so many people not only liked this but loved it.  OK the detail of plot is very original but so many other aspects disappoint.Firstly, and most noticeably, the acting is absolutely horrendous, being grossly stilted and wooden.  You could run a bus through some of the cues and I've seen far better on an amateur stage.  Secondly, the screenplay is appalling - the dialogue just doesn't flow.  Thirdly, the direction is woeful - the pace just never picks up and the whole thing just becomes one big frustrating, boring drag.  Even though the effects are decent the acting, script and direction give it a real B movie feel.I consider myself to be somewhat of a film lover - I like virtually all genres.  However, and I may be in the minority on this, but I can safely say that this is the worst film I have seen in a long, long time.","In a near future, the Antenna Research and the Cortical Systematics Corporations dispute the market of games. When the designer of the game eXistenZ Allegra Geller (Jennifer Jason Leigh) comes to a lecture to demonstrate and test her game, she is attacked by a fanatic terrorist. However,the marketing trainee of Antenna Research Ted Pikul (Jude Law) saves Allegra and flees with her in his car. When Allegra awakes, she requests Ted to let her connect in his bio-port to check the damage in her pod with the original version of eXistenZ. Ted does not have bio-port since he is afraid of any possible infection, but Allegra convinces him to go to the gas station, where she asks the attendant Gas (Willen Dafoe) to make a hole in Ted's spine and install a bio-port. Sooner she learns that Gas works for the enemy, but Ted and she play eXistenZ, in a bizarre virtual world. When the game merges in the real life, Ted and Allegra question whether they are still playing the game or whether the game has been transported to the real world. \"eXistenz\" is another bizarre and original film by David Cronenberg, with a weird and gruesome concept of virtual reality. The twisted story has similarities with \"Matrix\", entwining virtual world with reality, but both were made in the same year (1999); therefore it seems that there is no plagiarization of the idea. Jennifer Jason Leigh and Jude Law show a great chemistry and the plot has many twists. Surprisingly, \"eXistenz\" has not been released in Brasil neither on DVD nor in blu-ray. My vote is eight.Title (Brazil): Not Available","Cronenberg's films work best when they root themselves firmly in our world, and then misbehave -- think of the garlanded and psychotic twins in _Dead Ringers_, Jeff Goldblum's geeky scientist in _The Fly_, or even the glacial professionals of _Crash_. _eXistenZ_ reminded me of _The Brood_, Cronenberg's early exercise in gore and would-be psychological terror. If you were scared rather than amused by Oliver Reed and those kids in red parkas, you may like eXistenZ -- but the rest of us will squirm in embarrassment at the setting (a world in which everyone plays computer games which plug directly into their spinal cord) and the self-importance of much of the dialogue. Where the movie should work as horror, it often comes off as farce; and where Cronenberg may be attempting social commentary, he slides into solipsism and pretension.The film's design will persuade some Cronenberg fans of its merit. The game console designed by Jennifer Jason Leigh is an alarming mix of Playstation and kidney, complete with nipple start-button and throbbing (or should that be force-feedback?) game action. The sets are bizarre, especially the 'trout farm' (nope, they sure ain't trout) in which many of the movie's scenes are set. However, none of this weirdness can really compel in the face of some terrible casting (poor Jude Law is really out of his depth; ditto Ian Holm, who's given the year's least plausible eastern European accent) and a wonky script.The movie's biggest problem is that we're never drawn into this other world because it seems so heavy-handedly projected from the opening scenes. Leigh's new game gets its first public try-out in a church (materialism and false idols, geddit?), and that level of inventiveness pretty much characterises the movie from then onward. The tension of the later stages is dependent on our own uncertainty about whether what we're watching is real or part of the game Law and Leigh are playing -- but even this trick fails to grab.The final scenes (assuming they're not re-arranged for the theatrical release) fall apart as Cronenberg tries to have it both ways, to suggest that nothing's really happened and that the world's coming to an end. In sum, it's just a muddle -- and a real shame, given that Cronenberg on top form is one of the most interesting directors working today. With eXistenZ, he's managed to persuade a studio to bankroll his efforts -- it's a real shame, then, that this effort to cultivate a bigger audience should showcase more of his weaknesses than his strengths as a moviemaker.","The way you pronounce the name of this film is a little different. The story that is shown is certainly different, and after you have seen it, you will say it is movie that is definitely different in almost every aspect. Of course, I am talking about the 2000 sci-fi thriller, 'eXistenZ', which shows that going into the world of 'virtual reality', can be weird and dangerous. 'eXistenZ' also proves that virtual reality' can be a world that one cannot be sure of being in or out of.During the first closed-door demonstration of an amazing new virtual reality game - called 'eXistenZ' - the system's brilliant designer, Allegra Geller, is violently attacked by a crazed assassin intent on killing her and destroying her creation. Forced to flee into hiding, Allegra enlists the help of young marketing trainee, Ted Pikul, to help her test the damaged system, by convincing him to join her inside a game of eXistenZ. The action then explodes as their world's real-life dangers begin to merge with the fantasy of the game.This film has a most unique and unusual story, but in a good way. I have read on the internet, that eXistenZ 'makes the Matrix look like child's play', and I would have to agree. What I will say about this film's story, is that it gives the impression that its audience will understand where it actually is, and that they will believe who someone is, is truly that person, and that they are on a level par. I guess that is what is most inventive about the film, to make what is seemingly so true, to be actually not true at all. The writer/director of eXistenZ, David Cronenberg (from 'the Fly'), wrote a most inventive screenplay, that I am sure you will not see in along time.This movies lead actors are Allegra Gellar (Jennifer Jason Leigh) and Ted Pikul (Jude Law). The pair share a most unique chemistry onscreen, as we see their game characters doing some very weird and wacky things as they keep going deeper and deeper into the game of 'eXistenZ' they are playing. I love the way that both Leigh and Law turn this movie into a very erotic kind of an experience to watch. Allegra says this is all part of the game and that the pair should not give into any of these so called 'bits'. I must mention that Jude Law suits this kind of movie genre. Law has also been a part of the Steven Spielberg movie 'AI', which was another unique movie that I did not mind.The supporting cast of this film was also good. I like how we get to meet the guy at the gas station who affectionately known as Gas (Willem Defoe). The role that he took on in this film suits him down to the ground. However, I thought that his role of the 'Green Goblin' in the 2002 blockbuster 'Spiderman' was ordinary to say the least. Other supporting cast members include Kiri Vinokur (Ian Holm), the strange man at the trout factory Yevgeny Nourish (Don McKellar) and the Chinese waiter (Oscar Hsu).I also like the way this movie looks. The 'virtual reality' world created for  'eXistenZ' looks so weird and wonderful, that part of me feels that I might be tempted to play the game. Then the creation of the funny creatures in the movie, the funny pods that are used to play the game and the surprise in the 'special' Chinese meal are interesting to see as we go further and further into the film. Then take the great parts of the film. I like how this movie starts, as it is one thing that needs to be looked at carefully, or you could misread what is happening for the entire movie. When the lead pair then start to play eXistenZ the movie becomes all the more interesting, as this is the part where you can start to realise that not everything is what it seems.But here is a clue for you out there that are a little confused by the whole reality vs. virtual-reality parts of the film. The film does point out very subtle clues as to what mode both Allegra and Ted are actually in. However, if you are one person who is clever enough to work out the movie's entire plot, then you are one lucky person, as even I am still thinking up questions that I want to know the answers to (such as: was the entire movie just a game? What does the end of the film actually mean? Did those mean streaks that happened in the supposed 'game', turn out just to be glitches in the real life 'virtual reality' game? What should you make of the two lead characters after the end of the film?) I am sure I will think of more questions, but whether I find out there answers is another thing.The whole world of 'virtual reality', is becoming realer and closer in the world that we live in. We can enter into many different aspects of virtual reality at the drop of the hat, thanks to technologies such as computers (the internet) computer games and the movies that we watch. However whether the whole idea of 'virtual reality' is good, that I am unsure of. My opinion is if we enter into a world that is outside of our reality, than we could be giving something of ourselves that we don't actually know we are giving, and could turn us into people that we might not normally be. That being said, this movie makes me so curious about the world that I have just criticised. If you want to experience a film that goes one step further than what the Matrix did in certain aspects, then I can only recommend that you dare yourself to enter into the game which is called 'eXistenZ'.CMRS gives 'eXistenZ': 4.5 (Very Good - Brilliant Film)","Spoilers herein.I'm baffled by viewers who compare this to `Matrix.' The story is quite different. The Matrix has real people living in a synthetic world; simple enough. `13th Floor' is much more sophisticated: real and artificial people living in many parallel synthetic worlds -- there is not just ambiguity about environment, but over beingness.eXistenZ is more sophisticated yet in this dimension: synthetic worlds are not parallel but nested. Some real world exists which creates a synthetic world which in turn creates another synthetic world and so on. More: in this film, conspiracies blend levels, reversing and folding roles. This is the stuff of Phil Dick, not the Matrix, or The One, or any of that other juvenile stuff.But there is a more fundamental difference: Films like the matrix start with a story concept, then work to tell the story by whatever visual vocabulary is current. Cronenberg starts with a specific strong vision and hangs a story on it. Clearly, his vision here is for artificially living sexual paraphernalia. These have highly erotic exteriors but disgusting, reptilian interiors. The whole film is built around this notion: prurient fiction, repellent pudenda.And the whole thing self-referentially encompasses the audience with the final level because the film clearly shows itself to be a creation in the same mold as Allegra's. I love this stuff, if only as an intellectual construction.But what puzzles me is Cronenberg's meekness. He knows he's a cult filmmaker, so why pander to a bunch of kids who will go to `The One' instead? Jennifer has the guts to do whatever is required. Her presence here shows edge by reference, because we know that she would risk all if asked. But she's not asked. I predict that in a decade or so, as a reaction to special effects fatigue, someone with more courage will remake this with an X rating and more of an obvious Marienbad feel. Maybe you, dear reader.","What has happened to David Cronenburg?  I came out of this film feeling really dispirited and depressed, primarily because none of my expectations for a Cronenburg film were fulfilled.As soon as I saw the organic game pods, I laughed and was pleased, but the kind of development I was expecting of that idea did not materialise.  The gore and the organic props were simply displayed to us, as if that was enough to create a visceral response.  I'm afraid I found the scene in the Chinese Restaurant no more disturbing than actually eating chicken's feet for real.Too many of the action and plot points were set up in advance (such as the bony gun), leading to a lack of suspense.I think the worst aspect of the film is that there was no emotional involvement at any level.  Nothing was done to make us feel empathy with the characters.  The fact that we are in a game, and that game dialogue is trite and inane, is no excuse to use trite and inane dialogue throughout the film. The performances suffered as a result, and I was most disappointed in Jennifer Jason Leigh, who appeared to be sleepwalking through the whole movie.  The \"love scene\" seemed to be put in gratuitously just to show us some kissing.  Also Jude Law was completely miscast - his role should have gone to Christopher Ecclestone who, for our American friends who may not have seen him, is one of the most intense and powerful screen actors around. Law failed to convince that he was really scared or worried by developments.  One minute he is \"phobic\" about having his body penetrated, the next he is consenting to a spinal operation with scarcely a shrug.  Of course, if he's playing a game, he wouldn't be worried, no more than I am by playing Doom.  But a film has to use fear and uncertainty as a dramatic device to draw the audience into the story, and this is where eXistenZ failed completely.I think Cronenburg likes to think that the world he creates in his movies is existentialist and unemotional, but the fact remains that his best films, specifically The Dead Zone, The Fly and Dead Ringers (I haven't seen M. Butterfly), all work because of their emotional power.  The musical scores for these films (all by Howard Shore) all serve to underline the emotional undercurrent, but in eXistenZ the score is simply trying to create a response which isn't provided by the film, and gives the same impression of hack-work which the rest of the film provokes.  Furthermore, if we take the example of The Fly, the theme of physical transformation is very clearly expressed and deeply explored.  In eXistenZ, I could see from the plot that Cronenburg's theme involved the nature of reality, but I found no deep exploration of this theme, unlike in, say, Videodrome.The whole film suffers very badly from having a small budget.  The various game worlds we are shown are all very small-scale and cramped - not even up to the standard of modern role-playing games.  Also the props and the special effects looked cheap, with only the bio-port in the characters' backs remotely convincing.  I feel that Cronenburg should have made some other film for the money he had, and to wait until he could raise enough money to make eXistenZ on a much larger canvas.  This also affected the ending of the film, which came too quickly, and seemed quite perfunctory. The fact that the world of \"reality\" was one in which there is a battle between gameplayers and \"realists\", and that the world of the game was a world in which there was a battle between gameplayers and \"realists\", and so on ad infinitum, seemed to indicate a distinct lack of imagination on Cronenburg's part, and undoubtedly gave away the ending, at least for me.When the film was coming to it's (for want of a better word) climax, I couldn't believe it - nothing had happened yet!  Even when the final \"twist\" happened, nothing major was at stake.  I didn't care whether we were still playing a game or whether this was the \"real\" reality.  We never found out enough about reality to know if the conflict between gameplayers and Realists was meaningful.  In the end, the entire film could have been made as one of the less intriguing episodes of the Outer Limits (the Twilight Zone has already been cited), and certainly the so-called \"twist-in-the-tail\" ending was every bit as predictable as one from one of those programmes.I feel that Cronenburg should avoid writing his films from now on.  In the early days of Scanners, The Brood and Videodrome (similarly emotionless in tone), the films were worth watching because nothing like them had been seen before.  As his career developed, the films were worth watching because he combined visceral imagery with strong emotionality.  Now we are back to just strong images with no emotional involvement, and in 1999 the imagery simply isn't strong enough to excite interest any more.  These same problems afflicted Crash, his last film.  For me, Dead Ringers remains his best film.The film is worth seeing, if you have never watched any of Cronenburg's past stuff, and you have had no exposure to science fiction.  Otherwise, there's nothing new or provocative in this film to make it worth watching.","as a fan of cronenberg's films i judged this based on the other work and found it lacking. what it lacks is the emotional power of his best movies. i notice this isn't really mentioned in other reviews.intellectual games and speculation and bizarre special effects are interesting but what really makes cronenberg an artist in my mind is the underlying human tragedy he is able to express using the horror/sci-fi/fantasy genre, see The Fly for instance (not to be confused with  john carpenter's The thing) or even less known work like The Brood.existenz has no power.it does have a little philip k dick style charm, but without the heavy spiritual/philosophical impact of dick at his best.compared to your average movie, it's more intellectual but less fun. it has some humor but not much. there are too many references to past cronenberg movies which makes you wonder if he hasn't seen too many of his own retrospectives. also, i am not a gamer and so the game aspect seemed very adolescent, probably moreso than most actual games. then again, this movie is like a real cronenberg movie turned into a video game, lots of tricks and twists and effects, but all the emotion and feeling drained out of it. respect it cuz it's cronenberg, but go watch something else."],"review-user":["dbignell","bjrubble","peter_vangoethem","Delerium","hengir","Infofreak","tieman64","DemetriusAlrugoIII","Minus_The_Beer","richardgraham-4","big-red","5Dog","terceiro-2","gamestage_online","AS-69","Leofwine_draca","mister_peculiar","dfpm","Sean Kerr","claudio_carvalho","Pocock","Old Joe","tedg","Silas-7","watcherr"],"review-date":["14 July 2000","9 April 2002","26 January 2004","25 April 1999","19 November 2006","14 July 2001","8 May 2009","1 January 2017","14 May 2017","16 September 2005","14 July 2003","18 June 2016","20 February 2013","27 April 2007","17 December 2001","9 July 2016","29 June 2006","25 August 2004","24 October 1999","1 May 2011","18 March 1999","10 April 2003","21 November 2001","6 May 1999","6 July 2001"],"review-rating":["10","10","7","9","8","10","10","7","5","6","6","6","5","1","8","1"],"review-title":[" A well-crafted film deflated by the Matrix-sodden expectations of an effects-obsessed audience.\n"," Truly unique\n"," an existential psychotropic trip\n"," Get ready for one wild ride!\n"," A Shaggy Dog Story...but a good one\n"," \"Death to the demon The Matrix!\"\n"," Welcome To The Desert of the Real: Part 2\n"," I put a spell on you because you're mine\n"," Cronenberg Levels Up\n"," a wicked head trip\n"," hyper-reality shocks!\n"," Smart sci fi and the full Cronenberg eXperienZ\n"," Over-hyped\n"," A question of eXistenZ\n"," Tame and repetitive Cronenberg\n"," Not Cronenberg's best, but a good example of his work\n"," eXiStEnZ\n"," Where do we come from? From virtual reality, sure.\n"," Absolute Drivel!\n"," Another Bizarre and Original Film by David Cronenberg\n"," _The Brood_ redux\n"," Play it. Live it. Kill for it.\n"," Visual, Erotic, Layered Fiction\n"," Where did Cronenburg's talent go?\n"," the only cronenberg film i didn't like\n"]}