{"review-url":["http://www.imdb.com/title/tt0159365/reviews"],"review-text":["Anthony Minghela's (writer/director) Cold Mountain is a carefully constructed, sensitive, and intelligent drama set in the social context of the confederacy during the civil war. It deals with the politics of the war in a very subtle and realistic manner. While it accurately depicts the brutality and inhumanity of that war, it also does something that many films related to this period do not handle effectively - Cold Mountain studies the southern context from the inside out, and portrays changes among the non-slave owning common people wrought by the war. Almost uniquely, Cold Mountain does not over-generalize southerners, northerners or anybody else.The film surfs through genres as needed - never presenting a dull moment. It is a romance, a war story, an action-adventure and historical fiction, all nicely woven into one.The story centers on Inman (Jude Law) and Ada Monroe (Nicole Kidman), who are smitten with each other for very simple reasons. As this young romance begins to bud, Inman enlists in the confederate army, taking with him a book Ada has given him and a photograph of her. Ada's character is one of the most brilliant aspects of the film, which is important because the audience experiences this film from a third person perspective, but the story is clearly hers from the beginning to the end. Ada is an intelligent southern belle and daughter of a liberal minister. She begins the film as a daddy's girl skilled in many of the arts that southern women who have been surrounded by servants most of their lives were expected to learn. In other words, as she admits to Ruby Thewes (Renee Zellweger), she is a master of everything useless.Ada's father passes on, and she is left to manage his modest estate by herself. With no experience of this sort, she struggles, and survives by holding the memory of Inman close to her heart. Ruby enters the picture as a tough young woman who has been raised by a drunk and negligent father. Ruby has all the skills and abilities Ada lacks, and as they become inseparable business partners, they grow to love one another as best friends. Inman's experience is radically different, but something of a mirror image. During his participation in the war, he sees many friends killed for causes they don't really believe in, and decides to desert. Nobody he meets comes to his rescue as he begins the thousand mile walk back to Cold Mountain and Ada, and most of those he meets die.The bulk of the film takes place during Inman's long walk, following both of the protagonists as they live, learn, grow and change. An on-going act of will borne of desperation preserves their intense passionate love. For Inman, it is his only source of hope in a world of pure desperation. For Ada, it is very much the same thing, but also a symbol and remnant of the old south - a world which is rapidly passing.The cinematography is powerful and breathtaking. There are beautiful shots of Appalachian landscapes which give the film a strong sense of history. The script and editing are also extremely strong - emphasizing the broad class and educational differences reflected in the ante bellum southern dialects of the middle and lower classes. With the cast of this film, nothing short of perfection should be expected. And the cast, mostly, rises to the occasion. My one criticism, however, relates to the accents adopted by Kidman and Law's characters. An Australian and a Brit probably should not be expected to accurately reproduce southern American speech, but there are a few occasions where these two exceptionally gifted actors produce distracting vocal slips. I admit my oversensitivity to this, and can say with some confidence that it won't bother most people. Zellweger's performance is outstanding and she creates a character I will remember into my senescence.Very highly recommended.","'War movie' is a Hollywood genre that has been done and redone so many times that clichéd dialogue, rehashed plot and over-the-top action sequences seem unavoidable for any conflict dealing with large-scale combat. Once in a while, however, a war movie comes along that goes against the grain and brings a truly original and compelling story to life on the silver screen. The Civil War-era \"Cold Mountain,\" starring Jude Law, Nicole Kidman and Renée Zellweger is such a film.Then again, calling Cold Mountain\" a war movie is not entirely accurate. True enough, the film opens with a (quite literally) quick-and-dirty battle sequence that puts \"Glory\" director Edward Zwick shame. However, \"Cold Mountain\" is not so much about the Civil War itself as it is about the period and the people of the times. The story centers around disgruntled Confederate soldier Inman, played by Jude Law, who becomes disgusted with the gruesome war and homesick for the beautiful hamlet of Cold Mountain, North Carolina and the equally beautiful southern belle he left behind, Ada Monroe, played by Nicole Kidman. At first glance, this setup appears formulaic as the romantic interest back home gives the audience enough sympathy to root for the reluctant soldier's tribulations on the battlefield. Indeed, the earlier segments of the film are relatively unimpressive and even somewhat contrived.\"Cold Mountain\" soon takes a drastic turn, though, as the intrepid hero Inman turns out to be a deserter (incidentally saving the audience from the potentially confusing scenario of wanting to root for the Confederates) and begins a long odyssey homeward. Meanwhile, back at the farm, Ada's cultured ways prove of little use in the fields; soon she is transformed into something of a wilderbeast. Coming to Ada's rescue is the course, tough-as-nails Ruby Thewes, played by Renée Zellweger, who helps Ada put the farm back together and, perhaps more importantly, cope with the loneliness and isolation the war seems to have brought upon Ada.Within these two settings, a vivid, compelling and, at times, very disturbing portrait of the war-torn South unfolds. The characters with whom Inman and Ada interact are surprisingly complex, enhanced by wonderful performances of Brendan Gleeson as Ruby's deadbeat father, Ray Winstone as an unrepentant southern \"lawman,\" and Natalie Portman as a deeply troubled and isolated young mother. All have been greatly affected and changed by \"the war of Northern aggression,\" mostly for the worse. The dark, pervading anti-war message, accented by an effective, haunting score and chillingly beautiful shots of Virginia and North Carolina, is communicated to the audience not so much by gruesome battle scenes as by the scarred land and traumatized people for which the war was fought. Though the weapons and tactics of war itself have changed much in the past century, it's hellish effect on the land is timelessly relevant.Director Anthony Minghella manages to maintain this gloomy mood for most of the film, but the atmosphere is unfortunately denigrated by a rather tepid climax that does little justice to the wonderfully formed characters. The love story between Inman and Ada is awkwardly tacked onto the beginning and end of the film, though the inherently distant, abstracted and even absurd nature of their relationship in a way fits the dismal nature of the rest of the plot.Make no mistake, \"Cold Mountain\" has neither the traits of a feel-good romance nor an inspiring war drama. It is a unique vision of an era that is sure not only to entertain but also to truly absorb the audience into the lives of a people torn apart by a war and entirely desperate to be rid of its terrible repercussions altogether.","Anthony Mingheller's astounding film cleverly sweeps the audience into the horrors of war at its beginning.  He then introduces his two principle characters who would gradually move the audience into their world wrought by war and hardship. We watch as the characters begin to unravel their internal tortures and their need to subdue their isolation to face their regrets and hope for the future.  This is an absolutely fabulous movie that portrays the stunning performances of its stellar cast of actors and the overwhelming raw landscapes that are kept in sync with their events and moods.  Observe the stages of emotional changes in the characters. So amazingly and magnificently captured at different camera angles, from scene to scene against the cold, mountainous countryside!This film isn't throwing off longwinded dialogue and lengthy physical encounters between Jude Law's Inman and Nicole Kidman's Ada to reveal the meeting of two souls searching for a meaningful existence.  Yep, it's that brief and silent stare of Inman as he confronts the graciously low-keyed, prim and proper Ada that explicitly puts their sensory awareness of each other so powerfully on screen.  As the events flow, I was completely mesmerized by the Inman character watching him transcend to his sense of isolation and his developing disillusion with his world. On the other hand, I couldn't take my eyes off the immaculately well-bred and gorgeous Ada as she succumbs into a scrawny hapless damsel in complete distress.  It's fascinating to watch the couple adapt to situations beyond their control and to study the emotional and behavioral attitudes of two human beings altering at such opposing magnitude as a result of one war.  Observe how the once popular Inman slips into desolation in the battlefield, becoming even more tormented from his world as he meets up with some very strange characters. Will he ever find solace with these characters, or with Ada at the end? Will Ada, while feeling alienated from her new abode, at the beginning of the film and with the death of her father, be able to battle her insecurity to become spiritually enlightened and physically capable with the help of her new acquaintances?  Is she able to embraces what the farmland has to offer her? And will Inman be capable of escaping what the gruesome battlefield has come to mean to him?  This film lays out an enormous ground for the examination of the effects a war on different individuals.The film continues to remind the audience that Ada and Inman are bound together by their haunting memories of one another.  That, indeed, is beautifully captured by the expressions on Law and Kidman's faces. The symbolisms, throughout the film, are plentiful and brilliantly ascribed, allowing the audience to join the dots to the destinies of the couple. Even crows, clearly suggesting doom and destruction, never fail to demonstrate the dark instincts that trouble a man's soul. And those women Inman meets in his journey seem to trigger the expectation of the audience to see him drawing closer to the woman he loves and to home.  Even these characters, encountered by Inman, provide a picture of how different people react to the war. But will war ultimately bring peace and safety to its protagonists? This film is a masterpiece that will provide much food for thought.Renee Zwellweger is phenomenal in her boisterously loud 'Ruby' role. She brings another aspect of the American woman that's so different in breeding from Kidman's Ada.  Both are educated in their different cultural way of life.  What can Ada learn from Ruby, the frontier woman who sees the 'hands and knees' toiling as the only way of survival in her community? Zwellweger provides the comic relief that's much needed for this powerfully intense film.  She's superb in her role as the beacon of strength and hope for injecting a meaningful existence of living. Unlike the soldiers or the hypocritical Home Guard authorities that use guns to destroy their enemies, Ruby uses her hands-on skills to beat the odds of survival. It's uncannily delightful to watch her interacting with Kidman's character. She, Law and Kidman are definitely worthy of being recipients of the Oscar statuettes. They exhibit their superb non-stop performing talents in this film with their onscreen appearances. The Q&A session with Brendon Gleeson (who plays Ruby's father), has prompted me to want to go see this movie again - to watch closely how the strength of the film's womenfolk can make a difference to the human beings' survival instincts.  I want to study again how hellish wars are for destroying and crippling, not only the physical, but the mental aspects of the masculine race.  And Gleeson does drive home an interesting question: When these mountain folks `volunteer' to fight a war, how come they should be penalized as deserters if they were to decide to opt out of it?This film is a MUST-SEE. It's beautifully crafted, assembled, and absolutely mesmerizing in all aspects of filmmaking techniques and style. The music score and soundtracks are so appropriate locked into the events and the moods of the characters. And the film's title? It does project its allegorical appeal.A+","This movie moved me more than I was expecting, and I was fully prepared to cry. The acting mainly carried this film, with superb performances from Jude Law, Nicole Kidman and Renee Zellweger, as well as the supporting cast. These actors portrayed characters so intensely human that they lingered the remainder of the night with me, and I had trouble shaking this war drama. The costumes and cinematography were also magical, but didn't get carried away with themselves. They didn't take focus, but added to the whole effect. Cold Mountain could never become my favorite movie, as that title will always belong to The English Patient, but it's in the top five. The story itself was well developed, and stayed fairly unpredictable. I did not find myself guessing what line came next. A heart-wrenching story about humanity and war. In fact, this movie was so strongly real that it was barely noticeable it took place in the 19th century. It seemed to apply to all times.","Cold Mountain is directed by Anthony Minghella who also adapts to screenplay from Charles Frazier's novel of the same name. It stars Jude Law, Nicole Kidman, Renée Zellweger, Eileen Atkins, Kathy Baker, Brendan Gleeson, Phillip Seymour Hoffman, Ray Winstone and Natalie Portman.Music is scored by Gabriel Yared and cinematography by John Seale. Plot finds Law as W.P. Inman, a wounded deserter from the Confederate army who is trying to make his way back to North Carolina to rekindle a fledgling romance with Ada Monroe (Kidman). This is Minghella's world and the American Civil War movie gets a double shot in the arm as Cold Mountain not only deals in the home front, but also in the perilous life of the soldier. Add into the mix a fire cracker of an opening, a central romance and an array of expertly drawn characters, and it's safe to say that Minghella's film is not only epic in production, but also in story telling. In essence the film is about love, friendships and learning to cope under the most trying of circumstances, but the director doesn't paint it with a sentimental brush. As the three strands of the narrative play out, tone is often gritty, intense, sorrowful even, with Minghella cribbing from the Anthony Mann Western book by having the stunning landscapes form part of the characters emotional world. Come back to me, come back to me Story is strong, even if the key romance is soft; since it's told mostly in flash backs, but those flash backs are threaded into the main seam of Ada's life on the home front and Inman's perilous odyssey. She, befriended by hard working, dirty handed, Ruby Thewes (Zellewegger excellent); who also provides the only moments of levity within, he, meeting up with a number of interesting characters, both good and bad. This of course makes the film episodic, but in this instance it's a good thing, mainly because characters are so utterly compelling. Hoffman as a less than honourable priest and Portman as a young woman out in a wood cabin, alone with her sick baby, they stand out. But there's also the Home Guard attached enforcers led by blood thirsty Teague (Winstone) and a potent thread involving Ruby's fiddle playing father, Stobrod (Gleeson as usual a considerable screen presence). On the technical front it's hard to find fault, it's a tip top production. Romania's mountains, rolling hills and forests form the backdrop to most of the action, with John Seale's Academy Award nominated photography neatly passing for a rugged North Carolina. While the costumes, set design and Yared's score also add impetus to the feel of the time. There's some minor itches, such as fluctuating accents and the delicacy of the romance lacking the passion to drive such a journey by Inman on, but they are not flaws. Such is the strength of Minghella's story telling ability, Cold Mountain still comes out as great cinema. A film that can stay in your mind for days after viewing it. Bleak yet subtle, savage yet tender, a different sort of Civil war movie. Amen to that. 9/10","(Minor spoilers in this post)Cold Mountain's greatest flaw may have been its wrong-headed promotion as a great one-on-one love story. It is more a revelation of people, place and time.We avoided the theatrical release, because of the Law-Kidman romance that was promised (just another date movie...), then I read the Charles Frazier book. Oh. Think again.The film is nearly true to the novel. If anything, Minghella felt compelled to make more of Ada and Inman's budding romance before the war. \"I-I don't know you\" is spoken several times in voiced letters and at the end in the film. In the novel, they didn't know each other at all: three awkward meetings and one fumbled kiss.But, as happens in real life, Inman and Ada felt something was possible ... then their worlds were overturned. Minghella is true to Frazier in the bulk of the story.Ada is a photo that Inman carries, but she really represents HOME: Cold Mountain, his real love. A return to sanity from the insanity of mass murder.Inman is a photo that Ada keeps. He is a glimpse into the rural life she began to appreciate after her unhappy girlhood in the crinolines and parasols of Charleston. Her scholarly father was her one true friend. His early death left her completely alone, neither fish nor fowl.Until kindly Sally Swanger (Kathy Baker) sends Ruby Thewes (Renée Z) over to kill that floggin' rooster, and shows her how to survive.Maybe that's what disappoints many formula love-story critics. Law and Kidman are apart for nearly the entire film. Ruby and Ada get that place a-workin' -- just enough to last the winters at first, but functioning. Ada doesn't pine for Inman; in her letters she is caring, then as times get worse, she is very strong: \"If you are fighting, stop fighting. If you are marching, stop marching. Come home. Come home to Cold Mountain. That is my request.\"Another frequent complaint is that Cold Mountain is \"episodic\". Yeah, it is. That's the structure of the novel. Inman's desperate journey is another retelling of Homer's Odyssey - and that was THE love story of the ages, more than Romeo and Juliet.This is a story of the War Between The States, but one that looks beyond the the glory and horror of Gettysburg, Antietam and Manassas. This ain't \"Gods and Generals\" ... this is about a few ordinary people in an obscure corner of America. Inman's journey is a way of revealing how that war's evil claws reached the most innocent folks. And turned a few of them unspeakably cruel.Perhaps Frazier and Minghella did not intend to remind us, but their story was echoed in 1990's Bosnia; and too many other places today.Cold Mountain: the Frazier novel curled all my toes with its poetry, suspense and aching love of the mountains. Minghella earns two of my thumbs and a few toes for getting it on film.10/10 for the book; 8.5/10 for the movie.","In Cold Mountain, North Colorado, near to the period of the American Civil War, the Reverend Monroe (Donald Sutherland) arrives in the small town with his daughter, the shy Ada Monroe (Nicole Kidman), due to health reasons. Ada meets the also shy Inman (Jude Law), and they fall in love with each other. With the beginning of the war, Inman becomes a soldier, and his great support to stay alive is the wish to see Ada in Cold Mountain again. Meanwhile, Ada meets Ruby Thewes (Renée Zellweger), a survivor of the war, who helps her in the farm and becomes her best friend. The story alternates present and past situations, disclosing a beautiful romance. I liked this film a lot. Having names such as Philip Seymour Hoffman, Natalie Portman and Giovanni Ribisi in the supporting cast, a magnificent direction of Anthony Minghella and seven indications to the Oscar, this movie does not disappoint. My remark is that there are some very important scenes deleted in the story and presented in the DVD. At least one of them, which show what happens with Sara, her baby and the three dead bodies in her farm, should not be deleted as it was. My vote is nine.Title (Brazil): 'Cold Mountain'","A strongly acted and always interesting portrait of the hardships that came with the American Civil War, not only for soldiers but for those who did not fight too. The times are portrayed well, with sets and costumes that cannot be faulted. What can be flawed in the film however is the central romance, which is without much spark or realism. But all the action surrounding the romance is great, with some good-natured humorous touches, wonderful supporting characters and the perfect picture overall of life during the American Civil War. The cast is superb, with Zellweger in particular undergoing a superb transformation from her typical roles. The film is generally well written and well directed by Minghella, so that in spite of a lackluster romance, the film is still a captivating and entertaining watch.","There are a couple of things wrong with this episodic, rather sweeping film, but not enough to destroy it. Fortunately, the good outweighs the bad enough to make it worthwhile viewing. Law plays a shy, but thoughtful young man in Cold Mountain, NC. When the local minister's daughter (Kidman) moves to town, he is immediately taken with her and they share a few very brief, very stifled moments (including an impromptu kiss) before he leaves to fight in the Civil War. (An opening battle scene is so intense that the impact of it literally tears the clothes off one participant!) As they each experience great change, disappointment and destruction, it is their longing for each other that keeps them going. He can't wait to get back to her and she can't wait for him to come back. As Law treks across the southeastern coast, he comes upon a wide variety of opponents and allies. These are all played with great skill by a terrific gallery of solid, semi-name actors (Hoffman, Ribisi, Portman, Atkins, etc......) Meanwhile, Kidman faces the end of her gentle existence and almost existence itself until a scrappy, brassy local girl steps in to rescue her. Zellweger plays this feisty, mouthy girl, using every ounce of her acting prowess. The pair must fend off an opportunistic home guardsman played by a slimy Winstone. The film lurches forward with the all-important reunion moment dangling in front of the viewers like a carrot on a stick. It is solely due to the acting talent and intense chemistry of the stars and not the sketchy, spotty script that this moment carries any dramatic weight at all. Somehow, Law and Kidman manage the impossible, which is to create a romance and desire for one another that is never properly developed on the screen. They are forced to create everything through their expressions and body language and do just that. As good as they are, they are almost completely overtaken by the surprisingly wondrous and intriguing work of Zellweger. Her welcome dash of vinegar and bluntness is a perfect counterpoint for the dewy and sensitive lovers. Also, of particular note is another surprise - the downright striking job that Portman does as a lonely widow and mother. She outdoes herself in this brief role. As a matter of fact, nearly every performance in the film is excellent. The one exception is the horribly anachronistic and inexplicable presence of the peroxide blonde henchman to Winstone. His punk-rock, eyelinered look and shopping-mall line delivery remove the viewer from the already tenuous time period whenever he's on screen. (And is it ever stated why someone his age isn't IN the war??) That's one other problem. There is very little period feel to this film. It always seems like the actors are playing with clothes they found at Western Costume with their make up done by Ben Nye. Kidman's hair, while lovely, is absolutely ridiculous. It distracts from and detracts from scenes very often. Ditto her make up. One key scene near the end is a close up and her heavy mascara and shadow grey/purple eyeshadow (masterfully applied by those Hollywood wizards) turn what should have been an agonizing emotional moment into \"Barbie Does the Civil War\". Zellweger does better in the make-up department, though her chemically-whitened teeth do not go very far in suggesting her character's background. Her deliberately tousled hair is also a problem at times, but nowhere near the level of Kidman's. These are quibbles in light of the bigger problem which is an overriding predictability. Even to one who has never read the book, there is no doubt as to the ending of the film. There is very little room for surprise and what there is of that is telegraphed again and again. So the audience is left watching a 2-1/2 hour film with a foregone conclusion. (And this sometimes meandering work was originally FIVE hours long!) The amount of footage left on the cutting room floor makes for some uncomfortable continuity (such as when a character is tortured and watches 3 family members slaughtered and is next seen smilingly dancing a Christmas jig!) Nevertheless, the romance and beauty of the film still delivers and there is no doubt that Kidman is a MOVIE STAR. She glows and glistens and has every accommodation made to her. Even her old riding coat looks runway perfect. Law is achingly beautiful in the early scenes, but delivers a sincere, dedicated performance in spite of his physical features (which are all but buried as it wears on.)","There are so many good things to praise in COLD MOUNTAIN that it pains me to say that staying with it to the very end is sometimes difficult because it drags in spots and some of the story-telling techniques are awkwardly staged.Nothing but kudos for the casting. Nicole Kidman and Jude Law are in top form--with Law hiding his good looks most of the time under beard, stubble or mud. Renee Zellweger makes us understand why she won the Best Supporting Actress Oscar for her role as the tough but tender-hearted Ruby. Cinematography and background score are tops.By the time the two lovers have been reunited for the finale, much has happened in the way of showing how war brutalizes men. Anthony Minghella doesn't flinch from showing the harsh realities of battle and then switching to scenes of pastoral splendor on the home front. It's a film in which all the ingredients are put together with exceptional craftsmanship. So much so, that you wish the script had been a little stronger to make the two hours and thirty-four minutes more absorbing. Unfortunately, it tends to take too long to tell a tale that lacks the power of holding interest once it gets past the midway point.Nevertheless, anyone interested in the Civil War period will find this a meticulous work as far as costumes, settings and use of folk music is concerned. But be warned: This bittersweet romance at times is downright depressing and the gritty war scenes (and the brutality of certain Yankee soldiers) are about as graphic as such battle scenes usually get. The overall feeling is one of awe that so much has been accomplished and yet there is something unsatisfying about the tale itself.","The movie deals about American Civil War (1861-1865) , the starring (Jude Law , though Matt Damon, Josh Hartnett, Leonardo DiCaprio, and Eric Bana were all considered for this role) meets Ada (Nicole Kidman , though Julia Roberts and Cate Blanchett were both considered) in ¨Cold mountain¨ and they fall in love . Then he's enlisted and participates in Battle of Saint Petesburg (Virginia 1864). He leaves and sets off to find his lover . Being dead her father (Donald Sutherland), Nicole will have to confront a lot of misfortunes until that she's helped by a valiant woman (Renee Zellweger) .The picture is overlong , runtime is approx. three hours but is neither boring , nor tiring , but entertaining for the reason that happen several events . The film blends epic battles, drama , a love story, shootouts and a little bit of violence . The motion picture is pretty strong with crude scenes : the bloody battles ,rampages , rape , murders...it has many violent shots , for that reason the film is rated ¨R¨ as the violence is extreme with cruel killings , besides some sex scenes.In United States attained a moderated success in spite of nomination to various Oscars , though only obtained one award to support cast for Renee Zellweger . In Europe achieved much more success at the box office . The picture has spectacular sets and some wonderful snowy and natural landscapes. Many of the scenes were shot in the Carpathian mountains in Romania . The production design and set design by Dante Ferretti is breathtaking .Jude Law and Nicole Kidman interpretation is top notch likeness to Renee Zellweger rightly rewarded . The secondary actors are first rate : The hideous Ray Winstone , the renegade priest Philip Seymour Hoffman , the kind Bernard Gleeson , everybody are good. Gabriel Yared musical score is romantic and magnificent and John Seale cinematography is astounding and stunningly made . Anthony Mingella direction is accurately developed but there're some moments with slightly slow movement . The flick will appeal to emotion enthusiasts and romantic films fans . Rating: Very good . Above average , well worth watching.","Kidman and Law lack the chemistry to make this sloppily directed, poorly written romance/melodrama work on any level other than grandiosity. Kidman pouts andpines wistfully for her absent lover Law. She's just met him when he's whisked off to do battle for the South in the Civil War, and they've only exchanged about 5 sentences and one kiss, yet they're totally smitten. Law's main direction throughout seems to be `Look vacant and shell-shocked, but sensitive.' Rene Zellweger is about the only spark in this dreary script, but she plays it way too broad and over the top, like she was starring in `Annie Get Your Gun.' Yee-hah boy howdy! Something about her character felt more like it belonged in a Monty Python sketch - the one from `Holy Grail' where the peasants spend all their time wallowing in muck making mud pies for no reason. Kidman is a smart enough actress to stay out of her way whenever she can. Their scenes together are like a comic book hidden inside a Victorian Era novel.Whenever the action bogs down into total tedium, which is frequently, all the writers do is shout `Cue the Simon Legree-type Villain!' and Teague (Ray Winstone) comes galloping out of nowhere to do his unspeakably dastardly acts, like kill and torture innocent God-fearing townspeople in the name of loyalty to a fast-fadingConfederacy. All other times, he's missing in action, which is preposterous even in this cornball script. There is a plethora of other talented actors who give credible performances in small roles. These are the characters Law meets as he does his Johnny Appleseed trek from the front lines, where he has deserted, to the hopefully loving embrace of Kidman back in Cold Mountain. Ultimately though, none of these characters matter. Law has no time for them or their lives. Each of these little mini-movies has the same tired theme: war is gol-durn heck, and turns otherwise decent Christian folk into rabid animals.And the script is far too predictable, too heavy-handed. Moreover, the pacing of the story is dreadfully slow. You spend the entire movie waiting for Romeo and Juliet's inevitable reunion, with Kidman wringing her hands and sighing, Law overcoming incredible odds and dodging bullets. And when it finally comes you just don't care anymore. You'll be looking at your watch wondering how much more of this clap you have to endure.I give it one star out of five for the battle scenes. There is a potent anti-war message here. The incredible lack of concern for the loss of life by the Generals on both sides of the conflict is powerful stuff. But it's only about 15 minutes of this 150-minute dog.","This movie worked for me because I see this movie as an exact opposite of 'Gone With The Wind.' Farm owners instead of plantation owners. Scarlett fights and connives for what she wants; Ada gets depressed and turns inside herself until Ruby, (Renee Zellweger,) shows up to save the day. Sort of, in a round about way. Deserters instead of officers trying to get back to their families, the lists goes on and on. Even the love story was opposite. If this is what the producer and writers were trying to get across it succeeded with me. There are only two things I didn't like about the movie, the rest I thought was well done and I liked it enough to recommend it to friends. First, I couldn't see the attraction between Inman, (Jude Law), and Ada, (Nicole Kidman,) as being strong enough for Inman to desert to get back to her. Inman said he only had written to her a few times where Ada wrote to him almost constantly. Second, something or someone getting killed or dying in almost every scene was a little much. I must say it was full of action because of that, but after about the second scene I knew something or someone was going to die in the next scene. I like to be surprised by the next scene, not know what is going to happen before it does.I thought all the acting was very well done, with Zellweger the best. She deserved the credit she got for it. I thought she played the part of the hillbilly girl very well. She must have done her homework on the part. Zellweger even said in the movie that she was smarter than people thought she was. I think that was true. Law did well with his part with all he had to go through to get back to Kidman. It must have been a lot stronger love to go through all that than I thought it was. Now he showed a lot of emotion in his face during his trials. Kidman's part may have had something to do with the fact I chose her performance after the other two. Except when she was depressed she didn't show much emotion, I don't know if that is how the part was written or if that is how she perceived the part. She still did a good job, I just thought the other two were better. I liked the scene with the Zellweger, Kidman and the rooster, even though it was one of those scenes I mentioned above. I thought the 'Home Guard' was exactly as they probably were back then. Even though we don't hear much about them they were a part of that time. I thought the scenery was beautiful. The movie had everything needed to be a good historical romance.","Critics are falling over themselves within the Weinstein's Sphere of Influence to praise this ugly, misguided and repellent adaptation of the lyrical novel on which it's based.  Minghella's ham-fisted direction of the egregiously gory and shrill overly-episodic odyssey is one of the many missteps of this \"civil-war love story\".  Are they kidding?  After Ms. Kidman and Mr. Law meet cute with zero screen chemistry in a small North Carolina town and steal a kiss before its off to war for Jude and his photo souvenir of the girl he left behind, it's a two hour test to the kidneys as to whether he will survive a myriad of near-death experiences to reunite with his soulmate. Who cares?  Philip S. Hoffman's amateurish scene chewing in a disgusting and unfunny role pales to Renee Zelweger's appearance as a corn-fed dynamo who bursts miraculously upon the scene of Kidman's lonely farm to save the day.  Rarely has a performance screamed of \"look at me, I'm acting\" smugness.  Her sheer deafening nerve wakes up the longuers for a couple of minutes until the bluster wears painfully thin.  Released by Miramax strategically for Oscar and Golden Globe (what a farce) consideration, the Weinsteins apparently own, along with Dick Clark, the critical community and won 8 Globe nominations for their overblown failure. The resultant crime is that awards have become meaningless and small, less powerful PR-driven films become obscure.  Cold Mountain is a concept film and an empty, bitter waste of time. Cold indeed!!!","I had to write a review for this film after I saw it last night and read some of the comments of people trying to classify the displeasure of this film go down to wfmitchell's post)). I don't fit any any of those classification. The other classification that needs to be on the list is 5) people didn't like this movie because it was not good. I found the film to be booring and forced. My wife picked it for us to see because she is a huge Kidman fan and she also likes Jude Law.Speaking of Law, it took a long time and a huge amount of suspension of belief for me to believe his southern accent. I can't help but wonder if they didn't make his character less talkative on purpose so we would't have to hear that tortured accent so much.As far as the movie, it took a long time for it to get interesting (about 1 or 1.5 hours), and then fell flat in it's ending. What was interesting, is that I did not know that this film was directed by Minghella. About 40 minutes into the movie, I asked my wife \"this isn't going to be another English Patient is it?\" It absolutely was.As far as the battle scenes. I'm trying to think of a word to describe the opening battle scene, but I think the most descriptive word that accurately describes it is simply \"dumb\". It was forced, it was unbelievable, it was silly and it was dumb. (After the battle I looked at my wife and asked \"was that just dumb?\" to which she vigorously nodded her head).The only bright point in the film was the performance of Zellweger. The role was a bit over acted like any decent comedy relief role, but it worked. From her speech pattern, her walk, her mannerisms and esp. her little quips (my favorite: \"If you want to get 3 feet up a bull's ass all you have to do is listen to sweethearts talk to each other\"), she was able to create an almost cartoon-like character who did her job extremely well.I simply did not like this movie and I have to wonder about the kind of people who do say they like it (or the English Patient for that matter). I suspect you could categorize them in one category: 1) Soap opera fans","Someone wants her Oscar badly. The film itself is horrible. Ok, I may be biased because I hate these kinds of films. Drama. Lukewarm romance. Annoying actresses. What else is new?What's amazing in this film is Jude Law. Nothing more. Oh yes, and how they were able to get Renee Zellweger to do this movie. And well... the story is great. Several notable moments but all in all, this is a dull film. Thank god I just saw this at my friend's house. Paying for the movie ticket would be a crime.","Did you people watch the same movie that I did???? It was one of the worst movies I have ever seen. To begin with Nicole Kidman's heavy makeup in the beginning of the movie would probably have had her branded as a prostitute in those days. Also, she was miscast and her acting was terrible. Jude Law tried, but again he along with the rest of the (mis)cast never evoked any emotion in me. Rene Zelweiger's acting was convincing, but reminiscent of Granny Clampett in the Beverly Hillbillies. The characters were one dimensional and even Natalie Portman's scene did little to arouse any emotion in me. Donald Sutherland was the best actor in the movie and he was gone during the first half hour!! The script was terrible and laden with clichés from the characters to the dialogue. Even when Inman and Ada meet again, a scene that shouldn't leave a dry eye in the house, it left me cold, as did his death at the end. I just didn't care because these characters and actors never invited me into their world. If you want to see a movie with good acting and a realistic view of the Civil War stick to Glory or Gone with the Wind. Don't waste your time on this sterile tale.","Maybe I missed something, but this was one of the 20 worst movies I've ever seen. Every time you get attached to a character in the least, this random band of 5 murderers comes along and kills them. Why didn't somebody just shoot those Home Guard fellas if everybody knew they were just coming around to kill you and rape your family? There was not a single redeeming quality about the plot of this movie. It started out depressing, got more depressing, looked up for 1 day in movie time, then it got REALLY depressing. Living in the South, I've heard stories all my life about how terrible things were back then, about how there was no real government for a long time there, and there were constant murders and lynchings surrounding the war. But this really took that theme to an unbelievable and ridiculous extreme. Don't waste your time, you'll just wind up feeling like all the life got sucked out of you.","***MILD SPOILERS*** Dear Inman, Kind words are hard to find for me to describe the movie I have just been subjected to that stars you. The  problems are far and wide and painful for me to recount. . . yet I feel I must, if only to prevent others from suffering the same anguish as I did. This is NOT a film for anyone under 50,  it's sloooowwwww, soooooo slowwww, and when the big reunion of Ada and Inman happens. . .the biggest and most important scene in the film, NOTHING happens, it is a epic letdown. Now, like the director should have done, I will keep my words short and end with this warning, your film is disjointed, boring, has no flow and Jude Law is tragically mis-cast, he showed more emotion as a robot in A.I. - be warned, the film should be retitled . . . Bored Mountain. Love, Ada","I could forgive the fact that the movie was shot in Romania (the time and place are a crucial part of the novel full of character and qualified film staff, but remained an untapped resource for the movie).  I could forgive that foreign actors were used as leads, presumably for their names, while there are perfectly qualified American, or better yet southern actors available (there was an Australian, an Englishman, a couple Irishmen, and a whole bunch of Romanians; Oh and one great young southern actor, Ethan Suplee with a relatively inconsequential part.).  I could forgive the geographical mistakes (if you are in Petersburg, VA start walking south or west or better yet uphill and you will get to Avery County, NC, but you will never see the ocean).  I could forgive the lack of true development of a villain or evil (several were suggested, the weakest of which was there for the finale).  I could forgive Phillip Seymore Hoffman's British southern fusion accent (Not nearly as bad as Nichole Kidman's or Jude Law's sad attempts at southerners...sad and inconsistent), or Rene Zellweger's comic book interpretation of her comic relief character (she was occasionally amusing after all).  I could forgive the soundtrack for leading me by the nose though every pivotal scene like some kind of emotional laugh track (not the bluegrass, the bluegrass was great).  I could forgive Natalie Portman for anything (because she is supremely attractive).  I could forgive a lot of things, but I'm not gonna.  It was just bad.  The acting. The interpretation of the story.  Character development.  The sexual tension. The release of said tension.  This is Hollywood hubris at it's best.  To be fair everyone worked very hard, and with a different script and a different director this cast could have made one of the greatest movies ever (I have a deep respect for so many actors involved in this movie), and Cold Mountain is a nice vehicle (most of the nice parts of the movie were where Minghella left the book alone), but it just didn't happen.  Donald Sutherland was very good along with James Gammon and Giovanni Ribisi.  Romania was pretty. Cold Mountain however, was just plain bad.","I was really excited about seeing \"Cold Mountain\". Alas, like most movies I'm really excited about seeing, it was a letdown! Were it not for that miraculous invention called a DVD, I think I would've put my head through the monitor, I was so bored!I closely watched Kidman and Law when they meet because their characters are supposedly \"destined\" for each other. Yet Law's face showed anything but dumb-struck love, while Kidman seemed to be counting the seconds until she could run back to her trailer! Zellweger's character is pure Granny Clampett (as if we don't get it, cornball banjos mark her every entrance), and so over the top, it was all I could do not to laugh! Ironically, her performance serves to highlight just how stiff-as-a-board the leads are.Ada nearly starves because she freed her slaves; we never learn why. More perplexing is why didn't any of them stay on as Ada and her father were unusually benevolent, and (as shown in one scene) it was a very dangerous time for Negroes (as they're politely called here). Why didn't the neighbors teach her how to milk a cow or grow a crop? Heck, why didn't she just sell the farm and go home? And for all of Ruby's practicality, when she dispatches Ada's \"evil\" rooster, that kind of puts the kibosh on them having any more chickens!By the time her beloved finally returns, Ada doesn't need him or anyone else -- which is the big joke! Indeed, she may be physically intimate with Inman, but her real intimacy is with Ruby, who has turned Ada into an Über-Babe version of herself. Did anyone else notice how they walked down the hill holding hands, happy as two peas in a pod, as they left Inman behind?I doubt that Minghella recognized this as he was too busy making an anti-Bush movie. Inman tells us he is \"like every fool sent out to fight with a flag and a lie\", and Ada's father says \"I imagine God is weary of being called down on both sides of an argument\". These \"observations\" are historically inaccurate and insulting. While slavery was the basis of the South's economy, the reasons for the War were more complex. It was incomprehensible for a soldier to think that the cause was \"a lie\" (in fact, most in the rank-and-file were indifferent to it). For filmmakers to stamp their views onto a period where such views were foreign to those who lived in that time is beyond obnoxious.Structurally, the film is choppy and episodic. Law and Kidman are miscast, and have zero chemistry! The script is little more than half-baked dialog, and an egregious bunch of clichés and banalities. \"Small moments like a bag of diamonds?\" Ugh!","Are you seriously kidding me? This movie got Oscar nominated for what? After watching this I thought someone was pulling my leg. Lets start off with some facts. This is a civil war movie filmed in Europe. Totally inexcusable. The location was enough to make this movie doomed. But no instead we get a LONG drawn out movie where Jude Law \"Inman\" dies at the end after watching him live through every sort of situation imaginable he gets into a talking duel with Cold Mountains \"Billy the Kid\" and slowly dies. Come on! How cliche is this? Not only was the end of the movie pathetic it was anti climatic. What a waste of an opportunity. You had all the makings of a good movie and all the necessary characters early on, instead the script calls to kill everyone off slowly throughout the movie. The art of good script writing is dead. To many movies like this. Yes war is bad and people die, why not show us the smart ones who live through it and how they did it.Now lets not get me wrong Jude Law does a good job trying to be southern but I can't get over he is from England! The producer of this movie needs his head examined filming a Civil War movie in Europe with an English lead actor. Nichole Kidman does a good job but she just remains way to clean compared to the supporting cast and it stands out, she looks out of place even when they try to \"dirty\" her. Things like this and the completely depressing pathetic ending not to mention the overly long movie run time make this just not a very good film.Movies with bad endings are always easy to spot. They never get much public support. The reason is simple people DO NOT like to be depressed. That is why I was so hesitant about Cold Mountain. I kept hearing Oscar Nomination but no big push by the public for it. Some things never change. Maybe one day these producers and directors will learn that people really do enjoy good, smart movies about redemption, hope and happiness. Not sappy tragedies. There is a reason Shakespeare is only brought up in literature class and Cold Mountain was named \"Cold Mountain\". Sometimes its obvious, what a waste of time.","When I first saw the trailors for this movie, I was overjoyed. Anthony Minghella is one of my favorite directors. His English Patient has always captured my imagination and moved me deeply. The actors in this movie were some of my favorite. Jude Law and especially Nicole Kidman, whose last year's performance in The Hours shocked me with her undertone of power. And with a cast of amazing supporting actors, including the likes of Phillip Seymor Hoffman and Giovanni Rabissi. How could anyone not love this movie? Simple, it was sold to you. You were not expected to buy it or believe. It was a bad soap opera on wheels rolling into a ravine. True, this movie had its moments. But that is all it had moments of average filming that swept you away for a second. Yet, you were brought back quickly by the stereotypes of the film. The one that bothered me the most about this film was its love story. Contrived, that is all I can say. I am an avid movie fan and am usually quicker to love movies than to hate, but this rubbed me the wrong way.","We're back in the old South (\"old times there are not forgotten). The movie old South. No balck people to speak of. (Well, we hear that Nicole Kidman freed her slaves in Cold Mountain, North Carolina - during the war - musta made her popular). Horribly staged battle scenes, laughable dialogue, generic southern accents, and a story-line that would make the writers of daytime TV hide for shame. It's a tacky, badly acted, badly directed joke. 2.5 hours of film-making at lowest ebb. Give it a miss. Or a take a bottle of scotch in with you and mock the film as it goes by.","This movie really has nothing going for it.  With the Reverend played by Phillip Seymour Hoffman complaining about his constipation and other toilet humor in a 2.5 hour movie, you know that they made no cuts at all and left the crap in, literally.  It's a waste of good talent, and a total embarrassment.  Dreadful!"],"review-user":["mstomaso","oschaefe","janyeap","songbird2882","Spikeopath","keechelus","claudio_carvalho","sol-","Poseidon-3","Doylenf","ma-cortes","spikey01","dbarnes-6","jake j","bkirkby","sourapple","Tegwyn674","johnny-wales","TheMightyN","aaronsaft","ldavis-2","The_Real_Review","DarnellOne","rr19","superchoatie"],"review-date":["4 October 2007","22 August 2005","11 December 2003","8 June 2005","12 July 2011","23 November 2004","13 September 2004","8 December 2004","5 January 2004","7 July 2004","12 February 2005","28 December 2003","30 July 2004","25 December 2003","10 January 2004","31 December 2003","2 July 2010","26 February 2005","26 December 2003","16 January 2004","23 July 2004","15 July 2004","30 January 2004","26 December 2003","27 December 2003"],"review-rating":["9","8","10","9","7","1","7","1","1","1","1","1","1","1","2","2","2","2","1"],"review-title":[" Hope in Times of Despair\n"," A chilling vision of a tragic era\n"," It's the lasting effects of war on the idividuals...\n"," an epic\n"," I imagine God is weary of being called down on both sides of an argument.\n"," Not A Love Story\n"," A Beautiful Romance in Times of War\n"," My brief review of the film\n"," Worth watching even if \"brought to you by Mattel.\"\n"," Stunning photography, fine performances but flawed script and mixed results...\n"," Sensitive film with great interpretations and spectacular outdoors\n"," Overblown, Tedious, Boring Melodrama\n"," This movie works, but it is no \"Gone With The Wind\"\n"," Weinstein-Miramax Bulldozer Can't Scam This Viewer\n"," I normally don't write reviews for films...\n"," cold film\n"," Cold Mountain left me cold\n"," Long, rambling, pointless and depressing\n"," Dear Inman, your movie is tragically boring\n"," Why I thought Cold Mountain was just plain bad.\n"," cold..... burrrrr!\n"," Are you Kidding me? Oscar Nominate this? Please.\n"," When movies like this don't succeed it is beautiful.\n"," What movie did the critics see?\n"," Bad Script, Bad Accents, Bad Sex\n"]}