{"review-url":["http://www.imdb.com/title/tt0102212/reviews"],"review-text":["A beautifully dressed, frightened young girl seems to be running away from something. Actually, we can't tell how old she is at first because we don't see her face, but she is apparently female. Then she sees the bloody ballet shoes. And the chilling face of the dead girl attached to them. She screams.FBI profiler Isobel Neiman is hired by the Los Angeles Police. Det. Donoho shows her the depressing basement where her unit works. It seems the special unit was \"set up to fail\" but they fooled everyone by excelling at their jobs. The newbie is the victim of several practical jokes, but she's a good sport.Capt. Harris shows Isobel a room full of unsolved cases. She has a lot of work to do, but it just happens that she sees those ballet slippers again. Yes, I said SHE sees them again. And with them is a photo of the girl.Against the advice of everyone she talks to, Isobel decides to work on the \"ballerina murder\" (actually, it was believed she wore the costume when she was a hooker). She spends a lot of time with Tribune reporter Thomas Quinn, who wrote numerous stories about the 20-year-old case. Her obsession with the case, which includes living in the girl's old room at the once-elegant Hotel Rosslyn, becomes unhealthy in the eyes of some.Fric and Frac (Detectives Jepson and Robinson), who provide comic relief but are good at their jobs, work with Isobel. She participates in their investigation of burglaries. Notice I didn't say \"helps\".The central mystery of this movie becomes somewhat complicated, and the investigation starts out interesting, though toward the end I got bored. Perhaps this was just suspense. The thrilling ending, which I actually saw before anything else, made up for any weaknesses.Stephanie Zimbalist showed a lot of confidence and her character was easy to like. I especially liked Detectives Fric and Frac, and Lee Tergesen was good as a street-wise detective. Danielle Harris was also good at showing fear in her brief scene as the young Isobel. I liked the friendly old manager of the hotel, but I didn't catch his name or that of the actor.One other weakness--Isobel's friend Sylvia, who drove her to her new job when she first arrived in Los Angeles. Candy Ann Brown seemed like she was acting and didn't quite convince me she was a character. This was only a problem because it hadn't yet been established how good the movie would be.But it was good. For a TV-movie mystery.","This was really a great movie. Great plot, characters, locations, etc... The actors and actresses were also just as great. Stephanie Zimbalist at her best. 5 out of 5 stars! Watch this movie!If you like detective movies, you will like this movie. Each character works well with the other characters and there is nothing at all bad about this movie. It's like Perry Mason and Matlock. Stephanie Zimbalist is great as a female detective and she should do some more detective movies. Watch this movie!","One of the better Stephanie Zimbalist as detective on TV.What is interesting for me are the amount of scenes with no dialogue that is played well with just music, lighting, and acting. The audience is saved from too much exposition. (Spoiler) The one scene with Isobel speaking in reflection was particularly effective. One can't help wonder how long it took to execute this scene.","Yawn. A young girl comes across a crime scene where LAPD have discovered a dead woman dressed as a ballerina hanging over a hurricane fence topped with razor wire right by their station. Blood is still dripping from her.Twenty years later, the young girl is now an FBI profiler, who is transferring to that station as a Sergeant to work in their Special Investigations Unit. The SIU is where all the bad cases are transferred, the ones the LAPD as a whole doesn't want to be blamed for not solving. SIU apparently also covers cold cases. She helps with a home invasion/burglar case, but is mainly concerned with reopening the ballerina murder case. She enlists the help of a reporter who had covered it, and some of the SIU cops.This movie isn't terrible, but nothing struck me as too terribly interesting either. The murderer for me was pretty predictable. Oh well.","Where do I begin with the Killing Mind before I mention the good bit? This movie is about a young psychological profiling FBI woman, or something, that for some reason goes to work for the LAPD for a wee while. There are some recognisable faces, like the \"I love you, man\" bloke from Wayne's World, playing a cop (nice beard-age too!) and two guys who always seem to play cops playing..... you guessed it, cops. One of them was one of the cops in Gross Point Blank following John Cusack about the place, and the other is the FBI guy with specs in Final Destination, who is also in the Fugitive as another cop. I know the FBI, US Marshalls, CIA, etc aren't cops, but they're all the same. They enforce the law to a certain degree, that makes them cops in my book. Feel free to disagree with the definition of a cop all you want, they're still seen as the ones who are trying to bring the bad guys down. Any, I digress. The woman is working alongside these cops who just seem to sit around in a library in the basement or something, and for some unknown reason decides to reopen a case that hasn't been looked at for yonks. She saw the dead body as a kid, so naturally decided that she can reopen the case cos she was personally attached to it! I also like how the person profiling other people's psychological state witnessed a murder scene as a child. Surely that's the kind of thing that can screw with someone's head?! She starts asking questions off some journalist who covered the story when it was open, even though he appears to be the same age as the woman, so he presumably was either writing for a newspaper when he was 10, or he wrote a few school reports on it, and she decided he'd be the best person to ask about it.We then see that as well as reopening homicide cases from 25 years earlier, she tries her hand at petty theft as some really inconspicuous bloke sprints through a busy street wearing a balaclava. Way to blend, moron! Anyway, she and the cops she's with eating ice creams in the park give chase after him, and whilst crossing a bridge with a woman and child standing on it, the thief grabs the baby from the mother's arms and throws the baby in the river. This, if you haven't already guessed, is the best bit of the movie. I'm not sadistic, and don't have a hatred for babies or anything, but the scene just looks so stupid I promise you will wet your pants laughing at it if you should watch this movie. It gets better when the cop from Final Destination & the Fugitive jumps in to rescue the baby then declares to his friend \"It's a baby!\" How did he not know that before he jumped in, is beyond me.Anyway, she chases after the thief but loses him. Later on she remembers that a random dog didn't bark at the thief, so assumed it must be his and decided to track down the thief through the dog. The dog had no markings or anything on it, so how she knew where to find the dog, and thus find the thief is another question I won't go into. it was shortly after this that I stopped watching. The story was moving really slowly, and after I had stopped laughing at the baby throwing bit, I had kind of lost interest and missed what was being said.Saying that, I'll go ahead and assume that the killer was the journalist bloke because he seemed a bit shifty, and she was spending a lot of time with him, and anyone who watches Columbo knows that the person outside the police force who spends most time with the investigating officer is your bad guy. plus, other people's reviews say the killer was pretty obvious, so I'm sure it was him.So all in all, a pants film, but worth watching just for that one glorious scene."],"review-user":["vchimpanzee","PaigeSG1","cin_kong","FieCrier","dmusucksdonkey"],"review-date":["31 August 2006","15 March 2002","8 August 2017","2 December 2004","6 February 2008"],"review-rating":["9","5","2"],"review-title":[" Good mystery\n"," YESSSSSSSSS!\n"," Enjoyable\n"," so-so cold case profiler cop movie\n"," Rubbish Film, but one genius moment\n"]}