{"review-url":["http://www.imdb.com/title/tt0112111/reviews"],"review-text":["I viewed the original Outer Limits in real time, when first broadcast and have since viewed the entire original series again and again in re-runs and complete on DVD. I find the New Outer Limits WELL MORE than just a remake of old retread episodes, as some of the more adolescent commentators have suggested.With seven (7) years of programs versus just the two (2) years of the original series, the producers and writers have certainly added considerable new original stories and philosophical lines to a much longer running and very well produced (cable) TV series. Plots are intelligent, scientifically accurate projections of the unknown possibilities of the sometimes frightening and imminent future.While most producers and directors in Hollywood ignorantly view Sci-Fi as indistinguishable from Horror and Fantasy, this series returns to the origins of Science Fiction in the logical, moral and philosophical projections of current new technologies into their possibly fearful near term realizations. This series does this very well and remains unique in its avoidance of the \"shoot-em-up\" video game monster mentally of much of the current generation. It has brains, history, a message and good entertainment. It is an adult series without unbearable teenage know-it-all fantasies. Hurray!Now, if we can only get MGM to release the entire New Outer Limits series on DVD instead of just the six poor teaser discs and the 1st season now only available.","I discovered The Outer Limits in mid-2001 while it was in syndication. Sadly, I didn't realize that they had just wrapped their final season. I've been trying to catch all of the episodes on Sci-Fi, which has an erratic schedule for this show, to say the least!I must say that I disagree with most of the negative comments that I've read so far, regarding this program.  The series did indeed have some dud episodes -- especially the episodes which pieced together parts of other episodes to somehow make a \"new\" story.  However, for the most part, the show ran 7 seasons with some very original, creative, and fresh concepts that in most cases held my attention until the very end.  In fact, I felt sorry at the end of certain episodes that I wouldn't get to see more of the story, as each episode is a self-contained.  Unlike many shows than ran for 7 seasons, I did not find a degradation in quality as the show wore on. In fact, my second-favorite episode (\"A New Life\") was from the final season.While many writers were involved with the stories shown in The Outer Limits, a few were responsible for the majority of the episodes.  It's interesting to take a look at some of the \"themes\" behind the show in general.  The main (and stated) theme of The Outer Limits was to explore human nature and the consequence of human mistakes.  However, a viewing of all episodes also reveals a disdain that the writers seem to hold for both the American military and Christianity.  There were several episodes in which the military was either the villain, or the protagonist whose mistakes lead to the destruction of mankind.  Christianity was frequently shown as the vehicle used to brainwash unsuspecting earthlings into helping aliens accomplish their evil goals.  I am neither Christian nor involved with the military, but I found this apparent bias by the writers to be annoying, and sometimes ruined otherwise good episodes.I liked how The Outer Limits mixed its endings between happy and catastrophic.  That made things a bit less predictable, unlike many movies of today where you know in advance that the hero will survive and triumph.\nIf you're looking for a great episode, try \"The Refuge\".  I won't detail any of the plot for you, since it's best watched without knowing anything in advance.  It's from season 2, so I believe you can find it on the Season 2 DVD.","No, I have not seen the original series and I won't compare the two if I had. This series is filmed in Canada in Vancouver and Victoria, British Columbia. The series is well-written in a different story each week. Some are little out there but most of the time it is the quality of the story telling. I loved the Afterlife episode with Clancy Brown and Barbara Gerrick and the Deprogrammers episode with the irresistible Brent Spiner as a Deprogrammer in a world where humans have become slaves to a lizard reptilian species. It's funny how the lizards and reptiles are our favorite evil aliens like V but anyway he has three days to program a man who is totally brainwashed in serving the alien species on earth. The stories are usually a little out there but very entertaining to watch.","The Outer Limits is a unique show that includes material that appeals to a very large/diverse audience without \"selling out\" like many Hollywood movies. The science fiction aspect is authentic and detailed while simple enough and explained well enough to be understood by any interested viewer. Each episode will provoke ongoing thought. The cast changes from episode to episode, however there are a couple stories/characters which are revisited time and again. You will also recognize some known faces. It seems almost every time I see the show there is a famous actor/actress playing one the main characters. I remember Alyssa Milano, Kevin Nealin, Natashia Henstrich, Ryan Reynolds and many others that fail to come to mind (sp?). There are many great episodes; I recommend finding and watching the episode \"Ship\". I do not know which season it is from.","What can I say about the series dubbed the NEW OUTER LIMITS...Hmm.... Only that this was one of the best TV series ever assembled!! You have actors of all ages, The actors that are somewhat known and that time forgot. Everyone playing their part to exact perfection! These shows always have some type of moral story to them which most of the time (if not all the time) is very true! You can feel that the man whose voice is dubbed over the credits and in the beginning and ending believes what he is saying wholeheartedly! Not only do these shows have great story lines, they also throw you into them, get your mind racing, and your blood pumping. The original outer limits was a black and white in the 60's right, These shows made a triumphant comeback the likes of which I have never seen! The new twilight zone with Forest Whitaker was fun to watch, but the New OUTER LIMITS is where it's at! If you have not seen: I implore you to please check these episodes out, and you will see exactly what I mean! LONG LIVE THE NEW OUTER LIMITS!!!!!!!!!!!!","I haven't seen all the Outer limits episodes, but when I have tuned in I've seen some quite good episodes almost like a one-hour movie with good (if lesser known) guest stars. Others have been embarrassing to watch or just plain average, it seems the way they did things was to have mostly low budget \"filler\" episodes and save up for a great, blockbuster episode every now and then. The Outer Limits seems to offer both the best and worst of TV, I say overall it's not a bad effort but viewers like me may lose patience when it starts to seem like a long time between good episodes. I'm surprised the show ran as long as it did, with every science fiction-themed show outside of Star Trek and Stargate being cancelled at the first opportunity.","The six episodes here reflect the very best, and worst, of the series.Since The Outer Limits always preaches a moral. I would like to offer my own. Starting with the most entertaining to the flops.Favorite Number 1. Afterlife: As an institution, The U.S.A. military-industrial complex is both evil and paranoid, not to mention plain stupid. However, individuals with great integrity do serve our country, and they will obey their conscience even at a mind-boggling cost! In the end, the aliens don't need to say a word. Those without a conscience are fools who are to be held in utter contempt! A truly subversive episode! One that should be shown on prime time television for all to see! This might be a revelation for some, but folks without a conscience should not be allowed to serve in our military! Nor do the ends justify the means! Favorite Number 2. Relativity Theory: A good person may be forced to make a split-second decision between good or evil in order to save the lives of defenseless intelligent beings, and at great cost to one's self. What makes this decision all the more difficult is the stark choice: Being marooned with exotic alien strangers who you can't even communicate with except through gestures, or going along with a group of people you think will keep you safe from unknown dangers even if they are ruthless, and devoid of compassion! This episode is brilliant! What fuels this depravity is good old fashioned greed. This episode is one of the most scathing indictments of capitalism, transnational corporations and raping the environment, I have ever seen in my lifetime! Unlike real life, justice here is served - and swiftly! One of the most memorable lines is when the ruthless corporate thug said something to the effect, \"We did the same thing in the Amazon Rainforest War.\" Alluding to the killing of Amazonian Indians who were attempting to protect their rain forests from being strip mined, as justification for killing again literally in the name of the \"survival of the fittest.\" Something Darwin never meant to be taken literally! Favorite Number 3. Alien Shop: Tremendous power can be used for good, even from an exotic alien. This power can be used to heal instead of destroy. Mere mortals can learn from their mistakes! Even a criminal can see the light if given enough opportunity to do so.Sometimes it takes strong medicine, but we all can wake-up and change our self-destructive ways! Favorite Number 4. The Grell: An alien can be a Christ-like figure! In the distant future, slavery can be justified, once again, in the name of expediency! Basically good people can be corrupted. Sometimes a person needs to be experience great shame in order to see the evil he/she is committing. Children are closer to the truth than adults. Those with political power have tremendous responsibility! Another work of genius! As a species, \"Do human beings learn from history?\" Flop Number 1: Quality of Mercy: Loose Lips, Sinks Ships! When in war kindly keep your mouth shut about important military plans. Gee, did I really need to watch an hour-long soap opera in order to figure this out?!! I wonder, did the makers of The Outer Limits run out of ideas, or did corporate pull the plug? Dark and ugly, serving no purpose, but despair! Flop Number 2: Beyond The Veil: So bad there is no moral but this: When locked-up in a mental hospital, use some common sense, please! This episode is so bad it disgusts. What an X-Files rip-off! Don't waste your time on this one! You'll thank me later! It's a sad commentary that The Outer Limits went down the tubes toward the end of its run. Subversive episodes, like the first four, could not last forever! It was a miracle they were made at all! Hopefully, someday, other brave souls will follow the subversive Outer Limits tradition into new territory! If you happen to be such a daring person, a good place to start is with one unique book: \"Anatomy Of Wonder: A Critical Guide to Science Fiction,\" edited by Neil Barron! As far as I'm concerned, one of the most comprehensive books ever written on the subject!","I've only seen about 20% of the Outer Limits series. Some episodes are great, others just mediocre. However, \"Think like a Dinosaur\" stands in a league of its own. Never have I thought so much about an episode of a sci-fi series. The greatest aspect of this episode is its ability to elicit intense introspection; to imagine yourself in the protagonist's shoes and know you must make such a difficult decision. The clear, warming humanity of the \"unbalanced equation\" is overwhelming, which is why the choice is so painful. The ending still gives me chills. Imagine what the protagonist must be feeling when he sees her again. This episode is a brilliant depiction of morality and ethics clashing with science. I haven't yet seen the topic handled better.","I first started watching The Outer Limits back in 95 when I was 10, and it just blew my mind every week with each episode, every episode had a twist and each week I couldn't wait for the next. How the writers managed to do every episode so well and make it different from each over a course of 7 seasons is beyond me. This show manages to teach us about life, robotics, Alien and human encounters, and an insight into more of the paranormal, and how it affects the people. What really makes this a good show are the characters in each episode, they really show emotion and are really good actors. What you'll also notice each week is an actor/actress you'll know from a past show which is pretty neat in its own way.If you wanna chill out, and sit back with a good Sci-Fi show, then the Outer Limits is for you","I can be a bit of a sucker sometimes for anthologies, I always love the fact that they have as many stories as you want, it's true that quantity doesn't always equal a great amount of quality, but sometimes quality really does help.This is another sci-fi gem I think is under the radar. Yeah I know I lot of people say, this revival isn't as good as the original; but lets face it it's a tough act to follow. What I really like about this version of the anthology is isn't trying to one up it's predecessor, but it's trying to simply do it's own thing while staying true to the spirit at the same time, which I feel is what a good revival should do. I remember seeing this show when I was about 12 so in a way this show is one of the final relics of my childhood at it's end, also if it wasn't for this show I never would of known entirely about the original. It was also to me one of the last really good anthologies before they became a lost practice, not to say there aren't anymore but they've became few and far between.There are a lot of things I feel this revival has going for it. I really like the theme song which I think is very good and memorable, it has a really eerie and spooky tone to it. The production value I thought was on par, it was done on a higher budget but it was used well. From the make up of the aliens/monsters, certain special visual effects which hold up, well may'be not all some CGI effects do look dated.The pacing I personally thought was better, each of the stories like it's predecessor are an hour long but I hardly noticed the time. I really liked the into narrator, he has that storyteller tone which is both wise and kinda creepy.Even liked the use of cast members, each of them were a mixed bag from unknowns, experienced actors/minor leaguers you might have seen here and there, and some familiar faces from TV shows or movie you might know about. Each of them are different ages and I like that they all look like regular people, which I like because it makes them more easier to emphasize or relate to, than anyone from the CW whom look ridiculously good.And this show has a lot of good and memorable stories. It's true this show does have a lot of bad apples, but that's the same fundamental truth about most other anthologies out there, it's a matter of sorting out the bad ones in order to find the really good ones, and the good ones really are tasty. I really like how most of them are morality tales that really do deal with the fallibility's of man and science, the danger of uncontrolled progress, conflict between man and mechanization, fear of what is unknown or what we don't understand, and the importance of being human and humanity triumphing.There are plenty of memorable stories, I'll let you make your own lists and be the judge of them. But then again that's the point of most of these anthologies anyway. A couple of them for me are one \"Stream of Conciness\" which was about an internet technology completely running the show and books and literacy have became almost obsolete. Another which is my favorite one \"Tribunal\" which is an emotional story on a lawyer (played well by Saul Yurik from TV's \"Warehouse 13\") traveling in time to gather sufficient evidence, to try and convict a wanted Nazi.Overall this show was a solid sci-fi, I wouldn't mind another revival, or at least some other anthology based on sci-fi to form. Anthologies are something the sci-fi community needs more of right now. Like any story in an anthology this show is worth checking out.Rating: 3 and a half stars","In the mid-'90's, B.B.C.-2 screened 'The Outer Limits' in the slot vacated by the ratings-busting first season of 'The X-Files'. They gave it a 'Radio Times' cover and loads of publicity, but unfortunately shot themselves in the foot by opening with the execrable 'Blood Brothers' instead of the excellent pilot episode 'Sandkings'. Ratings plummeted, and the show eventually disappeared. It was a shame because 'Outer' had some good stories, special effects and performances to offer. By far the best episode was 'A Stitch In Time' in which Amanda Plummer played a time-travelling scientist who executes the men who will one day become serial killers. On the down side, the show featured gratuitous nudity and sex ( particularly 'Caught In The Act' ), something the original managed to do without. A number of episodes from the old show were remade; 'I, Robot' was passable, but the less said about 'The Inheritors' the better. The quality varied, but overall it was worth watching.","Usually when one says that a revival of an old show is exactly like the original, it's a good thing.  However, this show takes its inspiration and somehow makes it worse.The show is basically the older \"Limits\" series in color and with fancy special effects, along with some plot similiarties and the twist ending. Yet that's all it has.  It has none of the style or true punch that the original has, and that's it's main failing:  it has none of the heart, merely choosing to restate the same old morals Rod Serling gave us in the Twilight Zone and repeating them over and over again.Which is a shame, since there seems to be a lot of talent of every aspect in this show, which seems to scream 'I can do better!' yet is forced to peddle this simplistic mush.Bottom line: if you want your irony, go to the masters of the genre.  The only real reason to watch this show is to either waste an hour of your life or if you're too conceited to watch its better, which exists in glorious black and white and full of rubber monsters.","One of the stand-out features of the original Outer Limits series was the consistency of good writing. Oh, there were some bad episodes like the one with the telepathic rocks, but overall it was an amazing achievement in science fiction.The New Outer Limits saw just the reverse. Mainly, the episodes were formula and, where the endings in the original series brought hope, the new series primarily brought doom and destruction. The reason for this comes from a lack of writing skills. Science fiction writing is like writing mysteries. Of course, there are always the murder shows where the killer gets away with it, but then there is the clever side, as with Columbo or Agatha Christie, where the writer creates a difficult situation, but has figured out how to resolve it in the end. The endings in the New Outer Limits were, for the most part, unresolved and left the viewer with a sense of despair.There were a few exceptions, though. One was entitled, \"Tribunal\" and told how a man used a time watch to go back to Nazi Germany to a concentration camp, to try and save his half sister from certain death. It is a four handkerchief ending.In another brilliant episode entitled \"A Stitch in Time\", Amada Plummer uses a time machine to go back in time and eliminate serial killers before they ever killed. Each trip back to a rewritten present slams a lifetime of memories into her head, causing brain damage, a concept \"borrowed\" for the film, \"The Butterfly Effect\".Finally, in an episode entitled, \"Think like a Dinosaur\", the concept of what happens to you when you are teleported is measured to the extreme. Perhaps inspired by the Star Trek Next Generation episode where Will Riker is split into two separate persons by a transporter beam, each of which go on to lead two distinct and separate lives, something goes wrong with the teleporter and the original is not destroyed but revived. So which one is actually real? While one of the doom and gloom episodes, this one still raises enough questions as to the nature of the human soul that it manages to transcend the poor resolution of circumstances at the end.The fact of the matter is that the New OUter Limits more closely resembled the original Twilight Zone than the series whence it derived its name.","When I was growing up, the two great sources of what for me was \"real\" science fiction was the Twilight Zone and the Outer Limits. Some of those episodes just creeped me out, and years later, they still do. While the Twilight Zone occasionally had morals to its stories, the Outer Limits stories were more often an exercise in fear and terror, bereft of any moral.This was because the stories created by the chief writer of the Outer Limits was going through psychological problems of his own, and the stories that he wrote came to him in his car as he drove along. Had his psychologist been more successful, the earlier Outer Limits would probably be like the dribble that is the new Outer Limits today.Some how all the terror has been leached away and what we see are a series of predictable episodes that have ham-fisted morals that fit right in with the cynical '90s. There are only a few basic themes in the new version, and all the rest is just a predictable variation of \"virus destroys all but a few people,\" \"Mankind is bad and must be dealt with\" (by alien or androids-- it changes each week), \"Don't watch out or what you create may end up controlling you,\" and a few other limited themes. There was nothing really new here.And to make the series all the more depressing was that nobody ever on. The good guy/hero thinks he does but no! -- he dies, everybody dies, and then there's the moral. It's '90s cynicism that's just there to hammer down dull, and downbeat episodes where almost nobody ever comes out alive and happy.While 90 per cent of the episodes are a waste of time, there are a few good ones; you just have to sit and wade through all of the crappy ones to find a good one. For good science fiction, go and buy the videos or DVDs of the original series; those will either terrify you or give you things to think about. Unlike with the new series where you've seen a few, you pretty much have seen them all, with the originals they are all uniquely different from the others.","The original Outer Limits was a groundbreaking show:  even now, forty years later, the program is thoughtful, provocative, and imaginative.  It was sci-fi with a human twist, showing real-world problems against a backdrop of aliens, monster, mad scientists, and powerful political interests.  The show was steeped with Shakespearean themes of love, murder, betrayal, faith, family quarrels, romance, redemption, and greed, all cleverly offset against, for instance, the site of a man in an alien costume or a woman who was actually a queen bee.  This process of pairing two seemingly dissonant halves has proven to work well in other forms of entertainment, most notably the Singing Detective.  It was a formula that worked well for the 1960s anthology series, because it provided both real substance and genuine entertainment, a void which the X Files was to fill later on in the 90s.The 90s version of the Outer Limits lacks the sense of drama, and the magic, that the 60s version had.  Sure the special effects are better, but the writing is horrible.  Every time I watch this show, it's one of three storylines that they beat into the ground:1)  Mad scientist invents something, can't wait to try it out, tests it on himself, guess what happens (and there's always an evil board of directors out to stop his funding).2)  Human beings are being slowly changed into something else, and the mystery will be revealed at the end of the show.3)  Aliens (or a robot) have an ulterior motive, and it's not a good one.Oh, and you totally can't tell that they shot the series in Vancouver.\nWhere is the drama, the acting, the great writing that the original show had?  For example, Sally Kellerman, Martin Landau, and Chita Rivera are fantastic in the Bellero Shield, my favorite OL episode.  You have a greedy, ambitious Kellerman, a slightly loopy but brilliant Landau, Chita's weird dance-like movements and vaguely threatening presence, an alien murder, a wealthy industrialist, a spooky old house, and excellent writing.  Now that is an OL episode that none of the new episodes can even begin to compare with.  You feel something for each of the characters, and the storyline pulls you along.On the new OL, you can't care about the characters; they are flat, dull, lifeless, unlikable.  You can't identify with any of them, it's like they are made of flexible plastic or something.  And everyone is either good or evil, and the writing goes out of its way to make sure that the evil characters are pure evil and nothing else.  Like the one about the cloned robot who was put down by the greedy businesswoman at the end of the show, only to have the robot come back to life again and strangle her.  Gee, I didn't see that one coming.  Who wrote this crap?","I caught this show a few times when I was young and it was playing tilt, My parents loved it and now in syndication I feel what they feel. This show did what the original limits and twilight zone (new and old) couldn't do. This show used some old ideas and some truly original ideas.I still cannot believe Jonathan Glassner and brad wright did this. Those guys were producers on stargate sg-1. The show kept the audience entrenched in the story and set a truly scary atmosphere. This is what was not there in the new twilight zone. Rod serling coming in added to the scariness, forest coming in lightened the mood. The ending whether good or bad made for a scary time. You could never predict what was going to happen. I am still trying to find the seasons on DVD.","But the show has nothing on the original. While the original may have been low-budget and often hokey, it always held the attention. It also was notable for adapting several popular sci-fi stories of the era. The new show appears slightly higher in budget, but often the episodes run out of gas long before they should. The show sports some familiar faces (C. Thomas Howell is an example) but it is not presented with the intensity and passion of the original. At least there are a lot of episodes to sort through, as this version was on the air considerably longer than the original. OK for a very slow Saturday night, when you need something to put you to sleep.","I know a lot of purists out there hate the new version of The Outer Limits but you know, sometimes you just got to go with the flow.  There are some episodes of the original that can never be out done and the same with the new - The Down To Earth episode of the new TOL is one of those - the scene between Colin Mochrie and C. Ernst Harth in the diner one of the funniest I've seen in a long time - the whole episode was comedic and when you think about it, not really such a far stretch of the imagination.","\"Think like a Dinosaur\" was an well-produced & executed show of the -Outerlimits- series. The actor (Enrico Colantoni as Michael Burr) plays an impressively well and convincing protagonist-role. You can actually identify yourself with him and his 'introspective' feelings on what to do to the girl whom he has fallen for (because, he's been alone and disappointed for 2 years and feels hopeless until \"Kamala\" comes to his life with a timid fear of performing the task of being transported. He then consoles her and let's her know it's all going to be alright; which ends up being an deception to both of them. More so something bad occurs and she (prototype) comes back....and her (clone) is sent to the other inhabitant planet. Although, the -Dino- and \"Micheal\" have yet to find this out, when they do it's up to Michael to decide to either kill her or to let her live. Yet what happen to him prior upon meeting her (kamala) was very much related to what happen to his wife, his wife died similarly. This show professes irregularity and sorrow thru-out most of it. After the show you're left pondering...about what SHOULD have been done and you're stuck with the 50/50 of what's right from wrong. Hence, The \"balance\" equation being solely there is no one.10/10 Highly recommend watching this show.","I would give this series 20 stars if I could! It is unbelievable how much of the science and technology stuff they showed in the episodes back in the mid-90s to early 2000s, is now an everyday reality. Cyborgs, androids, Artificial Intelligence, brain transplants, cloning, mutating viruses, nuclear fallout, genetic engineering, alien DNA transplants, gene therapy, memory transplants and implants, ESP,discovery of new planets, brain-to-computer chip transfers, extinct animals and gene resurrections, nanobots, evolution/reverse evolution, frisky aliens, you name it, and there is an extremely interesting and realistic episode pertaining to it. These were scientific cautionary tales, for technology having gone awry, and each episode had a moralistic/introspective narration at the beginning and the end that posed these ethical and moral questions. Simply outstanding!","It's a revival of the old series from 63 to 65. It's similar to The Twilight Zone except the stories are sci-fi based. It's mostly technology and aliens. It's not all an anthology show. Sometimes there are sequels to some episodes on a later date and some clip shows that tie some episodes together in the same world.I don't like the clip shows. It feels like a waste of time. It's not good as a highlight show and it's unconvincing creating an unified world. And it's not a minor problem. There are quite a few of these shows and I have to downgrade the series from 7 to 6. I really like quite a few of these episodes. Some of them are not particularly compelling. It's also good to see some stars doing work when they're not as well known.","There's no point in comparing this with the original series. Though different in look and content, both are true to the original idea. That is, an SF/horror anthology series. Due to indifferent scheduling in Australia, I've only managed to catch a small number of episodes spread over the first few seasons. The very first episode really did give me the creeps (nightmares at my age ...!) but a number of others did fall flat; generally when the stories moved into horror realms and away from SF. I only hope the DVDs reach us eventually.","This Television Anthology program is that rarest of things, a tv program with no flaws whatsoever! Fine acting, great writing, wonderfull art/effects. The Outer Limits, the new version, is far and above, much better than the original series. which can only have a certain, \"antique\" quality when compared with this most excellent series.","people, get a clue! I mean, the writers dont have one, so I would expect you to...this show is SUCH a pale imitation of the '60 show that you can laugh at it!  and the sixties show is the one with the cheap special effects, and is in B&W fer Chrissakes! Yet the mood and the writing on the old show is MILES ahead of this drivel. Get HiP kids! if 98 Degrees or Brittany told you to watch it, you would! You know it! Just bypass them and tell all your friends you were 'IN' with the 'scene' BEFORE it became too cool!","The show is great I enjoy watching it Its like The Twilight Zone and Twilighted Side they all have the same idea. With Space Aliens Monsters Zombies. One of The Outer Limits show showed this man he got sent to prison and while he was in his cell the man next to him started talking to him when he got released from his cell there was nobody in the cell next to him. Another story is about A Witch who gets fat by eating she eats and eats and she explodes into seven witches all seven inches tall all the same existence of the witch. One witch says where is Johnny? the second witch says Where is Mike? the third witch says where is all the food? the fourth witch says Where is all the weed? The fifth witch says Where is all the booze?"],"review-user":["GeoData","severe_td","Syl","mtricoci","grisslemcthornbody","stevewest-1","liberalgems","Nathanel","NeverAgain85","hellraiser7","ShadeGrenade","Nick Zbu","Minerva_Meybridge","ryon-2","bregund","Big-jayman","ctomvelu-1","lea-1","memez","fuadkhan2002","SnoopyStyle","opsbooks","zog-3","seashellz","msudore"],"review-date":["11 November 2003","10 October 2003","14 January 2010","14 May 2005","19 April 2009","12 December 2004","25 August 2012","19 April 2003","22 May 2009","7 March 2014","17 September 2006","11 May 2001","26 October 2005","10 October 2004","20 February 2004","12 September 2008","10 November 2008","20 July 2001","23 July 2006","15 January 2018","12 June 2015","8 April 2003","30 April 2002","14 May 2001","27 April 2011"],"review-rating":["10","8","8","10","5","10","9","6","9","6","10","10","6","10","1","10"],"review-title":[" Well done intelligent Sci-Fi Anthology\n"," Excellent series - for the most part\n"," More Character and Story Driven than Star Driven!\n"," simply one of the very best shows in existence\n"," What a ride!!\n"," Wildly Varying in Quality\n"," Four of My Favorite Episodes and Two of The Worst!\n"," Think like a Dinosaur\n"," Well thought out, Highly defined Sci-Fi Show, I love this\n"," Stretching Imagination\n"," We Can Deluge You With A Thousand Channels\n"," Bland.\n"," Uneven, Doom and Gloom Series\n"," A Sad Commentary On Our Times\n"," A pale imitation of the classic original\n"," Scary and brilliant\n"," Watchable in part\n"," Everything old is new again?\n"," \"Think like a Dinosaur\"\n"," The Best Sci Fi Series Ever, Period! ( Portends The Real Future)\n"," some great episodes but hate the clip shows\n"," More of the same, but different ...\n"," Impressive!\n"," Big budgets and CGI do not a program make...\n"," Outer Limits\n"]}