{"review-url":["http://www.imdb.com/title/tt0109180/reviews"],"review-text":["How many times did he jeopardise his family by aggravating Duncan? If he had just gone along with him from the start they'd all have dug their way out relatively easily. Instead their persistent Hassling of the Hoff only served to rile him more. He might have been a nutcase but he would have had no reason to harm the family if they had gotten out and would probably have felt fondness for them if they'd both saved his life and helped him regain his fortune. Instead the father begins to get suspicious before suspicion was justified. And why would the daughter say she didn't trust him after he'd submitted his gun to Brian? if she were to be suspicious of everyone who had a gun, she'd be suspicious of a pretty high percentage of Americans.And the scene at the very end with the bloody jeep was the most irresponsible thing I've seen a supposedly heroic parent do in a movie. The chances of them getting out of there after he'd collapsed the whole bleeding cabin on top of their heads were negligible. It was a complete fluke that the son found them as he did.","I had the misfortune of seeing this crapulous effort on television a few years ago. Suffice it to say Michael Gross phones in his performance, and Hasselhoff is the least convincing thief/psycho...EVER! If you have a couple of hours to kill, watch it and prepare to laugh.","This is a made-for-TV thriller starring Knight Rider star David Hasselhoff as madman Duncan Snyder, who crashes into the Rockies, produces an avalanche and gets the Kemp Family trapped inside their house with him.It is notable seeing the Knight Rider hero playing a nefarious villain, terrorizing a quiet family and forcing them to help him find jewels in the mountains. It is pretty exciting to see how the Kemp Family attempt to get themselves out of Snyder's trap.The acting was so-so, pretty campy at times. But, the plot is fast-paced and full of suspense - from the avalanche to the fight for survival. All in all, not a bad TV thriller.Grade B-","**SPOILERS** Mind numbing thriller in the wilds of the Alaskan wilderness has Brian Kemp, Michael Gross, and his son and daughter Max & Dee, Myles Ferguson & Deanna Milligan, trapped in their cabin under 30 feet of snow. The three end up being terrorized by this maniac Duncon Snyder, David Hassilhoff, who's off-the-wall actions were responsible for the mess that they all, including Duncon, where in by being trapped and in danger of freezing to death under a mountain of snow.Only worth watching for Hasselhoff's incredible performance that has to go down in motion picture history as one of the most outrageous portrayal of an obsessed and out of control lunatic ever put on film.Taking off from Russia with a load of cut diamonds worth millions Duncon after gunning down the Russian Major, George Joseph, who tried to double-cross him, which was understandable, later shoots his partner Whitney (Dons Davis), while in the air over mountainous Alaska. Whitney who saved Duncon's neck by risking his life flying him out of Russia and preventing Duncon from facing a Russian firing squad or a lifetime stay in sunny and beautiful Siberia got just what he deserved by trusting a lunatic like him.Duncons brainless action in gunning down his partner and then having the plane crash into a snow-covered Alaskan mountain range cause an avalanche that almost cost him his life and lead to Duncon being rescued by the Kemp's, Brian Max & Dee, whom he dropped into their snow-covered cabin frozen stiff and almost dead. Brought back to life by the kind-hearted and caring Kemps Duncon instead of being grateful in them saving his good for nothing life instead tries to manipulate them into digging the wrong way out of the snow covered cabin, down instead of up, in order to find his stash of stolen diamonds, that he hid in a camera. Eager to get his hands on the hot ice, diamonds, Duncon plans to murder the Kemps and take off after he finds them. It takes a while for Brian to realize what a dangerous psycho this Duncon really is as he started to notice one or more looses crews, in Duncon's head, out of whack but by then it was almost too late for him as well as Max & Dee to stop the wild and crazy guy.Avalanche is one of those movie that you just can't turn off, no matter how bad and ridicules it is, with David Hesselhoff not knowing just what he's supposed to be or do in it. At one point in the movie I thought that Hesselhoff had so much trouble keeping a straight face acting, either like a deranged psycho or a mentally challenged Forrest Gump-type, that he must have been hypnotized like the claustrophobic Bela Lugosi was, in his being locked in a closet episode in \"Black Friday\", so that he wouldn't crack up and thus blow the entire scene!I have to say that in this movie I was in a way rooting for the bad guy, Duncon Syndner. Duncon who besides being completely out of his bird took about the worst beating I've ever seen anyone take, and still survive, in a movie and that includes the indestructible Jason in all of the more then half dozen Friday the 13th movies that he was in. I know millions of bad movie lovers, like myself, hope and pray that Duncon or David Hassehpff would somehow come back, from the frozen dead, in a sequel to entertain us for just one more time!","Dear Lord, this was terrible.  And I'm not blaspheming.  The constant messianic imagery invoked by Hasselhoff's character is just unbearable. He is raised from the dead, crucified, pierced through the side, and on and on. Meanwhile, there is blatant sexual tension between Michael Gross and the daughter, Dee.  \"I'm comin' baby,\" says Gross.  Later, she is heard to say, \"You just can't do it anymore, Dad.  You just can't do it anymore.\"  Give me a break.  There is no sense of space in the entire opening sequence, and the plot goes nowhere.Don't read on if you don't want a spoiler.  I need it for rhetorical effect only.  It is my hope that you will not see the film, though the only reason you would probably be reading this is if you have.  Either way, you probably won't mind the following spoiler.Tragically, they all get out of the avalanche at the end, although I think they kill Hasselhoff but he'll probably just be raised from the dead again. Don't see this horrible picture.","*may contain spoilers* In snow mountains, a helicopter pilot crash causes accident avalanche. Trapped family in log cabin rescue pilot and together inside, pilot and family try to survive. Baywatch and Knightrider star David Hasselhoff stars against type as unhinged thief pilot duncan. A father and his two children are trapped together with mystery trapped survivor stranger duncan. At start duncan seems sane and helping family but becomes increasing suspicious acting as family think of how to get out of avalanche. The father becomes frustrated with duncans behaviour but worse things then as duncan becomes violent especially to father and family struggle to shake mad thief off. Boy and girl try to protect father from duncans physical abuse. They are under pressure as father unable to help against duncan. The film is an enjoyable TV film and father role and duncan role are good cast. The film has suspense.","I saw this on Lifetime a few days ago, since I remembered seeing the preview for it back in '94. I never got to see it though.Well, 10 years later & I finally get to see it. Its pretty decent for a made-4-TV movie. The cast is good, well, Mr. Hasselhoff seemed a bit off. He had that cool killer stare, but he's not much a villain. He was still an evil, evil man. I got a good laugh out of it.David also seem to have that Fri. the 13th/Jason syndrome in the movie. HE JUST WOULDN'T DIE!! I would have died laughing, if in the end, the camera pans down to the snow & we see a David's bloody hand come out from the snow & we hear him scream, \"BRIAN!!!\"Brian was played by Michael Gross, a very good actor. I've enjoyed him from the TREMORS movies.I say, this is worth seeing just to see David Hasselhoff ham it up as the villain after his precious jewels. I should try to find a copy of this on Ebay, hoping its available in America on VHS or DVD."],"review-user":["zacneeds","danielsan128","OllieSuave-007","sol-kay","Plotner","vvjti","moviecollector"],"review-date":["2 February 2008","5 July 2002","24 January 2015","2 February 2007","11 January 2001","31 August 2009","22 October 2004"],"review-rating":["1","7","5"],"review-title":[" Brian was a complete retard in this film\n"," One for the 'so bad it's good' file\n"," Not a bad TV thriller.\n"," Snow Job\n"," God-Awful\n"," a lot fear\n"," It wasn't that bad\n"]}