{"review-url":["http://www.imdb.com/title/tt0187844/reviews"],"review-text":["It's not easy to explain the charm of something utterly original without resorting to worn-out labels and clichés. But since it's one of Farscape's greatest strengths to take a cliché and wring its neck til something totally fresh drops out, I'll apply the same technique, here.Imagine a show which starts like Buck Rogers with brains... for 7 minutes - until it slams you head-on into Star Wars for grown-ups... dips you into shrill comic book SciFi images and jumbles 'em up til nothing - absolutely NOTHING - is left of the drab TV SciFi routine we're used to since Kirk wrestled his first rubber-suited monster in 68. Trekkies, Gaters, X-Filers... yes, even some Babylonians will absolutely detest this show. On the other hand, people who loved such diverse movies as Dark City, Clockwork Orange, Brazil, Blade Runner, Dark Crystal, Excalibur or even Fear & Loathing In Las Vegas will love this show. This is SciFi with a very small Sci and the biggest Fi for bloody decades. LEXX only tried and failed to be what Farscape accomplishes with ease and VERY unusual grace for TV standards.General pace and atmosphere are almost the anti-thesis to shows like Star Trek and Stargate, which suddenly seem extremely sterile, well-mannered, insufferably prudish and politically correct.Imagine Jim Henson & Frank Zappa, young George Lucas and Terry Gilliam doing a pilot for an SF show, and you're getting pretty close to what awaits you on this show.Visually, this show is classes above the competition. Technology is only the brush in a painter's hand. What you DO with it is what counts! And there, Farscape far exceeds the limitations of its comparatively small budget.Sticklers for scientific possibilities will hate this show..., but fans of visual storytelling and the sheer joy of 'play' will adore it. In some respects, it's outrageous Fantasy in SciFi clothing.The acting is easily the most fresh piece on the US TV menue. No wonder, though, since only the lead is American, and in this case very much and rightly so, which gives Ben Browder's superb work a new and highly enjoyable angle. (Your proverbeal Regular US Guy lost in space amongst the weirdest collection of Aliens constitutes the basic concept of the overall plot) It was a stroke of genius to leave all others to their own accents and acting styles. (mostly Australian, British and Kiwi) To call the general style of acting, editing and 'pacing' on this show only refreshing, would constitute the understatement of the decade. All genre trademarks aside is the acting of an unusually high standard, but almost reckless towards the codes of 'proper' TV acting. MAJOR discovery of a formerly hidden gem: Claudia Black as Aeryn Sun.Having said all this of course includes the foregone conclusion that it's purely a matter of taste, in the end. But anyone game for an extremely enjoyable rollercoaster ride on the stilted clichés of SciFi is in for a hell of a journey!\nWhich reminds me, the UK DVDs (PAL) are easily the best TV releases in picture and tone quality I've encountered. The Stargate DVDs, for instance, seem like a grainy insult compared to those.\nUlrich Fehlauer","What can I say? It starts off great and ends great. The script is simply great and starts the series off with a bang. The characters are unique and intriguing. Special effects, from the space battles to the creatures, rock! Basically, this was an excellent beginning to a excellent show.","It's been a long time since I've seen a show that you can actually tell that the actors enjoy working on it.  I know it's not rocket science, no pun intended, but this show is fun.  I enjoy the writing, it is intelligent and witty.  I enjoy the banter between the characters.  It seems that some of the best new stuff is coming out of Australia.  And believe me, it's welcome.","Somehow, I missed many of the early Farscape episodes, so I'm seeing them in all sorts of orders as they are repeated on various channels. I first caught it - entirely by accident - whilst lounging in a hotel room. The first 10 seconds had me completely hooked - THIS is what SF is all about.The characters are strong; and Moya/Pilot the living ship is what Lexx should have been. The plots vary in quality, but none falls below excellent in my opinion. And I have to mention Rygel - what a gloriously irreverent character! None of your smarmy sugar-coated Star Trek aliens here, this is the real deal - cynical, self-serving and replete with disgusting personal habits, Rygel is the creation of a genius.Last week the SciFi channel showed \"Out of their minds\" (the body-swapping episode). A true classic, I couldn't stop laughing from start to finish...Long may Farscape grace our screens!","Not many television shows appeal to quite as many different kinds of fans like Farscape does...I know youngsters and 30/40+ years old;fans both Male and Female in as many different countries as you can think of that just adore this T.V miniseries. It has elements that can be found in almost every other show on T.V, character driven drama that could be from an Australian soap opera; yet in the same episode it has science fact & fiction that would give even the hardiest \"Trekkie\" a run for his money in the brainbender stakes! Wormhole theory, Time Travel in true equational form...Magnificent. It embraces cultures from all over the map as the possibilities are endless having multiple stars and therefore thousands of planets to choose from.With such a broad scope; it would be expected that nothing would be able to keep up the illusion for long, but here is where \"Farscape\" really comes into it's own element...It succeeds where all others have failed, especially the likes of Star Trek (a universe with practically zero Kaos element!) They ran out of ideas pretty quickly + kept rehashing them! Over the course of 4 seasons they manage to keep the audience's attention using good continuity and constant character evolution with multiple threads to every episode with unique personal touches to camera that are specific to certain character groups within the whole. This structure allows for an extremely large area of subject matter as loyalties are forged and broken in many ways on many many issues. I happened to see the pilot (Premiere) in passing and just had to keep tuning in after that to see if Crichton would ever \"Get the girl\", after seeing them all on television I was delighted to see them available on DVD & I have to admit that it was the only thing that kept me sane whilst I had to do a 12 hour night shift and developed chronic insomnia...Farscape was the only thing to get me through those extremely long nights...Do yourself a favour; Watch the pilot and see what I mean...Farscape Comet","Well how can I categorise Farscape without resorting to gushing superlatives?  Ok, here goes!  The scripts are fantastic, with each episode offering so much entertainment, drama, humour and sheer watchability.  The casting is perfect especially that of Zhaan (the blue lady) played by Virginia Hey, each character has a depth that just isn't there on the Star Trek series.I think having an Australian spin on the show makes this for me, Australia has been knocking out quality films for years and Farscape is no exception.I have only seen the first four episodes in UK order and they have a quality that makes each 45 minute show (in the UK) stand out more like a film than a weekly TV series.The episode that really does it for me is 'I, ET' which turns the alien concept around where Moya (a living ship, even the spacecraft has a great character) is forced to land on a planet that has yet to make 'First contact' and is surprisingly earth like and Crichton meets a radio telescope operator and *he* is the 'little green man' to them.   Gripping stuff.In short the effects are great, the scripts are top quality and the main characters (not one of them really given any more importance than any other) are interesting, not always 'good' and well just excellent.Roll on the second season!","This is perhaps the television series with the greatest potential of any series around.  The production values are in a class of their own.  The characters are rounded and interesting.  This is entertainment at its best. Some of the aliens are quite grotesque, but there is an underlying humour which makes it unmissable.   I hope that this series goes on for many years and will have many spin-offs.  Science Fiction has had its bad press, some justified, but this is truly a flagship science fiction series and I thank Henson for it.  Top marks.","I will probably watch the rest of this. More than likely due to the show's use of induction visuals accompanied by water-fall subliminal messages: \"You love this show. You will watch this show every week. You will tell your friends how great this show is.\" And they would have had to induce people: the story gets off to a rickety start; not pausing to build a believable main character. Was it really all that necessary to have a fighter-jock-non-geek-scientist? I think things would have stayed interesting if he had been just a stick jockey OR a complete nerd. As it was I never believed him.Which is probably why dialog gems like: \"I wasn't just any anarchist, I was a leading anarchist\" made it into into the shooting script. Can someone tell me how an anarchist would be a self-proclaimed \"leading anarchist\"? If they are a proponent of anarchy, wouldn't they understand that \"leadership\" would necessarily be eschewed? So how are they a \"leading anarchist\" if they don't even understand what anarchy is? Okay. I'm being a little too critical. I just found it rather funny. Maybe I should give the writer credit for humorously creating a universe contradiction singularity?","In Canada, 'Farscape' is only aired on the children's television network, YTV, which has alienated many science fiction fans.  I feel that this does not do the show justice.  Excellent characters made real by near perfect (if not necessarily brilliant) acting, high quality special effects, and exciting plots come together to make one of the most exciting science fiction series of it's kind in a long while.  If they were to kill off a permanent cast member this season, I would actually be upset, as opposed to a 'Star Trek' series where I constantly find myself wishing the annoying characters to die.  I rate it highest in terms of atmosphere and makeup; it's been a long time since a mainstrean show maintained as much power to frighten me, and the use of Jim Henson's fabulous puppets and the amazing alien makeup jobs put the show's realism in another level entirely from the pitiful aliens of 'Star Trek.'  So I'll continue to watch 'Farscape'; it may be on a children's station, but it's still infinitely better than 'Lexx,' 'First Wave,' 'Stargate,' or any other of the pathetic sci-fi offerings this decade.","I heard about this series in 2001 which a friend of mine was recording off the television each week. I never bothered to watch though I became acquainted with the series through the magazine which I looked at every now and then in bookstores. I recently purchased series one on DVD and have become addicted to this fascinating and original series. The characters at first seem unlikeable but it is amazing how fast they grow and develop into a united force. As they begin to care for one another it becomes easy to care what happens to them (bearing in mind that this is only a TV series and they are fictional).However it isn't the PC world of Star Trek and so whilst every character shows a good trait they each have their own flaws and demons that they must deal with. Indivual story lines mixed in with an overall multiple story-arc make this one of the most complex and rewarding television experiences I have ever had the pleasure of viewing. I absolutely enjoy watching each of the characters interact with one another.This strange new world we are introduced to is brilliantly portrayed through the eyes of astronaut John Crichton and as he learns and adapts to being on the other side of the galaxy, strange alien creatures, different cultures, being hunted by a character that wants him dead and being treated as inferior by his comrades we can easily relate to what he must be feeling. As he becomes used to his surroundings so do the viewers and his compassionate, strong-willed and brave character is a joy to watch.I have watched only seven episodes of Farscape season one and look forward to continuing through seasons two-four and the mini-series. Maybe one day we can all enjoy a season five. Highly recommended viewing and well worth setting time aside to watch. Buy and enjoy! 10/10.","I think that FARSCAPE is the best scifi since Babylon 5 and is one of the best sci-fi television series of all time (ranking up there with Dr. Who, Blake's 7, Red Dwarf, MST3K and the aforementioned B5). I find the characters and races of Farscape are much more interesting and imaginative than the typical \"humans-with-birthmarks\" that are found in many series. The effects are quite good and the stories engaging. Despite missing the bulk of season 2 and some of season 1, I find the character development very well done.","Watching this series will probably make you feel like how our parents felt when watching Star Trek for the first time.This series has it all. The kind of stories that makes you forget how to blink, the kind of characters that makes you want to jump into the TV to join the action, and the kind of atmosphere that makes your hair curdle in awe and endless admiration.In short, we start out with John Chrichton, an astronaut, who gets shot into a wormhole and ends up with a gang of prisoners on the run from the badguys in black, ironically known as Peacekeepers.Other colorful characters consists of D'argo, big dude with a short temper and a sword/laser-rifle. Aerun Sun, former peacekeeper and a Ph.D in buttkicking. Zotoh Zhan, who's a plant. No really, she is. She's also a priest, but with a mean streak. There's also Dominar Rygel XVI, an fat lazy bastard who farts helium and generally does more harm than good.Later in the series we meet the most sexy alien that has ever been on television, namely Chiana. A young and seemingly chronically horny Nebari. She is played by Gigi Edgley, which is a name you should remember.\nOne of the many things I love about these series is that since John Chrichton ended up in this part of the galaxy by mistake, he keeps giving references to \"Real Life\". Namely, when John is having a bit of difficulty accepting the fact that he will be frozen as a statue for 80 years, one of his many complaint is that when he returns, Buffy The Vampire Slayer will be dead.So Frell all the other series, get your Dren together and spend an Ahn on one of these episodes. I can assure you, Sci/Fi as you know it, will change forever.This series has it all. It's sexy. It's actionpacked. It's hillarious. It's Farscape","When this series first started, I actually found it very engaging. The first season was very well-done, with a lot of good episodes strung together. The second season started out okay, but towards the end, you could see that the writers were starting to forget what they were trying to achieve.The good side: Engaging characters (at least in the beginning), and an interesting premise. Star Trek meets the Fugitive. Excellent puppeteering and good makeup. The lead, Ben Browder, is an excellent actor, and the female lead, Claudia Black, is also good. The first season was a standout season, which isn't the case with many shows, which improves over time.\nThe Bad: As I said, most TV shows improves over time, but Farscape seems to have gone the other way. While the First Season was outstanding, the second was mediocre, and now, Season Three has begun, and things could be a heck of a lot better. For one, interesting characters are killed off and annoying and utterly infuriating characters are introduced and apparently going to stay on. These characters, like the Jool and Rygel character, have nothing to contribute to the storyline or the show as a whole, but only exists to be utterly annoying and try the viewer's patience. (As you'll notice, it's tried this person's patience so much that he's stopped watching Farscape.)Another bad point is the meandering stories. Episodes are now going nowhere, with weirdness thrown in for weirdness's sake. Where Season One had a coherent story thread, and Season Two was also fine in this regard, Season Three is seemingly going for the \"weirdness\" factor, which, though not bad in itself, weirdness for weirdness's sake is just...stupid. The show no longer has any focus and even the familiar characters are being annoying and trying the viewer's patience. I could no longer stand it, and hence, have turned this show off.If they keep going in this direction, I fear what's ahead. But, hopefully, things might get better. Hopefully, but until then, I'm staying off the ship.","I remember ignoring the TV series when it first debuted because of its 'look' with the Jim Hensen muppets. However, recently a friend let me borrow his Farscape DVDs, and I am just now realizing what a terrible mistake that was. As with any TV series, there are episodes that shine and those that don't. I ride the adrenaline and emotional rush during the great episodes and suffer through the lackluster ones. However, I endure regardless because of the core storyline that ties all the episodes together. What I'm talking about is the growth of the main characters and their love for each other. Let me warn you, it is something that is absolutely irresistible to watch. I cannot recall any other TV series (Babylon 5, Buffy, Angel, etc) that smartly and intelligently put together such a heartbreaking (at times) and suspenseful ride.I think that at the end of the fourth season, things were finally becoming tightly focused and I am shocked at the decision to cancel the series. I wait anxiously for the release of the miniseries and invite others to discover this incredible gem.","***SPOILERS***The entire purpose behind any show is to grow and change into something that it wasn't when it first began. I got hooked on Farscape when I accidentally wandered onto the Pilot the first time it aired. I was a few minutes in but that was when Scifi had an encore of all the Friday shows on Saturday morning. I didn't understand then what had me hooked about the show -- all I knew was that I was, indeed, hooked. For life.It was new, it was engaging, it was delightful with a thoroughly entertaining type of humour and a singularly engaging sense of the ridiculous. Of course, I loved the puppets (but with the Jim Henson company doing them, how could you not?) but *all* the characters were wonderful. At the beginning they were flat and virtually emotionless but that is normal for both real life new acquaintances as well as on TV. But then they get to know each other and as they get to know each other they begin to change, both as a direct result of getting to know each other and because of the things they get into as a result of meeting each other.John Crichton (Ben Browder) is a would-be hero who thought himself in his father's (famous astronaut) shadow. Then he gets the chance to go into space and gets launched through a wormhole. All of a sudden he's so far out of his father's shadow that he has no idea what to do with himself. So, while the mini-tapes last, he records his thoughts and feelings onto them as if he were talking with his father. Then he discovers he's being chased by an insane captain named Crais (Lani John Tupu) who has a personal vendetta because John got into a...spaceship accident when he landed on the other side of the wormhole. He's a Captain of the Peacekeepers who just happen to have this thing about intense racial purity. So, when Aeryn (Claudia Black) happens to get sucked in with Moya's crew, she gets branded irrevocably contaminated by Crais, she sticks with Moya. Originally, merely because she has nowhere else to go -- being a Peacekeeper is all she's ever known -- then, however, is when change comes in. Every single character has grown and changed over the last four years to become all the more likable. Even the most annoying characters (Rygel, Jool and most especially Sikozu) have changed and grown to become something more. It seems to be a habit with Moya's crew -- they've changed two big bads over to their side, even if somewhat reluctantly.And they've added wonderful characters along the way. Chiana (Gigi Edgley) was a gorgeous temptress who had a dark past with a dangerous secret and a connection to another universal power (the Nebari) but then isn't found out 'till later. (A Clockwork Nebari) Jool (Tammy McIntosh) was probably the most annoying character to ever grace the show...but she ended up being fun and a lot more tempered by the time she left Moya. And Sikozu (Raelee Hill) was all books, no common sense. Ironically, it ends up being Rygel who takes her down a peg by telling her that he was centuries older than her and what he had learned the most was that he knew virtually nothing. (It sounded better out of Rygel's mouth)Each episode was an enjoyable storyline in and of itself, but virtually all of them had a continuous arc. Some of the story arcs started in the early first season and still hadn't been closed at the end of the fourth. Some lasted through the season and finished when the season finished but they were all delightful.When the Scifi Channel cut it off after the fourth season, they angered a lot of people. They gave a multitude of reasons for the cut-off, none of which were truly valid. When they finally decided to get it together and make the mini-series to close out the story lines, the fans were ecstatic. At least now, we can get some closure.If you haven't gotten Farscape yet, I suggest that you find some way to watch them all. I have never gotten into any show the way I got into this one; don't ask me why, it could be any number of things. The stories, the characters, the actors, just the all-around cult-likability of it, I just don't know. Whatever it is...it worked, and I truly am ridiculously, preposterously, deliciously, delightfully hooked for life.Wickedness","My wife and I saw every episode in this series and loved it. However, the series was cut short without a final episode by the producers of the show. It ended with a typical end-the-season cliff hanger leaving it's fans feeling cheated. A waste of great writing and acting.","Having watched the show for about four weeks, which is enough to get a feel for the show, I think it shows potential. Whilst much is borrowed from other shows (what sci-fi doesn't these days), and the characters are stereotyped, I like what they are doing with the stories. There is some continuity with plot development and character interaction/relationship building, despite the essentially modular nature of each episode. There have been some science related topics explored as well as character secret/weakness revelations. These have also added some comedy to the show, something I would gladly  see more of in \"serious\" sci-fi. In all, this makes for good balance, such that can appeal to larger groups of people, unlike the Star Trek vs Babylon 5 debates I've been numerous participant and witness to. The visual aspects of the show are more than adequate, and well budgeted for a first season. The acting is acceptable, and I am curious to see how well the actors manage to grow their characters out of their scripted stereotypes. I see enough positives and potential to remain interested in seeing where the show wants to go...","I'll admit that the first time I managed to catch Sci-Fi's \"Sci-Fi Prime\" was last week, but despite the fact that I was a huge Sliders fan coming into the experience, Farscape is now easily my favorite of the four shows.Unlike most modern Sci-Fi shows (including, regrettably, the two new Star Trek series), this show manages to be fun without coming across as fodder for MST3K.","I must admit, at first I was worried about Farscape. The opening segment was not very strong, and I began to worry about what was to come. However, once it set in to familiar Henson territory with the wry sense of humor, the unique and enduring characters, and the compelling story combined to create an excellent piece of science fiction. The story follows John Crichton (played by Ben Browder) a scientist who has developed a spaceship and theory that rely on slingshot propulsion. However, during the first test, his craft encounters an unknown magnetic field, and he is propelled into an unknown galaxy, where he finds himself in the middle of a struggle between escaping prisoners (on the starship Moya) and the Peacekeepers (human enforcers). He is quite literally drawn into the prisoners ship, and after many twists and turns finds himself united with the prisoners (Ka D'argo, a Luxom warrior; Pa'U Zhaan, a Delvian priestess; Rygel XVI, a deposed ruler; and Aeryn Sun, a Peacekeeper who has reluctantly joined the crew). With excellent special effects, moderate make-up, and puppets and robots that exceed the Henson standard of perfection; as well as a very well written story, and character driven plot, FarScape looks to be a fantastically original, creative, and clever science fiction series.","i happen to love this show. Its a refreshing take on some older sci-fi feels and styles. they aren't afraid to shoot, and when they do people tend to die. Far too many show's are afraid of this and end up just pointing the guns and then having it be a standoff. Farscape also comes complete with a large amount of heartwarming characters. They all grow on you till the point where it confuses you to hear them discuss taking some of the animatronic ones out of their box's to make the mini-series. From beginning to end farscape leaves you with a feeling of hope, and dispair, as new and unexpected things happen and then people live and die, surprising you every time. Worth a watch even if you don't have the time.","Farscape is the best sci-fi on tv at the moment.Intelligently written,with great plots,brilliant characters and amazing effects,FARSCAPE REALLY IS THE BEST THING ON TV AT THE MOMENT. Whens the last time you seen a sci-fi programme that treats its viewers like intelligent people,not just morons who will watch a programme with some pretty effects?.Farscape has gone from strength-strength,and is a worthy successor to Babylon 5's title of Best Sci-Fi on TV.And its australian to!!,that country really is putting out great tv and films recently is,nt it?!","After 2 years of using this site for movie reviews, I finally registered with IMDB just so I could give Farscape a \"10.\"  The show's writers, cast and crew have proven themselves the unambiguous masters of the science fiction genre.  Even those who do not normally appreciate sci-fi should be encouraged to give this exceptional series a chance!Farscape's virtues are simply too numerous to list, but one of them stands out above all; the quality of the writing is amazing. I haven't heard dialogue this good since \"Blake's 7.\"  In fact, Farscape feels a lot like a \"Blake's 7\" with good special effects and a bit more romance.Everyone, enjoy!","Not since J. Michael Straczynski's Babylon 5, has a television show captured the wonderful art of applying a story arc to a television show.  This is easily the best thing on TV right now!  The characters are likable and one can easily get attached to them and care for their well-being.  The villians are the type you love to hate and leave you wondering what they're up to next.  And Brian Hensen's puppet work is the most innovative out there. Kudos to Rockne S. O'Bannon for a job well done!","When I saw this series advertised, just before it first aired, I initially wrote it off as 'Muppets in Space' but decided to watch the first episode anyway; I'm glad that I did as I soon realised I'd misjudged the series; it may have been made by Jim Henson but it was clearly aimed at an older audience.This opening episode sets up the premise and introduces us to most of the key characters. The protagonist is American astronaut John Crichton; he is involved in a test flight to prove a new craft that uses the Earth's gravity to slingshot it away at high speed. Something odd happens though and he enters a wormhole that takes him to the other side of the galaxy. When he emerges he is in the middle of a battle where a large ship is under attack. He is pulled aboard that ship and learns that it is under the control of escaped convicts who are trying desperately to release the ship's control collar and escape. When they do escape they bring one of the attackers with them; a woman named Aeryn Sun who unlike the rest of the crew looks human.The ship is Moya and she is alive; controlled by a being known only as Pilot; her crew of escaped prisoners is comprised of a blue priestess named Zhaan, a large warrior named Ka D'Argo and Dominar Rygel XVI, a deposed emperor. John and Aeryn are initially treated with suspicion although it looks as though they will live or die together as Aeryn can't return to her people as she is now considered contaminated. Her people are the 'Peace Keepers' and one of them, Captain Crais, has made it his mission in life to kill Crichton because he holds him responsible for his brother's death.This opening episode did a fine job of introducing the main characters and their situation. The acting from was solid throughout, even from the puppet characters! For a show made over ten years ago the CGI didn't look too bad; it might not have been as good as the latest Hollywood blockbuster but it was still decent and didn't have a video game feel to it. The way they got round the problem of his understanding aliens by using 'translator microbes' may be as far fetched as using a 'babelfish' but it quickly solved the problem without spending an excessive amount of time explaining something that isn't that important. The characters are varied and interesting; some seeming dangerous, others mysterious and others comically. When I first watched this series on television I really enjoyed it and now I'm looking forward to watching it again on DVD... seeing this opening episode again reminded me just how good it is.","When I first saw the Premiere Episode of Farscape, I had no idea what to expect. I was immensely impressed and satisfied with \"Premiere\". Subsequent re-watches, however, have made numerous flaws apparent to me that I missed initially. \"Premiere\" is not a great Farscape Episode, but it deserves credit for successfully and efficiently setting up the plot and giving the basic back stories to many of the regular characters.The episode begins with John Crichton (Ben Browder), an astronaut and scientist, preparing to launch into space in the Farscape Module, a small space ship perfected by Crichton and his friend DK. Crichton has a revealing conversation with his father, Jack Crichton, and then begins his test flight in space. Of course, everything goes wrong and Crichton is \"shot through a wormhole\" and winds up in \"a distant part of the galaxy\".After exiting the wormhole, Crichton's module is pulled on board a living space ship. From here, the characters and story line for the Farscape series are introduced in an entertaining albeit rushed manner.The regular characters are properly introduced during the first half of the episode. Of course, there is Crichton, played well by Ben Browder. He offers a the audience a sympathetic character to identify with. He's lost and has no idea how to do much of anything. In \"Premiere\", Crichton has to choose between joining the prisoners or the Peacekeepers. He knows nothing at all about either side, but in helping Aeryn (a captured Peacekeeper pilot) it becomes clear that he intends to help the Peacekeepers. He probably would not have ended up siding with the prisoners if it hadn't been for Crais, a Peacekeeper captain, declaring Crichton to be the murderer of his brother. This puts Crichton in an interesting situation: he's stuck with bizarre, violent escaped prisoners in a far-off galaxy about which he knows nothing at all. Crichton's total lack of knowledge of the Farsape world makes him a particularly interesting protagonist during Farscape's first season.The supporting cast is just as compelling. There's Zhaan, a blue Delvian and former prisoner. She's peaceful and reasonable, as opposed to fellow prisoner Ka D'Argo, a powerful and hard-headed warrior. Virginia Hey is totally covered in blue makeup, allowing her character of Zhaan to appear cool and convincing. D'Argo's mega-makeup, in contrast, is below-par. He looks kind of silly with his giant tentacles and strange nose, and there is something peculiar about his eyes. They look as if they have had some sort of allergic reaction to his makeup. Farscape would give some improvements to his makeup in Season 1, but the overall costume would, for me at least, remain as a problem until Season 2.The puppet/digital characters of Rygel and Pilot are, to put it simply, excellent. Rygel is a tiny Hynerian Dominar who floats around on some sort of hovercraft. In \"Premiere\" he is given some good dialogue but not much else. Pilot nearly steals the show as the liaison between the living ship, Moya, and Moya's passengers. Even in the first episode, Pilot gives off the appearance of being a real, living alien; he never once in the show seems to be a giant, expensive machine.The Peacekeeper characters introduced are quite interesting as well. The Peacekeepers are made up of a race called Sebaceans, who look just like humans. The chief antagonist is introduced in \"Premiere\" as Captian Crais, who believes that Crichton killed his brother. In reality, Crais's brother's death was merely an accident resulting from an accidental collision with Crichton's ship. Aeryn Sun, a pilot who Crichton helps escape, tries to explain that the death was an accident, but Crais just claims that she is \"irreversiby contaminated\" and refused to change his mind. Crais obsession for revenge, warranted or not (it should be clear to Crais that Crichton isn't responsible), is mysterious in \"Premiere\", but would be explained later in the season. Aeryn herself provides an extremely interesting character. By being forced to leave the Peacekeepers, she changes her whole way of life, and is in that regard in a similar (though less severe) situation as Crichton.The actual episode, as mentioned earlier, feels somewhat rushed and clunky. So much happens that not enough time is spent on anything. Also, D'Argo (for now) looks kind of silly running around in his mediocre costume trying to appear menacing. Still, \"Premiere\" is solid entertainment. The special effects (such as in the starburst sequences) are impressive. Most of the costumes and the sets on board Moya are original. Despite its flaws, \"Premiere\" is a must-see for Farscape fans. 3/4"],"review-user":["schogger13","Op_Prime","lje32677","AVickers","InfiniteInertia","aeronaut","zipit","xdor","xanada73","cyberman_scott","mozart827","praxiz","yojimbo999","markhu101","WickednessIsAMyth","joebart","Dirk-7","AbeJnkns","Armand-3","Longinus905","dusty_2002","csmith476","gaidheil","Tweekums","BSHBen"],"review-date":["3 July 2001","12 February 2000","5 April 2001","1 July 2001","5 January 2005","16 March 2000","23 September 2002","10 May 2014","20 April 2000","19 July 2005","2 February 2001","22 July 2002","20 April 2001","1 September 2004","15 August 2004","28 November 2003","11 April 1999","10 April 1999","20 March 1999","11 July 2005","19 April 2001","9 February 2001","26 August 2000","28 April 2012","30 March 2007"],"review-rating":["10","10","9","10","5","10","9","10","3","8","2","7","10","10","10","10","10","10","10","7"],"review-title":[" Pearls In Your Pocket!!\n"," Excellent start, excellent finish\n"," This show is fun!\n"," What SF should be\n"," Outstanding & Underrated show that re-defines Sci-Fi\n"," The best show bar none of it's genre\n"," Action-packed, funny, interesting, great special effects... refreshing!\n"," Heavy Sci-Fi Light-Weight Believability\n"," A real breath of fresh air.\n"," Addictive, brilliant TV series\n"," Love this show!!!\n"," Monumental Sci/Fi with an Attitude\n"," Good start, but has become awful\n"," A hidden gem!\n"," Ridiculous, Preposterous, Delicious, Delightful...\n"," Don't start on this series unless you to want to feel betrayed.\n"," Enough potential to keep me interested\n"," A lot of fun\n"," An excellent start\n"," loved it\n"," Best Sci-Fi since Babylon 5\n"," Incredibly entertaining...\n"," The Best Show on Television!\n"," The beginning of a great series\n"," Ambitious but Far From Flawless\n"]}