{"review-url":["http://www.imdb.com/title/tt0115195/reviews"],"review-text":["This is an exceptional adaptadation of the book.  An all-star cast which gives merit and worthwhile to the tv-film and Danson in his best performance yet as a sailor who becomes lost at sea, only to return some years later a different man - a man who has learnt alot of humanity in his journey's and a man casted as insane.Throughout the movie you don't know whether Danson's character is sane or not.  The amazing effects and direction make it a marvel to watch.  The all-star cast enjoy their roles to the hilt.The sequences within the asylum are disturbing, as are Danson's twisted hatred on humans, and what they have become.  And in some aspects the thought-provoking stories that Gulliver went through can still be adapted today.For example the \"we drink when we are not thirsty and eat when we are not hungry\" is a typically haunting line.  The social commentary which underlines the novel and indeed this film can still be used and adapted today.This is a thought-provoking, well made TV-film that is very enjoyable, and I recommend you watch it.My Rating: 8/10","Swift's writing really has more in common with Kafka and Orwell than with fantasy-adventure writers, so it's curious that Gulliver's Travels has been deemed a children's novel. Lucky kiddies!The same applies to this movie. There have been some really awful versions of this story, which must be why people are reluctant to look at this version. I mean, it's a TV-movie and it comes from muppetteer Jim Henson, so how should we expect anything but cuteness?Look again - beauty turns up in the oddest places. Children love this movie enough to sit through all three hours of it, but it also takes the time to get Swift's dark vision right. I hate special effects, but here they are used to carry the story forward instead of just dazzling us. Please note that the producers took the trouble to recruit classical actors like John Gielgud and Peter O'Toole who perform their eccentric roles with perfection.Dramatically, the romance between Gulliver and Glumdalclitch is rendered touching and poignant, as well as funny (she's a little girl, but twenty times his size). The frame-story has a theme about absent fathers that many children will relate to. And the part about Gulliver in the asylum introduces an element of horror dealing with the abuse of authority (apparently deriving from Val Lewton's \"Bedlam\" [1946], another forgotten masterpiece).The VHS is always turning up in the bargain-bin for a few cents, which is an insult to the many great artists who put this thing together. I encourage audiences to recognize a good thing by getting this movie and inspiring others to watch it. Although it has a lot to offer children, grown-ups will find that it stands up nicely to such classics as Aguirre, Brazil, 1984 and other serious fantastic works.Much of it was filmed in Portugal, I was looking up the various palaces involved- Sintra- -Monserrate(Laputa) -Queluz(Brobdingnag) -Ribafria Palace (Sorcerer's Palace, I think) -Castle of the Moors(Struldbrugs) Lisbon- -Ajuda(Burning Palace, Lilliput) Mafra- -Royal Palace and streetscapes (Lilliput) -Sea Cliffs (Brobdingnag and Lilliput) The Doctor's Mansion is obviously in the Cotswold limestone district... anyone recognize it? The final shot is modelled after the Paul Nash painting \"Landscape from a Dream\", surrealism seems right for a movie like this. www.tate.org.uk/art/artworks/nash-landscape-from- a-dream-n05667","This film is wonderful example of the quality dramas that Channel 4 and the BBC have produced over the years.  Ted Danson delivers a powerful performance of a man tormented by memories noone will accept, and a society that believes he is insane.  It is a remarkable performance by a man most known for his role in Cheers, a TV comedy sitcom. The supporting cast are all very well chosen, not least Mary Steenbergen, Danson's wife, who acts the part of Gulliver's wife in the film. But above all it is the seamless and very delicate shifts between our world and Gulliver's world that make this film.  The difference in perspective between giants and midgets, all acted by real actors is beautifully captured.  A rare treat of cinematography and direction.","We all know bits and pieces of Gulliver's travels. Tiny people, yeah, sure. Liliputians. Giants too, some of us may recall. Some might remember the word yahoo comes from here. That's were it stops for most people.Swift's book is omnipresent in school libraries. That's were i first read it, and there's were a lot of people read it for the last time. It is treacherously lightly written, like many of the old adventure books. Children can read it. Still, it's dripping with satire, black and uncompromising. That's something I think most screen writers forget when they adapt this movie.This movie remembers, however. Our hero, Ted Danson, gives a credible and serious performance as the world-adjusted man who's thrown to mysterious countries so like our own. Gulliver's travels criticizes everything. Theists, scientists, government, commonfolk, ethnicity, humanity itself. Few are spared, and most of the satire is just as fresh today.While very faithful to the story, the movie also dares adding new angles, all which work very well. The screen writer deserves all credit for managing to balance so well between time and activity(it's not boring, that is).Production values are way beyond a TV movie. With some marketing this movie would have done well at the box office. All of the fantastic worlds Gulliver visits are well-made, explained in detail and often very funny, much like Swift's book.Actors are all pros, since this is a British production. Mary Steenburgen stands out, along with James Fox's Dr. Bates, the chillingly cruel doctor who, much like nurse Ratched, only wants the patient's best.So, a modest proposal, if you ever get the chance to get this movie, do so. It's a real treat.","This has got to be without a doubt, the best adaption of Gullivers Travels that I have ever seen. It is visually stunning, with wonderful special effects (you really can't tell whats real and what's not now!) and a stunning cast. Ted Danson is perfect in his role of Lemual Gulliver, and he plays it with the right amount of emotion and anger. It enthralled me from the very beginning, from his first day back home, to the land of the Whinnims and Yahoos. And who can forget the frighting scene as the ill and blind but immortal women cry out 'You'll never die!' Although I have many favourite scenes I think my favourite is the court scene where Gulliver gets the upper hand. That scene is very exciting and tense and your rooting for him all the way. All in all wonderful stuff. Something that should be shown in school across the world, for there is a powerful message is it: Are we humans not simply just a race of Yahoos?..........","Ted Danson was a great choice to play Gulliver. Even though his background was mostly comedy, he shows here that he can do drama just as well or perhaps even better (though there is a lot of humour in this). Hard to turn a blind eye to his American accent especially since his character is supposed to be English but that's just a minor thing.All the villains are equally well cast: James Fox, Edward Fox, Peter O'Toole, Warwick Davis, John Standing, etc. Despite the fact that most of them are either tiny people or giants, they are 100% believable in everything they do and their motivations are very clear e.g. the Lilliputians' unremitting suspicion of Gulliver, Grildrig the (giant) dwarf's hatred of him for usurping his position as court jester, Dr. Bates' attempt to have Gulliver proved insane so he can marry Mary.Mary Steenburgen is great as Mary Gulliver (another 17th Century English character with an American accent but never mind). She is a deeply tormented character because she has been waiting nine years for her husband to return home and when he finally does, he is talking about tiny people, giants, a flying island and talking horses! Mary, despite the strong fantasy element in the story, is a very believable character.The special effects are breathtaking especially when you consider that it was filmed on a television scale at a time when CGI was in its infancy. It looks very realistic when we see a 6 foot tall man walking through a city filled with people who are 6 inches tall.The cameos are great as well: Omar Sharif, Richard Wilson, Sir John Gielgud, Kristin Scott Thomas, Ned Beatty. All great actors who create a strong supporting cast that complement Danson's superb acting ability.The Houynhnhms and the Yahoos are probably the most effective element of the story on the satire side of things: a society of talking horses who do not possess any of the vices that humans have while the Yahoos are primitive, disgusting humans who mate forcefully and appoint their leader depending on how disgusting he is. Gulliver and Mistress' study of them is also very well done and displays the differences and similarities between humans and Yahoos.The best version of \"Gulliver's Travels\" by far and one of the best mini-series ever.","GULLIVER'S TRAVELS (1996/MTV/NBC) ***1/2 Ted Danson, Mary Steenburgen, James Fox, Peter O' Toole, Alfre Woodard, Ned Beatty, Thomas Sturridge, Sir John Gielgud.  Excellent mini-series adaptation of Jonathan Swift's classic satirical novel about Lemuel Gulliver (Danson in a fine performance) and his near descent into madness after his journey and many adventures amongst many different people including the legendary Lilliputians (the wee folk) and the the Brobdingnagians (giants) with splendid supporting cast and grandiose production design.  Hats off to the special effects thanks to Jim Henson's effects shop and able direction by Charles Sturridge.","This production was quite well done for a television original, providing a very appropriate original slant on Swift's work. To make the frame story work well the film begins with Gulliver arriving home. Everyone who has read the book knows that will happen anyway. The frame story of the book has Gulliver's crazed confusion in sections. For example, he is horrified that he will trample little people in England because he has just returned from a land of giants. But the film has all the book sections within one long voyage. When Gulliver narrates his travels the editing cuts from England to the travel are very effective. I confess I found them intrusive and irritating at first, then they became natural. By the end, moreover, they have become a welcome addition to the story. As he tells his adventures to a larger and larger audience, more and more people listen to his compelling fantasy even though they doubt its truth. For example, his hatred of filthy Yahoos and admiration of pure logic from the fourth section comes across well when he is defending his own sanity. The intercuts between events in England and similar events or scenes in the tale is very effective. For example, ripping the cloth from the table to suggest the motion of towing a group of ships is inspired filming. The addition of Gulliver's family threatened by the lecherous doctor works well. Swift only hints at this by having the long-suffering wife protest against further voyages. It becomes a natural part of this story. The casting and acting were competent throughout. Some roles were exemplary. Omar Sharif's mad magician is superb. O'Toole's little emperor is doddering delightfully toward senility. Many specific complaints made by other writers here strike me as simple personal preference, which, after all, is what we are about here. I read the abridged version several times a year from fourth grade on. I may have escaped the complete version until a college class but have read it a few times since. And I had to start it again as I began reading about this film. While the Danson version is superior to any previous film, it does not replace the book. However, I think it will bring many readers to the book. If you have not read the book, enjoy this movie then go to the source. If you appreciate the satire in it, find Swift's \"A Modest Proposal\" and his \"Drapier's Letters.\" Both are satires attacking the wretched treatment of Ireland and the Irish during Swift's time. The drapier protests cheap, inflated copper coins being dumped on Ireland. These were Wood's light weight coinage, not good for face value in paying taxes and official debts. The outcry from Swift's satire caused the coins to be sent to another mistreated British territory, the American colonies. The universal satire in Swift's book and this movie just poke fun; they cannot change human nature. Give Danson's torturous experiences a chance. I think you will find them thought provoking and entertaining.","Considering the rubbish Hallmark has come up with since, it's easy to forget how good this was. As an adaptation of the book, this is easily the best version, and is the only version to include all four parts of the book. (I do have one reservation, which will be addressed). Obviously, some satirical points are lost, as the book contains many 'topical' references to persons and occurrences from the early 18th Century which would go completely unnoticed nowadays by anyone who has not made an academic study of the book. The book had Gulliver make four separate voyages to each land, but here (as in most versions that include more than one part) Gulliver discovers all the lands in one long voyage. Whilst this removes a reasonably important aspect of the book's framing device (The progressively worse treatment of Gulliver by the ships crews reflect Gulliver's own estrangement from the human race) it does make the film flow better. The films own framing device allows much more information to be imparted, although I do believe too much time is spent on the back-story accompanying it.The Lilliputian and Brobdingnagian segments are very well done- all the major points covered in the book are dealt with very economically. It is with the next part that my reservation arises. Laputa, the Academy and the Glubbdubdrib necromancy are very well adapted, but the depiction of the immortal Struldbruggs show an incredible lack of courage. In the book, the Struldbruggs are cursed with immortality, but not eternal youth and depicts gibbering, desiccated husks millennia old. Here, the 'curse' of immortality is simply blindness, and totally betrays the book. However, this remains the first time (to my knowledge) that the Houyhnhnms section has been filmed, a section that has given Swift a reputation (probably undeserved) of being a misanthrope). Here, the odious Yahoos are kept as vile as they are in the book and, although the impact of the ending has been softened, the blow is still there.The film is very well done indeed, with perfect art design, costuming and atmospheric direction by Sturridge- the Glubbdubdrib section is brilliantly eerie. Ted Danson is nothing short of fantastic, in a studied yet emotional performance. Steenbergen is less memorable, but still effective. The star-studded supporting cast impresses throughout, especially to O'Toole's Lilliputian Emperor and Nicholas Lyndhurst's Clustril (it is oddly satisfying to have a lead actor in 'Cheers' sharing scenes with a lead actor from 'Only Fools and Horses!) The music is perfect, with the rousing theme music, the Indian- influenced but otherworldly Laputan music and the primitive percussion of the Yahoo sections.In summary, this is a great, though qualified success. There will never be a film version that does full justice to the book, but this is as close as we're probably going to get.","I first saw this when I was a teen in my last year of Junior High. I was riveted to it! I loved the special effects, the fantastic places and the trial-aspect and flashback method of telling the story.Several years later I read the book and while it was interesting and I could definitely see what Swift was trying to say, I think that while it's not as perfect as the book for social commentary, as a story the movie is better. It makes more sense to have it be one long adventure than having Gulliver return after each voyage and making a profit by selling the tiny Lilliput sheep or whatever.It's much more arresting when everyone thinks he's crazy and the sheep DO make a cameo anyway. As a side note, when I saw Laputa I was stunned. It looks very much like the Kingdom of Zeal from the Chrono Trigger video game (1995) that also made me like this mini-series even more.I saw it again about 4 years ago, and realized that I still enjoyed it just as much. Really high quality stuff and began an excellent run of Sweeps mini-series for NBC who followed it up with the solid Merlin and interesting Alice in Wonderland.","Excellent story-telling and cinematography. Poignant, biting social commentary.Superb effects. Well-filmed and acted.However, the parallel action between the present and the travel adventures (though very well done) at times drags on a little too much (about 3 hrs), and over-interrupts the flow of the story.I first read the book as a child, and enjoyed the parts about the giants and the tiny people -- but the book lost me when it got to the floating island and the land of the \"yahoos\"! Well, although the adventure plot may sound like a children's story, it's in fact a very adult story, full of symbolism about the moral decay in England at the time of Jonathan Swift, the author of the novel that the film is based upon.","I guess I have to write something here, although I think my one summary says it all. I'm not a huge Ted Danson fan... nothing against the man, just hasn't \"done it\" for me. This covers the sides of Swift's novel that were never covered before. You can tell the cast was having a wonderful time filming this.","Gulliver's Travels is, at the beginning, a satiric novel written by a great misanthropist called Jonathan Swift.  So it is not recommended to judge of this movie, just by itself.  We must go deeper into Man's conscience to get to the point where Swift would have lead us.  Gulliver has lived a voyage of truthfulness, of solitude, of apprehension of what may be his true life. We cannot just sit and watch that movie, saying it is so cutie or so boring. The matter is far beyond that and I would like everyone to expect that. This is the greatest movie ever, as far as you can feel the truths that emerge from Ted Danson's character: the unforgettable Lemuel Gulliver.","At two hours, this could have been a very good movie but at three hours?? No, that's at minimum 40 minutes too long. The first hour of this is very good but after that it slowly loses steam. The flashback scenes are almost all interesting but when it gets back to the \"current\" story, Ted Danson drones on and on and on, trying to convince an unbelieving audience. By then, the viewer gets frustrated wondering if Danson's character \"Lemuel Gulliver\" will ever be believed and the conniving lying Dr. Bates (played well by James Fox) will ever be exposed for who and what he is.It's a very clean-language movie since it was a mini-series for television, and few people can argue with the \"peace and love\" message, but the it's long and frustrating to watch more than once.","I remember when this NBC mini-series aired when I was in high school. After reading the novel, I thought I'd check out some adaptations. Didn't expect much out of a TV mini-series, but now I might have to check out some more. This is actually excellent, and the best possible film version that could be made. Writer Simon Moore, who wrote the teleplay for the original Traffic mini-series, upon which the Soderberg film was based, came up with a brilliant narrative conceit which helps the story flow very smoothly: he frames Gulliver's adventures as flashbacks, with the actual story beginning as Gulliver first returns home (everything having happened on one journey). Gulliver, played by Cheers' Ted Danson, is sort of crazy-seeming when his wife, Mary Steenburgen, welcomes him back into his home. Unfortunately, the house is now owned by the local doctor, James Fox, who has designs on Steenburgen. Gulliver seems merely disturbed at first, but when he starts telling stories of tiny people, that's all the evidence Fox needs to throw him into an insane asylum. All four of Gulliver's travels are related in this version, in the same order as the novel (the only time this has been done on film). I love the way his present situation reflects his flashbacks. Gulliver's small son, whom he has never met before, reminds him of the Lilliputians. The doctors who observe him in his cell from a mezzanine loom above him and remind him of the Brogdingnagians, and the doctors' scientific inquiries remind him of the insane scientific experiments and theories of the Laputans and the professors at the Academy. Finally, when he is put on trial he is reminded of the Houyhnhnms and the Yahoos. The cast of this thing is amazing, and includes Peter O'Toole, Ned Beatty, Alfre Woodard, John Gielgud, Kristin Scott Thomas, Omar Sharif and Warwick Davis. The biggest flaw of the mini-series is that the acting is really uneven. You have all these fine actors, but the lesser characters are often played by actors who were probably fine in episodes of L.A. Law, but don't do well in a costume drama. Ted Danson isn't especially great, although he has a few sequences where he excels. It's probably better that he didn't attempt one, but all the other characters of the film speak in an English accent. Steenburgen is actually pretty good at it, and is quite good overall. Another flaw the series has is that the adventures happen a tad too quickly. It's not believable that Gulliver spent eight years away from home, as is claimed. But, in general, it captures Swift's tone and purpose very well, while, with its structure, adding a new emotional level.","Lemuel Gulliver (Ted Danson) is a doctor who goes missing at sea, leaving pregnant wife Mary (Mary Steenburgen) behind. Eight years later, he turns up, disheveled and seemingly mad - babbling about his adventures in the lands of the tiny Lilliputians, the giant Brobdingnags, the floating island of the intellectual Laputa, and the Houyhnhnms, a race of intelligent, talking horses who have to deal with the Yahoos - a race of bestial humans - among many other adventures. The not-so-good Dr. Bates (James Fox), who has designs on Lemuel's wife, has Gulliver incarcerated in a mental institution, and Lemuel, Mary, and son Thomas (Tom Sturridge) must find a way to prove his sanity.A splendid adaptation of Jonathan Swift's satirical novel, this film is a magnificent adaptation on so many levels: the story, the satire, the characters, the visuals, the brilliant cast. It's simply a treat to watch, and it's almost amazing considering that it was a made-for-TV film.The film does a brilliant job of capturing Swift's vicious satire, which cuts like a hatchet through British society of the time, but still resonates today. The wise Brobdingnags and the Houyhnhnms are almost perfect individuals who find it virtually impossible to understand why Gulliver speaks with such pride of the vices and corruptions of his society. The scenes where Gulliver struggles to prove himself different from the Yahoos are perhaps the best, with biting satire in describing how they pick their leaders (\"they seem to pick the worst among them. . . who rules until they find someone even worse\"), go to war (\"We only go to war for a very good reason - such as they are weaker than us, or we want all of their land\"), etc. The scenes involving Laputa are also effectively done - the intellectuals are so wrapped up in their specialized fields that they have no time for anything else, and really possess little common sense. And the addition of the asylum plot line enhances the story greatly - Dr. Bates is truly nasty character, and when he gives a speech to the inquiry on Gulliver's alleged vices, it's quite clear that he's describing his own faults.The film makes use of beautiful, and fairly convincing CGI effects depicting the very diverse settings of the novel with great effect. The contrast of sizes is done in a very skillful way, and all of the worlds depicted in the story are convincing in their own way. The cinematography (particularly that concerning the asylum) and the costumes are brilliantly done. The editing of the present with Lemuel's memories is a device which could be awkward, but works very well.The cast is truly wonderful; a veritable who's-who of British and American talent. Ted Danson gives an excellent, multi-layered performance as Gulliver, showing effectively his transformation from a person bewildered by his strange surroundings, to the lunatic state he was in when he reappears, to his rational, intellectual personality at the end. Most well-known for his work on sit-com, Danson shows that he's more than just Sam Malone with this wonderful serio-comic performance. Mary Steenburgen is effective as his wife, and James Fox is absolutely repulsive as Bates. The rest of the cast is made up mostly of cameos, with Peter O'Toole, Omar Sharif, Warwick Davis, Kristin Scott Thomas, Geraldine Chaplin, Alfre Woodward, Edward Fox, and Sir John Gielgud being the most memorable - but even the smallest parts are very well-played.While not 100% faithful to the book, \"Gulliver's Travels\" is a triumph of story and images. It's not to be missed.9/10","I just watched this Gulliver's Travel TV movie aired by our local TV station here. In the beginning, I thought it is just another movie for kids. I was very very wrong there. Indeed, it is a very excellent movie, thought-provoking and brilliantly 'potrayed' by the actors and actresses. Ted Danson at his best!","The mini-series fully deserves 10 stars. The framing device - Gulliver comes back from sea, tells a wild tale of his experiences, is committed to an asylum, tells further wild tales on further occasions, and is finally vindicated - has no foundation in the book, but neither does it alter the substance of the tales Swift wrote. Another major change is in the ending. Unlike so many adaptations, the film tells of all four of Gulliver's voyages - it is not limited to Lilliput and Brobdingnag. The first and second are altered by having Gulliver's voyage from Lilliliput end, not in rescue by an English ship, but in landfall on the Brobdingnagian coast. It is implied that the two lands are a considerable distance apart, but the book has Lilliput and its enemy Blefuscu lie in the Indian Ocean, whereas Brobdingnag is a peninsula off the coast of Alaska. The deviation is an intelligent piece of \nadaptation, and typical of the care taken by the adaptors to make a film of the book, rather than of something rather distantly based on it. Special props to Warwick Davis, who turned in a thoroughly convincing performance as Gulliver's dwarf tormentor at the Brobdingnagian court, and to Tom Sturridge: that Gulliver has a son is sort of implied, since the book says he has children. Ted Danson made the part of Gulliver his own. He inhabited it as thoroughly as Basil Rathbone or Jeremy Brett have inhabited that of Sherlock Holmes.","When was 8 or so, my dad bought this mini-series for me without completely knowing what it was. He knew the gist of course, tiny people island, big metaphorical plot, good self observing message, but this was quite more then that. It had great acting first off. The guy who plays Gulliver and the women who plays his wife are actually married in real life, so that kind of makes things cool. I also watched without understanding that it went beyond big guy in little world. It goes far beyond Lilleputt, into other uncharted regions, and undiscovered islands that are absolutely astounding-watch out for the big underlining meanings their awesome. I would recommend the viewer to consider this like going to theater- its not a big budget movie or anything-its a 90s mini series-buts a heck of 90s mini series!!!","At first i didn't like they way the director was constantly switching from the past (gulliver's travels) to the present (gulliver in the insane asylum). But it really is the best way to film the story even though it took some getting used to. Danson is outstanding as the title character and edward fox makes a wonderful villain. Worst part is mary steenburgen as gulliver's wife. She never has been Hollywood gorgeous and in this film they make her look downright dowdy for some reason. I'll never understand why directors make a woman ugly when it adds nothing to the story! Plus you want to strangle her for being so damn stupid in believing the lies bad guy Bates keeps telling her. Even her son can see thru the bastard. Still a good show and i rate it B+.","I remember this film quite clearly when I was in high school. At the time, I found it fantastic that I could watch a book without worrying about the doldrums of actually reading it. Looking back on it now, I remember a feeling of fantasy and imagination. I could only wonder what was running through Swift's mind as he wrote this symbolic story. Watching it again, older ... wiser ... and more inept to read instead of watch, I thought it was still a wonderful story. There were flaws, as there is with any made-for-TV film, but they seemed smaller then some of the big budget films that I have witnessed lately. I think that the fact that Henson's son had his hands in this allowed the creativity to leap from the screen.The biggest aspect of this film that I enjoyed was the satire on society. In every place that Gulliver travels he either imposes his society on others or they impose on him. There are times when they try to co-exist, but it ultimately fails in the end. Overall, the film is very well done indeed, with perfect art design, costuming and atmospheric direction by Sturridge- the Glubbdubdrib section is brilliantly eerie. Ted Danson is nothing short of fantastic, in a studied yet emotional performance. He has trouble with the English accent at times, but the effects and ensemble acting overshadow it. Steenbergen is less memorable, but still effective. The star-studded supporting cast impresses throughout, especially to O'Toole's Lilliputian Emperor and Nicholas Lyndhurst's Clustril. The music is near perfect as well.Overall, a decent outing by everyone involved and worth viewing again for those that may be hesitant to read the books.Grade: *** out of *****","This was a truly epic production that had all the elements that one would want in a fantasy film. The costuming, the music, the cinematography - all artistic elements of this film were absolutely beautiful and provided a rich experience.Ted Danson, best know for his TV roles in \"Cheers\" and \"becker,\" was excellent in the role of Gulliver. Mary Steenburgen (Time After Time, Cross Creek) performed equally well in her limited role as his wife.Other performances I really enjoyed were James Fox as Dr. Bates, Alfre Woodard as the Queen of Brobdingnag, and Peter O'Toole as the Emperor of Lilliput.This would make an enjoyable children's film, but it also would definitely appeal to adults for it's deep social commentary.","Not terrible, but mediocre. There's not much worse than a mediocre movie. You can laugh at a terrible movie, laugh at how badly it was made etc. Mediocre movies...you have to survive. this one made me cringe. the acting is really quite...mediocre. that stupid Brobdingnag girl...gaah! can't keep her southern accent away! \"Chaaawclaate? Cahn ah have sume chaawclaate??\" It also didn't stay true to the book at all. Gulliver wasn't telling the story in the book! He was living it! There are millions of unnecessary changes that only make it worse. Such as leaving out Swift's depiction of the morals of the different people. In the book, the Lilliputians, although appearing small and innocent are actually immoral and mean creatures. While the Brobdingnagians, seeming large and scary, are actually extremely kind and gentile. In the movie, the Brobdingnagians make Gulliver lie to and cheat people for their money. Nothing like that ever occurred in Swift's genius satire. Believe me, this movie is not worth your three hours.","Swift's socialism and pacifism come through against all odds in this well done remake. (Did you know there is no hyphen after \"well\"? Fact.) He meets warlike miniatures, socialist giants, head-in-the-clouds (literally) philosophers, and pacifist horses who rule over Yahoos -- nearly neanderthal humanoids. (Is that where \"yahoo\" came from?) We also meet the dastardly Dr. Bates, the devoted Mary Gulliver, the sweet and devoted son Thomas, and the full cast of a truly horrific 19th century lunatic asylum. Suspension of disbelief comes easily, and our 7- and 12-year-old girls enjoyed it as much as my husband and I did. (Sorry for the length, IMDb requires 10 lines.)"],"review-user":["modius","Prof_Lostiswitz","selwyn-5","MrVibrating","Estella","GusF","george.schmidt","Oldguypo8","northmoor1","craziersaiyan","julian_west","miniwidge","Paay","ccthemovieman-1","zetes","Hancock_the_Superb","Taha-4","djeimzco04","jdhooker","Hang_All_Drunkdrivers","film-critic","lastliberal","theglockner","Frankiezyx@aol.com"],"review-date":["10 December 2000","28 December 2003","28 January 2004","26 November 2006","13 May 1999","6 June 2005","31 March 2003","21 January 2007","4 October 2003","18 February 2004","13 February 2005","11 August 2000","17 December 1998","28 May 2006","12 October 2008","19 January 2007","2 September 1999","1 May 2018","20 August 2016","30 December 2004","11 August 2005","30 December 2007","29 May 2005","22 August 2006"],"review-rating":["10","10","8","9","8","10","8","10","5","9","9","10","8","7","5","7","5","8"],"review-title":[" Danson's best performance\n"," A Work of Art\n"," A quality film - must see, must have.\n"," Very underrated\n"," Gulliver is gob-Smackingly brilliant!!\n"," Brilliant mini-series\n"," Excellent adaptation\n"," The frame story which added to Swift's tale is useful and well done.\n"," Very good but not perfect. (Spoilers)\n"," Better than the Book\n"," A superb film (biting social commentary and adventure)\n"," The best adaptation of the book. Period.\n"," Many will see not the truths that lie in this incredible voyage.\n"," Too Long And Frustrating\n"," The best possible adaptation\n"," An amazing bit of work\n"," A brilliant adaptation\n"," A first-rate adaptation\n"," A Journey of Mind, Heart, and Spirt\n"," This is a long but fine movie\n"," Well, you weren't exaggerating... he's a whopper!\n"," I have been there.\n"," Weak\n"," Good family movie\n"]}