{"review-url":["http://www.imdb.com/title/tt0195630/reviews"],"review-text":["\"Julia Kerbridge (Catherine Mary Stewart) is working hard to become a doctor. Suddenly, Julia finds herself the guardian of her young niece, Amanda, after her parents are found murdered. Julia has a new neighbor, the mysterious Kevin Finney (Rob Lowe). Her hectic life comes crashing down when it becomes apparent that the young Amanda holds the key to a terrible secret. For she too is now the target of the killers. Julia must discover whether Kevin is friend or foe, and unlock the sinister mystery before the murderer strikes again,\" according to the DVD sleeve synopsis.This thriller quietly falls apart at the seams, but it is interesting some of the time. Stalker Sean Devine's background telephone scene (outside the police station) and Mr. Lowe's violin (restaurant) are tensely played. But, early on, it's difficult not to miss the fact that one of the supposedly sophisticated killers purposely twists his foot in some red paint at the murder scene. Unfortunately, this is not an intricate plot point; and, there are worse story stumbles afoot. Overall \"Dead Silent\" is not a bad way to spend some time, if there is nothing better on, or you're into Lowe and his co-stars.**** Dead Silent (1999) Roger Cardinal ~ Catherine Mary Stewart, Rob Lowe, Arlen Aguayo-Stewart, Larry Day","Rob Lowe must have eaten up the entire budget, but I can't fault him for running with the money.  Even he would have to agree, there was nothing good about this movie.  Filming, editing, direction, dialogue, sets, makeup, writing, casting (especially the young girl and imposter child psychiatrist), and the story all were just the worst.  I have never seen such a horrible movie.  Pass this one up for any other rental selection, or find yourself shouting out vile comments at the TV.  Dead Silent should be silenced for all time.","When Dr Julia Meybridge's (Catherine Mary Stewart) sister and brother-in-law are murdered in a burglary, she takes care of their daughter Amanda (Arlen Aguayo-Stewart) who cannot speak due to the trauma of witnessing the murders. However as accusations of stealing industrial secrets are levelled at Amanda's parents and someone continues to stalk Julia's apartment it is apparent that Amanda is still in danger.This is a reasonable TV thriller. It doesn't particularly pretend to having high aspirations and knows that it's plot isn't great but it's still OK if you're not expecting great things. The main story about the industrial espionage and the gang hunting for \"an item\" is pretty good if a little unbelievable. You can see the twists coming from miles but it doesn't take too much away from the conclusion.It's difficult to care about either Stewart (Dr Meybridge) or Amanda (Aguayo-Stewart). With Stewart her character is so work focused that she neglects Amanda, the idea being that we would gradually see her warm to the prospect of motherhood. However she is so unsympathetic for the majority of the film that it is that that stays with you and not the sudden urge of motherhood experienced towards the end. As an aside Stewart looks so much like Meg Ryan that if her current work dries up she should be able to get a job as one of those celebrity impersonators at parties!Amanda being mute for almost the entire film makes it difficult for Aguayo-Stewart to convey a lot of character. This would have suited a more experienced or better child actress and makes you wonder about how she was picked out for the role. Rob Lowe brings a bit of \"star-power\" to the film but, as projects like 'The West Wing' shows, he's too good for projects like this.A reasonable TV thriller, this would have benefited from better performances from both the female leads.","This film held my interest enough to watch it several times. The plot has holes, but the lead performers make it work.Catherine Mary Stewart (Julia Kerbridge), does a great job as a woman of 37 who has sacrificed everything else to become a physician. She worked years to earn the money to go to medical school. She is performing brilliantly in her residency and is just about to take her board exam and realize her dream.Meanwhile, Julia's sister and brother-in-law are murdered and as the nearest living relative she is compelled to take in her niece Amanda (Arlen Aguayo-Stewart) to avoid having her become a ward of the state. Amanda is about 7 years old from her appearance. Amanda is so traumatized from her parent's murder that she has become mute. Needless to say, Julia's 16-hour days get longer caring for Amanda.Rob Lowe plays Kevin Finney, a charming neighbor man in their apartment building who works his way into the lives of Julia and Amanda. He is always there with a trick or a joke to help Amanda deal with her distress. Amanda really starts to warm up to Kevin as the film progresses, perhaps more than to her aunt. Julia starts to rely on Kevin to take some of the load of caring for Amanda as she attempts to handle her case load and prepare for her board examination. Kevin is always there whenever some crisis erupts for Julia.The chemistry between Rob and Catherine Mary was great. You keep watching to see them get together before the end of the film. The chemistry between Rob and Arlen was good as well. Arlen managed to convey quite a lot without the benefit of words. The plot had Julia and Amanda gradually warming up to each other. You can see them working out a relationship as the film progresses.We discover that Julia's sister and brother-in-law (the Meyers) were involved in industrial espionage. They stole an extremely valuable prototype microchip from their employer. They had three associates who intended to share the proceeds of the theft. Julia discovers that the Meyers were planning to skip the country under assumed identities. The plot is unclear whether the Meyers intended to double cross their associates or were themselves double crossed.In any case the Meyers are murdered in their home by 2 of their former associates. The killers make no attempt to extract the location of the microchip from the Meyers before killing them. The killers search the home and fail to find their prize. They leave a living witness to their crime, Amanda. The killers then spend the remainder of the film making clumsy attempts to extract the microchip from Julia and Amanda who have no idea where the prize is located. Eventually, the killers kidnap Amanda in hopes she knows something about the microchip's location.Eventually Julia discovers the truth about Kevin. He is an investigator hired to recover the stolen microchip. After some rough moments in the relationship they manage to rescue Amanda and dispatch the bad guys. The predictable ending has the three forming a family and moving happily into a future together.What struck me about the plot were major holes. Kevin moves into the same apartment building as Julia and Amanda the day after the murder of the Meyers. How does he know that the microchip is not already in the hands of the killers? The killers blithely leave fingerprints at the murder scene, with no concern for concealing their identity. The killer that pretends to be a psychiatrist is revealed to Amanda by the remnants of red paint from the murder scene on his shoe soles. He was not shown in the murder scene at the start of the film. There are other weaknesses along these lines too numerous to mention.The film could have been a lot better if the script had been refined more before filming. Filling in the plot holes would have added little expense and greatly improved the effort.","It's amazing what you can do with little money. DEAD SILENT being a low budget movie delivers its promises. Too bad we don't see Rob Lowe more often on the silver screen. Lowe is at its best in this riveting thriller . No wonder he went from DEAD SILENT straight to the TV mega hit The West Wing . DEAD SILENT  8 out of 10 Sputtosi Toronto.","This movie has it all. Poor casting, slow pace, Rob Lowe slumming, you name it. To start off, the little girl was a very bizarre casting as Stewart's niece (though she really may be, for all I know) and as the child of the people we saw in the beginning of the movie. She looks adopted. Perhaps she was - and I wouldn't put it past this script to not bother telling us.The pace of this thing is deadly. There's no acting to speak of because the characters are cardboard. Everyone acts sinister. And what is all the fuss about? When actors chased after McGuffin in Hitchcock, there was another storyline to keep them interested. Not in this movie.One sits through this entire film feeling as if something is off. Off with the acting, off with the story, off with you for watching it. So let's have one more off - off with the TV.","The story starts off in the home of a little girl who is going to have a Birthday Party and both the mother and father seemed to act rather quiet and reserved with each other. They proceed to give their daughter her present which is from both of them and it stuck me funny the expressions on the two parents faces as they gave their child this gift, it was almost like, 'I hope she likes it'! There is a killing in the film and Catherine Mary Stewart,(Julia Kerbridge),\"Reaper\",2000, gets involved with the case because of family ties. Julia is working hard to become a doctor and this particular murder disrupts her entire life. Rob Lowe, (Kevin Finney),\"View From The Top\",03 is a next door neighbor in the same apartment dwelling as Julia and he eventually goes to bed with her and tries to help her in other ways. This is not a bad film, but it is certainly nothing to go crazy about, unless you like a film location in Canada and a good looking Catherine Mary Stewart, a native from Canada.","The movie uses motifs that could be plagiarized from \"Wait Until Dark\" (1967), a much better movie by Terence Young, starring Audrey Hepburn. \"Dead Silent\" is a pale paraphrase.  There is nothing new here -- the hidden object in the doll, the bad men wanting it, the bad guy posing as a good guy. The disability, though, has shifted : Audrey Hepburn couldn't see, the child in DS cannot speak. But both stories hinge on the handicap. Where \"Wait Until Dark\" built up unbearable suspense, \"Dead Silent\" lets you guess the outcome, the story being such a stereotype.","**SPOILERS** Better then you would expect Canadian import that has a twist ending to it that comes as almost no surprise at all. With the killer acting so obnoxious and weird, before his identity is revealed,that you can spot him almost as soon as you see him. The movie begins with young Amanda Mayers witnessing the murder of her parents , Larry & Elizabeth, in a home invasion by two ruthless thugs that leaves her so traumatized that she loses her ability to speak. With Amanda's closest relative being her aunt third year hospital resident Julia Kerbridge she's put in Julia's care which has her parents killers zero in on the two in their attempt to recover a micro-chip, that can revolutionize the world of technology. It was that chip that Amanda's dead parents had in their possession that their killers were looking for. We also have the mysterious and handsome next-door neighbor the on and off musician Kevin Finney who seems to take a more then a passing interest in Amanda and her aunt Julia. Kevin is always hanging around the place looking for something, the missing micro-chip?. He also has compiled a massive file, that Kevin foolishly leaves out in the open for Julia to later find, on the Mayer murders.Kevin gets very friendly with both Amanda and Julia which leads him to become a target of the two killers who are trying to get their hands on the missing micro-chip that they overlooked when they murdered both of Amanda's parents. Having her niece get treated by psychiatrist Dr. Ettinger has Julia and Dr. Ettinger realize that she's hiding the secret of her parents murder, and the missing micro-chip, in her subconscious mind that if cured, and able to talk again, would reveal their identities! even more important where the micro-chip is hidden! What Julia doesn't know is that the man behind Amanda's parents murder is a lot closer to both her and Amanda that she could have ever imagined.Well acted and eye-popping photographed, looking like it's in high definition, made for TV movie has Rob Lowe as the odd man out, who also plays a mean violin, as the hero. Lowe, or Kevin, after a few false starts shows who's side he's really on as the movie leads it it's final and unexpected conclusion. The killers in the film are so determined to get the missing,or stolen, micro-chip that they so far as getting themselves exposed by hanging around Julia's apartment house and Amanda's school, where they can easily be identified.***SPOILER ALERT****Things get out of hand for the killers when the real Dr. Ettinger shows up, from a two week vacation, and you begin to realize that Amanda's life is in far more danger then you, or both Julia and Amanda, could have ever suspected. It turns out that very person who's supposed to help Amanda recover from her trauma, of not being able to speak, is the one who caused it! The film has a wild and effective final with Amanda now again traumatized, by the fake Dr. Ettinger, to the point where she can talk again. With no one suspecting who he is will it be enough for both Julia and Kevin, who turns out to be a private investigator, to get the drop on him before he does them both, together with a terrorized Amanda, in!"],"review-user":["wes-connors","fmartin","bob the moo","jehaccess6","Sputtosi","blanche-2","whpratt1","Menga","sol-kay"],"review-date":["10 March 2010","16 November 2002","29 October 2001","19 January 2008","9 August 2002","20 September 2004","12 July 2006","28 July 2000","6 March 2007"],"review-rating":["4","1","7","10","4","3","6"],"review-title":[" A New Lowe\n"," Horrible in all respects...\n"," Poor thriller - bad lead actors doesn't help\n"," Slightly Above Average TV Movie.\n"," A penny for your thoughts\n"," ouch\n"," Not Bad/ Not Good\n"," Pale paraphrase of \"Wait Until Dark\"\n"," A chip off the old block?\n"]}