{"review-url":["http://www.imdb.com/title/tt0156146/reviews"],"review-text":["Like many others, I counted on the appearance of Dennis Hopper to make this not a complete waste of time. I was sadly mistaken. Everything negative said about this flic is more than true. What takes the cake however, is the horrible, horrible storyline for the main character.Here's why: The planet might be destroyed, the ONLY way to recover from it, for the ENTIRE human race to be saved trough it, is to get as many smart, capable, nice, competent people into an underground hide-out. And Dennis Hopper is the lone seer/scientist with vision who was prepared for the worst, and who has realized this. But what's the main motivation of Stevens (Sonny D'Angelo)?? He's angry because Dennis has decided who is to be saved or to be doomed! While it clearly explained to Stevens that Dennis' character has done everything to warn people of the danger but that he was laughed at. The Hopper-character was the boy with the finger in the dike, and now Stevens is blaming him for 'picking and choosing'??? And if that isn't enough, he wants to stop everybody from entering this hideout, because \"it isn't fair!?\" AND.... he's responsible for the death of the one guy who is humanity's saviour! OH MY GOD, how stupid can you get?What's also maddening that IMDb forces one to write minimal ten lines about this piece of crap. I mean, TWO MILLION in budget, what could have been done with that? Think Clerks, Blair Witch, and lotsa other movies who have been made for under 100.000 dollars and were still better. AAAAARGH! I count myself lucky that I didn't pay one penny to see this crap, and to sit through the end of this utter, úber-crap, is one the most heroic things I've done this year. It's no wonder that the writers of this pile of dung had jobs as camera operator and title designer before ...","Not only did the effects and acting in this movie bite, but the story was terrible.A scientist discovers that a comet fragment will hit the moon ... world leaders ignore him ... he builds a shelter ... then, everyone is upset that he is \"playing God\".How lame!  He built the thing, why is everyone \"entitled\" to access? Totally lame story, don't waste your time!","I bought this movie in VHS for 25 cents in Canadian money... and it wasn't even worth it! Tycus is alike every catastrophic movie that you can watch for free on TV during a week day afternoon. I know that a VHS movie doesn't stop every 15 minutes because of ads but I it's not really an advantage. You see, at least ads would have kept me awake! Anyway... it just wasn't a good movie. And I didn't even mention the lesson they are trying to teach us... NOBODY HAS THE RIGHT TO DECIDE WHO'S GOING TO LIVE AND WHO'S GOING TO DIE! That is not a spoiler, you'll ear that from the beginning to the end of the film... if you still want to see it. :P","'Tycus' is almost as bad as a science fiction film can go.I can hardly find something good to say about this film. The premises are completely wrong. A comet is supposed to hit the Moon and cause catastrophic damage to Earth, but nobody believes the scientist who predicts this.A whole underground city plus a launching pad for nuclear armed rockets is build in the California mountains without anybody noticing. When the comet nears Earth the news make it to the TV and newspapers hardly a day before the event. And so on, and so on ...Neither does any kind of emotion make it to the screen. Is the genius who discovers the comet and builds the underground city a savior of humanity or a beast? The director or Dennis Hooper who is playing the role did not seem to decide until the film was done, and actually it does not make any difference because acting and directing is so confusing that you end by wondering what does this film try to say. The special effects are so cheap that not only that they cannot be convincing in the era of computer effects, but they could not have been convincing even in the 50s, four decades before this film was made.A total waste of time.","Oh, boy, it's another comet-hitting-the-earth film. Coming within a year or two of Deep Impact, Armageddon, Space Cowboys and various other stupid flicks with rap stars in them, you'd think people would be burned out on this concept. Apparently not, since I rented it, hoping it MIGHT not be awful: Dennis Hopper was in it, after all, and he's a good actor, right?I forgot something important: along with Peter O'Toole, Robert De Niro  and quite a few other esteemed actors, Hopper has a penchant for appearing in dreadful films. Not only that, but he seems to prepare for them by taking forget-how-to-act classes. His performance in Tychus is so awful that you expect Divine or Edith Massey to appear in some scenes.\nI don't know what else to say about this rubbish, other than if you're into things crashing into the earth films, watch Deep Impact, and then Armageddon and Space Cowboys at a stretch. Forget the others altogether. This one really is bottom of the pile.","What a bad reccomendation!  I started watching the first 20 minutes of it, and I just couldn't take the horrible acting, production value (CAMERA!!), and SCRIPT!!! And everything else... It looks like a shabby made-for TV episode, without spirit or feel.  Cliche American characters make this one a movie to stop watching 20 minutes in... because I sometimes feel like my life has been wasted.  At least it was only wasted for 20 minutes or so instead of a couple hours.I don't care if this movie has some cool ideas, like asteroids hitting Earth and people living underground.  It is done horribly, so it doesn't get any points outta me.  If I feel my time has been wasted, how can a movie be at all good?Yeah, this is definetly a direct-to-video release, and am surprised a person like Dennis Hopper would voluntarily be in this movie.  Is he friends with the scriptwriter or something?????","A £3.50 DVD can be a gamble and this was one that sort of paid off.A decent Saturday Night type movie that entertains if you gloss over the obvious plot flaws. Special effects are a bit few and far between with some repetition (and why does London always look as if it's in the 60's ?)If it had the budget of, say, Armageddon then I'm sure it would have performed better at the Box Office as the story is quite a good one.Overall, Tycus is consigned to B movie history but if you see it for £3.50 then it's worth buying.","Unimpressive and extremely low budget sci-fi without any charm and appeal. Even the scenes related with the fall of the asteroids are stolen from other movies with the same plot. It's just a bad rip-off of \"Asteroid\" (with Annabela Sciora) and \"Deep Impact\" (with Morgan Freeman). Mr. Hopper seems to be anxious to slip away from this pointless and dull sci-fi entry.I give this a 2 (two). And don't say I'm not a good guy!","Oh dear, oh dear, oh dear. My lifetime was drastically wasted by this pile of stink. I would rather chew off my arm than watch this film again. Painful story line, painful characters and a painful two hours.The best way of describing this movie is a follows:- I would rather stick pins in my eyes and cut out my brain than watch another minute of this tripe.Advice is to stay well clear and let your local dustman do you a favour of removing this rubbish.Lin, you told me this was good!!!!Goodaleebyeload.","Peter Crawford discovers a comet on a collision course with the moon. But when the government doesn't believe him (dumb fact #1). He builds a shelter in deep underground and is drawing lots to see who will go. Plus is willing to kill to save humanity (dumb fact #2). With millions of dollars of technology, how could a civilian see what NASA could not? Plus, the ends justifies the means moral of this story is just plain WRONG!!! This movie is improbable and totally unbelievable. What was running through these people minds, why the hell do crap piles like this get the green light? Some times I wonder who someone has to **** to get a movie made in this ****ing town.","Not only that the VHS and DVD cover(at least in Europe)show a scene that has nothing to do with the actual plot of the movie, the acting is so bad, that the movie is crying out for being made fun of. If you have nothing to do, you are with some good friends and you want to have some laughs about a movie, that is supposed to be serious, watch Tycus and Peter Onorati, a man who will teach you how to knock over bad guys with empty carton boxes! Shame on Dennis Hopper, following Travoltas example by starring in his very own \"battlefield earth\". For those who want to watch a good movie about the earth being destroyed by a terrible force, please do not choose Tycus, but do yourselves a favor and watch \"Armageddon\" for he 20th time!","Despite of what anybody mite say,  I think that this was a very well done film,  I really enjoyed it.  Dennis Hopper was great in his part,  his character was so carm during the film, which is so cool in films.  I think that this film doesent get the credit it deserves.  I really enjoy those end of the world movies.8/10","There are SO many screwups and mistakes in this movie that I gave up counting after the first ten minutes. The acting simply HAS to be the worst I have EVER seen in my life, The effects can be done better on a home PC using 3DsMax software and the writing stinks so bad I thought the film was a comedy...I'm assuming it wasn't. For a start, The exterior jet is a Cessna Citation, and aircraft I am quite familiar with having piloted one myself and yet, when the main charecters enter the cockpit they are standing....not only are they standing, they are standing side-by-side in the doorsway. Standing in a citition is like standing in a VW beetle....simply no friggin' way. Does this director think audiences are simply stupid? or was this a cast and crew simply desparate for a paycheque?...either way, they didn't deserve one. The story, about an asteriod/comet about to impact the moon isn't so far fetched...the fact that they bounce back and forth from it 'impacting the moon' in one scene, to 'aproaching Earth's atmosphere' in the next clearly shows the desparation of the crew to simply have their name on the credits...obviously a first for most of the cast and crew. The biggest joke of the whole film??.....STEALING SCENES/FILM FOOTAGE FROM \"AIR AMERICA\" What?...The director didn't think anyone would notice the 'flying boxcar' crash scenes...do the makers of \"Air America\" know you used these shots?.. I can only sum it up this way: I simply had to watch this one right through although (my kids fell asleep after ten minutes) just to see how BAD this could get and, trust me on this, the whole cast and crew should sue to have their names taken off the credits.","Basic fun movie but don't go expecting to see great effects, great acting and a great story. The special effects are OK but not very realistic. The acting is OK but nothing special. The story is OK but predictable. All in all, an OK movie if you have a few hours to spare with nothing better to do.","Tycus is one of the worst films direct to video films that I see ever.I am not amazing that this product does not appearing at the cinema.Bad Visual effects (The start is dreadful)Bad actors (I don´t understand Why appear in this film the great Dennis Hopper)and Bad screen Without sense.My alternative:Armaggedon or Twister. SENTENCE FOR TYCUS:Do not watch this film.","For a movie shot in 18 days and a budget less than 2 million, this little movie that could deserves a 'best we could' award.  Interesting premise (aside from the usual meteor stuff) with solid perfs by a cast of familiar faces.  2 thumbs up.  Advice to the other reviewer: Don't be afraid to say you liked something.","Actually the movie isn't that bad.  The special effects are, for the most part, unconvincing.  The movie seems to steal ideas from other movies in this genre, namely Deep Impact.  The drunken pilot is practically a clone of Randy Quaid's character in Independence Day. One of the final scenes where the scientist gets trapped outside to die is shot strangely.  As the unlucky bystanders watch the select few head down the elevator (which looks more like an outhouse), their facial expressions reminded me of Night of the Living Dead.  Instead of hurrying to the elevator shaft to save themselves, they look catatonic.  Only as the elevator doors begin to close do they scramble for their own lives.  I made a mistake and paid to rent this as a new release.","This film is absolutly terrible! Thecast, plot and script is the worst thing I have ever seen.Not to mention the largest dissapointment, this movie used none of its on special effects. They used some clips from other movies and national geographic movies! Unless you like crappy movies, stay away from this rechid thing!","Not another \"comet hits the earth\" movie I hear you say.  Well, it's going to hit the moon, so I suppose it's slightly different this time.Dennis Hopper is probably the best actor on the planet at playing an egotistical maniac, and as the scientist building his ark in this film he does it well as ever.However, it's predictable and it's boring.  So don't see it!","One must place aside the core of the story with the confines of the security mine in order to save a certain amount of people from the catastrophe yet to accur shorty in the chapter of their lives. We must, therefore, concentrate on the comet impact from striking the moon and delivering its payload of death on the earth. I wish to remark on the special affects on buildings and surroundings with the most horrifying devastation to humankind . If such a demonic occurrence from the cosmic depths actually happened, and I most certainly believe that it will, then the film, Tycus, will be excepted as a valuable asset to our knowledge.","Fans of apocalyptic movies will savor this well-made low-budget thriller that is essentially a remake of the 1951 George Pal classic \"When Worlds Collide.\" A comet is headed for a near-collision with earth, and when his fellow scientists disregard his warnings of doom, eccentric scientist Peter Crawford (Dennis Hopper) gathers a group of private investors to secretly construct an underground sanctuary.The story unfolds through the eyes of muscle-bound Gulf-war veteran Jake Lowe (Peter Onorati)who inadvertently discovers Crawford's hidden sanctuary and then decides that Crawford is wrong for keeping his project hidden from the rest of humanity. As the comet approaches, the subject of who should live and who should die makes for interesting drama.While the special effects are not in the same league, I enjoyed the story more than I did Spielberg's War of the Worlds, because I feel this screenplay is better. Some suspension of scientific reality is required, but it's worthwhile for the development of a good story. I highly recommend this film to fans of the genre.","That's what one of the technicians who was tracking the asteroid shouted. Even though the asteroid was still behind the moon, on its collision course.Well, O.K. But I would think a movie script writer who flunked out of elementary school would know differently -- even on a low-budget $2 million movie.And then, when they launched the rocket inside the secret underground complex, it was in plain unobstructed view of the launch control panel and technicians. But there was no blow-back from the engines, which should have incinerated everybody.And the rocket engines were running the entire time from the Earth to the asteroid behind the moon.NASA would love to know how they did both.When the hero parachuted down to the area of the underground secret hideaway, the pilot was flying at only a few hundred feet to avoid radar in a remote mountain range, or so he said there was radar in the wilderness. So, the hero parachuted. He should have bounced two or three times before the parachute opened.And when the hero was in another gunfight with just about everybody, we knew he was out of ammo when he kept pulling the trigger on his automatic, and we heard \"click, click.\" Automatics don't go \"click, click\" when they're out.When Hopper was asked how he was able to build a secret underground complex at a cost of several hundred million dollars, and get a rocket with a nuclear warhead, he simply said something along the lines that he avoided the government bureaucracy.Near the end, when Dennis Hopper and the main characters and their families approached the entrance to the elevator shaft leading to the sanctuary, there were around 40 \"extras\" who found the entrance and were waiting for something to happen. They all knew they were about to die.Hopper & company calmly approached the entrance. The \"extras\" did nothing but look. Maybe just one had a comment, but that's it. Hopper pulled out his remote and keyed in the code to open the elevator doors. The \"extras\" did nothing. Hopper & company got aboard and said their final lines. Only when the elevator doors began to close did the \"extras\" ran amok and rushed the doors to save themselves. Oh, get REAL! And at the end, there's a distant future peaceful Earth, with the storyteller telling the children how all this happened long ago, with a space view of the earth now surrounded with fragments of the moon.Well, without the moon, there goes the tides, which is how the oceans clean themselves. But that doesn't seem to matter to the plot line.And the list goes on.The storyline itself is just plain awful. Dennis Hopper, a fine and gifted actor, just must have had an overdue yacht payment to make, to get involved in this disaster of a disaster movie.This movie is ONLY worth watching if you're having a rotten day, and want to see something much worse to lift your spirits.","I have read all of the reviews for this direct to video movie. I can agree that the movie is not \"Armageddon\" or \"Deep Impact\" quality. Nevertheless, if you are looking for a way to pass ninety minutes or so, then this is a movie that is bearable.I started looking at the film early in the AM hours as I was doing some geek stuff. It was very nice, because I was able to switch back and forth between what I was doing and watching the movie, with out missing a beat. It is a predictable movie, and the acting is not up to par for some of the veteran actors (for instance, Dennis Hopper).But I should point out that I paid only $2 (US) and as the old adage goes: You get what you pay for! If you are looking for some deep meaning movie that will have you have to watching it over and over again, then this is definitely the long video. On the other hand, if you looking for something to pass the time, then there is nothing wrong with Tycus (Which incidentally was called \"Comet: Final Impact\" in Mexico where I found this video).","It's certainly a direct-to-video, but the story is not as bad as most of the other reviewers think. I quite like the fact the hero is doing the wrong thing most of the time.The hero's reactions and the reactions of the rebels are just human. The Hopper character is actually playing god. That might be the right thing to do, but one may not like that anyway.In the end, the god player is doomed to death, and the hero, who would have spent his own life, can live. Quite a morale. :-)The most unrealistic thing I saw, is that earth is doing so well with no moon stabilizing its rotation.","A real B-movie, alright.  Rip-off special effects, lazy acting, lousy music...but not a total disaster.  This is one of those movies you can watch to kill 90 minutes.  It's pretty inoffensive.  I assume Dennis Hopper was well-paid!  Good rental."],"review-user":["huh_oh_i_c","UOJames","CarlosQC","dromasca","Lupercali","winstonsmith_84","Forever Damned","gazineo-1","mafster","lordzedd-3","elix-2","mr_pivac1985","MI5-2","Performr","SUPERNOVA HEIGHTS","anonymous-1","timmyb","ryankemp","redkiwi","Starlifter","noetorres","GeorgeSickler","kcallis","simon2tausend","witsend64"],"review-date":["16 April 2006","12 November 2000","2 June 2007","16 February 2007","15 February 2004","31 May 2002","15 June 2002","15 May 2001","12 August 2007","29 November 2006","30 October 2005","27 February 2003","14 May 2004","7 May 1999","24 July 2001","2 June 1999","2 September 2000","12 August 2003","10 August 2002","16 October 2006","16 July 2005","29 September 2010","21 September 2006","30 July 2006","25 February 2003"],"review-rating":["1","1","2","3","7","2","1","1","3","5","2","10","5","5","9","1","3","3"],"review-title":[" The most stupid, annoying main character ever!\n"," Don't bother\n"," wasn't worth it\n"," bad science fiction\n"," Thoroughly dreadful\n"," Can't believe I stopped watching it\n"," Not Too Bad\n"," A falling asteroid... on your head!\n"," It's really hit the fan this time...\n"," Stupid pile of crapola\n"," bad bad movie that's so bad, its fun to watch!\n"," A very enjoyable Dennis Hopper film.\n"," What's next for Hopper, Infomercials?\n"," Worth watching if you have nothing else to do!\n"," TYCUS DOES NOT PRESENT THE END OF THE WORLD\n"," The guy above just couldn't bring himself to say he liked it.\n"," Unconvincing acting and special effects detract from a mediocre plot\n"," This movie sucks!\n"," Deep Impact on the cheap!\n"," perhaps a futuristic horror from space.\n"," Overlooked classic in the genre of apocalypse.\n"," It's entering the Earth's atmosphere!!!!!!\n"," A way to pass the time\n"," Well, I enjoyed this\n"," Not the best, not the worst\n"]}