{"review-url":["http://www.imdb.com/title/tt0127917/reviews"],"review-text":["... Said the continuity announcer as TACTICAL ASSAULT was about to be broadcast . After seeing the first two minutes I started thinking Rutger might want to get a new agent . After seeing the next ten minutes I started thinking Rutger might want to retire thereby saving a potential audience from any more of his performances Yup this is a truly terrible movie . I wasn't expecting much and why should I if the name Rutget Hauer appeared in the credits , but within seconds of the opening title credits that featured NATO warplanes with USSR markings bombing Bosnia I realised I was going to be force fed inedible turkey three months after Christmas .The attention to detail is non existent . NATO planes carry USSR markings then were told Hauer's character spent six years in an Iraqi prison which would make the setting 1997 . What NATO were bombing the Serbs in 1997 ! I guess the producers didn't think the audience would have noticed this ridiculous inaccuracy but I know I did . The producers also probably hoped the audience wouldn't notice the lack of continuity such as dogfights with Iraqi jets that suddenly turned from Migs to F-4 Phantoms then back again but I did . Even stranger characters would take off in F-16s then when they arrive back at base there jet has changed into a Soviet built Mig Oh and if you're expecting a dumb action movie you're only half right because it's dumb but most of the plot centres around a BASIC INSTINCT revenge plot . I'll give the producers some credit ( Maybe credit is too strong a word ) because after seeing plots featuring nannies from hell , policemen from hell , flat mates from hell we now have a fighter pilot from hell which means every single occupation of the 20th century has featured in a from hell type plot with perhaps TATICAL ASSUALT being the worst movie of the lot","This movie is astonishingly poor. It was on television when I tuned in during an action scene and was chuckling away at the cheesy macho dialogue, waiting for Leslie Nielsen to appear. It took me a couple of minutes to realise that it wasn't actually a comedy, it was meant to be taken seriously. What has to be remembered is that somebody actually sat down and wrote this movie, and worse still - other people funded it and gave it the green light.Rutger Hauer obviously doesn't read movie scripts before he signs up, either that or he has some seriously bad debts to pay.Strangely, this film is so poor, that you find yourself staring at it, wondering how it actually got funded, and how a TV channel must have paid money for the rights to air it. The dialogue between hero and baddie whilst trying to shoot each other out of the sky is particularly painful, with dialogue sounding like it was generated by a Texas Intruments \"Speak & Spell\".The Hollywood money machine at it's worst. Funny though.","The movie contains a plethora of action scenes, explosion, blast, aircraft battles with various jet-planes flying to sound-velocity . USA captain John 'Doc' Holiday (Rutger Hauer) was fired during the Gulf War , he loses it under pressure after a fatal incident with a civil airliner over an Iraqi 'no fly zone' , as he nearly shoots down an unarmed passengers airplane . Pilot Banning is forced to shoot down Doc's jet instead save the situation. Unsettling Air Force pilot Holiday looks for destroy the life of his former commandant , who shot him down during the Gulf War to stop him from shooting on unauthorized civilian targets. In Bosnian front commanded by a General ( Ken Howard ), the squad leader is Colonel Lee Banning (Robert Patrick) , he gets him to be reactivated for the service depending on further therapy led by a Doctor (Dey Young) . Deranged Holiday however doesn't see things that way , he feels Lee decommissioned his career, as Doc decides to get avenge on Lee and will stop at noting for vendetta , neither sabotage nor target Banning's pregnant spouse (Isabel Glasser).This is an average action movie with suspense, thrills, dogfighting with spectacular flight scenes and some commercial elements. The story provides entertainment and action with no sense but sometimes is a little bit boring and dull . Mediocre-budget extended adventures produced about a maverick pilot and his deranged partner undergoing risked feats on air and earth . A standard actioner packed with aerial action , intrigue , and spectacular dogfighting . Robert Patrick shows professionalism as happily married crack fighter pilot , assigned to chase the rebel pilot and ex-partner . Full of jingoist ideals, dubious ethics and violent vengeance . Regular action film in what's really a revenge psycho-thriller . Filmed in Budapest (Hungary) and desert of Mojave (USA) . The film moves like a supersonic bullet for most of its running time and the last generation Jets steal the show. Contrived beyond belief with spectacular dogfights that play like video games, but slickly calculated to please 2000s audiences. The movie follows the wake of ¨Top Gun¨, ¨Iron Eagle I¨ and sequels. The motion picture is regularly directed by Mark Griffits who in the 80s directed films as ¨Hardbodies I, II , Ultraviolet , or Running hot¨ , while in the 90 and 2000 only directs TV movies. Rating : Below average , 4 .","It's as if the Stay-Puffed Marshmallow Man from Ghostbusters had been reincarnated in Rutger Hauer's body and is taking revenge upon a rival's pregnant wife!  If seeing an obese Hauer chase a very pregnant Isabel Glaser (imagine the spine-tingling thrills in that contest) sounds good to you, see this film! Seriously, if Hauer is what an Iraqi POW looks like after six years in prison, then hungry people everywhere should make a bee line to a jail in Baghdad.  Overall \"Tactical Assault\" rates 2 stars instead of 1 because Mike Mitchell as Hawk is terrific.  Mitchell burns up the screen as a NATO pilot until his plane is burned up itself (by an enemy missle), whereupon the film loses what little verve it had to begin with.","Well, this movie shows us that Mark Griffiths and producers think we all are idiots. If not how should we understand this:American pilots take off on Mig-29s. Suddenly all aircrafts turn to F-16s. Ha, a magic! After an action... Migs land. The magic again!Oh, did I mention that F-16s had Israel markings? Another magic: obviously unarmed L-39 trainers are bombing enemies.And more magic: while all movie is situated in Europe, we can see a desert in almost any flying scene.Maybe the director wasted all his magic on things above, because action scenes are incredibly chaotic and also explosions look awfully as if pilots bombarded with molotovs.OK, OK, this is a movie. I should write about its story... wait. A story? Yes there is SOME story in this film. And its horrible as well.","My Caddy Limo was destroyed!!! Well, I had one just like it - Drove the hoi polloi and many of the Chosen Ones around Manhattan for a few years. That was a whole lot more entertaining than this movie I can tell you. Lordy, what a bomb - as in RPG go boom. I also drove a lot more stars in my white Caddy than appeared in this dud of a flick. Robert Patrick is a very serious actor and did a credible job with the nonsense he had to work with. Unfortunately, Rutger Hauer played his part like a red-nosed circus clown. If he couldn't take it serious why should his audience? The director should have kicked his butt off the set in the first hour of filming.The dialog was written by 10 yr old's for 8 yrs old's. Surprised there wasn't a whole lot more cracking up on the sets. Oh well, I am a movie fanatic - ergo - you must take the bad to get to the good.","Well, you know... Rutger Hauer and Robert Patrick both are really good actors. But WTF with this movie? The story was lame and the script was just terrible. The poor actors didn't have material to work with!The DVD cover invited you to a flight action flick. You would expect something like Top Gun... Huge disappointment! The flight action in this movie is so cheap that makes you puke. The aerial scenes are clearly taken from documentaries and some other footage sources, not made for this movie. And they didn't even care about the marks or the fighters models, taking for granted the audience will not notice it.As I said the story was lame. With a little effort from the writer and director it could have been very interesting. In short, it seems a B-movie made in the 70's.I feel very sorry for these actors who put their names here. They sure must be ashamed.","Ahh yes, this is one of those films. You know the one. You're red-eyed and bleary with fatigue, but you just can't sleep. The dogs of insomnia outside your door. You flip the TV on at about 3am....this is the kind of movie you get.The person who noted that Rutger Hauer looked pretty beefy for a POW is dead-on. Maybe they tied him down for those six years at a Chinese buffet or something. He's a hell of a guy though. He is an Air Force pilot, but he also has ninja skills riding on a truck and messing up missile programming, killing armed guards, and surviving tank explosions. There was also some pretty sad security on that military base. A fence a 12 year old could clime is all that stands between tanks that you can just jump in and ride. There are no guards there either? Robert Patrick goes into that munitions storage and comes out with an RPG which seems to magically reload itself. Hauer's tank also got off three shots....I thought a tank had to be reloaded after firing a shot? Hmm...The dialogue in the last ten minutes was gold. Hauer has killed Patrick's squad...and is heading towards the base to kill his wife...who of course is on the exact floor he blasts his machine guns into. Patrick says something like: \"You S.O.B., you're no pilot!\" Well, Hauer's character is an S.O.B, and he is also crazy, but he is a pilot and all. That's how this whole thing started.After Hauer's plane crashed into the water at the end, I expected him to spring out of the water, ala Jason in the first Friday The 13th, as Patrick walked with his wife and newborn child.","'Tactical Assault' is the first movie I've seen in which Robert Patrick plays the 'good guy'. Sigh sigh, because I started to hate it! But I'm here to talk about 'Tactical Assault'. And it wàs a disappointment! Where was the action I expected? And the cover of the video showed a Mig or F-15, whatever, but didn't they use F-16's ALL THE TIME??? Jeezes, if you make a movie about jets and such, try make it GOOD. To those who like that genre - I am amongst them - I seriously recommend to see 'Iron Eagle' once again, to forget this horrible experience. Too bad, actually, because Robert Patrick is a great actor. And I kinda expected a lot from this movie...!","This movie caught my attention when I read that both Rutger Hauer (Blade Runner, The Hitcher) and Robert Patrick (Terminator 2) were both in it, so me being a fool for low budget movies I decided to watch it.Hauer plays deranged Captain John 'Doc' Holiday whose got a grudge with father-to-be Colonel Lee Banning, played by Robert Patrick. Captain Holiday wants revenge because of an incident back in the early 90's when Banning stopped Holiday from \"having some fun\" when attempting to blow up a civilian aircraft which had flown into dangerous air space...sounds a bit silly doesn't it?Hauer's character in this movie reminded me a lot of John Ryder, the character Hauer portrayed in The Hitcher. Hauer portrays Captain Holiday with the same evil, sarcastic and resentful attitude as he did with John Ryder. While Robert Patrick gets to play the good guy...for once.\nOverall, not a bad movie...felt like fellow fighter movies such as TopGun and Iron Eagle at times. Hauer still deserves better than these low-grade movies.5/10","Several years after he was presumed dead after an \"incident\" in the Iraqi no-fly zone after the first Gulf War, Captain John \"Doc\" Holiday shows up, eager to pick up life where he left off. Former flying partner and friend Colonel Banning helps him get his old job back and the two are in action again over Bosnia as part of a NATO operation. However, even though the report of the incident looks clean, Holiday blames Banning for the years that he lost and seems not all together right in the old head there. As minor peculiarities turn into out and out barking behaviour, Banning starts to worry.Fifteen minutes into this film and I had yet to hate this film as much as everyone else seems to have done; I had managed to ignore the made-up history and enjoy the scenes of jets flying and men going \"alpha roger, I'm taking fire\" etc etc. However at this point the film shifted slightly to Banning's wife and the back-story where Holiday starts to semi-stalk the family. With this the film joined the heap loads of films that already exist within this similar \"man/woman appears normal but gets obsessively crazy\" genre (trips off the tongue doesn't it) and it doesn't even match the low standard of the majority of them.Let me just deal with the whole setting  that of military action in Bosnia in the mid-nineties; now I'm no expert but the whole thing was not only horribly simplistic (Americans were the good guys in the conflict and those on the ground were \"bad\") but it is also plain wrong. I won't linger on this too long though because facts are not the point of this film and, to be honest, if you're coming to a Rutger Hauer film expecting a history lesson then you deserve all you get. Ironically the rubbish history provides the only pieces of vague entertainment as the usual stock footage of planes and explosions and the actors inside planes against blue screens at least provides some distracting motion even if it never is exciting or involving (and potentially annoying if you pay too much attention to the identity-swapping planes). Meanwhile the usual stalker stuff plods around on the ground until, finding itself with no dramatic drive at all it simply ends with a ludicrous set piece involving tanks that have the keys left in them and a dogfight high above Bosnia. It is poor throughout and only made more annoying by just how obvious and predictable it all is.The cast act as a clue as to how average this is going to be, given that it features two men who really don't do anything to deserve bigger projects that this. Hauer is obvious from the start to the end and never makes for an interesting character. In his defence, Patrick at least comes across as a sort of real person but even he can find little of value to use in his performance. Glasser is the damsel in distress and does nothing but that. The support cast are all average, with nothing to do but spit out the required lines in the basic required fashion.Overall this is a very poor film that tries to milk two genres but does neither of them well at all. The Top Gun action is distracting but full of stock footage and historical stupidities; meanwhile the stalker stuff on the ground is plodding, dull and tiresomely predictable. Don't make the same mistake as me  just avoid this.","(Warning: Some spoilers ahead.)What an incredibly crappy movie. It makes Iron Eagle 2 seem good.The story is as follows: Captain Holiday (Rutger Hauer) gets shot down by his friend Banning (Robert Patrick) to stop him from shooting down a iraqi airliner filled with innocent civilians. Six years later Holiday returns to take his revenge. Among other things he, sitting in a tank, chases Banning (now a colonel) and his pregnant wife over a field. He manages to fire shells and drive the tank at the same time. After getting the tank blown up by a bazooka, he miraculously survives and steals a fighter jet. With it he shoots down a number of allied fighters before attacking the NATO headquarters in an attempt to kill Banning's wife.An extra bonus is that major Baxter (who Holiday hangs in her office) has put the rank insignia on her right shoulder on backwards. Elegant.","I suppose it must be really difficult to film with the US Air Force. So difficult, the producers of this movie clearly decamped to Hungary and shot the whole thing with MiG-29s, MiL-24 Hip helicopters and La-39 Albatrosses for the ground shots, but with Israeli F-16s, Nellis-based F-16s and Israeli Phantoms for the aerial sequences. Okay, so maybe I'm just a plane nut, but some of this stuff was sporting dirty great Russian red stars, and pilots were flying one type and getting in and out of another.\nAs for the tank, who knows, but I bet it was a Russian one!","The late 1990s seems to be packed with dozens of low-budget, aerial action combat movies, in the same way that Top Gun generated a wave of wanna-be movies (e.g., \"Iron Eagle,\" \"Into The Sun,\" \"Flight of Black Angel,\" etc.) after its release in the 80s. \"Tactical Assault\" is just one of those military movies that hits the viewer with standard issue plot and an incredibly inconsistent storyline. It almost makes the low-budget Dolph Lundgren movies look good by comparison. Basically the story of \"Tactical Assault\" revolves around one insane Airforce officer (Holiday) attempting to inflict his anger and revenge on another (Banning), all while a military operation rages on in Eastern Europe.  It's basically the air-to-air version of \"Dead Calm\" combined with \"Death Race 2000\" in a sense. This movie is essentially insanity bordering on comedy. The funniest scene is in the end where Colonel Banning says \"hey, it's just a civillian vehicle\" about a dozen times to Captain Holiday who's about to 'accidentally' destroy a white, American cadillac driving haphazardly down a road.  The only redeeming value to this movie is Robert Patrick, who does a surprisingly good job as the hunted Colonel Banning.","Magnus, I too was annoyed that no one on the set noticed the USAF doctor had one of her shoulder boards backwards. It was also a joke to see Hauer stuffed into that tight USAF uniform with his long hair. Whatever happened to preparing for a movie role? Hauer definitely needed to drop about 40 lbs and get a freakin military haircut.I enjoyed the aircraft scenes but it could have been a much better movie is someone had paid more attention to detail. Top Gun wasn't a whole lot better when it came to an F-14 in one scene with certain types of missiles and fuel pods, then in the next scene, what is suppose to be the same F-14, now has a completely different set up.I think one of the best scenes of a military aircraft in a movie was the F-18 Hornet getting shot down by the missile in \"Behind Enemy Lines\" with Owen Wilson and Gene Hackman.It is nice to see Robert Patrick doing such a good job now as the Colonel on the TV series, \"The Unit\".Don","To correct the first reviewers aircraft comments.The Mig 29 are in Hungarian markings and also this air force operates the Hind Heli gunship and transport helicopters shown. Also featured in the attack on the castle are L29 Albatross plus a model of one. The F16 in combat scenes is in Israeli marks as are the F4 Phantoms and a Mirage. A NATO operated Boeing AWACs features. No argument about the continuity which is poor. Its an average action movie but is only saved from being below average by the inclusion of good footage of aircraft and being filmed on a former Soviet bloc airfield. The acting is adequate given the script.","A cheap, ineptly-made action thriller which tries to mix some TOP GUN-style aeroplane heroics with an on-the-ground plot involving Rutger Hauer seeking revenge on Robert Patrick for shooting him down in Iraq six years previously after he went berserk and tried to shoot down a passenger plane. Obviously the budget was spent on uniting the two once-were-great actors; Hauer for his memorable turn as an android in BLADE RUNNER, and Patrick for his excellent portrayal of the fiendish \"liquid metal man\" in TERMINATOR 2.Sadly, this film wastes their talents and makes them both look bad; Patrick seems to be a one-note actor here with an expressive face but little else, while Hauer is pure ham, laughable and unthreatening. You won't have heard of the rest of the cast, and you won't recognise them either. I may have been tired while watching this film but not many movies have me struggling to stay awake. The acrobatics and shooting in the sky have always been boring and thrill-free for me, while the tank chase at the end seems to be from a different film; as Hauer suddenly changes from low-key threat to all-out psychopath. This ending is kind of fun but it comes as too little, too late. TACTICAL ASSAULT is a typically generic (just look at that title) late '90s straight-to-video flick; seemingly made without any passion for the genres it covers and with no talent whatsoever. Give it a miss!","** Here be a little spoilers **My expectations when I started to watch this movie was not great. In fact, I expected a really bad movie, as many of these not very famous thrillers are. Now, this is no masterpiece either. The plot is predictable, and the fights are not very surprising nor long enough to build any amount of suspense. Hauer is his usual insane self (no, I don't mean he is insane, but his characters very often are), and he does it good. The other cast, including Patrick puts in some average performances.Well, as mentioned, not as bad as expected. If you have nothing other planned, watch in on TV or rent it, not that bad at all (but, do not expect any greatness)5/10"],"review-user":["Theo Robertson","mikestewart74","ma-cortes","ismitje","Arccos","vincevan","vocklabruck","RCamp48845","Hawks_Girl","Jonathan Horner","bob the moo","maggu","nigel0208","degracia","DJO189Doke","gary-1005","Leofwine_draca","Enchorde"],"review-date":["8 March 2005","8 March 2005","15 April 2011","27 October 1999","3 August 2005","25 May 2007","29 September 2007","24 July 2005","30 March 2001","31 July 2002","27 March 2005","11 August 2004","31 July 2002","18 October 2000","4 July 2007","23 December 2006","5 November 2016","12 May 2004"],"review-rating":["2","1","4","2","1","2","1","2","5","5","2","5"],"review-title":[" \" Rutger Hauer Wants Revenge \" ...\n"," Dialogue generated by a \"Speak & Spell\".\n"," Taking on among two crack fighter pilots full of dogfighting and impressive aerial action\n"," Mitchell burns up the screen!\n"," We are not idiots\n"," not worth the time investment\n"," Two great actors in a TERRIBLE movie\n"," Robert Patrick Must Stop Fat Lazarus-Like Hauer!!\n"," What a disappointment!!!\n"," TopGun meets The Hitcher\n"," A poor mix of Top Gun and stalker/revenge movie that does nothing well\n"," Worthless\n"," Another movie full of really bad aircraft choices.\n"," Dead Calm meets Death Race 2000...\n"," Uniforms, etc\n"," some good air footage\n"," A straight-to-video Broken Arrow rip-off\n"," Surprisingly not that bad\n"]}