{"review-url":["http://www.imdb.com/title/tt0138541/reviews"],"review-text":["And it got it in France ! Why not in the rest of the world while the studios keep churning out expensive post-Grisham trash (Will anyone remember him as a fine writer, and not the most betrayed-by-the-screen author this side of Stephen King ?) this one has it all. Okay, the situations are not always original, has minor plot holes and it has a tendency to be too clever some (brief) times for its own sake, but it actually delivers and is obviously a work of love. I'd be curious to know what the budget was. AND. for once, this is not a cheap Tarantino copy ! (Well, film noir didn't started with Tarantino, you know.) Will it once again be saved by Europe, like John Dahl's movies were, so Mr Guttierez can make another one like this ? If you ever read this, Mr Guttierez, thank you and se","What I really like about this movie is that the kidnapers generally show some intelligence...a rare thing in films.  They don't have many of the film clichés that plague this types of films--they don't openly fight showing little or no cohesion, a rift isn't created in which the hostage can exploit to get away, and they don't fall for the \"stall them and tell them it takes more time\" ploys.  The only two discernable \"stupid criminal\" clichés I noticed was opening up the case and gawking at the money in the gateway car and stopping the car to get another cell phone battery from the trunk...but there are other reasons for that.  I also like the way Rickman's and Thompson's characters play off each other...it's fun to watch.","Thirty pieces of silver and a kiss for luck. This one was another totally unexpected gem. Usually, I'm not even a suspense/thriller fan. This satisfying 100 minutes has more twists than a boardwalk pretzel. It has titillating erotic romance, reminiscent of \"Body Heat\" in more ways than one; it has cops and crime; political intrigue and just a dash of daytime soap. It has just the right touch of gritty violence that any professional \"by-the-numbers\" crime job must employ. Emma Thompson, (FBI AIC), delivers her role with grace and humor and gets my vote for best fake southern accent by a Limey. Alan Rickman, (local cop), who always seems to steal the show, is excellent but not overbearing. They work well as a pair. Lots of plot misdirection that never gets out of control and gets coherently reconnected at film's end. And who is this awesome woman, Carla Gugino? I want her to bear my children. Carla, if you're out there, let's do lunch","There are people who say it's sub-Tarantino.But I'm not a QT fan,by a long shot ,and I found this flick quite entertaining.There are enough twists to keep you interested throughout.My favorite is Emma Thompson ,whose playing is very tongue-in- chick :I love the scene when she's reading peacefully her book while eating Chinese food while they are waiting for an important phone call.The title is justified too,but you will understand it only in the last third.Hats off ,once again to Emma THompson,a first-class actress ,who agrees to play a supporting part and so lets lesser known actors shine a little bit.","I caught this on cable.  It started out well but I figured it would fall apart eventually but instead it got better and better. I don't know why it went to cable so fast and why  there  are currently no reviews in the database. It was an entertaining caper movie with great characters and truly unsuspected twists and turns set in New Orleans. Watch for great scenes: the Senators (Holbrook) put down of the detective ' .. don't ever even look at me again...'  as well as later, Holbrook's \"Apologize!' scene; the muscleman Reuben's method of showing how tough he is ; Coco's sexual heat scenes, Lizard's battle of wits with a determined FBI agent Sadie (Emma);Sadie (Emma Thompson) and (Rickman's) clever repartee. I did find the audio a bit difficult to follow because of background noise and character accents, and why an accountant was assigned by the corporation to deal with the kidnappers was unclear but on the whole an 8 out of 10 film.","Came across this film recently after so long hearing about it. It is an excellent not pretentious movie for people who loves film noir literature and films. Not \"camp\" but humorous. GREAT CAST! From the magnificent Carla Gugino and Emma Thompson to German superstar Til Schweiger, this movie is a feast for the eyes. Alan Rickman is very funny as the antagonist of gang. Would love to see spin off movie with this character and Emma Thompson solving cases and arguments between them all the time (much like Tracy and Hepburn, etc.)Intelligent story, nice twists and scope photography (don't watch unless it is scope because compositions are very rich).Sexy sexy sexy and very fun time.Best use of Just Like Heaven by The Cure ever (must see to believe!)********","Here we have a thoroughly satisfactory crime caper of the film noir variety. The plot has the usual ingredients  greed, sex, betrayal and revenge  but nicely blended and all proceeding at a reasonably fast pace. The casting of two serious British actors, Emma Thompson and Alan Rickman, as a couple of down-at-heel Southern cops is a bit weird, but it works. There's Coco, a gorgeous young femme fatale (Carla Gugino) and three other offbeat young crims, a steamy, authentic New Orleans setting, a kidnap gone wrong (a bystander is shot), hints of police corruption and a tense finale.The kidnap victim, played by Greg Wise (Emma's real-life partner, apparently) is a Bill Gates-like computer billionaire, though a lot better-looking, who is totally at a loss away from his keyboard  he spends most of his captivity quivering in a corner. I thought it was quite a neat trick to set his ransom at the level of his company's kidnap insurance cover - if you don't have to bear the loss you will be more likely to agree to the kidnapper's demand. The shot bystander turns out to have been the wife of a US senator, played by Hal Holbrook. Hal can do nasty political types in his sleep, but he puts plenty of effort into this portrayal.Our own Aussie Simon Baker-Denny as Coco's boyfriend and criminal associate brings plenty of cool to the role (a long way from the innocent young cop in E- Street) but Coco is the real stand-out. She's so hot you could fry eggs on her tummy yet she has a certain sense of innate decency that engenders sympathy. I don't really care if the film was directed by some hot young Venezuelan novelist (Sebastian Gutierrez) who is a fan of Almovodar (whose influence seems to have been limited to the primary colours used in the credits). We've seen the story and the characters all before - this is a Hollywood formula movie freshly prepared and presented with lots of silly bits and there's never a dull moment. Heck, Jamaicans can do bob-sledding  why shouldn't foreigners take over Hollywood? Yet the movie went straight to cable in the US. Silly Yanks.","I caught this film on a lark, never having heard of it, and not knowing what to expect.  It is a very well done plot twister, reminiscent of \"Body Heat,\" and with a great cast of unknown young people, backed up by more established stars like Emma Thompson, Alan Ricker, and Hal Holbrooke.  You're never really sure about what is happening until the end.","I found the movie Judas Kiss excellent. Carla Gugino's performance was extraordinaire, probably her best in her career.  Her facial expressions in many scenes, were unbelievably true to character, and they were exploited to its best by Director Gutierrez. All actors and actresses were very good in their performances. Emma Thompsom was, as usual, marvelous. Her acting capabilities are way above what would be required for this character, so she actually enhances it in the movie.The story, although sometimes over-intricate, is kept entertaining and pointed towards the end.  Very, very good. A movie not to be missed.  A story well weaved and brilliantly directed. Quality of film, excellent.","Sure there are some things about this one I didn't like (Emma Thompson's tortured opening lines; how the central murder could possibly have been planned; lack of atmosphere considering it was shot in New Orleans) but overall it was a real video find. Hal Holbrook's caustic brush-off of Rickman is a classic. Parents beware, though, this is a solid, solid R.","Loved this movie!! Great acting by Carla Gugino. Interesting story about a kidnapping that goes horribly wrong (don't they all?). Some surprising twists and turns in the film and the plot was easy to follow without being so convoluted as to be totally incomprehensible. It was a totally unexpected delight. More \"Quentin-ish\" than most films try to be.","What's the matter with you people? John Dahl? From \"Rounders\" and \"Unforgettable\"? TOO Quirky? Knocking emma Thompson and Alan Rickman for having fun playing against type? And somebody liked the Gingerbread Man?I rented this not knowing anything about it and found it about as nifty a video find as you can get. Never insulting, well thought out, funny, scary. I disagree with the naysayers, clearly. I thought the story itself was unremarkable but the great cast, which most likely means the director was paying attention, lifted it to super cool status. Good sound design also (much more appreciated in surround, but I'm not bragging). And yes, I'm a girl, so maybe it has a slight female slant (the guys in the gang are pretty worthwhile). All in all, a 9 and a hearty RECOMMEND.","Sure, there's stuff here that the Coens and Elmore Leonard have done before, but so what? If you want entertaining, lusty and smart -- \"Judas Kiss\" is near perfect. Prudes offended by tongue in cheek porn don't get it (Talk about getting your sex and violence out of the way straight up -- keeps your investors happy. That's independent filmmaking 101). As for the Brits making a bundle, I highly doubt it. This flick is clearly a labor of love and the budget probably not half of Mr. Tarantino's salary. Maybe guys don't like it as much as women. I thought it rocked. Go Coco!","Featuring a \"Body Heat meets Pulp Fiction\" plot, some delightful film moments, too easy performances from Rickman and Thompson, this first outing is solid and stylish. Well-written dialogue is delivered by a sexy young cast in a hit and run series of well-composed scenes. Political intrigue mixes with sexual dynamics against a crime and crisis backdrop. New Orleans provides historical richness to contrast high-tech communications tricks on the part of the kidnap gang. Recommended...","The efforts of a new group of young talent bolstered by Alan Rickman and Emma Thompson, 2 extremely gifted actors, makes for a thrilling and engrossing evening of entertainment. And I might add that Hal Holbrook shines as the Senator. This movie deserves five stars. I give it a ten on your scale. And the ending is PERFECT. I am constantly amazed at the ability of British actors to master our American accents. I was convinced that all the actors were born in Louisiana. And what finer locale for a mystery than New Orleans! The Big Easy, also known as the Crescent City, permeates every scene. As writer and director, Sebastian Gutierrez deserves high praise.","In the DVD era, you would think you could find pretty much any piece of crap committed to celluloid and for the most part, it's true. So WHY, WHY is it so hard to find this great little flick, clearly done by people who love noir as a loving homage (buit never descending into spoof land) of that most cinematic of genres. Emma Thompson and Alan Rickman are a HOOT in this and superstar-in-the-making Carla Gugino (KAREN SISCO, SIN CITY) does her now trademark red hot babe/great acting routine. This movie really has it all for fans of film. A b noir on steroids, the clever and steamy JUDAS KISS succeeds on every count.Please Columbia TriStar PLEASE release it on DVD soon!!!!!!","This was the first directing job by Sebastian Gutierrez, the writer of Snakes on a Plane and Gothika. Anyone who has read my reviews knows that I love capers, and this was a doozy. A kidnapping and a woman shot in the process. The FBI has Emma Thompson on the kidnapping case and the Police Chief (Roscoe Lee Browne) assigns Alan Rickman to solve the murder, which happens to be a Senator's (Hal Holbrook) wife. These two make an outstanding pair as they work together.The kidnappers/murderers have lovers Simon Baker (Land of the Dead) and the ultra hot Carla Gugino (Sin City), along with a couple of partners. They kidnapped a hotshot computer mogul and they run his accountant all over town before they get the dough. Things go fast from there as new twists and turns are brought in. The whole thing is brilliant and definitely a \"piss in your pants because you can't go to the bathroom or you'll miss something\" thrill.Now, to be completely honest, I would have given this movie a 10 if there had been more of the movie the security guard was watching in the opening. I would have loved to see more of Beverly Hotsprings and Yvette Lera, but, hey, that wasn't part of the caper; just icing on the cake.Thompson and Rickman should definitely make more movies together. One treat:Agent Hawkins: So fill me in. Detective Friedman: That remark could be misconstrued as sexual harassment, Agent Hawkins. Agent Hawkins: Let's get it out of the way then: you've never worked under a female superior before. I got to where I am by pushing paper and playing nice - I've never actually fired a gun before, I'm only in this job to prove to my father I'm not a coward. I give decent head, so I got promoted before all the worthy candidates, all of them men, all of them equally gifted at fellatio but there was a gender quota to fill. I'm also stupid and idealistic; you are hard and cynical, and usually right. I am secretly in love with you but I have a hard time showing it. Did I skip anything?Damn, that's great dialog! Gutierrez not only directs a great movie, but he can write too!And, did I say Carla Gugino was hot?Put this on your list.","Why this movie went straight to cable, I'll never understand.  It had great twists on the classic car chase, with Alan Rickman and Emma Thompson spinning out of control and Emma getting a very unglamorous bloody nose!! Alan was great as a Columbo type detective and almost consistently got the Southern accent right;  he just can't seem to avoid spitting out those final consonants, which no Southerner in their right mind would do.The  dance with the 'bad guy' after Miss Hot Pants interviews him was exquisite.  Quirky, funny, touching: I agree.  Why can't/wasn't this brought to the screen?  And at least, when do we get it on video?  I'll never understand the thought processes of people who decide to distribute drivel and leave quality on the shelf. Alice","Emma Thompson, Alan Rickman,Carla Gugino and Gil Bellows are a DELIGHT in this sexy caper. This film is smart, edge of your seat entertainment for adults, and what a relief that is in these days of big concept predictable cartoons. Great music and camera work add to the fun that is this New Orleans-set puzzle. Highly Recommended. Ten stars!","First off, this film is effective all the way through.  There are so many good actors in this film it's hard to know where to begin.  The four kidnappers work well together on screen.  The best part of the movie for me would have to be when Coco is talking about the time her and Junior had met, trapped in a meat freezer.  A song by \"The Cure\" is playing that has \"just like a dream\" in the chorus, don't know the actual name, but it is very romantic.  When Junior is giving her oral sex while she is holding herself up in the air by a meat hook, it is so romantic.  She says \"I can't even look at a steak now without getting wet\".  On to Alan Rickman and Emma Thompson who as two law enforcement employees, have some innocent romantic moments of their own.  Hal Holbrook gives a good performance as the revenge minded senator.  Anyway, this movie has a lot going for it.  I am surprised with so many good actors this movie doesn't have a bigger following.  I am a big Carla Gugino fan, and she is hot is this one, even though maybe only a nanosecond of her fabulous breasts.  Enjoy  6/10","It's not easy to find Judas Kiss on VHS (it's not available on DVD), but I wanted to add this rather obscure movie to my Alan Rickman movie collection.I can't understand how the talented Mr. Rickman gets into these mediocre films? Judas Kiss boasts several wonderful actors, an interesting plot and intriguing twists, but its strange visual wanderings and chopping editing ruined what might have been a great crime drama. Many scenes seem to be missing vital information to explain the character's actions: Why was our hero immediately suspicious of his bosses? Why did he mistrust the detective he replaced? There were times when I honestly couldn't tell if the director meant Judas Kiss to be a legitimate crime drama or a campy spoof. Why else would he toss in a topless/alien/lesbian porno scene in the first two minutes (that little surprise certainly made me scramble for the remote since my kids were playing nearby!)? Did he purposely instruct his two distinguished English actors (Alan Rickman and Emma Thompson) to use such awful New Orlean's accents? As an Alan Freak, I confess that I still thought Mr. Rickman was sexy: in a rumpled, weary, \"take-him-home-and-tuck-him-in\" sort of way.Judas Kiss isn't a great movie, but it does have some intriguing moments, but I don't recommend it unless you're trying to immerse yourself in Alan Rickman.","A fairly enjoyable kidnapping caper set in New Orleans, but its main downfall in my opinion is that it packs way too much political intrigue and double-crossing, and not enough of the sexy young actors, scenes of vibrant colour, original cinematographical style and biting humour. These aspects combine to give refreshingly daring cinema, which makes a whole bunch of recent stuff look unbearably dull. Let's hope Sébastian Gutierrez continues with such flair - he looks like a talent to watch out for. The mismatched bunch of small-time crooks in the film are outshadowed by the investigative partnership of Emma Thompson and Alan Rickman, the humour of whose scenes is much needed in making the movie what it is. The pair pull off their obligatory southern drawls just as well as the Yanks, and it's a delight to hear these two stalwarts of British cinema yapping away to each other with Lethal-Weapon-style fluidity...just a pity that the only scenes they have the opportunity to steal are exclusively theirs. Anyway, with a bit less politics and authoritarianism (!), the film would be near-perfect, so I'll give it a healthy 8/10 and hope that a few people remember it a bit better than the box-office did.","I admit it;I bought this movie because Alan Rickman is in it, and I'm a huge fan of his. But I was surprised by the whole film. I got a little worried when the first scene I saw was a lesbian porn-movie, but that was soon forgotten. The plot is good, and I was totally into it from the first minute. The camera's been used to give you a kind of stressed feeling, and I think I got a little stressed with the characters. This movie left me staring blankly at the screen first time I watched it, and I wasn't sure what I'd just seen. Now that I've seen it a couple of time, though, I think it's a great film. I couldn't help but notice how much Rickman's character, David Friedman, resembles John Rebus (books by Ian Rankin). The same sarcastic, dry humor. Old battered car. Divorced, one daughter. Likes to do things his own way, and doesn't let a beating stop him. The only thing I slightly disliked about this movie was that you felt like you were thrown into the last episode of a tv show, not knowing what had been going on before. I felt there should have been more both before and after. But in the end, that's the charm of the film. You're thrown into it, and before you know it it's over and you're left wondering what the hell just happened. I recomend this one. Really recomend it!","I got this movie from eBay mainly because I'm gay and I love Til Schweiger. However, it's one of those movies that, when you watch it a second time, you never say to yourself, \"Hmm. I forgot about this boring part. I'll go make popcorn.\" It doesn't have that part. It's a very fluid and constantly interesting film. And, yes, Til Schweiger is worth it, if nothing else. But, it's a great movie even for straight guys."],"review-user":["Phroggy","mr_ergo","Lary9","dbdumonteil","rich-106","quickas","Philby-3","jwhit67720","Vieux","monagan","BigDog-18","Chimera-6","Kilroy-55","TKo-2","Nimbo","reno-47","lastliberal","Alice-9","rattata","campblood13","alanfreak","screamer-13","Trinity83-2","im00sev"],"review-date":["7 June 1999","22 February 2002","7 October 2000","19 May 2004","24 April 1999","16 April 2007","10 June 2000","5 August 2001","28 February 1999","1 January 2000","6 December 1999","19 November 1999","18 November 1999","17 September 1998","24 April 1999","8 September 2007","2 July 2007","15 July 1999","23 June 1999","13 December 2002","22 January 2005","21 August 2000","29 November 2002","3 May 2001"],"review-rating":["8","8","8","10","8","10","10","10","10","8","10","6","4","8","7"],"review-title":[" Deserves a big screen !\n"," Generally an intelligent caper film\n"," Intelligence with pace\n"," Really entertaining\n"," Unexpected pleasure\n"," Hard To FInd But Worth it\n"," New Orleans (or was it Fargo?) not so confidential\n"," A Sleeper, But Great\n"," A good, entertaining story, well directed, performed and filmed.\n"," well worth renting\n"," A Sleeper!\n"," This is what you go to the video store for.\n"," Rad!\n"," Tight and stimulating 'film policier' set in steamy New Orleans.\n"," A Masterpiece\n"," Hard to Find, Perfectly realized\n"," You're a better driver, but I'm too proud to admit it.\n"," Great Acting by Emma and Alan as the Detectives\n"," Bravo Judas!\n"," Carla Gugino and Alan Rickman, how can you go wrong?\n"," Mr. Rickman looks sexy in a rumpled, weary \"take-him-home-and-tuck-him-in\" way\n"," A film which, despite having already....\n"," John Rebus goes American\n"," A secret jewel.\n"]}