{"review-url":["http://www.imdb.com/title/tt0101675/reviews"],"review-text":["I love this movie, and even own it on laserdisc.Most critics of this movie miss what I think is the real point of this hilarious spoof. Here is an alien monster out to wipe out the bunch of them, and to a man (and woman!) they are acting more like teenagers in the back seat of a car than interstellar warriors! The cast is totally concerned with making out with each other, and to heck with the monster, or anything else for that matter, in a truly bizarre attempt to commit group suicide. The Dead Space is really between their ears!Yes, it is basically a remake of Corman's Forbidden World, but effects (especially the robot) are better and Marc Singer is more believable as the heroic (?) Ranger.This is great stuff, and it becomes more of a hoot each time you watch it! It's one of the most entertaining travesties you'll ever see!","I saw Alien.  I loved Alien.  Dead Space is no Alien.  Take Alien and leave out Sigourney Weaver and other credible actors, remove artful direction by Ridley Scott, eliminate wonderful special effects, extract suspense, banish a sensible, thought-provoking script, exile any kind of passion in the material and you have this mess of a film called Dead Space.  What a complete bore!  Master thespian Marc Singer stars as the space vigilante out to help a space station in the middle of cheesy special-effects land.  Soon due to biological testing, a metamorphic mutant is created to fight disease only it ends up becoming a behemoth of evil trying to kill every person alive.  The mutant goes through several excrutiating special effect stages including an adolescent stage where it resembles not a little a mini-Godzilla.  The film was a test of my endurance not to fall asleep or fast forward or turn the television off.  Roger Corman produced this innate rip-off and he should be ashamed.  At least if you are not going to use something original, try and do some justice to your source.  The film is so bad that there is even a softcore sex scene which happens in a dream!  The only dead space in this film was the 80 minute void that I can never replace!  Whew!  Bow Wow!","STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsThe plot,as it were,has Marc Singer as a character called Captain Krieger who along with his robot,er,Tinpan (Rodger Hall), zooms about the universe doing not a very lot,it would seem.Until,that is,he answers a distress call from a research facility by the name of Phaebon,where a potentially lethal virus has been discovered.Before long,all manner of hell has broken loose and the virus (that,by the end,has somehow inexplicably taken the form of a giant monster) must be stopped.Only 70 minutes long.Only 10 characters featured.Yet Dead Space still manages to be a total Dead Zone of a film.I was enticed to view this very obvious B movie on account of a nice looking cover of a skeleton in a spacesuit.Needless to say,none of the characters featured are ever seen in spacesuits and neither are any of the characters astronauts.Misleading advertising or what?And the actual film itself is nothing worth watching,despite it's (extremely) compact running time,with it's droll script,bland characters and special effects that could be bettered by the standards of a Wrigley's Spearmint Gum advert.Tinpan was cool,but that was a robot who belonged in a much better movie.Actually,he's a very,very poor man's C-3PO,but I've got a thing for robots (nothing sexual,but,you know).12 year old DTV garbage is still garbage.Tinny and one mildly effective jump scene are the only reasons why I feel in any way lucky to have seen what should by rights be in it's DTV grave yard by now.*","If I am to remember correctly this movie is not half bad until the alien 'hatches' then it goes so far downhill it'll make you feel like your on a rollercoaster.One particular point sits in my memory, the 'alien' has just escaped and the scientists need to go to the surface for some reason. They make a big deal about how hostile the surface is and how no one could survive on it, but damn it he has to go out and fight the alien. Then they override the computer and open a hatch to ... the south western US! Now we get to see some dude in a suit walk around for like 5 minutes while they blow smoke infront of the camera to make you feel like your in an alien landscape. I believe you can even spot tire tracks on the ground and a rv in the back ground. Then we get a close up of the actor's face looking surprised, a close up of some purple weird dragon head going 'ROAAR' and then the scene of the dude running back to the hatch.My friends in I had to break down and start laughing, it was one of the most inexplicatble sequences in film since the burlesque scene in Glenn or Glenda.","Stop me if you've heard this one before: A murderous mutant monster runs amok on the research facility Phaebon. It's up to rough'n'tumble trouble shooter Commander Krieger (Marc Singer coasting on thespic automatic pilot) to stop the beast. Sound familiar? Yep, this particular picture is a hopelessly lame'n'tame rehash of \"Forbidden World,\" which in turn was essentially a sleazed-up early 80's drive-in discount version of \"Alien.\" Alas, \"Dead Space\" crucially lacks the scuzzy verve, slimy content, and sardonic wit that made \"Forbidden World\" such a trashy treat. Flatly (non)directed by Fred Gallo, with a trite and uninspired by-the-numbers script by Catherine Cyran, a crippling lack of suspense and energy, dim, murky cinematography by Mark Parry, drippy characters, cruddy (less than) special effects, precious little gratuitous female nudity, terrible dialogue (\"This thing is tough and adaptable -- and growing at an incredible rate!\"), poorly staged monster attack set pieces, a draggy pace, mild gore, a generic hum'n'shiver score by Daniel May, and a limp conclusion, this lead-footed clunker makes for a heavy chore to endure. The cast struggle gamely with the lackluster material: Laura Mae Tate as feisty genetics expert Marissa (who at least bares her nice breasts once), a pre-\"Breaking Bad\" Bryan Cranston as hard-nosed, terminally ill doctor Darden, Judith Chapman as chilly scientist Stote, Randy Reinholz as craven, wormy jerk Tim, ravishing redhead Lori Lively as perky computer specialist Jill, and Rodger Halston as Krieger's creaky, sharp-tongued robot partner Tinpan all do their proverbial best, but they are fighting a no-win uphill battle all the way. This deadly dull dud earns a point or two for its mercifully brief 72 minute running time, but overall it's still really bad and hence unworthy of your time.","So let me get this straight, Roger Corman for reasons only he himself knows decided to remake the film \"Forbidden World\". Not only did he remake it, he apparently decided to take out most of the nudity, make it less gory and make it a bit more talkative. Why? I am sure everyone out there would like an answer to this, but I am guessing he wanted to make a more serious version or something. This one is basically a lot less fun version, you have Marc Singer and his robot pal going to a planet cause an experiment has gone array. So yes, like \"Forbidden World\" only with all the fun stripped from it. It was not all bad as there was one rather good jump moment I was not expecting and there was a couple of good gore effects, but overall \"Forbidden World\" has this one beat in nearly every possible way. I mean the effects were even better in that one, as was the music. In that one it was a really nifty 80's sounding set of tracks while this was very forgettable. Stupid twists and the ending was not as cool either. That and another thing that made this film kind of hard to watch was the fact it featured more creature in the air vent scenes. I have watched a lot of horror movies the past few weeks and this theme is getting old. The monster does not look as good, the robot looks dreadful (though it did not look great in the original) just not enough here. Even the girls were more attractive in the other film. Though this film features one of the most unheroic moments I have ever seen near the end that had me chuckling too. Still, if I did not get this on a double feature set of movies along with \"The Terror Within\" I would be a bit more ticked off.","The filmmakers apparently had enough money to be able to afford decent makeup effects, but not enough for a creature that would move around and attack convincingly. We never get a chance to see the \"monster\" move from one place to another - whenever that happens (supposedly), the camera focuses on the \"terrified\" reactions of the humans that are nearby. And when a man is attacked by it, he simply seems to be holding an inanimate object against himself so that it won't fall to the ground. This is still not the worst \"Alien\" rip-off around (the two \"Xtro\" films are even worse, for example); it's actually sufficiently entertaining if you've got 68 (!!) minutes to spare.     (*1/2)","I am the kind of person who can enjoy a good B Movie if it has some kind of redeeming value to it, but Dead Space has nothing to redeem it!  This is the kind of film that will make you frustrated, restless and sick to your stomach. Bad acting. Lame story.  Terrible effects.  Horrible, excruciating dialogue. Dead Space has it all!","The first thing about \"Dead Space\" I couldn't help noticing immediately was the running time displayed on the back of the VHS-cover. It states 70 minutes! Okay here on the IMDb the running time is supposedly 80 minutes, but that probably includes trailers and/or full closing credits. 70 minutes is practically nothing. How can you possibly tell a proper Sci-Fi tale in such a short period? Well, see below this review for a couple of tips on how to make your film shorter, but usually it's not the best idea. But hey, \"Dead Space\" is a very redundant movie in general. It is more than obvious that this thing got made in probably even less than a week, under the strict surveillance of Roger Corman. It's a remake of \"Forbidden World\", which was released also by Corman not even ten years earlier. That movie was a shameless \"Alien\" rip-off, so basically \"Dead Space\" is the remake of a rip-off. Only Corman is shameless enough to make the exact same film twice and then still include footage from his other work, like \"Battle Beyond the Stars\". Marc Singer, who here looks like he might be Kevin Bacon's older brother, plays a lone space macho cowboy who arrives on the research facility planet Phaebon together with his pet-robot Tinpan after they picked up an S.O.S signal. He literally crash-lands amidst a group of scientists that are trying to develop a virus to destroy another virus; namely the lethal Delta-5 disease. Little problem, however, their anti- virus developed itself into a monster and finds pleasure in killing off the crew members. One of the main reasons why I liked \"Forbidden World\" so much was because of the awesomely cheesy monster design and special effects. That film had an amazing low-budgeted B-atmosphere going for it! \"Dead Space\" is also very low-budgeted and cheesy, but it never manages to bring forward the same irresistible charm or outrageous enthusiasm. I guess that's a privilege exclusively for 80's movies. The mutant monster looks like a clay dragon and the killings are very uninspired. This is one film that can easily be skipped, except of course if you're a sucker for cheap and amateurishly directed \"Alien\" rip-offs like there are literally hundreds of out there. As promised, I'm going to reveal some tips about how to make your movie fit right into the 70 minutes limit. For example: combine sequences! Director Fred Gallo knows that every self-respecting Sci-Fi movie needs (A) a sex sequence, (B) a dream sequence and (C) a monster-bursting- through-the-chest moment. In \"Dead Space\", these three classic scenes are one and the same! The lead girl dreams she has sex with Marc Singers and witnesses the creature bursting through her chest right before waking up! Secondly, if you have a eight-headed cast but not the time to introduce them, start by killing two of them before the cause of the problem is even properly established. If you don't want to waste too much time on the remaining six neither, then make sure they live up to the most commonly known stereotypical trademarks of cinema. One of them needs to be an obsessed scientist who'll continue with the experiments no matter what, one of them needs to be an insufferable coward and you also need one strong female cast member to put the link with Ellen Ripley in \"Alien\". See, it's easy.","Delta 5 is a disease which has no cure and kills whoever has contracted it, with spaceman(\"freelance controller\") Marc Singer landing on a research station containing scientists attempting to find a cure. A cultured creature(a \"metamorphic mutant\") breaks loose ala ALIEN and starts attacking crew members. The creature infects those it slashes with a flesh-eating virus that ravages the body relatively quickly and so avoiding it's mandible claws are a must. Singer's guns seem to have little to no effect on the creature so another method will have to be discovered pronto or else no one will be able to survive.DEAD SPACE is umpteenth movie to use BATTLE BEYOND THE STARS footage of battles in space(Singer encounters some \"resistance\" while answering the distress signal which lands him in hot water)and probably features Roger Corman sets. You have the chest bursting scene where the mutant breaks from it's human shell(the creature, in it's initial infantile form, invaded a victim through the nostril of her nose!) and continues to grow at an alarming rate(examples which mirror ALIEN, also). The uniqueness of this sci-fi horror's creature is that it is a virus which needs to kill because that's what it is designed to do. A virus kills cells and humans, as you know, have plenty of them. It travels through the science installation's vent system and becomes such a nuisance that anyone who has the misfortune of ending up in the same room with it normally doesn't last very long. As other like-minded individuals, I seek after low budget 80's sci-fi creature features, which rip off hits like ALIEN, producing clones on a smaller scale with B-movie casts. DEAD SPACE operates in this fashion which is why I enjoyed it more than the mainstream crowd who would probably find this laughable junk not worthy of their time. Director Fred Gallo shoots around the rubber creature as much a possible, attempting to make it scary, even though the grand reveal(and this is often this case) turns out to be a bit underwhelming. It does allow Singer to play hero, and he gets to show off his muscular physique for the ladies. Singer has a partner in a robot who operates under his command(basically a man with props glued to a uniform)he calls \"tinpan\".","Leave it to Roger Corman to ripoff one of his own ripoffs! This direct-to-video flick is actually a remake of the Corman produced ALIEN-riff FORBIDDEN WORLD (1982), going so far as to use footage from that which is actually footage from BATTLE BEYOND THE STARS. You still with me? Marc Singer takes over for Jesse Vint as the space soldier who answers a distress call from a scientific community. Once he gets there with his robot sidekick, he finds out the scientists have been performing a series of genetic experiments that have unleashed a big ol' monster. This isn't nearly as good as the original but it does feature a fine alien and nice performance by Singer. He really can make anything just the slightest bit better with his everyman delivery. The only place where the remake trumps the original is in the insertion of nudity. WORLD had a really gratuitous bit with Vint and a female companion in a sauna type area. This is even more casual as the nudity is inserted in a dream sequence a character has during all the chaos. Finding a place for that in the film's short 72-minute running time is perhaps its biggest merit.","From the Roger Corman factory comes this extremely forgettable remake of his 1982 production \"Forbidden World\". The Beastmaster himself, Marc Singer, stars as Commander Steve Krieger. Exactly what he's a commander of, I don't know, but he picks up a distress signal from the scientists on the planet Phaebon. These morons have been monkeying around with genetics and viruses and they've managed to create a mutating, evolving life form. It's up to Steve to save the day, with some occasional assistance from the doofuses around him.If people seek out \"Dead Space\" for any reason, it's likely because they learned that it was a very early credit for the Emmy winning actor Bryan Cranston. Because of him, the acting is a hair better than you'd usually be subject to in a LOW rent production like this one. Directed (not so well) by Fred Gallo, it's routine through and through, and highly uninspired. The makeup and creature effects are actually not that bad, thanks to the efforts of Gabe Bartalos, an old pro at this sort of thing. If one is already familiar with \"Forbidden World\", they'll experience a fair bit of deja vu, as this version sticks pretty close to the original plot.Singer is passable as the hero, and the ladies (Laura Mae Tate, Judith Chapman, Lori Lively) are pretty. Randy Reinholz delivers a useless performance as an equally useless character named Tim. Cranston does his best given the circumstances.\"Forbidden World\" wasn't exactly a movie crying out to be redone, and \"Dead Space\" itself isn't a movie crying out to be watched very often - if indeed one watches it more than once.Four out of 10."],"review-user":["gord-174-593106","BaronBl00d","davideo-2","jboy55","Woodyanders","Aaron1375","gridoon","the_northlander","Coventry","Scarecrow-88","udar55","Hey_Sweden"],"review-date":["29 November 2011","11 April 2001","7 December 2003","12 February 2003","18 November 2010","22 November 2010","1 January 2003","7 October 2000","12 September 2010","6 September 2010","6 August 2007","25 May 2016"],"review-rating":["8","3","3","4","1","4","5","5","4"],"review-title":[" not bad at all\n"," My Time Watching This Film Became....Dead Space!\n"," Can a film that lasts only 70 minutes really be this boring?\n"," A Rollercoaster of a movie\n"," In space no one can hear you scream rip off\n"," \"Dead Space\" aka the \"Forbidden World\" remake.\n"," Inept sci-fi.\n"," Possibly the worst movie ever\n"," Alright people, we have two days to make this movie so let's hurry!\n"," Dead Space\n"," Corman rips off Corman\n"," In space no-one can hear you yawn.\n"]}