{"review-url":["http://www.imdb.com/title/tt0109000/reviews"],"review-text":["The phenomenon Helge Schneider defies easy description or quick categorization. Yet, for the international audience not acquainted to him, one could say he's something like a crude mix of Weird Al Yankovich and Andy Kaufman, adding a foible for Jazz music and 70s outfits. While his stage performances already are eccentric, his movie works are simply hilariously outrageous.\"00 Schneider\" is, in my opinion, Helge's best movie. He stars in the two leading roles - police detective \"Kommissar 00 Schneider\" and murderer-villain \"Nihil Baxter\", and also in a precious smaller role as physician \"Dr. Hasenbein\".In the opening scene, we see how modern-art-loving Baxter accidentally kills the circus clown Bratislav Metulskie, from whom he has bought a malfunctioning used Jaguar, when a beloved sculpture slips out of Baxter's hands, fatally hitting Metulskie. Upon reading about the incident in the newspaper, 00 comes back from retirement to investigate the case with the support of his loyal sidekick, Lt. Koerschgen, who is played by an elderly actor bearing the same name. They pick up Baxter's track quickly, and interrogate him at his weirdly decorated mansion (one of the movie's best scenes!), but initially fail to gather any proof. The story winds through many turns, with several scenes that don't always really contribute to the progress of the plot but are hilariously funny, such as a daydream by 00 (including the most unusual view on a running man's brief-clad crotch in movie history), a police-department party during which Koerschgen gets into a row with the chief and has to be hospitalized, and a visit at the already mentioned Dr. Hasenbein's. Baxter, then, is finally caught attempting to escape to Rio de Janeiro on a plane.Always worth special mention is Andreas Kunze who in this case plays 00's wife, as he's usually appearing in drag performing women's roles in Helge's Movies.So all you folks out there looking for new laughs, I strongly recommend this movie. The catch? You have to understand German (as I doubt there's an English version around)...","Not only is this movie a twisted comedy that does not attempt to \"bring home every punch  line\", but instead, offers an atmospheric, almost contemplative type of humor unparalleled by  others. The storyline is coherent, unlike some movies by other comedians. Also, the camera  is brilliant. One instance would be where Nihil Baxter's head is next to his lamp in the first portrayal of his house. Some shots are taken in an almost British film noir manner, seen in  some detective movies from the seventies. Even though there is an apparent distortion about the characters Helge plays, they are rather  well observed, and satirical and heart-warming at the same time. Helge embraces his  characters somehow, and a happily floating absence of cynicism makes the movie a  treat you may want to watch more than once.","Helges best movie by far. Very funny, very surrealistic. If Bunuel made a movie starring Buster Keaton as Krusty the Clown it would look like this.Brilliant performances by the cast we already know from other Schneider movies, especially Helmut Körschgen as the sidekick of 00Schneider. (Andreas Kunze who once more plays the wife in this one is a bit annoying though). And of course Helge himself as Nihil Baxter is absolutely incredible.P.S: if this movie had a proper merchandising i would really like to buy a replica of that \"Holz ist\" painting.","Movie about a man (Baxter) who kills a clown (Methulskie). Some police officers (00 + Koerschgen) try to solve the case.  Mr. Schneider acts as both Baxter and 00.I went to see this movie at a local theater here in Germany. There were about 20 people there to watch it and after half an hour 10 of them left.Later on in the Film - during interrogation by 00 and his decrepit, alcoholic assistant - Dr. Baxter remarks upon a form of sexual intercourse that would be impossible to engage in due to the number of people present. In my opinion this is one of the high-points of the movie but it caused another 5 people to leave.The 5 remaining people enjoyed the movie a lot because... The movie is very funny - it has the kind of humor that makes you laugh instinctively and it´s also one of the strangest / trashiest films I have ever seen.","i consider this movie as one of the most interesting and funny movies of all time. It has so much highly intelligent thoughts in it, that anybody who thinks the movie is awful did not get it and is not able to recognize really deep philosophical themes, which are in it (in all the 3 Schneider movies) without a doubt. Several universities in germany and throughout europe have made studies on Schneider's way of seeing things. By the way, Helge Schneider is a very intelligent and sensitive person and on of the Jazz-musicions in germany (maybe europe). He is mostly inspired by the great M.Davis and T.Monk. So if you do not like him, it is ok, but please do not try to convince others that he might be stupid, cheap, boring or not funny. Because if you had to face this opinion in a discussion and if you are willing to really look into the art of H.Schneider you would have to \"surrender\".","The German-comedy-\"star\" Helge Schneider in his third entrance in cinemas! When I first saw this movie when I was in the 7th grade, probably 13/14 years old, I thougt it to be awful. I recognized the meaning, or let's say non-meaning of this movie first when I saw it a second time many years later: if you get involved in the strange kind of Helge's humor, it's extremely funny, but I understand people who are not able to laugh about it.The whole movie, for example the strange characters (Helmut Körschgen: a perfect actor or always drunken?)and locations, gives me the impression of being a crazy, surrealistic dream, arised from the mind of the genius Helge Schneider.If you like a different kind of humor,strange and weird (and drunken) characters, look for \"00 Schneider\" and the other Helge-movies, especially his debut, the amazing \"Johnny Flash\"!Try to watch all four one after another: an unforgettable experience!!!","And this description fits probably all of Schneider's work. His brand of humor and approach to comedy is so unique that it is either exactly your cup of tea or you won't find it remotely funny. I have to say, for me it is probably the former. This 90-minute film is over 20 years old and was directed and written by lead actor Schneider himself. It also says \"Brötchen\" as writer and I am not sure what this means. It's actually the German word for bread roll, probably just a joke by Schneider. The movie features him as a police detective and even if the character comes out of retirement (to solve the murder of a clown) in this one already, there was a sequel two years ago, almost 20 years after the original movie. And he was only under 40 back then anyway. Here, 00 Schneider (obvious Bond reference) chases Nihil Baxter (also played by Schneider just like some other characters).There are some factors which apply to this film and also to most other works of Helge. He does not cast famous actors. He mostly casts his buddies or people that he worked with before, even if they are completely unknown. Female characters are often played by male actors in drag. And there is lots of music in his movies. He is a talented saxophone player, but the music is mostly goofy and all over the place just like the action. Also, you will hardly find a film maker or actor who has more random dialogs than Schneider does. I don't do drugs, but I would imagine that watching one of his films under the influence must be one of the weirdest experiences ever. Don't do it though. drugs are bad. And this film is very strange as well without them.Finally, I would like to say once again that I like Schneider (he has 6 children from 4 different women by the way), also saw his comedy show live already. His humor is certainly not for everyone and has almost exclusively to do with personal taste, so I won't criticize anybody who does not like his work. It may be especially hard to appreciate for foreigners as the dialogs are so random that they may be difficult to translate without losing the comedy of the situation. recommended.","I'm sorry but I cannot even partly agree with some comments on this awful piece of sh...English is not my native language, because I'm a German citizen, so please do not blame me for inappropriate grammar structures or something *gg I cannot understand why this movie got such a high rating? 6.3??? Are you kidding me? This movie has completely no sense, not even a seem of good acting...When I looked at the comments on The Da Vinci Code, which has - I think - nearly the same rating, I had to bang my head on the table , because I watched 00 Schneider directly after Sakrileg, and oh my god , there are worlds between them.The majority of the posters in this board tears every hyped movie to pieces while rating this crime of movie making with a 6.3 and denominates Helge as a genius. Of course , he knows how to make money, but I think the main aspect of your opinions is the fact, that German isn't your native language and you just ignore - or rather don't notice the bunch of crap which is said in the sentences. OK , I must confess that some scenes ARE funny, but all in all , a 6.3 is just too much for my compatriot ;)"],"review-user":["Heizer-2","swisswuff","dilund","atf-crew","schlusenba","g-m-schaefer-my","Horst_In_Translation","djfreeloader"],"review-date":["22 August 2002","8 May 2004","12 August 2005","21 June 2000","15 December 2000","20 September 2003","15 April 2015","4 January 2007"],"review-rating":["10","10","10","6","6","4"],"review-title":[" Helge rules!\n"," Fantastic movie\n"," Helges Masterpiece!\n"," Mr. Schneider's portrayal of the demented Dr. Baxter is simply brilliant.\n"," incredible deep thoughts\n"," pure surrealism!!!\n"," Love-or-hate movie, certainly very different\n"," Stupid , stupider...Helge Schneider\n"]}