{"review-url":["http://www.imdb.com/title/tt0114537/reviews"],"review-text":["It has to be said that this film is definitely one of the better \"bargain bin\" movies out there - I'd feel a bit cheated if I had paid £15 for it, but at about £1.50 I felt that I definitely got more than my monies worth. The film can't quite decide if it wants to be \"Mad Max\" or one of the Clint Eastwood \"man with no name\" spaghetti westerns, and as such is stacked with clichés from both. Even the manic loony who hangs out with the bad guys in \"Mad Max\" is there.That guy from \"Blade Runner\" also cops a good billing, although he only turns up at the beginning and the end of the movie.Favourite bit - for me the punch-up on top of the oil refinery - if you look closely you can see the \"post-apocalyptic\" rush hour traffic thundering past in the distance as the two protagonists knock seven bells out of each other.Get several lagers in, a few pizzas and sit back and enjoy what is ultimately lightweight but entertaining drivel.","Ok, when I rented this several years ago I had the worst expectations. Yes, the acting isn't great, and the picture itself looks dated, but as I sat there, a strange thing happened. I started to like it. The action is great and there are few scenes that make you jump. Brion James, maybe one of the greatest B-grade actors next to Bruce Campbell, is great as always. The story isn't bad either. Now I wouldn't rush out and buy it, but you won't waste your time at least watching this good b-grade post apocalyptic western.","Generally, films from PM Entertainment and me don't get along (I'm thinking of LA Heat here). In my opinion they tend to stop just short of putting \"I'M CRAP! DON'T BUY ME!\" in fluorescent writing on the DVD cover. So you can imagine the sense of fear i felt when my friend returned from the bargain shop with this, 'Steel Frontier'. At first my suspicions seemed justified, the typical trailer which revealed most of the plot and action set-pieces was present and correct, and the opening to the film was fairly cheesy. But as it continued, something occurred to me: Steel Frontier isn't that bad. Although it's not particularly ground-breaking in any way, it's obvious that this film has a fairly big budget, due to the amount of explosions on show here, and it's these combined with the fairly non-stop action which give this film a fast pace which puts it ahead of many of its rivals. The acting on display is fairly competent too, and the presence of B movie icon Brion James in particular adds to Steel Frontier's credibility. All in all this is a film which won't particularly stick in the memory, but is a great way to pass the odd hour or two - kind of the film that wouldn't be out of place on late night sci-fi channel, for instance.","As other reviewers have noted, this movie is a cross between (i.e. stolen from) stories we have seen before. Specifically, this looks like Clint Eastwood in High Plains Drifter inserted into Mad Max. Remove Clint's cigar, and replace with a cigarette; remove his horse and give him a high-tech motorcycle, and voilà, an updated drifter. In this movie, the \"hero\" is even more blatantly a \"Savior\" than High Plains Drifter. Now our hero has long brown hair, suffers a wound to his left side, and his entry into town is preceded by a plea for \"salvation\" by the surviving townspeople--a pretty transparent reference to a \"Second Coming.\" I watched the movie on a hot, humid morning. Sleep was impossible and upon arising at 4:30 am, there was nothing else on TV. So the movie served its purpose. While unoriginal, with characters that are almost comic caricatures, the movie is still somewhat entertaining...at least at 4:30 in the morning.","Steel Frontier brings us to a stereotypical post-apocalyptic future of sorts. It conjures up a man without a name or title (Joe Lara) beyond that of a \"drifter,\" similar to Clint Eastwood's versions. A gun-wielding vagabond on a spiffy motorcycle who facially resembles Jesus Christ wandering through a toxic wasteland of society reduced to rubble and sand. At first glimpse, he finds a dying man with both legs torn off left to die in the middle of desert. This dying man pleads to the stranger to quickly end his life, as the stranger ponders over him for a few brief moments and decides...As the film's introduction continues, a recovering town by the name of New Hope shows a community of people ambitiously moving around tires, which now are being used as a natural resource (film does not elaborate on that, it does not really need to in the given context), as a harbinger of Mad-Max styled vehicles (seemingly gang members) approach the timid town of citizens.Once the vehicles arrive, we start to see all sorts of random odd-balls armed with rifles and pistols step out of the vehicle and ensure their grandiose of chaos on these innocent people, while the supposed leader of the outfit, General J.W. Quantrell (Brion James) casually enters into a barber shop with a rather frightened barber.The town's police force enters the scene, and is obliterated in mere minutes. After the General's done with his shave in the barber shop, he comes out to proclaim the town, as a (self) designated military outpost under the United Regime. Later, we see him discussing plans for new leadership for the town, as he dresses down the cowardly Mayor Kissmich (Quinn Morrison) who was nowhere to be found, during the siege. The General appoints his son as the #1 leadership of the town a little to the chagrin of Ackett (Bo Svenson).A few of the town's henchmen ride out onto the dusty roads to find runaways, and more or less runs into their possible Grim Reaper...the long-haired vagabond on the motorcycle. The henchmen taken by surprise to find someone crazy enough to be hanging out in such dangerous and desolate desert all by themselves with no care in a doomed world. One can observe fairly quickly that stranger is very much toying and play childish games with them. A stereotypical, but yet very excellent choreographed action car chase takes place. The stranger slips up... or does he? He enters the town as a man that no one has seen, before and the chaos really hits up. The film borrows elements from The Man with No Name and the Mad Max series, but it holds its own water very well. The ending actually turns out be a bit of surprise, and kind of ironic ... not quite as it seemed at the beginning of the film. The action scenes remain top-notch and exhilarating, as usual like with most PM action produced films. The characters are actually well-written for what most would consider to be a run-of-the-mill B-movie.","It's another one of those universes where they drive around so they can find gas so they can -- drive around some more.No-goodniks take over a town. Mysterious stranger shows up, takes on the no-goodniks. We've seen it all before, in a variety of places, including some bits which seem to be lifted directly from a book series I could name. \"Deathriders\", yeah, right.*Lots* of car chases, explosions, crashes, fights; improbable gunplay, improbable futuristic gadgets, improbable dialogue.I'll hand it to them -- they went to a lot of trouble to set up the \"society\". They also tried to throw in a bit of thoughtfulness amongst the havoc. And for a virtually unknown movie, the havoc is pretty major -- lots of stunts and pyrotechnics.It isn't perfectly awful, but this viewer finds it mighty tedious.I'm not sure why they set these things in a post-Apocalyptic world, as there are obviously already enough ruined buildings to go around (in this case, in the California desert).Bo Svenson goes through much of the movie looking pained, with good reason. Poor Brion James tries hard, but...The constant barrage of explosions, gunfire, and cussin' would make this a good choice if you wanted to annoy your next door neighbors late at night.Back onto the trade stack it goes.","In a post-apocalyptic future, survivors live in a dirty makeshift town named New Hope. It seems tires are valuable so workers toil away in the tire yards. One day, a band of marauders known as \"The Deathriders\" roll into town. Through violent tactics, they sack the town of New Hope and institute J.W. Quantrell (James) as leader. Quantrell then makes his son, Julius (Victor) Mayor. Their plan is to institute what they call the \"United Regime\". But a savior arrives in the form of a gunfighter named Yuma (Lara). He pits various factions against each other (not forgetting about Bo Svenson as Ackett, Kane Hodder as Kinton and Brian Huckeba as the immortal and show-stealing \"Chickenboy\"). Yuma attempts to save the lives of Sarah (Foster) and her young son as she is a widow trying to make it in this tough world. But there are many pitfalls along the way, not the least of which are desert-dwelling cannibals named \"Roach Eaters\". Will Yuma save the day and ride off into the sunset?PM attempts to marry two genres here: the post-apocalyptic actioner (in the vein of the Mad Max series but perfected by the Italians) and the Spaghetti Western (started and perfected by the Italians) with generally entertaining results. Like in the Italian post-ap's, cars have wacky contraptions glued to them and people wear wacky outfits. But because this is a PM, it has much more action than the usual slog. There's pretty much non-stop shooting, chases, stunts, fights and blow-ups. There's even minimal dialogue at the outset of the movie, telling the story mainly visually, which is difficult to do. But this is a PM synthesis of Yojimbo (1961), hence For A Fistful of Dollars (1964) and For A Few Dollars More (1965) (and any number of Clint Eastwood's 60's/70's output - including a bus chase reminiscent of The Gauntlet, 1977) along with a futuristic twist. So you get what's going on here.Even the name \"Steel Frontier\" indicates what you're in for: \"Steel\" indicating the future and \"Frontier\" indicating the Western. There's also some biblical symbolism worked into the storyline, a lot of which revolves around Joe Lara looking especially like Jesus this time around. He puts in an especially charming performance - this really is Lara at his absolute best. A location in the movie is even reminiscent of fellow Lara vehicle American Cyborg: Steel Warrior (1993). Maybe he lives in that industrial wasteland for real. You know Kane Hodder because he wears a hat with a Jason logo on it, and the guy who plays Julius has orange hair, making him, naturally, \"Orange Julius\". Svenson puts in a standard performance. Brion James should have been more involved.Because there is terminology such as \"The Drylands\" and the tire farmers are derisively known as \"tire suckers\", this would seem to be PM's Neon City (1991). But Steel Frontier is far better than that movie. To see PM's take on not one, but two classic genres together in one film, don't hesitate to see Steel Frontier. And did we mention Chickenboy?For more action insanity, drop by: www.comeuppancereviews.com","Lots of action and violence in the Mad Max genre of things with a western twist. While all the acting was great, the best performance in the film is given by Brian Huckeba as the character \"Chicken Boy.\" Much better than Vanilla Sky!","Steel Frontier tries ever so desperately to be a stylish spaghetti western to the likes of High Plains Drifter but ends up being an embarrassment to the likes of Spice World. God, the way the actors were performing, they thought they were making the movie of the century. They all suck, and whoever wrote their dialogue is a moron. Ugh! This movie is Mad Max meets High Plains Drifter if it were directed by a retard. Nothing good exists within this cesspool of butt. Avoid.","STEEL FRONTIER is an open copy of the MAD MAX films, particularly THE ROAD WARRIOR, made by the guys behind PM Entertainment. As usual, there's not much in the way of sense or style in the script, but the action is fast and furious and there are plenty of car chases between various armoured vehicles to keep you watching. The hero of the piece is an effeminate Jesus lookalike with Clint Eastwood touches who takes on an evil murderous gang led by the inimitable Brion James. As is usual for PM films, the bits between the action feel laughable at times, but the explosions and the fights look great. Watch out for Bo Svenson slumming it and Kane Hodder as a heavy, complete with Jason logo on his beret.","I made it about 8 minutes into \"Steel Frontier\" before I turned it off. Then, glutton for punishment that I am, I watched some more the next day. Today I had to iron a pile of clothes, so I decided to finish the movie, and that was its own punishment. Here's what I don't understand: Robert Rodriguez and Shane Carruth each spent $7,000 on their debut features and created two remarkable movies. Yet here we have two directors with arguably way more money, and they churn out a huge, steaming pile of crap. Let me see if I can figure out the logic: \"It's 'Road Warrior' but it's like a future Western. We'll get the cheapest 'actors' we can find, we'll have my mentally challenged cousin write the script, and we'll spend the budget on a bunch of explosions. We can't lose!\"Seriously. I don't think even the MST3K guys could improve this. But if you insist on watching it, I recommend getting very drunk first.","If you take the films, Mad Max, Beyond Thunderdome, and the movie Steel Dawn with Patrick Swayze, you will have a pretty good idea what the film is about. The only problems is, that the film lacks the production values of either, and represent mainly cheap copy of the former two. True, the film has plenty of action, but asks the viewer to suspend belief. No one can shoot a 50 Caliber Machine gun by holding it in his hand - and miss everything to boot, nor can you shoot at a group of people with an automatic weapon and miss the whole bunch. There is also a problem with poor editing, when the school bus flips over, it is easy enough to see the cannon used to do the job. And the lady driving the truck through it is superfluous, since she had more than enough time to stop the truck. If you are interested only in mindless action and violence then the movie is easy enough to watch. But don't expect anything on paar with Thunderdome, or even the somewhat cheap and tacky Steel Dawn."],"review-user":["Paul-b-1","haans_guetyn","well_fed_boy","jannagal","SydneyIz","insightstraight","tarbosh22000","chickiebid","ThyDavideth","Leofwine_draca","Curtis G.","papccs"],"review-date":["18 August 2006","5 June 2001","5 July 2005","23 August 2006","15 July 2013","26 August 2004","14 December 2012","21 September 2002","1 December 2017","8 September 2017","11 April 2009","16 March 2006"],"review-rating":["7","10","4","6","7","2","6","2","2"],"review-title":[" One of the better \"Bargain Bin\" movies\n"," Post-Apocalyptic Western Action Flick\n"," Quite a surprise\n"," Steel (Steal) Frontier\n"," Criminally misunderstood, enjoyable post-apocalyptic action yarn\n"," Mad Max ripoff meets spaghetti western meets bikers-terrorize-a-town\n"," Chickenboy!\n"," Time Well Spent\n"," Shall Be Cutting Myself For Days\n"," Straight Mad Max copy with plenty of action\n"," Painful to watch\n"," A Real Turkey\n"]}