{"review-url":["http://www.imdb.com/title/tt0103886/reviews"],"review-text":["This story focuses on the birth defect known as FAS, or Fetal Alcohol Syndrome, a disease diagnosed too often among Native Americans.  In spite of the down-beat nature of this drama, the great script and the characterizations move the story along very well.  This is arguably Smits best performance.","This was a excellent movie. I deal with a child who I am raising that has FAE and watching this movie was more than word can explain. I also purchased the book and it was great. I would like to have a copy for my own use and so I can have my son's teachers watch it also.I would like to know if anyone could sell me a copy of this movie, let me use it for a time or refer me to someone where I could purchase it. Thank You, Myra I would recommend this movie to anyone who deal with children/adults with special ability's. This movie should be shown again on TV. The team of doctor's that have been tracking my son would also like to have a copy. His special Ed teacher has also asked me to try to locate a copy that he can have or that he can borrow.Thank You","The film gives an accurate picture of the problems faced by parents of FAS children.The movie is based on the autobiographical story by the same name, which dealt with Michael Dorris' adoption of his son Abel. When Abel was adopted little was known about FAS (Fetal Alcohol Syndrome) and Michael Dorris learned after the fact that Abel suffered from FAS.FAS children display a range of physical, mental, and psychological characteristics, more or less pronounced depending on the amount of exposure and when they were exposed during gestation. While Downs Syndrome children can often excel in school and jobs, FAS children, due to diminished cognition, judgment, and poor impulse control, amongst other things, generally cannot adapt to independent living.Dorris adopted three FAS children and his efforts almost singlehandedly brought into existence a national movement against fetal alcohol syndrome. Sadly, Abel was killed in 1991, at age 23, by a hit and run driver, and Michael Dorris committed suicide April 11, 1997.","Channel zapping one night I just caught the start of this movie and it hooked me from the beginning. It tells the sad story of an adopted child, Adam, whose mother left him after birth. The movie takes us through his childhood, and makes us discover a very disturbing fact from Adam's past. I will not reveal more, but it is a very in-depth movie and will intrigue you for sure. This was one of Jimmy Smits best roles in my opinion.","It has been years since I have been privileged to see this movie on TV. I only wish I could contact someone to see it again. I married a man with three children and two had Fetal Alcohol Syndrome. I didn't' realize this but seeing this movie helped me understand more about their problems and more about how I can love them and help them overcome their difficulties. My step-son is now 35 and thank the Lord he has blossomed wonderfully but still has many after affects of being born by an alcoholic mother. We speak every month to Rehab patients with alcohol and drug addictions and this sharing has truly made monumental changes in their behaviors and endeavors to start out a new life not addicted to drugs and alcohol. Please please let me know how I can get a copy VHS or DVD of this movie or when they will show the movie again on TV. If you have not been in these shoes, you probably could never understand its value. Thank you so very much.","A very good film, focusing on a very important issue. Fetal alcohol syndrome is a very serious birth defect that is totally preventable. If more families saw this film, perhaps more children would not end up like Adam. Jimmie Smits performs in one of his best roles ever. This is an excellent movie that takes into account a very special family with very important needs. This is not unlike thousands of families that exist in the United States today. There are children struggling with this world wide. The really important point here is that it all could have been prevented. More people should see this movie and take what it has to say seriously. It is well done, with important messages, handled in a graceful way.","This movie was everything but boring. It deals with reality. To the people who think this movie was boring, open your eyes to the real problems in our society. Our children are dying. The consequences of alcohol and drug abuse are not to be ignored. I work in a correctional facility as a chemical dependency counselor,and i deal with these problems every day. People of all ages and all walks of life are effected by the consequences of their alcohol and drug abuse. It destroys families, hurts people and leads to serious brain damage,all kinds of health problems, and death. It is all preventable. This movie should be shown in every high-school in the world. If anyone owns this movie and wants to sell it, or sell me a copy, please e-mail me at: Ottenbreit2@netzero.net thank you","Some may go for a film like this but I most assuredly did  not. A college professor, David Norwell, suddenly gets a yen for adoption. He pretty much takes the first child offered, a bad choice named Adam. As it turns out Adam doesn't have both oars in the water which, almost immediately, causes untold stress and turmoil for Dr. Norwell. This sob story drolly played out with one problem after another, all centered around Adam's inabilities and seizures. Why Norwell wanted to complicate his life with an unknown factor like an adoptive child was never explained. Along the way the good doctor managed to attract a wifey to share in all the hell the little one was dishing out. Personally, I think both of them were one beer short of a sixpack. Bypass this yawner."],"review-user":["bux","mlopez1898","annekem","damirc","justothers","bichselr","ottenbreit2","helpless_dancer"],"review-date":["13 June 2002","24 October 2006","13 May 2003","16 January 2001","2 April 2006","2 March 2006","30 September 2007","14 November 2001"],"review-rating":["10","10","10","10","10","10","1"],"review-title":[" Inspiring, insightful drama\n"," comments\n"," Autobiographical\n"," A very emotional drama.\n"," Comments on the movie The Broken Cord\n"," excellent movie\n"," Excellent movie\n"," Better title would be \"The Unbroken Bored\"\n"]}