{"review-url":["http://www.imdb.com/title/tt0117433/reviews"],"review-text":["RAGE is one of those movies I stop to watch whenever it pops up on TV. Why, I have no idea. Perhaps it is because of the frequent action sequences and the thousands of expended bullets. Perhaps it is to watch Busey playing an absolute lunatic, shouting into the camera and looking like he just took a hit of fun juice. Lamas is rather subdued and cleaned up for this one, as he plays a stiff necked FBI agent hot on serial killer Busey's trail. The boat chase at the end is a hoot, if a little long, and you just know Busey won't be coming back. He goes out with a decided bang. This is actually one of Lamas' better efforts, although Busey and Scheider are clearly slumming here.","What a show! Lorenzo Lamas once again proves his talent as a cop who committed the worst crime a good cop can commit, by being a good cop. Then, again, he shows how sensitive a cop can be, displaying a range of emotions like no other actor can except, maybe, himself in Terminal justice.HUGE ENJOYMENT!","Nick Travis (Lamas) is an FBI \"Mind Hunter\" on the trail of a serial killer named Dacy (Busey) (the changing of a \"G\" to a \"D\" in the name was pretty inspired). Naturally, Travis' ways are unorthodox, so the bureau teams him up with a new recruit, the pretty Kelly McCord (Cloke), a gung-ho agent who wants Dacy and his gang as much as anyone. Second-guessing them every step of the way is Taggart (Scheider), an FBI higher-up. But Travis has just too much integrity to bend to his ways. While the deranged Dacy is putting his team of psychopathic yokels into high gear, Travis and McCord must race against time to prevent any new victims before becoming victims themselves. Not just of the killers, but of federal bureaucracy and corruption. Will their relationship survive against all odds?In terms of technical qualities, this DTV effort stands above some of its contemporaries. It has a fairly glossy, high-quality look and feel that is just a hair away from being theater-ready. The cinematography is quite good, and the picturesque locales in Utah help that along nicely. The score is also big and booming. Lamas puts in a personable performance as the FBI agent on the edge (not to be confused with his roles as a CIA agent on the edge in the CIA films). He has as many cool one-liners as he does snappy ties in his wardrobe. Cloke, as his partner, puts in a good amount of effort and you've got to love those bedroom eyes. Roy Scheider could presumably do better (as he clearly demonstrated by being in Executive Target, 1997) in his career, but at least you get to see a fight scene between him and Lorenzo Lamas. You truly haven't lived until you've witnessed Roy Scheider-Fu.As far as Gary Busey...if he's trying to live down his reputation as a raving psycho, movies such as The Rage aren't helping him too much. We think the filmmakers renamed the film from Word of Honor to The Rage in honor of Busey and his performance. There are plenty of classic Buseyisms on display as he rants and raves with wild abandon.Also David Carradine is literally wasted in a nothing role that's almost as senseless as Klaus Kinski's in The Soldier (1982).Director Furie has had a long and accomplished career, so that probably accounts for why this film is well-made. There are some good stunts and chases, despite the fact that the plot is pretty by-the-numbers. But it paved the way for TV shows like Criminal Minds, which are just hour-long plots very, very similar to The Rage. Too bad Lamas, in the TV world, is known for Renegade - he should have been a Criminal Minds cast member. But Wings Hauser was on an episode recently. But we digress...The Rage might be a good movie to see if you want to break someone into the world of DTV movies. Its \"not quite ready for the movie theater\" feel should help gradually wean a newbie in.For more action insanity, drop by: www.comeuppancereviews.com","Too bad, I really like Kristen Cloke and Gary Busey.  But the director failed to put this together.  There's a lot of action, a lot of promise, but it all comes off hokey.  The director didn't do his job.  Promising action comes off lame.  So much seems contrived in a desperate attempt to save the film.  This version of \"The Rage\" (DirecTV credits it as 1996) simply isn't worth the time to watch it.  Another director would have done a better job.","**SPOILERS** Outragous movie about a gang of psycho Vietnam Vets who are at war with not only the US government, whom they feel betrayed them back in Nam, but the entire country as well for not giving them the moral and political support that they needed when they came back home.Led by a Rambo-like Art Dacy, Gary Busey,these angry and unstable individuals have taken their rage and hatred back to the states by waging a guerrilla war of their own against the people and law enforcement personnel of Wasatch County.Assigned to finding out who's responsible for over sixty murders in and around Wasatch county is both FBI man and women Nick Travis & Kelly McCord, Lerenzo Lamas & Kristen Cloke. We learn early in the movie that the man in charge of this FBI operation agent John Taggert, Roy Scheider, is actually more interested in doing in his agents on the case, Travis and later McCord, then catching the gang of psychos who turned the entire north-west into a free fire zone. Taggert has it in especially for Travis since an unfortunate shooting incident at a place called Quantico where because of his screwing things up caused a number of FBI agents and white separatists to be killed in a Ruby Ridge-like assault by the FBI. This foul-up on Agent Taggert's, not Travis',part cost him the chance of being promoted director of the FBI and he's held Travis responsible for that ever since.Meanwhile crazy Dacy and his and his gang of loonies are planing to wipe out the entire bunch of US government representatives who are about to have a big get together between themselves and the North Vietnamese at an exclusive compound outside of Bear Lake called the Bountiful Society. Shades of the super secret Bohemian Grove retreat outside of San Francisco? Hard to follow because of all the side plots and double-crossing going on all throughout the film that you find yourself having trouble keeping up with what's happening on the screen. The movie \"The Rage\" goes from a psycho, or psychos, on the looses to a gang of veterans who were mentally damaged and left out in the cold by their government to a crazed and unstable FBI man. Who's obsessed w with hanging the man who he holds responsible for his failures. To finally a massacre of the leadership of the US government during the Vietnam war by the veterans that they sent there to do the fighting.You have to say one thing about the movie and that is that it didn't skimp on the action scenes which were like every ten minutes. The ending mercifully made sure that the villain, Art Dacy, wasn't going to come back for an encore. I have to say that even though Dacy was as vicious and venomous as they come you could still work up some sympathy for him, not his actions, in the movie. Dacy was turned into a Frankenstein monster by the government who refused to grant him, and many other vets, the medical and psychological help they they so desperately needed and in fact even cut the meager funding that Dacy and his fellow psychotic already got. Taggart was an entirely different type of cuckoo bird who had no reason for his despicable actions, in regard to both agents Travis & McCord. Taggarts demise at the end of the movie evoked a much more unsympathetic response even by his fellow lawmen as the SWAT team leader. As local Wasatch Sheriff Dobson(Brandon Smith), who gunned him down before he could do in both Travis & McCord,reported as he called for back up by saying: Come on down boys and pack up this trash, we ain't no litterbugs\".","The first in a new style of films for Lamas- no tattoo's, motorcycles or karate. I, for one, miss them. But this is a serious movie. He plays a FBI profiler who has lived so long with the bad guys in his head that he no longer trusts anyone, including himself. Gary Busey is either a great actor or somebody I wouldn't want to meet in broad daylight on a crowded street. Kristen Cloke pursues Lamas as doggedly as she pursues the serial killer. There is one surprise after another as the story unfolds not the least of which is the ending. It seems to never come - there is always one more layer to the story. Cloke and Lamas start out as the good guys, turn into the bad guys and somehow end up the heroes. But it's definitely worth the rental price. For maximum enjoyment throw in a candy bar,a bag of popcorn and a soft drink. You're going to the MOVIES!","I saw this 1997 movie because I am a fan of Lorenzo Lamas (and of his father, the late Fernando Lamas). In my opinion, Lorenzo looked his best in this film, mostly due to his hairstyle and the preppy wardrobe that were flattering to him.As the plot progressed, I realized the movie was more than just entertainment or a reason to see a favorite actor. The story was about a ring of serial killers and the attempts of law enforcement to investigate the ring and bring the members to justice. There was adequate suspense, and I believe the violence was necessary to relate the story to the viewer.At the end of the film I was shocked to learn the film is the true account of horrendous murders that occurred in Utah. Furthermore, Lorenzo and his leading lady were portraying actual FBI agents who solved the disappearances of many young women and contributed to the apprehension of the ring. I believe the film is worthwhile as it informs the public about the dangers and capabilities of the criminal element.","This was so much better than i expected, the film oozed proffesionalism compared to other B-moive of this sort of budget. The script was good if a little formulaic but the acting was surprisingly good from all including Lorenzo and you always expect good standards from Scheider and Busey. Aswell as the good plot and acting the action is good especially the car chases and the crashes are A-class. All in all this is a rise above other B-movie thrillers and doesn't have to rely on constant nudity or a flow of cheesy puns to make up for budget and script defficiencies, its certainly worth a rent.","Aside from the horrendous acting and the ridiculous and ludicrous plot, this movie wasn't too bad.  Unfortunately, that doesn't leave much movie not to suck.  Do not waste your time on this film, even if you find yourself suffering from insomnia, as I did.  Watch an infomercial instead.","Only twelve reviews? Really? C'mon yall some one is not even trying. Do I think I'm better than this movie? Yeah, yeah I do, I am better than this movie and you know what, so are you, you are also better than this movie, together we share that, how special for us. Why was this movie made, jeez I sound like a broken record always asking that same old question, but with The Rage, to ask 'why make this movie?' is all the more valid,y'know, cause this movie sucks.The Rage, is one of those kinds of movies where you know right away it has virtually no market audience, I mean outside of the random few of us who enjoy bad bad movies, who was this movie made for? I mean could the investors for this film not find any Treasury Bonds to invest in, hell even scratch-off lottery tickets seem like money better spent. Lorenzo Llamas may have or may not have ever been charged with domestic battery , but his acting in this movie makes me think he battered his spouse, not sure on this one but you could look it up, Google it, it could be a family activity. Is the Busey in this movie? Oh God yes, and yet sadly restrained like Gary was still trying to hold on to his sanity...oh well.","Some of my comments might be seen as spoilers, you have been warned.The Hero heads out to fight the Villain and his Villainess. On his quest the Hero is assigned to the Heroine. From here on the plot has no twists and almost everything is underlined with heavy semi automatic fire.The Hero is burdened with guilt and he has an Enemy within the bureau. The Enemy turns out to be angry enough to want to shoot the Hero and the Heroine in the end after the Villain has been burned to cinders. My my, what a surprise.The Heroine is a desk rat that has longed for \"the field\" and everything that happens, no matter if it's close to rape or getting her head blown off, it's handled as a new interesting experience. The only time she shows that this first time on the field touches her in any way is when she thinks she might have killed two bystanders in a moving car. (She didn't.)The Villain leads a gang of ex-Vietnam soldiers and their goal is to get even with the people that, in the gangs view, abandoned them after and during the war. On their way to revenge they kill, rape and mutilate to their hearts content. Needless to say, the shots from the coroner's operating theatre are gruesome to try to keep the viewers at least mildly interested. The Villainess wears ludicrous wigs throughout the movie and in the end she has to fight the Heroine amidst the flames aboard the flaming boats.The special effects are average in quality but I couldn't keep myself from laughing when one of the pads laid on the ground to ease a fall was visible.As in so many other \"the police against military trained bad people\" movies, the police, in this case the FBI and the locals, arrive in badly ordered groups that even I could take out with a few grenades and a heavy machine gun.The movie goes on and on while they fire round after round, gasoline bombs go off as to simulate ... something going off and everything ends with a boat chase and the Enemy getting shot and that kiss that says that everything will be fine.","Of all the films I have seen, this one, The Rage, has got to be one of the worst yet.  The direction, LOGIC, continuity, changes in plot-script and dialog made me cry out in pain.  \"How could ANYONE come up with something so crappy\"?  Gary Busey is know for his \"B\" movies, but this is a sure \"W\" movie. (W=waste).Take for example: about two dozen FBI & local law officers surround a trailer house with a jeep wagoneer.  Inside the jeep is MA and is \"confused\" as to why all the cops are about.  Within seconds a huge gun battle ensues, MA being killed straight off.  The cops blast away at the jeep with gary and company blasting away at them.  The cops fall like dominoes and the jeep with Gary drives around in circles and are not hit by one single bullet/pellet. MA is killed and gary seems to not to have noticed-damn that guy is tough.  Truly a miracle, not since the six-shooter held 300 bullets has there been such a miracle."],"review-user":["xredgarnetx","kossity1","tarbosh22000","tsmithjr","sol-kay","yatahaeshadai","Sheila_Beers","supertom-3","Susie-7","jessegehrig","joorin","orpple"],"review-date":["1 March 2006","10 June 1999","1 January 2013","4 February 2004","1 August 2005","3 March 2000","20 April 2005","7 July 2001","21 January 2000","22 August 2013","25 November 2002","3 October 1998"],"review-rating":["6","10","7","1","5","8","8","8","3","2","1"],"review-title":[" Decent action flick\n"," a TV movie\n"," The Rage might be a good movie to see if you want to break someone into the world of DTV movies.\n"," Promising cast, poor directing = poor movie\n"," Your lucky I don't work for the Post Office!\n"," Originally titled \"In Pursuit Of Honor\"- the name change was a mistake\n"," A true story\n"," not bad at all!\n"," C**p.\n"," more like Gary a-Busey, or wait wait how about ' he has a substance a-Busey problem'\n"," Unbearable would be too hard, good would be too generous\n"," I've seen 1000's of films\n"]}