{"review-url":["http://www.imdb.com/title/tt0119009/reviews"],"review-text":["I was subjected to this terrible excuse for a made for TV movie.  I only watched it because I don't have cable and my only other choices were Golf, College Basketball, or local news.  The plot is very generic and has no substance that I could see, not to mention it had a major flaw in my eyes. The main character, Dr. Sorensen, is a washed up astronomer who believes that an asteroid named \"Nemesis\" will strike Earth, causing all life to cease.  He bases his belief on his discovery of cave paintings by an Aboriginee (I'm sure I spelled that one wrong).  The paintings show an apparent timeline, showing significant events throughout history, such as the building of the Great Wall of China.  All of the events are shown in perfect chronological order, and the very last picture on the timeline is Earth being destroyed.  Now to me, if the painting showed things that had indeed happened, why would the great Doctor believe that he could somehow change what was going to happen?  All that aside, the movie moved along with extreme formulaic precision.  There was nothing in the movie that surprised me at all.  The actors were not very good, and on a few occasions I just felt that they didn't even take the movie seriously to put forth enough effort to try to convince me that the characters were worth caring about. The whole movie was cliche ridden and a downright waste of time and money. I'd recommend Armageddon over this piece of crap any day.  At least Armageddon has some good acting (compared to this), not to mention the eye candy that is Liv Tyler.  Now that I think about it, Golf isn't that bad.......","I saw this movie on TV and loved it! I am a real disaster film fan, and this one was great. The cast was made of some really interesting people. Connie Selleca is always great. And William Devane is in a league of his own. He can play both comedy and thriller in the same movie like few others can. The story line is great too. The thought of being able to follow a time line of what will happen, and to use this time line to prevent a global disaster is an interesting idea. And this movie brings it out in such a way that is almost totally believable.","I've always been a big fan of movies where the Earth is at stake and that was the reason I watched this film. The plot was good and it started pretty well but half way through the plot begins to creak and the dialogues begin to croak. Although we do see the americans and the russians firing nuclear missiles at the meteor rather than each other (for a change). The effects looked as real as the lochness monster. If u want to watch astronomical fiction then I'd recommend Deep Impact or Armageddon.","Hey! I loved this movie! I think it covers a lot of bases (car chase, travel, intrigue, creativity) and the possibility of the time line is a great idea. Connie Sellicca and William Devane are wonderful and their roles are totally believable! Ed Marinaro and Marsha Warfield played interesting parts. I have seen Marsha doing comedy, so this was a change for her. I would like to be able to acquire it on DVD and add it to my small but growing section of science fiction movies. Then, I could watch it when I'm in the mood for a great old Sci-Fi movie. Does anyone know where I could get a DVD copy of the TV series \"The Phoenix\"? It's another great show for its time!!! Again--Great Movie!","When I saw this movie I thought there would be no action but there was. There was gun fight, a car chase, and a father-daughter kinda feud. It was so good I saw it twice. If this movie is on TV or video i reconmend it. I give it an 8 out of 10.","Having to choose between fifth re-watch of MI:1, a cheap made-for-TV-romance or this one, I decided to have a ridiculous, bad variation of Deep Impact and Armageddon.Well, although the effects were really cheap and the science was awfully wrong (again), the story was fun to watch and the acting was OK for a TV movie. Some sequences were unintentionally hilarious, e.g., a shootout with hundreds of bullets in a hallway without anyone being hit.If it runs on TV and you don't really find a better alternative, it won't kill you to watch this one.Right after this, I'm in for a real piece of sh** and watch Stranded (2001/II)."],"review-user":["JB007LTK","CRICKETNC52","hitmannet","l_talbot","ab-2","daPeda"],"review-date":["18 March 2000","30 January 2005","15 February 2000","21 May 2016","6 September 1999","13 August 2005"],"review-rating":["1","10","5","10","5"],"review-title":[" Bad acting and a weak plot make this a real winner!\n"," Doomsday Rock\n"," Disappointed!!!\n"," Great Movie! Loved It!\n"," An excellent movie to see!\n"," Not extremely bad.\n"]}