{"review-url":["http://www.imdb.com/title/tt0264935/reviews"],"review-text":["As a hard-nosed cop investigating an apparently motiveless murder, and appearing to unravel as she does so, Sandra Bullock does something approximating to real acting in Barbet Schroeder's overly familiar thriller. Ryan Gosling and Michael Pitt play a couple of high school kids who commit a Loeb/Leopold style crime, planting a number of false 'clues' so that the police will build up a picture of the killer. They even have a suspect lined up. Of course, the one thing they didn't bank on was Bullock's chip-on-the-shoulder uberbitch detective.Schroeder does not build his film visually. It has a conventional TV movie feel to it and, despite being well played, Pitt's nerdy all-knowing geek is a bit too formulaic. But the film holds you nevertheless. Schroeder displays a storyteller's gift for how things should develop, (though a subplot involving an earlier violent event in Bullock's life seems like an unnecessary intrusion). And as the cock-of-the-walk arrogant yet vulnerable rich kid killer Ryan Gosling is the real McCoy. He can convey charm and menace in equal measure and often in the same moment and confirms his status as one of the best young actors in movies at the minute.","Barbet Schroeder's \"Murder by Numbers\" starring Sandra Bullock is solid work, though not particularly compelling. I am a big Sandra Bullock fan, and she is effective here as forensic detective Cassie Mayweather, who is not very likable and a broken person too. However, there is a sense of detachment inherent in the story structure. It's about the perfect murder executed by two spoiled sociopath teenagers, Richard (Ryan Gusling) who is the cool one, and Justin ( Michael Pitt) who is the sympathetic geek. Basically, Richard and Justin kill a young woman, because they have nothing better to do on a school night. They are very smart and very arrogant which is normally not a bad thing, but it just doesn't work here. Tony Gayton's script does a great job of detailing the investigation of a puzzling murder, and it is truly by the numbers. We have these two punk kids flaunting their superiority, and we just want them to take a fall. This is not a great exploration into the dark side, like Schroeder's \"Reversal of Fortune\" about Claus von Bulow. There are interesting turns in \"Numbers\". The movie is not so much a thriller, but rather a character study of Cassie. Sandra Bullock balances the bravado of Cassie, her fear of letting people get in with her, and her secret past. Bullock brings courage and strength to a suffering character. Her partner and sort of love interest, Sam (played by Ben Chaplin), is more a plot unconcealing than a real character. Though Chaplin does the bewilderment thing very admirably. The other nice touch is having Richard and Justin involved a strange sexual attraction. The most interesting thing about \"Numbers\" are Pitt and Gusling. There are many entertaining twists and turns throughout the movie. Everything is done very competently. I saw the movie about a week ago, and in retrospect I like it a little more than I did when I saw it. However, it is just not inspired work. Sandra Bullock and Barbet Schroeder deserve a lot better, and so do we.","I predicted too many things in this movie and the only thing that kept my interest were the two young actors playing teenagers.  They seemed to have the stronger and by far, more interesting scenes. They definitely seemed to have more to do than our star, Sandra Bullock.Bullock always plays this independent character that lives alone and has predictable \"back story\" issues.  I would like to see her do something a little more challenging.Not bad, just not great. 6/10","Two rich, bored high school boys (Justin and Richard) enter into a demonic pact, which leads to a battle of wits between them and a smart, determined female detective (Cassie) who is haunted by her own demons. The film's underlying premise is certainly relevant to contemporary American culture, but the story is poorly plotted. The POV keeps shifting back and forth between the two boys and Cassie.I was not interested in Cassie's tortured past, nor did I care about her relationship with her assistant, Sam. These plot points interfered with the more compelling story of two young men hypnotized by the \"philosophy\" of crime.Indeed, the film works when it focuses on Justin and Richard, and their efforts to second-guess, initially the cops and then later, each other. Michael Pitt (as Justin) gives an adequate performance, and Ryan Gosling (as Richard) is more than convincing. I would have reduced the time spent on Cassie and Sam, and added some back story about Justin and Richard to give viewers more insight into the boys' motivation.The film's visuals are adequate. There's some good camera work in the film's first and last twenty minutes. In keeping with the film's many cinematic clichés, the climax is a melodramatic cliffhanger ... so to speak. Still, the suspense was gripping. It kept me guessing as to who was going to do what to whom.Despite a convoluted and, at times, confusing plot, \"Murder By Numbers\" is worth watching for its provocative premise, its suspense, and the acting of Ryan Gosling.","Cassie Mayweather (Sandra Bullock) is a homicide detective with a disturbing past, she and her partner Sam Kennedy (Ben Chaplin) are called in to investigate the murder of a young woman found abandoned in a ditch. When everything seems to point at the killer, Cassie's gut tells her that things are not quite as they appear, and the real killers find that they can't hide as easily as they first thought.Murder by numbers does have some good intrigue and suspense in the plot, and yes it does try very hard to do something a fresh and different, but in the end it just seems pretty run of the mill.6/10 It entertains and it does have a good cast, but its just not quite sharp enough on the details.","There's something frustrating about watching a movie like 'Murder By Numers' because somewhere inside that Hollywood formula is a good movie trying to pop out. However, by the time the credits roll, there's no saving it. The whole thing is pretty much blown by the \"cop side\" of the story, where Sandra Bullock and Ben Chaplin's homicide detective characters muddle through an awkward sexual affair that becomes more and more trivialized the longer the movie goes on. Although Bullock is strong in her role, it's not enough to save the lackluster script and lazy pacing. Ben Chaplin's talents are wasted in a forgettable role (he did much better earlier in the year in the underrated 'Birthday Girl') as well as Chris Penn, who has a role so thanklessly small you feel sorry for a talent like him. Anyway, the plot really isn't even a factor in this movie at all. The two teen killers played by Ryan Gosling and Michael Pitt are the only real reasons to see this movie. Their talent and chemistry work pretty good and they play off of each other quite well. It's too bad they weren't in a much better all-around film. Barbet Schroeder is treading way too safe ground here for such a seasoned filmmaker. Bottom Line: it's worth a rent if you're a genre fan, but everyone else will live a fulfilled life without ever seeing it, except maybe on network TV with convenient commercial breaks.","When the dead body of a woman is found in the woods near the river, feisty homicide detective Cassie Mayweather (Sandra Bullock) and her new partner, Sam Kennedy (Ben Chaplin) are assigned to the case. Determined to solve the crime, Mayweather follows her hunches and microscopic bits of evidence, focusing her investigation on two teens: Justin Pendleton (Michael Pitt), a brilliant, misunderstood nerd, and Richard Haywood (Ryan Gosling), a smooth talking, spoiled rich kid. From the beginning, the audience knows that this unlikely duo has formed a secret bond that pushes the boundaries of morality and the law in their attempt to commit the perfect murder and experience complete freedom. It's up to Mayweather, who buries herself in her work in an attempt to forget her own tormented past, and Kennedy, a transfer from Vice who is working his first homicide case, to ignore the stereotypical profiles and see past the obvious in order to solve the crime.Murder by Numbers is an interesting and entertaining small little thriller that doesn't excel but never disappoints either. The film is gripping, engaging and has this somewhat mysterious atmosphere that creates quite a bit of tension. The story does have some small plot holes but nothing that will ruin the film. Gosling delivered a great performance as usual and I can see why he felt attracted to his project, the film ends up being more of a character study then a thriller often reflecting on the human nature. Michael Pitt was excellent as the ostracized teenager and Sandra Bullock (who also served as producer) did OK as the seasoned detective Cassie Mayweather. What really threw me off and dragged the film down was not so much Bullock's performance but the way her character was written and her past story. It was extremely cliché and contrived. Still, I was entertained by what I think is, a decent and well acted thriller.6.5/10","It's a swell thriller: a reasonably sophisticated plot, with some neat twists and turns, good camera work, and a kind of satisfactory ending. But just as with the murder story in question, the flaws become apparent at closer examination.Most important, the characters are not sufficiently presented and explained. The deadly duet shows a very close relation, but not what keeps it so close. It would be easy enough to understand, if they were lovers. Then their quarrel over a girl also makes sense. Since they are not - as far as the movie shows us - their relation remains a mystery.The same, to a lesser extent, is true about the detective duet. Bullock is not really able to convince with her tough exterior to hide inner wounds, although that should be easy for an actor of her experience, and her male colleague gets no room in the film to show us why he stands her, after what she puts him through the very first days they work together.Although it's mainly a thriller, I guess this movie would have needed some additional efforts on the drama of it, the emotional processes included in it. Maybe it's all too logical - like numbers.","This is exactly what Hollywood does badly. Very Badly. Typically awful who-dunnit featuring more bluffs and double bluffs than you could shake a stick at. This movie is up there with horrendous plotless rambles like Copycat, Along Came A Spider and even Kiss the Girls. Horrendous in that it is possible to work out just about every plot detail in the first 25 minutes. The constant \"twists\" and \"surprises\" are tedious to say the least.\nDon't get me wrong I like Sandra Bullock but when is she going to get a role that truly makes her shine. She seems to manage to choose the wrong movies time after time. I think she should maybe look to more comedy roles as I feel some of her best parts have been in films like Demolision Man and even last years Miss Congeniality wasn't too bad (ok it was was that bad but not as bad as Murder By Numbers). Michael Pitt on the other hand is awesome. I saw him in Bully not so long ago in which he was fantastic and also last years Hedwig and the Angry Inch. He does evil particularly well. I think he could be destined for very great things.   And what the hell is Chris Penn doing in this tripe?! Nice guy Eddie is far better than this!   It was worth going to see this movie just for the guys walking around in the Slipknot costumes whenever they were going to murder someone.\nOn the whole this film was very poor, it scores only a ** out of ***** on the Meejoir-meter. But if Sandra Bullock is reading this, I still love you!","This is a typical soft spoken rental movie for an slow sunday afternoon with your boyfriend/girlfriend :)It does all the standard moves according to the crime/suspense genre when the detective, (the miscast Sandra Bullock) and her partner  tries to capture the two killers, both rich and blasé but highly intelligent school kids.\nThe scenes in the film are well managed, all the angles correct as we slowly learn how the murder was done. Thankfully, this movie does not contain the ordinary huge fireworks/special FX/audio FX  budget.  And there is no need for such audio/visual effects either.But why must1) The detective be tortured by his/her past?2) The storyline use the most predictable path?3) The detective/protagonist alienate the freshman partner, and have a boss that misunderstands her?4) The protagonist always face danger without backup?5) The protagonist risk her job due to zealousness?There are many more examples but you can find out  yourselves if you have a couple of hours to spend watching this movie. 6/10.","Hard to believe that director Barbet Schroeder once did the majestic and very funny Maitresse (1976), and now only seems to do \"by the numbers\" Hollywood thrillers.This is very lightweight John Grisham material, crossed with the plot of a TV movie. Bullock is Cass Mayweather, a feisty and independent crime investigator specialising in serial killers. Ben Chaplin is her reserved police partner Sam Kennedy, and together they make an uncomfortable duo. Not good, when two unbalanced college maladriots (Gosling and Pitt) decide to send them on a wild goose chase - by planting very clever and misleading forensic evidence at a crime scene.Fair enough, but while Bullock and Chaplin fail to create any sparks, we also have to endure a several dull overly-melodramatic flashbacks illustrating an important event in Cass's history. Then of course there are the frequent shots of a cliff-side log cabin where there's absolutely no doubt the OTT ending will be set. Oooh... the atmosphere.Watch any episode of CSI instead. It's to the point and far more exciting.","Okay, so I've read most of the reviews on this movie, as well as comments left by visitors to this site, and the feeling I get is that most people who wrote reviews really didn't like this movie.  That's why I'm writing now-I represent the minority because, I did.  I admit, I went to see the movie because I am very impressed with Ryan Gosling's compelling abilities, and the projects he has been a part of lately have been nothing less than incredible.  He is an amazing actor. That aside, I wanted to see this movie because it seemed intriguing to me... why?  Because it's a whodunit where you know `whodunit' from the start, and that's kind of unusual.As the plot goes, two teenage boys endeavour to commit the \"perfect crime\" because they believe in a twisted philosophy that only through committing acts of crime are human beings truly free-the uninhibited, and let's remember, guiltless, acting out of one's will.  The relationship between Richard and Justin was complex, hinted at homosexuality, and was brilliantly acted by Ryan Gosling and Michael Pitt.  Gosling was the manipulating, controlling smooth-talker, and Pitt was the extremely book-smart, socially awkward outcast.  Enter Sandra Bullock's character, who it seems most people didn't particularly appreciate.  I think when people see she was the executive producer they automatically assume any role the actor has in it is a self-glorification thing.  I didn't see that as the case here.  Without \"Cassie's\" personal history about the ex-husband that nearly killed her, who, not surprisingly, shared similar traits with Richard Hayward, she never would have pursued her instincts about Justin and Richard.  The case was seemingly airtight against Ray, the unsuspecting school janitor and friend of the boys.  Even when the boys are questioned near the end of the movie neither Bullock nor her partner have much solid evidence about them other than the fact that they lied about knowing each other, and the vomit Justin left at the sight.  Therein lay the genius of the movie because the philosophy the boys were trying to prove through the act of killing, the guiltless acting out of will as `true freedom,' ended up working against Justin, who ended up having a conscience after all (and ended up leaving part of his conscience at the body dump site).  Without that crucial piece of evidence, they almost had a \"murder by numbers.\"  And to readers out there who have puzzled over the title as much as I have, I looked in to it and found that something done \"by numbers\" (such as a painting) suggests careful and critical planning and exacting.  There's also a song by Sting called \"Murder By Numbers\", but that's beside the point. :)\nMany readers questioned the necessity of the relationship between Cassie and her partner, but I think it really meant to show how cynical and manipulative she had become because of her history.  Like it or not, her history does play an important role in this movie because without it, she would likely have never followed her instincts about Justin and Richard. Yes, it was a bit of the cliche `women scorned, woman acting out vendetta in every facet of her life' plot, but I think without the depth of Cassie's character you have just another movie about teenage killers, and they just may have gotten away with it.  There's no movie there.And to the reader who commented that the teenagers obviously didn't commit the perfect crime because the police were on to them from the beginning, can I remind you that the reason was because of the purposely placed, and totally traceable shoe prints.  The boys wanted to be involved-it was a game.  They were so confident that they had committed the perfect crime that they wanted to see first hand the difficulty the investigators would have in uncovering what they think is the truth.  What they didn't expect was that Cassie Mayweather had an overactive case of instinct working on her side. A little unbelievable?  Maybe.  But many crimes have been solved by police officers who have followed their instincts.  However, this is a MOVIE!\nI saw this movie in theatres about three times, and each time it revealed a little more to me, and I liked it a little more.  The more I watched it, the more I was captivated and frightened by the psychological depth Richard Hayward-there are people really like this.  My main complaint about the movie would be that they should have had Justin and Richard's interactions a little more central (because, let's face it, there lays the intrigue in the entire film) and my main props go to characterization-each character was very distinct and interesting in his/her own way.  It was very well acted, although I would have given Ben Chaplin's character a little more depth to work with (he's a good actor) and maybe pared down Bullock's character a smidgen.I think everyone should keep in mind that for a Hitchcock type thriller like this to basically tell you the \"whodunit\" at the beginning, it poses a very big challenge for the writers to keep the attention of the audience until the very end.  I think they did so quite well by utilizing a few small plot twists throughout, slow revelation of the different character dynamics, and by lighting up the screen with some really emotionally charged performances by the young actors Ryan Gosling and Michael Pitt.  I think if we remove our innate cynicism and attempt to see how psychologically complex the characters and their interactions are, we may be able to look beyond any apparent plot holes and see the real texture and quality of this movie, if only in the characters who were brilliantly portrayed.  Especially Richard Hayward.  Not that I'm biassed. :)","The film is enough interesting , though we know who's the killer , the surprises don't fade . The starring Sandra Bullock and Ben Chaplin try to investigate the woman's murder . It isn't a spoiler to say who's the assassin because since the first frame we understand the reasons and persons execute it .Sandra Bullock interprets a thirty and some years old , spinster , angry and lone police with a terrible past . Ben Chaplin is his couple as an investigator cop who will help her as moral as physically .Both of whom will have to resolve the case and face off two villains , baddies and ominous adolescents : Michael Pitt and Ryan Gosling .In the film there are suspense , thriller , drama and a little bit of action and is deal entertaining.Sandra Bullock's performance is excellent , she has the production and of course she obtains the better role . Also Ben Chaplin is well but he's shaded by Bullock.Michael Pitt and Ryan Gosling are nice but the first is contained and the second is overacting .The movie will appeal to suspense and emotion lovers.Rating : Good 6,5/7","So, I'm wondering while watching this film, did the producers of this movie get to save money on Sandra Bullock's wardrobe by dragging out her \"before\" clothes from Miss Congeniality? Did Ms. Bullock also get to sleepwalk through the role by channeling the \"before\" Gracie Hart? As many reviewers have noted before, the film is very formulaic. Add to that the deja vu viewer experiences with the character of Cassie Maywether as a somewhat darker Gracie Hart with more back story and it rapidly become a snooze fest.The two bad boy serial killers have been done before (and better) in other films. As has the \"good guy partner trying to protect his partner despite the evidence\" character been seen before. In fact none of the characters in the film ever get beyond two dimensions or try to be anything but trite stereotypes.One last peeve - using the term serial killer is false advertising. Murdering one person - even if it's a premeditated murder - does not make you a serial killer. You may have the potential to become a serial killer but you are not a serial killer or even a spree killer.","I can get very tired of murder mysteries with the exception of a few really excellent TV series. Otherwise, there are just too many of these murder plot themes. I don't like the theme of the two over-clever, selfish youths killing as an intellectual exercise, I've no interest whatsoever in Hitchcock who appears to have been associated with this in some way I don't intend to find out about. But don't misunderstand me, the theme is in itself excellent, the whole movie is so well done, and of course Sandra Bullock is superlative as always. Sandra's character is (as in Miss Congeniality) not rated by the male team she works with in spite of her obvious skills, and the boss mostly ignores her ideas, eventually forcing her aside and giving the case to her male partner. Of course Sandra works out what's going on and nearly gets killed in a very dramatic denouement. It's intriguing how the boy who worked out the murder plot can't allow her to be killed by his colleague - he has a conscience of some sort and perhaps could be \"saved, while the other is a true psychopath.Sandra's hard shell is caused by misery in her past that's tied in poignantly with the murder case. Her colleague, realising that Sandra's solving this case in spite of being balked by the dense superior, finally discovers what happened to Sandra herself in her teens, that she must now face up to and exorcise and the last scene shows her starting - we hope anyway - to do just that. I can see from the few other reviews I've had time to read that this movie would attract a broadish group - those interested in the two spoilt boys whiling away their time with their grisly philosophical determination to trick the police and get away with the perfect murder, the relationship between them that's so cleverly depicted, the ghastly links to the heroine's past, a police theme, and some smokes and mirrors - as well as for Hitchcock fans.For those who've queried why Bullock's character has to have a problematic past, really I think this would be a far less interesting movie if she had been just a detective trying to fathom what was going on, with a willing sidekick helping out and a male-chauvinist boss. The link between the murder victim and the detective is necessary to show the detective becoming too involved or otherwise how would she lose her arrogant boss's confidence and thereby nearly lose her life? That's hardly an original theme, in fact it's usually an extremely irritating theme as this male chauvinist boss brutally tells his frustrated but obviously inspired operative to get off the case and leave it to someone who clearly doesn't have quite the skills to solve it nice though the sidekick is. I was getting very worried towards the end re what might happen to Sandra's character as her emotional involvement in the case and special sympathy for the unfortunate victim of the crime dangerously drove her on with this case by herself.I wasn't disappointed re the relationship between Bullock's character and her sidekick. That goes along interestingly and at times very poignantly.The relationship between the two boys is definitely intriguing, if that's what you were interested in watching. I felt it was kept low key in some ways either because the movie-makers didn't want to get into boy-boy friendships too much, or because we weren't supposed to think emotion ruled their relationship. The movie cleverly makes you wonder which boy's in charge of the situation and there are some twists and turns and the boys show their underlying immaturity at various stages.There one thing I wish had been clarified and that's what happens \"after the movie ends\" when Sandra's character arrives at the Court.... you need to see to movie to know why she's there.Very well acted by all. I certainly can't agree with those who complained against Bullock's acting - she was superb. The part suited her very well indeed. The story is gripping even if murder mysteries aren't your thing and they aren't that often mine.","Alfred Hitchcock invented any kind of thriller you could think of:he set the standards so high that any director who makes a suspense movie will be fatally compared to him.The main subject of this Bullock vehicle ,all the ideas,almost everything was already in Hitchcock's classic \" Rope\":the two students who commit a gratuitous crime, Nietsche's philosophy,and the clues that the boys disseminate ,the Master was the first to transfer them to the screen.And with an eighty-minute movie which was a riveting technical tour de force.\"Murder by numbers \" does not take place in a single room,like \"the rope\" ,mind you.And ,what a supreme originality,it pits two cops against the evil youngsters;and ,you would never guess it,these two cops are very different:actually,Bullock plays the part of woman living like a man ,and her partner (Chaplin) is as shy as a clueless girlie.The two boys' performances are not really mind-boggling ,not as good ,as ,say ,that of Edward Norton in \"primal fear\" .Well,you know ,\" Rope\" was so good ....","All the elements are there: Two privileged teens with a latent homosexual relationship commit murder for the thrill of it, and to see if they can outsmart the law.  That's L&L, as told in \"Compulsion\", \"Rope\", \"Swoon\" and who knows what else.  Add in an angst-ridden investigator (could still be \"Rope\"), make her a small-town detective with a sordid past that she's trying to escape, and throw in her green partner, with whom she has an uneasy, sometimes sexual relationship, and give their relationship some heavy-handed subtext as well.  Any cliches jumping out at you yet?  All it needs is for the boys to have neglectful parents and for the detectives to have a commander who wants them off the case and, oh, wait, we've got that, too!People tell me I'm too critical of today's movies.  I say filmgoers aren't critical enough.  I still love movies, even some Hollywood output, but I really hate it when I can watch a movie and, without even thinking much about it, recite the \"high concept\" pitch that the writers or producers or whoever made to the studio exec.  This is the tenth movie I've seen in 2002 that's been that easy, and the message it sends is that no one in Hollywood is even bother to THINK anymore, much less be creative.  And Barbet Schroeder, God bless him, was at one time a genuinely creative director, turning \"Reversal of Fortune\" from a bland rehash of a story, to which everyone knew the ending, that had flooded the media a few years prior, into a compelling character study by making it just that.  \"Murder by Numbers\", on the other hand, is a by-the-numbers character study with even its subtext having been co-opted from countless films noirs and 60s and 70s psychological drama/mysteries like \"Peeping Tom\" and \"Klute\".Even Sandy as a cop was much more convincing as her typecast \"lovable klutz makes good\" character in \"Miss Congeniality\".  She still shows promise as a dramatic actress, but she hasn't realized it yet.  The teens are appropriately intense, but despite all the claims the film makes, they're really not that bright, and experienced homicide cops would definitely be smarter than they are here.  In this way, the film even manages to co-opt from 80s and 90s teen farces.Basically, there's nothing new here.  And if the celluloid flophouses want four times as much as they did 20 years ago for me to sit my ass in their chairs, they better be prepared to offer more than a rehash of the same stuff I watched back then.","Can some one tell me the point of this film!!??!?You know exactly who did it right at the start, Bullock plays a 'character' who you care nothing about, Ben Chaplin is wasted, it slow boring and has no climax, the one small twist at the end is just that small and does not make up for what seems a life time to get toI beg you do not waste your valuable life on this!!!","slowest moving film I've seen in a long time. Include this with the fact it's basically boring (especially Sandra Bullock) throughout, and you've got a film that starts out with lot's of potential, but drags along with plot holes that are so evident...it's a \"crime\" in itself. The two boys in the film do a great job though..and make up for Sandra Bullock's obviously \"over the top\" acting as the \"tough guy\" female detective. If it wasn't for the two adolesent plotters...this movie wouldn't of even attained the 5 rating I gave it.","Just half an hour into the movie and it was becoming a stretch. I knew what would happen in the end then and there itself. No matter how \"perfectly\" the 2 high-schoolers carried out the murder, erasing every trace of evidence and planting new ones to deliberately throw the investigative team off the track, it just wasn't convincing enough. It was only a matter of time - an hour and a half more in this case - to nab the two after a \"nail biting and cliff-hanger\" kind of an end. Predictable stuff. Even though the performances are good, it is unable to hold the story together at all because there isn't one. This is a thriller, a murder mystery, but I never felt being pushed to the edge of my seat anytime while watching it. On one hand, Ryan and Michael go on with their murderous antics while the other track moves back and forth justifying Sandra's tough cookie image and her apparent vulnerable side. I didn't need this if all I wanted was to know about the 2 highly dysfunctional kids. If the movie would have delved into the psyche of these two guys, the nature of their relationship with each other, with others and why exactly such intellectually gifted kids can even think of committing murders out of \"sheer boredom\" and just for \"attracting attention\", it would actually have freaked me out. And I would have been glad; because this is how I expect such movies to make me feel. Expectedly, even though the movie can boast of good lead actors, they are not able to hold the movie together because it is the plot that should be doing this and there isn't any here. A real disappointment indeed.","Having been pleasantly surprised by Sandra Bullock's performance in Miss Congeniality, I decided to give Murder By Numbers a shot.  While decent in plucky, self-effacing roles, Ms. Bullock's performance in \"serious\" roles (see Hope Floats, Speed 2, 28 Days) leave much to be desired.  Her character is at the same time omniscient, confused, and sexually maladjusted (the sub-plot of Sandra's past comes across as needless filler that does little to develop her already shallow character).  The two teenage boys gave decent performances, although their forensics expertise and catch-me-if-can attitude is belied by stupid errors that scream \"We did it!\"  Chris Penn as the all-too-obvious suspect is wasted here, as is Ben Chaplin's token partner/love interest character.***Spoilers Ahead*** Mediocre acting aside, the biggest flaws can be traced to a TV-of-the-week plot that never has you totally buying into the murder motives in the first place, and as mentioned, the stupid errors (vomiting up a rare food on the murder scene, an all too convenient and framing of the school janitor, the two boys hanging out together in public, a convenient love interest to cause friction, etc. etc) cause the view to go from being intrigues to being bored and disappointed by the murderers.  The ending was strictly \"By the Numbers\" and was probably the most disappointing aspect of the movie.  Using the now-cliched tactic of almost showing the climactic scene at the beginning of the film, and then filling the audience in how we arrived at that moment, the final scenes surprise no one and lacked any of the so-called intelligence the film purported to arrive at it's conclusion. A somewhat promising concept, but poorly executed and weak in nearly every way.  * out of ****.","I saw Murder by Numbers last night at a free advance screening to college students on the campus of Kent State.  I think the studio is hoping to generate buzz among 18-25 yr olds by showing it free.  Unfortunately it was a complete waste of time.  Every cliche used in better movies is utilized from the angry police chief to the detective(Bullock) who know's the true killer's identity but no one believes her.  It's almost as if the writers of this started with an interesting script and then slowly wrote them selves into a corner as the movie progressed.  If you're like me you'll find yourself hoping against hope for a surprise twist at the end but don't hold you're breath.  There is none.  Add this movie to Bullock's impressive resume of Speed 2 and Love Potion #9.  Don't waste your time or money.","I almost didn't watch Murder By Numbers, for two reasons. First, I'm not the biggest Sandra Bullock fan, but second and more importantly, the trailer does not do the movie justice at all. In fact, I would advise against watching the trailer, because it will almost destroy all interest in watching the movie, like it did to me. The problem is that the trailer gives the impression that Murder By Numbers is a murder mystery with no mystery, because it is obvious from the start that there is no question as to who the murderers are. It leaves you with the feeling that if you watch the preview, you've seen the movie. Kind of like what happened with Pleasantville.It is not long before it becomes clear that this is not a murder mystery, it's a murder thriller. True, there is never any question about who the killers are, but the point of the movie is the chess game that they play with the investigators on their trail. It is difficult to accept Sandra Bullock as a CSI, but at least in the second half of the film she pulls it off. In the first half she was going through the motions, for some reason not really seeming to believe what she was saying, or who she was supposed to be in the film. Of course, this is all just my reaction, I could be completely wrong.On the negative side, the movie comes dangerously close to glorifying the Columbine shootings, although it features one rich popular kid and one recluse as the killers, while Eric Harris and Dylan Klebold were both outcasts lashing out against the popular crowd. Richard, the popular kid, displays some odd behavior in his friendship with Justin, the recluse. He seems to think that they're dating and acts like an over-protective, jealous boyfriend, generating much of his rage from times when Justin doesn't pay enough attention to him or, even worse, kisses a girl. Justin is the brains behind the operation, having studied in great detail the investigative practices that would follow their master plan, Richard is the motivation. He really wants to do this, and the only reason that he ever gives in the movie is that he was bored. A true sociopath.On the other hand, maybe it was Richard who felt like the outcast, given his lack of success with the girls. Granted, he didn't seem to have any trouble getting in bed with the girl Justin was interested in in order to turn him against her, but consider the reaction that he always seemed to get from Lisa, which was limited to obscene hand gestures. He was, of course, of the variety of high school kids who thought that the good way to get a girl's attention was to drive up next to her blasting Iron Maiden at full volume and flashing the devil's horns. Charming. Maybe if he had tried some more romantic Iron Maiden than The Number of the Beast, like Seventh Son of a Seventh Son, or Infinite Dreams. Chicks love Infinite Dreams.The movie has a lot to say about the bureaucracy of criminal investigations, as Cassie Mayweather (Bullock) struggles to follow the strong leads that she has come across, while her boss attempts to force her to stop investigating the crime, already intent on closing the case with the tentative conclusion already reached. I'm not sure if this is meant to portray him as simply wanting the case over and done with or to show that he really doesn't care whether the real killer(s) is/are ever caught, as long as someone goes down for the crime. Either way it's not a very glowing portrayal of authority figures.Then again, Cassie, being the only flaw in their plan, is meant to come across as this sort of reckless independent investigator, in one of the very few weak things about this movie. That's what every movie like this does. There is always someone who is forced to give up on a case because they're too close to it (the victim was a relative, lover, etc.), because they are a liability (they know the killer, the killer knows them, etc.), or because they are too dangerous (they destroyed half a city block and lost a lot of evidence). In this case, Cassie's forced to leave the case because she has found clues that might lead her to the real killers. Nice. Pretty weak way to generate suspense, but overall with some good twists this is still a pretty entertaining thriller.","A random murder, a secret friendship and a detective with an attitude problem are just three of the interesting ingredients of this absorbing psychological thriller. \"Murder By Numbers\" entertains and intrigues its audience, not by posing the question \"who did it?\" but instead by following the progress of a detective's search for the evidence she needs to support her theory about who was responsible for committing a brutal murder. The fact that her task is made more difficult by her personal demons, her clever adversaries and obstacles created by her superiors, only makes things more difficult and adds to the story's already tense atmosphere.Richard Haywood (Ryan Gosling) and Justin Pendleton (Michael Pitt) are a couple of high school seniors who, despite their very different personalities, are secretly close friends. They meet regularly at a deserted house overlooking the ocean, drink absinthe and are excited by the idea of carrying out the perfect murder as a means of proving their superiority over the police. They're both from rich families, very bright but also bored and the closeness of their bond is symbolised by the presence of a photograph which is actually a composite of photos of both of them.By having no apparent relationship with each other, selecting a random victim and planting misleading evidence at the site where the body's found, Richard and Justin succeed in concealing their own connection with the murder of a young woman and also ensure that the school janitor, Ray Feathers (Chris Penn) appears to be the culprit. Richard subsequently shoots the janitor in a manner that makes it appear that Feathers had, in fact, committed suicide.Experienced homicide detective Cassie Mayweather (Sandra Bullock) is assigned to the case together with her new partner, Sam Kennedy (Ben Chaplin). When her investigation brings her into contact with Richard, her instincts immediately tell her that there's something suspicious about him but she's prevented from pursuing her interest in his connection with the crime by the intervention of Captain Rod Cody (R.D. Call) who takes her off the case.Cassie's a troubled character who still bears the physical and psychological scars of a traumatic incident in her past and tries to find solace in casual sex, drinking alone and listening to Sheryl Crow songs on her houseboat. She has an unpleasant personality, a reputation for being difficult to work with and a history of not following the rules and so her determination to follow her instincts and ignore the instructions of her superiors is regarded as reprehensible by everyone involved, including her partner. Soon after, however, Cassie sees Richard and Justin together and becomes even more convinced that she's on the right track.The two detectives in \"Murder By Numbers\" are so different from each other that they make an uncomfortable partnership. From the dramatic standpoint however, their juxtaposition is very effective in highlighting how mismatched they are. Sam Kennedy is a decent guy who's well-trained and methodical but also too inexperienced to have developed the instincts that Cassie possesses or to have acquired the kind of insight that enables an investigator to see beyond what the evidence superficially seems to show. Ben Chaplin and Sandra Bullock both make their characters believable and their interactions are important to the development of the story. Inevitably though, it's the performances of Ryan Gosling and Michael Pitt that stand out most as they make their characters both fascinating and disturbing and show convincingly how Richard and Julian's personalities complement each other.Justin is the movie's most interesting character because his brilliance enabled him to acquire the expert knowledge of forensics and police profiling which was vital for attempting to carry out the perfect murder and also his preoccupation with Nietzsche's doctrine of the superman was a key component of the motivation for the crime.\"Murder By Numbers\" is strong on atmosphere, rich in complex characters and entertaining in the way in which the investigation of the murder develops.","Much like director Barbet Schroeder's previous work Desperate Measures, Murder by Numbers features compelling villains and uneven writing. Two high school students (Ryan Gosling and Michael Pitt) commit a murder to push their poorly digested Nietzsche beyond mere parlour games; a troubled detective (Sandra Bullock) investigates them.It's basically a Dostoevsky-lite thriller/character study, and an obvious homage to Alfred Hitchcock's Rope, homosexual subtext included. What elevates it above mediocrity are the stellar performances by Gosling and Pitt as the young sociopaths, the former as a slick, aggressive manipulator, the latter as a smug intellectual. Far more conventional is Bullock's cynical cop.Worth one viewing.6/10"],"review-user":["MOscarbradley","jon.h.ochiai","tbabe29","Lechuguilla","mjw2305","loogenhausen","BernardoLima","stefan-144","meejoir","spaceas","robert-jalberg7","Xhabelle","ma-cortes","shsimko","Rozinda","dbdumonteil","meebly","toffeesi","Blairzo-2","vasudevan-arthi","jjauron","xander91","Anonymous_Maxine","seymourblack-1","petra_ste"],"review-date":["4 August 2005","30 April 2002","29 November 2002","9 October 2005","13 October 2007","1 October 2002","27 February 2010","14 January 2003","17 July 2002","29 December 2002","18 January 2004","20 September 2002","22 July 2004","29 May 2009","15 October 2009","15 January 2004","28 October 2002","23 March 2003","6 October 2002","13 April 2008","13 October 2002","18 April 2002","13 January 2005","16 September 2014","28 January 2015"],"review-rating":["6","7","6","6","3","6","6","3","10","6","2","9","2","5","1","5","4","3","1","8","8","6"],"review-title":[" Gripping despite being overly familiar\n"," By the Numbers\n"," Pretty Cliche, and the kids get all the good scenes\n"," Worth Watching Despite Irksome Plotting\n"," Entertaining Run of the Mill Thriller\n"," Murder By The Book...\n"," Very decent even if flawed\n"," The numbers don't really add up\n"," Murder to watch. But Sandra, I still love you!\n"," Well executed formulaistic movie.\n"," 3/10. Yawnsome thriller with irritating flashbacks.\n"," Disturbing, fascinating, compelling... (*spoilers*)\n"," A good thriller well produced by Sandra Bullock\n"," Totally Predictable and Boring\n"," A very good movie\n"," \" Rope\" revisited.\n"," Leopold and Loeb and Ted and Alice\n"," Why!?!??!\n"," Murder by \"Boredom\"\n"," Murder of a thriller....\n"," Disappointing and formulaic\n"," Bad Scriptwriting by Numbers\n"," Objection!! Leading!\n"," A Random Murder, Secret Friends & A Troubled Cop\n"," Crime and punishment(s)\n"]}