{"review-url":["http://www.imdb.com/title/tt0252103/reviews"],"review-text":["Ok I will say more, this goes down in wrestling history as the first super match, it was the current WWF Champion Hulk Hogan vs the WWF intercontinental champion The Ultimate Warrior, it was a unification match of sorts.  What made this match so special was the fact that there was no 'bad guy' both were huge fan favourites and one of the few times when no one knew who was going to win, this made for a unique atmosphere with the crowd 50/50 on who they wanted win (I was a little warrior, not a hulkamaniac).  Of course now we know that the Warrior beat Hogan, much to my delight. Everyone thought that this would be the last time we saw Hogan hold the WWF Chamionship and that The Ultimate Warrior would go on to dominate wrestling. For one reason or another this never happened and a mere six months later Hogan was the champ again.  This match will also be remembered as one of the very few times Hulk Hogan jobbed (lost) to someone.  Anyway this main event will go down as one fo the great matches of all time, maybe not for the quality but because of how important it was.  I would rank it right up there with other main event Wrestlemania matches like Bret Hart vs Shawn Micheals, Steve Austin vs Shawn Micheals and the second Austin vs Rock match.  I would recommend buying this video to anyone for the plain reason of the main event.","This event ranks right up there with WrestleMania's I, III and X as a truly spectacular event with a brilliant main event and an awesome undercard.This event took place in April 1990 and for the first time in WrestleMania history two good guys fought for the belt. Hogan and the Warrior battled in an explosive match for over twenty minutes in a match that could have gone either way. Those two guys were sweating at the end of the match. And who can forget the crowd? Just like WrestleMania III where Andre the Giant fought Hogan the crowd cheered like they were crazy. The electricity in the building was amazing as Hogan and the Warrior tore into each other.If the main event isn't enough for you there were plenty of other great matches such as The Rockers VS The Orient Express, Tito Santana VS The Barbarian, Roddy Piper VS Bad News Brown and many other great matches. My favourite match on the undercard pitted tag team champions Demolition VS The Colossal Connection.A smashing event!","Usually, the main event of any major wrestling event was \"babyface\" (good guy) vs. \"heel\" (bad guy). Hulk Hogan vs. Andre the Giant would be a big example of such a main event. With Wrestlemania VI, however, two incredibly popular wrestlers at the time in Hogan & the Ultimate Warrior put their respective belts on the line in a main event that split the crowd in half in terms of cheering support. Good guy vs good guy!Of course, an event is not made by its main event alone, and this is a great wrestling card that earns its 5-star rating. I won't go into detail on every match here, but here are some of the highlights:-Mr. Perfect continuing his great brand of wrestling against Brutus \"The Barber\" Beefcake. -The Hart Foundation taking on The Bolsheviks with some hilarious pre-match comedy featuring Steve Allen. -An interesting semi-heel turn from newly-branded \"Macho King\" Randy Savage by pairing up with Sensational Sherri instead of the traditional Elizabeth. -Any Big Boss Man match (this time vs. Akeem) is usually pretty entertaining because he is such a great character.There are no terrible matches in this entire event. They are all entertaining in some facet or another. The commentary from Gorilla Monsoon & Jesse \"The Body\" Ventura helps set the perfect tone once again.Then, \"Hulk vs. Warrior\" blows the lid off! This was one of the most anticipated battles of all- time, and it pretty much lives up to the billing. Neither big man is a particularly talented wrestler, but the hype is just so big and each man plays his part perfectly.This is the best Wrestlemania in the series so far, just ahead of the tournament from W4.","1. Koko B. Ware Vs. Rick Martel - Woow, clean victory for heel Martel 5.5/10 2. World Tag Team Title match: Champs-André the Giant/King Haku Vs. The Demolition - Im impressed, Haku eats beat. André must be ill in these times...5.5/10 3. Hercules Vs. EarthQuake - Eartquakes's mouth bleed. Not so special match, but I haven't got problem with it. 6/10 4. Mr. Perfect Vs. Brutus the Barber Beefcake - Yes! Mr. Perfect but No! That Dumbass Beefcake has again his ugly gay-outfit :-/ Who booked to job Henning to that abnormal unpleasant clown BRUTUS. FU*K YOU! :-/ 3/10 Piper get interviewed. Oh my. -5/10 5. Bad News Brown Vs. RR Pipa Pajpaa - Like I expected, one awful match,furthermore DQ. 3/10 6. Hart Foundation Vs. The Bolsheviks - 30 seconds match. Sometimes it's better, like in Bolsheviks case. 7/10 7. Barbarian Vs. Tito Santana - Tito nice sells Barbarian's Finisher.. Amazing 6/10 8. Randy Savage/Sister Sherri Vs. Piggy \"Elbow is my only weapon\" Rhodes/Sapphire - Vaudeville match... 4/10 9. The Rockers Vs. Some Fuji's \"who cares\" Japanese wrestlers 7/10 10. Dino Bravo Vs. Hacksaw Jim Duggan - Greatest Wrestler of all time Jimmy Duggan (Sarcasm) 4/1011. Ted Dibiase Vs. Jake Roberts - Hmm another lose for Jake Roberts... Poor great guy... 6/10 12. Akheem Vs. Big Stiff Man 4/10 Bushwackers Appearance -10/10 13. Rick Rude Vs. Superboring Snuka - Decent match 7/10 14. The Retarded Warrior Vs. \"Always Unbeatable\" Hulk - Warrior played with electricity, or like Twisted Sisters, looks even more dumber and It wasn't easy... HEY It's not possible Hulkamania losing wild! I'm impressed, shame that the winner is Warrior. Hulk almost started to cry when he was going into the locker room. Must give 6/10","WrestleMania 6 took place April 1, 1990 at the SkyDome in Toronto, Ontario, Canada.Match 1: Rick Martel vs. Koko B. Ware - For what it was, a very solid opening match. Koko was always fairly popular with the fans, and at this point Martel was still getting over as a heel talent. In the end Martel is able to snag the win in a pretty non memorable match.Match 2: The Colossal Connection (Andre The Giant & Haku) (c) (with Bobby 'The Brain' Heenan) vs Demolition (Ax & Smash) for the WWF Tag Team Championship - At this point Andre's health was really awful, so his performance was really nothing special. The crowd is 100% pro Demolition in this match. In the end Haku is pinned and we have New Tag Team Champions. After the match Andre lays out Haku and Heenan and turns face at what would turn out to be his last WrestleMania.Match 3: Earthquack vs Hercules - Very short match. Big dominant heels were really a popular thing at the time. R.I.P. to both men in the match. John Tenta (Earthquake) passed not that long ago and same with Hercules. In the end Earthquake pins Hercules for the win.Match 4: Mr. Perfect vs Brutus \"The Barber\" Beefcake - The first really good match of the night. R.I.P. to Curt Henning (Mr. Perfect). Really solid back and forth action from both of these talented guys. In the end Brutus gets the win thanks to a lot of his major fan support during the match.Match 5: 'Rowdy' Roddy Piper vs Bad News Brown - Not a technical classic, but a pretty decent brawl for WrestleMania. Piper comes out half black/half white in what is considerably a classic moment. In the end both guys fight to a double count out with no clear cut winner.Match 6: The Hart Foundation vs The Bolsheviks - Complete squash match. The Hart Foundation gets an easy win. Surprising that WWE used to have a tag team division.Match 7: The Barbarian vs Tito Santana - Bobby Heenan's \"Heenan Family\" fairs better in this match as The Barbarian takes the win against Tito Santana. Not memorable, but good to go back and watch years later.Match 8: Randy Savage & Sensational Sherri vs Dusty Rhodes & Sapphire - Big inter-gender tag team match. Dusty Rhodes wears the uncomfortable polka dot outfit out to the ring. In the end Rhodes and Sapphire get the win over \"The Macho King\" and Sensational Queen Sherri.Match 9: The Rockers vs The Orient Express - Surprisingly another tag team match. Tag wrestling used to be so much better during this time period. A young Shawn Michaels and his partner Marty Jannetty take a loss by count out in this match to the Orient Express.Match 10: Dino Bravo vs Jim Duggan - Duggan gets a decent reaction, despite his American Patriot gimmick. Bravo, a member of Jimmy Hart's group, comes to the ring with Hart and Earthquake. Although he has support, Duggan takes the win.Match 11: \"The Million Dollar Man\" Ted DiBiase (c) vs Jake 'The Snake' Roberts for the Million Dollar Championship - The first major main event of the night. Roberts was extremely over with the fans. Match was considerably good for what it was. DiBiase is able to pick up a count out win on Roberts. But Roberts ends up possessing DiBiase's money and giving it away.Match 12: The Big Boss Man vs Akeem (with Slick) - One Man Gang's sad attempt at being an African Dream named Akeem. A really short match that needed some more time to develop itself as a match. Boss Man wins with a slam.Match 13: Jimmy \"Superfly\" Snuka vs Rick Rude - Heenan comes to the ring with Rude for this match. Snuka, never really got it good at WrestleMania. He always seemed to be on the losing end. After a short 5 minutes, Rude gets the win over Snuka.Match 14: WWF Champion Hulk Hogan vs Intercontinental Champion The Ultimate Warrior - Dubbed as \"The Ultimate Challenge\" we get some interesting promos from both men earlier in the night. The match was actually very good, given that people tend to think Hogan can't wrestle. A lot of near falls that really got the crowd and people that watch at home into it. In the end Warrior gets the win on Hogan and wins both titles. A stunned crowd looks on as Hulk Hogan suffers his first loss at WrestleMania.","In the 1980s in wrestling the world was simple. Hulk Hogan would take on Roddy Piper, or Bobby Heenan's cronies or Ted DiBiase and come out victorious more often than not. Occasionally he would get an ally like Randy Savage in 1988, but mostly it was all about Hulk Hogan vs Bobby Heenan, and that's the way it should be.But on this night that was about to change, a new champion, a man who the WWE thought would be their man for the 90s was crowned. It didn't work out. But the WWE was right about one thing: Hulkamania was finished and a new order needed to be established.This historic Wrestlemania, the first to be held outside America, kicked off with Rick Martel defeating Koko B Ware. Koko never really had a lot of luck at Wrestlemania and was taken down in short order here.Next up the Colossal Connection Andre the Giant and Haku put their tag team titles on the line against Demolition Ax and Smash and lost. New tag team champions crowned.Next match saw Earthquake defeat Hercules. Hercules was another fellow who didn't really have a lot of luck at Wrestlemania. Plenty of luck for Brutus Beefcake as he ended Mr Perfect's undefeated streak. Well, I guess someone had to end it.Roddy Piper and Bad News Brown fought to a double count out in a slow but fun match, next up the Hart Foundation defeated Nikolai Volkov and Boris Zhukov in 19 seconds. Not really a match, unfortunately. The Barbarian then defeated Tito Santana in a short match.The American Dream Dusty Rhodes and Saphire then defeated the Macho King Randy Savage and Queen Sherri in a messy mixed tag match. This was the only female wrestling really going on in the WWE at this point of time.Next up was a fun match as the Rockers Marty Janetty and Shawn Micheals defeated The Orient Express in a fast paced encounter. There were a lot of good tag teams at this point in time. Jim Duggan then beat Dino Bravo in a nothing match.Next Ted DiBiase put his most cherished possession, the Million Dollar Championship on the line against Jake Roberts. Roberts was distracted by Virgil and counted out allowing Ted to retain his title in an entertaining match and one of the longer matches on the show.Next up the Twin Towers collide as the Big Bossman defeats Akeem in short order, this is followed by Rick Rude winning a short match with Jimmy Snuka.Finally we come to the main event with Hulk Hogan putting the WWE Title on the line against Intercontinental Champion The Ultimate Warrior. This is an entertaining back and forth match won by the Warrior after Hogan missed a leg drop. The crowd was extraordinary and the match was a great spectacle.And so the torch was passed, but would the Ultimate Warrior prove to be the Champion the WWE hoped he would be?","This event wasn't even held in the United States,it was in Toronto,Canada. Also, the \"93,000\" people figure is from Wrestlemania III in Pontiac,MI. Just for those unaware,the 93,000 figure is a fake number produced by the always truthful world of pro wrestling. The real number is closer to 80,000.Aside from the main event,which was a BIG deal back in 1990,the under card was absolutely forgettable. Be on the lookout for a pre-Master of the Diamond Cutter,Diamond Dallas Page as he drives Honky Tonk & Greg Valentine to the ring for their match in his car.For pure nostalgia,this is worth another watch. If you take yourself back to that time and watch this with the thought of not knowing who was going to win between Hogan & Warrior...it has a special feel.","I was at Wrestlemania VI in Toronto as a 10 year old, and the event I saw then was pretty different from what I saw on the Wrestlemania Collection DVD I just watched. I don't understand how the wwE doesn't have the rights to some of the old music, since most of those songs were created by the WWF they shouldn't have to worry about the licensing and royalty fees that prevent shows like SNL from releasing season sets. Its pretty stupid to whine about, but for me hearing Demolition come out to their theme music at a Wrestlemania in person was a memory that I never forgot, and it didn't exist on this DVD. What is the point of them even owning the rights to this huge library of video if they have to edit it so drastically to use it?","This event defined an era of wrestling entertainment that, I believe, is not equaled today. The colorful characters - in their stereotypical garb - brought a certain charm to the show that has since been raped by society and overexposed. Wrestling had a bit of an innocence back then. A kid could watch it without watching an episode of Jerry Springer.Looking back now (I was 5 at the time), although I loved both Warrior and Hogan, I think I enjoyed Warrior more because of his mystique. Hogan was the branded hero who weilded an impressive public image. The Ultimate Warrior, on the other hand, was a masked man of few words - an out-of-the-limelight hero for a different audience.This rivalry was so exciting as a kid because of this duality in me duking it out for each combatant. I had a place for both of them. Because there was bloodshed too in this long, heavy battle, the stakes were high - at least to me as a kid. On a similar note, because of Hogan's defeat, this made him more human - I remember feeling kind of sorry for him.All of these emotions at play in the juvenile boy's soap opera made Wrestlemania VI such a great time to witness this game.","*SPOILERS AHEAD*\nGreat WrestleManias were still a few years away.  But this one was certainly good, with lots of good matches, and one great match.Demolition was always at their best at WrestleMania.  I'm glad their last WM hoorah (I refuse to include the other version) was a win over the Colossal Connection.  I liked the gag of Andre never tagging in.Few fans know that this was the first time anyone ever beat Mr. Perfect. For some reason, Brutus Beefcake's feat was never recognized.  Or the fact that he did it pretty easily.The Hart Foundation's win over the Bolsheviks was the shortest in WM history, including the 24/9 second match between King Kong Bundy and S.D. Jones.I'm glad Jake and DiBiase got to fight at WrestleMania.  This made up for the fact that the feud had to be put on hold for so long.I expected the Big Bossman-Akeem feud to heat up, but the Bossman just clobbered him.  As good as Bossman was as a heel, he was just great as a face.  He was always intense and obviously loved his job.If the Warrior just had a better work ethic and maybe tried to learn to wrestle, he would have been a great WWF champion.Worth a watch, especially since the boring matches are too short to complain about.  And the tag team matches are all very exciting.","First off, only 67,000 fans were in the Toronto Skydome to see Hogan/Warrior.  Secondly, not only wasn't it the largest American crowd, it wasn't even American, as Wrestlemania 6 was in Toronto, Ontario, Canada. Regardless, it's still an incredible show, with a few good matches, and an especially hot main event.","This was a very good PPV, but like Wrestlemania XX some 14 years later, the WWE crammed so many matches on it, some of the matches were useless. I'm not going to go through every match on the card because it would take forever to do.However major highlights included the HUGE pop for Demolition winning the tag team belts from Haku and Andre the Giant, The first ever mixed tag match featuring Randy Savage and Sensational Queen Sherri vs Dusty Rhodes and the late Sapphire and the first ever clash between The Ultimate Warrior and Hulk Hogan.Some matches were a complete waste of time. Like The Bolsheviks vs The Hart Foundation was only about 40 seconds long, Koko B Ware vs Rick Martel was short and Big Bossman vs Akeem was too short.Mr Perfect vs Brutus Beefcake and Ted DiBiase vs Jake 'the snake' Roberts were very good indeed.Overall Grade - B"],"review-user":["nicky_2006","Big Movie Fan","zkonedog","amanwhorocks","jts0405","bh_tafe3","eltacoman1978","calsinic","filmguy2003","wwfhistoryguy","jgoney","wrestlingsitewebmaster"],"review-date":["9 July 2001","28 April 2002","5 March 2017","23 June 2013","26 December 2009","15 February 2009","6 January 2007","17 February 2006","10 February 2005","5 April 2004","22 May 2001","12 August 2005"],"review-rating":["10","5","7","8","4","8","7","7"],"review-title":[" Warrior vs Hogan need I say more?\n"," EXPLOSIVE EVENT\n"," The Most Anticipated Match Until That Point\n"," Hoggies barely cried\n"," First WrestleMania out of the states... Hogan finally suffers a loss\n"," The End of Hulkamania\n"," Correction\n"," wwE manage to edit history\n"," Duality of the Battle\n"," About as good as WMV\n"," Good card, no record\n"," Wrestlemania VI\n"]}