{"review-url":["http://www.imdb.com/title/tt0287045/reviews"],"review-text":["I was recommended this movie by a friend, and finally got around to renting it.  I thought it was a good movie, touching and realistic.  The end leaves nothing resolved, but that adds to the realism, since nothing that complicated could really be solved in such a short amount of time.  Great acting, Andrew (Shawn Nee) is excellent!","Lauren Himmel's debut movie is well directed with a nice polished feel to it. There's a strong storyline going on with a meaningful point to it all even if at the end nothing is resolved hence the name Treading Water. The storyline revolves around a Lesbian couple and their battle with ones mother for acceptance. 7.5/10","Treading Water is a very beautiful movie. I would put it straight under the wonderful short movie : Cosa bella from Fiona MacKenzie. It's not only about coming out but also about tolerance and acceptance in general. I am looking forward to seeing more of Laurel Himmel's work in the future. The actors, Angie Redman and Nina Landey are quite good. The main characters relationship could have been strenghtened a bit as we understand there is a very strong bond between them but maybe this could have been explained a bit. I am surprised that Angie Redman doesn't appear much in other movies. A great first step as a director for Laurel Himmel, I am sure there's more to see from her skills.","Treading Water is a slow-paced movie that's really a character-driven piece, not a plot-driven story. Think \"Hiroshima Mon Amour\" or \"Snow Falling on Cedars\". Whether you like that sort of thing or not will probably depend on your tolerance for the slow plodding scenes and quiet revelations that are typical of that sort of movie.The basic story is this: the Christmas holiday is a catalyst for a lesbian couple and their extended family to come to terms with each other. Treading Water is a meditation on the problems that arise in family and romantic relationships when your self-image conflicts with your family's expectations. If you're looking for more of a lesbian romance, look somewhere else. At its core, Treading Water is really more about dealing with your family, not so much about the central lesbian relationship.","This movie just felt very true to life. I liked the ending which seemed to resolve naturally without any big moments but with a lot of little moments coming together. You could tell it is an honest love story. It doesn't matter what the 'sexual orientation' of the main characters are, it still a story about love and understanding.There were a lot of scenes that involved the family. The setting is during what for some people is a very stressful time. Namely \"the holidays.\" Christmas to be precise. Like most good films, this one addresses issues of love, fitting in, expectations, and can't-be-overcome biases. In the end Alexandra and Casey make a choice for each other, knowing that love is difficult, and about giving. Well done.","it was a very well written movie, and the actors had a very exquisite way of portraying all the character. but as the movie came to an end i felt as if there was more but they forgot to put it on the dvd. maybe they are planning on making a sequel...well even if they don't it's a good movie and a good rental, but even a better purchase.","The title of the movie says it all: it's a story about staying afloat, moving and moving without really going anywhere. \nThe love story between the two main characters is beautiful and wonderfully portrayed, their most intimate scenes very warm and credible, of course it wouldn't get the attention others lesbian themed movies got because the kind of tragedy it portrays is specific to gay people's experiences and there aren't explicit sex scenes. \nIt's a movie about love, in its different shapes and forms, on the technical side the editing is a bit abrupt but the actors delivered well rounded performances, the soundtrack is simple enough but feels very appropriate and never overdone. \nThe ending is true to life and I actually appreciated that they didn't destroy the love story between the two women, too many times these kind of movies seem to be written with the purpose to scold lesbians for their very existence.","This movie only got one thing right: Christmas sucks. Eerything else was horribly wrong. It looked like a 3rd grader shot it and came off as extremely low budget. The acting was completely unremarkable, as was the character development. Also, it was completely unbelievable that the social worker Alex took a case when she knew the client was her lover's brother. This was a complete conflict of interest and no ethical social worker would ever do that. it just contributed even more to the stupidity of the movie and of the characters. The portrayal of a dysfunctional alcoholic, dry, new england family was very accurate however, but still not enough to give it more than one star. I can't believe this movie won awards, or that I wasted an hour and thirty-two minutes watching it. I'm writing this review to save others the trouble.","This is a film that has garnered any interest or praise it has received simply on the merit of being a lesbian interest piece. The performances are mostly emotionless compared to better films in the GLBT interest genre. The entirety of the film's watchable value is garnered through modest suspense over whether and when the partners' family members will say something discouraging about their lesbian relationship. The best element of the film is likely the beautiful New England scenery, although much of the film is set inside. It is hard to envision how any viewer watching this film and not seeking affirmation of their GLBT lifestyle or wishing to see that of others affirmed, even through poorly realized drama, could appreciate Treading Water in any significant way. It is a terrible movie."],"review-user":["quietgirl4444","malakin","losanca","shanakins","battlecrycreek","pfag","Rain_Check","mglenn-345-313461","paulawyatt"],"review-date":["21 August 2003","12 September 2003","2 September 2007","8 December 2005","20 November 2009","4 January 2003","2 April 2018","15 April 2012","7 March 2009"],"review-rating":["8","8","6","10","9","9","2","1"],"review-title":[" good\n"," Well done movie about a touchy subject matter\n"," How a great love story is at stake because of family problems and lack of acceptance.\n"," realistic portrayal of a lesbian relationship.\n"," Excellent Movie about Love and Relationships\n"," i want more...\n"," Loved it\n"," Girl with rich waspy family falls in love with girl. Family doesn't like it. Stupidity ensues, especially because it's Christmas.\n"," Terrible movie doesn't deserve praise\n"]}