{"review-url":["http://www.imdb.com/title/tt0295718/reviews"],"review-text":["I enjoyed this film.  I thought it was good fun to watch, and just easy entertainment for a Friday night at the movies/DVD.  The premise is easy to follow.  Two Fish and Chip shop owners who hate eachother, find that they have to work out their differences to stop the construction of a Burgie's Burger's (An Hilarious spoof of Mcdonald's) right next door to their shops. The simple story includes hilarious jokes, a pretty enjoyable ending (most people complained about it, but I thought it was funny and unexpected), A bit of romance, Revenge, a traitor and much more.  I have read bad reviews for this film, and I must say I found something in common.  They were basically saying that it was unoriginal, stupid and had a predictable ending.  Ok, well let me just say that most films these days are unoriginal, the comedy wasn't genius and I couldn't see that ending comming.  So for once, just sit back, turn off your brain and settle down with some good old Australian Laughs! I recommend it mate!","If you ever want to see an example of a film that shoots itself in the foot as it comes to its conclusion, this is it. The set-up is quite funny, but the last 25 minutes (and the guys ultimate solution to fixing their dilemma) is so uninspired and idiotic that you'll be shaking your head is disbelief. The opening is terrific, Vince Colosimo and Stephen Curry are both good sports, and they share a great rapport. Rose Byrne is charismatic and gorgeous as ever, but she's given such a nothing role and all but disappears in the second half. There's a clever opening scenes about the origins of take away shops and a few good gags here and there (Curry's expressions are always good for a laugh), but again, the sheer idiocy of the ending ruins all that comes before it. Not helping matters is the similarities in story to The Castle, and a few gags that don't quite work. Co-writer (and very funny stand-up comedian) Dave O'Neill deserves some credit for coming up with some great gags, but there's not much here to sink your teeth into.","I hadn't planned on seeing this movie, however I wasn't disappointed when a friend dragged me along.  Although there are no real surprises here, the guys do reasonably well with their obviously modest budget.\nIf you've seen the trailer you probably know what to expect from this type of movie and there's a pretty constant stream of jokes here, with a couple of classic moments, with the highpoint probably being an excellent flashback to what the guys were like in the 1980's.  Also, I've read elsewhere that the ending was a disappointment, but I found it refreshingly different from what I had expected from this genre.Overall, this movie wont change your life, but it's got enough laughs there to keep you entertained throughout.","I expected a lot walking into 'take away'. With it's 'Castle-like' plot-line and starring two great comedic actors (Vince Colosimo and Steven Curry), this film barely broke mediocre at the best of times.However it got worse, as i was watching the film i was praying for a decent ending.. My prayers were not answered however, i left the cinema hoping they'd seen the movie and felt guilty enough to refund the price of admission.* out of *****","William M. Thackeray once said \"A good laugh is sunshine in the house.\" When I watched Take Away, I must say that the sun did shine in my house. This film was superb, the opening was very cleverly done, the story held together well, in a nutshell two fish'n chip shop owners who normally enemies are forced to form an alliance of sorts to engage in a David and Goliath struggle against a fast food chain which builds a restaurant on their street. The ending was hilarious even though I have found many who disagree with me on that one.The film was though very discreetly, portraying contemporary Australian ethnic stereotypes, in particular the collision or culture clash if you will between the traditional Anglo Australian and Italo Australian stereotypes, and how they found a sort of \"unity though adversity\", very nice.I found Vince Colosimo's performance as \"Tony Stilano\" an Italo-Australian Fish 'n Chip shop owner in his thirties to be first-class, his acting was very genuine and convincing, through his performance he managed to really bring to the surface the essence, or I should say the soul of the Italian Australian stereotype, which in reality is not too Italian but not too Australian either, Colosimo found that balance, breathed into its lungs and gave it life.The Cinematography could have been better, more shots of the local area would've been nice, from what I can see it was in Melbourne, but where in Melbourne? to me it looks like somewhere between Ivanhoe to Bullen, though I am not 100% sure on that one.I don't know why so many people are comparing this film to \"The Castle\" though they have similar themes running through them, Take Away stands in a league of its own.I think the film was Excellent with a capital \"E\" it has everything, it's funny, the jokes are great, it deals with contemporary issues facing Australian society, the story holds well, I loved it! I highly recommend it.","Alright, so not every Australian movie is all that good.  Yes, maybe there have actually been very few with much merit. Take Away however is an absolute bomb, qualifying as one of the worst movies I've ever seen.  I wanted to like it. I figured I'd give it a fair go.  I've even met one of the screen writers Dave O'neil so I feel kind of a traitor giving this movie a bad review, but...  The plot is fairly thin (I won't bother relating it... read the synopsis), which I can forgive: there are plenty of movies that can cover that up with a few decent jokes.  Unfortunately, Take Away's jokes cover its plot up like a $2 prostitute's skirt.  Probably the only laughs that came from the 6 other people in the cinema was at the poor acting and dialogue.  Take Away goes down like a week old Dim sim ... You might understand that joke if you see the film but the joke's not worth it."],"review-user":["the_insainiak","chamerski","BenSadlier","Jawsh","romulanbee","sticky_d"],"review-date":["30 August 2004","10 October 2003","16 August 2003","19 August 2003","5 April 2006","13 August 2003"],"review-rating":["4","7","6","10","1"],"review-title":[" Just don't take it too seriously!\n"," Decent set-up, atrocious ending\n"," A pleasant first attempt by Dave\n"," Average Film, Below Average Ending.\n"," This film is Wonderful!\n"," A sad day for Australian movies\n"]}