{"review-url":["http://www.imdb.com/title/tt0284253/reviews"],"review-text":["I am a Christian, and thought this movie was pretty good! :) While the acting wasn't Academy Award caliber, I thought it was good, considering the cast has had limited acting experience at the time this movie was made.The Gospel message and the transforming power of Jesus Christ was explained wonderfully. The message that the director was trying to get across (which is THE important thing, not how the characters dressed!) definitely got through. The theme of having the main characters involved in illegal drag racing was a good idea, too (cool muscle cars, btw). I think this movie will definitely reach out to a lot of young people.I would definitely recommend this movie, it is a great witnessing tool! :)","As a Christian, I found this movie to be completely embarrassing. The actors sucked, the writing sucked, the cinematography sucked, and the story was so typical. I couldn't say this is a great witnessing tool, because I'd be too embarrassed to show any of my unsaved friends. Hollywood has much better stuff, and that's because they invest the best into it. Christians put out sh*tty work and think it's OK because \"it's for the lord\". In the old testament, people spent huge amounts of money to bring offerings to God. David (or Saul.. I don't remember) spent what would be equal to about $50 Billion in todays money on building a temple for God. But these days, spending what would appear to be about $30,000 tops on making a movie to \"witness\" to people with is just pathetic. It's the person, not the product that affects someone. Don't waste your time trying to convert your friends with this waste of an hour and a half. If you want to make a positive impact with people, show them movies like The Matrix, American Beauty, Braveheart etc.. movies that have something to say and actually get it into you.","Just about the worst acting, writing, and overuse of transitions I will ever see. Christiancinema has a lot of explaining to do, as well as some serious work to do, because I would be ashamed to have anyone who isn't a Christian to see this. Iam ashamed to even have my very own Christian friends see it. The story has a good idea to it, but the acting, script, costume design ex. \"Money\" looks like he jumped out of N sync. Overuse of fading in and out transitions with memory to street racing expereinces, music - similar to watching an old 80's movie about drugs you'd see in Health class. The overall corny shots, the kid with his wingspan pose being held by his brother above the convertible, as an obvious technique taken from \"Titanic\". Many of my Christian friends would agree, we need more movies like \"Contact\" and \"Signs\". Overall, it was a great idea to reach the street racing audience put to terrible waste. While I appreciate the effort, I have a feeling the effect will only depict Christians as cheezy filmmakers with obvious attempts to convert everybody.","This movie was amazing. I was in tears by the end of the movie. Okay, I know the acting sucked but that's not what was important. The message came through loud and clear about God's love for us and Jesus's sacrifice. The movie was realistic and showed actual human feelings whether it be Pete's anger of the blond girl's sneers or the guy that asked questions. But it also showed the joy that comes from a true relationship with Christ. The cars were awesome and the actors were very hot and that attracted my eye. But what I liked most about this movie was the clear Gospel message. The mother and pastor supported Ben in his new walk with Christ and tried to be a godly example to others. Nicky D showed that no matter if you have all the world has to offer, without Christ, it doesn't matter. Nina showed how a misguided but good person can easily miss the mark. I loved this movie and think that it will bring many teenagers to Christ.","(As a note, I'd like to say that I saw this movie at my annual church camp, where the entire youth group laughed at it. I bought it when I saw it on a shelf one year later, if only for the humor I derived from a bad attempt at making an evangelical movie.)Lay it Down falls short of many movie fans' expectations on several different planes. Most of the problems lie within the impersonal acting. Regardless of the nice cars in the film, or the truth in Christ's sacrifice for you, as a movie AND witnessing tool, Lay it Down hardly delivers. Most good opinions of the movies are supported by Christians agreeing with the message. While it's easy for a Christian to agree with the points delivered, the audience hardly ever witnesses life outside a cliché. The fighting scene between Ben and his brother is horribly dubbed. And there are at least three blatant typos in the subtitles.I encourage anyone to watch the movie a second time with the director's commentary on. It really helps you understand just why the movie was written how it was. The director's views on secular society are practically opposite of what would cater to a movie-goer's needs: he shows a pedantic understanding of Nonchristians, as well as some points of religious conflict; most of the editing, he admits, was rushed, but \"satisfactory\"; he thought the over-used transitions and themes to be effective; and was completely happy with the acting. He also inserted motifs that he was rather proud of: -All (read: most) of the names are significant. Ben Destin = \"Been Destined\", Gus Pelman = \"Gospel Man\", Nicky D = Nicodemus. -The car doing donuts is symbolic of the circling nothingness that is a life without Christ. -When Ben leaves on Pete's motorcycle, he crosses his crutches to form a \"cross\".I'm not making any of those up. He throws around things like this in between saying while street racers and the like \"blow their brains out with guns\", and how \"God is in control when your born and when your die\". Yes, that was not a typo. He really says that.I have (little) forgiveness reserved for this movie. The \"cool cars\" and \"good message\" don't do jack to make this movie good. However, the movie was made from a group of unprofessional individuals on a budget less than 1/100th of \"The Fast and the Furious's\", and the time limit was unforgiving. With that in mind, I give it a score of 2/10, instead of the 1/10 I so dearly think it deserves.","Got this off of usenet, so I wasn't prepared for the heavy (and I do mean EXCEPTIONALLY heavy) religious theme.  Not that I'm one of Satan's disciples or anything, but it was very heavy handed.On top of that, the acting stunk.  It might be because they had to get good little boys to play bad little boys, but it didn't work.\nThere was some pretty cool filmmaking involved, so any fan of directorial style might want to check it out, but be ready with the fast forward buttons.There was some sloppiness to the editing.  In particular, a black Mustang (probably a representation of Satan?) squares off against a  white 240Z. Wheels spin, camera changes, and whattya know, that white 240Z is transmogrified into a white Civic.I gave up early on, so I can't vouch for the moral impact of it.  But I would like to point out that this sort of film is totally preaching to the choir.  If the director/writer/producer was trying to bring religion to the unwashed streetracing masses, they went about it all wrong.  I think I'd rather watch an adult diaper commercial than listen to a steely-gazed bible thumper rant about Jesus' dying for us.  Yawn.","Id just like to say that the film was good and touching. The film explains to you the real meaning of being saved or born again and is very well set out. The acting was quite good but could do with some improvements. The story Board is catchy and when my church had youth service and we watched it,8 people gave there life to Christ. Id just like to say too anyone who is reading this, give your life to Christ and repent from your sin. PLease visit www.lifeofacristian.piczo.com Thank you AndrewThe word of God will not turn Void. So Get saved and repent from your sin!","This is a very \"right on case\" movie that delivers everything almost right in your face. I'm a Christian and liked the film in one way. It had some average acting from the main person, and it was a low budget as you clearly can see. It can be a bit long-winded, but the film has some quite nice cars that rescues it from a lower rating from me. As a Christian film it was quite good, but maybe a bit right-on in the message. The film works best on a big screen. *SPOILERS* The fighting scene with the two brothers can remind you of the fighting scene between the two brothers in the Christian thriller \"Mercy Streets\" starring Eric Roberts.*End of Spoiler* I give it a 7/10.","A young man discovers that life is precious after he is seriously injured in a street racing accident.  His father is a pastor who changes his outlook on life and he spends the whole movie sharing his new-found love for others in this shocking and heartwarming movie. The theme is built around street car racing and it is an excellent movie for people who are into that and movies like 'the fast and the furious'. This shows how people can overcome their problems and gives the general message about the meaning of life in a new and exciting way!"],"review-user":["Not_Deceived","jake_heath","kwhatever55","cntrygrldx","wahay","greasecapade","andrewmartin93","jarmlar","brettbinder"],"review-date":["19 February 2005","10 November 2005","17 February 2004","21 October 2006","9 July 2006","6 December 2002","5 February 2007","28 September 2004","19 December 2003"],"review-rating":["8","1","9","2","1","8","7","10"],"review-title":[" Great Witnessing Tool\n"," I'm embarrassed\n"," Very disappointed, (from a Christian's Perspective)\n"," Amazing movie even if the acting was bad\n"," Setting a Negative Christian Stereotype\n"," Saved By The Bell meets ... um ... something lame\n"," Good and Catchy\n"," Right on!\n"," A powerful movie that will change your life\n"]}