{"review-url":["http://www.imdb.com/title/tt0203027/reviews"],"review-text":["NOBODY (1999) is a fantastic piece of Japanese noir. It's about three salarymen who get in way over their heads when their innocent, drunken cheapshots p*** off three OTHER guys one night in a bar. When these three mysterious strangers, who are up to much more deviant no-goodness than even the film allows us to know, beat the living daylights out of one of our \"heroes\", the trio decides to return the favour in kind - only they accidentally KILL one of the other guys! The remaining two baddies then begin the systematic destruction of everything these poor schmoes hold dear, including their fast-dwindling sanity. Phaedra Video's DVD sleeve features a critic quote calling the film \"A paranoid street crime freakout!\" or some such, and the term more than applies here. Brooding, tense, very violent and low-key (but still pretty slick), shot largely at night with many deliberately vague moments and character motivations that keep the audience guessing right along with the besieged protagonists (who, to some degree, deserve everything they get!). I give it a 10.","This Japanese film takes the sort of noirish 80s thriller that might have starred Michael Douglas or William Hurt and blends it with some hyper-violence and sociological alienation. Believe me, it's a lot better than that sounds.Three friends who work at a Tokyo advertising agency are out at a bar one night when they run into a trio of icy strangers at the next table. A fight almost breaks out right there and the three strangers later beat the snot out of the timid Konishi (Hideo Nakano). The hot-headed Nanbu (Riki Tekeuchi) wants to get revenge but after a futile attempt to track down the strangers, the repressed Taki (Masaya Kato) talks him into letting it go. However, when the run into one of the strangers alone in a tunnel, the three friends beat the holy hell out of him in revenge. Rather than end things, Taki, Nanbu and Konishi find themselves targeted by the strangers for death. At first the three friends think they've accidentally tangled with Yakuza, Japanese gangsters. Then they suspect the cold, deadly trio are actually cops. It turns out they're something even worse and none of the friends may survive.Nobody is a quiet, creepy and stylish little foreign film. It's a bit minimalist when it comes to dialog and relies a lot on long, meaningful stares, but it keeps you on your toes and never sure what's going to happen next. There are a couple of twists at the end that seem to belong in some other movie and there are certain moments that don't resonate in American culture they way they must have in Japan. Quibbles aside, this story about what happens when ordinary life turns out not to be so ordinary will grab and hold your attention all the way until the end.The acting is also quite good for an Asian-language film. Not that acting in Asian movies is typically bad, but it often has a different emotional rhythm and cadence that can be off putting to Western viewers. That's not the case with Nobody. Taki, Nanbu and Konishi are very relatable, both in normal situations and when their lives take a turn for the brutally unusual. Konishi is the quiet, somewhat wimpy friend who tags along. Nanbu is the macho friend who's still somewhat adolescent in his attitude and outlook. Taki is the friend who sort of straddles the middle between the two extremes. Without him, Nanbu and Konishi probably couldn't stand each other but without them, Taki would probably lead a dull, colorless existence.Nobody isn't a martial arts flick and it's not some art house film. It's the Japanese version of psychological suspense, the sort of thing Brian De Palma did pretty well before his talent seemed to evaporate on him. Unless you have a deep aversion to subtitles, I think it's worth a look.","it's a good watch if u have time - deals with three friends who get into a needless bar fight, and get into serious trouble. they find themselves fighting some shadowy people, and can't deal with. very, very disturbing portrayal of japan, the arbitrariness of modern life... some intense scenes, but a bit of a potboilerthe spoiler was that the plot is not too clear based on English sub titles. obviously, i don't know Japanese.the only other Japanese movies i've seen were kurosawa, who is a different and far loftier than this modern genre. so, can't really compare. otherwise, it compares better with most Hollywood \"blockbusters\" for story plot and buildup.taptieg24","Three businessmen are involved in a bar fight with three mysterious men. The three businessmen take revenge, which escalates to a murder after another. Supposedly the story is about the violence that could happen to ordinary people.The plot has too many holes. The details were ignored in order to move the story forward. The acting was uneven. The color balance was awful even though I watched this movie in DVD. The small budget and tight schedule were apparent. The whole thing seems to be an excuse to shoot the final gun fight, and the ending was just unbelievable.","Nicely filmed, a little uneven, \"Nobody\" is a good evening's entertainment. The plot is simple enough--three yuppies get into a scrap with a group of strangers in a bar, and it turns out to be much more than they bargained for.  The acting is decent, and there are a few unexpected twists.  Watch for the completely unbelievable (like the 10 shot revolver, and 25 shot semi-automatic handgun).","Nobody is a film with a good premise but flawed execution.A minor set of words between two groups of business men (three men in each group), leads to one of them getting beat up. They try find the other group to get revenge, but come up empty handed until late one night they come across one of the rival men in a subway. The three friends beat him severely, so much that they run away, and begin checking the papers to see if they killed him. Soon they begin to get phone calls from the men saying that they have killed the man (though there is no evidence) and slowly they begin to get picked off.Were these men just crazy business men? Bloodthirsty Yakuza? Crooked Cops? Unfortunately these questions and the I Know What You Did Last Summer-like plotline, dont hold up very well, and are clumsy. The deaths, the suspicion, and the finale, fall too far into b-movie territory. The script, direction, and cinematography are lackluster, and with a little fine tuning, some expanding on the cultural side, it could have been a better film. A slightly below average effort."],"review-user":["BrianThibodeau","MBunge","taptieg24","Yaz-6","kwierbate","iaido"],"review-date":["25 August 2004","18 June 2010","22 October 2004","25 November 2000","10 August 2000","23 September 2000"],"review-rating":["10","6","8","2","7"],"review-title":[" Paranoid, street crime freakout indeed!\n"," A bad night for 3 Japanese guys turns into a good movie for everybody else\n"," very interesting, disturbing movie\n"," Cheap thrill\n"," Japanese suspense yarn that's better than average\n"," Fair, Urban Japanese Horror/Thriller\n"]}