{"review-url":["http://www.imdb.com/title/tt0206476/reviews"],"review-text":["As I have said before in previous comments, some programmes are there to be 'Light entertainment'. So I get somewhat frustrated when commentators seem to be expecting a program that will reveal the meaning of life, you will not get that from Cleopatra 2525 and it does not presume to offer it. What you get is a girl who was frozen and is brought back to life some 500 years later and her adaptation to this new life is realistic. She does not settle in within 10 minutes as what happens with other time travelling adventures and neither is she the female equivalent of James Bond ready to take on all comers.Cleopatra is overawed by her new surroundings and frightened by some of the weaponry on display as most of us would be. However it is light entertainment, the stories have a beginning a middle and an end in quick time and their are some surprisingly good moments of acting. The episode when there is a double of Cleopatra is particularly moving and Jennifer Sky I think gives one of the best performances of someone dying for a long long time, and being a film and television buff I know what I am talking about. Finally to prove my sincerity I have purchased all but four of the episodes and I am entirely satisfied with my purchase. The only reason I do not have the complete set is because I purchased the other episodes before realising that there was one complete box set. Victoria Pratt and Gina Torres complete the trio creditably and for light entertainment Cleopatra 2525 certainly entertained me.","The same producers made Hercules and Xena. They were both action shows, but with strong emphasis on the dramatic battle between good and evil. Cleo, on the other hand, is a comic book come to life. Sure, it doesn't have the deep, brooding style of story-telling its predecessors had, but it's not supposed to. It was designed to be a companion to the hilarious \"Jack of all Trades\" starring the great Bruce Campbell (known as \"Back to Back Action\").The Cleo woman are tough and strong, and yes, scantily-clad, just as comic book characters usually are. Unfortunately, some fans tuned the show out early because they took it too seriously. Understandably, the half-hour shows were dominated by constant laser battles and fist-fights. But the later shows were an hour long, allowing the characters to develop and grow. That helped build the drama and made the action scenes more effective.Having the \"Cleo\" character (Jennifer Sky) be an exotic dancer from today added contrast and humor. And I'm not surprised that Gina Torres and Victoria Pratt are on new shows. They are both fine screen presences. So, relax, enjoy the comic book action and don't take it too seriously.","I love Cleopatra 2525. The show moves like lightning, plot set up takes about 2 minutes and subplots, if any, are sketched in between bursts of gunfire.  It's a show in which all extraneous elements have been stripped out, leaving you with a bunch of cute, underdressed girls running and shooting.  Yes, sometimes it's incomprehensible, but when the show is on it's dynamite.  In one episode Cleo relives the same scenario 3 times, a Run Lola Run in 22 minutes.  The pace is breathless, Jennifer Sky is funny and adorable, the show is shameless (stripper transported into a future full of scantilly clad women is the kind of idea people come up with at 4 in the morning after a lot of drinking).  It leaves you breathless.  Anyway, I love \"chicks kick ass\" shows, and if Cleo isn't quit Buffy the Vampire Slayer, it's still great campy action.  If only they would trash that horrible reworking of the song 2525.  It has the most abysmal lyrics written ever by anyone.","ya know the concept of \"guilty pleasures\"? yeah, you have 'em, like admitting you watched - and enjoyed - goonies, battlestar galactica AFTER they reached earth, v the series, charlie's angels, starsky & hutch, the 1950s version of superman, or godzilla movies.here's the ultimate in guilty pleasures. coupled with jack of all trades in a sam raimi action packed hour, this half hour slot is fast paced, easy to follow, and loaded with fun-to-watch scanlity-clad babes.the man that brought us evil dead, xena, hercules, and the adventures of brisco county jr does it again with this 2000 update of charlies angels. we got charlie (voice) an unknown being that has the knowlege and the time to find people who need help, bosley (mouser) the gadget man, and three gorgeous babes that kick a** for a living.and oh what a living!","Cleopatra 2525 is a very funny, entertaining show. You shouldn't take all the show seriously, but if you wanna have fun, that's your TV show. Being made by the producers of Xena is a quality guarantee, and Cleopatra 2525 isn't that different from Xena. The female warriors formula is brought to the future, where they don't have to fight warriors or gods, but dangerous robots which dwell in the surface, and the humans are forced to live underground. Along the two seasons of Cleopatra, they develop an interesting and funny underground world, and we get to know the three main characters: Cleopatra (Jennifer Sky), Hel (Gina Torres) and Sarge (Victoria Pratt). They all are different, but as a team, they work really well. The three main actresses appeared previously in Xena, like most of the regular/guest cast (there are some known faces from Hercules too, or from both shows). I specially liked the character played by Danielle Cormack (Ephiny in Xena), which is very different from any of her roles I previously knew. So if you liked Xena and Hercules, you'll love Cleopatra 2525. If you don't know them, try it: I'm sure you'll enjoy it.","Everyone I told about this show (especially females) was most skeptical of its quality (to say the least), but quality is one thing Cleopatra 2525 had in surplus.  After watching an episode or two however they began to see that this was much more than simple \"eye candy\" for men, this show had depth. Women are shown to be intelligent, powerful, and excellent leaders in this show more than any Sci-Fi series at the time. This show should be seen by all women for its pure self-esteem boosting qualities (my wife loves Sarge), \"girl power\" is in full force here (apologies for the cliché). Many people that thought the show was silly or degrading to women probably only saw the commercials for it, or a few minutes of the actual show (if even that) and never gave it a chance. The show had a \"pure Sci-Fi\" storyline which never drifted into the paranormal (i.e. always had a science explanation without ghosts, esp, god, etc.) which was a breath of fresh air in the midst of the many idiotic shows of the time that turned to the Paranormal to explain their plot devices.  As an example, when someone was \"out of phase/invisible\" and could walk through walls the writers went to great lengths to explain why they didn't fall through the floor to the center of the earth (ever hear another Sci-Fi or Paranormal show even try to explain that).  All the villains had motives (known or unknown) and were never presented as simply `evil'.  This show had great storylines, characters with depth, unique and creative set designs, gadgets, and special effects to die for.  The means of transportation was a blast to witness (shaft travel) as well.  The actresses were not just extremely attractive, but extremely talented as well.  This was the ONLY show I made a point to record when I would be elsewhere, and I can proudly say I never missed an episode.  My wife loves the show as well, although she can't stand the theme song and tries to make me mute it. The series unfolded in a way I have not seen since Babylon 5 (another great show, but a bit on the Paranormal side of Sci-Fi) another of my favorites. The entire series was building up to a spectacular revelation, but was cancelled for reasons unknown (after constantly being moved to increasingly inconvenient time slots that is). I can't help but wonder that if the PR for the show emphasized the Sci-Fi qualities more than the attractive women (and attractive though they are) they might not have given so many the misguided ideas that probably led to the changes in time slots, and ultimately cancellation. I give Cleopatra 2525 a 9 out of 10. Cleo, Hel, and Sarge, you will always hold a special place in my Sci-Fi heart.  >","There are moments when you don't want those deep drama-series. When you don't want series with heavy stories or a must to watch every single episode to be able to hang on. There are moments when you just want to watch a simple series, with lots of action and cool characters. For those moments, you have Cleopatra 2525.I was one of those who actually enjoyed Charlie's Angels. Critics said it was to superficial and silly. But the thing is, that's the point! People who can't relax and expected a serious movie hated it. It's exactly the same with Cleopatra 2525. It is superficial. It has silly and unrealistic characters. And that's why I like it. It isn't like any other series.The first season wasn't very good. The character Cleo was irritating and a little too much. The story was a little lame, and you didn't get to know the characters very much. But hey, they only had 20 minutes in every episode.In the last 5-6 episodes of Cleopatra 2525, they finally gave the series full 40-minutes length. And it was here I started to love it. The series finally started to grow into a very qualitative series. Too bad they had to cancel the series. Because the last episodes of Cleopatra 2525 actually was very good. I will never forget Hel, Sarge and Cleo. Unique characters that only the creators of Xena could have created!","Anyone who's watched any of the \"Action Pack\" shows like Xena and the like knows that they range from the comically cheesy to the just plain dumb. But here, in this futuristic show, somehow the formula of action, slapstick, and pop-culture in-jokes works great. Jennifer Sky is hilarious as the unfrozen exotic dancer who's WAY out of her league in this bizarre Lewis-Carrol-meets-Blade-Runner-on-acid future world, but bluffs incredibly well. Victoria Pratt pulls off the square-jaw heroics better than many before her - a 26th century Xena. And Action Pack veteran Gina Torres is finally given a three-dimensional character. The fact that our heroes are gorgeous women with exposed midriffs is more incidental than you'd think..","After only two episodes, this Xena-meets-Barbarella post-apocalyptic pajama party hasn't had a chance to deliver much...it seems to lack focus, and the pacing is extreme--likely due to the 30 minute formatting. It's a little (okay, okay, a lot) cliche, but seems well-intentioned. The premise has promise, and I have high hopes based on the cast.Gina Torres (Hercules' dynamic pirate queen Nebula), Victoria Pratt (Xena's Amazon queen Cyane) and Jennifer Sky (Xena's aspiring but capable young Amazon Amarice) have been Raimi/Tapert favorites for several seasons of Xena/Hercules, but so far they have been too busy screaming, grimacing and performing quadruple somersaults to act human yet.\nXWP/HLJ regular Joel (Strife/Deimos) Tobeck also joins the cast as the maniacal Creegan...and yes, you can recognize him even through the Mardi Gras make-up and prosthetic chin.  It's actually refreshing to see him as the Supreme Menace as opposed to his XWP/HLJ characters, who are supremely annoying (in a psychotic, endearing sort of way.)And so, All Hail the Futuristic/ Ancient Madcap Epic formulas so beloved by the Raimis...in effect a sort of Pythonesque Terry Jones/Michael Palin tribute.  And hey, there's a reason Sam Raimi sometimes credits himself as Alan Smithee, Jr., folks.---By the Way, that theme music...what were they thinking?","When the second edition of BAD TV comes out someday,this show will be in it without a doubt.You have a college girl who works as a stripper part time going in for a boob job.There are complications during the boob job and the stripper gets put in cold storage. As she wakes up it is the year 2525 and she comes across two macho amazon women in skimpy clothing who in the year 2525  go running around fighting robots who have taken over the world in 2525 and have driven humans underground.Take it from me it looks worse than it sounds. The two amazon women,Gina Torres and Vicki Pratt,go around shooting laser beam shots by throwing the fists forward as if they are throwing a punch,it looks absolutely comical to see them do this. Jennifer Sky ,who plays Cleopatra,goes about making wisecracks using 21st century jargon and screaming her head off at the sign of trouble. Aside from being a complete farce,the thing that strikes you about Cleopatra 2525,is the violent nature ,or macho nature of Torres's and Pratt's characters.Pratt's character is named Sarge and considering that this comes from the same people who brought you Xena,it isn't suprising that Sarge sort of acts as if she is Steven Seagal. That is what we get these days in our \"action and adventure\" shows now,women and girls are the heroes and macho and the men are the wimps and soft as tissue.All the robots that get shot on this show are male robots and the male robot the girls use on the show,Mauser,sounds as though he should put on an apron and start baking the cookies. It is hard to feel very sympathetic about the three main characters since they are so tough and since this is only an half hour,they won't suffer through any kind of defeat.You can't be too interestedin their fate since you know that things ,of course,will go their way. Cleopatra 2525 could have been made as a spoof like the 1966 Batman TV show,and it should be made that way.But the creators of this mess have it that they want viewers to take this a serious drama.Those who want to be taken seriously by everyone will be taken seriously by no one.","It may be campy (as described by the New Zealand TV Guide) and at times the stories may be a bit silly but with three beautiful women as the lead actors it can't go wrong.Gina Torres is great as the team leader Hel, She has the presence and the ability to pull the role off brilliently.Victoria Pratt as Sarge (real name Rose (\"they named us all after flowers\")) has the body to play a tough and ready to fight warrior (She is in my opinion the most beautiful woman out of these three).Jennifer Sky plays the dim-witted stripper, Cleopatra, who after being frozen in 2001 is revived in 2525 to help Hal and Sarge fight to retake the surface.","I picked up a DVD at the 1 discount, having no idea what it's about (but at that price I can't resist..) In brief: I was positively surprised.So much that I did quite some research. On the German DVD (part 2 of a series of 3), episodes were recombined into two 85 minute parts, and out of order. Here are my results, based on Wikipedia's episode list:\"Doomsday\" is In My Boots + The Voice (final episode). \"War of the Machines\" is Hel & High Water (1, 2) + Pod Listener + Juggernaut Down.Well, what can I say. Underdressed girlies are of course interesting for older men. I never watched Charlie's Angels so much, so I can't compare, but the more I watched, the less I looked out for bikini tops and their fillings. Instead, the characters (both m and f) became more interesting. I can imagine feminists have their fun with this, too. All in all, maybe a guilty pleasure, but a pleasure it was :^)","I wasn't expecting much at all when I saw the first episode. In fact, I was expecting to turn it off halfway through, but it actually started out kinda good. Cool tough-guy female characters and decent special effects, it was cheesey, but fun. That all ended when the main character, Cleopatra, appeared. A totally cliche screaming whiney bimbo blonde character, not at all appealing. There are things I would much rather be doing than listen to a shrieking airhead for 30 minutes. I give it a 3 out of 10.","Yuck! Where to begin. What drugged out imbecile thought this would be a great show? You get three women who run around in skimpy outfits, shooting lots of (predominantly male) bad-guys. They leap, they somersault, they shoot. And that's about your lot.Oh! Did I fail to mention that the title character screams at any opportunity and for great lengths of time? Did I mention that it all grates on your nerves? Let's also not forget the badguy boss (or one of them, anyhow) who dresses up like Gene Simmonds on mescalin. And if you don't know who Gene Simmonds is, then you are definitely the right age group for this show.It's just awful, awful trash. How could Sam Raimi and Rob Tapert come up with this abomination? You can't even enjoy it as farce because it's so diabolically bad.And what's with the \"everyone lives underground\" nonsense? why is there a great big shaft through the middle of this underground realm? Why do we only see people jumping down the shaft, but never see anyone climbing up? Where did all the mutants come from? What the hell is going on? Although only running to 30 mins, each show is anything but mercifully short. Now at least I know what the crew of the \"Event Horizon\" saw that caused them to gouge their eyes out! Avoid this show like the bird flu....","In 2000, with Hercules and Xena winding down, two new shows were created in an attempt to fill the void. One was the Bruce Campbell vehicle, Jack of all Trades, the other was Cleopatra 2525. The shows didn't attract the viewers that their predecessors had, and were cancelled after the first and second seasons, respectively.  I had never paid much attention to syndicated television shows. To me they had always been dumb, late night entertainment, something to watch when there's nothing to do, but you're not tired enough to go to bed yet. Then one day, while flipping through one dull show after another, I landed on Cleopatra 2525. I was hooked.  But why? I was above this mindless entertainment, wasn't I? What led me enjoy a series by the same people who spawned Hercules and Xena?  First of all, to be honest, the fact that the show revolved around women in form-fitting suits didn't hurt initially. Secondly, the show was basically Science Fiction, a genre I love, as opposed to Fantasy, which I'm less receptive to. In addition, I found that the very reasons I had avoided such shows might have been one of their greatest qualities. The fact that they're not taken seriously allows them to slip many things in under-the-radar', and most don't pick up on it because the figure it's just brain dead entertainment.However, I didn't find it at brain dead all.  There were, here and there, some wonderful and surprisingly original Sci-Fi elements and even, believe it or not, some good stories.  Many of Cleo's writers have impressive resumes, and have worked shows such as Buffy', The Outer Limits', The Pretender' and Enterprise'. Remarkably well assembled for a syndicated show, I believe it had underlying themes and allusions that many failed to recognise. This is largely because they, as I had in the past, looked at these shows only superficially, not bothering to entertain the possibility that there was more going on.The basic premise of the show is very interesting. Consider the fact that all three of the leading characters are women.  Their unseen guide voice' is, in fact, that of a female. Mauser, the one male in our group of heroes, seldom leaves the base of operations, and attends to many of the housekeeping' duties, such as repairing equipment, etc. Another interesting note on Mauser is that he was formerly a Betrayer, a being who aids in the enslavement of the humans.  Hel's personal arch-nemesis, Creegan, is also a male.  There are some intriguing implications made here, and one can draw their own conclusions upon watching the show.  Needless to say, the show examines gender roles and stereotypes. All this serves as an example of the elements of the show that slip by, unnoticed by those who fail to examine the show beyond its surface. Cleo. 25 is very much a typical syndicated show superficially.  Women in form fitting clothing, incessant comedic relief, and action strung along on a shoestring budget.  Deceptively, under this lies some interesting concepts and enjoyable characters.  The show does have it's fans, and you can running into them online is always a pleasure.   Perhaps, by some strange twist of fate, we'll encounter Cleopatra 2525 again one day.","As micke_rofon said here: (href=\"http://www.imdb.com/user/ur15937974/ref_=tt_urv)\"...Superficial, action-packed and light story - take it for what it is!...\"It wasn't meant to be a serious or realistic sci-fi show.I don't understand why people always put down TV Shows & Movies without taking in consideration the budget,time period, technology of the day, and other per tenant info.Cleopatra 2525 was made to be entertaining and not taken to seriously. it was purposely made to be fun and silly, yet they still managed to include morals and real life questions with out having to figure out whats going on . It allows you to be just entertained with out thinking to hard.Take it for what it is a show where the actors had fun acting in silly costumes, unrealistic tech and so forth. Don't think just enjoy the show as it was meant to be.If you like(d) Hercules: The Legendary Journeys (1995) or Xena: Warrior Princess (1995) or Babylon 5 (1994) or Andromeda (2000) I think you'll like Cleopatra 2525.","Most likely \"Cleopatra 2525\" will be of little interest if you did not watch the series when it was broadcast; and I don't think that many people did. But if you are still somewhat intrigued it is a \"Buck Rogers in the 25th Century\" premise without space ships and with no budget for wardrobe or production design. In this case the Buck Rogers part (Cleopatra) is played by Jennifer Sky. Which one might expect to be a good thing as Jennifer is very beautiful and quite talented; and has a nice comedic touch. But a quick glance at the promotional material will show that she is somewhat the worse for having a bad haircut and a Salvation Army Thrift Store wardrobe. If you remember how fetching Jennifer was during her time on \"Xena\" her dowdy Cleopatra look will be a huge disappointment. With a target audience of \"teenage boys looking to burn their eyeballs looking at \"hot fetish-attired girls\" it is not a good idea to skimp on the exploitation value of your heroine or her costume. And they wonder why some series don't attract much of an audience. Love it or hate it, \"Buck Rogers\" had hotter costumes and much better looking guest stars. The other two exploitation elements are Cleopatra's two female associates; Hel (Gina Torres basically playing her stock \"Firefly\" character) and Sarge (Victoria Pratt-another \"Xena\" connection-an extremely wooden version of Natasha Henstridge). Torres does a good job playing off the Cleopatra character, providing most of the show's comic relief. Torres sings the theme song, a somewhat lame parody of Rick Evans' \"In the Year 2525 (Exordium and Terminus)\" (1969). You remember the one that opens with the words \"In the year 2525, If man is still alive, If woman can survive, They may find...\"I suspect that they gave the series its title so that they could butcher this catchy little song although who knows, perhaps the title is a homage to \"Buck Rogers\" and they thought of using the song later. So, the premise of the show is that the Earth's surface has been taken over by aliens called Bailies (not the WKRP one) and the humans have been driven underground. Our three heroines fight against the Bailies under the direction of a disembodied (presumably) female voice (appropriately referred to as \"Voice\"). Unlike Buck Rogers, Cleopatra is kind of a wimpy third stooge, still dazed and confused from her cryogenic sleep or maybe just disoriented from the creepy haircut. There are a lot of nice close-ups of Sky wide-eyed and bewildered. Like \"Buck Rogers\" the running gag is Cleopatra using a common 21st century expression and everyone finding it either totally profound or completely baffling. Unlike \"Firefly\" the action is more of that hyper edited \"Xena\" garbage which is neither realistic nor particularly entertaining. One good gimmick is that the girls travel around \"Spiderman\" fashion, a sort of web slinging through tunnels and shafts in the labyrinth of their underground world. Strangely (or maybe not considering the budget) these are only half hour episodes and except for one two-part show there is not enough time for any subtlety and nuance. Then again, what do I know? I'm only a child.","At first I thought that this would be a lame updated version of Xena. The more I watch it I must admit I like the show. It doesn't hurt to have 3 gorgeous women in lead roles. I would like to see Cleo more assertive however, just surprise me one time. The only drawback though is I'm not learning about Greek mythology like I was while viewing Xena or Hercules.","This really is what schlock TV is all about.  A stripper wakes up in the distant future bringing along with her a ton of pop culture references to describe the future world. Of course, as anyone versed in the future, all women are remarkably sexy and wear revealing clothing as they do battle with evil robots.  Anyone watching this would have to come away shaking their head and muttering about how this is easily the silliest TV show on the air; and then find themselves checking the TV guide to see when its on again. It's totally and irredeemably mindless entertainment, but entertainment nevertheless.","Something about a future Charlie's Angels with a kick makes this show hopelessly fun and addicting.  Though Jennifer Sky is POINTLESSLY annoying as her character. Victoria Pratt and he other co-star make it worth watching. In order to make this show better it should be increased to an hour, remove Jennifer Sky completely and extend the story plots and the show would be much better.  But as far as trash TV goes, it's stupid and fun.  And again, why would one be addicted to watching this??? Hmmmm...","A Stripper is cryogenically frozen in the year 2001 and unfrozen in the year 2525. Many things have changed, Robots have taken over the earth, forcing humans underground to fight for their freedom. I first thought this would be extremely lame, but I had to give it a chance. The special effects are really good, and the writing, surprisingly is good too. The show is only half an hour though. All in all, its an OK show, i give it a 5 out of 10..","The antagonists in this series are robots that are exactly like the ones in the Terminator 2 and 3 movies. That said I don't think this series had a lot more going for it with the possible sexist exception of T and A appeal re the three starring characters being sexy women. Kind of like weekend entertainment for males in their 20s. Not evil, but kind of transparent.The fact that something like this actually was made is maybe not so great, and that is not to disparage the looks of the actresses one bit. Maybe Charlie Sheen was behind it. I can't think of anyone else who could take an idea this flimsy seriously enough to actually send it into production. The special effects are also not that believable, done in sort of cheap CGI. \"Hard Core\" fans of SF might buy the series sight unseen in DVD format, but I think they also might be fairly disappointed with it. They never should have created it.","From the setup (a young woman is cryogenically frozen in 2000, is defrosted more than 500 years to arrive in a world overrun by a terrible threat to mankind, and falls in with heroic freedom fighters) to the characters - particularly our heroine, who's very cute in a Chiana-from-\"Farscape\"-but-non-albino kind of way - \"Cleopatra 2525\" is as close to a live-action cartoon as any TV series in recent years has come. This in itself is no bad thing, especially since animated shows have long been worthy of more attention than they often get... but unfortunately the show isn't exactly on the level of \"Batman,\" \"Gargoyles\" or even \"Mighty Max.\" In fact, it veers closer to the quality threshold of \"Rude Dog and the Dweebs\" - with Cleopatra very definitely being the dweeb in this scenario. It might actually play better if it was animated, and its half-hour length wouldn't seem like so much of an anomaly (the show seems a bit rushed and compressed at this length, perhaps because half-hour action shows haven't been widely made in live-action for decades, whereas in animation they never went away and hence they never lost the knack). But while it can't compare to the Slayer, the Warrior Princess, Seattle's Dark Angel or even Townsville's Powerpuff Girls, you have only to watch \"VIP\" or the later episodes of \"Lexx\" to realise that it could be worse. And my thanks to the uncredited people responsible for the special version of the horribly depressing and depressingly horrible \"In The Year 2525\" - most of the words are changed and the tempo made more upbeat, resulting in a vast improvement over the original. Not that I'm sorry the show got cancelled, but at least it got something right.","\"Cleopatra 2525\" started off bad, got worse, became tolerable, but than sank back to the rank of unwatchable. The opening theme  was horrible, I don't think I could listen to it again without hurting someone. The acting was the worst I had seen and the premise extremely sad. The Special effects were ok, the plot could have been better, but the characters really needed work. They came across as stupid on their own and passable as a team. Also the title character was (rightly) pushed into the background. All in all, I gave this 3/10.","The only reason I watched this show was because I was waiting for \"Jack of All Trades\" to start. Boy, did I regret it! This show achieved what I thought was impossible. It dethroned \"VIP\" as the dumbest show on television.The show revolves around two women in skimpy outfits in the year 2525 who spend their time fighting evil robots. One day, they come across a stripper who went in for a boob job and got cryogenicaly frozen instead. She gets woken up 500 years in the future so it's too late to file a malpractice lawsuit. So she's sort of adopted by these two women to aid in their fight against these evil robots.So what's wrong with this show? Let's see, where should I begin? There's the bad acting from the three leading ladies. There's also the cheesy special effects. I could mention the scripts, which seem like they were written by the sci-fi freak in junior high writing class. Despite being the title character, Cleopatra does little more than scream and act frightened every time a group of bad guys attack. The show is mercifully short at 30 minutes, yet it still seems as long as \"Barry Lyndon.\" It also as the dopiest theme song I've ever heard on a TV show. \"In the year 2525/there are women with the will to survive.\" Yeah. Can you pick your son, pick your daughter too from the bottom of a long glass tube?My advice: read a book or do something constructive with your 30 minutes until \"Jack of All Trades\" comes on."],"review-user":["mjarvis0","richgei","cherold","tripperM","Lyceus","skeptic1222","micke_rofon","Phantom-43","Cari-8","pooh-24","TheSorcererBard","suchenwi","Rick-79","Rob_Taylor","ParanoidAndroidMarvin","deeww1","aimless-46","cpat","sychonic","PBXBear","hammer_pants","alienworlds","Victor Field","johncarpenter","JeffG."],"review-date":["18 September 2006","8 March 2003","8 May 2000","10 December 2000","3 February 2008","10 September 2001","9 July 2008","20 February 2000","31 January 2000","1 March 2000","21 August 2001","7 June 2009","27 January 2000","16 November 2005","1 October 2002","6 July 2017","31 December 2008","12 April 2000","28 February 2000","12 November 2000","22 January 2000","2 May 2010","11 August 2001","20 February 2000","30 January 2000"],"review-rating":["7","9","8","9","7","8","8","4"],"review-title":[" Think before you judge and surprisingly good acting\n"," A Comic Book Come to Life\n"," an hour show in a 1/2 hour slot\n"," millennial angels...\n"," Really funny! You won't be disappointed\n"," One of the most original, creative, and entertaining shows of the genre.\n"," Starts bad, but ends good! Superficial, action-packed and light story - take it for what it is!\n"," Finally, a good \"Action Pack\" Production!\n"," Post-Apocalyptic Pajama Party...\n"," Bad TV 2000\n"," Three women fight to reclaim the planet\n"," Galactic Swimsuit Issue\n"," Oh well...\n"," In the words of Grandpa Simpson.... \"Kill it! KILLL ITTT!!\"\n"," It seems like it's just entertainment, but there's more...\n"," Superficial, action-packed and fun to watch\n"," Buck's Babes\n"," Like to see Cleo more assertive\n"," a howl, mindless entertainment\n"," Why would one be addicted to watching this?\n"," Eh? A Stripper fighting robots, suuuuuuuuure....\n"," I thought it was a fairly shameless Terminator rip-off\n"," Better than that dreadful Zager and Evans song, anyway...\n"," I can't believe I sat through this\n"," How to make 30 minutes seem like an eternity.\n"]}