{"review-url":["http://www.imdb.com/title/tt0238112/reviews"],"review-text":["Ok, it's a given that you cannot make a good movie from a good book. (Unless you make it a trilogy :-) But comparing the book Corelli's Mandolin to this movie it's clear how much has to be cut to fit a screenplay. The book is very funny in places, romantic (of course), dramatic. What's left of it in the film is inexplicable romance -- as other reviewers have remarked, it's unclear why she falls in love with the italian while her betrothed is still around, and I have no idea why this was changed from the book -- and some gratuitous gunning and bombing scenes, more than in the book which derives its power from not hammering on the obvious points. Whole characters are cut: Carlo has maybe 10 seconds screen time, while in the book he has a whole story line that runs several chapters.","I have to admit that I approached this movie with a sense of expectation and dread. Louis de Berniere's bestselling novel is one of my favourites and anyone who has read it will realise that there is no way in hell that any screen adaptation can be 100% faithful. All the way through I found myself convincing myself that the movie was unsuccessful, and had stripped the book's plot back so far as to render it redundant. The ending, however, is much better than that in the novel, and I could not stop thinking about the movie afterwards. Still, the plusses (John Toll's magnificent cinematography, Stephen Warbeck's great score, etc) I felt did not outweigh my initial negatives (Cage's miscasting, a heavily diluted script).But, two days later, I was queuing again to see Corelli, and although not perfect, I have to admit now that the movie is the best anyone could have expected. Cage is actually brilliant in a role that even de Berniere was concerned was not a fully rounded character: his carefree spirit which gives way to shattered remorse is spot on, and complements the superb double act of Penelope Cruz and John Hurt perfectly. David Morrissey is quietly effective as Weber, the Nazi officer trying to reconcile his feelings for his newfound Italian friends and his inbred superiority complex to those around him. And the fine Greco-Italian supporting cast bring de Berniere's sundrenched world of Cepholonia dazzlingly alive.On leaving the cinema second time around, I finally let go my passion for the novel which prevented me from fully appreciating the story of WW2 Cepholonia in cinematic terms. My hat goes off to John Madden who, despite the almost expected critical drubbing he is receiving from the British critics (any director who has had a major success like Shakespeare in Love behind them is always a target for these moaning ninnies!),has managed to transfer a terrifically difficult book to the big screen with such heart, verve and humanity (the core virtues of the novel, in fact) that he has created another classic love story that will probably only be fully appreciated when the dust has settled a few years from now.If you are a fan of the book, like me, it's hard, but try not to make the same mistake on your initial viewing. Try to erase the book from your mind for two hours, bathe yourself in the glorious Mediterranean atmosphere, and discover Corelli, Pelagia, Mandras, Dr Iannis, as if for the first time (pretend you're watching something made from an original screenplay), and I guarantee you won't be disappointed. In fact, you'll be eagerly waiting to own your own copy of this delightful movie on video or DVD.8/10","As is often the case when you attempt to take a 400 plus page book and cram it into a two hour film, a lot is lost.  Here director John Madden (Shakespeare in Love) takes on an extremely ambitious project and almost pulls it off.  What we get is a charming and emotionally compelling film that seems somehow incomplete.There is much about this film that is wonderful and fantastic.  The cinematography by John Toll (Cinematographer for Braveheart and Legends of the Fall, winning Oscars for both) is splendid.  Working with Madden, the choices for locations on the Greek island of Kefallonia are superb and the visual images that come from photographing these majestic locations in varying light are lush and beautiful.  Madden also uses numerous Greek actors as the townspeople, giving the town an authentic feel.  The soundtrack is also terrific and the mandolin passages and vocals by the Italian soldiers are marvelous.Madden does an excellent job of bringing us the Italian occupation and the romance, which take up the greater part of the film.  There are numerous sweet and funny moments throughout this segment.  However, by the time the serious battle drama is ready to unfold, there isn't much film left in the reel and this component is extremely rushed and abbreviated.  While the battle scenes are well done, subsequent to the battle it is obvious that increasingly greater compromises are being made to keep the film from running too long. By the time we reach the post war scenes, the treatment is merely skeletal.  Another negative is that the DVD is particularly sparse on features.Nicholas Cage is charming in the romantic lead as the sentimental Captain who seems to have joined the army to sing rather than fight.  When fight he must, Cage switches gears seamlessly into a man of fierce principle and resolve and somehow remains believable in both personas.Penelope Cruz, whom the camera loves, gives an uninspired performance as Pelagia.  In part this is because Cage so dominates the screen, but Cruz just seems too placid in a part that should be emotionally torrential and dynamic.  She allows the character to be objectified as Corelli's love interest rather than establishing her as a powerful character in her own right.John Hurt gives a fantastic performance as the wise old doctor, who knows as much about human nature as medicine.  However, Christian Bale seems a bit overwrought and stiff as Pelagia's fiancé.I rated this film an 8/10.    Despite some drawbacks, this is a touching film that is well worth seeing.  The photography alone is worth the price of admission.","After a somewhat slow start I thought this movie about the Italian occupation of a Greek island during World War II picked up and became a quite enjoyable watch for a couple of hours, from primarily two points of view. The love triangle is an interesting one and strikes me as believable, because I know it happened in various places under occupation. Penelope Cruz played Pelagia, a young Greek girl engaged to be married to Mandras (Christian Bale). I had questions about the depth of their love from the start, but their future was torn apart when Italy invaded Greece, and Mandras went off to fight. After German intervention, Greece is conquered and the island Pelagia lives on comes under Italian occupation, during which Pelagia meets and begins to fall in love with Captain Corelli (Nicholas Cage.) This, of course, was a dilemma that came to many young women in occupied lands. As they got to know their occupiers, they started to see them not as the enemy but as real people, and sometimes fell in love - often to the disapproval of their neighbours. I just finished reading an interesting book about the German occupation of Britain's Channel Islands in which this was a major issue. Once Mandras returns to the island, Pelagia is torn between them.The second background issue is the Italian occupation itself, which I thought was quite realistically portrayed. First was the contempt with which the island treated their Italian occupiers. Greece defeated Italy (quite true from a historical perspective) and was really conquered by the Germans. The refusal of the town to surrender to the Italians and instead to insist on surrendering to a German officer struck me as something that could well have happened (and was quite funny in fact. I loved the line, \"we would rather surrender to this German's dog than to you Italians.\") The portrayal of the Italian troops also struck me as believable. The Italian Army was never enamoured of their German ally, and never enthusiastic about fighting with them. Although Hitler and Mussolini were close friends, their soldiers tended to treat each other with contempt. Here, the Italians are more interested in singing than fighting (which the German troops on the island simply can't understand,) and are ecstatic when Italy makes peace and withdraws from the war - until they discover that this may well make them prisoners of the Germans. It was all quite well done, I thought.It falters a bit at the end with an all too predictable finish, but still deserves praise.7/10","Being Of Cephallonian descent, I was happily surprised when watching the movie. I have heard the true history from my relatives that still live in Cephalonia, but when watching the movie and reading the book the sketchy bits of history were filled. It is all true, the Italians would sing, the oppression and the earthquakes that rock the island so often. The earthquake in 1953 killed my great grandfather and the book and movie both portray the feeling of the era with great compassion. If you haven't seen the movie go and watch it and read the book, it is not only a love story, and yes, there were plenty of Italians in love with Cephallonian women, in fact, boat loads of Cephallonian women were taken to Italy after the war, it is a true depiction of history.","Unlike many, I have not read the book and so I watched this purely as a film in its own right.  I'm not especially keen on romance dramas, and I expected this to be a bit slushy and/or operatic so I was rather hesitant about going to see it in the first place...But I'm glad I did, because it was good.  Beautiful, \"feel good\" scenery and with a light touch of humour that made it rather more endearing than a straight drama would have been.  The romance was gentle, inoffensive and sufficiently interwoven with enough \"proper\" story-telling to keep my interest, and the score was not too obtrusively operatic.\nOverall, the film takes a satisfying circular route from start to finish, inducing a range of emotions as it progresses.  It's about 2 hours long, but I didn't find myself fidgeting or looking at my watch once - and that's quite a feat for me!!  Very enjoyable.","The main problem with 'Captain Corelli's Mandolin' is that it focuses primarily on the romance between Corelli and Pelagia and that too is half-baked. What is it that draws Pelagia towards him is too unclear. Is it just his musical talent or his zest? The film is set against the backdrop of a war between the Germans and Italians in a Greek island but the war is given less significance and what we see appears very sketchy. The entire film appears too sketchy, melodramatic and clichéd. Much of it is also historically inaccurate.On the technical front it is well executed. The cinematography of the beautiful exotic locations is breathtaking. The score is terrific. Where acting is concerned, Penelope Cruz can't seem to lose her Spanish accent (she's playing a Greek character) but her performance is otherwise wonderful. John Hurt and Christian Bale are equally marvelous. Nicolas Cage is a miscast. His Italian accent, energetic personality, overdone non-verbal gestures all yield to a caricature rather than a character.Perhaps director John Madden was pressured to fit the entire novel into a two hour period and he chose to focus on the romance more to draw a larger crowd. I can't shake the feeling that perhaps someone like Anthony Mingella would have made a better and more complete film of it.","At first I didn't think I would like this movie, but as it progressed it became better and better.  I love music and I was impressed with how well Cage could fake the movements of playing a mandolin.  My son was with me and he also like the movie a lot for its music and the story and the way the story unfolded--- slowly showing how Corelli won the girls heart.  The acting and the story were both well done and well directed. At first Corelli's bravado was irritating, but soon he grew on you. The twists in the plot were intriguing especially the relations with the Germans.  I would like to see this again to follow all the side plots. I also want to buy the sound track to hear the music again.","Well, I see most of you liked this movie(I didn't). I read the book a few years ago and thought that it was quite good. I am of the firm belief that one shouldn't really compare books to their adaptation to the screen but this time It was hard not to. OK it's somewhat beautifully shot and the scenery is as I had pictured it but it ends there. Nick Cage is probably one of the most overrated actors of our time and his embarrassing shot at the Italian officer is remarkably unconvincing. I had hoped that American film makers would stop making the actors do fake accents to represent them being Italian etc. but no...audiences are obviously thought to be so stupid that they wouldn't understand that Corelli is Italian if he spoke with no accent. Then we have the Hollywood ending and all the other major changes in the script... (spoilers) Mandras is in this movie some kind of hero/friend of Corelli and helps him as opposed to trying to rape Cruz's character and getting killed as in the book. And of course Cages and Cruz's characters get back together a few years later instead of when they're in their 80s. I wish Hollywood wasn't so afraid of telling an uncomfortable story so that good books could become good movies instead of bad ones like this.","When I was watching this movie one thought had come to my mind for several times: \"It's not really what I expected, I thought it would be better\", but now that I finished watching it I realize: why should I expect a better result from this movie? Isn't it just a \"love story\" made up in Hollywood show's standards? Of course, it is! If so, why expect more? Captain Corelli's mandolin is a romance story in war time (WWII) and the plot which I was noticed about before watch the movie seemed very interesting to me. All that I didn't count was the \"Hollywood standard's\" touch... What I mean by this is that I expected a story a bit more realistic and with a stronger plot (which was not full of \"plot holes\" as this one is!) instead of this \"sweet story romance, with the perfect ending\", which we're used to watch in a great part of Hollywood's movies! Another Hollywood standard's gaffe which is very common is the natives' languages issue. The differences between Italian, Greek and German languages were all done just by a stupid accent, and all people seem to understand each other very well. The Italian and the German army arrive to a \"forgotten\" Greek island and they all understand each other very well as they all speak the same language! Of course it's just little technical details that don't even matter to the plot, but are all this little details which separate a good from a bad production! But the movie has not just bad-sided arguments! On the good side, I can find the original idea (which comes from a book), and the thought that is possible to be Human, and have Human feelings, even inside a War. It's possible to sing and be happy, have good feelings, to love and to be loved in a War time! Was because of that main idea that I wanted to watch this movie, and at this particular point I wasn't disappointed! I just was dissatisfied about the way it was made! Another good-sided argument is History's knowledge The movie is not very deep at that issue, but it's good enough to have a little idea how was the WWII in the Eastern-South Europe.Globally Captain Corelli's mandolin is not a bad movie but it's not as good as I initially though either, mostly because of the \"Hollywood show's standards\" up-mentioned.","A beautiful, sensitive film that brings home the futility and cruelty of wars no matter what the so-called reasons. The performance of Cage and Cruz were quite impressive, but it is to the older Greek characters that go the highest praises. Irene Papas is as gorgeous as ever! Though some scenes seems a little long at times, this film will be a heavy Oscar contender.","How in the world does this get 6 outta 10? My goodness. Cage's italian accent is miserable, the love story is contrived, the war is ridiculously glossed over. This was one of those movies that was so bad, that I kept watching out of shock (just to see how low it could go). Then I found out..... Cage survives more than 40 MACHINE GUN ROUNDS from an German MG-38?????!???. I don't care if someone shielded him, bullets go through people, especially machine gun bullets. I mean, we can only be expected to believe so much! Just plain bad... certainly one of the worst war movies I've ever seen.","SPOILERS AHEAD: Others here have wondered how this rates an IMDb 6/10. They're not alone, though my math runs slightly different: 8/10 for the first 30 minutes, zilch for the rest. Because it's as if there are two movies here: a lyrical small-budget essay about the impact of reluctant victors on reluctant losers. And a war movie so addled of execution you not only wonder where the hell the mandolin went, but where the plot disappeared to as well. It's as if director John Madden suddenly grows tired of the picturesque and picaresque and goes home, leaving everyone to stumble around in a morass of exploding cliches. Exposition? There ain't any. Bad enough that Cruz's capitulation to Cage is so unreal; worse, though, that the Italians sign up without demur or debate to the partisan side and battle it out with their former German allies for. . . What? No idea: if the island's some kind of strategic outpost, the script certainly seems unaware of it. Lazy film making doesn't get any lazier than this. What's especially sad about all this is that the original novel was based on fact, and wrought with such a delicate hand that it deservedly met with world-wide praise. Here, however, history is tarnished rather than garnished, and truth made to look like just another celluloid improbability. The nadir comes with the post-war 'earthquake', when you think 'aw for God's sake, do we REALLY need this rubbish on top of everything else?' Only later do you realise that the earthquake did happen, and that it's the movie's narrative incompetence that makes fact look like fiction. Of the cast, only Cruz and Hurt are worth mentioning: Cruz, because she is a consistent, consummate actress, and Hurt because he gives the impression that there's still some dramatic meat left on the plate even when the script ultimately deprives him of anything to gnaw on. As a result, Hurt's concluding monologue -- which wraps up the entire movie -- at least sounds slightly less trite than as written, so that you're not completely flattened by the stupefying banality it all. Even so, the performances of Cruz and Hurt still fail to mask the central problem that, at the end of the day, 'Captain Correlli's Mandolin' isn't actually about Corelli, or his mandolin, or indeed. . . anything at all. Hopeless. 2/10.","I voted two instead of zero because the island is wonderful and I grudgingly admit that I really appreciated the camera. But story-wise? Why the hell did they even bother using the name of the book when the only thing they used was names and a very, very crude initial settings? The amazing transformation of Mandras from every-day village lad to the bottom pit of human scum - gone. Carlo, a whole storyline of beauty, sorrow and prevailing humanity - reduced to twenty seconds of valiant dying that leaves us wondering why (and why the hell so long?). The book was about life first and foremost, and all its aspects - love, death, survival, cruelty, kindness, nonsense and magic etc. This movie is a weird watered down love story of a highly improbable Nicolas Cage and Penelope Cruz (who's actually OK despite her Spanish accent :-) ) with all the rawness and irresistibility of the forces of the human heart and twisted minds vanished. I was left wondering why the hell did they even fall in love, I didn't feel their love at all, the movie was full of loose ends and weirdnesses - what the hell was Mandras doing popping in and out all the time? Meaningful parts of the book were discarded while bullshit and inconsistent though nicely hollywoody passages added... OK, it is a bitter diatribe but I actually registered IMDb to voice my disgust, so there you go. If you didn't read the book and liked the movie, read the book, you'll be blown over. If you didn't read the book and hated the movie, read the book, you'll be blown over. Howgh.","\"Captain Corelli's Mandolin\" confuses more often than entertains. Although I haven't read Louis de Bernieres's World War II-era bestseller, I know enough about the changes to recognize the shortcomings of director John Madden's leaden movie adaptation. Audiences may remember this English director best for his 1999 Oscar-winning comedy \"Shakespeare in Love.\" Personally, I enjoyed Madden's earlier effort \"Mrs. Brown\" (1997), starring Judi Dench as Queen Victoria. Nevertheless, if good looks guaranteed great cinema, \"Captain Corelli's Mandolin\" would qualify as spectacular. Lensed on location in scenic Greece by two-time Oscar-winning cinematographer John (\"Braveheart\") Toll, this ambitious but abominable Nicholas Cage & Penelope Cruz wartime tearjerker is easier on the eyes than the ears. Aside from establishing a concrete sense of setting and atmosphere, Madden and scenarist Shawn (\"A World Apart\") Slovo have butchered Bernieres's novel so that it emerges in bites and incomprehensible pieces. Incredibly, Madden and Slovo let the action veer erratically between comedy and tragedy with an indifferent romance at the heart handicapped by a curious lack of chemistry. Complaints about miscasting may arise in the minds of some moviegoers. Nicholas Cage's insufferably sweet, Puccini-loving, mandolin-strumming Italian artillery captain is almost enough to give Fascism a good name. Meanwhile, nothing good comes of Cage's ersatz Chico Marx accent. Actually, Sylvester Stallone would have been convincing in this role. If poor dialects irritate you, prepare for a veritable cacophony. English supporting actor John Hurt, Iberian beauty Penelope Cruz, and Welsh leading man/villain Christian Bale all sound and look out-of-place alongside Greek native Irene Papas. Purists will most likely skip this Zorba the Greek meets \"The English Patient,\" not only for its inconsistent babble of accents but also for its mishmash of historical revisionism, not to mention its pallid plot.\"Captain Corelli's Mandolin\" unfolds on the idyllic Greek isle of Cephallonia in 1940. A wise old local physician, Dr. Iannis (John Hurt of \"Alien\"), who has been compiling a history of the island and its earthquakes, narrates this yarn. He lives outside the village with his grown-up, headstrong daughter Pelagia (Penelope Cruz of \"Blow\") in a small mountainside home. A brawny fisherman called Mandras (Christian Bale of \"Shaft\") wins Pelagia's heart with his rough and tough ways. Her crusty old mustached father warns her from the start: \"I would expect you to marry a foreigner.\" According to him, Greek men dominate their wives, and Mandras is \"not her equal.\" When Mussolini invades Albania, Mandras and she get engaged. He ships out to fight the Italians. Pelagia pens dozens of letters, but Mandras never sends a reply. Later, we learn about Mandras's illiteracy. Perhaps Pelagia's father knows best. Anyway, this revelation smells like a plot contrivance. How could a bright, well-educated girl like Pelagia overlook such an obvious fact? She serves as her father's nurse and aspires to be a doctor herself. Doctors are trained to observe, so Pelagia should have known. Furthermore, neither Mandras nor Pelagia appear as if they were made for each other. One flirtatious splash in the Mediterranean doesn't a romance make. Madden doesn't pump up the passion between these two. Sadly, Bale and Cruz make an unpersuasive couple. Meanwhile, Madden has given audiences the village tour and introduced its citizenry. Dr. Iannis wields a fishhook to extract a dried pea from a man's ear canal. Although his hearing has been restored miraculously, the husband dreads a future where he must endure his wife's constant complaints. This joke serves as a bookend of sorts that opens and concludes the film. Suddenly, the skies erupt with military aircraft and parachutes blossom. Mussolini's Fascist troops have come to occupy Cephallonia and ships pour in more men and equipment.When Captain Antonio Corelli (Nicholas Cage of \"The Family Man\") lays eyes on Pelagia, her beauty overwhelms him. \"Bella bambina!\" He exclaims and orders his platoon to glance in her direction. Initially, true to the romance formula, Pelagia wants nothing to do with Corelli. She regards the Italians with fear and loathing. Corelli is not only an artillery captain but also serves as a translator. The scene in the town square when the Greeks refuse to surrender to the Italians, preferring instead the Nazis, deserves a lusty laugh. Later, the Italians decide to billet their officer elsewhere. The Italian Army quartermaster makes arrangements with Dr. Iannis to board Corelli. Pelagia hates these arrangements, until the captain captivates her with his mandolin.Gradually, Pelagia's glacial attitude melts, and she falls in love with Corelli, even after her betrothed returns to the island and joins the Greek partisans. Mandras's mother Drosoula (Irene Papas of TV's \"Homer's Odyssey\") is not happy about this new arrangement. The Cage & Cruz romance kindles few sparks. A more meaningful but tragic romance occurs between a so-called good Nazi officer, Captain Gunter Weber (David Morrissey of \"Hilary and Jackie\") and another island girl. Although Madden shows the Italians firing their artillery, this bunch of guys heads to the beach to guzzle wine and warble Verdi operas to their prostitutes. At first, everything seems great when our protagonists learn that Mussolini has surrendered and the war is over for them. \"Captain Corelli's Mandolin\" has focused primarily on comedy until the Nazis come goose stomping into the action, and everything turns tragic. Sadly, Madden botches both assignments. He cannot stage a decent big battlefield scene, and he fares no better with the intimate romance scenes. If you're looking for a better version of \"Captain Corelli's Mandolin,\" then check out Gabriele Salvatores's \"Mediterraneo\" (1991) which won the Oscar for Best Foreign Film. World War II buffs will appreciate the genuine-looking Stuka dive-bombers that rain destruction on Cephallonia. The lack of romantic chemistry, a hopelessly muddled plot, and leaden direction sabotages \"Captain Corelli's Mandolin,\"and it fade outs on a whimper rather than a bang of jubilation.","I have just returned from Kefalonia. That's the only reason for marking this movie with \"3\". I like the Island...I simply have no idea what's wrong with John Madden. On the paper, the guy seems to know what he's doing. Seems to be able to differ good from bad (if we take that there is no right and wrong). But after letting myself finish this movie (since I seem to be a masochist when it comes to finishing everything I am watching) I have got the impression that this fellow had been directing this in a complete emotional chaos because I can not believe that his fellow citizen Louis de Bernières had anything close to this idea. Love story?! Goddammit no! Let's start with the casting. Nicolas Cage?! Let's see, his character is a profligate Italian occupier fighting along with the Nazis under Mussolini and seducing a wive of an honest Greek patriot who goes to war to prevent his home Island being occupied...On the scale of charm from 1 to 10, that actor must have been something like 15 to even having any chance to make his character acceptably nice so one could even finish watching the movie! There were only two movies in the entire career of Nicolas Cage when he reached above 5 on such scale and where he has been able to transfer some kind of emotion through his character: Leaving Las Vegas and Face Off. However, considering that something above 5 is way below required 15, I have a feeling like I have been raped after watching this movie to the end.OK, I understand. The history of art deals with probably the greatest anguish of mankind - the unpredictable ways of love. But after she (Pelagia - Penelope) was able to deceive and leave her handsome, honest, simple-minded patriot Mandras played by Bale (probably the only one partially rising to the occasion along with Penelope here) for the (above described) Cage, I believe the only honest feeling one could actually gain would be to support the angry Kefalonian inhabitants by marking her with βρώμικο πουτάνα - sporca puttana (for the ones still liking the Italian lover :) No really, even John Waters' Pink Flamingos love does not seem so repulsive anymore.OK, I could be moving on with this, but I believe I have made my point clear enough.","I haven't read the book so I'm not anal about the movie digressing from the original plot. But it's still a horrible movie. If you want to make a schlocky love movie with Nicholas Cage affecting a risible Italian accent like out of some Little Cesar's Pizza commercial, be my guest. But please show some respect and don't base it on a real tragedy, the bloody German-Italian occupation of Greece in the Second World War and the 1943 massacre of 9000 Italian troops by the Germans.To be fair to the movie, Penelope Cruz does her usual excellent job of playing an attractive girl who painfully holds out against her romantic feelings before eventually giving in to love. The only problem is that I've seen her in this role before. Other than that, the movie is 1950ies-type of inane. The Greeks are proud archetypes (but hey, daddy's still all for emancipation and that), the Italians are jolly opera boffins, and the Germans uptight, evil maniacs. Beautiful, proud Pelagia is betrothed to a resistance fighter but has the hots for a jaunty Italian soldier. You connect the dots. That's really all there is to it.The sad thing is that the entire plot's long been done before, a million times better, and with infinitely more charme, in the 1991 Italian movie Mediterraneo. If you like the general idea of a romantic comedy about Italians occupying a Greek island, and going native in the process, you've struck gold. Captain Corelli's Mondolin, on the other hand, is trite sh*te.","(Spoilers throughout) Am I alone in thinking this film in many ways improves upon an excellent, if flawed, novel? Make no mistake: DeBernieres' book is a modern classic, but it has two major weaknesses  one aesthetic, another of historical accuracy. This film nobly addresses both of these.1) Captain Corelli's Mandolin is an excellent and moving novel. The idyllic pre-war life of the natives is vividly and touchingly depicted. The subsequent horrors of war are thus all the more harrowing when they finally arrive.For all that, DeBernieres singularly fails to create a satisfactory conclusion. The last hundred pages or so detailing the intricacies of Pelagia's post-war existence are not uninteresting in themselves but seem banal indeed compared to the stirring drama that has come before. It is essentially a Second World War novel and should have ended with Corelli's departure from the island, or at least, soon after. The concluding chapters add nothing to the novel  DeBernieres should have been more ruthless and ended the story as soon as the main action stopped. The Great Escape would not have been improved by a concluding section about the surviving character's lives in the post-war decades and nor is this.Commendably, the film improves upon this weakness. Now Corelli returns, soon after the war's end. This is a decided improvement on the novel where an ageing Corelli does not return  inexplicably  until fifty years later! It is thus far too late for him and Pelagia to get together and provides a wholly unsatisfactory outcome to the novel.2) The novel is also undermined by a serious historical misrepresentation of the Greek anti-Nazi resistance movement, notably the organisation ELAS who Mandras falls in with. In the book, these are portrayed as Stalinist demagogues, more interested in the propagation of a narrow interpretation of Marxist dogma and political infighting with the British Allies, than genuinely resisting the Nazis. After the war, they are portrayed as practically being akin to the Nazi terror they supplant:in Cephallonia the Communists began to deport awkward characters to concentration campsHitler would have been proud of such assiduous pupils.' (p442).As DeBernieres now grudgingly admits, in this respect, he got his research badly wrong. Although I am no expert on wartime Greece, by all accounts, ELAS played an active and constructive role in combating the Nazis. The film rectifies DeBernieres' error, showing Mandras and the other guerrillas fighting the Nazis side by side with the Italians. This does involve a fairly major alteration in the novel's story line, however  Mandras's attempt at rape and subsequent death thus do not occur here, nor do any of his guerrilla experiences which are detailed throughout the middle stages of the book.There were other changes in the film that I was less keen on, however. The role of the Italian soldier Carlo, who plays a fairly major part in the novel, is here almost wholly omitted, presumably because of fears that his homosexuality would offend the crucial American market. His gesture in saving Corelli from the firing squad is thus largely inexplicable, except as  rather lamely  a benevolent sacrifice towards Pelagia.On the other hand, CCM is such a long and complex novel that one can forgive the film makers for not transcribing every aspect of the book to the screen. Film is a different medium to literature. The unfairly hostile critical reception this film has received suggests far too many expected a carbon copy of the novel to be revealed on film. (And as Madden also directed the generally awful but highly overrated Shakespeare in Love perhaps this evens the score somewhat).That said, the film is not perfect. I am not convinced Cage was the ideal Captain Corelli. The depiction of village life does come across fairly whimsically and compares poorly to the portrayal of European rural life in the 1940s in Jean De Florette. Although I've said changes from the book are not bad per se, some of the changes  the date of the earthquake from 1953 to 1947 seemed rather pointless. But generally ignore the pedants. The film would not be improved either by a) forcing the cast to learn and speak their character's native languages and subtitling throughout or b) correcting such 'inaccuracies' as the Italians occupying the island for two years (er - they did) or b) depicting Abyssinian style atrocities committed by the Italian forces on the island (none recorded). While not quite in the class of other Second World War classics like Empire of the Sun, Schindler's List or The Bridge on the River Kwai, this is generally a good film.","I actually was looking forward to this movie. After reading a number of reviews before the release, it sounded like a genuinely nice film, one that was beautifully filmed and one with an interesting cast (Nicholas Cage, Penelope Cruz and John Hurt.)Well, it might have been all of those things BUT it is so boring that I defy almost anyone to sit through this in its entirety and keep attention. Also, Cage's attempt at speaking with an Italian accent is embarrassingly bad. He's such a good actor that I cringed every time he spoke in this film. 'Disappointing\" seems to be the most-often word used by reviewers here to describe this film, and I totally agree.I guess it didn't take long for word to get out about how bad this movie was because, like Cage's accent, it did not do well.","Against her father's wishes Pelagia marries her fisherman fiancé just before he goes off to war. When she stops getting replies to her letters everyone fears the worst but she holds out hope that he is still alive. Meanwhile the Greek's initial defeat of the Italian army causes Hitler to support a full attack that leaves Greece and it's island inhabited by Italian soldiers. Pelagia and her father find themselves housing Italian Captain Corelli, who loves music and is charming. While Pelagia hates Italians and loves her husband she finds herself falling for the Captain over time.At the time of release there was plenty of dating couple who went to see this film and there was also a boost in the tourist trade in Greece, accompanied by lots of television travel programmes talking about the islands and the film. These two things were in my mind when I sat to watch the film tonight and I quickly understood why they were the case. Firstly the reason so many travel shows picked it up is because the film makes the place look great! Each shot is full of warm colour and the locations are picture-book all the way through. The idyllic feel that the location brings is also part of the wider film with a story that is sweet but high on Hollywood gloss. I have not read the book and have no intention of reading the book but I understand from other's comments that the screenplay has lost some 'difficult' elements and focused on the romance in the story. Ignoring this (as many who have not read the book will be able to) the film is just like the landscape  sweeping, easy on the eye, nice and ultimately quite unmemorable.This explains why it was a popular date movie or, to use that expression I generally dislike, chick-flick. The romance is simple and sweet and it is enjoyable on that level; I can't say it touched me on a deep level (or any level) but it was sweet and I quite liked it. Towards the end it gets harder and more about the war than the romance but I felt this was too sudden a change that had been left too late in the game to fully work  it was too much of a sea change for me to fully go with it.The cast are mostly pretty and OK just like the landscape. Cage is too nice to be true but still tries hard; his Italian accent has corny 'mama-mia' moments but is generally OK. Cruz is fairly bland and doesn't bring a great deal to the film other that her looks (which personally don't appeal to me that much) and Christian Bale is given little to do considering how good an actor he is generally. Hurt is good value as always and the support cast fill in the gaps well even if few of them have anything approaching what could be called a character.Overall this is a sweet film that turns bitter for the final quarter of it's running time  a change in mood that is quite difficult when it occurs due to it's suddenness. However it manages to stay quite sweet and romantic despite running with a simplified script and a glossy approach to everything. It is quite unmemorable and I doubt I shall ever watch it again but I found it to be like the landscape  easy on the eye and rather pleasing to watch without touching me on more than a superficial level.","Not having read past the first chapter of the book I was happy to judge this film entirely on its own merits rather than comparing it with the well-known novel. Almost, anyway - the first chapter I remember was hilarious - yet the momentum is sadly lacking in the opening scene which dismisses the humour within seconds. World War II approaches and Germany and Mussolini invade Greece. Nicolas Cage, as the unconvincing Italian captain who is more attuned to singing than warfare, demonstrates quite admirably that this is the sort of film he should leave well alone. Penelope Cruz, as the Greek girl betrothed to another but who falls in love with Cage is slightly better, but not enough to lift this bland and syrupy film above mediocrity. The rest of acting is fairly wooden, most of the script quite predictable, and the moral ambiguities of fighting for the 'right' side barely touched. The ending is unsatisfactory,as if we are expected to wait a couple of years and part with more money for part two. Part one didn't hold enough promise - the tedium and self-adoration in the photography and music failed to justify a film of over two hours that could have risen (but fell) on its own merits and lack of them, but it will most surely disappoint the many fans of what is reputedly an excellent novel.","Few days ago I finished reading of Louis de Berniéres novel Captain Corelli's Mandolin. The book was really breathtaking. I was looking forward to see the movie right after reading the book. This succeeded really quickly. I was home alone and I started to watch maybe a half an hour after I have read the last page of this amazing book. It was after midnight already, but I could not wait to see how the film-makers captured the huge power of this masterpiece in the movie. But as I felt happy when I first saw images from book (Cephallonia weather and the whole atmosphere) - such I was disappointed when Berniéres' novel full of reality of life, war and everything slowly changed into silly romantic flick. Everything is too much simplified so the story goes too fast.I am sure, that if Louis de Berniéres himself should make film (screenplay) from any of his novels, it would cost a lot of money and 150 minutes of time at least. But it won't be sweet happy-end story about cute girls, charming italian captains and brave partisans. It would be much more. Life and Berniéres' characters aren't so simple. Somebody really thought that if he will fill the movie with quotes from the book, people will think that it actually is book. This isn't bad film...I still give 7 points from 10. It's just deeply disappointing for those who read the novel. Maybe there are many perfect novels in the background of many average hollywood flicks. But sometimes there will be much better not to shoot some fine books... For those, who have read this commentary till now I have one advice - if you like superior reading and not just movie love stories - try some Berniéres!","An awful travesty of the Greek resistance. Senorita Cruz badly miscast as a Cephalonian Greek girl (there are plenty of attractive good English speaking Greek actresses so why pick a Spanish lady for one of the leading roles and with an English actor as her father, supposedly a Greek doctor!? Many of the supporting cast are well known actors and actresses from Greek theatre and TV series. The only foreign actor, to my knowledge, who has successfully portrayed a Greek was Anthony Quinn (as the Macedonian lignite miner Zorba in Zorba the Greek, as the plutocratic shipowner in the Greek Tycoon,and as a Greek colonel in the Guns of Navarone.There is some historical truth reflected in the film. People who remember the Italian occupation of the Ionian Islands agree that the Italians were not harsh, unlike the Germans who succeeded them. Also Mussolini's forces, as hinted in the movie, had been defeated by the Greek army in the Albanian campaign. After the Germans intervened in the Balkans they allowed the Italian military to occupy certain parts of Greece, so the refusal of the local government to surrender to Italian forces, rather than to the Germans. as portrayed in the film is quite plausible, although I am not certain this actually happened.","Wow.  What can I say.  I went to see this last night with the attitude that it would be a girly love story weepie film.  I was wrong.  Yes there was that love story, but it was the shocking elements of the war that really hit me.This film will leave you breathless. Not just because of Nick Cage but the horrible reality that this type of thing did happen.  Amazing film.","it is a lesson in butchering a book !in turning a rich book into a soap opera film by removing all the substance of the story ! important characters have been cut , even the marten is not here !worse : the very personality of the main characters has been changed !the casting is ridiculous ! with maybe the exception of john hurt and morrissey ( although his role is badly written) Nicholas Cage is totally ridiculous , too old for the part , too \" American\" and penelope cruz just cant act ! the directing is poor , even the costumes are wrong !all the people who participated in this \" thing\" should be ashamed of themselves ! I have never been so furious in my life ! no need to say how much I have loved the book which i discovered last year only - it was not a big hit in France . So as a previous message puts it : read the book !!!"],"review-user":["victor-65","dmnkeen","FlickJunkie-2","sddavis63","Helen14","officersmess","Chrysanthepop","lib-4","foxnetwork","mario_c","gnamel","truth382","Critical Eye UK","kate-812-940559","zardoz-13","andrejazecevic","Karl Self","Mercader79","ccthemovieman-1","bob the moo","Chris_Docker","Anetka","politicon2003","tankgirl_ni","charlierabbit-13008"],"review-date":["1 February 2003","8 May 2001","10 March 2002","11 August 2002","7 May 2002","27 May 2001","29 January 2009","14 September 2001","16 September 2002","11 March 2007","17 August 2001","2 June 2003","19 July 2003","9 October 2013","8 February 2008","13 August 2012","19 August 2009","22 May 2001","2 March 2007","31 May 2004","6 May 2001","11 November 2003","5 February 2007","26 May 2001","29 June 2006"],"review-rating":["8","8","7","10","6","8","6","10","1","1","2","1","3","3","6","2","4","7","1","10","2"],"review-title":[" Please read the book instead.\n"," Expecting the worst...\n"," Ambitious project falls slightly short\n"," Love And War And Occupation\n"," The film is a true depiction of went on in Cephallonia during the war and after.\n"," Very Watchable\n"," Sketchy, Melodramatic and Clichéd\n"," Music can bring love\n"," Disappointment, some spoilers.\n"," Could have been better\n"," Sensitive portraits, historically faithful\n"," This was horrendous spoilers\n"," Busted strings\n"," Lame. Lame. Lame.\n"," The lack of romantic chemistry, a hopelessly muddled plot, and leaden direction sabotages \"Captain Corelli's Mandolin.\"\n"," Great Island - Terrible Movie\n"," Painful\n"," Homage to Cephallonia.\n"," Both The Accent & The Movie Stink\n"," Sweet like candy but no more than that  unmemorable\n"," Bland and syrupy\n"," Try some Berniéres!\n"," A Travesty with a Miscast Leading Lady.\n"," Chick flick? Definately not!\n"," a shame !\n"]}