{"review-url":["http://www.imdb.com/title/tt0284135/reviews"],"review-text":["A talented high school graduating senior with a bad attitude is forced to play in the state all-star high school football game. When he meets and falls for an attractive local girl she helps him realize he has a shot at a 'full ride' scholarship if he plays well.All too often, these dramas fall into formulaic traps and tell the same old story of a troubled and confused teen. FULL RIDE's Matt Sabo certainly fits this profile, but below the surface is a much more unique individual than we usually see in this genre. Matt is the center of the action and he is a realistic teenager, both over-confident and vulnerable, optimistic and cynical by turns. Influenced by Amy, Matt grows into a man of character and heart. He, in turn, forms friendships with his teammates, which influences his growth as an athlete and as a team player.FULL RIDE has all the elements we love to see in a movie--great acting, admirable characters, exciting sports scenes, poignant drama, and a love story.  Still, while one may have seen these elements in other films, FULL RIDE is assisted by performances that are sincere and occasionally, even moving. Perhaps what's most impressive about FULL RIDE is its sense of reality. Although the author of the previous comment would seem to disagree, (clearly a disgruntled student who, for quite obvious reasons, received a poor grade in his film class) director Mark Hoeger grounds the film in a believable situation and location and does a great job of getting down to the grit of what life is like in a small town. These characters are real people rooted in realistic situations, which often create the most compelling entertainment. On one level it is a love story, on another it is a character study, and yet another it is a simple football film. All of these ideas come together to form a cohesive vehicle.","Last fall (of 2001), I took a film class that was taught by the director of this movie (Mark Hoeger).  His vast knowledge of filmmaking, his ability to dissect any scene of a film, and his winning of an Academy Award in some obscure category seemed to give him more credibility than your average independent film director.  When he mentioned during one of his classes that he had just finished directing a film called \"Full Ride\" and was in the post-production stages, my interest was piqued.  However, that would be the last I would ever hear of that film project.  Until last week...Last week, I saw in a TV listing that \"Full Ride\" was going to be showing on the WB network.  This immediately raised a red flag, as I can't help but associate WB with teensploitation shows such as Dawson's Creek, Charmed, etc.  PLUS, the fact that Full Ride was going to be released straight to TV wasn't too flattering in itself.  But, nevertheless, I set aside that time and sat down to watch my former film teacher's creation.After two hours passed and the end credits began to roll, I thought long and hard about what I had just seen.  What I had just seen was a typical WB-quality show stretched out to the length of two hours.  In fact, it almost seemed as if this movie was made with the sole intent of only showing on the WB network.  Critiquing this movie will basically be like critiquing a typical WB show.Where to begin?  The characters are shallow, the story is cliche in every sense of the word, the scenes are completely contrived, and the character development is forced and unbelievable.  This movie just screams `unoriginal.'The main character, Matt Sabo, is some hot shot from the wrong side of the tracks (literally) who plays solid high school football as a fullback, but then fizzles off into a life of crime.  He is then offered a chance at a full ride scholarship instead of going to jail.  Obviously, without much of a choice, he agrees to play football with an all-star football team, but is not excepted among his peers because of his poor team spirit and bad attitude.Then comes the love interest.  Of course!  Where would this predictable fanfare be without a love interest?  She comes in the form of Amy Lear (played by the beautiful Meredith Monroe).  She is actually a likable character, as opposed to the ever-so-abrasive Matt Sabo, so we almost applaud her when she rejects him at first.  But, of course, the inevitable comes to pass.  She falls for him, changes his attitude towards everything, and all seems good and happy.  But now it's time for conflict!Earlier in the movie, Amy makes it clear to Matt that she doesn't want to score with him, because it would be `shameful' to her and her mother.  This is much to Matt's dismay, and his football buddies (yes, they eventually warm up to him) who bet him he wouldn't get any.  But, of course, Matt eventually comes to accept these terms and decides he's not all about the nookie.  Here's where the exciting plot thickens.  If you don't want me to ruin this surprise, then skip ahead.[BEGIN SPOILER]Matt finds out from some local guys that apparently Amy Lear always tries to score with a guy each year from the All-Star team so that she can try to use him to escape her small town life of working in a cafeteria (which is baffling in the first place) and make it to the big city.  Suddenly realizing he's been used and that his love was a sham, Matt it tempted to turn back to a life of crime and leave the football camp before `the big game.'  Amy tries to reassure him that she was really in love this time, but he's too hot-headed to buy it.  So what will Matt do?   Will he take her back?  Or will he go back to robbing gas stations and being an all-round jerk?  I won't ruin the super-ultra-surprising ending for you.[END SPOILER]So, if I somehow got you pumped up for this movie, please realize that that was my sarcasm and not genuine enthusiasm.  This movie is an uninspired version of `Varsity Blues' or `Summer Catch.'  And that's not saying much. There's hardly any comedy to save it and the characters are too shallow to care about.  So what do you have left?  Not a whole lot.\nWhat I most disliked about the movie was how much of an unflattering picture Hoeger painted of Nebraska through this film.  It seems like he was trying to capture the essence of rural Nebraska and teenage life in the small towns, but his approach is all too stereotypical and shallow.  The characters' high hopes for making in `the big city' and the actions they take to do so are greatly exaggerated, and it only further cements the stereotype of Nebraskans being a bunch of hicks living in farm communities. I am unsure of whether or not Hoeger's intentions were good in trying to put his home state in the spotlight, but I think he ended up with a very shameful product.  If Hoeger wanted to portray Nebraska in a favorable light, he should have taken a note or two from Alexander Payne.  While Payne simply chooses to use Nebraska as a backdrop for his films, Hoeger integrates it into the plot of Full Ride and becomes so entangled in his awareness of where he's shooting, that he ends up churning out superficial garbage that would seem to come from an outsider.  If Hoeger actually lived here, you'd think he'd know better than that.All in all, I am completely disappointed in Hoeger's first big film, and I hope that next time he can combine his knowledge with a little bit of originality to create something different and thought-provoking.","Don't waste time watching this girl-meets-boy-from-wrong-side-of-tracks TV trash.  It seemed quite promising, for about two minutes. The girl who played Amy was sexy and quite a decent actress, but even she couldn't save this dirge.AVOID!!","I saw this movie when it aired on the WB and fell in love with Riley Smith immediately. I would recommend the movie to people of all ages who just feel like being entertained and not much more. I wish they'd air it again or cast Riley Smith in another movie!","To sum this story up in a few sentences: A teenage girl (Amy) uses her hot body and \"supposed\" virginity to entice a young troubled guy (Matt) with a potential football scholarship to provide her a \"Full Ride\" out of town. Come to find out she has quite the reputation & has slept with many football players in the past hoping they would offer her the same deal. Both of these kids have come from troubled & dysfunctional homes. Matt's mothers a alcoholic who repeatedly embarrasses him in front of his friends & Amy's mother had a bad reputation herself & got pregnant with Amy at a a young age. Matt falls in love with Amy & tries to straighten out his life for her. Very predictable ending. The actress that plays \"Amy\" is actually 33 years old trying to play a teenager!","I first saw this film as a world premiere on the WB network. At first it looks like this film is just going to be another mindless romp into the world of teenage soaps. And if that is what you are after this film will not fail to satisfy.It has a pretty Meredith Monroe, a Dawson's Creek veteran and a gorgeous Riley Smith, who first caught many a young girl's eye in the Disney Channel Classic, MOTOCROSSED but has lately been getting meatier roles like his recently recurring role on the Fox series \"24\" and a nice role opposite Ed Harris and Cuba Gooding, Jr. in RADIO.Just when you think you have this film figured out, it takes some very interesting twists. I don't want to give away secrets if you have not seen it but nobody turns out to be whom you thought they were. Like the SIXTH SENSE this is not a cheap shot. Once you learn what is really going on you think back and realize the first parts make even more sense.\nA friend of mine in the UK has seen it several times on satellite. She says the more you watch it the better it gets. Having seen it just once, I can't wait to watch again knowing what I know now. I will probably watch it more than once just to see Riley.","I registered on IMDb for the sole purpose of telling people not to watch this movie. You know those sick days where all you want is a bad movie that will entertain you as you lie awake wishing you had not had so much to drink the night before? These are the kinds of days which have resulted in me in watching many an awful movie taking great pleasure in it. Well, this movie was watched on one of these days and I hated every second of it. The acting was tolerable, the story predictable and done before but that is not why it sucked. it was how they went about producing it. Just awful. Please, I implore of you one thing, do not watch this movie. you will regret it.","The make -or-break of a love story for me is whether or not I like the characters and also if they click with each other. Matt is pretty unlikeable: aloof, braggart, seemingly lazy, and a misogynist. He's been hurt badly by his dysfunctional mom and this makes him a little easier to take. I guess I liked the details of his dysfunction--he was believable. He overcompensates by bragging that he'l nail Amy. He acts so cool around Amy that he strikes out twice. When they do talk he can't show her who he really is. She empathizes and then stonewalls him at just the right moments. She seems so mature and strong that the traits of hers that come out later didn't seem to fit. (For me.) I found her to be incredibly sexy and pretty, . . . girl next door pretty, I call it. So I was going to like this movie unless it really screwed up.Funny things happen with the coach, but Matt's relationship with the other coach was inspiring. The football scenes at the end were perplexing. Matt doesn't carry the ball but seems to be a blocking back. Folks, he isn't the right size! He's fifty pounds too light for that position. But I thought his acting was skilled. I measure that by the way I wanted to wring his neck a couple of times during his scenes with Meredith Monroe. The film was all right. Meredith M was better than all right.","This is movie is really bad. I like to flip on the TV while napping and this movie looked like it would be something good to sleep through, and boy was I wrong. My body literally woke me up from sleeping and said \"Hey... this movie is awful... you gotta watch it\". I love bad movies with bad actors and stupid plots. Something about unintentional comedy gets me going. This movie is impressively crappy. I really don't know how to properly express it aside from recommending you watch it just to see how bad it is. I mean, seriously, you should watch it with people. I was making the best jokes outloud during this movie and no one was there to hear them.Worse than Swimfan. It's that bad.","I took Film History and Appreciation class with Mark Hoeger, the director of this movie, last semester, and I have to say I expected much more out of one of his movies.  The movie had potential but really was ruined because of a few things.First of all, the screenplay was simply not well-written.  Besides the storyline being a long series of cliches and predictable attempts at \"plot twists\" the dialogue was totally unconvincing. Some of the lines were great (the one about giving a girl \"both inches\" made me laugh), but too often there were lines written in that just didn't seem to fit.  Some of the lines just didn't make sense at all.Also, the acting was bad even by WB standards, with a few exceptions.  I liked Meredith Monroe as the love interest, but basically the rest of the cast was typical WB crap.  The actors delivered their lines totally unconvincingly at every chance they got, and at no point did I ever believe that a guy with pubes on his chin could get a girl that hot to even talk to him.  Only a few of the football players were big, strong, quick, good, or mean enough to play football on a halfway decent high school team in Nebraska, let alone to play in an all-star type game.Finally, most football movies have lots of great action shots during the games, but the game footage was slow and boring.  Off the field there were way too many shots of the scenery.  If they put those shots in to bore the viewers, they succeeded. For most of the movie I was bored out of my skull, and the only interesting part of watching the movie was trying to pick out places I had seen before and people I knew.I really wish I had something really good to say about this movie.  It lacked any imagination or talent, and was flawed in many many ways.  In other words, it's a great WB movie.","I liked this movie.  I wasn't really sure what it was about before I started watching it, but enjoyed it nonetheless.  It was about a girl (Meredith Monroe) whose mom didn't want her to turn out like she did.  She meets and falls in love with a boy (Riley Smith) who is town for a charity football game.  It's a good movie.  I just hope it will be on again or comes out on video.","Excellent example of the disaster that happens when you combine a challenging script with two actors chosen for physical appeal. It is rare for me to be consciously aware of the acting during the first viewing of a movie because I try to just go with the story and save the analysis for the second viewing. In the case of \"Full Ride\", the acting was so weak that the movie was impossible to appreciate as a story; I was too busy (during first and only viewing) alternating between laughter and nausea.Fortunately for most individual members of the cast, pretty much everyone in the ensemble is weak, the individual talent limitations do not contrast with any actual competent acting. Riley Smith and Meredith Monroe are at least well matched physically, finding common ground in looking far too old for the credible age of their characters.Unfortunately the script requires especially intense and convincing performances to portray their characters which just exposes Smith and Monroe's staggering lack of talent. On the positive side, they know enough to not look directly into the camera and they do not stutter.Better to have used a less attractive pair who could physically pass for the proper age. The basic story is not particularly original, just another variation on \"An Officer and a Gentleman\", but it would have provided a nice showcase for a talented pair of \"teenage\" actors.Then again, what do I know? I'm just a child.","After seeing Meredith in \"Beyond the Prairie\" I had to buy another film with her staring.  I cannot believe how she let herself into this teenage flick. It's best to watch this one with the sound off but just concentrate on Meredith as she moves across the screen.  Save your money until the TV network comes out with a DVD on \"Beyond the Prairie\".  It's worth it at any price,  this one needs to pay you to see. This pretty lady needs someone to put her into a script that can use both her talent as an actress and her beauty as a woman. Perhaps some of her latest might fit but I haven't seen them. She has the smile of a Cathrine Bell and eyes of Dana Delany with a much younger body."],"review-user":["tridelt","llamaherd","buckaroobanzai50","MoviebufferLA","roses888","jaediem","yee_haw0","archiecm","mattb40000","Speedo_mask","tji80","aimless-46","bayoudan"],"review-date":["30 December 2002","29 August 2002","18 March 2003","16 January 2004","22 December 2006","22 January 2004","24 March 2011","26 April 2006","19 December 2005","7 February 2004","29 August 2002","22 November 2005","9 June 2004"],"review-rating":["9","1","9","7","1","7","1","10","2","7"],"review-title":[" Excellent Effort!\n"," A Total Waste of Time\n"," Truly Terrible!!\n"," Heartwarming teen flic\n"," Very predictable story.\n"," Satisfying yet Full Ride full of surprises\n"," Just don't do it to yourself, watch spice girls instead, really...its better\n"," This film had its moments\n"," It was so bad, it woke me up from napping\n"," All of the same old WB stuff\n"," Pretty good\n"," Desperately Seeking Even Marginally Talented Actors\n"," Meredith Monroe is worth watching, the story is not\n"]}