{"review-url":["http://www.imdb.com/title/tt0268401/reviews"],"review-text":["Having seen other Bollywood flicks with Salman Khan in them, I can say this is my favorite of the more recent ones.  The songs are all quite fun, especially 'O Priya O Priya' which seems to have a nice mix of Beatles, Indian music and (dare I say this) a bit of Prince.  The love stories are a bit more believable than, say, Chal Mere Bhai.  The occasional focus on Prem's use of alcohol is at times troubling as it doesn't really seem to make sense to me, but it's played well by Khan--although his voice does become squeaky when he's portraying drunkenness.","I bought this movie on DVD because I had seen several of the songs on another compilation DVD. As you may have guessed I loved the musical numbers.Why have so many people dissed this movie? I understand that this is a remake of the Wedding Singer. Although I have not seen the Wedding Singer I cannot imagine Adam Sandler playing anything other than a jack ass and any movie he is in as anything but a piece of ignorant garbage. Our Man Salman took his role and made it into a reasonably intelligent and emotional character. I was especially impressed with his emotional portrayal as Prem when he lost the girls, I almost cried with him! Our Man in particular and Bollywood in general have a knack for turning Hollywood ridiculousness into something dignified. He did overdo it playing the drunk though.Rani Mukerji was fantastic. She has the right combination of beauty, sexiness, earthiness and heart to make a great romantic love interest.The portrayal of the close knit and loving family and neighborhood added a lot to the emotional appeal of the movie. All of the characters were people that I liked and cared about.I did not find the movie that funny, but found it to be a good love story.","I walked into this one with high hopes Salman Khan Rani Mukherji Raveena Tandon (my favourite actress), Jackie Shroff the movie couldn't fail but it did big time in every category and in the box office as well. The real person to blame is the director who took the Wedding Singer starring Adam Sandler and Drew barrymore and turned it into a bollywood flick. Only one good song in this mess and that was picturised on Raveena and Salman. Rani was totally wasted what was she doing in this movie. Raveena also looks out of place in a small second heroine role. Salman does what hew does in every movie but this time looks bored doing it. I sat through the first half hoping this would end up being Hum Aapke Hain Koun instead is should been called Kahin Boredom Na Ho Jaaye. 2 out of 10 the 2 for Raveena Tandon.","Prem (Salman Khan) is heartbroken when his fiancée (Nisha, played by Raveena Tandon) cancels their marriage. After some time, Prem pulls himself together with the help of his loving family. He falls in love again, this time with neighbor Priya (Rani Mukerji), only it seems he'll have his heart broken again.This is a sweet romantic comedy showcasing Khan's charm and talent. The musical numbers are average, but the plot is strong and the acting good. It ties up a bit too nicely at the end, but other than that it is fine and entertaining film.","This movie is apparantly a remake of The Wedding Singer. I say apparantly, because I couldn't swear to it myself. I did see The Wedding Singer, but all I can remember is Adam Sandler's goofy hair. So, it's safe to say I watched this movie as an 'original'. Just as Adam Sandler Salman Khan plays a wedding singer. He falls in love. Gets stood up at the altar. Falls in love again. Gets 'stood up' before he can tell her he loves her. And then has to find the courage within to tell her and win her back (may the force be with you, Salman!).The story is like any other romance. Full of misunderstandings and people who won't tell the other how they feel, but just jump to conclusions. Which just begs the question, are all men in Bollywood movies stupid? Women CANNOT read minds!!! The same question could be asked about women. Men CANNOT read minds, not even their own!!! But then if it wasn't for these horrible depictions of the human nature, the Bollywood industry would probably be reduced to a quarter of its current movie output.Like any movie, this one also had serious flaws. My first question would be, how can a wedding singer who rehearses in his bedroom, afford to pay an entire team of approximately twelve dancers and six back up singers to sing at weddings for him? He must charge his clients a fortune. Then there is his nasty drinking habit. Let me say that Salman makes a really horrific stupid drunk. He is totally not believable as a drunk and should try to take a page out of SRK's Devdas. Speaking of alcohol, there is a scene *SPOILER* in which Rani downs three glasses of Scotch (I believe), instantly starts hiccuping and is drunk. Give me a break!!! Naturally there is also a scene involving an electrical guitar that doesn't seem to be plugged in, but that doesn't even bug me anymore, cause it seems that in India or any other country Indians can play electrical guitars without plugging it in, take for instance Kuch Kuch Hota Hai. And how about a girl *SPOILER* who has spent her entire life dreaming of an acting career, giving up the opportunity to star in a hot directors movie to be with a womanizing alcoholic. I mean, please, would you say no if Quentin Tarantino asked you to be in his movie, because of your sexist chauvinist boyfriend who has spent most of his life with his lips pressed to a glass of Scotch and his hands on some girl's ass?But leaving all the inconsistencies aside, it's a nice movie. Salman is just bearable. It's hard to spend three hours watching a man who spends half the movie drunk, a quarter of it crying and the rest talking about love. Salman, grow a spine. Rani was quite adorable. Spunky and sweet. And she shows us that bhajjia can stop us from sneezing. The setting of the movie is also refreshing and quite picturesque. Some of the characters are unnecessary. Obviously added to offer a little comic relief, but in the end just plain annoying. The same goes for the songs. They just seem so fake. And... they don't stick. In one ear, out the other.All in all, this is a nice movie. With a little work it could have been a great movie. But no work, so no great movie. Watch it if you like Rani, because otherwise watching Salman is a punishment with no rewards to make the pain go away.**/5 stars","This is so embarrassing.  It's a REMAKE of The Wedding Singer, which happens to be my favorite movie which gives me another reason to disapprove of this film.  It has the same plot, same jokes, same characters.  Jeez, people need to be more original.","When I read the reviews of Kahin Pyaar Na Ho Jaaye, I thought, \"Huh?\". It was THAT confusing. To be sure, I went to watch the film and what do you know? It's a remake of \"The Wedding Singer\". Several scenes have been changed to suit the whole essence of Indianness, but the rest of it is a direct lift from the 1998 Hollywood hit. Bollywood is no stranger to remakes, but this is one so poor that it pains me just to watch it. I groaned so much watching this and I realized I wasn't the only one doing so! One guy actually walked out of the theater and never came back! Salman Khan should seriously stop doing comedy roles. He shrieks and whines too much. Why can't he just take it easy? He doesn't do justice to the role originally acted out by Adam Sandler. He doesn't have Sandler's sense of comic timing. Rani is a wonderful actress and one of my favorites, but she's no Drew Barrymore either. The scene where she stands in front of a mirror practicing to say her new surname (\"Hi, I'm Mrs Pugalia\") doesn't match up to Barrymore's version (\"Hi, I'm Mrs Julia Gulia\"). I felt embarrassed watching that scene, even though I had loved the original. The music is not too bad. It's probably the only saving grace of this otherwise horrible film! Avoid this at all cost!","I saw this movie about 12 year ago on v c d but I was to depressed till three days why did I saw this movie very long & looks that one minute of passing movie like 10 hours long . I am the fan of leading actor of the movie but his acting like his previous movie in 2000s which he acts childish overreacted & boring also the leading lady also very big bore no one in this movie was saving grace & that's why movie was a great disaster at the box office. & I have to say that the movie name will be Kain public bore Na ho Jaye . the acting of leading actor is lick c##p & he does not deserve any sympathy all the movie. now I am so fearful because if I will write any thing wrong the leading actor will beat me."],"review-user":["OsGlink","T-27","sexysukh52","GypsiB","Ace_of_Hearts","GollumRox","rajivgill","himanshu-tushar6"],"review-date":["20 December 2001","21 December 2009","7 June 2004","21 April 2017","17 November 2003","19 July 2003","17 August 2001","4 April 2013"],"review-rating":["8","8","1","3","1"],"review-title":[" Thoroughly enjoyable\n"," intelligent love story\n"," boring and rubbish don't waste your time\n"," Sweet Romantic Comedy\n"," What do you get when you put four fingers of Scotch, a wedding singing lush and a no nonsense girl in a blender?\n"," OMG WTF\n"," It pains me to watch this *SPOILERS*\n"," what the bore movie\n"]}