{"review-url":["http://www.imdb.com/title/tt0209958/reviews"],"review-text":["The last time I reviewed a film helmed by a music video director, I was very angry at what I'd seen (`Mystery Men'), but Tarsem Singh spares us the fish-eye lenses and commercial overindulgences and decides to concentrate on presenting an astonishing visual and audible journey into the mind of a serial killer in `The Cell'.Carl Stargher (Vincent D'Onofrio) kills women by drowning them in glass cells, all the while videotaping the event.  Afterwards, he disfigures the bodies to resemble dolls and then tosses the finished `products' off highways into ditches and streams.  Nice guy.  He also likes to suspend himself on chains attached to hooks inserted directly into his back. Lovely.Meanwhile, FBI agent Peter Novak (Vince Vaughn) is hot on the killer's trail, and although Carl's started to get sloppy, he's just kidnapped another girl and she has 40 hours before her cell fills with water.  Carl is soon apprehended, but only because he enters into a schizophrenic seizure and falls into a coma on his kitchen floor.  A coma?  But how are they going to find out where the last victim is?  Oh, if only they could TRAVEL INSIDE HIS MIND.  Hey, what a coincidence!  Catherine Deane (Jennifer Lopez) is a child psychologist involved in an experimental project that allows her to TRAVEL INSIDE THE MIND of coma victims.And so begins a strange array of visuals and sounds, blended together so unusually that you honestly feel like you're experiencing a dream a not so pleasant dream.  Not only is Carl's mind slightly twisted, it's violent, disturbingly sexual, and very graphic.  But, it's also like a train wreck; you can't help but look.  Oddly enough, Mr. Singh clearly had the resources to make his special effects scream out at you with bright color and absurd lavishness, but he chose instead to simplify, placing the terror in the scale and content of the visuals.  I can't even use an example.  All I can say is think about a dream you've had that you couldn't describe to someone, and that's what watching this movie is like.  The photography is so stunning that it virtually eliminates the need for dialogue (only about half the film has discourse), and coupled with the horrifically spooky and scathing soundtrack, the film literally takes on a life of its own.My only objection is that when all is said and done, the only character we really understand is the serial killer.  Several clues about the other characters' pasts led me to believe that their lives would come into play and that their own memories would be tested and confronted.  To me, this would have taken this story to yet another psychological level, but perhaps it would have been too much for viewers.Despite this shortcoming, `The Cell' stills provides a myriad of images that will make you want to watch a lot of cute cartoons before turning in for the night.  Still, I don't know what was more disturbing: the movie, or the parents in the next row over who brought their two small kids to watch it.","Forget about the plot of this movie. Forget about the fact that it is wonderfully acted by Vince Vaughn and Vincend D'Onofrio. Forget about the fact that it is one of the few movies starring Jennifer Lopez that I can stomach. Although the story may be impossible to believe and much of the dialogue seems contrived, the one and only important thing to remember when contemplating watching this movie is that it contains some of the most amazing and disturbing imagery ever put on film. It is as if Salvador Dali decided to make a crime drama. A must see for anyone seriously interested in cinematography and the use of the film cell as a canvas on which to display true works of visual art. I would have to give this movie a 9/10 for it's amazing visual display.","I've said before that some films are like `nothing you have ever seen before'. Well, The Cell takes that saying and burns it down, blows it up and drowns it. This movie is something you could and can be only imagined. And if you then told someone about it they'd have you locked up for a very long time. It could be categorized as a Sci-fi thriller and then as a serial killer film. Like Seven and Silence of the Lambs this is not the ordinary serial killer film. It stands on it's own as a new kind of thriller.Jennifer Lopez stars as Catherine Deane, the best psychotherapist in the business. She works for a company who has developed the latest technology in therapy. She has the ability to go inside the mind of anyone and find out the reasoning to his or her distress. Enter Peter Novak (Vince Vaughn), a FBI agent tracking down a very sick serial killer Carl Stargher (Vincent D'Onofrio), who drowns his victims then dresses them up like dolls. On a FBI raid of his home Stargher goes into a coma and the whereabouts of his next victim are unknown. So Deane takes the job of going into his mind to find out where the victim is being held. And that's when this film gets intense, seriously intense.The director Tarsem Singh, known for the award winning R.E.M. video `Losing my Religion', blows away everything you could have imagined. The dream sequences are beautifully shot with many camera tricks, creepy color distribution, graphic images, and a tense score. They are extremely trippy and surreal. They actually have a dream feel because anything goes and there are no rules. Lopez performance is as good as she looks. She nails the psychotherapist dead on and does a great job in showing the different aspects of her character. Vince is Vince, very cool, very low key, and very real. D'Onofrio will scare you. His Carl Stargher would make even Hannibal Lecter scream for mommy. This guy is more disturbed than ever imagined. He has to be seen to believe it.Tarsem, with this film, has become one of my favorite directors and I will go see any film with his name on it. The Cell can only be described as a Sci-fi serial killer thriller that's visually disturbing, creepy, and one of the wildest films ever. It runs along the line with Seven for a good serial killer film and Event Horizon for a graphically sick and twisted film. This is best summer movie and the best film I've seen all year.","This is one of the most beautiful horror films ever made. It is a dream to watch and a nightmare to consider. Jennifer Lopez is stunning in her role and is never out of character. She manages to be both strong and vulnerable at the same time. I just bought it on DVD, and the deleted scenes and the director's commentary are included. This is an artistic masterpiece and terrifying thriller, too. Don't miss it.","'The Cell' is a journey into the mind of a serial killer and I mean this literally. The film is about the journey, about the world it shows during this journey, the destination does not really matter. In my opinion this journey through the mind gives such beautiful images other things do not really matter as long as they are not distracting. In fact, the story is pretty good.We start with Catherine Deane (Jennifer Lopez) in the mind of a catatonic boy. How this works exactly does not really matter, but it looks a lot like virtual reality. She and other scientist including Henry West (Dylan Baker) and Miriam Kent (Marianne Jean-Baptiste) believe that this method might work. Catherine enters the mind of the boy and speaks with him there, in a world that is completely created by the boy. She hopes she can let him do things that in the end will give results.The real story then. A serial killer named Carl (Vincent D'Onofrio) just dumped the body of one of his victims. FBI Agents Ramsey (Jake Weber) and Novak (Vince Vaughn) are on this case. Another girl (Tara Subkoff) disappears and at that time, after forensic research on the dumped body, Carl can be traced and captured. Two problems occur. 1. Carl just went into a coma; he has been sick for a long time. 2. His house and the house with his last kidnapped victim are not at the same place. In a way this part of the story is pretty standard.Things are about to get interesting again. To find out where the girl is, Catherine has to go into Carl's mind. This is dangerous for a lot of reasons. In short: Carl is unknown territory, schizophrenic and a serial killer. If Catherine starts believing Carl's mind is the real world then her mind can convince her body; she could die in the mind of Carl. A tape of how the last victim was killed, a fate this girl will have in about twenty hours, makes sure Catherine will try to get the location out of Carl's mind.It is the journey through this sick mind that makes this film more than worth watching. Director Tarsem Singh, who did music videos before this, in a way goes back to these music videos. Every room in the imaginative world is another short clip that exists out of beautiful and sometimes haunting images. For me the visual style felt completely new, the way 'Three Kings' had a new visual style one year earlier. If something like that can make you like a film, 'The Cell' will not disappoint. But fans of the thriller and horror genre can like this film anyway. The story itself, without the great fantasy world, is good enough for that. I think you have to be a little open minded, of course events are not (yet) possible in our real world. Still, a very entertaining film with nice ideas that looks terrific.","This movie is definitely a case of style over substance but the style is good and certainly more than unique on its own to make \"The Cell\" a memorable and above average movie.\"The Cell\" is beautifully looking with impressive sets, costumes and make-up. Yes, it's real eye candy to watch all. The movie has some perfectly 'dreamy' sequences that are certainly odd but also very beautiful and imaginative to look at. This movie is a perfect mix of an art-house type of movie and a typical Hollywood-thriller, that is accessible to both fans of the genre.The story itself is pretty far fetched and doesn't always make sense. Because of that the movie isn't always pleasant and likable to watch but like I mentioned before, the style compensates for this. The style makes you keep watching till the end and provides the best moments of the movie.Vincent D'Onofrio is unforgettable as the serial-killer with a twisted mind. Vincent D'Onofrio is really underused as an actor and this movie shows his talent once more. I'm not particularly happy about the casting of Jennifer Lopez. I know that she can act in some of her movies but she really wasn't suitable to play the main character in this movie. Her character wasn't strong enough and she was overshadowed by Vincent D'Onofrio and Vince Vaughn. Still I felt that Vince Vaughn was also miscast in this movie. He didn't fit the role well enough and no, I'm not saying that because I'm used of seeing him only in comedies now days. The rest of the supporting cast is good and still give the movie a certain degree of credibility.The musical score by Howard Shore was also surprising good and was sort of \"Se7en\" like at times. It suited the movie well and gave some of the scene's some extra mood and atmosphere.It's a far from perfect movie and the concept is far fetched and not always handled in the right way. Still \"The Cell\" is a perfectly watchable movie and perhaps even a bit of a must see, due to its style, originality and creativity.7/10http://bobafett1138.blogspot.com/","The last film that provided a vivid and disturbing look at what insanity is probably like was In Dreams. In that movie, you didn't see insanity, you were THERE. Now The Cell comes along with an updated and much more disturbing portrayal of the inside of the mind of a psychotic killer. The opening scene takes you into the seemingly innocent mind of a comatose little boy, and the things that Catherine Deane (Jennifer Lopez) sees are first fascinating and then terrifying. The things that she later sees in the mind of Vincent Stargher (Vincent D'Onofrio) are amazingly imaginative and fascinating, most of this stuff has never been seen in film before.The story of The Cell is not exactly something that is really groundbreaking. In fact, it is basically the same as the story in The Silence of the Lambs. You have a killer in custody and these people have to enter his mind to find a female victim who is currently in danger of losing her life. The only real difference between the foundation of the plots is that in The Silence of the Lambs, you have to enter the mind of a killer to find a different killer as well as his current victim, while in The Cell, you have to enter the mind of a killer to find his own victim. However, despite the unfortunately weak story, The Cell completely revolutionizes the genre of the psychological thriller. None that have ever been made even come close to it. Also, the film had good direction and was extremely well acted. Vince Vaughn delivers another of his characteristically excellent performances (he was even good as Norman Bates in the pathetic 1998 re-make of Psycho), and even Jennifer Lopez puts forth the second good effort of her career (the other being the great Out of Sight). Nothing can be said of the cinematography in The Cell to give it sufficient credit, it was imaginative and fascinatingly done and is unparalleled by anything ever seen in cinematic history. The Cell is an incredibly well-made film, and it deserves to be recognized.","Style over substance. But what a style it is. \"The Cell\" is the internal version of most serial killer movies. Unfortunately, the story hardly supports the visuals.Psychotherapist Catherine Deane (J-Lo) goes into her patients' dreams via artificial means to discover and help them over come their phobias and obsessions. A new patient whose fallen into a coma, is brought to her attention by the FBI. He's a serial killer who drowns his female victims then poses their bodies in grotesque scenarios like mannequins. Deane must enter the killer's mind and navigate through his sick fantasies in order to find and save his latest victim. Director Tarsem Singh has incredible visions and set pieces for this production. Each dream sequence is like a nightmare-ish painting in motion, from the landscapes to the costumes. But the plot suffers from lack of history of its characters. Stargher is the only person with a thorough background and he's the last person you want to care about. Without him, you basically have a movie that moves in the present tense only, which is a shame since the movie is so visually stunning and genuinely scary. Lopez is wasted but she's not that amazing an actress anyway, though she's as gorgeous as ever. And Vince Vaughn? I don't even know why he was chosen. This is not his forte and he overacts to boot. He tried too hard to become his character and it showed. Stick to comedy, Vince! Even so, this movie is so visually frightening, I still watch this movie with the lights on and can never fall asleep right away afterward.","\"The Cell\" is an exotic masterpiece, a dizzying trip into not only the vast mind of a serial killer, but also into one of a very talented director. This is conclusive evidence of what can be achieved if human beings unleash their uninhibited imaginations.  This is boldness at work, pushing aside thoughts to fall into formulas and cliches and creating something truly magnificent.  This is the best movie of the year to date.I've read numerous complaints about this film, anywhere from all style and no substance to poorly cast characters and bad acting.  To negatively criticize this film is to miss the point.  This movie may be a landmark, a tradition where future movies will hopefully follow.  \"The Cell\" has just opened the door to another world of imagination.  So can we slam the door in its face and tell it and its director Tarsem Singh that we don't want any more?  Personally, I would more than welcome another movie by Tarsem, and would love to see someone try to challenge him.We've all heard talk about going inside the mind of a serial killer, and yes, I do agree that the \"genre\" is a bit overworked.  The 90s were full of movies trying to depict what makes serial killers tick; some of them worked, but most failed.  But \"The Cell\" does not blaze down the same trail, we are given a new twist, we are physically transported into the mind and presented with nothing less than a fascinating journey of the most mysterious subject matter ever studied.I like how the movie does not bog us down with too much scientific jargon trying to explain how Jennifer Lopez actually gets to enter the brain of another.  Instead, she just lies down on a laboratory table and is wrapped with what looks like really long Twizzlers and jaunted into another entity. \"The Cell\" wants to let you \"see\" what it's all about and not \"how\" it's all about, and I guess that's what some people don't like.  True, I do like explanations with my movies, but when a movie ventures onto new ground you must let it do what it desires and simply take it in.I noticed how the film was very dark when it showed reality, maybe to contrast the bright visuals when inside the brain of another.  Nonetheless, the set design was simply astonishing.  I wouldn't be surprised if this film took home a few Oscars in cinematography, best costumes, best director and the like.  If it were up to me it'd at least get nominated for best picture.I've noticed that I've kind of been repeating myself.  Not because there's nothing else to say, but because I can't stress enough how fantastic I thought \"The Cell\" was.  If you walk into the movie with a very open mind and to have it taken over with wonders and an eye-popping feast then you are assured a good time.  I guess this film was just a little too much for some people, writing it off as \"weird\" or \"crazy\".  I am very much into psychology and the imagination of the human mind, so it was right down my alley.  Leaving the theater, I heard one audience member say \"Whoever made that movie sure did a lot of good drugs.\"  If so, I want what he was smoking.**** (out of 4)","What makes watching and reviewing films a pleasure is when every once in a while when you least expect it a film like The Cell comes along and knocks your socks off!. This movie is a superb horror that has everything a you could want when you want to be scared out of your witts. Without going into the story all i will say is that it has a great beginning ,middle and end that keeps you on the edge of your seat while being transfixed with the amazing special affects. The acting is good without being outstanding but that does not matter because the subject matter and the way it is put on the big screen makes this one of the best horror movies i have seen for a long while. It is one of those films that you imagine started as a novel but saying the credits it does not look like an adaptation , so a lot of credit must go to Mark Protosovich the writer. 9 out of 10.","A serial killer , Carl Stargher , has been kidnapping and murdering young women by letting them drown in a water filled cell . He is apprehended by the FBI , but is in a coma and his latest kidnap victim awaits in a cell timed to fill with water Take a look at the above premise and you'll see that there's a very much seen it all before look to it . The magic of Mark Protosevich's script is that he changes a hoary old chestnut plot in to something quite different from what you're expecting . If I mentioned the plot involves a machine that allows a psychiatrist to enter the mind of Stargher then sets up a different film entirely This wouldn;'t be enough to make THE CELL a different class of thriller but director Tarsem Singh creates a visually striking surreal thriller . The cinematography by Paul Laufer where opaque primary colours are to the fore is stunning but Singh doesn't let it end there , things like costume design where Stargher wanders around his idiosyncratic universe wearing opulent costumes does have a visual impact making this so much more than a run of a mill thriller What stops THE CELL becoming a classic movie however is that you start becoming more and more aware that the whole movie revolves around the visuals rather than having a natural narrative . We see a third character , a FBI man enter Stargher's domain but this seems more like a contrived plot turn just to introduce the audience to more stunning but very disturbing momentsIt should also be pointed out that this is a rather disturbing thriller with a atmosphere that is very depressing and that stops the film from being if not enjoyable , then involving . One scene where a FBI agent recounts a case where a paedophile beats a rap only to later cut out the heart of his victim will fill your heart with so much despair you might reach for the off button . You'll probably have to watch a massive amount of thrillers till you see another one as disconcerting as this one","The Cell starts as serial killer Carl Stargher (Vincent D'Onofrio) kidnaps Julia Hickson (Tara Subkoff) who he intends to be his next victim, Stargher takes Julia to an isolated underground bunker & imprisons her in a large glass tank which will start to fill with water & eventually drown her. However FBI agents lead by agent Peter Novak (Vince Vaughn) are close to catching Stargher & raid his house only to find Stargher comatose on the floor after having some sort of seizure. The doctors say Stargher will never regain consciousness & that his latest victim Julia is doomed to die. Then they decide to use an new technology that allows one person to enter the mind of another using computers, Catherine Deane (Jennifer Lopez) is given the job of entering the mind of a serial killer & finding out where he has hidden Julia in order to save her life. It isn't pretty inside Stargher's mind & with time running out the pressure is on to find the answers...This American German co-production was the feature film directorial debut of Tarsem Singh & while one cannot deny The Cell is a striking visual experience it's less impressive on other counts. If we forget about the lush & extravagant visuals for a moment there's not that much of a film here to be honest, the serial killer angle is laid bare within the opening sequence & as such there are no twists or surprises in that regard. We know Stargher is the killer from the get-go & the film plays to expectations in this aspect. The character's are fairly poor, the ever awful Jennifer Lopez's character in particular has no sort of story at all, we never find anything out about her & apart from walking around some fancy sets wearing some bizarre clothes she doesn't really have anything to do. Other character are similarly short changed in the development stakes. At about 100 odd minutes the pace is alright but I did like the film better while it was a straight serial killer thriller & I sort of lost interest once Lopez went into Stargher's mind with some surreal & bizarre moments that aren't exactly bad but I didn't really know what to make of them. The actually process in which Lopez enters Stargher's mind is never really explained & it looks more like virtual reality than a computer programme with those suits that they wear. I didn't hate The Cell but I didn't love it either, it looks fantastic but it's also rather shallow & somewhat empty on the inside.As already mentioned by just about everyone else who has ever seen The Cell some of the visuals are stunning from the sets to the special effects & the costumes which are lavish, extravagant & a joy to see. The Cell is a great looking, very arty & frankly gorgeously photographed film. The camera is free flowing, it travels everywhere from high shots to wide shots to tracking shots there's always something to look at & appreciate in The Cell but is that enough? Not really. There's a bit of nastiness with D'Onofrio hanging himself from the ceiling by metal hooks & masturbating over his dead victim & there's also an unpleasant scene in which someones guts are pulled out of their body on a spit roast thing. While it looks great & it's inspiration lies in surreal paintings & other works it's not scary & there's surprisingly little tension as it's fairly predictable with no real twists or surprises.With a supposed budget of about $33,000,000 The Cell looks great & has lavish production values & decent CGI effects, filmed in California & Namibia. The acting is OK, I personally hate Jennifer Lopez as I don't think she can act, I don't think shes that good looking & she definitely can't sing so whats the point of her existence?The Cell is a visually striking serial killer thriller that is very easy on the eye & features some truly memorable imagery but it doesn't really cut the mustard on any other count. Followed by a DTV sequel The Cell 2 (2009) which by all accounts is awful.","Spoilers herein.Weak script. Bad acting (except for D'Onofrio, who has done memorable work). Even big Latin butts don't do it for me. (Watch Musetta Vander as Mrs Baines who outclasses Lopez. )Science fiction with absolutely no science. Every plot device is stolen.What is interesting is the art -- I suppose it is a matter of taste how effective it is. I really like this sort of thing when done well. Done poorly is `What Dreams May Come.' Done well is `Prospero's Books.'In between are all manner of mixes of brilliant imagination and pretense. I'm willing to tolerate a lot of pretense, because I think the world needs lots of risktaking so far as cinematic vision. `Titus' failed to hit a home run with me, but I celebrate the attempt. Not so sure here.The problem I have is a matter of coherent vision. Some scenes impress. Some effects work. But it is all a jumble as if many people generated many different notions, using whatever was available. If an attempt had some power, it was kept regardless of whether it fit an overall concept. So what we have is a dozen different 3 minute episodes that use roughly the same characters. Some are effective, most not. Few are original.Ridley Scott and Peter Greenaway have the ability to build a vision that is sustained through a film, that because it sustains, can be elaborated and enfold depth. Their visions can serve as a structure into which other components fit. With less novelty, all good directors do. DePalma comes to mind. Others.The difference between what can be done and what is here is vast.Why do filmmakers subconsciously relate suspense of a film to suspending people in that film?","Tarsem Singh is certainly a photographer at heart and the surreal imagery of this movie is definitely gallery worthy.This is a suspense/ thriller that delves into the mind of a serial killer that seemingly euthanized his victims not out of spite, but out of pity. This is illustrated when as a child, he drowns a small bird before his abusive father can defile it. It was more humane to kill the bird than to let it live in such an ugly world filled with pain, and this was emphasized with Carl (the killer) even at a young age.Much of the movie is shot from the perspective of Carl as a child, no doubt to gain sympathy from the viewer while he sets in an animated reversion of sorts while communicating synaptically with Lopez's psychotherapist character. It was interesting to see him speaking of his first messy inexperienced endeavor with misty reminiscence, and also to view the symbolism of the white dog, or of how he hung himself from the chains. Better than the story, though, was the cinematography. It was stunning.I was taken back to this film when I viewed the \"Bodies\" display at the Tropicana, which I believe is now showing at the Luxor in Las Vegas. (For those of you haven't been, these are actual humans preserved in silicone on display actively posed for easy viewing of vascularization, musculature, organ systems, etc) In the film it was a horse with transverse cross sections between plated glass. The attention to detail with regard to the succinct slices showing the yet operational organs made my twisted little heart soar.It's interesting to me that Singh hasn't released much since \"The Cell,\" but he does have \"Immortals\" and \"The Brothers Grim: Snow White\" in the works. If you haven't seen this movie, see it, especially if you dug \"Se7en\" or \"Red Dragon\". It has a similar \"cop hot on the trail\" feel to it, and much like the others, the villain is a shining enigma with a troubled past and a demented message of sorts. While \"Se7en\" gets kudos for creativity and \"Red Dragon\" has Fiennes, \"The Cell\" still has the unmatched scenery that makes me consider it to be ever so slightly better than the aforementioned.If you love gore, such as an excruciating spooling of Vince Vaughn's intestines slowly onto a wheel, and you want to be visually dazzled, this is your flick.","I remember seeing the trailer for this movie when it was first released and it looked pretty cool. I never got the chance to see it though. When I went to Blockbuster to rent some videos, I figured I should watch it. After all I did love \"Silence of the Lambs\" and \"Se7en\", and if you enjoyed those movies, you might get a kick out of \"The Cell\". The whole story concept is very interesting. Going physically into the mind of a killer, I can't imagine the world they live in. The acting is actually pretty decent. Jennifer Lopez is the only one I have to say that wasn't that great, but she does a believable job. I would recommend for a scary thriller.7/10","This film has some of the wildest visuals I'd seen up to the time of my first viewing of this in April of 2001. The visuals were easily the highlight of the film. It isn't the story because that's too much on the sordid side. Sometimes, it's just plain too uncomfortable.It's another demented serial killer story, this one as sick an individual as I've seen, although, thankfully, there are not a lot of scenes with him. The switch is that he is captured early on but is in a catatonic-like state and unable to talk. His latest victim must be found quickly or she will die as the others did. The only way to find where this woman is stashed is by going inside his brain and try to solve the puzzle. That's Jennifer Lopez's role here as \"Catherine Deane.\" When she enters, the visuals are perhaps like someone on LSD, and they are very interesting, along with good sound effects. It's a bizarre story that keeps your attention, although gruesome at times. I haven't seen this film since 2002 and since then became a fan of Vincent D'Onofrio's detective character in Law and Order: Criminal Intent. I'm not sure I want to go back and see him as this sick killer now that I am used to seeing him as a \"good guy.\" However, I am curious about that.The bad points of the film, to me, were (1) a definite anti-Christian cheap shot in which it is shown that the killer was first \"tortured\" when he was baptized through immersion and held too long under water by his sadistic father. In addition to the obvious bias, it also shows you how theologically ignorant Hollywood is, thinking the parent does the baptizing. Wrong. Anway, in conjunction with that, the killer is shown ore as a young boy than any other period and then is seen to be a sympathetic figure! Only with Liberals, is there sympathy for the sadistic killer more than his victims!! At least there is one cop in here who states that a horrible childhood doesn't have to turn someone into a sick killer.So th question for me wound up being: are the visuals worth putting up with the unpleasant story. The answer wound up being \"no.\"","Oh yes, it's all there: dog, horse, boy child (the son), the zone (the cell), all that water, weathered wall, battered machinery, miniature house (home), weightlessness/elevation, the tree (of life/hope, blossoming even if it was dead to begin with) and religious imagery galore.After seeing Tarsem Singh's dreadful misunderstanding of Andrei Tarkovsky's 'Offret' in the musicvideo for REM's 'Losing my Religion' years ago, i just knew a full feature film would contain so much more utter nonsense. I was not mistaken ;-)A lot of the imagery stems from Tarkovsky films directly; especially from 'Stalker', 'Nostalghia', 'The Mirror' and last but not least: 'The Sacrifice'('Offret')So it's Tarkovsky badly misinterpreted with Singh delivering us such fine bonus, totally misplaced, christian moralities as 'salvation through cleansing of the soul' bla bla 'baptism', 'god-me-son triangularity', purgatory scenes, heaven and hell as ying and yang, 'Saint Catherine The Pure', bla bla, o lord.....The Cell attempts to run deep, but it's just very very shallow.Vision, dear Mr. Sing, not just images !","\"The Cell\" is a rather difficult film to classify. If you read the plot outline, \"a psychotherapist journeys inside a comatose serial killer in the hopes of saving his latest victim\", you might think it's a thriller with a touch of science fiction. But that doesn't really do this movie justice. There is a fantasy aspect within the sub-conscious minds that is stunning, with lavish visuals and incredible mind-tripping scenarios. There is drama as the aforementioned psychotherapist (played by Lopez prior to her becoming a solely romantic comedy component) makes contact with the child within and witnesses his terrifying upbringing. And there is most definitely a horror facet due to the sickening actions of the serial killer's evil persona. The movie attempts to function on many different levels and crosses genre boundaries at will. While I feel it ends up being a reasonably bizarre experience, I find it to be completely fascinating.Right from the opening credits, with Lopez riding a horse through the desert stunningly clothed in a white dress, you will know that you are in for a visual treat. Every time the audience leaves reality and follows her into the sub conscious depths of her \"patients\", they are guaranteed a feast of visual and aural delight. The costumes are wonderful creations of angles and colour. The camera leaves regularities at the door and traverses a world where up and down are the same. The characters become rulers of their own domains and transform into creatures worthy of such stature. If you don't enjoy anything else about \"The Cell\", you will surely be impressed with the work put into these scenes.The casting is top notch also. Jennifer Lopez is in her element here, utilizing her natural, compassionate and almost maternal sensibilities, while combining her own striking looks with the lush surroundings, makeup and costumes. She is incredibly sexy and I personally wish someone would find another role for her outside of the rom-com world she has been typecast into that would allow her to experiment further. Vince Vaughn is fairly convincing as an FBI agent that will do anything to save the life of a young woman. But it is without a doubt Vincent D'Onofrio that has the biggest impression here. It's an extremely difficult role as he is required to bring out multiple emotions within the viewer. We are disgusted at his actions, yet sympathetic towards him due to the trauma he has experienced during his life. He looks magnificently powerful within his realm, yet insecure and vulnerable within the real world. It's a great performance from an underrated actor.While \"The Cell\" doesn't work as well on every level it ambitiously attempts (some of the actions of the characters are not believable) and while it is all based on some fairly flimsy scientific logic, it is an occasionally shocking, visually astounding head trip that rewards multiple viewings.","I think this film might be one of the best of the year for me (if not, better films of the year which is 10-20 on my list) by showcasing some astounding visuals, a exceptional story and well thought out characters. \nDirected by Tarsem Singh (of R.E.M. music video Losing my Religion fame), he brings great visual and original quality to this picture that nowadays are being seen by quite a few music video/comercial directors turned film (Spike Jonze's Being John Malkvoich, David Fichner's Fight Club, David O. Russel's Three Kings, etc.).  And I think that shows that people who have experience directing off screen and then come into film, disrupt the film industry, in a good way.Tarsem has Jennifer Lopez back on the screen after a year absence (she was musical last year) playing a psychologist of the mind, who is hired by FBI to go inside the mind of a killer (Vincent D'Onofrio is a terrifying performance) who is the only one who knows where his last victim might be. One might compare the visuals to 2001, which are similar.  And another might compare the story to Silence of the Lambs, which has many similarities.  One being that this time, D'Onofrio's mind gives the clues the Lopez like how in Lambs Hopkins gave the clues to Foster.  One key thing also is that this film has fantastic visuals and a exceptional story to back it up.  That is how The Matrix last year got to be so good, and how Hollow Man (which had a horrible story) 2 weeks ago was a waste.  Definately a good film, but expect violence and gore more terrifying than the whole third act of Dawn of the Dead.  A+","This is truly one of the most unique movies I have seen all summer, although not the best. It certainly has the visual effects, and the acting isn't too bad either. Surprisingly, Jennifer Lopez actually does a good acting job. I was a little skeptical on my way into the theater, but she proved me wrong. The 2 Vince's also deserve credit, as they did wonderful jobs too. I see this movie walking away from the Oscars with the best costume design and best visual arts...My rating: 8 out of 10...go see it if you haven't yet!","I don't know what it was about this movie that failed to thoroughly captivate me. It was good enough to hold my attention and get me to wince a little, but that was only due to the special effects. The story was O.K., it reminded me a lot of Dreamscape. Catherine Dean (Jennifer Lopez) is the main character. She plays a psychiatrist that is able to enter the mind of her patients via some secret drug and electronics. Things start getting hectic when she enters the mind of a psychotic killer named Carl Stargher (Vincent D'onofrio) in order to find out where he has hidden his latest victim.There were plenty of interesting scenes from a cinematic perspective, but the dialogue and story itself did little to make this movie very good. The idea of going into another realm to accomplish something in reality is nothing new even if it is going into someone's mind. When you strip back all of the visual stimuli, you are left with sophomoric psychology and a weaker version of Silence of the Lambs.","Catherine Deane is a psychotherapist who has become involved in an innovative project to treat a catatonic boy who has not responded to normal treatment. The technique involves entering the boy's mind space and working with his subconscious to treat him. Progress has been slow though and the project is close to being wrapped up. Meanwhile, the FBI are close to catching a serial killer who drowns women as a form of torture before making them look like dolls and dumping their bodies. Clues lead them to find Carl but only as he falls into a coma of his own. With a girl still missing and no clue as to where she is slowly being drowned, the FBI turn to Deane and her team to go inside Carl's mind and try and find out where the girl is, before it is too late.I'm not sure if the plot is harder to swallow than Lopez's casting but certainly both these things take a certain amount of swallowing to get into this film. The plot takes elements from other films including all manner of serial killer movies to produce a setup that is hardly that inspiring a narrative on paper. However it works reasonably well enough as a frame for imaginative visual development. Naturally filling a film with style risks the substance falling down but here the former just about covers up for the weaknesses in the latter. Of course it never gets above the level of derivative serial killer movie and a load of obvious psychoanalysis stop it becoming very dark but in this area music video director Singh comes into his own.His visions are impressive and he directs really well with his expensive range of effects. True the material limits the meaning within the visual but it is hard to find the scenes dull! The cast are more part of these visuals than characters. Lopez is unconvincing and just simpers her way across the film, unable to really get any depth out of the story. Vaughn makes for a solid if unspectacular leading man while D'Onofrio hams it up the main villain. Support from Weber, Jean-Baptiste and a few others add a bit of interest and credit to Subkoff who produces a convincing turn despite being isolated from the majority of the story.Overall this is an average serial killer movie that is only really worth seeing because of the visuals. The story could have been much stronger but it works as a frame for the visual effects  which is pretty much the same for the cast, who are just part of the look of the film rather than well developed characters.","A revolutionary breakthrough in psychotherapy enables therapist Catharine Deane to go into the minds of patients to get to the root cause of the problems. After the police track down serial killer Carl Stargher, they find he has fell into a coma, this is bad news as his last victim is holed up in a cell that fills with water at frequent intervals, she's still alive but only Stargher knows where she is......The Cell to me was working just fine as a standard serial killer maniac on the loose film, we are introduced to the maniac early on {Vincent D'Onofrio on disturbed form}, and we get repulsed to the point that we are in no doubt that this is a troubled mind. The film then shifts from basic formula to one of pure fantasy, and as beautiful as some of the sequences and images are, the film goes dangerously over the top to create style over substance.It's an above average multi genre piece, but the acting is less than great, which in truth evens the films novelty value out. It's certainly worth that once only viewing, but thinking hard about it afterwards will only frustrate you because you realise they got carried away with the gimmick, 6/10.","I saw this movie for free and I got what I paid for. There is just enough plot to give a reason for the special effects. Much of the special effects includes gruesome or female-exploitive images. A very unsatisfying movie.","There are times during this movie, that I almost cry. Not because of some lame love story. Not because I dislike JLo so much (although I really do). I almost cry because this film is so beautiful. That's right.. so beautiful.\nFincher, Jonze and Tarsem Singh all come from music videos. Fincher and Jonze might make the better movies as far as the storylines go, but The Cell is an undeniable proof that Singh has the best visual sense (and by this I'm in no way trashing Fincher's film's visuals). This film is a perfect collaboration between the director and everyone working beneath him. I mean the production design, the photography and especially the score (screw LOTR, this is clearly Howard Shore's best and most beautiful work to date).\nSure the story is old and has been done to death, but what makes The Cell special is that it manages to be original anyway. The headtrips are UNBELIEVABLE. And even in the scenes that take place \"in the real world\", the film doesn't implode. The acting and the photography are too good for that.The Cell is a masterpiece, because there's just nothing as special around. Visually.***** / *****"],"review-user":["kitsenugari","asthmaticpunk","JohnnyPHreak","Geff","rbverhoef","Boba_Fett1138","Anonymous_Maxine","oxblood","Benzzo","CharltonBoy","Theo Robertson","poolandrews","tedg","Creepy-Suzie","Smells_Like_Cheese","ccthemovieman-1","Voix","TrickyTheHorrorFreak","MisterWhiplash","junebug058","view_and_review","bob the moo","Spikeopath","Mtrodgers99","ichabod81"],"review-date":["11 September 2000","5 February 2005","19 August 2000","13 January 2001","29 January 2005","1 January 2006","8 September 2000","13 January 2005","24 August 2000","4 May 2002","16 January 2010","3 August 2009","8 March 2001","28 April 2015","31 December 2004","12 December 2006","5 May 2001","24 October 2006","18 August 2000","3 September 2000","4 April 2006","20 June 2006","4 March 2008","18 September 2000","27 July 2004"],"review-rating":["9","10","7","7","9","7","10","9","7","5","7","5","4","8","9","10","6","6","1","10"],"review-title":[" The Cell: whoa... eww... whoa...\n"," It's All In the Pictures\n"," You ain't seen nothing yet...\n"," There's nothing like it...\n"," The least it does: looking great\n"," Creativly original.\n"," Every once in a while a film comes along that stands apart from all others made in years. The Matrix did it last year, and The Cell has done it in 2000.\n"," Nightmarishly good, but far from perfect.\n"," Daring to be different.\n"," A Genuinely Brilliant Horror\n"," Visually Striking And Disturbing Virtual Reality Thriller\n"," Visually striking but thematically empty serial killer thriller.\n"," Pretentious Attempt\n"," If you want to be visually dazzled, this is your flick.\n"," Bizarre, yet interesting at the same time\n"," Fantastic Visuals But Very Sordid, Unpleasant Story\n"," Tarkovsky badly misinterpreted\n"," A visually astounding film that works on most levels that it attempts.\n"," This is very good\n"," A truly unique thriller, although not for the weak\n"," visually stimulating but not much substance\n"," So-so film that relies heavily on visuals above and beyond everything else\n"," Interesting but muddled affair.\n"," Mildly interesting special effects, nothing else.\n"," Perfect visuals make The Cell a must see.\n"]}