{"review-url":["http://www.imdb.com/title/tt0096453/reviews"],"review-text":["This film starts as it means to go on: a bunch of pilgrim types, armed with pitchforks, chase a pregnant woman through a modern house (with light-switches) until she jumps out of window. We are truly in the realm of Italian madness.David Hasselhoff plays Gary, boyfriend of the mumbling Leslie, who won't let him into her pants. Won't even give him tops and fingers. Gary and Leslie are currently squatting in an abandoned hotel researching either a witch or witch lights or the gates to hell or something to do with a German book. It's kind of hard to tell, as Leslie explains most of this and to be frank she can't act or even speak very well. I think she was the one doing the research and Gary was the one trying to get into bed with her, but nevertheless they are in trouble for two reasons. One: there's the world's most tired looking woman hiding in the attic somewhere, being creepy and Two: the new owners of the hotel are heading there for a visit with their children (pregnant Linda Blair and proper kid Tommy), an estate agent, and a nympho lawyer.The old woman has already been appearing to this family for some reason and about five minutes after the family land on the island she wastes the guy who took them over in the boat. So it looks like they're stranded.What follows is your usual late eighties Italian set-up (like Ghosthouse, House of Lost Souls, House of Clocks etc) where a bunch of victims try not to be killed by supernatural forces. As I said it's kind of difficult to get a handle on what's truly going on, but it seems that the old woman (who may or may not be a ghost or a witch) wants to open the gates of hell by killing folks who have sinned in certain ways. She does this mainly by sucking them through into another dimension and wasting them graphically.Where House of Lost Souls was content to decapitate children with washing machines, Witchcraft opts for daft visual effects and surreal, nasty deaths. One victim gets her lips sewn shut, jammed down a chimney, and set on fire. Another gets impaled on a swordfish, and in the best scene, Bob Champagne's jugular explodes in David Hasselhoff's face. It takes a while to get to the good stuff in this film, but the gore has an nice nasty edge to it.Gore aside, the Italian daftness quotient is as high as ever. We don't have dubbing, but we do have Hasselhoff telling a fully clothed woman to get dressed, a whole lot of bizarre visual trickery (like the witch-lights), and the world's most terrified looking child actor.A lot has been made about how bad this kid is, but to be honest with you he just looks like he's scared of everyone in the film and would rather be anywhere else at all. I'd be scared too if I had to act with a woman who looked like she's been drinking three bottles of vodka a day for at least a decade.And another thing: never turn your back on Linda Blair. As usual, she goes all possessed near the end of the film in a scene that is pure comedy (unintended of course). To cement it's place as one of the most enjoyable films an industry in decline released as the decade drew to a close, we have our twist ending which is so abrupt and stupid you just have to applaud.Witchcraft has the lot: gore, madness, incoherence, and even a couple of scenes that are genuinely creepy (the Satan rape bit). As it seems to be unfairly trampled on by all and sundry, it turns up cheap on Amazon. For the two or three people actually interested in what Italian films were like after the golden age had passed, I'd buy Ghosthouse. Then this one.","I recently picked this up on VHS under the title \"Ghosthouse 2\", although it has nothing at all to do with the original Ghosthouse film. I was expecting it to be terrible, after reading IMDb reviews, but it actually turned out to be OK. The setting of the film is what gets the most marks from me - I love seeing the shots of the house and island from the sea. It's THE perfect setting for a horror film. I do think it was a little wasted on this particular film though. Never mind.The film itself isn't too bad, it just drags a bit in some places and I didn't like the witchcraft theme. I found the scenes where people are transported via that \"Doctor Who\" style vortex extremely cringe-making. It looked like something from a cheap 80's sci-fi film! Other than that I thought the death of the old woman was excellent - she gets her lips sewn together and is hung upside down above a lit fireplace. She can't scream for help and the others have no idea she's there. Now there's an original death for you! The parts where the helicopter flies around the house are also excellent - the people inside can't signal for help because the house has trapped them inside. I would recommend horror fans to give this a watch, it's silly and boring at times but the good bits make up for that.","At least there are some big names in this campy horror film to keep us occupied. Double billed on a new blue ray with \"Ghost House\", Witchery has David Hasselhoff (post Knight Rider, but before Baywatch) and Linda Blair (waaaaaaay after Exorcist). Another Italian horror film, filmed in Massachusetts, this one is directed by Fabrizio Laurenti. Like the Lenzi horror films, this one is so campy, so bad, that its kind of fun to watch. And who IS that Lady in Black? She and her magic gemstone pop up now and then, adding to the mystery. A real estate agent tries to sell a house on a private island, but Gary (Hasselhoff) and his assistant entered the house (without permission) to take photos. Jane (L. Blair) has her own secrets, as you will see. More cheesy special effects, and of course, the usual blood and gore. I'm surprised that Linda Blair still wanted to do films like this, since she was so well known for The Exorcist. It's pretty creepy. And as of today, only 3 out of 10 stars on IMDb.The \"story\" starts out pretty solid, unlike most oldie horror films. The acting and directing are a bit lame, but everyone does a pretty good job with the lines they are given. For a lot of of the cast, this is the only film they ever made. About two thirds of the way through, the plot gets weird and goes down these left turns. Lots of screaming, organ music, and smoke. Similar plot to Ten Little Indians, where the guests get knocked off, one by one. Interesting, if just for the historical value.","Creepy gory horror movie that is not for everybody.  Linda Blair and family, David Hasselhoof and wife and a few reporters come to stay on an island to look at a house. It turns out this was once where a witch got burned at the stake and now she and her demons are back to get revenge. Some scenes are very gory and hard to watch. One woman gets her lips sewn together and then is hung upside down in a chimney while the fire is going . Ouch! Ending leaves room for a sequel.  Acting is ok as is the direction.","Linda Blair has been acting for forty years now, and while she will never escape the part of Regan MacNeil in \"The Exorcist\", few of her subsequent horror films have used her legendary status to such great effect as \"Witchery\" does. She plays Jane Brooks, a pregnant single woman who travels with her family to an abandoned island hotel that her parents want to purchase. They are accompanied by a couple of real estate agents (Catherine Hickland and Rick Farnsworth) and upon arriving at the island they meet a photographer (David Hasselhoff) and his writer girlfriend (Leslie Cumming) who are illegally squatting in the hotel while investigating the legend of a local witch (Hildegard Knef). It seems that a long-ago witch-hunt resulted in her suicide, and she was with child at the time. Unaware of the danger, Jane has recently dreamt of the witch's dramatic death, and Jane's little brother Tommy (Michael Manchester) has been more directly visited by her spooky, black-clad spirit, which he calls 'the lady in black'. The group's time at the island inn begins quietly enough; unknown to them, however, the Lady in Black has already dispatched the captain of their hired boat (George Stevens). Before long, the isolation and cold begin to affect everyone, and it is during this period of moodiness and tension that the Lady in Black begins her reign of terror. She plans to avenge her own fate by possessing Jane and sacrificing her companions and her unborn child. Each of her other victims fulfills an aspect of her vengeful curse - greed, lust, and the blood of a virgin. As the sun goes down and the sea becomes wild, she haunts them one by one in gruesome, horrifying ways. The island location is effectively scary, and the inn is very creepy and hauntingly shot. It's such a colorful film that it reminds me of Dario Argento's work. The lighting is excellent, and the set decoration is perfectly spooky. The soundtrack is very effective and unique. The horror effects are extreme, terrifying, and unforgettable. The cinematography is great, and it is this that brings us back to Linda Blair. The creative team behind this film shoots her like a horror star should be shot: lots of dramatic push-ins, lingering close-ups that subtly detail Jane's incremental possession, and moments that are reminiscent of other great horror films. There are hidden homages to \"Rosemary's Baby\", \"Jacob's Ladder\", \"The Shining\", \"Black Sunday\", and of course \"The Exorcist\". She does a great job, and absolutely steals the show with her moody and understated performance. That isn't to say that the rest of the cast disappoints; Catherine Hickland is sexy and very good, and veteran performer Annie Ross is memorable as Jane's bitchy mother Rose. Hasselhoff gives it his best, but he is not essentially a film star, and his television persona gets in the way of his performance. Blair and young Michael Manchester have a wonderful chemistry together. The film is otherwise so violent and creepy (in a good way) that it desperately needs their warmth (Blair also played a mother in 2003's \"Monster Makers\", and her maternal scenes in that film have the same tender feeling to them). Lastly, Hildegard Knef (in one of her last roles) plays a great witch, and she has the most amazing voice and accent. Along with Blair, she was also perfectly cast. But it's Blair's movie all the way. Jane Brooks also seems to have some psychic ability, and this aspect of the film hearkens back to \"Exorcist II: The Heretic\". I think \"Witchery\" is up there with \"The Exorcist\", \"Exorcist II\", \"Hell Night\", and \"Summer of Fear\" as Blair's best genre work to date.","I like seeing Linda Blair playing in an actual \"horror\" movie again. I had been disappointed with her in most everything since the \"Exorcist \"movies (Which i loved). What was up with all of those nasty \"B-movies\" she did? David Hassellhoff on the other hand, all i could do is laugh. He is not cut out to be a horror movie actor. David needs to stick to \"Knight Rider\" or \"Baywatch\".All around, this is an awesome movie. Even for the eighties, this was an awesome film. It has horror, action, and drama. It is a suspenseful, and I loved the way Linda Blair turned out.","An Italian/American co-production co-starring Linda Blair and David 'The Hoff' Hasselhoff: how could any fan of trashy horror resist such a treat?Well, based on the uneventful, extremely tedious, and utterly nonsensical first forty minutes or so, I would have said 'very easily'; thankfully, however, things do eventually get a tad more entertaining with the introduction of several inventive death scenes, and for those lucky enough to find an uncut copy, a smattering of nudity too (unfortunately, my copy was optically edited to remove such offensive material).The Hoff stars as Gary, a photographer who accompanies his beautiful girlfriend Leslie (Leslie Cumming) to a run-down hotel on a seemingly deserted island in order to take pictures for her latest project, a book about witches; whilst there, frustrated Gary also hopes to try and cure a bad case of blue balls by relieving Leslie of her virginity.His plans for nookie are scuppered, however, by the unexpected arrival of property developers Freddie and Rose Brooks (Robert Champagne and Annie Ross), their pregnant daughter Jane (Blair), son Tommy (Michael Manchester), pretty nymphomaniac architect Linda Sullivan (Catherine Hickland), and estate agent Jerry (Rick Farnsworth), who have come to inspect the island's hotel.After explaining their unexpected presence on the island, Gary and Leslie are welcomed by the property's new owners, and when a violent storm suddenly picks up, making it perilous to return to the mainland, everyone agrees to spend the night in the old building. Unfortunately, unbeknownst to the hotel's new guests, the place is also home to the spirit of an evil witch (Hildegard Knef), who requires human sacrifices in order to bring herself back to life. One by one, victims are pulled into a swirling red vortex (which is guaranteed to provide unintentional laughs), before meeting a terrible fate.None of this makes much sense, and the acting is atrocious (Manchester as Tommy is particularly bad, whilst Hasselhoff proves to be one of the better performers, which speaks volumes about the others), but those viewers who make it past the dreary first half are rewarded with some pretty decent moments of gore: Rose has her lips sewn together, before being roasted alive in a fireplace; Jerry is crucified and burnt alive; Linda is tortured by hags and impaled on a swordfish(!!); Freddie's veins pulsate and erupt in geysers of blood; and Gary gets stabbed in the back.Oh, and Leslie is raped by a guy with no lips and Blair gets possessed (again).","An Italian horror movie with so many juicy AKA titles and starring both Linda Blair and David Hasselhoff... I mean, that has got to be worth it, right? \"Witchery\" is not even as inept as Umberto Lenzi's \"Ghosthouse\" - or maybe it is - and it's about as much fun. Hassle Da Hoff is always worth a few chuckles, if you ask me. Linda Blair gets to play her possessed self again, with an exploded hairdo this time. \"Witchery\" also features a handful of pretty memorable killings (lips sewn tight and burned in the fireplace, pulsating veins popping & squirting and bleeding to death, nailed to the cross and burned like a witch upside down, etc). This movie really ain't wrapped too tight, and there lies the beauty of it all: Italian genre movies from the 80's are usually a pretty bonkers affair altogether (that ghostly rape of a virgin was a winner! - yes, there's boobies). Safe to say I enjoyed \"Witchery\", more than I thought I would . Both Lenzi's first one (Italian title: \"La Casa 3\") and this unrelated, unofficial second film are recommended viewings if you like your haunted house stuff trashy, gory and Italian-style. Much like a big, greasy pizza, these movies aren't exactly nutritious, but they're tasty as hell.","A group of people are stranded at an isolated hotel by an evil witch (Hildegard Knef) who possesses them and kills them. I don't understand why the rating for this film is so low on IMDB. It's well made by the standards of the horror genre and featuring a good performance by Knef, some seriously scary scenes, and good effects. It is however unrelently mean and cruel. Unrated; Extreme Violence, Rape, and Profanity.","Witchery, or Witchcraft as it's commonly known in Europe, beings with Jane Brooks (Linda Blair) waking up from a nightmare involving a witch. Jane's Mother & Father Rose (Annie Ross) & Freddie (Robert Champagne) are interested in buying an old deserted hotel on an island about 50 miles from Boston, renovating it & reopening it. Together with Jane & their young son Tommy (Michael Manchester) Rose & Freddie are planning to travel to the island with an architect named Linda Sullivan (Catherine Hickland) to check on the amount of work that needs doing, they also meet up with the estate agent Jerry Giordano (Rick Farnsworth) & hire a local fisherman named Sam (George Stevens) to take them to the island. Once there they enter the hotel & begin to inspect the property while back on the boat Sam is killed & the boat is let loose to sail off into the distance. They discover two unexpected guests in the shape of a photographer named Gary (David Hasselhoff) & his virgin fiancé Leslie (Leslie Cumming) who happens to be researching a book that she is writing about the gruesome legends & superstitions surrounding the infamous island & hotel. As the night draws on a raging storm outside isolates them from the mainland as a mysterious 'lady in black' (Hildegard Knef) keeps popping up as the ancient evil that resides in the hotel seeks fresh victims for demonic possession, human sacrifice & Satanic rites...The director of this American Italian co-produced film is somewhat shrouded in mystery as the IMDb lists Fabrizio Laurenti as Martin Newlin but there are rumours that Joe D'Amato did the honours, either way to be honest despite it's bad reputation I found Witchery quite entertaining in a so-bad-it's-good cheesy sort of way. The script credited to Harry Spalding & Daniele Stroppa on the IMDb again is confusing too as the actual credit on the film itself is Daniel Davis, anyway whoever wrote this thing did a decent job, please stop laughing. At heart it's a haunted house horror but adds some gory deaths & a surreal feeling to everything. The different sets of characters have reasonable motives & didn't get on my nerves as much as I'd thought they might, it's not plotted very well, it doesn't make a whole a lot of sense & the dialogue isn't exactly top drawer stuff but as a whole Witchery entertained me for it's 95 odd minute duration plain & simple. It's reasonably well paced, a little slow to get going maybe but there are plenty of surreal, bizarre goings-on & gruesome deaths to keep one amused. One part of Witchery which destroys some of it's credibility is this so-called storm, there is no storm in sight & the sea is probably calm enough to swim in, Witchery's supposed 'twist' ending didn't really work for me either & just check out the dumb expression on Cummings face on that final freeze-frame. The hotel provides for a good isolated location & adds a certain atmosphere to the film which has the distinctive indefinable 'horror' feel throughout, cheap horror at that. Technically Witchery is not too bad at all, it was obviously shot on location so it looks good throughout & while not exactly the pinnacle of film-making finesse it's overall production values are slightly better than expected. The violence & gore is of typical Euro explicitness, a woman has her lips sewn shut & hung inside a fireplace so she can't scream as the others light it, someone is crucified & then burned alive, impaled on a swordfish, someones veins expand & pop & a woman is raped by a man with no lips. Witchery was shot in English so there is no dubbing, as far as acting goes David Hasselhoff & Linda Blair in the same film what more can I say?! Yes ladies Hasselhoff does take his shirt off & for the lads Cummings takes hers off. Both Hasselhoff & Blair are a hoot to watch in this thing, however the little kid is very annoying & really can't act at all. I sure most sane film-goers will disagree with my opinions but I still stand by the fact that I liked it & would happily watch it again, Witchery is pretty good fun & definitely worth a watch if your into 'bad' films or your a horror fan in general.","There are many different versions of this one floating around, so make sure you can locate one of the unrated copies, otherwise some gore and one scene of nudity might be missing. Some versions also omit most of the opening sequence and other bits here and there. The cut I saw has the on-screen title WITCHCRAFT: EVIL ENCOUNTERS and was released by Shriek Show, who maintain the original US release title WITCHERY for the DVD release. It's a nice-looking print and seems to have all of the footage, but has some cropping/aspect ratio issues. In Italy, it was released as LA CASA 4 (WITCHCRAFT). The first two LA CASA releases were actually the first two EVIL DEAD films (retitled) and the third LA CASA was another film by the same production company (Filmirage), which is best known here in America as GHOSTHOUSE. To make matters even more confusing, WITCHERY was also released elsewhere as GHOSTHOUSE 2. Except in Germany, where GHOSTHOUSE 2 is actually THE OGRE: DEMONS 3. OK, I better just shut up now. I'm starting to confuse myself!Regardless of the title, this is a very hit-or-miss horror effort. Some of it is good, some of it isn't. I actually was into this film for the first half or so, but toward the end it became a senseless mess. A large, vacant hotel located on an island about 50 miles from Boston is the setting, as various people get picked off one-by-one by a German- speaking witch (Hildegard Knef). Photographer Gary (David Hasselhoff), who wants to capture \"Witch Light,\" and his virginal writer girlfriend (Leslie Cumming), who is studying witchcraft, are shacking up at the hotel without permission. Along comes real estate agent Jerry (Rick Farnsworth), who's showing off the property to potential buyers Rose (Annie Ross) and Freddie (Robert Champagne) Brooks. Also tagging along are their children; pregnant grown daughter Jane (Linda Blair) and very young son Tommy (Michael Manchester), as well as oversexed architect Linda Sullivan (Catherine Hickland - Hasselhoff's wife at the time). Once everyone is inside, their boat driver is killed (hung) and the boat disappears, so they find themselves trapped and basically at the mercy of the \"Lady in Black.\"So what can you expect to find here? Plenty of unpleasantries! One of the characters has their lips sewn shut and is then hung upside down in the fireplace and accidentally slow-roasted by the rest of the cast. There's also a crucifixion, witches eating a dead baby, a swordfish through the head, someone set on fire, a possession, a Sesame Street tape recorder, the virgin getting raped by some demon, a guys veins bulging and exploding thanks to voodoo doll pokes and some other stuff. From a technical standpoint, it's a nice-looking film with pretty good cinematography, a decent score and good gore effects. The hotel/island setting is also pretty nice. Blair (particularly at the end) and Ross both seem like they're having fun and Knef is great as the evil witch. Even though people like to ridicule Hasselhoff these days, he's not bad in his role, either.On the down side, despite all the gore, the film seems somewhat dull and it gets monotonous after about an hour. The supernatural themes are muddled and confusing, too. When characters are being swept into the witches lair to be tortured and killed, the filmmakers unwisely decided to superimpose the screaming actors over some silly looking red spiral vortex effect that looks supremely cheesy. And the witch lair itself is vacant and cheaply designed with unfinished lumber. And while most of the cast is at least decent, a few of the performances (particularly the \"actress\" who plays Hasselhoff's girlfriend and the kid) are so bad they're constantly distracting.","Persecuted witch Hildegard Knef traps a group of people in an isolated seaside hotel and picks them off one by one in twisted, disgusting ways. I thought I'd seen it all until one unfortunate man here is crucified and then set on fire. Hildy is quite the prankster, too: she takes a nagging harpy and has her lips sewn shut...then hangs her upside down in the chimney just in time for a roaring fire! \"Witchery\" is an uninspired gore-fest that is (surprisingly) well-produced on an obviously tight budget, yet is seriously lacking in all other departments. Most of the acting is stiff and dull, although I must admit I loved the finale. It involves two people searching the hotel for a little boy and his toy tape-recorder, all cornered by Linda Blair looking fantastically possessed (in films, whenever Blair is allowed to drop the 'good girl' routine and take the spotlight, she instinctively knows how to grab the camera). The sequence only lasts for a few minutes, but you know the old saying: If you've got a great ending, people will forgive you for just about anything. *1/2 from ****","David Hassellhoff seemed to be lost in this film, not because it was a bad movie, but because it was so far from his days in knight rider, well only a few years, maybe his cash was drying up and he needed a top up, and Linda Blair, well you only have to look at her whatever movie she is in and the Exorcist comes flooding back. But even still this film was pretty good, and was still quite entertaining, especially the scene where the nagging old hag gets her mouth stitched together, and as if that was not enough is left dangling upside down in a chimney over a burning fireplace, just ignore the fuzzy picture and take it for what it is, A low budget gore feast.","I must confess that I've been a huge fan of the almighty David \"the Hoff\" Hasselhoff ever since he starred in the hit 80's TV series \"Knight Rider.\" Whether it's his extraordinary debut as a libidinous high school basketball player in the hilariously raunchy \"Revenge of the Cheerleaders\" or his brilliant portrayal of a dashing prince in the schlocky sci-fi gem \"Starcrash,\" the Hoff has proved time and time again that he's a simply terrific (and shamefully underrated) actor supreme. The Hoff excels here as Gary, a cynical and skeptical photographer who along with his repressed virginal writer girlfriend Leslie (attractive brunette Leslie Cummings) investigates a seedy dilapidated haunted hotel located on a remote island off the coast of Massachussetts. They're doing research on witchcraft throughout the ages and the hotel's last owner was an actress who allegedly practiced the black arts. A bickering family also shows up on the premises to check out the hotel. Pretty soon various folks begin to get bumped off in assorted gruesome ways by the mysterious Lady in Black (an effectively eerie Hildegard Knef).Granted, the rest of the cast gives the Hoff a run for his money: the ever-perky Linda Blair projects her customary charming flair as a spunky pregnant woman who winds up becoming possessed (natch!), legendary jazz singer Annie Ross bitches it up with gleeful aplomb as a snippy old bat (poor Annie winds up being incinerated alive after she has her lips sewn shut and she's hung upside down in a chimney), and gorgeous blonde Catherine Hickland oozes considerable sex appeal from every fetching pore as a lusty slut. Fabrizio Laurenti's competent direction, a suitably creepy atmosphere, Gianlorenzo Battaglia's slick, glossy cinematography (the fluid prowling Steadicam tracking shots are especially nice), the gaudy special effects, Carlo Maria Cordio and Randy Miller's spirited shuddery'n'spooky score, and the gory, sadistic violence are all up to par. But ultimately it's the tremendously dynamic and charismatic presence of the one and only the Hoff which makes this choice tasty chunk of tacky Italian horror cheese such a winner: He takes his shirt off once (hubba hubba!), gets sprayed with blood, and -- WARNING: Major *SPOILER* ahead -- even meets a pleasingly grisly untimely end. Produced by none other than Joe D'Amato, this picture overall rates as good, sleazy fun.","That movie has been produced and directed by the same people, who enriched the world of cinema with such masterpieces, as Troll 2, The Crawlers... Well, although this movie is not THAT horrible and ridiculous, as Troll 2 and Crawlers, although special effects (done by the same italian \"Greg Cannom\" (Mrs. Doubtfire, Bram Stocker´s Dracula, Titanic, etc.) Maurizio Trani, who have done some poor FX for Troll 2 and Crawlers, this movie stinks anyway. It´s a low-budget hilarity, where the characters behave as nobody would in real life. It also contains some episodes from the first part of this masterpiece (Casa 3, or Ghosthouse (1987), and which is in no way better. All these four movies were produced by an ultra low-budget company Filmirage. By the way, they had used the SAME score in Crawlers and in Witchery! What a shame!","I found this film under the title THE WITCHERY, I'd never seen or heard about it before recently but when I found out Linda Blair was in it I reckoned it could be worth a look since I was already busy trying to find not so well known films from the 80's or they're just not so well known in my country, here the only horror movies people know are Friday THE 13TH, HALLOWEEN and A NIGHTMARE ON ELM STREET, basically you can say if the film wasn't part of a franchise it didn't exist.Anyway, what really sealed the deal for me to watch this film was finding out David Hasselhoff was also in it, I mean the Hoff in a horror movie that's something you won't see everyday, the film itself wasn't bad, I'd expected worse but fortunately it turned out to be very entertaining, although a few of the death scenes were rather sick especially the scene where a woman has her lips sewn shut and I won't spoil the rest of the scene and when you see a set of boobs for the first time in the film is also a creepy moment (I don't mean the boobs I mean what happens in that particular scene).The acting isn't too bad, David Hasselhoff gave a better performance than I expected, the only actor that didn't do so well was the kid but you can't really expect too much from a child actor, otherwise the rest of the cast were good enough to keep this film from being a total disaster.Overall, it was better than I'd expected, it won't win any awards but then again I've seen worst films that have won awards, if you enjoy a few good but sick death scenes and a great atmosphere I'd recommend this film.","Oh my... bad clothing, worse synth music and the worst: David Hasselhoff. The 80's are back with vengeance in Witchery, an American-Italian co-production, helmed by infamous Joe 'D'Amato on the production side and short-careered director (thank heavens for small miracles) Fabrizio Laurenti directing . Marketed as a kind of sequel to Sam Raimi's Evil Dead series in Italy (that was dubbed \"La Casa\" in there), Witchery delivers some modest gore groceries and bad acting.A mix of ghost story, possessions and witchcraft, the film bounces clueless from scene to another without letting some seriously wooden actors and hilarious day and night mix-ups slow it's progress to expectable ending, topped with some serious WTF surprise climax. (I just love the look on her face...) Surprisingly Laurenti manages to gather some suspense and air of malice in few - very few - scenes; unluckily for him, these few glimpses of mild movie magic go down quickly and effectively.The plus sides are experienced, when the gore hits the fan. This department is quite effective and entertaining in that classic latex and red paint style of the 80's Italo-gore, when things were made 100% hand-made and as shockingly and vivid as modest budgets could allow. I could only watch with sadistic glee and few laughters all the over-the-top ways that obnoxious characters (and actors) got mangled and misused, one by one. I only felt sorry for Linda Blair, who apparently haven't been let to try any other than that good old possessed girl / woman role ever in his career, or so it looks like when checking out his filmography.Well, folks - not much more to tell, and even less to tell home about. Don't expect too much when spending some rainy afternoon with this, and probably you'll experience at least some mild fun. It also helps if your rotten little heart pounds in the beat of 80's euro gore horror. And speaking of hearts - every movie that has David Hasselhoff getting skewered by a sizeable metal object and bleeding heavily around the room and corridors, MUST have it's one on the right place.This is my truth - what is yours?","Witchcraft/Witchery/La Casa 4/ and whatever else you wish to call it. How about..Crud.A gathering of people at a Massachusetts island resort are besieged by the black magic powers of an evil witch killing each individual using cruel, torturous methods. Photographer Gary(David Hasselhoff)is taking pictures for Linda(Catherine Hickland whose voice and demeanor resemble EE-YOR of the Winnie the Poo cartoon), a virgin studying witchcraft, on the island resort without permission. Rose Brooks(Annie Ross, portraying an incredibly rude bitch)is interested in perhaps purchasing the resort and, along with husband Freddie(Robert Champagne, who is always ogling other women much younger than him), pregnant daughter Jane(Linda Blair)and grandson Tommy(Michael Manchester, who just looks bored throughout, probably wanting to watch Sesame Street instead of starring in this rubbish), go by boat to the resort being treated to a look at the property by Realtor Tony Giordano's son Jerry(Rick Farnsworth), obviously a pup in the business getting his feet wet. Along with these folks is architect Leslie(Leslie Cumming, whose character is a nympho)who might help Rose re-design the resort. The boat's captain is killed by The Lady in Black(Hildegard Knef, wearing her make-up and lip-stick extra thick)and a storm is brewing. The boat drives off by itself(..guided by the invisible power of The Lady in Black, I guess)with everyone stuck in the decrepit resort, which is in dire need of repairs. Most of the victims, before meeting their grisly fates are carried through a type of red wormhole whose vortex leads to another dimension(..perhaps a type of hell or something)where they are tortured by these fiends dressed in raggedy clothes with a crummy visage. One victim has her mouth sown before being hung upside down in a chimney, roasted as the others light the fireplace. One poor soul is tortured by harsh twistings of rope wrapped tightly around her flesh before being found hanging from the snout of a swordfish penetrating through her neck. One fellow is slowly suffocating as his veins bulge(..and bleed) and neck's blood vessels burst squirting in Hasselhoff's face! One fellow is crucified with nails hammered into his hands before being hung upside down over an open flame. Blair's pregnant victim becomes possessed with her hair standing on end speaking in another woman's voice. One is raped by this demonic man with a \"diseased\" mouth as the hellish hobos stand nearby gleefully cheering. The film, despite it's excesses, is mostly dull fodder for those who really wish to see the lowest point in the careers of Hasselhoff and Blair, who deserve better than this. Almost unbearable at times, building little-to-no suspense. Clumsy execution of the death sequences which look cheap and laughable. Sure some gore is okay, but most of the film shows victims after they've been run through the ringer. We do get a chance to see pregnant women(..who look exactly like stuntmen in costume with bad wigs) jumping out three story windows. Oh, and The Lady in Black's reflected face often pops up on inanimate objects for characters to see. Tommy has a little Sesame Street recorder which tapes The Lady in Black's mumbo jumbo chants, obviously used for later. For some reason, The Lady in Black likes to visit little Tommy. He's not at all scared of her, for Tommy's just too bored to show any expression on his face, much less fear. Need I say more? This one's a real stinker. Ugh.","A really very bad movie, with a very few good moments or qualities.It starts off with pregnant Linda Blair, who runs down a hallways to flee what might be monsters or people with pitchforks, I'm not sure. She jumps through a window and wakes up, and we see she is very pregnant. The degree to which she is pregnant varies widely throughout the movie.She and an annoying and possibly retarded little boy who I thought was her son travel to an abandoned hotel on an island. Italian horror directors find the most irritating little boys to put in their movies! On the island already are David Hasselhoff and his German-speaking virgin girlfriend (you know how Germans are said to love Hasselhoff...). He's taking photographs, and she's translating an esoteric German book about witches, I think.Also traveling to the island are an older couple who have purchased it, and a real estate agent, and a woman I thought was their daughter. Evidently she was an architect, and Linda Blair and the boy are the older couple's children. I guess they all traveled to the island together, but it really seemed like Linda and the boy were apart from the rest of them (maybe they were filmed separately).The hotel seems neat, certainly from the exteriors, but it isn't used to any great effect. An old woman in bad makeup and a black cloak keeps appearing to the boy and chants something in German sometimes, which he eventually records on his Sesame Street tape recorder.People start getting killed, either in their dreams, or sucked into hell or something. Some of these gore scenes are OK, but not enough to recommend the movie. Though the copy I watched stated it is uncut on the box cover, the death of one character whose veins explode really seems to have been cut. Much of the scene is showing another character's reaction shots, since we're not seeing anything ourselves. The creepiest scene is one in which a man or demon with a really messy-looking wound of a mouth rapes someone. He looked particularly nasty. There's a laughably and painfully bad scene in which Linda Blair is possessed. I wish if a horror movie is going to cast her, they would do something original with her role, and let her leave Exorcist behind her (except for the yearly horror conventions).In the weird, largely Italian, tradition of claiming to be a sequel to something it is unrelated to, this is also AKA La Casa 4 and Ghosthouse 2. That is, it is supposedly a sequel to Casa 3 - Ghosthouse, La (1988) - it's not (that's also a better movie than this one). La Casa 1 and two were The Evil Dead (1981) and Evil Dead II (1987) - again unrelated to Witchery and La Casa 3 (and much better than those). There's also a Casa 5, La (1990) AKA House 5, which seems to want to be a sequel to the fake La Casa series and the series House: House (1986) House II: The Second Story (1987), The Horror Show (1989) AKA House III, and House IV (1992). How's The Horror Show fit in there? It doesn't really, it claimed to be a sequel, thus requiring the real series entry to renumber itself to cause less (or more?) confusion. Oddly, The Horror Show is also AKA Horror House, and La Casa 5 is also AKA Horror House 2. Does your head hurt yet?","Dear Lord, I wrote a brief synopsis but I guess most of it got edited out. I have got to give it another try. Let me start out by saying. Have you every wanted to rent a horror movie so badly because it was so awful, you knew it would make you laugh your head off?, Well my friends, this is the movie. Don't get me wrong, I Love Linda Blair but this film is a riot from hell. As I stated in my previous notation, Annie Ross who plays Linda's Mother \"Rose\" in the film actually makes the film hilarious. She is convinced that this abandoned Motel out on an island is going to really be an investment, when they all arrive to view the place, Annie Ross says, \"This place is a wreck!, it's going to take a G-damn fortune to fix it up\". The driver of the boat that has to take the prospective buyers out to the Motel, says, \"You had better be ready here before sundown or I am leaving\". Annie says, \"Hard Nose Bastard\". Her husband in the film is a flirt from the work go, he makes pass after pass at the real estate sales person \"Linda\", who really is hot but she wouldn't give him the time of day, just tease the hell out of him. If you really want to see a horror movie that was done so poorly, please rent this one. I watched it over and over again because I needed a good laugh, and I get one every time I rent this film. Linda Blair plays a pregnant lady in the film and goes up to the rest room and sits on the side of the bathtub and begins to open up a bottle of pills, can't get the top off the pills and drops them into this bathtub filled with black water. Something unknown grabs her hand and pulls her through the drain (can you believe it), and she finds herself underground watching some kind of Satanic ritual, passes out and then miraculously wakes up on the floor of the bathroom on her back saying, \"My Baby, my Baby\". What was that all about?, I sure can't figure it out. Back to \"Rose\", she is disgusted to the point of no return and says to Linda Blair, \"Jane, give me one of your pills\", Linda can't find them and believes they must have dropped on the bathroom floor\", so Rose says, \"WELL THEN, They must still be there\"!!!! duh duh. Needless today, each member starts to disappear and of course Rose goes first, after they underground Satanic people tie her lips together, they hang her upside down in the fireplace. The remainder of the family,(unbeknownst to them, supposedly,), decide they are cold and want to build a fire. Rose gets microwaved to a crisp, because get this, eventually they start to smell a funny smell coming from the fireplace and then within seconds Rose's body drops almost all the way down in plain view, and when the family realizes it's Rose, all they say is, \"Oh, we've got to get out of here\". Can you believe it? Gosh what a gas. Rose is supposed to be Linda Blair's' Mother but Linda calls her \"Rose\" throughout the entire film. There are so many mistakes on this film you would laugh your rear off just counting the mistakes. I would guess that It may have cost the producers about 5,000 dollars to make the film and I would guess it made about 2,000 dollars. That's about 100.00 dollars for each actor. Oh man, I've got to go because I am laughing so hard right now, I can barely type. Go get this film, you've just got to. And if you like Linda Blair, there are about eight or nine movie of this same quality, let me know I'll email you the titles. One is called Grotesque. You've have to get this movie at a movie place that specializes in dull old crap. I'll tell you another film, that it about 10 times funnier than Witchery, \"A Woman Obsessed\", now this film you will totally pass out laughing at this one, it puts Witchery to shame. I love ya Linda, but ya got to make better choices.","Witchery (1988) * (out of 4)If you remember the whole saga of George Romero's DAWN OF THE DEAD being released in Italy under the title ZOMBI only to then have Lucio Fulci come along with ZOMBI 2 then you get the same type of thing here. THE EVIL DEAD was released in Italy as LA CASA and its sequel was LA CASA 2. Then Umberto Lenzi made a film called GHOSTHOUSE, which was released in Italy as LA CASA 3 even though it was in no way, shape or form connected to the Raimi series. Then, this film, was released as LA CASA 4 but again, no Raimi connection. Outside of Italy it was known as WITCHCRAFT, GHOSTHOUSE 2 and the current title listed above.The typical group of people arrive at your typical old hotel where there's the typical legends surrounding its curse. Apparently, many years ago, a pregnant woman committed suicide to keep from being burned alive as a witch. Years later a strange silent actress moved into the house and was apparently the last owner but soon our new guests start to fall victim to the curse. You have to hand it to the Italians when it comes to the horror genre but by 1988 their magic was running out and that's certainly true here even though they did manage to get Linda Blair and David Hasselhoff to appear in the film. This is your typical cult mess that features a little bit of gore but not enough to keep people interested. The story isn't any better or worse than a dozen other \"witchcraft\" tales we've seen from any country but the major problem here is the direction by Laurenti, which really shouldn't be called direction at all. The movie moves at a snails pace, none of the build ups are any good, there's no suspense and the worst sin is that the thing is just downright boring. It was rumored that Joe D'Amato did some of the direction as he and Laurenti would co-direct a movie a couple years later. Having seen dozens of D'Amato's work, I'd say he did have a hand in this as it has the same slow pace of many of his films. The one main reason to see the film is a creative death scene where a woman gets her lips sewn together before being hung upside down in a chimney to be burned alive. Blair actually gives a pretty good performance with ol' David getting to act as the boyfriend of a witchcraft specialist who refuses to put out for him or anyone.","\"Witchery\" might just be the most incoherent and lamentably scripted horror movie of the 80's but, luckily enough, it has a few compensating qualities like fantastic gore effects, an exhilarating musical score and some terrific casting choices. Honestly the screenplay doesn't make one iota of sense, but who cares when Linda Blair (with an exploded hairstyle) portrays yet another girl possessed by evil powers and David Hasselhof depicts a hunky photographer (who can't seem to get laid) in a movie that constantly features bloody voodoo, sewn-shut lips, upside down crucifixions, vicious burnings and an overused but genuinely creepy tune. Eight random people are gathered together on an abandoned vacation resort island off the coast of Massachusetts. The young couple is there to investigate the place's dark history; the dysfunctional family (with a pregnant Linda Blair even though nobody seems to bother about who the father is and what his whereabouts are) considers re-opening the hotel and the yummy female architect simply tagged along for casual sex. They're forced to stay the night in the ramshackle hotel and then suddenly the previous landlady  an aging actress or something who always dresses in black  starts taking them out in various engrossing ways. Everything is somehow related to the intro sequence showing a woman accused of witchery jump out of a window. Anyway, the plot is definitely of minor importance in an Italian horror franchise that started as an unofficial spin-off of \"The Evil Dead\". The atmosphere is occasionally unsettling and the make-up effects are undoubtedly the most superior element of the entire film. There's something supremely morbid and unsettling about staring at a defenseless woman hanging upside down a chimney and waiting to get fried.","\"Witchery\" is a decent little Euro-Trash horror yarn! David Hasselhoff is pretty damn funny in this one and sadly, he's one of the better actors. Linda Blair is downright terrible and the lady who plays Hoff's wife...she is hilariously bad! The plot of this film is ridiculous too. It's got some holes, which you can't help but notice, but it remains entertaining throughout.The gore in \"Witchery\" is freaking outstanding. I loved the part where the old bag gets \"sucked\" into the trash chute and ends up in the chimney to roast! And the part where the lady \"gets taken advantage of\" by the Devil was pretty damned disturbing. I'd say this one is a must for gorehounds.If you're looking for an overproduced, well-acted flick, look elsewhere. But if you like old-school style Italian sleaze and over the top gore, \"Witchery\" belongs on your shelf.I'm surprised by the low rating on here! What were you people expecting, \"The Exorcist?\" 7 out of 10, kids.","I can only assume that Linda Blair, David Hasselhoff and Hildegard Knef were not exactly at the peak of their careers when they agreed to act in a b-class Italian horror production with a cast of virtually unknown actors. When I think about great actors, David Hasselhoff doesn't really come to my mind, but delirious as it may sound, the Hoff actually does a decent job here and manages to stand out which, I guess, says a lot about the rest of the cast. David gives us a very likeable lead that seems to genuinely care about the rest of the characters and goes out of his way to save the day. As for Linda, her acting is decent and it is nice to see a horror icon. The enjoyment of seeing Blair in this flick mostly comes from the campiness of her character towards the last minutes, but the truth is that she is not really our lead. The final girl is portrayed by the unknown actress, Leslie Cumming, who wins the award for one of the most unexcited-looking characters in a horror flick. Seriously, I don't expect superb acting in a b-class horror flick, but this girl takes things to the next level, by lacking any kind of emotion and speaking in a monotonous tone of voice throughout the entire film.In \"Witchery\" the story goes something like this: A young woman named Leslie travels to a remote island to do some research for a book that she is writing, which is about the occult. Leslie's boyfriend, named Gary, travels with her to take some photos for the book, since Leslie wants to provide photographic evidence about the existence of witches and, according to some local folklore, there is a strange phenomena that occurs in the island, known as \"the witch's light\". Though Gary is a genuinely nice guy and he wants to help his girlfriend with her book, he also sees this trip as a perfect opportunity to finally get some action with his girlfriend (don't get your hopes up, Gary!) Though Leslie appears to be in her mid twenties, she is a virgin and very proud of it, since she believes that virginity equals knowledge or something like that. During their trip to the island, Leslie and Gary decide to stay at an abandoned hotel, which they are not supposed to do, since it's private property (unbeknownst to Gary, who was under the impression that they actually had a permit, as this is what Leslie informed him)On the other hand, we have a very heterogeneous group of people that also travel to the hotel where Leslie and Gary are staying. We have the Brooks family composed by a greedy matriarch named Rose, her creepy husband, Freddie, and their two children, Jane (Linda Blair) and Tommy. It should be mentioned that the mom and dad appear to be in their late fifties and the youngest son, Tommy, appears to be less than ten years old... unusual, but not impossible. Oh, also, Jane is pregnant, though the baby's father is not once mentioned during the entire film. Jane really loves her younger brother Tommy and cares for him at all times, while Rose, the mother, appears to be somewhat of a bitch towards her son and the rest of family... and towards everyone else, for that matter (but don't worry, folks, she'll suffer horribly). Why the hell are the Brooks going to the island? Because Rose wants to buy the old decaying hotel and turn it into a private club to make tons of money out of it. Joining the family, we have Linda Sullivan, a young, sex-crazed architect hired by Mrs. Brooks to assist them with the renovations and lastly, we have Tony Giordano, a goofy-looking real estate agent who is trying to convince Mrs. Brooks that buying the old hotel is the deal of the century.When the Brooks arrive to the hotel with the architect and the real estate agent, they don't hide their dismay when they find the young couple of squatters staying there. However, Gary manages to ease up the tension by explaining that they didn't mean to cause any harm and offers everyone some coffee. Believe it or not, this does the trick and everyone manages to get along with each other just fine... well, everyone except for Rose (did I already mention that she's a bitch?)Unknown to everyone staying at the hotel, the place is also inhabited by an old witch (played by German actress and singer, Hildegard Knef), who wears tons of make up and apparently smokes two packs of cigarettes a day, judging by the sound of her voice. This unnamed witch used her powers to cause certain events that brought all these people to the hotel at the same time. Besides using her powers to lure all these strangers into the hotel, the witch also kills the guy who drove everyone to the island by boat, preventing them from leaving, so in the end, it's no coincidence that these strangers find themselves living under the same roof. Now, what does the witch want? Eh... it's a bit confusing, but at some point it is revealed by one of the characters that, several years ago, the old witch was a actually a beautiful actress who starred in several films and was unable to cope with the idea of aging, so she retired from acting, because she didn't want to be seen anymore. From what I could understand in this convoluted mess, the witch needs to sacrifice certain type of people to complete a ritual that will allow her to be reborn through Jane's baby... or something.In lieu of a completely coherent story, \"Witchery\" provides a truckload of entertainment and features some gruesome and nicely done death scenes. Remember earlier when I said that Rose was a major bitch and that she was going to suffer a great deal? Well, this is what happens to her: at some point, Rose begins to rant and verbally abuse everyone, including her little son. In order to prevent things from escalating, her husband advises her to take a nap (though he is a bit creepy, I gotta give him credit for handling the situation with class). Rose agrees to lie down for a while, but before she gets to bed, she is sent to another dimension that takes place inside the house (we'll get to that later) and when she travels to this place, she is greeted by the witch's minions, a couple of demented centenarians, who sew her lips together, preventing her from being able to speak again (thanks, you guys!). As if this wasn't punishment enough, Rose is later jammed inside the chimney and...what do you know? Since the air is a little bit chilly, the colorful group of characters decide to gather around the chimney and light a fire, ignoring the fact that Rose is stuck in there, slowly burning to death, while everyone enjoys the heat (in a slightly humorous moment, Rose's husband comments that the pieces of wood that they used to light the fire smell \"funny\")Besides Rose's death scene, \"Witchery\" features some other scenes and moments that deserve an honorable mention... well, at least a regular mention. As I briefly mentioned before, some of the characters are randomly sent to another dimension, through a weird reddish vortex. We don't get an explanation about this realm, but we do get to see that the witch (also known as \"the lady in black\") seems to be the ruler of this place, filled with her weird servants. Are we supposed to simply assume that this realm is some kind of in-between territory between Hell and Earth? I'm not so sure, but I do know that, while the scenes that take place in this odd parallel universe are somewhat creepy, they could have made an effort to make it look less like some kind of barnyard from hell. Oh, and also, the witch's minions are weird as hell, they laugh maniacally all the time, they taunt their victims and they carry a doll (don't expect an explanation).Finally, our beloved Linda Blair finds herself playing a possessed girl again, but this time, her portrayal and the reasons behind it are rather cheesy, unlike the genuinely scary scenes from \"The Exorcist\". In this case, Jane is possessed by the witch and when she talks, she mimics the words, while we actually hear Hildegard Knef's voice. Also, for some reason, while being possessed, Linda's hairstyle changes and it looks like she had just auditioned for a heavy metal music video or something. Not sure why a witch possessing another person's body would actually take the time to change her hairstyle, but I've never found myself in this situation, so maybe it's more common than I think. At this point, Jane/the witch confronts the remaining characters that managed to survive this deadly mess and delivers a brief monologue, in which she reveals herself as the witch and explains the reasons behind her actions, before attempting to kill the sole survivors. However, our beloved hero, Gary, grabs a voice recorder in which Tommy, Jane's little brother, recorded himself repeatedly saying \"I love you, Jane\". This seems to do the trick, since Jane stops being possessed for, like, fifteen seconds, but in order to prevent the evil from taking over herself again, she jumps off the window and dies. Unfortunately, this clearly doesn't give us a happy ending: first of all, Jane, a nice gal, had to sacrifice her life and then, Gary, our beloved hero, dies. The sole survivors end up being only Tommy and the insultingly dull Leslie, who was, at some point, sent to the parallel dimension and raped by a skinny guy with sewn lips, just like Rose. In the end, we see Leslie lying in a hospital bed, where she is informed by a nurse that Tommy is fine and that she doesn't have to worry because her baby is fine, which prompts Leslie to look at the camera and say \"My baby?!\" with an odd expression of horror. Priceless!I highly recommend this flick to anyone who wants pure entertainment, gruesome deaths, a decent amount of ridiculousness that doesn't necessarily turn the movie into a comedy, some genuinely creepy moments and a plot that fails to provide enough logic.","Nothing says 80s like David Hasselhoff and Linda Blair. The film opens with an event that took place in the past of a pregnant woman being hunted down on an island hotel. Leslie (Leslie Cumming) is a virgin doing paranormal studies at this site along with her frustrated photographer boyfriend Hasselhoff. As the hotel is for sale a group of rich people, including the expected Linda Blair come to the location...all of which is an elaborated plan by a dead witch who wants to kill off a few in the group. The group is stuck in the house during a storm, but Tom Bodett keeps the light on for them, so how scary can it be?Yes. Totally 80's. Acting par on a Hassellhoff scale. Made for TV type sound track. Almost campy looking back at it.Parental guide: rape. nudity (Leslie Cumming)"],"review-user":["Bezenby","Tikkin","ksf-2","eric-144","shaneschoeppner1","dragon_gurl_1976","BA_Harrison","Vomitron_G","brandonsites1981","poolandrews","capkronos","moonspinner55","trvwatson","Woodyanders","ParaGraph","jhpstrydom","The_True_Meller","Scarecrow-88","FieCrier","sambillings2003","Michael_Elliott","Coventry","coldwaterpdh","Milo-Jeeder","nogodnomasters"],"review-date":["8 October 2010","1 April 2006","5 July 2015","4 April 1999","13 March 2008","16 February 2005","26 August 2009","27 May 2011","30 May 2002","7 August 2005","28 March 2009","20 January 2001","15 March 2003","31 May 2007","18 June 1999","3 September 2012","9 February 2010","12 July 2008","31 March 2005","31 May 2004","4 October 2009","23 June 2008","14 February 2008","1 May 2018","27 April 2018"],"review-rating":["7","6","6","7","10","10","4","4","7","4","3","8","7","4","1","3","4","7","6","6"],"review-title":[" The Hoff does a spaghetti poltergeist\n"," Excellent setting\n"," an Italian horror flick.... with the Hasselhoff..... not too bad\n"," creepy gory not for everybody\n"," Linda Blair reminds us why she is a horror icon in this horrifying tale of witchcraft and revenge.\n"," I loved it\n"," JUST about worth it for the gore. Possibly.\n"," Witchcraft AKA La Casa 4 AKA Witchery AKA Evil Encounters AKA Ghosthouse 2 AKA The Haunted House\n"," * * out of 4.\n"," So bad it's good supernatural horror, I quite liked it.\n"," Witchery - A real mixed bag.\n"," When Linda Blair pours on the devilish charm, she is positively regal\n"," low budget gore feast\n"," The Hoff in a trashy Italian horror flick? Now, that's truly scary!\n"," Oh, my God!\n"," Better than I thought it would be.\n"," Bad Black-Clad Mutha: One - People: Zero\n"," Witchcraft(Evil Encounters)\n"," Don't Go on the Island, Don't Go in the Hotel, Don't Watch This Movie; bad acting and directing all around\n"," WITCHERY LINDA BLAIR.....OH I DON'T BELIEVE IT.\n"," Bad No Matter What Title It Has\n"," The 80's! Witches! Linda Blair and David Hasselhof! What are you waiting for?\n"," Why the horrible rating???\n"," Fun, creepy and a bit messy, too.\n"," Lady in Black\n"]}