{"review-url":["http://www.imdb.com/title/tt0246628/reviews"],"review-text":["First they came for the Communists, and I didn't speak up, because I wasn't a Communist. Then they came for the Jews, and I didn't speak up, because I wasn't a Jew. Then they came for the Catholics, and I didn't speak up, because I was a Protestant. Then they came for me, and by that time there was no one left to speak up for me.Attributed to Rev. Martin Niemoller, 1945When faced with intolerance or injustice, the easiest thing to do is nothing - speak up and you risk becoming an object of scorn.  But when does enough become too much?  Global anti-Semitic sentiments allowed Hitler's genocidal policies to thrive, and equal doses of fear-mongering and ignorance made it possible for the anti-Communist purges of McCarthyism to destroy thousands of peoples' lives.  Inaction makes one no less culpable.Lawrence Newman is a chameleon of a man: quiet and nondescript he blends seamlessly with his surroundings.   Lawrence doesn't like to get involved - when he witnesses an attack on a young woman, he tells no one and goes about his business.  His world spirals into chaos when he buys a pair of glasses, and is mistaken for one of \"them.\" Lawrence's view of the world and its view of him is forever altered. While the subject matter of this film is not new, its presentation is definitely unique.  It is much easier to understand the irrational nature of prejudice, when placed within a certain context - Lawrence is more concerned with the assumptions that he is Jewish, than he is with the views of his attackers.  He believes that if he corrects this \"oversight\" that everything will be all right, not realizing that logic and prejudice never go hand in hand.  Whether playing a schemer (the only thing I liked about \"Fargo\") or a down home nice guy sheriff, William H. Macy's roles are linked by a common thread -his characters share a subtle, deliberate countenance that gives them substance.   Macy nails Lawrence down to the smallest detail, and says more with a furtive glance or tremble in his voice than a page of dialogue.  By showing, rather than telling, Lawrence is able to share his fear and bewilderment with the viewer.  The supporting cast brings the story together.Laura Dern is compelling as Gerty, Lawrence's bombshell wife with a past. Trailer park rough, yet other worldly wise, she has also felt the wrath of prejudice as the result of \"a mistake\" and unwittingly exacerbates Lawrence's situation.  Michael Lee Aday (aka \"Meatloaf\") is frightening as Fred, the prototypical redneck next door, equal parts ignorance and venom, rallying neighbours to his virulent cause.   In the midst of the chaos is Finklestein (David Paymer), the focus of the aggression, and the voice of reason that raises the important questions.  Paymer's even handed portrayal keeps Finklestein from becoming a stereotype or someone whose sole purpose is to engender sympathy, making his one of the strongest performances in the film.The tight editing and close-cropped cinematography make for a clean picture with few distractions, and mixes an air of claustrophobia in with the small town USA feel - it is simultaneously comforting and disturbing. The deliberate use of harsh two-tone lighting to accentuate the malevolent aspects of the piece and the carefully scored soundtrack, are powerful without being overwhelming.   Finally, the set and costume designs recreate the feel of the era, an essential component in the film's message.\"Focus'\" unconventional approach in dealing with prejudice is reason enough to recommend this film.  Just consider the excellent story, solid acting and look of the film as added bonuses.","This movie packs a punch. There are a few every now and then that make me think deeply, and disturb me a lot. I could see myself in this same predicament - passively allowing things to happen around me, not standing up for the right and decent thing, just trying to avoid trouble. How often do we avoid making waves or sticking our necks out? How often does our inaction condone the evil actions of others. We would never join them, we tell ourselves, we recognize that what they are doing is bad, but do we do anything about it? Lawrence Newman (William H. Macey) is a low-key, nerdy office worker who has paid off his home in Brooklyn, NY in the waning days of World War II. He rarely gets engaged in what is going on around him, has never married, rarely socializes, just goes to work and cares for his invalid mother. Then a series of events in his very \"white\" little neighborhood pull him out of his complacent shell into a maelstrom of events. It starts as he witness from his bedroom window the rape of a Puerto Rican girl by the son of his neighbor. Soon after he gets glasses because of poor vision. As he is now better able to see, he becomes less able to deal with the circumstances of his life. The one bright spot is a new love in his life, and he marries, hoping to continue on in his normalcy. Then the virulent anti-semitism on that street catches him, despite his credentials as a Presbyterian WASP. As things spiral further out of control, he discovers he must make an important decision - does he take a stand or does he simply go away.I cannot how anybody can view this movie without being affected and having to think very much about themselves and what they really stand for. Post war anti-semitism is the setting here, but there is injustice at all times and in all places. It is for the individual to decide where he or she stands.","Most people attending this film will have no idea of the great novel by Arthur Miller that is the basis of it. It's a novel that should be read by more people to see how prejudice affects and alters peoples lives.At the beginning, Lawrence Newman is an ordinary man. The eyeglasses his boss makes him get change everything he has worked for and his whole world collapses around him, little by little. There couldn't have been an actor better suited to bring this intelligent performance to the screen than William H. Macy. Not only is he a talented stage and screen actor, but he projects honesty behind every character he plays. He is an everyday man caught in his own insecurities. His anxiety intensifies when he takes a stand and walks out of his job. Suddenly, he has to confront the issues he has tried to avoid all his middle class existence in the Brooklyn of the 40s. Is he Jewish, is he not? The cinematography in this brilliant and atmospheric film, directed with sure hand by Neil Slavin, kept reminding me of some Edward Hopper's paintings, especially a sequence at the beginning of the film when Newman steps outside a building and the night shot when he and his wife are being followed with long black shadows behind the couple, menacing and anticipating the confrontation with the bullies. Laura Dern, David Paymer, and especially Meat Loaf, who infuses incredible depth to the bully-next-door, are excellent, but they all pale in comparison with the stellar turn of William H. Macy (H must stand for HONEST..) If you haven't read the book, I would sincerely recommend it because no one has written more truly and convincingly than Arthur Miller has.","For many, perhaps Arthur Miller is most famous for his 4 1/2 years married to Marilyn Monroe. For me, it is his Death of a Salesman for which I did a lengthy report as a college assignment in the mid-60s. I had never heard of Focus, and it is a movie that few have seen. An interesting premise, well-executed. His WASP-ish everyman character in 1943 (during the war) comes under attack after he gets a pair of new eyeglasses, which apparently makes him \"look Jewish.\" His Americanism is questioned, his garbage is overturned, is forced to quit his job, he gets thrown out of a union rally when he fails to stand up and clap, he and his wife get roughed up by thugs on the street at night. The film is an examination of our tolerance for prejudicial treatment of others, then our own reaction towards such treatment.The critic Ebert has a fine and complete review. William Macy, David Paymer, Laura Dern, and Meat Loaf Aday are all fine in their roles. A worthwhile 106 minutes of thought-provoking entertainment. The DVD, which was a free loan from my local library, has a sharp picture and good use of DD 5.1 sound. There is a very interesting extra which includes Arthur Miller discussing his book and the movie.","Others' main criticism of this film--namely that Macy suddenly looks Jewish upon donning his glasses--is misplaced. The glasses are just the little bit of change needed to CONVINCE others he's a Jew. The scene in which he says to his boss, (paraphrasing) \"but you KNOW what my background is,\" along with another discussion with his mother, suggests that he's had to fight this same assumption in the past. The glasses now make him look just Jewish enough to \"confirm\" his neighbors' and co-workers' existing suspicions. Then there is his new wife's large nose and taste for loud clothes, which OF COURSE means she's Jewish. The whole point of the film is how those little stereotypical nothings become the entire basis for judging others. If he has a lisp, he must be gay. If he has long hair, he smokes dope. If he's Hispanic, he's got a knife...and if he has round black glasses and he's slight of build, he must be Jewish. Those statements all sound equally (im)plausible to me. If the conclusion people were jumping to in Focus was reasonable, the whole point of the story would be lost.","In 1947, two films, \"Crossfire\" and \"Gentlemen's Agreement,\" opened a queasy Hollywood's examination of anti-Semitism in our society. \"Gentlemen's Agreement\" dealt with religious bigotry at the level of high, or at least upper middle-class, America while \"Crossfire\" exposed the brutal violence that always accompanies irrational hatred and bias. Both films made, and continue to make, an impression.Overall, Hollywood has left anti-Semitism in the U.S. pretty much alone. That many Jews have found success at both ends of the movie camera is well-known. That some of those Jews, many with Anglicized names, particularly feared the sting of the anti-communist fervor of the HUAC and Mc Carthy era, is a still disturbing and lasting legacy of a difficult time in our history. The controversy several years ago about the special Oscar for Elia Kazan brought the issue to the attention of millions ignorant of the heyday of Hollywood's involvement with the anti-communist campaign. Kazan, incidentally, directed \"Gentlemen's Agreement.\"\"Focus,\" which is showing in remarkably few theaters (only two in Manhattan and I wouldn't bet on a long run) both exaggerates and encapsulates a strain of anti-Semitism in New York City during the Second World War that, even today, few who recall it say much about its pervasiveness.The War Department was discomfited to learn through surveys that a surprising minority of servicemen thought the war was being fought for Jewish interests or that actually it had been caused by Jews. These beliefs, possibly spawned by the virulent rhetoric of Father Coughlin, the near treasonous utterances of Charles Lindbergh and the organized pro-Nazi rallies of the Bund (the U.S. arm of the Nazi Party), were more widespread than most accounts of the war recognize let alone explore.\"Focus\" takes place in a Brooklyn neighborhood of seeming homogeneity marred only by the presence of Finkelstein, the candy store proprietor on the corner. To insure that the audience understands the depth of the community's fear of Jews, quick shots of his unmistakably \"frum\" (Orthodox) relatives from the Lower East Side are presented several times.The cohort of organized thugs who harass both the nerdy-with-glasses-mistaken-as-a-Jew guy, William H. Macy, and his glamorous-in-a-forties-way, also mistaken as Jewish, bride, Laura Dern, didn't exist in New York City. Anti-semitic assaults occurred but they were sporadic and involved local youths, not followers of a priest who in the film is the spitting image of Father Coughlin back from hell.What is so chilling is that the married couple's abhorrence of the growing and organized anti-Semitic harassment is not matched by any introspection as to the baseness of their own feelings about Jews. Both Mr. Macy and Ms. Dern are extraordinary as actors in a small, local drama that recasts their lives without, perhaps, causing them to reshape their own bigoted views. Or do they change?This is a moving drama that invites exploration of part of the reality of World War II on the Home Front not covered in the continuing outpouring of Greatest Generation memoirs. When available for rental or purchase it should secure the much wider audience it deserves.","The essential message - one which Miller would have surely intended after seeing Vichy war crimes trials - is that hatred of somebody without rational basis is a waste of life.  Meat Loaf's character, Fred, has known Lawrence for many years, and yet when the time comes, at the bidding of his fanatical supporters, he allows them to attack a man who is not part of their \"target\" group.  For me, this is the crucial message - it doesn't matter what Lawrence and his wife do from this point onwards - they are marked, and have chance to save themselves by using reason.  Animal aggression and anger have blinded Fred's Union thugs to reality.A friend of mine suggested I should see \"The Wave\" to study how irrational hatred and evil ideology can take over people without them realising it.  I once conducted an experiment in a role-playing game, and was shocked to see how normal and level-headed people welcomed the creation of an oppressive police state - which would ultimate threaten them all - because it crept in in stages.Fred is the start, his LA friends and preacher idol are the catalyst which pushes his neighbours over the edge into violence without stopping to think that what they are doing in wrong.The relationship between Lawrence and Finkelstein, the Jewish shopkeeper is a fascinating one, because Lawrence misses the point almost until the end: if the bigots force Finkelstein out, where is he to go?  If his family have fled the Nazis, what an irony to be tormented again in the land of \"freedom\".That big poster (it's a fairly famous propaganda piece) about American families enjoying the highest standard of living in the world is a very important detail.  When you see this film, watch for the grafitti on the subway train, and all the little posters.  The message lurks there too.This movie should be on the curriculum of every school, especially in our time when baseless hatred is being promoted so widely by \"reasonable\" people who are just extremists in thin disguises.","One of Arthur Miller's finest works, Focus, comes to the screen and while there was a lot to like about the movie, some of it seemed like it was almost unreal (though I'm not sure if that's in a good or bad way). \nWilliam H. Macy, great as always, plays Lawrence Newman, average Joe and good guy in Brooklyn, NY in the early 1940's who finds he needs a new pair of specs.  Unfortunately, his choice of glasses makes him appear to be, well, Jewish, as this seems to his mother from the start.  Lawrence tries to ignore the ignorance and bigotry in his neighborhood against the Jewish people, but with a string of events involving his neighbors (Meat Loaf, David Paymer), and a new girlfriend (Laura Dern in one of her best performances) who knows what trouble Lawrence is in, push him into the conflict of his life.Often, Focus, delivers a poignant, startling and smart story in showing a character with so much at stake it is making him insane.  Macy and the rest of the cast are so close to perfect and if only for them make this a must see.  Not to dissapoint the fans of Miller's book, I suppose, but if it does then that is just another flaw.  B+","This movie tells the story of prejudice against jews in New York City, during World War II. It's great in the fact that I never knew such prejudice existed in our own country, and tells this story well. I would have liked to give this movie 4 stars, the acting was incredible all the way around. The storyline, however, kinda went nowhere, and the ending left a lot to be said. Since this is a book adaptation, which I haven't read, but I almost think they left out the last chapter. If there was some kind of resolution at the end, this would be an even better, fantastic movie. Should you see this movie? Great performances and a driving story, but just nothing left at the end. 10-21-02","If good intentions were enough to produce a good film, I would have rated the turgid, ponderous, obvious \"Focus\" a bit higher than 4. Macy does his best, but as an earlier poster commented, Miller's little parable asks us to suspend disbelief too often. Perhaps the novel gives us a bit more background on Newman, so we can understand how someone who is obviously not without intelligence could be so dense in perceiving the attitudes of those around him. I agree with another reviewer that if one is unaware of how bigoted average citizens were in America during this time period, then this movie might be an eye-opener. I grew up in the fifties, and the \"good\" pastors of my Lutheran church found nothing wrong with having the church picnic at a commercial beach, whose sign prominently indicated that no Jews or blacks would be admitted. It is difficult for young people today to understand that this was the norm, and not just in the South. As late as 1964, when I graduated from a somewhat racially integrated (but sexually segregated) public high school in Baltimore, my black classmates could not attend the traditional \"father and son banquet,\" as it was held at a facility which did not admit blacks. Sadly, it was an establishment owned by a Jewish family. The subject matter of \"Focus\" is important, and we should never forget, despite the lingering signs of racism in modern America, how truly repulsive the attitudes of that previous generation were.(The \"greatest generation,\" indeed). So, perhaps this film is somewhat valuable in countering the recent wave of sentimental crap about the forties from the likes of Steven Spielberg and Tom Brokow. But in the end, as in \"Far From Heaven,\" the filmmakers' good intentions are undermined by having a protagonist so ridiculously oblivious to the social conventions of their time.","I had the unlucky experience of stumbling upon a preview for this movie and thought it might be interesting. I am a fan of the two main actors, and I even find Meatloaf to be oddly appealing, but that couldn't compensate for the droning plot of this movie. This movie attempts to make social comments and be artfully intelligent. I am sure the audience gets the sociological message clearly, but has to suffer in the process. Personally, no matter how bad the movie is, I can't stop it in the middle. Something drives me to finish the worst of movies, but I often regret it. This is one of those...","First I must admit that I have not read the story on which this movie is based. Secondly I have to confess that I am always highly suspicious of movies which depict actions that are supposed to have happened more than fifteen years before production and try to create an authentic setting.That much said, I would like to explain why this film disappointed me so deeply. I presume the aim of the story consists in denouncing the outrageous absurdity of racism and prejudice and not in setting up the period piece this movies tries to be. In the center of this story should be a pair of glasses generating prejudice (hence the title focus)! Instead we have performances of brilliant acting talents such as Macy (at one time absurdly, \"artfully\" distorted like a comic book character), Paymer, Dern and Meat Loaf, clean sets with theme park quality, flawless fotography, brilliant colours. Everybody is striving to give his or her best  and it all confounds the issue. Ambition and ultimately vanity prevailed and killed the story to a large extent. In my opinion the whole approach to the story was a wrong one.","I had never heard of this film until it came to DVD. I was immediately intrigued by everything about it: the actors, the title, the cover, and especially the author. Arthur Miller, you can't go wrong with him, can you? Yep. I haven't read the novel, but I'm going to guess it was a lot better than the film. I had high hopes for this movie. I love Macy and Dern, and it looked interesting. Unfortunately, this film never really rises above cookie-cutter messages about racism and bigotry. If you've never seen any other films that deal with this subject, or if you never knew that America was founded on bigotry, then maybe this film will wow you. Others will probably find it predictable, stale, and overall bland.","What can be said about judging books by their covers can also be said of judging films by their posters. In the case of \"Focus\" I was drawn as much to its poster, a brilliant B&W photograph, as for its star, William H. Macy (featured prominently in the poster). The poster was reminiscent of Straw Dogs, and from that I expected a film of the same quality, a film that exercised the same subtlety and control, undoubtedly building to a similar violent climax (punctuated by the calm that preceded). But from the first scene of the film, a dream sequence that depicted a carousel (an overt metaphor for the cycle of hate that spins out of control - not unlike the film itself) I knew that my expectations would be disappointed. The sequence, aside from being gratuitous, wasn't particularly interesting - visually - and would have been better used as the background for the opening credits. Instead, the opening credits interrupt the film shortly thereafter. The dream, however, never ends, and we, the audience, are propelled deeper and deeper into a nightmare of shoddy filmmaking. There were moments when I hoped the film would improve, but ultimately the various talents that went into this film were wasted.","Let me first start with the obvious: antisemitism has been a serious problem throughout history, present in many societies and causing the deaths of million of Jews. That said, the problem with this movie is that it views the United States - probably the most welcoming society ever to Jews outside of Israel - as a not very different place from Nazi Germany. Set in 1943, the movie is about a man (William H. Macy) who gets confused with a Jew after he starts wearing glasses!. A number of very nasty things happen to him after that (he loses his job and he is unable to find a new one, his neighbors shunned him, all ending up in a violent confrontation). From one of Arthur Miller's self pitying, patronizing novels, the sort that gave liberalism a bad name.","Arthur Miller has always been known as one of America's great playwrights for works such as \"Death of a Salesman\" and \"The Crucible\". \"Focus\" is one of his lesser known plays brought to the silver screen. However, knowing what a great playwright Arthur Miller is, I doubt that his original play was very much like the movie. The movie comes across as empty and formulaic, with William H. Macy as a non-Jew mistaken for a Jew by anti-Semitic neighbors in WWII Brooklyn. Don't get me wrong: the acting is OK, and I presume that the people behind this movie were probably trying to make a point about racism, but the movie just doesn't work. Macy, Laura Dern and David Paymer just can't create an effective story with the material here.","That just about sums it up. Macy's fine acting saves an otherwise poorly scripted film about a very serious subject. The idea that merely by putting-on or taking-off a pair of spectacles can change a person's life in the extreme, is frankly unbelievable. I mean if it did happen surely you would find a pair of spectacles that were less 'obvious'? Laura Dern looked particularly uncomfortable as a 'Jewish' looking non-Jew and the idea that a sexy blonde who drew attention and wolf-whistles wherever she went would fall for Macy is preposterous. It was as dumb a suggestion as Macy's other good looker falling for him in 'The Cooler'. Come on Hollywood, get your act together with a little more realism. Finally Meatloaf did good as the bigot next door.","This movie, which deals with racism, is about a hiring manager who only discovers he is myopic when his boss berates him for hiring a foreigner going by the name of \"Pan\" who was really \"Paninsky\". He is told to shape up and get some glasses, which he does, small horn-rimmed frames that make him look like a ringer for Karl Liebknecht (the leader of the German Social Democratic Party during the first World War). The amazing thing is that even after he loses his job, and realizes that he doesn't exactly make the same impression he used to, he never once thinks of taking off the new pair of glasses. He even wears them to a fascist meeting that he attends at the recommendation of his Jewish wife (who swears she's not Jewish) where he is quickly beaten up. At the end he is forced by circumstances to admit that there is no difference between him and the others who share his situation (the Jews). Ultimately, in seeking police protection from the fascists for himself, his wife, and his Jewish neighbors, he identifies himself with the Jews, a turnabout from his previous denials that he is not Jewish. Definitely an original movie with good acting, but one which asks us to suspend belief just a little too often, and yet seems strangely relevant to the times we are living in.","\"Focus\" tells of a bland and nonconfrontational man (Macy) who buys a pair of eye glasses which make him look Jewish after which be becomes the object of antisemitic hostility, etc, blaa, blaa. A kind of lame attempt at revealing antisemitism in America during WWII, the film features solid performances by Macy and Dern though no chemistry exists between them...or anywhere else in the film. Generic, staged, and pale in comparison to many better films about hatred in American, \"Focus\" is marginal entertainment at best and a very meager history lesson. Passable stuff.","Did the other reviewers watch the same movie I did?  This was poorly written, poorly acted, and just overall boring.  I made it well past the halfway point in the movie and then just gave up.  I can't possibly imagine an ending that would have made the rest of the movie worthwhile.  Don't waste your time with this dog.  Seriously.",". . . by Marilyn Monroe's most messed-up hubbie, Arthur Miller. The themes of FOCUS are a more intensely personal form of psychotherapy for Miller than for most of America's screenwriters, and the \"making of\" shows Arthur was still johnny-on-the-spot during location filming, even at the advanced age of 86. All of the angst of the teenage Miller are reflected in FOCUS, which he did not spew out onto paper until he was 30. After the incredibly long wait of 56 years to see this story move from script to screen, the nearly-nonogenarian Art finally got to recreate the scary America teen boy Art saw upon arrival in Ann Arbor, MI in the 1930s, when it was the center American anti-Semitism. On those days the U of M's ferrets were not out on the gridiron, the AM radio was rife with the infamous Father Coughlan, dubbed then as \"Hitler's Priest\" (and thinly disguised as \"Father Crighton\" in FOCUS). A stone's throw away from Coughlan's Royal Oak Shrine of the Little Flower and U of M's Ferret Bowl was Henry Ford's River Rouge world HQ in Dearborn, where Ford published his widely-circulated anti-Semitic rag (and Ford henchman Harry Bennett made sure everyone read it on their five minute lunch break--literally at gunpoint). A Jewish kid from New York might have found more friends at Gestapo headquarters than Miller was likely to have found in Michigan in the 1930s. Coupled with the traumatic memories of his father's Depression-era business failures, it is a wonder that Miller had enough drive to give us all such happy pieces of Americana as DEATH OF A SALESMAN, THE CRUCIBLE, and THE MISFITS (the flick that was the death of Clark Gable, by the way), and bamboozle Marilyn into thinking that she would be happier with him than with Mr. Coffee!","I don't know if it was the directors intent to make sure the sky was almost always sunny and beautiful in this film. Perhaps that is the romantic image many Americans have of the time this film is set, as it is in the middle of the War, Macy has returned from the war (His neighbor asks \"Hey, is it true you got a Fritz over there?\") and is trying to get on with his life but one day he gets a new pair of glasses (hence the name) and sees things clearly as the surrounding situation reveals itself to be one of rabid anti-semitism, and Macy and Dern could wrapped up in it. Funny how neither is Jewish in this film but the accusation is made. Also it is historically accurate, as the labor union Democrats of this time wrapped themselves in the flags of America and God. Macy is continually pestered to come to the \"meeting\". His presence brings unexpected results.Applying this time frame to today is a study in contrast. In 2005, has undergone a complete reversal, with average citizens who have taken patriotism and religion as their unifier supporting the Republican Party and viewing organized labor as part of left-wing 'unpatriotic' America.A great picture to watch, if you care to see the friendly, timid and meek Macy (played beautifully by him) get caught in the carnage of race and hate in the mid 40's in NYC.A tough, emotionally charged film.","The first reviewer is right - In this movie we see ourselves, snuggling up to the majority, being agreeable, trying to stay out of trouble, just trying to live our lives, and we see how easily these very human traits, so fundamental to the functioning of society, can lead us to become complicit in a great evil.The story is set during World War II, with the radio, newspapers and movies reminding us of Hitler's attacks on Jews to underscore the irony of the same kind of violent anti-semitism taking place in America. At times that seemed a little heavy-handed to me.It feels more like a play than a movie, but it's so thought-provoking that such quibbles mean little. Perhaps less trivial is the fact that the entire plot hinges one one little fact that struck me as rather implausible. Larry has lived an uneventful life until middle age; yet all it takes is his beginning to wear a pair of spectacles for everyone - EVERYONE - to, at the first glance, take him for a Jew. I willingly suspended disbelief because the plot kept me moving forward, but the implausibility did bother me throughout the film. (And, quite frankly, I didn't understand why his wife was also taken for a Jew. Larry seemed to think so because her name was \"Hart.\" And later when he married her, I don't know why his neighbours assumed she was Jewish.) For the first part of the film I wondered if there were going to be elements of fantasy. Larry's unassumingness seemed exaggerated, almost to the point of the grotesque. Why not call the police on seeing the rape, even if the attacker was a neighbour? And I thought the lighting seemed to suggest something slightly unreal - the red of the houses seemed too red, Gertrude's entrance seemed deliberately overlit, generally the colours were almost crayon-like in their intensity.In the credits I see that it was filmed on Campbell Avenue and Wallace Avenue in Toronto, so I plan to drive down there (near Bloor & Dufferin) today to check out the colours. Really :) It was good to be reminded that the clergy at that time were often leading the evil of racism. (Remember how the pope refused to speak out against Hitler, seeking only to get protection for the Church? It was the same pope, by the way, who, when Rome was about to be liberated by American troops, requested that the first soldiers to enter the city not be black. Check your history.) I don't recall ever hearing of this movie before. That's a shame. It certainly is of great interest to every thinking person, to everyone interested in American history or racism; it's one of the clearest illustrations I've ever seen of Bertrand Russell's dictum, \"Do not go with a crowd to do evil.\"","I'm a huge fan of legendary director Elia Kazan . His movies often deal with people trying to overcome their weaknesses. Be it obsessive love in 'Splendor In the Grass, poverty in \"A tree Grows in Brooklyn\" or racism in \"Gentlemen's Agreement.\" While looking for other movies made by Kazan, I stumbled across a movie that was based on a novel by Arthur Miller. The movie called \"Focus\" stars William H.Macy (who happens to be one of my favorite actors) and Laura Dern. It deals with anti-Semitism in a very realistic way. Macy's character seems to go along with the bigots in his neighborhood and on his job, until it affects him personally. That's the key here... the reason he acted wasn't because he knew it was wrong and he wanted to take a stand, he acted because he was now considered an outsider, and he began to experience the same looks, the same remarks, and the same brutally that Mr. Finklestein (David Pamyers)experienced .The movie is very well written and well acted. Meat Loaf does a awesome job of playing a dirt bag! Both Macy and Dern's performances are outstanding! It's easier in life to go along with, instead of going against. Sometimes in order for people to take a stand things have to impact their lives, or the lives of their loved ones...Only then will some find their moral compass.","This movie impressed me. What I liked most was the performance of William H. Macy, who plays a square white guy, living the normal life in a mediocre job, sharing a house with his mom in a nice suburb. Everything changes when he starts to wear glasses which allegedly make him look Jewish. It's by no means the message against prejudice and injustice alone that makes this movie worth watching, it's particularly the way the movie shows Newmans reactions to them. At first he is furious, he can't believe what's happening to him when he loses his job. Then he tries to ignore the signs, acting oblivious to the way people react to his appearance. He even tries to join the same group of men that is harassing him, in a desperate attempt to turn the tide. All this guy wants is to live an easy life, he doesn't want to be a part of what's happening to him, but eventually he realises he can't keep his eyes shut an he has to act. The fact that all trouble starts by putting on some glasses just shows how randomly victims of prejudice and hatred are picked. It doesn't matter who or what you are or what you do,  if they choose to hate you, they will."],"review-user":["Shiva-11","osgrath","jotix100","TxMike","pzilliox","lawprof","michaeljacobs","MisterWhiplash","WaltDinLV","Jennel2","jive9","manuel-pestalozzi","mysticzine","mwpm","Andy-296","lee_eisenberg","aliasme","Don Muvo","=G=","kcbob","tadpole-596-918256","odanny","imdbFocus-2-ge_moore","prettybutterfly","san_strik"],"review-date":["12 November 2001","29 December 2002","1 December 2001","20 June 2003","13 July 2006","19 November 2001","20 November 2003","11 November 2001","21 October 2002","22 June 2003","7 July 2003","13 March 2003","26 May 2002","17 December 2013","18 January 2007","10 September 2006","13 June 2005","10 June 2002","29 March 2002","22 March 2002","21 February 2013","25 December 2005","17 April 2005","13 September 2006","19 February 2004"],"review-rating":["7","10","10","8","10","7","4","2","3","5","1","4","6","6","6","3","8","8","8","7"],"review-title":[" Brings clarity to a fuzzy subject\n"," Compelling and disturbing\n"," What a difference a pair of eyeglasses make...\n"," Fine film of Arthur Miller novel.\n"," It's not just about the glasses.\n"," American Anti-Semitism Confronted in \"Focus\"\n"," The message is timeless - baseless hatred is stupid\n"," Terrific Performances and a finely tuned story\n"," Ending leaves you wanting more\n"," Good Intentions...But Poor Execution\n"," nearly unwatchable\n"," Issue put out of focus by vanity\n"," High Hopes, Low deliverance\n"," Less Is More\n"," Poor movie on a serious subject\n"," almost totally empty\n"," Macy Makes it Worth Watching\n"," Why doesn't he just take off the glasses?\n"," Excellent mediocrity\n"," I couldn't even finish this movie\n"," Fear and Loathing ferreted out back home . . .\n"," Outstanding\n"," Thoughtful\n"," The movie is very well written and well acted.\n"," eyes wide shut\n"]}