{"review-url":["http://www.imdb.com/title/tt0224102/reviews"],"review-text":["A sequel in name only, we have another decadent journey into the realm of horror perversion. While this is notably improved over the first installment, it still has much room to improve.First of all the movie is really short, only about 66 minutes. That's hardly feature length. Though I digress, given what the film is most concerned with showing (graphic rape scenes) I think a short run time is just fine.A woman witnesses her friend commit suicide and decides to investigate the matter on her own. In the course of her investigation, she uncovers a criminal group marketing a new designer drug and taking woman for slave trade. She tries to put an end to it, but is ultimately taken captive and viciously (and I do mean viciously) raped. She is injected with the drug, but OD's and dies, only to return as a slimy, mutant hermaphrodite.The sex is handled more competently than the first film, but is ever bit as uncomfortable. The blood and gore are noticeably less until closer to the end when the blood monster goes on it's rampage. Those scene will stick with you for a while.This could have worked, but is killed by the same problems as it's prequel, that and it's near obsession with graphic depictions of gang rape.5/10","GUTS OF A BEAUTY is a bit better than its predecessor GUTS OF A VIRGIN. Although this film isn't really a sequel in the sense that it has absolutely nothing to do with the first installment, I did find BEAUTY to be a little stronger and better put together all-the-way-around than VIRGIN...but then again, that's not really saying much.BEAUTY starts off as a pretty rough and straight-faced exploit film. A couple of Yakuza cats are holding a young woman prisoner and begin gang raping her in pretty brutal fashion. As this nastiness is going on, the head guy tells the girl that they did the same to her sister and sold her into slavery in Africa, and that they're gonna do the same to her. They then shoot her up with some drugs and rape her some more. She somehow gets away and ends up at a clinic where the nurse there listens to her sob story. The rapee ends up freaking out from the stress of her prior experience and commits suicide. The clinic worker, moved by the young lady's story, decides to take revenge on the gang by seducing one of the lower-level guys and trying to hypnotize him to make him kill the Yakuza leaders. This whole plan backfires, so now Ms. Vigilante-Clinic-Worker gets exposed to much the same treatment that our original rapee got - only worse (some pretty rough butt-rape ensues along with the pre-requisite gang rape...). She too is drugged, but the drug has a strange side effect on our seemingly hapless victim ----- it turns her into a raging hermaphroditic BLOOD DEMON!!! (no sh!t, that's what really happens!!!) This is when BEAUTY really takes off with some pretty f!cking insane kill scenes - including a very classy chest-burst-rape that looks like a cross between ALIEN and a bad porn, and my favorite - a head-engulfed-by-demon-vagina kill (complete with demon vagina-slime...)that has to be seen to be believed...Definitely some promising stuff going on in GUTS OF A BEAUTY, but still very disjointed feeling. BEAUTY almost feels like two different films being forced together in a non-compatible way. Still, I have to give the film credit - the rape scenes are very rough and misogynistic, and the kill scenes are just totally off the wall. A solid 7/10 for another crazy J-horror \"classic\".","\"Entrails of a Beauty\" features a gang of Yakuza blokes gang-raping a woman and they drug her,and later on she dies and returns as this big slimy monster with a huge penis that has sharp teeth and also a big sloppy vagina.Crazy film,but not very good.The gore doesn't come until the last 20 minutes and most of the film is a standard soft core sex with lots of rape.Worth checking out,unfortunately heavily censored optically and nowhere near as much fun as \"Entrails of a Virgin\".","If they gave out awards for the most depraved and messed-up movies in the world, Japanese cinema would clean up: their exploitation cinema wipes the floor with most other contenders, the most extreme examples being absolutely jaw-dropping exercises in bad taste, nauseating gore, freakish weirdness, and misogynistic sex.Guts of a Beauty is a prime example of such whacked out filth, offering discerning viewers just over an hour of full-on debauchery and gratuitous violence topped off with some very insane J-splatter goodness.The film opens with a young woman named Yoshimi, whose search for her missing sister has led her into the hands of some nasty yakuza, who proceed to rape her and shoot her full of strong dope called Angel Rain. After the gangsters have finished having their fun with the poor woman, she manages to escape and flees to a nearby hospital where sexy psychologist Hiromi (Megumi Ozawa) attempts to help. However, the distraught and confused Yoshimi ends up throwing herself off the hospital roof, turning into a water melon as she hits the ground (at least that what it looked like to me!).Seeking to avenge Yoshimi's death, Hiromi lures Higashi, a member of the yakuza, to her office, hypnotising him into attacking his fellow gang members. After Higashi goes slash happy with a knife in the yakuza HQ, he is severely beaten and stabbed, forced to tell of his meeting with Hiromi, and then hacked into itty bitty pieces.The psychologist is then captured by the gang, forced into performing some sordid sex acts, and injected with Angel Rain—after which she promptly carks it. The gangsters then plonk her body in the boot of their car, along with the remains of Higashi, ready for disposal.Before they can ditch the corpses, however, the super dope has an unexpected effect on Hiromi: she returns from the dead as a hermaphroditic monster with a toothy wang and a ravenous cooch, and, hellbent on revenge, sets about killing the yakuza one-by-one; this leads to some memorable scenes of outrageously gory splatter, including a messy head squish, a man being suffocated by the monster's oozing orifice, and a woman being screwed to death by its giant, gnashing dong.As you can most likely tell from the above synopsis, this is some crazy, screwed up stuff, and probably not to the taste of most sane people, but for those weirdos who have long tired of mainstream cinema and are already well versed in Asian excess, Guts Of A Beauty should prove to be delightfully diverting and deviant fun.7.5 out of 10, rounded up to 8 for IMDb.","Going to horror conventions sometimes you ran into shops with obscure Japanese flicks. Let this be one of them. It do has everything that you want from the old school Japanese horrors. Nowadays it's full of stupid CGI effects or has in fact nothing to offer.This do offer quit a lot, but you will have to wait until the final part to see the gore. It's all about a Yakuza gang dealing in a special drug. Once the drug is injected in girls they become horny as hell. So on that part it delivers a lot of nudity. But naturally things go wrong when one of the victims escapes and get help by a nurse who is out for revenge. As I said it has a lot of nudity and that's what the first part is all about but once the nurse is being captured the movie switches into a nasty flick with entrails being cut out and a cursed one with a giant penis with a mouth full of teeth. Heads are being smashed an even that giant cock does it's work. It's a strange flick full with editing faults and continuity faults but still one to watch due the strange story. The bladder effects used once the drug is injected is also an effects to see. Not an extremely gory flick but still one to add into the old school category.Gore 2,5/5 Nudity 3/5 Effects 3/5 Story 3/5 Comedy 0/5","Kazuo Komizu, who hasn't made one decent film, directed this \"notorious\" shocker and should be ashamed that it was a hit upon its Japanese release.Yes, it does feature scenes of rape, gore and dismemberment, but so what? It has the style of a bad American porn film shot and badly photographed by Ed Powers (\"Dirty Debutantes\") and is incredibly slow.It seems to have earned its notoriety based on its roster of anti-social acts.There is a huge difference between this and horror that is well produced.Just because someone likes their cinema a little wet does not mean they'll accept crap like this. On the contrary, that kind of fan (myself, for example) tolerates even less crap than the average punter out there because he's seen so much and has become overly discerning. It's a shame production companies don't realize that.One reviewer here (ZombieKilla81) commented that the film's \"near obsession with gang rape\" is one of the factors that killed it. I disagree. The subject matter is never the issue. The issue is how that subject matter is treated. In ENTRAILS OF A BEAUTIFUL WOMAN, it is treated so unimaginatively that it is boring.Personally, I like graphic depictions of psychopathic behavior (with an intriguing context) if the material is well directed, freshly photographed and aesthetically pleasing. This Nikkatsu horror/pink hybrid is woeful.","Gaira's Entrails of a Beautiful Woman is an in-name-only sequel to his Entrails of a Virgin produced the same year. Basically what we have here is a Nikkatsu pink film merged with insane 80s J-splatter, ie: loadsa rape 'n' gore! When Yoshimi's sister mysteriously disappears she decides to do some snooping about and discovers that the Ichiyama Yakuza Clan have sold her as a slave in Africa, although by the time she learns this she is being gang-raped by that same gang and shot up with \"Angel Rain\", a powerful drug that causes her to really dig being raped. After the lads fall asleep she manages to escape and goes straight to her psychiatrist, Hiromi. Yoshimi proceeds to tell Hiromi what has happened then promptly jumps off a bridge to her death.Hiromi plots to get revenge for her patient and seduces one of the yakuza before placing him under hypnosis which compels him to kill the rest of his gang the next time they call him stupid (?!). He doesn't manage this and ends up mutilated and hacked to pieces. Then the clan track down Hiromi, gang-rape her then shoot her up with some Angel Rain which, instead of making her horny, transforms her into an inside-out-hermaphrodite-demon that goes on a killing spree, gorily butchering the yakuza that raped her (and the leaders girl too).From all the wonderfully sleazy rapes to the inside-out-demon rippin' through a chicks stomach with his/her fanged cock in an obvious Alien homage and punchin' through a dudes head; Entrails of a Beautiful Woman is one helluva good time! I actually dug this one far more than Entrails of a Virgin - it's a lot less disjointed, faster paced and brings more gore to the table too.Director Kazuo \"Gaira\" Komizu seems a really interesting & intelligent character also - in the interview on the Synapse disc, when asked what prompted him to make such a film he lurches into a long and rambling answer in which he touches on philosophers such as Descartes & Rousseau, as well as topics such as the duality of man, Japans lack of a focused religion, and many others that you wouldn't really expect from the man who created this sex 'n' gore epic.","Kazuo Komizu strikes again with \"Entrails of a Beautiful Woman\", the sequel to \"Entrails of a Virgin\". This time around the story is based around a psychologist (Megumi Ozawa) who decides to take on the Yakuza to avenge the suicide of a doped-up and raped patient that winds up on her doorstep one day. When she gets over her head and the Yakuza capture her, she learns their insidious plat of doping up girls and selling them into slavery. It apparently ends badly when she overdoses from the cocaine. But she soon melds with another body to be disposed of to becomedum, dum, dum  \"Super Slime Hermaphrodite Zord\"! This he, she = it makes mince meat out of the yakuza and saves the daynot really.Well it is better than \"Entrails of a Virgin\", but not by much. Most of the film (a whopping 67 minutes) consists of rape and sex with fogging and the usual ho-hum stuff. Almost towards the end we finally get our gore groove on with a few cool sequence (like an Alien-inspired penis-monster through the stomach scene and a gooey asphyxiation) but it still suffers from a hyper low budget feel that makes it fun but can't elevate it from z-grade soft horror-core fare.","This movie, I would like to say, was completely great. I can see how many people would think that it's just a shocker film. This isn't completely untrue, but it's as much of shocker fiction as Chuck Palahniuk's books are. One of my favorite movies of all time, Bijo no Harawata is a certain type of crudely made movie that you can have just about any reaction to. It's scary, funny, silly, gross, full of off-the-top material and to some people, arousing. The fist time I saw this, it was with my friend, and his mother had brought it home for him to see it. He said it was just some screwed up Japanese movie, but I saw so much more of it. It's badly made, yes, but it has a certain type of poignancy as to be beautiful, too. As the Director says himself, this is a shocker movie made for a certain reason. Its like atrophy. If you leave audiences soft, then the entire human race is going to be soft. I think this is a good philosophy, and I agree with it one-hundred percent. Bijo no Harawata is the type of movie that gang rapes the hell out of fitness, yogurt, and all of this new-wave stuff.","SPOILERS!!!You don't see movies like this every day. This japanese erotic horror movie has it all, sex, rape, yakuza, sex, rape, gore, rape, digitally blured blow jobs, rape, a mutated penis with teeth and a hermafrodite zombie, sufficating a man with her/his/it's vagina!!! There is a really simple storyline in this flick. A psychiatrist tries to avenge a girl, raped by yakuza-like men. This of course involves a lot of sex. She eventually get caught by the \"yakuza\", and of course gets abused, and then killed by a strong drug. She then returns for her revenge as a zombie!All this may sound really good...but it isn't!!! It's really dull most of the time. Not even the sex scenes(90% of the movie) a interesting. Lame effects and bad editing, makes this even worse (or better!?).The girls are nice though, and the ending is a hoot. Therefore I would rate it a 5 out of ten. With it's 70 min. running time, it's a nice little sick movie to watch in between. On the dutch DVD, there is a nice collection of original trailers, of other sick japanese films like; Evil Dead Trap 1+2 and the first one in the \"Guts\" series: Guts of a Virgin. All of them looks more interesting than this one.Only for die hard fans of the genre...","The follow-up to 'Guts of a virgin' is as much cult and weird as its predecessor. But it's not as good, even if that one was just mediocre, all in all. The story is pretty much ludicrous, but the insane gang members and a lot of the gore and effects make up a little for that. There's a lot less soft porn here than there was in the first one, but there is still some. This one does not have a truly great scene as the first one did (the severed lower arm scene near the end), and so this must end up with a lower rating.4 out of 10. I'm glad I finally tried these two films, but I may never want to see them again, except for maybe that one aforementioned scene.","Entrails of a Beautiful Woman is one of the weirdest, grossest, most sexually bizarre Japanese horror movie you will probably ever watch if you so choose to do so. Even when it starts out, things go left very quickly. A young girl looking for her sister only to be drugged and raped by a yakuza gang finds her way to an even younger looking psychologist's clinic. When the girl dies, the psychologist takes on the gang in her stead.Suffice it to say that Entrails of a Beautiful woman is not a family movie by any means. You can not watch this with small children. This is purely adult horror. As horror movies go, it's not suspenseful or spine-tingling. Some of it gets a few laughs, but most of the time you're watching with your mouth open. It is graphic in a lot of scenes. If you are a fan of Japanese movies, you know that they can be over the top and sometimes just downright silly. Entrails of a Beautiful Woman is more over the top than silly, so if you choose to watch, you have been warned.","Sure a film about the yakuza, a dangerous drug, and an inside-out hermaproditic monster with a HUGE monster penis that can transform into a gaping vagina might sound good on paper. But this movie is done lacking suck wit or charisma that the whole film sinks into below mediocrity. If I wanted to watch that trash, I'd rent one of those Guinea Pig 'films'. Don't get me wrong gory films are my bread and butter. But anyone can just throw grue, depravity and rape at the screen. The difference is some people have style (why does \"Visitor Q\" come to mind?) while others like Komizu don't.Synapse DVD extras: Part 2 of a Kazuo Kmizu interview (which he rambles on and on about philosophy it's weird); and a Theatrical TrailerMy Grade: D","'Oh, Japan! This mishmash of Yakuza thriller and horror flick (English title: 'Entrails of a Beautiful Woman') has a little bit of everything- rape, tentacles, strange designer drugs (Angeluh Rainu!) and a hermaphroditic monster. Not for the faint of heart, but well worth watching, if you have the 'guts'.This is most definitely NOT for those with a weak composition, but is a rollicking good time for those whose tastes run towards the more esoteric and decidedly unenlightened. Pairs well with 'Emanuelle in America', 'Ebola Syndrome', and 'Boxer's Omen'. At a brisk 65 minutes or so, it doesn't wear out its welcome and makes for a good night fun, even if you feel icky afterward. A bleach bath can take care of that, though!","This is straight out sexploitation like I have never seen.A young virgin (Seira Kitagawa) is brutally raped and drugged and raped some more by the Yakuza. They did the same to her sister before selling her into slavery. She commits suicide after telling her story to a doctor (Megumi Ozawa), who then decides to investigate.Hiromi's (Ozawa) plans don't go as planned and she finds herself in the same fix. But, after she is raped and drugged and thought to be dead, she turns into a hideous monster that does exact revenge.The blood flows as violently as the rapes.For fans of the outrageous."],"review-user":["Ky-D","EVOL666","HumanoidOfFlesh","BA_Harrison","trashgang","fertilecelluloid","Rapeman13","suspiria10","amoclock","plaznihqyllnikaaf","punishmentpark","jaezelaya","movieman_kev","mysoncool","lastliberal"],"review-date":["11 March 2005","2 December 2005","5 March 2002","11 July 2014","7 May 2012","1 January 2005","14 December 2008","3 April 2005","16 December 2006","20 July 2001","9 April 2016","2 November 2012","5 November 2004","1 March 2014","26 January 2009"],"review-rating":["5","7","8","8","7","2","7","8","5","4","6","9","6"],"review-title":[" Improved, but still misses the mark.\n"," Slightly Better Than The Original\n"," Sleazy and pretty gross!\n"," More mind-boggling madness and misogyny from Japan.\n"," old school Japanese horror with a nice twist towards the end\n"," Sloppy, inept horror\n"," Rape 'n' Gore!\n"," S10 Reviews: Entrails of a Beautiful Woman (1986)\n"," Atrophy\n"," Hmmm...\n"," Cult - yes. Good - no.\n"," Wooooow......\n"," Boredom of A movie-watcher (slight spoilers)\n"," Asian Craziness\n"," Japanese pinky/horror that is outrageous\n"]}