{"review-url":["http://www.imdb.com/title/tt0101597/reviews"],"review-text":["I saw this movie only a few days ago at a convention, and was moved to think about a side of torture tactics that I had never examined. The power of mental abuse can surely override any physical abuse, and that is shown through Madeline Stowe's wondrous acting in this movie. Likewise, Alan Rickman brings to the screen a marvelous portrayal of a ruthless government interrogator. It is interesting, though, even while he tortures Stowe's character, how you see a bit of himself shine through his terrorist personality. It grabbed me, in the scene where she is blindfolded, and he is pretending to be someone else, how he lets the mask fall from his face even as his voice continues his work. The basis of the plot is this: A children's book writer (Stowe) is arrested on the premise that her books hold subversive political ideas, trying to get children to go against the government. The writer continues to deny these allegations, even as she is questioned and eventually abused physically and mentally by a government agent (Rickman). The showing of these torture techniques is disturbing, and probably should not be watched by those who are squeamish about such things. The film was made in partnership with Amnesty International in the early 90's. On the surface of this movie, I would have to agree with all their policies, but as with any movie of this sort, a viewer should not support the organization purely on the face of the movie screen, but it should spur the viewer to outside research. I believe that is what this movie does for many of us. The upshot of this: I would say I enjoyed the movie, but 'enjoy' is not quite the right word. I would watch this movie again if the opportunity arose, and would also recommend it to anyone who has a taste for realistically disturbing movies. 4 stars out of 5.","Closet Land. The title itself conjures up thoughts of secrets. And that is really what's at the heart of this Amnesty International film. Government secrets, personal secrets, both are integral pieces of this story.By far the greatest acting seen in too long a time, both Alan Rickman and Madeleine Stowe were phenomenal in their portrayal of a Government Interrogator and Victim respectively. With only the two actors in this unusual standard length film, it is instantly clear that both actors were dedicated and talented enough to pull the viewer into this tiny bubble of a world and shut the door.A WORD OF CAUTION...What isn't mentioned on the description of this movie is that there is a subplot that deals with childhood sexual abuse. While there is no graphic detail about the abuse, the nature of it may be difficult for some viewers to watch - especially given the intensity of the film on whole.I'm not a big fan of Amnesty International films, but this movie drew me in because the acting was so exceptional, and I can't help but make this movie one of my personal favorites.","These 2 fine actors played off each other perfectly in this terrifying film. Rickman was very effective as the brainwashing and brainwashed interrogator. Stowe as the confused writer was good, letting the crafty Rickman convince her that he only wanted to go one step further, then one more, etc. This movie came off as something that could happen in a country plagued with a police state. Very good film.","\"Closet Land\" tells a powerful story and has many different subtle elements. You could read lots of stuff about the movie's plot before hand, but you don't really need to.  All you need to know is that the movie is all about an interrogation.  Along the way, we learn lots of things about the interrogator and the person being interrogated.  We also learn that the world can be a dark and scary place.  Especially when you have absolutely no control over it.In the end, the movie amounts to a warning (really though, the movie has several different aspects to it) about what happens to people's freedoms when they \"look the other way\" and ignore injustices happening to those around them.If you've got about an hour and a half and know where you can rent this, I strongly recommend that you do so.","Even the trailer for this movie makes me cry, like the first time I saw this movie. Not for people who are easily upset by intense material! The finest performances by Alan Rickman and Madelaine Stowe, without a doubt. This dreadful tale of a society with the power to kidnap and torture it's citizens for ANY reason, whether they are anarchist's or the writer of children's books will chill you to the bone. I saw it when it first came out 1991 and I remember every frame. It still scares the hell out me today. It's happening now.Apparently, IMDb requires ten lines to meet their criteria for a film review. IMDb might want to GET A GRIP! Some of us are a little more succinct about writing opinions.","This movie gave me recurring nightmares, with Alan Rickman's voice representing an omnipotent, insidious, fascist ruler. The scariest movie I have ever seen - psychological terror more powerful than anything any \"horror\" movie has ever achieved. Alan Rickman's voice will always represent to me the power and terror of a totalitarian state, reminiscent of Orwell's 1984. This movie describes to those who don't care the reality of a large part of current world governments. This film is disturbing, but in a way that everyone should watch it - it's a description of a reality that no one should ever have to experience, but so many do.","Placed somewhere in the midst of 1984' and Twilight Zone' this film may be about abuse of power, it may be about government control, it may be about overactive imaginations.One certainty is after watching Closet Land' you will ask yourself a few questions. A second viewing will raise even more.Many will be turned off at the notion of a film with only 2 speaking parts (David Mamet's brilliant Oleanna comes immediately to mind), but this is not a film for mainstream tastes. Chances are, if you would like it, you probably have seen it.Powerful premise, powerful performances, powerful film.","This is such an obscure film, but it was so powerful, I had to watch it a second time on the same night, just to be sure I didn't miss anything.Alan Rickman is at his best in this film, essentially playing four characters: the ruthless interrogator, the sadistic torturer, the tortured witness, and the lost soul.  Madeleine Stowe is as engaging as Rickman. Her strong-minded character put most of the modern, pop-culture action heroes to shame. This movie, at first, looks so simple, but it is one of the most complicated and layered films around.As it has been stated, this movie could very easily have turned out to be a flop.  The acting is some of the finest that can be seen from the last 20 or 25 years.  This is so underrated, but I would not recommend it for everyone, least of all my generation (I'm only 17.  Not many people my age would like or even understand \"Closet Land.\").  In the movie age of special effects, explosions, explicit sex, and all-too-often pretty faces with poor acting and dialogue, \"Closet Land\" is one of the best films I've seen.","\"Closet Land\" was sponsored by Amnesty International and does have a lot of political overtones, but there's so much more to this richly stirring story than that...This is not just about the political tension of the late 80s - it's about the personal persecution that a woman puts herself through as a child who was molested by a family friend. We see the subtle allusion to the parallels of a dishonest government/society structure and the culture of sexual predation where one in four young children are molested and one in three women has experienced some form of rape.For me, it brings up a chilling chicken-and-egg question: does the attitude of our sexual repression-leading-to-predation create the political environment of fear and censoring, or does the socio-political dysfunction fuel a culture of sexual predation? The psychological ramifications of even asking this question force us to a place where we are brought to develop our own answers.In the end, our young lady writer (Stowe) has a similar moment to the one at the end of Hensen's \"Labyrinth\" - she realizes in one shining, brilliant moment that the idea of having her power stolen from her by the secret police (Rickman) is an illusion. No one can steal your power - they can only trick you into giving it up, and then you have the right to take it back at any time.This is not a movie to be entered into lightly, and you most certainly do ENTER it. The minimalist aspects coupled with the child-like animation stirs the deepest parts of the psyche and leaves no viewer unchanged.","This film hits the heart with a reality like no other I have seen. It shows what us what we, in a democratic society, take for granted, and just what we are lucky enough not to be experiencing. The acting in the film is superb, sometimes you have to remind yourself that the movie is a dramatization, and not real life. Mr. Rickman does wonders with his role (as he does with all roles) making the interrogator fully dimensional and human. The set is incredible. It gives the feeling of 'in the round\" theater. Which does not add or take away from the emotion of the action. This movie seeks to open the eyes of the viewer, and I'd say they have made a success of that goal.","Acting, of course!  Think about it, Closet Land could easily have turned out so horribly - an entire movie filmed in one room with only two people, they better have some damned interesting things to chat about.But it didn't turn out horribly.  On the contrary, thanks to incredible portrayals by both Stowe and Rickman, Closet Land is a masterpiece in its own right.That's not to say it is for everyone.  Persons who have had their attention spans decreased through glitzy sex scenes and random gun fire may have trouble digesting Closet Land.  However, those who can appreciate good story telling without explosions should give it a look (no matter how many video stores you have to call to find someone who has it in stock).","This movie continues to provide endless fascination with each new viewing. Alan Rickman has never been better than in this haunting and haunted role, and Madeline Stowe is excellent as well.  The interplay of the two characters is like darkly beautiful ballet.  In short, if you're looking for escapist fare, go elsewhere; if you want to be challenged and see the finest acting this side of great theater, this is your film.","This two-character drama is extremely well-acted and has a valid message and some TRULY shocking moments (shocking not because they are graphic, but because you're not prepared for them when they come). But eventually it does become oppressive, just like the somewhat similar \"A Pure Formality\" did. Still, Alan Rickman should have gotten an Oscar nomination for his multi-dimensional performance, no doubt about it.     (**1/2)","What a movie... I just couldn't take my eyes of the screen. This is one of the best movies I have ever seen. I could go on forever like this. This movie is fantastic. Madeleine Stowe must be really proud. A solid 10 !!!","I really love this movie. It has a very real feel to it. I believe it was never popular because of the subject matter, however, because of the subject matter, it makes the movie all that much more important.This is an \"A\" movie and I recommend it highly. If you liked \"1984\" book or movie, I think you will like this one as well.This is harsh, to say the least, including mental and physical acts of torture, some pretty vile. Not for the week at heart or stomach. No gore, but his movie is so great at projecting the mental anticipation it doesn't need blood and guts.If you are not a realist or a pestimistic person I don't think you will enjoy it. It leaves you with an uneasy feeling about humans, what they're capable of, and the very real possibility that our government(s)does not necessarily have our personal best interest in it's heart.","I still think about this movie sometimes, over ten years after viewing it. It was disturbing and painful to watch.  I saw it twice, about 2 years apart.  I have always viewed it as a cautionary tale about what can happen under an abusive government that sees phantoms and subversion around every corner. (Think \"Patriot Act.\"  Yes, I realize that comment might land me in one of those rooms one of these days.)  The acting was pitched perfectly, and the setting served its primary function: it did not distract from the psychological drama.  This movie is haunting, and I really wish they would release it on DVD.  Here's hoping.","The film deals with universal themes, mentioning no specific country as its context:  it could happen anywhere--and has, in substance if not form. Those concerned about 1st amendment issues, censorship, et al--but don't want to be bored with lectures--need art such as this to illustrate, dramatize, teach, inspire.Rickman is certainly an under appreciated character actor; he shines in this film, showing off multiple acting talents that you must see (I have yet to see him give a bad performance, though, even in not-so-great films). Stowe gives perhaps her best performance (and proves that she possesses one of the most striking pair of eyes in Hollywood)--in two words:  stunning, convincing.The set design perfectly matches the situation, in function and mood.  The sound editing heightens to appropriate effect.  The total contrast conveyed through the animation sequences is a perfect symbolic device-and the welcome and only respite to the bulk of the story's necessary venue.  The script is tight and essential, with engagingly dramatic-yet realistic-dialogue (i.e., as it might be and ought to be).  Perhaps the most amazing aspect to contend with is the fact that 1) this is the director's first time out; and 2) he is the writer.  In one phrase:  a tour de force--with three recommendations: see it, own a copy, see it repeatedly to fathom all its secrets and grasp all it genius.","I caught this movie late one night and never knew what hit me.  This was one of the most disturbing movies I have ever seen, yet had me on the edge of my seat waiting to see what would happen next.  Alan Rickman is an excellent \"bad guy\" but this character beats all others.  I've never been so affected by a movie!  It's been 6 years and I still can't forget \"Closet Land.\"","Rarely does a film capture such intense drama and emotion. What makes this film so unsettling is that the drama feels so real, it's almost hard to remember that it's only a movie. This is by far Madeline Stowe and Alan Rickman's performance of their careers. The film almost feels like a theatrical production the way it is staged and lit. The only bad thing about this movie is that it's very difficult to get a copy of it. I have yet to see it other than on Laserdisc. This truly powerful film deserves a digitally remastered transfer and special edition treatment on DVD. It really is that good.","Closet Land is... something else. It's a movie about an interrogation, and one that ends on a note of a \"message\" (brought to you by Amnesty International, which is well intentioned but not the right note at the end of all of this). Up until then, it's an absolutely riveting display of acting prowess and technical marvel-work. Its bizarre execution comes from somewhere primal, somewhere from a filmmaker who wants to take you to some place that is rather unrelenting and sad about the human condition, where we put ourselves in a place we can't get out of - and, sometimes, how we can find a way to make it through, bit by bit.It's like if Kafka had to do a remake of Saw and use nothing but politics. Oh, and cast Alan Rickman instead of Jigsaw and make it about a woman who writes children's stories and is accused of writing subversive literature hidden in her latest story 'Closet Land'... come to think of it, that's nothing like Saw at all (save for the bits of torture, which, gracefully, are kept at a distance).Two things are striking here: the sets and lighting, and the performances (maybe that's three, who cares). It's a showcase for Bill Pope, later the mastermind behind lighting The Matrix, to really make this a claustrophobic but somehow baroque room the characters are in. We rarely leave it, save for those few flashes where Madeline Stowe imagines herself away with her creations, so the photographer has to come up with new ways to show us these people, in this very strange and oppressive environment. The other thing is the acting. If you ever want to look up 'underrated', here's the place.In fact, I would make a bold statement: this is Alan Rickman at his very best. He's so good here because he makes this character unlikeable but hard to pin down. Is he a really bad person, or is he just crazy? Does he really believe what he's saying, as he breaks this woman, or does he mean it when he says \"They're watching me, too\", when talking to Madeline Stowe's children's writer. We get glimpses of his character's life before all of this madness. but it's hard to see how that informs the macabre, pitch-black comedy of when we wee him as the \"other guard\" when Stowe is blindfolded, cavorting and contorting around the room like a madman. He gets to go to town, and is sinister, subtle, even warm, and when he gets mad, you can feel it. Stowe, on the other hand, is given a more challenging task playing the victim, always on the alert but strong because of her own 'Closet Land' she developed as a child, not as any kind of political statement.I believed both actors in the roles, no matter how horrifying things got, and the film-making is just direct and absorbing. There's a lot of dialog that they have to cover here, but it's never boring or slight. And, oddly enough, I don't think it would've worked as a play unless it was restructured or if things were cut out a bit. It is, for all of its 'wordyness', a cinematic piece, shot on a specific-film set, and given a musical score that, unless I was mistaken, sounded a helluva lot like Philip Glass (it says Richard Einhorn, but who cares). It's ultimately 'that' movie that you have to tell your friends about, since they probably never heard of it until you came across it on, say, Rickman's IMDb page. Among a small group of people, I imagine, it's one of the great little-seen films of the past twenty-five years: intelligent, provocative, adult film-making.","This little two-person movie is actually much bigger than it looks. It has so many layers. I've watched it over and over, and always pick up on something new. I am amazed at the depth of the acting, and I feel if this movie had gotten wider release that there would be no question that Alan Rickman is a major star","I am profoundly grateful to have seen this movie. The acting is astonishing, the movie itself is powerful and clear, and the issues involved are handled with subtlety and depth.This is an important movie. It could be profoundly transformative.I would pay good money never, ever to see it again. Because it *is* so good and so complex, it is extremely difficult to watch. I admit that my taste in movies tends strongly toward light entertainment; the visual medium can be so powerful that I tend to avoid it for anything really important. Those of you with greater fortitude than I have may find it easier to handle.But I strongly encourage people to see it at least once. Preferably with others, so you can talk to each other, and have someone around to remind you that there's more to the world than the movie.","Closet Land is an amazing, terrifying piece of cinema. It features only two actors in a single set, but never loses your attention. The set design is imaginative and troubling, the staging of scenes maintains your attention, while adding to your own sense of confusion and terror. The acting is outstanding, with Alan Rickman and Madeleine Stowe having the duty of carrying every scene.I first saw this film in 1991, soon after it came out on video. It didn't play in theaters where I lived; not surprising, given its political content. It should be seen, though. It features a brilliant staging of the torture and interrogation techniques used by repressive societies to instill fear and obedience in its citizens. The country is never named, which makes it all the more striking. It could be anywhere; East, West, 3rd World, 1st World. It illustrates what happens when a small group of people decide what is best for everyone; when government becomes the ruler of the citizens, rather than the servant.Madeleine Stowe is a children's author who has been dragged from her bed in the night and subjected to terror and torture. She finds herself in a room with Alan Rickman, a seemingly pleasant functionary. At first it seems a horrible mistake and she is free to go; but, fear causes her to remain and the terror escalates. She is increasingly subjected to physical and mental torture. The interrogator uses sensory deprivation, temporal manipulation, confusion, auditory manipulation, role play, and twisted logic to break down the author. She is humiliated and browbeaten, forced to endure strenuous bodily positions, deprived of food and water.Through it all, she refuses to give in; to do what the interrogator asks. She is told that it will all end if she just signs a confession. A simple little act. She refuses. Through it all, she employs defense mechanisms that have developed since childhood. It is slowly revealed that she was the victim of childhood sexual abuse. To survive, she developed fantasy worlds and characters that would take her away from the abuse. These mechanisms allow her to transcend her torture and turn the tables on her interrogator. She starts attacking his own beliefs and profession, forcing him to examine his own life and motives. In the end, she is free, because she maintains the freedom of thought. The interrogator is the one trapped by the state.This movie was made during the height of the Cold war, Apartheid, and at a time when the crimes of many governments throughout the world made daily news. It is even more timely in a world where \"enemy combatants\" are held and interrogated in secret prisons, denied legal rights or counsel; where \"ethnic cleansing\" lays waste to whole societies, and humanitarian aid is denied. It demonstrates that the individual can stand up to the state or other oppressor by refusing to give in to fear and terror.","This is one of my personal favorites and I am baffled to find out people hate it. However, it only works on levels apart from what the director intended. The first is as an answer to the question \"What if Fifty Shades of Grey didn't suck?\" The second is as a feminist (for lack of a better term) narrative. There is no movie heroine like this one: She has gone through extreme trauma and victim blaming, and we are supposed to admire her for maintaining integrity and willpower when her voice is threatened, which I do. She isn't even supposed to have a love interest! I salute you, Radha Baradwaj.Unfortunately, the political message is completely undermined once the twist is revealed. I myself am convinced the Interrogator was indeed the child molester, for long before child molestation is brought up, we have lines like \"Before you knew a man's touch\" and \"You've changed.\" You have to watch it a second time. Most convincing is the poetry the Interrogator recites, which would only make sense if he had known her before. And with all the times she says he's lying, she doesn't do so when he claims to be the child molester! So the motivation in tracking her down was personal rather than ideological--although you could argue that his victim blaming and rise to power despite being a pedophile are connected to ideology. BUT, she is not being held prisoner for ideological reasons! He just didn't want to be found out because the story Closet Land hints at his terrible secret. I guess pedophiles aren't supposed to work for this government after all. Anyway, considering all this, what evidence do we have that this government's beliefs and aims are so bad? Despite this gaping plot hole, I'm damned if Closet Land isn't greatly enjoyable and well-written in every other way. Especially if you're one of those crazy Alan Rickman fans, I recommend it.","(spoiler warning) I watched this movie on youtube, and came across this comment (mariehansler):\"this is not about her actually being abducted and tortured. It is a metaphor for how abuse and abusers physically, mentally, and emotionally continue to abuse a person even years and decades later. It is about how her escape (closetland) is not only her escape, but also her prison. In the end she comes to the realization that the prison is of her own making and﻿ only she has the key to setting herself free. \" This is absolutely true.I was the unfortunate victim of sexual abuse when I was a child, and I would suffer panic attacks at night. To escape, I would enter into a fantasy world in my head, where I was safe and beautiful. Years later, I'm now grown, and still regress into a fantasy world whenever I deal with stress. It's become a problem.I'm not the only person who has a story like this, and this film beautifully illustrates the disturbing prison of an abuse victim, constructed by both the Abuser and the Abused.This is an important film. It's helped me to diagnose my own issues as both a Victim and Prison Warden, and has brought others to this realization as well.Otherwise, the cinematography is magnificent, the performers are incredible (in my opinion, Rickmans' performance is Oscar-worthy), the music and sound-work is chilling and haunting, lighting, design, script, all Awesome (as in the dictionary definition).Lesson: You have the key. Only You can unlock the doors."],"review-user":["desertrain-1","LaelW","helpless_dancer","wyrder","draya10","kaiima","Doctor_Bombay","maelitael","lilith70","severus_snapepm","Madde-2","beconrad","gridoon","ZanYiaN","carial1969","SECurtisTX","ravenhair","kel-8","sambasangre","MisterWhiplash","battat2","gramina-1","grendelkhan","jwiley-86292","ckuschel25"],"review-date":["2 June 2004","28 November 2004","13 November 1998","6 February 2001","5 January 2006","30 May 2004","15 April 1999","4 November 2000","3 January 2005","6 June 2004","2 January 2000","3 October 2000","31 July 2002","10 October 1999","21 June 2006","12 November 2003","2 April 2000","16 April 1999","1 December 2001","9 April 2010","23 May 2000","4 June 2007","24 April 2006","17 April 2016","26 August 2011"],"review-rating":["10","10","10","10","10","10","7","7","10","10","10","10","10","10","10","8","9"],"review-title":[" A definite thinking film\n"," Simply Amazing, Simply Disturbing\n"," well acted, excellent dialogue, believable\n"," Everyone who likes freedom should experience this film\n"," Brilliant. Not for people easily upset by intense material.\n"," Scariest movie I know\n"," Political? Sci-Fi? Superb any way you look at it.\n"," Disturbingly incredible...\n"," More than it seems\n"," eye opening\n"," What makes a great movie?\n"," Two of the best performances I've ever seen\n"," \"It's the suspense, not the pain, that will drive you mad\".\n"," The movie I will never forget.\n"," Great movie\n"," A Classic\n"," As if you were there; a very personal cinematic experience; instructive and strengthening.\n"," disturbingly fascinating\n"," This film is uniquely stirring and disturbing.\n"," Alan Rickman, take a bow, same too for its first-time writer/director Bharadwaj\n"," many layered movie\n"," This is an important movie.\n"," tremendous piece of work, continues to be timely.\n"," Unforgettable\n"," A symbolic metaphor for the abused\n"]}