{"review-url":["http://www.imdb.com/title/tt0273855/reviews"],"review-text":["This is the modern take on the Cosby Show. While this isn't as successful it is funny. The thing with the Cosby show was that it was quite realistic. This show has some realism but is generally exaggerated and overplayed for more overt humour. It has more daring portrayals and deeper situations too, with the Kyle's young son taking drugs and also impregnating his girlfriend throughout the series of the show.The key thing that works here is the cast, much in the same way they did in Cosby. This is predominantly a far more modern family, younger parents and wilder children. Damon Wayon's is the father, Michael and he is hilarious. Damon is all about his delivery and is also a great physical comedian. I love Tisha Campbell as Jay, the mother of the household. She looks way to young to have two adult children but you soon forget that. She is vivacious and infectious. Then there is George O Gore as Junior the idiot son. The part is very over the top but funny, with Gore playing the dullard superbly. Jennifer Freeman is very good as the eldest daughter too, and not to mention sexy. The stars for me though are the child cast. Firstly Parker Mackenna Posey as Kady, the cutest sitcom creation since Rudy and the other little kid in the Cosby show. She's a great little actress and some of the lines she has a classic. I laugh almost every time she's on screen and she says something. Kids in these shows can often not have much charisma or can deliver lines well, but she does it excellently. The one that really makes me laugh though is the young genius and future husband of Kady, Franklin played by Noah Gray-Cabey. Every line he is given is superb, because generally he is given lines to say that you would never hear from someone that young. He's also the maestro pianist who serenades his girl with concerto pieces. The trademark line `Anyhoo!' is a gift for the audience that Franklin must utter at least once an episode. It's all funny stuff and lots of running jokes such as the ever more imaginative deliveries of the words `yes' and `no' with dances and palpitations resulting in an answer to a request from the kids. I have found myself doing the same, on one occasion taking a whole 2 minutes to tell my brother that I wouldn't buy him a takeaway.This is a very good comedy show and something I regularly watch. It's been done before but not like this.","\"MY WIFE AND KIDS,\" in my opinion, is an absolute ABC classic! I haven't seen every episode, but I still enjoyed it. There are many episodes that I enjoyed. One of them was where Junior (George O. Gore II) got his driver's license. If you want to know why, you'll have to have seen it for yourself. Before I wrap this up, I'd like to say that everyone always gave a good performance, the production design was spectacular, the costumes were well-designed, and the writing was always very strong. In conclusion, even though it can be seen in syndication now, I strongly recommend you catch it just in case it goes off the air for good.","\"My Wife and Kids\" is one of the funniest sitcom shows ever! Damon Wayans is really silly in every episode and it makes me laugh in every single episode. Damon Wayans plays Michael Kyle who is a modern day patriarch and husband who rules his household with a unique and distinct parenting style. As he teaches his three children some of life's lessons, he does so with his own brand of wisdom, discipline and humor. Michael can only hope his parental advice, mixed with witty humor, will steer his children to act responsibly. Through it all, Jr., Claire and Kady know they can turn to their father when they need his guidance. This show has very silly and witty humor that can break your funny bone! This show premiered March 2001 on ABC and was canceled May 2005. But why did ABC cancel this show? I think it should have gone another season or two or at least some other network should have picked it up.User Rating: 10/10 BOTTOM LINE: VERY SILLY!","Co-Creator, writer, and producer Damon Wayans also stars as the fun, loving, caring, and nightmarish father of 3, Michael Kyle.The show is about a married dad named Michael Kyle who has a sexy wife named Janet (Tisha-Campbell Martin) and three kids. Tow of which are growing into adulthood. Their names are : Junior (George O Gore II) who is a dummy at times but really is a cool bro, Claire (Jennifer Nicole Freeman) who doesn't care about anything but looks and boys, and finally there's Kady (Parker McKenna Posey) who is nothing but adorable and sweet with animals.This show is meant to be hilarious. But at the same time, it will teach you lessons about what life is like. And the right person for the job of being a dad is Damon Wayans. I think that he does a brilliant job with raising, punishing, and loving his kids.This show is my absolute favorite! I have never missed a single episode and don't plan to. I feel sad that the second season is ending this Wednesday at 7:00. I'll miss you Damon and the Kyles!!!!!!!!!!!!!!!!!!!!!!!!!!Coming Soon: My Wife and Kids- SEASON 3! I can't wait!!!!!!!!!!","This show was crap when it first came on. The first actress that played the daughter didn't fit the role, the writing was hit or miss, and Damon Wayans CLEARLY wasn't comfortable doing such a cornball family friendly show. The chemistry between himself and Tisha Cambell (they're long time friends, as are all of the Wayans clan with Tisha's husband and Will Smith and Jada Pinkett) DID work so they retooled the show. Once it returned, they recast the daughter, made the son much dumber (a la Eric from \"Boy Meets World\")and made the youngest daughter into a genius...(later they gave her a little genius boyfriend to do comedic guest appearances). The show, while if often rollercoasters from over the top buffoonery to being corny walks the line enough to keep it as a show that you can see Damon Wayans be comfortable in his own skin on the set (especially since the main writers, directors and consultants were ALL members of the Wayans family) AND in his character. Once everyone had been on the show for a while, they worked to everyone in the casts strengths and were able to make a consistently funny show on the air.However, there is TOO MUCH buffoonery, too many over the top antics, and oftentimes too much chaos happening in the life of the Kyle family. They made Junior TOO STUPID, they also made the eldest daughter an attractive, clumsy idiot from time to time and the youngest daughter wasn't even spared by the writers. I feel they jumped the shark and signed the shows death warrant when Junior got his girlfriend pregnant, she moved in and he married her and her parents were introduced (Junior's wife's father's character makes me WINCE just thinking about him). The show remained funny...but it was a UPN show on ABC if that makes any sense to the reader.The reruns are funny enough, but I'm relieved it's over...there was nowhere left to go with it. When it's bad it's REALLY BAD. It tends to be cornball at times but at least he was a black man who had a sitcom make it to syndication on a major network..Who can say that for themselves now? (Given the CW merger and the \"brownout\" on TV networks lately, that is). One.","Network: ABC; Genre: Family Sitcom; Content Rating: TV-PG (for scatological humor and implied sexual content); Available: Syndication; Perspective: Contemporary (star range: 1 - 4); Seasons Reviewed: Complete Series (5 seasons) I was a big supporter of \"My Wife and Kids\" in its first season. An ABC mid-season replacement, \"Kids\" felt like a refreshing and real family sitcom without the obnoxious strains to be \"edgy\" or a slavish following of the man-child husband, nagging wife, cute kids formula that runs most CBS comedies. It was an unlikely star-vehicle turn for \"In Living Color\" alumni Damon Wayans.Wayans constructs the show as a living homage to \"The Cosby Show\": a happy affluent African-American family with a father who spends most of his time at home, a strict but game wife, a dim-bulb son and adorable little daughter. Tisha Cambell-Martin (Janet) plays Michael (Wayans) Kyle's wife as a partner in his adventures instead of a constant adversary. The new Theo is George O. Gordon as Junior, the butt of constant jokes about the size of his head from dad, the new Rudy is the a quintessentially scene-stealing Parker McKenna Posey. \"The Cosby Show\" is highly regarded for a positive portrayal of its characters in the 80s when TV was seen as going down the moral tubes. \"Kids\" benefits from a similar swing of the pendulum and got some deserved praise for its ability to resist being smarmy in a sea of garbage.But as the show wore on, Wayans' scatological impulses begin to overtake him. It starts with season 2's \"Table for Too Many\", a one-hour juggernaut where Wayans faces off with Larry Miller at a Benihana-type restaurant and the \"pee pee\" jokes begin to fly. A few seasons later, \"Wife\" makes a spectacular and unexpected leap off the ramp and over the shark when Junior actually impregnates a girl and we're supposed to believe that a character played to us as nearly mentally retarded is becoming husband and father material.From season 2 forward the show gets lazier and lazier. The show is charming and pleasant enough  and would have been a perfect fit for all the conservative crusaders who want all TV to be about nice, happy people who nothing happens too but the show begins to stock itself more routinely with sex jokes that are less clever and less implicit. As when applied to any family sitcom, it's a little creepy.I like that the show doesn't try to gross us out; it doesn't try to be edgy or contemporary (though there is a memorably clever \"A Beautiful Mind\" homage re-casting Junior in the John Nash role). Not to mention, the show has the benefit of truly wretched ABC family comedies like \"Full House\" and \"Family Matters\" still in our memories to make it look better. Wayans does everything he can with what he has and within the limits of the genre (as well as his own self-imposed constraints) and gets a few good laughs along the way, but he alone can't keep the show afloat. The \"Cosby Show\" comparisons are a distant memory now as \"My Wife and Kids\" fell into the network family sitcom rut.* * / 4","My wife and kids is a good and funny series that truly shows the worries and problems that happen the most even in the best families.Michael Kyle (daddy) is a man who is always trying to stop his children from doing teen's stuff like partying, drinking, loving or making love. When they do something wrong, he is right there to correct them (by the way he loves to make bad penalties)Janet 'Jay' Kyle (mother) has a strong personality and rarely agrees with her husband. She understands that their children are teenagers and like to do \"wrong\" things, unlike Michael doesMichael Kyle 'Jr' is a dumb guy who believes in everything other people say. In the beginning of the series, he's such a cool guy and tries to be like his father, but lately, I don't know why, he becomes a very very dumb dude and he starts being a problematic guy. In the end of the series he falls in love with Vanessa and becomes a father, or should I say, a dumb father who does nothing rightKady Kyle is a typical teenagers who loves to party, kiss and drink. She has many problems with her parents because they invade her privacy too much. She has a boyfriend called Tony who is catholic and is scared of everything, so we can't understand what makes she date him. I can remember one episode that they're prepared to have sex, but Michael Kyle scares Tony claiming that sex is very dangerous and deadly, so he decides to guard himself until he's married.I resume this is the best series of my life and I still watch it everyday after 3 years so I recommend to all of you - mostly for teenagers.","This programme has an amazing cast which includes: Damon Wayans as the bald tough head father Michael Kyle Tisha Campbell-Martin as the feisty momma Janet 'Jay' Kyle George O Gore II as the dumb kid Michael Kyle Jr A.K.A Jr. Jennifer Nicole Freeman as the troublemaker teenager Claire Kyle and Parker Mckenna Posey as the cute youngster Kady Kyle. Damon Wayans is the creator/writer/producer (i think) he like Will and Jada has put his life on the screen, he has his family which include his son Damon Wayans Jr and Michael Wayans and many more helping him make this programme right and they have done it this is just basically a dysfunctional family with love between Michae and Jay. Hate between a brother and his sisters. With all the trouble that either Claire, Jr or/and Kady get into Michael thinks he can somehow sort it out with very different ways than normal fathers do Jay and the family sometimes help him out in what he calls Michael Kyle signature moments. Their comedy is funny because Damon has done stand up, a funny line i think is one like this: Michael Kyle: Junior, we provide a roof over your head, food on your plate, and clothes on your back, and yet you wanna sit around complaining. If that's not good enough for you hey so long sucker, see ya, bon voyage, arrived, later loser, goodbye, good riddance, peace out, let the doorknob hit ya where the good Lord split ya, don't come back around here no more, hasta la vista, kick rocks, and get the hell out. Michael Kyle Jr.: Well since you put it that way, I will. It's time for me to leave the nest, spread my wings, and fly. Michael Kyle: Yeah, well, it's going to have to flap real hard to get that big dodo egg head off the ground.","Really...I don't.This is just another run of the mill, crappy, goofy, campy sitcom that for some reason gets good reviews here at IMDb.I watched three episodes of this (one where the boy got some girl pregnant and a two parter where they went to Hawaii.) Damon Wayans is annoying in this (I loved him on In Living Color) but the whole show is just so campy! In the episode where the son gets some girl pregnant, Damon's character wakes the boy up at 5 AM crying like a baby and talking in a baby voice, explaining to him that that's what babies do and the \"audience\" (laugh track?) cued. I didn't find that funny (I thought it was obnoxious...) Then in the two parter when they went to Hawaii...first sitcom cliché (Hawaii!) Why do all sitcom families have to go to Hawaii on vacation (or Disney World?) Anyways, when they were in the airport getting their luggage, the little girl and Damon Wayan's character were riding the converbelt...with nobody telling them to stop, no security guards, no other people around there. That was unrealistic and just plain stupid.Then another sitcom cliché later in the episode, Damon's character is annoyed with the older daughter so what does he do? Give her the credit card and tells her not to go crazy with it. What does she do? Goes crazy with it (wow I didn't see that coming...) I really don't see why people compare this to The Cosby Show (that was flawless) this show is crap (in my opinion.) If you're looking for something like The Cosby Show then don't watch this.....","I like Damon Wayans (a lot). I also like Tisha Campbell. I expected to really like this show, too. But despite the talent involved, My Wife And Kids is a large disappointment. The Family Sitcom is a limiting, oversaturated market even in the best of times. In our ironic era, it's also almost impossible to succeed in. This show doesn't even come close, however. It's as if they went out of their way to make it boring and unimaginative. The kids are nondescript, the laughs are sparse and undernourished, the plots are instantly forgettable. Now they've even added their own version of Urkel (though this kid is much more self-aware than Urkel). Because of the talent involved, the show is always watchable, but it's a lot like spending 20 bucks to get a frozen pizza: you might eat it, and even enjoy it--but you sure do feel gypped.","The fact that they're showing this so excessively during non-ratings period here in Australia pretty much tells you everything. I tried watching this.... twice... and yet I was so repulsed I switched it off before the episode finished.This can not be compared to The Cosby Show. The Cosby Show was a great show. Bill Cosby is hilarious. My Wife and Kids isn't. First of all - just because the family is black, they're comparing it to the Cosby Show. The Cosby Show was actually funny! Second of all - the whole sit-com about a family has been done so many times, most of the time better than this tripe. It's been done so many times, with mostly good results (The Cosby Show, Everybody Loves Raymond). 3rd of all - The show has such an unimaginitive title, that's why I didn't want to watch it at first. But I thought I'd give it a chance. I see I was wrong.Somebody's gonna say, if you don't like it, don't watch it. I won't. This is one of the most painfully unfunny shows around. And people give shows like \"Yes, Dear\" and \"King of Queens\" a bad rap. I'd watch them over this anyday.","Lets be realistic here. This is one of the worst shows I have ever seen. My Wife and Kids showed real promise in its first season and only went down hill after that. It is so bad that words do not describe. The acting and writing are so dreadful on a consistent basis I wonder if Damon Wayans was producing such an atrocious show on purpose. From top to bottom every performance is ridiculous. Damon Wayans completely phones it in and George Gore II is so horrible I cringe at every over-acted line. Can anyone really watch this show and find it to be entertaining let alone funny? Please I implore you. Do not watch this show. As soon as TV affiliates stop picking this up in syndication we can finally be rid of this absolute garbage.","This rather embarrassing sitcom from the Wayans brothers is not exactly made of 'Monty Python' class material. The earlier episodes were indeed funny - as with most sitcoms - but most of the series makes the viewer shift uncomfortably at the unfunny dribble that spills from the TV set.The basic outline for the show is an out-of-work man (Damon Wayans) becomes a househusband, and has to look after his three children. The plots of the individual episodes can vaguely be worked out through the incoherent and cringe-worthy babbling of the father (Wayans) and son (George Gore). The studio audience on the show unsurprisingly make little noise, and the clapping that does arise is not applause, but is of the viewers clapping their hands over their eyes.Amongst the slumming actors filling the soundtrack with gibberish, crying and screaming, the loudest sound of the show is the bottom of the barrel being scraped.","I never really started watching the show until it was canceled and started showing re-runs. I actually enjoyed it for the first to third season. Once I saw the fourth and fifth one I was beginning to get irate. The first problem was that they did that irrelevant, scenario of history repeating itself (Jr having a kid like his parents did). The second had to be the one where they had everyone paired up with someone (ex: Katie and franklin) . The third one was when they made Jr even more idiotic than before which was beginning to be tedious and vexing to the point where I wanted to go into the T.V. and beat the stupidity out of him until he's unconscious . The fourth one had to be that zealous dork that Clarie claimed as a boyfriend. The fifth one had to be Katie, she was beginning to be too good for herself and was treated her \"boyfriend\" Franklin like the pushover he was. The last but not least was Noah Gray-Cabey!! Franklin, Franklin was just scary. It was like watching a terrible combination of Urkle and TJ Henderson only more annoying!!! They seriously jumped the shark when came he to the show. There was little to no realism to his character and the way he laughed was a sign of obvious force showing that Noah can't act. Eveytime I saw that kid just made me want slap he silly. However, B.F.(before frank) this show was funny and very entertaining.","This is probably the most irritating show I have ever seen in my entire life. It is indescribably the most annoying and idiotic show I have ever seen. Everything about it is just bad.Synopsis: Different situation comes up each week for the parent to handle their kids.I could not understand, what kind of idiot would produce this mess in the first place not to mention several season. The script is bad, very bad  it contains both cheesiness and unethical joke that you normally see in rated R or NC-17 movie. Especially for the young boy character where all he does is pleasuring himself, is that what one called family show humor? The casting is also horrible, cause all you see is a really really BAD Actors, period.Final Word: This Show is a real torture!! This show provides an image of how irresponsible parent can be (using power wrongly rather than understanding). It is zillion times away from reality. Listen to Kenny G would be a god sends compare to this. Watching washing machine twirling around wouldn't hurt your eyes as much as this show.Rating: 0/10 (Grade: Z) Note: The Show Is So Bad That Even Mother Of The Cast Pull Her Daughter Out Of The Show.","This show happens to be my favorite comedy TV show.My Wife and Kids is about Micheal Kyle and his family and how they each cope with everyday problems.Micheal Kyle and his wife Jay both became early parents in high school and after many years of balancing their jobs and family,they still have some adjusting to do.Micheal Kyle,a stubborn yet caring man with a great sense of humor deals with fatherhood and Jay,his sensitive and outgoing wife deals with motherhood.Even though they both love their three children,they have some trouble finding common ground with them.Micheal Kyle Jr. or Jr.,the rap-loving, carefree,creative and sometimes dumb 16-year-old is the oldest son.Clare,the slightly moody,sassy and clumsy 15-year-old daughter is the middle child.Cady,the cute,bubbly and lovable 5-year-old is the youngest daughter.These children often break the rules and fight amongst themselves and even with their parents but Micheal and Jay always do their best to teach their kids valuable lessons and to steer them in the right direction in life.Micheal Kyle style.This show is the greatest but that's just me.This show shows true acting talents as well as good episode writing talents.Who comes up with these out-of-the-box ideas?The best part about each episode is when Micheal comes up with a plan to teach his kids lessons in fun ways.Damon Waynes has now become one of my favorite male actors of all time.This show is actually based on real teenage problems such as teenage pregnancy,relationships and sex.Each actor/actress puts life into their characters and makes their lines more enjoyable.I don't care what everyone says but I think Franklin makes a great addition to the show.He has the wittiest lines and the best personality.It's such a surprise seeing that the actor is actually pretty young.When I first saw this show,I thought Bill Cosby's next generation.This show is filled with realistic characters and important morals,I'll give this show an 8.5/10.","This is something I enjoyed as a kid when it first came out, but it's not the kind of thing you can watch over and over again and still like it. This is one of the TV shows that gets stale and annoying fast. It also falls into the trap of other black comedy shows, where it doesn't make an effort to be funny and relys on natural black humour as comedy. It's not funny. None of the characters are funny and the show heavily relys on the kids dumbness and the fathers despair as humour. But it just doesn't work. I don't know why it's still gets aired here in the UK, especially in 2017. It is done. It needs to go. It needs to be forgotten about, because this may have been entertaining in 2001 but the world of TV has changed a lot since then.","My Wife and Kids was billed as the 00s very own Cosby show- but unlike the latter, it was unfunny and unwatchable. In fact, it is so poorly written and some of the jokes revolve around Michael mickey taking Michael Jr's dumbness and the fact that he is such a loser- which got more and more tedious and annoying as the show went on.What was supposed to have been a promising hit, eventually turned into a dumb, silly show later on where the ideas became so OTT and ridiculous. And as for the second Claire, i ended up disliking this character so much: she became a spoilt, childish and moaning teenage brat, in most of the later episodes.MWAK was no Cosby show trend setter, rather it was just a poor black sitcom by general standards.","The very important thing that i would like to say about the series is that it really surprised me. This is supposed to be a regular 'family comedy' like 'everybody likes Raymond' but trust me it isn't. In this show there are no redundant episodes in which the characters just tease each for no good ,on the contrary every single episode is enjoyable. There is the terribly funny and 'protactive' father of the family, an organizing and a bit passionate mother, a slow son, a typical teenage superficial girl and a cute baby daughter. But gotta say the father 'Micheal' is the real engine of the show: its just hard not to laugh at this guy:).The comedy is there but the issues of a modern family is also there which are a bit exaggerated of course in a funny way:). There are times when Micheal tricks his daughter into believing that there is a Justin T. concert( he doesn't allow her to go concerts alone) and busts her on the fake concert location where he takes pictures of her and her friends and adds them to the 'wall of shame' on the refrigerator. This is the most enjoyable sitcom I am watching lately and I d recommend to you to do so ,too:)","I have to admit I really started watching the show at first for about 1 episode or so but now since it is on syndication everyday now it seems so funny that My Wife & Kids is is great show worth watching now that the series had been canned by ABC. The Show basically consists of Michael Kyle (Damon Wayans \"In Living Color\") Janet Kyle (Tisha Campbell-Martin \"Martin\") trying to deal with their kids Junior (George O. Gore III) and Claire (Jennifer Freeman). Though the series lasted for 5 seasons in March of 2001, My Wife & Kids seems to be a down to home show that has a lot of humor especially with an episode of which Michael takes home a slot machine to deal with how much money you have to budget. Another episode is when Jr. beats Michael in Basketball and tries to overpower his plans to have power and authority of his dad. But My Wife & Kids was a great show that deserves to be on the air more often than just 5 seasons. So I'm giving this show a total of 10/10 Super show that hopefully they can make the new episodes to bridge up for that cliffhanger last season.","This show is one of the stupidest in the history of all bad t.v. shows (and trust me, there are PLENTY of them).  It's the basic \"moral values\" t.v. shows, but there's a soundtrack.  It's like a black 7th Heaven with a soundtrack and less drama.  I HIGHLY recommend that you change the channel when it comes on.","First,he was one of the members of FOX's \"In Living Color\";Second,after the success of \"In Living Color\",he went on to star in his own short-lived sitcom called \"Damon\",which co-starred his Living Color alumnus David Alan Grier(which was also on FOX),and from there he has quite frankly done it all until he stuck gold with this series in which some critics are calling it \"The New Cosby Show\" for the next millennium and its one of the best things to come about on television in quite some time now.The Actor:Damon Wayans. The Show:\"My Wife and Kids\" on the ABC Network. This is a family oriented sitcom that is extremely funny and downright hilarious. Here you have the exact same formula that was applied from 'Cosby'....a highly successful suburban African-American family which consists of a hard working dad(Wayans),his lovely successful lawyer wife(played by Tisha Campbell-Martin-aka 'Gina Payne' from the series Martin),his doofus but sometimes downright cool son(played by George Gore,III-aka 'G' from the series New York Undercover),their boy crazy fashion designer daughter(played by Jennifer Freeman,and was also played during the show's first season by an unknown young actress at the time),and their adorable cute as a button baby daughter(played by Parker Posey,whom some critics are calling it her as quote,'The New Rudy').The show has a lot of good family values and its the one of the shows you don't wanna missed cause you'll never know what to expect and with this family anything goes. During some of the episodes you may see some very special guests pop-up occassionally like for example folks from a variety of shows including rare sequences from Kim Wayans as the aunt or Kim Whitley(of BET's 'Oh Drama!')as one of their next door neighbors. It's about time that they brought back family oriented shows that centers around the everyday activities of black families especially those that focus on positive issues and etc......But overall,the show is hilarious and gut busting funny and lets give Damon Wayans a round of applause for putting a decent show back on top! Let's hope that the executives over at ABC don't give up on this show. Besides,anything is better than that boring Drew Carey which the network took off Wednesday nights and gave this show the time slot.","As a teacher I deeply hate that constant mutual verbal and physical abuse displayed at every moment in this show. Even the \"jokes\" are all constructed much too simple and predictable: There are very few examples when they are not like \"over-confidence versus disappointment through reality\". It would be best to forget it and let it die. If I imagine this show to be taken seriously by some people or work as role models for young people, especially African American families, I feel deep regret for them. These times of father figure drill sergeants or screaming wives menacing like Lysistrata with sex-strikes don't belong in this century.","Damon Wayans is a dad that is so funny that it hurts! The cast is great to look at and the acting is funny and just put Damon in any situation and he will be funny! The show will be a hit and stay on awhile! It's on ABC at 7pm on Wedsdays(Central time). Great show and DON'T MISS it! Give this show awhile it will break in the top ten! The cast is fresh and you will like everyone. Out of 4 stars I give it 3 1/2.","........how did it go so horribly wrong so quickly? I caught an episode this afternoon after no having watched the show for a while. It's not funny anymore. It just sucks.And what's up with all the recasting? We've already had two Claires and Junior's girlfriend has been recast after just one season?Maybe if they had had more special appearances that would have saved it in the short-term but that wouldn't have been much of a solution with the way the standard writing on the show seemed to have gone downhill.I'm kind of sad because when the show started I was glad to see Tisha Campbell again."],"review-user":["supertom-3","Catherine_Grace_Zeh","SonicStuart","superboy478","Dart_Adams","liquidcelluloid-1","raulfaust","willsgal1","gluba2000","budikavlan","Derrado18","nilebix","InaneSwine","NasKid91","Mr_Sensitive","Queen_of_Shadows","texxas-1","wchngliu","alp_turantan","JackBauer112","LMSCheers","raysond","rodkblxan","Pat1973","star_power"],"review-date":["29 July 2004","22 January 2006","21 January 2006","20 May 2002","9 June 2006","7 January 2006","14 September 2008","3 September 2005","16 December 2004","30 November 2004","3 January 2004","19 February 2007","20 January 2006","8 July 2007","26 April 2006","4 May 2005","7 January 2017","25 June 2007","29 October 2005","19 October 2005","6 November 2002","30 September 2002","3 October 2013","2 April 2001","23 May 2005"],"review-rating":["9","7","8","1","2","1","2","4"],"review-title":[" Great show!\n"," An absolute ABC classic!\n"," A very silly show!\n"," FUNNY FUNNY FUNNY FUNNY FUNNY!!!!!!!!\n"," A Tale Of Two Shows...\n"," Began as an admirable effort by Wayans and ultimately succumbed to lazy, absurd and out of place sitcom impulses\n"," A really real and funny concept of family\n"," so good\n"," I Don't See What The Hype Is About...\n"," Considerably less than the sum of its parts\n"," Barely watchable\n"," An incredibly bad show\n"," Embarrassing\n"," A sorry modern day version of the Cosby Show\n"," AVOID It At All Cost\n"," Great show.\n"," Not a classic, doesn't age well\n"," Was tagged the 00s Cosby show- only this is nowhere near as great as the latter show\n"," The best family com ever\n"," I just started watching repeats of the show.\n"," Stupid, Stupid, Stupid\n"," The New Cosby for the millennium\n"," Very disturbing\n"," Funny! The New Cosby Show but BETTER!\n"," I USED to like this show.......\n"]}