{"review-url":["http://www.imdb.com/title/tt0270957/reviews"],"review-text":["I watched \"Fuckland\" a long time ago. I lied if I'd tell that I remember it in detail; what I remember most vividly is the irritation it provoked me and the feeling of a total waste of precious money and time, not only my time and money invested in watching the movie but also the director's.Supposedly, \"Fuckland\" is a critic of Argentinians, presenting us (I'm an Argentinian too) as little people who take credit for and even boast about petty, ridiculous victories, and think we're the best thing that God (who is also an Argentinian) created. I'm not going to argue that. It's probably a true statement about a quite big part of the population (the part I despise, by the way). And even if this weren't true, that's not my point. The worst sin \"Fuckland\" committed was to express such a statement about its own director.The continuous impression I received was that the director was too busy trying to impress us for sneaking a camera inside the islands to worry about making a good (even a mediocre) movie. Many of the takes made with a hidden camera are pointless. The director chooses to show off with a silly edition of old war takes and his own ones. And there's no plot at all.Moreover, this movie proudly presents a Dogme certificate before the opening titles, only to disrespect its principles afterwards (for example, by including the director in the credits - another sign of his pride?).I found the movie offensive, not as an Argentinian, but as a watcher. I felt underestimated. \"Fuckland\" is simply one of the worst movies I've ever seen.","The preposterous premise of this flick has to do with Argentina reclaiming the Falkland Islands, having failed through force in 1982, by impregnating the European women inhabitants with Argentinean sperm thereby diluting the ethnic purity until it favored Argentina. Yeah, right.  The reconnaissance is done by our hero/villan and cad, Fabian, who hauls his fish-eye camcorder from pillar to post secretly filming his encounters with the Falklanders including his courting and eventual conquest of one woman, Camilla. An unfortunate indie and fraudulent documentary, this flick favors us with lots of boring tourism shot from the hip....yada, yada, yada. The film has no plot potential and only begins to become interesting as Fabian and Camilla wend their way through the usual moments of awkwardness and uncertainty as they get from the handshake to the bed. \"F*ckland\" is only for those cinema purists who can appreciate the bleak,  no frills, jigglecam austerity of Dogme indies.","I will confess that once I started watching this movie, it had a hold on me that forced me to watch it through to its conclusion. Quite possibly this was some latent voyeuristic tendency in me that wanted to see our hero get it on with his victim, or maybe fascination that they got funding to make, distribute, and show this film that kept me searching it for merit, or possibly some bizarre wish-fulfillment fantasy that there might be a point at the end of all the pain. But no such luck.So you are warned to not start watching it in the first place, lest the same thing happen to you. There's nothing here worth wasting your hour and a half on.The first-person mockumentary and the schtick about Fabian's \"quest\" to impregnate women of the Falklands comes out even more like a sophomoric (maybe Freshman - high school Freshman, that is) film student project than you might imagine. The effect ends up being both sneering at the local inhabitants (who, other than the two professional leads, are in fact real people) as well as engaging in rather disgusting sexual politics (no matter whether you take it all literally or symbolically, it's pointless and sexist).The reason I ended up watching it all the way is the same reason that once one starts to pick at a scab, there's an irresistable fascination of continuing to do so until it's completely off, even when you know it's bad for you. You just want to see what happens.In the end, this is rather dishonest filmmaking, because it seems ultimately to have no moral center, no elucidation of the local political situation, nor any place in the type of political-sexual-personal film universe  a la Goddard. In short it's got nothing to say and spends a long time pretending it does. Smug would be the one-word tagline.I'd suggest the filmmakers rent 'Waiting for Guffman' a few times, or hell, even 'Blair Witch Project' if they want to pursue the schtick with a little more style and a little more genuine emotion. Or at least entertainment value.","What the \"first 4 letters of this movie`s title\" was the director thinking? This movie is crap, and the worst thing is that it tries to be smart or innovate filmmaking when all `Fuckland` does is make the Argentines look stupid. 1/10","Text Taken from 2001 Melbourne International Film Fest Guide.fuckland The title is a pun based on the film's lead actor Fabian Stratas' deliberate mispronunciation of Falkland, a reference to the film's setting and a rather less than subtle allusion to the secret agenda of its protagonist.Fabian is an Argentine national, an amateur magician passing himself off as a tourist visiting the Falklands soon after it is reopened to its people. His master plan is to win the ultimate struggle by seducing and impregnating the local females, commencing with the delicious Camilla,thus siring an entire generation of half Argentinians. Fuckland creates the illusion of a documentary and maintains a fish-eyed perspective that gives the film a voyeuristic flair and intimacy. (ARGENTINA)","Fuckland is an interesting film. I personally love the Dogma movement. I wish it had lasted longer. It seems to have already died. Many critics tried their damndest to shut it down. I don't know why. It's the most interesting movement to happen in the cinematic world since the French New Wave. Besides Fuckland, I've seen the first three in the series, Festen, Idioterne, and Mifune. They were all great, Festen being a masterpiece, in my opinion. Fuckland isn't up to those others. I was just fascinated with the filmmaking. It's played as if it were a real documentary, with a real person who was so obsessed with his camera that he refused to put it down. At a few points in the film, it becomes clear that it is a work of complete fiction, but that illusion was protracted for an amazing amount of time. I wish that the filmmakers would have come up with something a bit more interesting to put onscreen. It is basically about this guy, Fabian, who is an Argentinian visiting the Faulkland Islands. Argentinians were only in the last couple of months allowed onto the islands, and Fabian plans to impregnate the women with Argentinian children. He sets his eyes on one, and most of the movie is spent on her seduction. The two actors are very natural. Camilla Heany only kind of hints that she is an actress. Fabian Stratas seems completely real. The politics of the film are somewhat confusing to me, since I have only an inkling of the situation surrounding the island and its recent history. I was 3, I think, when the Faulklands were invaded. The final bit of the film doesn't work at all. I don't get what the filmmakers were going for there. Still, Fuckland is an interesting Dogma experiment. It does break some Dogma rules, though, notably the no extra-diagetic music rule. There is a lot of that. 7/10.","I started watching this movie a bit after it started.  I guess I might have missed 20 minutes, maybe less.  It said docudrama in the onscreen guide...so I wasn't sure if it was real or a drama made to look like a documentary. Or maybe it was a dramatic documentary?  I was buying it, believing it was all real.  It's not at all exciting...it's actually pretty boring watching the jiggly camera work (I guess it was a hidden camera or something most of the time?) and seeing this boring story play out, with a lead character who is clearly insane...wanting to impregnate a woman to start the argentine line of heritage or whatever his plan is.  Tho, it was fairly boring, it's one of those movies you cannot take your eyes off of.  I wanted to start watching something else...I was waiting for the next movie on Sundance Channel, but I couldn't turn the channel...and ended up watching till the end.  I HAD to force myself to get up and check this site to make sure it was fake...because, if it were real, I would be sick by this guy's behavior with, what seems like, a nice girl who seems to be falling for his crap.\nThe two lead actors do really nice jobs...until the final scene where Camila tells him the stuff on his camera, they seemed real and honest.  During that scene, it was obvious that she's an actress and it was all fake...from what I saw on this site, I still wasn't 100% sure (I only read the summary on the main page.)It's an okay movie to see once...but, only because it keeps ahold of you. It's not a good movie overall- just one of those rare things that keeps you watching just to see what weird stuff will happen next, and how these people that seem so real yet so fake could do the things they do (fall so quickly into having sex and starting this relationship and all.)\nI guess the filmmaker had his point, and he made it...or maybe he was trying to make entertainment, and he failed...either way- not great, but not the worst either.","If you remember watching \"Private Parts\" the Howard Stern story, you should remember a scene where the execs are discussing why if people hate him do they still listen; \"number one response, 'I want to see what he'll do next'\".That's what this movie is like.  Nothing really happens, but you still just have to see what will happen next.I had hoped for a few more moments to happen in the movie, but is still was an interesting story line and concept.You find yourself trying to figure if this is real, or if you're being taken.","I've seen this film for first time and I find it confusing. At the beginning, the movie starts as if it were about to show how Malvinas was under British society and government, though it doesn't. Only some scenes show how the people live, with some disgusting comments.The few scenes where it really shows how Malvinas are now, really shocked me. People driving on the right hand, with a British flag. I felt really sad 'cause that's our(Argentina's)island. And a not very friendly sign in the church: \"We accept argentinians as long as they don't say these land is their property\".. Moreover a comment from a Briton that also shocked me:\"-There are a lot of argentine people here\" \"-How much is a lot\" \"-One.\"About the film, I find it not very serious, 'cause it has some sex scenes that shouldn't be there, and with an unexpected ending.My opinion : ** out of *****","Fuckland is a funny movie with incredibly low production values and an interesting idea. It is promoted as a documentary about an Argentine man who wants to impregnate an English woman in order that Argentines can take over the Falklands by stealth. Most of the movie is shot in hidden camera mode and there is shots of the main actor walking around the Falklands supposedly finding an English woman to knock up.The confusing thing about this movie is that although the shots of the normal people on the island are realistic, it doesn't make sense that the filmmaker could film himself having sex with a woman using a sabotaged condom and then sell the doco to networks. Of course when one check IMDb we can see that the women he \"has sex\" with is an actor as well, and the documentary is not really a documentary, but a movie masquerading as a doco.The question that I have afterwards however is what was real and what wasn't. Did all the people the main actor spoke to know that he was filming? Did the guy really hate the English who live on the Falklands? How much of the dialogue was scripted?Overall it was an interesting movie, but it brought up a number of questions that will probably never be answered.","I saw this film the other night on the Sundance Channel and was completely into it. I couldn't change the channel and had to see what happened. I live with an Argentinean so the concept of this film was intriguing. And I know how and why the Falkland Island invasion in 1982 angers natives of Argentina. So the idea of a native visiting the Falklands to impregnate locals of the island in order to create new Argentine bloodlines and, in a way, recapture the islands, was original, interesting, amusing and also disturbing. It was disgustingly voyeuristic watching this man manipulate this woman in order to just have sex with her and get her pregnant. But when it was over I noticed that the two leads were actually actors and not \"real\". After some research I found out that this film was a \"mock\"- documentary and not real at all. Needless to say I was angered to learn of this. Still, if the filmmakers' goal was to fool us then they succeeded. However, if this film had been real it would have had more of an impact on me."],"review-user":["rominaferraro","=G=","wall17","Gil-Estel","cuz-5","zetes","JBoze313","BenDecho","gaston_","gripfaster","gnorm44"],"review-date":["17 February 2004","8 January 2002","10 July 2002","3 April 2002","1 July 2001","10 May 2002","20 July 2003","17 September 2001","9 July 2004","2 October 2004","11 May 2002"],"review-rating":["1","4","3","9","7"],"review-title":[" Cheap show off\n"," The whooshing sound you hear is this movie sucking.\n"," Fascinating, like picking a scab is fascinating\n"," Trash\n"," Dogmaland\n"," Worth a watch\n"," not great, but it does keep you glued to the screen\n"," No special effects, but you can't turn away....\n"," Confusing\n"," Budget film-making with a funny premise\n"," What a Haze!!!\n"]}