{"review-url":["http://www.imdb.com/title/tt0285086/reviews"],"review-text":["I just watched the movie tonight and i found it brilliant. It doesn't have special effects that blow your mind, and it's not violent or bloody, no terrorist or aliens but it's brilliant. It's just plain nice, sweet and it brought me to a whole different time, a much simpler time, where people could take their time to walk down the street and look out at the ocean. I think it was beautiful and I for one recommend it. Nick was a great character and his friendship with Harry was one of the highlights of the movie. Everyone is entitled to their opinion, but i believe everyone should watch this, mostly when they feel down, or when they want to share something nice with their friends.","This is a quiet movie. It's a simple story about a writer who cannot write his story coming back to his home town to get started but instead he gets involved in a friendship with a weird older man whose life externally represents perhaps the internal state of the writer - it's a museum of unfinished ideas, outdated equipment and \"useless\" people.There are no extraordinary circumstances or any big movements in the plot. It's a movie about internal changes. Being stuck in their lives which are not developing much, the principal personages get to help each other to transform, stop leaving in dreams and achieve something or at least get a change and give their lives the desired and long-awaited new direction.On the film-making side I can think of only one weakness which could also be considered as a feature - we do not get much of characters description or inner world insights. It's very narrative on the side of thoughts and events and we have to guess about their true feelings which are rather hidden but still you can see them, and this is what makes your own mind work, trying to figure them out, to understand the impressions made by those people, and it's not empty underneath - the actors definitely hold well some inner states proper to their characters. It's close to the real life where you mostly never know someone well enough to understand them completely, and this turns us around and puts in front of our own feelings and choices.What's most important for me is that this simple almost flat story leaves you pondering afterwards, about your own life, about your own dreams and achievements, are there any or are we caught up in the routine and pleasures, leaving at 100% or only dreaming about it, could we do more and move somewhere we'd rather like to be than just leaving feed ourselves and others the tales like \"I'll do this one day\"- not moving one finger to make this actually happen, or \"I'm fine where I am\" because it's easier to go by the habits than to actually make a change? At least that's the impression it left me with and it was very timely for me, which adds to my appreciation of this far-from-famous movie. I definitely recommend it to anyone who likes the movies meant for the heart but those who need events and actions should stay away.","I just watched the movie today and really enjoyed it very much. The film reminds me in ways of \"A River Runs Through It\", The cinematography was beautiful and memorable. It's a movie about changes and leaves you thinking. I definitely recommend it. The story really is about Nick and Harry's friendship and memory. This was cool for me to see because you don't see films like this that often. I know that even A River Runs Through It was difficult for Redford to get made because it's not exactly an intense action film and this film was along those lines. The story is simple, but I found it to be a breath of fresh air in movies and it will stick with me.","I saw FAREWELL TO HARRY at the Plaza Theatre while in New York city and was quite taken.   The performance of William Hall Jr. is tremendous.  This is a movie for the classic movie goer.  Garrett Bennett's direction reminds me of early Barry Levinson and Robert Redford's work.  The movie seems to transcend the typical independent film.  It has a soul and a visual power that is quite unique. I saw this with a small audience (400) who were captivated from the moment of the first credit to the last and although I wasn't out and out crying (like the lady next to me) I do have to admit I had a little watering in the eyes...","I had hopes for this movie. The plot was simple, a man comes home to be a writer, and meets the interesting denizens of his home town. FtH told us the story in voice-over and while I love Joe Flanigan's really odd voice, the technique took away from the story rather than adding to it. The closest cousin I can think of is \"A River Runs Through It\", but in that movie the V.O. didn't take over the storytelling, but added perspective to it. I think the problem is that the voice over is a film-noir technique, and the cinematography while occasionally brilliant, was generally flat, and in a naturalistic style which left me confused by the fusion of the two.Harry wasn't as likable to me as Nick saw him, and Nick wasn't as interesting as we were meant to see him. The characters were relegated to second status under the narration and never really allowed to become real. For all of its disparate parts, the movie wasn't great, but in a way it is memorable, if only because it had potential that wasn't realized.The absolute best part of the movie was the awesome original score/music by Mark Nichols.","I registered at IMDb solely for the purpose of warning others about this movie. Hwo does anyone ever get funding for projects like this? That's the mystery. Farewell to Harry might be the worst movie ever, except that I tried to erase the others that rival this blathering idiocy. Bad plot, not-credible logic runs throughout. I can't spoil this movie for you by revealing anything that would make your experience less enjoyable. There is nothing enjoyable about this movie. I have the CD and will send it to you for free, it is that bad. First come, only served. If I know you, this offer is void, because I wouldn't inflict this movie on anyone, not on purpose. YOU HAVE BEEN WARNED."],"review-user":["cristinafind","alavita","imamoviedude","richarddavisla","sasteiner@att.net","jgg-5"],"review-date":["25 September 2008","25 January 2010","22 July 2010","1 December 2001","18 March 2006","8 May 2005"],"review-rating":["10","8","10","10","5","1"],"review-title":[" I liked the movie\n"," Stop leaving in dreams and do something\n"," Solid Film... Intelligent\n"," The Majestic Meets Cider House Rules\n"," I was slightly disappointed.\n"," Inspid waste of time\n"]}