{"review-url":["http://www.imdb.com/title/tt0244782/reviews"],"review-text":["This is a tough film to review, since several factors need to be taken into account. Let's filter the more judgmental..Ok, are you interested in the facts concerning the serial killer of Jeffrey Dahmer? Can you withstand an independent, low-budget film? Are you objective enough to NOT dislike a film solely due to its lack of stars or professional look? Well, if you said yes then you should have a mind open enough to handle this one. This film is an almost 100% accurate dramatization of Dahmer's adult life and subsequent murder spree, and is styled as an autobiography. It isn't a glamorized, unrealistic account that unfortunately the theatrical film \"Dahmer\" (2001) was. The movie begins with Dahmer, played quite convincingly by Carl Crew, sitting in the police car as they raid his apartment. His thoughts of what got him there are presented to us in a past-tense, narrated style that accurately explains much of Dahmer's psychoses and motives which led him to commit murder almost 20 times. We get to know the character, both the devious side as well as the side that came moderately close to living a normal life. It isn't anyone's fault but Dahmer's that 17 people died, but being a criminal psychology student, I was pleased to more than just his animalistic side represented, truthfully, in this film. You see him having a loving relationship with his grandmother as well as trying to find companionship, but of course we witness the side of him that everyone remembers. It should be noted that there is little actual onscreen violence, with much of it suggestive in shots such as spattering of blood or a body being struck through a blurred curtain. You do see two deaths that I remember, one being a pretty bloodless throat slash and the other being a man shoved alive into a barrel of acid. While you don't see anything graphic, this cruelty and the convincing acting of both Crew and his victim make this a disturbing scene. And while the actual onscreen mutilation is kept low, you will see the results. There is a prop hand and head or two, but it seems as if this was to disturb the viewer and doesn't look to be exploitive. Besides, these fake anatomical pieces are where the budget limitations are visible. Although acceptable, they look enough like fakes to not be too disturbing. The film actually concludes before Dahmer's death in 1994, due to the fact that it was released a year or two prior. That's about the only big difference from the real story, and the information that remains is, as I've stated, very true to the facts. The film quality could be better, the dialogue often sounds a little too quiet, and the acting of several characters IS a bit hammy, but it's not overboard. In my opinion, this is a flawed but ultimately honest and serious look into one of America's most remembered serial killers. I think it's safe to say the film is memorable as well, and I respect it for overcoming its limitations to deliver the story in a believable manner, aided by a thoroughly excellent Carl Crew as Dahmer.","This film is the most traumatising and painful horror film I have ever seen in my life. To know that this film is based on a true story and watching Jeffrey Dahmer(Carl Crew) brutally murder his victims is enough to bring a tear to my eye. I admit this was a low budget film with not the best dialogue, however it explained why Jeffrey Dahmer was a Psycotic maniac. As he was so selfishly/inwardly emotional his emotions and selfishness went so far deep into his brain that it resulted into him becoming a murderer. Every person that he lured back to his apartment, he was attracted to and had feelings for, and the reasons why he murdered them wasn't only for the thrill of killing them but because he couldn't cope with the fact of them leaving him. In the scene when he killed his first victim by bashing an object at the back of the guys head from what I noticed wasn't because he wanted to kill him but because he was devastated with the idea of the guy leaving him. It was from thereafter that he got use to the homicidal behaviour and made killing his hobby - for both evil and emotional reasons.The scene when he was talking while crying on the phone with his mother and telling her how much he loved her and the love he showed to his grandmother and how he didn't want to move out of her house did show that he did have love in his heart. One scene that I found quite spooky and strange was when a priest overheard Jeffrey in a pub inviting a guy back to his apartment and then phoned Jeffrey up in a phone booth within the pub so that the guy would lose patience and change his mind on going home with Jeffrey. When the guy left the pub, the priest then hung up the phone and was was laughing at Jeffrey. I also found that Carl Crew played a remarkable acting performance as the role of Jeffrey Dahmer. His evil and cold blooded facial expressions before he massacred his victims were so real, I was shivering in my seat. His facial expressions reminded me of the way Vincent D'onofrio (Private Pyle/Leonard) in the film 'Full Metal Jacket' looked just before he gunned-down the General in the toilet barracks.If your an emotional person I wouldn't recommend you to watch this film but if your not, than go ahead and watch it.","Prolific real-life serial killers seem to merit at least one big-budget film or at least some made-for-TV movie with a one-time star. This grisly, direct-to-video take on the late, infamous Dahmer (killed in prison in 1994) is pretty obscure and hardly ever even talked about by the most devout of horror fans. Carl Crew, who also scripted and co-produced, is Dahmer, and the film follows him from Bath Township, Ohio to his subsequent arrest in Milwaukee. Using the prospect of money for nude pictures, he lured dozens of men to their deaths. Scenes of him dismembering bodies with an electric saw, dipping live people in acid, performing botched lobotomies and caressing skulls and various body parts are appropriately disturbing and hard-to-shake. The films impact is enhanced by the low-budget mock documentary-style direction and grainy photography, but it's not in the same league as HENRY: PORTRAIT OF A SERIAL KILLER. Unfortunately much of the realism is killed by some lousy supporting performances and an uneven script full of unintentional howlers.","Hey what do you expect form a very low budget movie!?!? Although I haven't seen \"Dahmer\" (2002) I can say that following what the media put out about Jeff this is a pretty accurate depiction. I have studied the Jeffrey Dahmer case and learned all I can about this man. This is a low budget movie but it shows the mentality of a serial killer. If you can get past gore and see what the underlying story of a sick mind. I loved this movie! Just brace yourself for low budget and no blood. Its a story as seen through the eyes of a killer and his actions and thoughts from childhood up through his arrest. My favorite line is : \"If they had bothered to look in the back seat it might have saved a lot of lives\" Enjoy!","Considering the type of films one usually comes across produced on this low of a budget, Dahmer \"The Secret Life\", is suprisingly well made. Despite it's shortcomings;tedious scripting and dialouge, sub-par cinematography, and repetative scene structure-(i.e. two or three run-throughs of Dahmer's modus operendii would have been more than sufficient.) definate high points do shine through. Carl Crew's acting job held my interest till the end. Special make-up effects were better than I've seen on alot of \"Big Budget\" movies. The producers seem to have spent most of the limited funds where it counts most anyway. Overall, I'd rate this movie with  three out of a possible four stars.","This movie was fantastic and boy was it a powerful look at Dahmer. I liked it much better then the newer movie that came out this year. What ever happened to Carl Crew who plays Dahmer in this film? Not only is he damn good looking but he was a great actor. It's sad he did not have a longer and more exciting career in the business,especially when you consider the many undeserving talentless actors out there going strong. Anyway,the film is very entertaining,Carl Crew is a breath of fresh air to watch and the plot moves along great. See the movie. I only wish the DVD was better quality,but it's better then nothing.","The Secret Life of Jeffrey Dahmer is a necessary movie.  Carl Crew's acting is excellent, especially under the circumstances of a film made from documentary information, about this dull boy, who really has no life at all (within himself, at least).  Carl gives the whole as extremely factual, near to the bone but not over-gory, and with emotion too.  Although Jeff was known for not being the coolest of guys, and Carl portrayed Jeff in this film to be a teeny bit hip in parts - this was really pretty irrelevant. What was relevant was the facts of Jeff's life, purely! His childhood included, the whole of his years of killing, and the abandonment Jeff felt so often..unbias, nothing blamed.  And if anyone was to think that Carl Crew may have 'strange notions' to do the film, he has just gone one step further than those who have written the Dahmer (et al) books, who have gone just one step further than all of the millions of people in the world who study criminology, psychology law etc etc etc.  Excellent Film.","The acting is funny, let us get that out right away. You will laugh at just how bad the acting is from the victims of Jeffrey Dahmer. The final victim who survive has some of the funniest acting ever. His eyes are huge, his mouth is opened wide, and all he says is \"Oh my God, oh No, Oh Jesus.\" The crimes of Milwaukee's Jeffrey Dahmer is nothing to laugh about, but this movie is downright funny.And funniest of all, this is the best movie about Jeffrey Dahmer. It details his gruesome killings of men in the 90's, but doesn't really go too deep into his mental state. It is funny because of the bad acting, but it is also chilling too because you know that at any moment, Dahmer was ready to kill, rape, and eat his victims. Dude was hungry, and he didn't have money for food. He hunted his food in the streets of Milwaukee. Dahmer still continues to live in the mind of Milwaukee, and it seems like every few years people make movies about Dahmer in order to keep his spirit alive. Milwaukee is known for one thing, and that is Jeffrey Dahmer. This is a good movie to watch, might make you squirm at some scenes and laugh at other scenes. This movie surprisingly has a great soundtrack. When Dahmer is killing his victims, the filmmaker decided to put these really cool 80's sounding music in the background. It is a weird thing to do but yea, if you are a fan of Jeffrey Dahmer or are interested in the phenomenon behind Jeffrey Dahmer, the most memorable American serial killer, then give this movie a watch. It is a cheap looking movie, but worth your time.","The Secret Life: Jeffrey Dahmer is slightly interesting, but it goes around in circles too much. It never really taps into his mind, or shows why he is, what he is. It just shows Dahmer luring countless victims, and that's it. The special they did on Dahmer on the show Mugshots, was much more informational and interesting. Overall, slightly interesting, but the special they did on the show Mugshots, is far better. ** (out of four)","\"The Secret Life\" starts with the worst possible narrative intro: \"The crimes committed by Jeffrey Dahmer are too horrible to make a film about...\". Okay, so what are you suggesting? That we shouldn't bother to continue watching as the film won't be accurate or bloody, anyway? And they were right, too! The film isn't the least bit shocking and contains almost no blood or gore at all. Although I think that's mainly due to the low budget production values and not because of Dahmer's crimes being too horrific. Basically, \"The Secret Life: Jeffrey Dahmer\" is just one sequence repeated over and over again. Young, pitiful and mentally confused Jeffrey picks up victims (always males, as he was a homosexual), kills them and then talks about how it wasn't his intention to hurt them and about how lonely he is. This gets boring really quick and even the admirable performance by unknown actor Carl Crew can't save this movie from being a total dud. Still, this version is much better than the pretentious and hopelessly muddled \"Dahmer\" that got released in 2002.","I bought this used and only payed $1.99 for it.  That said, it's worth that kind of money.  It's pretty decent for an extreme-low-budget film, but it could have been much better.  To me, Carl Crew wasn't believable as Jeffrey Dahmer.  He wasn't the right physical type, nor did he speak with Dahmer's distinctive nasal accent.  And frankly, the constant \"I should have stayed with God\" diatribe becomes annoying after a while.For a more realistic and subdued look at Dahmer's life, see the new film \"Dahmer\" with Jeremy Renner.  Renner's performance as Jeffrey is so dead-on, it's scary.  And while it doesn't get into as many of Jeffrey's killings, everyone should already know the basic story by now.Bottom Line:  If you can see this movie cheap, it's worth a look.  But the 2002 movie is far superior, in my opinion.","I'm giving this an 8 because.. For the whole duration I was watching I was absolutely god snaked! \nPlease do not listen to previous post. This is far superior than the unconvincing Jeremy Renner Dahmer, whom didn't play the role as good as Carl Crew. Plus Renner's was more \"Hollywood\". Jeremey is far to cool to fit into a Dahma role. Why an 8?\n This is a narrated film, you are exposed to some of the most psychotic sociopath behavior and extreme cruelty while being narrated rather well. I was sick to my stomach with shock, which is what I want in a true life serial killer and Grindhouse, Giallo film.","Notorious serial killer, cannibal, and sexual offender Jeffrey Dahmner (a fine and credible performance by Carl Crew, who also wrote the morbidly fascinating script) murders more than a dozen people for fourteen years before finally being caught. Director David R. Bowen and writer/lead actor Crew cover all the well-documented facts of this awkward, repressed, and alienated loner which include his first murder, living a lonely existence in an apartment, dealings with his neighbors who constantly complained about the foul stench emanating from his apartment, his infamous killing spree (Dahmer would pick attractive young guys and take them back to his place under the pretense that he was only going to take explicit photos of them), and his eventual capture by the authorities. This picture's key triumph is that it manages to make Dahmer a recognizable and sympathetic human being without whitewashing the severity of the atrocious acts he committed. Moreover, there's some pointed social commentary on people giving too much trust to complete strangers and the ineffectualness of rehabilitation programs for convicted sex offenders. The matter-of-fact presentation of Dahmer's gruesome misdeeds gives this movie a genuinely clammy and chilling edge while the subtext about Dahmer's guilt and shame over his homosexuality adds a touching element of pathos. Ronald Vidor's rough cinematography provides a convincingly gritty look. Bowen's melodic and unobtrusive score likewise does the trick. A sound and evenly handled docu-drama.","***Possible spoilers***I've read up on Dahmer a little and saw the new Dahmer film (with the same name) at an earlier time. This movie here concentrates rather much on the victims and killings, too little on Dahmer himself. The film called \"Dahmer\" had the opposite problem, it was too little about his crimes and too much about himself.I did not find the acting to my satisfaction, it had a certain amateur feel too it, especially the probation officer. It also seemed as if the Dahmer acting got worse every time he played against the probation officer actor. But I might be wrong about that.What annoyed me a bit was that some of the scenes were quite disturbing but that the filmmakers seemed to try and show \"the real deal\" about what he did anyway. That is ok - but what I then don't understand is why the guy who ran away from his flat while Dahmer was out getting beer, was not depicted being naked, since that is also how it happened. It's not a big deal, but it just eats away further on the movies quality that such details are left out. What wasn't shown either or not even really hinted was Dahmers sexual obsession with the dead. Again, I don't mind they didn't SHOW it, but at least they could have mentioned it or built it in to the movie somehow.Conclusion: I think the really good Dahmer film is still to be made, a movie that incorporates not only Dahmers crimes but also who he was, and why he did what he did. I think that 1.5 or 2 hours are just not enough to grasp the complexity of it all. This movie was just a cutout (excuse the pun) of Dahmers life and personality and does not give you any 'close to good' insight into his life or personality.4/10","'The secret life: Jeffrey Dahmer' is, as far as I understand it (I know about quite a few facts, but not all), true to the facts that are known about the infamous serial killer of the same name. Of course, it is still an interpretation as far as the acting goes, and Carl Crew is a very mediocre actor. The dialogues will also have been interpreted freely, because Dahmer never told everything that happened word for word. Also, a movie that covers such a long period of time, must choose its (key) events, but this is pretty much a series of (gruesome) killings, skipping time when it pleases in order to show as many of them as possible.The film has a striking soundtrack, but it's also borderline cheesy. The settings are cheap, but of course this low budget stuff (I would assume, although one wonders how they had access to so many cop cars and rather neat gory elements such as the severed heads). Talent and charm can beat low budget, but I wouldn't say there was much talent involved here. Charm then? Well, here and there, but the movie fails to tell an evocative tale, this is mostly cheesy exploitation, even if I'm not exactly sure of what the director (/makers) intended.It was just barely worth my while, because I'm interested in many serial killer cases, but it took me several sessions to muddle through it. I would advise anyone to go watch 'Dahmer' (2002) or read the comic 'My friend Dahmer'; they have lots more to offer in atmosphere, a gripping story, etc.. Still, for serial killer (Jeffrey Dahmer) completists...A small 5 out of 10."],"review-user":["manalone923","EJBaggaley","capkronos","elleinad3303","wamslv","Rick-135","majestry","kxyang","Car316","Coventry","james_oblivion","unstableindustrialeffluents","Woodyanders","illegal_alien51","punishmentpark"],"review-date":["15 October 2003","5 December 2004","3 January 2006","2 August 2008","22 November 2002","31 August 2002","12 May 2000","20 September 2018","17 July 2001","30 April 2006","7 September 2002","15 October 2018","22 July 2011","11 December 2003","24 February 2015"],"review-rating":["8","7","5","10","8","3","8","8","4","5"],"review-title":[" Low budget but true to the facts\n"," Horrific\n"," Unrated, uneven, but fairly accurate.\n"," Great movie\n"," Suprisingly well made\n"," Wow!!!\n"," Lesson if Life??\n"," Still the best movie about Milwaukee's Jeffrey Dahmer\n"," Slightly interesting, but it goes around in circles.\n"," Serial Boredom\n"," Eh...not bad.\n"," As strong as Henry: Portrait of a serial killer!\n"," A worthwhile portrait of a seriously troubled soul\n"," Just not good enough\n"," For serial killer (Jeffrey Dahmer) completists and / or cheese fanatics.\n"]}