{"review-url":["http://www.imdb.com/title/tt0251422/reviews"],"review-text":["You must watch this because it is so bad. My climbing buddies and I watched this and laughed our asses off for a week afterward. Now, the movie's cheesy one-liners are part of our everyday lingo. It is the cult movie of climbing: the one that everybody loves to hate. The movie makes no sense. The climbing makes no sense. This is why it's hilarious. Oh, and also because they have a hilarious scene with a bear, which is so poorly done that it's obvious that the footage came from some other source. Oh, and I almost forgot the theme song to the movie, which I can guarantee you will be singing every time you go climbing: \"Take it to the limit-limit, got to doit-doit...Watch this movie tonight, or better yet, \"Screw this, let's go top-roping!\"","Wow. this movie is the voice of a climbing generation. Director Sam Keith takes us to the darkest depths of Man's soul where we find love, life, and top-roping. World-weary Telly (Leo Fitzpatrick) follows his heart and his anchors through a cerebral journey to find sanity in a post-apocalyptic Colorado. Instead, Telly meets confrontation in Don (Jason Bortz), the embodiment of machismo and a zeitgeist of humanities foibles. The epic film comes to a climbax at a gut-wrenching top-roping competition that will make even the strongest willed viewers squeamish at the dizzying heights.This movie has it all: Top-roping outside, Top-roping in the gym, Cut-off shorts and sleeveless flannel shirts, Awesome climbing footage (some so good, you see it 2 or 3 times!), Bear and snake attacks.I gave the movie 8 out of 10 because I wanted to see the romance develop a bit more. It seemed as if the film was leading up to a spicy, top-roped sex scene between Telly and his new lover, but alas, it wouldn't fit into the already jam-packed hour and a half thrill ride.Fans of Cliffhanger and Mission Impossible II will find this flick to be a diamond in the rough. Overall, if you are ready to challenge your world view on humanity and climbing, this is the film for you!!!1","My friends and went through a period of time when we would rent movies that none of us had ever heard of. The only good that came from it was this movie, \"Take it to Limit\" Right as the movie started, we could tell we were in for a true classic. The music is probably done by rural white boys from Colorado, but it sounds just like early 90's rap. The star of the show, actor Leo Fitzpatrick, plays the bad-boy so well, especially sporting a big zit the entire movie. This movie is based on climbing, and I'm not a climber, yet even I think it's hilarious when they have the climber struggling to climb and there's a guy in the background who is basically walking up the 'cliff'. You don't want to miss this movie, you'll get to see the same clips over and over again. You'll get surprises at every turn. You'll find yourself quoting the unforgettable lines. I highly recommend this movie to anyone. Take it snow. Disclaimer: This movie is poorly done, but that is what makes it great","Wow. We watched this film in the hopes that it would have at least some decent rock climbing scenes. We were disappointed there, but it was still a great movie! It was soooo cheesy it was great! I haven't laughed so hard at a movie in a long time. If you are into rock climbing, and you enjoy cheesy movies, then this one is absolutely for you!","A city boy gets in trouble with the law and has to go into the mountains to live with his uncle. He meets the local kids and gets on the bad side of the hot-shot climber. They challenge each other back and forth until the final showdown at the end. Super cheesy, but totally worth the watch if you're into climbing. No 'good' scenes or any action, so don't expect any entertainment other than the hilarity of movie itself.To sum it up, the clouds are sideways in at least one scene while the actors are free climbing, and in most scenes you can tell the rock face is far from vertical. If you like making fun of movies and you like climbing, this is a must! I assumed this movie was from the 80s, the theme song sure sounds like 80s rap, anyone know where I can get a tape of it?","This is possibly the worst movie i've ever seen, it was horribly done it didn't flow it was very choppy, because of that many people didn't understand the movie at all. I had to watch this movie several times before I got an idea about what was happening, OK its like this a kid stole someones car and while running from the police he totals it, for some reason the cops let him off and he has to face his parents who sent him to live with his uncle out in the wilderness, there he meets a girl who loves to rock climb and he gets into the sport and has to beg his uncle to let him enter a contest for climbing, and yeah thats about it like i said horrible movie."],"review-user":["inmidair","freebase20","romney013","OoklaMok","cacheone","patch1313"],"review-date":["19 September 2004","18 June 2008","21 May 2009","29 January 2001","17 May 2007","8 June 2005"],"review-rating":["8","9","10","1"],"review-title":[" If you are a climber, you must watch this\n"," Two words: AWESOME.\n"," You don't need to be a climber to enjoy this\n"," Cheesy fun...\n"," The fast and the Furious III of rock climbing\n"," Awfule Movie\n"]}