{"review-url":["http://www.imdb.com/title/tt0284490/reviews"],"review-text":["I put down this vehicle from Robert De Niro and Eddie Murphy, and Murphy in particular the first time but having seen it again, recently, I can see that it does have some very funny bits.This is by no means to say that this is the greatest buddy comedy of all time, but really what can you do to the already exhausted subgenre? What director, Tom Dey, has tried to do is make it a satire of the clichés of buddy comedy and the media. Early in the movie the executive of a cable network asks: \"How is this different from Cops?\", when Chase Renzi is pitching the idea of a reality show dealing with De Niro's character, Mitch Preston (hilariously boring name by the way). That's when I saw it in a new light that I hadn't previously noticed.The idea is to show all the elements of the buddy comedy and put a twist on them. De Niro's reluctance to star in the show and to partner up with Murphy is right out of every cop film you can think of. You can say that De Niro is actually playing himself asking: \"Why would I do another movie playing a cop?\" Chase Renzi is portrayed to be a Hollywood phony but if you look at her opening scene again, she is merely doing it to save her job. She somehow sees the ridiculousness of what she is doing but she wants to succeed despite that. One line says it all: \"Who doesn't want to be on TV?\" Maybe this is reading too much into what is essentially a lightweight film, merely set to entertain, but it does give it a little spin that I hadn't noticed before.As for Murphy. You got to applaud him for looking this ridiculous. Trey wants to be a star so bad that he is willing to sell out everything he comes in contact with. Murphy was a big star and maybe it struck a nerve that it is all so fleeting.The plot with the gun is of course pretty boring. The action sequences are nothing special, except the end which required a lot of effort both from cast and crew. One thing that I noticed about the villain is that he is dressed like an 80's pop star. George Michael comes to mind and that adds to the whole media spin.So, I trashed it the first time around but what the heck; if you are gonna do this, why not point out how ridiculous it really is and De Niro and Murphy took a big chance doing this.","I don't care what some of the reviews said, this movie was funny.  The thing with this film is that you can't expect anything else except to be entertained.  This is not some intellectual comedy, this is a clever popcorn movie.  The three main cast members are great and work very well with each other.  Shatner is a standout in the supporting cast as himself, a former TV cop, brought in by Russo's character to coach the cops on how to be \"TV cops.\"  Those are by far the funniest scenes.  If you want to be entertained and just sit back for a laugh, then watch this movie.","I cannot understand why so many people did not like this film. Robert De Niro was on top of his game, delivering his lines with such aplomb, one has to believe this is his everyday demeanor. Granted, the film seemed to take on many buddy-film conventions while trying to make fun of the concept, it goes without saying this film was genuinely funny. From the police dog, to the fact Eddie Murphy didn't annoy the heck out of me, this film is a real keeper. Rene Russo also evened out the rest of the cast perfectly, establishing her role so it does not interfere with the budding relationship between De Niro and Murphy.","Robert De Niro and Eddie Murphy star in Showtime as a couple of cops- a quiet, efficient Dirty Harry-like cop and a cop who is deep down an actor, respecively, who are brought together by an accident and forced to take part in a cop-buddy reality TV show for a hungry for ratings producer (Rene Russo).  For the first two acts, it delivers a good time in parodying old cop/buddy movie cliches and shows how De Niro and Murphy have some intelligent chemistry in a comedy, but the third act dips by leaving the parody and becoming what it's making fun of.  In all, a conventional and surely enjoyable escape on a weekend day.  B+","I went to see this movie not expecting much, but was pleasantly surprised by the teaming of Robert De Niro and Eddie Murphy.  It was a fast paced movie and the hour and a half went by fast.  This one certainly won't win any Academy Awards but it was a change of pace for Mr. De Niro.  He is good in comedy.  Overall I enjoyed it.","This is a funny movie.  The Bob & Eddie Show feel of it could lead to a sequel but I doubt it will make enough money.  Deniro proves he can be a great Straight man again with some hilarious and spontaneous moments.  Eddie was fun to watch working with people instead of CGI animals and rodents.  Rene Russo- well she's just fun to watch anyway and she's played her part excellent.Some wild and unusual stunts, especially the garbage truck scene. This was worth seeing in the theater.  We needed a good laugh and got many from the movie and the great out-takes at the end.  DO NOT LEAVE at the start of the credits!At least a 7.","This was a pretty good modern-day comedy with straight man Robert De Niro doing a good job with comedy and Eddie Murphy just playing his normal whacked-out character. You get a good combination of humor and action in here. It had the normal cliché the ending, the kind you can see coming a mile away, but it's okay; it didn't hurt the film.William Shatner was very entertaining in a supporting role and I think that was De Niro's real-life daughter playing Rene Russo's TV sidekick in the movie.A decent cop-buddy film that isn't memorable an entertaining way to kill an hour-and-a-half.","About the best thing that can be said for `Showtime'  a throwaway cop buddy comedy starring Robert De Niro and Eddie Murphy  is that it demonstrates that an inferior script can be at least partially overcome by first-rate performances.You can't go too wrong when you have acting talent of this caliber working for you.  De Niro and Murphy portray two LAPD officers who are recruited to be the central `characters' for a new `Cops'-type reality TV show, wherein a camera crew will follow the two on their appointed rounds as they chase suspects, round up criminals and, all in all, make the streets of LA safe for the common, decent citizens who reside therein.  De Niro's Mitch Preston is a reluctant participant in the series, while Murphy's Trey Sellars is a wannabe actor with stars in his eyes who sees this as his golden opportunity to make it big in show business.The initial problem with `Showtime' is that it feels more like a `high concept' exercise than an actual movie.  Despite the fact that there are a number of funny moments in the film, too many of the scenes fall flat both as comedy and as action drama.  The saving grace is that De Niro's understated cynicism provides an effective counterpoint to Murphy's over-the-top enthusiasm, resulting in just enough comic tension to wring laughs out of even the weakest of material.  It is a joy to watch these two pros at work and they are nicely complemented by Rene Russo as the driven TV producer whose brainchild serves as the excuse for the story.  William Shatner, playing himself, also generates some laughs, often at his own good-natured expense.Yet the film itself is a failure.  One of the prime dictums of the screenplay is to try to show the discrepancy between police work as it is portrayed on the screen and police work as it really is.  In fact, the film opens with veteran De Niro instructing a class of elementary school children about the mundane realities of life on the job.  Yet, the film betrays its own theme by itself indulging in all the inane shoot-em-up and car chase scenes it is supposed to be satirizing (the scenes are not exploited for comic effect, which might have lent some much needed satirical bite to the proceedings).  Even worse, the `serious' side of the story, involving drug deals and gun running, fails to generate any interest or suspense.\nOh well.  De Niro and Murphy are such likable comic actors that the movie, for all its many weaknesses, manages to whiz by without inflicting too much boredom and pain.  `Showtime' is a completely forgettable and innocuous little time waster, but fans of these particular actors will at least appreciate their efforts.","Of course, I could be wrong but I seriously doubt that the film in question, Showtime is not to too many folks the greatest movie ever made. However, Showtime is a pretty decent buddy action/comedy that is fairly entertaining. Eddie Murphy and Robert De Niro are a mismatched pair of cops that are working together and are being filmed on a reality cop show called Showtime. Both of these actors are great at what they do with De Niro being an excellent dramatic actor Eddie is a comic genius and while Robert De Niro is one of the best actors of his time Eddie Murphy is equally talented in the comedic realm. Also, both of these guys worked with director Martin Breast and made two of the best action comedies, Beverly Hills Cop and Midnight Run. Showtime can't really hold a candle against either of these classics, but still is pretty fast paced, lighthearted and action packed entertainment. Both Murphy and De Niro are great here, but the film itself is nothing spectacular. You could do much worst for an evenings entertainment and this is in my opinion, Eddie Murphy's best modern comedy that suites my tastes much better than the crappy family movies he has focused on since his classic period in the 80's and early 90's.","Despite of all the negative criticism I really enjoyed this movie. I am not saying this lightly. I love movies and am fairly picky about them (my home DVD collection is over 9,000 movies - some are great, others are OK, a few I do not like at all). And, to all those with criticisms: this is a comedy. I simply love this movie. It is light, funny, and very restful. I am aware of all (or most) of the deficiencies but I love it. The comedic talents of Eddie Murphy and Robert DeNiro are tapped (fully - for this type of movie). Do not compare it to other movies with these star actors, simply enjoy it. The cast is great and, I believe, that the purpose of this movie was fully accomplished. If you want a really \"easy-going\" and very restful night - watch this movie. DeNiro and Murphy simply had fun making this movie, so should we (watching it). And, please, do not be so negative. Do not expect Godfather performance or Meet The Parents from DeNiro, do not expect comedy blockbusters performance from Murphy... It is a completely different genre, and it made me relax after a hard day work. Your sides may not split from laughter, but it is still VERY funny.","Watching Showtime I got the impression that the producers got the idea to put Robert DeNiro and Eddie Murphy just for the sake of having a film that co-starred the two of them. Other than that I can't think of a reason to justify the film's existence. Not that it isn't amusing in spots, it certainly is, but the concept is so completely ludicrous that the laughs are somewhat muted.The thing that really got me was Eddie Murphy's character. I can't seem to wrap my mind around the concept of someone being a police officer as strictly a day job. When I was working person at New York State Crime Victims Board I had to deal with all kinds of cops and they ran the gamut between the really dedicated and some real slugs, but I can't think of one who thought that this was just something I do until I get my career going in an area far afield. I mean, can you really see Eddie Murphy or anyone else going through the rigors of the real Police Academy, not the screen version, just to get a day job?Anyway DeNiro is your basic hard working detective who's on the trail of a major gun dealer. He's undercover and Murphy is part of his backup. So what does the showboating Murphy do, he calls a reality based TV series like COPS to film the action. So DeNiro's bust gets blown sky high, but the producer of the show gets some good footage of Murphy and DeNiro and decides on a new reality based television series. So these unwilling partners get joined and try to continue working DeNiro's case with all the TV cameras around.Eddie Murphy's a funny guy, I loved him in Beverly Hills Cop and in the Doctor Doolittle movies, but he's done better things than Showtime and Robert DeNiro certainly has. I guess Murphy wanted a chance to work with DeNiro and DeNiro must have gotten one hefty paycheck to do this film.","SHOWTIME(2002) (3/5stars)Starring ROBERT DE NIRO EDDIE MURPHY RENE RUSSO And WILLIAM SHATNERIn the new cop-buddy film Showtime, Robert De Niro plays Mitch Preston,  a tough NYC cop, who in the opening credits distinctly points out that being a cop is nothing like the movies portray with their clichés . Eddie Murphy plays Trey Sellers, a cop who dreams of acting in films. After Mitch shoots out a TV camera at a crime scene, a network executive (Rene Russo) decides that they will sue the police department, unless Mitch agrees to be part of their new reality based cop show. When Mitch is forced to become part of the show, he ends up getting Trey Sellers as a partner. Trey is nothing like Mitch. Trey is goofy, doesn't follow standard police procedures, and doesn't take his police work seriously. Mitch is the exact opposite. So here comes the average cop-buddy film, right? Two opposites, forced to work together, who in the end patch everything up and become best friends? Not exactly.What makes Showtime different from the rest of the cop-buddy films in the genre, is that the whole situation is different, and is not exactly what you'd expect. Never before has a cop-buddy movie had the officers followed around with a camera. So with this in mind, this movie might be great, right? Again, not exactly.The problem with Showtime is, it could have been so much better. The camera really could've gotten some funny stuff. But in this film, instead of focusing more on the fact that they're constantly being filmed, most of the film we don't see the camera man following them. We see them at home, or talking about things, doing things. We never see the camera man with them. The film focuses more on what it's like to be followed by a camera, instead of WITH a camera. What I mean by this, is that we are shown footage of how Mitch and Trey react AFTER filming. It's like a celebrity bio. We see them behind the camera, their ordinary lives, and how they cope with paparazzi and spotlight. However, in Showtime, that's not what we want to see. We want to see the camera chasing them the whole way through the movie. We want to see Mitch and Trey react on the spot, dealing with the camera THERE and THEN, not later. It would be so much more of a fun movie, if we could just see Mitch and Trey, the whole time being followed on the street, getting into funny situations instead of what Showtime gives us-a look at how Mitch and Trey deal with it after their work day is over, and the cameras stop rolling. I'll admit, this happened a few times in the film, but it should've been more. The director really missed out on a funny movie here, by not portraying it the right way, and not taking it in the right direction.We find the plot in this film, to not really be taken seriously at all. No one really cares. At one point, Mitch and Trey get a big lead, and the camera doesn't show them react at all to it. They just go off, and we see them joking around driving in the car again.The acting in Showtime was good, but the chemistry between the characters wasn't all that special. Nothing jumped out at me with DeNiro and Murphy. I've seen much better chemistry between actors. It wasn't horrible chemistry, but it wasn't great, either.All in all, what Showtime could've been, it isn't. It more or less forgets the cameras are following these cops, and just leads us away from caring about anything going on. Showtime is like a mix between Lethal Weapon, Beverly Hills cop, COPS, and Turner and Hootch. It may sound like a weird combo, but it's true. Some of those films/shows are great, but if you combined them the wrong way, with wrong directing style and progression, what would you get? Showtime.So, do I recommend this film to you? Believe it or not, yes, I do. Because though it wasn't great, and wasn't half of what it could've been, it's still got some funny moments, and Robert DeNiro gives us the ol tough guy cop image like some of his other films, and Eddie Murphy redoes his `Break all the rules/procedures, goof off and triumph!' attitude. So though Showtime isn't great, a one time viewing isn't going to hurt. DeNiro's expressions throughout the movie help a lot. That's why I recommend renting and viewing the film once. 3/5 stars, enjoy!","Like some other review said, I gave this movie a 10 because it made me laugh and it's well produced. De Niro and Murphy roles are amazingly delivered by each of them, and even the dog scenes are to make you laugh. My favorite part is when Russo describes Mitch's apartment as a good match to his personality as she opens the window and she finds that the view from there is a brick wall. My other favorite part is the dog with his nose covered in white dust. Another scene is Mitch trying to get out of his new Hummer without being noticed by his fellow co-workers. One of my heart breakers is when they try to take away everything Mitch given to decorate his apartment to make it look sophisticated, but he holds on to the dog that he didn't even want in to begin with.","SHOWTIME is supposedly a spoof of reality TV. It is about a pair of mismatched cops are made to join forces in order to participate in a reality TV show.The problem is that, whilst it is supposedly a spoof, it actually follows the conventions so closely that it just comes off as a rather dull buddy cop flick. This interesting angle on a familiar genre is lamentably under used, descending into a cameo by William Shatner full of poor jokes about T.J. HOOKER. Like THE LAST ACTION HERO, it actually metamorphasises into the very thing it is mocking. Unlike that film it isn't entertaining.Robert De Niro looks tired and old, clearly in it for the cash. Eddie Murphy continues to be the most annoying man on film. Rene Russo gives it her best shot but is let down by weak characterisation and a lack of anything to do.The film takes over half its running time just to get the two cops set up, leaving them very little time in the latter half. To keep the running time down the investigation is made absurdly easy. The baddie is utterly generic, as is the McGuffin and the stakes are non-existent. The screenplay must take a lot of the criticism for this, being poorly paced, characterised and unfunny. A good car chase and a single good stunt involving a flood in a penthouse apartment fail to redeem the film. A poor effort.","If you've seen the trailer for this movie, you pretty much know what to expect, because what you see here is what you get.  And even if you haven't seen the previews, it won't take you long to pick up on what you're in for-- specifically, a good time and plenty of laughs-- from this clever satire of `Reality TV' shows and `Buddy Cop' movies, `Showtime,' directed by Tom Dey, starring Robert De Niro and Eddie Murphy.\tMitch Preston (De Niro) is a detective with the L.A.P.D., and he's good at what he does; but working a case one night, things suddenly go south when another cop, Trey Sellars (Murphy), inadvertently intervenes, a television news crew shows up and Mitch loses his cool, which results in a lawsuit by the television station that's going to cost the department some big bucks. Except that they may be able to get around it, thanks to Chase Renzi (Rene Russo), who works for the station and likes what she sees in Mitch-- enough to pitch an idea to her boss for a `Reality' cop show, that would feature none other than Mitch Preston, whom Chase sees as a real life `Dirty Harry.'\tHer boss likes the idea and gives Chase the green light.  Now all she has to do is convince Mitch to participate, which shouldn't be too hard, since the station has agreed to drop the lawsuit if he will do the show.  But Mitch is a cop, not an actor, and he wants nothing to do with any of it-- that is until he has a heart-to-heart with his boss, Captain Winship (Frankie Faison), who puts Mitch's future into succinct perspective for him. And just like that, the show is on.  Oh, yes, there's one more thing; for the show, Mitch is going to need a partner.  And who do you suppose they're going to come up with for that?  Let's put it this way:  Trey Sellars is more than one of the usual suspects.\tThis is Dey's second film as a director, his first being `Shanghai Noon,'-- also a comedy-- and he's definitely showing a penchant for the genre.  From the opening frames he establishes a pace that keeps the story moving right along, and he allows his stars to make the most of their respective talents and personal strengths, including their impeccable timing.  With stars like De Niro and Murphy, Dey, of course, had a leg up on this project to begin with, but he's the one who keeps it on track, demonstrating that he knows what works, achieving just the right blend of physical comedy and action, and employing the subtleties of the dialogue to great effect. \n\tThere isn't a more natural actor in the business than De Niro, and he steps into Mitch's skin like he was born to it.  And after years of doing hard-edge, cutting drama (in which he turned in one remarkable performance after another), with such films as `Analyze This,' `Meet the Parents' and now this one, he has firmly established his proficiency for doing comedy, as well.  Mitch is not an especially complex character; he is, in fact, something of an `ordinary' guy, but therein lies the challenge for the actor-- to make him believable, to make him seem like the guy who could be your neighbor and just another member of the community.  And on all counts, De Niro succeeds.  He's Mitch, the guy you run into at the grocery store or the bank, or say `good morning' to on your way to work; who likes to watch the game on TV and has a life, just like you and me, who happens to make his living by being a cop.  It's the character Mitch has to be to make this film work, because it makes the `ordinary guy in extraordinary circumstances' angle credible.  It's one of those role-- and work-- that is often wrongly dismissed out-of-hand, because it looks so easy; and, of course, this is what makes De Niro so exceptional-- he does make it look easy, and he does it with facility.\tAs Trey Sellars, Eddie Murphy turns in a winning performance, as well, and it's a role that fits him like the proverbial glove.  Trey is a cop, but also an aspiring actor-- and a bad one-- and it gives Murphy the opportunity to play on the over-exuberant side of his personality (reigned in enough by Dey, however, to keep him from soaring over-the-top into Jim Carrey territory), which works perfectly for this character and this film.  From his melodramatic take on a part during an audition, to his throwing out of one-liners-- delivered by looking directly into the camera (which as far as he's concerned isn't even there) while filming the `reality' show-- Murphy's a riot.  And he has a chemistry with De Niro that really clicks (which is not unexpected, as this is another of De Niro's many talents; his ability to connect with and bring out the best in his co-stars, all of whom-- evidence will support-- are better at their craft after having worked with him, including the likes of Meryl Streep, Christopher Walken and Ed Harris, just to name a few).  Most importantly, this is a part that allows Murphy to excel at what he does best, and he certainly makes the most of it.\tRusso makes the most of her role as Chase, too, a character who isn't much of a stretch artistically, but whom she presents delightfully, with a strong, believable performance.  And William Shatner (playing himself) absolutely steals a couple of scenes as the director of the show.\tThe supporting cast includes Drena De Niro (Annie), Pedro Damian (Vargas) and James Roday (Camera Man).  Well crafted and delivered, `Showtime' is a comedy that's exactly what it is meant to be:  Pure entertainment that provides plenty of laughs and a pleasant couple of hours that will have you chuckling for some time after.  It's the magic of the movies.  8/10.","Let's get this out of the way:I like Eddie Murphy.I like Robert deNiro.I like Renee Russo.I like cop-buddy-pictures, God help me.I even liked Tom Dey's last film, Shanghai Noon.Sometimes, I enjoy being mindlessly entertained by films. Give me a fun little picture any day; I don't always need intellectual stimulation from my celluloid.But I *hated* Showtime. It was ninety minutes of life-force-draining shlock that made me depressed and p***ed off for the rest of the day. I only spent $5.75, but that was at least $5.74 too much.I'm not going to go into the plot -- enough reviewers have done that already -- but suffice it to say that from the very first frame of the film (a schoolroom gag used about twenty times in the last ten years), one could pretty much telegraph the rest of the movie across the board. There were nearly no surprises, and except for a small chuckle or two here and there, few laughs. The theater was half-full, and I wasn't the only one shifting around in my seat.This is my first review on IMDB -- I never felt like taking the time to review a film here before, but I gladly took a few extra minutes out of my day just to warn people about this movie. Go watch something else, or read a book, or hit yourself over the head with an anvil -- any of these will bring you more satisfaction than watching Showtime.","It's exactly what I expected from it. Relaxing, humorous and entertaining. The acting couple was awesome, as well as the scene selection. I personally recommend this. It's kind of the movie that can be seen by whole family at the same time without anyone feeling uncomfortable or getting bored. This cute movie will make you smile, and laugh too. And the action scenes are tasty. Classics of modern american comedy. And very well done.","This movie never really decides what kind of film it wants to be.  It attempts to be a bit of a clever cop-movie spoof, but stumbles early on and never regains it's footing.Clearly, there must have been good material here at one time to attract the talent.  Russo, Murphy and DeNiro play well enough together, and they get a lot of help from the supporting cast.  They do a decent enough job with what is basically an \"unlikely-cop-duo-versus-the-euro-trash-bad-guy\" film (or a clever play on one, we are never sure).  Lots of things go *boom* and bad guys are assumed to be bad, justifying further explosions.The real crime here is that it could have been better.  The ham-handed directing and haphazard editing destroyed what small amount of clever pacing and ironic humour that _may_ have been intended by the author.The screenplay must have been better and, judging from the \"outtakes\", made a lot more sense than the finished product.Don't blame the actors on this one.  This film may be an example of what happens when a writer gets a chance to produce his own picture, and hooks up with a bad director.Pretty bad film.  The pacing is awful and the editing is criminal.  Rent it to have a laugh and eat some snacks.","After De Niro destroys a network's property in the midst of chasing down a criminal, they threaten to press charges unless he does a realty TV show with Eddie Murphy. Listen, Eddie, I know you've been in a huge slump and the little talented you had after the '80's ended was sucked from you by that transvestite, but bro, don't let your aura of badness take down Robert De Niro too. He can pull out of the funk that he's currently in. You can not. This Showtime movie sucked as much as ANY other live action movie you've done since the '90's (barring \"Life\" which I liked). Stick to your \"Shrek\" films. And Tom Dey, I'm let down, \"Shanghai Noon\" was an entertaining film. This isn't.My Grade: D DVD extras: Commentary with Tom Dey, Jorge Saralegui and Billy Webber; HBO first look featurette; deleted scenes; filmographies; Theatrical Trailer","Los Angeles detective Robert DeNiro and silly beat cop Eddie Murphy get partnered together in \"Showtime\", a funny, but honestly mediocre buddy comedy. It is modern-day L.A. and an undercover assignment has gone wrong for DeNiro. Murphy botched the whole thing unwittingly by calling for backup and not knowing that a sting was taking place. DeNiro destroys a camera and a $10 million lawsuit quickly follows. For the department to get out of the lawsuit, they agree to team DeNiro and Murphy up for a reality-based cop show. Rene Russo is the sleazy producer and ham William Shatner plays himself as he directs the odd duo. Murphy naturally has always had dreams of stardom while DeNiro is as serious as a heart attack. Thus their relationship is strained to put it mildly. Soon they end up going after criminal Pedro Damian who seemingly has an arsenal of weapons at his disposal. There is not much thought in \"Showtime\". It is typical Eddie Murphy fare as it is a production to show off his unique comedic timing. DeNiro has also become a comedy regular the last several years (unfortunately in my opinion) and he too shows an uncanny ability to add humor to his natural edginess. Overall though the movie plays like a long sitcom or an episode of \"Saturday Night Live\" as everything seems way too scripted. There is no real drama here, just cheap laughs. In the end those minor laughs make \"Showtime\" viewable, but not memorable. 2.5 out of 5 stars.","When Detective Mitch Preston is filmed while trying to catch a criminal using a powerful new gun, he loses his patience and shoots the camera. Seeing the public reaction to this bad cop image, TV producer Chase Renzi makes a deal to drop the civil case against the precinct in exchange for Preston being the focus of a new cop reality show. The search for a partner draws the attention of actor-wannabe Officer Trey Sellars; Preston dislike and contempt for Sellars makes him the first choice to be his partner and the two find themselves lumbered together in the show. However, this is reality television and very soon the reality of a criminal with a powerful and deadly new weapon at his disposable raises the stakes beyond what even the network could have hoped for.When I went to hire a video to watch for a night in, I was in a rush but was told at the counter that I could get one more out under their deal and actually save a pound  so I just grabbed the nearest film with no intention of watching it. That film was Showtime and funnily enough it was the film out of the selection that I ended up watching. 'Why?' you might ask 'did you watch the only one you didn't pick?'. Well, it was a lazy and chilling Friday night in and Showtime pretty much delivers just what I needed by being quite fun but never once causing you to think or really engage your brain by being original or clever. The plot is basically the standard mismatched buddy stuff and the actual crime story is merely the set up and something that allows the story to have an ending to speak of. As a buddy cop movie it does nothing new at all but still manages to be fun even if it doesn't really have anything approaching big consistent laughs. Many viewers will be annoyed, considering what a high profile movie it is, that it just trundles along the tired old clichés and jokes but others will find it forgettable and basic fun  I supposed it depends on your mood and you expectations.The cast is maybe part of the reason expectations would be high since both have had some success with the mismatched buddy genre before (Midnight Run and, to a lesser extent, Beverly Hills Cop). De Niro is always watchable but he is very much on autopilot here, plying his usual moody self without ever giving an indication that he was doing more than taking money and aiming for an easy popular hit. Murphy also wheels out his usual shtick with sub-BHC banter and 'that' laugh. Together they manage to have just enough energy and natural screen presence to make a mark despite the tired material but really they have both been much better elsewhere. Russo has nothing to do and is really just a distraction in a role that could have been better served with a less well-known actress in it. The cameos are mixed and this is best demonstrated by the presence of Mos Def and Wiliam Shatner. Mos Def offered me hope because he is so often the best thing in average films; sadly here he was boring and I was surprised he had taken such an uninteresting role. Shatner however is much better and steals the film from the other stars in his scenes as he wonderfully sends himself and TJ Hooker up.Overall this is far from being a great film, despite the budget and big name actors involved. It is unoriginal, lazy and rather uninspiring, however this is not to say that it is not some degree of simple fun to watch  if the genre weren't then they would have stopped kicking them out some time ago. If you approach it in the mindset of looking for basic entertainment with no real expectations on it then you should enjoy it, however if you think that it will rise above the pack solely on the basis of being a high profile film then think again and approach with caution.","I'll just get right to it, I really liked this film it was fun. Eddie and Robert have great chemistry and work well together, Rene Russo was fun in this and the action was cool.I own this on VHS but I first seen this as a rental form the library back in 2009.Overall, a good buddy cop film, it's sad that this didn't do very well, I think this is the best Eddie movie before his movie slump.I give it a 5/10. It's fun to watch and if your an Eddie fan I think you'll like it too.","Not a great buddy-movie. Not a great comedy. Maybe the average both yet with some very good action. The thing to complain about, after the unoriginality of the script, is the no-interplay between the 2 leads. (Robert De Niro) and (Eddie Murphy) weren't so good together. (De Niro) was kind of spoofing his seriousness in other movies. (Murphy) was watching (De Niro) more than doing his stuff creatively. They were great in just one scene, the frank conversation in the car, now I think that this scene was totally something of their improvisation! Another point, (De Niro) was 59 and (Murphy) was 41. True that the 20 years difference worked well but I think that Murphy's character as young actor who wants desperately to be a star is just younger than him. However (Showtime) isn't a bad experience at all. Maybe a little disappointing compared to the names of its stars. Its action compensates for the less good rest anyway. And it's only where you got the chance to hear (William Shatner) says about (De Niro) \"This guy is the worst actor I've ever seen !\". It's, in the best analyzing, simple fun to entertain for an hour and a half. Despite its reputation as a flop (Budget $85 million. Gross $37 million !) you maybe appreciate it more when you know that this, as it is, was the best buddy-action or comedy for its year beating movies like (Men in Black II), (I Spy) for Murphy, and (Analyze That) for De Niro too.","'Showtime' didn't work for me much during the first viewing but I got a chance to watch it for the second time and enjoyed it more. The film toys with the interesting idea of a cop reality show, comparing how police life really is to how it's portrayed on screen but the over the top action sequences which are also very long, goes against this very concept. 'Showtime' falls in its own trap but it did have potential to be a better film given the concept. It is the comedic track between Murphy and De Niro that stands out. The two actors, along with Rene Russo, somewhat make up for the deficiency of this movie and during the second viewing I was able to pay more attention to this rather than the storyline which is weak. I would like to see the two work together again, with a better script.","I've read a lot of reviews about Showtime on IMDb and many seem to miss the mark. I've noticed a lot of reviewers calling this the typical \"buddy\" film. De Niro is in no way Murphy's buddy throughout most of this movie. In fact, part of the comedy of this film is De Niro's reluctance to be friends with anybody.Murphy really shines in this one. He is back at doing what he does best, acting like a complete ham. He is a cop who wants so much to be an actor and enjoys being in the reality show. De Niro is perfect as the straight man who thinks the entire thing is stupid. I thought the two of them had great chemistry and were a perfect casting choice. Rene Russo is also great as the TV producer. Of course, she loves everything Murphy does and tries so hard (along with Murhpy) to get DeNiro going too.A lot of reviewers have touched on the hilarious scene with William Shatner, reprising his role as TJ Hooker to train Murhpy & De Niro how to \"act\" like cops. But, my favorite scene involves Murphy in the \"confessional\" hoping he could get a Wesly Snipes-Like cop to team up with instead of De Niro. Man, that was hilarious! Comedies often depend on your personal tastes. Sure you could poke holes in the plot, most often you can with a comedy. I was psyched to see the pairing of Murphy and De Niro...I think it brought out the best in Murphy, which was nice to see him at the top of his game again. I can only imagine it was a great honor for Murphy to be paired with the great De Niro. Rating 8 of 10 stars."],"review-user":["policy134","StreepFan126","Agent10","MisterWhiplash","iohefy-2","MadBadMovieman","ccthemovieman-1","Buddy-51","dworldeater","atdm4gospel-1","bkoganbing","MovieAddict2016","pichinga2","YohjiArmstrong","jhclues","emgarcia","maros612","clvrmnky","movieman_kev","tfrizzell","bob the moo","RoboRabbit89","elshikh4","Chrysanthepop","treeskier802"],"review-date":["23 March 2005","4 October 2002","16 May 2002","15 March 2002","18 March 2002","16 March 2002","8 August 2006","17 March 2002","20 September 2016","1 August 2007","29 September 2008","14 August 2002","12 June 2010","29 April 2011","21 March 2002","3 April 2002","12 March 2003","22 September 2002","21 January 2005","7 August 2003","9 November 2004","2 November 2017","9 November 2009","12 May 2009","1 October 2007"],"review-rating":["4","10","7","4","7","7","6","6","9","3","10","8","1","10","1","2","5","8"],"review-title":[" All together, kind of bad but hey, pretty funny\n"," Funny Movie!\n"," A fun film, and it even has Robert De Niro\n"," A decent show by two well intentioned leads\n"," A TYPICAL EDDIE MURPHY SPOOF\n"," The Bob & Eddie Show!\n"," Entertains, But Not Too Memorable\n"," lackluster comedy with a few laughs\n"," Decent buddy comedy from Murphy/De Niro\n"," Nix the negative criticism!\n"," A Day Job?\n"," A new kind of Cop-Buddy film\n"," If you want a movie to make you cry, then just skip this one...\n"," Unfunny\n"," \"You okay there, T.J?\"\n"," A Soul-Sucking Waste of 90 Minutes\n"," Celebration of film act.\n"," This must have been a good screenplay\n"," Blowtime\n"," Time to Show Up.\n"," Quite fun but entirely unoriginal in almost every regard\n"," A good buddy cop film.\n"," Average Show, But Not a Wasted Time !\n"," De Niro and Murphy Rock In This Weak Film\n"," Funny Film & Great Pairing of Murphy & De Niro\n"]}