{"review-url":["http://www.imdb.com/title/tt0283900/reviews"],"review-text":["This is a very well done film showing the life of international students during their \"Erasmus year\" in Barcelona which by the way is one of the most beautiful towns in Europe and is an ideal location. The idea itself with all the different languages is great and gives the film an original atmosphere. There are some clichés about the countries but most of them are true! The characters could not better represent their different countries.Having experienced \"Erasmus\" on myself during my exchang semester in Italy I can say that is movie is incredibly authentic. I had many experiences which were similar to the characters (except I didn't get laid as often). The movie is also quite funny yet not like all those stupid American college movies.Finally the movie touches also some important issues like the change from student to work life.9/10 (I may not be very objective though)","There are a few things in life that we can't experience more than once and the college experience is one of them.  Especially if we're living in a foreign country and in a apartment with 6 wackos from 6 different countries. Xavier the main character leaves his tidy life in Paris, his ex-hippy mother and his beautiful girlfriend and goes to Barcelona to study spanish in order to get a job at the embassy. He falls in love with the wife of a french doctor and he makes friends that make him look at things differently. When Wendy's brother (Wendy is one of the room mates) comes from England the film starts to become a lot funnier. Well anyway, Xavier starts to see things differently with all his new friends and he probably lives something he will never forget and will change his life forever. Overall a very nice nostalgic film, which becomes even more interesting because of the multinational cast. I thought it was very interesting that you could see all these kids from different countries, all of them speaking different languages and having different cultures get along with each other and fun. I gave it a 9 out of 10 because I left the theatre with a smile on my face and thinking about things I haven't done yet while I'm still in college and would want to do before it's too late.","The first thing I wanted to do after watching this film was watch it again (because I'd missed lots with all the laughing I did). I'm European and I've studied abroad and I've as good as lived with Spanish, french, Italian and German people. The film was full of stereotypes, which, more often than not, p*** people off, and reading some of the other reviews I see that it did p*** people off. But, this film gets the stereotypes so right I cannot fault it. Except for maybe the way the french guy became a drunken party animal. The English guy was the perfect \"geezer\" stereotype. Drunk, annoying, insulting but shines through in the end. As well as the stereotypes the film also got the emotional aspect of studying abroad correct. At first he's shy, doesn't know anybody, misses home, doesn't know his way around. As time progresses it becomes his home and when the time comes to leave, it is extremely difficult. A feeling people can only understand if they've experienced it. I highly recommend this film.","This film is about Xavier, an Erasmus exchange student from Paris who spends one year in Barcelona. During that time, under the influence of all the new impressions, he changes and grows. Upon return, he has a much clearer view on his life and finally takes it into his own hands.This is one of the most moving films I've ever seen, and the reason is probably that I've been in a very similar situation. I'm from Germany, not from France, and for me it was Madrid, not Barcelona, but I can assure you that this film is a completely accurate depiction of what an Erasmus semester in Spain will do to you. From what I hear the story is autobiographic, and that's probably why it is so realistic.Let me give some examples (mild SPOILER alert) - Xavier shares a flat with other students from Italy, Denmark, Germany, Belgium, Spain, and England. The flat looks EXACTLY like all the Erasmus shared flats I've seen in Madrid. The main characters are nicely developed, and some funny scenes arise from the usual stereotypes. The Spanish landlord is also 100% accurate. - The story of Xavier and his girlfriend Martine, who remained in Paris, is also very typical. About 90% of all relationships break up during an Erasmus semester (or shortly thereafter). - There's a wonderful scene in which Xavier tries to convince Wendy, his flatmate from England who is kind of \"uncool\", to go out with all the others. He finally succeeds, and Wendy probably has the night of her life.Another great thing in this film is that it's truly trilingual: The students in the flat speak Spanish or English, and Xavier speaks French with his mother and girlfriend. There are subtitles so that everyone can understand what's being said. I surely hope that this film never gets dubbed anywhere.I can imagine that for non-Erasmus people this is simply an entertaining comedy, but for all my fellow Erasmus I can only say: This is YOUR film! If you haven't seen it, do so. But be prepared for some feelings of nostalgia...10/10","In France, Xavier (Romain Duris) is a young economist of twenty and something years, trying to get a job in a governmental department through a friend of his father. He is advised to have a specialization in Spanish economy and language to get a good position. He decides to apply in an European exchange program called \"Erasmus\" and move to Barcelona to improve his knowledges in Spanish culture and language. She leaves his girlfriend Martine (Audry Tautou), promising to keep a close contact with her, and once in Barcelona, he is temporarily lodged by a French doctor Jean-Michel (Xavier de Guillebon) and his young and lonely wife Anne-Sophie (Judith Godrèche) he had met in the airport. Later, he moves to an apartment with international students: the English Wendy (Kelly Reilly), the Spanish Soledad (Cristina Brondo), the Italian Alessandro (Fédérico D'anna), the Danish Lars (Christian Pagh) and the German Tobias (Barnaby Metschurat). Then the Belgium Isabelle (Cécile de France) and Wendy's brother William (Kevin Bishop) join the group, and Xavier learns Spanish language, and finds friendship and love in his experience living abroad. \"L' Auberge Espagnole\" is one of those movies the viewer becomes sad when it ends. The story is a delightful and funny tale of friendship and love, in a globalized world and an unified Europe. This very charming movie made me feel good and happy, although I have never experienced to live in a republic of students. The newcomer William provokes the funniest situations along the story, with his big mouth and short brain. Further, it great to see a fresh approach of students living together different from those dumb American fraternities and their stereotypes, common in American movies. My vote is eight.Title (Brazil): \"Albergue Espanhol\" (Spanish Auberge\")","I think anyone who when young has moved to a foreign city, especially alone, would immediately recognize and appreciate the truths apparent in this film. Certainly everyone's experiences are different but some things, the initial disorientation, the difficulties and pleasure of adapting to a new and very different set of friends, the joys of eventual acceptance and adaption of a new routine; these are probably universal. This film depicts all of this very well.The Spanish Apartment rings especially true for me. Almost ten years ago I moved from NYC to Antwerp for one year then on to Barcelona, where I am living still. I was a bit older than the film's characters (late 20 's) but my experience was eerily similar. I lived just blocks away from their apartment, in Raval, and recognized many of the streets and locales. Myself, a Slovak girl I was dating, three male apartment mates from Bolivia, France and Italy. I made tons of expat friends from all over Europe (many of whom departed long ago) and eventually Spanish friends as well.I'm older now and settled down but watching this, I was overwhelmed with nostalgia and wished that I could travel back in time if only to relive one of those glorious weekends.If you've never done anything like this watching The Spanish Apartment may be the next best thing. The Barcelona tourist office should probably pay me for this.","One of the biggest French success of the year 2002, \"l'auberge espagnole\" was also very well greeted abroad which is quite extraordinary for a French film. It is not difficult to define the reasons of this success. This movie made by one of the most interesting French film-makers of these last years, Cédric Klapisch, presents students coming from all over Europe and gathered all together under the same roof in Barcelona. These students are described like the ones you imagine or you see in everyday life: either untidy, either serious or with a sense of humor. I guess that if the movie worked so well, it is because a lot of students must have recognized themselves in the main characters' portraits and especially Xavier's.We follow the movie and so his experience abroad as an Erasmus student through his eyes. Xavier is really an ordinary student with his qualities, his faults. An intelligent making with quite a lot of ingenious ideas perfectly expresses his lost mind and his anxiety about the world and being an Erasmus student. On that subject, the best examples can be found in two sequences. The first one is when Xavier asks a woman at university for the papers he has to send to prepare his DEA. When the same woman informs him about the different necessary procedures, all the papers appear on the screen when she is naming them! In the next sequence, Xavier's voice-over confides to the spectator his vision of the modern world. Now, where to find the second example? Well, the scene where Xavier has a thorough medical examination during which Klapisch films his visions is widely sufficient to speak of itself.Moreover, the director wasn't really interested by his main character's studies. He left this point low-key. He rather put a lot of effort into Xavier's private life, of course, in his love affair with Anne Sophie but also and especially in his relations with his fellow tenants. It is a real friendship story that Klapisch shows us with its moments of happiness but also its arguments and its tensions. Through Xavier's adventure and at the end of his stay, he will have been initiated into life which will make him more mature. The message that the author wanted to transmit isn't difficult to guess. You naively believe that you live in an untidy and complicated world. You mustn't give up but intensively search to get what you want even if it is difficult.Apart from this, we could also fear that with the topic, Cédric Klapisch wouldn't avoid a trap: the clichés. Let's be frank about it: they are included in the screenplay but the director does his best not to spread them too much in his movie. Then, the screenplay contains convenient and predictable moments: at the airport and before boarding we see Xavier shedding a tear after he left his family. But fortunately the shortcomings of the script stop here. Quite funny dialogs and cool young actors perfectly at ease in their roles make up the whole.In spite of its weaknesses, \"l'auberge espagnole\" is to be taken for a success in the movie of young people. Besides, the whole atmosphere it brings out lets us think that this movie is directed primarily to a young audience. Ultimately, the end of the movie and its big success let us suggest that Klapisch succumbed to a fashion that goes right for American cinema: the elaboration of sequels. And indeed, the film-maker currently works on a sequel entitled \"les poupées russes\". Let's hope that it will be as good as \"l'auberge espagnole\".","I have long been torn between Madrid and Barcelona, the former a dignified repository of old Spanish architecture and customs (a Catholic parade at 11 PM!) and the latter a Ramblas-rambunctious splash of youth and energy (Oh, that Olympic harbor!).  Cédric Klapisch's `L'Auberge Espagnole'(`Euro pudding') now tips the scales to Barcelona for me as I watch a group of 20 somethings negotiate life in a communal apartment. They represent the emerging melting pot of Europe, learning each other's language and purging themselves of racism and sexism.  The film is alive with change.Protagonist Xavier (Romain Duris) is moving from Paris (a city against its type here-repressive and decidedly unromantic) to Barcelona for a year in order to qualify for a business job that demands immediate experience in Spain. Leaving his girlfriend (Audrey Tautou) and his hippie mother behind, he witnesses love in forms his shy French persona would have never encountered, including adultery and lesbianism. That he will be different, more urbane and wise, is preordained by the decision to move; that the director wishes us to see the allegory of a polyglot Europe is all too obvious.But the photography through the narrow streets, even in the barrios, is muscular and lyrical, especially when it takes us all to the top of the Gaudi Cathedral to survey the messy world below (Xavier eventually comments the world is `badly made').Beyond my affection for Spain, this film reaffirms for me the salutary effect travel has on the uncertain heart.  After one year on his own, Xavier is ready to make a serious decision, but not about Paris vs. Barcelona-it's whether the corporate world that started this string of events is the one he wants or the artful one in his heart.  Tennyson's Ulysses says, `I cannot rest from travel.'  Xavier, on the other hand, found his rest in travel.","\"L'Auberge Espagnole\" collected the audience wherever it was shown. It gathered audience awards on many film festivals all over the world. And it is not strange. We have the ability to watch a cheerful and an astonishing piece of art. And it is wise by the way. \"L'Auberge Espagnole\" is a very funny comedy about youth and growing up. But most of all it is about the lights and shadows of living in the European Union.The main character of the film is a French student of economy Xavier. For his future carrier his is sent for one year of studying to Barcelona. In Spain it turns out that the lectures are being given in Catalonian language. That probably doesn't help the increasement of knowledge. But it helps in tightening the relationships inside the group of foreign exchange students. Especially if they rent a big flat together. There are 3 girls: English, Belgian and Spanish, as well as three boys: German, Danish and Italian. Our French guy will also get there. A year is a very long time. Long enough to get close and make friends. And get to know some European stereotypes while trying to break them apart.Klapisch treats this special case of a process of uniting Europe with humor and without pecky didactism. He comes out of the idea that young people are everywhere just the same. They like jokes. They like to make irresponsible relationships. But they don't neglect their aspirations. The most interesting is the sum of experience of this little community. They live together in the fire of everyday tasks fighting with the surrounding reality. They are full of unusual ideas for life. Young Europeans come back to their countries to take up a life of an adult on their own. They are Europe's hope to fight the many problems of the Union. For example, the terrifying administration system. In the end they proof that not only can they communicate and make friends despite the many differences. But they also now how to live the full of life. And they won't allow taking that full of life away from them.","I was looking forward to watching l'auberge espagnole since one of my favorite language YouTubers recommended it as a learning device. I don't know what they drank when they watched this because this movie should not be praised. I think its possible to root for a protagonist who is not perfect. We have Heisenberg, we have Tony Soprano. But this guy comes off to seemingly everyone as perfect when he is really a sexist, hypocrital pig who doesn't get his comeuppance. I don't care how relatable this may be to the traveling foreigner. I'm just thinking why did they portray this guy so badly. He tells his mother to shut up, convinces a married woman to have an affair, and got mad when his girlfriend says she has moved on. He disgusts me and it disgusts me that this movie is revered. It makes me question if this is normal behaviour for people in France. Never has a film made me feel such disgust for a character. What makes it worse is that people like this movie, they relate to it. I'm sorry but I cannot relate to an awful human being. All they had to do was make him likable, that's all.","I'm scratching my head thinking about which language I should use to write here, American English, Castilian, Catalan, Danish, English, Flemish, French, German, Italian??? They are all spoken at least once in the movie. Cinch, I just adopt the official language of the housemate recruitment meeting: English.The Eramus apartment in Barcelona is absolutely a microcosm, a miniature replica of EU where the Europeans are now moving around studying, working, having romance, breaking up, having affair, getting married. However, they may not respect one another, they may not speak one another's language, they may not understand or want to know about the culture and history of other countries, otherwise, William would not so carelessly think that German Nazi, Adolf Hitler are objects for making fun of.Is EU offering benefits or battles? Xavier was in a loss, every part of his life after leaving Paris for Barcelona: cultural shock, the linguistic misunderstanding, loss of mother tongue (identity, culture, wow means very much here), loss of the relationship with his girlfriend, loss of friendship (after the affair with the physician's wife Judith Godrèche disclosed). Nevertheless, he gained European friends from all European housemates. How they help Wendy to avoid being seen by Alistair when she is having fun with an American man in bed, they act unanimously to run towards their apartment.Xavier's study is symbolic: Economics. Why the establishment of EU? One of the reasons is to build up power to balance the one that the US has been enjoying for too long in both political and economic arenas. And the film states it pretty clearly which country wants to be the boss of EU. Wendy is the leader of the house who always clean, keep the apartment and \"discipline\" the other while the serious Xavier successfully gains the trust of the \"foreign\" landlord. Wendy (UK) is the Minister of Internal Affairs and Xavier (France) is the Minister of Foreign Relations. Anyway, Wendy got a \"W\" initial which is a few steps ahead of Xavier's \"X\".Clever and observant movie about the Europe and its people today. The apartment should take in four more people: British Indian, Swiss Korean (North Asian), French Mauritanian (Arab Muslim) and Spanish Moroccan (Muslin) etc to make a even wider world stage. It will be far more an unexpected intrigue than the real world we experience. Both warming (the people) and warning (the people's relationship).J'adore this pelicula very much. Vive l'Europe! Viva Europa!","Cliché-avoidance is one of this film's main achievements. When you hear a vague outline of the story  Erasmus students of mixed nationalities sharing a flat in Barcelona  you predict a collection of  Euro-stereotypes in a farcical tangle. Pas du tout! In fact, it's a finely judged comedy about a young Frenchman, Xavier, trying to make sense of human relationships. There are some excellently observed minor roles (the arrogant French neurologist, the insufferably irrepressible brother of the English girl, Xavier's forlorn mother) and some fine visual humour, especially in the opening scenes mocking the bureacratic complexity of the application procedure. So what does Xavier learn about relationships?  Nothing positive. In place of a conventionally happy ending, there is a regrettably portentous finale about `Identity'  Xavier has become' all the friends he made. Nevertheless, this highly enjoyable film deserves its great success. I saw it in Luxembourg with a mixed Euro-audience, who enjoyed themselves hugely and even applauded at the end.","This movie is proof that Hollywood does not have a monopoly on shallow, trite comedy. This movie is about a diverse crowd of young students from all over Western Europe studying and living in an apartment together. If all of the characters were American, and it took place in a loft in Manhattan instead of Barcelona, maybe drop the homosexual jokes here and there, this movie would have been virtually the same as an episode of \"Friends.\" I've been to Barcelona and while I love the city, the backdrop was not enough to distract you from the annoying characters (especially the main character, whose dilemma amounted to \"my life is miserable despite sleeping with supermodels\"), stupid situations, and petty concerns.What baffles me is the acclaim that so many people have for this movie. One has to wonder if the same people singing praise for this movie would be still praising it if it was a Hollywood movie about shallow Americans instead of shallow Europeans? I'm sorry hipsters, but just because something is \"Euro\" does not mean that it doesn't suck.","What a pointless little movie about nothing this is! Someone seriously rode the subsidy gravy-train to make this pile of rubbish. I love the way every national stereotype of Europeans is mocked here and rejected as untrue- EXCEPT the British ones- uptight goody-goody girl who would rather be serious and work than party, along with her loud-mouthed yobbish brother with his moronic drunken behaviour and offensive comments to his Spanish hosts and a German student. Those stereotypes are fine apparently. So what do we learn from this movie? Student leaves for a year, has some standard student fun, returns home to begin a serious life in a boring office, can't stand the idea and so doesn't do it. Wow.","\"L'Auberge Espagnole\" (LAE) tells the story of modern Europe - an Europe that struggles with unification issues while trying to maintain the identities of each of its individual members.  Set against this background, LAE is a coming-of-age story of Xavier - a graduate student from Paris who moves to Barcelona to learn Spanish - apparently a sure fire way of landing a job @ the MoF in Paris.Leaving behind his girlfriend (Audrey Tautou), he finds himself sharing a Barcelona apartment with a group of fellow 20-somethings from across Europe. The city, with its striking architecture, nearby beaches, and buzzing nightlife, offers Xavier a wealth of opportunities, and he comes to enjoy the camaraderie of communal living. But will his friendship with a shy married woman (a very SULTRY Judith Godràche) lead to romantic fulfilment?Klapisch's screenplay, though, has its share of comic stereotyping: it's the laddish British visitor (Kevin Bishop) who provides the \"jokey\" Hitler salute and walk, and it's the German guy who believes in a disciplined revision schedule.  The Italian who is always late, disorganized and into techno (and wears cool shoes), and the Danish who like his country does not play a significant role.However, the movie disappoints as Xavier's romantic entanglements feel underpowered - besides, I was left with the feeling that he learns too many of life's lessons without really having a strong grasp.\nI left the theatre disappointed - while a fun film, everything seemed to be surface like - the exploration of the supporting characters, the lessons of life Xavier learns, and the ending - all seems a bit too shallow in face of the messages that were trying to be conveyed.","Honestly, how did this film get such funding?! How did they put together an entire cast of utterly hateable characters?! How did they allow the main protagonist to be the most despicable of all (virtually a rapist, yelling at his altruistic mother to \"Shut the Fxxx up\")!? How did this film believe it could be the 'anthem of the EU Generation' on a platform of debauchery, treachery, and ignorant behavior!? Are these the proposed values that will bring a stronger, more unified populace? Was this film geared solely for the mid-teen crowd, or did they accidentally edit the scene where there was any sort of actual character or plot development? Honestly, I walk out of films about once per 4 or 5 years, seeing about 100 per year at home and at the cinema.. I ONLY sat through this whole mess because I was so amazed by how this bad a film was able to become such so popular. This is honestly one of the top 5 worst quality films and worst cinematic experiences I've ever had. SO BAD!!!","Because a friend had told me how much he enjoyed this film, I couldn't wait to see it myself.  I love French movies and each time I see one here, it's a joy. Except for this one.  At first, I loved the fact that the film was set in one of my favorite cities in the world; Barcelona. That almost every actor came from a different European country seemed very cool to me too.  On top of it, it had Audrey Tatou and who can resist her? But after half an hour I had enough.  Did anybody realize that this was just a two hour episode of a very popular MTV reality show?  \"What happens when seven strangers live together and stop being polite.  The Real World Barcelona!\"","I was really looking forward to seeing this movie, having spent a few (fantastic) college weeks in Barcelona myself. The premise is right on cue--a confused & disordered young individual enters a world of equally confused & disordered young individuals. But the director's weak swats at symbolism, philosophy and social commentary were completely off the mark, and it leaves us, the audience, feeling confused & disordered. Bravo.Perhaps if this movie had been presented as a European \"American Pie\" flick, then I'd be able to turn off my brain and go along for the ride. But right off the bat, the director piques our deeper senses by introducing the symbolism of the twisted highways and the dichotomy of the \"inner self\" vs. the \"public self\" (one's \"mother tongue\" vs. one's \"secondary language\"). Furthermore, it dives boldly into the subject of racial/national stereotyping. Off to an interesting start, eh?WRONG. That's as far as it goes. These interesting topics are hardly mentioned again except at the contrived epilogue-type ending which seemed to be the director's way of floundering to get back on topic. It reminded me of a meandering speech which goes nowhere, but the speaker ends by saying, \"So in conclusion, I hope you see how this relates to my original thought!\"Furthermore, as other reviewers have pointed out, the cynical jab at stereotyping betrays itself. If the point is to ridicule the use of national stereotypes, then why did the director introduce a cockney-speaking, beer-swilling English brat as a caricature of prejudice? Why did the director portray the American as a neanderthal (literally banging his chest & making ape noises at one point) whilst the Europeans tolerate him superciliously? Why is the British girl the one who sinks to uttering slurs (calling French people \"frogs\" and butchering the French language) while everyone else is above all that? The answer is that this isn't a deep or well-thought out film. It's simply an Anglophobe's retort to the Anglophiles. But really it's no different from the prejudice it seeks to ridicule! Now there's a funny irony to consider.OK, philosophy, artistry & socio-political commentary aside, I was still very bored by this movie. There is one very funny gag which involves deceiving one of the girls' boyfriends, but aside from that I was hardly entertained at all. The only reason why I watched it through to the end is that I'd like to brush up on my French & Spanish. (You see, we monolingual Americans may be stupid, but we do try.)","The \"Idée de Départ\" for this film was a very original one - the trials and tribulations of students in a Foreign Country on the Erasmus Exchange Scheme. Unfortunately, apart from a few funny moments, and the nostalgic pleasure of seeing all these foreign students speaking their own and other languages together, the plot of the film is absolutely hopeless and uninteresting. No clear direction is shown and the film follows its course aimlessly through 1h 50m with a few interesting things on the way but also a lot of totally boring and shallow moments. It's a shame because the subject matter could have produced something far more original. Also the film could have taken place in Barcelona from beginning to end. Useless to have part of it taking place in Paris. The other thing which annoyed me was the stereotyping - Anne-Sophie is portrayed as a stuck-up French bitch and Wendy as a typically sex-mad unfaithful English girl. The German is portrayed as \"typically\" having no humour when the English Girl's brother makes jokes to him about the Germans. This sort of stereotyping is all well and good but it could be done more intelligently. Also, certain others of the characters we learn little about - the Italian, the Dane. I thought the Belgian lesbian had her character developed a little more. The central character the Frenchman had, I thought a very weak and diluted character and seemed just unable to take it all in ( too much pot, I suppose ). Audrey Tautou's tantrums were unnecessary and she was nowhere near as interesting as in \"Amélie Poulain\".  All in all, a bit of a washout ( I had higher hopes before discovering the film ) and I can't really see it having much success internationally mainly because the plot and acting are so poor. It's main redeeming features are the linguistic aspect, its original starting idea and the fact that it may bring nostalgic memories to those ( like yours truly) who have mixed with foreign students abroad. I did in fact spend 2 months in Spain ( in Tarragona - not far from Barcelona (and Sitges !) to follow a \"curso de verano\" or Spanish Summer school where there were pupils of all nationalities - but the reality was not quite as \"baba-cool\" as depicted in this film ...............","Xavier is a 25 year old Frenchman, stuck in the same rut of life as most people his age.  He's looking for something to help him get a job, when he discovers that a friend of the family can get him a job with the EU if he knew Spanish.  So Xavier decides to enroll in an exchange program called Erasmus, where he will live and study in Barcelona.After arriving Xavier ends up settling in with about 6 roommates from various European countries (Italy, Germany, England, Spain, Norway, Belgium) and the wild cast of characters creates some ingenious comic situations. The film though is quite charming, and is dead on in explaining what it is like to live in a foreign land, and to escape your roots.  While the stereotypes that are examined are quite played out, they are shown in a way that seems unique to the characters and come out very warm and of course VERY FUNNY.  A highlight of the film arrives when Wendy's English brother comes down to visit her, and we discover he's a dumb ass loud mouth comic who thinks he knows everything about all the other countries these people come from.  He ends up providing the majority of the funniest scenes by poking fun at every person in the group at his own dumb expense. But the highlight of the film really is how it shows what it means to live in another country.  In the beginning we see that Xavier is awkward from fumbling around trying to find his first apartment, to complaining about Catalan, and by the end with the t-shirt he receives from his roommates on the last day, we see how he has been transformed by the friends he has met from all over.Quite a fun film, not perfect, but definatly a great film to see that will but a big smile on your face, and a warm feeling inside you once you have left the theatre.Rating 8 out of 10","It is an excellent comedy that rings the bells if you've ever studied abroad. Topography of the comments here on IMDb suggests that there might be a cultural split between Americans and europeans -- the former don't get the humour. International clichés are there, but righteously so. It's not a documentary, and generalisations are funny. The plot is fast, good acting, really nothing to say against this witty, romantic and friendly film. Certainly, the post 1975 or so generations will find lots of references, oldies can have problems.","Hey everybody! At this very moment I'm on Erasmus exchange (in France not in Spain but I think it doesn't make a huge difference) and as I've seen the Auberge espagnole I was totally disappointed by the way the film presents the Erasmus students as the youth who lives by the guidelines of \"sex, drugs and rock'n'roll\", when everybody's cheating on their boy/girlfriends and Erasmus is appearing as a hallucination. The only thing that is real about the Erasmus community is the fact that you get contaminated by the multinationalism you're thrown into (including speaking three languages at the time and acquiring new identities). No, I am not such a boring person, the Erasmus do go out, we do party and we have tons and tons of fun but not at such a low level of human behavior as shown in the film. I'm really disappointed because people get this wrong impression of Erasmus students who are in essence people who love meeting new people and sharing experiences at an intellectual level at the same time as discovering a foreign country, foreign way of life and enjoying themselves. Truly, talk to the first Erasmus student you meet and check out for yourself! The Auberge espagnole does NOT reflect the Erasmus reality (at least not the reality of the majority of Erasmus students!)!Europe gives us an opportunity to go on exchange - let's not spoil this great thing by giving an impression of irresponsible disgusting Erasmus students who may exist only in the imagination of film producers who want to sell their work!","The U.S. saw its \"Generation X\" wave wax and wane some years back, and the \"slacker\" films of that brief era - the lower the budget the better - provided thrills that still haunt me.  After all, there's a philosophical connection between the world outlooks of the Beat Generation, the Hippy movement (mine) and the X-ers - or those of Aristophanes, bon dieu - whether one reads Steppenwolf, Junkie, On the Road, or The Birds  - whatever - such that there's a degree of communion of desperation, gallows humor and cynicism at play, supposedly reasonable reactions to our predicament.  In my case at least, I can experience Matrix-like transformations of otherwise repellent women into beauty queens the moment they begin thinking and speaking in an enlightened philosophic manner.But a display of unrelenting stupidity, blindness and self-absorption such as perfectly rendered by the exceedingly unappealing lead idiot-character of this film makes this a stunningly gothic-sociologic piece of naturalism. The dizzying depth of its stupidity is accentuated through revealing the author of this piece of blind imbecility as the lead character himself - i.e., French business life is too rigid, tunnel-blind, bureaucratic and complacent, so our newly enlightened man in the style of The Graduate chooses at the end to flee corporate France, return to the life of the auberge and make his grand fortune by publishing all the wisdom he's learned.Personally, I spent a few weeks in an auberge in Valencia a year or so ago - till I moved to quieter quarters - and experienced enough so-called \"students\" to satisfy me for the rest of my life: people who did anything but study, and whose connecting ethos consisted of speaking English (whether they were Arab, African or European), and longing to get drunk and laid (while senselessly drunk). Incongruously enough, in my case, the one wonderful exception to that generation's ideal was a French girl, who was not only beautiful, but concerned with education and actually had a job. She was living alone, not in a hive of imbeciles.The only simple way in which to correct this film would be to replace the lead character and his ghastly girl-friend at home with some fresh comic talent and retitle the result \"Auberge des Cons\".  As the abomination stands, it's as said, an excruciatingly boring, gothic freak.  I'd rate it ZERO.By the way, I saw this film after watching Takeshi Kitano's \"Getting Any\". Whoa!  \"Getting Any\" can be accused of its own excesses, but compared to Auberge des Cons, it's a breath of fresh air - wonderfully funny in parts! Tanoshinda!","The crux of this film is in its central sections. 'Student adventures' that we all relate to or at least enjoy the humour of. This doesnt really make a movie-length experience though. The movie cuts from situation to situation without really developing any plot, and we realise that in the end all Xavier is going to do is end up returning to France - which is true - hence every crazy student story (the arrival of Alistair was the best for me) leads to nothing in particular but the characters memories. The ending might work if you are a fan of 'discover yourself and follow your own dreams' kind of stuff, but for me i found it a little flat. When is someone going to make a movie where a struggling art student finds happiness in working an office job and earning themselves some more money???Still. A funny film despite my criticism. 7/10 :)","Xavier (Romaine Dupris) is a young Frenchman in his early twenties. In order to secure a terrific job in the financial sector, he must go to school in Spain for a year and learn how to speak Spanish with ease. With his hippie-like mother urging him on, Xavier soon lands in Barcelona. There he is befriended by a French doctor and his stunningly beautiful new wife, and they offer to house the graduate student until he can find an apartment. Soon after, Xavier is fortunate to secure a cheap room in a boarding house, where a bevy of other students live. One of them is an English girl, Wendy, who seems very nice. The place also houses an ultra-neat German man, a Spanish lesbian, and so on. Xavier fits right in almost immediately and everyone gets along well. However, Xavier had to leave his beautiful girlfriend, Martine (Audrey Tautou) behind in Paris and this puts a strain on their relationship. Things get more complicated when Xavier develops a serious crush on the doctor's wife, Anne-Sophie. Will he make it through his studies and land the dream job he seeks? First, this is a very interesting film but one which seems put together with a bit of splashdash, at times. Yes, it has some stunning scenes, like the one where everyone in the boarding house parties hearty and ends up disoriented on the streets of Barcelona. The camera work at this moment is a unique layer upon layer of images that is truly inspired. But, sometimes the movie seems bent on being quirky and wanders off the beaten path. Then, too, anyone hoping for a Tautou film will be sorely disappointed, despite her smiling face in the middle of the cover. Her part is relatively small while Dupris' role is the main focus. All of the other cast members are quite nice, as are the costumes and lush settings in Paris and Barcelona. There is some fast and loose morals in the film, where sex, drugs, and drinking are somewhat glorified. Yet, despite this tendency, the movie really is a terrific look at young Europeans who are just finding their ways into the serious world of adulthood. If you like foreign films, you probably should put this one on your list, as it has an offbeat and surprising nature that so many non-Hollywood movies have. Even so, don't expect to be bowled over by the film, as it is only moderately successful in its delivery."],"review-user":["a9901548","wildstrawbe","tkeane-1","johnrock","claudio_carvalho","malebranche","dbdumonteil","jdesando","Kuba_D","bjamzilla","shu-fen","jfoulkes","Bletch76","purpledog","arikde","dsystmz","TinTin-6","rooprect","nicholas.rhodes","smakawhat","Natalie-7","drummergirl009","Oskado","miscreant","inkblot11"],"review-date":["20 May 2003","13 May 2003","11 September 2003","19 January 2004","8 May 2005","15 September 2011","15 September 2004","23 May 2003","14 January 2007","3 June 2016","27 July 2004","8 August 2002","16 December 2004","27 October 2003","29 June 2003","10 September 2007","9 February 2004","28 November 2006","8 February 2003","11 June 2003","21 August 2004","29 November 2006","2 January 2004","23 December 2003","5 September 2007"],"review-rating":["8","9","9","10","8","8","8","3","9","4","1","7","1","3","7","9","2","1","7","7"],"review-title":[" Great authentic movie about student life\n"," beautiful film about memories\n"," Stereotypes and truth together for the first time.\n"," This is EXACTLY what an Erasmus semester is like!\n"," A Delightful and Funny Tale of Friendship and Love in a Unified Europe\n"," Spot on!\n"," an initiation to life\n"," This film is alive with change.\n"," Very good\n"," This movie is all kinds of stupid\n"," The real life Europe is more complicated\n"," Highly enjoyable.\n"," Little more than Euro-Friends\n"," Eurotrash crap (spoiler, if you could spoil this movie)\n"," Could have been SO much better\n"," Astonishingly shallow, and just BAD!\n"," L'Auberge espagnole AKA Real World Barcelona\n"," Aw bummer.\n"," Good Idea but boring result - could have been much better\n"," Charming\n"," European exchange student classic!\n"," Erasmus reality - get a grip!!!!\n"," L'auberge des CONS\n"," Less than the sum of its parts... *SPOILERS WARNING*\n"," A moderate ole for this film, as it is quite interesting but not totally satisfying\n"]}