{"review-url":["http://www.imdb.com/title/tt0219374/reviews"],"review-text":["This film is so many things: corny, touching, hilarious, weepy, maddening...well, you get it - so many things and a really pleasant surprise. I watched it to see Kathy Bates and I fell in love with her talent. Like the movie, she is also many things and shows the complexity of a relatively simple character type (as \"D.S.\" put it - \"an American frump\"). Yes, she was very frumpy, but with a twist...she had real balls throughout the film and from the time her husband gives her the bad news she begins to show herself that she really didn't need him for validation; her strength shows with her first impulsive decision to go to England and then the fun begins. My favorite scenes are when the Fox sisters realize that they are sharing tea with a fan and, of course, Victor Fox's televised funeral. The end scene, while meandering and very maudlin, touched me and seemed the perfect end to an unexpected adventure. My favorite character was the daughter-in-law, Maudey. What a woman! I'll never see little people the same way again...she was very Chicago.","A mish mash of things you don't actually know what you're seeing, but it is delicious anyway. We know by now that Rupert Everett is a great actor a courageous man and downright irresistible. Unconditional love reminds you that unconditional means unconditional so you're going to love it, no matter what. From Julie Andrews to Don't Look Now, yeah why not. I had a lot of fun.","You know, people who make comedies so often forget it's really ok to be outrageous. Well, not this time. Unconditional Love has it all. Barry Manilow and a dwarf in a movie with Cathy Bates as the romantic lead...and it works. Not only does it work, it works very very well. In fact, I think it's perfect. I laughed so hard I think I hurt myself yet the main characters were all so human, so honest, and so very real. But isn't that where great comedies come from? Don't characters need real feelings, real emotions, and the ability to feel real pain? Well, they do in this movie. Unconditional Love is a movie you shouldn't miss, especially if you need a seriously good laugh, or you're at all curious about seeing the psychotic dwarf in the red raincoat.","My husband and I both loved this film.  At first my husband was skeptical and asked how many points he got for sitting through this one.  But after a few key scenes he was totally sucked in and by the end he was convinced it was one of the best movies going.  Kathleen Bates has never been so wonderfully loveable and the rest of the cast is just simply fantastic. Thank you for this beautiful film.","I found this film by accident while shopping a sale of used DVDs at my local video rental store. I hadn't heard of it but Kathy Bates is always worth watching, so I didn't even look at the back of the package for the rest of the credits. I got it home and was hooked from the beginning credits when the singer turns around and it is Jonathan Pryce. (I fell in lurrrrrrrve with his voice years ago in \"Jumping Jack Flash, in which he IS just a voice for most of the film.) And even though he sings the most incredibly cheesy songs imaginable here, if there was a soundtrack I would buy it in an instant. I enjoy movies which aren't easy to categorize. Here on IMDb it is listed as a Drama/Comedy/Musical/Thriller. That sums it up pretty well as far as I am concerned. If you need to have every little thing in a movie spelled out clearly and make perfect sense you will probably not enjoy this one. The whole movie has a slightly surrealistic feel and I loved the way it flows between reality and fantasy. It reminded me of Harry Sinclair's wonderful \"The Price of Milk\", but that wasn't a film for everybody, either.Incidentally, no one so far seems to have mentioned the first credited screenwriter, Jocelyn Moorhouse. If you did like \"Unconditional Love\", you might want to see another film she wrote and directed called \"Proof\", with Hugo Weaving and Russell Crowe. It also was very strange/odd/beautiful/moving and hard to classify.","I found this movie to be extremely delightful.I am biased I suppose.I happen to adore Kathy Bates.I found her singing an added pleasure.She has a very nice voice.Ms Bates plays Grace Beasley.The film takes you from her doledrums married life in Chicago to England,the home of her recently murdered singing idol Victor Fox.There she meets his three surviving uppity sisters.She also discovers that Victor leaves behind a male lover,Dirk Simpson.The story leads you on to some surprisingly comedic and heartwarming situations as Grace and Dirk develop a true fondness for each other,after an initial rather rude rejection,on his part.They return to Chicago where they team up with Grace's pint-sized,hilarious daughter-in-law,Maudie,to find the serial killer who murdered Victor.Everyone in the picture did a fine job.Particularly enjoyed Julie Andrews,Lynn Redgrave and Barry Manilow.This movie was fun.It makes you cry.The music is absolutely charming.Other posters here who found problems with any parts of this movie,just don't have a clue.","What a shame this movie was never released. (It is now playing on cable.) I tuned in based on my high regard for the stars and was rewarded by seeing a movie far better than the ones I've been paying to see in theatres recently. I like to be surprised.  So often movies are marketed as \"offbeat,\" but are in fact more of the same old recycled drivel.  This movie is genuinely different, with the bonus of a heartwarming message.  Jonathan Pryce sings like an angel. Even though he is required by the plot to sing some of the most mawkishly sentimental songs ever written, he does them so well one doesn't mind.  Cathy Bates and Rupert Everett are well-cast and superb, but a newcomer in the role of Cathy Bates' daughter-in-law steals every scene she is in.  Give this film a chance.","But a great cast! Jonathan Pryce, Kathy Bates, Rupert Everett, Lynne Redgrave, Julie Andrews and Dan Aykroyd! And that's just the beginning.I'm not totally sure that any description of the movie and plot are going to entice you to watch this one. Suffice it to say that it has something for practically everyone: death, singing, a sparkly suit, cell phones, a little person (nice looking woman, actually), a drawbridge (modern, not Medieval), a boombox, and a crossbow. Oh, and a psychotic. And Barry Manilow.You will have to trust me when I say that 50% of you out there will hate this movie because of the lack of the Absurd Gene in your DNA makeup. It's not your fault; it's hereditary. The other 50% of you will probably want to change the channel after 20 minutes, but you HAVE TO KEEP WATCHING.\nEven at that, at the end you may wonder why you watched... but keep in mind that absurdity thing. It should grow on you. It is a test.","Whether it is in drama or comedy, I enjoy Kathy Bates's acting. She always presents her character in a real way that isn't a carbon copy of her last role. And in this \"particular movie\" we get to say, \"Man, what a voice that woman has!\" Kathy Bates is wonderfully funny in the role of Grace Beasley whose life is falling a part. Her husband has left her. Her favorite crooner, Victor Fox (Jonathan Pryce), has been murdered while in Grace's home town of Chicago, Illinois. The only moral support in her life comes from her daughter-in-law, Maudey Beasley (Meredith Eaton), who is a little person with a big, understanding heart. (Maudey is married to Grace's only son, Andrew.) After Victor's death, Grace decides to go to England. She wants to attend his funeral. She desires to be of help to his family. Instead she learns that a young gay man, Dirk Simpson (Rupert Everett) is his family. And that Victor's \"blood family\" is trying to take everything Victor left to Dirk. (Victor's sisters are played by Lynn Redgrave and Stephanie Beacham.) Dirk has been hurt by Victor's death and the treatment he has received from the family. So, needless to say, it takes a bit for Grace to gain Dirk's trust. Once she does, she talks him into going to Chicago to solve Victor's murder. The outcome of their hard work turns up surprises concerning Victor's death.Then there's all that happens to move Grace towards independence, much to the dismay of husband, Max (Dan Aykroyd). This film is worth your time! Among the highlights of this movie are the roles played by Julie Andrews and Lynn Redgrave. What fun they added. AND getting to hear Grace (Kathy Bates) sing, along with a surprise accompanist.","\"Unconditional Love\" starts with great promise. As directed by P. J. Hogan, the film works great up until the last third of the movie, when it falls flat on its face. The screen play Mr. Hogan and Jocelyn Moorehouse wrote showed a myriad of possibilities that fizzle at the end. It appears the artistic team behind the movie had great hopes for it to play differently. The reality is this is a film that is looking in different directions in how to bring it to a resolution that ultimately fails. Don't get me wrong, the movie is tremendously appealing and will resonate with a lot of its viewing public.Based on the strong cast, we decided to take a look. The tremendously talented Kathy Bates is the perfect choice to play Grace Beasley, the woman who finds at the beginning of the film that all is not well in her marriage. Ms. Bates is an excellent actress who deserved much better, even when her character is not helped by what the authors have her do in the film.Rupert Everett is always dependable into delivering. His role, as the late Victor Fox's lover is well written, that is, until Dirk is lured into coming to Chicago to find Victor's murderer. It's bizarre and it defies all rules of logic. Dirk doesn't look capable of hurting a fly, let alone hunt down a killer with the help of Grace and her daughter-in-law, the incredible funny, Maudey.As played by Meredith Eaton, this little woman, Maudey, is one of the best things in the film. She's is brash and tells it as she sees it. Peter Sarsgaard, one of the best actors working in films these days has nothing to do in the picture; he is totally wasted. Dan Aykroyd also has nothing to do. We see him at the beginning and at the end of the film and his Max doesn't make sense. He appears to want changes in his life and his marriage, only to come back to Grace without any explanation, all things forgiven.The English actors are good. Lynn Redgrave has a better opportunity as the hysterical Nola. Jonathan Pryce is seen throughout the film as a ghost singing bland songs. Julie Andrews makes a funny contribution in a couple of priceless scenes. Ultimately the television show hosted by Sally Jesse Raphael is a turn off and doesn't add anything to the movie. The best part is hearing Kathy Bates singing. What a beautiful voice she has! In fact, Ms. Bates is the best excuse for staying until the end.","I greatly enjoyed Unconditional Love (2002) while also being able to see why the film wasn't a commercial success. The problem is that rather than straddling genres, it attempts to be multiple genres. First, Kathy Bates is initially starring in a typically American Lifestyle movie of a middle-aged woman \"finding herself\" after her husband has a mid-life crisis.Then we move to the UK, where we're in a kind of Richard Curtis black comedy (at one point they even sing one of the songs from Four Weddings and a Funeral). Various famous British actors pop up in the same kinds of comedic cameos that one would expect in such films. This even includes Julie Andrews, twice calming down a crisis with \"Getting To Know You\" (why not \"My Favourite Things\"?!)Finally we return to the US, where we're in a sort of B-grade mystery thriller, sort of Hallmark Channel-does-Silence-of-the-Lambs. This still gets interspersed with comedic and surreal singing and dancing sequences, and then we're back to screaming/running/chasing with Rupert Everett in a glittery jacket being the most histrionic of the lot.Meredith Eaton, an actress of physically short stature, has an interesting role. She plays Kathy Bates' daughter, a woman with dwarfism, but her character's condition is alternately used to make a meaningful point about prejudice and diversity, and then for comedic effect. Does it work? I don't know. Sometimes it felt rather awkward.The biggest clash is really the American schmaltz versus the British black humour. I was reminded of Finding Your Feet (2017), a British comedy drama that also features a central character who is a middle aged woman suddenly dumped by her husband who has to find herself. That film has far more tragedy and poignancy than Unconditional Love, and is much more bittersweet than comedic, but it works much better.Perhaps being sharper simply enables a movie to be more sincere. Rupert Everett sniping about gay persecution is far more sympathetic and poignant than Kathy Bates schmaltzing about \"unconditional love\" and human relations.Unconditional Love ends with a huge singing performance that includes Barry Manilow. That possibly tells you more about this movie than anything else could.","If there's anything more difficult to share with another human than a toasted almond, it's a movie comedy; I've shared \"Airplane\" with folks who thought it was insufferably stupid, and there are numerous individuals who don't find the W.C. Fields masterpiece \"It's A Gift\" anything but a bore. When you decide that your best pal has to share Duck Soup with you, and the friend sits stone-faced as Groucho cracks wise, perhaps you even begin to question the nature of your friendship.That said, this film provided me with genuine humor and frequent laughter; the experience seems to be created on the spot by a batch of skilled actors riffing on an impossible and often illogical script and just deciding to throw in whatever might stick to the wall--and they do it without resorting to stupid humor, to flatulent jokes or urinating dogs; instead, we have references to dozens of films, from \"The Wizard of Oz\" to \"Don't Look Now;\" even Julie Andrews appears magically on a stricken aircraft with a tuneful surprise, and...well, if you like slightly nuts, zany humor, you might find this funny. I did, loving the offbeat plot about a left-behind wife and her adventures in another country, but recommended it with caution.","I happened to catch this movie on late night TV. I saw the opening credits and thought this looks good. Well I was very wrong. While not excruciatingly bad (it had some funny and tender moments)it lacked any sense of cohesion.It started off well enough with Kathy Bates'character having a midlife crisis of sorts when her husband leaves her and her singing idol is murdered. But Kathy has played these disaffected women so well before - think Fried Green Tomatoes. The problem wasn't Kathy, it was the clueless screenplay that wandered all over the place. It was as if the writers must have been thinking what will we do next. The script also felt very contrived.Some others who have posted comments on this movie have wondered why it didn't receive a cinematic release. The main reason I think would have been to avoid embarrassment and the critics would have murdered it.Having said all that I thought the small woman who played Maudie was fantastic and stole the movie, not to mention how beautiful she is.","I am a huge Rupert Everett fan. I adore Kathy Bates so when I saw it available I decided to check it out. The synopsis didn't really tell you much. In parts it was silly , touching and in others some parts were down right hysterical.Any person that is a huge fan of a personality of any type will find some small identifying traits with the main character. (Of course there are many they won't, but that is the point)If you like any of the actors give it a watch but don't look for any thing too dramatic it's good fun.I might also mention you can see how darn tall Rupert is. I mean I knew he was 6'4\" but he seems even more in this film. He even seemed to stoop a bit due to the other characters height in this. He is tall! I mean tall!!!! And for you Rupert fans there is a bare chest scene...WONDERFUL!","This movie definitely had some potential in the \"feel-good\" \"chick-flick\" genre, but the editing and direction combined for a ham-fisted mess, and most sit-coms have better writing. A cute idea, an excellent cast, and a total waste of time. Rupert Everett, Kathy Bates, and Dan Akroyd were all well-cast, and handled the roles given them as well as humanly possible. The casting of Johnathon Pryce as the Sinatra/Elvis/Englebert Humperdink character might've worked with a better script, but as it was, it seemed either a moronic turn or a failed attempt at humor by way of mockery. The scenes with Julie Andrews breaking into song to calm riotous crowds were quite funny, and Meredith Eaton was a lot of fun as sex-crazed, hard-as-nails-but-with-a-heart-of-gold midget (the writers incorrectly labeled her a dwarf).Anglothropes will also find plenty of Britishness at which to point their condescending laughter.I'm glad i \"netflixed\" it instead of having to live with the memory of handing over cash for this poor-quality entertainment.","A story about a lonely housewife attracted to an aging pop singer. The pop singer is murdered at the time her husband decides to leave her.  Spurred by the news, she leaves to England to attend the pop singer 's funeral.  There she discovers that the romantic singer is, in fact, a .... It was funny.  The dialogue was witty. Hupert Everett is most attractive. I like his voice and half smiles. On the other hand the poor boy has absolutely no shoulders.  He should never been filmed in sweater, most of all from the back.  He does best in roles colored by hesitation, recalcitrance, stubbornness, not by aggression.  He should not act straight feelings, most of all anger.  Anger, in his case, should best be acted by the defense of devaluation, using arrogance perhaps.  But because this boy is so effortlessly classier than them all, he doesn't need a too overt display of anything, even arrogance. .The dwarf act was gigantesque. She steals many scenes. Her lines fit her like a kid glove.     As to Lynn Redgrave, she flies - like usual. Yet, even in a comedy, details have to make sense.  Here, there are too many inconsistencies. How could Grace get in the house and fix these meals without calling attention on herself!  Where is she staying!  And this sudden bike popping from the ditch!  And all those squatters sharing in the coffee - such small thermos! It reminded me of the multiplication of the fish in the bible.  And why connect the window-washer to the resolution! Come on; let's come up with something else, pleeease.  And if the killer killed because of the  singing, why did they all sing? And why did singing seem to keep him at bay, when singing previously had gotten him to kill!!!!!!  I know it is a comedy, but still, the audience, even though laughing, is left with all types of weird knots on its lap.","Minor SpoilersIn Chicago, Grace Beasley (Kathy Bates) is a housewife having a twenty-five years marriage with the lawyer Max Beasley (Dan Aykroyd) and a hysterical and psychotic dwarf daughter-in-law, Maudey (Meredith Eaton). Grace worships the singer Victor Fox (Jonathan Price), who will present a TV show in Chicago and will give five spots on the first row in a TV promotion. Kate calls the show and wins a ticket, when Max simultaneously asks for the divorce, claiming that their lives are too monotonous. Grace becomes depressed, and when she goes to the show, the audience is informed that a Chicago serial killer, who uses a crossbow, killed Victor Fox. With a broken heart, she decides to fly to England to Victor Fox's funeral. There, she realizes that he was gay, and becomes friend of his former mate Dirk Simpson (Rupert Everett). They fly back to Chicago, trying to find the killer. This movie is a delightful, original and weird dramatic comedy, having bizarre characters. It has a huge potential to be a cult-movie, with the presences of Julie Andrews and Barry Manilow themselves and a joke with Nicolas Roeg's masterpiece 'Don't Look Now', when Maudey wears a red raincoat in Chicago's underground part of the city. The beginning of the movie, with Jonathan Price singing 'Hitchcock Railway', is wonderful. I have repeated it four consecutive times. The cast has a magnificent performance, highlighting Kathy Bates, Jonathan Price, Rupert Everett and the unknown Meredith Eaton. Indeed, this movie is an excellent entertainment. My vote is eight.Title (Brazil): 'Amor a Toda Prova' ('Love to the Proof')","OK, let me just say that I registered for IMDB for the sole purpose of expressing how bad I thought this movie was. Laughably bad. One comment on this board said \"I can't believe I never heard of this movie - it couldn't have been a straight to video release.\" While I was watching this movie, I actually wondered how it could have possibly made it past audience screening and into the theaters in the first place.I really enjoyed the first 30 minutes of this movie. It actually seemed as if we were going somewhere with the arc of the story - a woman loses favorite singer and husband at the same time, and sets off for England to find meaning in her life. Fair enough. She meets the relatives of the singer, and finds that he wasn't exactly as advertised. We have some really funny revelations and interactions at this point. But then they (Kathy Bates, and Vincent Fox's lover, Rupert Everret) travel back to the US to try and hunt down the killer, and suddenly it turns into an amatuerish whodunit. The bulk of the characters' actions, especially by Everret, at the end of the movie are completely out of character from what we have learned about them in the first half of the film. It's as if someone stopped editing the script at the midway part of the film, and the whole thing goes flying around with arms waving until we have a completely unconvincing and painful Barry Manilow/Sally Jesse Rafael singalong at the end. It took more than 2 hours to eventually tell us that, well, I don't really know what it told us. Maybe there's a message here, but it was clouded by all of the incredibly superfluous action in the last 45 minutes.I see that the working title of this movie was \"Who Shot Victor Fox\", which suggests a grossly different kind of movie than does \"Unconditional Love\". That's perfect - even the writers didn't appear to know what the point of this movie was.","Director/co-writer P.J. Hogan loves a merry melange of raucous comedy and group sing along (the music motifs in his films have gone from ABBA to Burt Bacharach to Barry Manilow here--with Manilow present and accounted for!). Kathy Bates looks a little misplaced starring as a dumped-on housewife in Chicago whose idol, a ladies-man singer (Jonathan Pryce, channeling Peter Allen), has been murdered near her apartment by a serial killer; she travels to London for the funeral, befriending the star's secret gay lover and deciding they must go back to the States and bring the killer to justice. Even when she's playing it light and airy, there's a tension in Bates' work which makes her a little scary; she's like a hanging judge, with even her beatific smile capable of going either way. Still, Kathy tries hard to make good on this shrill, cartoony material, which is just too eccentric for its own good. Rupert Everett plays her new friend, Dan Aykroyd (looking sheepish) is Bates' ex-husband, and Meredith Eaton plays Bates' daughter-in-law, a little person with a take-no-prisoners approach to life. All have some good moments in this highly irregular, unsubstantial, woebegone sentimental comedy which ends in a torrent of good will on the Sally Jesse Raphael Show. Oprah must have been booked that week. ** from ****","I thought that the acting of the three leads was extremely good (I must be honest here and admit that I am a very big Rupert Everett fan, ever since I saw him on stage many, many years ago) and in the case of Kathy bates truly superb. The idea of the core of the film is interesting and worthy of exploration, which this film does with wit and the film is, enjoyable but everything is just too light which makes the film feel out of balance. I can suspend reality with ease (well I can normally) but I thought this was just too much, there was no light and shade.It was an enjoyable enough film but the happy ending so typical of Hollywood was rather too over the top and too sweet and left me feeling rather thirsty for something a bit more savory, if you know what I mean.I felt that this could have been a great film, instead of just being a good film.","This was a neat little film starring Kathy Bates.  She plays a housewife obsessed with singer Victor Fox.  One day her husband tells her he wants a divorce, which sends her on an adventure to England to attend the funeral of Fox. There she meets his gay boyfriend and they come back to Chicago to find Fox's murderer.  They team up with Grace's dwarf daughter-in-law and that's when the plot goes way-over-the-top. I didn't like the fact that the murderer turned out to be someone Grace knew because it was just too far-fetched and unbelievable.  But, I liked the songs in the movie and it had some cute moments.  Like when Grace meets Dirk and cooks breakfast, and when we see what Dirk picks out for Victor to be buried in, and the dwarf, Maudey, is really cute and funny in this.FINAL VERDICT: Overall not a waste of time, but it should have been a little shorter.  It has a unique plot with some comedy thrown in. I recommend it if you can catch it on cable.","This movie is stuffed like a tortilla with like six different genres. Which is fine. But it's like Taco Bell tortilla. It's all mushy inside. Now get this straight cause I'm only going to say it once. Kathy Bates plays a housewife who's only joy is to hear her favorite singer Victor Fox (Jonathan Pryce). He is killed the same time her husband (Dan Ayckroyd) leaves her. On impulse, she goes to London to Victor's funeral and meets his lover (Rupert Everett)and together, they decide to hunt down the serial killer who killed Victor. Oh, it's a comedy, I mean drama, I mean . . . i don't know what the hell this is. And there's a dwarf. Who easily steals the film. Why? Because she's funny, spunky and a joy to watch. She is played by Meredith Eaton.The rest of the film is a train wreck. A well shot train wreck but a train wreck none the less. Or was that a tortilla. I can't remember. My brain hurts.","We loved this movie because it was so entertaining and off beat-- Not your usual Hollywood drivel.My husband had a Blockbuster coupon and passed on a string of new releases of violent Hollywood stuff. He was about to walk out when he saw this and decided to take a chance. There was only one copy -- and with some glitches in the DVD that we finally had to flip to wide screen version and then back to the full screen version to make it stop stalling. But it was worth it. Cathy Bates is so good and she was so perfect for the role. And she can sing too! If only Hollywood would learn from Independent film makers! Maybe we would go back to the real movies. But for now, we're sticking with off beat and really entertaining films like this one! Other examples we've enjoyed include: A Box Full of Moonlight, Pieces of April, Delivering Milo, The Celestine Prophesy. Most of the ones by Christopher Guest such as: Best in Show, For your Consideration, A Mighty Wind, and Waiting for Guffman","I've read all the other user comments and am surprised that something keeps getting missed...this is a \"Mary Sue\" story -- a story where a fan has a great adventure with the object of her idolization. This one has an unusual twist (SPOILER ALERT, SPOILER ALERT)...her idol is dead, which, in combination with a couple of personal upsets, actually triggers her adventure. Now, in a typical Mary Sue story the fan also wins the affections of her idol, but this isn't a typical Mary Sue. Telling more than that would spoil the fun...and make no mistake, this is a fun movie.What *isn't* in this movie? We have a lounge-lizard who appears to be a cross between Elvis & Liberace; a grieving gay lover, two marriages on the rocks, a serial killer, a dwarf, greedy relatives...we've got it all, even a humorous reference to Kathy Bates' other \"great fan\" movie MISERY (which is sort of a Mary Sue nightmare) with the wood-chopping scene.The performances are great, and Bates is wonderfully touching, although for me Jonathan Pryce simply made the movie. He's amazingly versatile and has a great singing voice. (Hey, he managed to make a likable Juan Peron in \"Evita\"--what can't he do?)Those who find the film terrible or pointless simply didn't see the point. It's a Mary Sue story, and at the bottom of a Mary Sue story, whether she obtains the object of her affection or not, she learns something about herself. This one does just that, and becomes a better person in the process.","I rented this film based on others' recommendations & the strength of the cast, & really enjoyed it. Okay, the plot has holes in it, & the ending is improbable, but Kathy Bates & Rupert Everett are very good,  Meredith Eaton as the daughter-in- law is indeed a scene-stealer, but the surprise for me was Jonathan Pryce. He plays villains so often that it's easy to forget his versatility. Who would have thought of him as the quintessential lounge lizard?"],"review-user":["horusbedhetys","francozeff","yossarian100","PhilauraJ","Elfpiper","lena771","valkyr","thud-5","Stormy_Autumn","jotix100","istara","museumofdave","mochuck","t-claybourne","pclem70","duvtolev","claudio_carvalho","pn21","moonspinner55","keith_williamson","MLDinTN","Pale-4","bw11","mlktrout","allirish"],"review-date":["9 November 2004","20 March 2018","11 May 2004","1 December 2003","15 August 2004","26 April 2004","4 August 2003","29 October 2003","28 November 2005","6 April 2005","21 March 2018","23 March 2013","1 February 2005","7 April 2007","15 November 2004","11 October 2003","23 September 2004","17 February 2004","17 March 2008","3 June 2004","14 August 2003","21 November 2003","26 March 2007","2 May 2004","16 October 2003"],"review-rating":["7","10","10","10","10","8","7","8","7","4","7","4","8","3","5","3","10"],"review-title":[" A Pleasant Surprise\n"," Not The Salad But The Dressing\n"," An outrageous comedy with all the heart in the world!\n"," So Weird but so very great!!!\n"," This might be my new favorite \"comfort film\".\n"," Delightful\n"," Funny, sweet, unique\n"," Talk about a bizarre movie...\n"," A Funny, Touching Movie (that's loaded with talent)!\n"," Barry Manilow sing along\n"," Enjoyable, if confused\n"," Delightfully Offbeat Comedy When You Need A Boost\n"," Rather silly\n"," I laughed so hard\n"," Coulda been a contender\n"," Some weird knots.\n"," A Delightful, Original and Weird Dramatic Comedy\n"," A trainwreck of a movie with no focus\n"," Kathy Bates struggles valiantly to make something out of nothing...\n"," Very good acting spoilt by typical Hollywood schmaltz\n"," a quirky little film\n"," What the Hell?!?!?!?!\n"," A Surprise Sleeper\n"," Mary Sue Story with a Twist\n"," Offbeat, funny; see it!\n"]}