{"review-url":["http://www.imdb.com/title/tt0248615/reviews"],"review-text":["This was the tag line for the second Wrestlemania, the first Wrestlemania to be a Pay-Per-View Event.  The WWF had to come up with a way to top the original Mania.  To achieve this the event was split between arenas in 3 cities; The Nassau Coliseum, New York, The Rosemont Horizon, Chicago and the Los Angeles Sports Arena.  Each arena held 4 matches and the arenas could link up with live satellite feeds.NEW YORKWe have Vince McMahon and Susan St. James (who?) on commentary so off we go.The Magnificent Muraco vs Paul \"Mr Wonderful\" OrndorffTwo big fellas in here.  This match should be better than it is.  Muraco works through a few power routines, Orndorff displays some of his technical work, but it doesn't seem to gel right.  Crap finish as well.  I expect more from the opening of WrestlemaniaIntercontinental Title Match: The Macho Man Randy Savage (Champion) with Miss Elizabeth vs George \"The Animal\" SteeleAll f***ing right, the Wrestlemania debut of one of my favourite wrestlers of all time.  Savage in my opinion is pure wrestling class, heel or face, doesn't matter to me, the man always puts on a show.  Comes to the WWF, very quickly becomes IC champion.  Anyway, back to the match.  The styles of these two men don't gel too well although Savage tries to carry Animal. Not a bad match, but I am shocked and deeply annoyed that Steele felt he had the right to kick out of the elbow.  Watch it, you'll see what I mean.Jake \"The Snake\" Roberts vs George WellsHmmm, brand new heel with a killer gimmick vs some random jobber picked up on the corner of \"jabroni drive\" and \"know your role boulevard\".  Can't think how this will turn out.  Holy crap, the jobber is controlling the whole match, oh no, DDT all over.  Next...10 Round Boxing Match: Rowdy Roddy Piper vs Mr TTwo of the main eventers from the previous years Wrestlemania, now slug it out to close the New York segment.  This is a hard match to rate as it is so atypical.  A lot of people don't like this match but I find Piper hilarious, especially in heel mode so I quite like this one.  Pipers flagrant cheating is very funny and T's efforts to play it straight is damn admirable.CHICAGONow on commentary we have Gorilla Monsoon, Mean Gene Okerlund and Cathy Lee CrosbyWomen's Title Match: The Fabulous Moolah (Champion) vs Velvet McIntyreOld Moolah, old old old Moolah.  This is awful.  Velvet, who was actually a pretty damn good wrestler gets squashed by the old lard ass herself.  Very quick, very poor.  Next...Flag Match: Corporal Kirschner vs Nikolai VolkoffOkay good all american, albeit Sgt Slaughter rip-off, Corporal Kirshner vs evil russian Nikolai.  The WWF's answer to the cold war, a flag match.  The idea being that each man enters with his country's flag and the winner leaves with both.  Sounds pointless?  Yes it is.  Another daft and pointless match.  This Chicago segment doesn't appear to be shaping up to much.  Oh hang on the next two matches whup ass.20-Man WWF/NFL Battle RoyalGuest Referees: Dick Butkus & Ed \"Too Tall\" JonesGuest Timekeeper: Claire KellerThis battle royal contained WWF superstars as well players and legends from the NFL.  The participants are as follows:NFL: Jimbo Covert, Ted Arcidi, Harvey Martin, Ernie Holmes, Bill Fralic, Russ Francis, \"Refridgerator\" William PerryWWF: Pedro Morales, Tony Atlas, Dan Spivey, Hillbilly Jim, King Tonga, The Iron Sheik, The Killer Bees, Big John Studd, The Hart Foundation, Bruno Sammartino, Andre the GiantWell this is pretty good fun, most battle royals are.  You get a chance to see the future of wrestling in Bret \"Hitman\" Hart involved as quite a major player here.  If you take a look at the participants you can pretty much guess who's going to win this.  Good fun none the less.Tag Team Title Match: The Dream Team (Champions) with Johnny Valiant vs The British Bulldogs with Captain Lou Albano and Ozzy OsbourneOh yes the Bulldogs are here.  In my honest opinion, one of the greatest tag teams ever, and no not just because they're british.  Seriously, Davey Boy Smith and The Dynamite Kid were ahead of their time, pulling out moves you only previously saw in Mexico or Japan.  This match is absolutely brilliant, I never thought I'd say that about a match with Beefcake and Valentine in, yet here it works.  Best match of the night bar none, fabulous performance, great story to the match, superb shock ending.  They don't get any better than this.LOS ANGELESOkay, now on commentary we have Jesse \"The Body\" Ventura (yay), Lord Alfred Hayes (boo) and Elvira (god how I used to lust after this woman (still do)).Ricky \"The Dragon\" Steamboat vs Hercules HernandezI like both these guys, but this match just didn't do it for me.  I don't think their styles complimented each other particularly well.  Not bad, not great, just decidedly average.  Anyway I think I'll skip on now.Uncle Elmer vs Adorable Adrian Adonis with Jimmy HartYuk, yuk, yuk, yuk, yuk.  Two fat men, one dressed as a hillbilly and one in a dress gut-barging each other.  In my opinion, worst match on the card. Next...Tito Santana & The Junkyard Dog vs The Funk BrothersThis is more like it.  Tito flying about all over the place, JYD smashing Funks through tables, the funks taking some superb bumps.  This one is great fun.  I love watching Terry Funk, because you know the guy's going to do some crazy shit to his body, in this case a big back drop on to the cement floor.  This match is fast paced, the styles compliment each other quite well and this is the most entertained I've ever been by the JYD.  All in all, top stuff.Steel Cage WWF Title Match: Hulk Hogan (Champion) vs King Kong Bundy with Bobby \"The Brain\" HeenanGuest Ring Announcer: Tommy LasordaGuest Referee: Robert ConradGuest Timekeeper: Ricky SchroederOkay main event time.  Hogan in a cage that's pretty unusual.  Here we see the start of the trend of having Hogan face guys even bigger than he is, other examples being Andre and Earthquake.  This isn't a bad match, not great as cage matches aren't really suited for massive guys.  Still some good action, a damn good story, bit of blood, Heenan receives a slap which is always good fun.  Problem is, there's never a question of who's going to win.  Ah well, can't have everything.And so ends Wrestlemania 2, not as good as the first, but still worth a look.  Especially for the introduction of Savage and Jake, and that damn fine Bulldogs Match.  Anyway signing off for now, be back with a write up of Wrestlemania 3 sometime soon.","Wrestlemania II (1986) was shot at three different locations (bad idea). Vincent K. McMahon tried to be different and it nearly killed the series. Whenever you try to do an event such as this one in three seperate events, the quality is going to be anywhere from average to very poor.  But hey you can't fault the man for trying.  Most notable from this event is the great \"boxing\" match between Mr. T and \"Rowdy\" Roddy Piper.  Piper's promos are worthy enough to sit through the rest of the matches.  Mr. T is slouch either.  The rest of the card is a mixed bag.  For sideshow viewing you have the wrestlers/football players battle royale, the Funk Brothers in action (Terry and Dory jr. a.k.a. Hoss) and as always George \"The Animal' Steele. Hulk Hogan (juiced to the gills) is locked in a brutal cage match with King Kong Bundy.  Wrestling wise it's better than Wrestlemania I but it has it's boring and dull matches as well.For big fans of 80's wrestling.B","This was the first Wrestlemania to be shown on PPV as the first, in 1985, was shown on Closed Circuit Television. The Gimmick here is that we're coming to you from three different cities, New York, Chicago and Los Angeles in a coast to coast spectacular! This seemed like a great show at the time it happened and is still good fun now.The action starts off in New York with Paul Orndorff and Don Maruco fighting to a double count out draw. They do some nice stuff and the match ends after about 4 minutes. The second match on the card features the first Wrestlemania appearance for Macho Man Randy Savage, one of the great wrestlers of the late 80s and 90s. He's here putting the Intercontinental Title on the line against George \"The Animal\" Steele. Steele has his chances, but for most of the fight is too busy ogling over Savage's sidekick Miss Elizabeth. Savage rolls up Steele and puts his feet on the ropes to get the pin. Dastardly.Next up is he short match between Jake Roberts and George Wells. Roberts wins in short order with the DDT and gets his pet snake \"damien\" to slither all over the unfortunate Mr Wells. The main event for the New York section of the show is a boxing match between Mr T and Roddy Piper. This one ends in the fourth round with Piper disqualified for body slamming Mr T. I pity that fool.Things now move to Chicago where we kick things off with the Fabulous Moolah defeating Velvet McIntyre to retain the WWE Women's Championship. McIntyre looked a good thing to win the fight for most of the going, but the veteran Moolah pulled out the win with some nice evasion and a quick pinning combination. Next up was a flag match between Corporal Kirschner and Nikolai Volkoff who was accompanied by Freddy Blassie. Blassie tries to throw his cane to Volkoff, but Kirschner intercepts it, knocking out Volkoff and winning the match.The next match was the NFL Superstars vs WWE Superstars. I'll be honest as an Australian and say I have no idea who any of the NFL guys were. It doesn't matter anyway as the 20 man battle Royal comes down to Andre the Giant vs the Hart Foundation. Andre wins after eliminating first Neidhart than Bret Hart. The main event for the Chicago part of the show is the British Bulldogs (Davey Boy Smith and the Dynamite Kid) defeating the Dream Team (Brutus Beefcake and Greg Valentine) to win the Tag Team Championships. Plenty of shenanigans here, with head butts and ref bumps. From a technical standpoint this was the match of the night.Wrestlemania 2 now switches scenery to beautiful Los Angeles, and we kick things off with Ricky Steamboat getting an upset win over Hercules. Steamboat jumps around a bit, Hercules beats on him, goes for a splash, misses, Steamboat pulls out the win. Next up we had Adrian Adonis accompanied by Jimmy Hart defeating Uncle Elmer. Short match, don't know what the story was going in. Crowd seemed to like it. This is followed by Hoss and Terry Funk defeating the Junk Yard Dog and Tito Santana with help from Jimmy Hart's microphone.The main event in Los Angeles, and for the show is Hulk Hogan defeating King Kong Bundy in a steel cage match to retain the WWE Title. Some people rate this the worst match ever, but they really need to get over it. Fun match, crowd was into it. Good triumphs over evil. The only thing I will say bad about it is the awful female commentary throughout the event.An interesting experiment which didn't quite work for the WWE and was never tried again.","Here are the matches...Nassau Colloseum Paul Orndorff v Don Muraco: A relatively fast-paced match (which features a tasteless slanted eye gesture made by Orndorff against Mr Fuji) that ends with an unsatisfying double count-out. A shame because this could have been the sleeper of the night. I am sure I could hear the fans shout 'bullsh*t' after the match... 3/10 George 'The Animal' Steele v 'Machoman' Randy Savage for the Intercontinental title: This was an oddity and mainly a match of entertainment and hijinks than wrestling in itself. On a rare occasion, 'Machoman' messes up a flying body-cross and Steele actually kicks out of the flying elbow. It ended with 'Machoman' getting the cheap pin with feet on the ropes manoeuvre. 4/10 George Wells v Jake 'The Snake' Roberts: Jake gets dominated by 'jobber to the stars' Wells until he lands the DDT. Jake drops the snake over Wells (rather unconvincingly) but Wells sells the idea well by frothing at the mouth. 2/10 How many times does Susan Saint James say 'C'maaaan George' during the night? Lol.Mr T v 'Rowdy' Roddy Piper boxing match: This boxing match didn't go anywhere near the distance. Both combatants knocked each other out during rounds 2 and 3 and Piper got disqualified in round 4 for executing a body-slam. A waste of time really and the only real factor of this match was it started a face turn for Piper as the crowd realised he was more interesting than Mr T. 3/10 Rosemont Horizon Velvet McEntyre v Fabulous Moolah for the women's title: A blink and you'll miss it squash match which devalues the women's title. Moolah pinned McEntyre after a failed body-press within 2 minutes. I've read recently that McEntyre's match was cut short because she had a wardrobe malfunction. You can see McEntyre doing her best to protect her modesty during and after the match. 1/10Corporal Kirschner v Nikolai Volkoff - flag match: A mercifully short two minute spectacle giving enough time for Kirschner to catch Blassie's cane in the air meant for Volkoff and whack him with it to gain the pin. Kirschner still manages to bust his head open in the process. I can only guess this was the WWF's way of dealing with 'The Cold War'. 2/10 WWF/NFL battle royal: A decent 20 man event but not much time was devoted to it. If you notice hard enough you will find Bruno Sammartino barely does anything in the ring but wander around and 'Hillbilly' Jim tries too hard to get himself eliminated while John Studd falls for a rookie mistake. Andre the Giant won the match defeating both members of the Hart Foundation (sporting blue tights). 6/10 British Bulldogs v Dream Team for the WWF tag titles: This is definitely match of the night. Well fought though the majority of it sees Greg Valentine getting a beating. Ozzie Osbourne joins The Bulldogs (probably WWF still attempting the Rock 'n' Wrestling connection) and Gene Okerlund refers to Osbourne coming from Manchester when he actually comes from Birmingham. Anyhow, that aside, a good match which finishes when a dazed Hammer clashes with the Dynamite Kid and gets pinned. 6/10 Los Angeles Memorial Sports Arena Ricky Steamboat v Hercules Hernandez: A match notable for Hercules's ring costume at the start, portraying a Greek soldier and looking like the late 'Bruiser' Brody. Steamboat carries Hercules to a reasonable match (Hercules actually attempts the top-rope at one point) but the conclusion was never left in any doubt when Steamboat flying body-presses for the pin. 5/10 Uncle Elmer v Adrian Adonis: Adonis comes to the ring in a dress and wearing gaudy make-up. Before Wrestlemania 2 Adonis 'came out' as a homosexual (even though he was a happily married man in real life) so I can only presume the WWF equated homosexuality with transvestitism. I laughed at Elmer falling over after delivering a blow to Adonis and Adonis entertained with his bumping before he got the quick pin over Elmer after a flying head-butt. A favourite of mine but not a good match by any means. 3/10 JYD and Tito Santana v Terry and Dory 'Hoss' Funk Jnr: It's nice to see Terry Funk looking more healthier than he does these days. A pretty good match with Terry doing some nice bumping (he gets slammed on to a table at one point). The action was marred by a cheap foreign object ending as Terry pinned JYD after hitting him with Jimmy Hart's megaphone. 6/10 Hulk Hogan v King Kong Bundy steel cage match for the WWF world title: One of those rare cage matches that featured during the 80s where blue steel replaced the usual meshed cage. The match was predictable in it's outcome but a pretty tough outing for the two. At one stage Bundy removes the bandage from Hogan's injured ribs and proceeds to choke him with it and Bundy leaves the match with blood on his face. Hogan goes over the top of the cage to win the match. 6/10A lot of people really dislike this Wrestlemania and often rate it as their worst but it does have a few decent matches. I guess most of the criticism levelled at Wrestlemania II was the PPV structure set in 3 arenas and how much the show has dated because of it's comparatively limited production values and minor celebrity overload. Advert moguls Wendy's 'Where's the beef?' Clara Peller yells into the air while Burger King's Herb dances like a pillock when they get introduced. The pecularities in certain matches (George 'The Animal' Steele vs 'Machoman' Randy Savage and Uncle Elmer vs 'Adorable' Adonis) are interesting too showing the idiosyncrasies and attitudes in wrestling haven't really changed much over the years.","Three cities! Television personalities! Fast Food mascots! Football players! Awful matches! Yup, WrestleMania 2 has all of that. For some reason or another, Vince McMahon decided to broadcast this event from three different arenas in three different time zones. I'm not sure where the event would have originated from had he chosen just one venue, probably Nassau if I were to guess. So we start off from the New York segment at the Nassau Veterans Memorial Coliseum in Uniondale, NY. Vince broadcasts with scratchy voiced actress Susan St. James, who just happens to be married to Vince's buddy Dick Ebersol. I didn't count how many times she said \"Uh Oh!\" during these 4 matches but it was at least 22. We start off with Mr. Wonderful Paul Orndorff vs The Magnificent Don Muraco. This ends in a lame double count out, not a strong kick off to what is supposed to be your mecca event, granted it was only the second incarnation of it. Next we get the Intercontinental Title match between Macho Man Randy Savage and George \"The Animal\" Steele. About what you'd expect from an Animal Steele match, entertaining to a point, but it doesn't give Savage the chance to show off his true in ring talent (that would have to wait til WrestleMania III). Next is an encounter between Jake \"The Snake\" Roberts and former football player George Wells. Wells is wearing football pants that he either kept from his CFL days or stole from the Houston Oilers. Jake wins the match with a DDT that flips Wells completely over and then smothers and chokes him with Damian the snake. The final match in NY is a boxing match between Roddy Piper and actor Mr. T. This is not a good match by any means, but you DO get to see Burger King's Herb do a dance prior to the bell. Piper loses by DQ for shoving the ref and body slamming Mr. T. The real life dislike for each other was evident by this point, I wonder if a regular wrestling match would have sufficed better. Oh well, at least Cab Calloway was in attendance right?Now we're shipped to Chicago's portion of the event emulating from The Rosemont Horizon, which Gorilla Monsoon calls a beautiful arena, trust me it's not. He's joined on commentary by actress Cathy Lee Crosby and Mean Gene Okerlund and Big Cat Ernie Ladd during the battle royal only. We start with a women's championship match that lasts about a minute when The Fabulous Moolah pinned Velvet McIntyre in about a minute. Then Corporal Kirchner beats Nikolia Volkoff in a flag match in two minutes. Wow, these matches just keep getting longer. Now we get to the 20 man battle royal which has a mixture of WWF wrestlers as well as NFL football players. Mean Gene announces former Wendy's commercial actress Clara Peller and she has to ask \"Now?\" twice for her cue. Yes lady NOW! She then waves her microphone like a magic wand and says \"Where's the Beef\" but no one hears her. The Horizon comes unglued for hometown player (and recent champion) William \"Refrigerator\" Perry. The match also featured a trio of former world champions in Bruno Sammartino, The Iron Shiek, and Pedro Morales. Andre the Giant and \"Golden Boy\" Danny Spivey dress the same here, as they both don yellow Hulk Hogan tights and boots. Andre gets the win after last eliminating The Hart Foundation. The final match is for the WWF tag team titles in which The British Bulldogs win the gold from Greg Valentine and Brutus Beefcake. With Ozzy Osbourne and Captain Lou in your corner how could you lose? So far I'd say the battle royal and tag title match are the best of the night giving the edge to Chicago over New York. Let's go to L.A.In L.A., Jesse \"The Body\" Ventura, Lord Alfred Hayes, and Elvira are your broadcast team. Elvira wasn't the quickest thinker when asked questions but she's Elvira and she's sexy so it's ok. Sometimes the audio volume level goes up and down here, 1986 technology was only so good when you're running one show from three cities. First bout here Ricky Steamboat pins Hercules in a decent match, a clash of styles bogs it down a bit. Like Randy Savage, Steambout would have to wait a year to truly show off his talents. Next, Adorable Adrian Adonis defeats Uncle Elmer in an awful match with just a few bumps and flips by Adonis saving it from being completely bottom of the barrel. In a tag match, the Funk Brothers beat Junkyard Dog and Tito Santana in a decent match saved by some bumps by Terry Funk. Now the main event. Wait, no WrestleMania main event is complete without celebrities. Bring out Dodgers manager Tommy Lasorda, who spits (literally) as he's announcing Ricky Schroeder and Robert Conrad. WWF title on the line in a steel cage, Hulk Hogan vs King Kong Bundy. This is a better main event than the first WrestleMania. Some fans rated this match as mediocre but I found it to be pretty good. Despite some audio trouble, I'd give the edge to L.A. as the best segment of this lackluster event. In conclusion, between celebrity broadcasting, city hopping, bad matches, and low production values turn this one into a bottom 5 WrestleMania.","After the success of the original event, \"Wrestlemania 2\" ups the ante a bit with better production values and a larger sense of this being a truly not-to-be-missed event. Yet, it still relies far too much on the \"gimmick\" of celebrities and doesn't just let the plot lines play out.The highlights of this event include:-Ray Charles kicking off the proceedings with a stirring melody of patriotic standards. Really gives the show a sense of gravitas right off the bat.-Randy \"Macho Man\" Savage vs. George \"The Animal\" Steele. Two great wrestling personalities playing off of each other.-A Battle Royale featuring NFL players and (spoiler) won by the always entertaining Andre The Giant.-The boxing match between Mr. T. and \"Rowdy\" Roddy Piper works well with the hype...but then kind of fizzles in the actual match.-Same thing for the Hogan vs. Bundy finale...pretty good build-up but the match itself was nothing to write home about.-The fact that a guy named \"Uncle Elmer\" could be on this card (!).All in all, I give \"Wrestlemania 2\" a 2.5 ranking. The show looks better than the first, and (though not great by any means) many of the matches are an improvement as well. However, it is very clear that the correct formula for holding a big pro wrestling event is still being worked out. Instead of just letting the story lines play out and the personalities shine, the card instead still relies too much on celebrity involvement and gimmicks.As my title indicates, this is an event that is taking the first baby steps towards greatness in this production.","(04.07.86)Wrestlemania 2 was held in three places! We start off in Uniondale, NYYour hosts are Vince McMahon & Susan Saint James\"Mr. Wonderful\" Paul Orndorff Vs The \"Magnificent\" Muraco (W/Mr. Fuji)The match ends in a double count-out after both men brawl on the floor. This was a match that was meaningless and directionless. I like both wrestlers as individuals, but it's hard not to be disinterested with how poorly it was thrown together. The crowd chanting \"bullshi*****\" over the finish says it all.*Intercontinental ChampionshipRandy \"Macho Man\" Savage (C) (W/Elizabeth) Vs George \"The Animal\" SteeleSavage retains the title by using the ropes to pin Steele. This was a very poor comedy match. Steele spends most of the match chasing Savage around and I didn't find Steele's OTT antics to be entertaining at all. Steele kicking out of the elbow drop irked me as well. *Jake \"The Snake\" Roberts Vs George WellsJake wins with a DDT. This is a glorified squash match. Wells got in some convincing offense, but the result is never in doubt. The most memorable thing about this match is Wells drooling from the snake being draped over him. *1/4Boxing Match\"Rowdy\" Roddy Piper Vs Mr. TT wins by DQ in the fourth round after Piper bodyslams T. This was an OK spectacle. It's pretty boring for today's standards, but back then it was pretty huge. Part 2 emanates from Chicago, IL at the Rosemont Horizon.Your hosts are Gorilla Monsoon, Gene Okerlund & Cathy Lee CrosbyWomen's TitleThe Fabulous Moolah (C) Vs Velvet McIntyreMoolah pins McIntyre after McIntyre misses a splash (even though McIntyre's foot was on the ropes...) This was a very quick match and way too short for me to really comment any further on it.DUDFlag MatchNikolai Volkoff (W/Freddie Blassie) Vs Corporal KirchnerThe winner gets to raise the flag. Kirchner wins after using Blassie's cane. At least this match was short! Short and painless is what I like when it comes to stuff like this. 1/4*20 Man Battle RoyalThis one has stars from the NFL as well. The participants are Jimbo Covert, Pedro Morales, Tony Atlas, Ted Arcidi, Harvey Martin, Danny Spivey, Hillbilly Jim, King Tonga, The Iron Sheik, Ernie Holmes, The Killer Bees, Big John Studd, Bill Fralic, Bret Hart, Jim Neidhart, Russ Francis, Bruno Sammartino, William \"refrigerator\" Perry, and Andre The Giant. It comes down to Andre The Giant and The Hart Foundation. Needless to say, Andre dumps them both out to win the battle royal. This was OK for a battle royal. The NFL players didn't embarrass themselves. Perry and Big John Studd going at it was pretty cool and the crowd was electric for it. In one of the rare cases, the big man actually IS the favorite. Andre winning was a good choice, even if the fans desperately wanted William Perry to win it. (I don't rate battle royals)Tag Team ChampionshipThe Dream Team (C) (Greg Valentine & Brutus Beefcake) (W/Johnny Valiant) Vs The British Bulldogs (W/Capt. Lou Albano & Ozzy Osbourne)The Bulldogs win the title after Valentine collides with The Dynamite Kid head first. This is a textbook example of what tag team wrestling should be all about. Rarely will you ever see a tag team match go this smoothly. I can honestly say this match is awesome and completely stole the show.**** (out of 5 stars)We go to the Los Angeles, CA portion of the show!Your hosts are Jessie \"The Body\" Ventura, Lord Alfred Hayes, and ElviraRicky \"The Dragon\" Steamboat Vs Hercules Hernandez (W/Freddie Blassie)Steamboat wins with flying cross-body from the top. This match was alright, I suppose. It didn't have enough excitement to really get it over the hump, though. As amazing as Steamboat is in the ring, he can't work miracles. *3/4\"The Adorable\" Adrian Adonis (W/Jimmy Hart) Vs Uncle ElmerAdonis wins with a fistdrop of sorts from the top. The match was pure crap, of course. But watching Adonis bump around like crazy to try to get the match over is kinda fun.½*Terry Funk & Dory Funk Jr. (W/Jimmy Hart) Vs The Junkyard Dog & Tito SantanaThe Funks win when Terry Funk drills JYD with the Megaphone. This match was all sorts of fun! The match was rather wild and chaotic throughout with Terry Funk shining the most out of anyone in this match. Good stuff overall!***1/4WWF Championship (Steel Cage Match)Hulk Hogan (C) Vs King Kong Bundy (W/Bobby Heenan)Hogan retains the title by escaping the cage. This match gets by on solid drama and storytelling. Praise aside, this is still one of the weakest main events in Wrestlemania history. There is nothing outstanding about it or anything that should warrant a place on any \"Best of\" Steel Cage match DVD's. **It's not the greatest by any means, but after repeated viewings, it's not as bad as I originally thought. Having Wrestlemania in three different cities was an audacious idea that didn't quite pan out for Vince. I actually thought it hindered the show a bit. With all the hype Hogan Vs Bundy got, The Dream Team Vs The British Bulldogs stole a bit of their thunder and easily stole the show. Overall, this is one of the worst Wrestlemania's, but there are worse Wrestlemania's, such as Wrestlemania 9 and 11.","Don Muraco Vs. Paul Orndorff - Huray, double DQ from the start :-/5/10Intercontinenta Championship: George Steel Vs. CHampion: Macho Man- Please no more stuff like this. The only interesting part was kick-out from Macho's finishing elbow. Heh. :)3/10George Wells Vs. Jake Roberts6/10Boxing Match Mr. T. Vs. Piper - WTF?! Why is this c*ap on the card.2/10Women's Championship: Welvet McIntyre Vs. Champion: Fabulous Moolah - 1-minute long match? God, this is really weak event.4/10Corporal Kirchner Vs. Nikolai Volkoff - 2-minute match. Good old classic... (insert ironic smile) 4/10Battle Royal - Solid fun, but Andre \"Benefiting from Legend\" Giant, like a winner? 7/10Brutus Beefcake/Greg Valentine Vs. The British Bulldogs - I give credit, where it deserves. Good match.7/10Hercules Hernandez Vs. Ricky Steamboat 6/10Adrian Adonis Vs. Uncle Elmer - Only PPV appearance of Stan Franzier, worst wrestler for year 1985.3/10Terry Funk/Hoss Funk Vs. Tito Santana/Junkyard Dog 5/10Cage: Hogan Vs. King Kong Bundy - What entertained this crowd? Can't get it. 4/10BTW: Listening to Piper's interviews is like pain in the a.. :-(","Well Wrestlemania was a success and now the WWF had become a coast-to-coast organization and for Wrestlemania 2, Vince McMahon decided to capitalize on this fact by holding Wrestlemania from three separate venues in New York, Chicago and Los Angeles. Unfortunately, this takes away from the show.The New York portion of the card consisted of: - Paul Orndorff fighting to a double countout with the Magnificent Muraco. Orndorff was very popular at this point and the crowd booed the hell out of the finish. - Jake Roberts, a few months into his WWF run, beat some random jobber named George Wells with the usual move (DDT) and usual post-curricular activities (Damien). - Randy Savage defeats Geroge Steele to retain his IC title. They couldn't find a better guy for Savage to feud with. - Mr. T defeats Roddy Piper by DQ in round four in a boxing match. This was T's last appearance in the WWF and the end of Piper's monster heel run and his ascent towards one of the most loved workers of all-time.The Chicago portion of the card consisted of: - Velvet McIntyre loses to The Fabulous Moolah in a Ladies Championship match. Next. - Corporal Kirshener (who?) defeated Volkoff in a flag match. Yeah, yeah a minute of my life I won't get back. - Andre the Giant won a Battle Royale that involved football players as well as Bret Hart, Jim Neidhart, The Iron Sheik, Hillbilly Jim, The Killer Bees, John Studd, Ted Arcidi, Tonga Kid (Haku), Dan Spivey, Russ Francis, Fridge Perry, Jimbo Covert, Harvey Martin, Bill Fralic, Bruno Sammartino, Tony Atlas, Pedro Morales and somebody whose name escapes me. Anyways cool to see Bret in WM debut and he is last eliminated by the big man. - British Bulldogs (with Ozzy) beat Beefcake and The Hammer to win tag titles. Good match, um...Dynamite took a nasty bump at the end. No wonder he's in a wheel chair.LA portion - Steamboat pins Hercules who was crazier than normal. Steamboat was talented. - Adrian Adonis beats some guy named Uncle Elmer (quoi) and well I didn't bother watching. - Terry Funk & Hoss Funk beat JYD and Chico Santana when the Funks hit JYD with the Colonel's megaphone. - Hogan beat Bundy in a steel cage mathc.","*POSSIBLE SPOILERS AHEAD*I'll only say what hasn't already been said here (and I'll continue this for the rest of my WWF/WWE comments).If you're going to have a Women's title match, at least make it interesting, rather than just a squash to put over the current champion.  I guess Moolah couldn't handle an intense match but they wanted to have the legend in a WrestleMania.I thought the Killer Bees were wasted in WrestleManias, especially here. I became a fan in 1989, about a year after the B. Brian Blair was gone and Jim Brunzell became a canvas back.  So I didn't realize for a while that they were a top tag team, even top contenders.But I loved seeing Bill Fralic in the battle royal.  He really came into his own here, creating a cocky heel character in a pre-match interview and even making an elimination in the battle royal.  Besides Steve McMichael and Kevin Greene, he is the only professional athlete from my generation with any respect for wrestling (anyone remember Dennis Rodman?).  And what was with the Hart Foundation's ridiculous green tights?","WrestleMania I was a superb card and any card that was going to follow it would have to be good. WrestleMania II was good.It's quite sad watching cards from the 1980's. In my opinion they really were the best times for wrestling. The early 90's were fantastic as well. Wrestling is okay to watch nowadays but some of the current stars just don't seem as charismatic as the stars of yesteryear.(POSSIBLE SPOILERS)WrestleMania II took place in 3 cities each with their own main event. Andre the Giant won a Battle Royal! Roddy Piper fought Mr T in a boxing match and earned himself a DQ! And the most charismatic wrestler in history Hulk Hogan once again proved that good triumphs over evil when he beat the monstrous King Kong Bundy in a steel cage match!Just like the previous WrestleMania we were treated to the usual bevy of celebrities who helped make WrestleMania II a spectacular event.","This was the worst Wrestlemania in history.  The only good matches were Ricky Steamboat vs. Hercules Hernandez, and the tag title match between the British Bulldogs and the Dream Team (this one bordered on classic). Everything else was either poor or awful.  The idea of having three host cities was unnecessary, confusing and messed up the fluidity of the show. The celebrity guests were terrible on commentary, especially Susan Saint James.If you're interested in the mid 80's WWF, you're better renting or buying Wrestlemania 3, or just about any other PPV for that matter.","Match 1: Paul Orndorff and Don Muraco wrestled to a double-countout Match 2: Randy \"Macho Man\" Savage defeated George \" the Animal\" Steele Match 3: Jake \"the Snake\" Roberts defeated George Wells via pinfall Match 4: Mr. T defeated Roddy Piper by DQ in a boxing match Match 5: Women's Champion Fabulous Moolah defeated Velvet McIntyre Match 6: Cpl. Kirschner defeated Nikolai Volkoff via pinfall Match 7: Andre the Giant won a 20 man battle royal Match 8: British Bulldogs defeated Greg Valentine & Brutus Beefcake for the Tag Team Championship Match 9: Ricky Steamboat defeated Hercules via pinfall Match 10: Adrian Adonis defeated Uncle Elmer via pinfall Match 11: Hoss & Terry Funk defeated Junk Yard Dog and Tito Santana Match 12: WWE Champion Hulk Hogan defeated King Kong Bundy in a cage match\nOverall Mark: B+","A very lackluster show. I remember being like \"What a show!\" Back when I first saw it. Well 17 years later and I really dont like any of the card at all. Well thats what happens when you turn from Mark to Smark.The Funks vs. JYD and Tito match was suprinsgly good, while Match of the night honours go to Bulldogs vs. Valentine/Beefcake.Not recommended.BTW, if you want to chat about the good old days of wrestling just drop me an e-mail!","This one is not quite as bad as the first, but it does suck. The tag-title match is good, and I like battle royals, so that is a fun watch (even with pro-footballers in there) But the three different locals sticks. YOu get stuck with different annoucers & crowds and just breaks up the show. Take a pass on this one for sure."],"review-user":["stevedorsett","Captain_Couth","bh_tafe3","BobbyUK","Eraser81","zkonedog","callanvass","amanwhorocks","willge","wwfhistoryguy","Big Movie Fan","Jonas-4","Spawn Devil","RepoManRules","jimjam20-2"],"review-date":["16 May 2002","4 June 2004","11 February 2009","3 August 2007","19 January 2018","6 March 2017","18 March 2016","27 May 2013","19 May 2006","1 April 2004","26 April 2002","28 October 2001","1 July 2002","24 May 2003","5 March 2002"],"review-rating":["5","5","2","4","4","5","4","2"],"review-title":[" What the World is Coming to\n"," The second installment of Wrestlemania!\n"," Interesting and innovative idea\n"," A tale of three cities...\n"," Uh oh!\n"," Getting Closer...\n"," King Kong is no match for The Hulk!\n"," No.2 Better? Not really\n"," Too inconsistent\n"," Not as bad as first\n"," HULKAMANIA RULES AGAIN\n"," A terrible PPV\n"," New York, Los Angeles and Chicago featuring a Triple Main Event For Wrestlemania 2!\n"," Ick\n"," Three different locations? STUPID!\n"]}