{"review-url":["http://www.imdb.com/title/tt0202470/reviews"],"review-text":["As a huge fan of 80s Hard Rock, I was really looking forward to seeing Rock Star. As the movie started I was more than satisfied. A lot of the early scenes were funny and entertaining. The concert scenes made me feel like I was actually there. One major compliment I give this movie is that they made the songs from the fictional band STEEL DRAGON sound realistic for the time period the movie is in. If I didn't know better, I could've been fooled into thinking Steel Dragon was a real band, and all their songs actually were made in the mid 80s. The underdog portion of the story may not be original, but it still works none the less. And by the time Wahlberg's character was in his first concert with the band, I really thought Rock Star could be one of the coolest movies of the year.But at about the halfway point, I was lost. The second half of this movie could've really used a lot of work on the script. I say that the second half of the script needed work, but what I should say is the second half of the movie actually could've used a script, period. The second half is held together by some predictable sequences, all telling the story of a guy indulging in the rock star life, which we've all heard and seen a thousand times. There were very few moments that actually were used to progress the story.But I don't want to give the impression that Rock Star was no good. Although some of the movie didn't work, I still had a blast watching it. The music is what really holds it together. Both the original songs written for the film (Steel Dragon), and the background songs used. It's not often that you can hear bands like Bon Jovi, Def Leppard, Kiss, and Motley Crue used in a movie. And like I said before, the concert scenes are awesome.So for people who love great 80s Rock, this movie will be a lot of fun. \nRock Star is an average movie, with an above average soundtrack. Not a perfect film, but it provides enough entertainment for your money.","I must admit I wasn't expecting much on this movie. I was surprised  I truly enjoyed it as much as I did.  The script wasn't oscar material, but it wasn't horrible either.  The acting was great by Mark Wahlberg.  Jennifer Aniston  had a great supporting role, and looked lovely as ever.  What made this movie for me was the music.  If you do not like 80's glam metal or hair bands, then you probably wont like this movie.  Its all about being a rockstar.  Some cliche's were present, but didn't bring down the movie at all.  I would recommend it to anyone who likes rock and roll and remember to Stand up and Shout!!! 8 of 10 for great acting and awesome music.Jason","Surprisingly well-acted, well-written movie about hard rockin'-but-decent young man getting that much-hoped-for ticket to stardom: his favorite heavy metal band wants him to replace their lead singer. Not far-fetched, the film tries keeping things in perspective and doesn't go over-the-top; it certainly makes you think twice about those lingering adolescent fantasies about being in the music business. But the script, despite solid dialogue, follows a tried-and-true, formulaic pattern, and gets bogged down by its own clichés in the final act. I enjoyed it much more than the sugary fluffball \"Almost Famous\". It has a nice, bitter edge to go with its heavy metal decadence, but a stronger finish might've made it more memorable. **1/2 from ****","ROCK STAR / (2001) *** (out of four)By Blake French:\t\"Rock Star\" is the story of a nobody who becomes propelled into fame, only to realize living his dream is not the way he imagined it. We have seen all this before (in better movies), but this human story does capture the world of rock and roll with a brutally honest and insightful edge. It garners a recommendation because of its visualization of the atmosphere. The script, by \"Crazy/Beautiful\" director John Stockwell, portrays the hard-core universe with memorable images-it doesn't explain what it is about, it shows us.\t\"Rock Star,\" originally titled \"Metal God,\" stars Mark Wahlberg as Chris \"Izzy\" Cole, a Pittsburgh office supplies salesperson who dreams of becoming Bobby Beers, the fiery lead singer for the heavy metal rock group, Steel Dragon. Although Chris already sings for his own tribute rock group called Blood Pollution, instead of writing his own songs, he insists on performing only those by Steel Dragon, and only in the exact way they perform them. His group becomes irritated with Chris' obsessions and gives him the boot.\n\tThis devastates Chris, as well as his supportive parents and faithful girlfriend, Emily (Jennifer Aniston from TV's \"Friends\"). He then receives a phone call. It's the Steel Dragon band. They have seen Chris' tapes and want him to replace the recently fired lead singer. In an instant, Chris rockets into the dizzying world of sudden stardom-from the biggest rock fan to the biggest rock star. Unfortunately, it's not as rewarding as he expected.\n\tA true story inspired the \"Rock Star\" concept. An Ohio supply salesman, Tim \"Ripper\" Owens, really did replace Rob Halford, the lead singer in Judas Priest, after initially singing for a tribute band. The rest of the film is probably fiction, although most of what happens must represent the experiences of many other bands. The film details the various ordeals of being a rock star. It explores the aspects of touring, personality differences, the danger of drug abuse and violence, struggling relationships, sexual freedom, dishonesty, and the extreme measures of the producers all to please the fans and keep popularity high. \nI have seen all of Mark Wahlberg's movies, and this is the first that has earned my affection. Wahlberg, a former singer/model, has made movies like \"Fear,\" \"Boogie Nights\" \"Three Kings,\" and most recently Tim Burton's lacking remake \"Planet of the Apes.\" I am starting to admire the young actor more and more. Although he has not performed in many successful films, he has taken many chances, and done a variety of roles. \"Rock Star\" is his best film to date. I can't think of many actors who could have convincingly portrayed Chris Cole's struggles and aspirations. Wahlberg truly makes \"Rock Star\" rock. Jennifer Aniston lights up the screen as well. She creates a chemistry-rich relationship with Chris that induces audience participation. It's tragic of what happens to their relationship. We care about these characters a great deal. During the film concert scenes, director Stephen Herek (who also directed \"Holy Man\" and the live action version of \"101 Dalmatians\") creates a gripping atmosphere. He captures the scenes with an intense urgency, and a raw, unmistakable energy. The musical numbers provide the film with the best, most involving scenes. Unfortunately Herek cannot sustain the energy and zest throughout. At the three-quarters mark, he looses the spark as the movie becomes dull and unpleasant. I understand where the story needs to go in order to portray the negative side of fame, but this movie loses everything it previously had going for it. In \"Almost Famous,\" a much better film about rock and roll, there is a certain amount of interest and life in even the most sorrowful scenes. Here, it feels as if the filmmakers lose their passion.The message comes a bit too late and suddenly in the story. The film turns into a morality tale that wants to provide us with a sappy destination. The filmmakers might as well stop everything, appear on screen and say: \"now audience, the moral of the story is\" We understand the theme, but it's too instantaneous. The personal discovery for Chris' must be gradual.Fortunately, all of this happens in the last twenty-five minutes of the film, hardly enough to completely destroy an entire eighty-five minutes of a reasonably good feature. \"Rock Star\" is not a great movie-see \"Almost Famous\" if you want a remarkable film about rock and roll-but for Marky Mark, it's a turning point in his career.","I've been looking forward to the release of this movie since I first heard the concept two years ago, and I was not disappointed.  I won't bother summarizing the story since everyone else has, but I will say that it was just plain entertaining throughout.  The performances were great, as was the music, and the main characters were likeable.My only complaints are: (1) the story was definitely lacking; the movie wrapped up very abruptly- in fact the writing became pretty lax in the second half, as though the writers weren't sure what to do with the plot. Since the plot wasn't nearly as important as the music and the action, this didn't really affect the entertainment value of the film, so this is not as major a complaint as it would seem.(2) This is really nitpicky, but the music that the characters in the movie were listening to was sometimes dated after 1985, when the movie was set. INXS' Devil Inside was from 1987 and AC/DC's Are You Ready was from 1990, among other mistakes.  This bothers me a bit, since they obviously went to lengths to make a good period piece, they could have checked the copyright date on these songs to make sure they were 1985 or earlier.  Again, not a big deal.Oh, I thought of something else that was strange.  The Steel Dragon band members were supposed to be English, but for some reason Dokken bassist Jeff Pilson and Ozzy guitarist Zakk Wylde played band members, and they each had a couple of speaking lines in AMERICAN accents.  That was kind of lazy also, but it was still cool to see actual musicians playing musicians, so I will forgive that as well.I could probably nitpick all day, but I don't want to give the impression that this wasn't a super entertaining movie.  I will probably buy the DVD when it comes out, and I will certainly buy the soundtrack CD simply for the six Steel Dragon songs (some of which were sung by the singer from the band Steelheart, if you remember them!).  The highlight of the film was possibly a great outtake where Mark Wahlberg is lipsynching to a rock song on stage and suddenly someone plays \"Good Vibrations\" by Marky Mark and the Funky Bunch.  The surprised look of Mark's face is priceless.  Classic rock and roll flick! Score: 8/10 due to extreme entertainment","This movie had the potential to be great. It started out with an interesting idea: small town guy worships famous band then gets the chance to perform for thousands as a member of the band he worships.The problem is that the great idea was badly handled with an inept script. I enjoyed the music, but the story left a lot to be desired. Wahlberg did okay in his part, particularly in the concert scenes. But I felt that Jennifer Anniston was all wrong for this film. I totally did not believe that she would fall for a guy as goofy as Chris/Izzy. He reminded me of a big, dumb puppy.Also, the emphasis on the \"rockin'\" parents and the scenes of the mom's home daycare center made the movie seem too cute and cuddly...cute and cuddly do not fit in a movie about metal music!The use of real metal musicians as band members was interesting...but most of the musicians were bad actors. I know it won't happen, but it'd be great if another movie centering on the rock music world could be made...this time with a better script. An updating of the Barbra Streisand/Kris Kristofferson movie \"A Star is Born' remade as \"A Rock Star is Born\" would work nicely.","ROCK STAR is a well-told Hollywood-style rendition of the tale based on fact actually on how Ripper became Rob Halford's replacement for Judas Priest. Mark Wahlberg poured on his likable boy-ish charm and performed with believable admirably, something he has been known to do since the release of BOOGIE NIGHTS.Stephen Herek, no stranger to musically-themed movies, takes the audience through the wonders of the breakneck lifestyle of an extinct species, the Hair-Metal Rock God. Wahlberg's \"Izzy\" acts as the film's host plays the everyman who gets to see his wish come true. His likable character quickly wins over the heart of the viewer, who wants to see him succeed and gets the chance to give him the Metal \"goat horn\" hand-sign several times over.The only real complaint with the story is that the supporting cast, namely the other members of the band, were not fleshed out, or even introduced, properly. More interaction with these life-long Rock musicians would have amplified and solidified Izzy's new surroundings. Naturally, ROCK STAR is filled with great music. Rabin's score, the Steel Dragon's original work and plenty of 80's-style Metal hits makes this soundtrack a must-have! Let's all hope that films like ROCK STAR not only give a credibility to a style of music that helped define a generation but also spark a very-needed revival.","Where have all the rock stars gone?  The bubble gum pop bands with their virginal image and the hip hopping wannabe baddies bore me.  Where's the flash and excess of groups like Led Zeppelin, or the old Motley Crue?  These were the hard rocking, and even harder partying bands who brought the sex and drugs to rock n' roll.  Whether trashing hotel rooms, engaging in debauchery that would make Caligula blush, or caught up in a deluge of chemicals and booze, there were no half measures.  Women wanted them and men wanted to be them.  Sometimes, life is good.Life as a photocopier repairperson is less than riveting.  For Chris Cole the only way to cope with the daily tedium of toner and paper jams is in his alternate guise as the lead singer in a \"Steel Dragon\" tribute band.  Chris acts, dresses and sounds like his idol, hoping beyond all reason that one day he will join his idols.  Lucky for him, rock and roll is a fickle business. As anyone who follows heavy metal (or reads previews) knows, \"Rock Star\" is loosely based on the true story of salesman-turned-heavy-metal-frontman Tim \"Ripper\" Owens, who was tapped to fill in as lead singer for Judas Priest when Rob Halford left the band.  However, the similarities end there - when Judas Priest pressed for increased creative control over the project, the producers opted to distance themselves from the band and change the story and the exploits of  \"Steel Dragon\" are a composite of several apocryphal rock legends.  With strong performances in such films as \"Three Kings\" and \"The Perfect Storm\" Mark Wahlberg has proven that he is more than a living underwear mannequin.     Wahlberg brings the same combination of innocence and wide-eyed wonderment to Chris that he displayed in \"Boogie Nights\" (without displaying much else).  These qualities keep Chris' transformation from nobody to rock god from becoming a ridiculous parody. Keeping him grounded is Jennifer Aniston as his girlfriend/manager, the one person who realizes his talents and for once Aniston breaks free of Rachel, and delivers a decent performance.  The supporting cast, drawn from real rockers and solid character actors, gel well onscreen. Overall, the story is well paced, light-hearted, the soundtrack is great  (I felt my head moving back and forth more than once) and you actually buy the group as a real band.  Definitely worth the price of admission, and remember not to leave before the outtakes are finished.","Nothing really unpredictable in this movie, but a solid flick in all respects.  Everything from acting to cinematography was solid.  Not a perfectly linear plot line, but there wasn't anything you couldn't see coming.  Perhaps a tad melodramatic at points, but again, a fairly decent movie none the less.  Definitely worth checking out.  If in doubt of what film to rent over the weekend, give this a go.  Though you may not feel like running out and buying it, I found it to be quite worth while.","Mark Walhberg in a great role, idolises a rock star to the extent of knowing all his songs, imitating him to perfection, and dressing like him.  When the opportunity comes for him to take over his \"idol's\" role in the band, he jumps at the opportunity.  However the role of a rock star may not be what it is cracked up to be... and relationships can change ....  This movie certainly struck me as having the theme of what you attain for may not be what you think it is once you get it.  Overall a really good movie with great performances from all the cast as well as the two leads, Mark Walhberg and Jennifer Aniston.  It did make me feel sad, especially when Emily, (Jennifer Aniston), met up with Chris in Seattle and saw the depths to what he had sunk.  If anybody ever dreamed of being a rock star or a groupie they should watch this movie to see that the lifestyle, although glamourous for a while, is very lonely and ultimately not what you may want.","As a Heavy Metal fan I was keen to see this film, even though I had a few doubts going in. However those doubts were soon put to bed as the film progressed. The first half was very enjoyable for a fan of the music. A great sound track and the songs of Steel Dragon had a good 80s rock vibe about them.The first hour of the film basically takes the story of what happened to Judas Priest in the early 90s: they're singer leaves and they hire a new singer who was previously in a Judas Priest tribute band. However come the second half of the film they really mess things up with the plot. We are somehow supposed to believe that Mark Walhberg's character is obsessed with Steel Dragon and actually singing for them is the ultimate dream come true but then when he actually achieves this dream he is just gonna walk out on it so he can be with his girlfriend who doesn't even support his dream and suddenly get over the band.I'm sorry, but I just don't buy it. To me it basically said that Heavy Metal is just a phase that you'll one day grow out of. Well any true fan will tell you that this music stays with you for life. To me this movie was not written for fans of the genre because they totally copped out on the ending.However, I was pleasantly surprised with Mark Walhberg. I still think he is one of the worst actors in Hollywood today, but I thought he handled the role very well. Also, as I said before, the soundtrack was also cool. It was also great to see Steel Dragon made up of actual musicians: Zakk Wylde (Ozzy Osbourne, Black label Society), Jeff Pilson (Dokken)and Jason Bonham (son of late Led Zepplin drummer John Bonham).A film of two halves so I'm gonna give 5/10 a wasted a potentially good film messed up by ridiculous plot holes.","If you like the 80's rock, you should definitely see this movie! I've only seen it recently and completely fell in love with it!Overall, the movie is very entertaining, provides you with a great load of rock tunes and not a single second of the movie do I find boring! It was a great idea that some of the real-life musicians were in this, doing what they do best. I was happy to see Zakk, as well as Blas Elias, they all delivered solid performances. I tend to agree with a lot of people saying that the first half of the movie was much better than the second one, specially in the terms of the script.That could have been worked on a bit better, but not a major biggie. One thing that did bother me a bit was Jennifer Aniston's performance. I thought she wasn't the right person for this role,I just couldn't see her as a rock star girlfriend.But as the movie goes on, you somehow realize that she did a good job with this.There is a certain amount of honesty and sincerity she delivers that just doesn't live you cold. To summarize, a good and a funny movie, that doesn't go deep into characters but provides you with a good fun, a sense of nostalgia and of course the mighty vocals by Jeff Scott Soto and Mike Matijevic!","I really enjoyed this movie.  I thought that it would be stupid and boring (and yes, at times, it was both), but there were enough quirks in it to make it really different and interesting.First of all, I found it immensely amusing that Chris' parents were totally into his rock 'n' roll lifestyle and it was his brother who was the wet blanket instead.  Also, I liked how Jennifer Aniston, as his girlfriend, handled the situation.  Instead of being totally immature and jealous and breaking up with him in a screaming match with accusations flying everywhere, she calmly tells him that this is his time and his dream and although she is sad that she doesn't have a bigger part in it, she is content to go do something she wants to.Also, I watched this movie on DVD and I would totally recommend this way to view it.  If you listen to the director commentary, he tells you that there are artists from Slaughter, Dokken, Third Eye Blind, and Verve Pipe among others that play the musicians (including Jason Bonham).  Therefore, these guys really contributed a lot of input as to whether the movie was realistic.  As for the guy who commented that there was no connection to Judas Priest, the director said that the studded vest, hat, and collar seen at the Steel Dragon house was a direct reference to Judas Priest.  Also, that the lead singer of Steel Dragon turned out to be gay.So, if you like rock movies I would totally recommend this one!!","That it is. It's based on The rise to fame of Tim \"Ripper\" Owens, formerly of Judas Priest and current singer of Iced Earth. He was in a Priest cover band, among others. Priest's guitarist sister saw him perform live, liked what she saw, and set up an audition. Tim sang 1 verse before he was given the job. Be reminded that this was after Priest has been without a singer for 8 years! He held it for 6 years before Rob Halford came back. During that time he did multiple tours and 2 albums. He also did the vocals for Iced Earth's latest album, \"The Glorious Burden\". It was originally a favor, but eventually he joined the band. Another note: Judas Priest was originally involved with making the movie, but then backed out. And Owens never saw a dime for it either. Weird, huh?","The best thing about this film is that there is alot of music in it. it's not uncommon for 'music' themed movies to lack a solid volume of music, for this movie it's great that this isn't the case.This isn't the kind of movie people swoon over, especially critics, but if you want to get into a \"Rock Band\" tour and see the lifestyle, \"Rock Star\" is a perfect vehicle.SpoilerI was miffed that Judas Preist is in no way connected to this film.","*******Spoilers....*********This movie looks like it was written by some Hollywood suit in his office who has tried to imagine what it would be like to be in the biggest metal band in the world in 1985. So the result is some stupid lame movie full of sex,drug & rock'n'roll cliche's. I mean its so bad that I'm sure that the whole thing must be a pi*s take.\nSome of the scenes are so ludicrous it made me laugh. The scene where Mark Wahlburg is arguing on stage with his guitarist at a gig... In reality the music is so loud that theres no way you could hear what anyones saying even right next to you. But in this scene the music seems to quiet down while they talk on stage. Hahaha ...And when Whalburg takes so many drugs that he forgets what city he's in.. duh!! ..that happens without the drugs. But this is a Hollywood movie.. you have to have the \"singer gets messed up on drugs\" clich'e in there somewhere.And then theres the \"singer sees the light ,leaves evil hard rock band and forms happy acoustic band\" clich'e. No Hollywood movie is complete without a nice moralistic ending like this.If this movie is supposed to be loosely based on the Tim 'The Ripper' Owens story...how come Ripper Owens is still in Judas Priest and having a ball?? Sometimes reality doesn't quite cut it huh?.\nOK... Mark Whalburg is quite good ...considering he's been given a junk script to work with... But the acting looks forced from everyone else. It could have been a good movie if the guy had taken longer than 2 hours to write it.2/10","WARNING - POSSIBLE SPOILERS!'Rock Star' is one of the solid rock movies I have ever seen. The original idea of the script focuses on a young singer in the 80s, leading a tribute band of one of the most famous hard rock bands of the period. He is not only playing their music to the note, but also living the life of his idols. When his friends  in the tribute band expel him, in search of some originality, the destiny plays him a good turn, and gets hired to replace the lead singer of the idols band.  A dream came true? Well, almost. While starting to live the life of the famous, including the drug and sex excesses of the rock scene of the 80s, he will also have to face the problems in relationship with his supportive girlfriend, and will be eventually need to answer questions about creativity and having a saying in the music of the band.\nI liked the film, one of the reasons being that it is one of the first times that the life and music of the hard metal rock bands is shown in a realistic manner. Fans of the music genre will be satisfied by the soundtrack. The overall idea is original, and the issues of how an artist lives his life and creates his art are being rendered in a sensible and balanced manner. Acting is quite good, with Mark Wahlberg better than in most of the other action flics I saw him lately, and Jennifer Aniston in tune with the nice-girl-who-knows-a-lot-about-life role. More problematic is the ending, which  is quite conventional, and may disappoint.  It looks like the main character after quiting the big and famous band has found his own creative path. However, in an  ironical twist the music he is playing in the club at the end is the worst in the whole movie! 8/10 on my personal scale. Worth seeing - however, expect exposure to a high dose of metal. If you do not like this kind of music, you may chose to avoid this film.","What to say about a movie like Rock Star? A lot actually! This is the type of movie that is almost tailer made for the critics to slam. It is also a movie I, as a MAJOR Hard Rock fan enjoyed-no-loved actually-while all the while being very consciously aware of its many flaws and that the movie, while a decent effort in some respects missed the chance it had to escape into greatness and become a rock movie classic. Oh well....I loved this movie-and would see it again and again-but I know that's purely based on my own personal tastes-Rock Star is a movie that will appeal to anyone who has experienced elements of the rock or hard rock lifestyle and wants to go down the road to nostalgia. It was a great time for metal heads. And it's nice to have a movie that effectively captures that(long forgot by many non-rock fans.) time effectively, as I think that Rock Star has done. That is one of the film's strengths, the concert footage. You will feel like your right there with them and how could any hard rock fan not love that? As far as setting the atmosphere Rock Star gets a 10 of 10. It also gets a 10 of 10 for pure entertainment. If you want a movie to just let yourself go and free flow into some great memories of good times past, then this is the movie for you. It is also the reason why I loved this movie so.But it isn't a great movie. I understand that and were it my actual job to review movies professionally, I'd probably have to be a bit hard on this one. The problem with Rock star is the character development.What is wrong with the character development is this, there isn't any. None. The movie has certain scenes-few and far between but they ARE there-that DO touch on greatness:WARNING BRIEF SCENE SPOILERS: 3 examples- 1)when Izzy makes his debut on stage(including the fall he takes)2)The first \"after show\" party with Emily(Anniston and Izzy.)3)Backtracking a little-In the beginning when the original lead singer is casually dismissed(fired)-the whole \"business as usual\" tone sets the stage for what's to come. It's played very effectively.But the problem is, nothing ever does come. There is little to no character development of anyone in this movie, peoples' persona's are merely touched on, but never fully explored. I don't think that's the fault of the actors/actresses,particularly Anniston who tries hard, they just are not given much to work with. It's just that the script was weak and lacked the ability to go beyond the \"formula\" feel into true movie depth. Rock star was so sugarcoated at times(including towards the end) it was almost ridiculous. And , though, those scenes I mentioned WERE outstanding and very believable, sadly much else in the movie wasn't.Another reviewer mentioned the lack of buildup towards the end and I agree but there was actually a lack of buildup about ANYTHING. WHY does Izzy leave at the end? Because he misses his girlfriend and the band won't let him write songs? It tests the limits of believability. And, frankly the end was just corny. Made no sense and had no reality to it at all.Watching this, it's almost like watching a movie where the makers of it said: OK, this happens here and then this happens and then this etc etc etc. By the end it's no longer a movie about a boy who's dream came true, it's just another thickly formulated love story. And you wonder why so much detail is left out....I hope I'm not being to hard on Rock Star because I truly loved it-but not for the right reasons. I would have liked to love this as a great movie about the highs and lows of rock fame. Instead I loved it for it's 80's period feel, the clothes, the hair, the lights, the life.... Although many others loved it to, I suspect most are people who lived the life of a rock fan, like I did or some who play. I'd have liked to see the movie cross over and just be respected for being a good, well told movie, instead of a cliché. I think, one of the problems was the length. I myself, hate over long films but this was one that really should have been longer, if a movie is done really right, the length is not even felt-there is just to much to the story for it to be as short as it was-that's one reason why there doesn't seem to be much development of either the story or the human beings portrayed in the movie.So-to wind down-this is a movie you can greatly get into- but not a great movie. See it for fun. See it for entertainment. See it to go back to that great, great space in time when metal wasn't just a part of life, it WAS life-and for those non rock fans-see it to get a little glimpse into a life that meant and still means so much to so many of us.","Well........how and where do I start to describe this utter nonsense? Imagine the morals of a cheesy Hollywood Western, throw in a lavish helping of the most trite soap opera storyline, and try to dupe the kids into thinking its cool by dressing it up to be about something 'contemporary'. This film is all package and absolutely no substance.It starts with promise......young men dreaming of becoming rockstars and engaging in the kind of excessive hero-worship everyone can laugh at. After that, it all goes downhill.....quicker than a bobsleigh with no brakes. The scene involving the first gig with Steel Dragon is one of the most pathetic pieces of 'cine kitsch' I have seen in a long time. The singer appears on stage for his debut and falls down some stairs.....will he get up and sing???......or will he stay there on the floor and not sing......who cares by now?? It gets worse, but I don't want to bore myself by having to remember it in all its excruciating detail. If you watch it after this review, its your own fault!","The attempt here is to amaze us with a Cinderella story, but it can't escape the level of a morality play.A talent deficient actor poses as a talent deficient character/poseur. If they'd only spoofed that, we'd have something interesting. Wahlberg repairs 'copy machines' -- that's as close as they get.The 1980s were full of heavy metal preening, but this is not about heavy metal -- this is the Hollywood version of 'heavy metal'. Back in the day, the industry churned this stuff out faster than McDonald's big macs. It required no commitment for commercial mastication. It was the same thing over and over again (a copy machine), album after album. It seemed the principal audience could never get enough. It was finally supplanted by irresistible force, but that's another story...This narrative is simply a string of TV anecdotes ABOUT the lifestyle, ABOUT the bigger personalities in a weak cosmology, not that OF a cinematic experience. That would require some commitment, some leap of faith. This is simply everything we've seen in 'Behind the Music' -- pre-chewed and pre-digested.Ignore this. If want something far more authentic, see \"Decline...part II\". If you want to see a spoof done right (cinematically), see \"Spinal Tap\". This is but a tribute to a failed paradigm.","This is the movie that is somewhat based on the exit of Rob Halford from British Metal Gods 'Judas Priest' and how the band replaced him with Ripper Owens, who used to front a Priest tribute band. Originally titled Metal God this movie could have been something great. Instead, someone in an office somewhere who knows little to nothing about metal music decided to water it down. From the title change of Metal God to the 'safe' middle of the road 'Rock Star' to the lame soundtrack this movie plays out badly. Having spent most of my life in a professional metal band I was really looking forward to seeing this, I was very let down by several points of the film. The soundtrack is very NOT metal for one, and the ending of the movie is lame as well. The movie does have a few bright spots in the writing and acting but as a whole, it fails in the end because...1)A movie based on a metal band should have a metal soundtrack. 2)There is NOTHING metal about Marky Mark or Jennifer Aniston. If Bon Jovi, Warrant, Def Leppard and Poison are your idea of 'heavy metal' go see this movie. If Iron Maiden, Judas Priest, Dio & Black Sabbath are your idea of metal see this movie for a good laugh.","Being a metal head myself (though I like other music genres too)I'm not going to review the production qualities of this movie. No, I'm going to go higher and to speak my mind about the horrible facts who makes this to be one of the worst insults to whatever heavy metal have inspired in its more than 40 years of life.1. The title. If the plot of the film consists in the story of a METAL fan singer, who sings in a METAL band who pays tribute to another METAL band called Steel Dragon, and one day he's giving the opportunity to front the latter band, why on earth have this movie been called \"Rock Star\"?. Rock stars are Mick Jagger, Little Richard, Chuck Berry, and they are not that metal (at all!). 2. The music. Is Bon Jovi metal?, no. Is INXS metal?, no. Enough said. 3. The lead actress. When you know beforehand, that the movie is going to portrait 80's metal life style, one with even a certain amount of knowledge about that era could foresee that the lead female actress is going to be someone named Doro Pesch (Warlock's singer) or even Lita Ford. Nop, here we have Rachel from that annoying TV sitcom. 4. Steel Dragon. If this movie is based (loosely) on Tim Owens'life, then Steel Dragon is the fictional equivalent of Judas Priest. Mmm, not likely. Though made up of great musicians (Zakk Wylder, Jeff Pilson and Jason Bonham)Steel Dragon's image and music is nowhere heavier or good as Priest's. I see them as a slighter heavy version of Motley Crue (when they played pop metal). 5. The main protagonist. Marky Mark it's an outsider here. I think Vanilla Ice could have done a better effort. It's like doing a film about the life of Bob Marley, and giving the main role to Adam Sandler (who would suck even if he decides to play himself in a movie about his life). 6. The end. If you think this movie is inconsistent, then don't watch the end. I'll tell you one word: Seattle. Can you make the associations?.In the end, Rock Star is not good or bad. It's not entertaining or depressing. It's just a travesty to the Metal genre, the Metal community, its bands and fans alike.","This movie was a horrible, cliched steaming pile. The actors were too old and recycled from other roles they had played, the storyline was stale, the soundtrack was awful, and Steel Dragon is one of the stupidest names for a band I've ever heard. It's just a name some old guy thought up to make then sound tough and metal. For those of you who think this is metal, go out and pick yourselves up a copy of Reign in Blood by Slayer.","No emotion. Bad music (and I am a reformed eighties metal guy, so I would be vulnerable to some good stuff.) Everything is half done. The brother is a parody, there is nothing to hold us in except to see what horror from the eighties they'll pull up next. The tour manager tries to bring a humanity to the thing but isn't given enough time. Wahlberg is okay and Aniston is slumming. We know she didn't need the money. Is this the only role she could fit into her summer break? Surely she must slap her forehead every time it pops up on VH1--which is only slightly less often than Ozzy does. It barely qualifies as a TV movie. It's just hard to believe that it was actually released theatrically.","I don't know any idiotic rock'n'roll cliché not used in this movie. Ouffcourz , rock enroll life is only sex drugs and parties and tons of supermodels trying to ride with you. Say it to stupid young boys. The filmmakers seemed to have read too much Guns'n'Roses or Motley Crue stories. I have seen everyday life of usual rock band closely and there are nothing to do with reality in this movie. If you are successful enough your life is touring touring touring. Its means that you are mostly in a bus and trying to sleep. Just sleep. Because you must be fresh, sober and clean in evenings. After live you have a little time to discharge your stage excitement. Then you have a bit time to have fun. But its not any luxury or dream. Artistically this film was zero. Stupid characters and idiotic dialogs. The ending of movie was funny -- main character left heavy metal band and formed a grunge band! Yeah, what a moral. Real 90s."],"review-user":["unbend_5440","Feistfan","moonspinner55","Movie-12","noahk","SunChilde","joker-4","Shiva-11","C00L_HAND_LUKE","trudy.keenan","cliffo88","sanja_86","ishcabibble","longhair364","dashuba","Movie Detective","dromasca","triple8","bpstraycat","jldmp1","Helldorado13","julian_abadia","cancerkitty","lubyboris","margus-kiis"],"review-date":["7 September 2001","20 September 2001","15 August 2002","12 September 2001","10 September 2001","7 January 2006","29 January 2002","7 September 2001","13 January 2003","7 December 2001","2 June 2008","21 December 2006","19 March 2002","25 June 2004","21 February 2002","14 December 2001","27 June 2004","7 March 2004","27 April 2006","23 March 2006","17 October 2002","28 August 2010","28 February 2002","29 May 2006","31 August 2005"],"review-rating":["6","8","7","7","7","5","8","7","8","4","10","9","8","8","1","1","1","4","2","2"],"review-title":[" Music really saves it\n"," Stand up and Shoooooooooooooooouuuuuuuuuuutttttttt!!!!!!!!\n"," Comic book cynicism\n"," We've seen this all before, but the film still captures an honest and insightful attitude. *** (out of four)\n"," High Entertainment Value Compensates for Plot Problems\n"," Great Idea....Badly Done\n"," Simplistic and Enjoyable. Prepare to Rock Out!\n"," Rock N' Roll with a side order of excess\n"," No real surprises, but a solid presentation.\n"," Be Careful What You Wish For\n"," Disappointing in the end\n"," Great fun, great flick!\n"," Rock On!\n"," This is based on a true story. (SPOILER, maybe?)\n"," Like Rock? Check this out!\n"," Cliche`d Junk.\n"," good rock film\n"," Do you want the gig then?\n"," This film is a soap opera.....do not bother with it!\n"," Inauthentic\n"," Judas Priest story line with Bon Jovi soundtrack\n"," Marky Mark and the Metal Bunch!\n"," For starters, this is NOT metal.\n"," Why Jennifer, why?\n"," Full bag of stupid clichés\n"]}