{"review-url":["http://www.imdb.com/title/tt0242420/reviews"],"review-text":["Face it, folks-- \"DK3\" is more challenging, innovative, and clever than its predecessor. Challenging-- its levels are ridiculously difficult for a considerable amount of time. One especially difficult level is called \"Lightning Lookout,\" in which you may be struck by lightning at any given time. Innovative-- it opened a lot of doors. Too bad the SNES died out not long after this title. And clever-- the level names range from trademark plays-on-words (\"Lake Orangatanga\") to witty references that the game's targeted audience won't get for many years to come (\"Bleak's House\").What irks me about most people's criticism of this game mainly comes down to two words: Kiddy Kong. He is a worthy \"little-buddy\" successor to Diddy Kong, and certainly does not deserve to be referred to as \"that retarded monkey.\" \"DK3\" will remain a classic until the end of time.","Donkey Kong & Diddy Kong have been kidnapped by K.Rool who is now a big, fat ass robot named Kaos. Diddy's girlfriend Dixie and Funky Kong's baby cousin Kiddy Kong join the ride as they go through menacing obstacles and dangerous mechanical worlds.Playing this game after the last two does give me the meaning that this one is much more harder, much more challenging, many more obstacles to go through though sometimes playing it doesn't seem so original like the first one.Now I'm not saying that this one was bad, though I couldn't say this one was as good as the other two and it doesn't seem as playable as DKC 1 & 2.DKC 3 bases off of the theme of a Mechanical Themed atmosphere. Like DKC 1 & 2 it still had animal buddies, graphics and game play still remain the same, and a lost world is still there.If you liked DKC 1 & 2, you're gonna like DKC 3 which is a great game like the last two 8/10.","Now I thought DKC 1&2 were one of the best side scrolling adventure games to be around. However with this game, we don't have Donkey or Diddy but instead, it's that Retarded Dixie Kong and this other whiny baby named Kiddy Kong (who is Funky's little cousin) which make for a forgettable duo. The levels and every other obsticle in this game are quite the same with new improvements. This time your going around the seas. All of the characters that help you are changed once again. Cranky spends his life playing Swanky's games, Cranky's wife: Wrinkly now gives you advice. And Funky now does boat rides instead of Aircrafts. Plus you go see all these different bears that help you, yadda yadda ya etc. etc. Otherwise the graphics and gameplay are still the same and if your such a hardcore fan of the DK series than go ahead and get it. If your not well, it may just be a rental for you.","Sorry to disagree with you, but I found the DKC series to be quite engaging. So much so that I invested in the SNES system and my own copies of the games. This is, mind you, almost ten years after the initial release of DKC 1. The graphics were ground-breaking for their time, the first vector graphics games for home systems. The music and characters are all memorable, and the games brought myself and my girlfriend dozens of hours of entertainment. True, the second game was better than the first, and the third was perhaps lacking the 'edge' of the second installment. But all three offered different play, and I enjoy them to this day. By the way, I'm old enough to remember when there were NO video games whatsoever (and TVs were black and white!).","*** Possable spoiler but probably not ***\nThe game is called donkey kong but donkey kong is not even in itanymore! Diddy is gone aswell!The 1st Donkey Kong Country was one of my two all time favoriteSuper Nintendo games. (The other being Super Mario World)The 2nd Donkey Kong at least had diddy kong and good levels,although it felt more like a game based on pirates at times.However this one is the worst of the lot! It does not have the feel ofthe original or 2nd, The enemy's look stupid and the levels areeven worse. It does not look realistic anymore! I did not enjoy his game unlike the last two, the first had greatbackground music and the 2nd was not bad but the music in thisgame is horrible!It happens a lot these days that movies, shows and sometimesvideo games that start out fantastic, end up with it being ruined bya stupid sequel! I am sad to say I feel that donkey kong as a saga is not as goodnow that it has Donkey Kong 3!They should have left it at the original or MAYBE the 2nd one."],"review-user":["RiffRaffMcKinley","tequila101","Komplex Intelligence","georgereese","ThomasFr"],"review-date":["31 March 2007","10 August 2010","23 June 2001","24 January 2008","14 September 2002"],"review-rating":["10","8","3","3"],"review-title":[" Best of the bunch, no matter what anyone else says!\n"," Not as Good as the other 2, other wise it's pretty Average\n"," This is where it gets stupid\n"," Donkey Kong Country\n"," I didn't mind Donkey Kong Country 2 but this is horrible\n"]}