{"review-url":["http://www.imdb.com/title/tt0097178/reviews"],"review-text":["Just when you finally, absolutely, positively thought it was safe to go back into the water, up pops yet another Italian Jaws rip off—and slap me with a dorsal fin and chew my legs off if this isn't one of the most tedious of them all.Directed by Raffaele Donato (with more than a bit of uncredited help from the king of Italian sleaze Joe D'amato), Deep Blood is a virtually joyless experience from start to finish, with a dreary plot, umpteen characters that are indistinguishable from one another, terrible acting (nearly all the performers fumble their lines at least once), and unconvincing shark attack scenes comprising of various odds and ends of stock footage badly inter-cut with the frenzied thrashing of the supposed victims.The dreadful script offers a few unintentionally hilarious scenes, such as the sight of the film's heroes nipping to the local dynamite depot to stock up with enough high explosives to sink a battleship, or the hasty construction of a special shark attracting device that consists of a metal box with a flashing light on top, and further giggles might be had from the witnesses to the shark attacks, who run the gamut of emotions from 'mildy concerned' to 'slightly perturbed'; to be honest though, these brief moments of levity do little to compensate viewers for suffering through the rest of this bloody awful film.","There was a time, not even all that long ago if I remember correctly, that the notorious \"Jaws: The Revenge\" – the fourth installment in the world's most famous shark franchise, was listed here in the IMDb bottom 100. Admittedly this film isn't the elite of shark-movies but, trust me, it's a bona fide masterpiece in comparison to this shameless Italian piece of junk from the dirty hands of Joe d'Amato. \"Deep Blood\" – even the title is ridiculous – is a \"Jaws\" imitation that is at least 8-10 years overdue. The Italian shark movies from the early 80's are (for example \"Great White\" and \"Devilfish\") are also of questionable quality, but at least they're amusing and over-the-top cheesy! \"Deep Blood\" on that other hand is utterly boring and even too cheap to feature cheesy special effects. The only sharks that we get to see previously featured in National Graphic documentaries of which Joe d'Amato bought the stock footage! The wraparound story is also completely retarded. A bunch of young idiots living in a small and insignificant beach community take an oath to remain best friends for life and look after each other. Aw, how cute. Their buddy pact is immediately put to a severe test when one of them gets eaten by a shark. At least that's what you have to assume happened, because the actor simply vanishes in the water and the next shot just shows a puddle of red liquid instead. Either way, the rest of the losers decide to go shark hunting themselves, obviously against the will of local authorities. \"Deep Blood\" is a dreadfully tedious and overlong snoozer without any sort of memorable highlight Except maybe if you count the boys' inability to estimate what quantity of dynamite is required to blow up a shark. There isn't even any gratuitous nudity or sleaze in this garbage. I'm really disappointed, Mr. d'Amato!","The Jaws rip off is the trashiest of the all the Italian 'genres', and director Joe D'Amato is second only to the great Jess Franco in the trash film production stakes. Put the two together and what do you get? A gigantic piece of trash, of course. Unfortunately it's not trash in the good sense of the word either, as Deep Blood delivers more in boredom than it does in hilarity. To the film's credit, it does actually attempt something bordering on a plot; but to take said credit away from the film - the plot is rubbish. It has something to do with a group of friends taking of an oath (of friendship) and then some Indian curse that manifests itself into a shark. Or at least I think that's what was going on. Anyway, the majority of the film is padded out with boring dialogue and 'drama', and the shark itself - which lets not forget, is the only thing we really want to see - finds itself in merely a cameo role. Or not even that since most the shark is actually stock footage! Despite being a trash genre, there are actually a lot of fun Jaws rip-offs; but with this one, Joe D'Amato makes it clear that he couldn't be bothered to even try, and the result is what must be the worst Italian shark movie of all time. Avoid this dross.","This is the worst italian movie ever, quite possibly the worst movie of all time! Joe D'Amato is of course no cinematic genius but many of his movies are interesting and watchable. Unfortunatly this is not one of them. Its cheesy and boring....waaaaay boring. If you want a movie to MST3k, get Troll 2, if you want a movie to put someone into a coma, get deep blood!","I like to think of myself as a bad movie connoisseur. I like to think that the films most people label as the worst of all time I can easily withstand.But...there are exceptions.  I can only recall three movies I have had the misfortune to see that I have repeatedly used the fast-forward button for large chunks of the story.  Those movies are The Mighty Gorga, Night of the Seagulls, and this little crap, Deep Blood.In the world of Jaws ripoffs, this falls off the scale.  Deep Blood doesn't have the realistic storyline of the original Crocodile, nor the incredible effects of The Sea Serpent, nor the commentary of Tintorera.  No, instead we are treated to a handful of teens from any random failed '80s public access sitcom battling bullies and the local sheriff.Shark attacks are realized by quick cuts of documentary footage with actors thrashing about in the water, occasionally with a bit of what appears to be orange-ish paint thrown into the water.  Not a minute of original shark footage exists in this celluloid waste dump.Normally, I, or somebody like me, would read a dismal review like this one and say \"cool, I gotta find a copy of this!\"  That's the same thought I had when I read another viewer's review on this very site.  How wrong I was.So...from one bad movie fan to another...let this collect dust on the shelf...grab Up From the Depths or The Great Alligator instead to satisfy your need for something evil lurking in the water.","This is a great Italian shark movie probably not a full action type of shark movie but it has a great story about a native American in the form of a killer shark that attacks a small beach community. the movie has actual scenes of real sharks and some not but how they made it is pretty good the cast are not that brilliant of acting in this shark film but it it shows better acting in some other Italian shark movies such as (e.g cruel jaws,last shark)they show some pretty bad acting but most Italian shark movies are good which means this votes best as the best Italian shark movie ever , some scenes in this movie show violence/gore which makes this film good that it shows it so i would say this is the best film for all shark-movie-fans.","Deep Blood... Its one of those movies you here about and you say not another Italian Jaws ripoff! Well, Deep Blood is far from that. It is a cheap as film making can get and on the other side it is creative as well. In Jaws and all the other shark films we all have seen or herd about they all use fake made sharks, well in Joe D'Amato's film he takes a new approach by using all stock footage for his shark scenes. This is one of the many reasons I like Deep Blood so much is because it didn't use stock footage.In Deep Blood an ancient Indian spirit terrorizes a beach town in the form of a bloodthirsty shark, in Joe D'Amato's Shark classic Deep Blood.It seems that a Native American elder once warned a group of youngsters about this great evil in the sea, and years later, the friends are forced to face their fears when one of them is killed by a shark in a series of attacks along their coastline. Now it's up to the remaining few to make sure that this monster is killed, even if it means heading out to sea to do it.Joe D'Amato Directed and Produced this film under his company the Filmirage. Released in 1989 and was later used in Bruno Mattei's Cruel Jaws: Jaws 5, along with many other shark films. Joe D'Amato's shark entry is a great film and any Joe D'Amato fan of shark movie watcher should give it a try.","This movie is crappy beyond any limits. It's incredible - a very bad ripoff from Jaws and other (better) shark movies. A really bad one - everything is really pathetic. The story is purest crap, actors are bad, effects very cheap, no creativity whatsoever. It looks like some really debilitated children took Jaws script and arranged it randomly, then its parents took their 8 mm camera and shot the movie with their neighbors. The music is really inappropriate, just some \"elevator\" music, bland and overly optimistic when nothing happens, then slightly less optimistic when shark is around or when children gets depressed (again listens to VERY LOUD elevator music). Carlo Maria (the author) should be so ashamed he should ask for his name to be erased from the titles!! The movie acts as perfect demonstration how crappy music will destroy ***ANY*** scene which is supposed to be thrilling. There is one major difference to Jaws though: In the beginning of Jaws there are comments about stupid people who try to kill shark with dynamite. Well, there is an attempt to kill a shark with dynamite. When this does not work, guys take an ***BIG LOAD*** of dynamite and spent like 1/4 of movie by placing explosives in some sunken ship. This IS really original way to catch the fish I have to admit! They use so much dynamite like they would try to kill a battleship (I would guess Bismarck class of battleship) or to dig another Panama channel. This is just incredible. I'm glad they did not try to use napalm-flamethrower or tactical nuclear strike to eliminate this bad, bad approximately 2 m shark. Well, there is mystic disappearing native Indian (who looks like German pensioner) too in this mess. This is not a movie, this is a warning example how bad the movies may be! As a warning it is useful. But the public should be protected from this crap. Most of Italian movies is bad, but this... this is really exceptional in the worst sense of the word.","Deep Blood (1989) * 1/2 (out of 4) Joe D'Amato's next to last horror film is yet another Italian rip off of Jaws. After a group of friends take a blood pack, their friendship is put to the test when one of them is eaten by a shark. This is without question the worst of the Italian rips I've seen but I do have two more coming to me. The film has one suspenseful moment, the first attack, but after that everything is pretty dull. There's not a fake shark used throughout the film. Instead we get stock footage of a real shark that naturally never matches up to watch we're seeing in the other footage. Since no fake shark is being used, all of the attacks are rather silly.","Unlike some of the other Italian rip-off shark movies I've seen, this one is not all stock footage. It does steel footage from The Last Shark, but it also has its own mechanical shark and its own live shark footage. The movie's story has its sad moments, and that's part of a good film to me. The music is pretty bad, though. There are a couple good sounding themes in there but other than that, it's bad movie music. This isn't really a Jaws rip-off, more of a knock-off of The Last Shark since it has stock footage from it. In this movie, there is a wise old Indian who is very well acted and plays a very good role in the story. Other than the music, it's a good movie."],"review-user":["BA_Harrison","Coventry","The_Void","dogcow","cornjob-2","beastsauron","TheBossofTheNorth","the_wolf_imdb","Michael_Elliott","abigailjeffries"],"review-date":["14 October 2010","8 November 2011","28 April 2009","3 June 2001","7 November 2000","9 February 2006","14 August 2007","10 October 2008","26 February 2008","5 May 2011"],"review-rating":["3","2","3","1","1","8","9","1","10"],"review-title":[" 14 years after the success of Jaws, the Italians are still riding in its wake!\n"," All hail \"Jaws: The Revenge\"\n"," The attack of the stock footage shark\n"," makes TROLL 2 look like a work of genius!\n"," So bad it's...well...rancid.\n"," deep-blood\n"," Blood in the abysses\n"," What's wrong with Italian directors?!?!?\n"," Deep Blood\n"," Not all stock footage\n"]}