{"review-url":["http://www.imdb.com/title/tt0238784/reviews"],"review-text":["I missed THE GILMORE GIRLS first season because I'm generally not interested in series television, and I'm a man in his early 50s and this is a series about a mother and a daughter, and I'm frankly not interested in WB shows which focus on a more youthful audience. However, a year of reading rave reviews of the series, got me interested in tuning in during season II. It was instant love.I think this is the best series on TV, a thoughtful, funny, beautifully written and well observed show about the relationship between a loving mother and daughter. At the same time, if features the quirks and tics of a fictional town with the kind of appeal that is unrealistic, but makes us nostalgic for a sweet and picaresque hamlet that has taken the two formerly outsider main characters and claimed them as one of their own.Lorelei Gilmore (the stunningly beautiful and hugely talented Lauren Graham) is a young, single mother in her early 30s who is raising her daughter, Rory (a sweetly restrained Alexis Bledel) on her own. Lorelai got pregnant when she was sixteen, dashing the ambitions of her wealthy, snobbish parents (Kelly Bishop and Edward Hermann) for a fine college and a brilliant marriage.Lorelei has moved away from her parents home in Hartford, CT, taking her daughter with her to Stars Hollow, where she eventually becomes a manager of a bed and breakfast inn. Lorelai is determined to raise her daughter in a loving, if bohemian atmosphere. Most of all, she wants her daughter to be her friend and encourages this amazingly close bond. The town, composed of eccentrics and other comic types, has accepted them, watching over both women with love and affection.When it becomes clear that Lorelei will need financial help in order to put her daughter into Chilton, a local private school in order to prepare her for Harvard, Lorelai swallows her pride, and hat in hand, goes begging to her parents. They agree, but on one condition. The girls are to have dinner with them at their stuff home every Friday night. Lorelei agrees.This forms the basic story outline of the show. We see Rory blossom into a lovely and smart teenager. Lorelei, though responsible and a fine mother, is still a young and vibrantly sexual woman, so there are the complications of her love life, including an unfinished attraction with Luke Danes, the town's cranky, but hunky coffee shop owner (well played by Scott Patterson).Lorelei's best friend, is Sookie, a cook at the inn. Rory's best bud is Lane, a gawky Korean girl who lives under the absurdly strict iron rule of her judge mental mother, who thinks Lorelei is a loose woman who should be keeping a more watchful eye on her daughter. Rory has fallen in love iwth Dean, a young man she goes to school with (before she switches to Chilton). That love suffers a number of tests, most disastrously in the third season with the arrival of Luke's nephew, Jess, who asserts his own romantic mystery.Well, I'm going on and on. The entire cast is first-rate. It's fun watching series veterans, Sally Struthers and others as the townspeople. I love the pompous character of Michel, the asst.manager. He's a riot. The tension between Lorelei and her mother often explodes in angry confrontations that are very real indeed (Kelly Bishop, an original CHORUS LINE cast member is outstanding).But make no mistake about it. Lauren Graham is the glue that holds this show together. Sexy, funny, she handles the smart dialog with all those cultural references like a virtuoso. She deserves to be a movie star. P.S. I bought the first year on DVD and have been having a great wallow. This show is that good.","\"Gilmore Girls\" is probably the best show of its kind on TV today.  If Jane Austen were alive today, she'd be writing this show.  It's a great show, first and foremost, because it treats the viewer as an intelligent person and requires one to pay attention.  The rewards for doing so are the dozens of subtle jokes and pop references contained in the torrents of conversation that issue from the characters' mouths - (\"Gilmore Girls\" must have the highest words-spoken-per-minute ratio in the history of TV.)The writing and acting are both superb.  The familiar setting of the small, quirky town allows for the use of many inventive plot devices, like 24-hour dance marathons, picnic basket bachelorette auctions, and vagrants who apply to become the \"official town troubadour.\"  You can even throw in a smart-mouthed kid from New York to see how he fares (maybe a tribute to \"Northern Exposure\"???)  The progression of the story is well thought-out and well paced.Each actor really gets a chance to inhabit his or her role because each character, even the most peripheral, is defined by a very distinct personality and not just an occupation (e.g. hotel desk clerk.)  Thus we vividly remember sweet and shallow Shelly, mean Mrs. Kim, and shy guy Brad from Chilton even though they don't appear very often.  The principal actors are tremendous, especially Lauren Graham, Alexis Bledel, Liza Weil and Scott Patterson.  Ever notice the way Luke will sort of tense up/puff up his chest whenever he walks up to Lorelai's table?  That's good acting.On top of all this there are three characteristics of \"Gilmore Girls\" that make it an exceptional show instead of just high quality.  In the first place, it has good drama without being either melodramatic or manipulative. Think about the way the writers handled the Jess vs. Dean issue, and compare that to \"Friends\" where we have Is-Rachel-Pregnant-Or-Not one episode, Is-Ross-The-Father-Or-Not the next, Did-Joey-Propose-Or-Not the next ad infinitum.  On \"Gilmore Girls\" the drama unfolds not according to plot formulas but the interactions of the characters.Secondly, the show is female-centered without being self-consciously so or politically charged.  The main characters are female human beings, not symbols.  To whatever extent they are feminist or empowered, the show presents them as such without commenting on it, and that is refreshing.Finally, \"Gilmore Girls\" takes a unique, thoughtful, and complicated view of the relationship between the generations.  It's billed as a mother-daughter show but is actually a grandmother-mother-daughter show. On most TV shows, the roles of Grandma and Mom are restricted or stereotyped, but here we have three women of a line, Emily, Lorelai, and Rory, who are made of the same material but have led VERY different lives and are trying to get along and be a family.  Occasionally one woman will step outside her role and be a Mom or Kid to one of the others.  And this is also refreshing to see on TV.If you enjoy quality entertainment regardless of genre, \"Gilmore Girls\" is for you.  Enjoy it while it lasts.","I was surprised when I saw this show because WB has a reputation for churning out mindless, sleazy shows that don't add any value to television. 'Gilmore Girls' has to be the only quality show on WB and one of the few on television in general. It's about the relationship between a mother and daughter in a small town in Connecticut. Lorelai Gilmore had Rory when she was 16 and ran away from her uptight, old money parents to start her own life independently as a maid at an inn and then working her way up to general manager. Their relationship is more like a sister relationship than a parent-child relationship. The townspeople only add charm to the show.'Gilmore Girls' is an intelligent show with quick, witty dialogue that often refers to literature, music, movies, and pop culture. The characters talk extremely fast, which can be quite unrealistic sometimes when in a span of five seconds, two people can create comebacks for each other that contain references to Shakespeare and Madonna. But c'mon, it's just a show, and the point of the fast-paced dialogue and references is for the entertainment of audiences. We watch the show, hear the dialogue and laugh hard because we know what they're talking about. It's what makes 'The Simpsons' enjoyable, and the same can be applied to 'Gilmore Girls'. We know that such a quirky place as Stars Hollow most likely doesn't exist, but we watch it for the admiration for a dedicated single mother, hard-working daughter, and their minds that are abundant with intelligent and witty remarks about everything from Billy Bob Thornton to Bob Dylan.Give it a try. It's just one smart joke after another. Definitely not a typical WB show.","Even though this is a chick series, tell the truth I really like it. Love it, maybe?. There is something different about this show. Something good that make it so unique, and I'm not talking about fast pace of conversation and loads of sarcasm between each character.The story is good and not boring, somewhat very memorable and it going to make you feel very cozy watching it. Plus with good acting and gorgeous girls, this show is so great that I can't find any negativity. (a little bias, I know, but it is that good.) Anyway, when did you last see any show that have millions of fans and site especially for it, that how good the show is, and I highly recommend anyone and everyone to watch the show.Rating: 9.9/10 (Grade: A+)","i do not exactly know, which audience this show is meant to appeal to. i am a single male in my late thirties with a long history of being in love with my best female \"friend\". so of course, it will always be the Luke-lorelai relationship that will appeal to me. but the way lorelai interacts with her parents, the way, the town's community is depicted, the sheer speed of a 45 minute drama/comedy, are all simply wonderful. in a lot of ways, it reminds me of thirties' screwball comedies, you know the ones, katherine hepburn, cary grant. anyway, this show is perfectly written, directed and acted. it's a pleasure to watch. my previous favourite shows have been \"northern exposure\", \"picket fences\", \"buffy\" (oh yes) and \"frasier\". \"gilmore girls\" took the best of all of them and put it together. i hope, they can keep this sort of level and i hope it will never stop.","While it may appear to be a chick thing, I enjoy watching this show. The characters are not stereotypical and stand out thanks to the great job of both writers and actors (I especially enjoy Melissa McCarthy and Liza Weil's portrayal of their characters), the show is chock full of wit (that is if your brain is quick enough to register the references made through the fast speech) and the plot, from what I have seen, is more than sufficient to keep you wanting to see more.My favorite thing about the show is that, unlike other dramas, it isn't too over the top. The plot progresses smoothly and slowly (just slow enough), and while the show changes as time passes, it doesn't change so completely as other shows in the same genre would. It is a perfect example of that while life changes, it is a subtle change, not an overt one.I would recommend anyone in search of intelligent, witty television to watch this show. I give it a 9 out of 10, and I hope that it stays on the air for years to come.","\"Gilmore Girls\" on the surface is about relationships. The relationship between Lorelai and her teen daughter Rory is at center stage but their other relationships are shown. It is truthful in that Lorelai and Rory have real feelings and aren't afraid to express them. The show also unfolds how in a small community like Star Hollow, relationships overlap. It is what makes small towns a great place and terrible place to live. It is good because people are there to help you out if you need it - but bad because EVERYBODY knows your business.In guy talk the show is what is known as a \"chick flick\".But hold on. This show is so complex that if you try to classify it as merely a show by women for women then you are not looking hard enough.There are almost no TV shows about a good mother-daughter relationship. Sometimes Lorelai and Rory go over the top in their sweetness to each other but most of the time their relationship rings true. There could be more conflict as Rory seems to be a carbon copy of Lorelai and that kind of thing almost never happens in real mother daughter relationships.The other layer of the show is the quirky citizens of Star Hollow. Each are written and expressed in concrete forms that add to the show rather than take away. Most of the conflict in the show involves these other characters and their interactions with Lorelai and Rory.\"Gilmore Girls\" is the kind of show we need on TV. Quality and a lot of it.","Gilmore Girls is one of those shows that people love because they're so adorable...and they simply don't know it. And not teen pop bunk adorable, but as in they're easy to love. I was surprised by the quality of the series, considering it's on the WB. It's intelligent, creative, and sophisticated in an everyday way. And even though this show has enough sarcasm to give you heartburn (it's fueled by sarcasm, in double digit gallons) the characters are fleshed out and live an alternate lifestyle that may be foreign, but is completely believable. These aren't people who live stereotyped mid class American TV lives, they live like the people next door, but like the strange people next door. They're those specially chosen eccentrics, small town hicks, artists, and snobs who are so full of quirks and idiosyncrasies they tend to make our lives colorful.And this show is about characters and how they relate to each other. The crux of the show is the relationship between the close in age coffee addict mother (Loralai, played by the fantastic Lauren Graham) and daughter (Rory, beautifully played by Alexis Bledel) who have an unusually close knit, and witty, relationship. The two are an eccentric pair,  they live for each other and pay no heed to those who sneer upon them and indulge in their wacky Bohemian-ness. They eat at Luke's Diner for breakfast and order economy size platters of Chinese food from Al's House of Pancakes. Rory likes chaperones, Loralai intrinsically trusts her daughter.When Rory is accepted to a posh prep school (which she doesn't care for, but deals with because, quite simply, she has a higher IQ than most of the town and wants to get to Harvard) paid for by her incorrigible and borderline personality grandmother  (another recurring character), her mother has to take a job she doesn't want at a first class hotel, and thus a whole passel of problems and dilemmas occur. Long term plot lines gracefully combine with town occurrences, scandals, gossip, etc, and create a show with as much flavor and pizzazz as Stars Hollow can take.And where the sarcasm and one liners, bizarre scenarios and crazy happenings flow freely there's always an underlying riptide that surfaces quickly here and there, and the tensions that arise can become especially pungent because we're allowed to be close to the characters. For example, in one episode Rory accidentally falls asleep next to her boyfriend late one night while they were both reading a book together, and next morning they are found by Miss Patty (the fabulously fabulous Liz Torres who is also from \"American Family\"), nothing had happened, Rory is completely innocent, but Loralai is worried when she's alerted that she hadn't come home and receives the call that they had been found together. Rory's grandmother jumps to conclusions and starts harshly saying that Rory has ruined her life just the way Loralai had, but her mother adamantly sticks up for her. Yet when Rory comes in, they have an explosive fight, with Rory crushed that her mother didn't trust or believe her.And yet situations with even a slight potential for sugaryness are resolved with lightning fast dialogue a la `Philadelphia Story'. The fact that they're close is already there, anything else feels wrong. This is the genius of the show's writing and acting. All said, whether during revealing moments of emotion or poignancy, or the standard rib cracking, fire crackling wit and sarcasm, this show gets under your skin and refuses to let go. It's more than a gem, and I hope that it lasts.","Gilmore Girls is my favorite TV show of all times. they only aired the first 2 seasons in India but i've watched the rest on DVD or read it online. it's very refreshing to find a show where the protagonist isn't sneaking around her mother's back but has an open relationship with her. the chemistry between Lauren Graham and Alexis Bledel who play Lorelai and her daughter Rory is really great. all the acting is excellent and the characters, though extremely quirky, are still believable. the residents of stars hollow show all the amusing bizarreness of small town life, which is contrasted by the endless snobbishness and social norms that make up the high society life of Lorelai's parents. on one hand there are dance-athons and firelight festival's while on the hand you have cotillions, DAR meetings and cocktail parties. all the character's develop a lot and there's a happy ending for more or less everybody. there are dramatic elements but also a lot of very witty humor. Rory's boyfriends are all incredibly hot as are her friend Lane's. basically it's a cool, funny, very satisfying show which encompasses all the aspects of life and gives you a feeling of -if you work hard enough and wait patiently, you'll get what you want even if it wasn't what you intended.","\"Gilmore Girls\" (like Leonard Maltin, I usually like to use the title as it appears on screen, but we'll forego the nomenclature \"Gilmore girls\") is one of those shows that positive word of mouth and the \"You know, this does seem like a good show\" vibe from hearing about it made me want to get a look at; the series has finally started UK airings on Nickelodeon, a strange choice for the channel - it's certainly comedic, but it's more of a comedy-drama than the usual stuff that's on Nick. (Plus, unlike all its regular shows it's an hour series.)My rule of thumb is that if a series doesn't encourage me to keep watching by its third episode, it won't do so after its thirtieth; Amy Sherman-Palladino's series passed by the end of the first one. A number of viewers have commented that the dialogue isn't too realistic, and Lorelei Gilmore is certainly so quick with the witty repartee you wonder why she's not a stand-up comic instead of managing an inn (possibly a clue as to why one of the companies involved is called Dorothy Parker Drank Here Productions?), but it does have the saving grace of actually being funny... something that can't be said for a lot of official comedies.\nWhat helps the series work so far, apart from the dialogue, is the characters - just as \"M*A*S*H\"'s laugh track was kept out of the operating room even in the American broadcasts (it was initially broadcast in the UK sans track), the relationships between Lorelei and Lorelei (that's Rory - in the pilot we learned that she was named after her mother) aren't actually played for gags endlessly, and her mother's certainly strong but not a bitch, the way the makers could have easily done. No one in the show so far is truly bad or good, which bodes well, and the bond between mother and daughter is a rare thing for TV - they're both relatives and true friends without making you want to vomit, not a common thing in family dramas.We're about three years behind the WB, and I'm looking forward to catching up with the Gilmores and their friends (it's impossible not to symapthise with Rory's best friend in particular, what with her health-food-obsessed/antique-selling mother). And on a purely shallow note, Lauren Graham and Alexis Bledel must be the most attractive mother-daughter pairing in recent television history. Beautiful and funny? Who needs Madonna kissing Britney?","The Gilmore girls is about a mother who had a daughter when she was 16. Now the daughter is 16 (in season 1) and they live like sisters. Sharing everything, trusting each other completely.I like The Gilmore Girls but I am not sure why. The mother, named Lorelai (Lauren Graham), and the daughter, named Rory (short for Lorelai, played by Alexis Bledel), are both very beautiful women, they are both funny and they are charming in their own ways. There are some funny supporting characters, such as Luke (Scott Patterson). He and Lorelai like each, may be even love each other, but neither of them really acts on it. They have their little moments. There are some other supporting characters, most of them very funny, and with their won touching moments.What I like the most I think is to see the relationship between the young mother and the daughter who is becoming an adult. The dialogue between them is quick, sharp, funny and sometimes touching as well. The band they have is beautiful. The Gilmore Girls makes you feel good so try it.","Looking for something new to watch, I perused the ratings of various television shows and noticed that the \"Gilmore Girls\" had an astonishingly high 8.6 rating and was intrigued. I came to the show with absolutely no preconceptions The title indicated it might be a \"chick show\", though was not discouraged as I loved Buffy the Vampire Slayer and appreciate shows featuring strong female characters. So, I managed to find a copy of the first season, and set about watching it. From there, it was all downhill.The first few episodes were by and large exposition, introducing the ensemble cast and the relationships among them. Center stage are the titular Gilmore Girls -- mother, Loreli and daughter, Rory. They are depicted as best friends, and more often than not, Rory as the voice of reason contrasted to her over-the-top, pop-culture-referencing, care-free, dare-to-be-different cliché of a mother. At first blush, the script seemed witty, the banter playful. But, after about three episodes, the style became forced and horribly contrived. Loreli's inability to provide a straight answer or simple declarative sentence under virtually every circumstance quickly turns from endearing to irritating.Though the show's writer would have us embrace her as a free-thinking, independent woman, that facade quickly breaks down, and any sentient being watching sees her as little more than a selfish, vain, egotistical spoiled rich girl, who demands to be the center of everyone's attention. She demeans those who do not share her free-spirited world view, dismissing them as droll conformists who cannot appreciate her off-beat demeanor. She despises her parents, a wealthy insurance executive and his socialite wife, ridiculing them mercilessly and mocking them for their shallow need of respectability. But, her disapproval of them does not interfere with her turning to them for money when Rory is accepted to an exclusive private school. One need not be a PhD. in literature to spot the dripping irony of Loreli not only asking for the money from those she abhors, BUT for the purpose of sending Rory to a school that institutionalizes all that Loreli stands against. To stack the deck on her side, her parents are depicted as stodgy dullards, who have never resolved themselves with Loreli for getting knocked up at 16, and running away from home and have her child alone. (As an aside, Loreli's mother, Emily, though very much flawed, stands out as the only genuinely compelling and sympathetic character, as she struggles with her obvious mixed emotions for her ungrateful and overbearing daughter.) But, Loreli now puts up with their intrusive behavior in exchange for some quick cash. Free-spirited, indeed.What is most appalling about show (and there is a lot of competition) is its depiction of men as either spineless, unreliable, effeminate, wimpy, or imbecilic, or all of the above. I appreciate a TV series or movie that features strong female characters that defy the brainless-bimbo-mold that makes up the lion's share of the women we see on TV. Smart, independent women are hot. It was one of the things that made Buffy such great television. However, in order to elevate the female characters, it does not require that you denigrate or marginalize all their male counterparts. The male character are clearly the creation of writers who demonstrate a profound lack of understanding of the male mind, or, worse, a deep-seated loathing of men in general. Not one male character is admirable, and all are reduced to little more than sounding boards for the unbearably whiny Loreli. Loreli's attitude towards this collection of eunuchs is, at best, dismissive, and, at worst, abusive. In one particularly egregious incident, in a display of monumental bad judgment, she begins an affair with Rory's teacher, then after breaking up with him, she entices him back with words of love and respect and promises of commitment. In no time, she impetuously agrees to marry him -- a decision based entirely on her fear of losing him and having nothing to do with love...again, what a free-thinker. However, the day of their wedding, Loreli suddenly panics at the prospect of sharing her life with this gutless panty-waist (the source of her panic is, it turns out, that up until the night before her wedding, she never gave thought to the fact they would live under the same roof, and, now, is repelled by the idea...bright girl...) and, being the free-spirit for whom convention will not suffice, she skipped town with Rory without so much as a word of explanation to her betrothed, the wedding guests and those who worked diligently to arrange the reception...including among them, her BEST FRIEND! And, of course, the writers have kindly presented the rough-edged, plaid-flannel-and-backwards-baseball-cap sportin', tactiturn, though deeply soulful local diner owner as the Sam to Loreli's Diane, in one of the least compelling \"will they or won't they\" story lines ever hatched in Cliché World.In the case of Rory, her love interests have included a narcissistic, self-destructive preppy, a whipped townie whose most salient quality is his mistrustful attitude and soul-crushing neediness (whom, incidentally, pure and holy Rory lies to on a regular basis in order to hide her true feelings for another....seems the apple really doesn't fall far from the tree...), and a broken-home-bred bad boy who is equally at ease vandalizing property as he is quoting Steinbeck and Kerouac. You see, Rory is the only person in town who can see the true beauty of the aforementioned bad boy, ne'er do well, and, as we are so earnestly led to believe, she can tame his restless heart and draw forth the true potential that lies within.And here is the part of the show that I find most troublesome: even though I hate most of the main characters, think the writing is contrived and the stories simple-minded cliché, find the depiction of men deplorable...despite all that...I can't stop watching the damn thing! I swear...it's like heroin.... I need help.","I have no idea what's going on with Friends this year. I started watching Gilmore Girls because I knew Scott Cohen was going to guest-star. I stayed with Gilmore Girls because the acting is really good (I love the actors who play Lorelai, Rory, Sookie and Luke), the writing and pace are excellent, and the theme is so similar to situations I have faced in my own life. The best thing about the show has been the budding romance between Lorelai Gilmore (played by Lauren Graham) and Max Medina (played by Scott Cohen). These two actors have magical chemistry. On top of that, the \"Love, War and Snow\" episode of 12/14/00 used the theme of magical snowfall in Lorelai's life to underscore the romance.  Brilliant, high quality writing. I want MORE!","I tired on several attempts to sit down and watch this program \"Gilmore Girls\". It baffled me for I just couldn't put my finger on what this was about. Was this about a young woman having a baby young in life and never growing up? Was this about the daughter being more responsible than the mother? Was this about a rebellious rich girl and her non-rebellious daughter? What the heck is this show about? Finally, I just didn't care. The cast makes me want to scream. The writing is neither \"smart\" or \"intelligent\" it's syrupy and tedious.So why did I watch? Because I heard SO many good things about this and I am not one to voice an opinion until I have watched. Knee-Jerk reactions are usually wrong, so I watched a few times. The first time I watched this, I saw the mother running around like she was 12 and the daughter acting like she was 40. Maybe that is what didn't attract me. I never liked any of the \"Freaky Friday\" films - not to say this is like that, but there are some similarities. Also I have a friend who watches this show every week. So I asked her, \"What is this show about?\" A very bright young lady, usually articulate she never could give me a straight answer. So I asked others who rave about it - they really don't know either.Gilmore Girls is turning out to be a TV program that's like an \"art house movie\". Many of us wont get it, but those that go try desperately to find a meaning where there really isn't one, just to be \"hip.\" Yes, I find Lauren Graham's Lorelai annoying - whine, whine, nasally WHINE. A whole hour of that. Wow. And the rest of the cast is about as memorable as yesterday's cheese sandwich. The town is hokey, the men are wimps, the grand parents are boring, and sadly I find nothing redeeming about any of these characters or care about anything they do. It's like watching paint dry on the wall.","First off, I've seen very few episodes. It's not that it is visually boring, but more the fact that the pointless back-and-forth banter and frequent \"witty\" sparring makes me want to pierce my own eardrums with an icepick. Unfortunately since giving up on the series, my roommate continues and the one thing I cannot escape is that same mind-numbing drone of characters spewing quick one-liners at each other.It's just too much, too fast to make the exchanges believable. It's almost like either the writers wanted to jam in as much dialogue as they could, or the actors had to spew out their lines as quickly as possible to make it through filming. Either way, having so much mindless and completely pointless dialogue doesn't help me like or even connect with the characters at all.","When I first watch this series, the impression I got was that the characters were charming and funny, Lorelai and Rory in particular were witty and intelligent conversationalist albeit a bit too talkative. After watching it for some time, however, my opinion changed.The main characters slowly revealed themselves to be self-centered self-obsessed narcissists, who treated tiny wounds to their pride as the worst insults in their existence. For example, Rory wouldn't speak to her mother for months when Lorelai didn't consult her on her impulsive marriage, while Lorelai dumped Luke for simply wanting a little time to adjust to his new life circumstances. These people are shallow, see themselves as the center of the universe where everyone else should behave exactly according to how their own rigid rules, and if they don't, they will hold grudges against them for an eternity. They don't want to see other people's problems and treat the smallest slight as the gravest offence. Most of the characters appear to lack the ability to behave in a grown-up way. They think they should do whatever that they wanted and everyone else be damned.The series is character-based, so when the main characters became so unlikeable the show also became impossible to watch. I still have the rest of the series, but I doubt if I will ever finish watching them. I will also hold anyone who think highly of the show and its awful characters with the greatest suspicion - they must just as horrid as Lorelai et al.","This is an absolutely horrid excuse for a show. People say its witty and intelligence? I don't see how? Maybe because the characters use fancy words? Maybe because they are snooty, use dry humor, and have 2 dimensional personalities. I went to an Ivy league school and nobody acted anywhere near as obnoxious as these characters. In fact had I met someone like them I would have likely strangled them! The men act like little emotional pre-teen girls and all the minority characters are based off stereotypes... The characters are no AT ALL AUTHENTIC. Simply put they sound like a trailer park family trying to be rich and sophisticated. This show is just another cookie-cutter hit that brain-dead prime time viewers eat up on a regular basis.","Usually when I don't see a show on an original run, I find it later on cable and realize it's a gem. The \"Gimore Girls\" is one of those rare exceptions. I'm glad I missed it.I truly despise shows that fill every minute of the actors space with rambling, stupid, boring banter. This is one hour of just that. The mother, Lorelei, made me wonder if she is Bipolar and off her lithium. She never stopped talking; every minute, every second, talking to every person she interacted with. Worse yet, her speech is childish and soooo, like, Valley Girl. She talked about guys, her hair, her mother, her clothes. Like, what's the sitch?? (for situation). I've watched this show three times and still don't get the point of this series. It's not a comedy, it's not a drama, it has no point except to make three generations of females in one family look like the \"Girls\" from Planet Mars. The males by comparison are smart and make the show somewhat watchable. If Lorelei ever existed and attempted to latch onto me with conversation, I'd have to mace her to get rid of her. She obviously doesn't know how to take a subtle hint to stop talking and start listening to someone else. She also doesn't know how to really notice the existence of others.In one show Lorelei comes home from a date close to 10 pm. She got the date after pursuing a guy she met at an auction. She goes into her daughter's room where the daughter asks how it went. She dithers on about how boring the guy was. Her date somehow got a few words in edgewise. Lorelei complained about how the man didn't stop talking (choke). Hopefully the date learned how fortunate he was.One other person here commented on how the mother acts like a teen and the daughter is the adult personality. Lorelei even dresses like her kid. This obviously 40-something mom dresses and looks like she hit the mall with her high school pals in tow.I thought that this show should have been followed by \"Just Shoot Me,\" because that's exactly how I felt.","I know the rest of the critical world has endowed this show with the highest of accolades. Numerous websites are straining their voices to sing it's praises. So am I the only one who finds these characters so annoying I want to scream? I cannot remember a show that was so desperate to be adored, that went so far out of it's way to be precious. I've tried a couple of times to get interested in it. After all, with so many praises being heaped upon it, there must be something, SOMETHING I'm just not seeing. And every time I watch it I'm ready to strangle every character on the show within ten minutes. I watch the lead characters of Lorelai and Rory (could they have possibly been given more precious, saccharinely \"darling\" names?) and keep waiting for one of these characters in this mother/daughter relationship to behave like an adult. A REAL adult, not the kind of hip, cool writer's-creation version of an adult that could only exist in a television show (usually found on the WB).I'm growing to hate this show more and more each time I see it. Unfortunately, syndication is making it increasingly difficult for me to avoid it. It's cloying and annoying, and if you are someone who prefers your television with at least a touch of reality, I recommend avoiding this one at all costs.","I decided to watch this show and give it a go but I found it to be boring, and more importantly dull.....Dull.There is far too much sarcasm and the characters are all dull, there is far too much talking and the character Lorelai...just keeps talking on and on and on.... During a second glance felt like suffocating the characters, the banter doesn't work and the whole love and romance thing just ruins what is already a crap show....I can't believe this show survived past the pilot.... This seems to be a show which forces the 'Listen to your parents' line....No actual drama exists....Should have stayed a pilot.....and a pilot alone...","If you enjoy the program for its cute characters or relationships, that's fine. However, if you're looking for intelligence, depth, or realism, I think you're in the wrong place. The following explains why.Writing: I suspect the dialog is written as follows. 1) Devise a trite plot and produce a basic script to support it. 2) Revise the dialog by randomly interjecting references to pop culture. 3) Revise the dialog by using a thesaurus to randomly replace smaller words with bigger ones.Characters: I firmly believe that before every episode, each character draws his or her lines from a hat. If you were to ignore the actors and focus solely on the dialog, you would realize that every character is virtually identical. They all have practically the same interactions and reactions to other characters and events.Acting and direction: I posit that the following direction is given to the actors before recording each episode. A) If you are female, speak quickly. B) If you are male, speak less quickly, unless you are excited.Realism: Obviously, some aspects of the characters are universally shared among all people. However, I have trouble believing that the agglomeration of inanity and neuroses the characters represent could exist outside a mental institution in Fantasyland. In real life, their personalities could only arise if a town of clones was raised by circus performers in an amphetamine production facility.In summary, I find the program to be superficial and pretentious. I apologize if this offends.","This is a great show about a small town of wonderful eccentric people, but centering around a single mother, her daughter, and the diner owner who has been there to \"protect and help\" them as if they were his own family since they hit town 18 years earlier. And soooo much more warm, honest stuff. Everyone should watch it. I have it on disk - every episode of it - and watch a \"marathon run\" of all the episodes once every few years. It just keeps getting better and better. Always puts the world in perspective for me, reminding me of what is truly important in life - or should be - for all of us.Sure would love to see a series now called \"Stars Hollow-5 Years Later\" (or Gilmore Girls - 5 plus) or some such name; showing how the girls, Luke, and all their neighbors, friends, and family members in the original series are doing in their new lives 5 years later - this could be another series with another great 7 year run. I'd surely watch it and buy all the series on disk just as soon as they came out at the stores nearest me.","Remember the good old days of The WB airing classics like Dawson's Creek, Felicity and Everwood? Shows that had heart, warmth and realism were all the rage in the late 90s and early into the noughties. They made us feel for the characters and the story lines were smart, witty and heartfelt each time.This is the kind of feeling Gilmore Girls also gave us when it first aired on The WB all those years ago in 2001. It captured two girls, both very different, yet very alike coming together in order to made life fun, exciting and a roller-coaster ride from start to finish.It didn't need to have a large cast of young actors to win over fans. In fact, the wide range of ages that are portrayed in this dramedy make fun viewing whether you are 13, 43 or 73. All ages enjoyed the antics on Lorelai and her teenage daughter Rory as they grew up, fell in love, moved on with life and did it without any drugs, OTT violence or fancy clothes.If only shows could be like this today. Full of warm colors and witty remarks that only Lorelai and Rory could deliver with fast dialogue. Then there's all the other lovely, interesting characters of Stars Hollow and of course, Lorelai's rich, aristocratic parents who better her every move in trying to win Rory's affection over with each episode.With each season better than the last and the overall feeling of emotion and spark never leaving the screen, Gilmore Girls was amazing throughout it's entire 7 season run.I recommend it to anyone who is a fan of LIfe Unexpected today, or was a fan of Everwood, My So-Called Life and The OC.","As a girl from a small town, I easily related to this show. It made me laugh, it made me cry, and it made me fall in love with each and every character. The show is filled with friendships, romance, drama, and clever humor. The way people talked, had a general respect for others, knew everyone in town.... it all made me feel right at home. The writers are genius. Thank you for keeping it family-friendly. Gilmore Girls is definitely one of my favorite TV shows ever! I never thought I could last through 7 seasons of a series, but Gilmore Girls left me wanting more. Luckily, I can at least follow the work of the actors thanks to IMDb. I would definitely recommend this show to any fellow small town girls.","Yup, I am yet another guy who loved this show. I was in my mid-thirties when it premiered, and I took to it instantly. One of the main reasons for this was the wit, dialog and repartee, which was quite unusual for American television, particularly drama or dramedy series. I liked hearing zippy and smart conversations between people - Rory and Lorelei, Lorelei and Luke, etc. - who were all reading off the same page in terms of culture, pop culture, etc.Yes, in some ways the appeal of The Gilmore Girls was the fantasy aspect of it. You had a wonderful charming small town filled with quirky but harmless characters, and a collection of main characters who were smart, ethical and caring. And generally the conflicts, though serious, were real and dealt with in a mature and earnest manner.toward the end of the run the show threatened to derail. The writers started to move into night-time soap territory with story-lines about infidelity, and over-the-top plot twists (Rory's relationship with her rich boyfriend was grating at times, as was Paris' neuroses). However, the show managed to stay on track to the end, delivering a very satisfying conclusion to the Gilmore tale."],"review-user":["gregorybnyc","natan62","loveandrevolutions","Mr_Sensitive","alexander-vragovic","sadisticbelizean","cadfile","mercybell","treehuggingnut","Victor Field","rbverhoef","cannotlogon103","AMcElvain","lambiepie-2","fattyeggroll","limau","budda10000","coperzx3","BMatth6167","Angelus2","btriffles","elrelr","BlueMoon89","BreannaBaker","sts-26"],"review-date":["26 May 2004","26 February 2003","19 August 2004","4 February 2005","23 December 2004","24 November 2004","16 March 2003","16 August 2002","3 September 2007","16 September 2003","15 February 2003","17 April 2007","18 December 2000","23 February 2007","26 January 2015","27 May 2008","17 April 2007","21 January 2008","11 January 2005","31 October 2008","30 August 2005","29 December 2011","19 May 2010","2 February 2015","19 May 2009"],"review-rating":["10","7","4","1","1","3","1","1","1","10","9","10","8"],"review-title":[" A Chick Series Even Boys Could Love\n"," Modern-day Jane Austen\n"," Fast-paced, intelligent show.\n"," I Love This Show\n"," the best ever\n"," Thoughtful show\n"," Yes, I am a guy and I like this show\n"," Life (caffeinated, with some lemon juice please)\n"," god i love this show!\n"," Welcome to their little corner of the world.\n"," Funny and touching\n"," I hate this show with a seething passion...and cannot stop watching it. Please help me....\n"," Outstanding Drama, Writing and Cast\n"," Sugary, sweet and boring\n"," Wish I had earplugs\n"," From charming ladies to self-centered harridans\n"," Intelligent? Witty? No way no how.....\n"," Mindnumbing \"Banter\" Going Nowhere\n"," Is it just me?\n"," The sarcasm.........\n"," Sorry, but I strongly disagree about the \"intelligence\" of this show\n"," GREAT SHOW no matter what age - watched all the episodes over 4 times\n"," The Way Good TV Used To Be...\n"," A Small Town Girl's Favorite\n"," Another Guy Who Loved This Show\n"]}