{"review-url":["http://www.imdb.com/title/tt0220261/reviews"],"review-text":["I think my family must be the only one in Australia that sits down and watches Unit One every Friday. But we do. We stumbled across it last year when nothing else was on, and have watched it every week since. Not only do I enjoy listening to the Danish speakers, but the story lines are great. Unit One is a mobile police unit, that travels over Denmark in a semi-trailer that is their office. The group are not only colleagues, they're like family. Each week a new crime must be solved, sending them from one end of the country to the other. But the stories also dive into their personal lives. Ingrid's son, Allan's wife, Gaby and Johnny's relationship... Each week is a new and exciting episode. That is what keeps me coming back, despite the bright yellow subtitles I have to put up with. All in all, Unit One is a brilliant show, with wonderful writing and acting. I give it 8/10","First off, I'm an American -- I haven't seen any comments on IMDb about this series yet from a U.S. viewer. Secondly, I work in the television business in development. So I wallow in much of the sludge that comes out of American broadcast programming. \"Unit One\" is an example of television that's a throwback to what I would attribute as '70s-style scripting, feature-wise. Namely, those films made by young autueurs who had free rein to make the dramas feel more realistic and to allow for organic character development. It tacks more along the lines of stellar British dramas like \"Cracker\" and \"Prime Suspect\" as well as Australia's brilliant \"Underbelly.\" \"Unit One\" features stand-alone cases that are committed, then solved, each week. The mysteries aren't extraordinary or particularly byzantine. They usually center around one single twist, clocking in generally at the 40 minute mark, and resolution is neatly wrapped up in the 15 minutes thereafter. What makes this series a breath of fresh air is that it features main characters that you are hooked on and find relatable by episode 2. These are real, breathing, alive characters that have personal baggage, yet it's not a talky, batty type of baggage that American flotsam such as \"Grey's Anatomy\" or \"Desperate Housewives\" spoons out. These are realistic individuals whose backstories unfold leisurely over the course of the series, as if you work with them on a daily basis. After the mindless decade of \"CSI's,\" \"NCIS's,\" and \"Criminal Minds,\" along with their subsequent spawns, it's refreshing to actually sit down to watch friends you want to spend time with, as is the case with \"Unit One.\" The quippy banter, the unemotional wooden dialogue, and the over-the-top jeopardy that those American series I mentioned bludgeon us with each week are absurd compared to the nuance and the quiet resonance you get with this remarkable Danish series. I'm on episode 7 of the first season, but I've already bought all four seasons and am in for the long haul. If you need explosions and farcically-hopped up testosterone, along with music by The Who and fast-cutting, neon-lit, jittery palsy-cam action with cipher-like main characters as your main diet of television drama viewing, I suggest you stay away from this series. If you are an adult with a hunger for subtle, poignant, thoughtful and, yes, sometimes straight-forward procedural crime dramas, I urge you to check this show out.","I've seen selected episodes of Unit One on German television and am extremely impressed. I'm a fan of several Swedish crime series (Commissar Beck and the Henning Mankell mysteries), but Unit One is just as good, if not better. What is surprising is how much it packs into little over an hour. Not only does it cover the case in all its complications, but it also covers various back stories, the private conflicts that affect the members of Unit One. The writing, the cast, the photography, the direction are all superb, and I can only hope that ZDF in Germany will show all the episodes, and when they do, that they will put the series in primetime, and not in a late-night slot as they have up to now.","Rejseholdet is the second project from the national danish TV-station DR1 to bear that name, and it is by far the best of the two shows.The plot is very basic. The danish police force has a team that can move out and assist the local police in cases where expert knowledge is required. Each episode is based on real-life crimes commited in Denmark and (so far) the neighboring countries of Sweden and Germany. The story follows the away team, and much of the plot is focused around the character's interaction between themselves, their private life, and the people they meet during the cause of the investigation.\nWhat the series lack in action, is made up in the show of realism presented. The crimes are not solved at gunpoint, but rather in careful examination of the crimescene and the general public's help (remember Denmark is a small country, so often someone is bound to know something or have seen something).The acting is quite good, and very realistic compared to most contemporary danish shows and films. Especially Mads Mikkelsen (as Fischer) and Lars Brygmann (La Cour) stands out. The two characters suplement each other very well and are the ones with most depth.What also makes this movie very popular, is the fact that a lot of neglected locations in Denmark, is shown in the show. No town is too small for a crime, and most danes will have their city, or one close to them, featured in one of the episodes.It is no wonder that almost a quarter of the danes watch this series every week. And it is also no wonder that the concept has been sold to other tv-networks - so look out for your own version of \"Rejseholdet\" soon.","Taking inspiration in actual events in Danish crime history, this series simply rocks. I've just bought the whole series on dvd, and I must admit that it is quite amazing to see the development of the characters during the run. Finally a Danish series that can give the American ones, like CSI, Colombo, Murder She Wrote a.s.o. a little fight for the money.","After living in Sweden for a period during 1998/99 I had grown accustomed to fairly good quality local made TV, allbeit there wasnt that much of it unfortunately. I had since heard that Mordkommissionen (Rejseholdet orig Danish title) had become must see TV for some Stockholm friends during its Swedish TV4 play. Luckily the series was out on DVD when I was there again during New Year 2003, so I took a chance and bought the whole lot.   What an excellent buy! I have so far allowed myself to see the first 12 episodes which are by far better than any American crime series found on countless TV stations. I want to make it last so I have another 18 to watch over the next few months. What a treat this show is! I just wish that a UK channel would bother to even consider buying it, so that friends here can see it with English subtitles.Well done DR TV on the probably the best non-English series I have seen!","Have just seen the last episode, No 32, (though the site says only 30 episodes were made) and I must comment on the fact that this series was really very good and I would thoroughly recommend it to anyone who enjoys crime/cop stories. Supposedly all 32 were based on fact with information at the end of each episode of the court sentences imposed on the perpetrators of the crimes, this has at times been a gritty, well acted, believable and dare I say, entertaining series. The fact that the powers in Denmark decided to disband the unit was almost unbelievable as they did their work so well and in the series at least, never failed to \"get their man\"! It's a definite 10/10 for me.","This is one of the best danish tv series alltime! The series is about a police crew who investigates murders of all kind. The episodes is based on actual danish murder cases so the show are very realistic. I think its great entertainment and definitely a look worth","This series only began (on SBS TV) here in Australia around a month ago, and I'm already hooked!! Whilst not the best or the most original cop show there is, it's well made, and the stories are believable, and the characters of the police are well drawn. Mostly, I like the balance between the crime-of-the-week and the personal lives of the detectives, where the latter never ever seems to overshadow the former, as it should be, but the personal insights into regular characters gives them substance and dimension.I'd recommend it to anyone who likes their crime shows on TV to be straight-forward and without too much fanfare and sensation.","Yep, I too love the series, shown here in Australia on SBS. When it's on I fire up google earth and get my aerial view of the crime scene in Denmark! Charlotte Fich, and Trine Pallesen are gorgeous although some people say that Charlotte looks a bit like New Zealand Prime Minister Helen Clarke (well Helen Clarke would do well if she looked more like Charlotte)!Some things puzzle me a little, First is the video \"treatment\", it seems to have some \"texture\" or treatment which puzzles me a little as it looks like it has passed through analogue production processes.Second is one of the bridges in the opening title sequence. Is this bridge the one between West Zeeland (Vastsjaelland) and Fyns?Well done to the team at \"Rejseholdet\", and glad IMDb has the literal translation of the original title.","*Minor spoilers ahead*I agree with most people commenting about this series. It is good, in fact better than most of the worse than bad TV programmes, movies and so forth from this part of the world (speaking mostly out of experience of Swedish television, though). Fine acting, with the exception of Lars Brygmann (plays Thomas La Cour - maybe not entirely his fault, but it's just silly that he all of the sudden became psychic, it takes away a lot of the credibility for his character - feels like it's more of a shortcut to tying together loose ends within the script than anything else).Hope to see more episodes of this show in the future.","\"Rejseholdet\" is a big hit in Denmark, and there is a reason why. It is a cop series, where we follow the Danish police unit \"the travel team\", solving crimes, based on authentic cases from Denmark. The cast is full of talented Danish actors and actress', among others Mads Mikkelsen, known from the Danish movie Blinkende lygter a.k.a. Flickering Lights. In my opinion the show is god Danish quality, but don't just take my word for it, Tuesday November 26th 2002 \"Rejseholdet\" won the international Emmy Award for Outstanding Drama Series.","I totally disagree with Henrik Bro Jorgensen who has given another comment on this series.I think this TV-Series is a one-of-a-kind, though Henrik claims it's just like \"any other\" American cop-series. It's not! The series focuses on different cases which have been solved by the real Danish \"Rejseholdet\" (a mobile police unit). However, it looks into the characters working in the police force. How are they influenced by their work, and what happen when they are off duty.It's definately not as violent as for instance N.Y.P.D Blue, but it still has a touch of excitement - and the thing I like the most - gives examples on how the police actually works.Many of these Danish actors and actresses seemed a bit \"unprofessional\" in the beginning, but I must say that all of them grew with the part.The series just won an iEmmy for best TV Drama series - meaning that it apparently do touch the viewers no matter what.I'm really looking forward to the two last episodes which are just to be filmed. Two episodes supposed to show what happened to all the policemen (and women) when their unit was closed down (this also happened in reality, though it ended up not closing for good anyway).If you get the chance, check out the series - it also goes under the title \"Unit One\". It's definately worth a look!","This is a wonderful series and leaves the US ones for dead (except maybe NYPD Blue)..more in the style of UK cop shows, I guess. This really is a beaut show.. and the blokes ARE worth looking at. I admire the actress that plays Ingrid too, she is amazing.! good work guys.. us Aussies are enjoying the show just now (Oct 2005) I was born in Denmark and so can understand Danish, and I have to admit that the subtitles could be a tad more accurate, for example, with times (8.25 not 8.23) etc but my husband says he understands it and thoroughly enjoys the show.. it says that the stories are based on true crimes in Denmark.. if thats the case.. then it seems that Denmark is the place to be to commit murder as they seem to get off VERY lightly!! Sometimes only a suspended sentence! The show truly is wonderful and I so look forward to seeing it. I have not had time to search to see how long the series does actually run for, but here in Australia, we have only just got it. Love the show. and love that other show about the father in law of Denmark too!!","I've got all 32 episodes of Rejseholdet and , quite simply , I think it's one of the best series ever made.The title is effectively the same as the British TV series from the 70's The Sweeney and it is every bit as good as that series was.It's very atmospheric , the acting is excellent , the interplay between the characters is superb and adds to the realism of the series. Some of the asides , especially between Fischer and La Cour are very witty.Too many programmes on Danish television are nothing more than copies of English and American programmes. At its best , however , the Danish TV service ( danmarksradio ) has made some outstanding television series. Rejseholdet is amongst them","I started to watch this when it appeared on one of the streaming sites that specialize in foreign TV series, and also because I'm a fan of Nordic Noir. This series started off well, and I had high hopes for it, even paying to download the series. Unfortunately, a little past the mid-point of the first season, the writing took a dive, the characters became really annoying, especially the \"psychic\" who wanders around the crime scenes mumbling to himself. It became worse when he solved a murder because of a dream he had.Some episodes lack continuity, and the plot scrambles at the end to tie up loose ends that were created. This is often done in ways that are just unbelievable. It's like going from Point A to point C without showing the viewer what happened in-between at point B! One can only hope that the series is really not representative of the state of Denmark's Justice and Police system! I should not have continued with series 2 but did so because I hoped the writers would produce better scripts. Unfortunately, that was not the case. The downward spiral continued! Now, to be fair, this series is over 15 years old, and is probably not as well developed as the later Nordic Noir offerings such as \"Borgen\", \"The Killing\", and \"the Bridge\". Perhaps the genre was finding its feet at that time, and evolving into the excellent productions we see today. On the other hand, every country that produces TV series will produce some pretty \"horrible\" shows sometimes, and this may be an example of that. I believe there were 4 seasons produced but I don't think I will be spending more to find out if season 3 and 4 got better......just not worth the money to do so!","This is pure joy. Not in subject matter(very dark) but as entertainment. And that is what it's all about. This is so far from the Standard and Practices confined drop dead boring common US TV-productions.. The dialog makes the persons \"real\" and so does the story lines too.. And the actors are second to non.. The stories are for the most part based on real cases, and although the drama sometimes surpasses reality it doesn't go beyond the realm of reason.. One member of the team has been given a tad to much clairvoyance, for my taste. But he is very well written, and the execution by Lars Brygmann makes it OK(he is fantastic). It is a true testament to Denmark that they manage to have so many actors, that are so good.. Also very fun to see many of the actors that had roles in the epic series \"Matador\" having a go in this series.. I highly recommend to watch this series.. And if one really wants to understand Scandinavia, watch \"Matador\" too...","21st century has seen triumph of multiple CSI-s with different locations, mostly in the US, but, already in the turn of the century, the Danes have a created a versatile depiction of harsh daily life of special policemen, invited to all over Denmark when cases become too sophisticated. Quite often, working lives are intertwined with personal ones, and the latter includes no constant happiness, but rather different issues with families... Moreover, through 32 episodes, the viewers are able to get a glimpse of pleasant Danish cities-towns and natural areas (as for many of them, joy of recognition to me, but many other nice unknown areas such as Aalborg or Bornholm...) The scripts are also logically created (cases portrayed were loosely based upon actual incidents), but it is still better if you watch all of them in a row and far more often than weekly. However, no Scandinavian crime series can apparently do about cross-border sex traffic and child pornography... As of the cast, it is splendid, and many of those having small roles have obtained bigger or even leading roles in subsequent Danish crime series such as The Killing, The Eagle, Anna Pihl or Irene Huss... Or just provide memorable performances (e.g. Nicholas Bro, Thure Lindhardt). The main cast is quite even, but still: Lars Brygmann and especially Mads Mikkelsen give stronger performances than the rest; when they appear, then the rest become supportive characters inadvertently. Anyway, Rejseholdet is highly recommended to all fond of Scandinavian intense crime films, where the line between good and evil, cops and loafers is thin at times...","i missed the first two episodes of Unit One. I have watched it religiously ever since. i think it is an amazing show. please keep the show going. i love it. i rate it very highly along with Inspector Rex do any of the actors speak English are there any fan club sites a favorite in my family is \"IP\" i sincerely hope that they continue to produce this show as it the highlight of an otherwise boring Friday nights telly.how many episodes are there in the series? are there and plans for another series. i really hope that it isn't a one off . i would also like to know what city the show is filmed in. the country is beautiful.","Fantastic crime series from Denmark concerning an elite, dedicated homicide unit travelling the length and breadth of Denmark to solve murders as they occur. Although the crimes and the procedural paths to their resolution are competently staged and handled, I think the real stand-out of this series is the way the personal lives of the unit members and their interaction with each other are portrayed. Many series originating in other countries sensationalize the private lives of the protagonists to the point where such scenes either induce disbelief or jar the continuity of the plot. Here the lives of these police officers are characterized with subtlety and dignity, in spite of some personal situations that are sad and irreconcilable. If you are tired of the predictability of series emanating from English-speaking countries, then give this one a chance and be surprised by its freshness. Also 'The Killing' a series from Denmark is just as good. 9/10","We've just watched the last of the series shown on the SBS network and will miss our weekly dose of Danish Delight. My wife and I picked up the show after the Swedish show \"The Eagle\" finished and it seemed by comparison to be a very poor substitute for our then favourite show on TV. Week by week, however, the show grew on me, and whilst not as glossy as the Swedish show and definitely grittier in terms of their investigations of everyday crimes, it certainly provided a very satisfying weekly viewing meal indeed.Prior to these 2 shows I had not really been a fan of the cop genre and can't say I am now but the 2 Scandinavian shows really provided us with an insight into life in those northern Euopean countries through the eyes of their special policing units.","This is one of the best Non-English series I have seen. It weaves interesting single and double episodes of crime-solving together with a personal aspect that you just don't get in CSI. The individual characters all have personal lives that combine well with their day job and occasionally interfere. Additionally the characters all manage to naturally evolve throughout the episodes.The casting is superb and it was taped all over Denmark, giving a good example of the highlights that majestic country has to offer. Unfortunately only 32 episodes were made, however they are top-notch television. Here's hoping they consider making some more episodes of the same caliber.","This production, build on real danish crime stories, is a experience through excellent directing, acting on all levels and has a nerve not often seen in crime series. Every episode is a thrill because it's seems like the hole team believe that \"this is my life right now - this murder or murders are MY responsibility to solve\" and the output is brilliant.As a viewer, you just have this wonderfully filling of being entertained cause it feels like their focus, on purpose or not, lie on that they WONT you to have a good time...:o) Don't miss this one, it's just right under 'Band of brothers' quality and is a \"must have seen\" experience - What a wonderful crime time !","Re Unit One; Read the comments of (I've forgotten in the runaround here)but laughed out loud at;'What the series lack in action, is made up in the show of realism presented. The crimes are not solved at gunpoint, but rather in careful examination of the crimescene and the general public's help (remember Denmark is a small country, so often someone is bound to know something or have seen something).''Lacks in action', does the person mean car smashes every 10 seconds, 400 parking meter attendants dressed in black, grunting,'Hup hup hup hup , as they carry anti-aircraft and anti-tank bazooka's and machine guns etc, not to mention gas bombs and enough ammo for world war 3, which they expend in typical Yank style of, aim anywhere and lock the trigger until everything in the general area is on fire, dead, and mainly obliterated!? and thats for a jay walker! That is not police real life! And the best bit, 'Denmark is a small country, so often someone is bound to know something or have seen something'. I love it, and I'll bet the Danes are ROTFL. Denmark - Population: 5,432,335, thats 5 and a half million people, and the Area: 42,930 SQ KM.. Population Density (people (average) per square km)=123 in 2000. Absolutely no room to breathe whatsoever. \"yeh, ah seen it, ah was looking out of my window in Ringkobing, and ah seen dis man wiv dirty shoes, obvious a crinimal, in Hillerad...come quick!\"You MUST be an American.A GREAT programme,(this is English, not American, so the 'spell-checker doesn't like it) a vast relief from the Rambo-istic plastic plods, with glib, slick, zoom-on-the-serious-but-handsome/beautiful-best profile, emetic American drivel that they attempt to force-feed us day after plastic day. Thank Zeus for the off-button.","I am up there in age and have always loved crime series. The Unit One is one of the best series I have seen. The entire cast was great."],"review-user":["ElvenPiratePrincess","nedtsoaptalk","brrm","moebius deux","videojakob","MikeyEurocrime","MEG-40","Hansemande","prose","John_Barber","robertk_ees","laney fog","K-Hjorth","kirstenh","DAVID-BRADLEY","qui_j","troutmaster","BeneCumb","slinkywndy","Rupert17","geoffpetersson","Sublevel4","nalle-14","iq1982003","firecap-78294"],"review-date":["11 February 2006","3 November 2009","26 August 2004","17 January 2002","25 January 2003","30 September 2003","1 May 2006","19 April 2001","25 October 2005","27 December 2005","5 August 2004","29 November 2002","23 December 2002","28 October 2005","5 August 2004","29 October 2016","6 May 2014","1 September 2013","7 January 2006","21 July 2010","8 May 2008","2 March 2008","13 February 2008","11 March 2006","10 July 2018"],"review-rating":["8","10","3","10","8","9","9","9","9","10"],"review-title":[" Quality TV\n"," Excellent series - much better quality than our U.S. crap\n"," Fabulous crime series\n"," Realism over action\n"," It rocks!!!!!\n"," Excellent quality Scandinavian TV\n"," Great Series\n"," Fantastic Exciting TV\n"," Another highly addictive cop show\n"," It's on my MUST WATCH list.\n"," One of the better shows to come from Scandinavia.\n"," An Emmy Award winning show\n"," Fantastic TV-production showing real cases\n"," Terrific!\n"," I cannot say many good things about the series !\n"," Bad scripts, silly stories and bad acting at times\n"," A great TV-show..\n"," CSI Danish type - giftedly invented and performed\n"," Fantastic show.story lines are believable and not too far fetched\n"," Wonderful Wonderful Copenhagen!\n"," rare entertainment\n"," Danish CSI, but better\n"," What a wonderful crime time\n"," UNIT ONE..'Denmark is a small country'.\n"," great series\n"]}