{"review-url":["http://www.imdb.com/title/tt0276428/reviews"],"review-text":["I hope, from his seat on Heaven's comedic throne, Spike Milligan can see and can enjoy this film, as Terence Ryan and Ken Tuohy have taken a book that the author himself said writing it \"nearly turned me mad\" into a joy to watch.The film tells the story of the Irish town of Puckoon and the problems befallen upon it when the partition between Northern Ireland and the Republic is drawn up, cutting its way through the centre of the village and, more worringly, through the middle of the churchyard.  This causes some deceased, buried in the Catholic churchyard, to now be in the Protestant north - and so the local priest, assisted by a wide variety of eccentric locals, aims to move the bodies back undercover of darkness, and so avoiding the bureaucratic British border guards.It was inspired work to cast the Irish comedian and poet Sean Hughes to play the part of Madigan.  He brings an innocence to the part, especially in his to-camera pieces (which is normally where he interacts with the voiceover of Richard Attenborough, playing supposedly the writer/director of the film). Daragh O'Malley playing Father Rudden is also worthy of considerable praise; and the rest of the cast, from the household names like Elliott Gould and Griff Rhys Jones to people with what would normally be called 'bit parts' - such as Spike's daughter Jane who plays Madigan's wife give 100%  The credit for this goes, in no small part, to the wonderful characterisations given by Spike in the original book.I could argue that the film is slightly too long, or that Elliott Gould's Irish accent left a little to be desired, but those would be only minor points and take nothing away from the excellence of this film.","Saw the film at the closing gala of the Ealing Film Festival in West London(England). Enjoyed it immensely. Although the Crow & the Chinese Policeman don't appear, and Dan Milligan becomes Dan Madigan (played by Sean Hughes (I)). The interaction between Dan and the Author (Writer/Director) voiced/played by Lord Richard Attenborough, works very well.The rumour is that Lord Attenborough and Elliott Gould (as Dr. Goldstein) appeared in the film for just a pint of beer.Spike was shown the film, on video before he died and by all accounts enjoyed it immensely.","Puckoon, the story of a small Irish town divided by the Partition of Ireland in 1924 - really divided, the border goes through the middle of it! The characters are wonderful - the village idiot, the poacher, the priest and the hero(?)Dan Madigan, who participates reluctantly in hare-brained schemes to smuggle explosives into the North and deceased Catholics from the now Protestant side of the churchyard back into the Catholic part. Spike Milligan really hit the nail on the head with this hilarious story - pointing up the ridiculousness of political partition by 1)making it so farcical and 2) making the authorities who try to enforce it look like idiots. I notice that the Norwegian reviewer thought it a waste of money - but perhaps this film has the sort of message that only the Brits and Irish would understand. 10/10","Fantastically funny with a serious message at its heart. Director Terence Ryan has captured the bright infectious humour of Milligan's comic novel and balanced it with the darker political message of the partition of Ireland.","This film is a must see for fans of the book and Milliganesque humour. I think the best thing about it is that the film works as a stand alone film in itself, irrespective of the book. It must have been very difficult to pull all the various scenes and diversions in the book together into one cohesive film.All your favourite characters and scenes are in, and a great deal of the dialogue is word for word from the book, so you don't miss out on some of the characters' classic soliloquies, descriptions and chats with the author/director/viewer. The characters and setting really did appear as they did in my mind when reading the book. Off the top of my head, look out for the following classic scenes and dialogue from the book: - Madigan talking to the camera ('author' in the book) about his legs, his wife, retreating not running away etc.. - The owner of the Holy Drunkard pub describing his wedding day - Drawing the line to decide the border - Rafferty - Moving coffins to and fro across the border - two brothers smoking the same fag - the soldiers waiting for a train to show up - and lots, lots more!Sean Hughes is great as Madigan (changed from Milligan in the book), .... Gryff Rhys Jones is head of the border patrols, Ronnie Drew of the Dubliners has a cameo role, Richard Attenborough plays the 'author', and one of the Macgann brothers is in it as well. For me, it's one of those films that I could watch over and over again as there are so many funny lines and scenes - bit like rewatching Life of Brian.","Spike Milligan was one of the funniest men I've ever seen, and a huge influence on my life.This movie is limp and awful, and does his memory no credit. The script is cluttered and preserves too many lines from the book intact (the leg jokes here are incomprehensible). The actors' performances are uniformly ineffective, a great cast wasted, and the lead, Sean Hughes, delivers Milligan's belligerent hostilities in a plaintive whine, which misses the point completely.The gentle pacing is a killer as well. Farce should accelerate towards the end. The Goon Shows often did, the novel \"Puckoon\" definitely did, but this film, if anything, slows down just when you want the various elements to smash together in a final climax.Milligan narrated an abridged audio recording of \"Puckoon\" in 1980, with T.P. McKenna, Dermot Kelly, Norma Ronald and Jack Hobbs. Now, that's funny. Ten minutes of that is funnier than this whole film. I believe the LP was transferred to CD, but don't know if it's still in print.There is a movie of \"Adolf Hitler: My Part in his Downfall\" with Jim Dale and Arthur Lowe. It too is a godawful mess, but it's funnier than this thing.It's possible that Milligan's spirit is too rambunctious for the screen. The other reviewers here are indulging in politeness and wishful thinking. This film fumbles virtually every opportunity and never misses a chance to disappoint.","I saw this at a Boston Irish Film Festival screening a few years ago and thought it was just simply amazing!! Does ANYONE know where to get it in the U.S.? It rivals such other Irish flicks as Waking Ned Devine and the Rat in it's hilarity, but alas it is unavailable here as far as I know. All about a little town in the hills that gets divided up during the separation of the counties of Ulster from the rest of the country. The most memorable scene to me was when people were trying to cross the border to get to their everyday lives. Women unable to feed their chickens/harvest the eggs, men being able to go into the bar but not actually sit at it. The church even gets separated from sections of the graveyard, which in turn creates some more very funny situations where some of the villagers and the priest (Daragh O'Malley) try and sneak into Ulster to bury a body of one of their late friends. Absolutely BRILLIANT!!!","At last Puckoon has been made into a wonderful, mesmerizing film. This is a film that every Milligan fan will want to see many times, if just to catch everything that happens in each scene. The script has cleverly constructed in layers, the surface being the fast paced comedy and the deeper layers showing what happens to ordinary people, like the villagers of Puckoon, when their country is suddenly and arbitrarily divided","This is a fantastic comedy and a 'must see' for fans of Milligan humour and Pythonesque comedy. The screenplay has adapted the story as close to Milligan's novel as can be, keeping all the characters and humour as Spike portrayed them. This is the comedy film of the century.","Based on the 1963 novel of the same name by Spike Milligan, this is an absolutely hilarious satire on Irish North-South relations. The film takes place in 1924 and concerns the tiny village of Puckoon in County Sligo, which finds that the new border between Northern Ireland and the Irish Free State, negotiated by the Boundary Commission, has split the village in two. Since not even a single blade of grass from one side was given to the other by the Boundary Commission in reality, the film (and the novel) could be seen as a light alternate history. The unorthodox border arrangement means that part of Puckoon's churchyard is not only in Northern Ireland but the site of the British Customs post. Since the town's Catholic population cannot contemplate leaving people to rest in Protestant soil for all eternity, they devise a daring plan to exhume the bodies under cover of darkness. Unfortunately, they don't realise that the IRA is planning to smuggle a coffin filled with explosives to Northern Ireland and things go a bit pear shaped. I have never read the novel but the screenplay by Terence Ryan is certainly reminiscent of Milligan's comedic style so I get the impression that the script stuck to it quite closely. The film, which is very well directed by Ryan, has an extremely Irish sense of humour and I appreciated its irreverent tone and many fourth wall breaking moments. It is only 72 minutes long but it manages to fit quite a bit into its short running time.The film stars Sean Hughes in an incredibly funny performance as Dan Madigan, a shiftless, feckless, feckin' eejit, as we say in Ireland, who finds himself at the mercy of the Writer-Director, played by the always wonderful Richard Attenborough in his final film as an actor before his death in 2014. Attenborough replaced Milligan himself in the role as the latter's ill health forced him to drop out of the film. He died before it was released and it is dedicated to his memory. Dan often takes issue with the hardships that the Writer-Director inflicts on him in order to combat his laziness such as crashing his bike, getting struck by lightning and being urinated on. The scenes in which Dan argues about his treatment with the Writer-Director are one of the highlights of the film, not least because he typically finds himself on the receiving end of an even worse punishment afterwards.The film has an eclectic cast of Irish and British actors. And Elliott Gould. Daragh O'Malley is hilarious as Puckoon's priest Father Rudden, who devises the (relatively...) well-intentioned grave-robbing plot and tries to bless passing Protestant Boy Scouts in order to save their souls. Gould, whom Attenborough previously directed in \"A Bridge Too Far\", is not the most obvious casting choice for a film of this kind but is nevertheless very funny as Dr. Goldstein. He adopts a slight Irish lilt, never going over the top with it as other, lesser actors would do. In his penultimate film appearance, Milo O'Shea does not have much screen time but I loved his scenes as Puckoon's sole policeman, the 75-year-old Sgt. McGillikuddie. The great Irish character actor David Kelly, whom I was lucky enough to meet in 2008, has a fantastic cameo as the publican Mr. O'Toole, whose business takes a sharp turn for the worse when it is discovered that part of the pub is in Northern Ireland where beer is 30% cheaper. Griff Rhys Jones is great as the supercilious Colonel Stokes, who is rather aggrieved that he must deal with the eccentric locals and shoots himself in the foot at one point. That probably hurt. The film also features nice appearances from Freddie Jones as both the Boundary Commission representative Sir John Meredith and a blind man in the pub, Peter Woodward (who wrote Attenborough's final film as a director, the very bad \"Closing the Ring\") as Colonel Martin and Joe McGann as Chief Inspector Tomelty. I have to say though that I was very surprised to see Ronnie Drew of the Irish folk band The Dubliners pop up since I had no idea that he made any films whatsoever.Overall, this is a hugely enjoyable film that does not hesitate to have a bit of fun at the expense of almost every major institution in Ireland as well as the British government and its administration of Northern Ireland.","Spike Milligan's books and plays have defeated film makers over the years, and 2002's 'Puckoon' is sadly no exception. The novel, set in 1924, concerns the partitioning of Ireland, in particular its effects on a solitary community ( the 'Puckoon' of the title ). Due to a colossal blunder, half the village is now in Northern Ireland, the other half is in the Republic. Locals go to the toilets at the bottom of their gardens to find a barbed wire fence blocking their path. Drinkers crowd like sardines into a corner of the pub to enjoy a cheaper pint. A dead man has to have a passport made out in his name before villagers can reach the churchyard to bury him.'Puckoon' is a sort of Irish 'Under Milk Wood' with comic characters and surreal happenings galore. The lead character, Dan Milligan ( renamed 'Madigan' in the film ) is impishly played by Sean Hughes, and has conversations with the narrator ( Richard Attenborough ). Also in the film is Milo O'Shea, Griff Rhys Jones, David Kelly ( from 'Robin's Nest' ), Freddie Jones, Joe McGann, and Elliott Gould.Interviewed for the 'Making of 'Puckoon' documentary, writer/director Terence Ryan expressed undying admiration for the book. It shows on screen. But, alas, like the ill-fated film of 'The Hitch-Hiker's Guide To The Galaxy', a good book does not necessarily make a good film. The trouble with 'Puckoon' is that, like Milligan's other books, they simply do not work on the big screen. 'Puckoon' is essentially a collection of jokes in search of a plot.No way can the film be compared to train wrecks like 'Sex Lives Of The Potato Men', 'Fat Slags', and 'Lesbian Vampire Killers', but then neither is it as good as it should have been. The last half-hour involves a lot of running around by the police, the British army, some locals who have stashed explosives in a coffin, and is really tedious to sit through. Ryan's decision to stick closely to the book is the main reason for its failure to work as a film.The other problem is the total absence of charm. 'Waking Ned' had this in spades, while the 'Father Ted' television series was funnier by far. Spike lived long enough to see the film, and apparently enjoyed it. His daughter, Jane, has a cameo as Madigan's bride.The highlight for me though was the quotation at the beginning: \"I don't mind dying!\", said Spike: \"I just don't want to be there when it happens!\".","technically, this movie would have had it all: decent actors, a nice landscape, no obvious sights of a lack of budget, a celebrity like richard attenborough. the plot summary also sounded promising, suggesting a satire on silly bureaucracy and common people outwitting it.however, it never delivers. the plot is simply too illogical. throughout the whole movie, not one person does a single sensible thing. mad politicians, ridiculous soldiers, brain-dead villagers - all just hustle from one incredible situation to the next. what they all do never makes sense in a context beyond the current scene.of course, this kind of movie has to be absurd and exaggerated. however, it's also supposed to have at least one instance to point out the madness behind splitting a city in the middle. actually, there are (at least) two attempts, which unfortunately fail: the main character, who doesn't seem to have a clue about what's happening to him, and the \"writer\", who occasionally cracks jokes from the off that might be considered funny by an audience consisting solely of 12 year olds.what i found most impressing is that the movie tries to be funny all the time, but didn't made me laugh once. i've seen several bad \"funny\" movies, but until yet every single one of them featured at least 2 or 3 good laughs. so in this sense, \"puckoon\" is really remarkable.if you want to see a great movie with a comparable plot, check out \"brazil\". don't waste your time on \"puckoon\".","When I first looked at the back of the cover of this film, it seemed like me and my friends could be looking forward to 82 memorable minutes. And it certainly was memorable. Puckoon was the kind of movie where you keep asking yourself how this was possible. How it was possible that it was released on DVD at all. Out of all of the movies available at the video rental store that night...we might just have picked the worst. And yes, they had Tomb Raider. Absolutely nothing in this movie amused me even slightly. Who came up with the idea that it would be funny if the narrator could change the story by suggestions from the main character? Out of all the stupid things you can totally ruin a movie with, this is now my favourite. The character Foggerty, the village idiot, played by Nickolas Grace is the most annoying character since they started making movies in color. If there is one single movie that you definately not should see this year, please let it be Puckoon, cause I don't think it can be any worse. I still wonder if this just might have been the worst way I have spent my money, and take my word for that I have made many lousy purchases over the years."],"review-user":["Ulleskelf","William-de-Worde","senlac","bodhran","monty-46","tonstant viewer","greenarmadillo","opix","monty-46","GusF","ShadeGrenade","roskakori","coalesce"],"review-date":["30 March 2003","11 October 2002","5 August 2004","8 September 2002","8 September 2002","13 March 2009","10 July 2006","8 September 2002","7 September 2002","2 March 2016","20 January 2010","7 August 2002","27 July 2003"],"review-rating":["8","10","10","10","4","10","7","1","1"],"review-title":[" Anything done by Spike will be praised.\n"," A few changes, but still as funny as the book.\n"," Spike really hit the nail...\n"," Fantastically funny , capturing all Milligan's bright infectious humour\n"," A must see for fans of Spike Milligan's book -it's one of those films that I could watch over and over\n"," Big Milligan Fan disappointed in this damp squib\n"," OMG this movie is great!!!\n"," fast paced mesmerizing comedy with a cleverly constructed script\n"," Quote from The Guardian: It's fantiatical, magical stuff\n"," An absolutely hilarious satire on Irish North-South relations\n"," Knowing where to draw the line\n"," simply not funny\n"," Without a doubt one of the worst movies I have ever seen...\n"]}