{"review-url":["http://www.imdb.com/title/tt0218847/reviews"],"review-text":["The Last Supper DVD is a great concert of the great Black Sabbath songs. However, most of the songs can't be enjoyed because they are stepped on, the narration by the band interrupts the songs.  Sometimes in the middle, sometimes  towards the end.  What a disappointment this is, DVD quality music that can't be enjoyed. The producer of this DVD could have put the band's comments (which are great and very informative) at the end of each song, but they didn't.  I think whomever produced this DVD should be greatly criticized for screwing up such a great concert. Sure you can buy the CD of this concert, but the sound quality is nowhere near as good as this DVD.Does the music industry still wonder why people download music?  How about putting information on back of the cover indicating that the DVD is also a narration that interrupts the songs.","This movie would have been alright, indeed probably excellent, if the directors would have left the interviews and the concert footage separate. \"Into the Void\" is a great song, and I hate how it is cut off at the best part to go to an mumbling interview with Ozzy Osbourne. That should have been at the end of the film, or located in a special feature. The best part of concert DVDs is to put them on and let the music play, but \"Black Sabbath: The Last Supper\" is hard to put and and simply let play because the music is continually interrupted. Nevertheless, there are a few strengths to this film; the concert footage, when it does play, it excellent. Black Sabbath returns to the stage after a long hiatus without Osbourne and this film captures that well: Sabbath basically rocks the fans. The fans, of course, have a sweet advantage in the film because they are seeing the band live, of course, but also they do not have to put up with the incessant interviews that the DVD viewers are burdened with. Shame on Jeb Brien and Monica Hardiman (the directors) for doing this to the film! Also, shame on Wyatt Smith for editing the film in such a way.","Dear Black Sabbath, this DVD was great. The interviews interwoven into the concert were a bit of a distraction. But I'll take it. Bill Ward was really pounding those drums. He was so energetic. Geezer Butler still has that rhythm, I liked the way he moved on the stage. Tony Iommi looked a bit self conscious at times. Ozzy Osbourne was unfit as hell. He kept jumping up and down. Calling the crowd bastards. His voice was pretty OK for such an old man. I liked the way the crowd reacted when Children of the Grave began. It was terrific. There were quite a few mosh pits forming during that song. Best Regards, Pimpin. (8/10)","Just about every commentator has mentioned the way that some of the interview footage is superposed over the concert footage in places. This is true, and is the biggest flaw of this film. However, it isn't so often, or so bad, that one shouldn't see this video. If you are a Black Sabbath fan, you have to see this. Aside from having seen Black Sabbath in the Sevnties and early Eighties, I saw them in 2005 or 2006 when they also headlined OZZfest just like in this video. The concert was amazing, and very much like this, which was why I rented this in the first place. It's just about the best geezer-rock out there. Check it out.","This had the potential to be a nice document of the reunited Ozzy-era Black Sabbath, with solid concert footage, and some insightful interviews. However, the mixing of the two ruins both. The producers chose to splice the live music with the interviews, which completely ruins the cohesiveness of the concert. It seems like every guitar solo is overwritten with an interview second. Quite a shame that some overzealous wanna-be filmmaker would ruin this. It's also a shame that there isn't an option on the DVD that would let the user turn off the interview portion, so that the concert would play straight thru. C'mon, isn't stuff like that s'posed to be one of the DVDs main selling points?","Black Sabbath were pioneers on the hard rock/metal scene if only for their hard edged riffs and solos drenched in the darkness of thought.  Iommi, Ward, Butler and Ozzy himself return to the concert stage and this footage takes place over the stretch of concerts they had on the Ozzfest tour. Intercut are interviews and just footage of the four talking like the camera isn't even there which also brings interest.  Could've gone wrong if the music wasn't fresh anymore and tiffs still went on in the band, but this now isn't the case, even Bill Ward has it in himself to play, all this through long hard drugships (inparticular Ozzy who gives an ironical joke in a way- I should be dead!).  For Sabbath and Ozzy fans the treat of the season, and for other general rock fans a glimpse into a brilliant old British group whose roots date back to the late 60's.  A"],"review-user":["gmc750","teejay17","PimpinAinttEasy","smatysia","wdiv","MisterWhiplash"],"review-date":["19 February 2003","16 June 2006","7 April 2016","18 July 2007","4 February 2005","27 June 2002"],"review-rating":["4","8","8","6","9"],"review-title":[" Songs Are Stepped On\n"," A Great Concert Continually Interrupted\n"," Bunch of old farts playing great heavy metal .....\n"," Awesome music, stepped on a bit\n"," Could have been...\n"," Very insightful, very melodic\n"]}