{"review-url":["http://www.imdb.com/title/tt0210294/reviews"],"review-text":["My main attraction was that I absolutely love the original Snow Queen story and always have done, for me it is one of Hans Christian Andersen's best stories. So naturally I would see any adaptation of it, regardless of the company or who was in it. I was a little dubious though as for me Hallmark's output have been a very mixed bag. The good news is that while it is miles away from being perfect Snow Queen is really quite decent and one of Hallmark's better efforts.It does have a number of good things. The best asset is by far the visuals. The scenery, settings and lighting look absolutely stunning, easily one of Hallmark's best-looking movies, and the Snow Queen's costumes and make-up are an absolute knockout. The cinematography is basic and maybe some of the slow-motion shots get too much and unnecessary, but on the most part it is focused and fluid. The music score is very good also, it has the sparkling motifs that you'd associate with a fantasy score, the darker moments have a haunting musical undercurrent and it does all this without ever sounding generic.Snow Queen's lead performance I did think were quite good. The acting honours do go to Bridget Fonda who I think is wonderful as the Snow Queen. She looks breathtakingly beautiful, and while she is cold and icy at points she also has a humane side which she delivers with a surprising amount of pathos. Jeremy Guilbaut showed a lot of potential as Kai, he does bring genuine character and natural intensity to him proving that he is more than just a pretty face. Chelsea Hobbs is a little bland to start with, but I didn't worry too much actually as it fitted with the \"character going on a journey\"(literally and in character development) and later on she is easier to warm to.Oh and before I forget, I was surprised by how good the special effects were, the reindeer and the polar bear looked great. Snow Queen began and ended well, the darker moments providing a lot of promise for the telling of such a timeless story.Unfortunately, for all the good things that Snow Queen it does also have debits. The rest of the acting is uneven though with one exception nobody is exactly bad. That exception though is Kira Clavell's Summer Princess, who acts and sounds like she is participating in a high-school production. But the main problems are the script, the pacing and the story. The script once the darkness shifts dissolves into anachronism and modern vernacular, which against the production values proved to be quite a stilted mismatch.At this point as well, the pacing does get tedious and save for some inspired moments never really picks up- some of the action sequences like with the Summer Princess' minions and the Autumn robbers are quite nifty though-, which is a shame considering how promising the beginning and end proved to be. The story showed a lot of potential and I personally did find Gerda and Kai's love for one another and together convincing, which took a nosedive in the tone shift. For a programme of this length, I was disappointed at how forced the Autumn scenes seemed to be and by how certain events were introduced but never explained satisfactorily and consequently coming across as confused instead.So in summing up, Snow Queen was decent and watchable with the art direction being the best thing about it, but there were a number of things that stopped it from being great. 6/10 Bethany Cox","This is possibly one of my favorite films. It tells the tale of a girl named Gerda (Chelsea Hobbs) who lost her mother at a very young age, so has been bought up by her father. She falls in love with the bell boy named Kai. However, on her birthday the snow queen (Bridget Fonda) comes the the hotel which her father owns and kidnaps Kai. Gurda then goes after Kai, and follows him through the four seasons in an attempt to rescue him.I thought that this was an excellent adaption of the story with great performances from all the cast. It has wonderful special effects and the story fits together very well and is easy to follow. I think that it is a great film for all the family to enjoy. I have watched it every time t has been on since it came out and have never tired of it which is why I have given it a 10!","I have probably watched the movie 4 or 5 times. Every time, i get more and more impressed by how far the wish of a young heart can go, and the strenght of both Kai and Gertha to struggle for what they believe in.And the whole story is presented in such a way, you just get transfered into the plot and before you know it, you are there. you can see... yeah, there's Kai... working hard on the mirror... a little jump.... there's Gertha, fighting for her love..... and there's the Snow Queen...it's just a wonderful mix of love, adventure, tension.it's brilliant 10 out of 10","Sometimes Hallmark can get it right - like The 10th Kingdom - but many of their fantasy films plod, and this falls into the latter category. The version I saw may have been cut (a demon [?] shown in the trailer and publicity stills didn't appear), but anything that made the movie shorter can only be a blessing.POSSIBLE SPOILERS IF YOU ARE UNFAMILIAR WITH THE ORIGINAL FAIRY TALE:Anyway, the film updates the story to the early part of the 20th Century (?), and makes Gerda and Kay (here called Kai - being a Lexx fan, I kept expecting him to say, `The Dead do not solve puzzles') 18 year olds. Hans Christian Andersen's basic story is followed: the boy gets a shard of ice in his eye, goes bad, is taken off by the Snow Queen to solve a puzzle in her palace and Gerda goes to find him, having various adventures on the way.As the two main characters are older than in the original, a lot of time is spent getting them together and `in love'. Unfortunately, I was never convinced that they were particularly in love, and certainly not enough in love to make sense of Gerda's quest. By the time the main plot kicks in, the movie's pace has slowed to a crawl. Alas, when Gerda begins her search for Kai, it only manages to pick up the pace to a leisurely stroll.There are a few odd additions to the story that seem to go nowhere. At the start of the film the Snow Queen kills Gerda's mother, but no explanation for this is given. A polar bear living in the Snow Queen's palace is more than he seems (though this is possibly because the producers realised that the bear's feelings towards the Snow Queen would be OK in a Fairy Tale, but not in a modern film). Again, this is never explained. Also, hints that the Snow Queen has an erotic desire for Kai are dropped, but never followed through. The script is also full of anachronisms that really jar you out of the `fairy tale' mood.The production looks good, though there is evidence of penny-pinching: the Snow Queen's palace is the hotel where Gerda and Kai lived covered in ice. The three main characters are played with varying degrees of success: Kai comes across as bland as does Gerda initially, but once she sets off to find Kai you warm to her. Bridget Fonda looks great as the Snow Queen, but seems to be in a different movie to everyone else.Ultimately, the film is unsatisfying. It looks good, but drags and lacks magic.","This 3-hour made-for-TV miniseries came home with us from Blockbuster's this weekend. The production company clearly spent a lot of money on sets, costuming (Bridget Fonda, especially), and special effects (including a great Jim Henson talking polar bear & reindeer). They should have spent a bit more money getting a coherent script. The story line was so loose that it really never came together. One can overlook Irish-accented Germans, but not herky-jerky storytelling. With senseless loose ends which included a special guest appearance by the Devil, this one is certainly not destined to be a Christmas Classic. A shame that they wasted good performances by the two female leads.","DANGER: Watch for falling spoilers...Boy, was this a bad movie.  I know that they were going for a \"true love conquers all\" kind of thing, but about all this film conquered was about 3(which felt more like 9) hours of my afternoon which I will never get back. The movie is about two young lovers named Kai and Gerta who live in a remote town in a fantasy world.  Kai is the much-abused bellboy at a hotel owned by Gerta's father.  At first Gerta ignores Kai's advances but she eventually warms up to him much to the disgust of (You Guessed It!) Gerta's father.  As if this obstacle wasn't enough to overcome, an evil snow queen shoots a shard of glass in Kai's eye and he becomes a mean person treats Gerta poorly.  Kai is eventually taken to the Snow Queen's fortress (Which is the same set as the hotel just covered in ice, because the good people at Hallmark like to go all out) and Gerta sets out on a mission to get Kai back.  Along the way she runs into the 3 other seasons that are evil in their own special way, but Gerta escapes them with the help of some dull and forgettable characters she meets along the way.  (All the while you will want to turn it off, but can't force yourself to do it.  It's probably the most evil and most effective spells cast by the Snow Queen) Anyways, I will spare you from the ending because anything you can think up in your head right now is probably better then how they ended it.  So, in conclusion, the Snow Queen is an incredibly boring movie, which takes the fan out of fantasy.","Although a fine production with top notch visuals, Snow Queen ultimately is a disapointment. Too long and miscast in several roles, the main problem is the opening hour which sets up a love story between Gerda and Kai. In the original, the main thrust of Gerda's quest to rescue Kai from the Queen was friendship that was revealed to be love at the end, but casting the leads as 18 year olds defeats that revelation.","Gerda (Chelsea Hobbs) lost her mother when she was a child. Her father, musician as a hobby and owner of a hotel, lost his happiness with the loss of his beloved wife. Close to her eighteenth anniversary, Gerda meets Kai (Jeremy Guilbaut), the bellboy of the hotel, and they fall in love for each other. On the day of the party of her birthday, the Snow Queen (Bridget Fonda) kidnaps Kai and Gerda commits suicide, jumping in the river, trying to recover Kai. This is the beginning of Gerda´s adventure through the reigns of the four seasons. This confused story has some crazy parts that recall Alice in the Wonderland. Although having good special effects, the story is very confused, cold, slow and too much long. It is not clear why many things happen. My vote is five.","Complete entertainment! Although there are many strange things in the movie that the fairy tale itself doesn't have them including the autumn characters (mother and daughter) the general concept rocks.","I bought this film thinking it was a foreign import that I had seen many years ago, but nonesuch was the case. The film I was looking for was \"The Polar Bear King\", a Norwegian production dealing with a very similar story about a young princess searching for her abducted prince.\"Snow Queen\" however, is not set in the middle ages, but circa 1900 in the cold reaches of a Nordic landscape (even though everyone speaks English). We're presented with a sprawling magical epic of young love challenged by the callous heart of a queen who herself seeks to conquer what she already had, but failed to see.There's a lot of subtext and other themes going on here. We see the Snow Queen, and witness her cold manifest itself on both physical, emotional and even spiritual levels. She goes forth and sees that another wants, and covets another's possession. She exercises her power, and so our tale begins. Is she really evil and cold, or is there something missing from her life? Perhaps there's even more to her that we as yet fail to discover? Again, the story reveals all.During the unfolding of the tale our young protagonist ventures forth into a realm that lies \"straight on til morning\", to borrow from Disney's \"Peter Pan\". There she meets eccentric antagonists and other characters, mostly female, and mostly with an agenda. Our young heroine must brave, challenge and escape those who pose a roadblock to her ultimate objective.The production values are the usual top notch from Halmark. They don't spare expense when it comes to filming their intimate epics, nor do they waste money on extravagance that will not be used nor seen. We see a town that's in transition from becoming a small intimate affair where everyone knows everyone else, to becoming more of almost a small city ready to latently embrace the industrial revolution that's occurred in the outside world. We see vast wastes of snow capped mountains, and lush green forests and gardens. We see bandits and soldiers and a whole feast of visuals as our gallant heroine moves from one episode of her adventure to another.The cinematography is basic, but unlike a lot of other made for TV movies, is not bland for the sake of expediency. The camera angles are a bit more dynamic and inspired, but not quite the caliber of theatrical release. A combination of good camera usage and quality art direction gives the audience a very sumptuous TV film production.My critique is that it's not the film I wanted, but I enjoyed it for what it was. It's an American film made for American audiences based on some Scandinavian folklore, in regards to a tale that has some role reversal from the familiar tale of Gilgamesh. Everything aside, it is worth a night's viewing if you have nothing better to do.Enjoy.","I thought the movie started out a bit slow and disjointed for the first hour. However, it became more absorbing, fascinating, and surprising in its last two hours. So, while it starts out like a cheap horror film, it evolves into a beautiful and wonderful fantasy film.Bridget Fonda stands out as the Snow Queen. This was her best performance and it is sad that this apparently was her last performance, as she has not acted in the last 7 years. She absolutely personifies both the beauty and coldness of Winter.My daughter, age 14, found the film a bit frightening, so if you are showing it as family entertainment, please stay with your child and reassure her or him that it is just a fairy tale fantasy and not to take it too seriously.It is really one of the best fantasy films that I have seen in a long time, slightly better than \"Eragon\" or any of the \"Lord of the Rings.\" It is about as good as \"The Golden Compass\".","People comparing this movie to big blockbusters like Lord of the Rings or the Matrix will inevitably be disappointed with the way this movie turned out. Although it lacks in the big special effects department and there are no battles with hundreds of extras, there is still a masterful amalgamation of two old folk tales here. The acting talent, although not A-list, is still great and the interaction between the characters is perhaps more sincere than in a larger movie with an A-list cast. My particular favourite from this movie is Bridget Fonda, whose performance as the Snow Queen herself was quite moving, assisted enormously by a stupendous wardrobe and makeup. She injected humanity and a sense of pathos into the character of the fallen season corrupted by the devil's evil magic. Fonda aside the acting was not what we have come to expect from Hollywood, which I think is a good thing since Hollywood seems to have run out of ideas on how to train its acting talent to portray roles and so they have become stale and reliant on CGI and other special effects to take us away from the actors who all use the same tricks on us. Instead it shows new ideas some real thinking on the part of the actors about how they can find new variations on the the old themes of love and danger.","\"The Snow Queen\" is based on the famous and very beautiful fairytale by Hans Christian Andersen, about a girl, Gerda, who goes on a dangerous journey to rescue her friend Kai from the clutches of the Snow Queen. This adaption attempts to capture that story's sense of adventure and luminously intricate imagery through lavish sets and production design, but fails on a number of counts.Like so many Hallmark productions, the potential of the story is completely undercut by heavy-handed scripting and direction. The two actors playing Gerda and Kai are blandly pleasant but forgettable; Bridget Fonda as the Snow Queen looks the part but is otherwise miscast for the role. There's a notable lack of dramatic tension to this meandering three-hour miniseries. At least some of the pacing problems can be attributed to the addition of filler scenes that add very little to the original story, particularly in the opening hour that introduces the main characters.That said, \"The Snow Queen\" would be just about ideal for pre-teens with a liking for fantasy and a bit of patience. It's great eye-candy without being scary, and the acting is pitched at the sort of pantomime over-the-top level that spells out the storyline in very, very bold text. Just make sure you read them Andersen's story too.","Enchanting. The best time to see this movie is sometime when unhappy or sad. It's all just so cute, all, even the way that white bear loves the Queen in secret and gets Her in the end, also the achievement the two young actors of Gerda and Kai gave. It's music is also very nice. The two of us will always be one combined with sad piano tones in some places gives a very touching result and if one watches both parts at once, he'll see the Snow Queen is not so bad. She only tries to surround Herself with love in the wrong way. The evening this movie was on here (first part) I only watched it, because I was bored, but I loved it a lot more after and was very angry, when they didn't show the next part because of the Pope's funeral... Yeah, that was terribly sad for me. But when they said it will be on next week, I was so happy, that I recorded it and now I'm glad to have done so.","The Snowqueen is one of the best love stories I have ever seen: much better and deeper than Luhrman's Romeo&Juliet or Spielberg's Titanic. Gerda's love impresses me every time, her search, her battle is exceptional. Gerda becomes a strong, loving woman throughout the movie. Kay is the poisoner of dark forces: the temptation. This story encourages me to fight like Gerda for the ONLY ONE, for the love of my life, for Mister Right. Patience is one of the keywords of this movie. I cry every time when I realize all the suffering of Gerda and Kay. And I wish that it ends soon... Snowqueen tells although my life, I deeply identify with the story and the characters. Thanks at least for Hans Christian Anderson and the director.","This movie is based on \"The Snow Queen\" traditional fairytale by Hans Christian Andersen. The original story is quite depressing and I didn't like \"Snow Queen\" as a child, it was cold and quite dreary. The book didn't appeal to me. This film is a lot more colourful than the original fairytale. Gerda looks for her missing boyfriend, and traces him across the seasons, meeting various sisters of the four seasons who each want to keep her as their prisoner. It's only the Snow Queen who doesn't want Gerda, the only season who has no interest in her. The snow queen wants boys and has frozen a lot of them. She turned a man into a polar bear and forced Kai to fix a broken mirror puzzle. The main theme is that Snow Queen is actually Winter itself and threatens the world with an Ice Age. It was Gerda's magical broach that protected her from the Snow Queen. The costumes, the flying snow car, scenery, flowers and theme of seasonal sisters is delightful and appeals to kids mainly and some adults who enjoy watching family fantasy. Oh and the reindeer was cool but a shame he wasn't in it that much.","Hallmark wowed me with Gulliver's Travels back in the day. Even the remake of Snow White, while kind of freakish, but beautiful with Kristin Kreuk in it was a helluva lot better than this lumbering hulk of garbage.That said, please understand that I am a loyalist, and The Snow Queen and The Little Mermaid were my two favorite fairy tales of all time (you could say that Hans Christen Anderson was my first favorite author- I even liked Danny Kaye as Hans in the movie). I disliked the fact that Gerda and Kay(Kai) were so much older, and their little flirtation with romance, it felt heavy handed and false. There's no way that just after a couple of months and one kiss Gerda would chase off after Kay. Even with his silly Help Me note.That said, I think that the bits with Kay and the Snow Queen could have been considerably edited down, and more time spent with Gerda on her travels. I am not sure about the poster who said that there was no robber girl, but there was. I do know that the travelling thru the seasons was added because of the whole \"the mirror is the devils creation and he gave it to the seasons...\" bs storyline. Which, of course, is utter tripe.As far as being beautifully shot; sure, if you like white. Everything frm the frozen land looked as if it had been sprayed with canned snow, nothing really looked good. I didn't really like what they did to the snow queen; all in all, it was a complete disappointment to me. ESP the fact that I rented it and didn't think to remember that since it was hallmark it was probably a freaking miniseries or at least a two part movie. Christ I have been sitting in front of the tv for close to four hours!Two thumbs down, and a very bad rating. The acting is horrible, and the only thing I truly liked was the clothes.","I fret saw this sprawling romantic fantasy epic years ago when it premiered as a television mini series and I found it to be something special and loved it right away, it felt like this big fantasy adventure, a love story and a Christmas movie all rolled into one. When I watch this 'movie' which is always sometime in December, I'm always drawn in by the atmosphere and colourful visuals, there's so much attention to detail in the sets and costumes, it wasn't a super-high budgeted production but they were highly creative with what they had and it has a fantastic look. Anyway to me despite it being perhaps a bit too long, I still find it very fun and festive to unwind with during the chilly holidays. It's a big movie but I personally don't find it boring, there's a lot that goes on in it once it gets going and once I start watching I'm in for the long haul and have to watch it to the very end, there's something about it that I find very engaging and it cruises through the long story with a competence that most TV-produced short fantasy series fail to achieve, and happy sad or awed, you get a lot of emotional bang for your buck with \"Snow Queen\". Watching it is like being locked in jail but you love the warden! I like it best in the second chunk of the story where Gerda embarks on her quest to find her bewitched boyfriend and the Snow Queen and encounters the three other sister witches of the seasons who each act as obstacles to her final goal and are all selfish, possessive, and various degrees of crazy! It's not exactly what you'd call a linear story arc, a lot of it is pretty surreal and even metaphorical, there are points where you don't actually know which direction it's going to go in next, but it keeps a sense of strange reality about itself and has a good balance between the dramatic and fantastical and for me the overall presentation is a most enchanting one. I think the characters are good enough and make it work, Chelsea Hobbs is boring at first but as she traverses her very layered journey she really grows as a character and gains the strength and courage to face and defeat a foe who's far more powerful than she is by awakening her lost inner warmth and humanity and free her boyfriend's frozen spirit. Jeremy Guilbaut was so impossibly adorable in this, I had such a huge crush on him when I first watched it and I thought he had the face of an angel! He could play the cutie but also a jerk really well, so he was good for the part. I truly thought that Bridget Fonda made an awesome Snow Queen. She was hauntingly beautiful, vain, powerful and commanding, was self-centred, had a cruel sense of humour and was quick to anger and everything she did including essentially sacrificing many young men that she had enslaved to her will over who knows how long, was for the sole purpose of the virtually impossible task of reassembling the thousands of shards of a magic mirror forged by the devil himself that would give her the power to cast an eternal winter and reign supreme over the other seasons... I loved how it wasn't like she was only wicked and nothing else, she had an enigmatic tone to her character, like she wasn't always so completely cold and heartless, but had at some point been corrupted by something, which eventually turns out to be true. I loved all of the gripping scenes with her and Kai which stay in the same frozen hopeless place while Gerda travels throughout the seasonal realms. I also liked the touch of how the Snow Queen's domain was an icy version of the hotel, I find that quite clever in how it played into the theme if Kai's cold heart as well as Gerda's father's. I still love this and feel drawn to watching it around Christmas, I find it an uplifting and satisfying watch. It deserves a lot more love and to be remembered better than what it has been, and I'd suggest while watching it that you try to see beyond the kinks and look at the bigger picture of its story and try to enjoy it for what it is. Recommended to fans of fantasy and romance, the young and the young at heart. Truly magical. X","I thought that the storyline came into place very well. I liked this movie a lot. If you're going to rag on a Bridget Fonda movie, you can just rot. I thought that ragging on movie stars was a bad idea. Apparently somebody doesn't think so. I rather enjoyed the movie. I'm even thinking of buying it. I want it to be my very first DVD for my room. That's how much I like it. I rather would not start an online argument with someone I don't know & have it be over a movie. If someone could kindly retract what they said about the storyline, I would be more than happy to retract my insult. However, if they feel that I am not worthy of a retraction, I might just feel that they are not worthy of one either. But I can't control their actions, I can only encourage them in the right direction. Hey, they don't have to make a retraction, but I would greatly appreciate it.","\"Snow Queen\" is based, of course, on the fairy tale of the same name, collected in (at least) Andersen's Fairy Tales - and, unlike many other recent productions based on other fairy tales, this one retains the spirit of Faerie, an accomplishment not easy and not well understood by many, especially among Americans. Talking animals, arbitrary prohibitions, appearances of goblins, dragons, and demons, are not to be questioned in a fairy tale; they are as natural an element of Faerie as, say, gravity is in the scientific world, and the reason or explanation for them is completely beside the point of the story. Nor is the story bound by modern Hollywood rules of composition: direct, often to the point of being grotesquely linear in lesser works, and obvious (in retrospect, at least).With this defence against the common criticisms of those who do not understand fairy tales, \"Snow Queen\" is a delightful movie with wonderful visual effects, skillful acting, and great sentiment. The only flaw in the movie was, I think, not that it was too fantastical but that certain parts of the dialogue were too glaringly modern in slang and expression, a mar on its otherwise timeless nature.","Warning: I may include some spoilers in this review.I remember hearing the story of the Snow Queen as a child, and being terrified.  The first part of this movie captured that atmosphere entirely as Kai begins to change, but after he is taken and Gerda goes off on her adventures, the tension is mostly lost.Bridget Fonda completely looks the role of the Snow Queen, and is generally pretty good too, especially in what is probably her main line: 'Let the whole world be as I am.'  Kai is bland, and Gerda starts the same although as the movie progresses that changes.Some things in the movie just seem to be completely ignored or forgotten. Who is this polar-bear-changed-into-man?  Why did the Snow Queen kill Gerda's mother?  Why is Autumn a robber? Some parts are also dragged out too much; for instance, the scenes at the beginning of the lovers skating just go on for too long, and begin to feel far too soppy.Contrary to one of the other reviews I've read, I felt the ending was actually pretty good.  Winter being carried away by the ex-polar-bear gives the feeling that, rather than the typically stupid idea of 'evil turning good at the last minute', that she instead was merely going back to the way she was, and should have been, that she had been bewitched by the mirror.","I started watching the movie expecting to watch something magical and beautiful. Instead I found myself watching a very weak movie with really bad acting from all the actors. The story line is not attractive at all as is expected of a movie based on a fairy tale so full of magic and warmth of love. And it is unnecessarily long. I am a fan of fantasy and I really like watching mysterious characters. The snow queen by itself has the potential to be beautiful, terrible and mysterious. The snow queen of the movie is just like a teenager and does not convey the sense of superiority a queen from a fairy tale should have. I do not recommend this movie if you are a fan of fantasy genre because you will be the most disappointed.","This movie is sweet and touching and even a bit frightening at times, but that is purely at the beginning and end. The middle three vignettes in which the heroine meets the spring, summer, and autumn witches is too long, too unnecessary, and tedious and boring. The acting is fine throughout, the premise is interesting, but the middle seems like pieces out of another movie cobbled in. It breaks the flow and comes across as rather ludicrous. It is almost as if someone mistakenly stuck a couple of reels of a kids movie into the middle of an adult movie.Overall I would suggest this as a decent girl's sleepover movie if you didn't actually expect them to watch the movie. It could be easily edited down into a good movie. It's a shame the length and content is just too over the top and destroys a fine love fantasy.","I know the girl who did the figure skating for the lead girl. She once dated my brother and she was always really nice! I also live in Cranbrook B.C, about 15 or so minutes from fort Steele. Haha i used to go there for field trips when i was in elementary school. It was kinda weird seeing it in the movie. I also had the chance when the movie was filming to be an extra because there was a casting call for them at the mall.But i didn't feel like going to it at the time because i wasn't interested in acting. Now i totally wish i did. This was such an awesome movie that i bought it off of Ebay. It never came out here, (which is kind of weird seeing it was partially filmed here) so i was excited when it came. I really loved the story line and the poler bear was kinda cute.But if anyone has a question about Fort Steele, just ask away:)","Okay, I really dont care what most of you are saying, because you all are soooo much into details. But my personal opinion is that this is one of the best movies I have EVER seen. Its not got poor casting-I couldnt see anyone else playing some of those parts! Even though there are old versions of the movie, and a book. I like this version AND its characters. This is by far one of my favorite movies. =)"],"review-user":["TheLittleSongbird","rats_rox","Aprodia","LeMarchand","ixtoploplcatl","zcbrooke","Mark-129","claudio_carvalho","s_vouz","Blueghost","jayraskin1","Korridin","volatile","anntoanette","heinzfrosch","nightroses","angelafoltz","Foreverisacastironmess123","middlebaby2008","Lanklamenyn","lothy","azadeh-tafreshiha","zzoaozz-994-637879","foxy_irish_one","a_guest05"],"review-date":["26 December 2012","31 December 2006","19 December 2004","28 December 2002","13 October 2004","4 March 2003","16 March 2003","22 December 2003","16 October 2003","17 June 2011","23 May 2009","19 May 2005","17 December 2002","20 April 2005","5 April 2006","24 June 2018","5 January 2004","20 December 2016","23 December 2005","6 March 2005","3 January 2004","7 October 2013","6 March 2011","3 July 2005","17 May 2003"],"review-rating":["6","10","10","3","4","2","5","10","10","10","3","10","10","7","9","10","9","3","3","10"],"review-title":[" My feelings were rather mixed on this one\n"," An excellent adaption of a well known fairy story\n"," strong love, mixed with the magic of fairy tales\n"," The SLOW Queen\n"," Lots of Art, Not much Script\n"," Cold Movies Need Cold Reviews\n"," Winter Passes\n"," A Too Much Long and Confused Fairy Tale, Where Something is Missing to be a Good Movie\n"," A film to remember.....\n"," Another fine Halmark production.\n"," Spooky, but Very Nice\n"," Excellent considering its budget\n"," Meandering and heavy-handed adaption\n"," Unbelievably good lil' tale!\n"," life is a battle\n"," Icy fairytale\n"," Kill The Beast!\n"," \"Doesn't it just make your heart run cold with joy?\"\n"," This was a great movie.\n"," A fairy tale in essence, to be understood as such.\n"," Not Bad.\n"," Bad acting, bad story telling, disappointing\n"," Cut out the middle and you would have a good movie\n"," I know someone from this movie\n"," this was the BEST movie..\n"]}