{"review-url":["http://www.imdb.com/title/tt0228977/reviews"],"review-text":["This film is an excellent example of what an independent film can be. The director does an excellent job of riding the line between emotional and physical violence.  But in the end, he remembers what so many indie-films forget - he tells a good story.  When watching this film I was reminded of how timid and mundane most big-budget Hollywood films really have become.Especially notable, is an exceptionally strong performance by the film's lead - Jorge Cordova.  As an villainous thug (on his way to the top of the crime heap) Cordova plays a conniving, brutal, conceited, devious, and sleazy S.O.B., but he is so likable that he keeps you entertained the whole time.  I read somewhere that these guys were part of the New Wave of Latino Filmmakers in Los Angeles - called La Nueva Obra, or something like that. Either way, this film makes you look forward to seeing more of their work.","I was very impressed with this film from newcomer Dir./Writer Jose Reyes. The cast was excellent. \"Jorge Cordoba\" executed a powerfuland shocking performance as the lead character of \"Rafa\". It's inspiring to see independent films with this level of talent. It takes talent, courage, and determination to go out and make a quality film.I admire anyone who can take an idea from concept to conception and go the mile. It's easy for people to judge young filmmakers more harshly, but I applaud \"Jose Reyes\" and the talented cast for their successful efforts.","First, I must say that I don't speak spanish and usually do not enjoy spanish speaking films... BUT Two Coyotes is an exceptional film.  There is enough action and hard drama that it doesn't matter that its a spanish speaking film.  The subtitles were easy to read and didn't block the action - OR the drama!I would tell fans of spanish speaking films and non-fans of spanish speaking films to go see this movie.  The action and drama are worth every penny.","This first time writer/director comes across as a season pro with \"Two Coyotes\". Most action dramas are all about the action first then the story. But this picture works the other way around. If this is just the beginning for this director, then Hollywood will soon be making room for this rising star. Independent movie making has once again reached a new level.","I really liked TWO COYOTES.  One of my friends rented it the other night and we were really impressed with how good it was and how cool the main guys were.  I wonder if they are thinking of making a sequel because that would be excellent!TWO COYOTES ROCKS!","I should have known better..the clues were all over IMDB.com. This flick was written and directed by the same guy who has no track record. The cast is a bunch of unknowns with the possible exception of Joe Estevez who seems to specialize in bad movies. Etc. Suffice it to say, I can't see any reason why anyone would want to see this awful, amateurish attempt at film making. Turn on any broadcast channel at 3am and you'll see better movies. Nuff said."],"review-user":["thooker","erikargenti","cn8cs","comicboxer","beatnyc","=G="],"review-date":["8 June 2001","25 April 2005","13 June 2001","9 June 2001","13 June 2001","24 October 2001"],"review-rating":["9","10","10","9","10","2"],"review-title":[" Great Mex-ploitation Flick!!!\n"," Creative realism\n"," Good action+drama\n"," An action movie with a real story\n"," MUST SEE\n"," I hope Jose Reyes Bencomo has a day job.\n"]}