{"review-url":["http://www.imdb.com/title/tt0207351/reviews"],"review-text":["I remembered this awful movie I bought at Camelot music store in the summer of 1989 when I was visiting my Grandparents. It was a time when I had just discovered movies like Re-Animator, From Beyond, The Return of the Living Dead, and Dawn of the Dead. I was ready for all the horror/gore genre had to offer.... or so I thought! I was only about 12 years old at the time so I really don't remember it all that well. I remember a psycho running around with a corkscrew killing people, and a couple of cops (I think) who were riding in a car that wasn't actually moving, but being rocked side to side to look like it was... true cinemagic. I also remember it being the worst film I had ever seen up to that point and I promptly threw it in the garbage.Something tonight made me think of that movie (I can't believe I actually remembered the name), so I jumped on imdb to see if it was listed. To my surprise... IT WAS! And a full other 5 people have seen it.... Amazing. Even though I remember hating the film at the time I sort of wish I had kept it hidden away somewhere because I'd love to check it out again for a laugh (it would probably make a good drinking game movie). Anyway, I'm glad I'm part of the elite few that's seen this little \"treasure\". I would love to pick it up somewhere for a couple of bucks.... but beware, this is not a recommendation... it is awful... it's just for nostalgia.","I went through the highs. I went through the lows...cried, laughed, puked my ever-loving guts out. But through it all, I was made whole. I became a better person for having sat through this experience in self-imposed degradation. It's not every day we can say that we have lived through the worst, and come out the other side with something closely resembling our sanity whole and intact. Friends...neighbors-unite and be as one now. Go out and find this film and languish in its extravagancies. Place it high on the mantel and kiss its polystyrene box. Take it to bed. Take it out with you when you go shopping, or have blind dates with strange people. They will appreciate you all the better for your sublime and uniquely schizophrenic slant on cinema. And then they will throw their beverage of choice in your face (but you will have the last laugh). I ran for Governor with this little beauty under my belt (and you can too!). It is a treat worth having again and again.","I bought this movie at a garage sale when I was like 15. I hated it then, and watching it again, just for the hell of it, it's even worse now. You can hear the director and cameraman in the background yelling commands like \"Zoom, zoom, zoom!!!\". The are no special effects, just a raw piece of meat that is supposed to be a brain. This is utter crap, and i originally thought it was a one of a kind home movie or something that I bought. But this was distributed elsewhere and it's just really weird to know that other people have seen it. Whoops I need 10 lines....well....this can be an interesting thing to watch to see how no-budget movies were made before the invention of digital cameras. This sucks. Actually, yeah do watch this just to see if you can sit through the worst. If you can make it through this you can make it through anything.","I've already commented on this film (under the name TheLegendaryWD). But I see there are others who have commented since. All I can say is: WHAT THE F**K!?\". I cannot believe that a whole 16 people have commented on this film or even seen this movie. Add to that the fact that a couple give it great reviews (probably the makers of the film who went to one of those places in a strip mall that provide internet service and wrote a good review - seeing as how there is no way they could or would pay for their own internet provider... just look at their movie). Although I still admit I got a soft spot for this movie. I thought that some of the other people writing about this one might have it confused with another... until I read the reviews... especially the person who identified the tag line on the front of the box: \"The Ultimate in Frontal Lobotomy\" (what the f**k is that supposed to mean anyway? \"frontal\" lobotomy?)... I totally forgot about that until I read it in the review. People, we are a select few... I say we meet once a year to view this film... wait, does anyone still have it? If anyone does have it please contact me... I'm dyin' to get drunk.","I am in absolute awe of this corker of a experiment in SOV creation. Reaching a zenith in aspects as cringe inducing over-acting(most notably the lead who even mugs ferociously to the screen as he spouts off dialects about ruling the world and such in a German accent I could make out). Editing most definitely as you can tell they couldn't afford to show the titular weapon being plunged into the lead actor's victims or else they left it on the cutting room floor.I totally agree with another reviewer's comment of it being an SNL skit put to film length,except without SNL's comedic timing.It definitely drags at times spending more time on pointless dialog than action.Overly silly as well as some of the humor seems a little too juvenile for my tastes. It's an incredible feat to have a product this astonishingly awful to actually be seen and releases by somebody,but hey there's people out there who are in for more of an experience than an actual film,as this movie exceeds admirably in.Those who enjoy sheer surrealness and mind numbing banality in cinema climb aboard this horrific train.","It feels hard to review this movie because I can't honestly tell you what it's about. It's not really a story, much more random scenes loosely involving a \"brainsucker\" who drills people's brains out with a big, cartoonish drill thing.People just do random things in this movie, characters aren't really introduced nor developed. They just do random things, and mention this \"bloodsucker\", who is hardly shown in the movie. The sheriff, I think, makes the townsfolks deputies and they run wild. There's cuts to some radio talk show host who can't seem to stop breathing into the mic. There's some attempts at humor, but they're painfully unfunny. Some women says it's her son, but she dies off pretty quickly and pretty randomly. We get these terrible police, one with an absolutely terrible accent, chasing after a dance instructor and her boyfriend, when they reach an airport. One police officer finds out the brainsucker is his son, but this isn't really a twist and I don't really give a ####. They take off in a plane, and the brainsucker uses the drill to remove some white goop out of his head and releases it out of the plane.As I said, it's hard to review this because it's not a coherent movie in any sense. There's a lot that's in it for no real reason and the story doesn't make sense anyways. The characters aren't fleshed out or given any life, and there's little connection between them and what's happening. The effects are crude and barely amateur-level. The brains look like strips of bacon or pork cutlets. I can't recommend this to anyone, not even lovers of bad movies. Abysmal.","The worst film ever made, bar none.  Give yourself a pat on the back if you can possibly sit through every excruciatingly painful minute of it.  Except for the bit where the hard-luck loser turned deranged psychopath from forced medical experimentation pours his pea soup on the doctor's head and laughs like any good raving lunatic should...that's all.","A drunk judge sentences a repeat criminal offender to the care of a behavioral scientist.As the result of the mad doctor's treatment he becomes a love-doctor of sorts who sucks people's brains out with the aid of a corkscrew penis pump.\"The Brainsucker\" is extremely bad and amateurish horror movie with several odd characters.The humor is goofy and slapstick and the characters are exaggerated and annoying.I can't believe that adults are responsible for this piece of fecal matter.Is it even possible to find worse actors or write more immature script?\"The Brainsucker\" will suck your brain out and kill you with the stupidity.This film is truly one of its kind.2 out of 10.","I remember this film as the other person that commented said. I recorded over it but wish I had it now just because it had to be one of the worst movies ever. Funny, in a real bad way. I remember the tag line on the box was \"The ultimate frontal lobotomy\". I got it from my mom, who got it from a friend at work who said it was the worst / cheesiest movie she had ever seen, so my mom said \"My son will probably love it.\" and the woman gave it to her just to get it out of her possession. I then later taped over it, which I regret. I also remember the \"corck screw\" thing was one of those ball catcher things.... the yellow cone shaped things, with a red \"button\" at the end, and when you hit the red thing, it sends a ball flying. Well, they used that with a crank on one end, and a corkscrew in the funnel. When the killer killed they would show him coming forward with the \"weapon\" and then cut to a close up of what appeared to be raw chicken and fake blood on the victims head. I don't know what else to say about this \"gem\" except that if you like bad films, it doesn't get any worse than this.","This movie is possibly one of the most creative works of horror ever. It has everything you could want... suspense, drama, comedy, confusing subplots, native americans, brain eating... If you're looking for the be-all, end-all of brainsucking movies, look no further. The story of a man, bent on revenge. And how better to get it? \"I know, I'll suck out their brains!\" With great sound effects, and impressive special effects, I can't recommend this movie enough."],"review-user":["thelegendarywd","oscarwildesbush","michaelcbowers","wdskinner77","lonegurge","last_cheese","codfish","HumanoidOfFlesh","xnmex13-1","elhaz"],"review-date":["20 September 2003","1 August 2002","21 May 2005","29 November 2008","17 August 2011","23 June 2013","2 August 2001","12 April 2010","18 October 2005","27 March 2002"],"review-rating":["1","10","1","1","1","1","2","10","10"],"review-title":[" I'm actually honored to be one of the six people on imdb who has seen this garbage\n"," ...and now my life becomes complete\n"," I can't believe other people have seen this movie!!\n"," The Ultimate in Frontal Lobotimy\n"," How bad can film making get?\n"," What the #### did I just watch\n"," worst of all time\n"," Beyond bad.\n"," good lord!\n"," By far, the best brain eating movie ever made, bar none...\n"]}