{"review-url":["http://www.imdb.com/title/tt0253016/reviews"],"review-text":["Inherited this from my x's DVD collection when he left with my best friend (enough said), watched it one night when there was nothing on the telly (nothing new there then) and got a very pleasant surprise. Very British (you no hardly any budget, no faces you know or have even seen before), the accents were a bit thick for my liking, but after a worrying start (a bit too close to home in my case) it began to grow on me. Apart from the some unnecessary jokey cutting that really didn't add anything, I found the film throughly uplifting, very real, natural performances throughout left me wanting more from an ending that came suddenly too soon. Highly recommended!","A vg Brit rom-com, one to watch if you can get your hands on a copy. Quirky and often surprising, this is not the best of Brady's films (Kiss Kiss Bang Bang is by far the funniest), though it does have a unique charm. Well written the story veers off into a few dead ends but mostly surfaces with a new plot high. You know from the start how it's going to end, but when it comes it is honest and very open ended, a realistic and credible ending, the end seemed like a beginning, enjoyable and left me wanting more.","We really liked this movie. It wasn't trying to be outrageous, controversial, clever or profound. It was just entertaining and was what it said on the box a charming romantic comedy. Every other Brit film maker seems to want to change the world, nice to see one that just concentrates on telling a good yarn with elegant style.","Rented this out from my local because it was the only new British film available this week. Never heard of the film-maker before or his other films (thank you IMDB). About time some one made a good young British comedy that didn't star Hugh Grant or forty something's. The story is a morality tale but never preachy, throughly enjoyable from a young and fresh faced cast. Luke Goss's cameo was surprisingly very good, but then he did surprise me with his excellent performance in 'Blade'. Loved the colour grading, especially in the night club sequences. Great music and a truly original voice at work here. Nine out of ten and well worth the rental charge.","It's just one of those films, you're either love it or hate it, my girlfriend and me loved it, told my brother to rent it and he hated it, said it was too flashy and colloquial, then again he only usually goes to see big action movies, so probably not enough explosions left him disappointed. There were some great new talent (I'd never heard of the leads before anyway)? Des Brady (the directors brother?) was especially good. Playing a right dick at the start I thought he never would redeem himself but he managed to crawl out of the dark hole he had created and by the end I was really routing for him. A very surprising film with a whole lot of heart, if you can live without a body count and explosions then this one is very original. Yashimo. Brixton in the UK.","A very charming film with wonderful sentiment and heart. It is rare when a film-maker takes the time to tell a worthy moral tale with care and love that doesn't fall into the trap of being overly syrupy or over indulgent. Nine out of ten for a truly lovely film.","Wow! Why aren't more British movies like this. Great rights of passage money with a big heart and some stand out performances. The comedy is quirky and original and the kid is really great. One to hunt down and watch. Look out for it! Ten out of ten.","Logged on to the imdb to say what a charming film Love Love is and am totally confused. Seems to me that someone has been getting their titles mixed up. \"Plastic demon baby\" what? This wasn't Love Life. A little bit luvy dovey for my tastes but a great, funny and original film. Especially liked the ending that didn't fall into the normal pit of cliche that all hollywood romantic films  crash and burn it. Nine out of ten.","I watched Love Life on holiday, when it was filmed at a film festival in Florida. It was a lovely surprise to find a British film that wasn't derivative or exploitive. A beautiful romantic comedy for a change that will charm the pants of audiences prepared to sit back and enjoy the gentle pace of the film. The transitions between scenes I found a bit distracting, but as whole I think Love Life is a winner, a ruby in the dust. One for all the family. A pleasant change to see a British film for teen audiences that isn't littered with four letter words. Try and see it.","Watched this film at a local festival, the Silver Sprocket International Film Festival Florida . What a lovely film. A simple, uncomplicated morality tale about a young care free young man having to take responsibility for his actions. It neither pretentious or flashy my two teenage daughters loved it and for a change I wasn't embarrassed by any of the film content or language. A real family film and the best British comedy film I've seen since Billy Elliot.The film went on to win not surprisingly the top festival awards of Best Film and Best Director. Ten out of ten.","It hurt to watch this movie, it really did... I wanted to like it, even going in. Shot obviously for very little cash, I looked past and told myself to appreciate the inspiration. Unfortunately, although I did appreciate the film on that level, the acting and editing was terrible, and the last 25-30 minutes were severe thumb-twiddling territory. A 95 minute film should not drag. The ratings for this one are good so far, but I fear that the friends and family might have had a say in that one. What was with those transitions? Dear Mr. Editor, did you just purchase your first copy of Adobe Premiere and make it your main goal to use all the goofy transitions that come with that silly program? Anyway... some better actors, a little more passion, and some more appealing editing and this makes a decent movie.","This film is sick. Did the writer even have an audience in mind? Apart from looking like something out of the 80's, the whole concept comes across as extremely amature and what's the point of that deaf woman having that obviously plastic 'demon baby'? I don't think I can think of one redeeming quality. The maturbating scene - need I say more? And the acting! - please susspend my disbelief even a little about being a wacked up creative author! Get creative or give up."],"review-user":["sallychester","nyberg","illi_checkover","jango-2","yashimo","willy-74","z-v","rundle-1","tessa-b","film_critic2002","mrjared27","stevenspielbergdirector"],"review-date":["5 February 2006","19 April 2003","8 April 2003","22 March 2003","18 May 2003","28 May 2003","12 February 2003","12 December 2002","27 August 2002","16 October 2002","9 October 2002","11 November 2002"],"review-rating":["8","9","10","10","9","9","10","8","10","9","4"],"review-title":[" Fun and life affirming\n"," A very good Brit rom-com, one to watch.\n"," We really liked this movie\n"," Very Good Brit Flick\n"," Love it or hate it\n"," Charming!\n"," Wow!\n"," What on earth are people watching!\n"," Very charming, funny, a lovely family movie\n"," Wow! What a lovely film.\n"," Ballot Stuffing?\n"," Oh dear!\n"]}