{"review-url":["http://www.imdb.com/title/tt0259932/reviews"],"review-text":["The actors seemed to be pretty well cast, and the plot twists were good. :) The ending is probably a little \"too pat\", but hey, at least there's justice in the world. And at the end there's a kind of revelation about how it all got started. ;)As a native to British Columbia, I want to say again how amusing it is that the movie was set in Washington state, but the whole film was done in Vancouver and environs, as well as having the Government of Canada logo prominently displayed in the closing credits as being a grantor of money for the film project. *grin*","A proof that it's not necessary for a movie to have a deep many-layered story and other sophisticated elements to be a good movie. Even if the story could be expanded in many directions, especially in more sociological way (people lust for money) it seems that it's perfect just the way it is. Through many sudden changes it takes the spectator to the end without any unnecessary complications and without letting the spectator taking the eyes of the screen. But the acting for me isn't so good. With the exception of Lindsey McKeon the others were average or even worst. In some scenes they just empty-stared in front of themselves. For exception of Lindsey which was more convincing. It's a really simple movie for just laying back and enjoying. 7/10","Despite the fact that this was a Made-For-TV movie (and an obvious one at that: ie., cheap looking), CLASS WARFARE left me wishing I could get my money back, and considering this lame production was partially funded through Canadian dollars, I might just be entitled.What made me sit through it in the first place was seeing actress Lindsey McKeon, who I've watched for the last couple years in her role as \"goody-goody\" Mara Lewis on the soap-opera GUIDING LIGHT, taking a turn at playing \"the bad girl\" for a change. Surprisingly she does quite well, as Kristen, a spoiled rich-b*tch who suddenly finds herself dirt-poor, but with a conniving streak, and a twist of fate, that will possibly change her fortunes back around.  The twist of fate is provided in the character of Richard (Robin Dunne), a socially-radical outcast who discovers that he has just gone from having nothing to winning $23 million on a lottery ticket.  Now, put Richard, Kristen, her jock-boyfriend Jason (Wade Carpenter), and their camcorder-obsessed mutual buddy Graham (Dave McGowan) together for the weekend in a remote cabin, cut off from the world by storms, and just guess what unfolds.The film suffers from congesting both the story and characters'personas and motives too much.  Everyone is pretty one-dimensional and it doesn't take a rocket-scientist to figure out that some things, and some people, are going to go very bad, very quickly.  I don't think this is that original a plot and it doesn't go out of it's way to make itself anything more.  The acting is OK, McKeon is spot-on as the manipulative female lead, and Dunne is very good, perhaps a little too good at times, but no one else is worth writing home about.  The only other real credit I can give the film is the one twist I didn't see coming towards the end (not the very end though, that one is so obvious it hurts).  Regardless, I sat through all of it and lived to tell the tale so I can't say it was a complete write-off.  4/10.  A \"something-to-watch-when-nothing-else-is-on\" type movie.","I saw this mini-movie when it first aired, and loved it!It kinda funny to see how far people will go for money.It's also funny to see how much a boyfriend can be \"Whipped\". \"Whipped\" enough to kill. I think the cast was great, especially the character Kristin.Without Her smooth talking,and deceptive looks the movie would have not been the same.I never use to watch USA but now it is one of my stations.","This was actually looking like a good movie before the final 10 minutes. But the end (the very very final scene, not the predictable final chase) blew it all. Won't give you spoilers but the ending really ruined the whole movie for me.Anyway, like others have said, Lindsey McKeon was very convincing. Most of the other characters were fine as well. Amber was a bit less convincing. But lousy script - and in the end it got the upper hand over the actors and director.So, skip this unless you have nothing important to do and you are ready to weather the silly end. Otherwise, just watch a Colombo or something.","Lindsey Mckeon smoking a cigarette was so sexy and the movie made me a fan of Lindsey McKeon the movie was so good I watch it 5 times and wanted to buy the movie and I will love to watch it over and over again 225 times to put how much I would watch it like the movie porky's and Lindsey is such a great actress and her movies are so good I will tell anyone read this review to watch this movie and see why I love it so much and why Lindsey McKeon is a great actress and sexy looking and watch her other movies and television shows and her time on the soap guiding light and enjoy her photos online and check out her internet movie database page like I did and enjoy all the stuff on the page"],"review-user":["DrConway","prepad","Squrpleboy","Bondgirl-9","felix-goldberg","lindseymckeonclasswarfar"],"review-date":["4 July 2001","18 May 2005","21 August 2003","17 July 2001","3 October 2011","6 November 2014"],"review-rating":["7","4","10","5","10"],"review-title":[" Good movie - some surprises, too!\n"," Fine made movie\n"," The Numbers Just Don't Add Up\n"," Totally Cool!!!!!!!!\n"," Passable but the end is incredibly stupid\n"," Lindsey Mckeon is smoking hot\n"]}