{"review-url":["http://www.imdb.com/title/tt0284837/reviews"],"review-text":["Ali G earned his fame on the small screen - though the big screen has not lost him any kudos either. Ali G Indahouse is a hilarious laugh-a-second fun fest - just like on the small screen. He has lost none of his character or stupidity at all, and behind all that - none of the film is brainless fluff either. A human side to Ali is revealed during the film, the idea of Ali G running for PM is a brilliant, fresh and funny one - and the incessant stupidity of Staines' gangster man is mixed well with the stern, harsh world that is politics. The film is also full of brilliant new characters - and instead of just interview after interview, we get a proper comedy film that never gets repetitive or boring. So why didn't I give it ten stars? Well, the ending was funny, but also botched and failed - none of it made sense. And in parts, the film became offensive in trying to be funny - but that's Ali G for you - if it isn't offensive, it isn't itself, and it is totally and utterly ruined. Ali G's big screen debut was a success in my belief, and should have got into the 6-7 average rating range on IMDb. But it could have got worse as well, and people are bound to have mixed opinions, especially on a film such as this.On the whole, Ali G Indahouse is hilarious British comedy at its best - and funniest, and most clever. A great job! 9/10","Ali G Indahouse has got to be one of the funniest films I've seen in a long time, and Cohen's portrayal of a British gangsta is hilarious. This film has cult classic written all over it, and it features some really great lines. Ali G Indahouse is a good-time party movie that will leave the viewer laughing literally from beginning to end. Definitely Vote Ali G and keep it real.","Sacha Baron Cohen is a genius. And this movie is good! Although the film doesn't nearly reach the quality of the tv-show, it's still very funny and has some seriously wicked moments! I've liked Ali G since the first time I saw the material from the show. I think he's one of the best comedy characters of all time.. up there with say, Peter Dragon (\"Action\") and The Blues Brothers. Biggest surprise with this film was that they've actually got some serious actors to do it (Dance and Gambon). After this I will absolutely respect them even more, for having the good sense to take this chance. I have nothing really bad to say about this film, it's very funny. Very juvenile, but hey, so what?! One more thing to mr. G: SEQUEL, PLEASE!**** / *****","The thing with Ali G is that he takes the mick out of himself and his character. The humour is very much a 'like it or love it' brand of totally politically incorrect, irreverent and self effacing type.Personally I totally love this film, and so has everyone i have met who has seen it. You can watch it several times and pick new gags up each time. The humour is both aural and visual, and the timing is impeccable. The humour is probably very English, and specifically London, so its possible that non-English viewers may not get some of the humour. Think of yourself as a teenager and you will love it - especially if the likes of Kevin & Perry Go Large tickled you!","As someone who usually despises Ali G, Ali G Indahouse was absolutely brilliant. When I was watching it, I was in a hysterical fit. Yes it is sexist, rude and extremely crude, and I loved it. As some comedies are only have one or two comical scenes, this movie was laugh-a-thon. I have never seen a comedy as original as Ali G Indahouse.For a comedy starring Ali G, this would be worthy of an 8 out 10. Absolutely Brilliant.","When most British TV comedies get given the big screen treatment they are usually terrible. This is one of the more successful attempts but is still no where near as funny as when Ali G was the telly. Ali G was hilarious on TV when he was interviewing unsuspecting politicians/scientists/vicars etc, and less so here in this cinematic adventure. It actually has a plot as Ali rises to become Primeminister of Great Britain! It has some very funny parts but not nearly enough of them, maybe its because Ali G has been around for about 3 years now and the concept is becoming a bit stale now. Although I loved the bit where Ali met Sacha's other comic creation \"Borat\", very clever and a nice pay off for fans of his TV show. ***6/10)***","I first encountered the Ali G character a few months ago in the American import of his interview show in which he sets up unsuspecting celebrities and creates comedy at their expense. Since they are invariably people who feed on public attention, it is entirely appropriate to feed on them once in a while. But it takes a seriously misleading, confusing and outrageous character to pull it off, and Ali G (Sacha Baron Cohen) does it. Cohen thinks funny; Ali G is a hugely funny creation, in much the same way that another wild and crazy guy, Andy Kaufman, invented unforgettably outrageous characters. \"Ali G Indahouse\" is Ali G to the third power, cubed. The plot is suitably improbable, offering an appropriate springboard for the Ali G craziness. I laughed till I cried. The plot twisted around and ended happily, and there wasn't a cliché that wasn't ragged on or a convention that wasn't exploited, and at every turn, the absurdity of the Ali G persona looms over all, ragging on itself and painting everything with its humor. I like the fact that Ali G is a white middle-class guy who has become a hip-hopper and gone native with it. In that way it's about re-creating oneself and then bumping up against conventional reality, which results in absurdities and humor, some attributable to the pretense of the invented persona and some to the ridiculous conventions it scrapes against. It could be a stretch and unfunny. It works and knocks 'em dead.Let me now back away from over-analyzing something that looks uncomplicated and isn't, but is hugely funny, and deserves just to be enjoyed. Roll with the humor of that crazy dude. He is a classic. Doug Wilson","STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsMovie adaptations of TV shows,books or magazines are rarely very good,but Ali G Indahouse is one of those pleasing exceptions to the rule.The set-up for the comedy has the local authority closing down the community centre where Ali works and him going on hunger strike outside the Houses of Parliament.When Prime Minister Michael Gambon decides he needs someone young and hip to gain a wider appeal to the activites of his party,Ali is just the man for the job.Ali introduces his 'Keep it Real' policy,to the anger of Charles Dance's dastardly right-hand man who's planning to build over Staines.The frank honesty of Sacha Baren Cohen's character and the clever satire enterwine beautifully together.Big up yourself and go see this movie.****","... and if you do too then you should watch this film. If you're a fan of Ali G then this film is definitely for you. It is very funny - Its probably not as funny as the TV show or the video as thats where Ali G's stupidity is in its element. While it wont go down as a great British movie, it definitely is one of the better ones and funnier than some more high profile movies, it is still very funny and childish. 7/10","I used to love Sacha Baron Cohen`s creation of Ali G on THE 11 0`CLOCK SHOW in the late 90s . I also liked the spin off show though it should be pointed out by then the joke was wearing thin and it was obvious his guests were in on the joke of having a white boy impersonating a black ghetto boy wannabe . When ALI G INDAHOUSE was released I didn`t bother to see it because Ali was probably past his sell by date then . But my brother bought me the video of this film and watched it on Boxing day and I must confess it was a lot better than I expected ALI G INDAHOUSE is a very funny if you understand the \" Wigger \" culture of middle class white boys wishing they were black . I was laughing out loud at the first half of the film as Ali lays down the facts to his posse that wearing the wrong colours in the ghetto could cost you your life , and Ali on the election trail had me in absolute stitches as he drove down Staines high street giving a rap broadcast , but then the film goes slightly downhill as an extremely unlikely political plot takes shape and the jokes slow down So all in all ALI G INDAHOUSE is funny but slightly uneven . I still watch the video a couple of months after getting it but only the first half . It`s a lot better than getting socks for Christmas so thanks for the video Neill","If you are a fan of smooth, hip talking or just a bit of hip hop, then you'll like this film, as for everyone else, you can enjoy Sacha Baron Cohen as the great Ali G. Borat (Cohen) also appears, but his own film is much better. Basically, Ali G lives in the West Side of Staines and is protesting about his Leisure Centre closing down. So he decides to join the Prime Minister (Sir Michael Gambon) and his nasty assistant David Carlton (Charles Dance) in parliament, hence the title, Indahouse. Also starring Kellie Bright as \"me\" Julie, Martin Freeman as Ricky C, the fit Rhona Mitra as Kate Hedges, Tony Way as Dave, EastEnders' Nabil Elouhabi as Jezzy F and Ray Panthaki as Hassan B, Naomi Campbell, newsreader Jon Snow, EastEnders' Rudolph Walker as President Mwepu, and Richard Madeley and Judy Finnigan. Ali G was number 8 on The 100 Greatest TV Characters, he was number 6 on The 100 Greatest Funny Moments, along with Borat at number 24 (and Bruno at number 77), and he was number 6 on The World's Greatest Comedy Characters, with Borat at number 17, and Sacha Baron Cohen (or as the character) was number 12 on Britain's Favourite Comedian. Good!","IMDb mark: 7What a fun film this is! Especially the beginning... 'Ali g Indahouse' has got to have one of the greatest, funniest intros ever! Even the opening credits are hilarious. But you have to be open-minded. This movie certainly isn't for the people who move their heads disapprovingly when they see you purchasing prophylactic wrappers. Getting back to the movie, this film is likely to offend not only older people but women, too. So, it is fairly obvious that the movie is intended for a restricted audience.-Humour: There is more than a fair share of swearing in this movie. There are more than a few sexist remarks in this film. And yes, they are extremely funny. But there are even a few very funny lines that aren't sexist or obscene. 25/25-Physical Comedy: Sacha Baron Cohen is the one who provides nearly all of the funny stuff in this film, but he does it really well. He finds himself in predicaments and tense moments throughout the whole film, and some of his reactions are priceless. 17/20-Plot: The plot is very far-fetched. One of Britain's party leaders decides to use a stupid young man he sees outside making a fool of himself in his plot to overthrow the Prime Minister. But that young man isn't just anyone, he is street tough Ali g, who is one bad dude. 6/15-Ending: I didn't think the ending was too great. Of course, taste varies. 4/10-Theme: Not all people can be judged by their exterior. 9/10-Nudity: There is no nudity in this film, although there are a couple of nude pictures of some unknown women briefly shown late in the film. 0/8-Cast: I hadn't heard of Sacha Baron Cohen before seeing this film, but apparently he is better-known in the United Kingdom, having his own series, 'Da Ali G Show'. Other somewhat famous actors in this movie are Rhona Mitra and Charles Dance, and there is a cameo appearance by Naomi Campbell. 2/8-Genre: This is a comedy. 4/4-->Overall: 67/100It's so nice and refreshing to see a good sexist, lewd comedy among this bland sea of chick comedies. Since 'Married... with Children', I haven't laughed this hard while seeing a new comedy. From Swordlord, 2 swords up!","My god how bad this is. Who is this impostor pretending to be Ali G? Avoid this at all costs. It replaces the smart multi-layered satire and humour of his show with down and out toilet humour.This was obviously an attempt to get him known in the States before he released his show there on HBO.One commentator here pleads that we not judge the movie on the merits of the show due to the difference in the mediums. While it is true that the standard format of the show could never have been transferred to the big screen Mr Sacha Baron Cohen could have ensured the smart use of his comic style in a more conventional movie storyline. Instead we have this mess, which in all honesty has nothing at all to do with Ali G except for the packaging.Terribly disappointing. Go seek out the DVD's of Innit, Aiiii, or Bling Bling for some real Ali G.","As a fan of \"Da Ali G Show\" on HBO, I had high hopes for this film. I should have known better when it went straight to video.... and then none of my local video stores carried it! The problem with this film is it simply tries too hard. I did not not want to see the Ali G character in his home environment or running for parliament or saving England. In my opinion, the \"Ali G\" character only works when he is operating OUTSIDE his environment --- so we can laugh at how unbelievably stupid he is and laugh even harder at the frustrated, often angry reaction his sincere stupidity arouses in all those unfortunate to encounter him. This movie bombs horribly due to the throwaway script, and as a result, it is an interminable exercise in sheer boredom with maybe 3-4 genuine laughs to be had in TOTAL. I well and truly HATED it from frame one and it just NEVER got any better (despite crossing my fingers and gritting my teeth). I think Sascha Baron Cohen has talent (his TV show proves it), but this movie shows absolutely NONE of that talent.","I have to admit that I love \"Da Ali G Show\" and purchased the first season as soon as it came out on DVD. So when I heard Sacha's movie was being released on DVD as well I wanted to rent it right away. One could say I had very high expectations as he is an extremely funny comedian so it was to my dismay that when it came time to actually watching the film it was complete and utter crap (for lack of a better term). I laughed probably 3-4 times tops throughout the whole duration which is pretty pathetic considering the main actor's potential. I mean I was well aware that it obviously didn't have a stellar budget but it still had so much more potential that it just couldn't live up to I guess. I was even more disappointed when I came to the realization that Mr. Cohen was actually one of the co-writers of this piece of garbage too because if he didn't help pen it then he could be considered less liable but once again to my chagrin...not in this case. I have seen a lot worse and I'm thinking I'm only being so hard on it since I went in with such high hopes but there are a handful of laughs, however don't act surprised when you find out it's nowhere near as funny as his TV show!Final Slant:Movies: I would've cried if I blew that much money on this!!DVD Purchase: I was tempted just to buy it first since I figured it'd be so good anyways...thank God I chose against this!Rental: Only if you're a big fan of Sacha's and can't get enough of him.","Ali G was funny at first. His interviews were fresh and original. The idea of a mock gangster wearing OTT clothes and using street wise lingo was appealing at first.But this film is just a rehash of old jokes, the humour was mainly childish and revolved around the male sex organ for the most part. The film claimed good actors like Charles Dance, but their talents were wasted as they played silly 2-d characters. It is not 'terrible' but isn't really funny at all a second time. It could be said that the movie was Ali G's last bastion of comedy. After that he ran out of steam.","This is actually a quite lame comedy with some extremely childish humor but it all still somewhat works out due to the presence of the legendary Ali G character in it all.Even though this movie has basically nothing to do with the \"Da Ali G Show\" the character still works out as well in this movie. It's of course a ridicules and outrageous character but he's all the more hilarious because of it. It's obviously a satire on the whole rap and hip hop scene and it's still Sacha Baron Cohen most legendary character, despite the successes he has had with Borat and Brüno.The movie has some very childish humor, which mostly is about sex and it has an almost non-existent story. It's just the kind of movie in which the story really doesn't matter. It's all purely about the main character. Even the lamest and most predictable movie in this movie will still surely make you laugh a couple of times. \"Ali G Indahouse\" is not the most hilarious movie ever made or the best thing Sacha Baron Cohen has done in his life but it's good enough for a couple of dumb silly laughs. Still the movie gives you the feeling it has more misses than hits in it but jokes are bombarded at you so fast that you just tend to sort of forget the movie its weaker moments and enjoy the movie its more funny moments.Quite amazing actually that respected actors such as Michael Gambon and Charles Dance appeared in this type of movie. Or perhaps they knew of Ali G's success and just wanted to be a part of it. Still I feel that when looking back at it they won't regard this as their finest moment.Good enough for a couple of dumb laughs.6/10http://bobafett1138.blogspot.com/","Funny movie story about the successful character created by Sacha Baron Cohen who in his interviews succeeded in bursting the pomposity of many an unknowing victim. Unfortunately, after a while everyone knew who he was and the element of surprise was lost. A movie seems a logical progression.When news of the movie was first leaked, people speculated as to what the story would be. It would involve Staines that much was clear, so it was interesting to see Ali becoming the MP for Staines.It's a sign of how well the character is regarded when one considers the calibre of the actors involved. Hats off especially to Charles Dance, particularly for dressing up in the short leather skirt at the end.Since I live in Staines it was interesting trying to spot the many familiar places and also the changes in the town since the movie was filmed. In fact it is said that this movie was responsible for the rejuvenation that the town seems to be undergoing.For the most part the movie delivers it's laughs, although personally I've always found Cohen's other character, Borat, painful rather than funny. Still this is only a small gripe.If you watch carefully in some of the scenes you can see building work in the background. This was the new Staines cinema, and on the day it opened I saw this movie there.In summary, an amusing movie debut for a great character.","Being American, I have not been exposed to this character before, which is good because some of you have been disappointed. I have nothing to compare it to. I have found no enjoyment in the mindless idiot humor in the American teen movies, and although this is a slightly similar type  of humor, I couldn't stop laughing. I hardly ever laugh out loud at a movie. And usually a movie has a few funny parts for me, but this movie was funny from start to finish. My only disappointment was when it was over. I'm actually going to buy this on DVD when I find it.","Wannabe rude boy Ali G (Alistair Leslie Graham) teaches a class for scouts at his local leisure center to help them get out of the hood (Staines) although he knows in his heart that some won't make it to 11.  When he finds the Government is due to shut down the Leisure Center he begins a protest that brings him to the attention of David Carlton, the Chancellor of the Exchequer.  Charlton helps him run for office in the Staines by-election, however he is actually planning to uses Ali to make the Prime minister to look a fool, resign and then Charlton can take his place.  However Ali's `Keep it Real' campaign seems to catch on and is more successful than expected.As with most TV  film conversions, this isn't high art, but it isn't rubbish either.  The story is daft and actually gets in the way of Ali the character.  When things actually need to happen to move the story along it feels a bit forced but when Ali is allowed to be the focus of the scenes it is funny.  The humour is of two types  the humour of the white boy trying to take on black culture and live in suburbia as if it was the hood, while the other is dirty, rude or crude jokes.  Both are funny for the most part, however extending Ali's character to create other characters isn't very good (they can't do it like he does it).If you're an Ali G fan then you'll probably like this (but may see him as being dumbed down from his normal job of making politicians look stupid). If you like dirty jokes and toilet humour then you'll love this.  However outside of this you may just think it's rubbish (and you might be right). It's sexist, dirty, puerile, childish and silly  but when it hits (as it mostly does) it's very funny.  It also has lots of women for Ali to ogle  although his character is developed enough for us to believe he really does like Julie and is just stuck in character.Sacha Baron Cohen is really good and has added layers to his character to make the leap to film.  He also allows many of the jokes to be on him and does it well.  Freeman is poor and just goes to show how good a creation Ali G is  not everyone can do it!  Charles Dance is OK  but when you see what he has to do at the end of the film then you'll probably agree that he should have passed on this.  Same with Gambon really  although he doesn't sink to Dance's depth.  The rest of the cast are TV level and suffice  special mention goes to the actress who played the Chancellor's secretary (I forget her name).how hot is she!Overall it's rude and childish, but if you like that type of thing or are an Ali G fan then you'll laugh really hard plenty of times.  If you have any morals at all then you'll probably find it all a bit of a waste of time..I laughed the whole 90 minutes!","For some reason Sasha Baron Cohen delivers an incredible performance in TV shows that make you laugh. Yet, the moment the same story goes to the big screen it becomes almost idiotic. Ali G Indahouse is the first of those attempts and the weakest of them all, preceding Borat and Brüno.What you've seen in Da Ali G Show is more or less translated to the cinema format, but there is one important thing missing. A rather strong socio-political message underlined the TV show, in particular the season(s) filmed in the US. None of this is to be found in Ali G Indahouse. The movie resembled Scrubs with adult jokes in a feature film.","Well alongside his fame and fortune Sacha Baron Cohen has also managed to achieve such a high level of notoriety with his urban character, that the actual town of Staines changed its name to Staines-upon-Thames to get away from the negativity. That's pretty impressive Mr Cohen, you made an English town change its historic name, is that funny?.Like many TV characters that have reached the big screen this whole thing feels padded out, forced and struggling for material. Unfortunately this is no different despite being a brilliant and popular creation by Cohen. I think it was a bad choice to go down the actual movie with a plot route as we all know this character like all of Cohen's characters works better when lampooning reality. Seeing the highly naive and thick Ali G trying to strike a conversation with a real politician about current affairs only for him to lower the tone and go off on completely random filthy tangent is what its all about. Hearing Ali comment on his bitch 'Julie' or his various friends from Staines and the things they get up too is amusing to listen too, but to actually now see these people spoils the myth as it were.Of course the biggest draw with Ali G is the highly accurate satirical mocking of young British teens (black and white) who imitate the American rapper gang culture. This is the crux of his laughs, his not so secret weapon, talking with this modern day slang cum multicultural cockney hip-hop dialect that is frankly cringeworthy to listen too when anyone speaks with it, especially white folk. Add to that his heavily Jamaican/Afro American/UK chav influenced streetwise attire with bling, tracksuits and big trainers and you have a great controversial character ready for upset public figures.Thing is all of this is completely lost in the film because there is none of that, its just a silly bland plot about Ali trying to save a community centre in Staines. There are no funny clever stinging moments because its a scripted movie, instead they must rely on childish toilet humour which only works part of the time, its immediately unoriginal and loses all credibility. Coupled with the fact the cast is made up of big names merely sinks this project even further, big names equals no risks, no proper laughs, no awkwardness or embarrassing moments, its all played safe which is not what Cohen and his creations are about.Now I would be lying if I said there were no funny moments in this film, there aren't many but they are there. For me personally the best and most recognisable lampooning of my home country would be at the start of the film when Ali is 'street racing' in his hyper modded Renault down the high street. This very short sequence is extremely amusing because of the stringent UK road laws and the fact we have to drive at 20-30mph everywhere. Watching these two uber modded cars crawl down the high street at 30...pulling up sharply at the 20mph speed board is hilarious, literately the best bit in the film.Its actually reasonably funny during the start of the film whilst Ali is within his home territory of Staines and his mates. After that as we follow him to Westminster it just loses any fresh comedy hopes and becomes so derivative, the character of Ali G does grow somewhat but only in the wrong way. Instead of the chavy boorish dunderhead we all know and love we end up with some Americanised superfly looking pimp that just feels too much of a stretch even for this character. We all know about the typical UK traits that Ali G represents, we all roll our eyes at the image he portrays because we all see it in our daily lives, that's why its so funny. If you take that away and go down another countries cultural route then your target audience won't relate to it anymore, simple as that.In the end this film has just gone too far over the top with the character and its just not funny. Had it been a mockumentary style flick like 'Borat' then it would have worked I'm sure, but this option doesn't. Its basically puerile with dated stupid visuals gags and must resort to showing Charles Dance in drag to try and raise a laugh, and it fails at that. Such a huge huge error for the direction of this film that has resulted in a very very average outcome.4/10","Sacha Baren Cohen has created a masterpiece that will be loved by audiences all across the globe! The film has some great one liners that will keep you laughing until it hurts. I have the film on DVD and have watched it at least 10 times, and it never seems to get old! It is quite cringe-worthy in some places but that's what makes ALI G so lovable and this film so brilliant. This is outlined in how it grossed over 10 times its budget and the music in this movie is just brilliant too! This, along with Borat are Sacha's best works and he deserves all the credit that comes his way. The girls aren't have bad in the movie and the films all round display should be admired!","Before there was Borat, there was Ali G.Released in 2002, \"Ali G Indahouse\" was the first of three films featuring the three characters from Sacha Baron Cohen's TV series, \"Da Ali G Show\"--the other two films being 2006's \"Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan\" and 2009's \"Brüno.\" Unlike the latter two films, which used the unscripted man-on- the-street format of the TV show, \"Ali G Indahouse\" suffers from using a script.The story is mostly contrived. Alistair Leslie Graham, who goes by his wannabe name, Ali G, is a white kid from the London suburb of Staines who wants desperately to be black. He lives with his grandma and has a girlfriend he calls Me Julie. When the government threatens to close down the center where he teaches a group of boy scouts how to be gangstas (scenes of wasted comedic potential), Ali G goes on a hunger strike outside Parliament to protest. The hunger strike quickly ends when the reporters covering the event tempt him with some KFC. Ali G is then recruited by a conniving Member of Parliament, David Carlton, to run for the representative from Staines. Carlton's plan is for Ali G to fail miserably, embarrassing the Prime Minister (Michael Gambon, Dumbledore from all but the first two Harry Potter films), causing the PM to be ousted in a no-confidence vote, clearing the way for Carlton to become PM. Contrary to Carlton's plans, however, Ali G proves to be wildly popular by \"keeping it real.\" The PM's approval rating soars, and Ali G becomes the PM's adviser. Of course Carlton isn't going to sit by idly while this happens.The movie falls back on lazy, juvenile humor. Most of the jokes are stillborn and fall flat. What made the TV show so wildly funny--playing off the character with interview subjects who weren't in on the joke--is completely absent from the movie. The movie does have some good moments, such as when Ali and the gang break into the PM's residence and have to break dance through an \"Entrapment\"-inspired security system criss- crossed with laser beams. And there is some funny commentary on modern society, such as when Ali has to clarify over the phone an indecipherable message he texted in shorthand.But without an unwitting victim, Ali G just isn't very funny. Luckily Cohen learned his lesson from this film, and stuck to the format that made his show so funny in the inspired comedy \"Borat.\"","By convincing the Prime Minister to back the totally unsuitable Ali G as a candidate for Staines in the local elections, nasty chancellor David Carlton (Charles Dance) hopes to discredit his party's current leader, thus enabling him to seize power. To his surprise, however, the plan backfires, Ali is embraced by the nation, and Carlton is forced to find other ways to try and guarantee his political future.Puerile, crude, misogynistic, and always outrageous: Ali G Indahouse, the big-screen debut outing for Sascha Baron Cohen's middle-class Berkshire gangsta, is all of these things and much moremeaning it's my kind of film!!Obviously, there are those who are simply not going to get the joke, and there will definitely be people who find risqué jokes about oral sex, homosexuality, recreational drug use, hardcore pornography, and The Queen's nether regions offensive in the extreme (needless to say, they should stay well away!), but if you find such juvenile humour side-splittingly hilarious, are a fan of Baron Cohen in general, or just want to see hottie Rhona Mitra in her underwear (and you shud, cuz she iz well fit!), then I fully recommend spending an hour and a half in the company of Ali G and the West Staines Massive.They iz wicked!"],"review-user":["general-melchett","bussgirl","ichabod81","highslayer","rohan_g","LuboLarsson","douglaswilson","davideo-2","mysterywhiteboyisme","Theo Robertson","jboothmillard","Ii_fut_in_gura_pe_stelisti","DeviousMrBlonde","Logan-22","frankwhat","Jakethemuss","Boba_Fett1138","john_oneill41","trefluff","bob the moo","dragokin","phubbs","aaron-thandi","dustinkdye","BA_Harrison"],"review-date":["17 October 2006","28 March 2003","22 January 2003","24 September 2004","3 May 2003","5 May 2002","23 October 2004","4 April 2002","8 December 2002","4 February 2003","15 June 2005","27 May 2004","7 May 2003","3 November 2004","3 November 2004","15 May 2005","7 October 2008","7 May 2005","29 July 2002","26 March 2002","6 April 2015","5 April 2014","6 September 2013","28 July 2013","1 January 2009"],"review-rating":["9","8","8","10","8","6","6","6","1","1","4","3","6","10","3","4","4","8"],"review-title":[" Ali G loses no effect on the big screen - a hilarious comedy!\n"," Potter, Ali's better dan you\n"," All here: Aight, Booyakasha, wicked, Respect!\n"," A laugh a minute\n"," This movie was laugh-a-thon\n"," Quite good\n"," A crazed hoo-hah that will become a classic\n"," Riotously funny\n"," I have a sense of humour\n"," Better Than Socks\n"," Ali G Indahouse\n"," Je m'appelle Ali. J'habite in Staines.\n"," Indacrapper\n"," Ali G Gets No \"Respek\"\n"," Expected Better\n"," flogging a dead horse\n"," Quite bad actually, if it weren't for the Ali G character.\n"," Good film debut for Ali\n"," funniest movie I ever saw\n"," Childish, crude and lacking the core of humour that made him funny originally  but when it hits, it eye wateringly funny.\n"," a sub-par adaptation of the TV show\n"," Ali G Indahouse\n"," Timeless.\n"," Ali G suffers by having a script\n"," Restecp.\n"]}