{"review-url":["http://www.imdb.com/title/tt0209489/reviews"],"review-text":["this particular title is very interesting. the whole movie was like watching a ninja RPG, which is really cool. three magical swords, three clans, a horrible demon, a political power, yotoden has it all. the animation is decent, but a little grainy, the story is top notch, and the fight scenes are real cool. one thing that really looks good in this movie are the monsters. they are pretty freaky. if you liked blood reign and ninja scroll, yotoden is the one to see.","After reading more than my fair share of reviews for a vast number of different movies I have noticed a certain trend, people judge to harshly on what the expected to see.  I figure if you go into a movie open-minded not expecting anything certain than you will have better feelings towards it then if you try and watch but have pre-created standards you want it to reach.Since I try not to be hypocritical I watched this movie with a very clean slate and open-mind, and was very much pleased.  Since it is not a mainstream title or award winning for that matter I did not know quite what to expect, but in all truth I enjoyed it a good deal more than Ninja Scroll. Lovely animation, deep story, and the always joyful ninja hack-n-slashing combined extremely well to one of my personal favorite animes ever made.I am not promising that you will enjoy it, but just give it a chance and you may come out with a pleasant surprise.\"Before speaking, be sure of what you will say will be more beautiful than the silence\" - Chinese proverb","The animation is good, but not too good. Not bad either, but a little grainy. The plot is complex, but not really thought through, and it is not conveyed in an edible manner. Things happen too fast, characters all look alike and you don't know where they came from and why people care when they die. The fighting scenes are decent, but I think they used too much of that \"slow motion after the sword hits\" which actually doesn't show anything, just the spurts of blood.Watch it if you want to be sure you see all Japanese anime with ninjas :) but other than that, don't bother if you have something good to watch.","The Yotoden feature isn't really a film. Well, it's not how Yotoden was ever intended to be seen, anyway. In the UK Yotoden has been released in it's original OAV format, in 3 one hour parts. In the US however, aforementioned series was bought up, edited down to 90 minutes, removing most of the story segments in favour for the series' admittedly brilliant battle sequences. What story was left was turned into gibberish by an unintelligible dub, and the rest is history.Yotoden is one of the better Anime series to make it over here during the 80s. Bubblegum Crisis it ain't, but when you think that BGC aside, the era it's from was typified by Robotech and Fist of the North Star, even the American feature version looks quite solid. The story is reasonably strong, never over-egging itself too much but keeping dramatic tension high regardless, and the character design and animation is inventive. Many reviewers have commented on it's similarity to the better known Ninja Scroll, and this is a fair comment, but the extra restraint Yotoden shows makes it a more subtle and satisfying watch than Ninja Scroll.Still, it has it's down points. The ending is both anticlimactic and slightly annoying, the main character actually gets to do very little despite apparently being 'the only one who can stop this disaster' etc etc, and the movie is showing its age much worse than some of its peers, perhaps because of its rigid attachment to the constraints of the ninja genre. If it mixed it up a bit more, Yotoden would come out of enjoyable and into great, but it just doesn't manage it. Also, the American voice actors don't really fit too well with their characters, and the story in the half-length version is butchered so badly as to make the series incomprehensible.If you can track a full unedited version down, add two points to the above score, and check it out. However, as it stands, there's not enough going for the US version of Yotoden to really recommend it over other more coherent films like Ninja Scroll or Shadow Skill. Yotoden in it's original form is a great sleeper hit from the 80s, but getting your mitts on it will be very tricky.","After having spent a lot of my youth watching such movies, I found this one very easy to follow in both the unedited and cut versions, (Although the story has much more to hold it together in the unedited version. Unlike Ninja Scroll this movie hit a much more serious note and i think that's where it hit me. The animation while grainy is very original, and I just love the way artists in that year stressed shadows to show different emotions. I think the story is perfect. The beginning of the movie really hits hard and as the movie progresses you get the feeling that you're going along in this adventure with the characters. As they meet, become allies and find out the their greatest strengths, a lot of heart was put into this.","I really liked this one.  (SPOILERS??) It had a really good plot, the main female in this movie is really kewl.Despite the fact that she's the only one left alive and her lover dead, it seemed to be much like Ninja Scroll.  Another kick ass movie. ;)Watch it in japanese with subtitles.  I don't know where the idiots who learned to speak english are, but for some reason all dubs get an F in translation techniques.  The subtitles are more correct.\n9/10Quality:  7/10 Entertainment:  10/10 Replayable:  9/10","This movie stinks majorly. The only reason I gave it a 3 was because the graphics were semi charming. It's total disregard for a plot and the lack of even insubstantial surface character development made it seem like just a bunch of nice drawings. This is by far THE worse anime that came out of Japan. I can't believe they actually put their names on this garbage. What a rip off selling this thing for $20. If you haven't seen this don't bother. If you have, I pity you.","I'd have to agree with the previous reviewer: This film has awesome animation, but has problems throughout the rest of the movie.Plot holes are huge, dialog barely explains the concepts of the plot--the MAIN PLOT POINTS aren't even fully explained until the last five minutes of the film. The characters state the obvious, while failing to explain the more confusing points of the film. There are characters that pop up and have importance in the storyline that are never explained--most of them have names that are only mentioned *once*, and it is exceedingly confusing to a viewer.Don't waste your time with this movie. Unless you are in it for a good laugh and how DUMB it is.","Well OK, I've seen Wrath of the Ninja.It isn't something that I would recommend to people who aren't seriously into japanese fighting movies. This is a sort of japanese fighting ninja movie, with a complex plot. It's about these 3 old ninja schools that had these 3 \"Swords of Sorcery\". I saw the subtitled version (NOT recommended by the way, it's easy to miss something) and I didn't really keep up with it all. It had some good scenes tough, but in general, it wasn't much to my liking.","It's perfectly ok that people dies in an animation, but there are just way too many death in this one.  Start from the very beginning, the story is all around battles, fights, death, and revenge.  It goes on and on for entire one and a half hour.  It was interesting at the beginning, but I grew very tire after before the show was half way through.  Unlike other animations, this one is lack of humor.  There are not many interactions between the characters either. The good thing about it is the sword fight scene looks pretty good and the characters look nice."],"review-user":["GreyFox37","extremezero","siderite","Zombified_660","jd-348","PatrynXX","Spidey-18","inkytwist","Anaythea","yy15"],"review-date":["23 February 2001","13 February 2001","26 May 2005","30 April 2006","7 December 2007","28 August 2001","19 October 1999","6 August 2005","10 June 2002","10 June 2000"],"review-rating":["9","9","5","5","10","9","3","2","3","4"],"review-title":[" It's like an rpg\n"," One of the most un-credited great films. . .\n"," Average anime, nothing special\n"," If you can find the original, worth a look, but avoid this re-edit like the plague.\n"," A classic\n"," This is one of the better japanimation movies out there.\n"," Oh the horror.......\n"," Not very good at all.\n"," Good if you like ninja movies.\n"," Too many death\n"]}