{"review-url":["http://www.imdb.com/title/tt0244870/reviews"],"review-text":["A town in Japan is being taken over by a horribly brutal abstract shape: the spiral.  It's becoming a theme in everything from animals to clouds to people and twisting them, mentally and literally.  This film shows it happening to several groups of people.  Some demonic possession is implied, but nothing is entirely sure except that the best bet is to get the heck out of dodge.  The film progresses really well from normal life to abnormal phenomena (giant snails and crazy people) to the truly supernatural (walking dead).As a jaded American horror movie fan, this was just what I needed.  Maybe it was just the novelty of a different culture's film, but it seemed to have a very original progression, set of characters, and the premise was definitely new.  The Japanese may think \"horror shapes\" (uzumaki means \"spiral,\" I'm told) are old by now, but it was nice for me because I'm used to monster/alien/virus/disaster/undead films.  In an American movie, you know who's going to die (the annoying/nasty/lascivious/racist characters) and who will live (the children/heroine/dogs/cats/nice guy).  That's not true in Japanese horror.  It was not predictable how they would fight the evil or how it would end up.  Also, it had this really new (but probably typically Japanese) color leached Pacific Northwest style cloudy day thing going, which was a fresh visual effect for me.  The horrific moments were seriously creepy, relying on a little gore but mainly just impossibly overdone facial expressions (think The Ring) and body manipulations.  This should be one of the greats, up there with once-original ideas like the first Nightmare on Elm Street or Night of the Living Dead.","The residents of a small island community are slowly becoming obsessed with spirals. Young schoolgirl Kirie first notices this strange behavior when she comes across the father of her solemn boyfriend Shuichi videotaping a snail, lost in a reverie. Soon, other people begin to manifest the same strange obsession. A boy leaps to his death from a spiral staircase with a smile on his face. Shuichi's increasingly weird dad starts a spiral collection and throws a fit when they run out of spiral fishcakes for dinner. When he commits suicide by spinning himself to death in a washing machine, the investigation begins. Don't waste your time trying to fathom the mystery behind Uzumaki, just enjoy it. Or, if you must, take the few vague clues that the movie provides and come up with your own theory behind the spiral madness. References are made to an ancient cult of serpent worshippers who spent a lot of time at Dragonfly Pond. Spiraling stormclouds are seen to touch down at said pond, where a beast-god may once have lived. Offerings of ancient mirrors are unearthed from the bottom of the pond...but none of these facts are ever tied together and handed to you with the words \"Reasonable Explanation\" printed on the wrapping paper. It doesn't really matter anyway. As the spirals consume the cursed island, the amazing visuals rule the film: bodies twisted into tight circles, hair coiled into gravity defying spirals, eyes spinning like whirlpools, people transformed into snails. It's as though Lovecraft penned a slightly disgusting comedy, and the film feels very much like the manga comic on which it was based - colorful, exaggerated and silly, but also sick and disturbing as well. This is a beautifully shot and well acted film with some stunning effects. If you're not the type to concern yourself with sensible details and neat story lines, you may just enjoy the sheer weirdness of Uzumaki. It's a comic book come to life. Seven out of ten stars.","Uzumaki is an entertaining film for any horror fan. True, cultural differences between Japanese and American perceptions create some difficulty in fully appreciating the horror aspects. I found some of the film slightly funny instead of scary; but it is captivating nevertheless. I believe that if I were to view more films of the genre I could fully appreciate the intent of this film, because it is skillfully done.  There are subtleties that I perceived, but that did not fully impact me. I hope to see the film again soon.  One reviewer lamented the want of a DVD that we can all play on our equipment. I must concur that it's a shame, because this is a film I would love to own. The little lead actress is compelling and quite adept. Her delicate and minute facial expressions mirror her dialogue well, and this comes across even with the subtitles. I think her performance is what kept me intrigued with the film long enough to really get into it and keep watching. I recommend that if you are a horror fan, and see this film playing, take the time to see and enjoy it.","\"Uzumaki\" takes place in a small Japanese rural town,where people are going mad.They go nuts over vortexes and spirals.The crisis is getting worse,because people are turning into snails and vortexes appear everywhere.\"Uzumaki\" has to be one of the most bizarre and original horror movies I have seen.The plot is really clever and the gore scenes are really funny as the film doesn't takes itself too seriously.\"Uzumaki\" is wonderfully photographed and the use of colors is top-notch.The characters are likeable and there is enough shocking surprises to satisfy fans of Japanese horror.Despite of some hilarious scenes,the overall tone of this film is pretty dark.\"Uzumaki\" is not as good as \"Ringu\",\"Ju-on\" or \"Audition\",but if you like Japanese horror movies you won't be disappointed.7 out of 10.","Hypnotists can use a rotating spiral to send their subjects into a trance; director Higuchinsky risks achieving the same result with his dreamlike horror movie Uzumaki, which makes very little sense and crawls along at a snail's pace.Fortunately, just like the many spirals that proliferate the film, Uzumaki is extremely twisted stuff and, with its impressive visuals and creepy atmosphere, should prove intriguing enough for fans of bizarre Japanese cinema to resist falling asleep.Eriko Hatsune plays pretty schoolgirl Kirie Goshima, who comes to realise that her home town has fallen under the influence of spirals (that's right, you read correctly.... spirals). Members of her community are becoming obsessed with the shape, which results in some downright strange behaviour and even physical transformation: there is a spate of suicides, a man loses control of his eyeballs, a girl grows medusa-like gravity defying hair, and people even turn into snails!The film is split into four chapters—Premonition, Erosion, Visitation, and Transmigration (although these titles do nothing to help explain what the hell is going on)—and each is weirder than its predecessor; by the end of the final chapter, almost nothing has been resolved, but viewers will at least have been treated to some very memorable scenes of Asian weirdness, a couple of unexpected, gory deaths, and some subtle subliminal whorls hidden amongst the action to keep sharper-eyed viewers happy.5.5 out of 10, rounded up to 6 for IMDb.","After reading a review of this film on a Ringu site I just had to get it and I managed to get an import once I got a multi-region DVD player and I don't regret it! A very quirky little film that follows Kirie a cute school girl in a small town in Japan where strange things keep happening, spirals appear in strange places and people take on obsessions with spirals which eventually drive them to their deaths. There's little spirals through the film, you just catch in them out of the corner of your eye, others are bigger and more obvious. You never really find out what's going on, but it's a great little black comedy-horror :)","I've seen a fair few films from the Far East recently.....some were excellent (Battle Royale, Infernal Affairs, the Eye), and some were not so great (Versus, The Triple Cross). Then there are ones like Uzumaki and Returner, which while flawed I still enjoyed.The basic premise involves the mysterious and horrific effects that a growing obsession with spirals has upon a community. Sound silly? Yeah, thats what I was thought. Firstly, the good stuff. Direction was top notch, sure a bit over the top in places but never the less interesting and stylish. Secondly the story, was original and like other writers commented very lovelace-esq...it was interesting. What it reminded me most of however was early Cronenberg; films like Shivers and Videodrome.The acting wasn't great, but not too horrible either. To be honest I was actually bored on a few occations....I felt the pacing especially initially was a little slow. My main problem was that it was too silly and funny to be true horror, and yet not so enough to be considered a comedy. *SPOILERS* below.*SPOILERS* Some good scenes (washing machine =)) and I liked the final shot/voiceover. At first I thought it ended far too abruptly but about 20 seconds later I realised the meaning and liked the end. However, because of the lack of seriousness in the story, combined with over the top scenes such as the news report at the school ment that I did not care for the characters much in the end. The final scene which was perhaps supposed to be a little poignent, while in reality I couldn't really care for the girl or her boyfriend. *SPOILERS END*\nSo overall I kinda did like this film, but it frustrated me and I think there was real potential in addition to some good scenes. Couple of other points, the main girl is quite pretty and cute, and the song that plays at the end is good too. I rated it 7/10.","I'm a horror movie freak, and this has got to be one of the most phenomenal horror flicks I've ever seen. The plotline is totally original (who else would think up a town who gets totally obsessed with a certain symbol to the point of death and insanity?), the special effects are amazing, and the cinematography couldn't be better. Some may find it disturbing, but that doesn't mean it's a bad movie. It also makes a good point. The spiral symbol is kinda ubiquitous. The spiral notebook, spiral seashells, spirals on cakes. Of all the shapes they could have used (square, triangle, trapezoid, rectangle) this was one of the best choices. If you can find this movie, definitely see it. It's certainly unique, and quite unforgettable.","Logic never rears its ugly head, but that's okay: take this one for what it is- a good, old-fashioned monster movie that's just plain fun. Like ATTACK OF THE MUSHROOM PEOPLE (though by no means as scary). If one were inclined to take lightly one's comments regarding a movie like this, one might say that the movie slithers along at a snail's pace or that it's slow as snail mail or... Well, you get the idea. (And don't get ticked off at me if you think I just revealed some secret about the storyline: I warned you up front that this comment contains spoilers.) (And I'm not rubbing salt in the wound, here.) (Salt being one surefire way to deal with people who turn into giant slugs...) Lightweight fun- but fun, nonetheless.","It's very true that this film defies convention by not spelling out the plot for the viewer.  While some may have a problem with having to figure it out for themselves, I embrace \"Uzumaki\" for its irreverence.  There is a PLOT, it's just that it may not be immediately accessible to a lazy viewer.  This is a film that invites numerous interpretations, as all great art does - however, this film is also very entertaining, making it a rare film experience.  It's simultaneously provocative and fun.","As is frequently the case when Manga is translated into live action, there is quite a bit lost in the translation.  However, this remains a highly entertaining film.  The premise is unusual and it is presented in the quiet, understated style so prevalent in Japanese films (ha!).  The special effects are a little 70s camp but, it adds to the comic book feel of the film.  I wouldn't recommend this film to everyone but, if you are familiar with (and enjoyed) other Japanese horror films like \"Evil Dead's Trap\", this film will appeal to you.","I noticed a lot of reviews for this film were older, it seems like a number of people watched during the wave of the import DVD scene in the early 2000's. I read Uzumaki last year, and then saw a number of good reviews, so I expected a little more from the film. Still was managing my expectations that it would be a solid adaptation of the manga based off others. For that matter, I always try to separate adaptations and judge a product on it's own merits, however this film falls very short.The film looks cheap - tacky spiral effects in the background and fast cuts (bordering on spastic at some points) do not do the film any favors. Also the editing is something like a school video project, using all kinds of odd \"fades\" and \"screen wipes\" that really seem dated to a modern audience. The film never takes itself too seriously and it is styled almost like a comedy, yet the tone is inconsistent. They toss in cheap jump scares that are out of nowhere. There are a few scenes that establish a creepy atmosphere, but that gets tossed out the window with a bad edit or goofy scene every time; the potential gets squandered.The acting is pretty stale in a lot of parts, and I think some of blame falls on the director's camera techniques. Often I felt he was highlighting a weaker performance with his shots, zooming in on actor's faces like a soap opera. If he had instead spent more effort focusing on atmosphere or building tension I think the story really could have benefited. The story is somewhat vague and had I not read the source material I wonder if I would have been able to follow it at all. To me that is the biggest problem, by picking and choosing bits from the manga and changing too many other things to condense it into a film, it is a half-baked product to the core. Fans of the manga will be disappointed, while newcomers may not be sure what is going on. Alright, I've gotta be that guy.... If you choose to watch this film and think it has some good ideas, check out the manga. It is much richer and more rewarding. Everything is better connected and well explained, the vibe is much creepier. I can pretty much guarantee you'll dig it. If you read the manga a while ago, and want to turn your brain off for 90 minutes, it does have some cool moments but really lacks any payoff. It is totally skippable otherwise. I only finished it out of inertia - I was ready to tap out around halfway through but decided to finish it off when I saw it a short feature. If the movie worked on it's own I would say check it out, but don't waste your time.2/10","I happen to have read all of Junji Ito's English released manga. I watched the Tomie film and it was a big steaming pile of turd. THANKFULLY Uzumaki actually does justice to the manga. I think those who have read the manga will really appreciate this film more, as many screenshots and camera angles are exactly like in the manga and it is interesting to see how the book characters are played in the film. This film reminds me of eerie indiana. The ending differs to the manga, which I was expecting. Kirie looks like her manga counterpart, and her male friend suits the whole very well. Very creepy I have to admit, this film feels like a feverish nightmare, the kind you have when you were a kid. Not really scary at all, but freaky, if you get my drift? Another great horror from Japan, get yourself a copy.","I enjoyed this film very much. It effectively combines humor, fantasy, and a few moments of horror with a solid film making effort from Higuchinsky. Brilliant visuals and a very original story concerning spirals. My only complaints are that it had its dull moments and wasn't as daring as it could have been. Still, I give this a solid 8 out of 10.  The U.S. should take note of this and other fine Japanese horror/fantasy films that have come along recently and have them available on Region 1 DVD. Actually, Asian cinema in general, have some of the finest films that have been unnoticed by the American public because they're hard to find.  I strongly recommend people to go look for these treasures, they're hard to find, but once you find them, you'll be glad you did.","First of all - don't expect horror movie. I did and I was quite disappointed - not even by the lack of actual \"horror\" - much more by poor CG and lack of any sensible explanation(s). I could live with that, but what really bothers me - it looks like creators of Uzumaki themselves had no idea how to explain events (or at least develop a story). The movie IS twisted, like - well - home of a snail. Some people compare it to creations of David Lynch. There is one resemblance - Lynch also often has no idea how to clarify his story. Strange - or rather weird - things happen all the time but often without any particular reason. After the movie ended I felt like after watching \"Twilight Zone\" mixed with a pinch of \"Tales from the Crypt\" and all that shoot in \"Ringu\" style. Such blend sounds promising, but Uzumaki doesn't keep its promise - it's simply too uneven. In addition all actual action concentrates on scenes with CG effects, which are often so poor that they will make you laugh. Everything between them (while quite stylish) may bore you to death - especially if you're not a Ringu fan. A pity. But there are two things that I actually \"won\" by watching this movie. The first one is end credits song (fortunately credited not with Japanese Kana, but Latin characters) - \"Raven\" by \"Do As Infinity\". I've found the video for it - and it basically contains all the action and special effects of the movie. If you will watch it before the movie - chances are that it will spare you the disappointment. And the song is really great!Second great thing about Uzumaki is its origin - the comic book. After finding out it's based on a comic I understood why it recalls \"Tales from the Crypt\" so noticeably... But Uzumaki comic is simply great! The story is very well developed and everything makes *much* more sense than in the movie - and that's quite strange because the movie is quite heavily based on the comic! Unfortunately all threads are mixed and twisted (pun intended), and the final effect is much worse than its origin.My final grade for Uzumaki is 5/10 - it doesn't mean that the movie is average. It's simple an average of what I want and would like to give it (i.e. 3/10 - 7/10).","I watched this movie a couple of years ago, and when I first saw it I was just annoyed by it, since the story didn't make any sense at all. There are hardly any hints about what might be going on in this village and in the end you're left with no clue at all. For some movies of that genre this works just fine for me to a certain extent, I just didn't like the way Uzumaki left you completely in the dark.Maybe if you knew the Manga, you'd be able to understand a lot more, so this review probably isn't of much value for you and if you just want to watch something strange I guess this movie will satisfy you, and admittedly can be entertaining to some degree.","Uzumaki, which translates into \"spirals\", arriving within this new wave of Asian Horror films following such hits like Ringu, Ju-On and The Eye (two of them with remakes.. and much more coming like Dark Water and Tale of Two Sisters), falls short of the spooky, supernatural thriller element so characteristic of the other movies, the only thing that remains is weirdness and not in a Tim Burton or David Lynch kind of way, but in a irrelevant and dull way. Its start with a girl, some other kid with a crush on her, her best friend and his dad who's obsessed with Uzumakis! Everything that happens concerns Uzumakis, people die and you see Uzumakis. So okay, It'll go along with it, I'm kinda amuse by spirals myself, characters don't seem to go anywhere, but I'll play along. We find out the town is cursed by Uzumakis, people start screaming at Uzumakis and the point is Uzumakis are everywhere, the movie is a disaster, it doesn't know where to go, except to show you the power of Uzumakis!!!!!!!!! There are some cool concepts like when the mother cuts her fingers because she sees Uzumakis on her fingerprints but then there's another scene where she hears her husband (from beyond the grave!!) tell her that she also has Uzumakis in her ear, the way they handled that scene was just laughable, not even cheesy fun, there are also some (a little bit) of cool visuals, like the collection the father has of Uzumakis and the girl with the Uzumakis hair.. yep, Uzumakis hair, its out of context though, its seems like it was taken out of a Fruit Snack commercial where if you eat an Uzumakis fruits snack, its taste is so incredible your hair turns into Uzumakis, now if this wasn't bad enough, suddenly, out of nowhere there are Snail Men.. or ManSnails whatever and you know why? right? Because in their shells they have Uuuuzuuuumaaakiiiis. That only left time enough for a crappy anti-climatic ending and by that time I was sick of friggin' uzumakis.. uzumaki here uzumaki there, sure, look around you, how many Uzumakis can you find If you want to see a movie about spirals go see PI (3.1416) now there you'll find some pretty cool uzumaki concepts in between the meaning of life and Dark City has also a little bit of a spiraling thing in there.This movie could have worked as a music video, it has already garnered a cult following and thats why I was compelled to see it, but after doing so, I'm not sure why people think it's great. I was truly disappointed.","Uzumaki has a very unique story and I will never look at spirals the same way again.  Not really spine tingling horror, this film has a dark morose, acid trip feel to it.  During certain parts, was it just me or did you see vortex visuals?  The camera shots are interesting and the movie lets your imagination run wild.  The bizarre supernatural feel of this film draws you in just as the title suggests.  Acting is done well and the town setting itself seems wrong with to begin with.This may take a few viewings for it to sink in.  A great trippy film.","I thought it was weird and just gory, not scary. I have seen a couple of the Japanese horror films, Ringu and Juon, and loved them; but this movie was a disappointment. It never even explained anything about the curse. I just didn't see any horror... it wasn't scary to me at all. The whole time I was watching I was waiting for Kirie to discover the secret of the curse and why it was happening now. If this was some ancient curse, why didn't it happen before Shuichi's father? And it never told us what happened to her father. I kept waiting for someone to tell us the meaning or the reasoning behind this curse and then it just ended. I was very disappointed.","This film Uzumaki \"The Vortex\" is a pretty weird experiment in cinema and a proud part of my vast movie collection,its a strange movie about a town that gets posessed or cursed by the VORTEX damnation,A lot of people start going insane about the shapes of the spiral in the VORTEX to the point in which some choose to die by becoming a VORTEX themselves, I know that whats new is J-Horror or Japanese Horror as people know, but this film really takes the cake, it has no visible comparition to any other J-Horror movie (Ringu,etc,etc) because its a twister of twisted material for your eyes, its a nightmare from which its hard to wake up. I really recommend this film for Japanese Horror movie fans and weird movie fans like Eraserhead and stuff that plays with your mind, the movie is a little slow and has no start nor ending to the story, actually the ending is kind of stupid but the whole thing works. Check it out.Ill give it a good 9 out of 10 on Scare factor on J-Horror movies.","Uzumaki is a visually astounding film however I felt as if some of the story line may have been sacrificed. There is hardly any character development which left me feeling personally detached from the film, which is ironic because all puns aside, this film really does draw you in with its many slight spiral effects and stunning scene transitions. At first the overall cinematography threw me off but as you get used to the overall appearance you start to see the beauty in this twisted film. This is a great movie if you are looking for a looker with out too much substance or deeper meaning.It is a great horror film that is not actually scary or suspenseful but somehow...eerie.","A girl begins to notice that people in her small town are becoming fascinated by anything that is shaped like a spiral. Soon, the fascination turns to obsession and things get deadly. While I won't say that \"Uzumaki\" was an excellent film, I will say that it was unlike anything I've seen before. Throughout my viewing, I felt like I was watching a cartoon. There are funny segues between scenes and characters with digitally enhanced eyes. Later, I found out the film is an adaptation of a manga comic, so this makes sense. However, just when you think you are watching something that could be a kid's movie, you are bombarded with nasty and gory visuals! The story often lags and the ending is somewhat abrupt and seemed anti-climactic at the time, but in retrospect I appreciate it more for its originality. My Rating: 7/10.","Wow.. I just saw this movie on the Sundance Channel, and it really is bizarre. I may not be a film expert, but it's probably the most bizarre film I, as an average movie fan, have seen.Whoever came up with with it had a great imagination. I'm a bit of a fan of Japanese dramas, and there are often actors from dramas in movies.. (Matsushima Nanako, for example, the lead in Ringu, is a major j-drama star.) But it looks like this is the first film for Kirie and Shuichi's portrayers. I must say, if they really are debuting here, they do a pretty good job.Kirie was a very sympathetic character, I thought she was easy to relate with. She was kind and good-hearted, perhaps not the most popular girl but nicer than some of the other attention-seeking girls. She was also pretty in a classic kind of way. I hope she does more films, but it's been a couple years so maybe she has no such plans.The ending was odd. I'm not going to give anything away, but the rest of the movie's bizarreness was kind of put to shame.Very bizarre, but very imaginative and unique movie. I'd recommend it for Japanese horror fans, though I'll warn you, it's a lot more bizarre than Ringu.Nonetheless, I'd give it a 7.5 out of 10, for originality, imagination, good characterization, above average acting, and just being plain intriguing.","Uzumaki, is a visually stunning Film, and I don't think anyone is going to be able to argue that.  But, unfortunately, the story somewhat falls flat.The film nevertheless is very entertaining.  It uses it's wild style to tell a somewhat non-existant story.  The film almost works, just based on it's characters and style, but In my opinion, leaves something to be desired.","For those who have seen Uzumaki and enjoyed it, i have a suggestion: read the manga(japanese for comic) series by Junji Ito. It can be found at many popular bookstores that have a comic/graphic novel section, for example i found it at both Borders and Barnes and Noble. The film covers many of the elements covered in the manga, but there are three of the books published so far (in america), including one that is somewhat of a prequel. Try it out, and see what the original is like!"],"review-user":["ShimmySnail","Gafke","teuthis","HumanoidOfFlesh","BA_Harrison","The_Missus","JayJay_Scotland","fuxing626","poe426","Monkhead","fuzbuddy","joodense","ouijaouija","LatinoNoir","Gucek","ArtWendeley","randychico","InzyWimzy","vickie8669","rogelioduron","steve_ove","ThrownMuse","PessimisticGrace","GuitarGod75","bunnyphang"],"review-date":["15 August 2004","24 July 2004","8 April 2003","15 March 2004","4 July 2009","19 October 2002","14 March 2004","21 August 2002","10 September 2007","28 December 2003","8 August 2000","23 June 2016","19 May 2005","10 February 2003","19 June 2004","16 February 2006","19 March 2005","22 July 2002","10 August 2005","28 March 2003","28 January 2006","26 April 2005","2 November 2003","6 February 2003","26 November 2002"],"review-rating":["8","6","9","6","7","10","6","8","7","2","8","8","5","3","4","10","3","8","7","8","8"],"review-title":[" seriously creepy\n"," Like a circle in a spiral, like a wheel within a wheel...\n"," Intriguing Horror\n"," Bizarre and entertaining.\n"," Twistin' time is here.\n"," Great Fun!\n"," Memorable, but Frustrating.\n"," You'll never look at a spiral the same way again....\n"," Good, old-fashioned fun...\n"," Don't be fooled by lazy critics...\n"," Entertaining (and silly)\n"," Amateurish adaptation that does not stand on its own\n"," Simply superb\n"," Like a Tim Burton movie, only darker\n"," Don't expect a horror...\n"," Don't try to understand it without knowing the Manga\n"," Its a pretty dumb movie about evil spiralssslrips live touba eivom bmud ytteep a stI\n"," Beware the vortex!\n"," I wasn't impressed\n"," A mind bending VORTEX full of weird stuff!!!!!!\n"," Beautiful but...\n"," Strange cartoonish horror\n"," Bizarre, but interesting.\n"," Bold and Stylish Experimental Film making...\n"," Good film, great comic\n"]}