{"review-url":["http://www.imdb.com/title/tt0286476/reviews"],"review-text":["Renowned Czech actor Vlastimil Brodský, mostly known in North America for his leading role as Jacob in the original Est German/Czech production of Jacob the Liar (Jakob, der Lügner 1974) gives us a last brilliant performance as a 80 year old prankster who refuses to admit that he is about to die.Jirí Hubac's screenplay is exquisite.  Funny, moving and well-developed. It explores well both the subject of advanced old age and the motivations of characters that are precariously strong and fragile, happy and unsettled.\nFrantisek (Vlastimil Brodský) and his best friend Eda (Stanislav Zindulka) are up to all types of shenanigans and are making sure to make the best out of their dying days.  Meanwhile, Frantisek's wife is preparing for their death, saving up for funeral money and chastising Frantisek for his endless childishness and irresponsible attitude.  Their son is about to take their apartment over and put them into a retirement home, but Frantisek doesn't want to hear any of that.  He wants to enjoy life and make people around him laugh.  He wants to help and love and give... but at what cost?Sure to captivate adults of all ages, this fine piece of film by talented director Vladimír Michálek is both touching and funny.  It makes you think of how we live our lives and why we live our lives. It brings the simple story of a charming stubborn old man to the forefront and allow us to reflect and feel what life is all about.After an active career lasting more than 40 years, it is somewhat sombre to know that Vlastimil Brodsk died in April 2002, no longer in the grip of terminal cancer.  It is however uplifting to think that he had the chance to be a part of such a moving script and to be the catalyst of this ode to joyful old age that has not even started to make the waves it is about to create in North American repertoire cinema.\nAfter the international success of Jan Hrebejk's \"Divided We Fall (2000)\", it is starting to be clear that Czech cinema has indeed something to offer to the world.  This film at least is a must see.","Up front, if you're tired, the first hour could be slow. The set up of the story has a natural leisurely pace, unhurried - giving us time to appreciate the kind of everyday life and situations the main characters are in. Once you arrived at the climatic segment of the storyline, the turn of events will keep you hooked: how will things turn out, what will happen to our precious Fanda (portrayed to utter quiet perfection by the veteran Czech actor Vlastimil Brodský), how will his wife (wonderfully played by Stella Zázvorková) treat him, what happens to Fanda's dear friend Ed (played by Stanislav Zindulka - a matching sidekick to Brodský), and Jára the son with selfish hidden agenda, blind to the kindness of his parents (sigh!)\nVladimír Michálek sensibly directed the film with sprinkles of humor, preserving the insightful script by Jirí Hubac. Thanks to clear subtitling, I was able to notice for every 'complaining' phrase Fanda's wife utters, there's a hint of 'caringness' showing/buried in between the lines - and so did the judicious lady judge observed. Fanda is '76 going on 80' and the affection of their enduring (endearing) marriage manifests even in their bantering arguments. His playfulness can be infectious.This is 'Growing Old Together 101' for (at least) the beyond fifties, and lessons learned to sons and daughters not to take parents for granted. One may need to rethink if assuming 'home for the aged' is a means to an end, so to speak. The film is gently shouting to us to live life to the fullest while we can. (Hint: there's joy in staying on and watch the end credits roll.)We're fortunate to be able to see an occasional Czech film. The Sverák (\"Kolya\") father & son's 2001 \"Dark Blue World\" was revealing with pathos. It's good to take it slow now and then and appreciate a foreign gem - its subtitles, scenery, melodic score and an engaging human story with elegant performances. \"Autumn Spring\" (aka Babí Léto) is available on DVD. Enjoy!","As an (aging) college professor, I am constantly in contact with American youth who think that old folks are \"icky, out-of-it, unaware, dull, and boring.\" And here at last, is a masterful film that demonstrates that some seniors are really young people who happen to be trapped in old bodies. Without spoiling the plot line, let me just say that the lead character in this film brought tears to my eyes with his portrayal of one man's struggle to remain young and vibrant. And also, it was just wonderful to see a story told so well through ACTING and PHOTOGRAPHY without lab-generated special effects. This film's a real gem!","This is a charming movie to say the least. The main character, Fanda, is an old man who refuses to be among the living dead by which he is surrounded. He and his accomplice go around pulling pranks and getting into trouble all over town. Meanwhile his family is up in arms about what to do with him. From there you see Fanda's relationships with his wife, best friend and son develop. It finally leads up to one of the best movie endings I have ever seen.The characters in this movie are rich and deep. They develop well through the course of the film. The movie has quite a range of moods. It goes from light and funny to grim and dark. Any slow parts for you in this film will be made up for in the end.Autumn Spring carries a similar message like a lot of other European movies do -- don't lose sight of the small pleasures in life. If you enjoyed Amelie, The Eighth Day or Life is Beautiful (all great films BTW), you will probably like this movie.8.5/10","To qualify my use of \"realistic\" in the summary, not many old folks I know go around pretending to be famous maestros, blind people, etc. -- nor have I ever been elderly. Those minor issues out of the way, the relationships between the characters in this film and the emotions expressed therein were completely realistic and genuine. In fact, though we're not yet 30, I could see many characteristics of my relationship with my wife in the interactions between the main character and his wife. For those that don't die young (there's a great line in the movie about this, when the two best friends are talking about dying young, and one of them says--and I'm paraphrasing, we missed our chance--we'll just have to stick it out), we'll all be where these characters are some day. I know many movie-goers would prefer to be swept *away* from reality as opposed to being *faced* with it, but even they might enjoy the sweet reminder of our mortality--and the importance of living life to the fullest--that this film is.","As a Czech I am very pleased when I read these comments here. I am absolutely sure that this film is great. And what you maybe don't know is that story was specially written for Mr. Brodský. The man you can see is him and his typical attitude - to live and to resist death. He was one of great actors and we are very lucky that we he has made so many beautiful films during his life. You are lucky you could see at least one of them. Enjoy.","This is a FANTASTIC film. Hána is a very old guy with a very young heart. He knows how to live his live fully everyday by teaming up with his friend making pranks on just about everything, even his own death. While his wife can't deal with his \"irresponsible\" behavior, she also knows that it's exactly why she loves her husband for almost half century. I would love to hang out with this old guy because he knows how to enjoy live and never fear of death. He is joyful, witty, mischievous, and never boring. Vlastimil Brodský brilliantly played Hána at the age of 79. Every look from his eyes and every move from his aging muscles deliver so much about the character to the audience. This is a film that leaves a big smile on my face afterwards, and it makes me look at my own live a little closer. Tomorrow I am gonna go and buy myself a mansion and have some fun. If Hána can, so can I. But I think I will skip the smoking part.","I found this film to be one of those great heart-warming gems. The story line is tightly woven and the character development throughout fantastic! I am a big fan of non-US films anyway and this is right up there with: \"Happenstance,\" \"The Closet\" even \"King of Hearts.\" Vlastimil Brodsky as Fanda, is fantastic. It is a love story in the true sense of loving life and the twists and turns it takes to get the viewer to understand/enjoy Fanda's view of life (which nearly costs himmore than he is prepared to give) are wonderful. His co-star Stelle Zazvorkova is unforgettable as his fed-up wife. I highly recommend this movie for the whole family--my children loved it.","This film just won the best film award at the Cleveland International Film Festival. It's American title apparently is Autumn Spring.  The acting is superb. The story takes you into the life of an elderly man who takes what life deals him and spikes it up a little bit.  Abetted by his best friend (and partner in not-so-serious crime) he puts people on at every opportunity but still often reveals his heart of gold.  His longsuffering wife has come to her wits end and makes a life-changing decision which is heartbreaking to watch.  The resolution of the story is beautiful.","Not much to say other than it is simply a masterpiece. this film contains a myriad of messages that all should take to heart. especially- women do not squelch your man's dreams -honor them -that's why you loved him in the first place! Those who plan for death will live in the grave. Those who carpe diem will awaken those who live in fear. Even our Lord spoke of this when he chastised the the one who buried his talent in fear that he might make a mistake and displease the Master. Take a risk, get out of the boat and you will walk on water. Life is a journey that does not end in the grave but in our minds and souls.","The main cast:Vlastimil Brodský .... Frantisek Hána Stella Zázvorková .... Emílie Hánová Stanislav Zindulka .... EdaDirector Vladimir Michalek gives this charming story of elderly folks enchanting twists that make the characters appealing, really universal.Frantisek Hana is retired and on a pension, his previous occupation unknown. He lives in a very nice apartment with his wife of forty-four years, Emilie.  His son Jara covets the spacious apartment as a problem-solver as he needs to house one of his ex-wives and several of their children.  The son isn't a vicious schemer, just a guy with one past spouse too many and a blind eye to the attachment his dad has for the flat (which he moved into after relinquishing a previous residence to the son).Hana and his also elderly close friend, Ed, spend there more than ample free time doing small con jobs not for money but for the pleasure of putting one over on easily duped folks like estate agents.  A favorite ploy is for Hana to act the part of a retired divo of New York's Metropolitan Opera returning home in need of a sprawling mansion.  Ed is his companion as gullible realtors fall all over themselves proffering chauffeured limousines and fine French restaurant meals in hope of a lucrative sale.When not engaged in well-planned scams, the duo engage in quick ploys such as pretending to be railroad security agents so as to snatch kisses from breathless and ticketless teens trying to sneak onto trains.  Chaste kisses, that is: there's no lechery here.Hana's long-suffering wife is obsessed with saving enough money to insure that the couple, individually and jointly, have a grand funeral, an event the life-loving Frantisek is in no hurry to experience.Disagreements about money and Frantisek's promiscuous disposition of marital funds lead to a crisis whose resolution rings both real and endearing. Michalek fishes for the viewer's emotions but he does it openly, honestly and effectively.\"Autumn Spring,\" subtitled of course, is a product of an increasingly vibrant Czech cinema.  It wasn't shown widely in the U.S. but its availability on DVD will, hopefully, bring this affecting flick to a wide audience.  Sadly, Brodsky recently succumbed to cancer so this movie is a valedictory to a fine actor who imbued his character with a passion for life's pleasures that must have reflected the actor's own values.9/10.","\"Autumn Spring\" tells of the misadventures of a dapper, walrus faced, 78 (approx) year old Czech man who haplessly befuddles and bemuses all who know him with his mischievous ways while his wife meticulously plans her funeral. Centerpiece Hana (Brodský) shows us how to get babes to kiss you when your 78 and how to cop a feel in an elevator and get thanked for it as he pranks his way from day to day in this warm and glowing look at old age and one man's creative, amusing, but socially unacceptable ways of enjoying life while refusing to be relegated to the old folk's home. \"Autumn Spring\" is a plodding, subtle comedy with messages for all ages which will have the greatest appeal with more mature foreign film buffs. (B+)","The title of the film seems quite appropriate given the persona of the lead character, Fanda. He's an older man living in the late autumn of his life, yet frolics about as a jubilant school boy who's just entered a spring meadow. The frailties of old age and the warning signs of death are all illusions to him. His wife supports this idea when she observes, \"Fanda laughs at funerals and death.\" In other words, death is not something Fanda takes too seriously; he has more important things to do than worry about what already is inevitable. Life, however, and the pursuit of living life to its fullest, is the philosophy that governs Fanda's existence. He is not one to merely exist, but must live for each day and each passing moment, for tomorrow is not guaranteed. The film seems to make a strong commentary about living as though there is no tomorrow, let alone death. Too many people take life much too seriously and consequently miss out on the actual living part of life. Fanda's wife for example; she's so worried about preparing for death, not in some religiously connotative way, but in a far too practical, even lifeless way that she forgets how to smile, laugh and just have a good time. Her humanity seems to have transformed into zombie auto-pilot mode. Fanda, to the contrary, is perhaps too blithe and absent-minded for his own good. He needs a person like his wife, Emilie, to help balance him. It's as though Fanda possesses the invincible spirit of a child, like a kid trapped in an older man's body. He is introduced as the adventurous type; he pretends to be people he's not in order to get gain, squanders money, factiously lies and is always up for a good laugh. Deep-down, though, he is a kind-hearted and gentle old man who wishes to be submissive to his overly pragmatic wife. The two off-set each other quite nicely, though neither one of them truly appreciates the binary quality of their relationship until they metaphorically chance upon death: meaning, their divorce. It is during this courtroom scene that Fanda realizes the reality of death and what it means if he is separated from his only love. His wife emotionally recalls all of his flaws, yet is tenderly drawn to continue to love him despite his crazy behavior. In this moment of her forgiving him, Fanda realizes his selfish behavior of driving his wife bonkers and makes an internal commitment to make her happy. Ironically, though, after making this commitment he becomes what his wife later calls, \"a living corpse.\" The life-blood within him drains away as he becomes more like hera zombie going through day-to-day motions. He doesn't seem to live anymore, but exist. For example, he gives up his zany pranks, doesn't squander money, quits smoking on account of his wife (not his health), and overall, just acquiesces to whatever she wants of him. Succinctly put, he changes on account of wanting to make her happy. Thus, the binary quality of their relationship begins to slowly vanish. Realizing that her husband is not who he used to be, there is a part of Emilie that misses the old Fanda. She misses her husband's aloofness and the fights they used to have, because it was in those moments that they were truly living, not just simply existing. I believe the filmmakers were trying to get across a specific message here; that true and loving relationships will not always be easy or convenient, but often times will take sacrifice and endurance to wade through the seemingly bad times. The possibility of death at any moment is what reminds people to live for every moment. Life is often taken for granted, but when threatened with deathbe it literal or figurativepeople awake from their ungrateful slumbers and are aroused to start living life to its fullest. It's as though they are scared that they'll never live again, so they better make the most of it while they have it. Fanda and Emilie had been married 44 years with fights along the way, but it wasn't till they were both threatened with the possibility of death-like-separation that they began to show their true colors. As the old maxim goes, \"Love knows not its own depth until the hour of separation.\" They both begin to see what matters most in life and that is the people they meet along the way. More importantly, the intimate relationships they make with their significant others.","Similar comment is posted earlier. But this did kind of warn me of my future not so far ahead in future! Financial management is key to success and may even famous people do not do it and face the peril in the end. Developed country or not, it is the same story. The wife's approach looks right but the husband seem right too. As money is not the end in itself. Have it enough so as to not to waste time on worrying - know that limit of yours, is what I would say, is my take away from this movie.Now writing these lines just to make the review more than 10 lines as mandated by guidelines :) - the actors seems genuinely common people and not the well known heroes, at least for me as I do not know much of the Czech film industry. One of the channels shows all such international films and are usually pretty good. I am going to recommend this movie for local film clubs.","A wonderful movie about a man who refuses to grow old. Autumn Spring revolves around Frantisek Hána, who is in Autumn of his life but mentally still lives in Spring. He loves fine dining and he still loves making pranks and he doesn't cares much for death. But he is kind hearted and generous, a good friend and still loves his wife.While Autumn Spring is mainly about living life to its fullest, it also about friendship, marriage and parent-child relationship. And it is also a very good character study.There are many good movies about people struggling with age of which Tokyo Story is my favorite. In Autumn Spring, the topic is handled in a fresh, loving and humorous manner, leaving the audience with a smile on their faces as the movie ends.","I am neither an avid movie fan nor an accomplished review contributor but felt compelled to relate the exuberance I felt when I first saw this film. I have repeated the experience and still remain enthralled. I really felt that it was a documentary - a real life expose rather than a dramatized film. The music is absolutely delightful and I am trying to ascertain how I might learn the title and obtain a copy - it lingers and frankly haunts me a little. The entire experience was so rewarding that I fear I will judge all other movies I and tempted to view by this standard. The hero is not really a comedian but someone who has made a judgment about his behavior - deciding that in his old age he will be himself. His character is such that he does not take life seriously and that might be interpreted as comic however that is not his intention it seems. His long-suffering wife does make an attempt to rectify what she sees as the error of his ways but, in the end, he is a hero because whilst conceding slightly, he has the courage of his convictions.","Shakespeare's famous line, \"I have liv'd long enough. My way of life. Is fallen into the sear, the yellow leaf\" does not hold water here in this film. Vladimír Michálek pokes fun at, & at the same time offers a shoulder to rest heads on to, those who are counting their last days because, as the saying goes, their days are numbered.Frantisek Hána (Fanda), who is just a few paces away from his grave, thumps his nose at old age and lives life king size; at one place he says, 'old men should be rich and respectable.' Being in the autumn of his life his spring does not fade; rather it's the spring that's mightier. If Fanda is the obverse of the coin called life, then Emílie Hánová is the reverse of it. She's all autumn: and she even tries to make her autumn (death) grand and peaceful. She stashes away money for their funerals; reads various dead person's epitaphs and even, rather hilariously, copies them; she also books a place where their graves would be; she desires herself and pesters Fanda to shift to an old-age home before death. Emilie, a woman rather obsessed than sad and afraid of death, through her small, almost blink-and-you-miss, acts in the film has painted a picture of the intensity of a soul to live every moment of one's life. it's just that her intensity to live has overgrown and surpassed towards death itself. Hence, she wants to die a peaceful death and even stay there peacefully.For Fanda death may be the ultimate upshot, but why whine and pine for it? His gather-ye-rosebuds-while-ye-may attitude towards life jars Emilie's preordained plans. He plays pranks with unknown people and wines and dines in posh restaurants; squanders Emilie's hard-saved money in whimsical trifles; pretends to be a ticket collector or a well-off personality looking for a mansion and so on. The man may be a jumping light of happiness, yet he does not desert them who are not: he often helps people in need with money, though he has none. The way he looks at life becomes a dish to savour and hang on with till the last breath. Jiri Hubac has touched upon the pathos of old age and the outright resignation of such traditional pathos of a man when his last days can be counted on his fingers.A subtly dark, but hilarious, humour plays upon the various strings that transform the film into a musical unison of life and its counterpart - death. The film celebrates and undoes before the viewers the various themes of marriage, friendship, life, death and how they work in consonance with everything that meets the eye. The carpe-diem motif signified by Fanda wins over Emilie's pessimism. She spends most of her savings in the end only to enjoy, and more precisely, to live a moment in her life with Fanda before the Reaper wields his sickle.Ed (Stanislav Zindulka) remains as a living image of friendship and a perfect companion and a sweet accomplice of Fanda in good and mischievous deeds. Ed's death at last tells upon Fanda which signifies the approach of autumn, though spring never fades in this movie - only changes colours at times which seem like autumn.Jara (Ondrej Vetchy), the prying and covetous vulture that he is, tries every opportunity to make his parents' life miserable. He spreads a shroud over the eyes of Emilie which she later clears off. He fails to do anything to Fanda - a master of and in his own terms.","Czech movie goers may have enjoyed and rated this film highly because it was Czech, but I found it to be trite, tedious, moronic, boring, and insipid. Again, I suspect \"ramping\" in order to increase sales of this dog of a film. Amazon describes this film as being about a couple of fellows that refuse to grow up, but I will go one further--I think it is about two fellows that have entered a state of dementia and perform actions that make no sense to anyone. I have been told that one of the actors in the film committed suicide after the film, and I would believe it. When he saw his performance he probably realized what a gosh awful job he had done and realized that the only way to avoid terminal embarrassment was to make the \"big exit\", which I am sure was much more dramatic and a much better performance that he had done in \"Autumn Spring.\" Don't waste your time or money on this pathetic performance. It's nothing but a dog in a manger."],"review-user":["christian94","ruby_fff","NaplesMacMan","grotchly","Argos-3","petko-cz","YNOTswim","renee-77","bdots48","kickstar1","lawprof","=G=","gentendo","akumthek","princebansal1982","gregoryralph","purnenduvianworld","gumby_x2"],"review-date":["27 August 2002","8 February 2004","19 June 2004","2 January 2004","19 January 2004","13 February 2004","8 November 2005","23 November 2004","9 April 2002","18 January 2005","15 February 2004","5 December 2003","26 October 2008","12 April 2014","26 May 2011","6 September 2014","5 December 2013","17 February 2009"],"review-rating":["8","8","8","9","10","10","10","9","10","9","8","7","5","10","9","1"],"review-title":[" Excellent screenplay enables fine actor to depart gloriously\n"," This is a gem - even though it may not seem so immediately\n"," This film is excellent sensitivity training for 30-somethings!\n"," Wonderful little film about living life to its fullest (NO spoilers)\n"," Realistic and touching picture of old age\n"," Film for people who don't fear thinking about things in life...\n"," Live the fullest\n"," Fantastic family film\n"," Funny,moving portrait of an aging rascal\n"," masterpiece\n"," A Sprightly Czech Charmer\n"," A wonderfully warm and amusing character study\n"," Live, don't merely exist\n"," very touchie and real\n"," Spring in Autumn\n"," An enthralling if somewhat bitter-sweet comedy - please see my full comments\n"," Leaves from Two Lives\n"," Avoid, Avoid, Avoid!\n"]}