{"review-url":["http://www.imdb.com/title/tt0223503/reviews"],"review-text":["I'll make this brief. This was a joy to watch. It may or may not have been more effective if the characters had resembled their real life counterparts, but aside from this minor observation I found the fantasy animal characters to be most enjoyable. The visuals were most stunning except for the second-rate CG scenes, which could have been left out. I dislike computer generated animation anyways, it defeats the purpose of a biopic such as this one. Watch it, you will appreciate it too!","Spring and Chaos is an astonishing movie for three reasons. The first one is the apparent antagonism between the form and the substance, a poetry writer biography in a \"funny animal\" story such as The Aristocats... The second one is the gap between a commercial manga cartoon style and a non figurative painting style with strobe light effect editing, rough draft cartoon sequences and even word's keying ! Last but not least is the strength of the poetical atmosphere that proceeds from all these apparent discrepancies thanks to a subtle script, a perfectly chiseled dialogue and a strong screen presence of main characters.","Spirit and Chaos is an artistic biopic of Miyazawa Kenji, a Japanese poet and writer who was active in the early 20th century. The film captures and interprets his artistic method ('sketching' poems), his inspiration (the spirit of nature and its fantastic beauty) and his struggles to accept a harsh reality in the face of his idealist imagination.The film integrated excerpts of Miyazawa's poems into the plot beautifully. His relationships with his students was powerful, especially in one scene where he offers everything he has to a student who has just been caught stealing materials from the classroom. Miyazawa's selfless compassion for the farmers in his village, his sister and other unfortunate people can serve as a lesson to us all. Furthermore, Miyazawa's devotion to science was also nicely portrayed. In a time when Western ideas were still met with skepticism, especially in provincial towns like the one where Miyazawa grew up, he understands its usefulness in helping his fellow villagers and is inspired by its elegance. The way the film presented moments of artistic passion and disappointment in the writer were truly intense and well interpreted.I felt that the CGI integrated into the film, while groundbreaking an innovative, clashed with the more organic animation. It could be argued that this was intentional to represent conflict within the main character, but I found it rather unaesthetic. I also wish that the film had discussed Miyazawa's Buddhist influence, but it worked fine without it. I though this film was very well done. I give it a 9/10, with the one point being deducted for the CGI. Otherwise the animation, plot and dialog were all wonderful and heartfelt. I haven't seen any other films by Kawamori Shoji, but after seeing this one I will be sure to give them a chance.","I never thought I'd say this about a biopic, but there is a near over-abundance of characterization (especially concerning Kenji Miyazawa's emotions) and too little on the literal occurrences in his life--by the end, I'm not sure if he dies (he's supposed to), or if his sister finally dies (she's supposed to), or if the director spent a little too much time on the Galactic Railroad (that's an inside joke, in case you missed it--Miyazawa wrote a children's book called Night on the Galactic Railroad).  However, this glimpse inside the mind of a writer who \"sketched poetry and fairy tales from his imagination\" is very intelligent, creative, entertaining, and emotionally powerful.All this despite the fact that everyone is animated as animals (like in many of Miyazawa's stories).Some of the visuals are truly astounding, especially considering that it was a made for TV movie.  Seriously, some of them (like the sequence with birds trailing blue light) rival parts of Fantasia. However, I still can't stand computer animation when it is mixed with cel animation.  The CGI trains are horribly obvious--even more so than the Anastasia train.8/10","Talk about being boring!I got this expecting a fascinating insight into the life of the man who wrote the mythical Night on the Galactic Railroad. I expected to see crazy stories and hijinks of an eccentric man and to discover his inspirations for such bizarre material. Boy, was I wrong.Spring and Chaos is mostly boring with only sporadic moments of innovative animation. It's certainly nothing to write home about and nowhere near as good as NOTGR which is something that I suggest you watch instead. Leave this bore alone. If you absolutely MUST see then either rent it or find it somewhere cheap. Do not pay top dollar.","I waited many years to finally have an opportunity to see this. I had heard so many good things about it and was lucky enough to finally catch it streaming (legally) online this week. Words cannot express my profound disappointment at this overrated, self-indulgent piece of garbage.Some reviewers have actually equated parts of this low-budget train-wreck to Fantasia, which makes me sad for some people who must be visually challenged. Honestly, some of the more \"experimental\" aspects of this anime are actually quite derivative (most notably the colorful etching style which artlessly apes George Plympton). And the computer animation that people praise is middling even for the 1990s.The dub, which features an obviously African-American voice actor as Kenji Miyazawa is a legendary miscasting. Anime like this must be watched in Japanese with subtitles - English cannot possibly do justice to the local color needed to flesh out some of these philosophical concepts.The story is padded with long pauses, repetition, and ultimately goes nowhere, leaving us with no real feeling for Miyazawa. The character designs are ugly and inconsistent - these anthropomorphic felines lack all of the charm and beauty of their counterparts in Night On The Galaxy Railway (also based on the works of Kenji Miyazawa).Anime fans can often be self-delusional with regards to shows that feature weighty concepts and artsy pretensions, but I find it impossible to praise something so shoddy and hollow as Spring & Chaos."],"review-user":["squarefanatic","mathieu-c","djlayton4","Jeremy Bristol","CuriosityKilledShawn","zillion29-1"],"review-date":["28 September 2003","12 August 2004","21 October 2007","8 June 2001","8 December 2004","7 October 2011"],"review-rating":["10","9","8","4","4"],"review-title":[" Expressive and Thoughtful\n"," Spring and Chaos is an astonishing movie for three reasons.\n"," A moving film, but could have done without the CGI\n"," Very good animated biopic\n"," Dud\n"," Super Disappointment\n"]}