{"review-url":["http://www.imdb.com/title/tt0251094/reviews"],"review-text":["this movie is certainly worth a watch. it's full of action. it's also humorous. you'll laugh until your stomach hurts if you watch this movie. this movie also includes lots of hi-tech things hence the name gen-y. i recommend you to watch the prequel of this movie which is gen-x.","Genius or utter madness? That depends on your interpretation of this film. I responded to it on the level of a self-aware \"cop-movie parody\", and I sincerely hope that was the intention as I don't see anyone taking it seriously! :-D Paul Rudd for one seems to be chewing up the scenery and really getting into the spirit of things! Is this film supposed to mark a departure for Rudd from his core background in the comedy genre? Some kind of insane attempt to reinvent him as a hard-boiled action star? I think not! With the cheesy, almost awkward acting, low budget FX, and zany over-the-top action set pieces, it all kinda evoked that old TV show \"Sledge Hammer\" for me! HILARIOUS!!! :-)Of course, I may have totally interpreted the film wrong. If it was in fact an attempt at a 'straight' action movie, then it was certainly an amusing failure!!Watch with lots of alcohol and some mates!!! ;-)","This film is really a big piece of trash trying to make itself look like a Hollywood production.Poor story outline(stupid robot story)...ultra bad acting by untalented pop idols...and they are trying to\"FIGHT\"!!!My goodness...those miserable actors uses wires to make them look like they are \"good fighters\"...:(and I hate that arrogant Edison Chen...the worst actor I have ever seen!!!I will never touch his movies again.AVOID this movie at all costs!!!I wanted to give it a negative value out of ten...not even worth a 0/10.","A robot, on a killing spree? Cheap DVD? Sounds interesting to me. Welcome to the strange world of the y-gen cops. The y-gen cops are basically match and alien two unconventional cops. (Think great teacher Onizuka but more annoying.) These two idiots always manage to save the day in the most unusual way. For example whilst on a stakeout they use a cellphone to call for backup, only remembering in the nick of time they had accidently picked up the bomb phone. Thus destroying there ferrari. Both speak English, well kinda anyway. They try to speak English throughout most of the movie but what they say just comes out as lame. As this was a chinese movie I was surprised that most of the film is English. Incredibly as far as I can tell it was not a dub!! Although when they do speak chinese it is subtitled, well when the filmakers can be bothered to. Sometimes they speak entire sentences and no subtitles come up!Anyway getting past all this basically the R-1 robot is to be sold to the highest bidder. The R-1 is an almost indestructable machine which is loaded with weaponry. The hong kong police and the FBI want it back before any damage is caused. But this is y-gen police, I doubt thats gonna happen! What follows is a large number of action sequences which can be pretty thrilling at times. Especcialy the ending. If you just wanted a film that you could just sit down to and have a good time, y-gen cops is probably it. Although, beware my the movie on my DVD came in full screen and not widescreen which can be rather distracting at times, but by the end of the film you should be used to it.I find it hard to rate y-gen me and this film have a love-hate relationship. The voices annoy me, the action scenes excite me. So I'm going to give it a: 6 out of ten","I am having a holiday in hong kong now, and i just saw gen y cops at the cinema.... what can i say... it was sooo cool!!Everything you could wish for was in it! Basically... just see it if ya can... I'm gonna get my friend to send me the vcd when it comes out....Only bad thing was the dodgy American style of talking employed by some of the hl actors... like Edison... \"What's up my man?!\" but it did add even more humour to iy... hheheSee it... especially if ya like any of the following geners: HKfilm, action, comedy, sci fi!    SEEITMAN!!   Edison did a good song for it too... so download it... Edison Tse - Heroes","So this is the sequel to one of my favorite martial-art flicks that don't star Jackie Chan, Gen-X Cops, though why he chose to have his name attached to this is a mystery. It's hard to blame the godawful dubbing, because even with subtitles, the fighting is stale and the special effects are so so lame. It makes the original look like Police Story. In short, Generation Y should be embarassed to have this associated with them.","This is a well done action movie. There are plenty of fight scenes, the acting is convincing (for this genre) and RS1 is awesome. I don't know why people feel compelled to trash RS1, I thought his effects were executed very nicely and his design looked great. The plot was acceptable for a martial arts movie.Having said that, I must tell you Richard Sun is one of the worst actors from Hong Kong I have ever watched. At least RS1 had the right idea by killing him. Now, for all of you who thought Sam Lee (Alien) was a bad actor...he wasn't meant to be taken seriously! I have just had the pleasure of watching Gen-X Cops (prequel) and Sam Lee played the same character the same way!Now, please, all of you guys who watch highly reviewed Oscar winners: DO NOT JUDGE THIS IS A THINKING MAN'S MOVIE! IT ISN'T SUPPOSED TO REQUIRE THOUGHT! Just meant to be enjoyed, that's all. I hope they make another soon.","I love Paul Rudd and all, but my God. This movie is /rank/. It makes little to no sense, and the thing keeps /pausing/ to identify characters. Not to mention the accidental subtitling when people are speaking english.Paul Rudd does look good wet, though.","Exceptionally silly actioner with braindead leads in a story which would have suited a fill-in issue of Spiderman. The action sequences never really flow as they should, leaving some cool bits orphaned in a sea of sound and fury, signifying nothing. I really wonder how they'll release this one in the West. Sam Lee overacts like  crazy, newcomer Edison Chan doesn't display any acting talent yet. The robot is clunky and not very impressive, and the CGI effects (though done by US sfx-people) are ridiculous, totally destroying any remaining suspension of disbelief. I am NOT looking forward to Gen-Z Cops...","\"Gen X Cops\" was an fun blend of drama, comedy, action and technology.  I was disappointed to see that only a couple of the original cast members came back for the sequel, especially since it was the group of them that helped make the first film so appealing.The plot of Gen Y (an armed American robot is kidnapped by its creator/programmer and used to commit chaos and revenge etc etc etc) and consequent subplots are really second to the action.  There's quite a bit of humorous dialogue between the two Hong Kong partners, though the character of Alien truly does overact in a number of scenes and his use of English slang is overdone.  For the most part, though, this is an action movie with an emphasis on technology not to be taken too seriously and is quite a departure from the first film.  I think it might have worked just as well as a movie on its own instead of a sequel, but I didn't finance it.The special effects are amusing (some well done and some not quite so well done), the action sequences are well choreographed and the new cast members hold their own, especially Edison.  He's cute, got some good moves and I'm looking forward to seeing more of him in future films.  What in the world was a blonde Paul Rudd doing here though???Don't expect the most serious film in the world.  Just sit back, relax, be amazed, cringe and wait to see what the next sequel brings us!(7 out of 10)","Review: I lost interest in this film from the get go! The movie looked cheap and extremely dated and I wasn't impressed with the action. Its about a robot which has been made to be the ultimate fighting machine but when it gets stolen from an exhibition by a computer hacker, a group of young cops, who were hired to protect the machine, fight to save the world. One of there fellow cops are drugged and used against the cops so the head of the FBI agents, Ian Curtis (Paul Rudd), attempts to get back the robot and kill the agent who has turned to the darkside. The young undercover cops manage to find out that there fellow agent has been drugged so they try to prove his innocence by getting back the robot, there own way, whilst fighting against the hackers, who have different plans for the robot. Personally, I didn't find the comedic scenes that funny and the gun tooting cops weren't that interesting. The robot looked ridiculous, especially towards the end but on the plus side, it's quite short so I didn't have to put up with the movie that long. I wasn't a big fan of the first movie because it seemed a bit messy and this film isn't much better. The trendy young cops just didn't seem to take the whole situation that seriously, even though there is a lethal robot on the lose, so I have to give this movie the thumbs down. Disappointing!Round-Up: Starring a young Paul Rudd, who looked uncomfortable throughout the movie, this, supposed to be, action movie wasn't that great and the scenes with Paul Rudd made me laugh because of were he is today. This film was directed by Benny Chan, who brought you the first movie in this franchise along with Who Am I?, New Police Story, Divergence, Robin-B-Hood and the great Shaolin. This movie would have been much better if it didn't have so much comedic content, which wasn't written that well and it feels like I'm beginning to sound like a broken record because I have said the same thing about a lot of the movies that I have seen recently. Anyway, this film was produced by Jackie Chan, who also produced the first movie and you can see that they used his style of action during the fighting scenes. Its just a shame that the movie wasn't that great!I recommend this movie to people who are into their action/sci-fi movies starring Paul Rudd, Mark Hicks, Edison Chen and Stephen Fund. 2/10","I somehow managed to make it all the way through this movie, but was dumbfounded by the complete lack of entertainment delivered. My friends and I are fans of HK film, but WOW. This movie has it all, and by all I mean everything a movie shouldn't have. Underdeveloped and stereotyped characters, way over-the-top overacting, cheesy special effects, talking robots, no less than 20 double-foot jumpkicks, impossible situations, unfunny \"gags\" and \"jokes\", elementary school premise, mindless killings, and too-long running time for the material. Throw in the fact that Gen-X Cops was a decent film and this movie becomes even harder to bear. Quite simply, if you're entertaining the idea of watching this film...don't.","I saw this movie on VHS some time ago (27 Jan 2003), just because of the name of Paul Rudd on the cover. I liked his performance in `The Object of My Affection' very much and I really expected a good work. However, I found this film a complete mess. The story has a very confused screenplay and the characters are not well developed. Further, the low-budget special effects do not help much. I do not know the previous generation of Gen-Y Cops, but this next generation is not good. I do not recall exactly why I gave this grade (and I do not intent to see this movie again), but my vote is four.Title (Brazil) : `Gen-Y Cops A Nova Geração' (`Gen-Y Cops The Next Generation')","This film is great. All the hi-tech machinery and technology is mind-boggling. It is packed with action, humour and not to mention, guys. You will want to see it again and again. Very very funny. Also, it has a very unique plot which is unpredictable. You wouldn't want to miss out on it.","Gen-Y Cops...since I heard of the film being in release, I have been wanting to see it because I loved Gen-X Cops. I was a little disappointed that A) Nicholas Tse didn't return and B) too much slapstick. Nevertheless, I enjoyed the sequel because it may not be good as the first film, but it is good in its own way.Stephen Fung returns as the ultracool ladies man Match, who has a steady girl in Oli (NOTE: Where is Haze?) and Sam Lee returns as the insane Alien (this time sporting a mohawk and speaking a lot of English!!!!). The real star of the film is newcomer Edison Chen. He makes a great replacement for Nicholas Tse as...Edison. I also enjoyed Paul Rudd's performance of Agent Curtis...he seems to be the tough as nails, smartmouth FBI Agent you'd love to hate...but soon, you'd like his character.The fight scenes are a lot better in this one...even though there are very few, but they are great, courtesy of Jackie Chan stuntman Nicky Li.\nLook for a cameo from Ron Smoorenburg as a cage fighter who has a teeny little fight with Match. Smoorenburg also is the stunt double for Rudd.If you liked GEN-X COPS...you'll love GEN-Y COPS!!!","This movie is over hyped!! I am sad to say that I manage to watch the first 15 minutes of this movie and anything beyond that, I will have to force myself real hard to sit down and watch the rest of the movie. It's totally stupid and very fake. The robot in the movie looks like a man wearing those steel suit and the acting is really bad especially the one playing the character Alien.He is totally annoying!! Don't waste your money watching this sequel to the popular Gen-X Cops. I'd rather sleep or spend my money on some other things rather than watching this movie. 1 out of 10. If possible,I'd give 0.","The \"why\" is obvious - the first one was a hit, and understandably so.  Good action, decent story, strong cast.  Everything a good HK movie needs. \nThen along comes \"Gen-Y Cops\" (or one of its other names - Metal Mayhem or such).  Here you have some of the cast (no Nic Tse?) from the first movie trying to stop a Transformers reject from shooting people.  Why were there robots to begin with in this movie?  For the most part, robots in movies haven't even been cool since 1988.  On top of that, you have Match and Alien from Gen-X cops walking around talking street jive.  \"What's-up-my-man?\" Plus, there's Edison - or as I call him \"The Asian Marky Mark\", because really, after watching him, you feel like he should have said \"Feel the vibration!\"  He has the look... the Funky Bunch look.Paul Rudd, well, I dunno.  He's just there, being an Angry American Government Agency Guy (A.A.G.A.G.) who becomes a friend over the course of.3 seconds.  There's a story of Edison's old friend being the one who made/sabotaged the robot and made it kill, but does it matter?  Does it really matter?\nNope.\nSo really, all we're left with here, is Stephen Fung, Sam Lee, and the Asian Marky Mark having to fight Megatron while Paul Rudd struggles to keep up. Oh, that and they speak English for a good portion of the movie - which they do considerably well, if you overlook how obnoxious it is.  By that, I mean you hear \"WHOOOOOOAAAA, MAAAAAN!\" every 15 to 45 seconds, usually Alien (Sam Lee)'s fault.In my opinion, the only redeeming quality this movie had was the music it played on the DVD menu.  Other than that, there's really not much to it. Stick with Gen-X Cops.  That's all you need.","I think this movie has got it all. It has really cool music that I can never get out of my head. It has cool looking characters. IS REALLY funny(you know, the kind that you'll crack up on the ground and you'll keep saying the funny parts over every day for three weeks).Despite the bad acting, bad cgi, and bad story(about cops going after a robot), its really cool. Its one of those movies you and all of your family can watch, get together, eat pizza, laugh like crazy, and watch it two more times.There are so many funny parts, like when Kurt was trying to get Edison's attention and gave him the finger, and then threw a paint ball gun at him so they could play paint ball. On that part, I kept saying \"Remember, Remember?\"to my cousins who saw it and showed them what happened. There was also a really funny part when Edision ran into the room and Kurt was there(just before they fought) and Kurt was talking about his \"Strange dream\" and how he was \"Superman\". I LOVED that part, although it has been a while since I saw it, so I don't remember that part. Everything the actors said were funny, like how Kurt says, \"I worship you, like a GOD!\" to the robot.Although there was some bad things, in all it was a GREAT movie. Man, I can't stop laughing. I wish I had that movie. );","Well,what can I say?This film had it all. Funny Chinese fighting,funny Chinese talking, Funny Chinese haircuts, and coffee. I really fancy that one from friends. The robot is so realistic I thought it was a human!!! I almost wet myself it was so scary!The only thing I didn't like was that there weren't no yellow robot,I would have called him Mr.Sparkles and he would'ave been my friend. I recommend this film to fans of romantic comedies and viking films. I give it four and a half thumbs up!!! Gordon the third.","I have so much hope for the sequel to Gen-X.  Luckily, my hopes have came true.  You got a whole bunch of action, comedy...silly comedy, and surprises.  I think the newcomer Edison, is really a hit in the movie, but I really find Sam's 'Alien' stupidly annoying with English.  Although the movie had some flaws with the robot graphics and the silly dialogue, the action always keeps it strong. The action set-up is much stronger than the 1st.This movie is getting more of an American feel since 60% of the movie is in English from the Cantonese.  This movie will not disappoint you. I recommended this for young 'uns that care about pure action-packed fun.","The first GEN-X COPS was one in a new wave of youth-themed films from Hong Kong, in which the likes of Nicholas Tse, Stephen Fung and Daniel Wu broke into cinemas and offered fresh, ultra-frenetic produce in the crime thriller genre, which was rapidly running out of steam with the likes of Jackie Chan and John Woo concentrating on their US fare and new ideas feeling few and far between. It was a successful film that got by on its youthful excesses and energy alone, but this follow-up is something else entirely.Only Stephen Fung and Sam Lee return from the first movie, but this time around they're joined by another pretty-boy, Edison Chen, and a plot that seems to be a mash up of ROBOCOP and a dozen other robot-themed movies. In a nutshell, a young computer hacker manages to win control of a police robot that's been designed to subdue criminal elements with maximum firepower; it's up to the young heroes to put a stop to his plans.GEN-X COPS II: METAL MAYHEM is a cheesy film, to be sure, and also very funny with it. So many scenes are played for laughs (particularly anything including Sam Lee's character) that at times I suspected that Benny Chan was making an out-and-out comedy. Everything involving the robots is particularly entertaining, with wild, anything-goes effects work and a real zeal when it comes to destroying the scenery. The plot is slapdash and all over the place, but the action is ladled into the mix thick and fast so that it all becomes very effortless (and entertaining).Of the cast, the central duo of Chen and Fung are merely required to look cool and kick ass, which they do at frequent intervals. Maggie Q appears in a minor, next-to-nothing role before she got famous, and American comedian Paul Rudd appears as a typically wooden westerner. Best of the bunch is Lee, whose humour helps to make this movie a great deal of fun.","I decided to watch \"Gen X Cops 2: Metal Mayhem\" immediately after I had seen the first one. And that turned out to be a big mistake. Why? Well this sequel was just downright bad compared to the first movie.The story is about the creator of a robot stealing his creation back as he apparently had his creation stolen away from him. He steals it back and will sell it to some Arabs. But the FBI are working with the Gen X Cops of the Hong Kong police and the job is up to them to stop this from happening. But things run hot between the FBI and the Gen X Cops.Story-wise, then \"Gen X Cops 2: Metal Mayhem\" was sort of stupid and they tried to incorporate a lot of really bad comedy that just didn't work out in any possible way. If anything, then the attempts at comedy just made the movie even worse than it initially was.What impressed me was that they had managed to get Paul Rudd to participate in this movie. And honestly, then I must say that he was actually doing a good job, and it was a nice change to see him in an action movie and not in the usual romantic comedies that he usually stars in. And another treat was seeing Anthony Wong make a short appearance, a cameo much like Jackie Chan's cameo in the first movie. But still, despite Paul Rudd and Anthony Wong, then it wasn't really worth it to sit through this movie.There was a good amount of action in the movie, that worked well in the favor for the movie, however the fighting was stunted and halting, and the special effects weren't anything to applaud. And this really brought the movie down a couple of notches.And what was up with the lame part about using Edison Chen and Sam Lee's actual real life names as the names of their movie characters as well? That was just ridiculous.Do not watch the first one and then watch the sequel immediately after, because you will be sorely disappointed.","First and foremost, this movie was surprisingly released in 2000, and not in 1991 as it clearly looks. I'm still trying accept this. Let's just say the cinematography isn't a reason to see it. Gen-X Cops 2: Metal Mayhem (also known as Gen-Y Cops) is a thoroughly amateurish, incredibly cheesy Hong Kong attempt at a Hollywood-style blockbuster. I haven't seen the first Gen-X Cops movie, so I can't compare the quality between the two. The sequel, however, falls firmly into the \"so bad it's (almost) good\" category. The dubbing is atrocious, the fight and action scenes (while occasionally entertaining) are poorly choreographed, some of the acting is beyond awful, and the story is a mess of stolen robots, police officers trying to clear their names, maniacal hackers, and slapstick humor. Probably my least favorite thing about it was that it was simply too long and too often it was boring. I only watched the movie because of Maggie Q. (not nearly enough of her) and Paul Rudd (in his most ill-fitting role ever, though he still manages to be unintentionally funny). If you have similarly extraneous reasons or you just want to see a cheesy, weird movie, give Gen-X Cops 2 a shot. Otherwise, stay far, far away. "],"review-user":["acids","lukasx123-1","ngr_82","leanmeanbean8","Arkiliknam","ManMonk","Zillamen","eakarras","Mrswing","Kage-3","leonblackwood","SmokeManmuscle","claudio_carvalho","grace4108","AlbertV79","keVin-19","Jordan-M","exo_kopaka","fruit_celler","ironsidev","Leofwine_draca","paul_haakonsen","lewiskendell"],"review-date":["19 December 2000","12 March 2009","3 May 2003","13 March 2004","21 December 2000","17 July 2003","20 August 2003","1 March 2002","24 March 2001","3 May 2001","20 December 2015","20 March 2006","26 July 2004","1 August 2001","5 July 2001","22 December 2000","18 December 2002","27 June 2005","2 October 2004","24 January 2001","27 April 2013","20 August 2012","20 April 2012"],"review-rating":["10","10","1","10","10","1","2","2","4","9","9","1","9","9","6","3","4"],"review-title":[" this is a fun and entertaining movie to watch\n"," UTTER GENIUS!!! (But only if taken as some kind of parody!)\n"," BAD to the limits!!!\n"," Interesting no-brainer\n"," Funny, action packed, and awesome... must see!! Even good music!\n"," Y oh Y.\n"," Highly enjoyable martial arts movie.\n"," Good lord\n"," Another failed Hollywood-wannabe extravaganza from HK\n"," Film could have been a stand-alone, but was sequel instead.\n"," Not That Great! 2/10\n"," Terrible...\n"," A Complete Mess, With Confused Screenplay and Not-Well Developed Characters\n"," A great movie\n"," They are back...\n"," Absolutely awful!!!\n"," \"Gen-Why?\" Cops. Yeah, that was witty.\n"," Super Coolness!\n"," Brilliant!!!I loved every minute of it!!!\n"," Getting better...with action!\n"," Cheesy, hilarious, robo-themed sequel\n"," A disappointing sequel to say the least...\n"," Not exactly a Hong Kong masterpiece.\n"]}