{"review-url":["http://www.imdb.com/title/tt0202381/reviews"],"review-text":["A sign of what to expect in this film came when I spotted that this was the first (and probably the last) film to have in its credits a \"Vomit Technician\".In what is a couple of hours of silly gags, hilarious violence and excellent slapstick humour.This film was just what you'd expect from the Bottom boys, and it is great to see them back in their best form after Rik Mayall's life threatening accident.Richie (Mayall) and Eddie (Edmondson) are too similar to their Bottom characters, if we can have any criticism at all, and Edmondson does a surprisingly good job in directing the film also.This film has already spawned the predictable comparisons to Fawlty Towers that just aren't there, and the Guest House Paradiso itself  is hardly Torquay!Watch out for some excellently crafted dialogue amongst all the violence and mayhem.If you don't like Bottom you'll probably hate this - but I loved it.","I saw this when it first came out, and found it to be a work of some genius; but I must confess I was clearly in the minority at the time.For me, the progressive lunacy of the proprietors of Guest House Paradiso just gets better and better throughout the film, with one of the most hilarious climaxes to a film ever.But I wouldn't recommend it to Mother.Lovers of gross-out comic book style humour will appreciate this movie; there are subtle jokes hidden away, but they are usually quickly flattened by a comedy frying pan. Rik Mayall and Ade Edmondson are superb, and the deadpan, unsuspecting guests are also excellent.","I've always liked to think of myself as an intelligent and sophisticated viewer of both movies and television. I've always prided myself on appreciating films with strong, uncompromising stories. I know what David Lynch is going on about, okay?The only trouble is that, for some bizarre reason, the sight of Rik Mayall pretending to kick Adrian Edmondson in the groin (accompanied by an over the top crunching sound effect) never, ever fails to make me laugh like an idiot who's just seen an ex-Doctor Who slip over on a banana skin.So excited was I at Richie and Eddie's leap to the celluloid fantasy of the big screen ('ere, 'ark at 'im) that I arrived an hour and five minutes early. I'd been waiting for the film ever since the first rumours about a year and a half before hand.With such a build up, how could it leave up to my expectations? Well, I don't know, but it did.Hysterical laughter ensued right from the off (that's right, I even laughed at the close up of Richie sleeping that starts the film) and didn't stop for, ooh, some time (half way through the ending titles, I think).As movie sandwiches go, this one had a good spread, but had some very good chunks added to the mixture. Amongst the best were Richie's hysterical laughter/wince inducing 'Candle in the eye' and the scene with Simon Pegg's nipple ring that got a truly amazing reaction from a woman sat near me.So, I loved it. True, not everybody finds somebody getting a fire extinguisher in the face, or getting trapped in an oven, or all of the other really painful goings on funny, but we don't talk about them.Any problems? Well...it ended a bit suddenly. It took me a couple of seconds to realize the film was actually over. It did lack Rik and Ade's usual bitter nastiness - just look how many Bottom escapades ended with Richie and Eddie's untimely deaths.Still, a good note to end on: It's bloody funny. No, bloody bloody funny.","This is probably the funniest thing I have ever seen - from start to finish it was perfect in timing, atmosphere, punch lines, background music, fighting sequences and every other possible aspect you can think of. To be absolutely honest i find this movie as funny as their (Rik & Ade's) sitcom \"Bottom\" - maybe even funnier. I laughed constantly throughout the whole movie and can only recommend seeing this film... However, if you watch it without knowing (or liking?) the type of comedy Rik Mayall and Ade Edmondson has done before, you might not think it's funny at all - but I REALLY can't understand those who dislike it - THIS IS HUMOUR FOLKS!!! (People getting hit with frying pans, guys running around wearing red rubber lingerie, green vomit filling the hallways, guys getting kicked in the b******s and getting candlesticks in the eyes - HOW can this NOT be funny???) 10/10","The first time I had heard of Guest House Paridiso was in the, er... \"washroom\" after having just seen Fight Club. In each urinal was deposited a small, round black circle. When the circle came into contact with moisture (to put it delicately), it caused a colour picture to form, with photographs of the two stars and the tag line \"You'll P*** Yourself Laughing\". When you'd finished washing your hands, the circle had dried and faded to black again, waiting to spring it's surprise on the next \"victim\".Okay, maybe the punchline wasn't terribly sophisticated, but you have to admit it was innovative. In fact, I think I can honestly say I've never seen anything like it in my life before, and these days of over a century of cinema and marketing, that's a real feat. What a pity the film that went with it failed to live up to the promise.I hate to pan Guest House Paridiso and I am indebted to Rik Mayall (Richard Twat) and Adrian Edmondson (Eddie Elizabeth Ndingombaba) for many years of laughter through their appealing television series, be it the invention of The Young Ones (1982-1984), the sitting room plays of Bottom (1991-1995), or even solo work, such as Rik in the New Statesman (1988-1993). In fact, this would have made an hilarious 45 minute tv special. Unfortunately, its an 89 minute film.There's definitely some merit to be had, and I laughed continuously throughout the protracted finale, which spoofed the Exorcist and Raiders of the Lost Ark, and involved... well, you'll have to see that bit for yourself. Yet often the pace is leaden, and a sterile atmosphere is throughout. The two stars (Edmondson taking his usual backseat, this time due to the fact that he adequately directs) never really get into first gear, Mayall only sporadically showing the foul-mouthed mania that makes us love him on the small screen. Indeed, the writers' presumption that we are already familiar with the characters leads to them being underdelivered to the audience. The slight hints of depth seen in the series (Richie's effeminate, failed social-climbing for example) are not present here, and instead we are left with parodies of parodies.The Fawlty Towers accusation does pass water, complete with drunken chef and unseen, called-for waiter \"Pasquele\", which uncannily rhymes with Manuel. Some of the ideas, such a hotel next to a nuclear reactor with a childrens' swing hanging over a cliff face, are very, very funny, but ultimately the frenetic pace is stolen, the two constantly looking for a studio audience that isn't there, and all the \"dead laugh\" areas patched up with incidental \"comedy\" music that would have been dated in a Carry On film two decades ago.Paridiso's brand of puerile, sadistic, perverse humour IS funny, and I feel sure it will make you laugh ... just not as often as it should.","For any fan of Bottom, this film is the \"go to\". Its not quite Bottom though, Richard Richard is now Richard Tw@t (pronounce \"Twait\") and Eddie Hitler is now Eddie Elizabeth Ndingombaba, its not much of a change because it is still technically Bottom just set in a hotel. They even bring in some of the old cast members such as Steven O'Donnel who played \"Spudgun\" in the original show and here he plays the drunken chef and you'll recognize a young Simon Pegg and Sophia Myles entering their Bottom debut.The funniest part of this film has to be when Richard Tw@t runs around the hotel wearing nothing but a rubber bra and panties. Its nearly the dumbest thing I've ever seen him do, it doesn't even compare to The Young Ones when he tried to kill himself with laxative pills. How he got from talking to a love Goddess to blowing up in an oven while still having the underwear on, I have no idea.In the long run, yes this is definitely one of those \"plot doesn't matter\" films, so sit back relax and take an hour and a half of Ade and Rik nearly killing each other while running a hotel (it makes Fawlty Towers' service look like The Waldorf-Astoria). You'll enjoy this if you liked Bottom, Young Ones or Filthy Rich And Catflap.","Well, well, well! what can you say? Masterpiece seems to weak! perfect is not enough! Divine? perhaps. this is the best slapstick movie I have ever seen. the kitchen scene beats anything. It´s stupid, disgusting, and... totally wonderful. I worship this movie. (wonder why no one have done action figures of Richie and eddie)","I went to see it about 3 days before Xmas and lets just say it, it was a great Xmas trip!!!! Better than Fawlty Towers any day!!!!When I heard the name Mr. Twat, I killed myself laughing!! With him getting stuck in the oven with that underwear was brill but oh the chef was hilraious!! Spud Gun at his best!!! But I look around and everyone seems to hate it!!! Well youre not true Bottom fans!!! Im getting it when it comes onto video, thats for sure!!!!","Guest House Paradiso is Rik's and Ade's finest hour, given the big screen treatment it is way better than Bottom. I really do not understand why this film has such bad press is it Rik's reputation and his love hate relationship with the tabloids? The manic cartoonish violence, the bottom/toilet humour and schoolboy jokes are not everyone's cup of tea but Ade and Rik as their characters in the TV show are, are purposely absurd and unsophisticated characters, this is why internationally they are immediately recognisable and loved. Mayall and Edmondson do their best to craft a wonderfully crude film with humour that will be understood in ever country on the planet, if this is what they set out to do, to make an international popular hit, they succeeded hands down. So in my humble opinion this Guest House Paradiso is a stonking success and their finest hour.","The Guest House Paradiso is situated right on the edge of the cliffs on the English coast with great views on one side and a nuclear power plant on the other. As if that wasn't reason enough to avoid it, the owners, Eddie and Richard, are about the least competent or hospitable people in the hotel trade  making Basil Fawlty looking like the best manager in the world. When a disaster in the kitchen proves to be the last straw for the few guests living there, Richard and Eddie finds themselves alone in the hotel. The blissful peace doesn't last long though, because a young family (The Nice's) turn up, with the Paradiso being the only place they can afford. This is bad enough but things are only going to get more complicated when an Italian film star, rubber swimwear and a dish called \"fish surprise\" come into play.It is not always possible to say that a film is bad or good because sometimes they are aimed so specifically at a particular audience that if you're not in that group then it is likely that you will hate it while they think it is fantastic. In these situations it is possible that the \"majority rule\" is not necessarily right but Guest house Paradiso is an example of where you really want to be trusting the majority. Of course you could fall into a very small group of people who find uninspired crudity funny but, if that is you then you probably have more important things to sort out than to be watching this film. Those who like Bottom will love this but I would be surprised if anyone else found much to enjoy in this thing; the violent and crude slapstick is basically copied from that TV show, which is a problem because, as you might guess, I'm not a fan of it at all.The narrative here is pathetic though and makes Bottom's plots about sex etc look like highly polished works of literature. Here we have plots about Italian film stars, video tapes of rubber cavorting, nuclear fish and, when all else fails vomit, lots of vomit. The script doesn't offer anything other than crudity to work with and by the end of the film I had been worn down by shoddy jokes, crudity for crudity's sake and an endless feeling of being rather soiled by the whole affair. Normally I would sorry for the cast in this sort of film but since Mayall and Edmondson wrote and directed this they have nobody to blame. They can take a punch but they cannot make this tired old filth feel fresh or funny; by the time they are swimming in green vomit I really worried that they must have actually thought this was a good idea and worth doing. Support from Pegg is sad because he has shown himself to be much smarter than this with his various projects and this must have been like a low point for him. How on earth Casell, Nighy and Mahieu got involved is beyond me.Overall, if you think Bottom is the funniest thing ever then you will enjoy this film. For the vast majority of audiences though it is endlessly crude and constantly just aiming for the lowest form of humour that it can get; the \"big climax\" of loads of vomit just made me wonder what on earth the funders of this rubbish were thinking. I apologise to all the teenage boys who think this film is brilliant but I gotta call it like I see it and this is sh*t of the highest (or lowest) order.","\"Guesthouse Paradiso\" is a typical low-budget British movie. You've seen most of the cast on TV dozens of times and everything about it screams that no expense has been spent in its production. There are dozens of movies like this languishing on the shelves at BlockBusters so why pick up \"Guesthouse Paradiso\"?Only because it's pretty much the last hurrah of anarchic comedy duo Adrian Edmondson and Rik Mayall, who have spent the best part of 2 decades getting laughs out of bodily functions and cartoon violence. Anyone who is a fan of their \"Bottom\" TV series will know just what to expect. \"Guesthouse Paradiso\" is as deep and complex as a puddle of vomit but has a high content of laughs, wince-making fight scenes and stunts. Ignore the thin plot and concentrate on Mayall and Edmondson as they have a laugh and try not to injure each other too seriously.","bottom at its absolute highest perfection. who ever says slap stick comedy is dead and boring is completely wrong. not that this film will only appeal to those who are of a masculine nature. this is another quality British dark comedy with many many jokes not violence related, but it helps if you can let your senses go and laugh at the sheer stupidity of it all.this is a true example of thriving British ingenuity and homegrown talent hats off to them. on a performance level it reminds me very much of the early works of the marx brothers where the same level of enthusiasm and devotion are present in their acting styles, resulting in a performance where the audience can really engage the innate human desire to see others suffer, yet to be detached and still feel safe, much like the principle many TV chat shows operate on. a truly marvelous bit of manipulation leaving all parties feeling better off.","I had seen Rik Mayall in Blackadder and the New Statesman, so I thought I'd give this film a try.At around 4 pm I bought it, at around 8pm I started to watch, at around 8.15pm I fast forwarded the remaining film to see if there was anything left watchable for a human being with a brain... but there wasn't. At around 8.45pm I threw the DVD into the dustbin. And that's where this \"film\" belongs.What ever happened to British humour? The humour so fine and witty, intelligent and artful that you find in Yes, Minister, Blackadder, Vicar of Dibley, Fawlty Towers or The Fast Show? The black humour Britain is so famous for? I don't want to insult anybody, but I presume even stupid children wouldn't find this funny. They deserve more intelligent fun. And Rik Mayall, you can do better, so please, do!","Wow, this film was terrible. It is as simple as that. It is actually the first time that I walked out early, as far as I can remember. This turned out okay, though: I had a very nice chat with two most charming girls while we all waited for the rest to finally give up on that crap they called a \"movie\".Where to start. Bad acting, bad jokes. Faecal humour, which I simply cannot stand. Sorry, but snot, pee and scat are *not* funny. You have seen the title picture? That scene actually drags on for about 5 minutes, with the two \"heroes\" hitting and mutilating each other, which is supposed to be humorous all by itself. It is not.Apart from body fluids, violence and cross-dressing, I do not remember much about this. At least not much good. I was really, really disappointed by this piece of garbage. Or let us be honest here: given that I am actually a big fan of \"british\" (i.e., black) humour, I was angry.So, want my advice? Three words: do not watch.","Possibly the worst film within the genre in existence. It was announced as a comedy, but is simply tragically pathetic. I don't think anyone could have achieved anything more terrible and irritating if they were specifically requested to. It is toilet humour at its very poorest, I would avoid even watching the trailer. I only went to see it because it was announced that if you like Monty Python, you are bound to love this. Whoever wrote that was either biased or seriously deranged. I am still bewildered how one can honestly believe such a statement. Rarely do I leave the cinema, really it takes a lot of effort for a film to have that effect on me: this one did it in just 30 minutes.","This was a funny movie and i am a big fan of The Bottom episodes and shows, however this has a very underrated rating. Its great though to say its budget was just 2million! Its comedy factor isn't as great as some of the earlier television episodes however it doesn't leave any of the best jokes out.Some may consider this a poor movie but befoure you judge it be sure to check out the television series first. Rik And Adrian edminson are two fine comedians who deserve another shot at Bottom and maybe even a guest house II. This movie has great acting and has a hilarious setting, overall this movie is pure bladder bursting fun and easily deserves a 9/10.I think you'll have to be British to like it though cause Americans have a different sense of humour?","I have always been a fan of Bottom, grabbing as many videos as I could find of the series here in the states. The chemistry between Rik and Ade is always genius, and the combination of smart writing and utterly stupid humor seems to work without fail. I thus sat down to watch this movie with great eagerness... and was utterly disappointed by the end.The first 3/4 of the movie can best be described as uninspired and poorly directed (sorry, Ade!), but with some utterly brilliant moments. Unfortunately, these laugh-out-loud moments make you realize how less-than-brilliant the rest of the movie is. The slapstick starts off funny but eventually becomes a bit boring, with only the perverted sex jokes to keep things humorous.The end of the movie (the 'green' scenes, for those of you who've seen it) was... perhaps the worst ending I've seen in the past decade. Honestly. It was one joke repeated about thirty times, followed by an abrupt ending that made no sense (which didn't bother me) and wasn't funny (which did).To sum up, I was sorely disappointed by this movie. I shall cling to the few brilliant moments in it, to retain the fondest memories that I can... but I have to warn you, if you're about to overpay for your NTSC conversion tape from the local importer, don't. There are far better things to spend your money on.","As an adult, this was the first film I ever walked out of It wasn't funny, it was just stupid and dark and really I can think of no redeemable factors. Even if towards the end it somehow improved it could in no way make up for the first 30 minutes or so. There is nothing worse than a film by people who think they are funny, talented or otherwise possessed of comedic brilliance when they clearly have lost it - if they ever had it before If you find this on DVD - by all means get it as it would make a fantastic gift for someone you hate. Acting - abysmal Writing - I think they were just winging it and had no script Filming/production - Blair Witch Project was of better quality.","It may not be Oscar material, however this was a very funny film. I was always a fan of Eddie (Edmondson) & Richie (Mayall). \"Bottom\" & \"Young Ones\" were legendary TV series', and it was about time they made a film. Some of the stuff they get up to is brilliant, from the pencil is the rear-end, to the rubber sex-pants, as well was the infamous line that Richie says when he falls and a candle he is carrying goes into his eye. He says to Eddie \"Candle In The Eye, Candle In The Eye\", and Eddie been the simpleton that he is, sticks the candle he's carrying into his eye. Can't forget when Eddie is on his motorbike, and he needs to urinate.... It was a great comedy, not to be taken seriously at all, but the film lacked with an ridicilous ending. Overall, a exellent comedy, full of laughs, and lots of fake green vomit. A 9/10.","i had been looking for this film for so long before i found it, i had seen it when i was younger and loved it, after my second viewing i still loved it and i still do.this is a love/hate film, if you like bottom, young ones, the comic strip, then you will find this funny. If you don't like that kind of humour then don't bother. I love this film and have grown up with these comedy programmes, for me this film is simply placing their comic genius on the big screen.. It is not an award winner by any means but if you just want good wholesome slapstick then this is it!the film lacks the quality of the TV series and this is usually the case with films but it still has enough material to keep you laughing even if a lot of the jokes are pretty similar to their previous work.yes, the humour is a little childish and not to everyone's taste but sometimes you just need that in a film.","Bottom has been my favourite sitcom ever since i saw it on t.v and the movie is even better if your a bottom fan i say this is a must buy!!! the plot is that Eddie and Ritchie run a hotel named guest house Paradise but not all goes right for them as customers leave until a famous actress come to stay they try there best to impress her but not all well go right this is a upbringing to British cinema so buy this and you will wet yourself with laughter. also starring Simon Peggi (shaun of the dead) and also bill neigh (love actually) it might of not done good in the box office or by the looks of it on this website but don't listen to them buy this and i swear you will love it","Okay, this may not be the most sophisticated movie you'll ever see. Actually, there isn't a bit of \"sophisticatedlyness\"* in it. It's puerile, adolescent, inoffensive, idiotic..And utterly hilarious. Basically, Richie and Eddie run the worst hotel in Britain. Cue some ridiculous antics with the guests while they beat each other up, try to get the rent money out of the only resident who is daft enough to stay, have an all night drinking binge with the boys from the power plant next door...And fall in lust with the beautiful actress who comes to stay to avoid the press. Give it a try if you're a fan of Rik and Ade and their work. If you're not...Don't get the movie. Simple as that.*I'm not being thick, this is a word from another one of Rik's fab jaunts into the movie world ^_^","This is a gem of a film, Slapstick violence a-plenty, Simon pegg and Green Spew.A suspicious looking power plant and an incontrollable motorbike add to this stonker. If you haven't seen this I can highly recommend it, maybe not quite as good as bottom but not far short.If you have never seen a man impaled by the nose on two hooks then what are you waiting for buy this film.I didn't even see the twist at the end coming when it turns out that Ritchie and Eddie are both ghosts.Feeb - 1 boiled egg."],"review-user":["redkiwi","Mark-1384","MrTrees","flensborg82","The_Movie_Cat","Morbius_Fitzgerald","Nils-Granberg","h_tails1983","ian-sturrock","bob the moo","extravaluejotter","samuelmrose","missmarmite","RMFendt","kristof-vajda","julie-james80","pkittybrainpuke","bonsaisamurai","molloy1986","Swannee13","p-robson2","Ozzys_Babe","will-237"],"review-date":["6 December 1999","22 October 2004","26 December 1999","26 January 2005","8 December 1999","7 February 2013","4 October 2001","27 May 2000","29 August 2003","19 April 2005","1 August 2007","28 August 2004","11 March 2006","8 November 2005","23 November 2006","15 June 2008","28 September 2002","30 April 2013","24 October 2003","6 August 2006","13 December 2005","22 November 2005","11 November 2005"],"review-rating":["9","9","10","4","8","10","9","6","7","1","1","6","9","1","1","10","7","8","9","8"],"review-title":[" 90 minutes of brilliant depravity\n"," Looney Tunes on speed\n"," \"Candle in the eye!\"\n"," Go rent it/buy it now ... NOW I TELL YOU!!\n"," Not as inventive as it could have been...\n"," The Bottom movie!\n"," \"Laughing my ass to pieces\"\n"," Am I the only one who loved it????\n"," Guest House Paradiso is Rik's and Ade's finest hour\n"," If Bottom is your idea of wit par excellance then go for it, but most audiences will end up feeling soiled and sullied by the whole nasty affair\n"," An Overlooked Classic (Sort Of)\n"," dark British comedy\n"," What was that???\n"," Catastrophic\n"," Appallingly pathetic\n"," Funny - But underrated.\n"," Has its moments, but doesn't live up to the TV series at all.\n"," I walked out\n"," Very Funny.\n"," slapstick gods\n"," F-In fantastic\n"," Bottom: The Movie\n"," Feeb\n"]}