{"review-url":["http://www.imdb.com/title/tt0253700/reviews"],"review-text":["While marginally better than most of director Fred Olen Ray's and executive producer Charles Band's most recent output, SIDESHOW still emerges as only a mediocre rendering of a decent concept.Five teens (two guys and two girls on blind dates and the wheelchair-bound kid brother of one of the boys) spend the evening at a traveling carnival and end up p1ssing off dwarf Abbot Graves (Phil Fondacaro, the contemporary answer to Angelo Rossitto), who runs the \"Doctor Graves Horrors of Nature\" sideshow exhibit--an attraction which features such freaks as Conjoin-O (a guy with a monster in his belly), Aelita the inside-out girl, Hans the bug boy and Digestina (a woman who lives in a pool of digestive fluid) (?!) Abbot doesn't take too kindly to being pushed around by one of the kids and decides to get even with them all by turning their worst fears or insecurities into reality.The characters aren't fully developed enough to get elicit much sympathy or interest and their eventual transformations are unfortunately rather predictable (a girl who hates being touched is turned into a doll in a glass cage, another who is insecure about her body is turned into a faceless woman with a nice body, etc.), but the film is reasonably well-made given the budget, the acting is acceptable and the make-up FX by Gabe Bartalos are pretty good. Also bit parts are played by Ray regulars Ross Hagen (as the sheriff), Brinke Stevens (fortune teller), Pete Spellos (freak with a monster in his belly) and Richard Gabai (game huckster).","Sideshow was one of the later Full Moon outings so that means it had a lot of potential to suck. It did, but it's better than most of the drivel they were putting out around this time (Ragdoll, I'm talking about you). We've got the usual 30-somethings masquerading as high school students who visit a traveling carnival and become permanent members of the freak show. The make-up isn't that bad, but some of the freaks don't make sense. I mean, Digestina? She lives in a vat of stomach acid and excretes toasters. What the hell? About the acting, let's just say it was bad and leave it at that. Phil Fondacaro is my favorite minuscule actor and he's the only one coming off as a professional. The movie ended very abruptly and just left me feeling stupid for watching it. But what else did I expect from a Fred Olen Ray movie? Oh, and I almost forgot Brinke Stevens is wasted in a bit cameo. The Videozone after the feature was very informative, however. It revealed that Fred Olen Ray was at one time a carnie. I knew it all along!!!","Someone else called this film a \"fable-horror\" movie, and I think that fits pretty well.  That's the concept at least.  A group of teenagers, each with their own vice, catch the eye of a twisted sideshow barker.  He decides to teach the teens a lesson by making them part of the freak show.  A cool idea, but could have been executed better.  The fate for some of the teens is shoved in your face too obviously, while other characters could have been fleshed out more.  Also, the ending was a serious let down.  No resolution or big twist or anything.  But as a low budget horror movie, it's pretty fun to watch.  If you're into cheesy spookfests, you should have a laugh watching this one.  I think one of it's faults though... that it takes itself too seriously.  It's a silly movie, and if it was a little more self-aware when it comes to that, I think it would have been better.  But at least there's enough neat carnival themes and b-movie monster makeup to keep you watching.","\"Side Show\" is one of the weirdest Horror movies ever made from Full Moon Pictures. Very gory in some places, but not as shocking as the Trailer makes it out to be (The Trailer for this movies shows all the gory parts). Also, the acting and visual effects are well done. I would recommend this movie to horror fans everywhere.8 out of 10Fans of Horror Movies like this should Check out Puppet Master, Skinned Alive, Slumber Party Massacre, Sleep Away Camp, and other Full Moon Pictures flicks. For other recommendations, check out the other comments I have sent in by clicking on my name above this comment section.","Sideshow is a good example of a basically interesting idea gone very, very wrong. As far as horror movies go, and especially with the influx of teen movies at the moment, a film based around a bunch of teens attending a mysterious freak show is something you could have a lot of fun with.However, the writer decided to make a very straight, very boring, very plain tale about five teens who become part of the show when enraged midget Abbot Graves transforms them into freaks using some pathetic machine that mutates them into beasts.The five teens are picked off one by one until the last guy is left, his 'punishment' being that he is unable to join his friends and thus 'be alone'. What a load of rubbish! The 'actors' are really poor, this film has no comedy (and it could have been so funny!), no gore (and it could have been so gory!), no action and no horror (and it could have had so much of both!) The director has failed in his duty to even try to make this a little interesting to watch. His experience in soft-core has obviously disabled any creativity he may ever have had, as all the shots are the same, with very few edits and little movement. The quality overall is poor.I'm not usually swayed by nudity in movies, but believe me the only high point in this film was a pair of breasts.","\"Sideshow\" is a cliché but interesting story.**SPOILERS** As the carnival comes to town, five people, Bobby, (Jamie Martz) Tommy, (Michael Amos) Grant, (Scott Clark) Melanie, (Jessica Keenan) and Jeannie (Jeana Blackman) wander around playing the games, eating the food and having a fun time. When Abbot Graves (Phil Fondacaro) announces the opening show for a spookshow, they all line up to see the sights. Grant tries to explain how they did the make-up effects but after a while, Jeannie becomes jealous of some of the performers. Because of their individual reactions to the performances, they all become separated. They find evidence of foul play and go to the police, but Abbot Graves is able to convince them that nothing is going on. After they can't find her, they begin to wonder what to do. Grant feels like something is wrong, and convinces Tommy and Melanie to go look for her back in the sideshow. They get captured and transformed into what they supposedly deserve. Only Bobby remains normal person. Learning from Madame Volosca (Brinke Stevens) about his and his friend's fate, he finally leaves the carnival.The Good News: I have never liked Carnival Sideshows for this reason: they are creepy and make me uncomfortable to be around. This film perfectly captures this spirit and does it well. This is a carnival that actually seems creepy because the freaks in it are not the usual freaks in a sideshow. All of them are also pretty unexpected as well. They were pretty scary realized and manipulated, yet shared the inhumanity that makes them look like sideshow freaks. All of them were also designed to creep people out, and they did creep me out. What was also new was that there was one person left alive at the end. Normally, these movies kill off all of the characters and left town. This was a very nice and new touch that not many films would try to get. It has that \"Wishmaster\" vibe to it, that those who get wishes will get their just rewards. I really like this theme for films and it should become a more regular fixture in friends.The Bad News: Unless watching the freaks in the sideshow is not upsetting for you, then this may be a less enjoyable film. I really can't see why, but it can seem that way. Like all Full Moon films, this contains no jumps or shocks to make it a more interesting experience. This has to become a very noticeable change in their films, as I've only found one film, \"Shrunken Heads,\" that contains a jump. With all the films in their catalog, they do have a niche, but it isn't among those that like to be scared with their horror films.The Final Verdict: Unless you like Full Moon films or hate carnivals, this would should be approached with caution. It does star two cult stars, Brinke Stevens and Phil Fondacaro, but the fact is that it does need something else. Take a chance, which is all I can say.Rated R: Violence, Graphic Language, and Nudity","This was not a very good movie, the acting pretty much stunk and the effects were bad most of the time. But there were some funny moments but most of those were not meant to be funny. The most hilarious part of the movie to me was the part were a little kid in wheelchair falls out (thats not the funny part What kind of person do you think I am)anyway the kid falls out and starts screaming for his big brother, well the brother comes running and the way the kid runs is so funny he's all stumbling and really over acting I had to rewind it several times so I could laugh some more. so if your looking for something to rent but just can't seem to find anything check  this one out and watch for the running part.","Stay away from this movie.  Far away.  Phil Fondacaro stars as the demented ringleader of a Freakshow.  Every performance is flat and unfeeling, except Fondacaro's.  The plot is a simple one, and follows almost every horror movie cliche possible.  A group of high-school kids go to a carnival, see a side-show, and get in over their heads.Fans of Fred Olen Ray should be warned, this is not like any of his other films.  This one is lacking in all departments (humor, sex, horror, etc.) other F.O. Ray movies excell in.The version I saw also contained a Making-Of documentry, in which the director makes comments like \"We had a limited budget\" and \"with our limited timeline\" which speaks volumes about how much Charles Band cared about this film.  Go rent \"Droid Runner\" (Fred Olen Ray) or \"The Dead Hate the Living\" (Full Moon) instead. Full Moon should be ashamed of themselves (and that's saying a lot after seeing \"Killer Eye\")Grade: D-","Teens go to a Fred Olen Ray sideshow and get what they want or deserve. Typical Fred Ray/Charles Band type of \"B\" film. Master of Ceremony has a \"monkey paw\" conversion machine. Guide: F-word. Nudity ( Shyra Deland Curran Sympson-partial nudity)","This movie is awful. It has an awful story line. It also has awful ending. It is very very very mush a pile pooh. 3.8 is not a good ratting but this is such a bad movie. That 3.8 is overrating it. This a 1. This got to be one of the worst horror movies of all time. It so stink. Do not wast your time. Do not wast your money. Do not see this awful movie. This is a big pile of pooh pooh with pee pee on top. This not scary. It is just strange and stupid. It a very pooh pooh horror movie. Not like Friday the 13th (1980) which is a good horror movie and very scary. This is just pooh pooh. I think because people do not like horror movie that means it good. But some times people are write not like a horror movie because it is pooh pooh.","Full Moon Studios is a film production company that mainly does horror films. In fact, that may be all they do. They had a few good films back in the day, their strongest period probably being in the 80's as in the 90's they made nearly everything a horror/comedy. They never were as bad as Troma though, as their films felt like they were almost big time, but not quite, while everything about Troma says cheap. That being said, for the most part, I really do not care for the movies this studio churned out during the 90's. A lot of them had potential, but just missed the mark and some of them were just horrid abominations that never even should have been conceived. This one I found to be kind of okay which is high praise indeed for one of their movies made after like 91 or so. It was not a great film by any means, but I was enjoying what they were presenting and even if I were hating it, one thing nearly every Full Moon Studio film does is end fairly quickly as they usually do not clock in over 1 hour 20 minutes. The film's main fault I found was that it did end too quickly as one minute it was on, the next it was over.The story has a group of sort of friends going to a carnival. The group consists of an obnoxious dude that wants to be the center of attention, his friend who seems to be the most sensible, a girl who wants to be worshiped, but has space issues, a girl who wants a hot body and the sensible boy's brother who is confined to a chair. The obnoxious guy has trouble with one of the games and the wheelchair bound boy figures the game is rigged and after this the proprietor of the freak show seems to take an interest which grows when the obnoxious person makes fun of the proprietor for being a little person. They go into a fortune telling hut where they are read their fortunes and they also get tickets to the freak show where they see some rather disturbing freaks and soon the girl who wants a perfect body goes missing. The friends with the exception of the sensible one just have to try and search for her which brings them all into danger! The freaks were pretty good as the strange bug man looked rather good as did inside out girl. The one guy whose brother lived in in his belly was right out of Total Recall and then they had one that I did not get at all in Digestina. They billed her as being able to eat anything, but all she did was sit in a vat of acid it seemed. She kind of made no sense; however, she was the hottest girl in the film. The teens are all idiots and probably deserved worse than they got. The sensible guy though ended up just in a field and then the movie ended. Not sure what that was all about as in this particular case I kind of wanted the film to go on a bit. Ross Hagen turns up in a bit part as the sheriff and Phil Fondacaro as the proprietor does a really good job in this one too.So perhaps had they worked on the ending I would have enjoyed it more. The film plays out as kind of a dirtier version of Something Wicked This Way Comes, but with less chills. You never get a real sense of danger in this one as you really do not care about the group of friends except maybe the guy who keeps telling everyone they should leave, but they want to stay to find their friend, but not really. They all have kind of selfish reasons for wanting to find the girl and they all get what they deserve. This one might have been even better had they done it earlier as back in the day Full Moon films did not have enormous budgets, but more than the 120,000 this one had. They generally had 1,000,000 which may not sound a lot by today's standards, but could have helped this film out a lot as there is a cheapness about it. Still, it was kind of okay, just wish they worked on that ending a bit more.","A group of teenagers visit a freakshow attraction at a traveling carnival. The kids are all taught nasty lessons about themselves from sinister ringleader Abbot Graves (marvelously played with tremendous theatrical flair by Phil Fondacaro). Director Fred Olen Ray relates the gnarly macabre premise at a quick pace, does a good job of capturing and conveying the creepy seediness of the carnival setting, and maintains both a pleasingly eerie mood and a grimly serious tone throughout. The acceptable acting by the competent no-name thespians who portray the kids keeps the picture humming: Jamie Martz as the meek Bobby, Michael Amos as mean jerk Tommy, Scott Clark as sympathetic wheelchair-bound cripple Grant, Jessica Keenan as the stuck-up Melanie, and Jeana Blackman as frumpy and insecure wallflower Jeanie. The make-up by Gabe Bartalos for the various freaks is strikingly grotesque and imaginative; my favorites are the luscious Curran Sympson as Aelita the inside-out girl -- she does a truly sick variation on your standard striptease! -- and Peter Spellos as Conjoin-O, who has a head living in his stomach. Benjamin Carr's twisted script has a dark fairytale-like quality with the kids all meeting appropriately nightmarish fates that reveal their true natures. Popping up in snazzy small parts are Brinke Stevens as fortune teller Madame Volosca and Ross Hagen as the crusty sheriff. Mac Ahlberg's sharp cinematography and the shivery score both further enhance the overall spooky ooga-booga atmosphere. An enjoyable horror outing.","A group of teenagers mess with the ringleader of a freak sideshow and of course the ringleader takes it upon himself to teach the teenagers a nasty lesson.Brinke Stevens is totally wasted in a cameo performance, the ending is terrible, and the special effects are pretty sorry, even by Fred Olen Ray's standards. Rent Jack-O or Hollywood Chainsaw Hookers instead.Rated R for Nudity, Language, Graphic Violence, and a Mild Sexual Situation.","What appears to be an average B-Movie style develops into an enjoyable delve into Twilight Zone-esque Sci-Fi.Well crafted ideas, apart from the 'human budgie'(!?), keeps it interesting although the camera action leaves you feeling your watching a TV movie rather than a cinema flick.Slows down near the end but rejects a cliched finale.Not bad.","The film has kind of a cool concept, but suffers from a poor script and extremely slow pacing.  Some of the performers are fun to watch especially with the material they were given. One standout is Jeana Blackman who plays the role of Jeanie.  Even with the problems with the script, she manages to bring a depth to her character and finds some very nice moments - especially in the scene where she and Jamie Martz are buying the popcorn.All told, I'd probably rate this movie a C-/C.","Out of the three newest Fullmoon films Im aware of(Dead Hate the Living,Killjoy,and Sideshow) I'd say sideshow is the best out of them. If you like so bad so good horror movies,this one is ok....it doesnt suck,its not a Plan from Outerspace or Troll 2.The dwarf was awfully good and Digestina was HOTTTTTT!!!!!This movie is worthy of a bad movie night with your friends. If you want an actual good horror movie then what the HELL are you doing watching Fullmoon films for? Oh yeah for cheese fans....STAY AWAY FROM DEAD HATE THE LIVING!!!!!","This is a great horror movie. Great Plot. And a person with a fear of midgets will definately love the evil midget! This is a must see for any horror fan. Finally a lower budget movie with decent effects and a great cast! Highly recommended."],"review-user":["capkronos","Backlash007","bsdryn","The Creeper","shes_dead","slayrrr666","Ghostly83","baskil","nogodnomasters","jacobjohntaylor1","Aaron1375","Woodyanders","brandonsites1981","guitarphil","Scott-262","Che Z. Scare","marcicw"],"review-date":["22 August 2003","28 November 2004","21 July 2003","1 January 2003","20 February 2006","8 January 2005","14 November 2001","14 August 2000","17 September 2018","31 May 2017","12 October 2015","27 February 2013","12 September 2001","9 June 2002","17 May 2001","17 March 2001","8 July 2003"],"review-rating":["5","4","8","1","8","3","1","6","1","6","8","6","5","10"],"review-title":[" This one was alright.\n"," \"Step right up.\"\n"," cheesy horror fun that could have been better\n"," Weird Horror at it's Best!\n"," Nice idea, terrible film\n"," Pretty creepy and not all that bad\n"," not as bad as some I've seen\n"," A sad, sad outing from Mr. Ray\n"," Five fates. Five dollars.\n"," A pooh movie.\n"," Kind of a take on Something Wicked This Way Comes\n"," Cool little low-budget fright flick\n"," * out of 4.\n"," Suprisingly Enjoyable\n"," Okay for a B-Movie\n"," An ok piece of cheese.\n"," Step Right Up\n"]}