{"review-url":["http://www.imdb.com/title/tt0206305/reviews"],"review-text":["Co-scripted by William H. Macy from, arguably, Donald E. Westlake's best and hardest to find novel, \"A Travesty\".  *Very* faithful to the story, the movie stars Macy as a hapless man who gets in way too far over his head after attempting to cover up an accidental death.  Costars Adam Arkin and James Cromwell in good supporting roles.  The strength of the movie is in the intricate twist-after-twist storyline and in the acting, particularly by Macy who routinely and delightfully breaks through the 4th wall here and gets away with it every time.  A good storyline with much dark humor, this one engaged me enough that I've watched it three times in the week since it came out.  Prepare to shelve your critical faculties and emit a loud, bipartisan \"wheeeeee!\".","Okay, I love Bill Macy, who's invariably fun to watch, with those pouchy eyes and that \"please don't kick me again\" expression-- or maybe it's \"please don't kick me again so hard.\" And I love Donald Westlake, one of the best writers of light capers on the scene today.  Westlake wrote the novel on which this is based, which I seem to recall reading as \"Enough,\" not \"A Travesty,\" which is what it says in the credits.  The combination of these two guys is inspired, all the better in that Macy co-wrote the adaptation and tailored the lead precisely to his acting strengths.  Macy just looks like a typical Westlake hero-- only, as one of the other characters points out, he really can't be the hero if he's killed his girlfriend, even accidentally.  And he's not really the hero, I guess, although you do sort of root for him.  Macy plays Jerry Thorpe, a not-very-nice TV film critic, whose attempts to evade the consequences of committing an accidental murder get more and more involved as the plot thickens.  It's an anti-Columbo, where we follow the criminal, not the cop, and wonder when and how he's going to blow it.  Macy's stayed true to the book, adding a lot of character touches and a couple of nifty flourishes.  He even includes a funny reference to one of his own previous pictures, \"Searching for Bobby Fischer.\"  I guess, for me, the fun was just watching Macy have so much fun in a leading role-- like Steve Buscemi, he's a terrific character actor who rarely gets the chance to carry a film.  He carries this one, and I hope to see him carry more.","\"A Slight Case of Murder\"  is an excellent TV movie, which is defiantly worth the price of a rental. William H. Macy is great as a movie critic who accidentally kills his mistress, and then has to try to conceal the crime. Although that may sound dark, the film is actually quite light hearted and funny, with many memorable lines (\"Acting is harder than I thought- you ever see BODY HEAT? I think I owe Bill Hurt an apology\" and my personal favourite \"For next week answer these two questions about film noir, What do these people do during the day? and Why is it always raining?). The film has a great supporting cast including Macy's real life wife Felcity Huffman, James Cromwell and Adam Arkin. A must see for Macy fans!","This was a riveting film, one that really drew me in.  I'm a big fan of William H. Macy, and he puts in a wonderful performance.  His great likeability, coupled with the way his character breaks the fourth wall, really gave me a sense of complicity in his actions.  I found myself waiting tensely for the whole house of cards to come collapsing down around him (and by extension myself, as his confidante and silent witness).  It took several minutes for me to relax once the film had ended, I was so wrapped up in it. Good performances all around, too, not just with Macy.  Arkin was quite good, as was Cromwell (he was surprisingly fierce). In short, I highly recommend this film to any fans of Macy and/or the murder mystery.  But you may want to prepare to feel a little guilty.","William H. Macy is terrific in this Alfred Hitchcock-esque film.  Macy stars as a film critic who accidentally kills one of his girlfriends.  The characters that ensue are hilarious.  James Cromwell gives a terrific performance as a blackmailing private detective.  As always, Macy is incredibly funny and gives a phenomenal performance.  See this movie whenever it is on t.v. and check your video stores because this is one you don't want to miss.","William H. Macy is brilliant as Everyman caught in a desperate situation. Starts off with a bang and never lets up.  Twists and surprises are fresh, unpredictable.  Use of film noir clips and frequent quotes and references to 30's and 40's flicks makes this a delightful \"must\" for movie buffs.","William Macy is perfect in this unique contemporary film noir. The look is 40's although its not really a period piece.  The interaction of Adam Arkin and Macy is electric, with multiple cat and mouse games being played.This movie raises the bar in TV movies, and is an intelligent entertainment with an unguessable ending.Loved it.","\"A Simple Case of Murder\" is a tight and clever little noirish caper comedy-drama made for commercial tv. William H. Macy, that \"Fargo\" guy, is at the center as a film critic who has an argument with a lady friend who slips, hits her head and dies. What follows is a slow, one step forward and two back unraveling of Macy's cover up scheme which leads to extortion, robbery, murder and lots of tongue-in-cheek humor while Macy narrates from both sides of the camera. A fun little \"sleeper\" on video.","when I realized that the main character in this movie is the same man (William H. Macy) who provocate all the deaths in FARGO. I said \"man, you are a real maniatic\". the  story has his own way to tell the story.also the camera takes are fantastic. the first take \"going up the building\" are awsome, very clever.I trully recommend this picture, not only because the story, is a great movie if you're a \"Movie Classics Lover\".","It is probably the reductio ad absurdum of the self-conscious neo-noir that its ultimate hero/villain/victim should be a film critic, about as far removed from the original prole/lower-middle-class noir heroes (e.g. 'The Postman Always Rings Twice', 'Double Indemnity') as you could get.  Faced with a crisis, Terry Thorpe turns it into a screenplay, a fiction.  And this is what saves the film from smart-alecky ghastliness - it is a film about mid-life crisis, the flaws and difficulties of the modern affluent, middle-aged man.  it seems like noir can still speak for people rather than to itself, but this often palls - the best joke is a corpse called Laura who doesn't get up.","William H. Macy is a film critic caught in a spider web of deceit in this TNT original, co-written by Macy, a self-referential noir in which Macy speaks directly into the camera to us, letting us know he's not such a bad guy even as he accidentally kills his mistress, brains his blackmailer, robs a bank and screws the head investigator's wife. Macy is so likable he makes any number of lame situations work, and the disjunction between his relationship with us and with the characters on-screen is pretty amusing. There is even some pretty amusing subtext about the critical constipation and impotency of critics, but it never drills very much beneath the ironically detached veneer to be more than lightly satisfying.","William H. Macy is dealing with \"A Slight Case of Murder\" as well as with his libido and blackmail in this 1999 TNT movie. The film also stars Felicity Huffman, Adam Arkin, James Cromwell, Julia Campbell, Paul Mazurski, and Vincent Pastore.Macy plays a film critic and teacher, Terry Thorpe, who accidentally kills his girlfriend and becomes frantic to cover up the crime and hide the body. The matter is complicated by a detective (Cromwell) who saw him at the building and is now attempting to blackmail him. Then Thorpe makes the fatal mistake of getting involved with someone else -- someone else besides his other, alive girlfriend, played by Felicity Huffman.Using a convention from Columbo, Thorpe works on forming a friendship with the detective assigned to the case, Stapelli (Arkin) - which has interesting consequences.Macy is the same befuddled wreck that he was in Fargo, but he's smarter and more worldly. He gives a wonderful, wacky performance in a film that is filled with all kinds of humorous dialogue and humorous moments, despite the subject. A fresh twist on the film noir. Recommended.","Just as in \"Columbo\" we see the fatality occur right at the beginning. What follows is an escalating web of lies, sex, blackmail, and murder. The investigating officer, Adam Arkin, is even somewhat of a fumbler, not unlike \"Columbo\". It is William H. Macy, as the movie critic suspect who carries the film. Constantly twisting and turning, the plot sends Macy deeper and deeper into the quicksand of his \"perfect crime\". William H. Macy fans will enjoy \"A Slight Case Of Murder\", as will those who like crime capers with all kinds of delicious possibilities. Add some well timed comedy, and this is very similar to a fine episode of \"Columbo\". Highly recommended. - MERK","Not a stunner, but a good movie to see once or twice. Bill Macy shows he can do more than just act; his writing was pretty darn good. Great supporting cast, especially Jamie Cromwell as the extortionist private eye.The movie's greatest strength is the work of Macy, who reminds us of his Jerry Lundergaard role from Fargo. He has numerous scenes where he is extremely funny as a slimy, manipulating and deceitful character. It's enjoyable to watch him be a weasel, and for a while I was happy that things were turning out well for him. *** out of four.","I saw this last night at a screening for a marketing company. It is Fargoesque, and was a lot of fun to watch.  It held my attention all the way through and did not seem to lag at all. I'd recommend watching it when it airs!","I can not say this movie was a hilarious, but I must have had a grin on my face the entire time. I like this darker kind of comedy; \"very bad things\", \"8 heads in a duffel bag\" or \"coldblooded\"The way the main character tries to get away with murder is a lot of fun to watch. To me it was not much of a surprise what the ending would be, but the way that ending came about was. Another thing that sticks out, is the way they have managed to involve the audience. The way Terry looks at us is hilarious, you can almost pretend you're his accomplice.","CAUTION -- CONTAINS SPOILERS --\"A Slight Case of Murder\" stars William H. Macy in a role not that different from the car salesman he plays in \"Fargo.\" Here he is a professional movie critic, and often his character speaks at the audience, directly into the camera. Although he has a nice, attractive and devoted girlfriend, he is weak. He is having an affair with a co-worker when she accidentally slips and dies while he is with her. Afraid, he slips away in the night, but is photographed by a PI (James Cromwell, who was the farmer in \"Babe\") hired by the jealous, separated husband. The PI attempts to blackmail him, and Macy whacks him, eventually disposing of the body parts in a lake over the side of his girlfriend's sailboat while she is fast asleep after he drugs her wine.Meanwhile the detective (Adam Arkin, \"Adam\" on Northern Exposure) befriends Macy, who ends up having an affair with the detective's wife. At the conclusion, as it appears that Macy will get away with his various transgressions, and is all set to have a happy life with his girlfriend, he comes home and his apartment is overrun with police. The detective has found out about the affair with his wife, decides to plant evidence (back door key, blood on shoes) to frame Macy in retaliation for seducing his wife, not for a second thinking he is really guilty.As the movie ends, and Macy is being taken away in a cop car, he says, \"If you ever decide to commit murder -- and I don't recommend that you do -- don't complicate matters by getting involved with the detective's wife.\" Macy co-wrote the screenplay, and plays the main character very well. For good entertainment, and a moderate amount of suspense, I rate it \"7\" of 10.","Macy is aces as always in this funny send-up of noirish films. Many funny references to other films, really a moviebuff's movie. Highly recommended. Kudos again to Turner Movies. They are a class act in television movies.","This one was a surprise and better than most films I've seen recently. Highly enjoyable from start to finish, this is a film that will surely satisfy 99,9% of movie fans worldwide. Great acting from everyone, great script, great story and fantastic plot and twists. Try not to miss it!","Turner and friends are closing in on HBO for the top spot among made-for-TV movie producers. This is a nicely paced, contemplative thriller of sorts. William Macy is stellar, as always, and Adam Arkin offers one of his better performances. A bit more lively than classic Hitchcock but not as in-your-face as typical movies of its type, A Slight Case of Murder eases you in and never lets go. (Note: I saw a preview copy, which means I didn't have to wait through commercials. Those interruptions may hurt the pacing, but you know this will be available on video sometime","When they announced this movie for TNT I was excited.  A Travesty from Donald Westlake's \"Enough\" was one of my all time favorite stories.  After I watched it I was not all that thrilled.  Recently I had the chance to watch it a second time with my aunt, and once again I was disappointed (she didn't like it much either, and she'd never read the book).  In this movie they managed to sap all the charm from the book and turn it into dull mush.  A big part of the problem was William H. Macy.  I like him fine in other films, but he played (Terry/Carey) Thorpe as a stammering, incompetent yutz. In the book Thorpe takes a lot of valium for his nerves, but remains outwardly collected at almost all times which is part of the fun.  SPOILERS follow: They also left out a big part of the story (other than a 2 second glimpse at the embassy), where Thorpe solves not 1 but 4 homicides for the police.  This is important not just because it's funny, but because it helps set up the relationship between Fred and Thorpe.  In the movie Fred's betrayal in the end is not nearly as affecting, because they don't seem all that close.  In the book they become pretty good friends especially on Fred's side, which makes it all the more ironic that he is he one that arranges Thorpe's downfall.  Fred also suffered a bit from casting, I love Adam Arkin but he was not a cheerful, happy to be alive upbeat sort of Detective, character traits which book Fred possesses which makes it more obviously out of character for him to mess with evidence and thus more shocking.  Patricia and Edgarson were pretty close to the book, and James Cromwell was great despite not looking much like Martin Balsam.  The whole boring boat house scene which was entirely added for the film was much less interesting than the police finding Edgarson's body after Thorpe ships it to Seattle and blaming the death on the mob.  Kit was okay although she was mostly rewritten, and it would have been nice to see her die as she did get slightly annoying.  I don't mind changes to books to make movies, I know they are necessary because of length and difficulty, but it would have been nice if some of the changes in this movie had been funnier or smarter instead of duller."],"review-user":["davelocke","Ian-121","dvanhouwelingen","CSniezek","natebbn","Prophetess","canepa","=G=","valyruiz007","the red duchess","ALauff","blanche-2","merklekranz","McClane-5","Thirstee","oslcool","TxMike","loupgarou-2","grimsi","Leroy-13","eily"],"review-date":["26 September 1999","19 September 1999","4 October 2000","19 September 1999","19 September 1999","26 September 1999","6 September 1999","5 October 2001","21 December 2003","18 May 2001","15 February 2005","14 September 2011","3 March 2008","24 September 1999","1 September 1999","9 July 2001","26 May 2001","28 February 2001","7 July 2000","24 August 1999","29 July 2001"],"review-rating":["9","8","9","10","8","6","6","6","7","8","8","7","9","8","4"],"review-title":[" Prepare to shelve your critical faculties and emit a loud, bipartisan \"wheeeeee!\".\n"," A nifty little postmodern anti-Columbo\n"," Wonderful, comic murder mystery!\n"," I feel guilty!\n"," A terrific dark comedy that grabs you from the start!\n"," Fresh, clever, funny\n"," Delicious contemporary film noir\n"," A fresh, creative, tight tale of mischief, misdeed, & misadventure\n"," Another forgotten tv movie\n"," This is what happens when you spend your whole life watching movies.\n"," Lightly amusing--pretty good for a TNT original\n"," fun TV movie\n"," Like an episode of \"Columbo\" with William H. Macy....\n"," Pretty good fare\n"," Cute, quirky spoof on Murder Mysteries!\n"," Fun movie to watch\n"," Novel comedy, writing and starring credits to William H. Macy.\n"," Must see filmbuff flick\n"," Very, very, very good!\n"," HBO finally has competition for great made-for-TV fare\n"," Very Disappointing\n"]}