{"review-url":["http://www.imdb.com/title/tt0261877/reviews"],"review-text":["I accept that this film is a grim portrayal of a tough family life, but sometimes family life is tough and the film, by portraying such a hard life, is good for that purpose. Anyway, there are moments of humour that lift the film from being simply a dark \"grim up north\" piece. It is a shame to write the film off just because its subject matter is fairly dark. The film is well put together and John Kielty for example is a young actor at the outset of his film career at the time. It may not be a blockbuster, but for a young Scottish actor it was the perfect entry into film. (I'm speaking here from my own point of view, and not necessarily representing John's own feelings or those of the rest of the cast). If you have the chance then go and see this film. You won't necessarily be blown away, but you might have your eyes opened to how tough life sometimes is.","One Life Stand is an accomplished piece of film making which hasn't been given the credit it deserves. Its IMDB rating of 1.7 doesn't do it justice and is, perhaps, due to the very few screenings it has had rather than the quality of the film itself. Shot on digital in black and white, the film is well directed with production values that belie its shoestring budget. The performances are excellent, particularly that of Gary Lewis who gets better with every role. My only criticisms are that it is a bit on the long side and could have done with a touch more humour to offset the darker moments. Overall, though, it is a fine piece of work.","I was lucky enough to see this film at a festival last year and had half expected it to get a release. The fact that it was shot on a digital camcorder has surely inhibited its success, but as i understand it was never the intention of the film maker to make it LOOK LIKE FILM in the first place, it was more about the story the characters and their relationships. Is that not what films are supposed to be about!? But it did have a quality in the texture of its visual appearance that suggests May Thomas is onto something we should pay attention to. For independent film makers and producers alike who have a the talent and lacking the money and drive, a lot can be learned from watching this film, technically it has everything going for it, the use of light, music etc by far outweigh that of any other digital feature film i have ever seen and therefore it is worthy of much praise. The actors performances are believable to a point, if not slightly under played, i felt there was much more in there, more depth, in particular from the male lead John Paul Clarke. But one thing that really does bother me, as a film maker myself, is the film being in black and white a need to cover up a multitude of sins than if it was colour?  Do we have more to learn in the progression of digital technology? Or is this the future of wonderful, affordable film making?","I just watched the DVD of this award winning film. One Life Stand is a stark drama that through it's pace, black and white shots and atmospheric music, paints a very compelling and honest picture. It's a story about life's dilemma's around power, sex and control highlighted by a few sad lonely lives. The mother (very well acted by Maureen Carr) is uptight and drawn in on herself. The father only appears on the side-lines, and yet is a powerful and pivotal part of the drama. Money is hidden in boxes and shoes.The writing was superb, and I liked the sensual close-up shots of details such as nails, red lips, a candle, mirrors etc. The way the camera was used made it very intimate. It's a harrowing tale, with sexual undertones, while the Glasgow drizzle on the dark streets adds to the despair of the sad characters.There are some highly memorable shots conveyed simply by a walk, or a dropped shoulder - such as Trise walking away under the bridge. And the stunned and hurt look on Trise's face in the call centre, which hopes to helps people through using tarot cards, as she listens to a caller talk of her own abuse.At the start we see John Paul, wide-eyed and innocent, having photos shot as he wants to try modelling. Trise, his mother, is deluded and making poor choices for him, in a way pushing him away while she tries to keep him. John Paul's modelling turns into escort work and Trise's boss offers her money, and eventually they go on a date. There are also moments of humour and subtle irony. One excellent scene is when they are having a fairly normal meal, and starting to open up a bit, when the father appears with his dark presence and clouds everything over. But this, and other things offer moments of hope.I felt at times the pacing of the film was a shade too intense, but this is a small detail in another wise challenging and memorable film, and something a bit different. It stands in start contrast to most American films which are either total fantasy, or the real' world' as seen through tainted glasses. This film depicts life with all its rough edges and displays unforgettable images. This isn't 'light entertainment' but a thought provoking and real life drama.One Life Stand is a truly involving and emotionally honest film.","Have to agree that this movie and it's talented director do not receive the plaudits they deserve. Here's hoping that the DVD will do very well and bring both to the attention of a wider audience. The actors gave excellent performances and the plot is excellent. Perhaps overall the movie is a little long but May Miles Thomas seems to enjoy her actors when they are giving strong performances and therefore sometimes holds them in longer close ups than necessary. Good for the actors I am sure but sometimes as the audience you are ready to move on so to speak with the plot. May Miles Thomas deserves more recognition from the Film business as one of our foremost digital movie directors,","A truly accurate and unglamourous look into modern day life. It could be set in any town in the UK. I live in a housing estate in Glasgow and can relate to this film very well.Sadly the situations and characters are all too realistic but not predictable.The actors are scarily believable, I felt as if I was spying on my neighbours. It was an intimate dip into the lives of fragile and hopeless people. I was very moved by a few scenes.I loved the way this film was shot.Overall this film IS a must see.","I saw One Life Stand when it premiered at the 2000 Edinburgh International Film Festival and was blown away by it. Made on a micro budget, this black and white digital movie is very much a European film and succeeds brilliantly in spite of the limitations of DV. The film works because it's in the indie tradition - dealing with complex issues, yet moving and relieved by touches of understated humour. One Life Stand avoids falling into the trap of other UK realist films, with ordinary working people portrayed as either hopeless victims or comedic stereotypes. The performances are strong, particularly Maureen Carr as the mother, Trise. I understand the film has recently been released on DVD and I would definitely recommend it. The rating on this site is misleading, which is why I gave it a high score because the filmmaker, May Miles Thomas obviously put her heart and soul into it and deserves better than 2.8 for her amazing achievement.","Seriously engaging, intelligent and thought provoking drama at its very best. Mean, gripping, moody and captivating. Every home should have a copy! Don't take my word for it see it yourself. One Life Stand makes you consider your own lifestyle and how you treat your family and friends. Beautiful photography and impressive acting makes for one of the best cinema-graphic experiences of the year. John Kielty's debut is a delight and adds a real touch of truth and realism to this deep and gritty film. This is a film that cares and has an honesty that is unequalled in recent years. No car chases, but a film packed with hum our and emotion. I first saw this film screened at the Edinburgh film festival in 2000 and am now delighted to be able to own a copy on DVD.","All budding filmmakers should watch this movie - it is like a masterclass in digital film- making in itself. Some of the scenes look like they have been shot on much higher production values than what they really have been. It is very encouraging that such a well crafted piece of work can be made on a low budget. The acting is very good, and the characters are very interesting, particularly that of the lead boy (John Kielty), who manages to play a teenager experiencing difficulties whilst remaining really likable. His beautiful but fading mother was also very well portrayed, and the relationship between her and her boss was very intriguing. This is a very quirky, interesting piece and I will be looking for anything else made by the same team. The director is certainly one to watch.","Hard up, No proper jobs going down at the pit, why not rent your kids! DIY pimp story without the gratuitous sex scenes, either hard core or soft core, therefore reads like a public information film from the fifties, give this a wide miss, use a barge pole if you can.","I would like to thank you for giving me a chance to be one of the first to actually view the film. It really does grip you. John Paul does eventually get to see the light and make a life for himself away from being tied to his mothers apron strings.I imagine there must be so many families these days in the same position (especially with children leaving home older but I wouldn't say wiser) with very sad parents who haven't really got lives of their own and who make their lives a misery.I think this film should definitely have a wider audience. I would also say that the other actors played brilliant parts as well. It is such a deep film and very moving.","This ultra-low budget kitchen-sink yawn is the kind of film that can only be made in the UK in that, anywhere else in the world the fact the a market would need to exist before a green-light would be given. Most probably self funded this is clearly an attempt to redress important issues but ultimately undermines its point of existence in that the question needs to be begged, who would ever put money into distributing this and secondly if a market audience doesn't exist to watch, buy or rent this film, why would anyone bother in the first place? My opinions may sound unfairly harsh on a first time director but, this is the kind of film that only goes to undermine the commercial viability and quality standards which have only just kept a British film industry in existence. Reviewed in Edinburgh. 2 out of 10."],"review-user":["gmgmgm1979","swivelhips","kerrymillan","pa-keightley","thedudemoe","mysnookiegirl","leannesmith-3","mhood-7","info-4109","clyde-30","morris_55","red709x"],"review-date":["28 December 2004","18 February 2004","16 June 2003","1 February 2006","4 February 2006","28 January 2006","2 February 2006","3 April 2006","23 March 2006","6 July 2003","5 February 2006","27 June 2003"],"review-rating":["5","8","10","10","8","10","10","10","9","1","9","1"],"review-title":[" Maybe grim, but worth seeing\n"," an accomplished piece of film making which hasn't been given the credit it deserves\n"," Ambitious, subtle and sometimes affecting\n"," One Life Stand is a truly involving and emotionally honest film.\n"," Agree that this movie and director do not get enough attention.\n"," excellent\n"," Inspirational film-making\n"," One Life Stand - A Digital First\n"," A must see for all digital filmmakers\n"," Typical grim up north dirge!\n"," Well worth watching\n"," Dire, kitchen-sink, yawn!\n"]}