{"review-url":["http://www.imdb.com/title/tt0218641/reviews"],"review-text":["I cant believe I was dumb enough to sit through this! This has to be the worst movie Ive ever seen, even beating all of Chris Klein's disasters. It's a shame really, because the plot itself has a lot of potential - submerged aircrafts, navy operations etc - usually end up drawing good crowds but this one was just horrible. This is the first time Ive seen Nicole Eggert since Baywatch, and I cant believe she would take part in such a bad movie. She still looks pretty good but even eye candy could'nt save this one. If anyone's cable operator decides to show this one on a Sunday night - sue 'em!","This movie was one of the worst I have ever seen (not including anything by or with Pauly Shore).  I couldn't believe that a film could actually be THIS bad!Coolio has to be the single worst actor (again, not including Pauly Shore) to ever \"star\" in a movie.  The temptation to hit the STOP button during this movie was huge (in fact, if there was a THROW IN THE TRASH button on my VCR, I would have been inclined to press that).Do yourself a favor, and do something more interesting than watch this movie, like watching the grass grow, or watching golf on TV.","Okay this isn't a great movie, but it is still fun to watch. The effects are bad and the old recycled footage doesn't work. But if you enjoy watching great character actors ham it up on screen, then you can enjoy this movie. Dennis Weaver, Fred Williamson, and the rest of the cast are all fun to watch and turn in good performances. I also enjoyed watching the very weak and predictable plot unfold on screen, because it is clear that no one involved in making this movie was trying to win an Oscar. Relax, turn of your brain and just enjoy it!If you are like me and enjoy low budget movies then you should enjoy this one.","This is a terrible movie that only gets worse and seems to never end.  The acting was bad, the plot was worse, and the special effects seemed to have been created by a 5th grade science class.  Dennis Weaver is such a great actor and should have never taken such a part.  My advise, DON'T WATCH THIS MOVIE!","\"Submerged\" is an updated remake of Universal's \"Airport 1977.\" Although this is a Paramount release, \"Submerged\" uses the same model work, stock footage, and many key plot points from \"Airport 1977\" including the same rescue sequence.  This version sensibly takes some of the story outside of the plane crash--the fatal flaw of the original. There are some good action chase scenes and some lively explosions.  There are some other interesting additions, such as shark-infested waters and a pregnant woman in labor. The plane decor is interesting -- including a old western-style saloon bar. Aside from Dennis Weaver as Stevens, the acting is pretty wooden and uninteresting. Overall, \"Submerged\" is midly entertaining, on par with a good made-for-TV movie.","Okay, I just had to sound off on this one...   Like a tremendous mental-gimp, I've just sat through this film in its entirety.\nYou'll note that the trivia section of IMDB points out that portions of the raising of the 747 were \"borrowed\" from Airport 1977.   This really doesn't scratch the surface...   Virtually all exterior shots of the plane skimming the ocean, landing in, sinking, and even the at-rest shots are borrowed from Airport '77.   All of the \"raising\" shots are pulled from '77, including most of the interior flooding clips, with the exception of Dennis Weaver's drowning.  I couldn't help but wonder if Olivia Dehavilland might come floating by at any moment, or maybe a \"dead\" Tom Sullivan.   Another eye-roller:  Dennis Weaver's name in this film is Stevens, which is to compensate for the fact that Airport '77's plane is owned by the Stevens Corporation (headed by Jimmie Stewart of course).This is a veritable calvalcade of actors who don't work much, or at least haven't worked in a while, which might have been the first clue that it was going to be a real stinker.I've rated this film a 2 -   It's quite worthy of a \"1\", but if this film can't offer any other redeeming quality, at least somebody helped Coolio, Max Caulfield, Nicolle Eggert, and Dennis Weaver make their car payments that month!","\"Submerged\" is definitely NOT \"the worst movie ever\". It does have its flaws, such as borrowed footage, crazy script and non-existent special effects (these are the worst), but it also has some good points too. The acting is surprisingly good, there are LOTS of familiar faces whom you probably know if u're a b-movie fan like me.I was very glad to see Brent Huff playing one of the heroes, knowing him mostly for his 80's action films, and i must admit, he is not a bad actor at all. Fred Williamson, Maxwell Caulfield & Tim Thomerson get some limited screen time, but are believable in their parts. The \"eye-candies\" in this Fred Olen Ray movie are Yvette Nipar and Nicole Eggert, both looking very sexy and very mean. Michael Bailey Smith adds some muscle to the background as a Navy SEAL. Unfortunately the only cast member who (in my opinion) is completely out of place is Coolio. He doesn't act at all, talks like he didn't even read the script, and being a badass in the beginning of the movie, gets shot like a wimp a hour later. Not a good choice.To sum this movie up - this is not such a bad choice for late night entertainment. If you can get over the special effects thing (so many guns, so much fire, and not a single wound on anyone), Coolio's annoying performance, and the recycled footage from Airport 77, you might like this no-brainer after all.","Boring, ridicules and stupid \"Submerged\" is a waste of time. The shootouts were a joke, real people do not just stand out in the open with out any cover, hoping to get shot first!  So many things wrong or bad, not worth the effort to list, except one major flaw. At 500 mph for 20 minutes = about 166 miles west of L.A. and the water is 100ft deep??? Even at that, none of the people would have survived the decompression from being subjected to 100ft of water pressure for more then 20 hours when they were brought up. Just a awful.","There is part of one sequence where some water rushes into the sunken plane, everything else that happens in this movie is stock footage for Airport 77. You can even make out Jack Lemmon and Christopher Lee in some of the shots. A total rip off? Well almost by definition. There may be more stock footage in this film than in Plan 9 From Outer Space.All the new material, actors sitting around in an airplane set talking, is bland and terrible on every level. Dennis Weaver is totally wasted in a career low movie, though that's true for everyone other than this films director Fred Olen Ray, who uses one of this many necessary fake names in order to keep working.There is a level of scant professionalism that makes this film such a waste of time, it would actually be better if shot by someone with no technical knowledge at all, because Ray has just enough knowledge about how to put together a scene in the worst old school TV fashion that this film, like most of his films, is totally devoid of life. The worst kind of hack work. The worst kind of film. Boring.This type of film is a waste of money, an affair where the crew on all levels are ghosts hoping to get whatever scant pay check they can and that no one will see or know they appeared/ participated in this rip off. There are so many people who want to make movies it's disgusting to see Ray burn up the money given to do nothing more but fill time.His commentary track is interesting in that he has to start it by explaining that he is really Fred Ray as he isn't credited on the film itself. That tricked me into seeing it don't let it trick you.","The movie was your average low budget film.  But the part that got me the most was the blatant scenes stolen from Airplane.  It was so obvious it makes you wonder who they were trying to fool.  Splicing scenes from a movie made in the 70's into a movie made today and trying to be taken seriously, is pathetic.","Submerged (2000) * 1/2 (out of 4)Low-budget action picture has a plane hijacked so that a group of terrorists can steal a missile launching code. The plane ends up crashing into the ocean and sinking to the bottom so it's up to some Navy Seals to try and save the passengers.If the plot sounds familiar then you've probably seen AIRPORT '77. That disaster film is one of my favorite pictures so when I heard about this movie I just had to check it out. Director Fred Olen Ray is a master at low-budget movies and he at least made this one look like a professional production but sadly there's really not too much here to enjoy.THe biggest problem with the film is the fact that there's just no drama, tension or suspense. The film is well-made, like I said, but at the same time one wishes that there was some sort of connection to the characters that made you care about them or that the film really made you fear that some sort of disaster was going to happen. None of that happened so we were left with a rather flat film.The film does have some familiar actors including Dennis Weaver, Fred Williamson, Nicole Eggert and even Coolio. Of the cast, Weaver comes off the best playing the rich redneck who likes to drink. The film does offer a couple nice action scenes but the scene with the plane being raised from the ocean is actually footage from AIRPORT '77.","This film has to rank down there with Ed Wood films.  A terrible script and bad, bad acting.A machine gun fight in front of plate glass windows; minutes go by before anyone is hit and nobody has cover - not one window ever breaks. You'd think after a fire fight like that the big U-Haul truck might be riddled - not a scratch.Do CIA agents and government contractors =shout= Top Secret information at a stand-up cocktail party with hundreds of people around.There isn't one actor you care about; everyone is shallow and basically unlikable.A Hawaii bound 747 flies out of Los Angeles and crashes twenty minutes later in the Pacific \"...in 100 feet of water...\".  A short time passes when the stewardess announces to the five other passengers they only have two hours of air left; on a 747?The next day the rescue teams show-up and amazingly the six passengers are still alive.A movie that starts out mediocre and goes from bad to worse.","I guess Airport 77 wasn't good enough, although this movie has footage from it.The plot was nearly identical. Terrorism. Wow, what a concept. Get original Hollywood. What a catastrophe. And I'm not talking about the plane.Was this some cheap attempt to coincide with the problematic issues of the day at hand, or was it an expense issue that merited dubbing footage from Airport 77? Maybe it was an attempt to heighten Coolio's ratings, I'm not sure. It didn't do any justice to him as far as I'm concerned.I kept waiting for Lloyd Bridges to pop out of the ceiling and say anything. What a joke...","Paramount's low budget action film directed by b-movie favorite Fred Olen Ray (Hollywood Chainsaw Hookers, Armed Response, The Tomb, Cyclone, Warlords, Active Stealth, Scream Queen Hot Tub Party, Haunting Fear, & Invisible Mom 1/2) with surprising recognizable cast: Fred Williamson (MASH, Black Caesar, Hell Up in Harlem, Inglorious Bastards, New Barbarians, Bronx Warriors, Vigilante, Black Cobra Trilogy, From Dusk Till Dawn, & Original Gangstas), Tim Thomerson (Trancers, Dollman, Near Dark, & Fade to Black), Dennis Weaver (High Noon, Duel, & Touch of Evil), Nicole Eggert (Baywatch, Blown Away, & The Demolitionist), Brent Huff (Armed Response, Oblivion 2, & Black Scorpion), Yvette Nipar (Doctor Mordrid, Brisco County Jr., & Robocop), Stacey Travis (Phantasm II, Hardware, Ghost World, Bandits, & Intolerable Cruelty), Fredric Lehne (Lost, Ordinary People, Dallas, & Men In Black), Maxwell Caulfield (Oblivion 2, Empire Records, Waxwork 2, & Sundown), Michael Bailey Smith (Hills Have Eyes 1/2, Monster Man, Black Mask 2, Men In Black 2, Best of the Best 3, Fantastic Four, & Nightmare on Elm Street 5), Brinke Stevens (Slumber Party Massacre, Nightmare Sisters, Sorority Babes in the Slimeball Bowl-O-Rama, & Haunting Fear), and well.... Coolio (Judgment Day & Gangland) who wasn't so impressive. Regardless, this film wasn't as bas others were claiming it to be. It was very entertaining & worth the cheap price I paid for it. Check it out!","Minor SpoilersThis is a ok air plane flick Dennis Weaver and Coolio.There is note here about Submerged.Don't quote Me on this but I believe Submerged and and another plane film called Sonic Impact has the same score!Yes the same music in both different films!Anyway the movie is entertaining and is a good one to watch!","This movie was better than I expected.  I don't think it deserved an R rating, though.  I've seen PG-13 films with worse language and violence. I found this movie entertaining and I enjoyed it.  If you're a person who dissects everything, you might find a lot wrong with it, but if you take it for its face value, I think you'll find it entertaining."],"review-user":["Hollywood-3","WentOnA777","clark2005","PSmith5407","imdb-99","genxjeff","face_of_terror","terrencecmay","HEFILM","sinisfun","Michael_Elliott","TheFog-2","flyinguitarist","KrakatoaEnt317","Movie Nuttball","laurakni"],"review-date":["22 March 2001","2 February 2001","17 January 2010","3 May 2002","27 May 2001","1 December 2003","26 December 2008","21 August 2001","27 July 2005","7 August 2002","15 November 2017","5 January 2001","2 September 2004","1 September 2009","12 April 2003","13 April 2002"],"review-rating":["1","5","2","2","4","1","1","1","6","6","8"],"review-title":[" One of the worst of all time!\n"," I wasted 94 minutes of my life...\n"," Stupid Yes.... but still fun!\n"," This is a terrible movie that only gets worse and seems to never end.\n"," Homage to Airport 1977\n"," It's more Crapmerged...\n"," Could have been worse....\n"," So many things wrong or bad with this movie\n"," One of the worst films from one of the worlds worst directors\n"," It would have been good, if it was supposed to be a comedy.\n"," Lacks Any Suspense or Drama\n"," Spoiler-One of the worst movies made\n"," What a joke\n"," Not that bad....\n"," Submerged with Dennis Weaver and Coolio!\n"," A pretty good movie\n"]}