{"review-url":["http://www.imdb.com/title/tt0216165/reviews"],"review-text":["Lifeline, A Hero Never Dies, and you think he couldn't top himself off. This film manages to be one of the most intelligent action films ever made and still fits in a compelling love story told in three scenes better than most films can tell a love story in the entire film.  The gag premise, a man with 4 weeks to live takes on the Hong Kong police is only part of the brilliance of the film.  I have to thanks the script writer for a constantly innovative script, as much as Johnny and I await their next collaboration with much anticipation.","Not high art, not even exceptionally innovative, but a thoroughly enjoyable movie. Funny, fresh, intelligent - there are still people out there who don't need millions of dollars to hide that they're out of ideas.When you compare this to your average Hollywood action flick, you're comparing a homemade meal with a big mac.","If you're familiar with the work of auteur Johnny To and his band of filmmaking cronies over at Milky Way, you know what to expect with this latest production.  All the familiar elements are in place: the strong camaraderie between two characters: usually a cop and a baddie, the coincidences and chances that turn on a dime and pay off handsomely in the end, and the humor that arises even in the most dire of situations.Andy Lau plays a man who has 72 hours to live and decides to rob an insurance company.  Lau Ching-Wan (also brilliant in other Milky Way films like \"Longest Nite,\" \"A Hero Never Dies,\" and \"Where A Good Man Goes\") portrays a hostage negotiator/cop who is on the robber's tail, even as the robber sets up a series of tricks and clues that he must follow in order to get his man.Funny, poignant, and cool while being subtle, \"Running\" is actually one of the most entertaining Milky Way films to date.  Don't miss the performances by the two leads, esp. Andy Lau, usually considered an average actor who has rarely been this natural and fun to watch.  This film is one to go out of your way to see.","I just purchased An Zhan (Running out of time) on DVD and it was an excellent film I must say. Not really action-packed, in terms of gun play, but definitely exciting and witty. I do not think I have seen Andy Lau in better form. And the editing on this film was very well executed. Go watch this now if you are a fan of Lau or HK thiller/action film!","I've recently seen An zhan.  Not because it was a Hong Kong film, but because I was looking for a change from the films being produced here in the US.  In my humble opinion, I believe the film could easily compete against the action thrillers being produced here, except for the traditional idiocyncracies of Hong Kong film.  The one that still  bothers me was the chief inspector character.  I still don't understand why there has to be a complete-idiot-comic-relief-type character even in the serious films that come out of Hong Kong, but I can live with it when the movie is this good. The characters are believable even if the situations they are in are not. The story is fast paced and really sucks you in to it.  The real cincher scenes for me were the two bus rides that the thief character takes. Overall, a really solid film.","This film was recommended to me by a friend.  I don't know much about Hong Kong cinema, but having seen Aau Chin, I definately want to find out more. I really enjoyed it, and found it was surprisingly different from what I was expecting.  I had prepared myself for lots of big fights, lots of blood and gore, and more than a little machismo.  What I got was a sad, sensitive and suprisingly funny bit of cinema.  Ok, so there are gunfights, car chases and bombs a plenty, but there is also something else - a heart.  I really liked the interaction between the two leads, I think it worked really well, and I loved the fact that the criminal and the cop were working together.  The love story was terribly romantic, and even the 'purely for laughs' role of the chief inspector was done quite nicely.  As an introduction to Hong Kong cinema, I'd say this was perfect.","Having seen 'only' about 200 Hong Kong films in my time, I have to say this film is among my very top favorites. Not only is the plot engaging (and in some ways surprising, which these days is rare for any movie), but the chemistry between the two lead actors is superb. Top notch casting! And while often even the most serious HK films tend to insert quite a bit of humor in between all the drama and action, often spoiling the mood a bit, here the jokes are kept subtle and woven into the plot, even improving character relations. The music is also very well done, and the two main themes are very beautiful. With the release of the HK special Edition, they've even cleaned the picture (first release was grainy) and the subtitles, even if the quality of the translation is still lacking (nothing new there). All in all, if you have to see a HK film that isn't directed by John Woo or have Chow Yun Fat in it, this should be at least on your short list! A truly fascinating and entertaining watch!","This film is a refreshing change of pace from the mindless Hong Kong triad movies I have grown so tired of. There are no spectacular gun fights. No car chases. And practically minimal action to speak of. The audience is kept in suspense for the most part, though certain aspects of the so called \"ploy\" by Andy Lau are quite obvious.The film has been hailed as a departure from the genre of violent triad films, and as an \"intelligent\" crime film. To an extent, it is. But, to some extent, it still fails the \"believability\" test. One can hardly picture any triad member to be dumb enough to not see through the female disguise of Andy Lau in a second. It also seemed to have fallen for the \"if someone was seriously ill, the said someone will be coughing up copious amounts of blood regularly\" thing Chinese films seem to go for all the time.The subtle relationship between the two lead characters is a refreshing change.All in all an enjoyable film, even though the concept is not new and there are few surprises. >","Andy Lau and Lau Ching-Wan are both superb in Johnny To's tautly directed crime thriller which puts most Western efforts to shame. Think of it as the Hong Kong 'Heat', only better! Everything about the film screams class; from the performances to the soundtrack, the cinematography to the script. The tone remains serious throughout, but the film has a nice line in black-humour, friendship and romance at it's heart. Sure, it gets a little preposterous later on, but it would be a hard-hearted viewer who didn't find something to love about this movie. Thank God, Hollywood hasn't (yet) re-made and ruined a classic. Do yourself a favour and see this film!","Terrific, deeply moving crime thriller starring Andy Lau and Lau Ching Wan.From the dizzying opening sequence to the extremely satisfying conclusion, this cat and mouser hardly misses a beat.Johnny To, again working with ace composer Arthur Wong, constructs another operatic actioner that grots in the face of its contemporaries.To's images are strong and moving. His cutting, combined with the extraordinary music cues, is exemplary. You are in the hands of a master cinematician.The two sequences in which Andy Lau \"hides\" from the cops on a bus by pretending to accompany a lithe beauty (Ruby Wong) are testament to To's unique directorial skills.Lau Ching Wan is strong and commanding as the harassed cop while Andy Lau is dynamic as a dying man avenging his father's death.This is superb movie-making, only mildly compromised by some bad English dubbing in one scene with criminal Waise Lee.","These are my thoughts after re-watching Aau Chin on a VCD recently bought at HK$15 (definitely NOT a pirated version). I still found it quite enjoyable.The \"setup\", while not brilliant, is carefully done, with attention to details. No doubt the audience will find the total incompetence of the villiant \"Baudy\" quite unbelievable. But he only serves as something on which the duel between the two heroes is built.Here's is where this film differs from many others in this genre (most notably John Woo's), in which the two heroes usually start off in sharp confrontations, although they may end up appreciating each other. Not here. Right from the beginning, Lau Ching-wan and Andy Lau give you the impression that they are engaged in no more than a friendly game of chess. I, for one, like this arrangement, as a refreshing change.Lau Ching-wan delivers his usual easy style that is well liked by his audience. He is the mouse in this cat-and-mouse game, a dignified mouse, for that matter. Andy Lau is the cool cat, actually too cool. Hong Kong movie stars who are also Canto pop stars (and that accounts for some 90% of them) often have to watch the role they play in movies to ensure that they wouldn't tarnish their image as a singer. Andy Lau, however, is so popular that I don't think he needs that caution. He just like to look cool in this movie. Didn't hurt either, as it won him his first Hong Kong Oscar.Finally, while this is a good movie from director Johnny To, my top favorite of his is The Mission, in which style is king.","This viewer must admit that he's a relative newcomer to Hong Kong cinema but this interesting and gripping thriller from director Johnnie To has left him wanting to see more. It's stylish, humorous, even poignant at times. It's not wall to wall action, but it doesn't need to be. It's also not particularly violent. The twisty script does keep one watching, intrigued at finding out just how things will develop from scene to scene. Also, the solid performances by the leads, Andy Lau and Ching Wan Lau, help a great deal.Andy Lau plays Peter Cheung, a dying young man who learns that he has just weeks to live. So what he decides to do with his time left on Earth is play an elaborate \"game\", which ends up involving intrepid hostage negotiator Ho Sheung-Sang (Ching Wan Lau) and the local mafia, led by Baldy (Waise Lee). What really gets the audience hooked is wondering just what the hell Peters' motivation is and what he hopes to gain from the whole experience.The action, when it does take place, is well orchestrated, and director To does a good job at keeping a reasonable level of tension throughout his film. The pacing and editing are efficient enough at creating a story with a fairly brief running time of 93 minutes. In addition to the engaging lead performances, those who leave an impression are Shiu Hung Hui as comedy relief character Chief Inspector Wong Kai-Fat, who is believed by Ho to be inefficient and cowardly, and lovely ladies YoYo Mung and Ruby Wong.The opening is pretty chilling and sobering, and the ending is quite satisfactory.Overall, this is good fun.Eight out of 10.","Although the plot is not without it's faults, the execution of the simple material is near perfect. This is expected from Johnnie To, as once again he brings a certain finesse to the cinematography and character development which never cease to provoke intrigue. Andy Lau plays a dying man plagued with stage 3 cancer, and in his last days wishes to seek revenge on on an old foe. Ching Wan Lau is a police negotiator, who inadvertently becomes involved in Andy Lau's plot for revenge. Many twists and turns become evident as the audience is pulled alongside Ching Wan Lau in the fast-paced investigation to nab Andy Lau. The two bounce quips really well off of each other, due to the dialogue being edgy and gratifying. There are a few silly moments along the way, but when the ride's over you'll be glad you hopped on board. The tension and mystery resolve in a perfect bow, and all questions are cleared at the end, the way a good thriller should. 8/10","The one thing that can be said about RUNNING OUT OF TIME is that it's an immensely clever film. It's interesting to note that the film's writers are French, which may explain the movie's \"out of the norm\" vibe, as it doesn't really fit in with what is commonly called \"Hong Kong Cinema\".The movie concerns a thief who plans revenge on some criminal types using the assistance of an equally clever cop. But first he has to convince the cop to join his personal crusade, and so begins a series of games where the thief manuevers the cop into his plan.Quite a clever movie.7 out of 10(go to www.nixflix.com for a more detailed review of this movie or full-length reviews of other foreign films)","Running Out of Time rests somewhere in the middle of Johnny To's cannon, in the \"solid good\" category. As a crime thriller it's not terribly original or overwhelming and the action scenes will not blow you away but it has something else going for it. It's a Johnny To film after all, it has to.Andy Lau has 72 hours to live. He decides to play a strange cat-and-mouse game with a hostage negotiator of the HK police, played by Lau Ching Wan. That's the plot in a nutshell. On top of that To piles layers of twists and turns that keep proceedings interesting throughout. It occasionally becomes too convoluted for its own sake but never lets it get the best of it. However, just as Johnny To is about to hand over a slick and well-made crime flick (which, let's face it, are dime-a-dozen), he slips in bits and pieces that bring Running Out of Time alive as a full emotional experience, providing the soul and heart to the well-oiled skeleton.The concepts of synchronism and minimalism (staples in his work) are explored in great effect here. Always subtle, letting the images speak for themselves, giving them time to develop with long takes and slow tracking shots, exemplary cutting to the score, it's all here. A small love story in a bus between Andy Lau and a girl is among the highlights of the film and part of the \"heart\" I'm talking about. So simple yet so powerful. Ditto for Lau's and Lau Ching Wan's car scenes and the bowling-room showdown.However something stops me from claiming Running Out of Time is a masterpiece. To has all the ability and craftmanship down to a notch but he can also be too workmanlike or bland at times. When he's good, he's REAL good. There are even isolated moment of pure brilliance that are just TOO good for their own sake, leaving a bittersweet aftertaste for the rest of the movie. I'm convinced that if he puts his heart to it, he can make a really great film. As it is, this is another one of his films that is flawed but enjoyable. Underneath the slick HK style, it's the black humour and heartfelt drama that makes this a compelling film. Worth watching, definitely.","An exciting story of a man who have 72 hours to live (played by Andy Lau) and wants to play a game of cat and mouse with one of the best detectives in Hong Kong.This movie has elements of comadary between two unlikely friends, coincidental twist and turns, humor and a bit of irony.The performances by the two leads (Andy Lau, and Lau Ching Wan) are definitely not to be missed.  Especially the performance of Andy Lau. This is definitely one of his best ever in which he won for the first time the HK Film Awards (the HK equivalent to the Oscars.)","The second of Johnnie To's three homages to John Woo's \"The Killer\" is also one of his most memorable films, with a terrific script full of witty and clever writing, and a well developed relationship between the two leads, making you actually care about their fate. To kept his camera moving rapidly throughout, and that combined with the strong editing and pace made for a gripping film that simply refused to lose my attention. The score by Raymond Wong was effective and fit every scene like a glove, especially during the rather poetic ending, which managed to surpass my expectations. Instead of ending with a generic shootout, the movie goes for a more unique approach that benefits it in the long run. Andy Lau and Ching Wan Lau were quite frankly perfect in their roles; charismatic, subtle, subdued, and entertaining to watch. Although listed as an action movie, this is really a drama of loyalty, friendship, and honor, much like Woo's masterpiece being alluded to here. Unlike Woo's film, however, it never once steeps into melodrama or becomes overbearing with emotion. It's played mostly straight, with some genuine laughs here and there, and it deals with the issue of cancer in surprisingly good taste. Fans of Hong Kong cinema owe it to themselves to give this a watch if they haven't already.","what are you going to do if you're on your last few days on earth? The answer is obvious. You plot revenge on your father's enemy by enlisting the help of the police thru a series of mysterious clues, misdirections, intrigue, and schemes.The leads do a great job. Andy Lau plays the genius living on borrowed time. Ching Wan Lau seems to have been born to play a cop. Every movie I see him in he's a police officer. He displays some great screen presence here in his 'duel' with Andy.The end result is a fast paced thriller with a couple chases, a few unexpected twists, and a comedic turn by Chief Inspector Wong.8/10","A mastermind criminal is diagnosed with a terminal cancer and has 3 days left to live . He decides to spend his remaining days avenging his father over a stolen diamond and playing a cat-and-mouse game with the smartest detective/negotiator on the force .Classic Johnnie To elements of men on opposite sides of the law befriending each other to take down each other's rival . Even features a side love story for a final chance of romance before death","The story is smart and they paint it with a smart storyboard. Not much martial arts, just like cat and mouse playing their tricks to each other. A bit of romance but still cute enough. Not many dialogue, you need to pay attention while watching or you won't get it. Kinda fresh if you compared it with another Johnnie To's films.","With Hong Kong heart-throb Andy Lau and veteran star Ching Wan Lau, \"Aau Chin\" has everything going for it for the beginning part of the movie, unfortunately, the movie falls apart at the end.Andy Lau plays a sophisticated thief who only has 4 weeks to live, but still has one thing unfinished...  He pulls an elaborated scheme tricking the police into helping him...  However, the police is hot on his tail....  Can he pull it off before being caught?The build up of the movie is good.  Bits of pieces of clues are left behind for the audiences to try to guess at the real intention.  Unfortunately, the build up leads to a disappointed final showdown.  It feels as if in the middle of the script, the writer has changed and that all the build-up becomes disconnected.A 3/10 ....","A man diagnosed with only a short time to live plans an elaborate game of cat and mouse with one of the best hostage negotiators in hong kong. While being far from a great film, both Andy Lau and Ching Wan Lau are good in this movie and help the film to transcend it's mediocre standard plot... to a point. The problem isn't with the acting per say, but rather with the ending which didn't really feel to be true in keeping with the film, to me at least.Johnny To does seem to be an OK director, but having seen this and \"Beyond Hyperthermia\", it leads me to believe him to be a slightly over-rated one.My Grade: C+ Tei Seng DVD Extras: 3 theatrical trailers; Trailers for \"Xin Long men Ke Zahn\" (Dragon Inn) and \"Tin Dei Hung sam\" (Armageddon)","you know I've seen a lot of crappy hong kong movies in terms of production and were good. But Running out of TIme was great.i guess what made it so good was the fact that Andy Lau and Ching Wang, have such great chemistry. The film at first is really fast paced but slows down not enough to even notice which is also good, we don't want to have a heart attack,lol. In terms of plot their is enough of other things going on to keep you interested. Lau has some pretty good moments as he uses make up to impersonate people from the underworld. Also the movie has the best oriental supporting cast since \"house of Flying Daggers\".The movie is great because its so unpredictable and leaves you wondering at every corner. Definitely a good rental with tons of comedy, action and thrills pact in to one, 8 out of 10","... is ultimately ruined by a totally stupid, cheesy and unnecessary homophobic subplot, first, when one of the colleagues of the inspector tells him in the car 'Everyone at work thinks you're gay' and later on, how the chief of police is portrayed, they could as well have made a complete screaming and gesticulating drag-queen out of him.This is what really irritated me to the highest degree and gave me want to throw up, because otherwise, and even later on, Johnnie To's direction and handling of the plot was excellent, the story was involving, even moving to a certain degree and the action extremely well- handled.Moreover, that aforementioned subplot is completely useless, because it definitely does not contribute to the story, and is totally OUT OF CONTEXT for what affects the SUBJECT MATTER of the film. Those scenes should have been deleted.I am otherwise definitely a great admirer of Johnnie To's films, and I do not put the blame on him for this obnoxious element.However, when I checked who the writers of the film were, I found out that there were two French screenwriters and only one Chinese So I suddenly said to myself that it was definitely not surprising. So my suggestion would be that these two french bastards stop polluting Hong Kong cinema with filthy and disgusting Western clichés!!! As I said before, without this disgusting subplot, i would have given a 10 tho this film because both Ching Wan Lau's and Andy Lau's performances are perfect, and the plot is otherwise almost flawless.I substance this is what drove me to give this film a 1, a thing I deeply regret, but unfortunately, there are, however, things I do not tolerate, and think (but this is a personal opinion) should not be so easily overlooked.","The reason Johnnie To is a big-name filmmaker in the West seems to be because his pluses outweigh his minuses. I'm not sure if he ever made a movie that really makes sense, or at least wasn't hard to follow, but he has so much directorial flair and talent for subtle comedy that the viewer is usually just glad to be along for the ride.He had to have his off-days, and I'm afraid \"Running Out of Time\" may be one of them. It's still stylish and entertaining, with amusing moments, but in this case the plot is just incomprehensible. You can follow it at first, but in the second half it just runs away from you in several different directions at once and I could not keep up.I'll try to tell you the plot as I remember it, and then include the bits I had to read about online to learn about: Ho (played by To regular Lau Ching-wan) a skilled hostage negotiator, is somehow noticed by Cheung (Andy Lau), a man who has a terminal illness and only days to live. He plays a game with Ho, stringing him along through complicated and unrealistic means.Meanwhile, a mysterious bald man is having a diamond appraised by an old man. He kills some American gangsters.The plot... thickens. It is a better descriptor to say that it shatters. I really lost the plot after this; all I really remember is that Cheung disguises himself as the bald guy in one scene (at least I think it was him) and dresses up as a woman, possibly in the same scene? I don't know. I really lost the plot at this point.I had to read online that Cheung's entire scheme was about taking revenge on the mafia, and impersonating his dad. This doesn't really seem to dovetail with some of his other actions in the movie, such as shooting randomly out the window of a moving car.And what was the point of his 'game' he played with Ho? Why not just level with him at the outset, since the other man couldn't turn him down? Right?...I enjoyed this one, but felt it was just too confusing to recommend. To's \"The Mission\" and \"The Longest Nite\" are both superior."],"review-user":["suburban madman","dhahn","ajy1","movie_guru","heychast","principessaleah","se86","Karfoo","rmj1971","fertilecelluloid","harry_tk_yung","Hey_Sweden","tntokmenko","NIXFLIX-DOT-COM","chaos-rampant","nc2","Abyss47","J_Charles","jimniexperience","henhelena","mindless_junk","movieman_kev","lee_shenlong10","yduric","jadavix"],"review-date":["26 April 2000","19 December 2000","5 October 1999","10 March 2000","10 December 2001","1 August 2003","14 January 2007","13 February 2001","30 November 2005","24 December 2004","23 February 2003","10 March 2014","20 January 2013","27 August 2003","12 July 2008","30 August 2000","9 March 2013","28 March 2012","28 December 2017","21 July 2017","5 July 2003","30 December 2004","9 January 2005","23 April 2010","17 July 2017"],"review-rating":["8","9","9","8","10","7","8","9","8","8","7","8","8","8","3","5","8","1","6"],"review-title":[" Against re-establishes Johnny To as the best working action director.\n"," Hollywood just doesn't make 'em like that...\n"," A smart and satisfying film\n"," To and Lau equal excitement\n"," An action thriller comparable to the best from the States.\n"," A great little starter for Hong Kong cinema\n"," Excellent piece of Hong Kong cinema!\n"," Nothing new, but entertaining nevertheless\n"," Top quality HK thriller\n"," evocative, searing crime thriller\n"," The best of enemies\n"," Nicely done.\n"," The great rivaling chemistry between both the Lau's makes this an action film worth watching.\n"," A Clever Film\n"," It's the heart that makes all the difference\n"," One of the best movies I have seen\n"," An engaging and poignant crime drama.\n"," Thriller with a great premise\n"," Johnnie To Cat-and-mouse Thriller\n"," Great Script\n"," Good Beginning, Bad Ending\n"," running out of patience\n"," pretty good for an HK film\n"," Could have been excellent, but...\n"," Too confusing, though still enjoyable\n"]}