{"review-url":["http://www.imdb.com/title/tt0225899/reviews"],"review-text":["Nothing can prepare you for how truly rubbish this film is. Rubbish actors, rubbish script, rubbish camerawork. But it is because of this that you simply must see it. From the way some actors make random noises instead that have to purpose, to the ending that seems to contradict everything in the film, this film is a work of terrible genius. My favourite scene? When the girl is repeatedly stabbed in the bathroom, and yet the knife remains somehow clean, and she is still standing after getting a good 30+ holes in the chest. Oh, and the blood looks like it's being squirted from a tomato sauce bottle. In fact, it probably is tomato sauce. Just watch the film and laugh. Laugh hard.","This film is so awful it is funny, not quite to Troll 2 levels of hilarity, but funny nonetheless. The acting is awful, the music is atrocious and the story does not make a blind bit of sense. The story revolves around a man dressed in an awful granny costume killing a bunch of people at a party. The death scenes are so badly done they are hilarious. One girl is stabbed repeatedly in the chest, but does not scream, try or defend or self or run away. She also manages to remain standing despite being stabbed repeatedly. Another death scene involving a rope is also extremely hilarious. No thought seems to have been put into the plot. The Granny seems to magically move from one area to another(e.g. be hiding under leaves in a woodland just where the victim just happens to stand, appears in front of someone even though it had been behind them ten seconds earlier), people kiss at extremely inappropriate moments(would you stop and kiss someone if you were being chased by a homicidal maniac) and the double twist at the end is utterly ridiculous, it seems they just threw it on just to confuse people. I would advise people to watch this film if they love awful horror movies like Troll 2, The Dreaded or Blood Gnome, but do not watch it if you are expecting a scary horror movie, you will be disappointed","I watched this movie at a party, we were very puzzled by the ending, it ended rather poor. even though the entire movie isn't too amazing, i was expecting something slightly better. This movie is pure trash, but i suggest you watch it if you find cheap horror films with a weak script quite funny. Personally I loved the advert, it was my overall highlight, the fighting scenes were basic, a shot of a knife, some shadows in a window, fake blood. I must say the Granny costume was quite scary, This film is a mixture of kill joy, camp blood and boggy creek 2,except this film has slightly better camera wok and colour treatment compared with camp blood.","I've given this film a \"6\" so i thought I'd better justify that one before i get driven to the nearest mental unit. As a horror movie, this was awful. It was boring for at least 30 minutes then it was poorly-acted, poorly-directed, and the camera work was terrible. Even i can hold a camera straight. As a comedy, it's a work of cinematic genius. I've never laughed so hard in my life. This is what \"Scary Movie\" should have been (but wasn't). So I give it \"6\" for its unintentional comedy.","Truly awful nonsensical garbage. This movie does everything wrong except make the running time under an hour. The gore FX defy gravity & logic. There are no scares. The acting is abysmal, with everyone appearing to be reading their lines. There's a surprise ending that's just silly where we find out that things we saw happen didn't even happen. Boy do I hate cop out endings! They pad this thing out with long drawn-out shots of people doing nothing interesting(like putting on make-up or talking for what seems like forever). They have to pad out a movie that's under an hour long? Ridiculous. The story itself is pretty freakin' thin. I mean it's just a variation of the movie APRIL FOOL'S DAY, if I remember that movie correctly, and that film wasn't all that great either. The only good thing I can say is it seems to have been shot well. Too bad nothing happens that's very exciting.","On seeing this movie, I didn't expect much. I was delightfully surprised. Although the writing was unpolished, as some of the dialog seemed drawn-out and contrived, the script did have shining moments. (My favorite line, \"Life is like a rich meringue, an-and I'm diabetic, so I can't enjoy it...\".) The plot was new and refreshing as opposed to some of the newer more \"main-stream\" horror that most of us are (sadly) growing used to. I do believe some of the scenes could (should) have been longer (and maybe some shorter). The superfluous use of blood was campy but seemed to make sense in the end....Ah, the end. The end would have been a little better if they had explained why what happened, happened. (I don't wanna spoil it.) It might have also added to the movie time, which is in the area of \"it's only an hour long, how good could it be?\" Answer- Quite good.","Right, here we go, you have probably read in previous reviews on this film that it is awful, badly acted, avoid at all costs. Well i suppose in some ways this is true, it is fair to say that you couldn't write a spoiler in this comment as there is no plot to spoil. However, there is a fine line between plain awful and absolutely hilarious and believe me this film is the latter. The acting is so bad, the plot so non existent and the ending so completely baffling it will have you laughing the whole way through. There are scenes in this film that take comedy to a new level. Do not expect an Oscar winner but believe me for the small price you will pay for this disaster, it is worth every penny.","First let me correct the other comment, this is NOT a home movie- it is that bad with a budget. oh the horror. it it a truly abysmal film only worth renting out with such classics as jack frost 2 and Octupus. the ending is hmm vaguely fight club but only at a push i would actually go so far as to say it is non existent, and the pitiful attempt they do have really makes no sense at all. do NOT watch this film if you are weak of heart or soul. only for die hard C movie fans (yes C for cheese)","Granny, directed by Boris Pavlovsky (who?), sees eight friends experiencing a night of terror when a psycho-killer dressed in a old hag rubber mask and a nightdress interrupts their party.They say you can't judge a book by its cover, but it appears that the same is not true of DVDs: I was in the mood for a REALLY bad horror film last night, and since the cover of Granny featured a shoddily photo-shopped image of the titular killer swinging an axe, terrible typography (they even use the system font Sand, a definite design no-no!), and credits featuring absolutely no-one I had heard of, I reckoned it would be pretty lousy.It was!When a film clocks in at just under an hour long, it really shouldn't waste too much time before getting to the action; Granny, however, spends the first 20 minutes or so with its unlikable group of friends indulging in pointless games and extremely banal conversation. Anyone who actually stays with the film long enough for the killing to begin (and I doubt most sane people would bother) will be treated to several dreadful death scenes featuring amateurish gore, loads of awful acting, and a surprise ending that comes as no surprise (if you've seen April Fool's Day, then you'll guess what the twist is way before it is revealed).Granny is uninspired, unexciting, and almost unwatchable. Avoid.","Anyone who is annoyed by this film's quality should be ashamed. This is one of my favourite films ever! It has spawned many a catchphrase amongst my friends and it is a sure way to cheer me up.This film is clearly rubbish. yes. but so terrible, it comes out the other side of bad into funny territory. The acting, the writing, the special effects, the camera work, the music, all hilariously awful. So bad, i still haven't figured out whether it was intentionally this bad, in a kind of spoof type thing. Serious or not, when the makers of this film brought Granny into this world, they were doing a glorious thing!!dom","GRANNY IS THE BEST MOVIE EVER Ganny is the best movie i have ever seen. the plot was like nothing ever seen or done before these people are truly blessed with a talent no joke i love this movie. i need to buy it but i cant find at any place. it is a dream for me to go and meet the actors and try and do a granny 2.i rented GRANNY at Broadway video and kept it for a week longer than i should have and asked them if i could buy it off of them they said no a big disappointment and an even bigger one the week after i returned it i wanted to go and rent it again but come to find out Broadway video was out of business. if anyone has the movie or knows where i can buy it at then please tell me write to me at iloverot@aol.com","Forget Samara/Sadako and Jason...Horror has a new name : GRANNY. The plot is simple but efficient. The actors are good (two thumbs up for \"Michelle\" and the killer) and the dialogs are even quite clever. From the beginning to the end, the action will leave you breathless, you just can't escape it... There is blood, awful murders, funny moments, and a sense of perversity that goes far beyond any rule. \"Deja vu\" ? Surely NOT : \"Granny\" is not another slash movie, it's truly a classic of its own... It deserves the success it had and there's even more success to come with its re-release. Congrats!","An object lesson in how to make a bad movie which masquerades as Horror. Without going in too close I would imagine this is the results of a bunch of film school students all adding bits to the story and then actually ACTING in it! Its like a film workshop of some kind and its a film badly in need of an editor-in which case it would have lasted 10 minutes! The director of this garbage probably had more money than sense. Consider the number of submitted scripts or even unreleased films which would have benefited from this. The so called Granny who was killing people in some pretty stupid ways looked like Christopher Lloyd in Back to the Future-or maybe the musicians Johnny Winter/Edgar Winter. It starts off with 20 minutes of crass boring nonsense spouted out by the students-something about paranoia. Giving this rubbish 1 is because it can't get any less. It has not one single redeeming feature-and when one of the girls thinks the body on the floor covered in blood is the guy fooling about she has to actually TASTE the red stuff before she knows its not tomato ketchup! Its an insult to the intelligence of an idiot","I love low budget movies. Including those that are intentionally or un-intentionally funny,excess fake gore,violence etc.This,however is beyond stupid. Once you see the ending you'll say,what the hell was the point of all the killing scenes with no one around(except in a couple) to witness them.AND how did the ending actually come about(I won't give the WHOLE story away for those dumb enough to actually watch this) Granny is like a psychic Jason. First she's outside the window with a body and 15 seconds later she's in the living room knitting. The whole thing is a setup for a newcomer. They pull off graphic kill scenes,the knitting needles in the eyes,that only Chris Angel Mind Freak could pull off. And again,the very end was Pre-posterous. 56 min waste of time. I've seen one of the directors other films and it was almost as bad. Give me 20 grand and I could do better. This really deserves a big fat 0.","NO WAY ! I hated Granny. First, she is way too tall -of course she is, it is Tom, whoever's brother, who's playing her- and I hate that thing she does when she brushes her fake silver hair back, but : there are funny parts in this movie. For instance, the fact that every single actor looks V.G. (very German), and also that they think that, even when left alone, they should pretend that that guy (Tom) is their actual \"granny\" or something. I specially liked -not- that moment where Charlotte leaves and starts walking to the nearest gas station to ask for some help. She suddenly finds herself in the middle of some woods (where were these before? nobody dares explaining) and turns, turns, turns a-r-oun-d like a ballerina, looking at the stars...and...ignoring the fact that GRANNY'S BEHIND HER, READY TO STRIKE !!! But, anyway, the music wasn't so bad, the haircuts were okay and the ending terribly provocative... Mmmmm... wish I had the German version.","Oh my god, this movie is incredible, it's the baddest movie ever and I know what I am talking about! I am a scary movies fan!The story is totally silly, a group of adults decide to make a party and a silly guy with an awful mask comes and kills everybody... the dialogs are a kind of parody, worst, they're just talking about sex with a so bad accent. The end is (oh!!!!!!) discover by yourself! you will be really really surprised... (not possible! yes it is!) and surprise the movie is just 58minutes. (not possible (bis) yes it is!) Worst than House IV and Howling V.To put it in a nutshell, forget it forever!!!","This movie was plain fu***** stupid.  Not enough Axe killings and no sound effects while granny is killing the kids. Wake up people! you are all worried about that bad Special FX, acting and camera work when you should notice somthing that is very noticable.","I took it back & said we'd already seen it. They fell for it too. Thank goodness it was only on an hour. My friends will never trust me to pick a decent film ever again :(","This home movie is basically scandalously rubbish, but you have to give them 3/10 for trying. The blood is rubbish, but the granny that kills them is quite funny, and I think the concept is good, and make-up is OK for a home movie. However thank god it was only 55 minutes long, and the twist at the end is quite literally Fight Club (as in almost as trash as the film). Just read this comment, don't watch the film.","When you read on the back cover that the running time is only 60 minutes you wonder how a film can be that short. That only lasts until you start watching and then you think thank god it's that short. The acting is awful, granny can teleport about the house and you even have gravity defying blood in the bathroom. The end result is I LOVED IT","The only positive thing I could say about \"Granny\" is that it was mercifully short--at only an hour in length. This is because I have never seen a film with a bigger assortment of annoying characters in my life! In fact, they were so annoying and poorly written that I couldn't wait until someone showed up and started killing them as this would (mercifully) make them all shut up!!The film begins with a group of friends getting together to act like jerks. The men were particularly annoying and mostly made sexist comments, though a few of the women were also annoying and crass. Eventually, the killing began but it took way too long! This film is obviously a semi-professional sort of film. The acting is fair, the writing is abominable and it all looks like it was filmed with a home video camera--with sound that ranged from very good to almost unintelligible. The fact that writer/director/actor Boris Pavlovsky has no other credits before or since doesn't come as much of a surprise.","O sure, they knew what they wanted to deliver. A nice slasher. But without a good script you doesn't have a flick. This is a perfect example. This clocks in at 55 minutes and the first 10 minutes it's all about talking. The friends are sitting together in a room and are comparing each other over their sex lives. Once the story involves into granny things go wrong. But it's already too late. The first ten minutes destroyed this flick. You couldn't care about any person. When the killings start the first one was rather okay for a no budget. But from then on it becomes ridiculous. The stabbing of a girl has no red stuff flying around and the knife used is bloodless. What a mistake. Just before the girl is stabbed it again takes ages before she's ready making herself beautiful. By having all killings off-camera and only seeing the result it degrades to a turkey. But clocking in under a hour makes it watchable. The plot was a good thought although seen it before in April Fool's Day (1986). This is all so bad that it even becomes good, Gore 0,5/5 Nudity 0/5 Effects 1/5 Story 2,5/5 Comedy 0/5","made on an extremely low budget and with some of the worst dialogue i have ever heard in a film which is made even worse by the fact that none of the cast can act and are constantly stepping on each others lines there are far too many tedious scenes that go nowhere and for a slasher film with not much else going for it there is relatively little gore also there is some strange use of sound effects. The editing is sub par but not terrible as there is only one scene that desperately needs re-edited (also one of the dumbest parts of the film) the ending tries to deliver a twist but its nothing to write home about and rather contrived. Usually the dialogue is pretty hilarious and the casts overacting enhances the humour to a point were its pretty watchable would recommend to hardcore bad film enthusiasts","My partner and I sat down to watch this film over a bottle of wine last Saturday and although we initially had our reservations once the story got going it was in actual fact rather gripping. The scene in which one of the characters in brutally murdered by knitting needles was particularly shocking and echoed the work of Korean new wave auteur Park Chan Wook. The weapon of choice was a particular masterstroke and allowed us to see into the psyche of 'Granny', heavily altering the connotations of a loving, warm Grandmother into a murderous hag. The dialogue was incredibly moving and lyrical in expressing the innermost paranoia the protagonist. Pavlosky's selections of mise en scene furthermore enhance the unnerving and manical atmosphere of the nights events, combining with the Oscar worthy performances to create a chilling and thought provoking masterpiece. The ending, which I won't spoil for you here, reminded my partner and myself of M Night Shyamalan's institutional masterwork The Sixth Sense for it's mind altering twist that has left me thinking weeks after viewing. Definitely one to watch, repeatedly!","Granny is definitely one of the worst horror movies ever made in the history of cinema.The script was diabolical, so bad in fact that I was almost crying with laughter at some of the things they came out with. The acting was almost as bad, they would have been better off casting traffic cones to play the roles (they would have done a better job). The murders were laughable, the suspense was non existent, the camera work was ineffective and the \"major\" plot twist at the end was disgustingly inappropriate, it just gets worse and worse.\"The Granny\" is possibly one of the most unthreatening \"villains\" caught on film, she looks like she is wearing a cheap mask from the supermarket (the nylon hair caused endless amounts of laughter) and a frilly nightgown. Would you be scared by that??? I certainly wasn't.If you like watching bad movies (see Manos, Troll 2, Michael Bay films &#61514; ) then this is a must see. Those who don't like bad movies and don't enjoy laughing at shockingly bad dialogue, avoid like the plague."],"review-user":["miykwhat","Pheebshirl","wigglexwiggle","michell944","gamera64","Lord Vukodlak","extrema06","emotion_is_dead","BA_Harrison","vortgorn","iloverot","vulgarity-land","alicespiral","Ironhelm38","fegorleo-1","ilovefixou","octagon88","SCoRN [UK]","wong-3","werdna1690","MartinHafer","trashgang","spawned-13-860433","da-j-meister","mungthemerciless"],"review-date":["14 September 2003","23 April 2006","26 April 2006","17 February 2002","21 December 2006","30 June 2002","8 January 2007","28 April 2002","17 October 2008","30 August 2004","2 January 2005","1 October 2004","25 June 2007","17 June 2007","8 January 2007","2 November 2005","26 October 2003","18 June 2000","12 May 2000","15 July 2018","12 May 2014","13 March 2013","24 April 2011","31 July 2008","13 October 2005"],"review-rating":["2","1","6","2","7","10","2","10","10","1","1","1","1","3","5","1","3","3","10","1"],"review-title":[" It's so bad it actually becomes must-see stuff\n"," Awful but funny\n"," Granny says be nice!\n"," Hysterical!\n"," Crappy crapola!!\n"," Too short, though time well spent.\n"," The best £4 i have ever spent\n"," do not rent(buy?!) at all costs.\n"," Agonisingly awful but mercifully short.\n"," So bad it's brilliant!\n"," the best movie ever a must see\n"," Scariest horror flick since \"The Ring\"\n"," Gives trash a bad name\n"," Beyond the realms of stupid!\n"," Telefilm ? Ach, ja !\n"," You'll never see worst.\n"," Can somone tell me why there is no sound during the murder scenes?\n"," I can't believe they stock this at blockbuster :(\n"," OK I'm very very sad!\n"," Thank god it only lasted an hour\n"," This film made ME want to go on a killing spree to make these characters SHUT UP!\n"," one big joke\n"," script lol\n"," YOU'LL love it to pieces!\n"," Borderline Offensive\n"]}