{"review-url":["http://www.imdb.com/title/tt0338467/reviews"],"review-text":["This film appeared on cable television under the title of \"High Roller.\" It is a well-crafted biographical portrait of three-time world champion poker player Stu Ungar. In life, Stu's nickname was \"The Kid,\" and the film chronicles the descent of an intelligent young man with great promise, who becomes addicted to gambling and ruins all of that potential. As Stu, Michael Imperioli delivers an engaging and credible performance, capturing the essence of a life spiraling out of control from the craving of high-stakes gambling. The cast surrounding Imperioli is excellent, especially veteran actor Pat Morita, who plays a Las Vegas gambling impresario. The film's production values fall somewhere between a competent made-for-television movie and a workmanlike low-budget feature film, attempting valiantly to convey the period styles of the final four decades of the twentieth century. There is one revealing scene with documentary footage of the classic Las Vegas Sands Hotel being imploded and crashing to the ground. That moment vividly sums up of the sad life of Stu Ungar.","What is it about certain films that generates such polar opposite reactions?Some people here have called High Roller \"disgusting.\" Some have called it \"extraordinary\" (as would I, actually).Why? I think it's because films like this don't make heroes out of jerks, or glamour out of degeneration, and some people just can't deal with that emotionally. They NEED a hero. And I'd also add that if they're gamblers or poker players, they might feel personally betrayed when their existence isn't justified.High Roller in NOT a poker movie. It's a PEOPLE movie. It's not perfect, but it looks good, is well-written, and wonderfully acted. And best of all, it generates an emotional response and inspires reflection.And maybe that's what makes some people so damn mad.","An insult to both poker and cinema, this movie manages to make the most dynamic, brilliant, and fascinating figure in poker history into an utter bore. Still a fun film to make jokes about, from the lame gangster movie clichés of the first half to the incomprehensible nonsense of that second hour. Hilariously, Stu Ungar wins all three of his World Series titles without playing a single hand on screen. His infamous dealer abuse? 1 scene. His coke habit? 1 scene. His incredible memory? 0 scenes. They couldn't even get any real poker players. What did they cover? A lot of high angle shots from inside a house in the suburbs. Oh, and a montage of Stu waking up every day and shopping for meat which doesn't come anywhere close to making sense. Why do I care so much about this little Sopranos summer camp trying to cash in on the poker craze? Because I think there's still a great film to be made about Stu Ungar waiting for someone willing to do it right.","This movie was well acted and kept my interest in the main character for the entire movie. Stu Unger lived an extraordinary life. Imagine if Stu were alive today! This movie paints a picture of what Stu Unger's life might have felt like. It was interesting to see how connected was growing up. I would have liked to seen more detail on Stu's partying, his gamesmanship and his relationship to Bob Stupak. But all in all, this movie was well done, well acted and the story touched on many facets of a life that was full of many events that were larger than life.This movie is worth renting.","stuey unger was a card playing legend. he was quoted in an interview as saying, \"Some day, I suppose it's possible for someone to be a better No Limit Hold'em player than me. I doubt it, but it could happen. But, I swear to you, I don't see how anyone could ever play gin better than me.\" there's a gin rummy scene in this movie that is so amazing you could have plopped it in 'X-Men' as a showcase for a superhero's mutant power. that's how incredible this man was.i have a few minor problems with this movie. as dark as this movie was, stuey's real life was darker. poker pro todd brunson said, \"During the last World Series of poker, Bob Stupak, Mike Sexton and I had a drink and talked about Stu. Mike told us how he could barely talk, hadn't showered in weeks and how his fingers were burned black by a crack pipe.\" in the film, michael imperioli looked far too healthy to be stu unger in the final years of his life. when stuey won his last wsop he looked like a skeleton, but let's face it, this production lacked both the time and the \"deniro\" to make that kind of transformation. my other problem was that i wish there was more poker playing, with actual hands and situations. sure it might have bored the average non poker enthusiast, but it would have been nice for the hardcores. too bad the movie wasn't 6 hours or so longer.i watched the movie with 3 non poker players and they all thoroughly enjoyed it. just like you don't have to be a former member of the colonial army to enjoy Gibson's \"the patriot\", you don't have to be a poker player to see this gem. can't wait for the DVD. (8 out of 10)","Well, the movie was no terrible, but whomever created the screen play did not do a good job of even creating the essence of unger. This movie was slightly below average and did not tell the story correctly on one of the most interesting persons ever born. I suggest reading the book \"one of a Kind\" the real unger story. They left out huge parts of his life. They also at times did not understand the real caractor that he was. The actual facts of his life were at times out of order. And in the end they really did not portray the actual personality that he did have. So please don't watch the movie; read the book. By the way I'm not just some prick who feels you have to stay 100% to the real story, but they did not even come close!!!","You would have thought that this biographical film about Stu Unger (one of the greatest card players ever) had great dramatic potential, but this movie turns out to be a most undramatic undertaking. The plot device is to have Unger sit on a bed in some fleabag motel room and tell his story to a \"mysterious stranger.\" The story is told in linear flashbacks inter-cut with *much* talk in the motel room. I always get suspicious when a screenwriter has a character talk about himself rather than being able to formulate a scene to more effectively make the point, or at least have the character talking within the context of a scene rather than talking about a scene.This is a movie about a person and his profession. We get a lot of stuff about the person - teased kid, difficult father, marriage, child, divorce, drugs - but not much about the profession. As presented this is the life's arc of a not atypical contemporary American and it is not all that interesting. The focus should not be on why this guy was ordinary but rather why he was extraordinary. This is like offering a biography of Einstein but never drawing us in with an understanding of his professional accomplishments and his genius. Many opportunities are missed to provide some excitement, tension, and interest. At least some intense build-up should have been given to Unger's winning his first World Series of Poker, climaxed with his going head-to-head with poker legend Doyle Brunson. That scene was disappointingly uninspired. My god, how could they flub that so badly?A political party will play to its base and why this movie failed so miserably to play to its base of poker players is a mystery. Maybe it did not want to glorify gambling, and it does not, but using Unger as a poster boy for the evils of gambling is misguided - he was such an unusual person that drawing any general conclusions is questionable. In any case most drug addicts will not fare well at the tables and the fact that Unger could come back to win the WSOP in 1997 is an amazing feat. It has always puzzled me why passionate professional gamblers are considered addicts and cast in a negative light, but those who pursue other professions to the exclusion of most all else are accorded esteem.Some have honored this film for not sugarcoating Ungar's slide toward addiction and death. But from reading about Ungar's life it sounds like his womanizing, surly behavior, and drug use were much worse than portrayed. In fact I got more from reading the wikipedia entry on Ungar than I did from this film, so go there if you want to save yourself some time.Never having seen \"The Sopranos\" I had never seen any of these actors before and my reaction was, \"not bad, but not great.\"If you want to see a much more perceptive character study of a gambler, see Philip Seymore Hoffman in the under-appreciated \"Owning Mahoney.\"","Wow, i just witnessed one of the greatest poker tragedies and I'm not talking about the premature death of the great stu ungar. This film I'm sorry to say was terrible. Absolutely terrible. A true tragedy in filmaking history. Well maybe I'm being a little harsh but unless you have some interest in the life of stu ungar then don't even consider coming near this one. And those that do have an interest in his life will find that most parts were trivialised and made out to be great novelty scenes. I watched it because of Stu UNgar but nearly wanted to end myself like he did while watching this movie 4 stars for effort but unpleasantly painful","This movie has a \"big production\" feel that I was not expecting from an independent film. The characters are each developed and dealt with in a way that not only helps to tell the story, but left me with a satisfied viewing experience.","Having just finished reading the book \"One of a Kind\" a week ago, I was thinking \"This would make a great movie, especially now, when people know a little about poker and poker players\". I was totally shocked to find it while browsing at the video store last night. I had no idea someone had actually turned this into a film. I grabbed it immediately and watched with much anticipation. What a major letdown!All of the intriguing things about Stu Ungar were skimmed over quickly, and instead I was left with a biopic that could have been about anybody. Ungar may have been a burnt-out jerk, but he was also a brilliant thinker that could read people instinctively. That is what made him so fascinating. Why not focus on that?And talk about watering down the real truth. This guy was excessive about absolutely everything: drugs, women, gambling, starvation, sleep-deprivation. He gambled on sporting events from dusk to dawn, he would go missing for days while hanging out in crack dens, his body was perpetually emaciated, and yet, if he ever needed money, he could always beat just about anyone at will playing cards. Now that's a story!Too much time spent on his childhood and personal relationships (although his ties with \"Vincent\" and his daughter were hardly touched on) and hardly anything about his drugs use (which was exorbitant), his insane gambling and his incredible card-playing abilities.Probably too late now, but I hope someone remakes this film properly. I had no problem with Imperioli. He is excellent. The script just left him with nothing interesting to say.","This movie is a shameful result of what happens when:A) It is written, directed and produced by an idiot. and/or B) It was rushed in production to satiate the poker/Stu Ungar craze. The story from beginning is uneven. Vidmer spends too much time on Ungar's childhood and not enough on some of the legendary tales -- such as counting cards, his blackjack escapades, the roll of money as id. He also leaves out mentions of other poker greats such as chip reese, brunson etc. The movie is a complete mess from beginning to end. If you want a more complete and accurate account, read the book One of a Kind. If you thought the movie was good, read the book and change your mind.","By many accounts, Stu Ungar was not a very nice guy. He spat on dealers, stiffed people he owed money to, and was verbally abusive. Many filmmakers might choose to sugarcoat the man, making him into some sports hero that would triumph despite adversity. But High Roller doesn't do that. And that's a tough row to hoe.Instead, we have to look VERY closely to see a man that never matured passed the frightened little boy from the streets of New York, despite all his successes. And the only real approval he ever gets is from death himself. Very brave (because people won't get it) and very touching (when you do).What is also brave is the use of a Scorsese feel. \"Aha! How derivative,\" people will say. Really? But there's virtually no violence. And Stuey LOVED gangster movies. Maybe the feel reflects the man Stu and not the director Marty? And if it really is a low budget film and looks that good, bravo!Finally, the linear flashback structure. Wow, will that get hammered. Yet, not only does it work, it works exceptionally well, even for those who don't see the connection to the \"Seventh Seal.\" (PROOF: In SS, Knight plays game of chess with death: In HR, Stuey says \"We can play a hand of cards for, ya know\"... Death says \"Never much good at cards..\" Damn great last line.)No tricky effects or camera moves. No shaky camera. Nothing trendy at all. Just solid, tight storytelling.Maybe that makes the movie too basic and somehow flawed. But then again, so was the guy. And that makes it just about right.9/10","This is probably the worst movie I've seen in a long time. Independent or not, solid writing is a must. Ditto for directing and acting. I know these actors can act (I've seen them in Sporanos and more...) but this movie is very bad, very bad. Maybe it's the script, maybe it's the director. Probably a little of both.....Probably a LOT of both! Technically OK, Just bad, bad, bad... I have a theory that the backers for this movie also own the Poker magazines, because I saw a very favorable review in one of the magazines. \" Hey' we made it, so it's gotta be good, right?\" Not so fast Bucky. I know it takes a lot of hard work and money to even get a movie made, much less sold and distributed, and for that I commend these folks. But the final product, leave a bad taste in my mouth.P.S. I won a free rental and chose this movie from Blockbuster. Tomorrow I'm going to get my money back.","This movie attempted to make Stu Ungar's life interesting by being creative. What they forgot is that his life was plenty entertaining enough on it's own without having to make things up.A short list of the inaccuracies: 1) Stuey was not sent straight to Las Vegas for a Gin Tournament to pay off old debts, he spent a good deal of time in Florida first, and only went to Las Vegas when he ran out of Gin games on the east coast.2) Stuey never associated (or played Gin) with a casino executive (like the one played by Pat Morita in the movie.) 3) There was no magical turnaround in the buildup to the 1997 WSOP. In fact Stuey barely made it into the tournament as it was. He snorted Cocaine the week before even.Either tell the story right, or don't tell it at all. 4 out of 10 stars for Michael Imperolli's credible performance (the only redeeming quality of this movie.)","How does this movie suck? As a fan of Michael Imperioli's work on The Sopranos I picked this up at Blockbuster based on his name and a story that sounded like it had promise. It still does, but this movie doesn't fulfill it.Every turn of the story is entirely predictable; I kept looking for the Lifetime bug on the bottom right corner of the screen. It's all there: the noble woman coming out of hard times, the guy failing to live up to his potential despite her best efforts, the kid who gets stuck in the middle, etc., etc., etc. The mysterious stranger's identity is what really made me want to throw stuff at the TV -- I would have been more satisfied with little Stuey waking up and realizing it was all a dream.The filmmakers may as well have had a \"The moral of the story is...\" bit before the credits, since as another reviewer pointed out this thing really does roll like an afterschool special. Don't gamble, don't drink, don't do drugs, stay with your wife, spend time with your kids...come on, how about a little nuance? How about some interesting bad guys? Writer/director A.W. Vidmer should be singled out for special notice: not only is the dialogue leaden, the pacing (within dialogue and at either end of many scenes) makes this movie at least 45 minutes longer than it needs to be (and believe me, it feels like longer). The talents of Imperioli, Renee Faia and some of the supporting cast (Steve Schirripa, natch) are the only things that keep this from a \"1\" rating. All of their good work is nearly offset, though, by the atrocious job of portraying the boy Stuey. Not sure if it was a casting mistake (hey -- it's a mob movie, so let's cast someone from Blue's Clues who can't do anything but over-overact with a big fake grin...next let's cast the sullen, brooding kid in the Disney flick) or just awful directing but those scenes are really painful to watch.I'd be interested in another filmmaker's take on this character and his story; it's a shame Imperioli has already been used up by this flick. Awful, awful, awful.","Stu Ungar had one of the most exciting and crazy lives a poker player/gambler could have, and this movie does an incredibly poor job of showing it. I am a poker player and a fan of poker in general and was extremely excited to hear that a movie about arguably the greatest player ever had been made. All this movie does is gloss over his life. The poker scenes never last more than 1 or 2 hands, so there is no depiction of the flow or struggle experienced in large tournaments like the WSOP. His well known struggle with drugs is barely even touched. In real life, the guy had to have surgery done on his nose because he snorted so much coke that he ate through the cartilage, and then he started smoking crack to avoid damaging it further. In the movie, there is only one scene of him snorting coke. Not a thing is mentioned about his step son who killed himself which sent Stuey further into self destructive behaviors, why would such a crucial life moment be left out? Also, towards the end, the movie gives the impression that Stu is recovering. There are multiple scenes of him being rehabilitated by his Vegas friend who tries to show him how to live a normal life and it seems to be working. Then it jumps to Stuey dying in his hotel room to end the movie. What the hell? Show the downswing! As far as I am concerned, a legit Stuey Ungar movie has yet to be made. I blame the writing, even with quality actors like Micheal Imperioli, this script fails to tell an accurate story. I realize things need to be changed a bit for a Hollywood movie, but this falls so short that it gives a false interpretation of Stuey's life and I would not recommend it to anyone who wants to learn about Stu Ungar.","I rented this movie hoping that it would provide some good entertainment and some cool poker knowledge or stories. What I got was a documentary type look at an average guys life who happened to be really good at cards. Do I want to see the romance with his wife? NO Do I want to see about everything that went on in this guy's life except poker? NO. Well thats what you get with this film. The acting is good for such a low budget piece of crap. The film never tries to break the mold or do anything original. It simply sleep walks its way through the script. The ending is disappointing and never really looks deep into Ungar's mind. Instead it focuses on what was already obvious. He was a drugged out card player with an average life not unlike any other average joe in vegas. The movie focuses on the aspects of his life that were UN extraordinary rather than the Extraordinary. The poker scenes in the entire film add up to about 4 minutes of footage. Ungar's achievements of winning the WSOP 3 times seem life after thoughts. A 10 year old could do a better job directing this movie.. or maybe it was the script being a piece of crap from the beginning that doomed this joke of a movie.If you want to see a film about gambling watch Rounders. It at least has style.","Saw the film at the Nashville Indie Festival. The technique of the mystery visitor making Stuey relive his life for the camera was great. It really provided a lot of insight into his character. Quite an impressive film -- I'd highly recommend it to anyone who's into mystery and curious about high living.","This is possibly the worst film I have ever seen. What a weak waste of Michael Imperioli's obvious talent. Disgusting film from start to finish. All I can say is, this director is no 'auteur'. You never once get inside the game, the character's head, the amazing talent with numbers the real Stuey had. The coke scene is bad enough to throw your shoe at the set, it might have been a great scene had it been shot for movies and not the stage, with the camera half way across the house hovering over a mirror with drugs on it while the drama is going on far in the background. The scene where he wins the big championship is just laugh out loud ridiculous. This should be screened in Film-making 101 - What Not To Do In Making Pictures.","20 people rated this a 10! That ballot box was stuffed better than a Christmas turkey! Speaking of turkey's, here's a traditional story hoping to piggy-back on the current poker craze - without success. Told entirely in linear flashback, and when I say \"told\" I mean TALKED TO DEATH, this film never let's a picture suffice when words can be used to exposit.Stu Unger's childhood fascination with cards and his associations with hoodlums might sound like interesting movie material, but the director manages to suck the life out of them. At no point did I feel the least bit of sympathy for Unger, a genius at cards who threw it all away on other forms of gambling at which he was not so proficient. Of course, this leads, as we wade through THREE musical montages, to the inevitable downward spiral of drugs, loss of family, and finally his redemption (sort of). Big yawn!","Personally, I find watching poker on TV to be very boring. This is about poker, but more about how it affects life.Michael Imperioli plays the title character, a three-time World Series of Poker winner before his death at 42. This is how he rose to the top and fell back down just as fast.He was an addicted gambler until he managed to win the World Series of Poker the first time. He protector (Michael Nouri) died soon after, but he managed to get his former girlfriend (Renee Faia) back with his winnings.But it went downhill from there. He lost his wife and daughter, and just went to hell.Somehow he got it together to win a third time after a 16 year absence. But he went right back downhill.Imperioli was fantastic, and Pat Morita was a bonus.","Stu Ungar is considered by many to be the greatest poker / gin player of all time - an extraordinary self-destructive force of nature - tiny in stature, but a huge heart for the game.What we have here is a kind of Hallmark film about the dangers of gambling. Sure, he wins, he loses, he blows it all on sex, drugs, and more gambling we get it, but where is the real play - where is what made him the greatest card player of all time.Much too flat, and frankly boring in places, this gets a four because we get to learn something about Stu the man, but Stu the card player, nada.Nicely shot and presented up to a point this is the perfect example of how not to make a film about cards: honestly, ESPN's coverage of the World Series is more watchable than this.A waste of a great chance.","First off I want to apologize in advance for my English. Hope you all get what I'm trying to say. As a longtime (amateur) poker player I've been reading and watching every book or film coming out with poker in it. I myself play mostly plo cuz I don't cope so well with the swings in nlhe. What can I say, I'm no Archie Karas.Now about Stuey, Stu Ungar was and will always be an icon in the poker world. Everyone who doesn't gamble think that's what the gambling world is all about, making money then spending it on sex, drugs and rock'n roll. Well Stu was such a larger than life character. His brilliant mind needed more than just the thrills of playing cards to stay satisfied, he started taking cocaine NOT so he could be able to play longer sessions (players took metamfetamine for that) but to numb his brain after days of intense playing. The intensity that Stu Ungar had in everything he did or said, his table presence that was felt everywhere he sat was never brought to the screen.If you make a movie about a poker icon you don't wanna try to make it for everyone to watch, cuz then it's turning out to be more of an educational video than something else. It should be for the fans and this wasn't!! The casting was terrible 2, Stu Ungar snorted away his nose after two decades of drug abuse and they cast Michael Imperioli to play him. Michael probably has the largest nose of any actor in the business!! Michael Jackson probably would have made a more convincing Ungar than this.Conclusion: this movie is NOT for poker players but for people who never heard about Stu Ungar or Texas hold em. It isn't fast paced like Stu Ungar's life was and turned Stu into a dull, boring alter ego of himself, Stu wouldn't have liked it!","What in the world! This piece of gambling cinema would have been suitable for the Lifetime Network. Michael Imperoli is a good actor but I think his portrayal as \"Stu\" fell short. The montages were unbearable and too many. The supporting cast, where are you? Whoever did the casting should be partially at fault. The cinematography was useless. A gambling story with an after school feel to it. Stories of this sort should be left for the Oliver Stone's of the world. It would still suck ass but at least it would be fun to watch. It was an attempt that lost it's wheels before the race ever begun. Mario Andretti in the 1982 Indy 500 came to mind.","The basis for this dynamic docudrama is the true story of one of the most extraordinary card players ever.STUEY is a tight, cohesive biopic of a true poker Ace whose life is a one-way trip down the Highway to Hell with few detours.This dramatic feature stands wide apart from other films about poker. It represents a rare and earnest attempt to bring to the silver screen a true story of ultimate gambling compulsion. The complete obsession that annihilates any proximity of spirituality and nullifies any chance of redemption. This is the least likely movie a Vegas Casino executive would recommend. And it is the sole poker DVD you are likely to find on the shelves of Gamblers Annonymous.There are scenes in this movie that poker buffs are sure to refer to as some of the best gambling scenes ever. Stu reading his opponent's hand and, particularly, a Texas hold'em bluffing scene.Prophetically, early on in the movie we see a young Stu bullied out of his pocket change by a bunch of neighborhood hoodlums. Poker is for loners seeking revenge. It is a game of patience which bullies lack. 'You can't bully me!' may very well be an underlying sentiment of the punishing force that a champion poker player unleashes upon his adversaries.Conservatives will look upon this film as a cautionary tale of a soul lost in sin. They may evoke Mark Twain: 'The best throw at dice is to throw them away.' The young and liberal masses will inevitably have a more simplistic and sympathetic outlook. They may not have heard of Twain's quote, but will sure remember a remark made by Stu's stunned pal who learns from up-and-coming Stuey that he'd won a car from a local character in an overnight game. 'You tell'em to go to hell and they look forward to the trip'.The mosaic of Las Vegas vignettes that we see in STUEY will long linger in memory. Frank Sinatra, the most generous tipper? Forget about it! Nobody tips as extravagantly as a hot-shot gambler. And for Vegas visitors who may not know the impact of tipping on the quality of their stay, check out the scene of Stu checking in a Vegas hotel!'This is what i was meant to do, this is where i was to be. Movie stars in Hollywood, politicians in Washington and gamblers in Vegas.'"],"review-user":["lavatch","filmflam-1","kawalsky","trainofvideo","emineric","jtdeible-1","bandw","harvard_guy","goodthings","johnnydelbravo","m0j0deuce","filmzrheaven","jallen-21","j_kro","jpoling3","da03","er1cindy","suzie-bcoc","pix_chick","jwgmm","lastliberal","intelearts","wuytskristof-823-169489","derbyhandicap","Charles_LePoje"],"review-date":["11 February 2005","17 May 2005","11 April 2005","30 May 2005","31 January 2005","31 August 2006","12 July 2007","25 September 2006","15 May 2003","2 December 2005","23 November 2005","8 April 2005","17 April 2005","26 January 2009","7 August 2005","16 June 2009","24 April 2005","19 May 2003","17 May 2005","29 March 2005","22 August 2009","7 March 2009","11 April 2012","15 July 2005","13 July 2005"],"review-rating":["8","1","7","8","4","5","4","10","2","1","9","1","4","2","5","1","1","3","6","4","1","7"],"review-title":[" A Sobering Look at Gambling\n"," Recognize yourself?\n"," play me in gardena\n"," Interesting background on legend.\n"," a tale so extraordinary you have to see it to believe it\n"," Average movie and nothing like his life.\n"," Not terrible, but probably not worth your time\n"," One of the great Poker tragedies\n"," This movie took me by surprise, it's complete and tight - well done.\n"," In a word: dreadful\n"," great poker player, terrible addict, horrible movie\n"," Smart and brave...\n"," Probably the worst I've seen in a long time.\n"," Too many things that didn't happen, reality would have made a better movie!\n"," Let me count the ways\n"," What a let down\n"," Average Guy, Below Average Movie\n"," Great first film from AWV\n"," Pee-ew\n"," Tedious biopic - unsympathetic subject\n"," See, life is a people game, too. Only... the emphasis is just a little bit different.\n"," A lesson in how not to make a poker film\n"," A slap in the face to every poker enthusiast\n"," Mommy....I'll never watch a bad poker movie again.\n"," Movie stars in Hollywood, politicians in Washington and gamblers in Las Vegas\n"]}