{"review-url":["http://www.imdb.com/title/tt0373175/reviews"],"review-text":["My Architect by Nathaniel Kahn is that ancient story, the search for a man's father.  Nathaniel was the illegitimate son, the `bastard,' of Louis Kahn, the architect who died in Penn Station, New York, in 1974 coming back from Bangladesh.  Kahn had three children, but only one by his wife; the second daughter and only son were by two other women.  The architect was a nomad and a man obsessed with his work.  He saw Nathaniel and his mother once a week, but Nathaniel never got to know his father well.  Lou Kahn died when his son was only eleven, and the secret children and their mothers weren't supposed to come to Lou Kahn's funeral, though they did.So 25 years after his father's death, at the age of 36, Nathaniel set out to make this film to find out who his father was - and he has done an amazing and triumphant job.  He begins with a sketch of Kahn's origins, the fire that disfigured his face (it looked pock-marked), and his early displacement to America.  We learn about Kahn's development over time and the sources of his style.  They look back to the archaic and the monumental, not to anything his contemporaries did.Nathaniel visits all the significant people and places in his father's life as well as a number of important architects. He starts out with `the man with the glasses,' Philip Johnson.  Johnson talks about what a `nice guy' Kahn was.  `All the rest of us were bastards,' he says.  Johnson's point is there was a lack of jealousies or rivalry, a selflessness:  that focus on the work; it's also clear Kahn is a member of the Johnson pantheon..  I.M. Pei makes one thing emphatically clear:  he considers Kahn his superior. `It's quality, not quantity, that matters,' he says rapidly and bluntly when Nathaniel suggests Pei was more `successful.'  Kahn may only have completed a few buildings, Pei says, but they are great masterpieces.  Later in the film Frank Gehry says Kahn was his original inspiration, that without Lou Kahn, he would not be.  It's plain that the most famous architectural figures of our day are all in awe of this man. A failure morally, a man who couldn't do right by the people closest to him in his life, Louis Kahn is perhaps the greatest American architect.  That fact emerges as powerfully as do his personal shortcomings.Nathaniel `interviews' the great buildings, too, most beautifully and movingly.  His camera scans their spaces.  It peers at them far and near in different lights and shadows.  We even see him from far above, roller blading around the space encompassed by the Salk Center in La Jolla, casually making friends with and taking possession of it after an interview with the man Kahn worked with when the center was designed.  These viewings of the buildings, a revelation of the man's achievement, presented for the most part without commentary, are deeply moving both in and of themselves and in the context of the searching portrait of the man behind them.To skip forward to the end:  in the film's final segment Nathaniel Kahn tells Shulyar Wares, the Bangladeshi architect, that his three days of photographing the government building at Dhakka, Kahn's last great project, will only yield at most ten minutes of film.  `Ten minutes!' Wares exclaims. `You would try to do justice to this building in ten minutes!  To its spirit, its power, the ambiguities of its spaces!' Wares then speaks about Kahn's achievement and character. It's not unusual for a great artist to fall short as a man, he says:  the one failure may be necessary for the other success. It's an eloquent, seemingly spontaneous speech, and a perfect finale to the portrait.It's hard to do justice to this film without summarizing it scene by scene. It's the cumulative effect of the interviews, plus the fine photography and the brilliant editing, that all add up to an extraordinary portrait of a great artist and a flawed but complex man.  Nathaniel Kahn's simple bravery before the camera leads to a series of intensely revealing, often moving scenes with the people in Kahn's life. There are quite searching conversations with the two other women, including the filmmaker's mother. Nathaniel Kahn never falters or spoils the tone:  he isn't confrontational, but neither does he avoid hard questions.  He's serious, but without an ounce of self-importance.And while the interviews are powerful, they are paced by visits to the few but great buildings, whose effect at times is transcendent, and needs no inflated commentary from Nathaniel or anyone else.It's astonishing how the film modulates from some rather petty remarks by men who worked with Lou in Fort Worth (who considered the architect impractical and airy-fairy) to the building that resulted, backed up by Beethoven's Ninth.  If you can look at a building with Beethoven's Ninth as background and the music seems right, you know it's a great building.  And this is the revelation of My Architect:  that Louis Kahn's buildings are magnificent, radiant visions of serenity, vastness, and beauty:  that they're among the artistic masterpieces of the twentieth century and we're fools not to go see them.  I for one plan to make the pilgrimage to La Jolla for the Salk Center as soon as I can.The triumph of Nathaniel Kahn's documentary is its balance.  While the exploration of the buildings and the processes behind them goes along, so also the search for the secrets of Kahn's life continues through the course of the film. We realize that indeed as Wares says, Kahn's weaknesses and his virtues are inseparable. If he was a bit of a Don Juan, it's because he was a man of great personal charm, a man without poses or pretenses whom everyone liked - though sometimes they had to give up working with him to save their health and sanity, because he worked so relentlessly.  Neither of the `other women' would have had it any other way.  The first found working with him tremendously rewarding despite the painful secrecy (she was an architect too), and the second, the filmmaker's mother, still believes that Lou was about to come and live with them when he died. And if Kahn was irresponsible toward women, he was passionately committed to his work, and the result is a lasting monument of triumphant buildings.There is a surprising amount of footage of Kahn himself, so that his face, his stature, even the way he looked walking in and out of his offices in Philadelphia, are always a reality to us. It's appropriate that Kahn died in the huge train station, his address mysteriously obliterated from his passport.  He died as a nomad, exhausted from his great final project in Bangladesh, driven, isolated.  Nathaniel even managed to find and interview - in California! - the railroad employee who found his father's body in Penn Station 25 years before.  The whole film seems a combination of diligence and serendipity.  It's a homage with equal measures of passion and restraint.  Though a search for self in a way, it's selfless and compassionate.","Documentaries in which sons and daughters seek to understand a parent and, by the process, their own lives are not that uncommon.  Also not uncommon are results that reflect lack of talent, a failure of introspection, an abundance of narcissism and, perhaps, an unsubtle quest for publicly-splashed revenge for countless past hurts, real and fantasized. What is unusual is a brilliant, fair and engrossing portrait of a fascinating parent and \"My Architect: A Son's Journey\" is that rare achievement.Louis Kahn emigrated to this country as a child, his face irreparably and brutally scarred by an accident.  He and his parents settled in Philadelphia where the talented youngster loved art and music.  Soon he became enamored of buildings and decided only an architect's career would answer his creative abilities.Kahn became an architect but as this film shows it took a long time before he attracted the attention of the leaders in his field. One architect suggests that he was a victim of the \"yellow armband,\" that anti-Semitism that along with bias against women was long a disreputable aspect of the American profession of architecture.When he did achieve notice, he was seen, clearly accurately, as a self-assured, workaholic prophet exclaiming unyielding demands that his vision and only his vision be realized.  That inflexibility was the reason that while he drew wonderful plans for many buildings he built but a few. The interview with an aged gentleman who fired Kahn in Philadelphia because of his unacceptable dream of a transformed urban center where people left their cars on the perimeter and walked into the city is hilarious.Kahn was a born teacher and some of the extensive archival footage here shows him with students, his voice steady but passionate, their gazes respectful and intense.Many architects were interviewed by director, writer and project honcho Nathaniel Kahn, the architect's only son.  Some are world famous - I. M. Pei, Robert A.M. Stone, Moshe Safdie, Frank Gehry and the still active nonagenarian, Philip Johnson.  Their comments paint a vivid picture of this idealistic but in the end financially unsuccessful designer of buildings that blended the castles, fortresses and grand buildings of past centuries into designs for the present.  Kahn's buildings are shown, among the most impressive being the Salk Research Laboratories in La Jolla, CA.  To me his style has a neo-Romantic air deadened by too much blank space that repels rather than attracts human interaction.But Kahn's son was after more than the story of his father, the architect. For many years Louis Kahn had three families: a wife with whom he had a daughter and two long-term relationships, one of which produced a daughter, the other the son. Kahn visited his son at the mother's home often but at the end of an evening mother and son would drive Kahn back to the marital home.  Nathaniel clearly wanted to know about this unusual set of relationships but he doesn't appear to be scarred by what was certainly a strange affair for a little boy.  When Nathaniel was a young boy Louis Kahn died of a massive heart attack in the men's room of New York's Pennsylvania Station after returning from India where he had pitched one of his massive projects, another one that was never built.  At that point his Philadelphia firm was at least $500,000 in debt and had he lived a trip to the federal bankruptcy court was probably in the offing.Kahn left several monumental structures of which the government building in Bangladesh is clearly the biggest.  A teary local architect hails Kahn for having created a building where democracy may (and hopefully will) flourish.Fellow architect Moshe Safdie opines that there might have been something fitting in Kahn's suffering a mortal heart attack in a train station given his incessant globetrotting.  I disagree: it's sadly ironic that Kahn should die in the faceless replacement for one of America's true architectural gems, the old Pennsylvania Station, wrecked to make way for a sterile replacement with no character and no continuation of civic memory.There are a number of emotional moments filmed during the younger Kahn's journey, including with his half-sisters and his mother, but they're genuine and moving, not maudlin and staged.  Historians of architecture will always study Kahn.  His son found reasons to remember him as a flawed but very iconoclastic and ultimately private man.9/10.","I saw this movie 4 times within the course of 2 weeks, and could probably have seen it 4 more times without losing interest. To me the movie is 3 things: a story about a son's search for information about and connection with his father; the father's story, both personal and as an architect; and an homage to the father's architecture. I find the movie very rich on all accounts.I found the son's search very moving and one I immediately connected to emotionally. The father's story is very interesting--a lot of mystery but also a lot of information, including film of the father which greatly enriches the story. And the architecture is quite wonderful and presented in a very moving way.The movie is full of interviews, many quite wise and spiritual. A few folks present \"the other side of the coin,\" so we get a good picture of the contradictions of Louis Kahn, his family and colleagues.The editing and pace of the film drew me in and kept me engrossed throughout. Especially wonderful was the music. For me this movie is like going to a concert, a museum and a spiritual event all at the same time, as well as seeing an engrossing story. A wonderful experience!","My Architect is a great film about Nathaniel Kahn's search for himself via the legacy of his famous Architect father, Louis Kahn, dead since 1974. The film builds slowly, but perfectly, and what starts out as a seemingly lost fortysomething's identity crisis unfolds into a beautiful tale with much deeper meaning with regard to the importance of love, loss, family and perhaps more importantly, our life's work.I had never heard of Louis Kahn prior to this film, although I was vaguely familiar with some of his work.  Through the words (both good and bad) of Louis Kahn's colleagues, you get a very good sense of what Nathaniel must have felt as memories are recalled and stories retold.  Sometimes it seemed as though these people were telling Nathaniel how to feel about his father. As I listened to each recollection, my own opinion of this man would range from beautiful to horrible, sometimes in the span of a moment, so you get a good feel for the rollercoaster that Nathaniel's emotions must have been riding.The final sequence in Bangladesh totally made the film for me.  The reverence of which the people of Bangladesh spoke of Louis Kahn's work tied all the loose ends together nicely for me, and, hopefully, for Nathaniel.I think Nathaniel Kahn finally found what he was looking for.","My impression, having seen this documentary, is that Nathaniel Kahn ended up with more questions than he had before he made the film. He took five years to make it, a labour of love and longing. I can only imagine the turmoil of the editing process, what to leave in, what to take out. His father, the renowned architect Louis Kahn,comes across as a man too selfish and self-absorbed to be emotionally available to even one wife not alone three. But like many men of his character, he attracted women who were spellbound by the remoteness and entranced by the creativity. One of his mistresses said he was \"accessible\" but that is never explored. Other comments by people who knew him well suffer the same fate. A pity. The tension between the three half-siblings in the room of a home Louis designed is also palpable. The unsaid hovers over the conversation. The only tracks that his father left were in the buildings he left behind, some great, some not so great. I was captivated by the music ship and the Salk Institute. Saddened by the baby mothers who got caught forever by his callous impregnations never more exemplified than what he said to the director's mother upon being told of her pregnancy - \"not again!\" 8 out of 10, beautifully filmed, genuine. It appears, in this case at least, the son is not the father of the man.","A frustrating documentary. Louis Kahn's son, who saw his father only minimally during his childhood because he was a member of just one of the three separate families his father had created, takes on the task of trying to learn more about his father through an exploration of his architecture and his life. It sounds like a great idea for a documentary, but it ends up flat and uninteresting.Sadly, the basic problem is that Kahn's son, Nathaniel, is not just one of the film's protagonists --- he is also director, writer, producer, interviewer and narrator. Nathaniel seems both too inexperienced and possibly too close to the material to function well in any of these roles. Further, while he seems like a nice enough guy, he doesn't have much screen presence, so the fact that he is the only constant in the film becomes wearing. Nathaniel also comes across as an unprepared and amateurish interviewer --- there are several points where an interviewee makes an interesting or provocative statement and the camera cuts to a shot of Nathaniel offering little more than a blank stare and a sort of timid \"uh-huh,\" as if he's a little panicked that he's going to have to come up with something to say in response. At times, I felt embarrassed watching people who might have had truly interesting things to say about Kahn (or at least better things to do with their time) seeming to realize that they were in the hands of an interviewer who was going to rely on them to direct the conversation. Nathaniel's dual role as both documentarian and lost son seem to do more to hurt the film than help. One senses that some of the interviewees are a little reluctant to really open up about negative aspects of Kahn's personality and career, presumably because it's not clear from Nathaniel whether he's looking to dig into the truth or simply wants to hear nice stories about his Dad -- preferably ones that will confirm his hope that his Dad really did care more for Nathaniel and his mother than seems likely. His passive approach as an interviewer may stem directly from this conflict. The only person Nathaniel does push is his own mother, but those conversations tend to feel a little like bad teen drama (Aren't you ANGRY, Mom?\") and don't offer much in terms of helping us (or Nathaniel) understand Kahn or the loyalty he evoked from those around him. What the film desperately lacks is shaping by an experienced and independent hand, not to exclude Nathaniel, but to balance his subjectivity and inexperience. An independent director could have stood away from the material, given more thought to what the interviewees could contribute and, one hopes, cut out those portions of the documentary process that just don't work, such as the weird segment with the guy who claims to have see Kahn die (which made it look as if Nathaniel was just being taken in by some loony) or the entire bit about hooking up with Kahn's first cousin, who had nothing to add about Kahn or Nathaniel. Too many times Nathaniel makes us watch him standing in or near a Kahn building buttonholing strangers to tell them that his father was the designer. (Ahhh huh. Thaaat's nice, sir. UmmI gotta go now.) I understand why these things might be important to Nathaniel and that showing the documentary process is sometimes interesting, but this is one of those examples of when a documentary can be TOO personal.As an aside, I thought the score written for the film was great! (But, one of the oddest moments in the entire thing for me was when, during the tour of the Kimball Art Museum, the voice-over quotes Kahn as making a comparison between architecture and Beethoven's Fifth Symphony. The music being played at the same time? Beethoven's NINTH Symphony. A mistake? A miscue? Who knows? It did make me laugh.) Kahn was a great architect and it's clear that he was an unusual human being and had an intriguing life story. There's definitely a good documentary to be made about him. One is sympathetic to Nathaniel's search for the father he didn't know, but I'm not sure whether THAT is an interesting story. Neither works so well in this film.","What a tribute to his father! He set out on a quest to learn more about a man whom he knew little of, and by the end of the journey, I believe Nathaniel Kahn is content with what he learned and personally felt. The film is 5 years in the making, and a quarter of a century after his death, Louis I. Kahn's total commitment in his work - consistent strong desire to build buildings that are meaningful to humanity and timeless to the whole world, with insight into his life is proudly depicted by his son Nathaniel in the documentary \"My Architect: A Son's Journey\".The film is by no means an anthology of Louis' work. There are plenty of books and archived materials that have records of Louis Kahn's projects and buildings. This documentary works like a mystery, writer-director and co-producer Nathaniel Kahn was searching for the man whom he briefly knew as his father. The film is in chapters. In \"Heading West,\" we're at the Salk Institute for Biological Studies at La Jolla, California. It's a sight worth beholding - Kahn's integral concept of building and environment, optimizing light for the scientists at work is amazing. From a former colleague who worked with 'Lou' 35 years ago, we hear about his meticulous attention to detail, also how 'rambunctious' he could be - certainly didn't mince words in his criticism. A memorable scene is when the camera pulled back wide and we see Nathaniel skating around at the plaza area of the Salk Institute - a tiny figure, like a child happily playing in the bowl of his father's hands. \nThe \"Immigrant\" segment brought us to meet Anne Tyng, the architect who collaboratively worked with 'Lou' and also bore him a daughter, Alex. Now at 80, Tyng's return with Nathaniel's film crew to the Bath House project at Trenton, New Jersey, was nostalgic. In \"Go to sea,\" we get to see the Barge for American Wind Symphony Orchestra - all made of steel, and meeting Robert Boudreau, who was surprised by Nathaniel when he finally told him he's 'Lou's' son. Boudreau was touched, he said he had seen Nathaniel when he was six, with his Mom (Harriet Pattison), and he was not to tell anyone that Lou had a son. It was a 'chokingly' emotional moment of reunion.\nLike his father \"The Nomad,\" Nathaniel traveled to Jerusalem, and learned about the Synagogue project that his father began but not realized. He visited the wailing wall, and seeing his yarmulke kept falling off/being 'breezed off' his head gave me a sense that he need not be 'totally' Jewish to be his father's son. We continue with sitting down with his two half-sisters at the \"Family Matters\" segment. We also hear him conversing with his Mom at Maine, and from talking to previous office personnel at his father's office, we come to know how his father intensely worked and practically lived there, sleeping on a carpet on the office floor, weekends and all. \"The End of the Journey\" brought us to Ahmedabad, India, to the Indian Institute of Management building. Talking with architect B.V. Doshe was a revelation. In the end, Nathaniel found a very much alive Louis Kahn, his father - his spirits live within him. This documentary is very much a tear-jerker for me. I was teary-eyed most of the time - it was very touching and am in awe of the man, the architect and his son, and the women in his life besides his famous works and buildings. Louis I. Kahn wanted to give his love to the 'whole world,' juggling work and three families (you might say he has three women in his life to keep his inspiration going). As Shamsul Wares, the architect at the Capital of Bangladesh complex (completed 9 years after 'Lou's' death) so poignantly noted: Louis Kahn has given the people of Bangladesh a lot, spending time at Bangladesh, understanding the culture of the place and people - as well as giving them democracy through what he has achieved, and for such a dedicated man, usually the people close to him he'd often miss seeing. It seems the price of being great comes with inevitable personal sacrifices. This film reminds me of King Vidor's \"The Fountainhead\" 1949 (good dramatic story in B/W with music by Max Steiner), based on Ayn Rand's novel, with Gary Cooper as the uncompromising architect who stands by his own ideals, and Patricia Neal as the parallel supportive woman in his life.","When Nathaniel Kahn embarked into this voyage, he hardly knew who his father really was. By the end of the film, he found him and comes to terms with the strange life he lived as a child.Louis Kahn was the father. He was an architect's architect. His designs were perhaps too complex, as he tried to create buildings that didn't conform with trends popular at that time. It is ironic that he never achieved the fame that came so easy to some of his contemporaries. He had a vision and he never strayed from it. We can see characteristics of his unique style in the buildings he left behind as a legacy to humanity. Every one of his creations are unique in that they don't imitate works from other architects.Louis Kahn's life was rather complicated. He was married, yet he had affairs with two of his assistants that produced a girl and a boy, besides the legitimate daughter he had with his wife.As a boy, Nathaniel Kahn's life was lived in a secluded area, away from his father, who only visited late at night. Louis Kahn never recognized these children, although it is very clear they all knew about the others existence. It is tragic that Louis Kahn died alone in Grand Central Station when he was returning from a trip without making peace with the women and children he never acknowledged as his own by his side. He probably cared a great deal about all his children, but he remains an aloof figure throughout the film. We never get to know the man, although at the end, Nathaniel, in his quest to discover his father's life, finds most of the missing pieces of the puzzle.This is a personal account on the life of an artist. Thanks to that son, who has the courage to tell the story, we are almost prying into the lives of Louis Kahn and his extended family.","Nominated for best documentary feature at 2004's Academy Awards, My Architect follows filmmaker Nathaniel Kahn in his quest to find out about his father, the legendary architect Louis I Kahn. Lou Kahn died in 1974, when Nate was 11 years old, leaving behind an incredible but limited body of work, unpaid debts and three separate families all living within a few kilometres of each other. My Architect follows Kahn's life through chronologically examining his buildings, and interspersing their beauty with the story of a charismatic, but selfish and emotionally immature genius. As the son which Lou never publicly acknowledged during his lifetime, Nate has delicately placed himself in the story without overpowering the main focus. When examining the magnificent Salk Institute in California, Nate evokes his father's mythic use of space and light in his buildings, making it a peaceful and fascinating experience for viewers. The shot of Nate rollerblading in Salk's smoky white central meeting place emphasises the building's harmony with nature. It's breathtaking. My Architect also covers the difficulty Louis Kahn had with getting his designs accepted. Several fantastical buildings exist only on paper, dismissed by more practical architects and property developers. It wasn't until Louis Kahn went to the East that his visions were enthusiastically embraced. In India, where he built the Indian Institute of Management, a former co-worker describes him as a guru. In Bhangladesh, where he built the magnificent National Assembly Building, citizens consider him a father of democracy. Watching My Architect is a wonderful way to begin or continue learning about architecture and the importance of space. But it's the irony of Lou Kahn's egotism combined with the transcendence of his work that will inspire you. 4 stars.","Films are a unique way of imagining, somewhere between the unreal and what we call real. It really is quite a unique thing, more than a mere medium. I have always thought of film as the outer spheres of private literature grown into public architecture.So it pains me when we have a bad film about architecture, or rather a film which features architecture but which has no real architecture in it. I've lamented before about films which supposedly feature math or music or religion or great philosophical ideas, and end up focusing on people, usually tortured people. The mathematics or whatever is acknowledged but not revealed and the tortured souls involved might as well be sportsmen.That's a loss. But this is a greater loss, because with some skill film CAN convey architecture, in fact the special eye of the moving camera can reveal things about space that are unavailable to a single human in that space. The next frontier in architecture IS cinematic architecture, expanded form.Kahn was indeed the man who invented postmodern architecture. Perhaps no person working in space understood space as well as he. This is quite apart from the ability to shape and manipulate space, something he did with only ordinary skill. So in his case it is not even enough to introduce us to buildings, but we have to go into the buildings in dimensions other than the space they enclose.There are dozens of people alive who could have spoken to the matter, to have enlightened us. What we get is search by an undernourished child, some pictures of clouds as they pass over Kahn buildings, some spewing of irrelevant platitudes by lesser architects and finally a teary testament of inspiration from a thankful Bangli.There's no architecture here.Kahn's notions had nothing to do with \"recreating ruins\" and everything with revealing order, order in utility, in forms (usually classical forms), and order in light. How wonderful would it have been for the son to discover this and convey it to us. Who gives a bleep about how he relates to his half-sisters?Whether you know it of not, Kahn changed the way you imagine. But there's a fascinating story that was missed here. Unmarried mother number one was Anne Tyng who was more than a mere draftswoman. for several decades she was the center of distributed collaboration in revealing the post-modern form of the new brick. As a young architect, I communicated with her on this and feel sure that she was a key influence in his late education. I have since spent quality time with the fellow who actually did much of the design work while Kahn was jetting around speaking and am convinced that the insights were both more collaborative and profound than reflected here.This is as far from actual architecture, actual notions of where we fit, than Mel Gibson's iconography has to do with Jesus.Ted's Evaluation -- 2 of 3: Has some interesting elements.","The problem with this film is also its most interesting asset -- the filmmaker. The film sheds little light on Louis Kahn's character or his architectural abilities, and it says basically nothing about architecture whatsoever, so if you are looking for a film about architecture, move along.Beyond a great number of shots of Lou's sometimes beautiful, sometimes unpleasant buildings, this film is not about architecture.What it is about, and what it excels in portraying, is a man's search for a father he lost in his youth and with whose ghost he has not yet made peace. Nathaniel Kahn has not made himself a very likable character, and for that I suppose one must respect him. He wavers between cloying innocence and childish sullenness and smugness. I think especially of his near falling-out with his mother. He comes across as downright cruel in not allowing his mother her idealizations and delusions about Lou's intentions toward her. Watching this film, the viewer does see the damage losing a parent does to a young child. Nathaniel is stunted and boyish, and sweet in an altogether unlikeable way. The Nathaniel we are given in this movie haunted by his father and his inability to understand him or to resolve his feelings toward him. Little Kahn does have a number of interesting interviews with the people who knew his father; it's an interesting study of how greatly people are affected by a single person, how disparate their recollections of the person are, and also, how similar they sometimes are too. Apart from a few biographical facts, this film could have been about anyone who was greatly loved and deeply complicated (i.e., about a quarter of the people most of us know). Did it need to be about Lou Kahn to succeed? No.","Some documentaries have an interesting topic and create an altogether mesmerizing movie out of it. Others have a very interesting topic but somewhat fizzle out in the middle of it. Still others don't have an interesting topic and fizzle out throughout the whole movie. The last is the case of My Architect: A Son's Journey, a documentary that could have been a moving, loving tribute to Philadelphian architect Louis Kahn. Instead, it's a distant, shallow, and almost mean-spirited look at Kahn's life and buildings, coldly narrated by his son Nathaniel.Kahn himself is an interesting character-he had not just one but three families. Although after listening to his son talk to us for two hours, it's not hard to understand why he would want to spend as much away from that son as possible. Nathaniel's droll feature narration is not only monotonous and dull, but it seems scripted-almost like someone is telling him how to feel about his father. If he truly did care about his father, then I think he would at least have the dignity of trying to at least act like he cared about his father. It's hard to listen to a man talk about how much he loved his father for two hours when it's obviously not true? Why would Nathaniel even narrate it himself? Instead of giving this BS commentary on his life, why not get someone to read a more impersonal commentary whose voice doesn't start to grate on you soon after the movie begins?On the other hand, Kahn designed and built some very interesting looking buildings. Many of them were not practical, but they were nice to look at. If only I would have been able to see more of them; the fullscreen presentation really brought down the impact of viewing the buildings. Something that bugged me is that there was nothing about how Kahn got his ideas for his buildings, the ideas behind them. Did he suddenly have ideas pop up into his head, or did he have long, drawn out processes? We never find out. If the members of the Kahn family never found out, I would be OK with that, as long as they didn't keep us wondering about it.But not only was Nathaniel's narration hard to take, but the film itself isn't very interesting. In fact, some parts are just plain boring. It seems padded to the two hour runtime, yet much of the material was unnecessary, such as the reunion between the three Kahn kids. Sure, it's nice they got to know each other, but necessary? I think not. My Architect was nominated for an Oscar for best documentary. It lost out to The Fog of War. It's easy to see why it lost, too.My rating: 5/10Not Rated.","This is a profound and moving work about the creation of art, that which is uniquely human and cannot be produced by nature, the cost of genius and the search for transcendence and what in the end constitutes family, i.e, all of us. I was very much moved by the family discussion that Nathaniel had with his sisters about the shortcomings of their father as it was set in a beautiful home that seemed to radiate warmth that Lou had created. And although Esther seems so cold in her discussion about Lou's inability to make money you can appreciate how she at many points in his life must have been a counter-weight to his impulses. Nathaniel did a great job of showing how all of the people in Lou's life fit in and completed it and became as much a part of his work as his own genius. Yes even, or maybe especially, our failures make us who we are. And of course there are the buildings. I had only known Lou Kahn by name and did not really connect his name to his work, they are evidence of grace. Perhaps someday there will be a building where we will all fit, and it will certainly resemble a Lou Kahn building, perhaps the unbuilt temple in Jerusalem. Perhaps there is salvation","Nominated for the Best Documentary Feature Academy Award, this HBO documentary follows Nathaniel Kahn as he tries to discover more about the father he never knew, the great architect Louis Kahn. Dying alone of a heart attack in a train station 25 years before, Louis Kahn was left unclaimed for days due to him mysteriously blacking out information on his passport. He was married, but not to Nathaniel's mother - she was one of numerous mistresses he had during his later years. The film takes Nathaniel on a journey where he interviews friends, family, and colleagues, as well as visiting some of his father's spectacular works.The father-son story of discovery has been done numerous times in cinema, to various degrees of success, but I've never experienced a film so personal. It is peppered with scenes of raw emotion, including a moving scene where Nathaniel reveals himself to be Louis' son to a man that knew :ouis well. Yet amongst all the emotion, the stand-out scenes are the sections where he visits his fathers works. The Salk Institute is simply an outstanding piece of art, and the film captures it beautifully in all its glory. Even though it is arguable that such a journey needs such a detailed account, I found the film slightly overlong, and I found my interest sliding at times. But this is a film that successfully explores the complexities of the man, whether you feel he was a philanderer, a tyrant, or a troubled genius, through the eyes of a son who wants to see good in and love his father. I have no doubt that Louis Kahn, were he still alive, would have been deeply moved.www.the-wrath-of-blog.blogspot.com","To start with, I am not a fan of Mies or his acolytes (notice I didn't say \"less talented\" acolytes because in my opinion, none of them are talented).So it was not any happy revelation to find out that one of those acolytes, architect Louis Kahn, is responsible for starting the 1960's and '70's fad of using pockmarked reinforced concrete walls (often windowless) as an interior and exterior finish material. (His Salk Institute would not look out of place as a location for a movie about the apocalypse.)Anyone trying to talk to me about his prodigious \"talent\" justifying his having two children by two different women while he was married to yet another woman and then denying paternity may as well be talking to a wall. There is no excuse for what he did, no matter what his profession or his fame. None. He didn't care about his wife, his mistresses or his children while he was alive, and he certainly didn't care what happened to them after he died.The words in the title of my summary belong to his out-of-wedlock son Nathaniel, who directed this documentary. The last segment of \"My Architect\" is subtitled \"The Truth about the Bastard\". And that is exactly what Louis Kahn was.There's enough blame to go around. I don't feel sorry for the women who knew he was married and had unprotected sex with him anyway, or for the wife who must have suspected what was going on and didn't put her foot down because she enjoyed the status of being Mrs. Louis Kahn.Nathaniel Kahn's mother comes off as the world's biggest dimwit. Somehow, she has managed to delude herself into thinking that when her baby's daddy dropped dead in Penn Station in 1974, he was leaving his wife and on his way to be with her and Nathaniel for good. Yeah, right.The true victims in all of this were his children, who had their father's love and attention doled out to them with an eyedropper, and will never be able to confront him about his reprehensible behavior. Not that they would get a straight answer; people like Louis Kahn have a way of justifying everything they do, no matter how vile. The scene where they meet and share their separate memories of their father and of the tension between their mothers at his funeral should be an education for those who think that children are \"resilient\".As Nathaniel interviews those who knew his father professionally, the crocodile tears flow fast and furious. \"I knew about you. But your father was always very private.\" Please. With colleagues like this, who needs friends?The funniest lines belong to patrician Edmund Bacon, who presided over the 1960's bulldozing of a good portion of Philadelphia's downtown in the name of \"urban renewal\". No gushy posthumous testimonials for him. He fired Kahn in a dispute over the direction that renewal should take, and his fiery convictions about the inappropriateness of Daddy Kahn's ideas are still evident forty years later as the son interviews him. I won't spoil it; see the movie.","After seeing the documentary, \"My architect,\" we learn a great deal about a flawed man, by way of inference. Louis Kahn was the designer of the Yale University Art Gallery (which i have visited)and he is discovered, through his buildings by his ilegitmate son (also the director!!)The main conceit of the film (courtesy of \"Citizen Kane\") is that his \"journey\" will be more compelling than knowing the man. Although the film deals with serendipity by using interviews of those who knew his father as well as his various \"families,\" the film is ultimately just a tease. However, when his former colleague,edmund bacon is interviewed the film becomes extremely funny.","Anyone interested in modern architecture should see this film. It's rare to get behind the facade of an architect's work and learn more about the person.This documentary does it in a beautiful way, mixing a reverence for his work with a sincere exploration of the man himself--by his own son.The film combines the usual biographical information, with an unusually personal insight and helps give you a new view, and appreciation for architect Louis Kahn's work.Kahn clearly had a profound effect on modern architecture. It's fascinating to hear his peers, giants of architecture, talk about him in spiritual, as well as physical terms.The entire film is deeply emotional, culminating in the last scene, set at Kahn's last and largest work, the massive Parliament complex in Bangladesh. People don't talk about this architect as a \"form-maker,\" but as someone who understood the spirit of a place and made it concrete. It's really beautiful.","In this documentary, Nathaniel Kahn, son of architect Louis Khan, sets out on a journey to find out about his father. I knew nothing about Louis Khan, the father, and I found the documentary a thorough and revealing investigation of one very imaginative and unconventional human being. His son revisited his father's past from his birth in 1901-02 in Estonia, where as a child he suffered severe scarring when he burnt his face with hot coals, to his last day in Penn Station, New York City, where his body was found. As a young immigrant, he found his home town of Philadelphia a place where he could excel. Architects such as Philip Johnson and I.M. Pei agreed that he was brilliant, thinking and creating on a grand scale. Another from Fort Worth was visibly angry, comparing his work to a selfish flight of fancy. Through interviews with his partners and their families, we see the lengths he went to in order to keep secret three separate families with two born out of wedlock. One woman was bitter that he never lived up to his promise to marry her. An observer of his work felt that he had such an immense love for all people that he could not show love to the ones closest to him. Nathaniel also talked to taxi drivers and even the man who witnessed him die, who found a parallel in his relationship with his own father. Louis had three children with three women (married to one) and succeeded during his career in keeping his personal life a secret, except to a few people, because in his time, such a scandal would have shaken his career. His architectural works are now viewed as powerful achievements, although they met with decidedly mixed reviews at the time. Colleagues held him in the highest regard, while admitting they knew little about him. In the end, he died in Penn Station, New York, with no proper ID and lay in a morgue unidentified for three days. He was bankrupt after spending time in India and Bangladesh, where he was greatly revered. It was agreed that Louis was a workaholic with a limited output of the highest quality. At the end, we feel that his son Nathaniel would have gained tremendous insight into a life that had seemed mysterious and misunderstood, yet interesting, lived to the fullest and highly original.","Lois Kahn had scars from being burned as a child, so his deliberate school tardiness helped him avoid ridicule yet the way he appeared when he walked was inconsistent with a man feeling inferior. The inconsistencies in Kahn's life were abundant. \"Louis Kahn My Architect\" is a documentary found with some hunting on youtube, because the many excerpts vids with the same title make the full documentary an unlikely first click. It begins with the surviving illegitimate son reading the late architect's obituary on fiche, which is a symbolic scene. In addition to opening with the man credited for making the film as a product of old-fashioned thorough research it also shows a man under credited for being the late architect's son who, today, is largely under credited for his architectural achievements. Dear kind readers: Declaring, \"boring\" and clicking beyond is the most common reaction to this movie -- it's not a blockbuster. If you want to give yourself hope of finding the KO-emotional punch, then look for the documentarian's image reflected in the glass as he scans fiche on the projector. Sincerely, Tom Doody. It's a magical film-making moment at the start of a film Hana and I have seen to the end three times. Hana and I have plans to visit Salk Institute on California's Pacific Coast. Why? Because it's more practical than a visit to the Capital of Bangladesh. Kahn's life was filled with inconsistency, and one of those inconsistencies produced Nathaniel Kahn who survived the late architect, lived to make this film, and Nathaniel lives today. With this film he has unearthed some deep-seated emotion, and exposes it. The surviving son generates scenes of emotional awkwardness, which are tortuous. It's ironic how the awkward scenes are self inflicted, and not the work of manipulative pop media trying to expose dark moments of celebrities. The brilliance of the film is how the documentarian's emotion becomes central to the film without distracting his viewers from the subject. Alternatively his emotion illuminates his father's achievements. Like all great men, Louis Kahn was a great man -- sort of.","I love documentaries. The Andy Goldsworthy doc was great.I looked forward to this one - but was very disappointed. I knew of Kahn and was intrigued by the idea of his lonely death in a Penn Station men's room. There must be a story here, I mistakenly believed.The only story here is of sadly deluded women who had affairs with an ugly little famous married man. In the absence of anything like an explanation for this guy's horrible behavior, we're given endlessly repeated clips of Kahn walking around and painfully long - supposedly contemplative - shots of his soulless buildings.Actually, some of the buildings are interesting but the thrust of the film asks us to think about the guy himself. The overwrought soundtrack references an emotional tug that is entirely absent from the film. Kahn's apparent gifts do not excuse his behavior or martyr his mistresses. This film seems to want to give Kahn the great artiste's free pass and thus make the director and his mother sympathetic figures - I don't buy it.","I can't say I warmed to Louis Kahn or his architecture. Each edifice seems peculiarly ponderous, brutally imposing themselves on the landscape. Buildings so wrapped up in their own sparse, Cartesian ideal that they offer no comfort or concession to the humanity expected to inhabit them. Could they in fact be a microcosm of the man himself? So bound up was he in his accomplishments that he avoided confronting the disaster of his own personal life. With three estranged families of fatherless children, he left a swathe of heartache in those that fell into his gravitational pull. Is this the cost exacted for great works, the tragedy being that the price was paid by those that loved the man?","Khan may be a genius but he was also a despicable human being. I agree that Nathaniel's mother was a dim wit and that the children were the victims here. The scene with the three children was poignant with the unspoken suffering of their childhoods. Younger viewers today  cannot understand the disgrace in those days for \"illegitimate\" children growing up. Ann, Alix's, mother was the most dignified and self-respecting of the bunch. Of course he couldn't divorce Esther; she supported him most of his life and probably had the money in the family. He never even supported those children financially since their mothers worked and he died bankrupt. As for his work, I thought the Salk complex was one of the coldest, most barren sites I have ever seen. Frankly, Kahn deserved to die as he lived;  aloof and alone.","On March 17, 1974, a man is found dead in the toilets at Manhattan's Penn Station. Although well-known, he cannot be identified because he scratched out the personal information in his passport and his body lays unclaimed at the city's morgue for three days. It turned out to be the body of what many consider one of the greatest American architects of the twentieth century, Louis I. Kahn. He died at the age of 73, on his way from India, where one of his greatest projects, the Institute for Management in Ahmedabad, was nearing completion.One of the most influential post-war American architects, Louis Kahn's architectural legacy includes the house of parliament in Dhaka, Bangladesh, the Kimbell Art Museum in Forth Worth, the Yale Art Gallery, the Salk Institute in California and a kind of mobile \"music boat\", designed to give concerts in harbours in various cities around the world.While celebrated as an architect, very little was known about his private life. In addition to his wife Esther, and their daughter, Sue Ann, Kahn was survived by two mistresses, Harriet Pattison and Anne Tyng, and their two children. All three families lived within miles of each other in suburban Philadelphia, but their paths never crossed until the funeral. His son, Nathaniel, the director of this film, was only 11 years old at the time, and had only a few memories of his father's weekly visits at Harriet Patterson, Nathaniel's mother, in Philadelphia. Twenty-five years later, he sets out on a journey to confront his father by visiting Kahn's buildings, talking to relatives and colleagues and visiting the places that played a role in Louis Kahn's life.One of the most moving confrontations is when Nathaniel asks his mother, a landscape architect and mistress of Louis Kahn, why she kept up with playing second fiddle to his wife and never confronted him with this. Tears shed her eyes, but she has no regrets. \"It was worth it.\" It's such an intensely sad moment. She's obviously shattered, treated as an outcast at his funeral, which she was forbidden to attend, it's almost as if she led a substitute life. It all feels strangely unreal. Another interview with Edward Bacon, Kahn's architectural nemesis, who was in charge of the rebuilding of his native Philadelpia in the fifties and sixties, almost suffers a stroke on the spot, when he is reminded of Kahn's unsavoury ideas about architecture. His son, Nathaniel, listens uncomfortably when a very senior Bacon literally screams with anger whenever Kahn's name comes up. The final scene is reserved for Kahn's grandest creation, the Capitol in Dhaka, Bangladesh. It took 23 years to complete, a vast and extraordinary building, of which the Bangladeshi are extremely proud. It's one of the very few national symbols with stature in this impoverished nation. Some of the interviews with the locals brought tears in my eyes, especially when they find out they are talking to - God forbid - the architect's own son!The film is as much a personal journey as it is an account of Kahn's grand architectural legacy and is above all about the fruition of the film itself and film-making in general. Perhaps Louis I. Kahn faltered as a father, but these shortcomings in his personal life make for an all the more interesting portrait in this extraordinary film.Camera Obscura --- 9/10","Sure as eggs are eggs I felt this film was a fake from the first 90 seconds. I believe that the buildings were built by a man called Louis Kahn but I don't believe the filmmaker is his son and I think all the central people in the movie are fake. OK Pei and Gehry must be in on the con but that's not impossible. This director, don't forget, has gone on to make an accepted fake film (re The Village).A few quick reasons in no particular order: 1) Whether your movie costs $50K or $500K there's no reason in this day and age for the picture quality to be so poor (this is way worse that digital video, at least as shown in London, UK) I suspect this is to blur the line between the \"archive\" footage and the new footage. 2) You can't walk up to a bunch of Philadelphia cab drivers and they (not just one guy but they) remember your dad from 25 years back. Nonsense. Making documentaries just isn't like that. 3) Some of the interviews are shot continuously but from more than one angle. How many cameras could this guy afford? And if he could afford two why is the picture quality so terrible?? 4) The \"archive\" footage makes no sense at all. Is it home movie footage in which case how in the late 60's is it sync sound? If it's Museum type footage as the end credits claim then it's too badly shot and the \"newsreel\" bit with voice-over has some footage as he goes into the shadows across the edit which would never have been acceptable on-screen at the time. 5) I felt that it the film wasn't fake then it's not interesting enough to make yet alone finance or distribute. 6) OK this may just be deliberate style but why is none of the handy archive footage of his Pop put into context. We meet none of the directors or camera operators who filmed the man and we never learn anything about the films or programmes that these extracts are taken from. Curious. Anyone else agree??","plodding, given to very hokey \"classical video\" interludes, this movie desperately needed editing. It was bad enough that the guy undertook every element of production himself but the post ought totally have been turned over to someone capable of greater finesse in which he case the result wouldn't have been great but it might have been passable. As it is, I couldn't continue after one hour. The one thing he K Jr. can be credited with is at least not attempting a Micheal Moore/Morgan spurlock/etc. star turn loaded with shtick/indulging in set up sequences made to go wrong for comic effect and that sort of thing (which only MM is able to pull off and it's a shame he taught that technique to a whole generation of ham documentarians)"],"review-user":["Chris Knipp","lawprof","m-sherkow","belikemichaeldotcom","wisewebwoman","TooShortforThatGesture","ruby_fff","jotix100","colettesplace","tedg","yourfriend","movieguy1021","jsullivan-28","tomgillespie2002","smithster","maldoror-1","danielwill","barryrd","nearlincoln","kjs99","rupertbreheny","aajay","Camera-Obscura","philip-18","marymorrissey"],"review-date":["1 February 2004","25 January 2004","24 May 2004","6 April 2004","25 June 2005","16 February 2005","15 February 2004","13 March 2004","2 January 2005","2 June 2005","24 June 2004","30 April 2004","25 August 2006","19 May 2012","18 March 2004","19 March 2004","11 December 2017","2 March 2016","4 August 2015","22 February 2005","26 August 2004","12 April 2004","17 March 2007","5 September 2004","25 December 2010"],"review-rating":["9","9","8","3","9","10","8","5","10","6","5","10","9","10","2","7","2"],"review-title":[" A wayward genius brilliantly revealed\n"," Mesmerizing Portrait of an Artist By a Son\n"," A Soulful Film\n"," Son of an Architect\n"," A son's search for a father he barely knew\n"," Don't try this at home!!! Use a trained architect to design a building ... and a trained director to make a film.\n"," What a tribute to Louis Isadore Kahn - Nathaniel Kahn's \"My Architect: A Son's Journey\" is a worthwhile two-hour journey to experience\n"," The illusive father\n"," A very personal documentary which succeeds in evoking the splendour of Louis Kahn's buildings\n"," Spaceless\n"," Not really about Louis Kahn\n"," My Architect: 5/10\n"," art\n"," Louis Kahn would have no doubt been moved\n"," The Truth about the B***ard\n"," cities are abnormal\n"," A beautiful documentary about the man behind the buildings\n"," A son seeks to understand his father's life\n"," gr8 film\n"," What a self indulgent bore\n"," At times as heavy and unremitting as the buildings of his father, Nathaniel Kahn's documentary is at once weighty, compelling and profound.\n"," Genius and/or \"Ba****d\"?\n"," An inspirational journey through the live and work of Louis I. Kahn\n"," A fake!\n"," a bad film that under no circumstances should have run more than 75 minutes\n"]}