{"review-url":["http://www.imdb.com/title/tt0317740/reviews"],"review-text":["A few years ago I saw this remake of the sixties classic with the Mini Coopers for the first time and I remember liking it a lot. Now, about two years later it was shown on television and I just wanted to know whether I would still like it as much as when I saw it in the cinema. Well, the answer is yes.The movie is about a team of robbers that will do one final job in Venice, Italy. The plan is flawless and the execution perfect. They escape and won't have to work for the rest of their lives. But there is one problem they didn't take into account: Someone within their own ranks doesn't like to split the loot, but wants to keep it all for himself, even when that means he will have to kill the rest of the crew. But all but one survive and they are out for revenge. One year later, in Los Angeles this time, the surviving team members create a smart and devious plan to steal back the gold and get their revenge on the traitor...The story on itself is of course not very original, since this is a remake of the original 1969 movie, but it has plenty of goodies to offer to make you forget about that. This is a typical heist / action movie but it certainly is one of the better ones in its kind. The action is very nice, the landscapes and Venice are real eye-candy, the story is OK and the special effects are stunning. Even the acting is very good, something which you'll not often see in an action movie. I must admit that I really liked what I saw and I give this movie a well deserved 7.5/10.","The Italian Job is a real blast to watch. It's a genuinely entertaining film, something you watch just for the sheer enjoyment of it. It's not heavy with drama or emotional hand-wringing, it has no cosmic statements about life, and it's not violent or profane. It's just a fun movie. Between watching the little Mini Coopers fly around the crowded streets of L.A. and the great bits by stereotypical computer geek-turned-crook (played gleefully by Seth Greene), I had a lot of fun watching this film.Special kudos to the background music. They truly set a masterful tone for such a movie, so subtle yet keeps you on the edge when needed. Apparently a lot of artists contributed to the music, I found it to be the classiest part of the film.8 out of 10. Not awe-inspiring but a great film to watch at the end of a lousy day at the office.Barky","If you are looking for a film that is quick witted and won't bore you then this is the place.  It is fast paced and funny with some decent acting comeing from the characters.  It is always hard for me to see Mark Walhberg as anything except Marky Mark.  That image is burned in my mind forever.  As an actor though he is pretty good.  This movie is a must see for action fans who like to see a few little twists and turns.  I will have to pick this movie up one day and buy it.","My reaction to this remake of \"The Italian Job\" is probably hopelessly mixed up with the events occurring in my life when I saw it; This is the first movie I saw after I had just landed a job after 8 months of unemployment and going back to school for retraining. Money was still tight, but I no longer had to choose between seeing a movie in the theaters and paying bills (or eating lunch), and the sense of relief and gratitude I was feeling at the time was enormous. In consequence, my enjoyment of \"Italian Job\" was probably far out of proportion to its actual worth. Still, I picked it up used on DVD a few weeks ago and watched it again, and I still enjoyed it immensely. I have never seen the original (though I have heard it is an absolute classic), but its modern day counterpart is eminently watchable if you have a taste for modern day production values applied to older films plots and themes. What initially won me over to this movie was the soundtrack - IMO Don Davis writes some of the most supple, textured and aurally pleasing soundtracks around. IJ opens with a sly, witty, pulsing arrangement that combines strings, guitar harmonics, brush work and quiet moments - it won me over completely from the opening seconds. And the whole movie is like this - I haven't heard this kind of ringing, chiming, pulsing soundtrack music since Stewart Copeland left the Police and started doing soundtracks for movies like \"Rumble Fish\". There are at least a dozen irresistibly scored motifs in here, along with some pop song remakes that range from \"all right\" to \"inspired\". For people to whom the soundtrack is important, this movie is a delight. On to the movie: I can take or leave Mark Wahlberg, but he's okay here as the leading man, and the movie doesn't ask him to do anything he can't do well. He's the weakest \"major\" actor in the film, but that's because the rest of supporting cast is so strong, especially Donald Sutherland in a bit part. Mos Def, Jason Steadham, Ed Norton, Seth Green and Charlize Theron all turn in solid, fat-free performances. Norton seems to mostly be phoning it in (rumor has it that he didn't really want to be in the film), but he's still a natural even at 1/2 power. My one quibble with the casting and acting is with the character \"Wrench\", who seems to be a male model pretending to be an actor. His part seems to be shoehorned into the movie, and he has little chemistry with the rest of the cast (although you can blame some of that on the size of the part and the \"late walk on\" nature of the character). If I were a cynical sort,I would wonder who the actor slept with to get put into this movie in such a supernumerary role? Nah, never happen...Production values, camera work, stunts, plot...everything cooks along quite nicely and Gray and his production crew pull things together pretty seamlessly (with the exception of the \"Wrench\" character, see above). The dialog has a nice, light touch that rewards your indulgence, and there are several satisfying major and minor plot payoffs along the way. (My favorite moment - when Norton's character tells Wahlberg's character that he's just lost the element of surprise. Wahlberg proceeds to cold cock Norton with a right cross, and then asks him, \"Were you surprised??\" Hmmm, maybe you had to be there...) Of course the movie requires a certain level of \"suspension of disbelief\" to work, but if you just relax and go along with it (and don't think too hard about the mechanics of cracking a safe underwater, or the likelihood of anyone being able to successfully hack and manipulate LA traffic via a laptop, etc), you'll have a fun ride. \"The Italian Job\": it's lightweight summer fluff, but it's very good for what it is, and it doesn't try to be anything else. It isn't good enough for an \"8\" but I'd give it a \"7.5\".","I went to see THE ITALIAN JOB with mixed reviews in my head.  I was pleasantly surprised with an entertaining close to 2 hours.  I thought the cast was just great and so were the special effects, with the safe and truck just dropping out of sight.  If you like fast paced action movies, this is the one to see.","I enjoyed the movie very much. Everything in The Italian Job is simple. An explosive guy, a safe-cracker, a computer genius, a wheel-man and a man with a spectacular plan of stealing 35 million without using a gun. This film is entertaining although it has no central idea. It is a non-stop movie with lots of actions. All the stunt work is gorgeous. From the speedboat chase in Venice at the beginning to the chase on the busy roads in Los Angeles involving three mini coopers and even a helicopter. The best boast chase I have ever seen. I like the mini coopers. The expert thieves used mini coopers for the getaway cars. The chase between the mini coopers and the motor-bikes is amazing. They chased underground. I can say there was not a moment I was bored. Mark Wahlberg (Charlie Croker), Charlize Theron (Stella Bridger), Donald Sutherland (John Bridger), Jason Statham (Handsome Rob), Seth Green (Lyle), Mos Def (Left Ear) and Edwin Norton (Steve) really did a good job. I like the actors in this film. I have seen a lot of heist movie but The Italian Job& is one of my favourites. A great Hollywood action movie without a drop of blood. After all, I do love this kind of movie.","John Bridger's gang of thieves are double crossed and left for dead after a daring gold raid in Venice. The surviving members regroup and convene in L.A. to enact revenge and recapture their gold.......the job is on!This could have been a complete disaster, I'm British and the wave of revulsion that boomed in my homeland upon hearing of this remake was explosive; \"how dare they remake a British institution\" was the cry. Things were not helped in the run up to the film's release by it's main star {and drawing card} Edward Norton, proclaiming that the film was a contractual obligation and that fans of his work would be better advised to give The Italian Job a miss!Had to be a stinker then surely? Actually no it isn't. Director F. Gary Gray hasn't remade the Italian Job of 1969, in fact he hasn't even re-imaged it, the minis are in there, the gold is in there, but all the stand out moments so beloved by many in the 69 film of the same name are not to be seen at all. So what we get is a very cool heist-come revenge movie-that's maybe a tad too glossy at times, but it's got a pretty sharp script, tight action sequences and a group of actors working very well as a team. Mark Wahlberg, Mos Def, Jason Statham, Seth Green and the delectably delicious Charlize Theron all come out smelling of roses, whilst Edward Norton really had no cause for concern because his portrayal as Steve is a smarmy delight.I have jokingly titled this film Ocean's 5, but that is in no way detrimental to The Italian Job, it lacks the jazzy coolness of Soderbergh's Ocean's 11, but its a fun and enjoyable picture all in its own right, its rating of just under 7 here on IMDb is actually spot on. 7/10","I wonder how many MINI Cooper automobiles were sold thanks to this movie? It couldn't help but add to the sales of this little car, which is featured in this film, along with an attractive cast.This is a very, very entertaining heist-and-chase film. It features a \"cool\" cast with Mark Wahlberg, Charlize Theron, Edward Norton, Seth Green and Jason Statham.The best chase scene is right at the beginning with a boat pursuit in Venice, Italy. The film doesn't overdo the violence, has a pretty intelligent script (with a few short exceptions). features interesting characters and is nicely firmed. The cat-and-mouse game between Norton and Theron's characters is suspenseful and fun to watch.Once again, however, we are manipulated into rooting for criminals portrayed as \"the good guys.\" How many times has this happened since the days of \"Butch Cassidy and the Sundance Kid\" in the 1960s? It's twisted Hollywood, for you. In here, one of the criminals (Norton) stole and killed the leader and father figure (Donald Sutherland) of the gang, so he's the worst of the bunch and the film's villain. Also Theron's character is in the typically overblown-feminist mode of Hollywood in which women can do all things (including driving a car) better than a man. A third minor irritation is Seth Green's smug, smart-ass attitude which we also are supposed to go along with because it's hip and cool. Despite these hindrances, it is an extremely entertaining movie and it also doesn't overboard on the profanity or sex....and, yes, those little cars are cool. Everyone I've talked to who has seen this film, enjoyed it.","\"The Italian Job\" is a caper movie done by the numbers. Riding on the back of every caper cliche, it rises to no particular heights and will be a movie footnote by about the end of the month.The biggest problem is that \"The Italian Job\" possesses no imagination at all. I've seen it all before and done better then. The acting is fine  the cinematography is completely acceptable, but this film breaks absolutely no new ground.Let's tick off the cliches: - \"old-school\" criminal father figure and his protege - another gang member jealous of protege - a double-cross - only bad guys use guns while good-guy criminals don't have to - good criminals always outwit the bad guysAnd that's about the first fifteen minutes. Everything is so predictable. Even the heist and car chase scenes, supposedly the highlight of the movie, seem pretty ordinary. This is especially true since they appeared in the trailers for the film so I already knew what to look for.For me, a caper film works only if it has an element of realism - that maybe, just maybe, it could be pulled off without relying on a deux ex machina or \"just because\" moments. Parts of \"The Italian Job\" just throws that out the window, with computers doing things that computers can't do, the good guys not hitting anyone with their driving (especially going down the stairs) and not one single police car responding to street explosions, recklessly driven minis or even a low flying helicopter. Must be a heck of a city for these things not to rate a response.The acting is passable, with the crew (Seth Green, Jason Stratham and Mos Def) being at least fun to watch. Mark Wahlberg is just too smarmy as the \"nice guy\" hero while Charlize Theron is about the only actor called on to display some kind of range. Donald Sutherland is a class act as always and shows up Wahlberg's deficiencies every moment they are together.Overall this is a pretty uninteresting film. Given the IMDb ratings, it's the girls that really love this film, which I can understand to some extent, but there are such better caper films out there - even the vapidness of the recent \"Ocean's Eleven\" outshines the non-event that is \"The Italian Job\".\n***SPOILER***At the conclusion, take a moment to think about what is going to happen to Norton's character. Are we meant to be cheering the good guys for causing his demise, especially since it would appear to be long and painful? He didn't deserve that, simpering creep that he was.***END SPOILER***","This is a woeful Hollywood remake of a classic British film. Everything that made the original \"Italian Job\" entertaining has been bled out of this festering sore of a movie \"scripted\" by Donna and Wayne Powers and listlessly \"directed\" by F Gary Gray. I am amazed that Troy Kennedy Martin (the screenwriter of the original film) allowed his name to be used in the credits for this pig's ear. Martin has worked on some of the finest film and TV projects of the last 40-odd years. Even being vaguely associated with this stinker is NOT A GOOD THING.The humour is forced, the drama is laboured, all the characters are cookie-cutter likable crims (with the exception of Charlize Theron's implausible, beautiful safe cracker/rally driver)and the plot only matches the original on the following points:(1) Three Minis (the modern BMW-made versions, but Minis nonetheless)(2) Use of the names Croker and Bridger for 2 of the main characters(3) Disrupting a city's traffic control system to provide a safe route through it.(4) Er, that's it.Otherwise, what you get is a bland and implausible American by-the-numbers heist movie in which a gang of jolly pirate chums eventually get the better of their evil associate. Believe me, it feels like an awful long time before they do. The cast do their best with what they're given but it seems that they all accepted it as a turd-polishing exercise after reading the script. None of the original film's quirky nature and distinctly British flavour has survived being fed into the Hollywood hamburger machine. Do yourself a favour and watch the original 1969 movie instead of this sucking chest wound. It's a wonder that Noel Coward hasn't done an Aunt Nelly, jumped out of his grave and kicked the teeth of everyone involved in this tepid remake halfway down their throats.Italian Job? More like Italian Jobbie.","I must admit, I was against this movie from the outset but I tried my hardest to be impartial, I really did, but the very idea of remaking a sophisticated, witty, entertaining, quirky British classic full of character has to be dubious from the outset.People in my house were watching this so I swallowed my pride and told myself to be professional about films (I have studied them at Uni after all).As expected for an American film of this sort, the movie began with a chase which wasn't bad. Indeed, many of the action sequences are credible and this alone lifts the mark.Yet the characterisation was abysmal, the set-pieces could very easily have been spliced from any American schlock blockbuster you might have had the misfortune to watch and it lacked all character.Seeming to take a skewed angle on the original film with a failed initial robbery, the US version does the predictable thing and introduces an emotional factor with the death of Donald Sutherland's character. This allows our US cousins plenty of opportunity for sycophantic, dewy-eyed vengeance-seeking against the 'evil-doers' which it milks to predictable excesses. This is never more so evident as in the scenes featuring Charlize Theron (oh pretty! oh so pretty! Look at her pretty, wounded Bambi eyes, everyone!) which were thoroughly nauseating. Her entrance scene, particularly, was like something out of Resident Evil or Tomb Raider which were both a) more entertaining and b) had better beginnings because they couldn't mess up a game like they could with British cinema which was already chock-full of spark, people you genuinely feel something for and moments of inspiration. But I digress, the whole inclusion of a pretty girl for the sake of it just seems like the most ham-fisted manoeuvre I've seen in some time and exposes cynical Hollywood blockbuster-lust for what it is.If you like any of these actors, by the way, and you agree with any of the above comments, DO NOT GO TO SEE THIS FILM! If I had the opportunity of watching 'Fight Club' or 'American History X' after seeing Ed Norton in this, I would have declined. Likewise Jason Statham with 'Lock Stock' (and I suppose 'The Transporter' is okay if you like that sort of thing).Sadly, all the set-pieces are designed in the most transparent possible way to get you thinking, 'Wow! He's smart!', 'Coo! He's cool!', 'Hey! What a tough guy!'. Then there's the 'funny PC guy' who has 'comic relief' splattered across his forehead but whose humour content can be anticipated two minutes in advance. To be honest, if you've seen one or two films like it, you might easily confuse the two as clones from the Jerry Bruckheimer stable. Not that Jerry is irredeemably awful, by the way, but he just uses the clichés to excess as everyone knows (or should).This is where I have to come clean. I didn't manage to make it to the end, so I couldn't even say whether the brilliant ending in the Michael Caine version made it but, I'm sorry, it's just one of those extremely rare films that, if I'd seen it at a cinema, I would have walked out and staged a small protest outside. It's not just that it is another identical by-the-numbers Ocean's 14 or something (Ocean's Eleven was fine but don't bother with the rest!) with all the glitz, glamour, fake sass and pantomime heroics of such a film but I couldn't recognise anything from the original at all.So, if you are expecting 'THE Italian JOB' and not 'OCEAN'S 14' albeit badly written with a less established cast and characters, some disingenuous elements and cardboard cut-out script-writing then DO NOT WATCH! I don't mind people liking a bit of mindless fun but this is a criminal hatchet-job that does not deserve in any way to parade itself under the title of a classic. Seriously, show some pride! I felt thoroughly justified in my outraged and sickened reaction when I first heard that the film would be made. Avoid at all costs!P.S. Some of the action sequences aren't bad at all so add an extra '1' to the mark if you like this sort of thing.","A ridiculous, badly acted Mini Cooper infomercial. Includes cameos from Pepsi, Dell, etc. Absolutely nothing worth rescuing here. Particularly bad are Donald Sutherland, the music score, scene transitions, etc. An embarrassing production.Hey, THEY should pay YOU for watching this one.","Over the last few months, I have seen a lot of reviews for The Italian Job, many of them negative. The gist of almost all of these pessimistic criticisms is that, for all its modernistic bravado and high-budget technology, the film doesn't have much substance where it counts. Look, people, it's just a fun movie. This is the type of picture where you're supposed to sit back, relax, and just enjoy the steady-moving pace of the film. Like Ocean's Eleven (2001), you can concentrate on the characters and the plot at the same time without having to do much thinking (lucky for some of us). Granted, \"Ocean\" is a better movie, but who cares? The plot may have some holes (there's a huge one about 3/4 of the way through), the action may not be as gratifyingly gratuitous as the trailers made it out to be, and some of the dialog may seem pointless and cheesy, but again, who really cares? Cool characters, Mini Coopers, big explosions, Charlize Theron. What more do you want? I think it's time to drop the fake Roger Ebert meets Gene Shalit act and enjoy yourself for once! Oh, and another thing, whatever you do, don't compare it to the original because, to reiterate what F. Gary Gray has told the press a million times, THIS IS NOT A REMAKE!! My advice- if you're interested in nit-picking your way through a good-humored, fun flick, don't even bother seeing The Italian Job. But, if you don't have a severe inferiority complex and/or want to see Ed Norton get jacked by a bunch of Ukranians, go ahead. The Bottom Line, my fellow moviegoers, is: Lighten Up and Have Fun, Dammit.","Well, how to start? I saw The Italian Job for the first time some years ago and visiting a rental shop I couldn't quite remember why I had a bad feeling about it. Now I do.After voting for the ratings for this film I saw the statistics. Apparently this film appeals most to under 18 girls. No wonder. They didn't pay enough to Charlize to flash and I guess some girls magazine has rated Mark Wahlbergs abs \"AWESOME\".Other than that this film is completely predictable, the actors are mainly forever B-stars and even the good ones are being misused horribly, the film is filled with obvious product placement and imagine this: it even manages to repeat itself without doing a sequel! The first 15 minutes are the best part of the film and it's all downhill from there and once they figured this out they decided to use the finest hour again in the end repeating-to-detail their gold heist. All in all, lots of noise about nothing.I think Charlize Theron is good and Ed Norton could be more as he's been before. Apart from Donald Sutherland's \"look, I'm here too\" appearing in the beginning I'd say this movie ought to have a \"pass if you're above 18\" all over it.","Overall a good movieThe bank job it's the typical action film, with some minor improvements. Team work is not something which i didn't see before, this isn't the first film which insists on the robbery business, and won't be the last one. The cast tough famous wasn't so good, actually it was medium to overstate. Still what makes it a good action title?this time is in the details, this is the most important plus. Not the acting, not the end, not the far fetched story, but the details.It was lively I admit, which made it pleasant to watch, but it's not all about the rhythm. There are other things which should be take in considerings, like: characters. The character typology was standard: the beautiful, dangerous woman, the impulsive leader, the computer genius, not to mention the handsome skilled driver. It wasn't something new, and surely wasn't fortunate.The simple alignment of a title, to action genre doesn't or shouldn't undervalue important aspects such as originality and authenticity, which are clearly neglected here.Not bad but still lacking originality and authenticity. I rate it *** out of *****","I was really disappointed by this movie. Great actors in it, and potentially a great plot, but it just seemed to limp along.Charlize Theron was masterful in her role and beautiful, but it seemed like 90% of her on-screen work was in car chases done with Austin Minis. Product placement gone wrong, so very wrong.The direction seemed off, too. Edward Norton is the bad guy, and it was so obvious right from the start. Every time the camera would pass over him, it would linger too long and Norton would grimace or something. C'mon, Hollywood, give us a little credit! It's okay to surprise us with a plot twist without having to telegraph it.Sorry, but this movie was just below average. I have always been one to appreciate the work and talent that goes into a movie, but this one just didn't have it.","Having not yet seen the original The Italian Job that Michael Caine I have no frame of reference to compare it to. Still this version is fast moving and fun and you got to tip your hat to a bunch of professional thieves who know their business and steal without it being bloody. Donald Sutherland has assembled a crack team of thieves all with special skills that include Mark Wahlberg, Edward Norton, Mos Def, Jason Stathem and Seth Green. The six pull off a well timed heist of 35 million dollars in gold bullion bars. But then Norton gets real greedy and in turn steals the bullion from the rest, killing Sutherland and nearly all the others. Of course they're out for revenge, but revenge is a dish best served cold. Still they're all a little emotional on this one given the circumstances.New on the team is Charlize Theron who is Sutherland's daughter and she brings safe-cracking skills into the mix. They will be needed before the film is over.Edward Norton in his career has done a nice variety of sociopathic types from The Score, Primal Fear, and American History X. He's some piece of work in The Italian Job, but Norton is an actor who creates a peculiar fascination with the evil he does.The key man as the team attempts to heist the bullion again from Norton is Seth Green the computer hacker. What he does I can't say, but it's the equivalent of directing a mouse in a maze.This version of The Italian Job can safely stand on its own merits as entertaining and thrilling. Even without me seeing the first one as of yet.","Sometimes remakes are a good thing, sometimes they're not. This one is very loosely based on the film of the same name in the 1960's starring Michael Caine and Noel Coward with Benny Hill as the comedy relief. That film was a so-so farce, but this one is a runaway hit. The action starts at the beginning and keeps the pace throughout the film. Mos Def and Seth Green are our comics in this film, but their abilities to shift from comic to dramatic are well played. Mark Wahlberg and Charlize Theron are well suited to their roles and come off with a very reserved but appropriate sexual tension to add interest to the already interesting hi-tech portions of the film. Sutherland's role, while brief, is the perfect set up for the remainder of the film. Statham does what he does best, and his character is a mix between The Transporter and The Mechanic, with a splash of smooth to balance it out. As always, whether good guy or bad guy, Ed Norton's presence is perfect to create the correct tension in the movie. Good plot, great scenery, and exceptional photography make this a film the entire family can enjoy together, despite the PG-13 rating. Collectible if you like action adventure, although you will probably pull it out as an afterthought.","The original 1969 film offered something different. Set mostly in Turin-Italy the film is about a group of clumsy English villains who set out to grab a stash of gold bullion during transit. They find themselves up against it with both the Mafia and the Italian authorities. Much of the film is very typically British from the cast and their accents to the Austin Mini cars (red, white and blue with GB stickers on the back!).This is one of the few films I can think of that doesn't have a happy ending but it does have the feel good factor and an excellent cliff hanger to boot. When viewed today it obviously lacks some of the refinements we have come to expect from the typical Hollywood blockbuster, some of the acting and camera shots are laughable. However 35 years on it still hold it's own and has many merits including...Good music Lovely cars 60's Fashion Stunning backdrops Good stunts Original and plausible plot Memorable cliff hangerA very British film with plenty of character 8/10The new film is very different to the original movie. In fact most of the good features that the original had going for it were lost. In it's place is a blatant marketing exercise for the new BMW mini mixed in with some good but uninspiring action sequences. The new film starts in Italy but then moves to the U.S. which for me misses the point slightly. I found that the plot involving the traffic light control method used in the new film to be rather geeky and unbelievable at best (another feature that worked better in the old film).Despite it's faults the film contains some nice action sequences and is watchable (although one viewing is more than enough).If I hadn't already seen it all before, by itself this might be a great film. However I have and this isn't. 5/10","A remake of the 1969 British film of the same name, 'The Italian Job' comes up a winner. The 1969 cult-hit, in 2003 was revised with it's technology and style. I haven't had the pleasure of watching the original which personified the 'heist' theme, but I surely can say, I know what 'The Italian Job' is all about.The film is about a team of thieves who plan to steal gold bullion from a former associate who double crossed them. The film scores big time, mainly because it entertains you from start to end. Stylish and Accomplished, filmmaker F.Gary Gray pays homage to his favorite film and has done his job exceedingly well. He's a fan of the film he's making, and that's quite visible throughout. The action sequences are amazing. The climax, is spell-binding.In the acting department, Mark Wahlberg is fantastic. The actor lives his character from start to end. Charlize Theron looks a billion bucks, and delivers a truly fine performance. Seth Green is terrific and provides comic moments. Jason Statham is perfect. Mos Def is good. Edward Norton is a bore this time. Donald Sutherland is okay in a cameo.Watch this heist remake... it entertains and has it's moments to leave you talking and thinking about it. Thumbs Up!","I was really looking forward to this movie.  I like slick heist movies (Ocean's 11, Good Thief, etc) and i think this is a great cast.  But be warned -- there's a reason that Ed Norton didn't want to do this movie and it is very obvious about 2 minutes in.First off, the dialog is terrible.  very few \"funny\" interactions are actually interesting (Seth Green imitating Jason Statham is a notable exception).  The director (who has done nothing noteworthy since Friday) clearly didn't care if there was any chemistry on screen or if the words coming out of the actor's mouths actually fit their characters.  He just wanted all the words in there.  At one point, a Ukrainian does a whole routine about how the CIA rigged the 2000 election -- why even keep that in there?most of the characters have cute nicknames, which just makes the whole script seem even more forced.  in the first 20 minutes, you are hit over the head repeatedly about the relationship between Marky Mark and Donald Sutherland so that you know he'll be dead before the second act. obviously there is a romantic relationship that suddenly blossom's between Sutherland's daughter (Theron) and Marky Mark.  Like you couldn't see that coming before you even walked into the theater.Speaking of which, Theron clearly filled in for Angelina Jolie, playing exactly the same role that Jolie played in Gone in 60 seconds.  there are several points in the movie where she is vulnerable (maybe trying to show more range than Jolie?), and in each of those scenes, when Wahlberg comforts her or says \"you can do it\", i thought i was going to puke.worst offender of all is Norton who sleepwalks thru one of the least complex characters he has ever played.there are all sorts of continuity problems with the movie and several characters are introduced and then grossly underused (there's a 400 lb somoan looking dude who may have been an interesting character if we saw him for more than 2 minutes).every plot twist is predictable 30 minutes ahead of time, every \"funny part\" is given away in the trailers (except some of seth green's screen time), and everyone is dragged down by the poor script and direction.  STAY AWAY FROM THIS FILM!","Why bother making a re-make of an all-ready good film? Why bother ruining a great film?And why on earth call it the Italian Job seeing as the whole thing is set in LA, Its just Hollywood stop taking good classic film dumbing it down, making the plot completely stupid and completely Americanising the whole thing.I went thinking if nothing else they would have chucked a bunch of money at the car chases, I was wrong, even where Hollywood could do what it likes to do best, and add loads of special effects and car chases they didn't.It doesn't come anywhere close to the original.","A Adventure/Action/Crime/Thriller about a guy named Charlie Croker(Mark  Whalberg)who leads a bunch of Robbers on a heist to get a lot of gold  bullion 35 million to be exact.But the Robbers get robbed themselves so  Charlie is planning a new heist to take back the money that was taken  from him and his fellow Robbers but they don't just want the money they  want the revenge.  Mark Whalberg,Charlize Theron,Jason Statham,Seth Green,and Edward  Norton all give amazing performances especially Edward Norton he plays  such a good bad guy.The screenplay in this movie is very good the  directing is OK nothing special.The music in the movie is very upbeat  and exciting i enjoyed it a lot.There were some exciting car's in this  movie from the Austin Martin Vanquish to the mini coopers.The storyline  in this movie is refreshingly good every moment is exciting.  Best actor/actress-Charlize Theron   A exciting joy ride-Jake Hyden   I gave this movie a 8 out of 10   8/10","The characters was as unoriginal it hurts. The little skinny dorky computer geek, the funny African-American with stupid clisché punchlines, cool white guy with a compassion for cars and the handsome leader who ends up with the pretty girl. The actors is at best mediocre. Ecsept from Norton who does a pretty good job as the bad guy. The rest of the movie is also stupid and a total waste of time. Its all in all about a group of spoiled boys using the world as their playground where every safe in a big house is what keeps them with food on the table. I mean, why work for a living when you can rob people?AND,.. Who the f**** messes with the traffic lights in a major European city?!? And in the middle of the FRIGGIN day!? Think of all the damages and not to say deaths among innocent civilians. What about all the ambulances and firetrucks? I created NO compassion for the main characters, and weather Mr Wahlberg gets his bloody gold or not, i could not give less of a fart.","I am utterly amazed by the comments that have been left by other people who've seen this movie.  My college was presenting a free preview screening of The Italian Job, and I STILL left feeling ripped off.  The film is utterly absurd.  The dialogue is among the most atrocious that I've ever seen.  \"You can do it\" serves as inspiration.  A single moment together is supposed to make the \"subplot\" of a love story believable.  Even the car chases, which I'm told are what made the original stand out, are completely cookie-cutter and uninteresting.  I haven't fallen asleep in a movie since I was a little kid, but it took several pokes from a friend to stop it from happening this time.  Overall, the plot was ludicrous on all counts, there was absolutely no character development, and even the action scenes were mediocre at best.  Hearing the praise that some have chosen to give this movie boggles my mind.  It is perhaps one of the worst movies that will be released in 2003.  Save your money.  I didn't even pay any to see this tripe, but I still regret it.  I could've gone bowling tonight, blast it..."],"review-user":["philip_vanderveken","Barky44","iwatcheverything","lemon_magic","iohefy-2","ccc950","Spikeopath","ccthemovieman-1","evilasahobby","extravaluejotter","Ibsen3","chogno98","manideep-yelisetti","petri-leppala","serghei_romanu","Daryl-7","bkoganbing","fredericksmith1952","feederz2002","namashi_1","brownpr0","marc4991","futurestevenspielberg","mr_Ron_Burgundy","AdamDM"],"review-date":["26 April 2005","29 June 2005","23 November 2003","11 December 2005","26 June 2003","23 February 2005","14 June 2008","20 January 2007","15 August 2003","27 March 2007","20 January 2008","7 January 2004","28 May 2015","7 March 2007","18 January 2010","5 February 2005","13 August 2011","13 February 2012","29 March 2004","11 July 2010","25 May 2003","31 July 2006","7 July 2005","20 March 2006","6 May 2003"],"review-rating":["8","8","7","7","8","9","7","9","3","1","1","3","8","1","6","4","7","10","8","1","1","8","3","1"],"review-title":[" Maybe not the most original movie, but a very good one in the genre of the heist / action flicks\n"," Great, fun, caper flick\n"," Highly entertaining\n"," Slick, amusing caper film; Gray's best movie featuring Davis' best soundtrack\n"," FAST PACED EXCITING MOVIE\n"," non-stop action film\n"," Ocean's Five.\n"," Very Entertaining Heist Movie & A Big Plug For MINIs\n"," Caper by numbers\n"," No Sauce, just Plain Boiled Pasta\n"," A sickening travesty of a classic film\n"," Warning! Product placement spoilers\n"," Despite a few fall-backs it's a great film\n"," First 15 minutes are OK..\n"," Medium, ordinary but nonetheless fun to watch\n"," Barely Passable as a Movie\n"," \"We're All A Little Emotional In This One\"\n"," Sometimes remakes are a good thing, sometimes they're not.\n"," Nothing like as new and inspiring as the 1969 original\n"," Killer Time-Pass...\n"," One of the worst movies I've seen in a long time :(\n"," rubbish re-make\n"," The Italian Job\n"," Bad Job\n"," Worst movie I've seen in years\n"]}