{"review-url":["http://www.imdb.com/title/tt0370402/reviews"],"review-text":["Well, SWORD IN THE MOON finally got a DVD release in Korea, and despite the mostly negative responses I've heard to it, and the suspiciously tardy DVD release, I couldn't help but pick it up - any wu xia film is better than most non-wu xia films in my eyes :D Perhaps low expectations were an advantage, because I was quite pleasantly surprised to find the film pretty enjoyable.An assassin is killing a number of ministers who were involved in a revolution that usurped the throne, and the government's top swordsman is tasked with identifying the culprit. This doesn't take particularly long, but the answer is not one he wanted to hear. Through prolonged flashbacks we learn why, and the history of the swordsman and the assassin, and of the revolution.The film is typically melodramatic for a Korean film, and resolutely serious in tone - no HK style comedy moments to be found here. The story can be a little difficult to follow at first, but all makes sense eventually. The film goes a bit wobbly at the end, but no worse than a Chang Cheh film might do, and for the most part I found it enjoyable. The production values are high, with some good cinematography to capture it. The fight scenes aren't up to the calibre of the better HK wu xia films, but perhaps they're not meant to be - the fights are more \"realistic\", in that they're less like choreographed dance routines, but there's some wirework and occasional cgi that put the film in \"wu xia\" mode. The film doesn't have the best cast, unfortunately, with the leads being a tad lacking in charm and occasionally difficult to distinguish from each other. There's a young lady in the film that I don't think I've seen before, but makes the best impression of any of the principle cast - not just because you see her nekkid... or perhaps it is :p The film lacks the charm and grace of the better HK wu xia films, and perhaps the beauty too, but I only wish HK would make them half this good anymore - TWINS EFFECT 2 does not give me hope that *that's* about to happen any time soon, though Tsui Hark surely still has it in him if he can get the funding and cast. SWORD IN THE MOON is not going to go onto my list of favourite wu xia by any means, but it's a whole heap better than ROMANTIC WARRIORS or LEGEND OF THE EVIL LAKE - perhaps better than BICHUNMOO too, though I did like that film quite a bit more on a second viewing. Obviously it's nowhere near the wonderful MUSA, but it's a different affair altogether really. SITM will probably get a second viewing within three years, which is perhaps the best indicator of how much I liked it :) 7/10","I saw the movie on its North American premiere (July 14, 2004) at the Fantasia Festival. I was slightly disappointed as I had been expecting a more epic, ensemble cast movie along the lines of Musa the Warrior. Instead, the movie concentrated only a much smaller number of characters. Still, the movie was solid, thoughtful and visually intriguing. There were slightly jarring tone shifts from the dominant thoughtful and realistic tone of confused loyalties, intrigue and blood, versus the lighter, more flamboyant, martial arts sequences. It almost seemed as though the filmmakers couldn't make up their minds about whether the movie was supposed to be a martial arts \"flick\" or a historical epic. The story touches nicely on the issue about the need for loyalty versus the need to adapt to new situations. Is it really worth your life and those of your friends to be loyal to one's master or does there come a time when one must submit to the winds of change? Is there perhaps greater courage in leaving the old ways for new ones? How does one decide? These questions are raised in this movie, and ironically, there is the suggestion that the answer given, may in fact be the wrong one!","After seeing a preview for this film at my local mall where there is a stand for purchasing foreign films, I thought it looked very entertaining. Before watching the movie i went on to IMDb to see what ratings and comments it received. I was worried when I noticed the low numbers and the negative ratings. Despite the hype, I watched to movie and to my surprise I found it unbelievable. The story was great (just pay attention) and the characters and their relationships within the film is astonishing. I haven't seen such a good combination of leading characters in long time. I really felt for both characters and sensed a strong bond. As reading previous posts about this movie not being \"epic\" enough or a lack of martial arts I could not disagree more. This film is what it is, its not Braveheart and its not Enter the Dragon but it is still a wonderful film that does an excellent job combining story both and action.While Sword In The Moon isn't perfect (what movie is?) it still is wonderful and moving. Just wait until the ending scene, with the music and cinematography together, its breathtaking. I only hope more people can see this movie to give it a fair voting.","Recap: After the king was overthrown there is a short time of order. But then generals and ministers start turning up dead, often most brutally slaughtered. The new king's best swordsman investigates and soon find out that the assassin is his best friend, one who is still loyal to the old king.Comments: Although full of swordfights and combat this is a unexpectedly slow movie. Mostly this is due to that a lot of the movie is flashbacks of how the two swordmasters became friends. How they trained and ultimately how they ended up on different sides of a war.It's a well crafted film. Obviously a lot of energy has been put in to get costumes and sceneries right. Actually it is a beautiful movie. Like many of recent Asian pictures this is very strong in filming. Visually it is almost flawless. However, the story is a weakness. It gets far too slow with these flashbacks. They are not clearly distinguishable either, and when the main characters switch clothes and are similar in appearance it is sometimes hard to figure out who is doing what. It sorts itself out in time though, but it doesn't help to keep the interest up.Maybe something for real fans of movies of medieval Asian times but for everyone else I guess another movie will work just as well.6/10","The best swordsman in the kingdom is tasked with finding out who is killing the ministers and looking to kill the king. The answer to the question lies in the past, specifically with the events that put the king on the throne-and it raises questions our hero may not want to deal with.Okay action/mystery/drama that is epic and compelling for a while before it just seems to be wandering on with no direction. There is a direction and there is a resolution, but by the end I really didn't care. Its not that its bad, its just that it didn't grab me or rather hold me. Worth a look if you run across it but I wouldn't go out of my way to find it.between 5 and 6 out of 10","I must say: out of all modern korean martial arts movies this one is worth checking out. It wasn't as epic as Musa-The Warriors and didn't develop the characters as well, but it had many nice ideas. Simple story: a elite soldier thought dead, returns after years to end the reign of the Japanese in Korea in medieval days. His counterpart was formerly the best friend he had and now he is out to stop him. The fight scenes are all with sword or different weapons and very entertaining to watch. The motives of the figures are discovered first near to the end. You might need to watch it again to get all the connections right. And me personally...I loved the end. I could watch it over and over again. Maybe a little pathetic, but a real freedom fighter story.... People can be killed, but not the ideas they stand for....","When I was young, I'd get up early every Saturday morning not to watch cartoons but to turn on the local channel for what was called 'Kung Fu Theatre.' It wasn't as if these films were works of art. It wasn't as if these films all came from China, Japan, Korea, or any country in particular; if the story had to do with fighting  be it swordplay or fisticuffs  and if the fighting didn't resemble much of anything going on in any American gym class, then that was good enough. It wasn't as if they were really even very good. They were just great action flicks with incredibly over-dramatic music where the hero reaped his vengeance over a whole host of bad guys, and then the credits would roll.\"Sword in the Moon\" is much like these films of my youth, arguably a bit of a thematic throwback given a welcome twist by muddying the characters up enough that it becomes increasingly difficult to tell the bad guys from the good.Yun (Cho Jae Hyun) is known throughout the kingdom as 'the human butcher.' He kills quickly and mercilessly on behalf of the Chun Dynasty, the chief bodyguard of an Emperor who spared his life and the life of his men in exchange for his service. However, an equally merciless rebel and his lovely sidekick appear in the countryside and start murdering imperial ministers, and Yun agrees to find these rebels and kill them. His task becomes one of personal discovery when he learns that the two rebels are Choi (a friend from his past) and his former love, Shi Yeong.Sadly, \"Sword\" doesn't have much to distinguish itself from other action films. Some stunning cinematography is nearly entirely wasted on shoddy editing with portions of the film put together so loosely its hard to believe that what inevitably made it to the film was what anyone intended. While the atmosphere and story tend to gravitate toward a dark mood, the tone is almost sacrificed to the never-ending parade of flashbacks as each of the main characters is given a healthy story arc. What should've been a quick and easy action film gets weighed down by far too much personal baggage, and the film suffers as a result.I've read that this film marks Korea's first real foray into the world of art-house action pieces along the likes of \"Crouching Tiger, Hidden Dragon.\" Next time, I'd strongly suggest that the producers stick with a little more 'martial' and a little less 'art.'","Although I saw this movie in Korea, in Korean, and therefore did not understand the language, images sure say more than enough. From what I can make of it, this is the story: Two superb sword fighters become friends in their service as the king's guard. One of them finds himself opposed to the ways of the king and starts assassinating important men. The other has to hunt him down. This movie is visually great. The swordfighting is great. And the movie has a gripping end. I just hope this movie will be marketed for the western cinema goers. And be released on DVD, of course.","Nice movie. At the begining, i thought it's a medieve detective kind hi-fi movie, but the ending totally surprised me. I guess, the whole movie covers too many subjects, each of them can be the main subject,e.g. avenge, friendship, and dream. But it mixed all of them without focusing on any of them. I think, it'd be a great movie if it's built around the ending from the very begining.","The tale of two comrades who made different choices and now fight on opposite sides. An expensive and visually exciting movie ruined by a very thin plot and some flashbacks that are difficult to distinguish from present, actual events and the faces of many actors are so similar to a western audience that it might well happen to feel quite confused.Scenery and costumes are very interesting and there are some details in weapons, armors and robes that are very particular, such as the far east small hand weapons, the lamellar cuirasses and the hats of the dignitaries.Blood runs in rivers and beheaded enemies rank in dozens. It is disturbing in the long distance and it is absolutely unnecessary to show all this violence to tell a tale. A film about violence embellished by the choreography, sets and costumes. The plot is irrelevant at the end.","Amazing scenes. Great colors. As a fan of Asian movies I accept this one as a promise for more great ones. I can't say this is masterpiece because I am not into the Korean cinema - i saw only two or three movies , but hey don't forget Kim Ki Dook movies - so they are more than 3 :-) Anyway - Im not sure that I understand the final. But I got the idea - the friendship has not a time for existence. This is something that may have or may have not. I give 5 of 10, because of the idea, the costumes, the atmosphere. Although there is too much blood - I say bloodbath. The beginning was promising - I thought that it would be a medieval crime movie - because of the mysterious murders , but the point of the movie was not that kind. It is too deep to consider. May be I'm kind a disappointed because of the end: just like the \"Spirited Away\" - manga movie... But that does not mean the movie is not great.","than 'Hero'. But it's not a fun comedy. The story is about an army that opposes the despot ruler and when this is divided into two fractions they have to fight each other, or something like that.The production values are fancy camera effects and similar things like that- and less substance and thought of course. Not far from the 'Matrix' style. The Koreans are capable of a better historical movie than this, I just haven't seen it yet. For a fan of action packed martial arts movies this may be gold. For me it has little to keep my interest.","Korea, the late era of Joseon dynasty: Gyu-yeob (Jae-hyeon Jo) is a brutal but skilled warrior who starts tracing a mysterious assassin who has been murdering the King's ministers. Soon clues point to the assassin being Gyu-yeob's old military friend Ji-hwan (Min-su Choi) who he has fond but tragic memories of. What is the truth behind the revolutionary killer and his female assistant Shi-yeong (Bo-kyeong Kim)?As can be expected from a historical epic, the sets, costumes and massive group scenes look authentic and the colours of the cinematography, such as the green forests and blue night scenes are a joy to the eye. Still, it's harder to sink into the world of the film than in, say, Yimou Zhang's masterpiece Hero, largely because of the restless camera-work that would be better suited in an urban modern-day action thriller than a historical warrior epic. The camera spins around the characters, constantly tracks them, shakes as if in the hands of an epileptic and even goes to very blurry slow motion for long periods of time, making the already hectic fight scenes confusing to follow. The calmer, more static shots in the peaceful scenes look very nice though; I wish this approach would have been used more prominently.Technical direction issues aside, the film's writing isn't really among my favourites of the genre either. As Gyu-yeob is such a cold and aloof warrior, it is difficult to relate to him and his emotions about his long-forgotten friendship with Ji-hwan. Now the lengthy flashback scene detailing their time together interrupts the main plot for too long; perhaps a traditional chronological structure or showing smaller flashbacks more evenly would have worked better. The long-haired Ji-hwan is a stylish character though and easily carries the scenes where he is in. The female Shi-yeong receives less attention and her role doesn't come across a very significant one, despite her implied importance to Ji-hwan.In summary, I think Sword in the Moon is a visually good-looking, but not very effectively directed epic in which the nature of friendship is a major theme. A calmer style of presenting the action scenes would have benefited the whole significantly and suited the extravagant, even pompous, music better. I guess the characters could also have been fleshed out better, but in spite of my complaints, the film is not terrible and fans of historical sword epics should find it easily watchable – give it a chance if this type of cinema is your thing."],"review-user":["simon_booth","dgwyn","wjc722","Enchorde","dbborroughs","raoul-guariguata","ncc1205","emvanbeek","windmaomao","neozeon","mavruda1977","Atavisten","random_avenger"],"review-date":["1 January 2005","15 July 2004","12 September 2005","18 August 2009","24 August 2008","22 September 2006","4 February 2005","10 August 2003","27 December 2003","10 April 2005","17 December 2006","4 July 2005","17 August 2010"],"review-rating":["8","8","7","6","5","8","4","8","8","5","5","4","6"],"review-title":[" Decent attempt at wu xia from South Korea\n"," Solid if slightly confused martial arts intrigue\n"," Absolutely Wonderful\n"," Slow medieval action\n"," Ultimately it didn't grab me\n"," I loved this movie\n"," More 'Martial,' Less 'Art'\n"," Two close friends, medieval Korean swordsmen, face each other\n"," better than expected\n"," Too much violence and an uninteresting and flat plot\n"," I don't get the end or may be I just don't like it ...\n"," More 'Akakage'\n"," Sword in the Moon\n"]}