{"review-url":["http://www.imdb.com/title/tt0301976/reviews"],"review-text":["Leland Fitzgerald (Ryan Gosling) is sent to jail for the murder of an autistic kid. When pressured with the question 'Why?' he doesn't have an answer. While in jail he meets Pearl (Don Cheadle), his teacher, who decides to take matters into his own hands and helps Leland figure out why he did it. Throughout this film we learn all about Leland's troubled life, including his ex-girlfriend Becky(Jena Malone), his famous father Albert(Kevin Spacey)and his whole sad life. This film is Matthew Ryan Hoge's second movie, and it is spectacular in nearly everyway. This is one movie which will leave you thinking in the end, and wondering about how it all works. The movie is quite dark, but if you can handle that then you will realize just how good a film it is.In this movie, there is no bad guy. There is no one you can blame for anything that happens. There's no stereotyping, and the audience does not try to prove Leland guilty. Instead, we sit back, relax, and watch this boy's life unfold throughout the corse of the movie. All the problems depicted in the story are very real. Drug addiction, parental expectations, overwhelming sadness; they all exist in our world.Ryan Gosling gives one of the greatest performances of his career in this movie, as the depressed teenager Leland. His father lives in Europe and doesn't really care much about his son. The only person he loves is Becky, but she has problems of her own. He knows exactly what he did, but as he says in the film, 'You want a why, but maybe there isn't one. Maybe this is something that just happened.' There is a why, but we don't find out about it until the end. As you watch the movie, the audience finds themselves amazed that such a young person could know so much about the world. Leland notices things that people tend to ignore. A particular thought-provoking scene which really affected me was during one of Leland's conversations with Pearl. Pearl just cheated on his wife and when Leland asks why, Pearl replies that he's only human. Then Leland says something which never really occurs to anyone: \"Why do people only say that when they've done something wrong?\"Another fantastic acting job was provided by Chris Klein. In the film he plays Allen Harris, the boyfriend of Becky's sister Julie (Michelle Williams). Although he is not one of the main characters, I found myself amazed at how deep his character was. You can relate to Allen a lot. You know how much he cares for the Pollard family. It's as if they were his own flesh and blood. By the end of the movie, you realize just how far he would go to help them. Overall, this movie is a masterpiece which has been overlooked by quite a few people. If, however, you take the time to watch it, you will most likely see that everything I've mentioned above is true. And once you're finished watching it, you'll never look at the world the same way again.9.5/10","I was looking at the external reviews (Ebert, etc.) for this film and they were all pretty much negative. However, after reading many of them, I noticed that they all made the same point. Critics were upset that the film centers around what appears to be a senseless murder of an autistic child. Certainly, this is a disturbing image. Critics like Ebert want a traditional detective story that uncovers why the killing happened and squarely places blame on the guilty. They want blame to be cast and resolved. Well, that status-quo theme is kind of what the movie is parodying. Just like society, the critics wanted a very quick resolution so they could move on to their next tragic opera. Perhaps there is no simple question to be answered here? There is a whole lot more to what happened then what is on the surface. The film does not seek to rationalize what happens, but rather understand the why. What also steams me so much about these inane reviews is that all they look at in the way of performances is Spacey and Cheadle, who were both great (and generally are). But there are other great performances at work here other than just the two current icons of Hollywood. Gosling gives an incredible performance that really only somebody of his extreme talent could deliver. Somehow, Gosling is able to make the killer of an autistic child sympathetic. This irritates many, I am sure. However, if one watches the film, they see what Leeland's motivation is, it is wrong, but it is not evil. Malone is also on top of her game as yet another confused young character. Basically, the killing of the child in this film is not the main theme of the movie. The main theme is life itself and how people go about dealing with it, the highs and lows, and how they attempt to sometimes help others deal with their lives (which does not seem to work out very well). There is a lot of good and bad in this world and how we handle each has direct impact on how much more good and bad will take place, and sometimes a confused attempt at doing good, can lead to a whole bunch more of bad. I think this is one of the more memorable films in sometime and has an ending that is as touching as anything in recent movie history. I strongly believe people should view this film, with an open mind.","Don't let any reviews (critics, IMDb users or mine) influence you seeing this movie. I read only the plot premise and became intrigued. After watching, this movie, in my opinion, is definitely worth seeing. It gives a perspective on life that many have probably not contemplated. Its is not however, as Leland himself says, a movie that \"can be wrapped up in a neat package with a bow and everything.\" Other user reviews on this website claim to have a psychological background and imply that the story is not feasible. Quite obviously they missed the entire point of the movie, which is disappointing. to say the least.In short, it is a well acted, well directed movie. The story is not a feel good one, but I feel if you don't come away from the movie feeling good, you may just have missed something. To characterize it as \"art house\" is unfair, in my opinion, but as our society likes labels, this is probably the one that fits. If you find you know everything there is to know about the world... I'd suggest skipping this one. If you feel movies should be a form of escape \"from the world\"... you won't find it here. But if you do watch it... you just might find something in yourself.","Leland P. Fitzgerald (Ryan Gosling) has committed an unspeakable crime, the stabbing of the retarded younger brother of his ex-girlfriend Becky (Jena Malone). No one, least of all Leland himself, can explain why he's done what he's done, whether the act was premeditated or spontaneous, done out of hatred or love.In the detention center, Leland meets Pearl Madison (Don Cheadle), a onetime novel writer who sees in Leland's case a second opportunity. But Pearl also wants to understand Leland's motivation and takes him under his wing as a confidante in the prison.The film jumps from the past to the present several times, often allowing the past to act as a context to the present, and vice versa. Writer/director Matthew Ryan Hodge shows how Leland's crime - and the events leading up to it - affect the people in his life, from Becky to her family to Leland's mother (Lena Olin) and estranged father (Kevin Spacey) to Allen (Chris Klein), a young man who is staying with Becky's family after the death of his own mother.The chief asset in the movie is Gosling, who is perfectly cast as the 15-year-old pseudopsychopath. Like Bartleby the Scrivener, Gosling's Leland just exists; he shows little emotion during the film, but instead his expressions belie an ocean of guilt, sadness, love, and rage.Each of the main actors offered perhaps their best work to date, save Spacey (who's not exactly a novice). Special praise is due to Malone and Klein, two young performers who are better known for lighthearted comedy fare than the heavy drama of this movie.Another huge benefit in terms of the story is that none of the characters is flawless; none are heroes out to save the day. This is simply not a black-and-white movie.","I am no Ebert. What I am is a compassionate and I have never felt more compassion for a fictional character than I felt for Leland P. Fitzgerald. Sorry if I do not offer a critique, but I see nothing but perfection in this film. I am sure that many who watch this film will never see the same things I do, but if you look hard enough maybe you will see something you weren't expecting. I've read that the character of Leland was flawed. It seems to me that who wrote this was not able to see past the Question this movie presents. I feel sorry for anyone who doesn't see the answers this movie delivers. Open your heart more than your mind and you may be able to let this Leland P. Fitzgerald show you a world that truly has a meaning. Excepcional story with extraordinary acting. Ryan Gosling deserves to be talked about.","There are subtleties in this film that I think a lot of people may miss if they're not careful. You really need to follow what Leland says and read his character to figure out the intended \"why\" the movie presents at the end. Nothing it solid, it's not definite, it's about what the individual viewer takes out of it. I think that was the plan from the get-go, people aren't meant to all understand it in the same way, it's almost about forming your own personal relationship with Leland in order to maybe feel him a little better.The storyline is interesting but its summary could never explain what the movie really is. It's dramatic and thought provoking, a lot of heavy ideas, but the pace of the movie is almost soothing, even with its more intense scenes with yelling. I think it's probably Leland, he's just calm and almost serene, even for all of his sadness. The movie personifies Leland in a way.Of course it is captivating and draws you in if you let it, but there are some recycled ideas. I mean, Leland has a lot of impressive dialogue, he is anything but typical, but he's not a prophet. Everything he says is not a revelation, many people I know have mentioned things he mentioned, even I have observed a few things he's observed. Leland is the unique and attractive character he is probably mostly for Ryan Gosling's portrayal.In the end the acting is all exceptional, there are no real bad guys, there is no way to psychologically evaluate Leland, only to maybe understand him and life a little better.Comparable to Igby Goes Down I think, not comedic, but similar in its general outlook on life.","I saw this movie the day it was released back in April, and I absolutely loved it. I was blown away, as I always am, by Ryan Gosling's performance. Leland is such an intricate, amazing character that really makes the audience stop and think about their own life and their own actions. When a movie can take you out of your comfort zone and make you really stop and think about the world around you.. that's what I absolutely love. And Leland definitely did that for me. Gosling's performance is eerily touching, and the rest of the cast, including Kevin Spacey, Don Cheadle, and Jena Malone, put on great performances as well.So please see this movie if you get the chance. [the DVD comes out on September 7th.]","Before I saw this film, I read the comment of someone who wasn't very fond of it. This I must admit made me apprehensive to dedicate 1 hour and 48 minutes of my life to it, but I'm glad I did. Ryan Gosling is a fantastic actor, I especially loved the Believer. Don Cheadle was also fantastic. The film presented an interesting view on life and death. It was very touching and very sad, yet it kept me interested, which most touching stories cannot do. It is a film that reckless of whether or not you like it, you should see it. It was unique,and I don;t think that anyone will ever be able to duplicate it. All of the young actors did surprisingly well given the subject matter and the emotion that must have gone into it. I was pleasantly surprised.","Leland follows the story of Leland P. Fitzgerald (Ryan Gosling), a disaffected teenager who has apparently murdered a severely retarded peer, the brother of a girl he was dating. The issue is not whether he did it or not  Leland admits to it, straight away  but rather, why. Interestingly, rather than a crime drama, Leland becomes a character story, examining why people do what they do  not necessarily the easiest ground to till.And Leland features the required indie group of screwed-up people. Aside from the title character, there's also Pearl (Don Cheadle), who is his teacher at the juvenile correctional facility and who sees straight off that Leland is different. We meet Leland's distant and egotistical father (Kevin Spacey in an extended cameo), who never seems emotionally stirred in any way by what his son did. But the real flavorings come out when we immerse ourselves in the Pollards, the family of the retarded child. First, there's Leland's girlfriend Becky (Jena Malone), a drug addict who can't keep herself clean; her sister Julie (Michelle Williams), perhaps the most normal person in the film, who merely seeks to get away from it all; and Allen Harris (Chris Klein), a young man who lives with the Pollards and is Julie's boyfriend. Lastly, there's Ryan (Michael Welch), whom all the others call goofball, who cannot communicate and seems barely aware of his surroundings.Leland focuses primarily on its eponymous protagonist, but the movie slowly  occasionally too slowly  burrows into everyone's lives, asking the chief question, why do people do what they do? While Leland discusses it openly in a journal Pearl allows him to keep, examining notions of good and bad and personal responsibility, all the characters at some point in the film face a moment where they must make the fundamental choice of their own happiness or another's, perhaps the most basic choice any human can make. And the movie takes a good look at what goes into those choices, and the consequences of them.In the beginning of the film, you're simply struck by the depth of the cast. Spacey. Cheadle. Gosling. Michelle Williams. Even Chris Klein  these are people who for the most part tend to elevate any film they are in, and putting them all together makes for a heady brew. For a space in the middle the film seems to stall, sputtering along as it unfolds; it looks for a while as if it will be content merely to ask questions and not supply any answers. But when we arrive at the home stretch and the movie starts to hit its stride and come together, Leland becomes a quietly powerful piece of film-making. Leland's explanation of the world and his actions, in the end, bring every story into focus, and all the investment you've made in the film pays off.Saying Ryan Gosling is excellent is like saying a sunny day is nice. At this point in his career it's redundant  this is one of the finest young actors working today, and it is a pleasure to watch him craft what could have been an unlikable character into a thought-provoking protagonist. Gosling employs such subtlety here that it hardly seems like acting; he has to face off most of the film opposite Don Cheadle, whom we know has the goods, and he not only holds his own, he elevates Cheadle's game as well. Cheadle himself is in top notch form, imbuing Pearl with a fully-rounded humanity  for good and bad. Spacey is kind of one-note, but that's the character, and he handles it excellently. I was surprised by Chris Klein; with this level of acting, I thought he would be buried in the mix, but he gives probably the turn of his career so far. Terrific work all around.Leland is a bit of a downer, and again, it's draggy in spots. But it finishes strongly and leaves a lasting impact on the viewer (on this one, anyway). There's also a subtle commentary on racism in the film (in Leland's first day in juvenile hall class, he's the only white person in the room) that, like much of the movie, is very effectively handled. I wouldn't go so far as to call this required viewing  some might find it too slow or too odd  but I thought it was one of the better films I've seen in a while, far stronger and more satisfying than most fare out there. I'd recommend it  with the above caveats  if for no other reason than to watch Gosling further perfect his craft.","Every role, down to the smallest, has been cast and acted with bravado.The extraordinary Jena Malone never takes a misstep. Her two co-stars are equal to her in this film. Ryan Gosling may be the best actor of his generation. Chris Klein gives his best performance to date. This is a thought and conversation provoking film that should be seen by teens and young adults. You'll think and talk about this film for days. Highly recommended.","This is a movie that really makes you think about your life, our culture, family structures and situational actions. I will not give the plot in this post, I think others have beat me to it already. I hope that despite reading opinions on this site, you will take the chance and see this movie for yourself. I went to see this movie with my husband and a friend and I must say, after the movie was over there was total silence in the theater. After a few minutes I looked behind me and everyone in the theater was staring at the screen, lost in thought. This will make you delve deep into your psychological abyss to ponder several things:How much does society influence my life and the lives of my generation?How long does someone have to pay for mistakes that they have made?If there is a second chance given, is it ever realized?Is it better to live in a box or to not live at all? My questions are not intended to show my approval or disapproval of Leland's actions. I do not want my opinion of them to in any way dictate what you will take away from this film so I am not giving it. See it for yourself. I am still lost in thought, attempting to answer my many questions from the film. I enjoyed it greatly and hope that you will too. This film is not trying to answer questions, condone any action or promote any punishment. This movie is trying to make us all evaluate our lives and take off the rose colored glasses that most of us view the world through.Great movie. 9 out of 10 stars","This movie is like reading an 8th grader's goth poetry: self-important, self-indulgent, and hyper dramatic, death is so romantic, heroin use is so cool, and I'm so deep and important because I'm sad. Actually, it's worse than reading junior high goth poetry.I am a huge fan of Ryan Gosling and he was terrible here. It's a minor feat to make Gosling unwatchable, but they did it. This film is not deep or profound, but indulgent and false. I challenge anyone to find a more clichéd role in film than Kevin Spacey's writer character who abandons his son, then sits in a hotel bar with a bottle of scotch solo, or worse, sits in his car with a voice recorder and says, \"there was a time when we moved through life, with something like electricity...\" . Laughable.Here's the story for you: Leland, a weird, squeaky voiced misfit who appears to be missing a few points of articulation in his body (Gosling) begins to date a super cool hipster music junkie (Mallone) and then she dumps him. This sends Gosling out of orbit, and he stabs to death Mallone's retarded brother. Then Leland goes to juvie and has really deep conversations with Don Cheadle and another detainee. Cheadle is a failed writer who wants to write about Leland because he's so fascinating, and who can argue that a semi-retarded squeaky voiced kid shuffling his feet and looking like he has to take a dump is not fascinating? Cheadle confronts Leland's missing dad, Spacey, cheats on his girlfriend because he wants to do bad things and gains Insight. Leland writes a surefire best-seller diary and gives it to Cheadle, then gets knifed in the yard by Chris Klein. Klein is the live-in boyfriend of Mallone's sister. He gets dumped, and then overwhelmed when Leland knifes the kid, so decides to get locked up in juvie to have a go at Leland. Wow, all these parts, these machinations, it's like a Swiss watch! Um... no.When Klein finally knifes Leland, he says off-camera \"it's over.\" But it isn't. You still have to watch some closeups of Leland, because he's so profound, and tragic, and he's like a saint or an angel come to earth to tell us about our sad lives. That's what having your first girlfriend dump you will do. You'll all go out and stab retarded kids in the park, because, see, life is so heavy and we're all ignoring the sadness.Meanwhile, the characters all repeat dialogue about \"making mistakes\" and \"doing nothing wrong\" and somewhere buried in all this is the conceit that we all make mistakes. WOW, you didn't see that one coming, did you?This movie is not good. Don't waste your time.","i'm gonna rant now. there are some spoilers coming. i truly hate this movie. i hate it for so many reasons. i hate everyone in it. i hate the way it was shot. i hate the writing and the story and music. the united states of Leland bothers me in a way few movies do. one of the main reasons is i can't understand why Leland fascinating to everyone? his writing is not intelligent. Leland's thoughts are the same thoughts every high school goth kid has. \"oh. so much darkness and sadness around me, i can't take it\". so he stabs a retarded kid? and the Chris Klein character. what? are you really supposed to buy him throwing his life away to avenge his ex-girlfriends brother? and don Cheadle. he cheats on his girlfriend. furthermore, he IS trying to exploit Leland for his own good. he says in the movie that he is an aspiring writer. there is nothing to suggest that he is doing anything to help Leland. and why does he find Leland fascinating? \"maybe people only see the good so the bad and the bad so the bad and everything is dark and sad and bad so the good is bad\". WOW! that kid is smart! and then there's the part where he goes to new york, alone, when he was 12 and starts to live with another family. who would let their kid do that? i don't care how detached you are, thats ridiculous. the main problem i had with this film is that i just didn't care about anyone. i don't care if don Cheadle gets back together with his girlfriend. he doesn't deserve to. i don't care if Leland's girlfriend is a Junky. i don't care if Chris Klein and his girlfriend split up, or if he goes to jail. and most of all, i don't care what happens to Leland. and the ending was so predictable. it has been a while since i've seen a movie that has bothered me this much. for whoever sees something in this movie, a deeper message or whatever, good for you. but i can't stand anything about this movie. its unbelievable how much IMDb edits these comments","I noted that the official IMDb review refers to Leland as a sociopath. I believe that this diagnosis is manifestly and profoundly incorrect.This is a movie about sadness, and about the ability of one particular teenage boy to see sadness in daily life, as it lies in wait around every corner, in advance of the unfolding of the lives that it impacts. A sociopath is a person who cannot empathize with others, and who, while understanding the difference between right and wrong, does not care about this difference. A sociopath is a subject who places himself or herself at the center of that subject's universe, with total disregard for the impact that the subject's actions have for those around him or her. One of the defining characteristics of a sociopath is that a true sociopath lacks the ability to feel empathy -- lacks the ability to feel that which others feel, and does not correlate changes in the moods of others as the result of that sociopath's actions with those actions. A sociopath CANNOT feel the pain of others, or understand that the pain of others is the result of the sociopath's own actions. A sociopath is a person who is not completely formed. A vital chunk is missing from the psychological and emotional makeup of a true sociopath, rendering the sociopath immune to \"talking therapy\" and other treatment modalities that involve human interaction and the exploration of personal feelings. Sociopathy is devastating, even when the subject is treated and placed in a highly structured environment aimed at containing the damage that the sociopath can do to others. Many sociopaths function more or less normally and never raise a blip on the radar of the criminal justice system, although they tend to leave a trail of emotional debris in their wakes.Leland Fitzgerald is no sociopath. He is a person who is blessed (or cursed) with the ability to foresee what he considers to be the inevitable consequences and outcomes of human interactions. Leland literally sees sadness written into the eyes and faces of people around him, as he slowly assimilates and internalizes the philosophy that life is about loss, and that people slowly succumb to the inevitable and inexorable fact that, for want of a better metaphor, things fall apart. People who fall in love and who kiss and cuddle today turn into \"pathetic\" elderly couples. The electricity in the eyes of Leland's \"mother\" (a wealthy New York socialite who loves Leland and who invites him into the home that she shares with her family when he arrives in New York City, alone and determined to remain in the city at the age of 12) fades as she explains to him, on the last of his visits to New York City, that she learned that her husband had been cheating on her all the time, that she got a divorce, that having one's heart broken happens to everybody, and that such loss is an inevitable part of growing up. Her eyes still reflect light, but the electricity that once illuminated them is gone. This scene -- this explanation, late is it is in coming -- is crucial to understanding why Leland commits a seemingly savage, senseless crime (killing the retarded younger brother of his ex-girlfriend). Leland knows what lies ahead for this little boy -- a lifetime of unattainable goals, of being taught only words that signify danger, of never knowing the love of another human being, of never feeling such love, and of never connecting with another person. More than any other character in this movie, this little boy personifies everything that Leland sees as being inevitable and horrifying about the world. Leland's act -- killing this little boy -- is, for Leland, an act of mercy, committed because this was the one thing that he COULD do in a world in which actions cannot change outcomes. Whereas a true sociopath knows that actions can and do change outcomes but does not care about the harm inflicted on others by those actions, Leland does care. What most people view as a barbaric and horrifying act is, in Leland's eyes, the only decent thing that he can do to alleviate the suffering of just one person.It would be comforting to be able to present this as an explanation of Leland's actions -- comforting, but incomplete. For in the end, \"blame\" for Leland's actions lies elsewhere. As is so often the case, there are no easy explanations and no balm to apply to the outraged soul. Why did Leland not learn something that even the most pessimistic people usually acknowledge -- that sometimes -- just sometimes -- people DO remain in love, and that relationships DO succeed, and that even the saddest lives ARE transformed? For Leland, there is no middle ground, no inner core to which he can retreat and regroup. There is only pain and sadness. One is tempted to blame his arrogant and thoroughly unpleasant father -- the brilliant writer (played by Kevin Spacey) -- for not being there at critical times during Leland's development, but given this man's thuggish nastiness, that may have been a blessing.In the end, this viewer was moved by a tremendous sense of sadness. Why was Leland doomed to view the world through a veil of pessimism and depression? There is a maturity to Leland's character -- present, for example, when he repeatedly insists that nobody was to blame for his girlfriend breaking up with him -- that is both stoic and heartbreaking. Stoic, in that it is absolutely genuine, notwithstanding the heated denunciations of Leland's teacher. But heartbreaking, in that it is born not so much of understanding as of despair. Leland's indifference to his fate is merely a reflection of the utter certainty of his belief that nothing really matters. Nothing that he does can change his fate.This is not sociopathy on display. This is, if anything, its polar opposite......","For those of you who have never heard of the movie until now (of which, I presume there are many lucky people who haven't), I'll summarise it for you. Ryan Gosling plays the titular character of Leland, who also serves as the film's narrator (a la Kevin Spacey in American Beauty, but without the intelligent observations on life). Leland goes to jail for stabbing a retarded kid to death, and the movie attempts to figure out why he did it. He seems to be a nice boy (if not mentally absent), and is portrayed by Gosling with a complete lack of violence, anger, or agenda (and if you're waiting for him to reveal his sinister side later in the movie, don't waste your time-- it's not that kind of movie). Once in juvenile prison, Leland goes to classes taught by Pearl Madison, ably portrayed by Don Cheadle (who is incapable of anything but quality, even when in bad movies). Pearl attempts to unlock the mystery of Leland in an attempt to figure out how such a kid could do such a thing, and so he could write a book about it later (along with being a juvenile prison teacher, Pearl is also an aspiring author).The relationship between Leland and Pearl is the driving narrative behind the film, as their talks unveil Leland's past to the audience. However, to call it the central focus would imply that this meandering film had one. It does not. The United States of Leland boasts an impressive cast, which seems to be to the detriment of the film. It seems as though writer/director Matthew Ryan Hodge (don't worry that you haven't heard of him, he's never done anything) had to give EVERY character a personal story arc and personality flaw in order to get the actors to play them. Most of these traits and stories are clichéd, and most go underdeveloped and unresolved.I'll try and break them down here: Martin Donovan and Ann Magnuson are the parents of the slain retarded boy (I love how the movie kept calling the kid \"retarded\", never \"mentally disabled\". That part made me laugh inside), they apparently have a cold relationship, because all suburban marriages in contemporary cinema must be cold. Their other two kids are Michelle Williams, who is apparently an aspiring actress about to attend college, and Jena Malone, who plays the same troubled teen-archetype she always plays, this time with a heroine addiction. Malone was also the girlfriend of Leland, which gives him his link to his victim. Williams' boyfriend, who was orphaned and came to live with the family, and is a baseball player looking to go to the same college as his girlfriend, is played by Chris Klein. He ends up doing more with his character than any of the other bit players, managing to steal the movie at times. Lena Olin is Leland's mother, who seems to be perpetually sad for some reason. Kevin Spacey (also the executive producer) is Leland's cold and absentee father, who is a famed novelist. Eventually, Sherilyn Fenn will show up to put a wrinkle in Leland's story-- if you even care at that point. Oh yeah, and there's a drug-dealing ex-boyfriend, a couple of fellow juvees, and a co-worker of Pearl's with whom he has an affair on his long distance girlfriend with (played by Kerry Washington).Sorry if all that synopsis and character breakdown took so long. If it seemed meaningless and boring, then you've just experienced a bit of what I did during the 108 minutes I spent watching the movie. But the unruly supporting cast of over-wrought clichés is the least of this film's crimes. The biggest one is that the whole exercise is entirely pointless. We aren't given a fascinating look into a troubled mind, we aren't given an effective explanation, we aren't given much of anything. Given that it sucked so much, I'm gonna go ahead and spoil the ending for you so that you never have to see it: Leland stabbed the retard because all Leland could see in the world was sadness, and wanted to spare Corky (or whatever the victim's name was) the sadness in his eyes. It's like the worst emo band in the world made an album, and titled it \"The World Is Sad, So I Killed A Retard\". Oh, and Leland dies in the end, in a sequence so reliant of unbelievable coincidences that it would have ruined the movie, if the movie didn't already suck. Of course he dies in the end, because that made the movie so deep.I'm giving the movie 2 stars, because the actors themselves all did a pretty good job with the junk they were given. The scenes with Cheadle and Gosling together were even interesting on some levels. But, to paraphrase the film itself, you have to believe that movies are more than the sum of their parts, kiddo.","It's interesting to contrast Ryan Gosling's brilliant performance as the terrifyingly smart, aggressive, and articulate Jewish Nazi skinhead Danny Balint in Henry Bean's `The Believer' with his characterization of Leland P. Fitzgerald, the sweet, confused middle class child of detached, alienated American whiteness who's murdered an autistic kid in `The United States of Leland.' And this is probably the only reason to see this new movie. The roles are polar opposites, which must have attracted a young actor as talented and adventurous as Gosling. But the movie is a muddle and so, inevitably, is Gosling's Leland. The best actor in the world couldn't make sense out of Matthew Ryan Hoge's sappy, disorganized writing and unsure direction. This is a movie that never decides where it's going and never develops a pulse. It's ill conceived in a whole list of ways. Leland is in special custody for committing this terrible, inexplicable crime  which his fellow inmates consider so evil they call him `Devil Boy.' Yet he is portrayed as a young philosopher, a mild-mannered (if potentially lethal) Holden Caulfield. The disconnect is never explained. The movie purports to be exploring Leland's motives for the killing but it never finds any.\nThe tension is diffused by telling the story out of order with intercut scenes that build up our knowledge of subsidiary characters like Leland's mean, famous writer father (Kevin Spacey), his mother (Lena Olin), his girlfriend Becky (Jena Malone) ), his girlfriend's little brother and sister and parents, a young guy who lives with them (Chris Klein) and. . . and. . . Hoge doesn't know where to stop. These subplots weaken all the characterizations, not just the central one, and they rob the movie of any point. Hoge is so interested in the career and love problems of Leland's prison teacher and would-be biographer, Pearl (Don Cheadle), in Leland's nasty, remote dad, in the dilemma of Chris Klein's character, and in Leland's girlfriend's drug issues, that the mystery of Leland and his crime never gets plumbed, even if Hoge knew how to do that, which he doesn't seem to. Is Leland some kind of perverted saint, or just a mild-mannered psychopath? We never find out. All we know is he has come to look on the world as very sad, and that's the best explanation we get for the crime: he wanted to save the little boy from sorrow. At one point confused, vague flashbacks about trips when Leland was supposed to visit his father in Paris but wound up in New York reveal yet another subplot as he's semi-adopted by a well off Manhattan family.\nThis all seems either ludicrous or crazy.  If it strikes you as sensitive and deep, maybe you'd better check your own pulse. Autism advocates are up in arms at the suggestion that Leland's killing of an autistic boy might be merciful, but this is not a portrait of the autistic boy -- who's only glimpsed a few times, or of the crime (ditto). What's even more reprehensible than the slighting of the boy is the suggestion that murder might be seen merely as an expression of teenage angst. The thinking behind this movie doesn't bear looking into, and if you want to demonstrate against every badly written film you're going to be awfully busy. Another interesting contrast is to compare \"The United States of Leland\" with Jordan Melamed's `Manic,' where Don Cheadle plays a very similar role as a psychiatrist dealing with a disturbed youth named Lyle (Joseph Gordon-Levitt) who's killed a child in a fit of rage. `Manic' depicts in concrete terms where Lyle's rage comes from. We understand the rage is going to be a lifelong problem, but that with luck he may learn to tame it. There's no nonsense about the sorrow of the world and there aren't a lot of confusing subplots. `Manic,\" in fact, may be almost too simple, but it fairly bristles with powerful, authentic emotion. The story moves forward with intensity and the performances really sing. Gosling doesn't shake our faith in his skill as an actor, and Cheadle, Klein, Spacey, and the other principals all do respectable, occasionally fine work, but they can't compensate for how badly this movie is conceived, written, and edited.","One wonders about the state of a society that produce a father like Albert T. Fitzgerald, who we first meet on a plane, as he is heading toward the place he abandoned a long time ago, and where he left a wife and a child who is now accused of murdering a mentally challenged boy. When we first see him, he has caught a headline in the paper the woman in front of him is reading. Rather rudely, he asks her if he could have the newspaper, and the lady offers other sections. Well, that's not what he asked, what he wants the woman to do, is to give him the front section she is reading.Matthew Ryan Hoge wrote and directed this disturbing film that reflects, in many ways, our society as it is today. In fact, Mr. Hoge is pointing out exactly at what is wrong with it.The film presents Leland, a teen ager who can't even differentiate between fantasy and reality. It's evident that killing a human being, even the sweet and innocent boy who hasn't done anything to deserve it, will have fatal consequences, not only for himself, but for his own family, and the family of the slain boy. In fact, Leland seems to have no idea about what motivated him to commit the crime for he does not show any repentance about it.It's obvious Leland has been traumatized by his parents divorce. His own father is an aloof man who couldn't care less about him. It's Pearl, the teacher in the juvenile detention center who sees the turmoil inside the young man and wants to help, but unfortunately, he doesn't have a chance.The best thing in the film is Don Cheadle, a great actor who always delivers. The ensemble cast does good work under Mr. Hoge's direction. Kevin Spacey has a good opportunity playing the egotistical father of the accused murderer and makes us detest him for being an arrogant idiot.Although a bit long, the film leaves us with more questions than what it answered.","What a great piece of work. For those who thought this film was slow, I assume you must not be great fans of Shakespeare or watch C-Span. This movie doesn't spell anything out for us, and we have to spend time listening, observing, picking up nuances... all things a good movie or book make you do. Leland and the rest of the cast are all tied together in some way, everyone going through there own private hell, absolutely disconnected in their modernity. Everyone is trying to break out of that dreary numbness that a purposeless (upper middle-class)life can fill you with. Some try to leave, others have affairs, others actually escape to other countries, some choose drugs. Leland in my opinion *SPOILER ALERT* seems to have committed the murder in an attempt to actually do something about it. To help a helpless member of society escape. And in his numbness... feels nothing afterward. John Mayer talks about \"Numb is the new deep\"... something to think about. Excellent performance from Ryan Gosling, a sensitive, brooding character with the weight of the world on his shoulders. Something a lot of youngsters feel these days.","Despite tackling such weighty subjects as murder, drug addiction and depression 'United States of Leland' manages to have all the pain of a TV movie about a slight weight fluctuation. The problem does not lay with the excellent cast but with the fact that they don't have anything to do other than look miserable and spout some portentous dialogue now and then.The film is about the travails of the dysfunctional middle class and is aimed squarely at the self same middle-class, but this isn't a mirror to reflect their complacency, merely a gentle panacea so they can congratulate themselves if they haven't had to deal with this many problems in their lives and nod concernedly as the wonderful Anne Magnuson looks a bit miserable at her son's funeral.Maybe the director wanted everyone to seem as though they were just drifting through life unable to feel a thing, but I, for one, wanted one of the characters to let rip like Kevin Kline at the end of The Ice Storm when all the pain and rage pours out of him in a drunken moment of despair and pain. All the way through the film I was waiting for the bland exterior to be ripped away to reveal the raw beating heart of the movie but this, alas, is never to happen. Even prison isn't too bad in this film - just an inconvenience which means that the characters can't get to feel the sun of their faces as much as they'd like. The director never manages to convey that the characters are repressing their feelings nor that they are really suffering, they just stoically trudge around in their designer gear looking a bit put upon.The United States of Leland is directed with all the drama of a headache advert ; sure Jena Malone's hair goes a bit lank and stringy every time she has some heroin but that little fashion crisis is about as much insight into her suffering as we ever get. Ryan Gosling wanders around and makes a few vaguely poetic statements about strawberries and it isn't until the very end of the film that the viewer begins to understand what led to his actions and by then I , for one, was just about beyond caring.The United States Of Leland is a film that promises much but never delivers. It wears its class on its sleeve and the presence of such a good cast seems to be all the justification it needs to exist. This isn't a BAD film as much as it is a lazy film; a quasi-poetic study of depression and sadness without any real feeling","A bloody and seemingly pointless murder of an autistic boy, brings about a cantankerous amount of toilet-paper philosophy, when the culprit Leland P. Fitzgerald (Ryan Gosling), son of famed author Albert T. Fitzgerald (Kevin Spacey), discloses the reality of his actions to wannabee writer and correctional facility teacher Pearl Madison (Don Cheadle). In the background multiple people cajole and sulk about with their best impressions of Droopy the Dog. These include Becky Pollard (Jena Malone), Leland's ex-girl and former drug addict and Julie Pollard (Michele Williams), prepping for college and a change of scenery, both sisters to the murdered boy. Add on Julie over-protective boyfriend Allen Harris (Chris Klein), Leland's eternally sad mother Marybeth (Lena Olin) and a host of other drab characters to form the backbone of a cumbersome tale of woe, doom and gloom of juvenile sadness.The story labours from the on-set, setting up the overbearing negative mood to the proceedings, which never lighten, instead engulfing the dreariness with adequate music and countless lingering shots of people weeping, praying, fretting, getting high or just plainly pulling a down face. Within this framing comes Pearl Madison, an aspiring writer, who wishes to benefit from the story withheld in Leland's emotions and thoughts. In a venture to disclose the reason, the why, he must come to terms with his own frailties (as he is only a human being) in order to accept the pristine views of his object of interest. Characters throw about tidbits of wisdom frequently, somewhat successfully given the general positive feedback from viewers, but it all seems so flagrantly skin-deep, hitting at you with a lack of restraint and more like microwave philosophy for the modern age, where things must be served fast and straight up.Somewhere near the end the story manages to tie up nicely in a well packaged conclusion, nicely connecting all the loose threads with an effective finale. Shame however that the entire build-up is just so smug and trite.","This is by far one of the most well-written movies of the last decade. The dialogue is introspective and often times a biting portrayal of society as we know it today. Although at times the title character may seem distant and aloof, especially when talking about his own life and mistakes, in reality he is a microcosm of and an accurate representation of what we have all felt at one point in our own lives. This film is highly recommended for anyone who has ever felt the vice of sadness that can at times overwhelm, or conversely the inability to help those in the grips of their own inner turmoils. It is pretty much guaranteed that this movie will leave you thinking about your own life, your own loves, your own losses and your own mistakes for some time come.","United States of Leland is a movie about human nature. It shows the true characteristics of people and their never ending search in life. Everybody wants a why, a reason why something happened or why somebody did something. But like Leland said, maybe there is no why, maybe it really is something that just happened. I love this movie because it examines life the way I examine it myself. The question about God and the Devil, it was dead on with what some people really experience in life. Is there a God, is there a Devil? People do like the idea of the Devil because it gives them a reason for why they did something bad. The Devil made them do it, or they were tempted or something else. God exists to redeem them after their inevitable mistakes. Everybody makes mistakes, everybody does something wrong, but everybody at one point or another will use an excuse and not blame it on somebody else and not even blame it on the Devil, they blame it on being human. People do only say that after they do something bad. It's their excuse for messing up, for making a wrong choice. People do mess up but sometimes it's because they want to. Pearl is a perfect example of this in the movie. He can use the excuse that he is human all he wants, but the truth is he did what he did because he wanted to. Leland is the only character who makes no excuses and that is what I love about him. He is so different from anybody else in the movie. This movie questions life, love and people. It makes you think. It's the best movie I have ever seen because it has stayed with me. I can never forget some lines from the movie or the overall message I got from it.","The title comes from an alteration an adolescent inmate in a correctional facility makes on the front cover of his school book on government, titled \"The United States;\" he adds \"of (his name).\" Many characterizations in this movie work well -- the scenes between Leland (Ryan Gosling) and Becky (Jena Malone), Pearl (Don Cheadle) and father Fitzgerald (Spacey) as well as with Leland, Becky and sister Julie (Michelle Williams), among many others.But the central thread of this movie -- the fulcrum on which everything hangs -- is the character and motives of Leland.  He's a somewhat shy, passive, nice high school student who daringly introduces himself to Becky whom (we find) is going to an alternative school because of a past history of drug problems. In Becky's family, she has a sister, Julie, who's just graduating from high school and preparing to go on to college; Julie's boy friend, Julie's age (and whose parents' had recently died) is also living with them. Leland lives with his mother; his father (Kevin Spacey) and mother have long been divorced and his father is a famous novelist. Leland is very perceptive. The young boy in \"The Sixth Sense\" saw dead people; Leland sees teenage lovers and recognizes that years later they will divorce, that pain is going to follow many people's present experience of happiness.  BUT, for reasons that are never made explicit, his prescient gift seems to operate some times, for some people, some relationships, and not for others. ???Parts of the movie feel a bit like a derivative quilt -- borrowing from \"American Beauty,\" \"The Sixth Sense,\" \"The Graduate,\" and possibly some others I didn't recognize. That wouldn't be bad if only the character of Leland worked.I think Gosling did a great job of playing Leland but the script and the story imposed limitations.  Would such an observant, meditative young man ever be homicidal?  Even for altruistic reasons?  Nothing in the film gives a reason for this.  I'm a retired therapist with much experience working with families and teenagers; while many of the reactions shown in the film work -- this part, this most essential element certainly does not.\nAnd there is at least one other element which, in my experience, would not fit with real life although it's not as critical.  The reason for the differences between the sisters, Becky and Julie, are never hinted at but that's okay. Once two sibs begin occupying different roles (one the all good girl, the other the troubled one), the roles themselves can begin driving each other to more extreme positions. For the troubled one, Becky, it's kind of, \"what do I have to do to be loved around here -- give up being me and become Julie?\"  And the pressure to live up to being the All-Good, parent-pleasing child, is no less intense on Julie.  So, why would she break up with her boy friend of long-standing and of whom her parents so obviously approve?Don Cheadle was good as Leland's teacher; all others were good in their parts. 98% of the scenes were good.  What was missing was that crucial slip in understanding human nature.Good acting; flawed story and psychology; worth seeing; not a total loss.","After stabbing a retarded boy, the fifteen years old troubled and pessimist Leland P. Fitzgerald (Ryan Gosling) is sent to a juvenile detention. His teacher and aspirant writer Pearl Madison (Don Cheadle) gets close and tries to understand him, first with intention of writing a book, and later becoming his friend. Leland slowly discloses his sad vision of world, showing that he is a sociopath.\"The United States of Leland\" is a depressive and interesting study of a character. The low paced riveting screenplay discloses pieces of the story like a puzzle; there are excellent lines and dialogs; the performances are great, although the twenty-three years old Ryan Gosling does not convince as a fifteen years old teenager; but it seems that a part is missing to complete the puzzle and make \"The United States of Leland\" an unforgettable movie. The disappointing clarification of the \"why\" for the violent action of Leland against Ryan Pollard is not convincing or touching, indeed shows that this character is a totally deranged sociopath with a weird and sick sight of world. Further, the way Allen Harris gets Pearl's knife is ridiculous. My vote is seven.Title (Brazil): \"O Mundo de Leland\" (\"The World of Leland\")","OK, so there's this kid who had a not-so-great life and, like, did this  bad thing. He goes to a kiddie-jail and makes friends with his teacher.  His teacher does some good things, but he also does some bad thing,  too. But not, like, as bad as the things the kid did, but, like, still  bad things. And then some, like, stuff happens, and like, you never  really find out why. It's there just to be there.  Like, the end.  Garbage. Total garbage. Anybody who says this is a movie worth watching  forgot how to see junk when it's staring them in the face."],"review-user":["Macadamian-Nut","Tecun_Uman","Gunz-2","dfranzen70","imtchosen1","Twisted_Utopia","shoparazzi","Goosey101","oshram-3","malizma","fawnbrown","ancientgodofevil@yahoo.com","sparklemonkey","PhilipChandler","say_andy","Chris Knipp","jotix100","csela33","PaulLondon","p-stepien","allmovingparts","lckybabyblue","Bob Pr.","claudio_carvalho","uncertain"],"review-date":["7 November 2004","2 January 2007","24 July 2005","12 March 2005","20 March 2005","5 February 2006","3 September 2004","22 March 2005","8 January 2007","5 April 2004","28 May 2004","11 February 2008","6 January 2005","17 April 2006","4 May 2005","16 April 2004","14 December 2005","15 October 2004","13 March 2006","2 July 2013","21 January 2006","14 January 2006","13 May 2004","28 February 2006","23 September 2008"],"review-rating":["9","10","8","8","10","8","9","8","10","10","9","1","1","9","2","7","8","5","2","10","10","7","7","1"],"review-title":[" An extremely moving, touching, thought-provoking movie\n"," The critics failed to grasp the meaning of this one\n"," Inspiring movie...\n"," Original and thought provoking\n"," This is not \"Just a Movie\", unless you want it to be.\n"," Let it draw you in\n"," fantastic.\n"," a must for anyone\n"," Very, very strong film\n"," Exceptional acting\n"," Amazing film with a great cast and impressive storyline.\n"," total rubbish\n"," this movie=something terrible\n"," ****SPOILER WARNING **** This review contains spoilers......\n"," Like American Beauty plus Donnie Darko minus the quality\n"," Disunited states of Matthew Ryan Hoge\n"," Leland of the US of America\n"," Almost a masterpiece *One Spoiler*\n"," A bad hair day for the middle classes\n"," Doom and gloom of juvenile sadness\n"," The United States of Leland P. Fitzgerald\n"," A movie you can never forget because it makes you think.\n"," Good acting; flawed story/psychology; not a total loss\n"," Depressive and Interesting Study of a Character\n"," What just happened?\n"]}