{"review-url":["http://www.imdb.com/title/tt0342275/reviews"],"review-text":["This is a great compendium of interviews and excerpts form the films of the late sixties and early 70s that were a counter movement to the big Studio Films of the late sixties. Directed by Ted Demme, it is obviously a labor of love of the films of the period, but it gives short shrift to the masterpieces of the times.Many of the filmmakers of this period were influenced by Truffaut, Antonioni, Fellini, Bergman, and of course John Cassavetes. Unfortunately the documentary logging in at 138 minutes is too short! The film is rich with interviews and opinions of filmmakers. Some of the people interviewed are: Martin Scorsese, Francis Coppola, Robert Altman, Peter Bogdonovich, Ellen Burstyn, and Roger Corman, Bruce Dern, Sydney Pollack, Dennis Hopper, and Jon Voight.Bruce Dern has a moment of truth when he says that he and Jack Nicholson may not have been as good looking as the other stars that came before them but they were \"interesting\". This summarizes the other areas of this period of film-making in American history.The filmmakers were dealing with a lack of funding from the Studios because they were expressing unconventional attitudes about politics, sex, drugs, gender and race issues, and Americas involvement in overseas conflicts like the Vietnam War.There is a great interview with Francis Coppola saying that he got the chance to make \"The Conversation\" because the producers knew he had been trained by Roger Corman to make a movie with nothing so they bankrolled his film.Another interview is with Jon Voight who was directed by Hal Ashby in \"Coming Home\" a clear anti-war film about a crippled soldier immersing himself back into society after his facing battle. Voight talks about how his working methods helped him achieve an emotional telling point when Ashby said that they were doing a \"rehearsal\" take and it ended up being the take used in the film- it was better because it was so un-rehearsed and not drained of its freshness by being over-rehearsed.There are also many fine excerpts from Al Pacino's break-through film \"The Panic in Needle Park\", and interviews from Dennis Hopper on the making of \"Easy Rider\", and interviews from Sydney Pollack about making films.All in all the documentary is a fine jumping off point for any film lover who wants to see great examples of what the new voices in film were like in the Seventies. Many of the Sundance Folks, where this film made a big splash, are unaware of just how much the Independent Film Maker today owes to the films of John Cassavetes, Milos Foreman, William Friedkin, and Roger Corman.Rent it from your favorite shop. It will at least perk you up to some films you may not have seen before and can enjoy today. Amazon.com has it for as little as $11.50, if you want to buy right out.","The 1970s opened the door to the largest, most diverse era of film in its history. Some films were great (\"The Godfather\", \"The Conversation\", \"Mean Streets\", Chinatown\", \"The French Connection\", \"Five Easy Pieces\", \"Jaws\", \"McCabe And Mrs. Miller\") Others were not so great (\"The Getaway\", \"The Outfit\", \"Badge 373\", \"Joe\", \"The Taking Of Pelham One Two Three\", \"Brewster McCloud\", \"Castle Keep\") And others were barely worth the price of admission.Yet every one was a fresh breath of air compared to today's Corporate Hollywood. Where every film is given a Big Weekend to recoup its cost. Or go straight to HBO and rental.What \"Decade\" does so well is to relate the sudden and rarely experienced sensation of freedom to be given money to make and direct a film. Perhaps personal. Perhaps not. Sometime with a clutch of extras. Sometimes, in the middle of a busy street before the cops show up. Long before the Corporate Overseers, Suits, Committees and Lawyers ever became part of \"The System\".The commentaries are superb. Especially Julie Christie and Dennis Hopper. Though as you listen, you'll slowly discover just how many Big Directors today (Coppola, Scorsese, Ron Howard, Dennis Hopper, Peter Bogdonovitch) got stated as \"Roger Corman Commandos\". Working long hours with short pay. Shooting a film in under a month. Learning all the steps and tricks of the trade by doing it themselves. Turning in product that was on-time and under-budget.See \"Decade\" for its message. And for a long and varied list of films to watch made through those wondrously turbulent years.Though, I would not complain if IFC decided to devote another documentary solely to that most under-rated Grand Pioneer of film, Roger Corman.","What a wonderful documentary - I sat down thinking this would be a rehash of the bitchy stories told in Easy Riders, Raging Bulls, but it is, in fact, a clear-eyed, glorious celebration of a strange and twisted era that spawned some truly great movies. What struck me was the lack of bitterness apparent in the director interviews, given that now the movie business sucks in a large fashion - instead, folk like Friedkin and Coppola's eyes seem to positively glitter recalling their glory days. The footage of an audience coming out of a daytime screening of the Exorcist was priceless. 'It was - traumatic,' one guy says. A great epitaph for the late Ted Demme, a thrilling film, I just wish it was longer - I could have sat through a three hour cut of this.","This exploration of a unique decade in US cinema begins with the fall of one ailing, out-of-touch empire and culminates with the unstoppable rise of another, equally associated with escapism and box office receipts. Meet the new boss, same as the old boss. Or, as Peter Fonda observed in Easy Rider, \"We blew it.\" In between, from Bonnie And Clyde to Star Wars, the young Turks (some under the guerrilla tutelage of Roger Corman) were creeping under the wires to produce some of the greatest artworks of the 20th century. While the story is already familiar from Peter Biskind's Easy Riders, Raging Bulls directors Demme and LaGravenese are less concerned with muckraking than in providing a platform for the filmmakers and stars themselves.Everyone from Martin Scorsese to Francis Ford Coppola and Julie Christie is interviewed and a roster of well edited clips places the decade in a socio-cultural and economic context. If their responses are self-congratulatory (to say the least), they're also highly quotable, funny and revealing, making this something of a cinephile's wet dream. Director William Friedkin reveals how the original The Exorcist poster was to feature a little girl's hand holding a bloodied crucifix and the legend 'For God's sake, help her\", before he complained. Former Warner Bros.' head John Calley recalls that when he first saw Robert De Niro in Mean Streets he assumed Scorsese had secured a psychopath's day release for the shoot.Happily, a certain amount of hard perspective has crept into the mix, as might be hoped from a politically motivated, consciousness-expanded generation; Hopper stresses \"there's a lot of real crap in there too\". Julie Christie observes that 1970s US cinema was \"not a good time for women\". But if Demme responds with a spoonful of sops to women's movies - brief clips of Alice Doesn't Live Here Anymore, They Shoot Horses, Don't They and Klute - we're soon dragged back to the usual male wall-pissing contests.The shift from tough, socially-conscious film-making to no-risk crowd-pleasers like Jaws for 'Nam-weary, fantasy-craving audiences is also documented, though a little rushed. But kudos too, for the inclusion of lesser-sung, but equally relevant films like Panic In Needle Park and Joe. \"We weren't handsome,\" muses Bruce Dern on his contemporaries. \"But we were f****** interesting.\"","In retrospect, the 1970s was a golden era for the American cinema, as demonstrated and explored by this documentary directed by Ted Demme and Richard LaGravenese. This IFC effort serves to illustrate and clarify the main idea of what that time meant for the careers of these illustrious people seen in the documentary.The amazing body of work that remains, is a legacy to all the people involved in the art of making movies in that period. The decade was marked by the end of the Viet Nam war and the turbulent finale of those years of Jimmy Carter's presidency.One thing comes out clear, films today don't measure against the movies that came out during that creative decade because the industry, as a whole, has changed dramatically. The big studios nowadays want to go to tame pictures that will be instant hits without any consideration to content, or integrity, as long as the bottom line shows millions of dollars in revenues.The other thing that emerges after hearing some of America's best creative minds speak, is the importance of the independent film spirit because it is about the only thing that afford its creators great moral and artistic rewards.This documentary is a must see for all movie fans.","A DECADE UNDER THE INFLUENCE (2003) **** (Featuring interviews with: Robert Altman, Peter Bogdanovich, Marshall Brickman, Ellen Burstyn, John Calley, Julie Christie, Francis Ford Coppola, Roger Corman, Bruce Dern, Milos Forman, William Friedkin, Pam Grier, Dennis Hopper, Sidney Lumet, Paul Mazursky, Mike Medavoy, Polly Platt, Sydney Pollack, Jerry Schatzberg, Roy Scheider, Martin Scorsese, Robert Towne, Jon Voight) Excellent documentary about the last true Golden Age of Cinema: The '70s with interviews of those who made seminal films intercut with footage of the movies providing an interesting time-line of how the influences of previous filmmakers changed the face of filmmaking, the advent of the auteur, the dawning of the age of the blockbuster and the amazing array of unbridled, raw talent of actors providing a bumper crop of truly classic films.  A must for all film buffs and those who are on the way to becoming a new age of cinema.  Directed by Richard La Gravenese and Ted Demme (who passed away prior to its completion; this his fitting swan song to the art form).","A surprisingly good documentary. My surprise was mainly due to the fact that I was confused by the title. I assumed this was about the influence of the drug culture on film making but no it is a much more far reaching and intelligent film than could have been expected. Demme has done a great job in encapsulating the period from the late 60s to the late 70s. From, 'Easy Rider' and the collapse of studio influence, through all those introspective 'real life' movies, where brilliant young directors tried to express themselves politically, sexually and artistically, through to the beginnings of the blockbuster and the return of the reigns to the money men and their studios. As someone who saw the 'real life' movies of Britain and the rest of Europe through the sixties and then the revolutionary US films of the 70s and is sad that the sequel to the sequel is so much the order of the day, this was a most fascinating film. The interview clips are measured (thanks to DVD the full interviews are available as extras!) and the film clips well considered. Also, as someone who has only just caught up with, 'Joe', I am impressed that this important little film gets its well deserved entry here.","A documentary dealing with American films made in the nineteen-seventies, with major emphasis on experimentation with new styles of cinematic expression and departure from the traditional style of film production.It's tough to generalise, but I think the seventies is my favourite decade of film. This is a quality documentary about that period, which correctly identifies my reasons for feeling that way - the waning big studios giving rise to the auteur, non-prohibitive costs and the first \"movie-brat\" generation of film school graduates. However, it then turns into an all too predictable film critics' textbook examining how cinema reflected the social upheaval of the period and champions the usual directors - Altman, Hal Ashby, Bogdanovich, Coppola, Pollack, Scorsese and so on - and their de-Hollywoodised, European-influenced approach. It even goes so far as to hint that the huge successes of Steven Spielberg and George Lucas (who had the temerity to make imaginative, exciting, crowd-pleasing genre pictures) killed artistic creativity and put the studios back on top, a suggestion which pisses me off to no end. Everybody has different tastes - I love Coppola and I can't stand Altman - but I find it ironic that although the films discussed and the interviewees are almost always championing anti-establishment stances, by doing so the documentary is virtually a propaganda film for cinema's Critical Establishment. Some of the comments are spot-on (Dern's analysis of the difference between his acting generation and the preceding one, Schrader's synopsis of the big studios' transition from factories to banks), some are wildly inaccurate (MASH was not the first film to treat war as comedy by a long chalk), but all are interesting and almost all the talking heads are witty and erudite, particularly Corman, Friedkin, Grier, Lumet, Mazursky and Platt. At the end of the movie there is a politely amusing slide which reads, \"I can't believe they didn't mention (insert filmmaker here).\". I could insert specific filmmakers (Ralph Bakshi, Mel Brooks, John Carpenter, Larry Cohen, Michael Crichton, David Cronenberg, Walter Hill, Peter Hyams, John Landis, many others), but what I'd rather insert is, \"Anybody who was either vaguely disreputable, made scuzzy genre movies, didn't have artistic pretensions or didn't receive critical approval.\". If you evaluate the movies of the seventies which still show up constantly in revival houses and on TV, they are all genre movies; horror, science-fiction, crime, action and comedies. This documentary completely ignores them and says that the films we should be remembering are things like McCabe & Mrs Miller and Shampoo. I'm sorry, but no way. A pivotal seventies movie like George A. Romero's Dawn Of The Dead has just as much social relevance as any of the movies discussed in this documentary but, unlike them, is bloody good fun too and what's more, people still want to see it today. All this narking aside though, this is a very well-made and intelligent film, featuring many interesting filmmakers, and not to be missed by moviehounds - just remember that it only reflects a very small, critically-approved niche of seventies cinema. Sadly, co-director/co-producer Demme, who made some nice offbeat flicks (The Ref, Snitch, Blow) died of a heart-attack not long after production wrapped.","...and my reasons for which are simple- there are so many great films presented and discussed here (most of them by their own directors and stars), so many clips of infamous moments in 70's movie history, and in fact a number of films I have yet to see, that it wouldn't be fair to grade this work. By this logic I shouldn't have given grades to other movie documentaries like Martin Scorsese's Personal Journey through American Movies and My Voyage to Italy. But while those films were on the basis of one man's view of cinema, narrating through most of the way, Richard LaGravanese and (the late) Ted Demmes' A Decade Under the Influence lets the films and the creators speak entirely for themselves. What makes 'Decade' worth at least one watch for film buffs, or just anyone who likes the films of the late 60's-70's in America, are the levels that it goes to, that in the uncut version (three hours, not the theatrical version, which I have no comment on) plenty of ground is covered. Interviews include the likes of Scorsese, Robert Altman, Sidney Lumet, Julie Christie, Jon Voight, Francis Ford Coppola, Paul Schrader, Pam Grier, Bruce Dern, Peter Bogdanovich, Roger Corman, Dennis Hopper, Robert Towne, etc, and there's a constant flow of insight from start to finish. The way the clips and directors/actors pop up, edited together in a flashy and quick style, is also fascinating. The one down comment I have on the documentary is that most of the information presented has been reported on in various books, like Easy Riders, Raging Bulls, and though I haven't seen the movie version of that book yet I'm sure it would have covered many of the films and directors and incidents as here (in fact, the book of that is one of the best I've ever read. HOWEVER, this documentary serves as something special for film buffs and occasional movie goers of the future- they can look at this and learn not only about such well known pictures as Easy Rider, The Last Picture Show, Annie Hall, Coming Home, and lessor knowns like Scarecrow, Panic in Needle Park, The Landlord, Joe, They Shoot Horses Don't They. They can also learn about who influenced them (new waves of Europe and Asia), who they served as influences for, and how the subject matter that created controversy after controversy still serves as intriguing and chancy material for the contemporary crowd. Seek this out!","As it stands for right now, Ted Demme and Richard Lagravenese's valentine to 70's film and their makers is an almost average, almost dull look at an incredible moment in the history of cinema; I think even hardcore film buffs will be a bit disappointed, especially if they've seen Raging Bulls, Easy Riders which covers exactly the same territory with much more thoroughness and compulsively compelling narrative.  It doesn't seem fair to judge what they've done  considering this is a gutted version of what will be a three-part, three hour show on IFC sometime in August but as it stands 'Decade' serves as a celluloid 70'S MOVIES FOR DUMMIES for those who are curious.It walks the typical tightrope of grainy movie clips from beloved classics --The Godfather, Chinatown, One Flew Over the Cuckoo's Nest--  intercut with that decade's most famous (and beautifully lit) characters  --Robert Altman, Peter Bogdonovich, Francis Ford Coppola--  and yet there's no new observations or insight into that time or its films.  For the first hour or so, you're slammed over the head again and again with their \"We needed to shake up the old studio system, man!\" message and the back-slapping, self-congratulatory machismo that runs rampant yet when shown the result of their anger and angst, it looks almost silly --i.e. Midnight Cowboy, Panic in Needle Park, Easy Rider-- and ADUTI comes dangerously close to nearly capsizing.The only moment where something fresh seems to be said comes when both Julie Christie and Ellen Burstyn comment on the lack of roles for women during this reverential pissing contest.  A brief salute to Jane Fonda for They Shoot Horses, Don't They and Klute and Jill Clayburgh for An Unmarried Woman and suddenly it felt like the filmmakers were taking you down a street that's been closed for quite some time but then it was back to the world of Martin Scorsese, Paul Schrader, Peter Bogdonovich, William Friedkin, and Coppola.  (Christie and Burstyn are only two out of four women interviewed for this documentary  --the others being Polly Platt and Pam Grier--  and it makes you wonder why Gena Rowlands, Faye Dunaway, Diane Keaton, Liv Ullman, Shelley Duvall, and Fonda herself either declined or weren't even approached.)The best thing about ADUTI is its never-given-its-full-due undercurrent in how most of today's filmmakers and actors are confronted with the same b******* these mavericks were in their struggle for personal vision and expression.  Where are our \"Klute\"'s and \"Scarecrow\"'s and \"Bob and Carol and Ted and Alice\"'s and \"Network\"'s in this A Beautiful Mind/Gladiator/Braveheart/Chicago movie world.Maybe the full, unedited show will be more satisfying.","When an artist, particularly a popular artist creates a work, it is not a matter of them creating something which we can then encounter or not. There is a constant collaboration back and forth, a synthesis of preconceptual stuff that is exchanged. The artist creates tentative forms that will be received by us and affect us, and to do that he has to enlist our help as cocreator.It is a complex business and the rules are always changing. No one fully understands what is going on, so usually intuition is what everyone relies on. Movies are more complex than other art forms, and they are younger by a far stretch. No decent film theorist has yet emerged.Even with the high cost of production, there is so much money in the game that there is lots of room for trial and error. And that's how things happen.How quickly we forget that all of our celebrated filmmakers, especially those featured here, had some really, really big failures. And until these dogs were sent out, they thought they were as terrific as the things that we now endorse.The point is that when it comes to explaining things, these might be the very last people to ask, and whose answers may be the least trustworthy.Yes, it probably helps to know what Scorsese now thinks was in his mind when he did something thirty years ago. And it is useful to know some of the factual history about funding and who introduced whom.But none of that gets us closer to understanding film in the 70s. No one knows what the stock market is doing, but everyone seems to have a plausible explanation afterward. I know that Hopper and Schrader have more interesting opinions than expressed here  I've heard them. Those opinions are of the type I credit and have to do with constructed reality. But none of that will be found in this high school level discussion.Look, these are professional storytellers. They've been explaining themselves all their lives, so they've constructed plausible stories about what happened and why. You can't see it here, but if you dig deeper into individual views, you'll find that each person's vision of the real world corresponds to that of the constructed worlds they create.Scorsese believes the whole world is spun by personality. Schrader believes that drug-addled artists can stumble upon an accidental creation if their passion is great enough. Hopper's world is one in which a noir fate simply lays accidents of insight here and there, and so on.Demme was the wrong man to ask these questions. Of major American filmmakers, only one has exhibited his independence from the internal/external trap: Woody Allen. When he does something like this, we should all listen. Meanwhile, stuff like this only confuses history and understanding.Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.","I swore I would never allow myself to devolve into to the bogus authority figures of the sixties who told me things were better in the \"good old days\"  the current Australian Prime Minister is a sordid example of just such a mind set.But I switched over to \"A Decade Under the Influence\" because I found watching the much-heralded \"Sneakers\" documentary on the other channel such a dispiriting experience. I found the values expressed by the \"Sneakers\" interviewees too ugly to accept as reasonable. So materialistic! So devoid of any sense of outrage at a society that can countenance killing someone to steal his very ugly shoes! So lacking in any worthwhile purpose that they can report without distaste the exploitation an audience by haranguing them to hold those shoes above their heads to lock in a sponsorship deal for themselves with a company of cobblers was just too much to continue watching.\"A Decade Under the Influence\" depicted a completely different response to the fruit of stupidity, corruption and concupiscence in high (and low) places.I have noted the change in film-making that accompanied the exposure of America's disastrous foreign policy debacles in Vietnam and so many less reported places in my www.peterhenderson.com.au website. \"A Decade Under the Influence\" documents the precise moment at which that change took place.Before the seventies, the armed forces were depicted in American films as an invincible fighting force comprised of decent human beings who transmogrified into conquering heroes on the battlefield. After the seventies they are generally portrayed as a dispirited rabble misled by a bunch of bureaucrat clowns in the Pentagon Before the seventies, the FBI agent and the honest cop tended to be depicted as your friend and protector. After the seventies, the FBI agents were all incompetent and the best a cop could aspire to was to ignore their foolishness and his superior's corruption and uphold justice in his own idiosyncratic manner.Before the seventies, the archetypical American \"little guy\", the \"average Joe\", the Jimmy Stewart type would face down the problems encountered and thereby gain some insight into underlying wisdom of his elected leaders and justice of the \"American Way\". After the seventies, Kevin Costner usurps that role, but now he is the voice of one crying out in the wilderness for evil to be exposed, or accepting his lot and making out the best he can.And now those \"old time religion\" mindsets have been stripped of any honesty and righteousness and portrayed (with a certain amount of justification) as sanctimonious bigotry and self-serving hypocrisy.\"A Decade Under the Influence\" tells it like it was. \"A Decade Under the Influence\" tells it like it is now. It depicts the redemption of the American film industry from the hands of the artistically, morally and intellectually bankrupt studio moguls. It shows the storming of the Hollywood Bastille by the independent film makers who promised to get a disillusioned and tired audience back into the cinemas. The fact that their failures were numerous, and at times disastrous, merely underlines the greatness of their achievement. An achievement reflected in the adventurous and questioning attitudes of the big box office stars such as Clooney, Daman, Affleck etc and the directors and producers who provide the vehicles for their talent.","As I am a teenager, I have about one hundred years of movies to catch up on. I try to see a mixture of classics, mainstream, art-house, and other movies. The 70's is one of the most important decades for films: it's when the average, common, classical films changed into full of messages and anti-social behavior. It became like nothing anyone had ever seen before. What A Decade Under the Influence basically shows is how important all of the movies from around The Graduate to about Star Wars.Richard LaGravenese and the late Ted Demme are the primary interviewers in this documentary, which interviews such people as Dennis Hopper, Francis Ford Coppola, Martin Scorsese, Robert Altman, and Jon Voight, among others about how those few years changed cinema forever. It's a very professional, polished documentary, and it's even financed by IFC films. However, as this is a very professional one, I would think that they would at least edit out the noise of someone behind the camera laughing. To me, that took out a lot of how neat and clean the whole thing was.On the other hand, it's a very interesting documentary, about film by the people who make it. Of course, they aren't bashing their own films or anything of the like, but they're portraying honesty on what they thought of the films and what they meant. I don't know much about film (but I want to be involved around it when I become an adult), so I feel like to someone like me this movie is a huge asset. I have seen a good number of movies that they mentioned, like Chinatown and One Flew Over the Cuckoo's Nest, but a little more insight into those movies were very informative.The main reason, however, I didn't love Influence is, as slickly as it was edited, it seemed to take its time in the beginning and be quite relaxed, therefore not having enough time to get to everything that they wanted to show. They crammed in Star Wars and Jaws in the last few minutes, when they were two of the most important. It seemed like they tried too hard to show lots of clips, and that's fine, but some of them were unimportant, such as an extended one from Network.Overall, though, Influence is a very enthralling, informative documentary that helped me, at least, learn more about a second `golden age' in American cinema.My rating: 7/10Rated R for language, and images of sexuality, violence and drug use.","Hollywood can never be trusted to tell the truth about itself (e.g., Sunset Blvd., Private Parts). In all the discussions about post-studio system Hollywood no one, not a one, mentions the most important director, Stanley Kubrick. He distanced himself, wisely, from the neurotic rat race of Scorsese, Altman, Peckinpah, Coppola, Rafael, Schrader, ad nauseam. He made THE definitive films: cold war satire (Strangelove), outer space (2001), future dystopia (Clockwork), period (Barry Lyndon) & Gothic horror (Shining). He moved far away to England w/ his family, a long, sane distance from the anxious, greedy, salivating pigs. I've seen the vast majority of the films mentioned here and can attest that only a small minority was worth the time. A Decade Under the Influence is the babble of the nervous, superficial clique, always worried about being popular, about money. None, not a one of them, were \"artists\" as they claim. They all pandered and chased the almighty buck. Hal Ashby, for example, was NOT an important filmmaker. Roger Corman was nothing compared to Val Lewton, the real king of the B movie. PS. Roman Polanski is also conspicuously absent.","Pros: Great interviews, tons of clips, \"Apricot Brandy\" (the film's theme song), got some films on DVD/Blu-Ray (The Conversation, Being There, American Graffiti).Cons: 70's cinema can be over-celebrated as noted on an excellent LA Times article by Manohla Dargis (http://articles.latimes.com/2003/aug/17/entertainment/ca- dargis17).","Fine documentary on the changing of the guard in cinema, 1969-1979, when independent film companies began churning out more relevant and successful movies than the major studios, and audiences (young people attracted to counterculture cinema) dictated what was a hit and which actors were the new stars. Many terrific interviews with the filmmakers of the time are included (Sidney Lumet, Paul Schrader, Sydney Pollack, Martin Scorsese, William Friedkin, Jerry Schatzberg, Francis Ford Coppola, Robert Altman, Peter Bogdanovich, John G. Avildsen, Milos Forman, Robert Towne, Roger Corman and Dennis Hopper), yet the two directors who changed the face of '70s cinema (which was changing rapidly, anyway), Steven Spielberg and George Lucas, are absent. Spielberg's \"Jaws\" in 1975 and Lucas' \"Star Wars\" in 1977 brought adventure and fantasy back to moviegoers who had been pummeled over the head with Vietnam and Watergate and the sexual revolution. \"Star Wars\" also brought in a new strategy for making millions of extra bucks, through merchandising. This turned an industry, which seven years before had begun to embrace the anti-establishment tale of the anti-hero, into a money-making monster, with blockbusters designed for the whole family. Although not as concise as 2003's \"Easy Riders, Raging Bulls: How the Sex, Drugs and Rock 'N' Roll Generation Saved Hollywood\", this document pretty much covers the same territory--and, similarly, under-utilizes the female perspective (here we have production designer Polly Platt and actresses Pam Grier, Ellen Burstyn and Julie Christie relating their experiences from the female point of view, but that's it). Directors Ted Demme (to whom the film is dedicated, posthumously) and Richard LaGravenese make some minor mistakes (for instance, a still from \"The Exorcist\" is actually that of \"Exorcist II: The Heretic\"), but their clips are well-used and their interviews are colorful and informative. **1/2 from ****","This documentary is based on the idea that the 70's was the most influential decade in American cinema history; seeing as this is an opinion that I have always agreed with I am essentially on-board right away. The subject matter more specifically is about the emergence of the New Hollywood. Strictly speaking this was a period that began about 1967; it was in full bloom until the early 70's but didn't properly die out until round about the dawn of the 80's. The period was characterised by personal director-led films. These were quite a lot less commercial and a lot more left-field than Hollywood had produced previously. They were effectively a response to the box-office disasters of several big budget studio pictures that had failed to find an audience in the counter-cultural times of the late 60's. Once Bonnie and Clyde, The Graduate and Easy Rider were released to huge success, the studios figured that these types of films were the new way forward and would make them a lot of money. It turned out they were only partially right, as while many of the New Hollywood movies were successful in critical terms, not many made a lot of money. And once Steven Spielberg and George Lucas released Jaws and Star Wars, respectively, the age of the blockbuster arrived and it has been thus ever since.As a fan of this period of films I naturally thoroughly enjoyed A Decade Under the Influence. It does have to be admitted though that it is hardly an even handed examination. The view clearly stated is that this was a great time for movies and there is very little in the way of critical counter-views. I don't consider this to be a major problem as this is about shining a torch positively on an interesting period of cinema but it is at least worth acknowledging it. It might have strengthened the documentary overall if there had been some examples of the failures of the movement.Pleasingly, there are clips from many films. It made me realise how many of these films I haven't even seen yet and the segments are certainly well chosen, which is not a given in these types of docs. The structure is of the talking heads format. We hear the views of directors, actors and writers from the period. We learn a lot about their motivations and about the historical context that informed them like Vietnam and Watergate. These were turbulent times in the United States, the upshot is that a lot of great contemporary art was produced, not just in movies of course but also in books and music too. I think all these things came together at one time and the results are there for all to see. If you are interested in the subject then may I suggest also reading Peter Biskind's excellent book on the subject 'Easy Riders, Raging Bulls' – there was a documentary made of that too and while it was good, for my money this one is better.","This three-part documentary was produced for the Independent Film Channel and is about the American film industry during the late 60s to about 1980--give or take. It's clearly much more than a single decade despite the title. The first part is about the context for change in American films with the rise of international cinema and its influence on young filmmakers. The second about the freedom of the 70s and the gritty social dramas. And, the final portion is about the changes that brought about the death of this sort of filmmaking and a rise to giant corporately produced blockbusters. It's all very interesting and features not only directors but writers, producers and actors and I marveled at the large number of interviewees used in making the documentary. In fact, it really excels in an area in which most film documentaries fail--it gives plenty of time to the subject and you don't feel short-changed. My only real complaint is that although the people and films are OFTEN identified, this is not always the case--and unless you are very familiar with these people, you may forget who is who. This is not a problem for advanced film students and cinemaniacs like myself, but for the more casual viewer it might pose a minor inconvenience. Still, it's like sitting in an advanced film class where you learn at the feet of the masters. Fascinating throughout.By the way, although this film was clearly not intended for kids, I should warn the viewer that there are LOTS and LOTS of obscenities in the film---LOTS. So, for the very sensitive sorts, perhaps this isn't the film for you. Also, there are no close captions or DVD captions--which is a shame, as my deaf daughter could not enjoy this documentary.","In 2003 the Independent Film Channel produced a nearly three hour long three part documentary called A Decade Under The Influence (a nod to the 1974 John Cassavetes film A Woman Under The Influence), about American cinema during the 1970s. The general posit of the film, co-directed by Ted Demme and Richard LaGravenese, is that the 1970s were a 'tweener period between the collapse of the old Hollywood film studio system and the rise of the Lowest Common Denominator summer blockbuster mentality, ushered in by George Lucas and Steven Spielberg, that destroyed the template of directors having control and authorship of their works.Now, anyone that has even a passing interest in film- American or otherwise, cannot disagree with this premise. The problem is that the documentary itself is all style (including a great opening musical track) and no substance. In short, it's an MTV-like hyperreal and scattershot take on the films from that decade which were anything but hyperreal and scattershot. Imagine Steven Spielberg bemoaning the loss of Orson Welles when his career is the utter antithesis of that man's. Hypocrisy is a word that floats to mind. That or an ironic streak beyond sharp. Go with the former, people!The film starts out with an homage to the European greats of the 1960s, who helped inspire the younger Americans. It also has the usual 1970s crowd of filmmakers- from greats like Woody Allen, Robert Altman, and Martin Scorsese to once-greats like Francis Ford Coppola and Hal Ashby, to has-beens like Peter Bogdanovich and William Friedkin, to never weres like Monte Hellman. And there are some classic clips from Easy Rider, The Godfather, Bonnie And Clyde, Chinatown, One Flew Over The Cuckoo's Nest, Midnight Cowboy, Taxi Driver, The Graduate, Annie Hall, Network, and others, but it's all perfunctory, surface, and vain. Not a single film nor scene is really looked at, analyzed, put into a blender and studied for why it worked, why it worked in the context it did, nor why such scenes are absent from the films of the Peter Jacksons and Michael Bays.This film lacks any real insight and is too fawning, as if a study of a small group of adepts who have a secret they don't want others to know. The problem is that their secret is well known and their acting like they can keep it is just plain silly.A critic like Kenneth Turan or Roger Ebert would likely have remedied those sorts of shortcomings, but, as with many possible fruitful avenues it could have gone down- such as viewing the decade through the lens of a dozen or two key films, and analyzing scenes for what they meant and how they expressed their points, the whole film fails. It lacks the substance and edginess that it claims for its very subject matter, even though some good insight is provided by, of all people, the British actress Julie Christie.Then there is the smugness. Don't get me wrong- guys like Coppola and Scorsese made great films in that decade, and while Scorsese's only gone downhill in the last decade, Coppola's artistic drought is nearing thirty years since Apocalypse Now. And while Scorsese is not totally condemnatory of modern Hollywood, Coppola seems to buy in to the 'Evil Suits' theory of American film destruction. No doubt that that is mostly to blame, but many of these young directors got big egos and vanity took over, resulting in critical and financial disasters like Michael Cimino's Heaven's Gate, or the crash and burn personal lives of filmmakers like Peter Bogdanovich (whose career never recovered) and Roman Polanski (whose career did). The only person in the film who even comes close to telling these truths is a production designer from Bogdanovich's The Last Picture Show- Polly Platt, who blames the loss of the edginess that the 1970s films had on just this fatness and sassiness, claiming that the young auteurs, especially, got old, rich and lost touch with the very things they and their films once were icons for.A Decade Under The Influence is a so-so attempt to reveal the depths of a subject better left for a ten or twelve hour PBS documentary by one of the Burns brothers. That's because the two directors of this film are too soft and intimately related to the subject matter (as example, Ted Demme's uncle- Jonathan Demme, was one of the young 1960s auteurs). A more objective approach to the film was needed, and this lack of objectivity is the underlying problem that results in all the film's aforementioned problems. In short, while they are the symptoms, a lack of objectivity is the cause, and the best documentaries always strive for objectivity, lest they become Michael Moorean agitprop. And that's a fate and storyline as bad as any lame Hollywood suit could brainstorm.","Because of his access to the heavy weights of the 1970's, film maker Ted Demme gives us a very thorough look at the influences on and of film in the 1970s.However, this ground has been covered so well before, and Demme really does not give us much more insight to that revolutionary decade of film history.Except for some very good and touching interviews with the likes of Jon Voight and Bruce Dern, much of what is covered in this doc has been examined so much more thoroughly in docs such as \"Naked Hollywood\" and the PBS series \"The American Cinema.\" Demme, however, relies on the actual film makers of the decade to tell it as it was. Though the doc's biggest strength, this lack of studio execs telling their side of the story leaves the documentary a bit unbalanced.","The Presentation is VERY shabby. (to my notion) as documentaries often are. Michael Moore's \"documenatry\" - Farenheit 911 is FAR more convincing but has FAR too much media and political influence. Cant wait till Saturday when I get to see the docudrama \"The Game of their Lives\" . IFC goes right of center. I have started a collection of IFC movies from off the internet due to \"TGOTL\" *** out of ********** on \"Decade\". Wanna see good documentaries? Stick to the History Channel.. Or try docudrama. You cant go wrong with them my friend. Cant go wrong. The seventies were ten years of reruns. Or so the old times would have you to believe. Disco died and it is gone forever. When Elvis died o yes we all did grieve"],"review-user":["spelvini","cinebuff-3","Scudpipes","Ali_John_Catterall","jotix100","george.schmidt","christopher-underwood","ShootingShark","MisterWhiplash","barbarella70","tedg","raiderhayseed","movieguy1021","ockiemilkwood","cmomman1988","moonspinner55","Red-Barracuda","MartinHafer","Cosmoeticadotcom","gerardx","PORTCITYPOET31407"],"review-date":["5 June 2006","17 January 2005","26 June 2008","20 September 2009","27 December 2005","28 April 2003","12 November 2009","24 September 2006","8 December 2003","21 June 2003","24 June 2005","15 February 2006","13 November 2003","26 August 2018","15 August 2017","13 June 2017","13 April 2013","27 January 2013","5 September 2008","26 December 2005","4 May 2005"],"review-rating":["10","9","9","7","8","10","5","10","5","8","7","4","7","6","9","9","5","6","3"],"review-title":[" Nice Slice of Cinematic History\n"," An Excellent Film On Films!\n"," Terrific movie\n"," \"You got a gun? Suck on this!\"\n"," Golden decade\n"," The last Golden Age of Cineama: the '70s; a must for film buffs\n"," I was confused by the title\n"," Interesting But Slightly Snooty Documentary On Seventies American Cinema\n"," As much as I loved this film-buff docu-delight, it's hard for me to give it a grade...\n"," Disappointing as a theatrical release\n"," Do They Know?\n"," Watching History take place, as it happens\n"," A Decade Under the Influence: 7/10\n"," Hollywood cheerleading for itself, as usual\n"," Cinema under the 1970's\n"," \"There has to be the personal statement. Otherwise, the culture is going unrepresented.\"\n"," Into the golden age...\n"," A must for film students, though the title is a bit of a misnomer.\n"," Middling take on America's greatest cinematic time\n"," Well made, but nothing new here\n"," The Topic matter is GREAT\n"]}