{"review-url":["http://www.imdb.com/title/tt0378786/reviews"],"review-text":["This film was both entertaining and thought-provoking. I'd recommend it to everyone who wants to be moved and challenged. Great acting, directing - and it is Canadian to boot! It is a film that families can enjoy and serious movie lovers. The locations in Ontario evoked such a sense of nostalgia for the era. With so much garbage and superficial hype selling these days it is great to see that someone could back an independent flick. For any family that has risen to overcome a challenge or an obstacle - be it financial or illness - this film strikes a resounding chord! It approaches the idea of the afterlife in a contemporary way - without cheaply capitalizing on all the \"gohst\" and supernatural themes that have become staples in Hollywood and the TV networks.","I don't usually like to see movies while they're still in theaters because of high ticket prices but I saw a poster for Some Things That Stay and I thought, \"that young actress looks intelligent and mysterious, not like the usual blonde teenybopper BS\". So I decided to take the plunge and see this movie on it's opening night. I must tell you, I was happily surprised. I went to this film with no expectations. I didn't really know what it would be about, but the raw emotion and honest teenage experiences expressed by Katie Boland left me feeling rather satisfied with my decision. Alberta Watson also did a fantastic job as the role of Tamara's disease-stricken mother and I must also add that I was quite impressed with the comedic stylings of Megan Park as Tamara's friend Brenda. The film was wonderfully directed by Gail Harvey, and pulled together in the kind of kitschy 50's way that leaves you feeling warm and happy, even if the storyline tended not to be so uplifting. I also thought that the film was well-shot, many beautiful images of a 1950's countryside will remain in my mind for weeks to come. This film as a whole was quirky and great. I found it to be unpredictable and although the story ends in a somewhat open-ended way, I was still left satisfied. Whether you are looking for a fun, yet powerful coming-of-age story, or simply want to reminisce about life in the 1950's, I guarantee this film is for you. Even if you have no expectations, it is still quite likely that you will be most impressed. Give this one a shot!","I saw this movie with my girlfriends and we all loved it! It is so sweet and heartwarming, a real tear-jerker! I was still thinking about the story days after i'd seen the movie. It's such a beautiful story about the difficult things all families go through, it's something anybody can relate to. I really recommend this movie to anybody looking for a Saturday night rental. With your girlfriends, your family, your boyfriend, everyone will really enjoy it! :D It's a real story about a real family that would pull at anyones heartstrings. Not to mention, beautiful landscape shots and fantastic acting. See it, i'm sure you'll love it as much as I did!","\"Sometimes Leaving Is The Only Way To Move On\"Frankly it comes down to this, Some Things That Stay was average film-making at best because, for me, it couldn't find the right balance of emotional material to keep me enthralled but at the same time not trying to drown me in it.When I say drowned I mean that I was just so overwhelmed with emotional that at the end I felt emotionally exhausted, but not in a good way. I had the same experience with The Pursuit of Happiness, where all through the movie the emotion was just driving me down. However, The Pursuit of Happiness gave me a better sense of connection with the characters better than this movie did. It's not so much that this was a short movie, which it was, but it did have a lot to handle in that time period.The characters were portrayed very well, considering the how amateur the film-making must have been, and I enjoyed, but most importantly believed how they were all presented. So I do give this movie that note. Though, I must admit that the character Rusty was nothing more than just a horny teenager, which is real, but kind of out of place.I DO NOT regret watching this movie, nor am I ashamed. This movie has a lot going for it, and I truly understand why people would love this movie, and I truly understand why people don't like this movie. Consider me somewhere in the middle.**1/2/**** StarsSome Things That Stay (2004): Rated PG-13 for thematic material and some sexual content involving teens","I was wondering what possessed the organizers of the Victoria Film Festival to include this film in their program. I guess they must have agreed with the others who have reviewed this film. I, on the other hand, consider it the worst film I have ever seen. It starts with a bad script, full of holes, and dialog so unlikely it's embarrassing. Ideas are introduced, then dropped with no development. The acting left me totally cold and uninvolved. The set decoration was appropriate for the time, but a decorator's nightmare. The only way the characters could love this house is if their previous homes had been ghastly. The attic looked as if the items had been thrown in for the scene with no attempt to create the look of a real attic that has been filling with junk over the years. The photography was leaden and lacking in variety. Save your money for something worthwhile.","Tamara Anderson and her family are moving once again, as her itinerant painter father chases his next landscape. Fifteen years old, she is in her rebellious stage. Already angry at her father for their frequent relocations, her anger is exacerbated when her mother is suddenly confined to a sanatorium for tuberculosis. Her mother's absence causes Tamara to lash out at her father and seek comfort in religion, the boy next door, Rusty, as well as the spirit of the dead teenager who used to live in her rented house.The story is modest to a fault. It's oddly paced, and even during its emotional scenes there isn't any tension. The actors portraying the parents are fine. Alberta Watson is incredibly charismatic as the sick mother, and Maria Ricossa is particularly effective as the guilt-ridden mother of the dead teenager. But Katie Boland, as Tamara, is too amateurish to carry the movie. The dialog is very natural and Boland can't quite pull it off. She has her moments and when she hits them she can be good but there were too many times when she came off awkward. One can see her thinking 'ok this is what my line is and this is the face i'm supposed to make' rather than actually reacting to the other actors. She's not the only one, Kevin Zegers as Rusty and Megan Park as his sister Brenda also suffer from stilted delivery but at least they're in fewer scenes.If done right, the screenplay could have made her an affecting movie. And it has it moments but much of it is bogged down with an amateurish lead performance and flat directing."],"review-user":["make_the_pie_higher","delusional_caitlin","xoxo_Alice_coco","antidonnie","whatchamacallit","kcla"],"review-date":["7 March 2005","8 November 2004","13 April 2005","12 January 2009","7 February 2005","28 December 2007"],"review-rating":["8","10","10","6","1","4"],"review-title":[" This film was most impressive\n"," You will be pleasantly surprised\n"," I loved this movie!\n"," I Was Sunk In The Emotion, and I Almost Drowned\n"," The worst film I've ever seen\n"," Stilted and amateurish\n"]}