{"review-url":["http://www.imdb.com/title/tt0398883/reviews"],"review-text":["One of the most significant quotes from the entire film is pronounced halfway through by the protagonist, the mafia middle-man Titta Di Girolamo, a physically non-descript, middle-aged man originally from Salerno in Southern Italy. When we're introduced to him at the start of the film, he's been living a non-life in an elegant but sterile hotel in the Italian-speaking Canton of Switzerland for the last ten years, conducting a business we are only gradually introduced to. While this pivotal yet apparently unremarkable scene takes place employees of the the Swiss bank who normally count Di Girolamo's cash tell him that 10,000 dollars are missing from his usual suitcase full of tightly stacked banknotes. At the news, he quietly but icily threatens his coaxing bank manager of wanting to close down his account. Meanwhile he tells us, the spectators, that when you bluff, you have to bluff right through to the end without fear of being caught out or appearing ridiculous. He says: you can't bluff for a while and then halfway through, tell the truth. Having eventually done this - bluffed only halfway through and told the truth, and having accepted the consequences of life and ultimately, love - is exactly the reason behind the beginning of Titta Di Girolamo's troubles. This initially unsympathetic character, a scowling, taciturn, curt man on the verge of 50, a man who won't even reply in kind to chambermaids and waitresses who say hello and goodbye, becomes at one point someone the spectator cares deeply about. At one point in his non-life, Titta decides to feel concern about appearing \"ridiculous\". The first half of the film may be described as \"slow\" by some. It does indeed reveal Di Girolamo's days and nights in that hotel at an oddly disjoined, deliberate pace, revealing seemingly mundane and irrelevant details. However, scenes that may have seemed unnecessary reveal just how essential they are as this masterfully constructed and innovative film unfolds before your eyes. The existence of Titta Di Girolamo - the man with no imagination, identity or life, the unsympathetic character you unexpectedly end up loving and feeling for when you least thought you would - is also conveyed with elegantly edited sequences and very interesting use of music (one theme by the Scottish band Boards of Canada especially stood out). Never was the contrast between the way Hollywood and Italy treat mobsters more at odds than since the release of films such as Le Conseguenze dell'Amore or L'Imbalsamatore. Another interesting element was the way in which the film made use of the protagonist's insomnia. Not unlike The Machinist (and in a far more explicit way, the Al Pacino film Insomnia), Le Conseguenze dell'Amore uses this condition to symbolise a deeper emotional malaise that's been rammed so deep into the obscurity of the unconscious, it's almost impossible to pin-point its cause (if indeed there is one). The young and sympathetic hotel waitress Sofia (played by Olivia Magnani, grand-daughter of the legendary Anna) and the memory of Titta's best friend, a man whom he hasn't seen in 20 years, unexpectedly provide a tiny window onto life that Titta eventually (though tentatively at first) accepts to look through again. Though it's never explicitly spelt out, the spectator KNOWS that to a man like Titta, accepting The Consequences of Love will have unimaginable consequences. A film without a single scene of sex or violence, a film that unfolds in its own time and concedes nothing to the spectator's expectations, Le Conseguenze dell'Amore is a fine representative of that small, quiet, discreet Renaissance that has been taking place in Italian cinema since the decline of Cinecittà during the second half of the 70s. The world is waiting for Italy to produce more Il Postino-like fare, more La Vita è Bella-style films... neglecting to explore fine creations like Le Conseguenze dell'Amore, L'Imbalsamatore and others. Your loss, world.","This is a very visual film. By that I mean that the dialog is sparse, almost to the point of being a silent movie for some very long takes, beginning with the opening shot.The silences, however, are broken by a stunning sound track that ranges from discordant, staccato beats to a haunting mix of violins, and interspersed with vocals that sound like dreams. It's a feast for the ears as much as for the eyes, one of the early visuals being a man walking along a street, so preoccupied with his interest in a shapely woman, that he walks into a lamppost: one of the consequences of love and a metaphor for what lies in store...A long time ago, another movie  Love Story (1970) -- said that love is never having to say you're sorry. This narrative turns that idea on its head in a number of ways, beginning with the main character, Titta (Toni Sevillo), a seemingly innocuous long-term resident in a plush hotel somewhere in Switzerland. Everyday, week in, week out, he sits at the same coffee table, enjoying the passing world, his cigarettes, his coffee, his solitude  and he's been doing it for ten years. He sits, he observes, and once a week he engages in three very surprising activities that you'll find out about when you see this little masterpiece...Love is explored in another way, in a direct counterpoint to Titta's solitude and reserved nature: two older residents of the hotel are still much in love, but the man wants to die in a spectacular manner when his time comes, while his long suffering wife berates him for cheating at cards with the other guests, one of whom is Titta. Now, Titta knows about their squabbles, their love, the man's cheating, his apologies to his wife, and his whining. How? In a surprising and black-comedic manner...one of those surprise activities I mentioned.But, this is no comedy, in reality, although it does touch upon the idea of the human comedy in a Balzacian sense: the irony of life and what to do with it. That decision had been made for Titta ten years earlier when he left his wife and began to live in the hotel. He keeps in touch occasionally, and it is clear that he still loves his children (now grown up) and the sorrow in his voice speaks volumes. But, there's something more than just sorrow...Such a life as Titta's would obviously seem to be utterly boring, and it actually is from many perspectives. It is only when we learn what lies beneath his almost death-like countenance, however, that the horror of his situation hits the viewer between the eyes. But not before we know that the female bartender, Sofia (Olivia Magnani), is very interested in Titta and goes out of her way to pique Titta's interest in her.And that's when things start to unravel for Titta: he eventually succumbs to her femininity and in doing so discovers, once again, the consequences of love. Ironically, in doing so, he finally realizes what he must finally do with his life, and in a most spectacular fashion.I know that all of the above is somewhat cryptic; but, to say more would spoil the film and story for you. If you like Italian cinema  I love it!  I urge you to see this one. The acting is superb; the sound track chills the spine; the camera work is truly innovative; the direction shows the maturity of a true artist.I know I'll see this movie again, and again...","There are movies that are just a different version of another one, not remakes, but just similar to others, it is not. Although it talks about Mafia it is watched in another way and often it seems just a secondary theme. I went to watch that movie for case (because the otherone's theatre was full) and I was satisfied at the end. It surprised me, because of its black irony or cynicism and there are more and more interesting items to analyze. It doesn't follow the classical ways of movies, it is just different and I think not to be the only one to like that. I am very happy also because it is Italian, and I was afraid that Italian directors and producers were not enough brave to change themes. In this movie you can watch new Italian style as well, but is not blocked into clichés. I hope to be understandable enough, I know it is difficult, I hope also that this movie can be exported out of our frontiers, it is a good product to export. I want to point out also the music, very good soundtrack, the movie needs it because of its long silent pause and they are covered perfectly by that music. Many compliments to the director, and thank you, cinema needs these movies.","I saw Le Conseguenze Dell'Amore on the 2005 Rotterdam Filmfestival, It was the first of ten films I saw there.Le Conseguenze has left the most powerful impression of the ten films. From the first shot, you know the movie is going to be something special. The beautiful cinematography left me in awe of what can be done with a camera. The music is also on par with the visuals, complementing the colorful and stylish architecture-like images.Toni Servillo plays the main character in the film, Titta. He's a tax expert gone wrong who lives in a hotel. Every week, he brings a suitcase with money to a bank and the story plays around this.He is always very controlled and shows almost no emotion to anyone; Looks calculated and well-dressed. He has a habit of ignoring people who are of no significance to him. For example Sofia (played very nicely by Olivia Magnani), who works as a barmaid in the hotel where he lives. Although she's been working in the hotel for two years, he never greets her, even if she does greet him. On one day she confronts him with this and the next day he sits at the bar, instead of his usual spot at a window. From here the story really begins, and will unfold in a strong tale of love, sacrifice and the mafia.I won't spoil the rest of the film. See this film if you love stylish movies like ones from David Lynch, The Godfather, etc. Don't see this if you're an action-buff.","The opening shot is hypnotic, drawing you in. Into a world of strangeness and solemnity. A deep, Italian baritone-voiced narrator making the invite ever more enticing. Then:A middle-aged gentleman just sits in the hotel lounge, looking intelligent and distant, distinguished but also downright arrogant and rude. He never speaks to staff, or other guests, even, despite having been in residence for ten years.He does something, without fail every Wednesday - and a couple more things the same day, once a year.The sort of gentleman one could chance upon in any hotel, pretty well anywhere in the world. A poker-face of nothingness, smoking his life away, his concentration on his inner world only broken by the burned out cigarette stub. The excellent acting of Toni Servillo, coupled with the sublime direction of Paolo Sorrentino, employing a Kubrick style of slo-steadicam, with an ever sense of steady dread. Always compelling rather than propelling, the story unfolds with Servillo's character, Titta, as he leads this strictly regimented life until confronted by the stunning Sofia, the barmaid. She looks at him straight in his eye and states that she's made his bed, served him this and that, had always been polite and courteous for the three years she's worked there. And he's never had the decency to utter a single word to her. Instead of being nice back or even saying anything at all, we're aware that a flicker of something human has sparked within him. But, as the very title states, this lowering of his guard could very well be his downfall. What does, however inflame this film and raises it even higher are the occasional flurries of activity. Titta hardly does anything more than almost nothing (driving one block, or looking around - not buying, though - a shopping mall) is accompanied by very loud punk rock music. This is unsettling - is this a dream he's having? Does he yearn for the fast life? Are the people he meets from a past, productive life? Do the characters he encounters then have any relevance to him - and to his situation now? The scenes look very real; the mood and ambiance are definitely not.Moving on into the realms of more conventional crime drama, but still with a cool unease and an almost Memento meditative pace, the whole reveals lives and opportunities lost. Of redemptive longing and knowing one's own fate. This is an intelligent film that refuses to retread a potentially familiar path.If in the U.K, BBC4 shows it again, wrap yourself inside it, be enveloped by it. You'll want to watch all of it, not that you know why but you'll be glad that you did. It's only 90mins. I've seen The Consequences... four times now, and I never tire of it. The ending will have you quietly shocked and amazed, too.","The consequences of love: There is really something special about this film but it's very hard to put your finger on. It is a love story of sorts but not really one i've seen before. It has several love themes running throughout the film. One mans love for a younger woman, a younger mans love for his older brother, the mafias love of money at all costs these are just some that intertwine in a story that has you guessing or rather not knowing where and how it will end. The cast are all superb from Sophia the teasing barmaid to the straight faced-ness of titta the films central character. With simple yet affective camera work bounced off an ever-changing soundtrack that mixes low-fi trip hop with lush orchestral pieces. The style of the film changes beautifully using several styles without ever getting cluttered. Love has never looked so diverse and powerful as the tales we are told rumble towards various conclusions. The director has married old and new into a rich Italian classic.","Well, where do I start...As one of the other reviewers said, you know you're in for a real treat when you see the opening shot - minutes and minutes of film time spent on a guy standing on a travelator.I won't repeat Rubin's excellent summary of the story. What I would like to say, though, is that this film gripped me more than any film I can remember. I sat open-mouthed, and on the edge of my seat all the way through. The camera work, sound track and *fantastic* performances (particularly that of Tony Servillo) draw you to the screen and won't let you look away.It's Italian, so of course everyone looks fantastic, but it is by no means merely an exercise in cool style. This is a film with lots to say about luck, loss and love.Go and see it.","OK, I'm Italian but there aren't so many Italian film like this. I think that the plot is very good for 3/4 of the film but the final is too simple, too predictable. But it's the only little mistake. The Consequences of Love in my opinion have great sequences in particular at the beginning and great soundtrack. I'd like very much the lighting work on it. The best thing on it is a great, great actor. You know, if your name were Al Pacino now everybody would have still been talking about this performance. But it's only a great theater Italian actor called Toni Servillo. Yes, someone tell me this film and this kind of performance it's too slow, it's so boring, so many silences, but i think that this components its fantastic, its the right way for describing the love story between a very talented young girl, the grand-daughter of the Italian actress Anna Magnani, Olivia and the old mysterious man Toni. One of my favorite Italian films.","I saw this movie in the Rotterdam Film Festival and I was pleasantly surprised. The photography is just so stylish and beautiful, and the story it's just not your average mafia movie, actually that storyline is pretty much in the background. It's more the personal journey of a middle age man that is trapped in an existence he was forced to live. The actor, Toni Servillo, is superb, he excels this \"quiet man\". The girl, Olivia Magnani, is the grand-daughter of Italian actress Anna Magnani and lives up to the family surname.If you're expecting your typical Italian movie where everybody is screaming to each other in big families, this is NOT your movie. There are not you're average clichés and it's definitively worth seeing this one.","Although I totally agree with the previous comment regarding the marvellous acting of Toni Servillo as Titta Di Girolamo, I would also like to add the beautiful filming and montage which turns this movie virtually into a painting. The young director Paolo Sorrentino had the courage to experiment with different types of camera techniques which reminded me of Darren Aronofsky' Requiem for a Dream. They both used the same MTV-style filming combined with modern (alternative/techno) music, making the film  Le Consequenze dell'Amore - stand apart from the other crime/mafia movies in its genre. Even though the movie may start of very slow-paced almost \"sec\" compared to the faster Hollywood productions it should be enjoyed cause of its serenity, marvellous character portray and splendid ending. Definitely a must see for people who enjoy the European/Italian cinema. PS Toni keep on acting like this we need an encore.","I've seen this film so many times, It's that good. Maybe because I can relate to Tittas way of life is the reason why. Not everyone would find it to their taste. Also, my Italien is improving after each viewing. Am I a sad case? Thankyou Mr Sorrentino. I look forward to your next film. Although I did not see the film at a cinema, I have the DVD and would encourage anyone to buy it. The Special feature extras alone is worth the price. The amount of time a director spends on the making of a film is very seldom appreciated, the extras on the DVD gives an excellent insight to the making of a film. As for the story of the film, I'm bias.I happen to rave about it to all my friends, but as I said before, I relate very much to the main character who is a loner in a situation not of his own choosing. The Mafia in Sicily use Titta to launder their money in a Swiss bank. He owes them for costing them Millions of dollars years ago in stock market deal that went wrong.Love kills.","I saw this interesting film back to back with the Chinese/French film \"2046\" at the recent Dubai Film festival. Both were intelligent works made the same year (2004/2005). Both had the main characters living in a \"hotel\". In both films, the hotel is more a metaphor of exile than a location. Both dealt with love between a man and a woman. Both had wonderful music and riveting performances. What a coincidence and yet how the two films differ in treatment of the subject! Somewhere at the beginning of the film, a man walking on a pavement turns to look at a woman and in doing so hits a lamp post. The audience erupts into a volcano of laughter innocently. But isn't that brief shot the synopsis of the film, that entertains you for 2 hours? While the film is a wonderful blend of black comedy (e.g., using a stethoscope to listen to a neighbor's conversation in the adjoining hotel room), the film builds on what Buster Keaton and Jacques Tati had introduced to cinema earlier--stoic faces that leads to comedy quite in contrast to the equally intelligent world of Robin Williams or the heartwarming Danny Kaye. A sudden frenzy of activity transforms an otherwise stoic character while moving money from the hotel to the bank is reminiscent of Tati's works.But the film is not mere comedy. The anti-automation statement (cash counting and the reaction of the bank staff to the statements relating to it, the dummy that acts as an ineffectual warning to the speeding lady, the reference to \"Moulimix\" as the fictitious \"company\" he works for, etc.) are several cues that the director is offering a loaded comedy to the viewer. Laugh, yes, but reflect on it and enjoy further..The movie's strength lies in is brief, staccato script (by director Paul Sorrentino) that offers comedy that is mixed with philosophy (\"Truth is boring,\" \"Dad is dead, but nobody told him,\" \"Bad luck does not exist--it is the invention of the losers and the poor\". Then the director goes on to provide you with a fascinating lecture from the main character on insomniacs. You will not sleep through this lecture.Sorrentino provides entertainment pegged to the subject the Italians know best--the Mafia. It is an existential mafia film.There is a loaded philosophical sequence where a young girl, sitting opposite the lead character Titta Di Girolamo, reads aloud a passage from a book: \"Whatever he wants can happen. What a fine mess. That is the advantage of using memories to excite oneself. You can own memories, you can buy even more beautiful ones. But life is more complicated, human life especially so, a frightening, desperate adventure. Compared to this life of formal perfectionism, cocaine is nothing but a stationmaster's pastime. Let us return to Sophie.. We become poetic as we admire her being, beautiful and reckless, the rhythm of her life flowed from different springs than ours. Ours can only creep along, envious. This force of happiness both exciting and sweet, that animated her, disturbed us. It unsettled us in an enchanting way, but it unsettled us nevertheless. That's the word.\" The reaction of Titta to the passage is interesting. Titta is himself a cocaine addict. Titta looks at the barmaid of the hotel-his own \"formal perfectionism.\" The following sequence is of Titta calling his own wife and daughter on the phone--a conversation filled more with silence than words. They, too, are Titta's \"memories.\" The final sequence of the film is of Tittas' best friend Dino Guiffre working alone repairing a fault on an electricity pylon in biting wind in a snowy landscape--recalling his own best friend Titta. This is a film about friendship that transcends the mafia.Since \"Truth is boring\", the director provides a dessert as part of the fine meal of superb acting (Toni Servillo), good music, clever camera-work (Luca Bigazzi), a beautiful, enigmatic actress (Magnani, grand-daughter of the great, immortal beauty Anna Magnani) and powerful script. The dessert is for the viewer to figure out the truthful feelings of Titta, towards his family members, towards his hotel guests, towards the bar girl, towards the mafia, towards the bankers, towards the hotel owner, and towards his best friend Dino. (Assuming that the viewer accepts the eventuality of how Titta recovered his suitcase from the goons, how does he get inside his car and get it covered with its synthetic cover while he is still inside it?) Perhaps it is Sorrentino's admitted love for the literary works of Louis- Ferdinand Céline that has sculpted the character of Titta. The film's end will remain an enigmatic one for a reflective viewer.","Italian screenwriter and director Paolo Sorrentino's second feature film which he wrote, premiered In competition at the 57th Cannes International Film Festival in 2004, was shot on locations in Italy and is an Italian production which was produced by producers Domenico Procacci, Nicola Giuliano, Francesca Cima and Angelo Curti. It tells the story about a middle-aged man named Titta De Girolamo who has lived in a anonymous hotel in Switzerland during the last eight years. Titta is a well dressed and short-spoken man who has maintained an ice-cold facade for a long time and who spends his days at the hotel's bar and lobby where he distantly observes the personnel and the guests, but his life alters the day he unexpectedly allows himself to become interested in a young and attractive bartender named Sofia.Italian filmmaker Paolo Sorrentino had made a number of short films before he in 2001 made his debut feature film \"One Man Up\" and he received international recognition three years later with his next narrative feature. Within the 100 passing minutes this piece of art lasts, times existence disappears and one's eyes is magnetically drawn towards Paolo Sorrentino's minimalistic vision of an esoteric character's monotone and ritualistic life at a hotel where colorful individuals live in a spiral of repetitive behavior. Through the protagonist's point of view, a reflective voice-over narration, sterling production design by Italian production designer Lino Fiorito, cinematography by Italian cinematographer Luca Bigazzi and a great score by Italian composer Pasquale Catalano, Paolo Sorrentino depicts a refined study of character about a nostalgic and introvert 49-year-old man who against his own principles let's the light into his life at the moment he establishes communication with an accommodating woman who has spent two years trying to declare her existence to him. This fascinating play with perspectives which almost exclusively takes place at a hotel, becomes a distinct film experience much due to Paolo Sorrentino's characteristic use of close-ups, repetitions, slow-motion scenes, long takes and sequences with rapid editing where the music is impressively well calculated, and is impelled and reinforced by it's cogent narrative structure, quiet though intensifying continuity, cinematographic expertise, aesthetic depiction of an almost mechanical upper class milieu, synoptic screenplay, quick-witted dialog and the understated and convincing acting performances by Italian actor Toni Servillo and Italian actress Olivia Magnani. An existential drama, an unconventional love fable, a thriller, a neo-noir or a gangster drama, Paolo Sorrentino's genre mix is well-constructed and this ingenious work is inspiring cinematic creativity from the innovating opening scene to the stylized ending. A brilliant exercise of style and form where image, sound, movement, figure of speech and narration is sublimely incorporated.","The Consequences of Love begins with some very stylish introductory sequences, acquainting us with the ritualised life of the protagonist. Most of the movie essentially consists of a series of 'clues' thrown to us by the director, through which we gradually form an understanding about Titta Di Girolamo's circumstances and tragic existence. At some point the movie abruptly shifts gear in order to show how this fragile world is demolished, as a consequence of the thawing of Titta's human emotions. Regrettably this is where the movie fails in this viewer's opinion. The reason is the very weak, non-believable and unmotivated twists in the plot. Titta's character performs a massive swing from never exchanging as much as eye contact with anyone, to performing mindless acts of dangerous folly to get Sofia's attention. This extreme tension within him has been so carefully hidden from the audience that when the swing happens, we are all left wondering. On a minor but related point we are never really sure as to where Sofia's interest in Titta comes from. In general one might say that the movie succeeds in engaging the audience only in a 'solve-the-mystery' or 'who-is-this-man' kind of way but never manages to really make us care for any of the characters.To the movie's positive elements must be attributed the superb acting of Toni Servillo, the inspired camera work as well as very good use of musical ambiance. However, the truly exquisite style of the cinematography at times seems like the movie's own enemy, as there are scenes shouting with the 'stylishness' of fashion or car commercials, detracting from the movie's aims. In all, it is worth seeing and should be given credit as a promising effort by a new director, but, sadly, not much more.","Maybe my rating should have been a 9, but the film absolutely stunned me when viewing it first time and my latest viewing confirmed my initial belief. Stylish yes, every scene has crafted scoped views, terrific angles with a perfect sound side accompanying them.Put on top great acting from especially Toni Servillo, garner it with one of the most beautiful and charming women in Olivia Magnani, and a fine plot and you will end up seeing this small masterpiece over and over.Paulo Sorrentinos next movie \"L'Amico De Famiglia\", which is in competition in this years Cannes Festival, will be eagerly awaited.","Very slow, dull, enigmatic film. MAybe the kind of film Jean-Luc Godard would have made had he been Italian. Certainly conveys how tedious, repetitious, joyless and empty a person's life can be, but I don't usually go to the cinema to find that out! The plot (such as it is) doesn't convince. Why a gorgeous hotel receptionist (an exception to the dullness of the film) would be the slightest bit interested in a moody, chain-smoking, silent loner who speaks in 'deep' aphorisms baffles me. Very difficult to feel any sympathy with the main character. One feels like shaking him by the throat and telling him to 'snap out of it!'. His brother is a much more human character. The ending is inconclusive and puzzling. Everyone in the cinema (when I saw the film) went out muttering about how they nearly fell asleep. Of course, it shouldn't have to be a Hollywood Bruce Willis-style 'shhot-em-up' and 'crash-bang' fiesta, but a little bit of energy and action would have made it a lot more thrilling. One of the best Italian films ever?! Pleease...An art-house, curiosity at best.","This is one of the worst pieces of cinema I have seen in some time. This is also my first review so you can tell I must hate this film at lot.Don't get me wrong, I like my serious films. I don't like Hollywood too much, I tend to like French, Italian, offbeat US or anything that tries to communicate something sensible.But this was awful. Why? 1. The plot (such as it was) was entirely unbelievable, even though the director seems to be hinging everything on a feeling of realism.2. The main character has nothing to recommend him. Does he smoke for coolness or to show us his angst? For goodness sake this guy is meant to be an ex-dodgy mafia lawyer. Are we meant to care more because that he is also one of the meanest unfriendly people you could ever meet? And he smokes...so he must have deep personal issues. Pop psychology at it's best. In the final moments, I almost cheered as he gets buried in the cement. Best place for him. And I thought that was about the only good scene. Or maybe that was because it was so close the final credits.3. The entirely tired and unbelievable interest in the main character from the beautiful girl. She was there simply because beautiful girls always have odd sexual relationships with old, old men with a deep and meaningful personality (as demonstrated by smoking). Happens all the time. In really bad films that is.4. The pace was so leaden. I like slow, I like careful. But this was just deathly.5-50 a bunch of other stuff that I really can't be bothered to write.Awful.","A true masterpiece by Sorrentino and Tony Servillo demonstrates his exceptional acting ability as the cool, enigmatic Titta.Yet another example of a must see movie that the everyday person will not receive access, as the high street cinema chains are full of Hollywood funded nonsense. Fortunately I reside in the metropolis and amongst the privileged few who enjoy the choice the art-house cinema provides. I champion the day when cinema investment will be channelled into bespoke film screenings allowing choice for the masses and away from assembling penny sweet counters! Film of the year for me so far and yes I've seen a few....","Someone on these Boards has predicated that the whole thing is being dreamed by the best friend of the protagonist, albeit a friend he hasn't seen for some 20 years. I'm reluctant to dismiss this out of hand but it does raise some viable questions. Why WOULD a telephone engineer - or a shoe salesman or butcher for that matter - WANT to create a mythical world and weave it around a friend populating it in the process with a set of equally mythical supporting characters. With an imagination that good the friend should be WRITING not Dreaming. Dream or not SOMEONE, and the obvious candidate is director Paolo Sorrentino, has created a very watchable world in which Tony Servillo makes stillness a Fine Art. We are asked to believe that forty-something Titta La Girolomo (Servillo) 'upset' the Mafia some years prior to our meeting him and as penance he is a virtual prisoner in a small Swiss hotel from which each week he drives to a local bank with a suitcase containing nine mill large in used notes. Other than this weekly trip he is free to do as he likes and what he likes to do is smoke, play cards with a man who cheats and a wife who reminds the husband how far they have fallen socially, and ignore the friendly overtures of Olivia Magnani, who has spent two years trying to get a smile and/or a 'good evening' out of him. For reasons best known to himself and which are inconsistent with a man who has no interest in anything or anyone, Servillo spends a certain amount of time every day applying a stethoscope to the wall of his bedroom and listening to the private conversations of his card-playing partners. Eventually he does respond to Magnani - he has to do so or they would be no film. This is plot 6f: the one about Destry, who never wears a gun, or Sean (Duke Wayne), the 'Quiet Man' who refuses to rise to provocation and fight until the obligatory scene where the gun is strapped on and the fists cocked - but instead of contenting himself with a polite come stai oggi he removes 100,000 from the suitcase and buys her a car. The final inconsistency occurs when Magnani tells him she will pick him up the following day at 4 pm in her car and they will drive into the mountains to celebrate his birthday. We've established that she lives locally so why she is then seen driving from somewhere miles away, ignoring a police roadblock to drive off the road and overturn the car is anyone's guess. This inconsistencies apart this remains a fine piece of film-making with an excellent lead performance and a very good supporting one.","I was so looking forward to seeing this film that I can't really understand how I got the impression I would enjoy it. I'm afraid it really is a yawn fest - every single patron in the cinema I attended yawned and fidgeted frequently during the whole film. This is a shame because it is a fantastic story - I'm inclined to think that it would make a better read. It is not helped by the principle character only showing his teeth once - and that was as a result of the camera angle. As the story unfolds it becomes easier to understand the main character's dilemmas. However, the suspense and drama that could have made this a really top rated film have been completely spoilt by the dull treatment. Dull as a half-baked documentary!","You could tell from the opening shot of the conveyor belt in the bank that this was going to be a great film.A touch minimalist in feel with a twist of retro this film oozes style -the brilliant camera-work, acting, script and the manner that the secret life of the protagonist unfolds all complement each other in possibly making the best Italian film I've ever seen (up there with La Stanza Del Figlio - albeit different).Shame on the people sitting behind me who made it obvious that they couldn't see the relevance of the slow but painfully beautiful scenes meticulously crafted by the camera. Don't miss.","A stylish, touching Italian film. Toni Servillo's ascetic, crisply presented hotel-hermit Girolamo barely speaks and looks thoroughly bored. Not promising. However, we are engaged with a double hit of Girolamo's mysteriousness and the peripheral characters that he can't avoid in and around the hotel. Not least of these is the barmaid, the dark and irresistibly fragrant Olivia Magnani. She reaches out to him - the rest of the film are the consequences of his piqued humanity.I liked the editing, the use of a broad and varied soundtrack and a fresh, non-judgemental attitude to some familiar set pieces - murder, drug use, lust. There's no specifically existential narrative. It's equally cool and noble but no issue is made of any of these facets. Rather it's a straightforwardly told story in which all these themes are interdependent on one another. 6/10","A stylish story-telling. Dramatic like Malèna but with the eroticism toned down. Dialogues are focused because director Paolo Sorrentino is hellbent to make spoken words as limited as possible.Introvert Titta di Girolamo from Southern Italy lives alone at a hotel in Switzerland, confined by the mafia. Everyone is curious about his profession. He is shown as the one of those uptight people who hardly utters a word and lacks in imagination. Everything is fine and smooth with his life until he falls in love with a barmaid. Since the movie is Italian and mentions little of Mafiosi, I expected guns and tragic scenes. And the fun is that the film-maker managed to twist around everything we know of clichés about Mafioso. Does the barmaid reciprocate and fill his life with something exciting? Girolamo wrestles with insomnia and hopes to find courage to get out of the prison kind of life.An irony of a scene comes up somewhere in the beginning. Girolamo shares a quiet dinner with a couple who is his neighbour. The narration shows that bitterness corroded the husband's life as he exclaims to his wife: I was immoral and wicked and I ruined your life. You know what frightens me most? Dying of old age, I want to die an extraordinary death. And right at that moment his wife hands him a pill and says: You've got to take this now, Carlo.There's another scene of the old couple. The husband tells her woman they should holiday to Cambodia and so, she asks where would they get the money. He replies that he will sell off the painting gifted by her mother. She retorts that the painting is the last sign of her mother. To this he gets angry: Your materialism revolts me. You're just a petit bourgeios. All this time, Girolamo had been listening to them with a stethoscope held to an adjoining door between them.I just love verses being read out. Here in the movie, a young woman who happened to occupy Girolamo's favourite seat reads out a beautiful verse about love to her friend. With the barmaid behind him, it seems like the situation is telling him to do something but he just stands there.The soundtrack of the movie suits exactly. Songs fill up the silences in the movie for the film-maker was aiming to make the conversations dramatic and indeed he did pull it off. A mesmerising Italian song closer at the end. (I don't know the duo who sang this) Some lines go like thisYou need passion,lots of patienceraspberry syrup And a touch of recklessness. You need a pound ofyour own abilityLatin sensuality and a little distance. That's how you make it, lipstick and chocolate and not to eat them would be a shame. That's how you do it over low heat stirring, with lots of feeling.Watch it but don't expect the Mafiosi fanfare. Or for that matter, don't expect nitty-gritty stuff like Gomorrah.","I was fortunate enough to see all of Sorrentino's work recently at this year's Italian Film Festival here in Hollywood and by comparison I can report that this movie is one of his best. To be sure - all the usual quirky idiosyncrasies of his style are represented: The dialogue not necessarily representing the individual character's intelligence but rather his state of mind, the quick, often fleeting hints at things happening, the sometimes inconsequential progression of plot which only makes partial sense once you've seen the whole time line, etc. This time the story lends itself nicely to all of Sorrentino's traits and save for the ending which once again seems somewhat stilted, his tale is a piece of work not to be missed. Check it out!","Le conseguenze dell'amore (2004)is a beautifully made film that takes small carefully positioned steps towards its ending that need to be savoured in order to be enjoyed. From the contrasting landscapes, to the tightly enclosed world that the hero inhabits, we are taken by the Director and controlled from the very moment we enter the hotel. We, like the hero, will never escape from the suffocating intensity and paradoxical monotony of his criminally driven, Mafia world. That the film resists Mafia stereotypes whilst revelling in them makes it all the more successful. The concrete grave, the inevitable brutal executions and overwhelming maleness are laid bare and exposed for what they are. Just brutality and business, and no more. Life is about being part of the corporate machine that is organised crime and not about love or living for self, family or others. Our hero is indeed a hero in that he gives up his life for the sake of the touch of the beautiful barmaid, the resolution of the misery suffered by his only neighbours in the hotel and in order to escape his decorative prison. The consequences of love are indeed beautiful and brutal at the same time. See it!!"],"review-user":["Asa_Nisi_Masa2","RJBurke1942","dadie","Rubin55","tim-764-291856","come2whereimfrom","eamonnb","remfanit","martacarmona76","rainmaker1981","thf36","JuguAbraham","SindreKaspersen","y_vog","Al-Swearengen","MarcChrys","Tony221268","movietipster","writers_reign","PipAndSqueak","hummerboy","Framescourer","bunty-thoidingjam","RaidonD","sp2303"],"review-date":["19 April 2005","4 April 2007","31 October 2004","30 January 2005","10 January 2011","2 October 2005","20 July 2005","9 August 2005","1 February 2005","1 February 2005","5 October 2006","29 December 2005","3 December 2010","28 May 2005","22 April 2006","1 October 2005","27 February 2006","24 November 2005","21 June 2005","28 July 2005","29 May 2005","13 October 2006","29 April 2014","4 March 2014","25 April 2009"],"review-rating":["7","9","10","9","9","8","10","9","10","8","10","8","9","5","10","4","1","9","8","4","10","6","8","7","9"],"review-title":[" The consequences of wanting to live\n"," Beneath the serenity of daily living lies the liesor truth?\n"," Finally a very good movie\n"," Stylistic miracle of camera-work and storytelling.\n"," Distinguished & deliciously cool\n"," different kind of love story.\n"," Cool, stylish, gripping and wonderful\n"," wonderful\n"," Stylish Italian movie\n"," Beautiful till the end\n"," The consequences of great film\n"," Intelligent black comedy that urges the viewer to think (after s/he laughs!)\n"," \"Brilliant exercise of style and form...\"\n"," Interesting idea, quite poor plot resolution\n"," Stunning\n"," Italian/Swiss paint is just as dull to watch dry\n"," One of the worst\n"," Film of the year....\n"," Love Forty +\n"," Sorry folks, this isn't for everyone\n"," sublime\n"," Existential man vs mob movie\n"," It takes courage to die an extraordinary death\n"," One of Sorrentino's best\n"," The Beast with elegance and beauty\n"]}