{"review-url":["http://www.imdb.com/title/tt0382097/reviews"],"review-text":["I liked most of this film. As other reviews mentioned it has a good cast, the plot is interesting enough. All in all it is fun to watch.But the ending, I feel, is completely botched, it left me bewildered. Yes, you expect people crossing and double-crossing each other in this sort of movie, but quadruple-crossing? Well, if it's justified by the plot then why not? But that's the bad part, there's completely no need for it. After a certain point it's all scheming with completely no meaning. (here comes the SPOILER). After the airport scene Enrico and his accomplices already HAVE the money. I couldn't understand the need for the rest of the scam. Is it all necessary just to rub Federico's nose in the fact that he's been fooled? I don't buy it.So 6 out of 10 for 3/4 of the film and 2 out of 10 for the ending.","This is an outstanding criminal thriller, and with a great cast too. Spanish language cinema's best and most popular actors of the past couple of decades, Victoria Abril and Federico Luppi, team up in one of the better Spanish language crime thrillers of 2004-5.The film begins by focusing on thirty something Ernesto (Ernesto Alterio), an elegant, attractive and slick thief who learned from childhood friend Gitano, and more recently from Manco, an old seasoned swindler. Manco introduces Ernesto to Federico (Federico Luppi), an also elegant, but more astute & experienced methodical thief - the best in his class.Federico's only known weakness is Pilar (Victoria Abril), his former mistress and partner. She suddenly appears and proposes a fabulous rip-off scheme to her former lover, a crime in grand scale, which will eventually require the help of Ernesto, Manco and Gitano, among others.The script is full of twists and surprising reversals, particularly towards the end of the film. One criticism about the film I've heard a lot is that there are too many plot twists towards the end, but I disagree. The film captivates the audience so much that all the unexpected events are not too much to follow. In fact, these are what make the film outstanding. I highly recommend it.","Miguel Bardem is one of the latest off springs of a well-known family of actors, directors, composers and writers. His previous films have been very irregular, since \"Más que amor, frenesí\" was nice, \"La mujer más fea del mundo\" was too weird to my taste and \"Noche de reyes\" was a complete failure. \"Incautos\" is his best film so far, but still has a few gaps in the screenplay and its pacing. Three actors in a state of grace (Ernesto Alterio, Victoria Abril and Federico Luppi are great) are involved in a plot that might remind the viewer of Stephen Frears' \"The Grifters\". Although the film starts well, the ending is somehow too twisted and some pivotal points in the plot are barely explained. Maybe all the events going on in the first hour could be cleared by a second viewing, but the screenplay should explain everything by itself in a single viewing.\"Incautos\" is technically good, specially cinematography and score, and the cast is outstanding (apart from the three leading actors, Manuel Morón and Manuel Alexandre are a delight to watch). Therefore, a better structured screenplay would have helped to make this film a really great one.Overall rating: 6/10","This stirring picture deals with Ernesto (Ernesto Alterio), a young swindler who tells us his infancy in an orphanage, youthful years until his relationship with El Gitano (Alejandro Casaseca) and tutelage from an aging con man named Manco (Manuel Alexandre), a true artist from long time ago . After some years of smash-and-grab burglaries , they're joined by Federico (Federico Luppi), an old swindler , he is the best , a real professional . Things go well until they become involved to Pilar (Victoria Abril), a woman from Federico's past, re-enters his existence with a proposal to trick that will put them all on richness , but the events go awry . Now they along with Orozco (Manuel Moron) got to the edge of a big score when attempt to cheat a millionaire named Mellado (Gabriel Melki) by means of a complicated plot.This interesting film packs thrills , suspense , action , twists and turns . It deals with a group of swindlers and their cat-and-mouse game full of plot twists and extraordinary surprises . The twisted story is carried out in similar style to other magnificent films as ¨Nine queens¨ and ¨David Mamet's House of games¨ . It is developed in flashbacks from childhood until the final big score and is narrated voice in off by the starring , an excellent Ernesto Alterio , son of another good actor , Hector Alterio , and sister of Malena Alterio . Remaining cast is frankly fine as Victoria Abril , Federico Luppi who bears a strong Argentinian accent , Enrique Villen , Marian Alvarez , Alfredo Villa , among others . Special mention to veteran and always likable Manuel Alexandre , recently deceased . Atmospheric and suspenseful musical score by Juan Bardem . Being a co-production Spanish/French appears as cameraman Thierry Arbogast who realizes a good camera-work and he has photographed several French super-productions.The motion picture is well directed by Miguel Bardem who belongs a notorious actors family , as is son of director Juan Antonio Bardem , aunt is Pilar Bardem ,cousin of Carlos Bardem, Mónica Bardem and Javier Bardem. He has directed some entertaining films as comedy as ¨Twelfth night¨ , Mas amor Que Frenesi , ¨Mortadelo and Filemon , mission : save the planet¨ , suspense as ¨The ugliest girl in the world¨ and ¨Incautos¨ at his best and results to be his most successful picture .","I was so offended by this film that I had to write SOMETHING about it, so please humour me.Its only redeeming virtue, outside of some good acting, is that it doesn't go on past 107 minutes. Even that length is about 30 minutes too long.Comparisons have been made here to the brilliantly dark 'The Grifters,' but I can't see it. They are two different films altogether. The closest 'Swindled' comes to an existing film is 'The Sting,' made in 1973. It borrows (sorry, STEALS) liberally from this splendid George Roy Hill 'entertainment,' which is exactly what is was. I enjoyed it because it didn't pretend to be anything else.There are so many red herrings in 'Swindled' that I thought I was in a fish tank. It's very confusing, but that's only one of its many problems. The principal one is this: if you make a film where everyone lies to everyone else, where everyone is conning, we have no 'anchor' to ground us. The inevitable result is a mish-mash of very sloppy seconds from other caper flicks.Just about everyone in this film is conniving and objectionable. Surely a basic Film 101 class would tell us that the audience has to 'care' for someone. We can't 'care' for anyone here: they're ALL swines. It might have worked as a rakish comedy, but it plays it straight from beginning to end.IF YOU WANT TO SEE THIS FILM, READ NO FURTHER. BIG 'SPOILER' COMING. SORRY, BUT I HAVE TO DO IT.There's so much fake blood and so many fake killings that it doesn't strain credulity -- it destroys it. The ending is absolutely ridiculous -- a 'murder' in a crowded airport that isn't really a 'murder' at all? And the 'murdered' guy, blood-soaked, simply stands up, brushes himself off, and walks away, fake blood dripping, with the booty? All while the police and hordes of people are looking on, and no one intercedes? The director must have a lot of cojones if he thinks we're supposed to buy into this. Noirish B-movies from the 1940s did better. I'm a great fan of European flicks, but this confirms that schlock doesn't always come from Hollywood. As far as 'Swindled' is concerned, my judgment lies with a famous line from the oft-misspoken producer Samuel Goldwyn, who knew all about schlock: 'Include me out'.","That's the best title for this movie, because nothing ever happens. Totally stupid and waste of time. Luckily for me I fast forward it so didn't waste all this time. Some good acting though","So far Miguel Bardem's career it's been one of the more dreadful of recent Spanish cinema. He's made nothing but rubbish... until now. \"Incautos\" has been quite a surprise: it's a serious film, with rhythm, with a great cast and very entertaining.The art of robbing, that's what \"Incautos\" is about. A film much alike to David Mamet's \"House of game\" and stuff like that. A thousand of twists in the script, and a story where nothing's like it seems.The weak points in latest Bardem's movie may be the so-American language, that makes some of the characters look rather unnatural (especially Victoria Abril's. She's a hell of an actress, but in \"incautos\" she looks a little bit forced). Ernesto Alterio is not that bad, but he's not half as good actor as his father... And what to say about Luppi?? Well, he's the MAN.In short: a good movie. The best that Miguel Bardem has ever made. I hope this is the beginning of a brand new stage in his career.*My rate: 7/10","Ernesto is a man that makes a living out of duping other solid citizens of their hard earned money. Together with Manco, an older man with a lot of experience, he pulls out capers that allow him to make a decent living, but that is not making him a rich man by any means. Enter Federico, an older man who is more experience in the art of deception. Together with the younger Ernesto they prove a winning combination. That only lasts until Pilar, Federico's former love interest, appears in the picture.This Spanish film directed by Miguel Bardem, is light in tone and pleasant to sit through. Other, better made caper films have been made with much clever plots than this one, but the film is easy to take, and at times, it has a lot of funny situations.This viewer will see Federico Luppi in anything, even reading the telephone directory! He is an actor's actor. We have had the privilege of having seen him in the Buenos Aires stage doing excellent work before his international film career. As Federico, he does what he does best. It's impossible to imagine anyone better in his role. Ernesto Alterio, the son of Hector Alterio, is a young actor who promises to have a great career. Victoria Abril makes Pilar fun as she gets involved with these con men. Miguel Alexandre, a veteran actor, is also good as Manco."],"review-user":["hello_dima","ElianaM","newland80","ma-cortes","groggo","ferdelaboca","rainking_es","jotix100"],"review-date":["4 December 2005","5 November 2005","29 August 2004","23 February 2012","16 April 2007","26 May 2018","17 June 2006","16 October 2006"],"review-rating":["4","10","6","6","1","2","7","7"],"review-title":[" A good film with a very stupid ending.\n"," Outstanding Criminal Thriller! Great cast too\n"," Nice but irregular thriller\n"," Nice Spanish movie about intelligent swindlers full of suspense , thrills and plot twists\n"," Proof that some European films can be crap too\n"," Nothing\n"," Finally Bardem makes a decent work...\n"," The con men\n"]}