{"review-url":["http://www.imdb.com/title/tt0395669/reviews"],"review-text":["Do the following: Get a copy of this movie and a friend. Wager the friend $10 that they can't sit through this entire movie. They cannot divert their gaze or be distracted by anything. Now watch your friend. Win or lose, you get $10 of entertainment.It angers me to no end when people see a movie and are quick to give it 1 out of 10, or sum up their thoughts with \"it sucked\". (And when asked \"Why?\", they respond, \"Just because.\" Arrgh.) That is why this movie exists. It's sole purpose is for me to say, \"There! THIS is a horrible movie! THAT is 1 out of 10!\".This movie is absolutely appalling.While the recent trend of movie parodies has forced them to become increasingly formulaic, this movie falls short in every single aspect. It's not funny. It's not entertaining. And for some of the parodies, it's completely inaccurate! Horrible acting. Unfunny dialogue. A witless story. Terrible \"special effects\". One INANE gag after another. And to make matters even worse, there isn't even gratuitous nudity to somehow make it even fleetingly worthwhile.This movie leaps past idiotic, stumbles over stupid, and lands face first on moronic. Even I, who loves a good \"check your brain at the door\" movie, found myself physically agitated watching this. This movie isn't even \"Hard Ticket To Hawaii\" so-terrible-it's-good bad... IT'S JUST BAD.NOTE: I actually challenged a friend to watch this as described above. Not only couldn't he make it all the way through, but he had a headache and needed a couple minutes afterward because he felt a little ill. True story.I could not accentuate this rating any more... a resounding 1 out of 10!","This movie (even calling it a movie is an overstatement) is ridiculously horrible. Normally a huge fan of Eric Roberts in \"B\" list movies, this tragedy of a flick makes me question his real B list clout! And Charlie, please go back to hoping for a Diagnosis Murder revival rather than this.....you can't blame the nameless eye candy (uhhum...beauty pageant members) for participating in this weak movie, but YOU are a former TV star man! Pull yourself together. Don't even get me started on Stuart Pankin. For the sake of all that is good Stuart, you should have seen this was not necessarily a real movie! Bryan Michael Stoller exemplifies absolute genius only in the fact that he was able to dupe anyone into investing in this picture (money or time).Really, this was no parody or spoof movie although it tries on a 2nd grade level. Mostly, it is poor writing and acting and camera work and editing and....well poor everything. I watched it because I read an article in some mag about agent MJ's involvement and my interest was peaked due to the lawsuit in which he was involved. I now wonder if the only reason they show him from the shoulders up in the movie is because he, like at the trial, showed up wearing pajama bottoms and barely lucid (wait a second, is he ever really considered lucid?...I digress). And Agent MJ? Is that the best they could come up with for a name for his character? Sheez. What a startling piece of originality! Or, maybe that was supposed to be funny? Putting Marriott into the movie was a nice touch at first, but overdone and annoying after all is said and done.Spare yourself the grief of watching......don't say I didn't warn you.","You should never ever even consider to watch this movie! It is absolutely awful! This isn't an overstatement!! It is so unbelievable and exaggerated, it gets boring. It is just a movie where they have taken stories and plots from several movies and put it together in one. They writer hasn't been able to pull it off in a good way.If you'd like to see pretty girls in bikinis and no brain this might be the movie for you, but still, you should plug your ears and just watch. It's not worth listening:p There are so many great movies out there, and if I could choose one, this would be the last movie I would pick. But all in all, it's your choice!!! Enjoy!","First, I would like to apologize for my rating of \"1\"... The only reason i give this film such a high rating is that I can't delve into negative integers. All \"This is a spoof\" musings aside, and while I certainly have tried to give it due consideration, have left me with a certain notion, namely; \"This is quite possibly the worst film ever made.\" On any level and in any plausible quantification of qualitative measurement... Seriously, I tried, I'm just as in to any indie born-for-cult-video-distribution film as the next buff, but seriously, this movie sucked rhino balls...Honestly, if I had directed this \"film\" I would have seen it as a legitimate cause for suicide.","There was a time when Michael Jackson was revered as the King of Pop. Then came a time when he attracted negative publicity as much as lemonade attracts wasps. Finally, it is now the time that we feel truly sorry for this man.This 'movie' is another reason to. I promised a rabid Michael Jackson fan to watch it with her. You know the type of fan -- someone who tells him- or herself to like everything the object of affection ever did. While watching this movie, which she had seen twice already, I realized how far this fandom goes. Probably far enough to rate this movie above a 1/10, as some people miraculously did.The movie attempts to be a parody of many other movies and series, most notably Cast Away, Lost and Jurassic Park. Unfortunately, it fails miserably at any level. The acting does not save the absolutely horrible story, the filming has the quality of a too-often played video tape, the special effects were better executed in Be Kind Rewind (for those who do not now this movie: with aluminum foil)... All this would be funny if the movie managed to be, well, funny. Unfortunately, it is not. It hurts to watch this.And then there is Michael Jacksons appearance in this garbage. He appears on a projection screen to deliver an important message, and manages to come across as mobile as Jabba the Hutt and as serious as a 4-year old. Just when I thought \"who is the terrible person that lured this poor man into participating in this movie and yet again making a total fool of himself\", I (finally) reached the ending credits and discovered that the movie was actually partially shot at Jackson's Neverland ranch. In other words: He. Likes. It.This movie, and Jackson's involvement in it, is truly disturbing. Do not watch it even for the \"haha, a movie in the IMDb Bottom 100\" effect. Or be warned.","While traveling with a team of misses for the dispute of the Miss Galaxy, the airplane piloted by Maximus Powers (Eric Roberts) and Mike Saunders (Charlie Schlatter) crashes in an isolated, where lays Noah's Ark protected by the Jurassic Pork. While the group fight to survive, alien apes plot to use the ark to destroy the human race and dominate planet Earth.I like parodies, but \"Miss Castaway\" is an offense to human brains. The awful story and the special effects are very, but really very bad. There are spoofs with \"Lost\", \"Castaway\", \"Jurassic Park\", \"Sixth Sense\", \"Titanic\", \"Planet of the Apes\", \"Raiders of the Lost Ark\", \"Congo\", \"MIB\", \"Perfect Storm\", \"Austin Powers\", \"Jaws\", \"Mission Impossible\", \"Close Encounters of the Third Kind\", \"Star Wars\" and \"Hulk\", but the problem is that most of them are very silly and not funny. In the end, the trailer is better than the film. My vote is four.Title (Brazil): \"Missão Quase Impossível\" (\"Mission Almost Impossible\")","holy sweet murder this is quite possibly the least funny movie i've ever seen. you can take my word for this as truth because it's playing on television right now. it's really one of the most pathetic productions i've ever seen. there is not a single redeemable aspect of this flick. it just lacks any humor whatsoever. the only good thing it possibly has going for it is that it's so unfunny that it's wholly unmemorable. in fact, i just sat through some ridiculous sub-plot and i can't really tell you what went on. the only reason i can even possibly remember having seen this movie is because it's so absolutely humorless it will stick in my mind forever based on that alone.an absolutely must miss. if your friend wants to show it to you, shoot him and save yourself the boredom.","As an indie filmmaker, I try to at least make a decent film . This piece of ____ was beyond low budget. It was shot on video and not 24P mini-DV at least. The look and feel of this was just baaaad. I met the director a few years ago at ShowBiz Expo in LA and he was talking about that book, Film-making for dummies that he was putting together. I thought this little video was going to be something but I guess I was wrong. He could have brought the value up a little by shooting 16mm film instead of that awful video. The plot was stupid as well as the acting and all the fake green screen and sound and the whole nine yards. I had a choice tonight to rent any movie and made the wrong choice. Damn!!!!! I did buy JoyRide which was a hell of a movie. Maybe the director should read real motion picture books on film-making and not try to cut corners when trying to make a low budget flick. Maybe he should learn from the masters who made, Night of the living dead and The Evil Dead and Chain saw massacre. just to name a few of the all time low budget great hits. This is one video that should have stayed dead. I cannot call it a film because he did not use film.","How did this movie ever get made? This is quite easily the worst spoofing movie I have ever seen. Anyone who criticises Friedberg and Seltzer should sit down and take a look at this because it's worse than all of their movies.I would really like to know How they got people like Michael Jackson and Pat Moria to be in this because this movie is crap.The plot should not even be mentioned, well Okay but I did warn you, as far as I got it a plane crashes on an island and the antagonists are The Planet Of The Apes, if they launch Noah's Ark it would create the Perfect storm and the US Government try and destroy the island.No Wonder it's on The Bottom 100, IT DESERVES TO BE THERE","This film, had it been done properly, has SO much potential. Parody films are always funny, and people tend to like them because they're light hearted, stupid and silly but fun. This film WAS funny in some parts, but it could have been a lot funnier. The acting itself was OK from all the actors, but...I wasn't satisfied. It seemed a tad empty, and my summary title says it all about the effects. Proper green screens weren't used for this movie...backgrounds were added in after which just looked terrible. No wonder this film went straight to DVD lol. It wasn't ALL a total loss, it is funny and will give you a good laugh (AT it, not WITH it most of the time).","Three questions arise in my mind when watching this movie, \"What?\", \"Why?\" and \"How come this in not over yet?\"There are random things happening all through the movie that make you wonder what the heck is going on. One or two unexplained things, sure, but there are so many of these random events that it makes your head spin. When you finally figure out what is going on (is it joke, or actually part of the plot?) the next question is why, why is this nonsensical thing happening? It's completely ridiculous. I figure it out at the end, all the weird stuff going on is part of some subplot or other, and they do actually tie all of them up in the end (in a haphazard and untidy fashion but still) but the problem is that there is no main plot, only subplot, the end result is a nearly unwatchable mess.To top it all off there is a large amount of unfunny jokes thrown in here and there, much like in Epic Movie, which is not a good thing. The only reason I give this 2/10 instead of 1/10 is the laughable green screen effects, they are much funnier than the jokes.","Okay, I think we're all agreed that Michael Jackson was the low point.And the special effects too. But, please, keep in mind that this was NOT a big-budget film, okay? Not every film gets as much of a budget as Harry Potter or Star Wars.However, I thought it was pretty funny altogether. B-? Nothing that would, in my opinion, waste your time.Parodies are always fun to watch, and just because it wasn't big budget doesn't mean it's bad.I think this was a good movie, if weak at some points.Hope this comment helps. ~Angela","\"Miss Cast Away\" is an amusing trifle, which dispenses with serious plot or character development to pack in as many gags as possible. Best enjoyed with a large audience that is open to such entertainments and perhaps, has had a few drinks. Most of the jokes are current-event based so in future years this film may become a time-capsule of turn-of-the-21st-century pop culture references.The 30i to 24p conversion of the footage does create a jerky appearance in some parts, most noticeably the opening aerial shots.The appearance of Micheal Jackson is indeed a strange non-sequiter event. But I, for one, find it encouraging that Mr. Jackson has shown a helpful interest in one of his protégés even after he (the director) has passed from the cute-preteen-boy stage.The effects work is not as bad as one review suggested. Most of it was done by a one-man crew in a brief span of time consisting of animator William Sutton, whose name seems to have been omitted from the IMDb credits. His work is an extraordinary achievement and really helps to fill in the gaps in this movie. I hope he's finally been paid!","A planeload of incredibly stupid beauty contestants crashes on an island and lots of movie genres are spoofed in this film. If you fond films like \"Disaster Movie\", \"Epic Movie\" and \"Meet the Spartans\" too intellectually challenging, then I have a movie suggestion for you! \"Miss Castaway and the Island Girls\" is a spoof with non-stop humor(?) and is very similar to these other films--but the budget is significantly lower and the jokes are even dumber (yes, apparently this IS possible!). However, in defense of \"Miss Castaway\", it cost less to make and at least didn't make young adults significantly stupider--as no one went to see this film (whereas, inexplicably, the other three were well attended--which seems to prove that the apocalypse is real and imminent). I also would say that although the film is totally awful, it....no, wait...there's nothing more to say...the film is just terrible. Now considering the cast of mostly no-names and fourth-rate stars and faded stars, this is no huge surprise. With the likes of Eric Roberts (who used to be famous), this isn't a surprise--nor is it a surprise with guest spots by the like of Stuart Pankin, Pat Morita, Jerry Lewis and Bernie Kopell and, interestingly, Michael Jackson.So why did I watch this banal film? Well, I have a confession to make. I occasionally like a terrible film. Considering I have reviewed hundreds or perhaps thousands of art films, foreign films and documentaries, sometimes I just need a good laugh--and a bad movie can be funny. No, the jokes aren't funny---but laughing at how incredibly bad a film can be is good for a laugh. This film, not surprisingly, is on IMDb's infamous Bottom 100 list, I HAD to see it! So, if you WANT to see a terrible film, give this one a watch--it's funny in a brainless way and is great for a group of friends to watch and laugh at some minor ex-stars self-destruct. Plus, it makes no pretense--it doesn't try to be anything more than dumb--and I can appreciate that.","This is a film that revolves around two mysteries (which I have now demystifed).First, did the film makers understand the concept of 'parody' before using it to carpet bomb the audience throughout the film? Parody is when a reproduction attempts to mock, comment on, or pay homage through self-depreciating humour to, the original work. In other words, there should be reasons to parody such work, and they should definitely be clever. I didn't see any of those in the film. I did see some awful 10 seconds jokes that fell flat within 2 seconds of delivery. Bryan Stoller probably went to Eric Roberts and said \"hey, I was drunk last night, watching Survivors, and had this brain fart for a straight to DVD release. I want you on board without reading the script...because I plan to direct this film without one!\" And herein lies the second mystery: Eric Robert's career. I use to think Eric Roberts had the career he had because he was unlucky. Now I realize it's because he is stupid (and therefore deserves the career that he had). After watching this movie, it is apparent that he would have been better off had he gone into mainstream adult films, which has higher budgets, more...intense...scenes and roles, better acting and direction, more elaborate and compelling plot lines, and a much wider audience than this B-movie reject (C-movie?).","Director Bryan Michael Stoller apparently wrote the reference book \"Movie Making for Dummies\". This film is not a good advert for his book and doesn't do his credibility as a director much good at all. I had to look long and hard for a DVD copy of this film before finding a German region 2 copy available under the alternate title of 'Silly Movie 2' (Thankfully, there is no 'Silly Movie 1'). It is riding high in the IMDb database of the 100 worst movies of all time, and upon viewing it, I can say it is placed that highly for a very good reason. Bryan Michael Stoller's direction and script is so incompetent that he actually makes his nearest contemporaries, Jason Friedberg & Aaron Seltzer look like genuine Oscar contenders. Compared to this, 'Meet the Spartans' and 'Epic Movie' are like the 'Citizen Kane' of spoof movies. The only two real questions that arise from watching this movie is to wonder how far Julia's brother Eric Roberts had to sink to headline this film, and how on earth the director talked Michael Jackson into performing what is nothing more than a three minute cameo. This was filmed in 2004 and proved to be Jackson's last work as an actor (he died five years later in 2009). The special effects are nothing short of woeful, the acting uniformly dreadful. Even lots of beautiful girls in bikinis can't save this one. As a spoof it's not even funny. See it if you dare, but don't say I didn't warn you what a pile of rubbish it is. Some films are so bad they are actually almost good. This film is just bad.","Really a spoof film. Fun and just plain old cool! Eric Roberts is the man and has a few funny moments. They actually got actors that are really good but a weird movie to boot. They got Eric Roberts & Charlie Schlatter. Two actors that were in great movies. If you are a Eric Roberts fan or a Michael Jackson fan, you should buy this DVD. Go to the website and buy it! It also has great bonus footage and Top secret behind-the-scenes from the Neverland Ranch! A must watch! Different and just plain old cool! Very cool and just going to be a collectors item for sure. Out of 4 stars a solid 2 1/2. Not all that good but very fun! Thanxs for the memories! Funny!","If you like silly comedies like Airplane you'll love this movie! It's definitely in the style of Airplane and Scary Movie. A fun film! It has the strangest cast of characters all in the same movie. Michael Jackson, Evan Marriott, Joyce Giraurd, Stuart Pankin, Charlie Schlater and Eric Roberts. The special effects are hokey, but I think they're supposed to be since it's a silly comedy. There is apparently two versions of the film, one at Blockbuster and one on the official website: MissCastaway.com. The one on the website appears to be a preview release version signed by the director. There's some fun behind the scenes material filmed at Neverland with Michael Jackson as well. The movie was filmed in 2003 and says it's PG rated fun on the box.","I don't understand why this movie has such a low rating. It totally deserves more! Sure, it's completely ridiculous, but that's what it was supposed to be. Don't expect cinematic transcendence from a movie about beauty pageant contestants stranded on a Caribbean island! What you should expect is a huge spoof of pretty much every relevant sci-fi, fantasy and block-buster movie in cinematic history, and even references to other spoofers. All completely exaggerated and sometimes totally unnecessary, but that's exactly what makes this movie stand out. If you like parodies, and enjoy say, Leslie Nielsen or Mike Myers, you're gonna love this. I sure did!","I do like comedy and I do like spoof movies, but when I saw Miss Cast Away online I found myself loathing every second of it. It is not as monstrous as the likes of Disaster Movie or Epic Movie, but it is a long way from being a Galaxy Quest or a Young Frankenstein.The film does look cheap. The scenery is not striking and looks more like tacky studio sets, while the editing is rushed and the special effects are some of the worst I've seen in a while, and that is including the Jaws like shark.As for the story, was there even a story? Seemed like a series of disconnected and witless scenes, and the basic idea was predictable and unoriginal. The humour was painful; the jokes are incredibly forced and timed really poorly while the writing and dialogue are insipid and unfunny.The characters are clichéd and none of them are likable in any way. The direction is incompetent, the soundtrack is poorly used and the film is rushed in the pace and dull in how unfunny it all is. The acting is dreadful, the actresses are the epitome of all looks no talent, Eric Roberts phones in, Michael Jackson's appearance was both disturbing and useless and I don't know what Charlie Schlatter(who is a decent actor) was doing here.Overall, awful and doesn't work on any level. 1/10 Bethany Cox","A plane is about to take off. On board are a bevy of ladies, representing the states of the USA, who are flying off to compete in a beauty pageant. Along with them are reporters and pageant staff. Meanwhile, the Pope has been informed that the remains of Noah's Ark have been found, with Noah in it! His Holiness sends underlings to investigate. Hold onto your bottoms, folks! The aircraft goes down near a deserted island and there may not be enough make-up kits to last until a rescue boat arrives. The gals start fighting while the men organize the ladies into two groups to plan survival strategies. Only no one picks Michael's group, except a lovely brunette. Unbelievably, this is the same island where the Ark was found, with its Congo-type ape protectors AND where the Porkasaurus Rex, a cross between a wild boar and a huge, fierce dino, roams! Who will survive the ordeal, especially when one typical beauty contestant reveals that she has never eaten anything but restaurant meals provided by a handsome male? Ho, ho, fun and games will start! This is an ultra-silly spoof of a long list of films, such as Jurassic Park, Congo, MI, The Love Boat, Miss Congeniality, and other fine movies. In fact, it misses the mark of comedy far MORE than it hits a humorous note. Most of it is so lame that it can be classified as wheelchair-cinema. The cast, all pretty much unknowns, save for Eric Roberts and Stuart Pankin, have mediocre talent at best. However, they are exceedingly gorgeous, especially the ladies, so those searching for an eye-candy cast will be happy. All in all, don't go looking for this one unless you consider it better entertainment than shucking corn or taking out the garbage.","Except for the appearance of talented Austin Powers impersonator Richard Halpern, this pic was your run of the mill movie spoof. Dated movie references will not help audiences that may come across this endeavor in future. Watch for \"Groovy\" Austin Powers in the hot tub. It's a hoot and a half.Poor special effects are overcome by the appearance of numerous starlets in skimpy outfits, so at least that should keep one entertained (if that's what thrills you).For my money, I would rent the DVD of classic spoofs such as \"Airplane\" or \"Lobster Man from Mars\"."],"review-user":["da_flipboy","Pietruck","astrid_lien_16","orengoldschmidt","nosiesnetnieuws","claudio_carvalho","balthazar13","rko290","WakenPayne","crazyinfatuation","a-twetman","ronrocks92","robcat2075","MartinHafer","dontspamme-11","churchofsunshine","WhiteTigerPat13","filmfun-3","hellblade","TheLittleSongbird","inkblot11","max-140"],"review-date":["19 June 2008","3 May 2006","25 March 2008","14 February 2006","9 September 2008","28 November 2006","21 May 2008","26 November 2005","4 July 2011","2 June 2005","29 November 2012","20 August 2005","21 August 2007","9 February 2012","28 March 2010","8 June 2014","3 February 2005","31 July 2005","3 January 2009","18 June 2011","13 January 2011","20 December 2005"],"review-rating":["1","1","1","1","1","4","1","1","1","3","2","7","7","1","1","7","7","1","3","4"],"review-title":[" The ONLY way to make this movie fun...\n"," So very very bad....and not in a good way!\n"," There is no word that can explain how horrible this movie is!\n"," I must apologize...\n"," Absolutely horrible -- another reason to pity Michael Jackson\n"," Silly and Non-Sense Parody\n"," it sucks.\n"," Learn from the Master FilmMakers\n"," How?\n"," Could win an Oscar for the worst CGI effects ever\n"," Just a bunch of random subplots\n"," Low Points and High Points\n"," Pop culture time capsule\n"," Sort of an Ed Wood film for the 21st century.\n"," Two mysteries\n"," A truly terrible offering from a director who manages to make Friedberg & Seltzer look like Oscar contenders!\n"," Miss Cast Away a fun movie...\n"," If you like silly comedies like Airplane you'll love this movie!\n"," Spoof everything! Even the spoofers!\n"," One example of a spoof that doesn't work on any level\n"," A miss-take it is, to give this a thumbs up, its so lame, its in a wheelchair, cinematically speaking; but, the cast is attractive\n"," Groovy Guy makes otherwise dull pic watchable\n"]}