{"review-url":["http://www.imdb.com/title/tt0387714/reviews"],"review-text":["\nI think \"All Grown Up\" was a creative idea, taking the \"Rugrats\" show in\na\nnew direction, making them all 10 years older.  It was interesting to see\nhow all the characters evolved.Even though the guys are all had some personality changes, they're all\npretty much the same as they always were and still friends.The only downside is everyone (with the exception of Dil and Phil) is\ntrying\ntoo hard to fit in, like most preteen/teen show.  I would have liked to\nsee\nmore of them trying to go after their aspirations and pursue more hobbies\nor\nsomething, rather than trying really hard to make people like\nthem.Overall this was a good effort and had some funny material.","Many people seem to be comparing this show to the original series, \"The Rugrats\". But this was not the reason why this show was created. It was created because the premiere of the special, \"All Growed Up\", was the highest rated premiere in Nickelodeon history. Some say that its bad because of the way its written. But it can't be bad, because none of the stories were taken from the original series, or any other shows. All of the stories are original. The show started in November, and they already started showing second season shows in June. In fact, Nickelodeon has ordered 22 new episodes, along with \"Jimmy Neutron\", \"Fairly Oddparents\", and \"ChalkZone\". More people can relate to the All Grown Up characters, so kids have more interest in it. Plus, now Dil serves a purpose and they can now communicate with their parents. Nothing is wrong with this show.","This is a show about teenager-wannabees that are 10 years old. The first few episodes of this were all right and they were doing well with Nickelodeon and I enjoyed them, but the new ones have easily-solved plots and spastic drama from (guess who) Angelica and Susie. My little sister watches this and I can see her sometimes getting ticked off because of the stupid lines of the characters. I'm trying to make this show bad and I'm also trying to make a persuasive argument. I could relate this to Fairly Oddparents, which also has easy-to-solve plots and sappy lines. Nickelodeon is going down the tubes and if 3-year-olds are watching it daily, don't be surprised if they start blurting out phrases like, \"Whatever!\" and, \"So yesterday, galfriend!\" I admit that I'm exaggerating this show, but with the previous sappy shows of Nickelodeon backing me up, my point is pretty clear.","I'm a fan of the original rugrats, when All Grown Up came I was very excited, I think it's a nice show, but it isn't exactly what I was expecting from a rugrats spin-off.The only bad side of this show is that the show killed the rugrats, Tommy isn't the leader anymore , at the beginning he was supposed to be an artist and later he was just randomly obsessed with girls, Susie just thinks on singing and college, Angelica became just a generic boring teenager, Chuckie from being a nice and caring baby became a self-centered person who is always complaining of how bad is life for him, Kimi gotta be the worst of all of them, she doesn't have a personality not even a trait to set her apart from the other rugrats, she's portrayed as a selfish, spoiled girl who seems to think that the world revolves around her, by far the most horrible character in the entire series, At the end we have Dil that unlike his countpart on rugrats, he has evoluted to become the best character in this show, portrayed as the weird, nice,smart ,caring kid who is always willing to help and trying new things other people wouldn't do,always ready for the action, and that challenging attitude of not caring what other people think of him.I think it's a good show, but I wish it would have to deal less with teenage issues and more kid related issues, if this wasn't a rugrats spin-off it'd be a very good show, but with rugrats in its past, people expect more from it.","\"Rugrats All Grown Up\" is a good show. I loved Rugrats and when I saw commercials for All Grown Up I got really excited. \"Rugrats\" was going downhill and it needed a change. I thought it would be cool to see the Rugrat gang 10 years later. All of the characters have matured in their own way. Tommy is still the leader of the group and still looking out for the others. Lil has become more of a girl and more independent from Phil. Phil is still gross but in a more mature way. Dil now talks and is always watching out for Tommy. Angelica isn't as mean as she was in Rugrats. Chuckie is always looking out for Kimi and giving good advice to Tommy. Kimi is always helping the others. And Susie is still a great friend to all of them, especially Angelica. I also love the theme song, it is very catchy.All Grown Up has many good episodes. My favorites are: \"Coup DeVille\", \"Brother, Can You Spare the Time?\", \"Saving Cynthia\", and \"Truth or Consequences\". My favorite characters are still Angelica, Phil, and Lil. Overall this is a really good show and I hope it lasts as long as Rugrats did. I give this show 10/10 stars.","It is almost inevitable that when something good and entertaining is made in the entertainment biz, there's something that is made after it that serves some relation to it, but is a piece of garbage. Sadly, a great and entertaining show like Rugrats has suffered from this. I'm pretty old for Rugrats, but regardless of age, the show was still Nickelodeon's best animated show, and is definitely one of TV's greatest animated achievements. What has disgraced Rugrats? The spin-off piece of garbage that is `All Grown Up.' \n   All Grown Up has the same characters from the original Rugrats, but they are all grown up now, and in school. That right there already ruins the entire main idea of Rugrats. Rugrats was such a significant show because it depicted life through the eyes of toddlers, and every week would show the `adventures' they go on. That's what made it so original, the fact that they were babies, but now that they're all older, it isn't original anymore. It's just like all those other ridiculously awful shows on Nickelodeon.What's even worse about the show is that all the characters now have all these problems involving popularity and all that other garbage, and again, that is something that furthers this travesty from the original Rugrats.\n    The animation in this isn't distinct like the original Rugrats. Instead, the backgrounds (buildings, houses) all look too generic and plain. The color and look of everything from characters to exteriors is too light, and worst of all, the drawings look too perfect, and really have no significance whatsoever. The original show's animation wasn't the best, but that was the beauty of it. The animation wasn't the best ever, and it looks like it was done that way on purpose. Back then, the characters and backgrounds look like they were actually hand drawn by people, and they weren't so plain.    I simply cant stand this vile. The fact that it's predecessor was RUGRATS, a great show, is ridiculous. If you want to make an animated show that displays problems in the lives of kids in school, call it something else, just don't relate it to Rugrats. Sitting through this, to put it best, is a rigorous task. It'll most likely last a looong time, seeing as how kids probably watch it.Overall score: ½ out of 10.","I learned about these series quite recently.I was a Rugrats fan from a younger age and when I discovered there was a spin-off of the characters,I was really excited to watch it.Firstly,I watched the TV movie/episode of Rugrats \"All Growed Up\".It was a nice episode.Angelica was chasing the babies for taking her karaoke machine and finally they got in a closet,trying to hold the door from opening by Angelica.Then (I don't understand how exactly) the babies decided to go to the future and they did it by putting some kind of headphones to a ball.(?)Everyone is still the same thing only a bit different to their way of treating (one good example is that Chuckie is not afraid that much anymore).Then after a few incidents (and a nice and emotional video slide show of their baby years and adventures),they get back to the present knowing how they will look at the future and how will Angelica treat them then.(Oh,yes,Angelica WILL treat them a bit well!)This episode was really interesting and maybe one of my favorites,though I've read and heard that many Rugrats fans didn't like it,because it destroyed their imagination of how the babies will be in the future,the same they believe for the series Rugrats:All Grown Up!,that it destroyed the original one.Then I watched some episodes from the series and I was quite satisfied by them.They were nice,funny and at the end (as in the Rugrats) there was always a life lesson,through the preteens' life and adventures.I find it very enjoyable and it's certainly is a good show for children and preteens and -who knows?-teens and adults will love it too!9 stars out of 10 is the best I can put,it wasn't the most excellent ever,but it is surely a nice and hard-worked series!","I never saw the original special that started it all. I think it would've been better had this series not been made.Every episode I've seen stresses too heavy on the morals. Well it's a kid show, I suppose that's normal. But everything is recycled, and the main antagonists are those so-called cool kids that are nothing but assholes. \"We say it's cool.\" That is so retarded! And that episode where Kimmy doesn't find out until she's like 12 or something that she's Japanese and wants to be more Japanese: #1 I don't think kids are that stupid and would know what ethnicity they are before they get too old #2 The moral of the episode seems to discourage having an interest in one's own true culture which really upsets me.There's a desperate cry for work on writing and characters. Among all things Dil is a FULL clone copy of Carl from \"As Told By Ginger\" another unoriginal show, while the rest of the cast only bear some similarities to other characters in personality.I'm not some freak who thought that this series was a bad idea from the start. I had hopes for it, but when I realized while watching how much of it has been done to death, I was outraged.The show lacks fantasy and wonder which was what makes The Rugrats special, nothing like its spin off at all.","This is far from being \"Rugrats: The Next Generation.\"  Instead, you can see palpable changes in the characters of the show from the baby-oriented original series to this one.The plot lines have some refreshing changes in them. Coming along for the ride is a new Vice-Principal who was an ex-professional wrestler.  He takes a keen interest in Dil, who is the breakout star of this show.  In one episode, he counsels Dil (Wisely!) when the other kids use his genius for their profit.Dil is the weird one who does weird things, but inside that brain is a true genius.  Also amazing is the transformation of Tommy from fearless leader-baby to more a member of the group, complete with insecurities. Angelica is different too.  She's softer and less bossy, but still a schemer.  Her lispy friend Harold is a nice foil for her antics.This is completely kid-safe.  It's also fun for adults, too.  Perhaps it's not in the same league as Spongebob, but it is great fun!So on my 1-10 scale, I give it an 8.J","It tires to hard to reach out to teens with its unrealistic story board. I mean if rug rats was bad enough their teenager stage is more annoying if that was even possible. Think would a teenager today dress-up and pretend to be some foreigner or would anyone even think or acting like angelica. i mean its just not realistic.I don't get why oh why nickelodeon did this to us buy making it but i will never forgive them.Basically this show was just a gimmick to get people to watch. Nickelodeon should have just sticked with its good shows invader Zim or Ren and Stimpy. If you would like to watch it go ahead but be warned you wouldn't like it.","I like this show. It may seem dorky at first, but it actually makes a life for the so called RUGRATS.The show makes me happy, and makes me enjoy my teen life more! But my only flaw is that they are starting to use the dorky and annoying Rugrats music (1997-2001) that annoyed me after all these years. Otherwise the show makes me comfortable.I recommend that everyone watch this show. Teens Mostly!The show though gets annoying after a while with Angelica, who I hate!The show alternates from one teen having a problem, to another being weird.Hey, it's a typical Klasky/Csuopo cartoon with the animation and feel of most of their show which are excellent.The show is GREAT.Rugrats: 9.5/10 All Grown Up: 9.8/10","For starters I love The Rugrats. True they jumped the shark in the later seasons but I found the weaker episodes still watchable, and I love the show as a whole. I didn't like the idea of All Grown Up, but I decided to give it a chance. The show does have its moments, but in my opinion this is not a good show at all. I will give credit, it is not as bad as ChalkZone(Nickelodean's worst) or Rocket Power, but it is very lacking in I think originality and charm.The good things are that the animation is nice and colourful, and the voice acting is very solid.However, I cannot stand the theme song, it is so uninspired, while the writing is often unfunny and the story lines predictable and all-too-familiar. I don't like the characters as much either, Tommy and Chuckie are fine, but I personally found Dil cuter when he was a baby(and to be honest that was when Rugrats jumped the shark I think) and Anjelica has lost her charm and is bratty to the point I cannot tolerate her.Overall, disappointing. Not the worst show on Nickelodean, but it is far from the best. 4/10 Bethany Cox","The storylines aren't bad, the characters are unique in their own way, and the animation is solid.  This new show would have deserved a higher rating - if I hadn't seen it about a million times before.I believe that this incarnation completes the metamorphosis of a droll, avant-garde Nickelodeon children's show that explored the psychology and socialization of infants to just another cookie-cutter pre-teen show for the Brittney Spears generation.  I would be interested in seeing the types of topics they covered that hasn't already been done in \"Doug\", \"As Told By Ginger\" and any other show that involves home, school and friends.Basically, this is a show that's would be most enjoyed by \"Rugrats\" fans. I'll admit that it's fun to see how the characters in the older show turned out, although one would be wont for surprises.  Chuckie is still as insecure as he ever was, which goes well with the awkward geek stereotype he turns out to be.  Angelica has toned down the \"brat\" side to her personality and has slipped comfortably in her role as an alpha girl seeking popularity and influence.Tommy resumes his role as the unofficial leader and consensus builder of the gang while Susie is the sunny one.  One of the few pleasant surprises is Dil, who turned out to be even weirder than we use to give him credit for. While Phil continues to be a goof-off, Lil is in the process of finding her own identity apart from being the female counterpart to Phil.\nThe parents haven't seemed to change a bit, they still have that ambience of cluelessness around them which would make for some funny moments when the more sophisticated kids confront them.All of this won't matter, however, to those that have been living under a rock for the past dozen years or so and don't know who the \"Rugrats\" are.\nThe main rule of making sequels is to not just redo - reinvent.Unfortunately, I don't see much creative investment in this \"Rugrats\" spin-off other than making the characters ten years older.** out of **** stars.","I think you guys who are giving bad reviews are being unfair. All Grown Up is a great show, I'm not denying that Rugrats will always be better with it's (in my opinion) unique style of humor that both kids and adults can enjoy. I find it enjoyable to see how the 'rats have grown and changed. If your looking for more misunderstanding between kids and adults type humor that was so common in The Rugrats, then go elsewhere. If your more interested in seeing the kids growing and how relationships between some of them have changed, as well as another 'growing-pains' \"tweenage\" show. Then watch this, you won't beat it.I'd give it a 3+1/5 out of 5","Wow, so they're all grown up and in their preteens. Hmm... for some reason this show lacks the innocence that the old shows had. In the old days shows would always start with things being seen through the eyes of a kid, in fact that was pretty much the whole premise of the show - kids trying to figure out and understand the world around them. The adventures they had then weren't really special but the perspective was interesting.Not so with this show, everybody's been a preteen at some point in their life and so there really is nothing out of the ordinary to expect. It's all been done before through other shows like Recess, Doug and so forth. Just name a theme and it's already been done, if not better by other shows.Speaking of the characters, they really haven't changed at all, instead they've evolved into the more stereotypical characters you'd expect at that age. There's more bitching, moaning and squealing over the dumbest things in life and the parents are dumber than ever. The storylines are predictable at best but one thing does remain is that the acting talent is still there.In conclusion this show is crap, so don't bother seeing it. You're better off doing something else","The original series of Rugrats was pretty good. This is an effort to show what happens when the children get older and go to school. And it isn't too bad. The characters all have new personalities that have changed and been elaborated upon during the years between this and the original. I actually think this is an alright series. The interesting question as to how the characters would change was answered abruptly at the beginning, no suspense or anything, which was nice. This is an interesting portrayal, and gives the universe (shared by the W Thornberries) an extra bit of canonicity to work with. Certainly not a bad show.","ALL GROWN UP is basically a spin off and not much else of the original Nickalodeon RUGRATS cartoon that featured the babies Tommy Pickles, Chucky Finster, Lil and Phil DeVille, Angelica, Susie and (later) Kimi (Chuckies sister) and Dill (Tommy's brother). I grew up with RUGRATS and thought it was a great cartoon. It had excellent humor, nice stories and the show's creators, Klasky & Csupo, were obviously very original and creative with the concept of the adventures of babies. The new show ALL GROWN UP tries to recapture the magic of the original cartoon. I was disappointed when I saw it. I found the \"all-grown-up\" Chuckie just annoying and the whole \"pre-teen-acting-mature/trying-to-be-popular\" that applied to (unfortunately) *all* of the characters dull and washed out. There still are some funny scenes and jokes in the new series and it was interesting how the artists would make the whole baby gang of RUGRATS look ten years from their age in the original show. Overall, this show is 'fair' and only watchable if a) you're a die-hard fan of the RUGRATS, b) have never seen the original show, c) you're a pre-teen that has nothing to do, or d) your so bored that your somehow forced to see this show. This show is not that good. It doesn't compare to the older RUGRATS episodes in quality, humor, and everything else.","This show has done a good job of replacing the Rugrats. They can develop better than Rugrats. Dil is weird, (he did get bonked in the head by Lillian Marie Jane and Phil Deville) Each character has a different personality which helps use a Tom Brady spread show type of PreTeens. Stu is clumsy, Didi worries too much, Did Lulu die? Grandpa Lou has yet to get his part, Tommy, the film maker, co-leader, Dil, the weird boy with the brains to get out of a bases loaded jam type situation, Betty, still tough...she pulled a school bus out. Howard, funny, and OLD, Phil, still gross, he still needs to develop more, Lil trying to gain respect for popularity, Chaz, the clumsy Java Lava worker, Kira...unknown, Chuckie, the geeky daredevil, with a girlfriend, Kimi, gaining independence with her Japanese group, Angelica... still bossy, but softer when gaining independence, Drew, unknown, Charlotte, Struggling with her face. Susie, loves to sing. It needs time to gain towards other NICK shows, might catch SpongeBob in about 4 years, like a rookie in football, or basketball (Lebron James), (Carmelo Anthony). Ages: Stu: 44 Didi: 49 Tommy: 10 Dil: 9 1/2 Chazz: 45 Kira: 43 Kimi: 10 1/2 Chuckie: 11 3/4 (to turn 12) Betty: 47 Howard: 60 Phil: 10 1/2 Lil: 10 1/2 Susie: 12 (to turn 13) Angelica: 12 (to turn 13) Charlotte: 41 Drew: 45 Lulu: 86 Lou: 86 Miriam: 88 I like the idea of Dil getting his ego with Pangborn, and Chuckie risking himself. And how about punches when Tommy embarrassed his friends.","I've already seen spin-offs of cartoons such as The Flintstones, Scooby Doo, Tom and Jerry and Looney Tunes and most of them are great.When I saw the All Grown Up pilot in 2001, I thought it was interesting to see how the Rugrats would look in their pre-teens/teens and it contained things that would usually happen during that time of life such as going to a concert, going to school and being grounded.The actual TV show is better because the Rugrats seem to wear different clothes in each episode and Angelica doesn't get punished as much as she did in the original Rugrats series. Tommy and Susie get punished in this series.I've also noticed references to Rugrats in this show and even flashbacks of how the Rugrats looked in the original series. They actually talk to the adults in this show because they're 10 years older.This show is aimed at a slightly older audience than the original Rugrats. Viewers of the original show may like this.","What does \"The Rugrats\", \"Beavis and Butthead\", \"All in the Family\" and some of the \"Cartoon-Cartoon\" shows on Cartoon Network have in common? Well, they started out as good shows, but later went downhill and eventually, came out with lame @$$ spin-offs. You think most people would learn from all of this, but there are some that don't.AGU is basically a typical Teeny-Bopping show for the \"Brittney Spears\", \"Cristina Agulera\", \"Jessica Simpson\" and the \"Boy Band\" generation, only difference is that they have Rugrat characters in there as stereotypical pre-teens. This is just a travesty to a once good cartoon.Don't be fooled fans of Rugrats! This is basically a teeny bopper show disguised as Rugrats francise.","All Grown Up is much better than people claim. Heck, I can't decide if I like AGU or Rugrats more. And to those who complain about the former Rugrats trying to fit in; It's actually normal for that to happen.Personally, my favorite character is Chuckie Finster. To me, he's more relatable than all of the other characters put together. \"My stomach, my butt, in a unitard?!\" \"I can feel it. It starts in my feet, and...\" \"I've always said the key to happiness is... lowered expectations.\" \"I can't fight the man. I can't even get my jacket closed.\" Those are only a few relatable quotes by Chuckie alone, but I'm sure those are enough to prove my point.My favorite episodes have to be \"Project Chuckie\", \"Wouldn't It Be Nice?\", and \"The Finster Who Stole Christmas.\" The first one shows that popularity isn't everything, and Chuckie decides to stay a dork. Plus, it briefly showed him as a Rugrat! X3 The second one shows that homosexual pairings are perfectly normal, even though the marriages weren't real. Plus it shows that there can be too much of a good thing, what with Harold and Harriet. Also, it shows to not judge a book by its cover, with Chuckie and Fridge. The third one has the classic lesson \"Appreciate the small things in life.\" Also, who doesn't love an episode centered on their favorite character?So overall, I feel like All Grown Up is a wonderful, yet underrated cartoon and I wish reruns were on again in the mornings, when people are actually awake.","This show was released in 2003 so it was near the era when Nickelodeon rocked and still aired good shows, \"All Grown Up!\" is definitely one of them.The show focuses on the main characters from the original Rugrats series 10 years older and this was a pretty interesting idea, seeing them out of the pen and into the world where they tackle tougher problems.The characters are pretty much the same as they were in Rugrats except older. Tommy who's the leader of the group and still looks out for the others, Chuckie who's a risk taker and does look out for Kimi, being a responsible step-brother plus he does give Tommy good advice, Phil and Lil who are more independent from each other but are still caring siblings, Susie who pursues a career in singing and focuses on her future in college but still a great friend, Angelica is much nicer in this series where at 3 years of age she was hell spawn, but now she's a lot more tolerable in this series, Kimi who likes to help others and of course Dil, Tommy's younger brother who's definitely my favorite character from the show. He has a much bigger role in this series which I'm really glad to see. He is weird but nice, smart, caring, isn't afraid of trying new things and doesn't care about what other people think of him.The episodes themselves are pretty compelling, I really liked \"Coup DeVille\", \"Lucky 13\", \"O Bro, Where Art Thou?\", \"All Broke Up\" and especially the longer episodes like \"R.V. Having Fun Yet?\" and \"Dude, Where's My Horse?\" which almost felt like full length movies than regular episodes. In some of the episodes themselves, I like the fact that they discuss more grown up and tougher hardships like going through a break-up or being framed by a con artist. This show was presumably for the people that grew up with Rugrats so they would be able to tackle these kinds of problems at a certain age.The animation is very good, the voice acting is solid, the episodes are enjoyable and some of the lines are pretty funny. Overall, a great spin-off to a great show and I would recommend it to anyone whether you're a Rugrats fan or not.","As good as \"The Rugrats\" were in their heyday (1991-4), it's almost painful for me to contemplate how terrible they've become since the first movie in '98.  I absolutely reviled the original \"All Growed Up\" special, for it sucked.  Though the idea of seeing the 'Rats as teenagers for one episode might be kinda neat (to seem people), I think that making them tweeners for a whole series (and one that seems to have at least some base of popularity, since it has yet to be cancelled) is REALLY stretching it.  It's bad enough that this show took a lame idea and stretched it out beyond all reason, but that could be overcome, if this show was written with some degree of wit and originality.  But it isn't.  This is the usual Klasky-Csupo, unfunny, lowest-common-six-year-old-denominator garbage, at best a fifth-rate rip off of \"As Told By Ginger\" (which I dislike but isn't completely terrible, contrary to my review of that show).  The plotlines have been recycled from the cliche bin of virtually every kid's television show ever made.  There are plotlines about a career aptitude test (everyone from \"The Simpsons\" to \"Hey Arnold!\" have done that one) to Kimmi hanging out with a \"bad boy\" (name one kid's show that doesn't involve a similar plotline) to Susie being ripped off by a supposed talent agent (the most recent show to do that was \"Everybody Loves Raymond\", but I seem to recall it occurring in a number of other shows as well).  So obviously, this show wreaks of originality.The characterization is even worse, with the usual cliche teenage characters, mixed in with some truly out there characterizations.  Angelica is really the only survivor; she's as bossy and egotistical as she's ever been, but at age 12/13 she somehow seems less entertaining than when she was 3 years old.  Susie's pretty close to what she once was, too, but she was never more than a marginal character, so that's kinda irrelevant.  Tommy is now a dumba** would-be avant-garde filmmaker (remember his \"brilliant\" movies about sneezing and dirty laundry?), without much other characterization.  Chuckie's very geeky (though he's somewhat more rebellious), as to be expected, but thanks to the \"ingenious\" casting of Nancy Cartwright to replace Christine Cavanaugh, Chuckie sounds more than ever like Bart Simpson with a head cold.  Kimmi isn't exactly a particularly enlightening character either.  Dil is a weirdo who believes in UFOs or some garbage like that, and Phil and Lil are pretty much typical popular kids. And the parents now are virtually non-existent caricatures of their former selves.So: is \"All Grown Up\" a p***-poor spin-off of an increasingly turgid franchise, or simply an average teen show with familiar characters? Actually, it's both.  I've watched three eps of this show, and they've made me not want to watch any more.  And the theme music is absolutely gut-wrenching as well.No stars. I'd rather watch post-Dil, even post-Kimmi \"Rugrats\" (shudder) than this filth.","I'm a big fan of the original Rugrats and this show is also great. I really liked the \"All Growed Up\" special from the original show and I liked the idea of the babies becoming teenagers. The characters haven't really changed that much since \"Rugrats\", except with a few additions like Tommy (who's still the leader of the group) wanting to be a movie director which I guess is a career he's decided on, but I guess he's had 10 years to think about it. Angelica is definitely nicer than she was in \"Rugrats\" and I honestly like her better that way, she's much more tolerable and it's a breath of fresh air to see her do more nice things. Phil and Lil are also pretty entertaining and have some good episodes centered on them. Dil of course is my favorite character and I think we can all agree that he's the best character from the show! He's weird, yes, but that's what makes him so unique from the rest of the characters, he's the most entertaining of the lot but most importantly: He actually has a purpose in the show! Where in the original show as a baby he didn't really participate much and that's one of the reasons why I like this show as he's actually involved in the episodes. The episodes themselves are pretty compelling, they're more teenager oriented which is suitable for the target audience and it does have some good morals. The animation looks great and the backgrounds are very well done. Overall, this is an excellent spin- off that doesn't disappoint!"],"review-user":["penguin805","darcyhuff3","theguys1","rita_ritzuki","Ginger87","Lando_Hass","marouski","aleusong","johntam","peacegrl","lorrimonacelli","TheLittleSongbird","Nicholai","rcoopland","bigben5","atomius","I_Am_The_Resurrection","Sportswhizz2004","Stompgal_87","Angel_Meiru","elena1997","hscott-44461","Hancock_the_Superb","wilsonworks"],"review-date":["7 December 2003","9 July 2004","13 July 2005","20 April 2006","14 December 2004","6 January 2004","7 September 2011","31 January 2005","31 December 2003","22 February 2005","3 September 2005","8 August 2010","4 December 2003","18 October 2004","26 December 2003","11 July 2007","27 July 2005","12 July 2004","4 August 2006","8 February 2004","10 September 2016","2 June 2016","18 August 2004","19 September 2016"],"review-rating":["10","4","6","3","8","10","10","10"],"review-title":[" Worthy effort overall on a creative idea\n"," Great show\n"," worse than juniper lee\n"," It's a nice show\n"," Fun To Watch!\n"," HATE IT...\n"," A nice spin-off of Rugrats!\n"," Too heavy on morals, Too light on originality\n"," Very Refreshing for a Sequel...\n"," 2 thumbs down\n"," Great Show\n"," Disappointing\n"," Been There, Done That\n"," Unfair\n"," Lame\n"," the babies 'grow up'\n"," OK, But There is No Comparison...\n"," Better Dynasty than Shaq and Kobe\n"," One of my favourite cartoon spin-offs\n"," Some things should not be made into spin-offs.\n"," Wonderful, Underrated 'Toon!\n"," An awesome show\n"," A truly original, enlightening, witty show that makes Aaron Sorkin look like a hack! ;)\n"," Love it!\n"]}