{"review-url":["http://www.imdb.com/title/tt0363307/reviews"],"review-text":["Oh, how I miss the days of Nigel, Mr. Jay, and Miss Jay! I respected the opinions and judgments of those guys. These days, it seems that the show is less about fashion and more about fads. And I'm sorry, but I find Kelly Cutrone a frumpy, grumpy, lump, while Johnny Wujek just needs to take off those stupid hats and dress like a grown-up! I am willing to live with the in-house dramas (and flirtations, in this season) because I find the fashion shoots interesting; I'm not sure I'm willing to put up with the social media hype and the unimpressive \"experts\" on top of that. This will be my last season of being an ANTM fan—unless most of the cast is fired and the old crew brought back.","It's one of those shows that you either absolutely hate or you absolutely love.If you chose to see it as a bunch of stupid, beautiful girls competing through make up and runway tests, then yes, you will be disappointed. But it is called America's Next Top Model, did you think they would be competing for who could eat the most worms under a minute?ORYou can see that some (to be used very strongly) have genuine personalities. Like in any reality show, you get attached to the people, this show is no exception. Elyse, Adrianne, Shannon (and G-d help me) Robyn' personalities made me come back every week. It was a fun show to relax to over the summer for an hour a week.","This show is my guilty pleasure all the way!! When I first tuned in to America's Next Top Model, I expected to be bored, and to find it very very stupid. I didn't. This show is actually serious fun. I read on one of the other reviews that it makes you wonder if you have what it takes to be America's Next top model. And it so does! Who doesn't love the glamour and excitement that come with being a model? On ANTM you get to see what it's REALLY like. And who doesn't love hearing the girls bitch about each other and get into fights? Or enjoy wanting to throw something at that Janice lady?Give this a chance. Don't expect something intelligent or a show you can look to for a life lesson. Just enjoy it for what it is. Serious fun!","Who could have ever foreseen that this show would last for more than 20 seasons. I think that singular fact proves how many people out there are closet ANTM fans. There is no need to be ashamed because the truth is that it is a fantastic show. How many little girls (and boys) grew up seeing images of beautiful people in magazines and on TV and wanted to be just like them when they grew up. Hell many of us still do that now. ANTM lets you live out this dream and see what it really takes to be a supermodel. The crazy fashion industry people, long photo shoot days, hair & makeup to the extreme, a lot of mirror & runway practice and the continual criticism. It kind of puts it into perspective and makes you realise that modelling is a tough job.As the seasons have progressed we have experienced many changes in the judging panel as well as celebrity guests. None has been as controversial though as the loss of Nigel Barker, Mr. Jay Manual, and Miss Jay. Initially when it happened I was shocked and bitterly disappointed. I thought the new panel were hacks and thought the show would never be as good. Turns out the success really has nothing to do with the panel but has everything to do with the drama created by the contestants and the amazing photo shoots they do. Even Kelly Cutrone has grown on me after first thinking she was one of the most disgusting people on the planet. I do still think that she is bitter that she never was able to be a model.America's Next Top Model is my guilty pleasure show that I refuse to feel guilty for. I will continue to watch it until the day it goes off the air just like many other people around the world. It may not be an intellectually superior show but it does entertain you.","Alright, anyone with a brain could tell that this show is a little unfair. Who is picked and who is sent home is so contrived; everyone can see straight through it. It really is too bad a lot of them are in denial. Anyway, let's go through a typical season, or cycle, I should say, because Tyra has to be menstrual.(I stole that from someone funny.) The first episode generally starts a clip show with a Tyra-logue about modeling. How far she made me, how she struggled, how she is(or was, depending on who you favor) #1. Then we go through 30-something young girls who get flown in to some city for an in-person interview of sorts so Tyra can get a glimpse of their TV personalities and hear sob stories. The Tyra makes a series of cuts to get down to the top 10, 12, 13, or 14 contestants.Almost all the episodes after that generally go like this: we open with the b*tches, I mean \"aspiring models\" in Tyra's ego-house. There's fighting, there's laughing, there's the focus(usually) on the girl who is going to be ceremoniously sacked by the end of the episode.The girl's are then sent to a few things, sometimes in a different order. The first is usually some sort of contest to depict who can do the best at something stupid. Blah, blah, blah. Then comes the photo shoot. The photo shoots are generally the second best thing in the show, second only to the pictures that are shown during panel.Of course, there are usually some episodes throughout the season/cycle that break the robotedness. The first is always the make-over episode, generally 3 or 4 episodes in. Everyone gets a dramatically awesome hair make-over(or not, in a lot of cases) and there's always some menstrual case whining(except for cycle 8, where when no one whined enough, they had to take out Jael's cute extensions just to really irritate).And then there's the episode where the girls do an acting session and star in a commercial or something of the like. And sometimes we get a clip show where no one is eliminated and nothing is all that interesting. And of course, there's always the episode where the girls get sent to a foreign fashion capitol(and apparently, any big city in the world is a fashion capitol to Ty-Ty) and someone gets sent home without being there for 24 hours.Then the final episode shakes it up a bit. Because there are only 3 contestants left, we must suffer two eliminations where Tyra reminds us what the winner gets. And it's always the same thing. A modeling contract and a magazine spread(It was with \"Elle Magazine\" the first few cycles, but I think when they realized this show didn't turn out any actual TOP models TyTy's winner's got dropped to \"Seventeen Magazine\".) So yeah, they usually do a CoverGirl shoot to pick the final two and then do a fashion show... before evaluating both finalists and usually picking (in my opinion except for Cycles 1 and 7) the worst of the duo.In all honesty, this show doesn't really turn out what you could call Big Winners, but it's entertaining when you need a guilty pleasure amount of trash in your week. Enjoy.","Pack your bags UPN! you may get out of last place in ratings with this new reality tv show of yours.  Showing the real difficulty behind modeling is an educating, not to mention sweet eye candy, experience.  Having only seen a few episodes and listening to the general buzz about the show, Top model is definitely succeeding in drawing an audience.  Then again, reality tv is not for everybody and if that is the case, this isn't your cup of tea. Feminist's may have problems with it due to its promotion of an ideal image of women.  Luckily, by having a female host, Tyra banks, and many of the nit picking judges and fashion designers depicted with a strong focus on their respective areas of expertise rather than simply the models measurements, most feminist issues are diverted away.  Watch the show, it will get you hooked and GO Elyse Sewell!! my choice for America's next top model.","America's Next Top Model is reality television without pretensions. Or, rather, it's a reality television show with pretensions that are so obvious, they're impossible to hide. It's a show about being shallow, daring, energetic, humble, and, of course, absolutely gorgeous. Led by Tyra Banks and a variety of photographers, stylists, acting coaches, directors, designers, and EX-ex-models, ANTM will go to all kinds of lengths to grab your attention. From four blonde beauties doing a high-fashion shoot in Venice to soap-opera style acting classes with Taye Diggs, to old-fashioned nudity and sex (on- and off-camera), every season, every episode, will grab your attention. It's not quality television, but it's fun and addictive and all over the place. Don't invest money in the original series of Bankable Productions, but if you've got a free minute, check it out on VH1. They might have a marathon on. And - who knows? It might be that episode with the wet t-shirt pillow fight.","Tyra Banks needs to teach these girls that it's not all about being beautiful on the outside. The inside counts for something too. A lot of the past winners have looked semi decent but are horribly cruel and starting trouble for the other girls. I see Tyra less involved with the girls in every season. About the only thing worth watching Top Model for is Mr. Jay Manuel. Recently, Tyra had a contestant who was a pre-op transsexual. I felt that she should have done more to encourage her. It was obvious that she had insecurities about her original anatomy showing through her feminine look. Tyra should have given her tips or perhaps she could have sent resident Trannie Ms. Jay to help the girl out. Instead, the contestant was met with harsh criticism and not enough positive criticism. It's a shame because I truly enjoyed the first 3 seasons. There's a reason why Project Runway has all 4 seasons out on DVD and Top Model only has 1 season on DVD. It's called taste. Top Model seriously needs a lot of revamping an some more humanity.","I watched the first episode of Next Top Model, for one thing no Tyra. Second they forced girls to change their hair whether they liked it or not. They forced a redhead to have redder hair even tho her hair was striking already then they fired her the same day. Also a black girl didn't want to look masculine and they made her appear very male. That was tasteless, forced and also for ratings. What is your motto? Make them go further than they want till they cry? WTH?So very disgusted with that aspect not to mention the nudity. They made all the models pose nude on television. I imagine if one didn't want to do it they would have been sent home so they're under a lot of pressure to comply.I won't ever watch this stupid show again. How many girls on that show are under 21 and photographed naked? That can ruin a person for life. I don't care what your stupid excuses are. It's for ratings & the almighty DOLLAR. It's not art. It's a disgusting display for your ratings and it should be stopped. Gratuitous nudity is UNCALLED for. Poor girls I feel bad for them being FORCED to be photographed naked. Bad call. Never watch again.","This is by far the most vapid, idiotic, insanely stupid show that has EVER been on the air, and this is coming from someone who remembers \"San Pedro Beach Bums\".My wife loves watching reality shows--and there was one episode of this drivel where the wannabes had to develop a \"walk\". The end result was straight out of Monty Python's \"Ministry of Silly Walks\" sketch. I couldn't laugh hard enough.And then there's the ubiquitous Ms. Banks (as in laughing all the way to the...). She has to be the most annoying self-important woman on TV since Rosie O'Donnell left \"The View\". As if modeling was doing great things for mankind. Please. I've never found her attractive, and I don't find her intelligent now that she has the temerity to open her mouth.Someone needs to tell these human clothes hangers to eat a healthy diet and actually look like real women.","America's Next Top Model is a great reality show in every sense. It has a great hostess, has great guests, a great production and some of the best professionals of the modeling world contributing for something they hadn't achieved yet: present a true America's Next Top Model. Of course this is not something easy to do, therefore USA and the world already would have 10 top models concurring and fighting between themselves in this cruel world.But it's obvious that its intention is not to present the America's next top model, but yes, the America's Next Pop Model. The show gets together a bunch of models without any experience with different personalities and big personal, professional and financial problems, giving them a chance for bringing to life a dream or to make their lives something worthy. It's obvious that Tyra Banks uses all that for her advantage, she gives the dream, but in exchange for that she gains audience and more popularity. Anyway, she deserves it, because she is intelligent and, if I might say that, a pioneer to this kind of show. Tyra also is a great observer and knows how to give based opinions, differing herself of other models and hostess of foreign versions of the NEXT TOP MODEL franchise. In Brazil, as an example, Fernanda Motta is its hostess and \"once-upon-a-time\"-Top Model. She doesn't have even 1/10 of Tyra's professional skills, which keeps Tyra Banks on the top. Tyra have professional and personal knowledge about what she says and she's a great mentor because she not only criticizes but she points the mistake and teaches the right way with wisdom.The show doesn't suffer from big problems, it does and fulfills what it promises during the cycles. The models chosen to work on the show in fact are not the best unknown models of entire country because Tyra Banks bets with the difference, and she is right, because she (and also good part of her audience) believes that it's time for the modeling world to change some straight parameters. During the cycles, she and her team really makes fair deliberations, where the weakest go away and the promising ones have new chances to prove their capacities but must be fast to do that, otherwise they lose it.Other very interesting thing is that Tyra also knows to decide who should or shouldn't win even when she's against people's opinion. She knows that whoever wins will be famous, but has a very few possibilities to truly be a worldwide recognized top model. At the same way she knows that, some times, the second place is more valuable than the first, because 1st place wins the title, but second doesn't gets the title stigma. Hardly she makes mistakes when she decides the future of any model during the show.After 9 cycles the show is getting a little tired with some old ideas, it's time for Tyra to change some things and lines because it's getting boring and comparing to the firsts cycles we can see that she's getting bored too, so she needs to do that if she wants the show to live a little longer.Anyway, the show explores the fashion and modeling world, but it's also entertaining for those ones that live outside all of that. It gives the opportunity for some girls and also the market, and also gives great tips for those ones from the audience who shares the same dream.","Yes, I watch this show. Because my girlfriend watches it, of course. Well, at least, that's what I tell my friends. But as nobody here ever known me, I can say this; I love it! That's excellent trash TV. First, there's the panel; Tyra herself, who doesn't miss a single opportunity to talk about herself, yet she is to be taken seriously, as she is quite the businesswoman. Then there's Jay Manuel, A sober gay guy, very serious and amazingly professional, and Miss Jay, an extroverted one, \"queen\" of the catwalk and a damn funny guy, and Nigel, self-styled as the only man on the panel.Second, the show is an in-depth look at a shallow industry, and we've got to give it to the producers for showing us the inside view, which can be informative as well as entertaining.Finally, the edition is great; there is just the right mix of everything; The girls living together in the ego-house, their impressions on sets, the competitions themselves and the judging. All of this slides smoothly with just the right beat. There are no lenghts.Of course, there must be other factors that led to eliminations that we don't see in the shows; The panel is made up of capricious divas, extroverted and quick on the bitching; woe to those who offends them! But that being said, as long as one contestant does not step on their toes, their judgment is usually fair - I think.So, give your brain a break; If you can't beat them, join them, and have a good time watching this bit of reality TV with your loved ones. It will make crave for more, somehow.","As if reality shows like \"American Idol\" weren't enough, in which judges like Simon Cowell shoot razor-sharp barbs to contestants trying to make their mark on the music world -- barbs that many a time has reduced even outstanding singers to tears after what was deemed a \"bad performance\", now \"America's Next Top Model\" has for the past three years invaded the boob tube with its own version of \"looking for the next big thing\" in a business that values superficiality, concepts of beauty, and body dysmorphia.A concept created by Tyra Banks, who is also a judge in the show, it gathers some fifteen contestants from all walks of life and has them submit themselves to innumerable \"tasks\" in which they must prove their \"talent\" in front of the camera and subject themselves not only to the now departed Janice Dickinson (self-dubbed \"American's First Supermodel\") but the equally catty Jay Manuel and Nore Marin who may at one point focus on one girl not performing well and blithely rip her to shreds like it was bad morning coffee. Like in many other reality-based shows, each week one contestant is voted off and must pack her bags and immediately leave (a thing that they are reminded by Tyra at every turn). Of course, there is the bitchy tension between several of the more type-A females, female bonding, tears, dramatic swells of music in key moments, and some truly breathtaking pictures that transform erstwhile ordinary, pretty girls into unattainable goddesses.I'll have to admit, the show is a guilty pleasure. Maybe it's the state of mind I'm in, but I kept wondering where the vomitorium was in cases when the already thin girls would need to hurl to make the cut and look the way the judges and photographers and many fickle designers would feel was correct for the moment. Even so, it's drawn me in despite my previous paragraph, possibly because I've always had an interest in the fashion world and have always loved watching stunning women being made even more unworldly with make up and perfect lighting. But I wonder where are they going with these increasingly difficult photo shoots. It's as if they were competing with \"Fear Factor\". Shoots that look like re-enactments of fight scenes in CROUCHING TIGER, HIDDEN DRAGON, shoots where the models have to pose underwater or in almost impossible situations, What's next: posing while tied to train tracks as an oncoming Amtrak roars upon them at 70 miles an hour? Or a shoot where they are underwater, chained, trying to set themselves free in record time while at the same time looking smashing in chiffon, and never, ever forgetting to smile their pearly whites at that camera? How about a \"Pit and the Pendulum\" version of a photo shoot?In one thing the show has to be given some kudos, and it's in a way akin to \"American Idol\". With this I'm probably going to justify the harshness of both shows, and its abrasive judges -- and essentially go against my initial paragraph. \"America's Next Top Model\" is a show that is an extended audition, like \"American Idol\", and in it the girls will get the sort of test treatment they will receive in the real world, where prospective designers and photographers, as monstrously fickle as they can be, will crush them to bits at the drop of a hat if they can't sell themselves the way they're expected to, and where one is asked to leave, another will supplant her with the necessary requirements. Which makes it a wonder that any girl would want to get into such a difficult media, but that's what dreams are made of.Going into its Fifth season it's been a major disappointment with the departure of Janice Dickinson; during her run she was a pretty tough barometer as to how the girls should walk, talk, emote, express themselves, and ultimately present themselves as a walking, living product that sells. With the cold addition of Twiggy I wonder where it will go from here -- Twiggy just can't replace the over-the-top temperament of Dickinson. So with Janice's absence the show has lost some of its edge and may even have signaled its slow demise, but in the meantime, it's still a catchy pleasure to watch, mindless entertainment on weeknights, if at all for the gorgeous visuals. If at all, it's the show that launched Adrienne Curry into the spotlight. Curry has made a name for herself due to facts that have less to do with modeling as much as her theatric love-affair with one time child actor Christopher Knight in their very own reality soap opera.","In watching this off and on for a few seasons, two things come to mind: One - wondering what kind of girl wants to be a \"model\" and two - run to the nearest ice cream store and have a low fat sundae.I tried to be a fan because I liked the idea of this reality show competition. No other \"famous\" model thought of this, and it is very admirable for Tyra Banks to do so. But as the series goes on and on I've come to the conclusion that this is a sorry lot of folks trying to make a mountain out of a molehill. Women shouldn't watch this, teens should stay clear of it unless they're doing book reports on the subject.Many women try out for slots to compete for \"Americas Next Top Model\". They live together, cat fight together, cry together, get put through pointless modeling shoots with pointless modeling people and fashionatas and get eliminated and almost all of them claim, \"You will see me again\". Heck, I'm trying to see what happened to the ones that DID win, actually.This is the dream of some girls, and good for them. In watching this I hope the other girls that see this and run like Hades the other way - like to college.I just happened to watch more of this recent season because of the \"ploy\" of full figured models joining the group. That even made me think more of this as a sorry lot of folks. The \"full figured models\" were no more than average sized ladies competing with what I think is the thinnest group of models they ever chose - so of course that would make them look even fatter - a \"ploy\" fashionatas use all the time. Bad, bad, Tyra and crew.But to be fair, \"Americas Next Top Model\" is not about \"full figured\" models, it's about projecting an imagined image a beauty that can be mass marketed and sold as the ultimate in beauty - and this show is just looking for the next fresh piece of meat to add to the mix. Hence the name of the show. Hence the sorry lot of judges, photographers, associations. Hence Tyra and her consistent \"this was me\" plugs every camera angle you can get. But then again, that IS the one thing I like about this show - the ex-model giving others who wouldn't have the chance -- a chance to enter the doors. But after that...everything else is status quo for that industry which is why there are no surprises or week to week interest in the program.","There will be two more seasons of America's Next Top Model. Right after the Cycle 5 reunion aired a commercial for Cycle 6 appeared. And if you download an application for a America's Next Top Model it says Cycle 7 and I really cant wait!!!!!!! And Tyra Banks will still be hosting the shows, even though she has retired from modeling she is stll a hugh part of the show. Being the creator/executive producer she will still go on. I really want this show to go on. This show is really great and hopefully there will be at least be 5 more seasons till the show ends because I don't think that this show should end any time soon !!!!!!! Thank God that Nicole Won!!!","Tyra & the rest of the modeling world needs to know that real women like myself and my daughter don't care to see all the ridiculous modeling to sell something. Weird locations, too much makeup & too much skin is not necessary. Sex does not always sell when you are selling to women. The same goes for the horse stomping runway walk that looks unnatural. People come in all shapes & sizes & they need to have that on the show. My daughter has a 36\" inseam, is tall & slender & a size 5, I am more average at a size 12. We would like to see both- I can not picture how something would look on me when a size 2 is wearing it, it will not fit the same way on me. I do not buy magazines anymore because they are one sided on this matter. We would really love the show to consider women of all sizes. Thank you.","I mean let's face it, all you have to do in modelling is pose for photos. The judging is so over the top with it's criticism. The show however is entertaining, especially with Tyra Banks, Nigel Barker, J Alexander and the supermodel herself Twiggy. I've watched season 5, 6, 7 and in the middle of season 8. It looks like American Idol gone sexy but I'm a guy and I only watch it because of the hot girls posing in their bikinis! The show can be quite boring, when it comes to judging, Tyra tends to go on and on and it's really off-putting. Anyway would I recommend it? Yes, Would I recommend it to women wanting to go into the modelling business? No.","Under the tutelage of supermodel and chat show host Tyra Banks, a group of young hopefuls are pulled together to try and make it through a series of weeks to be offered a shot at their own modelling contract. Each week one girl will leave based on the opinion of the panel of judges and the results of their most recent modelling assignment. Of course there is also the ongoing risk of some bitchy infighting but really we're all here to try and learn how the fashion industry works.You may have detected a hint of sarcasm in my last sentence and you would be correct in that observation because personally I find the professional fashion industry to be a vacuous waste of space whose only purpose to me seems to be to provide laughs at the clichés they embrace. And so it is with this show because really I don't know anyone who watches it in order to see the girls embrace their natural talent for modelling, no, we're pretty much all here to see and partake in just one series long bitching session. As a formula the series doesn't do much to discourage this view because it doesn't have a lot going on other than this. The modelling shoots are fairly boring affairs on their own terms and it is hard to care about a \"look\" that nobody can really define.Of course this is part of the problem. Because so much of it is \"indefinable\" it pretty much makes whatever the judges say right or wrong, depending on how much you buy into them as experts. So they say things like \"they hate that look\" or they \"love that look\" but really it is hard to see what they are seeing and none of them bother to really explain their reasons. Of course this plays into their hands because generally the judges are fairly worthless fashion divas who are there to stir things up a bit and don't have much of value to say. The girls themselves are fairly interesting but not in a good way  they are mainly basket cases swarming to an industry that eats up young girls and spits them out. Some of them are nice and don't last long, others are bitchy and last longer  presumably because the judges know that they need the ratings more than they need to actually produce a top model. They are mostly all good looking in various different ways but there are few I would want to spend much in the way of time with.Overall then this is a fairly pointless and vacuous show but then I suppose that is the point. With a \"talent\" that is so less tangible than singing or dancing, the comments of the judges and the individual performances of the contestants become less important than the bitchy histrionics between the contestants and with the tutors & judges. On this level it is amusing and distracting but never \"good\" television although it is worth a look if you are looking to veg in front of reality television and have no demands for anything that could be considered \"good\" on a tradition scale.","It's not a decent modeling base obviously and Tyra herself is not that big of a supermodel that she thought of herself to be but how can you hate this show? (Now, yes. But let's go back to 2004- early 2008)The best thing about this show is the girls. These girls shared the same dream with an amount of the female population. Each one comes from a different background. Each one has a different set of assets and tastes. All are put together in a beautiful mansion (some cycles). Girls' age ranges from 18 to 26 going through an emotional experience no matter if they've wanted it since they were 8 or just a few months before they participated. Because it's a weird competition, the 6-week period is going to have a big impact whether they like it or not. And us folks from outside get to catch a glimpse of it.It's a career-based reality TV which demands a lot of tension. It started off very promising though does not deliver. We'd see passionate young women who aren't in it just for the sake for \"one in a lifetime experience\" or Tyra Banks or because they're homeless at the moment or a TV personality kind of fame or a 100,00-dollar-check (although that couldn't hurt) or for a man. We get to see what they are about. They are by far seem more realistic than ones from other shows. Sad thing is if the girl is against Tyra's will in some way such as the weight factor and the Tyra-will-do-something-with-your-hair-even-if-it-is-for-the-worse factor and the future career factor, she'll in eliminated for contrived reasons by Miss Banks. And it's frustrating to watch. Miss Tyra exaggerated modeling industry, added in a bunch of weird, unrealistic stuff when she's not even a real good \"supermodel\" herself. Nevertheless, it's still watchable. The show featured superstar athletes, musicians, bartenders, waitresses, rich kids, young mothers, painters, college students, high schoolers in senior year, shopkeepers, strippers, former models, Jesus freaks and more. Some aren't doing what they really want to do. Some are doing just fine but want to model as well. The contestants get to find out more about everything through fellow contestants. Some of them become and stay best friends for life; they've become bridesmaids and godmothers. Some of them find out more about one another and leave. Some girls had a lesbian crush on fellow contestants. They are excluded from the outside world. They only have phones and packages from people at home and rare occasional visits in case they win reward challenges. Though they'll be judged individually, they have to have friends in the house. It creates a very interesting dynamic. In some cycles, there'd be one girl whom all the other contestants root for in case they don't win or one girl that nobody could stand. A lot of them are hilarious. A lot of them are deep and cultured. Some have blemished history. Some are very adorable. Some are affected and annoying. Some of them are very strange and dull to the point we think they're fake. Some are mentally limited bitches. Some are crazy and wacky. The editing absolutely tweaks how these girls really are but if we look closely and pay attention from the beginning that they get little air times, we won't be surprised by their \"people from home\"'s comments and social networks' pages. They're inspiring and memorable and very cool despite the fact that they could disguise as pretty 16-year-old mall rats. These are the only people from reality shows that I become real fans of. Can't deny that it has a lot to offer to the audience and a couch potato like me.It kinda gets girls who usually wouldn't audition for reality shows that have a lot to do with personalities such as Survivor or to be a subordinate such as Hell's Kitchen and The Apprentice end up showing their personalities. The antics that they make, the little games they play, the night outs that they go, so they can chill and take their minds of the competition are real.","This is ten times better than \"Who Wants To BE A Super Model\" on Bravo I think it is more true to the business. Tyra is strong and sensitive at the same time and is able to get the most out of each aspiring model. The photos look for depth in each of the models, in personality and beauty, strength and demure attributes, and the ability to endure and work for what they want. I enjoy seeing Tyra's personal experience brought into the photo shoots and on the runway. I don't always agree with the judges decision's or Tyra's comments and at least one of the winners, I feel did not deserve to win. But this is just a show and every girl on there is very lucky to have this chance.","The next top model is so good I really want to be on the next top model and I really like it and I like the girls and the tv show looks good","These new team is as polished as Season 1 Episode 1! It's really going left. Tyra left this Brand at the top and it's a huge thud. The contestants the set the panel. I'm really lost, no Pop, no swag and lackluster story lines. 😔 The challenges aren't fresh and the struggle to be inclusive is cliché. When you leave at the Top you don't want a team that could use a makeover. Hurry and press redo.","I thought that Eva was the least deserving out of all the final 3 contestants to win that CG cosmetics contract. She truly didn't do anything to deserve being named America's Next Top Model. Both Eva and Yaya are selfish people. Neither one deserved to be in the final two much less did they deserve to be named America's Next Top Model. Sure Miss Eva is a very pretty girl but Amanda, I think, had a very novel reason that she wanted that CG Cosmetics contract and that's so that she could buy a house and make her life and the life of her son better. Blindness aside I think Amanda should have won the whole thing because she had the face to be a model.","ANTM has proved to be one of the most interesting and enjoyable programs that TV currently has to offer. After already 6 seasons you'd expect that this show is going to be headed for a nasty end and I'm sorry to say this but you are right. After Janice left the show hasn't been what made it what it is today.Cycle 1 was my favorite cycle because the models were fresh, the concept of the show was fresh and the models were actually expecting to become rich and famous (now the models end up as 15 minute celebrities doing cameo appearances on E).This show is a reality series but because of the editing and voice-overs etc. it seems staged and 'fake'. Has anyone ever noticed how they seem to fit more into each episode in cycles 1,2,3 and 4 but not in the last 2 seasons? The last 2 seasons have been over-edited and almost cartoon-ish because of the silly computerized sound effects. It just seems that they leave so much out and replace it with catchy background music and flashy scenery.Race has also been a bit of trouble on the show. Their are complaints over some of the winners because they are white or black and the previous winner was this or was that. I HONESTLY think that race might have a little to do with it but it also depends on talent and skill.Don't get me wrong, I love the show BUT if they showed us what truly happens in the model house and what the judges truly think i would think that they would attract more viewers. I hope this show doesn't end soon because it is entertaining and i guess informative in a way too. This show is now a phenomenon around the world so it should live up to its expectations","This is the best show ever no matter what you say!I have been watching this show since cycle 1.This show is never boring its wonderful how you see peoples dream come true of being a model.Tyra is trying her best to help young women not be ashamed of their bodies and make them believe that they are beautiful in their own way and that you don't have to feel beautiful by being anorexic.And just as Tyra says on the Tyra show so what if your curvy so what if you have a big round booty so what if you have a big nose so what if your not as beautiful as the people in magazines you are beautiful to her.SO WHAT..............................."],"review-user":["gwysham-815-939881","go_u_must","myrsini_kal","Shopaholic35","Jonny-ironica","aeriz","emmabrock","westcrow2002","wolfalpha-26218","djdekok","mirwais-orbit","MVictorPjinsiste","nycritic","lambiepie-2","josh_01","bobgo3","jacobhenrytucker-1","bob the moo","highrise_scrambler","jewel2008","hknight-91993","medina787","blackarachnia2","random_165","alonzoXOXO"],"review-date":["11 October 2013","15 February 2004","11 June 2008","6 February 2014","22 October 2007","3 June 2003","12 October 2005","23 November 2008","27 December 2016","30 September 2007","12 January 2008","14 November 2008","9 June 2006","28 March 2007","21 December 2005","14 April 2007","20 April 2007","2 April 2006","3 January 2013","15 March 2008","6 August 2018","15 February 2017","3 February 2005","31 July 2006","15 March 2007"],"review-rating":["3","7","9","4","1","1","1","8","8","10","2","3","7","10","8","10","1","10"],"review-title":[" I Miss the Old Days!\n"," The title speaks for itself.\n"," My guilty pleasure\n"," A completely shallow show that I absolutely love.\n"," Trash Television at Its Finest\n"," UPN's salvation...\n"," It's Not Quality, But It's Fun\n"," Top Model has lost it!\n"," Horrified\n"," Tyra Banks...who died and made her a deity?\n"," America's Next Pop Model\n"," A Guilty Pleasure\n"," Models, Inc.\n"," Well, at least Tyra wants to give back....\n"," Cycle 6 & 7 of America's Next Top Model!!!!!\n"," What Tyra needs to know\n"," It's very over the top\n"," The indefinable nature of the \"talent\" means that the show mostly trades on bitchy tension  watchable rubbish but nothing more than that\n"," Focuses are beyond modeling that it's not high fashion modeling anymore but love it anyway\n"," ANTM is a Better Show\n"," The next top model is good\n"," Horrible\n"," Can Anyone Think Of Anything That Eva The Diva Did To Deserve Becoming America's Next Top Model? What A Bullshit Ending To A Great Third Season.\n"," The downfall of America's Next Top Model\n"," Who will be AMERICAS NEXT TOP MODEL\n"]}