{"review-url":["http://www.imdb.com/title/tt0377171/reviews"],"review-text":["If you want to know the hard mechanics, the mathematical underpinnings and other details behind string theory, look elsewhere. If you want to know what physicists are up to these days, then you've found your documentary.The film makes no attempt to explain the equations behind string theory, but instead gives a synopsis of science history and thinking, followed by the theories developed from that history, in a very plain and simple way most people (read that as people who are not into physics) can understand.There're no incredibly long differentials strung out on a chalk board or butcher paper for the more educated viewer to scrutinize, copy, and hence play with. What this film is is a presentation of how the scientific community, and specifically high energy physics, is dealing with explaining the basic and fundamental mechanics of existence. If you thought otherwise, and are into physics, and were subsequently let down by the program, then maybe you're not as bright as you thought. That's just some food for thought. I think Einstein once remarked that he believed the universe, at its core, ought to be elegant, simple, and easy to understand. That's the whole point of this documentary: To explain to people how and why the world around us is the way it is.Myself, a person who's trained in science and who's read some literature on the more theoretical fields of physics, I found this mini-series to be very entertaining, and hope I get to see another special about the next big breakthrough in physics. I learned about things that, quite frankly, I had no idea existed.If you're just an amateur scientist, or just have a passing interest in scientific things, then this small series should entertain. Heck, even if you're an undergrad you might learn something. Enjoy :-)","The Elegant Universe brings to light many ideas of the universe and existence. After watching this documentary, one can't help but take a step back and rethink their view on the existence of everything. There is a large cast of scientists, mathematicians and others on both sides of String Theory. It is continually brought into question as untested, untestable, and possibly dead wrong. The closest to proselytizing that anyone does is to explain that Quantum Physics, the set of mathematical ideas that give extremely good approximations of what happens to sub-atomic particles, has never made an incorrect prediction. Not so with String Theory; no one is willing to say, on-camera, that String Theory is the truth, and in so doing, the piece retains a certain respectful distance from the subject.","My local PBS station WHYY Philadelphia recently showed \"The Elegant Universe.\" After three hours of watching it, besides having my brain hurt, I learned all about wormholes, quantum mechanics and parallel realities and alternate universes.The last hour of the show was about \"String Theory\" Physics, a semi-new branch of physics which makes many of the the ideas of science fiction not only possible, but PROBABLE. With the \"String Theory\" it sounds like wormholes, alternate realities and alternate timelines ARE possible and it could just be a matter of time until we get the knowledge to use them.Although it may not have given new information to someone familiar with the topic, I found the show VERY interesting and informative. It was very understandable to anyone who is just being introduced to this subject.","This program was quite interesting. The way the program was displayed made it all the more interesting. String Theory is also very interesting to listen too. The whole three hours in my opinion were well worth it. I enjoyed listening to the ideas given by the physicists. Extra dimensions really boggle the mind. If you have the chance, watch this amazing documentary.","Ladies and gentlemen: the show begins with this documentary film. It's structured in three chapters, each one chronologically arranged. The first presents the classical physics and links to Einstein. The second studies in depth the quantum physics and enters in String theory. The last reveals the Everything theory... The difficult concepts used here are introduced in a very simple way, with daily objects; although you must believe them without checking by yourself -if you are not a scientist- (and even if you are a scientist!!). The film is not a masterpiece by its fabulous technique or the way it's produced; what really imports is the story, and WHAT A STORY!!!","I was very disappointed with this series. It had lots of cool graphics and that's about it. The level of detail it went into was minimal, and I always got the feeling the audience was being patronized -- there was a lot of what seemed to me as \"This is extremely cool but we're not going to explain it in further detail because you won't get it anyway. Let's just show you some pretty pictures to entertain you.\" The host would drop interesting-sounding words such as \"sparticles\" and \"super-symmetry\" without any attempt at explaining what it was. We had to look it up on Wikipedia.Furthermore, I know quite a bit about superstrings (for a layman) and I found their explanations were convoluted and could have been so much better. They could have chosen MUCH better examples to explain concepts, but instead, the examples they used were confusing and further obscured the subject.Additionally, I got so sick of the repetitiveness. They could easily have condensed the series into one episode if they had cut out all the repetition. They must have shown the clips of the Quantum Café about 8 times. The host kept saying the same things over and over and over again. I can't remember how many times he said \"The universe is made out of tiny little vibrating strings.\" It's like they were trying to brainwash us into just accepting \"superstrings are the best thing since sliced bread.\"Finally, the show ended off with an unpleasant sense of a \"competition\" between Fermilab and CERN, clearly biased towards Fermilab. This is supposed to be an educational program about quantum physics, not about whether the US is better than Europe or vice versa! I also felt that was part of the patronizing -- \"Audiences need to see some conflict to remain interested.\" Please. Give me a little more credit than that.Overall, 2 thumbs down :-(","Many of us who went through high school probably made it through alright without having to take a Physics course - I know I didn't. But after watching this program, I surely wish I had.This documentary is a guide to the 'Holy Grail of Physics' - the quest to unify all the fundamental forces of the universe into one 'master equation' that eluded Einstein during the last years of his life. Brian Green, a professor at Columbia University, introduces us to this mind blowing theory in a wonderfully simple way and leaves us with an even greater appreciation for the universe we live in.We start with the tantalizing possibility of a 'master equation' that could unite and explain everything... *everything!* in this universe, including the four fundamental forces that we know that exist: electromagnetism, the strong nuclear force, the weak nuclear force, and gravity. Green takes us on a tour of how our understanding of the universe came into view with the work of Newton, then Einstein, and then later on to the revolution of the physics at the quantum level.But it is at this point that we run into a problem that has plagued physicists for years, and one that no one has been able to solve just yet. How can we unify all these forces that we know together? We find, as Green constantly points out throughout the problem - that the answer to this perplexing problem could be in the theory of strings. However, if we are to describe the universe in terms of string theory, there is a very big price to pay.It turns out that out of the mind numbing mathematical equations of string theory, that, as a consequence, we find that we could possibly be living in a universe filled with, not just 3 dimensions that you and I see every day plus 1 (for time), but rather, that we may actually live in a universe of *11* dimensions. But the math that arises out of that theory doesn't stop there - the possibility exists that there may actually be parallel universes; some of them right next to you and me! Could we possibly take such a theory that leads to such consequences seriously? As Green points out; we have yet to fully find out, but we do know that the math that has arisen from these equations are already showing us that the universe still has much to show us.For those of you who fear that you won't be able to understand the concepts in this program - fear not. Professor Green does a wonderful job of doing away with the math and harder concepts of physics and instead focuses more on the *concept* - which, when you take away all the math from it, transforms from a monstrous beast into an incredibly simple and, as Green constantly points out, 'elegant' concept. Viewers of this program need no prior background in science; the concepts are so simple even a child could understand them.When you finish this program, you will truly come to understand what a wonderful and mysterious universe it is that we live in.","OK. On the whole, this three part documentary will bring most interested people up to date with going's on in the world of physics, and the last 300 years of discovery of our universe. If you have read Stephen Hawkings brilliant book \"A Brief History of Time\" and understood it then you might benefit from the visual description of certain concepts..which i did to a certain extent. Greene is bearable, but obviously for the sake of the masses, tends to explain things in a slighty patronising way. This is of course deliberate and will be perfect for almost everyone who watches this series.The guest scientists were good. (no Hawking, but i suppose he has his own DVD(s) ) I kept waiting for him to appear but they rotate through the same ones for almost 3 parts... (very American weighted here, with a few Brits and one antipodean) I bought the Nova 2 Disc edition (NTSC) and there were a few inclusions that really detracted from the overall experience.1. The \"this is brought to you by..\" at the start of EACH part was a necessary evil for the first part, but seeing it 2 more times before It was over was very ordinary.2. Can't be helped I suppose but there is quite a bit of overlap at the start of 2 and 3 which had me reaching for the FFW button a few times.3. This disc set was straight from TV..(ie ads, what happen last show for those that missed it, and frequent \"goto pbs.org for more ....\" )appearing throughout the presentation. (quite unlike BBC material which is unmatched for presentation..Planets, The Blue Planet, etc) My 7/10 is based on content alone. The niggles were there but I got over them. If this had have been done with that classic British accented presenter( you know the one) it would be a perfect Disc set in my opinion.If you have seen this and want more...then I highly recommend Hawkings book \" a Brief History of Time\"... I wish it was a movie too.Happy viewing.","I myself am a physics student, and I have to say I think this is one of the best 'popular' introductions to string theory that's out there. The Elegant Universe manages to make the entire topic of string (although it's actually M) theory accessible to a wider audience.Some 'popular science' programmes feel that the best approach is just to throw the audience in at the deep end, throwing technical jargon at them without so much as an explanation, and presenting the theory in a boring, stale style. This programme goes through concepts such as general relativity and quantum mechanics, and explains the issues that need to be resolved between the two so we have a coherent theory that can be applied to the universe on both a large and small scale.I suppose some could say it's slow and takes too long to get to the interesting stuff like extra dimensions and wormholes, but the thing is: that's against the point. Explaining string theory from the start is nigh on impossible without at least mentioning the physics at its base, and the way it's explained in The Elegant Universe is clear and entertaining.Whether you'll like this program really does depend on if you're willing to perhaps be initially dumbfounded by some of the ideas that Greene presents: extra dimensions and warping of spacetime aren't exactly prevalent in everyday life, are they? But, if you persevere with some of the more exotic concepts in this programme, you'll find that it will give you an insight into the research that drives the world of physics today. And if you're studying physics, well, it's great entertainment as well as you'll be likely able to follow this and appreciate it even more!","The Elegant Documentary -Don't watch this movie ... if you're an egotistical know-all student of physics. This much less than one percent (miniscule fraction) of the population may find that this show just tells them what they have already learned and already know.Do watch this movie! - If you're one of the massive majority of people that fall into the greater than 99% of the population that does not study or already have a sound knowledge of the theories of physics including Relativity, Quantum, String and M-theory.What a brilliantly architected documentary. Starting with some helpful historical background you will be lead step by elegant step into a Universe of pure magic - and dimensions beyond. I have always had a huge appreciation of Mathematics. This movie can easily give you an insight into what an exquisitely beautiful language mathematics is without making you feel like you're about to fail the grade.The show is repetitive at times as the original format was a mini-series split over three shows. It therefore makes sense to give us polite little reminders of the principles being presented. I found this immensely helpful as it kept reminding me of the multitude of questions and possible answers that make up this amazing tapestry of our very existence.We are all (and everything around us) is vibrational-energy with a natural tendency towards harmony. This movie may blow your mind - or at least help you realize that the universe is far far bigger than that which we see around us (even with the Hubble Telescope) and far far smaller than the protons and neutrons within the atoms we learned about in high-school. M-theory holds many magnificent magnitudes of 'possibility'.It just seemed so appropriate that all of this elegance should by it's very nature move (by admission by the many brilliant scientists presenting) out of the realm of Science and into the realm of Philisophy.You do not have to be religious at all to feel like this movie brought you one step closer to God.Bravo Brian Greene. Well done indeed.P.S. If you're interested in feeling even more comfortable and at home in your place in the Universe and would like some more insight into the 'possibilities' Quantum mechanics blended with Spirituality (of all things) can bring then I highly recommend that you also watch \"What the Bleep!? - Down the Rabbit Hole\". Yes I know they make a few silly mistakes by suggesting a Shaman may not be able to see a boat if he hasn't seen one before (my eyes process light reflections just fine - I see things everyday that I've never seen before) and brain cells are cells in the body that actually don't divide. But if you can get over these little hurdles and put down the things you don't like and hang on to those that you do - there is a lot to like about this film.Then watch \"The Secret\" (2006 documentary about The Law of Attraction - search for IMDb title \"tt0846789\"). This information just might change your life profoundly - forever. If you search deeper you might even find the Universe is talking to us with thought (if you'll listen) - and some are - and that is truly incredible. There is a modern day Jesus/Mohammad/Buddha (those, among others, that history suggests have communicated with the non-physical) alive today and she lives in Texas. I know some of you know what I'm talking about.I do not consider myself religious by any traditional definition but I have never felt more at home or as comfortable in the Universe as I do now.","I'm really disappointed by this piece of work. It is quiet shallow, keeps repeating itself, is mostly not exact and sometimes on the verge of being wrong. I think it's made for elementary school, especially because it keeps repeating itself over and over again while leaving large gaps. A young kid might actually enjoy it and learn from it, but a better way to make a kid appreciate theoretical physics are books like \"A short history of time\" or \"The Tao of Physics\". If you are familiar with the topic on a very basic level, you won't gain any new information or views from this series. Don't waste your time with it. Nice eye candy though.","The main question the documentary is asking itself (and the user) is \"are we discussing science or philosophy?\". I am inclined to choose the last option since almost none of the presented statements have been or ever can be verified.The documentary consist of a lot of talking, mostly sharing opinions.An opinion is nice, but please keep it real and on track with facts. In addition, the documentary tents to repeat it self, not once but numerous times, which I found a bit annoying and cheap.Also the discussion of the string theory kicks of after lets say 2 hours, so be prepared to sit out the first 2 hours seeing through the birth of the string theory and the history of Albert Einstein's career.Overall conclusion: it is a boring documentary, it provides you with a lot of opinions. I did not learn much and left with a feeling of dissatisfaction, though it did succeed to make me more skeptical regarding the so called string theory and its 11 dimensions.I rated it a six, barely.","In the wake of my personal research into the pending \"end cycle\" time of 2012 presented by the Mayan calendar system, I believe this movie should be seen every bit as much as \"What The Bleep Do We Know?\" While some may believe that matters of top level science should only be communicated in doctorate level \"speak,\" \"The Elegant Universe\" breaks such barriers. The visuals and the select dialog make it easy to comprehend this walk through the history of physics. There are numerous messages in this movie, the least of which is that academic science must always be ready to revise what's being taught. True, pure discovery science is beautiful because there's always something additional and exciting to bring to the fore if we have the courage to seek it out in the face of \"established\" science.","I had a hard time staying awake for the two hour opening episode. It was dumbed down to such an extent, I doubt if I learned a single thing.  The graphics were rudimentary.  Any small idea was repeated ad nauseum. Contrast this to the Cosmos series hosted by Carl Sagan. That had a good musical theme. There was NO music coming from these infernal 10-dimensional Strings."],"review-user":["Blueghost","alexblock-1","nannyjo","majekowski","fjhernando","muon0101752249","cassius2600","druidvideo","manitou-full-moon","Zenorb","hendrik-9","Simkin the Jester","jlp-14","aostling"],"review-date":["17 July 2004","11 March 2005","4 June 2005","6 November 2003","31 October 2007","18 November 2008","15 March 2005","9 June 2005","28 July 2005","28 September 2006","7 March 2004","4 February 2004","18 December 2005","29 October 2003"],"review-rating":["9","10","9","10","4","10","7","10","10","3","6","10","1"],"review-title":[" Good scientific hypothesis for the layman.\n"," Simply Mind-boggling\n"," I found it VERY interesting\n"," Quite interesting\n"," Masterpiece\n"," Disappointing - lots of fluff and little real content\n"," A guide to the Holy Grail of Physics\n"," Quite Good, but some points that let it down.\n"," A good introduction to modern particle physics theory\n"," Do We Live in the Realm of Science or Philosophy?\n"," Shallow eye candy.\n"," Too slow and too philosophical\n"," Very important look the history of physics theories\n"," Truly awful\n"]}