{"review-url":["http://www.imdb.com/title/tt0349903/reviews"],"review-text":["George : Hey guys, remember that movie we all did a few years back called Ocean's Eleven?Brad : Course we do, we had such a great time.Julia : And let's not forget we made stacks of money on it. It was a hit!George : Well here's an idea.Let's make a sequel!Matt : Fantastic idea! I mean the first one had all of us in it but most of all it was directed, had cool music, had lots of us in it and had a great script.Brad : The script? Oh yeah, the script, whatever.Julia : Let's do it. Everyone will love seeing us mugging it up on the screen. Steven Soderbergh's a friend of mine so he'll love directing us again.George : Yeah, he'll do it. He won't have to work too hard though because it's got us in it. In fact he can just stuff around and experiment with all sorts of stupid camera angles.Matt : Won't that just confuse the audience and make them dizzy?George : Stuff that! Just so long as everyone can make out it's us up there on the screen they'll love it!Matt : And the music??Brad : Pfft! Music? No one goes to the movies for music. They want to see stars. Like us! Let's just have any old stupid music for this one.Matt : That's fine. What about the script?Brad : What is it with you and the script? Hey here's an idea. Julia, you're so famous and wonderfulJulia : So are you Brad.Brad : Thanks Julia. What I was saying was how about we have an entire sequence where your character pretends to be you! Everyone knows you're fantastic so they'll love it!Matt : Great idea Brad. How do we fit that into the script?George : Who cares??? It's Julia! Everyone will love it!Julia : OK. How about we get someone else as famous and wonderful as us to join in the cast? The audience will love that.George : Yeah, let's get Bruce Willis in a pointless uncredited cameo. He's never been too fussy about what movies he's made before. He's bound to say yes.Matt : How do we fit him into the script?George : Who cares??? It's Bruce Willis. Everyone will love it!Julia : OK, who else?Brad : I'm way ahead of you here, Julia. I've got a famous wife so let's get someone who is famous and wonderful, with a famous husband and who they audience will love if they see her and I having a romantic scene.All : Catherine Zeta Jones!George : I'll call her and see. (Ring Ring)Catherine : Hello. George : Hi Catherine, George Clooney here. You might remember working with me in Intolerable Crueltythe audience loved it!Catherine : Hi George. What's up?George : We're making a sequel to Ocean's Eleven. It's got me and Brad and Julia and Matt in it. How'd you like to be in it too?Catherine : Yeah sure. What's it about?George : Who cares?? It's got me and Brad and Julia and Matt and you in it!!Catherine : OK. But how about we film it in Europe? The audience will love that!George : It's a deal. See ya.Catherine : ByeJulia : So how'd it go?George : She's in AND she had a great idea. She reckons we could film it somewhere in Europe.Brad : Fantastic!Matt : So how does that fit into the script?Julia : Who cares about the script!! It's got us in it! And anyone who liked Ocean's Eleven will get sucked into seeing it and by then it's too late for them to worry about the script because they've already paid their money.George : And besides they'll love it because it's got me and Julia and Matt and Brad AND Catherine in it AND it will be filmed in Europe. Everyone will love it!Matt : Great. Let's do it!!you get the idea.","Unfortunately I think this is one of those films that if you or I took it to the studio and said, 'can I make this great movie with my friends Mary, Mungo and Midge from school?' the studio would have you kicked to death on the spot. However, if a bunch of massive Hollywood names say, 'look, I fancy a jaunt to Italy with my mates, how about it?' the studio writes a cheque.We kick off with the casino boss from Ocean's 11 tracking down the robbers who made off with his cash, and then Brad Pitt is shagging Catherine Zeta Jones, and then there's some monkeying about in Amsterdam and Italy and such and such and then it all ends somehow.The film does, however, include the most shameful moment of both Julia Roberts' and Bruce Willis' careers, which is a cinematic gem. I nearly vomited in my lap and tore my eyes out when Julia Roberts, playing Tess in the movie, pretends to be (you guessed it) Julia Roberts! Bruce Willis stands about clearly wondering when he can leave, and how much the cheque will be.Ah well, to be fair, I'd have done it for the cash, so I suppose I can't really criticize the poor loves, but I'm a penniless slob not a Hollywood legend. I guess what really annoys me about this film is not that it is boring and pointless and has a terrible story, but that I think the actors probably all had good fun doing it! I think the actor's entire job is to project emotion outwards...I feel like I paid to go to the party, but had to stand outside in the rain. Booo!Watch it if you like Como, or fancy CZJ or something, but otherwise go for a walk.","Great actors, beautiful European scenery, funny lines, witty banter, nice camera work, what could go wrong? ... The plot. When I saw that 27% of the people gave this movie a 10 rating, I wondered if I was the slow one. Then I read the reviews.When most of the stars started appearing on talk shows, trying to convey the buddy buddy tomfoolery that went on behind the scenes, I kind of sensed that damage control was underway. There was a moment in this movie where a few of the actors were sitting at a table talking complete gibberish, and it was later joked that they pulled a \"lost in translation\". I guess the joke was on me the viewer.What rolled along as a pretty good movie slowly gathering steam, stalled into chaotic incomprehensive mess. If you loved the first movie because it developed into a brilliantly masterminded theft with many twists, you be left with the empty feeling that the only thing that was lifted in this movie; was your money for the admission ticket.It is too late for me now, but you still have a chance.","Every James Bond movie has its own set of rules. Just like every Indiana Jones movie has ITS own set of rules. And the fact that screenwriters don't break these rules maintains the integrity of the characters. With a completely unnecessary plot twist, the integrity of both Ocean films plummets somewhere between Airplane 2 and a Roadrunner cartoon.Imagine what would happen, while teetering on the rope bridge outside of the Temple of Doom, if Indy told Shorty and Willie not to worry because throughout the entire first two movies he's secretly had super powers and can fly them both to safety.Entertaining? Sure, for a Roadrunner cartoon. But Spielberg would never have done that because it would have destroyed the integrity of the film. More importantly, it would have ANGERED the audience. They'd already sat on the edge of their seats through 3 hours worth of Indiana Jones movies and they were counting on Indiana to get them off that bridge in a believable way. If he were to fly off? People would have walked out of the theaters the same way people did during Ocean's 12.SPOILERS1. Julia Roberts'character, Tess, infiltrates a museum by disguising herself as...Julia Roberts?!? A clever twist? By breaking the fourth wall three hours after we've been introduced to these characters? Is this the Naked Gun 33 and 1/3? It's a textbook example of how a cheap laugh can ruin an entire film. But wait...just in case you haven't walked out yet...2. The suspense builds throughout the last hour of the movie -- how will they pull off the heist -- there are only 10...8...5...2 DAYS LEFT! And then in the last 12 minutes of the film, the ONLY entertaining part of this movie, we see that the heist was made days earlier and took Matt Damon all of 30 seconds to pull off. The past 10 days? A complete waste of your time.BACK TO INDIANA JONES ON THE ROPE BRIDGE...\"Just relax, Willie! I stole the REAL stones back about a month ago! Besides, I convinced them you were Kate Capshaw!\"If you haven't already seen it, cut your losses and go see the Polar Express. I don't want to ruin the ending for you, but there really is a Santa Claus. Most importantly, you won't feel cheated leaving the theater.","SPOILER!! Terrible camera work, horrible writing, non-existent plot, and numerous plot wholes. Wonderful acting! Except for Julia Roberts. Who poorly plays someone who is impersonating Julia Roberts, poorly. Catherine Zeta Jones is adorable in this movie.During the movie, we repeatedly zoom in, on each of the twelve (!) characters. Twelve is too many, even for a classic like 12 Angry Men. And the problem is, we tediously zoom in on the characters, when all of them are in the same room, doing the same thing.Yep, Clooney's eating. Yep, Pitt's eating. Yep, the \"Jew\" is eating. Yep, the geek is eating. Yep, the bodybuilder's eating. Yep, Mr. Sensitive is eating. Yep. Yep. Yep. Yep--Yep. Yep. Phew! This happens at least three other times in the movie. Yep, they're all sitting in cars, bored. Yep, they're all getting arrested, frightened. Yep, they're all being led out of a jail, depressed.But it wasn't until I was home that I realized how badly they'd \"got\" me on this one. This is a heist movie, right? That's what I went to see, right? But when I walked in and set my car keys in the change jar, only then I realized: NOTHING WAS ACTUALLY STOLEN IN THIS MOVIE! That's right. It's a heist movie, where nothing gets stolen. Oh, they try. They go to try and steal some boring document or something, from some guy's house (whatever), and it turns out it's already been stolen. 20 minutes of my life, wasted. Then they try to steal some egg from some museum (YAWN!), and they screw that up and get arrested.Then we see how some fairy french guy stole the egg even before they did, and we get all the joy of \"Entrapment\", except this time the person inside the tight catsuit dancing around the fake lasers is... an ugly skinny french guy. Um.But it turns out he didn't actually steal the egg either. Actually, our heroes stole the egg, LOOOONG ago, in another movie entirely, which would have been a GREAT movie to watch, had they made that movie.Instead we see a 30 second clip in black-and-white about how they robbed some college student of his back-pack. You heard me... the daring caper, the ultimate heist-- the buildup of this 2 and a half hours of utter boring crap-- is them stealing a back-pack from a college student, by creatively getting into a fight over baseball teams and distracting him, and replacing his back-pack with an identical back-pack? What?? Ugh. I'm telling you, this was so bad, I didn't even realize just how bad it was-- just how badly I'd been robbed-- until I got home.","Terry Benedict (Andy Garcia) catches up with Danny Ocean and his team and demands that they repay the money that they stole from him (in Oceans 11) plus interest. He holds back from violent action however as he is under the instruction of the world's greatest thief, the Night Fox. The team then have to pull off a series of heists to pay Benedict back whilst testing their abilities against the Night Fox who wishes to maintain his position as the greatest thief ever. Put simply, this film is a complete mess. The masses may argue that it is \"cool\" and that Clooney and Pitt put in great performances but these are the same people who have a subscription to \"Hello\" magazine and think that David Beckham has the potential to be a great actor. The story is convoluted, it is not complex or clever and it does not have intelligent twists and turns, it is just a complete mess that spills out in multiple directions with the hope that the audience will think it is cool and intelligent (Hello magazine readers). Any respectable movie watcher will however see the film for the farce that it is. Whilst Oceans 11 wasn't a great film it had a decent pace, was stylish and had some decent twists and turns. This movie loses its way very quickly and then basically gives up. It is as if the director and cast said to themselves, hey this isn't really working out, lets just have a laugh! Indeed the cast looks like they are enjoying themselves but I was not. I will not delve into the plot as its confused evolution does not warrant any examination. The addition of Catherine Zeta Jones is largely annoying. The scenes where Julia Roberts impersonates herself (with Bruce Willis undertaking a cameo role) whilst mildly amusing appear to be a desperate move to keep the audience interested. The movie is so full of plot holes that it as if Arnie has emptied an Uzi 9mm into the film studio. Credit can only be given to some scenes where the Night Fox uses Caopeira to undertake a heist against the back drop of some funky music but this is hardly justification to watch the movie. The final scene features the team in a nonsensical drunken stupor; this accurately sums up the movie. Stick with the original.","Three years ago Danny Ocean (Clooney) and his team stole 160 million dollars from Terry Benedict (Garcia). Now Benedict wants his money back. Plus interest. Thus Ocean and his crew must scramble together what they owe; too hot to work in America, they set their sights on Amsterdam.... where, not so coincidently, Rusty Ryan (Pitt) has an ex-love (Zeta-Jones) who just so happens to be head of police and hot on their trail. But Benedict and sexy cop Isabel Lahiri (Zeta-Jones) aren't the crew's only problem. Another thief under the alias of \"nightfox\" ( Vincent Cassel) is keen to battle it out with Ocean and his team; to decide who the best thief (or thieves) are. And there you have Ocean's 12; a film which falls too short in terms of wit, appearance, plot... and pretty much everything else in comparison to the original Ocean's 11.One thing must be made clear, however; the cast is great. Spectacular really. There is a definite and rare chemistry between everyone; even Catherina Zeta-Jones, newcomer to the Soderbergh film. And it is indeed very rare to jam-pack a film with so many big name celebs without the film being ruined by too much star power and not enough of anything else. And these films do indeed have A lot of Hollywood star power in them; Julia Roberts, George Clooney, Brad Pitt, Matt Damon, Catherina Zeta Jones, Bernie Mac, Andy Garcia, Don Cheadle... just to name the biggest names. And watching Ocean's 11, you can tell that the crew enjoyed making this film. Unfortunately, the audience may not gain the same pleasure as the actors did....If you were like me, absolutely blown away by the chic and jazzy first film, then Ocean's 12 will be a disappointment. The first movie was simply 'classy'. All of the shots, every single take, camera angles were all very clean-cut, solid and very stylish. In this film however, Soderbergh decides to use the currently popular 'shaky cam' technique for some scenes. I can understand why. In this film, unlike the first one, the crew haven't had time to plan to perfection their 'pull'. In this film its a mad rush to meet Benedict's deadline and I suppose Soderbergh wanted to get that rashness and disorientation across. But it wrecks the film. He really should have stuck to his original idea of having it all snazzy, bold and clean. Plus it is confusing when the film snaps between past and present to explain how the crew made some of their robberies; it looks messy and ugly to change between shaky cam to the bolder scenes.Secondly, the laughs are fewer in 12 and the script is duller. Ocean's 11 had a quick-wit and many a memorable line. Ocean's 12 has to sink so low as to throw in an age joke for Clooney; \"Do i look 50?\". The plot is predictable; from Julia Robert's 'impersonation' to the crew's great escape. It's all very blunt and can be spotted a mile away. And the summing up of the 'pull' is a little confusing; past tense (there's that shaky cam again!). I cant give too much away but my personal opinion is that the explanation of how the team pulled of the robbery is a little confusing and a sort of \"huh\"? moment which you will need to disucss with other's who have seen the film, to make sure you absolutely understood everything.All in all the film is a let down. By all means go and see it; if for no other reason than to drool over the gorgeous Matt Damon, Brad Pitt and George Clooney.... But do not get your hopes up. As the credits roll you will find yourself feeling cheated somehow. Ocean's 11 was a real gem but Ocean's 12 just leaves you pining for the original.... 5.5/10","I felt compelled to write about this movie after i joined IMDb because i thought it was the worst script writing i have seen in a while.The acting/direction/other-areas of the movie are fantastic. I love brad Pitt with George Clooney. It works. The witty banter was still there too from the first movie. My question is how in the world did they let this script out of the drafting process? I thought that not only did the plot develop like a slug racing to the end of the sidewalk, but that twist? (can i call it that) was so incredibly stupid that i wanted to go demand a refund from the ticket booth. I have never felt so played and used from a movie in my entire life. Here i was expecting something similar to the first movie (good chemistry, good acting, good direction, amazing plot) only to find that they had taking my 8 dollars and made a mockery out of it.The part that gets me still is that this movie has now grossed more than 125 million dollars.In summary, I felt that this movie insulted my intelligence. I still feel like the only part the writers concentrated on was that little bit with Julia Roberts acting like Julia Roberts. This movie made me sad and angry.","Simply put, this is a boring movie. The strength of Ocean's 11 was that it started at point A and it ended at point B, and it did so in a convincing and entertaining matter and threw in a believable plot twist at the end. It was very simply and straightforward.Ocean's 12 is nothing like this. The film is in desperate need of a better editor, as it is so bloated and ponderous that towards the middle of the film, if you've even managed to keep track of who's stealing what from whom and why they're doing it, you won't even care any more. You'll just be begging for the ending. The film is filled with bizarre camera angles, such as a shot of an incoming airplane that for some inconceivable reason is filmed sideways. There are also some VERY bizarre scenes, such as a scene where Julia Robert's character has to pretend to be Julia Roberts, and a thief break-dances through lasers.However, the biggest flaw of the movie is the absence of a good heist scene. The heist in Ocean's 11 was masterful, and there is nothing in this film that even comes close. I didn't go to see this movie to watch a cop get reunited with her father who happens to be a master thief, I went to see a team of funny people go up against the odds to steal a lot of money.Bottom line: You will hate this movie. Don't waste your money on it.","I had very high hopes walking into this movie. After all, Ocean's 11 was a truly great Hollywood product. Its rapid-fire jokes, incredible star power and tight script made it one of the most fun caper films I have ever seen. Of course, with all the money it made, a sequel was on the way, and I, for one, was excited.Needless to say, I was absolutely blown away by this movie. Blown away by how horribly wrong things can go. This movie had everything going for it; the return of the entire original cast, the same director, news stories of crazy on- and off-set antics. How could it possibly have gone so wrong?It starts immediately with one of the most awkward and unnecessary opening sequences ever and goes downhill from there. After reasonably goofy short scenes between Pitt/Zeta-Jones and Clooney/Roberts, the film spends several minutes watching Andy Garcia waltz from scene to scene, telling each individual member of Danny Ocean's original eleven that he wants his money back. Believe me when I say that these scenes are only here to pad Andy Garcia's running time, because without these ridiculously awkward shots, his screen time would be WELL under five minutes.This leads me to another major qualm I had with this film. The pacing is so uneven that characters are dropped completely from the story, and only sometimes brought back later. Bernie Mac's character is dropped from the script early on, and never comes back except for 2 short scenes with no dialogue. Garcia appears for the first few minutes, and returns for an exceptionally brief scene at the end. Roberts shows up for about 5 minutes at the beginning, and isn't even mentioned again until there's about 20-25 minutes left. Even Clooney himself spends a large chunk of the film in prison.This would all be excusable if the film was funny. At all. 90% of the jokes fall completely flat and the ones that do work are worth a chuckle at best. The \"plot\" is undeniably worthless, and left me feeling cheated. At one point in the film, the team takes on a job worth $2.5 million of the nearly $100 million they need to raise before Garcia's two-week deadline. Several characters even acknowledge how absurd wasting the time to do this job is, but they do it anyway! Over 30 minutes of the film revolve around this job that they shouldn't even be doing, and one gets the feeling that this part of the plot was simply added to pad the running time. Furthermore, the equipment they use to pull this job off CLEARLY cost millions upon millions to fund. Just wait until you see what they do to pull this job and realize it would cost far more than $2.5 million to pull off. Obviously, because of this, they have to pull off several jobs to make the money. The beauty of the first film was the one big con and how ingeniously and intricately it was pulled off. Here, they pull so many jobs, in so many different ways, that they rush through all of them because to explain them would make the film several hours long.We all know walking into this film that there will be a big twist at the end. Thus is the nature of the caper film. The twist at the end of Ocean's Twelve made me laugh; not because it was funny, but because I couldn't believe how cheated I felt. I won't give it away, because I know most of you will be foolish enough to throw down the money to see this movie anyway.What I will say is that it makes most of the 2 hours you have sat through already completely irrelevant.I was excited to see this film, after absolutely adoring Ocean's 11. I left the theater feeling like I had been the victim of a truly great con pulled by the cast and crew of this movie in tricking me into thinking that this movie would actually be worth watching. I have never given a 1 to a movie on IMDb.com, but there's a first time for everything. Consider yourselves warned....1/10","I went into 'Oceans 12' as being a big fan of the first installment, but my hopes were not astronomical. And for the two or so hours that I watched the movie, I was not disappointed. However, I cannot say that I enjoyed it nearly as much as I had enjoyed 'Oceans 11'.'Oceans 12' was a very fun, but at the same time flawed, movie. The movie was every film students dream come true, full of indie style camera and editing tricks from beginning to end. But this could not hide the fact that at its core it was still a studio movie. The storyline was entertaining and full of just as many twists and turns as had graced the first one. However, when the final credits rolled I could not help but wonder about some of the loose ends (and there were many). It almost felt as though the scriptwriter had too many ideas that really did not fit with one another, but he threw them in anyway. At times it could be a little frustrating and leave you wondering why they even showed the last ten minutes of the movie.By far the strong suit of the film was the cast and their generally above par performances. Brad Pitt was excellent again, and Matt Damon was probably even better then he had been in '11'. The rest of the gang was about as they had been previously, with the possible exception of Shaobo Qin whom I felt was even funnier this time around. Catherine Zeta Jones turned out to be a welcome addition and she fit right in with the movies flow as Pitt's love interest. She perhaps looked the most comfortable in her role out of all of them, despite the fact that it was her first hand in the series.All in all, I was pleased that I had spent the eight dollars to go and see this the day that it opened. But by the same token, I doubt I will be purchasing it when it appears on DVD.My Overall Rating: 6 1/2 out of 10","Three years after Ocean's Eleven the gang's all back for more in this sequel. This time around the elusive group of thieves and con artists reunite and travel abroad to Europe to pull off another elaborate heist after vengeful casino mogul Terry Benedict (Garcia) tracks them down looking for reimbursement. Little do they dream that they'll face stiff competition from a self-proclaimed criminal mastermind (Cassel) who's determined to try and upstage them. The latest in a long line of tepid Hollywood sequels; the cast may have had fun making this film but that doesn't mean the audience will as it drags on for over two hours with endless story lulls, self-conscious humor, and banal dialogue. One particularly embarrassing in-joke falls flat and leaves you wondering just how desperate the producers were to earn cheap laughs. The same group of gifted actors that made the original so special are wasted here, as the needlessly convoluted 'script' lacks any wit, style, or sense of purpose. **","It's inevitable, isn't it? After the success of the remake of Ocean's Eleven, out comes the sequel three years later. I liked the style of the teaser trailer (and was probably one of the only ones who didn't mind the name), so naturally, I was looking forward to the movie. Naturally, it's a sequel, so it's inferior to the original (which I liked more than the original of the original). The entire cast is back (plus one more, obviously) for the necessary foreign-country locations and trendy scene transitions. There's the constant music, the people with the general European accents (well, villains), and every other caper movie cliché in the books.Danny Ocean (George Clooney) and his eleven/twelve compadres are forced to pay back the money that they stole from Terry Benedict's (Andy Garcia) casinos three years earlier. To get the money, they have to steal it in Europe.Where the first movie was fun, this sequel was mildly entertaining. It went on a little long, but was never boring. It's watchable (as all crime movies like these should be), but not really entertaining. I wasn't having fun while watching a lot of Ocean's Twelve. I wasn't bored, either. I was in Limbo of the movie world. All of the Vegas glitz added to the first, and here it's drab European backgrounds. Steven Soderbergh's directing also makes the film harder to enjoy. The film's choppy-we don't see events that happened until after the fact (if that makes any sense), and there are so many subplots and characters with similar sounding names that eventually we stop caring. Whenever a movie makes me do that, I usually focus more in on the fun aspects of the movie. And sure, the movie had its fun moments, and never left me bored, but overall, it just lacked that ultra-cool style that the first one had.Then again, every actor's back in cool form. Catherine Zeta-Jones is the newbie here, and although her character is barely defined, she still manages to be cool. George Clooney, Julia Roberts, Brad Pitt (being on screen probably more than anyone else), Matt Damon-they're all cool. But it's obvious that this isn't the best sequel that could have been made for Ocean's Eleven-the movie was originally written for a completely different movie, and then readapted to a sequel. Because of that, there aren't really any reminders on who these people were. I remembered Clooney, Roberts, Garcia, and a few character names and quirks (such as Pitt's obsessive eating), but, really, who were these people? Did Soderbergh think that we would all rush out to see the first one before seeing this? I'll bet as many people did that as the number who went to see the Russian Solyaris after Soderbergh made Solaris.The caper this time around isn't as interesting (the major one doesn't come in until halfway through), nor as easy to follow. In fact, the whole movie's basically a convoluted mess. The subplot about Isabel's father, things like that...if there's a definition of worthless, that's it. Also, that \"Julia Roberts\" bit went on for too long. We got the joke there. At that moment, I think that the movie thought it was funny enough to abandon basically the entire plot and go with a ten minute schtick, when there was basically no other humor in the movie. Still, Ocean's Twelve isn't terrible, and can offer a good time if you're the right person.My rating: 6/10 Rated PG-13 for language.","This was the biggest disappointment of a movie...:( Sucks, cos I was really looking forward to it.All the twists were crap. They were ALL flashbacks!!! What makes a good heist movie is the BELIEVABILITY of the the job. Yes it has to be surprising so the audience is stunned, but if you walk away and go that's bulls#!t... what's the point? Plus the main heist was a bag snatch anyway! You didn't get to see the team operating at it's full deceptive and brilliant potential. There was not even ONE good heist in this movie! They were all rubbish.. including that french idiot's break dancing crap to get through the lasers... it's easy to do that when they are composited in afterwards! Plus that kind of stuff has already been done in at least one other movie.. and it was stupid then as well...Also, there's no reason to have even HALF of the 12 or 11 in this movie! What difference do half of the cast really make to the outcome of this movie??? Half the SCENES don't even need to be there! The first one was classy. This was CHEAP! And it makes the whole team loose credibility. Especially Ocean himself for bowing down the Bennett.","Man I loved Ocean's 11.Smart movie. All eleven characters were crucial to the heist as each had their own specialised skill that was necessary to pull of the grand finale.What on earth was Oceans 12? What was the purpose of the twelfth person? I assume it's supposed to be Zeta-Jones but she wasn't really a part of the 11 as she was trying to trip them up and working against them the whole film?? It was more like the story of Brad and Zeta-Jones' characters boring relationship with some bits from the original movie thrown in just to get some bums on seats to watch the movie.With O-11, the gang were always a step ahead of Benedict (Garcia). They were always able to outsmart him. What happened here? He catches up with them after a tip-off and suddenly they're all wusses? The whole movie is so that they can raise the money they stole plus interest to repay back Benedict for the heist they pulled on him 3 years earlier. So next movie they're going to develop courage and brains again and get him back for making them pay him back for the first heist? Puh-lease...This movie could have been achieved with just Brad Pitt, Zeta-Jones and 5 mins of Matt Damon for the switcheroo scene.Slow moving movie, not the energy of the first one. I tried hard to like it and I'm usually very easy to please but I'm really disappointed.SPOILER!!! The twist - the whole movie didn't need to have been made as the real heist was done before everything you just saw over the past 2 hours.END SPOILER.Wait until it comes on TV or if you're a fan of the original from 2001 please don't watch this.","I had read the newspaper reviews of this film and I must say my expectations were very low before watching Ocean's 12. I really enjoyed the first movie but this successor is one of the worst movies ever. I would rate it top 5 of the worst movie I have ever seen. Why do I say that? First of all there is a story so thin that Britney Spears Crossroads looks like the perfect action thriller. The fragments that could be assigned the term \"story\" is loosely held together at times but most of the time the movie just moves along with no purpose or drive. The entire story seems forced and the script surrounding the story is even more forced that it become farce at times.The actors show up but doesn't do anything to deserve any credit or appraise. Most embarrassing are leading ladies (Roberts and Zeta-Jones) that either overplay or are extremely plain. Damon, Clooney and Pitt aren't brilliant either. To be honest I really don't understand how they would want to be associated with something as bad as this movie.=== May contains spoilers ==== Camera and editing, sigh where should I begin. There are many unnecessary camera movements that just make the experience painful. Combine that with extremely untactful editing and you start looking for a wooden spoon to carve your heart out. Especially the scene where the entire gang is moved out of the prison to be transported away by car. The camera zoom to each person just get boring and when you are at number 3 of 12 you got the message: wow you are cool and can do simple zoom effects - NOT. I understand that the scene with Tess Ocean (Julia Roberts) playing Julia Roberts is supposed to be funny but it just gets extremely embarrassing and you turn away to avoid experiencing the mess. Bruce Willis. Why? Please explain it to me! WHY???To summarize ... if you have to choose between root canal work and watching Ocean's 12 I recommend the former. Make sure they do all the teeth while you are at it ...","I loved Ocean's Eleven so I was hesitant to watch the sequel but this didn't fall flat the way so many sequels do. It is strange in that it builds off the original, you would be lost without previous knowledge of Ocean's Eleven, but yet it has an entirely new tone and feeling as well as European look rather than the Vegas glitz of the first movie. I was very happy that all of the originals came back for the sequel. If you like a good action movie that keeps you guessing then this movie is for you. It was very nice to see Brad Pitt's character fleshed out more in this movie. I would like to have seen more of the banter between the Malloy brother characters but on the whole the movie left me wondering if there will be an Ocean's 13. There seemed to be an opening for one with where they left the Night Fox at the end of Ocean's Twelve.","Ocean's 12 starts off on annoying and gets worse from there on. Like a celebrity awards presentation, each major actor/actress is introduced in short 60-second scenarios that seem to stop just short having a blinking \"applaud now\" sign. The first 60 minutes of the film are incredibly disjointed, poorly edited, and at times, utterly unrelated to the story and confusing. Speaking of the story,...there is one, kinda,...but its barely visible for all the \"look at me\" shots and cameos. Only Matt Damon seemed to actually \"act\" during this film...the rest of the cast appeared to only be there to participate in a rat-pack-wanna-be session. As for the heist, the action, the drama....it was put into the last 8-10 minutes of the movie and was pathetic and anticlimactic. Horrible! Horrible! Horrible!","I can honestly say, which doesn't happen often, that I would have preferred to have just not seen this movie all together. I feel like the actors in this movie got together, realized they could do whatever they wanted and people would still come see it, and made a travesty of the first movie.The heist is these actors taking a good movie, Ocean's 11, and using a sequel to steal about $7.50 per person in theaters. The story was a real sell-out, the characters were trying to be clever for the sake of being clever, and at the end you ask yourself \"That's it?\". The majority of the movie was the actors just trying to fill up screen time. I'm sure at one time during the production they said something along the lines of \"We're short a half hour! ... no worries! We'll just remove people from the plot for no reason ... and cameos ... \".I don't want this to be a spoiler. But that's all you're going to get if you go see this movie. A spoiled version of the first.","The 2001 remake of Lewis Milestone's \"Ocean's Eleven\" is a good adventure, with action, comedy and thriller in an updated screenplay. When this sequel was released, I was impressed with the number of stars and locations mostly in Europe, and certainly a huge budget. Unfortunately, this movie does not have the most relevant component: a decent screenplay. The beginning is confused and most of the situations and dialogs are not funny, being indeed ridiculous; when the execution of the heist is disclosed in the end, it is ludicrous; and the absurd plot itself is totally unbelievable and does not work. The direction is also very bad, with horrible and weird movements of camera. Steven Soderbergh began his career with exceptional works, but his last films are very deceptive (\"Full Frontal\"(2002); \"Solaris\"(2002)). My vote is six.Title (Brazil): \"Doze Homens e Outro Segredo\" (\"Twelve Men and Other Secret\")","There are certain times at the cinema when it slowly becomes clear that you're the only person who is loving the film. A weird chemistry occurs in which your enjoyment of the evening is diametrically opposed to everyone elses. And so it was tonight during Ocean's Twelve. It really isn't the film anyone was expecting, but that actually means is so much better. If you're a fan of the first film because of all the heist hijinks you'll probably hate this. If you're a fan of Steven Soderbergh and seen all of his films, you'll just love it.I don't want to talk about the plot here because frankly you wouldn't believe me. Just when you think the film is going to settle down into some kind of recognisable rhythm, something entirely unexpected is thrown in turning everything on it's head. You know the moment at the end of the first film when everything you thought you saw turned out to be something different? Pretty much every scene here is like that. Which is probably were I and nearly all the mean spirited reviews I've read part company. The general feeling seems to be that the plot was thrown together and the story lacks structure. Well yes that's the point. Soderbergh's messing about with what you're allowed to do in a so-called typical Hollywood sequel. It's experimental rather than erratic.I'll admit to a degree that is a greatest hits of Soderbergh's greatest hits, with a variety of film stock and messy camera angles on display. Flashbacks are in full evidence as are the freeze frames and captions in multiple fonts. But so what? Would it have been better if some hack had been hired to trot out a clone of the first film, clinically perfect without any passion? He should be applauded for not making the same movie again, opting instead for something which resembles his own Full Frontal, with obscure film in-jokes intact. Go with an open mind and a clear heart.","I absolutely loved Ocean's Eleven. It was well-put together, contained great performances, and was endearing. The sequel was a pathetic attempt to cash in on a franchise. Hopefully, it will never be considered a black eye on the success of its predecessor.The problem with the movie is its similarity to the first movie. In Eleven, the synergy between George Clooney and Brad Pitt is entertaining. Twelve overuses this relationship. Eleven took the time to explain why so many thieves were necessary during recruitment. Twelve seemed to struggle to fit all of the characters into the plot.I left the theatre with the feeling that I'd just seen a very cheaply made imitation of a great thing, like the Mexican reproduction of Birds, entitled Beaks. I'm still expecting Brad Pitt to leave me a voicemail apologizing for the movie in its entirety.","A heist movie works on the premise that the audience is in on the heist. We dread the incredible security measures. We get to see the planning and the development. We marvel at the skills of each expert. We experience the same suspense and drama as the characters. Ocean's Twelve discards all these elements in favor of creative editing, avant garde camera work and superficial writing. It tries to extract great performances from so-so actors. O.K. so they all are beautiful people. That doesn't mean they are automatically the best actors. It doesn't mean that they can carry a film on their performances. Clooney and Pitt are no Newman and Redford. The acting talents of Catherince Zeta-Jones have never been anything to write home about. Only Finney in a tiny cameo draws any real emotion from the audience.The best heist movies have real suspense. This film has none. The outcome is never in doubt. No matter how the surface of the plan is seemingly foiled...everyone is in on the far deeper \"actual\" plan.On major problem is Garcia's character. If the original \"11\" successfully pulled off the job we are made to believe they did in the first film, they wouldn't panic and crumble like a house of cards to Benedict's pressure and scare tactics. In fact, once a member of the cadre had been contacted, survelliance would have captured Benedict's strong arm tactics and bellicose threats immediately. The man would have legal challenges beyond belief. It's not enough to know who robbed you. You must have proof, otherwise the worst threats would be a laughing matter for seasoned pros.","The sequel to Ocean's Eleven is dreadful. Let's look at the first one, it was funny, interesting, and had some unique characters. In this one, the magic of the first one is stripped away. It's unfunny, it's uninteresting, and you don't even see most of the characters for more than a minute. It begins with Terry Benedict(Garcia), the villain from the first one, going around acting cool while letting the Ocean's Eleven know that they had two weeks in which to return his money with interest or he would have them killed. The team then goes to Amsterdam to try to get rich. They are then confronted by a good thief who calls himself the Nightfox(Cassel), who thinks he's better than the eleven and challenges them to a thief duel. First off, what a crappy plot, it is also dreadfully predictable. While watching, you don't connect with any of the characters and any so called \"fun\" that you are supposed to have is ruined by terrible camera work, annoying music, and annoying transitions. If that's not enough to make you reconsider and see a good film like Finding Neverland, then you'll be in for a treat. Perhaps the worst thing about this disaster is that in the middle of the film, in a failed attempt to have some laughs, Julia Roberts has to play Julia Roberts in a heist operation. And if that's not bad enough, they also hide a pillow underneath her shirt to try to make her look pregnant and have Bruce Willis in a cameo playing himself meet up with her and that add to the chaos. Any way you look at this it's a terrible film. 1 out of 10.","I think this film is meant to be a piece of installation art. It is a heist film that has robbed millions of people of small amounts of money, whilst cleverly featuring no actual heist on screen. Brilliant. Bravo. Author! Author! Please, I implore you, do not watch this movie. It re-defines the word \"dreadful\". The reviews here tell you all you need to know. The appalling acting - the total lack of a script - the confused direction and editing - the painful sight of Julia Robert pretending to be Julia Roberts and the mighty Bruce Willis standing around waiting for his cheque.I just want to post a warning that you will feel mugged and dirty afterwards."],"review-user":["andrewwastie","mungo39","goodale69","crliston1","katmarsen","arahman","Sweet_Ophelia","jackson-50","patrickjw","SkdRow8","NiGe2011","Special-K88","movieguy1021","chickentucker","normano","mats_lundberg","Maxi-14","dkar3","fartdoctor","claudio_carvalho","feelinglistless","SuperBaes","stevetseitz","rt3sdavison","marcusedenellis"],"review-date":["22 December 2004","1 June 2005","13 December 2004","12 December 2004","11 December 2004","19 July 2005","11 December 2004","26 March 2005","14 December 2004","11 December 2004","13 December 2004","18 December 2004","15 December 2004","12 December 2004","29 December 2004","3 April 2005","6 May 2005","10 December 2004","11 December 2004","11 June 2006","28 August 2005","15 December 2004","12 December 2004","13 December 2004","27 August 2005"],"review-rating":["5","1","5","4","2","1","5","1","5","1","6","1","1","1","10","1","1","6","10","5","6","1","1"],"review-title":[" When egos meet\n"," Even Sinatra would have said 'no'.\n"," Huh?\n"," I'd might expect this crap from this cast...but from Soderbergh?\n"," The Ultimate Heist Movie-- *I* was Robbed!\n"," A Complete Mess\n"," Leaves you pining for '11'\n"," Insulted my intelligence.\n"," Awful\n"," That's IT? No, really, that's IT?!\n"," Neither awful nor amazing...\n"," a mistake\n"," Ocean's Twelve: 6/10\n"," Crap, Crap, Crap, Crap (SPOILERS)\n"," What the ...?\n"," Top 5 worst film ever\n"," A Surprise!\n"," Horrible, self-serving, disjointed movie\n"," They steal YOUR money, that's about it.\n"," Great Cast and Budget Wasted in an Awful Screenplay and Terrible Direction\n"," weird chemistry\n"," Huge Disappointment\n"," Too clever for it's own good.\n"," Puts the first one to shame!\n"," A cinematic mugging\n"]}