{"review-url":["http://www.imdb.com/title/tt0391229/reviews"],"review-text":["Garlin did a great job. Nice concept well executed, and tightly produced. Came across as a very sincere story. As a fan of \"Curb Your Enthusiasm\", where Jeff was pretty much the straight guy role, I was delighted with how much depth he brought to this role in a simple yet effective portrayal.Much of the humor was understated and subtle and drew on poignancy, which I really liked, rather than being slapstick or over-explained. And there were some nice little surprises and twists. The convenience store vignettes were a delight.When I say it is a wonderful \"small\" film, I don't mean budget or quality. It is simple, intimate and hand-crafted. It tells a highly believable everyday story. Relax and go see it. Let it wash over you, and you will feel good for having done so.","Any movie that offers Bonnie Hunt, Sarah Silverman and Amy Sedaris in the supporting cast has to be well worth watching, and comic actor Jeff Garlin takes advantage of the terrific talent he recruited for his 2007 directorial debut, a sad-sack comedy about an overweight man who feels out of step with the world around him. Familiar as Larry David's manager Jeff on \"Curb Your Enthusiasm\", Garlin plays James, a still-struggling, 39-year old Chicago actor who still lives with his widowed mother. His self-esteem is so low that he can't meet women, but it's the comical way he views his single status that makes his dilemma involving. If the storyline sounds a bit familiar, that's because the film is partially a tribute to the 1955 Ernest Borgnine classic, \"Marty\", about a lonely Bronx butcher living with his meddlesome mother. In fact, Garlin uses \"Marty\" as the play which James is desperate to do since he is so empathetic to the character's situation.Naturally there is a love story of sorts in this new millennium version, and Silverman plays Beth, an off-kilter, sexually voracious ice cream parlor server who takes him on an underwear shopping spree. Their best scene together is in his favorite convenience store where they improvise different characters in different aisles. Hunt plays a lonely elementary school teacher who shares a passion with James for jazz musician Ben Webster. They meet accidentally in a record store and then again at a career day at her school where he hilariously exposes his sexual neuroses in front of a classroom of first-graders, including his best friend Luca's pert daughter Penelope (played by Dakota Fanning's look-alike baby sister Elle). In a wedged-in cameo and looking quite a bit like Jerri Blank, Sedaris plays the school's counselor who speaks to James after his inappropriate monologue. David Pasquesi plays Luca, a retirement home manager, and his scenes with Garlin have an easy rapport that makes their friendship easy to believe. Almost stealing the movie is character actress Mina Kolb, who plays James' pixilated mother with pluck and heart.There are also unexpected cameos from teen idol Aaron Carter and Gina Gershon (don't askbut the set-up is funny), as well as sharply played bits by director Paul Mazursky (as the snaky director of a candid-camera-type show, \"Smear Job\"), Tim Kazurinsky (as the unsuspecting victim of that show) and Dan Castellaneta (as the tough-love convenience store owner). With his rueful bouts of insecurity and self-loathing, Garlin's comic sensibilities resemble those of Albert Brooks, and the casual dialogue at its best reminds me of \"Modern Romance\" and \"Defending Your Life\". The one persistent problem I had with the film is pacing as some scenes dragged out longer than necessary. The problem is more evident in the first half when Garlin is trying to establish the right tempo, and the lack of real conflict adds to the sluggishness. Regardless, what he does well is capture that gnawing sense of desperation one feels upon the revelation that life is not what it is supposed to be, that a significant other may be out of reach, and that a steady diet of junk food eaten on a car hood is the only sure thing when it comes to gratification.","My original title for this review was going to be, \"Ending disappoints, Film triumphs.\" But I actually thought about this one on the way home. It is not the fairy tale most of these films are, it takes turns that are different and while its ending is at first disappointing, it slowly sinks in and hits the core on a satisfying tone.The plot follows a man named James Aaron(Curb Your Enthusiasm's Jeff Garlin, who also wrote and directed) a struggling actor who lives in Chicago with his mother and deals with both his obesity and his inability to find someone to love.Yes, it sounds corny, but it experiments with elements that make it somewhat unpredictable, and actually makes you wish it were longer. The ending came kind of abruptly and had me saying, \"that's it!?\" But once it starts to take it's toll, it really makes you smile.It does have many tones of seriousness throughout, but fear not, for it is also very funny. Some scenes offer huge laughs, and those who have seen Jeff Garlin's stand-up will recognize a couple (Primarily when he gives a speech at career day for his niece's kindergarten class and bombs). It begins on somewhat of a serious note that you do not expect, but what follows is very funny, entertaining, and quite poignant as well. It is the kind of movie that you keep watching and always enjoy. And as I said before, while the ending may seem absurd at first, once you take time to think about, it is a true joy.","Garlin outdoes himself as writer-director-actor in his indie production about a big guy (Garlin) wandering around Chicago with an eye for every woman he sees. The laughs keep coming almost every minute. It's a somewhat dramatic and serious story about a man looking for love, but done with great comedic writing and acting. The supporting roles are also very well done and very funny and really make the movie rich.Rose Abdoo is hysterical in her receptionist role taking you right into the mood of the rest of the film. Sara Silverman is awesome with some of the great bits she does with Jeff. Bonnie Hunt is classically great in her role. I only wish there was more of her in the film, as I think most will agree. It's certainly refreshing to see her in a tight leather outfit.David Pasquesi was the aloof detached sidekick, and voice of reason. Mina Kolb plays Jeff's mother who he lives with. There were numerous other cameos, all of them done very well.At the premier Jeff mentioned his inability to do more with Bonnie due to production issues. Still, it's good to leave you wanting more. I think it's that indie thing of keeping some things ambiguous to let the audience do some thinking for themselves to fill in the blanks. The wordy title should clue you in to this.Jeff said some of the basic characters were based on his past relationships. This explains why they work so well. Real life people are always unusually colorful and makes great characters. He departs quite a bit from what you might expect, having seen Curb Your Enthusiasm and some of his other work. It's one of those break out things where an actor takes some risks to do something they maybe always wanted to do but couldn't.I think it's noteworthy that Garlin's improv Second City background, and Hunt's for that matter, set the style here of acting being the focus of the story and the directing. It's perhaps a new innovative hybrid of improv meets indie film-making.","Garlin is unquestionably a comedian's comedian and a comedian to anyone looking for a good time. His first film, which is entirely his own creation and production, tells the story of a struggling Chicago actor James Aaron with whom Jeff obviously identifies. He wonderfully juxtaposes James to Paddy Chayefsky's \"Marty\" and to Jackie Gleason's Poor Soul as he exposes James' dilemmas with an array of actors that in real life are Jeff's friends, many who are fellow Second City alumni.He delightfully uses Sarah Silverman's diametrical cuteness and scathingly absurd humor to exemplify how despite common sense and talent, life's contentment can too often belie unyielding frustration. Bonnie Hunt gives an endearing performance as a romantic interest.Don't let a simple story mislead you, the characters and conflicts are well thought out and ring true. Those that follow Garlin's career and understand that his humor is based on telling reality humorously, not necessarily creating fiction which too easily can be contrived, will appreciate his dialogue driven story.We surely will see Garlin working much more as director and writer with other talented intelligent comedic actors who undertake the great challenge of making life funny.","Jeff Garlin's film is filled with heart and laughter. As in Curb Your Enthusiasm, his screen persona is hilarious; but in addition we get to see both warmth and a sense of emotional vulnerability that makes the story universal. While the film chronicles his character's dreams of love, performing success, and weight loss, it will appeal to anyone who dreams of a better life. The supporting cast brings the frustrations and joys of his life to the screen in funny and heartbreaking ways. The simple joys of food, friendship, and trying once again once life has disappointed us are all themes. The use of music is creative and adds to the many pleasures of this film. Any fan of Jeff Garlin's TV appearances must see it!","This film is about a struggling actor trying to find satisfaction in life, especially love which he has not had a taste of for 5 years.It basically is a film featuring a man with very poor social skills, and he says wrong things all the time. The plot is hollow and contrived. The main character, James, is lonely, but this theme of loneliness is not adequately explored. It is more like an empty statement which other subplots stem from. Sadness and disappointment after being dumped are superficial. There is a serious lack of emotions in the film.It is not funny as a comedy either. There are some funny one liners but that is it. It lacks the happy and uplifting atmosphere to infect people with happy mood. I don't find \"I Want Someone to Eat Cheese With\" funny.","I enjoyed this film for the most part, but there are a lot of problematic things I'd like to point out.First, let's say what's good about the film. It's clever, and the characters are well rounded and quite honestly, the main character is entertaining in his own awkward way. The love interest aspect of the movie actually ends up taking a backseat to this man's somewhat depressing life, but the film never stops being a little charming. The problem, though, is that it's been advertised as a romantic comedy. It's not.Mostly it's a sitcom in the form of a full length feature. Anyone familiar with the formula of Seinfeld or Curb Your Enthusiasm will recognize the setup of many jokes and situations throughout the film (Jeff Garlin is a producer and character on CYE, so this shouldn't come as a surprise that they're very similar. Even down to the soundtrack.) My girlfriend and I picked this one up after seeing the trailer and thought it would be a funny romantic comedy. But, as I've already said, the relationship aspect to the film is only a side note. Sara Silverman's character gets maybe a total of fifteen minutes on screen, and is not anything like the trailer portrays. To make a long story short, my girlfriend fell asleep a long while before the movie ended, and I, while I thought it had it's funny moments and made a decent \"indie\" film about the life of a depressed overweight man, was a bit disappointed that there wasn't a stronger romantic aspect to it since that's what I was expecting. The movie in its entirety seems like Jeff Garlin's attempt to emulate the style and comedy of Curb Your Enthusiasm with a slightly more true-to-life tone. I could see this main character becoming a character in a sitcom, and part of me wonders if this wasn't some type of offshoot of a project that was originally intended to be a sitcom, or something that Garlin hoped would be well received enough for someone to give him his own show.Six out of ten because of its charm and several funny moments, but seriously disappointed with the misleading advertising.","Great ensemble cast but unfortunately a bunch of undeveloped ideas make the film drag. One feels not fulfilled at the end after waiting for some kind of conclusion, closure, or at least an ironic twist.It had that familiar \"Curb\" feel without dare I say it, Larry as the annoying polar opposite. The music was there, the 'show about nothing' scenes pop up, but without any common thread or suspense - it falters as a solo project that ran out of budget.Spoilers: The movie title speaks about cheese but she prefers the rice pudding. Is cheese a better selling title than rice pudding? He prefers just any junk food, regardless of the sell by date. Maybe I want someone to eat 'cheese-dogs' or ice cream in a pirate suit would have at least tied some scenes together.Marty: this is just not funny and overdone. People just don't care about a 'show' within a show. A coffee book table about coffee books was funnier.Unless you are big fans of the cast, save your time and eat some cheese. It doesn't even have to be with anyone.","Anybody expecting the acerbic wit of Curb Your Enthusiasm (due to Jeff Garlin's presence) or the belly laughs of Something About Mary (due to Sarah Silverman's presence) will be sorely disappointed. The film isn't bad, but \"not bad\" is hardly a recommendation, which is a shame, because there's some great talent involved. Jeff Garlin seems to have cashed in a lot of favors with Second city alumni and fellow stand-up comics to help him out on his feature film directorial debut, and I'm guessing that none of them will be putting this on their resumés. It's got several inspired plot mechanics that go nowhere, like the fake cast of \"Streetcar Named Desire\" starring Aaron Carter and Gina Gershon (who are both great at scene stealing, which is quite a feat when you read the laundry list of well known participants) but someone should have told director Garlin that cameos do not a film make. The film is essentially without plot and tends to meander from one situational set-up to the next without really developing a story. This lends an episodic feel at best and at its worst, it comes off as mundane. It seems to be going for an early 90s indie-comedy nostalgia, but it lacks the innovation and quite frankly the era that made those films appealing. It's shot well, but still has a stagy, direct-to-video look, and the music is so dinner-theater schmaltzy that you'd swear this was shot-in-Canada (it wasn't). The performers are obviously having a good time, but the whole project seems to be about ten years past relevance, and I -for one- have always hated watching performers have an obviously better time than their audience, but at least nobody is ghost walking through their roles, which lends an improvisational spirit even if it goes nowhere. It's not offensively bad; it's definitely watchable. But if you have any expectations arising from the supporting cast -actors from Little Miss Sunshine, Strangers With Candy, The Simpsons- you'll be more than aggravated that you wasted your time on this rather than rewatching one of those aforementioned titles instead. And with the title \"I Want Someone To Eat Cheese With\" they've all but assured that nobody's going to watch it anyways. You can do a lot worse, but you can do a whole lot better, too.","\"I want someone to eat cheese with\" was an okay movie. If you don't like Jeff Garlin or Sarah Silverman you might not like it. Jeff Garlin was cute and brought character to this movie. Sarah Silverman was funny and nothing less than she normally is.The plot was a bit prolonged. But if you really think about it, the \"prolonging\", if you will, was necessary. The end might upset you if you expected a sappy, long-lasting love for James (Jeff Garlin). If you see it more than once you may get the foreshadow in the beginning that explains the end.Enjoy the movie that's not without it's charm.","This movie is like an 80 minutes long episode of \"Curb Your Enthusiasm\", except there is no Larry David, and Jeff Garlin is now the main character. We can say that Jeff would be Larry, and David Pasquesi would be Jeff. This movie is so much like that show, that many of the actors have been on the show, and in some scenes even the soundtrack sounds exactly the same. I don't mean that this is all bad, but Jeff, some originality please.The movie it self has quite funny parts, but most of the time you are just looking at the screen with no emotions, you are not bored, but you are amused, you don't want to laugh, and you don't want to cry, you are just watching and waiting for something to make you either give up on it, or really want to keep watching it. In fact, that is what I feel when I watch the TV Show also, one more common thing between them.I was also expecting something more from this movie since most of the actors are well known (in the comedy area). It was a bit of a disappointment in that chapter.Eitherway, if you like \"Curb Your Enthusiasm\" you should definitely watch this movie, if you hate it don't watch it. If you are like me and liked some and hated some, watch it because it's only 80 minutes long.","As a recent convert to Curb Your Enthusiasm, which prompted my viewing of all season's episodes, I expected more, much more from Jeff's efforts.When I view a film offering a slice of an average 'Joe's' life I need reasons to be interested, to care, to feel and believe. And with Jeff Garlin at the helm I also expected a bevy of shining comedic moments. This film failed me time and again.Jeff plays a living with mom, plump sad sack who is a social disaster. He has not had a relationships, real or even casual, for many years. He appears to be mostly unemployed and, as noted, shacks with his mommy dearest. Can things get worse? Sure. In short order he gets sacked by everyone around him including Silverman, Second City (his comedy workshop) and his agent. All reinforce his 'loser' status. Silverman's 'fatty' experiment was as cruel as it was absurd. His obsession with the role of \"Marty,\" as the means of his career's salvation, also hits a big dead end.While the film's final moments offer a glimpse of better things to come the cinematic 'journey,' albeit with occasional golden glimmers, was sadly lacking.","In an early scene, Luca (David Pasquesi) and James (Jeff Garlin) are walking down a neighborhood street in Chicago, admiring the bucolic architecture, when a woman, angrily arguing in French on a cell phone, passes by them, prompting James to remark, \"There's nothing hotter than an angry French woman.\" A few blocks later, they pass an old Filipino woman, also angry, also arguing on a cell phone, and Luca remarks, for referential effect, \"There's nothing hotter than an angry, elderly Filipino woman.\"The humor in Jeff Garlin's I Want Someone to Eat Cheese With is best characterized by the word quotidian. The film is a conversation. We might as well be eavesdropping. Rather than go for antics, the film relies on character flaws and human curiosity to deliver laughs. While it's not innovative, it is far from banal, and even if James views himself as being rather jejune, we know that he is fairly average, and this endears him.Self-betterment is the primary theme of the movie. Sarah Silverman, who plays Beth, is excellent as the catalyst of change; she revitalizes James, and so reminds him to live a better life. Even so, achieving some idyllic dream is not the end of these characters, but rather something simpler: that they might pick up what pieces there are of the life they love, just to keep for themselves at least enough to carry on.A movie about life lessons can be overwrought, as it can forget to connect with its audience. I Want Someone to Eat Cheese With is subtle and winsome, and while its moral may not be inspiring, it is still resonant. This is low-key comedy, but it will stick with you.","This is absolutely awful. It's everywhere & nowhere & doesn't have any sort of point. I have never understood what is good about Jeff Garlin or Sarah Silverman. Bonnie Hunt is so above this drivel she must have been personal friends w/people involved because there is no way she would have read any part of this so-called \"script\" & thought, \"Yeah I wanna do that!\" Most movies I can find at least one or two things that are redeemable or funny. There is ZERO of that in this. It's extremely dumb. There really isn't any other word to describe this. This is quite possibly the biggest waste of money on making of film that I have seen in a long time. Skip this at all cost, you'll be glad you did.","Has the proliferation of relatively high quality shows on the proliferating TV networks made it possible for people to produce, direct, finance and/or star in their own films who might otherwise not have been able to? Is that a good thing? This film does not answer the latter question either way, but it does appear that without Curb, Jeff Garlin would not have been able to make I Want Someone to Eat Cheese With. Like most new producers/directors, Jeff Garlin's independent piece heaves a heavily more sensitive sigh than the vehicle he is primarily known for (Curb). And yet, is it a sensitive guy film? He isn't really a sensitive guy. Likable, sure. Relatable, indeed. What this film really is about is a bit hard to say, I can only relate what I took away from it. I rented the film because of the trailers, particularly the scene of a counselor portrayed by Amy Sedaris informing James Aaron (Garlin) that a particular woman is interested in him mainly because she is a \"chubby chaser.\" I just about fell out of my seat. Based on that scene alone, I ran to my computer to write a note to myself to rent this movie. The reason - I thought the school counselor (Sedaris) was talking about Beth, portrayed by Sarah Silverman. I imagined a lightish romantic comedy between the foxy Silverman and the fat Garlin. I didn't think the story would be anything original, but that the dialogue would be snappy and the scenes would move along at a satisfying pace. In short, I thought it would be a comedy. It was intriguing that the film started out that way but then took a much much more realistic turn when Beth gives James the heave ho because \"I've never really been with a fat guy before.\" That is how brutally we live life, and it was completely realistic. I applaud the decision. It just meant that Beth has now left the building and with her, the one snappy person in the film.James's relationship with his mother was also interesting. That part made me wonder if the whole concept did not start out as a play. It had that intricate feel to it. (The whole \"Marty\" movie within a movie thing was utterly lost on me, as I have never seen that film.)There were serious doubts I had about the character of James Aaron, though. Is it really possible that at 39 he had not had a serious relationship? And he is an actor? That did not really square with me. To me, his persona was less actor-y, and more corporate. I could not really buy his ordinariness either. No doubt he was extremely disappointed that things with Beth did not work out. We felt that. But then, did he really care? Another thing - how in the world can both he and his mother afford to move out at the same time? Hasn't he just lost his job? The last one he had? That was one reason he did not seem ordinary to me. Where's the funding for his life coming from? And yet, I have read reviews that talk about the realistic portrayal of urban loneliness, so there is that. Yes, it is very realistic, the way we must be satisfied with what we have because it is all that we have. The way we sort of disappear from ourselves and each other in interactions (James and Stella), some kind of self-effacement that takes place just to move on to the next moment. That, contrasted with the possibility of defining ourselves through our moments, our thoughts the way James had with Beth, it's really crushing.Very well done.","This is probably the worst film I've seen in ages and I've seen a lot of films.It's like a really bad episode of Curb Your Enthusiasm where nothing is funny and there is no Larry David.Sarah Silverman is slightly funny but the whole film is so badly written that after about 10 mins I wanted to stick pencils in my eyes.It would be more fun just eating cheese, lots of cheese. So much cheese that you turn into a really fat man, become an aspiring actor, get dumped by your girlfriend and then star in a really terrible film.Jeff Garlin you should be ashamed of yourself.","How i deserved to watch this crap??? Worst ever. The acting was awful, when i read that this was a comedy i expected at least to smile, once - or twice, but.... If you are wiling to loose hour and a half of your lives, this is the right movie. I recommend just look in a wall or something, anything else but watch this \"film\". Yoy can even watch a documentary (if you are a guy) about pregnant women, i guarantee it will be more entertaining :)The actor in this one (i forgot his name) is not that bad, and i am surprised how hi accepted the role. Anyway \"I want someone to eat cheese with\" is the right film if you want to punish someone.","\"I Want Someone to Eat Cheese With\" is one of those movies where you are supposed to feel sorry for the hard luck case in it, but really you just can't get past how much better his life is in it than it would be for someone in a similar circumstance in reality. What's depressing is that there are very few, if any, movies made about people like this which are realistic at all, perhaps because such a movie would be too bleak for anyone to bear sitting through.The character played by Jeff Garlin, James, is an overweight, underemployed actor who lives with his mother and has, the back of the box tells us, \"problems with women\". He still manages to snag the gorgeous Sarah Silverman, who sexually propositions him on their first meeting.When the movie begins another girl, also ridiculously good looking for a guy like James, dumps him, and again I guess we are supposed to feel sorry for him. I'm sorry, but the fact that he got a girl like that to go out with him in the first place, and then later repeats the trick with Silverman, makes him well and truly above our pity. He should be pitying us. Are you having a hard time feeling sorry for him? I was.The movie is typical low key comedy stuff: dialogue which is humorous but never laugh out loud funny. It's not outrageous enough to really make you laugh, but it might make you smile.","This is a tedious movie filled with actors that have all done better work. My whole thought during the movie was........OK now what. They kind of tried to make it about a fat guy but it could have been ANY guy who can't make a decision. The story didn't have a point other than this guy cant push forward in his life. I mean if you just want to watch a movie with a lot of recognizable actors just for that purpose watch one of those multi plot deals. They are in general just as boring but they have more \"stars\". I was reading this movie cost 1.5 million dollars. HOW the hell did it cost that much?!!? I am pretty sure he knew everyone in the film and every venue. His friends hate him to make him pay that much for this movie. I made the choice to watch this flick and now I am making the choice to never talk about it again.. I want that time back but I am pretty sure I could use it to just sit and look at the wall and think of fluffy bunnies and still been more interested.","So I watched \"I want someone to eat cheese with\". So was it good, well ehhhhhh. I liked it, I am a fan of Jeff Garlin, but its not what I would say is a \"good\" movie. It is likable though, if you enjoy quirky comedies, which I do. I will say I thought the references to the film \"Marty\" were very apt, considering the plot, and I did like how this guy was basically a very lovable loser. If you enjoy indy comedies, you may enjoy this movie, but if not you can probably skip this one. I really have nothing else to say about this film. if you like concise reviews of interesting films please read my other reviews at http://raouldukeatthemovies.blogspot.com/","If you like \"Curb...\" you will like the main character, as they are so similar to the \"Curb..\" formula. I should watch the entire thing, I guess, before making comment. To me it's a one-trick pony film, and the trick is insignificant, if I see it at all. \"Chubby-chaser\" jokes are typical of this low-rent, low-interest genre. Perhaps this is meant to have all sorts of important underlying comments about weight, rejection etc, but there is nothing subtle or watchable about it to my eyes. Sarah Silverman is OK, for the time I saw her in the movie at least, but nothing special. That rally sum up this film, for me, in that it is Nothing Special, just typical.","I Want Someone to Eat Cheese With reminds me a little bit of World's Greatest Dad. It's marketed as a comedy, when really it's a drama. The front cover of the film is quoted in being \"Hilarious\" when it's anything but. It's a melodrama that is only chuckle inducing rather than constant hilarity as one may assume. Personally, I find nothing funny about a down-on-your-luck, heavy set man going through almost a midlife crisis. I don't find the humor in that.Jeff Garlin stars as James, an obese man who's luck has seemed to be at a halt. He works at Second City, an improvising show in Chicago, and he loses his job, lives with his mother, his girlfriend leaves him, and he sneaks out of his Overeaters Anonymous seminar to go to an ice cream parlor. He meets a plucky and younger woman named Beth (Silverman). Beth gives him an ice cream snack she made as practice and even questions James if he's ever done anything kinky.James and Beth hang out the next day and it's beginning to be noticeable that both are getting attracted to one another. James continues to go on with his every day life which involves a goofy show or two, and hanging out with his friends. My favorite, the clerk played by Dan Castellaneta.The movie tends to hit starts and stops, and sometimes seems as if it is not progressing at all. It's short and sweet, but Garlin works through the film softly and calmly. He doesn't rely on regular humor most romantic comedies do and it certainly isn't formulaic. Its got the humor of Larry David's show Curb Your Enthusiasm, which Jeff also stars in.Shot in eighteen years, but spread over the course of almost two years, I Want Someone to Eat Cheese With is a strange, strange little film with some off the wall humor and some very well crafted characters. I enjoyed Garlin's sweet and simple attitude, Silverman's presence, and its far from cliché ending. This isn't the most eventful rom-com, but it's one that shows love in a different light. With IFC Films on the cover, it is surely far from the Hollywood light.Starring: Jeff Garlin, Sarah Silverman, Bonnie Hunt, Dan Castellaneta. Directed by: Jeff Garlin.","The dialog has that rare combination of smart, quirky, and subtle that is such a thirst-quencher for the intellectual. This is the thinking man's Marty. No, I had never heard of it either, but it might do you well to get a little familiar with the 1955 movie with Ernest Borgnine before watching this one, e.g. the excerpts on YouTube. And not only because the plot talks about a remake.Jeff Garlin, charming, never maudlin.Sarah Silverman is her thoroughly attractive self. As the lead says, what can he do, he likes them young and insane. When she's uncomfortably over-the-top, it's the character's fault, not the actor's.Bonnie Hunt, what can I say, she is never less than a treat with a cherry on top.The main thing I'd add to the excellent reviews by Ed Uyeshima and CountryJim: pay close attention. The last three minutes say an awful lot. The big twist in the middle left me feeling abandoned. The denouement at the end tied me back in.","The musical theme is a sprightly French tune led by an accordion that might develop a psychological set in the viewer, something like: \"Oh, good, a Jaques Tati kind of movie!\" Mais pas de tout.Jeff Garlin is a good natured enough Chicagoan and a little clumsy but there is no slapstick worth mentioning, he minds his own business, his innocence doesn't get him into trouble, he speaks loudly and emphatically, he's ambitious rather than feckless, and he's burly instead of tall and skinny. But he shares with M. Hulot a polite regard for the welfare of others.The problem with Jeff Garlin, a cast member of Chicago's Second City, is that he's not particularly handsome and he's overweight. By the way, I don't know if it's intentional or not, but the Second City sketch we see, something about Garlin's being a hillbilly who likes corn, is anything but funny. At any rate, his weight and his features, which are about as interesting as a hard-boiled egg, don't get him very far with the girls. Invited to speak about himself and his job before a class of kindergartners, he announces loudly, \"My problem is that I need to get laid.\" The little kids sit there dumbly while their teacher's jaw drops. It's one of many cute scenes. Then there is his mother, hanging over him, predicting his every move and divining his every thought.Then he bumps into Sarah Silverman and begins to get resonant vibes. She's an interesting actress. She does well by a rather complex role. She's attractive too, with her vulpine face and her eyes set so close to each other across the bridge of her nose. And she's surprisingly well built. She's trying on underwear in a department store and Garlin is doing his best to sneak sidewise glimpses of her behind the curtain. A sales lady comes to him and asks him to take another pair of bra and panties to \"your girlfriend.\" This struck a personal chord because I was once asked to do a similar favor for a beautiful girl I hardly knew. (I gulped and complied.) I don't know if I should reveal why an attractive young woman like Sarah Silverman should be interested in a nice but plump guy like Jeff Garlin. I guess I won't. It's enough that, the next day, Garlin goes around with a big smile and tells everyone, his mother included, that, \"Last night I had sex for the first time in five years.\" It really IS something like \"Marty\" without the drama. There are constant references to \"Marty\" throughout the film. Garlin tries out for the part in a local play, arguing, \"I AM Marty!\" But Marty was genuinely in love with the frangible Betsy Blair, while Jeff Garlin, though he likes Silverman, seems mainly interested in sleeping with her. And Garlin, smiling and puzzled as he often is, never experiences a moment of despair -- which is okay with me, as far as that goes.It's a pleasant enough way to spend an hour and a half and it has its moments of quirky charm, much of them coming from Garlin's oddball friends, like a hot dog vendor dressed as a pirate."],"review-user":["CountryJim","EUyeshima","samuelthemovieman","Alarming_Passion","Panamafargo","dbairdk","Gordon-11","imajestr","weiler97","flickhead","graydra","safinahmed","stevepat99","notevenwordshere","TheEmulator23","correcamino","maia_lloyd","kostovskib","jadavix","evileve2012","rdukeesq","charliesedaka","StevePulaski","BobStein-VisiBone","rmax304823"],"review-date":["3 July 2006","9 September 2007","21 September 2007","1 July 2006","5 October 2007","6 October 2007","5 February 2008","25 February 2008","8 February 2008","24 January 2007","11 May 2008","22 February 2008","23 February 2008","11 July 2008","6 November 2009","6 April 2008","12 April 2010","21 June 2009","22 June 2016","2 October 2013","14 August 2011","4 July 2013","13 June 2011","9 May 2011","28 March 2011"],"review-rating":["8","7","7","6","10","10","6","3","5","6","5","4","8","1","7","1","1","5","2","3","8","7","6"],"review-title":[" Surprisingly poignant, yet entertaining and funny.\n"," Modest Comedy About a Lonely Sad Sack Boasts a Smart Cast to Overcome Its Familiar Premise\n"," Wait for it to sink in\n"," A refreshing indie comedy\n"," Fresh Cheese\n"," Funny and warm-hearted and recommended\n"," Not funny\n"," Another case of misleading advertising\n"," I want cheese but not this rental\n"," Should have been better with this cast\n"," Confusing But Not Without It's Charm\n"," Where's Larry?\n"," Stale Cheese\n"," I like mozzarella, she likes provolone\n"," Pointless, meandering, snooze-fest! Skip.\n"," Sarah Silverman Has Left the Building\n"," Don't do it. Watch something else instead.\n"," If you want to punish someone, just recommend this one!\n"," Depressingly unrealistic\n"," Skip it ..........\n"," daddy day care was sadly better\n"," If You Like \"Curb......\"\n"," Full of hot dogs, ice cream, and hoagie shacks\n"," Light Touch within a Light Touch\n"," Marty Without the Drama.\n"]}