{"review-url":["http://www.imdb.com/title/tt0369171/reviews"],"review-text":["When I saw the promos I thought it would be sleaze. I decided to watch Gary the Rat (which came on before it) because I liked the premise. Then I ended up watching Stripperella. I laughed my butt off!!Ok yes it is a little cheesy at time but that is what makes it so great. Totally makes fun of itself. Great villains like Dr. Cesarian, Cheapo the discount criminal, Klinko, and Pushy Galore to name a few.\nThis show is very adult. One villain was named Queen Clitorus. Which led to the obligatory jokes about not wanting to rub her the wrong way, she is very sensitive, and that men don't believe Clitorus exists. Yes it is immature but still very fun.Cheapo is by far the best villain of all time. His idea of a crime spree involves taking all the pennies in a 'Need a penny, Take a penny' tray, stealing the change from a fountain, and stealing immitation furs.Other great charachters are Chief Stroganoff, Stripperella's boss. He isn't complete upstairs. He has a few screws loose. Special Agent 14, is the mentally handicapped agent. Oddly enough he is fairly intelligent. The lab boys get lot of laughs. They are in love with Erotica/Stripperella and want to make molds of her various body parts at any opportunity.This is a great series and I look forward to many more eps.","This is not Shakespeare. This is not Frank Miller. This show has plot-lines and characters worthy of a sexed-up version of Batman back in the '70s. I loved it.As far as animation goes, both sets of character designs are on par with the good stuff your kids (and some of you grown ups) watch on Saturday morning. It's a lot better than what I used to watch, and I'm not that old. The voice talent is great and the writing is clever, not taking itself too seriously but not leaving gaping plot-holes that can't be explained with the shows own established logic.So, just to warn, the DVD collection does, in fact, have nudity. There is more in the earlier episodes, as a side note. Characters are intentionally gimmicky and not particularly multi-dimensional, making the show easy to pick up and enjoy no matter what episode you're on. The plots, villains, and every other aspect of the flavor is an eerily accurate parallel of Saturday morning cartoons. And the star's influence shines through with the overwhelming amount of animal-rights pushing that happens.All the clichés are there, and all the jokes. There's nothing not to love except that not enough people watched. Put the kids to bed, grab the wife/husband/whatever and enjoy.","I've just watched the 1st episode and this is what I think:  This is the funniest of the 3 new series on TNN.  I never would've thought it but it's great!  Great voices, good animation, plenty of boobage ;).  It's got some great comic book humor and ideas.  Another fun Stan Lee character has arrived!  -Kind of a \"Men In Black: the Animated Series\" but with a lot more skin (well, human skin ;D).  I hope this continues... :D","This show is naughty and raunchy, and appeals strictly to the adult audience. And it sure hits its target. Voiced by super-vixen and sex kitten Pamela Anderson, the show follows Erotica Jones a stripper by night, who turns into Stripperella a superhero by later night. This is the kind of cartoon that makes you feel dirty, just for watching it. I love it!","I was afraid this would be like VIP, only animated. But this is actually a quality show. There is a wonderful mix of trash, CLERKS humor, BATMAN-like art, action, and it's just fun. Pam puts on her best performance here. I wish BARB WIRE was as good as this show. Stan Lee's influence is wonderful too. He even has a small role in the show as an isolated scientist who invents object that already exist. LOLReally fun show. I watch it all the time. 8/10","This show is a great spoof of both the spy and the superhero genres.  I was a little anxious at first, but I was laughing like a high-schooler by the time the show had ended.  As a matter of fact, I think this was a better spoof than the last Austin Powers flick.  That's right.  I said it.","\"Stripperella\" is an animated series about a girl named Erotica Jones (voiced by Pamela Anderson) who lives a double life as a stripper at a gentleman's club known as \"The Tender Loins\" and as a sexy crime-fighter known as Stripperella, a.k.a. Agent 69 who works for a government organization. As Stripperella, Erotica fights crime and the forces of evil such as a plastic surgeon who gives women breast implants that either explode or make them fat and Cheapo, a criminal who steals from 99 cent stores and makes his two henchmen share a gun. The creator of the character and the series is Stan Lee of Marvel fame (and creator of Spider-Man).Back in late June of 2003, Spike TV (then known as The New TNN) premiered a Thursday night block of three animated shows. Those shows were \"Ren & Stimpy: Adult Party Cartoon\"; new adventures of classic kids show characters Ren and Stimpy for adults done by original creator John Kricfalusi, \"Gary the Rat\"; about a lawyer who is turned into a human sized rat starring Kelsee Grammar of \"Cheers\" and \"Fraiser\" fame, and \"Stripperella\"; the adventures of a stripper who doubles as a superhero voiced by Pamela Anderson and created by Stan Lee. I remember seeing all three of the premiers. I was anxious to see Ren and Stimpy as I love the original show. I was a little let down. It was alright but it seemed to take things a little too far; seeing the two have gay sex together was a bit much. Though Gary the Rat wasn't bad, the best of the three was easily Stripperella. The animation was really good, it had an awesome intro song, it had some good talent behind it, and it was funny as hell! The show was just so silly, I don't even know how to begin explaining it! After four of five weeks (if not a little less) the animation block disappeared, which was weird because I know it got good ratings and it was advertised everywhere. I was disappointed to see Stripperella go but several months later I found out about new episodes that aired at like 1:00 AM. I only got to see one and though it was funny as hell and I was glad to see the show back after all that time, something seemed a bit off....In the beginning of it's short run, \"Stripperella\" had great animation. It was dark, moody, realistic, and somewhat sexy too. The Stripperella costumed looked good too, the character was drawn well. After the long hiatus and during the rest of the episodes, the animation was very different. Instead of dark and realistic look it originally had everything was now really colorful and cartoonish. Stripperella received the biggest changes though. Before she had normal long hair, now she had hair bigger than Peggy Bundy's (Married with Children) if even possible. Also, the eye mask actually shows her eyes now; before it was just white you saw which was cool since it was more superheroish. Also, the upper part of her costume was kind of a vest-type thing with a collar and her costume was dark blue; that changed to her costume being a bluish-violet color and her upper costume being really crappy looking in comparison. In short, the show was a cartoon and very over the top silly beforehand, but the second-half it became more cartoonish looking and though still laugh-out-loud hilarious, it became more zany as well; for example, there was a later episode about a were-beaver...yes, a were-beaver. Anyway, instead of complaining about the mid-series changes, \"Stripperella\" only ran one season but it was a very good show. Like the Tales from the Crypt film \"Bordello of Blood\", it may be really campy but it's really fun. As long as your not a prude you'll find yourself laughing repeatedly at this show. I haven't seen every episode because I haven't got the DVD yet for two reasons: #1. Paramount released and they have this screwed up policy about not including any extras on nearly all released TV shows, even though this was the entire show (I would have liked to see some commentary's maby explaining the animation change and interviews with Pamela Anderson and Stan Lee) and #2. the awesome Kid Rock song during the opening was replaced. Now I'm not a fan of his, but that intro sang WAS the theme for the show! If your not going to pay to have any extras at least pay to have the original intro song you jack-asses. The show also had a few interesting guest stars such as John Lovitz as Cheapo and Mark Hamil as the plastic surgion who hates models. Also Tom Kenny (SpongeBob) was on the show as the owner of the strip club in most every episode. Stan Lee has a cameo in one episode too.The Breakdown: PROS: Had a great look to it at first, FUNNY AS HELL, a very fun show, great voice talent for the most part, Chief Strogenoff (watch the show and see some of the stuff he does), and was easily the best of the three animated shows mentioned earlier.CONS: The mid-series animation change and the crappy DVD described earlier. Aside from the fact that some of the humor could be kind of dumb at times I have nothing really negative to say about this.OVERALL: Stripperella is a huge guilty pleasure of mine and it's a shame it only ran one season. It was a very funny, sexy, actioned packed cult series that I hope to see air on Adult Swim someday with the original intro intact and possibly give it another season like Family Guy. Check it out even if it is on the lousy DVD. You will laugh yourself silly.Rated TV-MA: Crude and Sexual Humor and Nudity, Runtime: About 25 minutes per episode, Score: 9/10","At initial thought, the concept of this show seemed to be a joke and a gag, just for Stan Lee's amusement. I expected nothing more than a sleazy, animated version of Barb Wire with low production values, much like those short pieces of crap you see on Adult Swim for short term amusement, but can never taken too seriously. Boy was I wrong!Stripperella has even better production values than similar Marvel Toons. The animation is very good and it seems that they've taken this series very seriously and given it a full effort to make it a professional production as possible.The humor is good too, on the sexy, suggestive and sleazy side. It is very similar if not exactly like the Simpsons style. You may encounter clichés and a lot of predictable humor but its still fun nevertheless. If this were running today, I'd surely see it regularly. Its surprisingly one of the better toons ever made.","\"Stripperella\" has returned to \"Spike TV\" with all-new episodes (check your local listings). Because of the long layoff, a new team of animators has taken over, so the look of Season 2 is very different from Season 1. Erotica Jones gets even curvier (if possible), and you can actually see her bright blue eyes while she's wearing her mask as \"Stripperella\" (in Season 1, all you saw were white eye-holes, like Batman & Robin).Plus, there's new gadgets, new villains, and new double- (O.K., single-) entendres for the audience to enjoy [not to mention Erotica's cute co-workers at the Tender Loins strip club!]. I give this show a 9 out of 10.","Wow. It is hard to believe that Stan Lee, the creator of many iconic comic-book characters made such a uninteresting animated series like this.I mean, I don't have any trouble with this being silly, but why this have to be so dull and boring? Most of the jokes were pretty bad, like if most of the script were composed of rejected scenes from the \"Austin Powers\" movies.It also doesn't help the fact that the animation from this series isn't very good, either, being mediocre at best, turning even worse in some episodes.This was a very dull series, with many lame puns, bad jokes and bad animation. Personally I didn't like it at all.","This is a very good show, Pamela Anderson portrays Erotica Jones, .a.k.a. Stripperella, she strips at The Tender Loins, she battles criminals like Cheapo, Pushy, Klinko, and Dr, Cesearean. She uses her lipstick to detect secret hideouts.","\"Stripperella\", a stale, unfunny spy farce (think the last two Austin Powers flicks), also suffers from unremarkable voice talent and having too many musical interludes [in the first five minutes of the pilot episodes, we heard songs from both of Pam Anderson's most recent beaus]. Not even worth a casual look.","While watching this show one has to ponder the inevitable question who the hell would produce such a sad unappealing cartoon?  The gist of the plot line is that Stripperella is  Erotica Jones a stripper by night and a super hero by \"later\" night. In the premiere episode she fights an evil doctor who enjoys inflating super models. The plot line, dialogue, and attempts at humour all fall flat but the worst scenes are those showing the cartoon Stripperella stripping. I find myself wondering who would enjoy watching a cartoon character strip. This show has nothing going for it and I wouldn't be surprised if it was  swiftly cancelled. 0/10","I lack cable-vision and no longer have \"DirecTV\". So being a rural resident I have to wait for DVD releases. Being a lover of blondes but not blonds, I of course not only have \"Barb Wire\", but I have \"Stripperella: The Complete First Season\". I've not yet found \"VIP\" or a second season for Stripperella. I have the \"Baywatch Hawaiian Wedding\" DVD. I have the issues of \"Playboy\" that Pamela Denise Anderson posed in. I could go on. I love Pamela! There is no one or anything that could make me feel guilty about enjoying Stripperella. But there are certain elements that I dislike, but live with, for other series depict smoking and alcohol consumption too, some times. But those are my personal peeves and I try not to let them ruin the fun of a series like this for me. I too was taken aback by the change in animation style, but I adapted. However, the amount of female nudity decreased, and that is a big disappointment as one expects a lot of it in a series with a premise like this. But then again I adapted. One of my favorite episodes of \"Mork & Mindy\" was when they got to meet Robin Williams! So of course one of my favorite episodes of \"Striperella\" is when Pamela & Tommy visit the club and the comparisons begin! If there really is a \"Season 2\" I hope that I can find it, for as a completest, I need to complete my collection. I recommend this for other admirers of the female form and lovers of blondes. (Hey! Psst! \"Blonde\" & \"blondes\" are the feminine form for spelling \"blond\"! Your software should already know that!)","Some Plot Spoilers Ahead.The Nashville Network's so-called rebirth as \"The First Network for Men\" is a complete disappointment, as was its block of adult cartoons. The new Ren and Stimpy was just plain awful, \"Gary the Rat\" mediocre at best, and \"Stripperella\" pretty unwatchable. This cartoon is mostly boring; if \"Ren and Stimpy\" suffered from gross-out overkill, \"Stripperella\" lacked any decent shock gags, funny witless gags, clever gags, or gags, period. The concept is bad to begin with: Pamela Anderson, a stripper-cum-superheroine, saves \"The City\" from an assortment of goofy supervillains. This cartoon seems like an homage to superior wacky superhero spoofs, like \"Darkwing Duck\" and \"The Tick,\" but without those cartoons' wit and good writing---or even good storyboarding. \"Agent 0069\" tries to vacillate between being goofy and sexy, but she is neither, and this cartoon's failure to make her one or the other brings this series down.Watch your taped episodes of \"The Tick,\" and see what a real superhero spoof cartoon is like.","Directed by Kevin Alteri (Batman: The Animated Series) and created by comics greatest Stan Lee Stripperella is the type of shows perverts would enjoy. The concept is pretty dumb but while I've seen Pam Anderson nude several times I would have prefered this show to be live-action. I don't want an animated nude Pam! This is a dumb show just trusting it's future on the air by advocating naked animation.","This spoof of the superhero / superspy genres (Stripperella is both) brings in and sends up every imaginable cliché while carving out it's own territory of silliness, thanks to a consistently clever and funny approach to the material. Her villains are a lame, cheap, twisted and above all hilarious rogues gallery right out of Dick Tracy. Her superspy gadgets are amazingly stupid and often work amazingly well in unintended fashion. And her supporting cast in her double life as a stripper / crime-fighter all have great running character gags. Fellow stripper Persephone has a different foreign accent each week (Russian, Scottish, French); Special Agent 13 is so 'special' he could have his own telethon; the Chief has less sense of irony than Leslie Nielsen etc. etc.Unfortunately, a lot of this inventiveness is played out on the first disk and the second disk shows some evidence of recycling. Even still, it's pretty entertaining. Recommended, especially to fans of Spike TV, where the show originated.","came across the first season of this campy animated series while browsing through a DVD shop years ago and promptly bought it as i can see it's potential cult status. to say the least, i was not disappointed upon popping it into my DVD player. i had a lot of fun and pleasure watching the many tales and capers of its heroine stripperella played none other than by former bay-watch babe and pin-up girl Pamela Anderson. it is definitely not for children as there is a lot of risqué humour and sexual innuendos throughout each episode. i liked the witty dialogue and thought the storyline was well-written. the assortment of odd ball characters and goofy antics of the villains were great to watch. unfortunately the series is no longer on TV so it will be difficult to get your hands on a copy."],"review-user":["Rattrap007","mlarowe","hassenpheffer","Tennessee_Rebel","JackDevoe","LanternArrow76","ZeldaFan2929","Shellpencil","Perdicus","Rectangular_businessman","bandcrsh","vlvetmorning98","ReganRebecca","LeoStarDragon1","michael_the_nermal","TheTVConnoisseur","dave13-1","michellelocke007"],"review-date":["31 July 2003","17 February 2006","26 June 2003","27 June 2003","10 July 2003","3 July 2003","22 June 2007","16 October 2006","28 February 2004","5 January 2013","14 August 2003","1 July 2003","28 June 2003","21 August 2008","9 June 2006","26 June 2003","12 April 2012","14 September 2010"],"review-rating":["9","10","2","9","2","6","6"],"review-title":[" Way better than I thought\n"," Sexy, ridiculous fun\n"," Much funnier than I thought!\n"," Naughty fun\n"," Almost like the animated CLERKS, Very welcome!\n"," WAAAAY better than I thought...\n"," A definite favorite of mine and a huge guilty pleasure!\n"," Way better than expected. A mainstream toon!\n"," She's back!\n"," It wasn't very good\n"," Stan Lee Presents\n"," The worst of TNN's first generation 'toons\n"," Baaaaaaad\n"," I Enjoy It!\n"," Poorly Done Adult Cartoon.\n"," Pam Gets Animated\n"," Often clever, at least in the early going.\n"," a role that Pam Anderson was born to play if she were animated\n"]}