{"review-url":["http://www.imdb.com/title/tt0343172/reviews"],"review-text":["\"What Alice Found\" was a pleasant discovery. As written and directed by A. Dean Bell, this is combination of a road movie with a cautionary tale, as well as a voyage of discovery.If you haven't seen the film, maybe you should stop reading here.Alice is a case study of a young woman that wants to break away from the unhappy life she leads in a New England town. Her pretext for leaving is going to join her best friend, who is away studying at a Miami university. Alice is the product of a single mother's home, one that is struggling to make ends meet, in sharp contrast with the life of ease her friend seems to inhabit. In flashbacks we get to see Alice's life before going on the road.Alice, like her namesake in \"Alice in Wonderland\", embarks in a trip to the unknown that life hasn't prepared her for. The highways of America are full of predators in search of the weak and innocent. Alice meets with disaster when her car breaks down the road and a friendly Southern couple come to her assistance when a strange man approaches in the darkness with the excuse he wants to help her. Sandra and Bill convince her to come along in their plush R.V. on her way down South.Nothing has prepared Alice for what this couple turns out to be. After all, in her sheltered life, she hasn't dealt with what Sandra and Bill, her new benefactors do during the overnight stays at the rest stops in the American highways. It comes as a shock to her the realization that the kind Sandra is nothing but a prostitute that plies her trade among the truck driving populace one meets in those places.Alice, brilliantly played by Emily Grace, is a study in how the young woman awakens to the new reality she can't escape. In fact, Sandra makes it seem so easy that Alice tries her luck at the oldest profession on earth in order to raise some badly needed money.Judith Ivey gives a tremendous performance as Sandra. Ms. Ivey is perfect as the seemingly normal woman, one wouldn't suspect she is doing the nasty with clients she and Bill find along the route they travel. Ms. Ivey is amazing when she reveals the truth about her life to an accusing Alice. As the husband, Bill Raymond is good in his portrayal as the husband, that in reality is a procurer.Under the excellent direction of Mr. Dean Bell, the film is not afraid to go to places mainstream films dare not to go. Congratulations to this director who has written a plausible story and has gathered the perfect cast to play it for our benefit.","Having worked professionally with young girls on the run, I found this film surprisingly authentic. I would never have found it had a friend not loaned his videotape. There are classic themes here: Coming of Age, Mother/Daughter Estrangement, The Limited Choices of the Underprivileged, Who is the Good Samaritan, Tragedy is in Every Life & the many layers or relationships. Flashbacks are meaningful (when Alice acquires a gun we know she has some familiarity with how to use it) and it does not end in cliché. The cast really \"sells\" their roles. It is adult material and the audio is a bit too grainy. Allow it 15 minutes to so to draw you in.","Writer-director Dean Bell offered many surprises and engaging moments in this modest yet compelling road film. His dialogue was snappy, and his use of very short flashback sequences was especially effective in the film's narrative structure.At the heart of the film is the character of Alice, who is running away from her New England past in a desperate effort to get to Florida. Along the way, she travels with a pair of eccentrics, Bill and Sandra, who incredibly make the attempt to groom Alice as a prostitute earning money at truck stops.As a newcomer performing in her first screen role, Emily Grace as Alice is sensational. There is not a false note in her character choices. But the film is worth watching above all for the wily yet sensitive character of Sandra, as masterfully created by Judith Ivey. There is an especially sly subtext to virtually every moment in which Ivey is on-camera. As a viewer, I found myself stopping the tape, hitting rewind, and reviewing her scenes in order to attempt to discern the psychological subtleties.The film raises the following question about the characters: Are Bill and Sandra good Samaritans, or are they an evil pair of Dickensian predators preying upon the youthful Alice? One of the strengths of the film is that it never quite fully answers that question. Alice seems more self-confident than she started out as a result of her experiences with Bill and Sandra. But is she really a better person?Part comedy, part road picture, and part coming-of-age drama, this carefully crafted film succeeds in involving us on many levels.","Six out of seven people who took the time to comment on this movie have very positive responses. The one negative review happens to reside (or did) on the first page of the movie's location in the IMDb.I found \"What Alice Found\" to be one of the best movies almost no one's heard of that I have seen this year. It's 6.4 rating is misleading and may be more a function of the difficult subject matter than the quality of the movie. Who would think that a movie purportedly about truck stop prostitution would be worth seeing? Guess again.For me, \"Alice\" was a positively gripping psychological thriller. I was virtually on the edge of my seat the entire time. It's a very credible story with a realistic script and is very well cast. In a fairer world, actress Judith Ivey would win awards for keeping you guessing whether she was good or evil.Ignore the rating and see this terrific movie. (And by the way, I wish there was a soundtrack album.)","This is a low budget, well acted little gem. Alice, a small town Massachusetts teenager, fed up with her existence, takes to the road to escape her mother who flips burgers and her own job as a check out in a super market. She sets out for Florida and to stay with her wealthier high school friend who is a freshman at Miami. After her car suspiciously breaks down on the thruway and she loses all her money, she ends up with a retired couple in an RV who also happen to be traveling to Florida.. The couple, brilliantly played by Judith Ivy and Bill Raymond are overly hospitable and, it turns out, a prostitute and and her pimp. Slowly, Alice is lured into truck stop prostitution as the RV meanders down the thruway in the general direction of Florida. Through intermittent flashbacks, we learn a little more about Alice and her desire to leave tiny Milford. We also see the couple in a new light and their life and the choices made by the couple and Alice all seem quite credible. An excellent, well made film that you will think about when it is over.","It's a sad state in corporate Hollywood when a movie surprises you by not taking routes you've been seeing in the movie house since day one. I had literally no idea how this film was going to end, because it went left when I expected it to go right, zigged when I expected a zag, etc. This could have easily unraveled into generic suspense thriller, or depressing white trash drama, but it stayed a course all its own till the end. It is a sad story, though. Not because of what happens to Alice, but because of the sad world that surrounds her and leads her down this path.The plot has a quiet dignity of form that's usually reserved for theater, but the pacing could use some tightening up. Either way, it's a very good film, and for some reason I suspect sour grapes from those who have scored this one low.","Until I did a Web search on \"What Alice Found\", I didn't realize that the name of the film is embedded in the title of one of Lewis Carroll's books. The book's complete title is \"Through the Looking-Glass (And What Alice Found There)\".The Alice of the film comes from a background quite different from that of Lewis Carroll's Alice. Her fresh and assertive character, however, is similar. The movie Alice begins as a young woman in New Hampshire who steals money from her ass-patting boss and takes off for Miami, vaguely planning to study marine biology and play with dolphins. She encounters a middle-aged couple in a motor home (the husband's retired from the military) who rescue her from a strange man at a roadside stop and from her car's breakdown (perhaps caused by their mechanizations).As it turns out, the couple is heavily involved in truck stop prostitution and see sweet, young Alice as a promising recruit. The wife (played by Judith Ivey in a performance worthy of some big award) buys Alice sexy clothing and shows her how to apply hot makeup. Initially, Alice passively accepts her ministrations and, with the couple's instructions, does several tricks. The encounter shown in the most detail is quite different from most cinematic sex but may be typical of what most often happens in real life. The man is shy and deferential and apologizes for \"finishing\" too fast.What's wonderful about Alice (and different from her prototypes from Clarissa to Sister Carrie) is that she learns from her experiences and asserts herself. This is how things really are. Prostitution is everywhere. People are neither all good or all bad. Alice leaves the motor home with her well-earned money and a feeling of mutual respect.","There's nothing much to the story. A young woman steals some money from the dreary Vermont supermarket where she works, decides to run away to Florida where he has dreams of attending school with her friend Julie, and encounters an odd couple on the highway. If you remember the elderly couple from \"Rosemary's Baby,\" you have some idea of what these two are like. Bill has a comical face and is retired from the Army. Sandra is an ex stripper now become a truckstop whore, although we don't find this out at once. They're affectionate, helpful, and full of common sense.They more or less adopt the girl, Alice, and promise to give her a ride in their elaborate RV, although they are not driving \"directly\" to Florida.This is where the film could have gone one-hundred-percent wrong. All the film makers had to do was turn the elderly couple into the personification of evil. They would take the virginal Alice (handcuffed to the bed or whatever) and sell her body to any greaseball driver who has a lot of money and likes rough sex. (Alice would have had a heck of a time escaping, with lots of aborted attempts, before the final shootout.) But, no. The couple really IS pretty nice, and Alice is far from virginal. Alice overhears Sandra with a customer, asks about the business, and tries to turn a trick on her own. Bill prevents anything from happening and insists she do the job right if she's going to do it at all. They don't talk her into it. They guide her.Alice makes several hundred dollars, which is several hundred dollars more than she had when she met the couple. Bill and Sandra keep her money in the safe where customers aren't going to find it. Alice misunderstands. She doesn't find whoring very pleasant work, and she thinks she'll never be paid off because every time she asks to be dropped off, Sandra responds with, \"What? Not here, honey. Not in the middle of nowhere.\" However, after she is talked into handing her gun over to Sandra, the couple give her the money she wants and rather lovingly release her to continue her trip to Florida.You know what I found the most tragic moment in the film? It had nothing to do with prostitution or thievery. Alice has been expecting to room with her friend Julie after she arrives in Miami. Julie is after all a legitimate student. But when Alice calls her friend from someplace in Alabama to assure her she's on her way but will be late, Julie hesitates and says, \"Well -- my mother doesn't think you should room with us. And to tell you the truth, my roommate isn't cool on it either. I invited you down, sure, but I thought it was just like a visit for a week or something. Go back to Milford, Alice\" There is a long silence before Alice hangs up.Only one shot is fired (a few white frames of film) and no one is hit. Tears appear only once. Nobody slugs anybody else. No car explodes in a fireball. No cop chases them down the Interstate.The direction is occasionally clumsy. Too much cross-cutting between Sandra trying to disarm Alice and Alice's hand holding the wobbling pistol. There is hardly any musical score. There is brief male and female nudity and it's awkward, as it's probably supposed to be. Alice isn't unattractive but she is not babalicious either. She sports Asiatic eyes, a kind of robust version of Molly Parker. The cinematography looks cheap and the colors are washed out. The direction is a straightforward narrative, with a few illuminating flashbacks. Nothing is wasted. And it was all evidently shot around Danbury, Connecticut. The city sticks in my mind because I drove through it after one of its floods and remember the cars caked with a film of mud all the way up to the door handles.I don't know exactly What Alice Found. (I dread even THINKING that the answer to the riddle is that \"she found herself.\") The acting isn't bad at all. Judith Ivey is better than that. It's definitely worth seeing, a quiet, orderly film that treats the audience like adults.","I just saw this on cable. I liked it. It held my interest and the dramatic choices were good. The old couple were very good and good at being subtly creepy. The cinematography is not so great, but the shabby video also adds to the sense of realism, so its a trade-off, you know? At times the girl would hit the New England accent to hard. The accent would sort of come and go. Anyway, I thought the film was well done overall, though. The storyline was strong and dramatic tension was held because you felt their was some subtle mystery going on, even though things seemed mundane. Good job on a low budget. Another good SUNY Purchase filmmaker. Way to go.","Judith Ivey as the scamming old whore is awesome. Emily Grace the young girl. Is innocent and exciting as she learns whats going down. Excellent direction and camera. Story is dark and disturbing.Supporting cast is good. Shows what happens and can happen with a run of bad luck. Great independent film. Small cast. Pace is slow at first and then moves good. A good movie to show your teen age daughter who has aspirations of leaving home early, for the open road and adventure. This movie, film has a low budget feel to it, but it works because of the low lifes and areas that these people move in. I will never stop a rest stop again with out thinking of this movie and checking my tires before I go.","While I can understand some of the points made regarding the cinematography (I thought a more purposeful approach would have better supported the low-fi, home movie feel) I must say that I thought the script and acting of WHAT ALICE FOUND were excellent! Dean Bell has crafted a real gem that Judith Ivey charms with character-driven delight. Her performance of Sandra is a pleasure -- unfolding, alternately, as diabolical and romantic. We are at once intrigued and repulsed by her actions... and never given more information than is necessary. Her's and the supporting cast's efforts meet Bell's post-modern fairy tale with arms wide open. Emily Grace's Alice is infused with a doey-eyed magic. She seems to mold like clay before us, morphing into some sort of beautiful, lost beast. By the end, we are at odds with words, as she is, saying goodbye to her mother. Kudos also should be doled out to Jane Lincoln Taylor -- whose Mother provides the right amount of tragic historic weight -- and Justin Parkinson -- whose shy first-time John, Sam, provides one of the sweetest, if not most awkward, sex scenes in film. Bell has created a first rate story and assembled a plethora of talent to make it.","This is a very amazing movie! The characters seemed so realistic to me, it was hard to believe they weren't real people. Being from the South, I thought Judith Ivey's character seemed especially real, and as everyone else has mentioned, she does an outstanding acting job. The characters are not beautiful and look nothing like the average Hollywood stars - their imperfect bodies and personalities seem so much more natural and real. One reviewer mentioned that the main character, Alice, had no good reason to run away from home, which is true - she didn't have any moral or upstanding reason to run away, such as escaping child abuse, etc. I thought that she was just fed up with dead-end jobs in a working class life and wanted to flee down to Florida where her friend lived the appealing and privileged life of a college student in Miami. The actress shows Alice's confusion, uncertainty, and questioning turn into decisiveness and willingness to take control of her life with impressive naturalness. The film also shows how Alice is trapped in situations with seemingly no options, causing her to panic, take action, and reach out for help. At first, the grainy filming style put me off and made me think that it was a very low budget or homemade movie, but in actuality it is very well done. The home movie quality really makes you feel like you are there with the characters, a part of their RV trip across the country. This is definitely a film worth seeing, although I don't quite understand all the descriptions of it as a heart-warming coming of age tale. It is rather vulgar and disturbing at times, even if it is not completely sad in the end.","A great performance by Emily Grace! I stumbled upon this movie while browsing my satellite listings and was curious by the summary of the plot giving by my satellite service provider. I was high entertained and had much compassion for the character \"Alice\" played by Emily Grace. The story had me guessing in what would happen to Alice and was not predicable. The overall story was refreshing and had some great twists to the supporting characters. The ending of the story ended on a rather fair way. I will purchase this DVD to add to my library. I am a new fan of Emily Grace and I high anticipate in seeing more from her performances.","At the first glance of this film the camera angles immediately make you think that this is a low budget film that will bore you to tears or make you press the stop button. Surprisingly, the storyline comes forward and is played through the screen in a way that I feel most would relate to. I scored this movie at 7 but like most would, felt it should be a 10, you will understand as you watch it because its a rare thing for a film to be in touch with a persons feelings and how life should be shown by a TV set. Most films try to leave you in awe of their special effects, twists and turns etc, this film dealt a true hand showed a good film backed by an Alabama style storyline that most would feel was a good waste of a couple of hours. Wish I had put the popcorn maker on after all well done!","at the story. It is reality mixed with Americana- and very original.Emily Grace is a young girl tired of her boring life working at a minimum wage job, in New England. Her sleazy boss propositions her- she quits and takes a little bit of cash from the register. Driving from New Hampshire to Miami, Florida, is not a short trip, and her Ford Escort dies out. She then meets a personable older couple, portrayed by Judith Ivey and Bill Raymond. They have an RV and graciously offer to help her out- it isn't safe for a girl to be alone on the road. Especially I-95.Emily Grace is very realistic as Alice, and initially lets the Judith Ivey character help her; buy her decent clothes, cosmetics, etc. At first it is a nice vacation for Alice, who hopes to hook up with her girlfriend, who attends college in Miami. There is interesting cinematography, as the trio drives the RV down to Florida: the rest-stops, bland scenery and eventually beautiful mountains of North Carolina.Eventually there is something awry, and the Ivey character apparently has fabricated stories about her daughter, as well as her husband, who now seems a bit sinister.I will not spoil the outcome of this film- but it ends positively as the audience waits in suspense- This film reminded me a bit of Spielberg's \"Duel\"- while it was initially not as menacing- the moral of the story is - you never know what people are thinking- especially if you are driving cross-country. Beware!!. You will enjoy this film.","Fantastic film! Wow - this is really a treat. I can't believe that I discovered such a gem of a movie. A pretty young girl traveling south to Florida meets a friendly older couple with an RV, after she has a flat at a rest stop. However she learns that things aren't as they seem and the couple gets a bit creepy after she spends some time on the road with them.Everyone in it was just so perfect for their parts you just about believe that you are watching this happen in real life in front of you.Newcomer Emily Grace did a fantastic job as the really cute, yet somewhat shy Alice. Emily gives you the feeling that you can understand what she is experiencing and you can see just how she got into the situation that develops in the film. I'm sure we'll be seeing Emily in more films in the future.Contrary to what some others have said, the lighting and photography in this were just perfect. The editing was done well too - just the right way to put together images of the highway to give you the feeling that you are traveling along with the cast on their road trip.I didn't see it on the big screen, but I can only urge everyone to go out and see it. More films like this are *exactly* what we need.SF","I wasn't expecting a whole lot when I rented this film, as a lot of independent films seem to be a bit overrated these days (well, Hollywood films too for that matter) but this movie was fantastic, really great, it's too bad it didn't reach a huge audience because it's just superb. I really love Alice's determination, it really makes me look upon my life as a gift, and i see how privileged I am just to have an education. But all of that aside, this movie really proves that a good artist can tell a good story, no matter what the budget, it's an excellent film and everyone should watch it, they will love it and definitely learn something from it. I don't have to be roger ebert to know it's one of the best movies I've seen all year, and certainly one of the most truthful.","Going into \"What Alice Found\" started me off with two feelings. I expected absolutely nothing, but I was happy to be at Sundance (I only saw the film's poster until after I saw it). Now, I'm not a big fan of Indie-type music and it actually made my head spin for most of the film, but it perfectly shaped the film into a true indie, as well as a film about trashy trailer/RV life. So, it was redeemed on that level. The second point I immediately noted that became redeemed as well was the film quality. From just leaving box-office type movies, I had forgotten the other world of film. So seeing the first 20 minutes of \"What Alice Found\" looked like my dad's home videos. But the filming (especially towards the end) had a real sort of style to it that made the film seem more real, and that made you forget about how it was filmed, but just about what the story was about. I will not spoil the story in any way, but Judith Ivey's acting was superb from the second she walked on screen, and Emily Grace entered the film industry in a nice sort of way. There was nothing that hit me in this film as unbelievable, but from all of the recent films I have seen, \"What Alice Found\" was certainly the best film of trashy people, told in the best possible way. You feel like you are there with the actors, due to its 'real' feel, and seeing the plot unfold made this film really shine. I would like to say that it was a very nice film that blossoms in its small little way, but nothing could please me more than films like this one day reaching massive audiences. Creators of the film, your film really had a purpose, one that should be told, exposing Southern RV life in no way ever shown before, and I commend you for your efforts, so I wish you the best of luck in the future.","My roommate and I watched this movie on TV last night just out of sheer boredom. Besides the fact that the New England accents were AWFUL the movie was good. I live ten minutes from Milford NH, born and raised there and still attend school in the New Englan area. So we were cringing every time a New Englander spoke. But we found ourselves drawn into the movie. It was surprisingly sweet for being so trashy at the same time. Definitely not for kids, but if you like good indie films, this would be something good to watch. Give yourself some time to really get into the plot. You almost find yourself with a case of Stockholm Syndrome for the couple that takes Alice in.","This is most likely the best picture not many will see. It presented a culture in a real unhollywoodized way. A must see for all who like Indie and for those who don't. I think this movie will draw more into the Indie scene. The acting was top notch! The character  of Alice was portreyed so well. With perfect akwardness. This movie ahould be brought to the mainstream! I think it would do phenominally! ALICE is the most real look at an element of our culture that I have seen since GO ASK ALICE. A look that is untouched by the Hollywood hand. Movies like this show young people that these things aren't glamorous but that they are real and compelling. If you liked PIECES OF APRIL you will love this one!","The early user ratings for \"What Alice Found\" baffle me.  The pace was so slow that counting ceiling tiles seemed interesting to several people in the audience-- instead of capturing our attention, then telling the story visually we were treated to a shot of uninteresting scenery, then of vehicles in parking lots, of people walking, of vehicles on the road, of anything handy that could be used to fill up time, then a tiny slice of the story, and back to the fillers.  Hidden inside this feature was a great story, but why was it hidden?  Paced properly this would have made the basis for an interesting short, and if some of the conflicts had been explored, and the characters allowed to evolve, the story could have served as the foundation of a good, quirkily presented offbeat feature length movie.The pace was slow and there was too much padding, but even so, there is no excuse for flat, uninteresting lighting.  DV does not mean boring images, and to shoot in DV requires the same care and finesse in lighting as any other motion picture image, but it sure didn't get it here.  A fill light, a high kicker, a touch of sparkle light in the eyes, anything to enhance the skin tones, and the audience would have forgiven the lower image detail. Lighting is a good thing no matter if you are shooting DV or film, but it was neglected in this feature.  Even if you wanted flat, uninteresting lighting for some reason, thirty dollars worth of ND film on the RV windows would have kept the background from overpowering the foreground so badly that the compromise degraded the viewer's attempt to see nuances of the performance.Assuming you slide past the slow pace and extraneous shots, then squeeze by the flat lighting, you trip over focus and depth of field.  Repeatedly the camera is not focused on the subject or point of interest, but someplace else, as if the camera operator either forgot or just didn't care where he was focused at that moment.  When the buildings outside the RV are sharp and clearly defined, but the actors involved in the action taking place inside the RV are out of focus, something is wrong, because if the point of focus does not include the main action the scene simply does not work.  Sometimes the depth of field was too great, and the background intruded on the action; sometimes it was too shallow, and not enough was in apparent focus at a given moment to look real.  I could not accept that as an artistic choice as it plainly did not fit the story or action.  Focus, point of focus, and depth of field are vital to each scene.After you slide by the pace, squeeze by the lighting (or lack of it), and trip over the focus issues, you find yourself confronted with underdeveloped characters.  No, they were not the most undeveloped characters in the history of cinema, they were ninety percent developed-- but they need that final ten percent to come to life.  Alice had a life that was more boring than anything else, but there was no real cumulating of events or a triggering factor worthy of her sudden and drastic action.  Maybe the supporting roles could be allowed to remain more two dimensional (although I feel it is better if they, too, are fully realized), but the protagonist should be fully developed, three dimensional, and each action should be based on cause, reason, and must be believable.  Yes, being bored is bad, being unhappy is, to state the obvious, being unhappy, but there was not enough demonstrated cause for Alice's action to trigger the trip, and no arc to show why she made the choices she chose during her time in the RV.  The character was somewhat too shallow.Emily Grace may be a very good actress, but given only the role of a bored, unmotivated, semi impulsive young woman \"without too many smarts\" to play here, then put into a flatly lit, frequently improperly shot scene, you really cannot tell if she was brilliantly defining the role as it was presented to her, or if she was struggling to find the character, too.Many, many of the right ingredients, but the wrong mix, prepared wrong, an edible meal, but not a gourmet feast.And that's the pity. .","While made for what literally looks like $50, and shot on what seems to be a home video camera, film-maker Bell manages to make these limitations work for him, giving this disturbing, ambiguous story a sense of odd reality. His actors are so good, (especially the great NY theater actress Judith Ivey) that rather than feeling amateurish, the style makes the film feel uncomfortably voyeuristic and appropriate. Alice is running away from an awful home life when she meets a well-meaning couple on the road who help her out, and take her on with them, Then they turn out to be less altruistic and somewhat creepier than they appear. While this might sound like a recipe for a low budget horror film, Bell keeps the film and the characters in shades of tense but low key grey. Everyone, even our heroine, has their secrets, and true motives are always a question mark. No heroes, no villains just people surviving and using each other in the process. If this is a 'thriller' at all, it's a thriller of behavior, not action and violence, ala more recent films like 'We Need to Talk About Kevin' and 'Shame'. It's really more a dark coming-of-age film. Not all the acting is up to Ivey's level, and some of the flashbacks are a bit on-the-nose, but overall I found the film far more quietly haunting and thought provoking than the vast majority of what I see.","Plot: \"What Alice Found\" is about a high school runaway, who tries to get to Florida. Alice (Emily Grace), the runaway, encounters an elderly couple (Bill Raymond and Judith Ivey), who introduce her to the world of truck-stop prostitution. As she gets sucked into the elderly couple's world, she discovers (and we discover, as an audience) more and more about who Alice is, and what she wants out of life.Acting: The acting is pretty good, actually. I didn't always find Ms. Grace's thick Boston accent to be believable, but that didn't really detract from the performance. Ms. Ivey was wonderful as Sandra, a Southern belle with a checkered past and bills to pay. Mr. Raymond's character (Bill), however, was not as well defined as the other two characters, but his acting was still pretty good.My only complaint is that Alice doesn't take very long to warm up to the idea of selling herself. I think her character should've taken a little bit longer to slip into that kind of world; however, I will admit that this does lend an emotional instability and a general uncertainty to the film.Cinematography: This film is shot in a sort of naturalistic style, that lends well to the themes of desperation and banality that come with this type of setting and story. I found, however, that--at times--things can get a little blurry. Nonetheless, the cinematography definitely suits the story.Sex/Nudity: You'd think there would be more sex and nudity in a film about prostitution, but there's actually only three on-screen sex scenes, and one-third of them don't involve Alice and/or Sandra (the first sex scene is actually in a flash-back, and it's somewhat brief)! There is another sex scene off-screen, and a fourth that is shown very briefly (as in, only a second or two). For those who are good at math, it's also implied that Alice had sex 5 times total (considering the amount of money she earned).I must give Ms. Grace and Ms. Ivey credit, however. Ms. Grace played her sex scenes as well as could be expected of her character; and Ms. Ivey didn't seem phased at all by the subject-matter. I was very impressed at the subtleties of their characters, as well!Editing: This film has a decent run-time, however, it was edited in a manner that makes it feel like the film is much longer than it really is. Ordinarily, I might have a problem with this; however, the editor certainly made it feel like a long, RV-road-trip, which is the way it should be.Overall: I had seen this film a while back, and I really didn't enjoy it (like many of the F.A.Q. contributors and reviewers on this site); but, now that I've seen it with the eyes of an adult, I can see the film for what it truly is: A somewhat twisted, sad, sexual, coming-of-age tale that should be seen, especially by teenagers who plan on running away from home. I give it an 8 out of 10!","Driving from New England to Florida, a young woman's car breaks down but is offered a ride by a middle-aged couple in an RV. The first impression one gets from watching this drama is how cheap it looks. The quality of the cinematography is about on par with a home movie. The script and direction are amateurish, but the film must be given credit for keeping things interesting as it explores the seedy goings on at truck stops. Newcomer Grace does OK in the title role, although the most striking thing about her is her strong New England accent. The main attraction here is Ivey, who is quite good as the woman who takes Alice under her wing.","Really, average is the only word that comes to my mind when you see this.The acting was average (maybe a bit above average), the camera usage was average (actually below average. The picture was so shaky and the colors were grainy and blurry.) The plot was a good one but moved at such a slow pace and wasn't put to good use.This could've been so much more if it didn't go at a snail pace and we saw more into the characters backgrounds.All we see are flashbacks here and there of Alice and how her home life is so \"bad\" (her mother is a working class woman trying to make end meet for her and her daughter.) We see a flashback of her of when she was in high school and her friend says to her \"tell your Mom to make some better food\" and \"everybody says it's your mom.\" Yeah that's embarrassing but why would you run away from it. I could definitely see if her Mom was a drunk or somebody was abusing her but nothing was wrongwith her home except she was embarrassed by it. How immature! We're not even given a glimpse of what the couple's lives have been like (except that they've been prostituting for awhile and the woman, forgot her name, gave her baby up when it was 9 months old.) This really could've been so much more. It could've had Alice who was abused by her drunk mom go down to Florida with her friend but then becomes a prostitute. Or something along the lines of that other then the real plot of this movie (that is) Alice, a girl with a home life of probably 90% of America's population (WORKING CLASS) runaways to Florida but then gets sidetracked by turning into a prostitute.I don't see why it won an award at Sundance (it must've been up against some really weak competition to have won that one award.) Also to me, Alice's Boston/New England accent seemed forced. It didn't seem genuine. (I should know, I was born and raised in Boston, but now live in Georgia.) 4/10 Not really worth your time in my opinion."],"review-user":["jotix100","trolyat9","lavatch","mgrandin","danashley","stonedonkies","koolpopoki","rmax304823","DeLux","cfhnyc","blackjay001","zackaria85","Lou101","nd-electrical","MarieGabrielle","Scarletfire-1","rhinestone_cowgirl","Esoteric1616","dolfingirl146","lisanorkus","colcam","runamokprods","garden-17","kenjha","gluba2000"],"review-date":["28 March 2005","25 March 2005","8 January 2006","21 October 2004","11 March 2005","25 March 2005","16 May 2004","15 March 2005","3 August 2007","3 July 2006","7 December 2005","12 June 2005","20 October 2005","27 August 2004","7 April 2006","9 October 2004","20 January 2006","13 March 2003","12 April 2006","21 March 2004","23 March 2004","5 March 2012","17 February 2012","7 August 2011","12 March 2005"],"review-rating":["8","8","8","8","8","9","7","8","8","9","8","7","10","9","10","6","10","9","8","6","4"],"review-title":[" Alice doesn't live here anymore!\n"," A sleeper in the best sense\n"," A Most Surprising and Unpredictable Film!\n"," This is an under-rated movie.\n"," A Real Sleeper\n"," 6.5 is too low for this fine film\n"," What Alice Found is a really good movie about growing up in America without the all too common clichés.\n"," Strangely involving minor film.\n"," pretty good drama\n"," Great Movie.....\n"," Superb Character-driven Realism!\n"," A very real and slightly disturbing/depressing movie\n"," Great performance by Emily Grace !\n"," a heart warming story line that meets suburban reality\n"," Excellent film...you will be surprised\n"," Fantastic film! Wow - this is really a treat.\n"," what a fantastic little movie\n"," Accomplishes its goal\n"," New England what?\n"," Brilliantly Real and Refreshing!\n"," not quite a gourmet feast\n"," Haunting and effective, dark coming of age drama\n"," What I Found\n"," Amateurish but Interesting\n"," Could've Been So Much More\n"]}