{"review-url":["http://www.imdb.com/title/tt0342492/reviews"],"review-text":["With Green Butchers (aka: De Grønne Slagtere) we are in the territory previously marked out by Sweeney Todd, Eating Raoul, Delicatessen and the like: art house cannibalism. The peculiar flavour of writer-director Anders Thomas Jensen's film is partly explained by this choice of subject, as well as his involvement in the Dogme film movement, having contributed scripts for Mifune (1999), The King is Alive (2000), as well as Open Hearts (2002). The Dogme movement has made a virtue of making films to a strictly naturalistic series of rules, the severity of which, whether entirely serious or not, was intended to \"force the truth out of characters and settings.\" Green Butchers is not a Dogme film, but some of its characteristics owe themselves to an artistic manifesto which instructed its adherents to make films by all means available, even \"at the cost of good taste\" if necessary.It's Jensen's second feature film after the well-received Flickering Lights (aka: Blinkende Lygter, 2000 - a film which also starred Mikkelsen and Kaas), another comedy-drama. Jensen's sly, dry humour is much in evidence here, too, as we follow the business of his two misfit butchers, 'Sweaty' Svend and pot smoking Bjarne, into the path of making meals out of unwanted humans. As critics have observed, this is a film with two intertwined threads, with much overt, and grisly, dark comedy revolving around Sven, a man who \"has never been loved.\" He's apparently unable to show anyone the inside of his freezer without adding them to the chilled cabinet for the customers next morning, prepared as his speciality dish 'Chicky Wicky'. Bjarne's story brings to the narrative more in the way of pathos and sweetness as, while struggling with the predations of his increasingly erratic partner in butchery, he also has to come to terms with the sudden revival of his brain damaged twin brother, as well as burgeoning relationship with the slightly naïve Astrid.Playing both Bjarne and twin Eigil, Nikolaj Lie Kaas is remarkable in giving entirely separate performances throughout, so much so that I was going to make him a name to watch, but a quick look at his filmography reveals that he has already made 28 (including one related to his portrayal here, the notorious Dogme film Idiots of 1998) of which no fewer than 20 will have appeared in the last five years! The Walkenesque Mikkelsen, who is perhaps most familiar to British and American viewers as Tristan in the recent version of King Arthur, is also memorable, offering up Svend's characteristic, sweaty, culpability whilst sporting an unnaturally high, damp forehead (an on-screen effect gained, we learn, by a watering unit ingeniously devised by the special effects department).In the interviews which accompany the film on disc, Jensen mentions how keen he was to \"make something better than farce\" out of his subject matter and, if it has a fault, it is that his film occasional teeters too far in the opposite direction, refusing some obvious opportunities to show the comedy of panic or grim humour. Instead, Dogme's metier means that Green Butchers unfolds slowly, with more natural pauses and silences, and an unforced lunacy all of its own. Such deadpan absurdity frequently pays dividends (one especially relishes Svend's quiet words to the newly returned Eigel, soft toy under his arm, that he should \"point the giraffe somewhere else, so that we can talk calmly again\") although there have been complaints from some that a sharper edge to the bloody proceedings, other than those demonstrated by Bjarne and Svend's knives, would have been welcome. To be sure, some cannibalistic movies, such as Romero's Dawn Of The Dead bring an apt comment on consumerism. Instead Jensen's film relates slaughter back to interior matters such as Svend's compulsive, murderous need to be loved and successful - a result he eventually achieves through his marinade - or even by placing the act of butchery in a entirely different context outside of society altogether. For instance the comment by Holger, famous for his deer sausages, that \"It's mythological to kill an animal and then mock it by sticking it in its own intestine.\" Outraged by the role that nature played in provoking the death of his parents, Bjarne sees his work as specifically an act of revenge on animals, not people, a logic that places him apart from such characters as Sweeney Todd. While the eager consumers of Chicky Wickys queue up outside the shop eager for their next portion, obvious satire is played down. In interview, the cast and writer see the film's focus elsewhere, on \"coming to terms with one's fate,\" or learning to live at peace with oneself.Of course interior states are always subjective rather than objective. And if the Dogme creed values strict naturalism, then Green Butchers is a film which, although related to the movement by eschewing overt dramatics, it never the less inhabits a separate, almost fantasy world of its own - another point acknowledged on the DVD's accompanying interviews. It's a place not unaopposed to the fertile and dark imaginations of Caro and Jeunet (to whose successful Delicatessen it has sometimes been compared) if without their Gallic flamboyance, and whose odd elements gradually fit into a weird whole. Indeed the last scene of the film makes the point succinctly, drawing together the principal characters in a moment that is both playful, absurd and unifying at the same time. Given the unique nature of Green Butchers (how often does one see a Danish cannibalism movie?) as well as uniformly excellent performances, it can be recommended.","De Grønne slagtere or The Green Butchers as it is called in English is a very dark comedy about two losers who work for a popular butcher. They are fed up with their bosses criticism and decide to start a business on their own. Their shop is expensive and it doesn't even have electricity all over the place. And to make things worse, they haven't got any customers (as their former boss predicted). When the man pays them a visit in their shop, he challenges them to provide the meat for a dinner party he organizes.Than a tragic accident happens. One of the butchers locks the electrician into the freezing chamber when he closes the shop. The man dies and the neurotic one of the two butchers decides to cut fillets out of the electrician's thigh and serves it to the dinner party instead of calling the police. It's an incredible success. All at once every person in the village wants to taste that incredible \"chicken\". Overwhelmed by his sudden success the butcher sees no other option but to kill more people, who he can sell as chicken.I guess that the subject cannibalism may not be enjoyed by everyone, especially not because it is shown with a lot of humor. Personally I liked it a lot. It shows perfectly how far some people would go for some social acceptance and to get out of their isolation. It may sound a bit far-fetched, but I'm sure you would be surprised to see how people in real life sometimes act.Next to the original subject, I was also pleased by the actors' performances and the humor. There is no overacting, as you might expect in this kind of movies, it's all very sober and realistic (I guess that's typical for the Scandinavians and Scandinavian movies). The same for the humor. I'm sure I wouldn't have liked it as much as I did now if the humor had been over the top, or with a lot of farting, vomiting,... like you see so often in American movies. I loved this movie and I give it an 8/10.","THE GREEN BUTCHERS (Anders Thomas Jensen - Denmark 2003).How do the Danes keep coming up with these films that are consistently funny, sharply written, exquisitely filmed and filled with great performances? THE GREEN BUTCHERS is a dark and wickedly funny comedy, in many ways the Danish counterpart of EATING RAOUL and DELICATESSEN, but it has more on offer than just laughs or parody. The film brings us the duo of chronic pothead Bjarne (Nikolaj Lie Kaas) and chronic perspirer Svend (Mads Mikkelsen). Sick of their evil boss, the two pals decide to open their own butcher shop in a small Danish town, but initially business is slow and customers stay away. When an electrician is accidentally locked up and freezes in their meat locker, Svend decides to turn the man's thigh into fillets he promptly nicknames \"chickie-wickies.\" This special dish suddenly has everyone in town flocking to their counter and Svend - unable to resist this sudden leap into popularity - turns into a serial killer with Bjarne acting as his reluctant accomplice. But soon, led by their ex-boss, many people in town are starting to wonder what special ingredients the two men are using.Without the extraordinary performances by Kaas and Mikkelsen, the film might not have risen above the level of the average black comedy. On paper, the character of Svend might border on caricature but Mads Mikkelsen portrait is that of an earnest, insecure and deeply twisted man, but Mikkelsen manages to make him frightening, funny and moving at the same time. Kaas actually plays a double role, also playing his comatose twin brother Eigil. When watching the film, I never even realized it was the same actor. The other performances are just as wonderful with every character in town refreshingly off-the-hook with some truly wonderful vignettes.The subject material is - naturally - a bit morbid and the material might not be completely fresh, considering quite a few predecessors that handled the same kind of material, but director Jensen gives it a fresh twist and manages to build some real characters with the strange duo of Svend and Bjarne, with this wonderfully bizarre tale of two social misfits.Camera Obscura --- 9/10","If you don't mind subtitles, you like comedy and truly interesting characters, along with a taste of something different from mainstream American cinema, then take a chance and rent this film.Two contrasting friends, (one very neurotic sweater, the other the strong quiet loner type) working for a jerk butcher in a smaller danish town, decide to strike out on they're own together and open a butcher shop themselves. Not successful at first they incorporate something new to they're recipe and become an instant hit with the village.That being an interesting story in itself, this smartly humorous film is laced with even more, (friendship, romance, crime, death, personal tragedy) that makes this film so funny yet riddled with numerous subtle interests that make it so interestingly funny yet warm and fuzzy.A must mention is the characters created and the actors making them believable. You can have the best script yet if the characters aren't believable it can sink a film and with this, the directing, acting, character believability and story all mesh so well they make this a very entertaining film.So, if your in the mood to stretch a lil, want to see something very good yet done a bit differently, then I suggest you rent this film while I'm on my way out to find more by director writer Anders Thomas Jensen.","The art of the absurd is alive and thriving in current Danish cinema! Well, at least it is in this movie. Nobody in this movie are amused. They are all either annoyed or shocked, and if they aren't yet, they soon will be! It is a story of screw-ups, murder, embarrassment, dignity, and, in the end, love and redemption. The chilling, awkward humorous style is idiomatic and won't appeal to everyone, but personally I found it to have just the right fascinating mix of the bizarre and the absurd. You pity the characters from a distance, even as you dislike them up close and personal. But their story is so tragic that you find it in yourself to forgive them and be happy for them, even when they get away with murder.This is, in my judgment, definitely the best Danish movie of the last few years.9 out of 10.","This is, by far, the best movie I've seen in a long while. It is a wholly original and beautiful plot. It is not boring, nor is it too dramatic. The characters are tangible and realistic, but it does not take away from the story line. The fact that is not in English is most likely the final touch. The end leaves you fulfilled in a way I've never experienced in a movie before. I wish I had found this movie earlier.More lines.more lines.more lines a lot more lines c'mon, i'm done","Many Americans are lazy, and this has manifested itself even in our DVD-watching. Many of us don't like to take the time to read an hour-and-a-half (or more) of subtitles, so we choose not to see many foreign films. One film that is TOTALLY worth your time, no matter how mundane a task you might think the subtitle-reading is, however, is \"The Green Butchers.\" It's by far the best foreign film I've ever seen, and tops many American films I've seen lately as well. It's a complex situation told in a remarkably simple and funny dialogue. The character depth derived in this film is AMAZING. The way Svend and Eigel (sorry if those are spelled wrong) feed off each other's contrasting personas is downright spectacular! The actors were well-cast, and I'm very much hoping that a sequel is in consideration...it needs very little of Bjorne and what's-her-face...just give me Svend and Eigel on some sort of journey with supporting characters and more amazing dialogue! To the author of this fine screenplay, I say: Write more! The story itself is rather twisted, but you'll find yourself rooting for the bad guy anyhow...with no remorse. PLEASE check this movie out!","Not entirely sure how I stumbled upon this movie, but I'm so glad I did. Initially, we were put off by the fact that it was subtitled, but even my dyslexic brother who hates to read (especially at the weekend) enjoyed this film. I found the script fantastic and the way it was delivered in such a dead-pan manner only added to the puddles of pee on my sofa. Not entirely sure whether it's quite so funny to the native Danish as the comedy seems to be enhanced by the tonelessness of the subtitles and the ambiguity of the translation. I haven't watched many Danish films (or any for that matter), but judging by this film I'm guessing they're not constrained by the same political correctness as elsewhere (gawd bless 'em) making the character of Eigel a breath of fresh air, because let's face it special needs are funny. There are so many great one-liners in this film it puts American sitcoms to shame.","OK, so I'm not usually one that runs out and rents foreign movies...especially foreign dark comedies. I think I can count on one hand the number of films that I found genuinely hilarious from beginning to end. This movie will be added to the short list. Even dark comedies right out of Hollywood sometimes turn me off because they require an incredibly dry sense of humor. But this one had my eyes welling up with tears. My sides hurt. I haven't laughed that hard in a long time. This movie was recommended by my mother and I don't think I would have even dreamed of watching it had she not raved about it. Don't be afraid of having to read during your movie - you'll miss out on a hilariously well-acted flick.","The Green Butchers was a very funny Danish Black Comedy about a pair of losers who decide to set up their own Butcher shop. Their business is failing and they accidently lock an electrician in their freezer where he dies. When their former boss comes by to taunt them and challenges them to provide the meat for a dinner party, the obssessive compulsive one (Svend) snaps and makes filets out of the electrician's thigh and serves it to the dinner party. The other butcher (Bjarne) is shocked but goes along with it thinking it would be a one time thing. Meanwhile, the brother (Eigil) of Bjarne wakes from a seven year coma and wrecks havoc on Bjarne's life. The brothers are twins and are played very well by one actor. The dinner is a success and he next morning there is a line up at the two butcher's place. Svend is enamoured by the fact people actually like him and wants the adoration to continue while Bjarne has troubles with his brother and turns a blind eye to what Svend is doing. Eventually things work out. 8.5/10 If you liked War of the Roses or Dr. Strangelove I think you'd like this film.","This is actually a brilliant movie. The story is grotesque, but the actors are brilliant. Especially the performance of Mads Mikkelsen as Svend, is magnificent. It's a simple story about two guys with an urge to make it on their own, but it unfolds to a strange and absurd story, with a lot of people accidentally getting killed and served up as chicken steaks. If only more people understood danish... This could be a great candidate for an English version. It is also worth mentioning Ole Thestrup, who always delivers that extra twist to the plot, with his slightly mad character Holger. I can only recommend this movie to the danish audience. Also take a look at Adams Æbler (2005), a movie by Anders Thomas Jensen, also with Mads Mikkelsen accompanied by a well playing Ulrich Thomsen.","Good Lord... How this ended up in our DVD player I'll never know...my wife thought it was a new release she'd missed somehow...Nevermind it's a couple of years old and in Danish ( I think)... She kept looking for the English soundtrack...All in all...the film wasn't bad... Good production values,better performances, and a clever story that doesn't get too far away from itself make for tidy, dark-humored fare from across the sea! The ending will make you chuckle...in fact, the whole film will. Incredibly strange characters that we grow genuinely interested in make a film that might be worth your while...Without spoiling the plot, the film's title and DVD jacket give you a good idea where this thing is going!","'Taste this marinade' 'No' 'Smell the marinade' 'I smoke 20 joints a day. I wouldn't smell my hair if it was on fire'This is the kind of humour you are up against with this movie and I love it. The Green Butchers is a wry, dark but well executed movie that doesn't act like a brash, puke 'em up, farty yank movie would with the same subject matter. Oh no sir. None of that old rubbish here. Scandinavia wins again and this time it's a Danish offering. Two butchers work for a man who is less than impressed by their efforts so they go it alone and open their own butchers shop to escape his scathing criticisms and earn some self respect. The opening doesn't go well. Then there is an accident. Then there is a modicum of success. Then there is a lot of success, But, because of this there has to be another accident to keep up with supply and demand. People disappear. But the meat is so good. Do you see where I'm going with this.? Not one spoiler will there be in this review. I gave this movie 9/10. Why not the full 10? I hear you ask. Nothing is perfect in this world that's why. But The Green Butchers comes mighty close in my humble opinion. Get it people and enjoy. Oh by the way CANNIBLISM is a part of this movie. Even if it is by default. =-)","This movie is a mix of a dark comedy and a drama, about two guys who worked in a Butcher's shop and wanted to build up their own. When they finally fulfilled that dream, they faced a new problem: there were no clients! One day, by accident, one guy dies in the refrigerator room, and a new kind of butcher's business begins They start selling human flesh, saying to the clients it's just chicken and their business starts to improve: Human flesh sells good! Oh! I forgot to say something These guys aren't normal! There's really something missing in their brains! The movie has some nice dark humour scenes, but it is, in my opinion, mostly a drama. One that shows us what is inside the head of a psychopath, what are his motivations to what he does. I must confess I was a bit surprised with the ending of the movie, because I never expected they could make it without been discovered, but that's probably because I see too many Hollywood movies What I mean by this is that in Hollywood's cinema we always expect the punishment of the guys which do the \"bad things\". There's always a morality protecting the \"good values\", in spite of we all know that in \"real life\" it doesn't happen this way too many times And I liked this movie mostly because of that, because it fits in a kind of cinema which is true, frontal, without fake moralities, and which \"see\" what is on the other side, behind the \"conventional morality\" It just happens in independent cinema (especially in the European)! Besides, there're excellent performances by Nikolaj Lie Kass and Mads Mikkelsen (especially the first one) in the roles of the \"disturbed guys\" Very nice Danish film!","Send them to the freezer.  This is the solution two butchers find after they discover the popularity of selling human flesh.  An incredible story with humor and possible allegories that make it much more than a horror film. The complex characters defy superficial classification and make the story intriguing and worthwhile - if you can stand it.  Definitely a dark film but also a bit redemptive.","of Adam's apple and With Your Permission. I didn't know until looking it up just now. Also the errrrrrmmmmm 'Wilbur Wants to Kill himself' I prefer this very focused deadpan ...drama over Adam's Apple's over the top comedic zeal. But With Your Permission is much more layered and subtle, but that's another director.Once the 'meaty' part of the story takes place I felt the dread of coming back to the shop again and again. A bit claustrophobic .. maybe that is intentional. It builds on the atmosphere. You dread the rediscovery and again and again until the 'kick in the shin'.this is some funny stuff.","I think when you make a movie about butchers that use a \"special kind of meat\", it's inevitable that your film will be compared to and measured against a former masterpiece Delicatessen that uses pretty much the same premise. And if you do this comparison, sadly The Green Butchers will fall short.It lacks the visual gags of the French classic, its characters are underdeveloped and kind of distant and the story has its bumps, too. As far as the humor goes, there are a couple of good lines but altogether I didn't find the film particularly funny. And it's not me against black comedy because I like the genre but I think a film like this in order to be really amusing needs characters that are genuinely funny in their quirkiness. Unfortunately in Green Butchers there weren't any and on top of that the scenes involving the twin brother were more embarrassing than comic. I also felt that the two Danish stars were not as comfortable in their roles as they should have been to be able to portray them effectively.So the Danish Delicatessen was a bit of a letdown for me considering the high standard movies from Denmark have set lately. Maybe if you see it without having Delicatessen in your mind the experience would be better (it won't be an easy job because the filmmakers were obviously aware of the French movie and included various hints at it throughout).","\"De Grønne Slagtere\" (aka \"The Green Butchers\") is a great Danish comedy that has a twist of very dark humor to it. Why? Well, because the movie has some really hilarious characters in it, and also the storyline is very bizarre - about two misfit butchers who open up a store and become famous for their meat, human meat that is.There is a lot of funny situations in the movie, many of which are really well carried and delivered by both Mads Mikkelsen (playing Svend) and Nikolaj Lie Kaas (playing Bjarne and Eigil). These are, of course, the main driving force in the movie, but they are well accompanied and supported by people such as Ole Thestrup (playing Holger).The movie is set in a small town in Denmark, and it actually depicts such a community quite well, well aside from the murdering and turning corpses into food, of course. The movie does have a cannibalistic topic to it, but it addresses this with a great sense of humor, and that ghastly topic is not really the main issue for the storyline. So thumbs up for director Anders Thomas Jensen for managing to pull this movie off as nicely as he did.\"De Grønne Slagtere\" is definitely a comedy that is well worth checking out if you enjoy comedies that are supported by a bizarre and twisted storyline. I warmly recommend \"De Grønne Slagtere\".","This movie is the funniest danish movie I've ever seen!The plot is funny, surprising and exceptionel. Danish humor is unlike any other, and it gets you every time. The entire audience laughed 90 % of the time....it was incredible. The characters are so well played, and the two actors, Mads mikkelsen and Nikolaj Lie Kaas play their best ever!I would highly recomend seing this movie, you won't regret it, believe me :-)","Cannibalism, a pair of cinematic references to Delicatessen, not only in plot, but in style. Cannibalism, a pair of references to the historic case of the Uruguayan rugby players that survived in the Andes by eating the dead members of their flight to Chile. Cannibalism, only an excuse the movie uses to delve into the extremes men are willing to go to defeat isolation and obtain social acceptance.The script is extremely creative, and hopefully is going to leave the viewer laughing and wondering...","This is a novelty in Danish film. The mood is not unlike that of Blinkende Lygter, also by Anders Thomas Jensen, but with a novel touch. One difference is fewer characters, leaving much more room for them to be dwelled into. And what characters?! The two butchers are perfect. Mads Mikkelsen is a dominating, deranged parody and Nikolaj Lie Kaas an indifferent looser with a twin brother more or less an unholy pairing of the two.","Living outside of Denmark I only got to see this on DVD, however, I doubt that has changed the experience as this is a movie built on the same dogma-like principles that have proved very successful over the last 5 years.There is no hand-held camera or the like (as in the original dogma-films), but it is all very down-to-earth with focus on the actors, the dialogue and the story.Unfortunately this story is nowhere near the level of some others (like \"Festen\"). It tries the same dark form of comedy as seen in \"I Kina spiser de hunde\" and \"Blinkende Lygter\", and it works reasonably well as a comedy.As in \"I Kina spiser de hunde\" the entire story is built around some extreme characters doing some extreme stuff, and in neither case is it convincing. It is too far fetched and that makes the whole thing too boring, because it is not that amusing, just weird.The actors do a terrific job and this is what raised my initial rating of 4-5 to a 6. Especially Nikolaj Lie Kaas is excellent in his double-role as the twin brothers Bjarne and Eigil.Don't watch it for the story itself, but the actors' performances - and then there are some pretty good lines in there as well.","The psychology of the characters is so well constructed, and carries through the movie very well. You get immersed, and to a certain extent, their insanity is relatable, and funny. The ending made it even more worth the twisted trip.","This without doubt one of the funniest and most entertaining movies I have ever seen. I really enjoyed the characters in the movie. They are all wonderful bizarre in them selves. It's quite something I have never seen before in any movie.The story is almost non-stop from beginning to the end. There are no boring moments. I was totally captured by the movie. And I thought the acting was great.So if you want to see a fun movie. You should look for The Green Butchers. A great movie.I give it 10/10","That said, this movie is hillarious and has a few ideas to add. If you haven't seen 'Blinkende Lygter', I'd recommend that over this - if you *have* seen it and liked it - this is definitely for you!Particularly noteworthy is Nikolaj Lie Kaas' perfomance as two very different characters - a set of twin brothers, one of which is brain damaged."],"review-user":["FilmFlaneur","philip_vanderveken","Camera-Obscura","FilmFan777","sarastro7","Howsadtosee","johnnyb6202","acleon","andreakranz","Proud_Canadian","bisbjerg-1","LAKERS34","daddyzee631","mario_c","FilmLabRat","dumsumdumfai","drylungvocalmartyr","paul_haakonsen","anja_jansen","ganrique","thniels","JesperT","marianasambora","inmewetrust","FuzzyCerts"],"review-date":["3 February 2006","25 December 2004","28 October 2006","8 October 2005","16 January 2005","16 August 2005","30 July 2005","6 May 2006","26 February 2008","3 December 2003","11 November 2005","22 June 2005","5 September 2011","29 September 2007","19 January 2004","15 September 2008","26 October 2008","25 May 2013","24 March 2003","1 November 2003","24 March 2003","18 July 2004","10 September 2018","22 March 2006","13 November 2003"],"review-rating":["8","8","9","9","10","9","9","10","7","9","8","7","8","5","7","10","7","8","6","9","10"],"review-title":[" A cut above the normal...\n"," A very dark, sober and realistic comedy\n"," Deers sausages and \"chickie-wickies\"\n"," Funny, well written, directed, acted and full of charm\n"," Serious comedy\n"," Excellent Movie!!!\n"," Best \"foreign\" film I've ever seen!!\n"," Excellent film that I can't write enough good stuff about it\n"," Lol Hilarious!\n"," A good black comedy film\n"," A story about two guys, trying to cut it, in the cruel business world\n"," Well Crafted, Bizarre...\n"," Scandinavia FTW.\n"," Human flesh sells good!\n"," what to do with troubling people\n"," the same writer\n"," Not quite the new Delicatessen\n"," How much do you trust your local butcher...?\n"," Danish humor rocks!!!!!\n"," The Vue From Below\n"," Bizarre and funny\n"," Bizarre and black comedy\n"," Twistedly hilarious.\n"," Excellent bizarre and funny movie\n"," Delicatessen did not go unnoticed...\n"]}