{"review-url":["http://www.imdb.com/title/tt0395616/reviews"],"review-text":["I've just watched this with my three children - 12yrs (boy), 10yrs (boy) and 8yrs (girl) and this film was good old fashioned family action adventure. Although definitely aimed at the kid market (I'd say 5 to 13)it was certainly watchable and as a parent it is a pleasure to find a movie that appeals to a broad range of ages whilst still being suitable for the whole family to watch - particularly younger children.The story revolves around Ricky, a bit of a nerd with a vivid imagination (this can definitely be seen in his daydream sequences) who foils a kidnapping and major art theft while on on-board a flight to Washington for a school trip. Ricky's dad is an airplane mechanic, so Ricky not only knows the structure of the aircraft inside out but is also a top-gun on his computer flight simulator. This comes in handy when the pilot and co-pilot are out cold through a series of misadventures and there is no-one left to fly the plane. I don't want to give away any more of the plot.","This film is titled \"Junior Pilot\" here on IMDb but \"Final Approach\" at Netflix. Go figure! The movie is a delight for both the target youth audience and for adults who can suspend their maturity long enough to watch this film through the eyes of their own youth. For the adult, the story is quite predictable, and perhaps trite and melodramatic; whereas the tale may seem new and creative to youngsters who have not yet seen or read many films or books with such a story line.In any case, credit must be given to the film's creators, particularly the director James Becket and the cinematographer Denis Maloney, for making this most entertaining and visually interesting film. The cut-aways to the young protagonist Ricky's fantasy thoughts are hilarious as well as delightfully filmed.The young actors give uniformly believable performances, seemingly quite invested in their roles--silly as many scenes are. Jordan Garrett plays the protagonist \"Ricky\" with quite well, having excellent camera presence. Jeffrey Tedmori creates a delightfully soft and sensitive \"Shashi\" who of all ridiculous things thrives on hot sauce. Skyler Samuels and Adam Cagley give solid performances as well.As is typical of his always fine acting, Larry Miller creates a solid parental figure around which the children's part-real, part-fantasy world revolves. Compared to his father-figure, the other major adult roles appear to be shallow and one-dimensional, intentionally and quite humorously so, to be sure.This movie is a simplistic youth-targeted story, of course, yet it is quite entertaining, perhaps repeatedly so to the targeted youth crowd, but also for at least one viewing by adults who retain the ability to view such a film from their once-youthful perspective.","I spotted this film in a branch of the Duane Reed pharmacy in New York on holiday, and it seemed like a bit of silly fun. And sure enough, the whole premise is ridiculous beyond words - but it turned out to be a thoroughly enjoyable action film for kids, and their parents too.10-year-old Ricky Bernard (Jordan Garrett) has his head in the clouds most of the time, much to his father's (Larry Miller) dismay. As a member of his school orchestra, Ricky and schoolmates fly to a concert performance ... and once again Ricky's mind 'takes off' and suspects some criminal plot is happening.Reluctantly aided by best friend Sashi, who is a fan of hot sauce (what a strange plot device that was) and others they try to get to solve the mystery. Oh yes, and Ricky's skills 1,000 hours of flight simulator experience prove to be handy when he is called on to save the day in the film's thrilling climax! It was good to see Eric Roberts and Mark Dacoscos play parts in a family film. And watching the DVD interviews everyone seems to have had great fun taking part.I totally liked Junior Pilot; charming and good-natured performances, funny plot line and a real; sense of enjoyment and sheer silliness.If you are looking for an entertaining family film, you could do far worse than buy this one.","This was a great movie. It had one \"sot-so-nice\" outburst. Plus there were some very intense (drama) scenes which might make it inappropriate for younger viewers, under 6.For a under the radar film, the acting was quite enjoyable, and touched down in our family room for a near perfect landing. It held the attention of our whole family and we were kind of sorry to see it end.This movie had elements of spy kids with young people saving the day, but was given a somewhat more believable scenario. The dream scenes were a distraction at first, but did a great deal to establish the plot. The pranks and hi-jinx were also quite amusing.We hope you like as much as we did.","Definitely worth renting! Good clean family entertainment. My 4 and 5 year-olds (and I) loved it. Kept them on the edge of their seats. I recommend parents sit with their younger children to watch this, as it can be quite suspenseful for them. It's not too often you can find movies that you can watch with your children, and so this is a rare find. Some of the acting / realism isn't quite there at times, or maybe is a little corny, but children don't seem to notice or care, they love it. Parts are predictable, but other parts are not - like trying to figure out who the good guys are and who the bad guys are. The movie doesn't have any really scary/creepy stuff, and so I doubt it will give children nightmares. It does inspire children to dream, which is something we need to encourage and foster more in our children. Rent and be blessed!","perpetrated on children. More often than not it's simply a series of gross misrepresentations of reality. Packaged in a 'nifty' kids' format (as so many others in the genre) this film does just that. From the head-phone-less 777 pilot who reads a 'newspaper' in the cockpit (folded, read from the hand with less than serious attention, an en-route flight chart is hardly a suspect here; and taking off his glasses in the direst emergency during the film doesn't help) to the ridiculous time-segment distortions, children are given the impressions that not only does everything happen in slow motion in the world, but that 1) professionalism, 2) today's technology, and, 3) emotional stability  among countless other real-world scenarios requiring mature judgment - can be plucked out of the air and bent for their own use simply because they think it so (Hollywood: guilty as charged).Parents, try this at home: give your offspring a good dose of REALITY during the viewing of this flick (put the recorder on 'pause' at the appropriate moment and MAKE IT SO). It may consume some precognitive time --- on your part. There's nothing wrong with fantasy, just make sure your kids know the difference. And, FYI, it's one of the main reasons English-speaking children fall so far behind many nations of the world in high-school and college aptitude. We're not only losing our engineers, teachers, artists  and yes, dreamers  for the same reasons, we're losing parentage.FANTASY: 10 --- REALITY: 1, for an HGN rating  Hollywood Gross Negligence. PS/yes, I've raised children (5)  they're all out of college, doing well and having payed their own way; they know 'the difference' and I didn't pay a dime, just a lot of attention","This is officially the terrible, boring, corny, and ridiculous movie ever created. The movie is all about a crazy kid and his friends, and they land a 747. His dreams are very corny and make no sense at all, and is very poorly done. Every special effect looks as if it was done without any modern technology, and might have been created by the kid that plays the \"leading role\" in the movie. If you watch this movie, it will definitely make you stupider. I advise you to never consider watching this movie, and if you do, good luck and don't miss the brain cells you killed off. My comment does not even fully grasp the awful creation from hell that has been made. The person that wrote the comment before me did not watch the same movie that I dreadfully watched, and wish I never watched. Peace.","There are no - NO redeeming qualities to this film. They didn't check a single fact - NOT ONE about... anything. I feel sorry for Larry Miller, and even more sorry for his agent for not being more capable for finding him a more suitable venue.The adults are all idiotic. The effects are cheesy and devoid of any sense of reality. The music is honestly cheesy. The plot is beyond belief.I you want to see something good with your family, see anything else. Take some time and check for mildew in your attic. My ten-year-old is mocking this film as we watch it. He's unfortunately learning that not every movie is worth watching."],"review-user":["fetchyourmovies","TJMurf","rodneykumar","duparker","Pastor_Dave","Missileman1","littlepelejr10","xlkorg"],"review-date":["29 April 2005","22 March 2006","23 October 2008","17 October 2006","21 April 2007","9 May 2006","20 February 2007","17 February 2007"],"review-rating":["7","8","9","10","8","1","1"],"review-title":[" Good clean family fun!\n"," Fun for kids & good for adults too.\n"," Great fun! Go buy it!\n"," Final Approach (junior pilot) gets thumbs up\n"," Gets a two-thumbs up from me!\n"," Sometimes VIOLENCE isn't the only cruelty...\n"," Worst Movie Ever Created.\n"," Inconsistent, predictable, brain-dead and awful\n"]}