{"review-url":["http://www.imdb.com/title/tt0390441/reviews"],"review-text":["This DVD will be treated with indifference by mllions of classic rock music devotees across the world because Rush just aren't cool. It is a shame that Rush have had to overcome sneering disdain from the majority of North American and British music journalists over their thirty odd year history as this has deprived many people the chance to get into a real band.Each of the last four decades are well represented here and what a catalogue of songs it is! We have the seminal \"2112\", the magical \"The Trees\" and the lyrical \"Tom Sawyer\" interspersed with the high-energy, genre-challenging pieces from their latest album \"Vapor Trails.\" The musicianship is almost flawless, the stage show is spectacular and the Brazilian fans are just plain crazy (at one point they sing along to an instrumental!)Each band member plays at a level that defies belief-real craftsmen performing art.If you doubt this try out the instrumentals \"La Villa Strangiato\" or \"The Rhythm Method\" for size-and yes the latter is a drum solo (which has to be seen to be believed.)Sound and vision production values are very high as befits the Rush experience and you also get a documentary and multi-angled set pieces to boot.This is an astonishing performance and tribute to the Canadian rockers and all serious classic rock fans should own a copy.","I loved every aspect of this DVD set.  Yes, the production was sup-par; but if you read Neil Peart's liner noted you'll see that this was a hurry up project.  It was all recorded from the back of a van on a last minute basis under the threat of the sky opening mid show!FABULOUS!!!  Rush at their best in years. The music is phenominal, the crowds are more alive than anywhere in the States or Canada, and the guys are ON FIRE!  Some old favorites such as \"The Pass\" are mixed in with the usuals.  They even added \"Closer to the Heart\" back into the playlist specifically for the South American leg after hearing that it was the crowd favorite.All in all, a superb live DVD... And you gotta love the Vapor Trails dragon!","This much anticipated DVD memento of Rush's visit to South America in 2002 is possibly the finest rock video ever set down on disc.The picture and sound production values are amazing,even more so as they constantly battled the elements to bring this production off. All the tracks you would expect from the RUSH catalogue are here from Tom Sawyer to The Pass gloriously reproduced for the frankly,orgiastic Brazilian crowd.They actually singalong to YYZ-which is an instrumental, and gives you an indication of their fervour!The first disc is the concert and the second disc contains 3 multi angle set-pieces -la Villa Strangiato,YYZ and the awesome drum solo, plus a 30 minute documentary about the bands visit to Brazil. All in all this is a triumph and all serious classic rock fans should own a copy.","How do these guys keep going? They're about 50 years old each, and act as if they're only 30. They play 3 hours of music at every concert, and barely break a sweat. This DVD is their first concert in Rio, Brazil. Although the people don't speak English, they try to memorize the words to the most famous Rush songs, and try to sing a foreign language at the concert with their best friends.From Tom Sawyer to The Spirit of Radio, this concert DVD will keep you in the chair not wanting to pause or move away from the classics that you've listened to when you were young. This is their 30th reunion tour (started in 1974). I went to their Scranton PA concert, and this was just as good, although in PA they didn't play Freewill, so I was upset.They have Freewill, they have The Trees, they have YYZ, The Pass, Driven, Dreamline, Red Sector A, Limelight, Roll the Bones, 2112, and much more. 10 out of 10, because nothing else compares. If you never go to a Rush concert, then at least buy this DVD.","First I have to point out other comments about the editing/MTV quality of this video.  Once you see the pains and heartache they went through in order to deliver this video to the general public, you will have a better appreciation of what they've done.Through rain, bad weather, mechanical malfunctions and thousands of screaming fans, Rush was able to record and edit their first concert DVD ever!  There's no sense commenting about the quality of the editing once you actually watch the documentary and realize what they were up against in filming this; just sit back and enjoy the show!The show goes on for several hours, spanning just about every album of their 30 year career.  There are songs for every type of Rush fan from every generation.  They play some old, rarely heard classics (ByTor and the Snowdog) to some of their 80's hits (Tom Sawyer) and songs off their latest release, `Vapor Trails'.  There's something for everyone as far as their music goes.The documentary is one of the only video documentaries Rush has ever recorded.  You get to see everything and everyone, from Neil warming up, Alex goofing off and Geddy stressing about his hair :) This is one of the only times the `boys' have provided this in-depth look into the band, and is worth the price of the DVD set alone in my opinion.I will admit, the screaming fans get a bit much at times, but hey, when was the last time you've heard of Rush performing to an audience equivalent to the type the Beetles did in the mid 60's?  It's truly awe inspiring.","I purchased this DVD recently and I was totally awed that Rush's songs sound the same as they did when I first listened to them in 1980. The lineup of Geddy Lee, Alex Lifeson and Neil Peart is so talented that I want to listed to them play again and again.Songs I remember like Tom Sawyer, XYZ, The Big Money, The Trees, Freewill, Closer to the Heart, 2112, Limelight, and The Spirit of Radio were played and the 40000 plus fans there singing along and having a great time and I swear over half the audience was under 25!Writers who put down Rush as far as Rush fans like myself are concerned are a bunch of jealous dunderheads who like to taste rancid sour cream mixed with lemonade in a taco.Rush doesn't put on makeup, wear spikes, lip sync,wear lipstick, get in trouble with the law, and have a band member brag about how long they have been unmarried. All they do is entertain!I give this DVD a 100 out of 100.","Rush in Rio is simply an amazing DVD. This concert is one of the peak moments of the history of Rush and they deliver their music brilliantly and with more power than ever.I was lucky enough to actually be in this concert, and not only that, I was in the very first row grabbing the gate that separated the audience from the stage!! It's the first and only time I've seen a Rush concert live and it was a dream come true for me. I have no words to accurately describe this experience but I can tell you it is one of the highlights of my life.Some people complain about the sound of this DVD saying it is not very clear and polished, but the sound you listen is real, true to how it was in the concert. It is raw and powerful and so authentic that every time I watch it I go back and re-live that beautiful moment. Many artists record live shows and then they make a lot of tweaking, so the final product is far from what the actual concert really was. Sure you can achieve a very sophisticated and polished sound this way but you don't get the real thing. This is not the case with Rush in Rio, this is the real deal!! I admit that I enjoy those fancy sounding concert DVD's, I love music and the sound is a very important aspect, but it's refreshing to listen to a concert that is so honest. You listen to Rush just the way they sound in a live performance, no tricks, no tweaks. This is a real live concert DVD.I highly recommend Rush in Rio, the set-list is fantastic and the performances by Geddy, Alex and Neil are mind-blowing. Not to mention the crowd, you can see how much they love Rush and sing along to every tune, even YYZ which is an instrumental!! I actually appear singing twice; in Tom Sawyer I sing \"always hopeful yet discontent\" and in Earthshine I sing \"only reflect\". It's just a few seconds but I simply couldn't believe my eyes when I saw myself in a rush DVD!! Awesome!! I hope you enjoy this magnificent concert from the greatest band on Earth.","These guys are excellent and anything they put out to the public is first class. The musicianship of this band is amazing and we should all be very thankful we live in a world where Rush exists. Future generations will never be able to see such mastery live and in person. Get this DVD and you will enjoy it throughly!! I was recently able to see these incredible musicians play in Houston, TX and was blown away. I have not missed a show since power windows and I have to say that they are better than ever. Everyone should embrace these guys and teach others what real musicianship is! There will never be such a tight and well put together trio again in our lifetime. Lets just hope and pray that they do not retire anytime soon!","After searching for 6 months, I finally found this DVD. All I can say is it was damn well worth the wait! \"Rush in Rio\" may very well be the greatest rock DVD in existence. I'm not joking. It's incredible! All the fuss about the sound being crappy is true, however it doesn't make the concert unwatchable. I find it makes you feel like you're actually in Rio watching the concert from the audience. That's one of the reasons I love this DVD. It makes you feel like you're actually there. Also, Geddy, Alex and Neil have never been in better form! Geddy's vocals are flawless, Alex's guitar playing is still incredible, and Neil - absolutely no words to say. The camera work on this concert was very good I must say. They gave us a good look at everything that was going on on-stage, and in the audience. Kudos to the cameramen! Anyways, enough of my raving! Go watch \"Rush in Rio\" for yourself. You will be amazed. I guarantee it.10/10","I have been a \"huge\" rush fan ever since \"moving pictures\" and this concert is simply and example to everyone who is a fan why Rush is so popular. They completely admitted to playing their biggest concert yet, and, despite the rain in a soccer arena, they still manage to give an outstanding performance from start to finish. A real example of this is during \"yyz\" the entire crowd start to sing along to it in a real classic manner, in perfect sinc. They really play all of everyone's favorite songs with a real powerful \"lust\" that rarely happens anymore. You get the best seat in the house for one of their best concerts given. The second DVD is a fascinating documentary of the band while they are in brazil and shows you a lot of the backstage things going on and it allows you to see them not just a musicians but as actual people in their everyday life. This DVD gift set is a must for any Rush fan young and old and is definitely a keeper for your DVD collection. Their is even a cd of the concert for those who just want to listen to the music. This DVD is worth it!","\"Rush in Rio\" is, no doubt, one of the most exciting DVDs I have purchased. Although I am a biased Rush fan of almost 20 years, I found this performance to be flawless.  The music is heavy and sharp (which sounds great on any surround sound system), the band is energetic, the crowd has a constant smile... it's like they were able to capture every concert I've been to. For any Rush fan, this DVD is a must; if anything, just to see the \"Boys in Brazil\" documentary (which reveals the travels of this rather isolated, personal band).  For any non-Rush fan, this DVD is an enjoyable concert. Rush fans know the talent of these three Canadians.  We have rather firmly stood by them for years.  I've shown this DVD (or portions of it, anyway) to those who have never heard of Rush, or those who think Rush is less than good because they do not appeal to the pessimistic masses of rock (i.e., sex, drugs, and a drunken frenzy).  The bottom line is this DVD is worth every penny and more than worth the time to view it.","Having seen Rush live, I'm able to appreciate the awesomeness of this. Others may complain of sound problems, but it's sometimes over dubbed by the overwhelming screams of 60,000 Brazilians and it goes to show the band's territorial gain of attention","After 30 RUSH shows, I might trade most of them in just to be in the crowd in Rio! Seriously, how can you not want to be there? I'd give up at least 13 shows just to bounce up and down with the fine folks from Brazil. Must have been nice to let EMOTION take over the Cerebral. Let's just quit with the \"production value\". Are you kidding me?!!. I have seen some great shows...but Rush in Rio..well honestly it gives me chills. I can tell just by looking at the guys...it pumped them up! To see that crowd react to them the way they did, must have been AWESOME! I'd have loved to been there! I saw that tour, in the states, and well, the folks were just to intent on listening to the music, but they forgot to enjoy it. The fact is RUSH, IMHO is the greatest Rock band of All Time!!!! You want to say they are something other than a rock band....knock yourselves out...as for me...THEY ROCK!!!","A long overdue concert release, Rush-in-Rio DVD is both compelling and disappointing.  This slick two-disc set shows Rush at their finest.  After 30 years of honing their unique sound, it's great to have this record of one of the most talented rock bands ever.The concert features over two dozen songs, a documentary, and three songs that feature multi-angle viewing.  Packaged in a bi-fold holder with sleeve and a small insert, it's priced very well for the amount of material it contains.I'm a Rush fan of the late seventies to early eighties period, and this DVD comes through big, with half of the show highlighting songs from that era. I won't list the songs, in case you want to be surprised.  If you attended the Vapor Trails tour, then you'll know what they'll be playing.Playing in Rio to their biggest crowd ever, Rush is a huge crowd pleaser here.  In fact, that was one of the first things I noticed that was peculiar about this show.  Throughout most of this two hour concert, you hear and see the crowd, actively chanting and dancing wildly to the music.  At first, it's heartening to see the fans give Rush a well deserved response.  But after several songs, I was ready to hear and see more of the band and less of the crowd.  This is in no way a slam of the crowd of Rio.  More power to them!  It's a critique of the final editing of the DVD.Which brings me to my second and main reason \"I hate it\".  The video editing is terrible in my opinion.  Save for the multi-angle view bonus cuts, the entire show is a frenzy of visual chaos.  It's like the director wanted to see how spastic he could make it.  I count changing camera angles, on average, between every one and four seconds, constantly!  After about three or four songs, my head and eyes were ready for a break.  Which is too bad, because I would have liked to have sat through the whole show, like I was able to at the concert last year.  Maybe this fast-cut editing is the latest craze for concert DVD's, but I really think it's an annoyance and detraction from the overall experience.  As stated before, I wouldn't mind it for a song or two, but the whole visual aspect of this disc is hurried, or RUSHed. It's really ironic, because all the previous concert clips I've seen of Rush, mainly from Moving Pictures, are strictly straight-filmed, with little switching back and forth.  It's almost boring, visually speaking.  This DVD has taken it to the other extreme.  I know a lot of dyed-in-the-wool Rush fans will vehemently disagree with my statements, but that's just my impression of it.The bottom line:  If you're a Rush fan, you'll buy this DVD regardless of my review, or any other.  I still would have bought it after I had read my review.  Just don't get expect a \"normal\" concert.  Who knows, the things mentioned above might not bother you.","Admittedly Alex has become a little podgey, but they are still (for me) the greatest rock trio, ever. I wholeheartedly recommend this DVD to any fan.I was very disappointed that they canceled their planned recent Munich gig (logistics) and regret not making an effort to see them elsewhere. The DVD is a small consolation - the greatest incentive to acquire a proper DVD playback setup.Naive perhaps, but I still don't understand the significance of the tumble-driers on-stage; I would be grateful for any clarification.Cheers, Iain.","Ho humm - - - More of nothing. If you are a long-time Rush fan you know what this video contains: loathsome songs from the past, the \"BIG 3\" hits from the 80's and their \"last-ditch\" efforts to remain contemporary. They do succeed in making fun of themselves by beating the critics to the punch by portraying themselves as \"dinosaurs.\" Unfortunately, they FAIL at protecting themselves from embarrassment. Close-ups of their faces only add to the fact that these guys HAVE BEEN.If you are have been following (as much as you can stomach) the band for a couple of decades from the 70's, then you know there is no new material here. Same old, same OLD: 1) Neil avoids the press, 2) no real behind-the-scenes (Geddy looses his SHOES?! Give me a break! Even HE thinks it's absurd!) 3) no new insights.A better video would have been to show the CREW setting up for 3 or 4 hours  just let the camera run. And stop changing camera angles every 2 seconds! I understand the director wants to try to do something artsy. But then offer a full concert version of 2 or 3 shots the VIEWER can choose. We know what the band looks like  let us see what WE REALLY want to see.Do yourself a BIG favor: RENT this movie first.","I was really looking forward to enjoy this DVD, but I have to agree with topsail33's comments. The constant change of view is a major pain in the neck. I can't understand why many concert movies are produced like this. In my opinion, this doesn't resemble a concert at all. If this is the director/producers idea of a concert, I suggest he stay off the drugs for a while... or MTV. :-) I've been a Rush fan since the 'dark ages' and I think the band just keeps evolving. Kudos to you guys for beeing SO great!"],"review-user":["tonyriviere","cahoffman","tonyriviere","IamtheRegalTreatment","lerxstwannabe","HermanSchafer","vinnie2112","ButNoMore","Workin_Man","jind","jessemaddox@charter.net","markstench","rocinante_pilot","topsail33","iain-1","unionpro","michjoha"],"review-date":["18 March 2004","2 April 2004","18 January 2004","8 November 2004","17 March 2004","1 July 2008","30 December 2007","18 December 2007","24 September 2006","5 August 2006","31 December 2003","20 December 2003","8 August 2010","15 December 2003","25 December 2004","7 May 2006","3 February 2004"],"review-rating":["10","10","10","10","10","10","10","10","10","10","10","7","9","2"],"review-title":[" An astonishing performance by cult Canadian rockers.\n"," BEAUTIFUL!!!\n"," Possibly the finest rock video ever recorded\n"," Can't get much better... hmm...\n"," Great effort, great show!\n"," I ignore the critics of Rush.\n"," Stellar!!\n"," Amazing Band and an Amazing DVD\n"," The best live concert DVD in existence\n"," one of best rock bands ever show how excellent they are in Rio\n"," The Power of Three\n"," BEST LIVE DVD EVER\n"," Just To Be There...\n"," I love it, I hate it\n"," More power/professionalism from any other rock trio ?\n"," HO HUMMMMMmmmmmmmm......( < < < YAWN > > > )\n"," Rush goes MTV\n"]}