{"review-url":["http://www.imdb.com/title/tt0343644/reviews"],"review-text":["i saw this before 'bubba ho-tep' at the fantasia film festival in montreal. everything about it is either tipping the hat to (or completely ripping off) tim burton. i enjoyed it nonetheless, even if it is extremely derivative. what most impressed me was the quality of the visuals given the obvious shoe-string budget. the set design and the props were inventive and original, although the script definitely was not.","Sigh. I'm baffled when I see a short like this get attention and assignments and whatnot. I saw this film at a festival before the filmmaker got any attention and forgot about it immediately afterwards. It was mildly annoying to see it swiping the Grinch Who Stole Christmas heart gag along with the narration, the set design seen many times before, the whole weak Tim Burton-ish style, and the story that goes nowhere. And we got the \"joke\" about shooting the crows with the 45 the first time, alright?But I guess what's really unacceptable is that it even swipes its basic concept from a comic book circa 1999 called LENORE, THE CUTE LITTLE DEAD GIRL by Roman Dirge! As any quick internet search will reveal. I mean, what is this? This is what they base a Hollywood contract on and opens doors in Canada for a filmmaker? \"Give your head a shake\" as Don Cherry might say.","You may like Tim Burton's fantasies, but not in a commercial-like show off lasting 8 minutes. It demonstrates good technical points without real creativity or some established narrative pace.","Obviously the previous reviewers here are not fans of this genre, but I think this one is done quite well.It's twistedly cute clever & dark. This story brought back memories of the types of girls I was in love with as a child.Also, it makes me want to check out some of Nadia's other movies, many youtube comments about how hot she is in this video. Sure there is some Burton influence here, but I wouldn't say this Brad is trying to rip him off.He is just jumping in & adding his talents to a genre that I can appreciate. I like what he does & he does it well, nuff said!"],"review-user":["xBMVHx","Magnificos","vostf","Recordgrooves"],"review-date":["25 July 2003","29 June 2004","17 February 2003","1 August 2009"],"review-rating":["7","3","4","10"],"review-title":[" ode to tim burton...\n"," Third-rate Tim Burton and Seuss rip-off and less...\n"," Over-stressed fantasy\n"," Cute little film\n"]}