{"review-url":["http://www.imdb.com/title/tt0344839/reviews"],"review-text":["Anthony Wong plays Lok,a husband whose wife is seriously ill.Poor Lok-due to her illness he has been going without sex for a long time.That's why he is plagued by a series of sleazy nightmares featuring nurses and schoolgirls.\"Erotic Nightmare\" is a fun Cat III flick loaded with sleaze and voyeurism.There is also a bit of gore as the first part of the film shows some nasty killings committed by Wong character under the influence of the monk's mystical powers.The dream sequences are quite erotic and sleazy,so I'm not complaining.Of course those who expect gruesome Cat III horror in the tradition of \"Diary of a Serial Killer\" or \"Red to Kill\" will be disappointed,but fans of sleazy exploitation cinema should give this one a look.7 out of 10.","Excellent film featuring Anthony Wong that certainly lives up to it's title. Erotic, but increasingly violent courtesy of dreams purchased from a crazed occultist that rapidly turn into nightmares of some magnitude as the sorcerer gets inside them to manipulate poor Mr Wong. Well filmed and very fast moving this is a non stop tale of serious magic, herbal medicines, power and corruption but also makes time for some fine sex scenes and some very bloody violence. There is also just a little touch of humour now and again to catch you further off guard and the whole thing makes for a most exhilarating 90 minutes or so. Excellent performances all round.","Notorious HK CATIII actor, Anthony Wong, is for once (well...not actually once - he was a cop in the DAUGHTER OF DARKNESS films and a few others...)not a psychopathic weirdo in EROTIC NIGHTMARE. Usually recognized for his role as a complete wackadoo in such CATIII \"nasties\" like THE UNTOLD STORY and THE EBOLA SYNDROME - this time, Wong is on the receiving-end of the nastiness...Wong plays a guy who goes to a sorcerer who promises to give him really good dreams, for a price. True to his word, the dreams that Wong has involve having mad donkey sex with smokin' hot schoolgirls - but the dreams come with a price that's more than money. The sorcerer can manipulate the dreams and with the help of a sexy ghost, blackmails Wong out of his cash and business, kills his family, and eventually kills Wong himself...Wong's brother comes to town to find out what's going on, and eventually finds that his family's murder is the work of the evil sorcerer - but as it turns out - Wong's brother is a pretty dope-ass sorcerer himself, and with the help of the sorcerer's abused wife - turns the tables on the sorcerer and his schemes...EROTIC NIGHTMARE is one of the more enjoyable CATIII films I've seen in a while. Absent is the gritty and dark feel of some of the other CATIII entries like RED TO KILL, THE UNTOLD STORY or HUMAN PORK CHOP - EROTIC NIGHTMARE, though still sleazy in terms of sex and subject matter, is more \"fun\" then some of the more serious films of the genre. More comparable to ETERNAL EVIL OF ASIA - a more \"carefree\" CATIII entry that delivers plenty in terms of nudity and a good bit of gore, without being overly comedic either. Definitely worth a look, especially to the genre enthusiast. 8/10","This relatively obscure Hong Kong \"minorpiece\" is the perfect desert island movie for video age peeping toms (at least its first half is). Every set-up, every scene, every sequence is an excuse to look up a girl's skirt, stare down at her breasts, gaze at her bottom and leer at her tight crotch. What it's establishing is the lead character's perverted proclivities, of course(!)Genre stalwart Anthony Wong is a marginally perverted married man who is plagued by erotic daydreams and outrageous fantasies. All involve scantily clad, sexy Chinese ladies with nothing but sexual servitude on their minds.The plot is thickened by a homicidal subplot, voodoo doll skewering and a little rape and pillage.Some of the sex scenes are fairly hot and the gore is liberal, but the supernatural elements introduced into the second half feel half-baked and the plot developments are ludicrous.Clearly, producer of garish garbage Wong Jing was in a terrible hurry to get this into and out of theaters.The arty title sequence did not fool this jaded punter."],"review-user":["HumanoidOfFlesh","christopher-underwood","EVOL666","fertilecelluloid"],"review-date":["5 August 2006","11 January 2007","5 March 2006","30 October 2005"],"review-rating":["7","8","8","4"],"review-title":[" Sleazy and cheap thriller from Hong Kong.\n"," certainly lives up to it's title\n"," Anthony Wong As The \"Good-Guy\"??? What's The World Coming To???\n"," A desert island movie for video age Peeping Toms\n"]}