{"review-url":["http://www.imdb.com/title/tt0289438/reviews"],"review-text":["If you want to make a worthwhile slasher film, there has to be certain elements present. If any are missing then this will just be an adventure for Paul Naschy completists, which is not a bad thing.There is plenty of gore and violence after the movie gets going for a while. It is not overly gory, but enough to make it a good slasher. The gore does look realistic, which is good, as did the decapitation. There was plenty of screaming, too.The best endowed girl in the film does give us a show with her boyfriend. When the slasher puts her away for later, her stupendous breasts are covered in blood. We get to see those breasts over and over.Paul Naschy made a really good killer. He had a sinister smile and was very funny as he collected his victims.It was a very suspenseful film. I won't say scary, but very tense. It kept you captivated through the entire time. The ending is, unfortunately, unclear.","The World of Horror has lost one of its last remaining icons. I was deeply saddened to learn that Paul Naschy (born Jacinto Molina), a true deity of European Exploitation cinema and one of the last living legends of the Horror genre, died of pancreatic cancer at the age of 75 in his native Madrid last week. Maybe best known for playing the Werewolf Waldemar Daninsky in thirteen films between 1968 and 2004, Naschy was a multi-talent who scripted and directed many of the films he starred in himself, and doubtlessly the most charismatic and influential leading man in Spanish Horror cinema. Not all of the films in Naschy's career may qualify as 'good' in a traditional sense (though some, such as the near-brilliant \"El Jorobado De La Morgue\" of 1973, doubtlessly qualify as great), but they are almost entirely highly entertaining and impossible-not-to-love gems of European Horror cinema, and they all have a certain inimitable charm to them that can not be found anywhere but in a Naschy-film. The world of cult-cinema is a lot poorer for the loss of this great man, but it is oh so much richer for the wonderful films he has given us. So what would be a better way of mourning this icon than to celebrate his work by watching as many of his films as possible? I had delayed the viewing of this film several times, for the reason that I generally prefer my Horror to be old, and therefore rather watched the films Naschy did in the 70s and 80s. These preconceptions were unfounded, as one of the most wonderful films Naschy ever was in was the 2004 film \"Rojo Sangre\", which was directed by his son and which basically was a giant tribute to leading man Naschy. Carlos Gil's \"School Killer\" of 2001 is indeed not one of Naschy's best films, but it s still a highly entertaining Naschy one-man-show that none of my fellow fans of the man should miss. The main attraction of the film is, of course, Paul Naschy, who stars as the eponymous School Killer. The film starts out pretty unimaginative when a bunch of kids decide to spend the night at an abandoned old boarding school set in the middle of nowhere in the mountains. Strange and supernatural things soon begin to happen, and when it turns out that the school was the site of a massacre in 1973, things begin to get out of hand... The film begins unspectacular, and gets a little ridiculous when the first supernatural events occur. However, it really catches up in the second half, and once one has acquired a taste for the rather far-fetched premise of the film, it actually becomes really creepy. Naschy is once again awesome and wonderfully creepy in his role, which basically carries the whole film. The rest of the cast aren't memorable, and their characters are pretty forgettable; however, even though the young characters are a little annoying at times, Naschy's creepiness makes it possible to actually feel for them.Overall, \"School Killer\" is no must see, but it is a decent little film and, especially now, it is mandatory for us Naschy fans to see the master in as many of his later roles as possible. There are dozens of Naschy films to recommend over this one, such as \"El Jorobado De La Morgue\" (\"The Hunchback of the Morgue\", 1973), \"La Orgia De Los Muertos\" (The Hanging Woman, 1973), \"El Espanto Surge De La Tumba\" (\"Horror Rises from The Tomb\", 1973), \"Latidos De Panico\" (\"Panic Beats\", 1983), any of the Waldemar Daninsky films like \"La Noche De Walpurgis\" (\"The Werewolf Vs the Vampire Woman\", 1971) or, more recently, \"Rojo Sangre\" (2004). However, once one has seen many of the films Naschy has been in, this is yet another worthy addition to his oeuvre. Once again: The World of Horror has lost one of its last icons. My deep condolences go to Paul Naschy's family. Rest in peace, Hombre Lobo. You were a legend, and you always will be. And legends never die!","A group of teens decide to take their slumber party to an abandoned school where, 27 years prior, a horrible massacre took place. Unfortunately for them, the person responsible for the slaughter still lurks the halls of the derelict school and he is not happy with their presence.This film is not like most modern teen slashers we've seen. It's much darker, much more suspenseful, no wise-cracking murderer, etc., and I liked it for those reasons. From a film-making point-of-view, it's not great. The acting is below average. The writing was pretty bad and quite full of clichés, containing randomly tossed-in references to American horror films, some that didn't even make sense (like. . . \"Have you seen Scream 3?\", a girl asks. Yes, I have, and it had nothing to do with walking through the doors of an old school so it in no way relates to this film). But, hey, it's a slasher flick, those are part of the fun. Also, the underutilization of characters was heavily exhibited in this film. There were six main characters (not including The Security Guard) and, to be honest, only three or four were really used. Two characters (the token black guy and some other girl that wasn't important enough to get a label) barely spoke: Between them, I'd estimate about five or six lines total. Also, the girls (other than one) weren't formed well enough to differentiate them from one another. They could've replaced each of the girls with one another repeatedly throughout the film and I wouldn't have noticed the difference. The pacing, however, works well as the horror begins right from the start and rarely ceases. The atmosphere is utilized well and the direction reveals some truly chilling moments. . . although, the overall appearance is a bit cheap-looking due to, what I assume is, low-grade camera equipment (and operation). The ending, though I liked the idea they were going for, was fairly poorly done. It felt rushed and without explanation enough to make it effective. With the amount of time they spent running around looking for nothing, they could've spent a little bit more time on the conclusion to make sure it didn't feel like some random event thrown in for no good reason (which is a flaw many modern horror films are afflicted with). However, ignoring a few irksome issues and trying to focus on the first 98% of the film rather than the ending, this is actually a rather good modern slasher that should be checked out, especially if you're a fan of Spanish and/or atmospheric horror.Obligatory Slasher Elements:Violence/Gore: There's a good bit of blood and gore, realistically done, but not buckets. The violence is extremely well done, not to excess, but pretty brutal at points.Sex/Nudity: Little bit, and with the hottest girl in the film.Cool Killer: Well, security guards are hardly considered 'cool,' but this guy is pretty wicked. His creepy smile was chilling.Scares/Suspense: The suspense is top-notch. . . very tense, very well done. There are also some extremely creepy moments that fused jump scares and the spooky atmosphere.Mystery: None at all, really.Awkward Dance Scene: Of course: between a couple of guys and a half-unwilling female in the flashback.Classic Quote of the Film: 'One more trophy.' Final verdict: 7/10. This may be stretching it, but fans of Session 9 might want to check it out simply for the similar tone and atmosphere.-AP3-","Six teenagers go to an old remote abandoned school where 27 years ago a horrible massacre took place for a night of fun and pranks. Instead the kids run afoul of the vicious crazed security guard (excellently played with supremely creepy menace by Spanish horror icon Paul Naschy) who committed the nasty killings. Director Carlos Gil relates the intriguing story at a brisk pace and does an adept job of creating a compellingly spooky and mysterious atmosphere. The witty script by Tino Blanco and Mercedes Holgueras offers a clever and inspired blend of slasher and supernatural elements that keep the viewer guessing to the very end. The slick cinematography by Fernando Arribas makes expert use of light and shadow. David San Jose's moody score likewise does the trick. The attractive and appealing young cast all contribute lively and engaging performances, with especially praiseworthy turns by Carlos Fuentes as ringleader Ramon, Olivia Molina as the panicky Maria, Zoe Berriatua as obnoxious joker Jordi, and Carmen Morales as spunky goth chick Sandra. The murder set pieces are every bit as bloody and brutal as they ought to be. Terrific whammy of a surprise dark ending, too. A solid and satisfying shocker.","Spain has produced a number of good horror films over the last two decades, with directors such as Alejandro Amenabar, Álex de la Iglesia and Jaume Balagueró making some truly standout films. School Killer stars one of the main players of seventies/eighties Spanish horror films in the form of the great Paul Naschy; but overall I'm not surprised that this film doesn't get mentioned alongside the likes of Tesis, Rec and Day of the Beast as one of the better modern films to come out of Spain as despite some good ideas, there's far too many things wrong with it. The plot is not particularly original and focuses on the common horror film ideas of a bunch of kids getting into trouble and an old abandoned building harbouring a maniacal killer. The kids decide to go to the old school building, where one of their dads stayed twenty seven years earlier, for a party but it soon becomes apparent that there's something strange going on inside the building and they soon learn that the boy's father was the only survivor of a massacre the night that he and his friends stayed there.The best thing about this film is undoubtedly the atmosphere and director Carlos Gil succeeds in creating a truly foreboding feeling that suits the film very well and excellently compliments the plot and the building at the centre of the story. I went into this film expecting a slasher (and thus without any high hopes) but to the film's credit, it actually tries to be more than that and it could be argued that the film is more of a psychological thriller. This certainly gives the film an extra element of interest and it manages to take a mysterious plot and blend it well with the gore you'd expect from a slasher. Paul Naschy is obviously the main standout of the cast and he still has a good screen presence despite his advanced years and provides an extremely effective villain. As mentioned, the film does feature some good gore and although it doesn't feature all the way through; what we do get works well within the context. The film is rather slow to start and it doesn't really get interesting until the final third. However, despite this; the film doesn't end very well and there's too much left unexplained for this to be an effective film overall. Still, School Killer is better than a lot of modern horror films and is at least worth a look.","Why has Ramón(Carlos Fuentes)brought his five college mates to a spooky abandoned school building which used to service the black sheep children of wealth? That answer might just lie in a diary in his possession supposedly written by his dying father. What they come in contact with is in fact a relived episode involving another group of six, with five of them presumably meeting graphic fates at the hands of a sadistic security guard(Paul Naschy)which occurred 20 some odd years ago. But, as they seek out a way to escape from this place, terror awaits them as that horrifying moment in time replays as the group run for their lives, often in states of panic as the killer begins to hunt and destroy them in a various bloody ways. Will Ramón and any of his pals survive this night of horror or becomes ghosts forever repeating the very same night like those before them?Stylish Spanish slasher has that professional gloss and potent, shocking violence to match. Some witty exchanges between the characters..layered in their dialogue are pop-culture references to American horror films which might annoy some viewers. A demented Naschy is really ferocious with the kiddies as he attacks them gleefully..quite a bloodthirsty maniac who carries out his violent acts with relish. I found the loud musical cues a bit annoying and the filmmakers often use flashbacks from previous events in the film as reminders to the audience. I don't think these tricks are necessarily needed, but felt the director wished to communicate in depth with the viewer hence the use of cues and flashbacks. A minor diversion for this film's plot keeps moving and the camera follows the pace of the characters and how they react to the chaotic situation presented to them. Your enjoyment of this film may ultimately come down to your acceptance of the paranormal supernatural aspects of the plot. Moments in time relived and a killer who continues his work seemingly from the grave. The twist does seem a bit jarring and abrupt, but this might(..or might not)work considering how the story plays out regarding why Ramón's father is shown amongst those ghosts re-enacting those grisly events two decades prior. I will say that this film probably wouldn't hold up if scrutinized in detail, but as a slasher flick, it's a breath of fresh air.","I doubt that people from 3 years ago will look at this but they seemed to be having a hard time figuring out the story. In 1973 3 men and 3 women went to the school to party. Let me say I was in my 20s in 73 and we didn't have a boom box. The security guard (Naschy) kills 5 of them but the last man alive gets Naschy in the head with an ax and throws him down a well. 27 years later the son of the man who \"killed\" Naschy comes to the abandoned school with his father's diary and the ghosts of the 6 people murdered are seen by the 6 who are there now. The father is trying to tell them Naschy is alive but by the time they figure it out they are all killed and become ghosts too. Paul Naschy gives this movie both class and makes the ghost story which is somewhat old fashioned really work. A lot better than the Blair Witch or the slasher side of the film do. The only thing I didn't like was the foreign \"rock\" soundtrack. If you have to use \"rock\" do like Argento and use Iron Maiden or Motorhead. Maybe these guys are big in Spain I don't know. For great Naschy look for Frankenstein's Bloody Terror or Night of the Werewolf (The Craving) or at least Horror Rises From the Tomb.","Bit of a curate's egg, this one. I started off hating it, with it's predictable' Old Dark House' set-up, it's constant references to recent US horrors and regular trips up and down dimly lit corridors.But it does get going and has it's moments of originality.I began to wonder , once the killing started, how they were going to last out with only a cast of six but then we get flashbacks to a previous visit to the building and see a whole slew of gory killings which is pretty effective.Naschy is fine and by the end it's been an enjoyable enough movie. It just does not jump up and grab one, hard enough.","I cannot believe someone gave this movie a 1 rating!!! and it is only a 3. average... What is not to love about this film? It is original, it has lots of scare scenes that actually made me jump out of my seat, and it has some great special effects. The story is fresh, there is some nudity, and it is very campy. The killer was scary in his own demented way and the end is very unexpected. I must admit that I really love this film, one of Spain's best horror films ever. If you consider yourself a true horror fan you need to get out there and try to find this film. You will be pleasantly surprised to do so.","An annoying group of ex-students from 'Monte Alto International High School' decide to spend a night in the now abandoned institution where a 'mystery' killer called the watchman played by horror legend Paul Naschy murders them off one by one.\"School Killer\" features some references to such teen slasher staples like \"Scream\" or \"Friday the 13th\".The climatic twist ending looks like lilted from \"The Sixth Sense\".The uncertainty about whether the homicidal watchman is alive or dead provide some mild interest,but the characters are one-dimensional and the endless scenes of walking through dark school corridors really got on my nerves.The presence of charismatic Paul Naschy almost saves this clichéd slasher flick.There is also some decent gore on display including a splendidly bloody beheading.It's nice to see Manuela Velasco of \"Rec\" fame in a small role.4 out of 10.","School Killer (2001) *** 1/2 (out of 4) Extremely creepy Spanish film about six college students who go and spend the night at an abandoned school where six kids were killed 27 years earlier. This film from director Carlos Gil is without a doubt one of the best horror films I've seen in quite some time. The film had me on the edge of my seat throughout and that's saying a lot because I don't normally get creeped out by any film. Not The Texas Chainsaw Massacre or The Exorcist were able to scare me but this one here did. The film is neck deep in atmosphere and the direction is terrific throughout. The screenplay is also very good and gives us characters that we care about and know. These characters just aren't there to be slaughtered like so many American horror films. The film is smart about the genre and smart in the way it plays out. Spanish horror icon Paul Naschy plays the security guard and gives a very good performance as does the rest of the cast. The theatrical trailer makes it seem like this is an outright slasher but it's more in the ghost genre and certainly one of the best I've seen. The only negative is some heavy metal music that is played during a few scenes.","This movie is not a typical slasher. The tension is very high, and the story is appealing. The acting is below average, and there are a lot of holes in the plot. Nevertheless, it successfully kept my attention till the end. Talking about the end, while I understand that the director wants to leave us some space for imagination, but that is TOO MUCH imagination he's asking for. I thought there will be at least another 20-30 minutes to go, and the credit rolls already! We do not know who the killer was, what his father wanted to tell them, how each member died, who moved the bodies, etc. I really wish the DVD featurettes will have the director provide us with some explanation.","I'm not a Naschy fan nor a horror film fan, but I enjoyed the thrill of the film. However, the predictable setup at the beginning, the too-much-unnecessary-information slash-slash diary-reading scene and the abrupt ending made it difficult to really \"like\" it.Specially the ending, it made me mad. The \"they'll all die - guess how\" part is just lame. It's obviously in the lines of \"we didn't know what to put in the well so that everything makes sense, so we'll try to make it creepier killing them all in the remaining 3 minutes of film\". Even a \"open well - blackout\" ending would have been better (and that's lame). It could have been a \"videogame\" kind of scene where you take a risky situation to get to the true ending or you chicken out and get a bad - game over ending, but not even that.However, the killer sure was creepy (for no interesting reason whatsoever... who cares, though), it just lacked a bit of development, but it's thrilling anyway."],"review-user":["lastliberal","Witchfinder-General-666","Shattered_Wake","Woodyanders","The_Void","Scarecrow-88","joeshoe89","christopher-underwood","tony_ramos5","HumanoidOfFlesh","Michael_Elliott","raymondshih","kebukai"],"review-date":["25 February 2010","7 December 2009","19 August 2008","19 October 2007","10 May 2008","17 November 2007","15 May 2007","12 January 2007","7 October 2004","13 March 2009","29 February 2008","7 July 2006","8 July 2010"],"review-rating":["6","6","7","8","6","7","6","7","10","4","6","6"],"review-title":[" No one studies here. It's my school.\n"," R.I.P. Paul Naschy - Legends Never Die!\n"," A creepy, atmospheric slasher (See This Slasher #3)\n"," An immensely enjoyable and effective Spanish horror winner\n"," Does more than the usual slasher fare\n"," School Killer\n"," Interesting Ghost Story\n"," has it's moments of originality\n"," Great film\n"," Weak Spanish teen slasher with some ghostly elements.\n"," Underrated\n"," What? It's over already?\n"," Creepy, bit gory... just that\n"]}