{"review-url":["http://www.imdb.com/title/tt0388318/reviews"],"review-text":["I was very lucky to see this film as part of the Melbourne International Film Festival 2005 only a few days ago. I must admit that I am very partial to movies that focus on human relations and especially the ones which concentrate on the tragic side of life. I also love the majority of Scandinavian cinematic offerings, there is often a particular deep quality in the way the story unfolds and the characters are drawn. Character building in this film is extraordinary in its details and its depth. This is despite the fact that we do encounter quite a number of characters all with very particular personal situations and locations within their community. The audience at the end of the screening was very silent and pensive. I am still playing some of those scenes in my mind and I am still amazed at their power and meaningfulness.","This film came as a gift - a late-night offering out of the blue - so unlike other reviewers I had no preconceptions whatsoever. I found myself glued to my seat as the film slowly dictated its own rhythm, its own unfolding. I was drawn to acknowledge my own deep love and humanity as I willed for \"good\" to prevail - but also forced to wryly acknowledge that sometimes I was on the side of the \"bad\" guys. The film is quite quite beautiful - the word \"elegiac\" comes to mind, and this more than because the film begins and ends in an elegy. Far from being depressing or confronting, to me, the film acknowledges deep suffering - and then, by its cyclic nature - with the births and re-births as well as the deaths - the film celebrates the fact that to quote an Aussie poet, there is \"sometimes gladness.\" Oh gods, I feel as tho I've just written a love letter to this film - but there it is. Hola!","For Estoninans Finland sometimes seems like a land of dreams. A land where many of us want to go and work there or start a business. Find love, start a new life etc. But... Aku Louhimies has made this brilliant piece which shows that everything is not so good in Finland as well. That Finland can be just as Paha maa (The Bad Land) than any other country. It shows that people there can be just as miserable in their lives than we in everywhere else. That sometimes there's nothing good. This movie nicely shows why Finland is one of the top suicidal countries. It's not easy to live in North. Cold climate changes us. I've become more and more attracted to Finnish movies and this one is very good. The acting is great as well. Jasper Pääkkönnen has become one of the top Finnish stars. Beware of the sex scene (if you have little children) and a little depression that might come afterwards the movie! 8/10","This is another of those rare movies one feels grateful to be introduced to instead of the usual Hollywood tripe. It really is a roller coaster ride, as we follow the effects of a a forged 500 Euro note on a multitude of people. One asks 'what if' all the time but it certainly is a butterfly effect captured on film. It'll have you laughing, crying and biting your lip. I loved every minute of it! And thank you SBS Australia for showing films that are truly entertaining, even worth the effort to read the subtitles. The only downside to my mind is that I wont be booking a holiday to the Frozen Land - they all seem to be far too depressed - must be all that cold weather. Either way, watch it - it's worth every second.","Before I'd seen this movie I've heard a lot of praise about it and quite many exclamations about how \"horrific\" it was. Not to take any credit away from this movie, I think it wasn't all that horrible or even shocking. It's just a movie about people living in the darker side of the town. And a good one at portraying the point.There's some great acting here and a well-thought of manuscript. Paavo Westerberg is a renowned writer in the Finnish movie scene and he's the best in what comes to describing the contemporary Finnish culture (albeit he's not the only one writer for this movie, but I dare say he's the main-writer anyway. Correct me if I'm wrong).The casting is excellent, except for Jasper Pääkkönen (the pseudo-main character, who in my opinion should have stayed in the soap opera scene), and the sets, the cuts and sounds are very well done as well and give great atmosphere to this movie.This movie is a story about loosely interconnected sad destinies that according to a famous Finnish band's very well known song (Eppu Normaali's \"Tuhansien Murheellisten Laulujen Maa\", which VERY roughly translated to \"Paha Maa\") throughout the whole Finnish society lead to a sad, dark end accompanied with booze, lonesomeness and the bad choices. And it's the side of everyday Finnish life about 80% of the population have no awareness of, unless movies like this are made.","I saw this film at the 2006 Palm Springs International Film Festival and Director Aku Louhimies introduced his film and was on hand for Q&A after. For some reason this movie is titled Frozen Land in English so I don't know how the distributors got frozen out of Paha. This is a very good film. It doesn't for me have enough that I would knock it up a notch to the excellent category but I did talk to some viewers who felt that it was an excellent film. Louhimies said that back in Finland people either loved this movie or hated it and said a lot of people in theaters walked out on it. I'm sure some objected to some of the violence, swearing, drug and alcohol abuse and sexual explicate scenes. It's a very clever story of how these different lives are woven together because of a trickle down effect. This film has very interesting and strong characters. I would rate it a 7.0 out of a possible 10 and would see it again and recommend it with caution.","This was a movie of which I kept on reading the reviews again and again; and despite it being played at Film Museum and not at Pathe theatres  I decided to give this movie a try. The reasons were many  in the reviews it was compared with Pulp Fiction, it had several parallel stories running in the movie and lastly it had already won 17 awards internationally in various categories. I was eager to see this movie and due to my off day at Greenpeace I decided to make myself happy by going and seeing this movie.It is a story based in Finland. I think it reflected the current life of people in general  drugs, crime, sex, anger, anguish, fear and guilt. Every emotion was captured brilliantly in the movie. There are several characters and stories interwoven but a few characters come back in the latter half  making a link with the beginning sequences and that takes the story forward.The story is about two friends  one of whom is computer geek and the other is a drug addict  son of an abusive father. The drug addict boy trades a Euro 500 note  printed by his friend  to buy back his music system, and in returns gets huge change of cash back to buy more drugs. The trading of Euro 500 note continues to bizarre events  from the shop trader to an auto mechanic cum robber  to a car dealer  to a vacuum cleaner salesman  to a prostitute  to a police officer  then to her family and children. How the beginning of a small thing  creates a chain reaction that lead even after 5 years of that first incident to a depressing last note  which I won't reveal here.The direction is excellent. The character development in the movie is first rate. The character that sticks on your mind even after you come out of the movie is of the vacuum cleaner sales person. All the departments of the movie are handled nicely. Here I would like to make a couple of critical comments. First, during the sequence of one event leading to another I felt that the coincidences were too rapid and forced. But this screenplay writing error is pardon when one sees the whole canvas. Second, the trail of one character leading to another somehow leads back to the first two characters and that again I found to be a forced decision by the screen play writer. There was no need to have the same characters showing up again when there are different causes leading to different effects in such a big city.But after saying that  it is an excellent movie! It is a dark movie with quite a few sex scenes. The characters are having the black, white and gray shades and emotions that change from facing different situation which is brilliantly captured by the director.A top rate movie! It has all the ingredients of becoming a cult movie. I hope that only such movies should not become and achieve the status of cult movies and win lots of awards, because without crime, sex, violence, drugs etc. too one can make fantastic movies  Bicycle Thieves and Pather Panchali are its prime examples  only thing is that they were a long time back and times are changing and I think movies are reflecting the current times.","Frozen land, frozen feelings. Desires, suffering, grief, depression.And all of this in little over two hours. Our daily routines and quirks, our pains and grievances, our passion and tragedies never stay our own. They spill, expand and enter other lives , the ones we touch upon on the streets. Strange movie , contained and violent in the same time. Full of mixed messages, and overflowing with heartaches. The school teacher gets fired, and the whole world runs amok. The characters in this movie are like the puppets in some macabre puppet theater. Someone is pulling the strings, but who is it, that is the question.As time time goes by, some recover and some just vanish into oblivion. The world is coming to an end, as one character repeated few times. And it surely seems it is...","The problem I have as a Finn is that most of the actors in this movie are in every Finnish movie. I have a feeling that Finland has only like five actors. I think that if you're not from Finland you really like this movie as a refreshing novelty.This movie is about a dreadful chain of events that affects a few people quite harshly. Alcoholism, cold climate and darkness may all be clichés but they're still very real in todays Finnish society. A lot of people in Finland have depression, especially during winter.The tone of the movie is very melancholic. I enjoyed it and Louhimes' directing was again very solid. I liked this movie a lot, only negative thing is that you see the same faces that you've seen over and over again.","I saw this on DVD with subtitles, which made it a little frustrating to get through, because of the film's length. But I was riveted throughout all of it. That I was fascinated by the characters and always engrossed in the story, despite the subtitles, is a testament to the film's power. It's an amazing piece of work. I have it on my list of ten favorite films of all time. It's easily the best foreign film I've seen in the last twenty years or so. I would like to know the full story behind the making of this film. It must have taken a very long time and required the use of hundreds of locations. Its use of some hardcore scenes (on the TV in the motel room) may unfortunately make some people choose not to see it, but if you don't mind those, you'll be deeply moved by all the stories in this one!","This is based on a Tolstoi story about agony being passed from one person to another. Here it's symbolized by a false 500 euro note. There is catastrophe in one way or another for everyone who touches it.This is well acted and you fell for the persons involved. But you never get surprised. In some ways the script is just like another one emerging from the film schools. Talented but not brilliant. You might ask why the people are doing what they're doing but you don't ask yourself about morality in a bigger meaning.Rather entertaining, but you really could ask for more. This is far from Tolstoi.","Paha maa is different Finnish film. But the things which makes it different are copied abroad. Some techniques of narration are from Amores Perros, Jackie Brown and Elephant. Scenes are shot from different angles again. Paha maa is a good movie, but it isn't so good that the hype tolds: \"Realistic movie, no happy end, and no commercial admissions.\" Some actors did great job. Sulevi Peltola was so good as a vacuum cleaner peddler. Also Jasper Pääkkönen shows his skills. But Mikko Leppilampi was so lame. He is so overrated actor, he's handsome and a nice guy, but not the best actor of Finland. But if you like Finnish movies, Paha maa is worth to see.","Let's see. This movie is many things to different people. To Finns, as shown by the comments, it can be OK or dreadful or boring. To other folks, it can be something different. First off: if you do not speak Finnish (I do), you will understand half of what is going on, as subtitles are dreadful and even the title is translated incorrectly (\"Paha maa\" would probably be idiomatically translated as Badlands in UK English).Why did I not like it? Because it is a Tarantino-style movie: it simply takes a very harsh reality and throws it back at you, as brutally as possible. I, however, am not American, and thus I am not particularly fond of this proceeding, because all it does is show that the director has really nothing new to say. Technical prowess (camera work is brilliant), script (not that unoriginal) do not rescue this movie from the bottom where it belongs. Should you wish to see a Finnish movie, then go for any of the Kaurismäki brothers' movie, who match talent and directorial skill, with very good actresses and actors. This director ought to review his intention and priorities: none was intelligible, and thus this film failed. By not watching it you won't miss much.","I recently waisted 8  by going and see this movie in the cinema. It was a waste of time and the only feeling you get going out of the theater is a slightly nauseous of all the disgusting social pornography. It could have been interesting if it had a quite absurd twist but it hadn't so it was just plain awful with maybe one or two scenes which could have been taken out and made to very nice short movies.Another thing I thought about is the way the director uses all the Finish stereotypes as characters. It is quite extraordinary how you as a Finish director can make a movie with the worst stereotypes of your own nationality. It was sad to sit and and hear the audience sitting and laughing at things that they thought was typical Finish but in general just is making fun of people.","If this is what's best in the Finnish cinema at the moment, I'd say those big tax euros spent at supporting \"culture\" have gone to waste here in a horrible way. Paha maa is the worst kind of example of trying to make a Finnish \"European film\" for big audiences. I'm sure they wanted it to be all state-of-the-art, smart and touching at the same time. The result is crap.To make it short: - The story is pretentious, naïve and not credible. The same goes for the characters. I can imagine them brainstorming about making a film where \"everything would, like, turn to ***t and people would be hurt and feel, you know, really bad inside, because Finnish people are so notoriously depressed, too, and their self-esteem is so bad\", which brings us to the fact that...The film is loaded with clichés, mostly about \"the Finnish mentality\". The way the it deals with people's problems and their causes could be straight out of a regular women's magazine or a cheap bull-psychology-self-help book. (\"We feel so bad inside!\") I'm sure they watched some Kaurismäki, too, to find out what it is about his films that people like, misunderstood him completely, and came up with a boring, depressing story about people going through all kinds of s**t for no other artistic purpose than perhaps social pornography. It's a crying shame they threw in Tolstoy here. It's just a sign of trying to be smart. And of not being.I think the worst fault, however, is the complete lack of vision and depth. The film is highly unoriginal. It is also frustrating to watch endless sulking and suffering without any real revelation brought to it. I can go through this kind of mind**ck if the film is funny or ends up being an elaborate joke, or better yet, something sublime like in e.g. von Trier's Breaking the Waves. There was none these in Paha maa. Actually though, I did start laughing at some point because the turn of events was again just too predictable, over-the-top and incredible.Who does this crap? And who likes it? I hope they're pretending.","Imagine the most depressing winter you will never experience: grey instead of white, no snow fights and certainly no wonderlands. This is the Finland as portrayed by 'Frozen Land'. This film follows a bunch of people whose lives are oddly linked to each others' with results beyond anyone's nightmares. Yes, most characters are flawed in the way that only celluloid characters can - completely annoying and frustrating to watch, yet for some reason you wish for their luck to turn. With some randomly placed humour and a cast that groups together Finland's somewhat mainstream faces, Frozen Land offers a glimpse of the Finnish mentality that despite its depressing downward spirals manages to restore some faith in humanity. More so than Kaurismäki, to say the least.","An absolutely amazing film. Beautiful deep storytelling with some heartbreaking performances. All performances all the way round were just amazing.A nice sober way of presenting the narrative, with lot's of style but never distracting. Everything centered on these beautifully written characters and their mainly painful situations. And painful it gets. Films like this are rare. \"Crash\" comes to mind and especially \"Short Cuts\" and maybe \"Magnolia\", but the heartache felt here and the wonderful complexity I have only before seen in one other movie. and that was \"Amores Perros\", which is my favorite film of all time.It's a hard watch and it's draining and I probably won't see it again for a couple of years, but it is absolutely essential viewing that I can't recommend highly enough 10/10","Although the acting was excellent, I spent the whole movie waiting for the nasty boy who caused so much grief to so many of the characters, get his final nemesis, and instead everyone else suffered except him and he gets the job of the husband whose wife's death he causes by running away from his friends, wins the girl he gave an overdose to and tried to rape. Even his friend gives money to his father, but the butterfly effect completely fails to return to its cause.This is a very dark film as each character that gets affected, suffers never ending depression. None of the normal avenues for relief seem to be effective and the only thing the authorities seem to do is give out quantities of stress pills.If this is normal behaviour in Finland now, I'm never going to go back just in case I am affected by such an amoral butterfly and end up as destroyed as the characters in this film were.","i just wanted to say i liked this movie a lot, but i also want to ask about something..does anyone know the artist/song name of the song that the young boy (cant remember his name now) plays on his cd-player when his dad and 2 men comes and takes the TV and the cd-player ??? that song is so freaking cool even though i cant understand a word what they're saying...feel free to mail me the artist/song name at hpn_x@hotmail.com thanks a lot in advance!! =) ---------------------repeating----------------------------- i just wanted to say i liked this movie a lot, but i also want to ask about something..does anyone know the artist/song name of the song that the young boy (cant remember his name now) plays on his cd-player when his dad and 2 men comes and takes the TV and the cd-player ??? that song is so freaking cool even though i cant understand a word what they're saying...feel free to mail me the artist/song name at hpn_x@hotmail.com thanks a lot in advance!! =)"],"review-user":["carlo61","colettet","synkronized-1","jjj-114","bluefrog10","johno-21","rajdoctor","sergepesic","ville_koistinen","holbrookp","stensson","takalevy","muaddib-20","rubing-1","Svenri","Tiina_Heinonen","movies-by-db","stomfi","hpn_x"],"review-date":["27 July 2005","8 August 2006","11 June 2006","9 August 2006","11 February 2005","6 February 2006","7 January 2007","16 October 2011","13 March 2005","8 October 2009","4 March 2006","31 January 2005","29 December 2007","28 April 2006","14 July 2007","28 June 2009","3 October 2015","8 November 2008","26 September 2006"],"review-rating":["9","9","8","9","9","7","7","8","7","10","6","7","3","1","1","8","10","1","7"],"review-title":[" This is a gem\n"," Deeply moving and a testament to the love (and hate) in all of us\n"," Land of dreams turns into Paha Maa\n"," Gripping\n"," A somewhat sad movie about common destinies - in the Finnish scale.\n"," Good story, good movie\n"," Frozen Land\n"," Frozen feelings\n"," This could've been better.\n"," One of the best I have ever seen!\n"," Another short cuts\n"," Different Finnish film\n"," Not particularly brilliant\n"," Two and a half hours of social pornography\n"," Horrible, mind-numbing crap-load of clichés\n"," Santa most certainly doesn't exist\n"," Profound and harrowing storytelling\n"," Unsatisfactory Ending\n"," nice movie! kept me in the stressless\n"]}