{"review-url":["http://www.imdb.com/title/tt0365763/reviews"],"review-text":["Skenbart takes place in the 1940s, right after the second world war. Main character Gunnar (Gustav Hammarsten) quits his job to get a chance to \"make a difference\" in the bombed-out postwar Europe. He packs a book by his favourite philisopher, Ludwig Witgenstein, and embarks on a trip which will eventually prove Witgenstein's famous statement true: Nothing is what it seems.There are two main plots, and several subplots, to this film, which takes place on a train bound for Berlin. Writer/Director Peter Dalle (also playing the role as the conductor of the train) has assembled an impressive cast including swedish legends Lena Nyman, Gösta Ekman and Robert Gustafsson. Overall, the acting is excellent.Skenbart offers some rather twisted slapstick comedy combined with more subtle black humor (like the nun who loses her faith and starts cursing violently). It's like Killinggänget meets Peter Jackson (Braindead, Bad Taste) in Schindler's List. I laughed during most of the film, and when i woke up the next morning i laughed even more. An intelligent film for fans of Swedish comedy.","`Skenbart' is one of the funniest movies to not only to come from Peter Dalle but from the  Swedish cinema industry itself. It is a movie made in black and white to get something of the atmosphere from the days before Christmas in December 1945, which it does very well. Almost the whole plot takes place on a train, non-stop to Berlin. On the train is a mix of homosexuals, nuns, deported refugees, murderers, alcoholics and the failure literature critic 'Gunnar'  played by the, in Sweden, famous actor Gustav Hammarsten. The leading role 'Gunnar' is the type of person that, although his intentions are for the best, seems to drag everyone near him, in a extremely funny way, into disaster and to a living hell, especially for a from the Finnish war, homecoming, wounded soldier played by the extremely funny comedian Robert Gustafsson. On the train is also a doctor, who cheats on his wife, with his mistress. They have together planned to murder the doctors wife that is also travelling with the same train without any knowledge about her husbands intentions. Will the wife of the doctor elude the plans to murder her and will everyone else survive the unlucky fellow 'Gunnar'?","In December 1945 a train leaves the central station of Stockholm for Berlin. There aren't much left when it arrives. Not of the train and not of some passengers.This is a black comedy directed by Peter Dalle and acted like they used to act in the 40s and also photographed (in b/w) like they used to  during that period. The actors must have had lots of fun making it. They aren't much of characters, like they weren't in the 40s, but the story is well narrated and everybody has timing.A deadly black and deadly funny film. See it, if you didn't think the Swedes were capable of humour.","Very funny film with some of the best swedish actors. It's all filmed in black and white with the true 40-ish feeling. Most of the film you are aboard a train headed for Berlin in 1945 among a mixture of characters from refugees to 2 gay guys and 2 nuns. I truly recommend this film if you like to laugh.","This thing works on all levels -- it's intense as a thriller, full of Lars von Trier homages, but also very much its own film -- and it does have a message: happiness comes from within, best personified in the wounded soldier who practically (and, believe it or not, humorously) disintegrates limb by limb throughout the film, all the while apologizing to others for imposing on them. You laugh at him, but you envy him as well. The central character is a well-meaning but clumsy writer who spends the whole film trying to help those he befriends on a train from Stockholm to Berlin just after World War II. He ties the parallel stories together, and really screws people up in the process. To say things go wrong is an understatement -- and structurally, the characters are all in perfect opposition to each other. It's like every one of them has an opposite -- just so tight, like watching anti-matter collide. You will not believe the sick stuff you end up laughing at. To say more would qualify as a spoiler -- all I can say is it is a shame this film has not been released in the US, not even on DVD. Some moron probably told them Americans wouldn't get it -- which is crap, because we not only \"get\" but produce things like South Park... If this film gets marketed in the US, it should be sold as a mainstream black comedy, because that's what it is. Over-the-top, sick and twisted, but fuuuuunnnnnyyyyy!","First of all - I hardly ever watch Swedish movies, and this is actually the second time in my life I watch a Swedish movie on cinema! Therefor, I believe it's one of the best Swedish movies ever! The combination of thrill and humour is OUTSTANDING, and sometimes you don't even know if you should be terrified or just laugh! The plot is about this man, a writer who wants to go to Germany after World War II and help the Germans to start over. On the way to Germany, he is trying to help his friends on the train, which is however a bad idea. What a clumsy jerk! And poor Robert Gustafsson - the wounded soldier - always get in the way ... OUCH!!! But he still got his great mood. A positive guy. Robert Gustafsson have done some less great movies the last years or so, and this is really a relief. He is great in this movie. After all - this is one of the best Swedish movies ever, and Peter Dalle has made an excellent job! Congratulations!","SPOILER WARNING. (Though not too much. Just enough!) This is an absolutely fantastic film that takes place on a train going from Stockholm to Berlin in Christmas time in the year 1945. It's a very unusual film, it's actually a THRILLER COMEDY! And the mix works very well. The film is hilarious and immensely entertaining! It stars some of Sweden's most amazing actors. Lena Nyman's playing an old lady with some dark secrets and Marie Göranzon plays the nun that can't stop swearing (!) after she gives up on her beliefs after a lot of hardships on the train journey. There is also a cheating couple trying to poison the man's wife that's also on the train. Gustaf Hammarsten (who is now known for playing Sasha Baron Cohen's assistant in the film \"Brüno\") plays the humble man who is trying to get to Berlin to \"do some good\" but can't seem to get in anything but trouble. Legendary actor Gösta Ekman does an absolutely amazing performance as an older gay man that caters to his lover who is totally unappreciative. This lover is gay just because he hates women! Here is a great clip, with English subtitles: http://www.youtube.com/watch?v=gLc85TLhSl4 . And not to mention Robert Gustafsson who is incredibly funny in as an injured man that gets in more and more accidents and is soon all covered in bandages but doesn't seem to mind his injuries at all... lol...The film is written and directed by Peter Dalle, another famous Swedish actor, and after making this film I consider him to be a genius! I also love the extra material on the DVD where he explains some of his choices behind the film, it's really a masterpiece! A must watch! And the Swedish DVD edition has English subtitles so anyone can understand.","Audiences should be used by now to Peter Dalles special brand of film-making. One could easily say that he is a man with a rather cruel view of humanity, and this also shows. His sense of humor is not for the weak-hearted and dark as coal. This however is both more accessible and more elaborate than his previous works.Gunnar is a literary critic who wants to change his life. This is just after World War 2 and Gunnar decides to go to Germany where there is work rebuilding the country. He wants to make a difference. He gets on the train to Berlin along with a gallery of other personalities. Some of which have more sinister motives...Seldom have i seen a noir murder story mixed with slapstick-comedy. And i guess this is not for everyone, but in my opinion it works pretty well. Mostly due to solid acting from most of the cast. The murder story is quite interesting, but would perhaps have a had hard time standing by itself. But with the small side-tracks and the humor added the movie moves along quite nicely. Also i have to say that this is one of the nicest-looking Swedish movies i've seen. The technical quality is excellent in Swedish terms.So, no movie is perfect. What is lacking? Well some of the actors, especially Anna Björk and Kristina Törnqvist in the two largest female parts, are quite wooden and unnatural. They could just as well be reading their lines from a piece of paper. Also the slapstick has a rather brutal touch to it sometimes that becomes almost too much. But of course this is a matter of taste and humor.All in all i felt this was a well-made and enjoyable movie from director Peter Dalle. I rate it 6/10 and recommend it.","...and this movie easily exceeded my expectations. The fact that it is written and directed by Peter Dalle led me to believe it was in style with other films I'm used to (and bored with) seeing him in. Anyway, I grudgingly went along to see this flick and that I'm glad for. This stuff has humour and depth. 9 out of 10. See it!","This solid black and white slapstick comedy with a dark (but hopelessly contrived) plot is a true crowd pleaser that will have you howling with laughter (as well as rolling your eyes with disbelief).It's the old psychopath on a train story but that is of no big importance as the thriller portion of the film almost seems to be merely a counterweight to the antics of the great comedian Robert Gustafsson. His hapless, nearly incurably optimistic soldier invokes both compassion and schadenfreude in a fashion that almost rivals Chevy Chase.The thing about the film that appealed to me the most, however, is that wedged between the improbable and the hilarious are the accurately portrayed everyday joys and nuisances of train travel. They add a most welcome sense of realism and recognition.This thriller comedy has admittedly borrowed most of its \"suspense\" from Hitchcock and should, in my opinion, only be watched for its comedy value (which is high indeed). Besides Gustafsson, Lars Amble's solid performance as a delightfully cynical misogynist is worth the price of admission alone.Heartily recommend.","An interesting comedy, taking place on a train from Stockholm to Berlin, December 1945. One can't help to feel sorry for the poor writer/critic who quits his job and jumps on the train to Berlin. His ambition is to make a difference, and to participate in building the new unified Europe after the war has ended.I like the black and white format of the movie, as well as the closed scenery of a train in motion.Robert Gustafsson makes a classic \"Gustafsson-role\" in this movie. If you're a fan of him, this movie is for you!The philosopher Wittgenstein, through his saying \"One can never assume that anything is what it seems to be\", is referenced several times in the movie.","This picture begins with a group of Swedish characters embarking on a train journey to Berlin. We are soon introduced to the dark humour that is a main feature of the film, and then the simple plot is introduced, two lovers intending to murder the man's wife. Shades of Double Indemnity in that it's to be done on a train. A writer and critic who is also travelling, has encounters with his fellow passengers, especially a wounded soldier, whose injuries he gradually adds to in a series of accidental and increasingly bizarre mishaps. The other characters range from the fairly normal to the frankly weird, from the train conductor to the male couple and the two nuns, but the writer who blunders his way through the film causing mayhem is the central figure, and his encounters with the soldier will amuse or not depending on your taste in comedy and how seriously you take life.The murder plot is woven into the comedy nicely and the murderous couple become increasingly desperate as their plans seem to be failing. The B and W photography is crisp and as the train moves on the plot moves on with it at a nice pace. The postscript is quite clever too.Monsieur Hulot meets Hitchcock?","Outside Sweden you are not expected have seen this movie. Happy you. The cast includes several actors that are important part of modern the Swedish movie history. And still.. Seems like Peter Dalle only had a an idea lasting for about 20 minutes. Robert Gustafson is totally misused in this movie, trying to copy a younger Gösta Ekman. Ekman, by the way, is the only actor fulfilling the expectations. Credit that can be given is for the photo, splendid idea using black and white. Music is OK.But over-all it's a waste of god actors and the time of the audience.","Set in 1945, Skenbart follows a failed Swedish book editor who decides to take a non-stop train to Berlin. Unfortunately for everyone around him, he's a walking disaster, causing mayhem everywhere he goes. The train also holds a man and his mistress scheming to murder the man's wife (who's also on the train), a soldier on his way home, two gay elderly gentlemen, an angry train conductor, two nuns, a bunch of refugees, and even more people.Meant as a mix of noir-ish thriller (which it does quite well - at least to begin with), and comedy, the film fails with both. It doesn't sit right as the film changes tone with every new scene. And as the train races towards its final destination, the film turns more and more bizarre, ending on a truly surreal note.The good bits are wasted in a myriad of pointless plots and characters. Skenbart is packed with famous Swedish actors, no matter how small the part is. It feels like the filmmakers rang everyone they've ever worked with and offered them a part in the film. Too bad that the performances are just as bad as the script (act your lines - don't read them!).The comedy is more or less slapstick, with the same jokes repeated over and over. The pace is incredibly slow at times (quite often, actually) with on scene in particular dragging on for about ten minutes for no good reason. The screenwriter also seems to think that swearing is a good way to replace decent dialogue. The film looks great though, in moody B&W, but it's wasted on such inept film-making in every other department. [1/10]","Don't see this movie! It's... repulsive! The start is indeed very good, but in the middle everything falls and I really regret spending 80 crowns (about 11 dollars) on the ticket! Peter Dalle should consider this as his last chance to gain peoples interest. AWFUL picture! The only bright spot is the splendid work of Robert Gustavsson, Lena Nyman and Gösta Ekman.Hope you take my advise... The picture is rubbish.","If I could give this movie a negative rating I would. The humor is the cruelest I have ever seen in a film. Horrible things happen to good people and people who have already suffered horribly through no fault of their own. There are 2 plots, neither of which supports half of a film. Where is the \"depth\" others see in this movie? That no good deed goes unpunished? That only the heartless can succeed? The film does start well and the black and white is very moody and well done. The acting is very good and convincing witch makes the cruel humor even more horrifying. If you think that the 3 Stooges are too nice to each other, if watching the beheading of a kidnap victim with a Bowie knife is a real thigh slapper, if you thought \"Schindler's List\" was hilarious, then this movie is for you."],"review-user":["fabianl","fotobosse","stensson","timmytimboy","SWZwick","Motorskallen","anna_8146","Antagonisten","zaarqon","swedeolicious","sm4suc","tynesider","swedhawk","Jexxon","supercoool89","pentacon"],"review-date":["17 January 2004","8 January 2004","11 February 2004","11 January 2004","2 December 2005","12 January 2004","12 January 2011","15 February 2005","14 January 2004","7 January 2004","4 January 2004","7 November 2008","23 January 2006","3 February 2005","3 January 2004","13 February 2006"],"review-rating":["8","9","8","8","10","10","10","6","8","7","7","5","3","1","1","1"],"review-title":[" Excellent slapstick comedy in black and white.\n"," Extremely funny Swedish movie.\n"," Unbelieveable. A talented Swedish comedy\n"," A comedy in black and white where things aren't what you think\n"," One of the funniest movies I have seen in decades!\n"," Great swedish movie - a movie about trains!\n"," The best Swedish film I've ever seen\n"," Recommended\n"," Nothing is what you expect it to be...\n"," Almost there\n"," Fun comedy in black and white, with Robert Gustafsson at his best!\n"," Don't take this train without first checking the passenger list!\n"," Congratulations to all non-Swedes\n"," Derailed\n"," Disgusting!\n"," If you thought \"Schindler's List\" was hilarious\n"]}