{"review-url":["http://www.imdb.com/title/tt0321961/reviews"],"review-text":["Odd but wonderfully original movie. Genuinely frightening, creepy and ridiculous in equal measures. The setting of a high rise red brick apartment is a perfect backdrop for the haunting action. The thought of a secret sealed room in a place like this is good enough but when the lead naive couple start cleaning up the old bed they find in this room the scene is set for some classic chills. The cast is fantastic. Tanya Dempsey really gets to chew some scenery after being undervalued in other Full Moon films. Joe Estevez proves why brother Martin Sheen is so much bigger in Hollywood - his rolling eyes during the making the bed scene are really hilarious. Charles Band co-produced with Stuart Gordon and this really is an exceptional Full Moon/Darkwave release. Danny Draven also directed Hell Asylum with Dempsey.","It's one of the best movies that I have seen this year ! I don't agree with the person who said it's boring. Of course some people may find this movie not frightening at all, but personally I spent a very good moment. This movie alterns very well sex scenes with frightening scenes. There is also a nice touch of humor. For example when the wife tells her husband that in her childhood she was abused by her father, and then her husband says \"how can someone abuse someone like you\", and then he attempts to attach her on the bed for sexual games :D Very funny ! I recommend this movie to everyone, and by the way, sorry for my poor English (I'm from France).","What we have here is an original twist on the classic \"haunted item\" story. Tanya Dempsey and Brave Matthews are a young couple who move to an old apartment in Hollywood. Soon, they'll discover (although we the audience knew it since the first scene) that there is an old 30s bed where a horrible murder happened. Strange things will occur as they start using the bed.I found the idea of a haunted bed very original, even when this kind of story have been told since the beginning of civilization. The story was well developed and the effect the bed has over the couple was very interesting. Nightmares, hallucinations and poltergeists disturb the mind of Tanya Dempsey's character and she gives a very good performance. She will have a bright future if she keeps up the good work.Sadly, the rest of the cast is not that convincing. Joe Estevez makes an appearance as the owner of the building but his performance is forgettable. Brave Matthews just was not up to the role. Dempsey owns the screen and carries the film even with its problems. She makes the film enjoyable although she can't save it completely.The film gets boring at times, mostly due to the poor development of characters although that makes it clear that the writer intended the bed to be the main character.It's very good to note that there are no over-the-top effects or gore and that the scares are very subtle, something very different from typical Full Moon B-movies.Something bad about the film were the flashback sequences, which were poorly done. The problem here is that the DV camera shooting is very bad for the B&W shots, in contrast to the rest of the movie, where the lighting works in awesome ways, the flashbacks are noticeable for its poor lighting. I think that it is a major, but understandable. flaw.The cast & crew of this film have a bright future to come, even though this film may not be the Classic horror that Stuart Gordon (who produced it) usually creates, it is a promise of the talent that we'll see in the future.Very Good 6/10","This film is what I like to call `The soft-porn ghost story' I will tell you why...*Spoilers*At the start of the film we find Karen an artist (Tanya Dempsey) and Jerry a photographer (Brave Matthews) They are a recently married couple wanted to move into this big LA loft, that over looks the Hollywood sign. Wait i'm getting ahead of myself sorry. The film really starts in black and white. An old bed sit's with this scary pig faced guy chocking a women who looks like Catherine Zeta-Jones in `Chicago\" Anyways lets get back to now. The two lovebirds get the loft from a guy who looks just like Martin Sheen, and this all leads up to them finding the same bed old pig guy was on in the 20's.The bed makes them do some crazy things. It turns are poor lead into a whore! But really I have to say, I liked the big orgasims, and hard gasping that the very cute Karen and her stud hubby Jerry did while being under the beds control. I myself had a similar trouble with a bed, but it just made my heart beat faster (Long story)Okay, so every chance they get there's more sex. One funny part is during the 3rd love scene; Jerry is holding Karen's breasts (while being chocked by her) so you couldn't see her nipples. That's what I like, you don't have to show much of anything for the two to be sexy, and that's a hard task. So very good you two!Jerry later on has a dream with the same Chicago gal that has been in Karen's dreams too. This gal goes out and seduces him, and there's another sex scene. This time Chicago gal takes off her top! Hey I thought this was a good old family ghost movie? Why doesn't Jerry hold her nipples to block them from the camera? Anyways lets more on you pervert's. The movie ends on a sad note. Cutie Jerry is possessed by pig face, and ties to kill his wife. But she doesn't go down without a fight.with a hammer! She grab's a hammer, and in the funniest part of the film, wack's Jerry/Pig Face with it. But no not once, but over and over so that his skull sinks into a pool of blood, and guts. And when it comes on contact with his skull the sound effect is like she's hitting a 200-pound metal weight. And watch to see how she swings it, classic!Now it may sound as if I didn't like this movie, but I did. The main leads are sexy, and keep you into the story. It was their first movie, but I hope to see more of them in the future. The film plot is very oringal(ha ha) and it is filmed okay.","I saw this movie previewed before something else I rented a while back...and it looked decent.  I've seen some good stuff from Full Moon video, and thought it was worth a shot...  Unfortunately, this was not good stuff.The story is about a possessed bed.  A couple moves into a new apartment, discovers the bed, and odd things start happening.  Odd things like the woman discovers kinky sex.  And the man discovers kinky sex.  And the woman draws pictures of kinky sex.  And the man photographs kinky sex.  And they both start having dreams about dead people having kinky sex.  You'd think a movie with so much kinky sex would be good, right?Well....  No.  The problem is that this is supposed to be a scary movie, or at least a thriller, and it just doesn't deliver.  There is little tension, no suspense, and no fear.  Aside from some troubling dreams and visions, there really isn't anything for this couple to be worried about.  The whole movie is basically the two of them having these visions and playing around in bed.  Sure, you get a monster fight at the end...and some bloodshed...but nothing spectacular...  There's only one murder, and one good scare, and that's it.And the kinky sex?  Don't get your hopes up (or anything else for that matter).  Their idea of kinky sex is woman on top, fully clothed, trying to strangle her mate with a necktie.  Not exactly my idea of a good time.","Karen and her boyfriend Jerry move into their new Los Angeles apartment.They discover an old brass bed that Karen takes a liking to,unfortunately it has a really sinister history involving kinky sex murders.\"Deathbed\" tries to be a creepy supernatural tale,but fails miserably.The action is slow,the acting is nothing special and there is no suspense whatsoever.Even the sex scenes are lame.The climax is pretty gory and violent,so fans of splatter should be pleased.However the first hour of \"Deathbed\" is deadly dull and offers some tired horror movie conventions and cheap scares.Definitely one to avoid.My rating: 4 out of 10 and that's being generous.Watch \"Re-Animator\" or \"Castle Freak\" instead.","I mistakenly thought this was the 70's art film about the bed that eats people, which sounded interesting. It isn't. Interesting, I mean, let alone about a man-eating bed.I assume Stuart Gordon put his name on this in the same spirit that Lloyd Kaufman puts \"Troma\" on just about anything that's been shot with a video camera, in the interest of building up a franchise library. Little more can be said about this opus other than the running time is less than 90 minutes. It is, of course, about a bed that is haunted by the spirit of a man, or something, that once killed a woman with a wig and long false eyelashes. Along the way we get **a five minute opening credit sequence (is the one for \"Lawrence Of Arabia\" even as long?) **a murderer with Marylin Manson contacts who kills using the same technique as the troll in \"Cat's Eye\" **demonstrations of a sexual practice Michael Hutchence may have employed **a preview of what Emilio Estevez will soon look and act like **soft core porn even Cinemax would pass on **manbutt and one topless scene **a wacky (or is it \"whack\"-ee?) ending involving unintentionally hilarious hammer hits and leftover strawberry pie (well, it looked that way to me) **and a rudimentary surprise ending apros pos of nothing much. It's like the screenwriter even fell asleep on the \"Deathbed\" before finishing the last draft.It's not scary, it's not sexy, it's shot on hi-def video and doesn't look bad but doesn't look good either, the acting is just good enough to not be bad enough to be fun and so is everything else. No one would probably have even seen or heard of it unless it was on a disc with another movie, the modern day \"double feature.\" I wasn't paying attention for parts of it so I may have missed something. But for some reason I doubt it. Rating: PASS","This movie was thought to be low budget but it turned out to be awesome. I just rented it from blockbuster and i loved it. The acting was very good, hot women and some scary parts.  It is plain and simply worth the money to pay for.","The film opens with a black & white scene set in the 1920's or 30's where a couple are indulging in some kinky bondage. Then we cut to the present day where a young couple move into an LA apartment & inherit the bed from the first scene, which turns out to be haunted and turns their lives upside down.\nThe DVD cover has Stuart Gordon Presents on it but it's a million miles from Re-Animator, From Beyond, etc & I expect his association with DeathBed was only slight. \nFor A Full Moon Pictures/Film2000 release the acting is quite reasonable. The plot revolves mainly around the couple & their bed, it really does drag but perhaps with a bigger budget & in more capable hands it could have been expanded. There is a fair amount of soft sex, a couple of jump scares & a very brutal,gory climax but DeathBed could easily send you to sleep Zzzzzz","I caught this one on Amazon Prime under the title EVIL NEVER SLEEPS rather than DEATHBED. It's a straight to video Z-grade B-movie shot by the lamentable Danny Draven, with Stuart Gordon and Charles band producing for Full Moon Pictures. The whole thing has an amateurish look which means that it's impossible to take it seriously. A couple come into possession of a cursed bed which begins to make them act in bizarre ways, with an emphasis on kinky sex which comes across as quite laughable. The whole thing is very tame and cheesy despite the promise of the title and genre. Poor old Joe Estevez has the decency to look embarrassed by appearing. There are also a couple of low rent ghost and monster scenes, but overall this is quite pitiful.","The plot seemed to be interesting, but this film is a great dissapointment. Bad actors, a camera moving like in the hands of an amateur. If there was C-movies, this would be a perfect example. A plus for a nice DVD cover though and a great looking female actor.","*SPOILER ALERT* *SPOILER ALERT* I bought this video for four bucks. So this couple finds a bed in their attic. They decide to sleep on their new found discovery. It's too bad for them that this is a Deathbed. Seems there was a murder on the mattress back in the 30's and the essence of the murderer still inhabits it. The bad bed helps the couple become more sexually active until pure insanity starts to take hold of them.You know, a big part of me wants to like a movie about a supernatural bed that makes you horny. But I'm afraid \"Deathbed\" is just so completely ridiculous that I can't get into it. Hey, if the bed is the problem, why not buy a futon? Why not break out the sleeping bags or check into a motel? This movie is cheap and proud of it. All it has is a bed. That's it. A big fluffy, scary bed. Someone saw this bed and decided to base a movie around it. Eeek. I'm scared. There's no action, tension, nudity (!) or scares. There's just a bed. This movie has got me feeling sleepy.","I usually go into the video stores and can pick up a crap horror movie easily. I picked up Death Bed because of Stuart Gordon and Danny Draven. Let me tell you, this is a fine horror film, shot on quality video, it is classic in my book. Draven really sets up some tension and mood. Check it out! **** out of *****","A Movie about a possessed bed! A novel idea indeed, Interesting artwork, that certainly sold the movie to me, but my main reason for watching this movie, was the presence of Stuart Gordon and Charles Band.As it stands, the cover read \"Stuart Gordon Presents\" But what exactly does he present, and this i swear, to the end of my days, i'll forever be a fan of Charles Band work, but heaven help me, when they both got together to work on this endeavour.The Film opens with an old style scenario capturing the essence of a silent movie, of a man slowly seducing a beautiful woman on a bed,to the eerie strains of haunting music, finally ending with the woman being strangled with a silk scarf, this is followed by a slow fade to black, not however before i realised that the man committing the crime,was one time stalwart of Fred Olen Ray's band of film makers,Michael (D) Sonye (Aka Dukey Flyswatter) and if memory serves did he not write, Ray's \"Deepspace\" but also voice the titular character in Charles Band's \"Sorority Babes in The Slime Bowlarama.Intriguing Indeed, and as for the rest of his scenes, he never has one word of dialogue, which means he didn't have to try to hard to put his character up there on scene, as the scene set his character, i can't however say the same for the rest of the characters in the movie.Who should i blame, nobody really as all i did was watch the movie, and power to all involved as we should never dismiss the true art of film making, and the efforts invovled in putting it all together, but Danny Draven (Where was Trent Hagga?)along with John Strysik the writer and hand model in the movie have crafted nothing of note.A Movie littered with all the usual false scares, interesting use of lighting effects and a little light titillation, nothing new on show here except for the concept, So how real was the presence of Charles Band and Stuart Gordon, I'd say about as real As Joe Estevez's turn as the caretaker of the fancy building that the young couple movie into, Now thats the real horror on show here!!!","Made it through the first half an hour and deserved a medal for getting that far.  Lots of excuses for scantily clad women but no real plot to speak of emerged in that time.  What sounded like a good idea for a movie was badly executed.","Rented this one by mistake thinking it was another film with the same title, and realizing that I had rented it some time before.Quick plot line. A couple consisting of an artist and photographer rent a studio apartment in Los Angeles from Joe Estevez, still cursing the fact his brother Martin Sheen could actually ACT! They find a bed in a forgotten room, but the bed is haunted by a nasty looking serial killer from the 1930's and his last victim. Their ghosts inhabit the couple, first enhancing their sex life, but eventually becoming more menacing.What ensues is cheap R-rated sex scenes, cheaper thrills and kind of a waste of time.","Where do I begin, its one of the most frustrating movies I've seen because it makes a lot of sense in terms of the point but it comes off as seriously stupid. A movie about a ghost inhabited bed?? The first 2 minutes of the movie shows a black and white flashback of a weird looking fat dude going dominatrix on a Fabienne from Pulp Fiction lookalike contest winner and strangles her with his tie. This is supposed to set up how the bed factors into the story. Still though, if you wanted an opening to keep people interested or send them away early, having a strangulation is the way to do it. Fast forward to the present day, a married couple moves into an apartment with a friendly landlord and begins unpacking their things, so far everything's normal. Then one night while doing the hippity dippity on a single mattress, they realize they need a bed frame. This is where things get fishy, why didn't they bring or buy a g*d damn bed frame before they got there? We learn that the door leading to the attic where the first 2 minutes took place doesn't open but then once the couple realizes they need a bed frame, the door magically opens. They go up to the attic and discover the old bed frame and decide to bring it downstairs and their lovemaking days are saved...or so they thought. The rest of the movie centers around the both of them being haunted by the bedframe. The female is an artist so she starts drawing up the ghoulish images she dreams about and the male is a photographer so he starts having his models act as if they're bring tortured or tied up.(one of which has gray hair and appears over 50 years old, yuck) The female grows increasingly scared and she discovers the house she lives in was once a haven for serial killings and murders which bring about the end to the movie. They find the friendly landlord murdered (which makes no sense since ghosts need to take a human form to kill) and decide to get the hell out of dodge. While packing up, the husband moronically goes up into the attic where he is possessed by the crazy fat dude and the female bashes his skull in before the cops show up and take her to a mental ward where she kills some dude trying to hit on her.Well if you've read this far you have to be thinking one thing.......WHY THE HELL DIDN'T THEY JUST THROW THE BEDFRAME OUT THE WINDOW???? Seriously, they never said anything about the actual house being haunted, just the bed....so why not get rid of the damn thing and move on? That's why the movie is so frustrating because it actually is a good plot and the actors follow suit accordingly but there are more holes in it than Sonny Corleone at a toll booth. The couple did try to leave town as upposed to every other movie that has the ol \"oh lets give this place a chance honey\" scheme going, so props to that. Still though, me and my buddy who watched the movie kept saying every 5 minutes....why didn't they just throw the bed out? Especially once they learned it was haunted would have been a good time to set it on fire or something.All in all its a near-watchable movie with plenty of porno like bed scenes and a believable plot (to an extent) but the solution is so simple you're scratching your head by the end of the movie wondering how stupid can the married couple be? The highlight of the movie is when the husband tells the 50 year old model to spread her legs and his assistant tells him that he can't shoot her like that.4 out of 10 (a low budget porno The Man Show would love)"],"review-user":["barnthebarn","fandetv","jluis1984","moulinrye","Ephemeriis","HumanoidOfFlesh","TonyDood","lifehousefan13","Stevieboy666","Leofwine_draca","Scorpio-15","Dr. Gore","pig_71","jamesbourke50","oshilling","JoeB131","KHayes666"],"review-date":["23 March 2005","16 September 2005","13 November 2005","5 May 2004","1 June 2003","15 October 2004","30 March 2009","4 October 2002","19 May 2018","24 January 2018","26 January 2003","30 January 2005","29 December 2002","29 December 2002","8 November 2003","5 March 2010","28 January 2008"],"review-rating":["8","10","6","3","4","2","10","3","3","1","1","3","4"],"review-title":[" The Bed is Waiting...\n"," Great !\n"," Very good & original ghost story but...\n"," A dirty ghost story?\n"," A disappointment...\n"," Very dull.\n"," Made Me Sleepy\n"," awesome this movie is awesome\n"," Dull Bed\n"," Impossible to take seriously\n"," A total waste of time\n"," Big Bad Bed\n"," Scary flick\n"," Deathbed! Can you hear the sounds of screaming? Hmmmm!\n"," Dire\n"," Not Scary\n"," A possessed bed?\n"]}