{"review-url":["http://www.imdb.com/title/tt0361856/reviews"],"review-text":["I thought Rachel York was fantastic as \"Lucy.\" I have seen her in \"Kiss Me, Kate\" and \"Victor/Victoria,\" as well, and in each of these performances she has developed very different, and very real, characterizations. She is a chameleon who can play (and sing) anything!I am very surprised at how many negative reviews appear here regarding Rachel's performance in \"Lucy.\" Even some bonafide TV and entertainment critics seem to have missed the point of her portrayal. So many people have focused on the fact that Rachel doesn't really look like Lucy. My response to that is, \"So what?\" I wasn't looking for a superficial impersonation of Lucy. I wanted to know more about the real woman behind the clown. And Rachel certainly gave us that, in great depth. I also didn't want to see someone simply \"doing\" classic Lucy routines. Therefore I was very pleased with the decision by the producers and director to have Rachel portray Lucy in rehearsal for the most memorable of these skits - Vitameatavegamin and The Candy Factory. (It seems that some of the reviewers didn't realize that these two scenes were meant to be rehearsal sequences and not the actual skits). This approach, I thought, gave an innovative twist to sketches that so many of us know by heart. I also thought Rachel was terrifically fresh and funny in these scenes. And she absolutely nailed the routines that were recreated - the Professor and the Grape Stomping, in particular. There was one moment in the Grape scene where the corner of Rachel's mouth had the exact little upturn that I remember Lucy having. I couldn't believe she was able to capture that - and so naturally.I wonder if many of the folks who criticized the performance were expecting to see the Lucille Ball of \"I Love Lucy\" throughout the entire movie. After all, those of us who came to know her only through TV would not have any idea what Lucy was really like in her early movie years. I think Rachel showed a natural progression in the character that was brilliant. She planted all the right seeds for us to see the clown just waiting to emerge, given the right set of circumstances. Lucy didn't fit the mold of the old studio system. In her frustrated attempts to become the stereotypical movie star of that era, she kept repressing what would prove to be her ultimate gifts.I believe that Rachel deftly captured the comedy, drama, wit, sadness, anger, passion, love, ambition, loyalty, sexiness, self absorption, childishness, and stoicism all rolled into one complex American icon. And she did it with an authenticity and freshness that was totally endearing. \"Lucy\" was a star turn for Rachel York. I hope it brings a flood of great roles her way in the future. I also hope it brings her an Emmy.","This was well put together. 3 hours wasn't enough. Ms. York made me believe and Danny Pino had Desi's turn of phrase perfectly.  It covered Lucy's life in surprising detail considering it was too short.Like a trip down memory lane, Lucy and Ricky are a part of our culture then and now. If you allowed the story to take you there, you were in for a rare treat.York and Pino did their jobs perfectly.I was very impressed with the re-creation of many famous scenes, BusterKeaton's involvement with Lucy's life and Lucy's close personal relationships with her family.Four Star entertainment!!","I thought that the actors did a good job portraying such well-known and loved people. Sure, nobody could ever do it perfectly, but they did their best. Other people have mentioned that the Vitameatavegamin and Candy Factory scenes were done wrong. If they knew how the real episodes went and then saw those scenes and where they were or how they were dressed, a viewer would realize that those scenes were done as rehearsals. Lucy in her dressing room with a bottle of Coke practicing with a mirror, and Lucy and Vivian experiencing the conveyor belt for the first time at practice. Some people just don't pay attention. Like I said, I enjoyed this movie but would rather read Lucy's autobiography, \"Love Lucy.\"","Dramatic license - some hate it, though it is necessary in retelling any life story. In the case of \"Lucy\", the main points of Lucille Ball's teenage years, early career and 20 year marriage to Desi Arnaz are all included, albeit in a truncated and reworked way.The main emotional points of Lucy's life are made clear: Lucille's struggle to find her niche as an actress, finally blossoming into the brilliant comedienne who made the character Lucy Ricardo a legend; her turbulent, romantic and ultimately impossible marriage to Desi Arnaz; Lucy & Desi creating the first television empire and forever securing their place in history as TV's most memorable sitcom couple.As Lucille Ball, Rachel York does a commendable job. Do not expect to see quite the same miraculous transformation like the one Judy Davis made when playing Judy Garland, but York makes Ball strong-willed yet likable, and is very funny in her own right. Even though her comedic-timing is different than Lucy's, she is still believable. The film never goes into much detail about her perfectionistic behaviour on the set, and her mistreatment of Vivian Vance during the early \"I Love Lucy\" years, but watching York portray Lucy rehearsing privately is a nice inclusion.Daniel Pino is thinner and less charismatic than the real Desi was, but he does have his own charm and does a mostly decent job with Desi's accent, especially in the opening scene. Madeline Zima was decent, if not overly memorable, as the teen-aged Lucy.Vivian Vance and William Frawley were not featured much, thankfully, since Rebecca Hobbs and Russell Newman were not very convincing in the roles. Not that they aren't good actors in their own right, they just were not all that suited to the people they were playing. Most of the actors were from Austrailia and New Zeland, and the repressed accents are detectable at times.Although the main structure of the film sticks to historical fact, there are many deviations, some for seemingly inexplicable reasons. Jess Oppenheimer, the head writer of Lucy's radio show \"My Favourite Husband\" which began in 1948, is depicted in this film as arriving on the scene to help with \"I Love Lucy\" in 1951, completely disregarding the fact that he was the main creator! This movie also depicts Marc Daniels as being the main \"I Love Lucy\" director for its entire run, completely ignoring the fact that he was replaced by William Asher after the first season! Also, though I figure this was due to budgetary constraints, the Ricardo's are shown to live in the same apartment for their entire stay in New York, when in reality they changed apartments in 1953. The kitchen set is slightly larger and off-scale from the original as well. The Connecticut home looks pretty close to the original, except the right and left sides of the house have been condensed and restructured. There's also Desi talking about buying RKO in 1953, during Lucy's red-scare incident, even though RKO did not hit the market until 1957. These changes well could have been for dramatic license, and the film does work at conveying the main facts, but would it have hurt them to show a bit more respect to Oppenheimer and Asher, two vital figures in \"I Love Lucy\" history? The biggest gaff comes in the \"I Love Lucy\" recreation scenes, at least a few of them. It's always risky recreating something that is captured on film and has been seen by billions of people, but even more so when OBVIOUS CHANGES are made. The scene with the giant bread loaf was truncated, and anyone at all familiar with that episode would have noticed the differences right away! The \"We're Having A Baby\" number was shortened as well, but other than that it was practically dead on. By far the best was the \"grape-stomping\" scene, with Rachel York really nailing Lucy's mannerisms. The producers made the wise decision not to attempt directly recreating the \"Vitametavegamin\" and candy factory bits, instead showing the actors rehearse them. These scenes proved effective because of that approach.The film's main fault is that it makes the assumption the viewers already know a great deal about Lucy's life, since much is skimmed over or omitted at all. Overall, though, it gives a decent portrait of Lucy & Desi's marriage, and the factual errors can be overlooked when the character development works effectively.","This is a very well-done TV movie. The production values are high, the acting is usually excellent, and the story is factual, for the most part. Honestly, I have seen few movie biographies that were as factual as this. Some details are incorrect and events that did happen are sometimes in the wrong order, but to me these are minor issues. I have seen biopics that captured most of the right details, but they were presented in a way that was not true to the spirit of what happened. While not 100% accurate, the spirit of the real-life personalities and events was usually captured. The most inconsistent thing in the movie is that virtually no one in the movie seems to age significantly, especially Danny Pino as Desi Arnaz. He looks like he ages five years (at the most) from 1940 to 1960. His performance is ten times better than the actor who played him in \"Lucy and Desi: Before the Laughter,\" though. Pino plays Arnaz in a way that is slightly exaggerated and feels like an \"impersonation\" at times, but it is an effective performance. Rachel York does an excellent job playing Lucille Ball, although she is written to be a little more like \"Lucy Ricardo\" than the real Lucille Ball ever was. York has a \"zany\" or \"ditsy\" quality that Ball never had in real life. I enjoyed how the love and fun of Lucy and Desi's relationship came through as well as the tragedy. This movie had a nice balance of the fun times and the hard times. It also moves along at a quick pace, never really dragging. If you were to watch this movie and \"Lucy and Desi: a Home Movie\" (the definitive documentary on Lucy and Desi) back to back, you would find that most of the facts about their lives are accurately reproduced in this movie. Some casting could have been better (such as the actress who played Vivian Vance- she did not look, act, or sound at all like Vance) and in some cases the facts could have been better represented, but overall a well-produced, accurate, and entertaining movie.","\"Lucy\" the movie, failed to live up to the promise of it's commercials, which featured recreated scenes from the famous \"I Love Lucy\" series.The over long film juggled facts and dates to the point that any real Lucy fan watching couldn't help but spend the entire 3 hours raging about all that they got wrong or changed. So Buster Keaton readied the couple for their vaudeville act? Funny, Desi's friend Pepito the clown has always been credited in every biography of the couple I've ever read. They've got Lucy as a blonde years after she went red - where was the movie \"Too many Girls\" for which MGM imported Desi from NY, and during the making of which the couple began dating? Yeah, I'm nit-picking, but the film was so filled with little blunders like that! The kind of things that drive any hard core Lucy fan crazy! I could've over looked much of this had the producers provided me with  a more believable Lucy - but Miss York frankly did not cut it. Lucy was as famous for her beauty as for her talent, and Miss York is simply not even in her league.With a running time of 3 hours, they had time to get it right - that they chose not to do so amazes me! All in all, a really tedious waste of viewing time. If you love Lucy - Avoid it!","I had not seen this TV movie back when it came out but was on the getTV channel today and our internet was down after the heavy rains over the weekend. So I settled in.This is actually a very well made movie and the main actors are very authentic. I was growing up in the 1950s and 1960s and well remembered the TV show \"I Love Lucy.\" This movie puts it all in a perspective we never knew, and shows that Lucille Ball in real life was a lot more ordinary than we would have guessed from her TV persona.Rachel York is Lucille Ball and Danny Pino is Desi Arnaz. It shows how they met and how they decided to get married quickly when Lucy was back in California while Desi was working in New York.While it can be argued that Desi really did love Lucy he was of Cuban stock and he did not see fidelity as a necessary part of his marriage. This was a recurring thorn for Lucy and it plus his drinking and gambling finally resulted in their divorce. However in their heyday they had an extremely successful TV run and their fan base was so loyal some businesses posted signs \"We are now closed on Monday evenings, we love Lucy.\" Plus they formed Desilu Studios which produced a number of other very successful shows. They remained friends after their divorce.","Just watched this movie on TV - tripped over it and likely wouldn't have watched it any other time because I'd have been expecting it to be as bad as all the OTHER Lucy movies. Boy, was I surprised! I thought it was excellent and Rachel York was excellent IN it. Her voice sounded almost exactly like Lucy. She was a little \"prettier\" but once her hair was red, she was a GREAT Lucy. I loved the way she did Lucy's most famous scenes and stunts. They didn't look any different than when Lucy did them from the first one on stage to the famous wine vat. She had all the right movements and I thought she was just perfect.I LIKED that they didn't spend a lot of time on Fred and Ethel; they showed that they were cast and she and Ethel had their scenes together, but it was all about Lucy, as it should have been.Danny Pino was a great Desi. I'm really used to seeing him on SVU so it was a little hard to disconnect them, but he did all his iconic scenes very well and if he did his own singing, he was great.I recommend this movie. I was not familiar with Rachel York; clearly this must have been toward the beginning of her career and now she's a Broadway star, but I can't say enough what a great Lucy she played. To be able to get Lucy's nuances and quirks so well, she was top notch.I'm pulling my review out for editing because after reading OTHER reviews, I realize that it was a 3 hour movie but what I saw was cut into a two-hour movie. I didn't see any of her early years (that was my fault; I started 20 minutes late; my first view was when she drove into the driveway in California with her family. I couldn't understand why Buster Keaton was introduced and I clearly saw nothing of the RED scandal. The movie seemed complete as far as I saw it, but I realize now I sure would have liked to have seen the whole three hours.","They're screening this now on Get TV, but I fear they will need to change the name of the network to Get Lost TV.I don't even begin to understand, when the REAL history is so fascinating, so well documented and thus so easily obtainable, and so much better than this drivel, that they would chose to make this mess. Was this some high school film student's project? I'm not the world's biggest film enthusiast, but I must have half dozen books on this subject and truth is so much better than this badly acted, well, er, mess. They're making Lucille look like some idiot who just bounced into one unbelievable bit of good luck after another, when in fact the woman was a talented actor and a business genius. She got Buster Keaton himself to teach her how to use props! They didn't even get the meeting with Desi Arnaz correct, and that's Hollywood lore.I doubt you'll ever be faced with this decision, but should you find the opportunity to look at this, just don't. So disrespectful.","This is clearly a made-for-television movie. The plot line follows the rhythm that allows for commercial advertising breaks.  Nonetheless, the form suits the content: how the real-life coupling of Lucille Ball and Desi Arnaz led to the birth of a new comedic genre - the sitcom.Ball's goofy and good-natured ability to recount funny stories foreshadowed the eventual development of her unique physical humour. Rachel York uses her considerable talents effectively in her inspired performance as this very contemporary clown. Did Lucille Ball really receive coaching from Buster Keaton and Red Skelton or is this merely a fictional embellishment, creating a bridge between her mostly unknown film roles and her emergence as a television star?\"Lucy\" wisely does not recreate many scenes from the original \"I Love Lucy\" shows, with the stunning exception of the grape-stomping scene. Though the intervening years have provided TV and movie audiences with new comedians, the verve and the brilliance of Lucille Ball, as played in that particular scene, is well worth revisiting.","It was on tv last night..kinda surprised no one has commented on it yet. I actually missed the first 20 minutes or so of this because the alarm didn't wake me like it should have, but the rest of the film was very gripping. I never realized how much drama there was in Lucille's life..it's quite sad to think about. She was very happy on-stage, clearly.The looks of the actors, Rachel and  Daniel, were very off from the real Lucy and Desi (sometimes they actually find people who look like the people) which kinda threw me and made it hard for me to like see everything happening to the real Lucy. However their voices and accents were really good, so that helped. I noticed they kinda changed around a few things whenever they were recalling an episode...like the chocolate factory one...it was the bossy lady who called the machines to go faster..not Lucy..oh well. It's also sad that it ended so early in the story of their lives, but I suppose it was just to portray the story of \"Lucy\". It was still excellent and stuck in my mind.","The movie starts with the filming of the final episode of 'The Lucy-Desi Comedy Hour', a continuation of the very successful 'I Love Lucy' TV series, in 1960.  Lucy and Desi are privately calling each other names, some of which we could never have imagined them saying to each other, in an era when such words were not used on TV.  In fact, this movie has quite a bit of cursing.  Meanwhile, the personas they show to the public appear to tell a different story about the legendary relationship.Then we switch to the 1920s.  Young Lucille Ball helps her Uncle George sells hamburgers, and she dates a boy who supposedly smuggles alcohol from Canada.  We see the ups and downs of Lucy's early life as she attempts to start an acting career, including an acting class with a young Bette Davis, who already appears to show promise.Forward to 1931.  Lucy is good-looking and not afraid to take a pie in the face.  These qualities give her enough success in movies that she is able to move her mother, brother and grandfather west to live with her.  Then she meets Desi Arnaz and falls in love, knowing that he has many women after him, and that his father thought nothing of being married with a mistress. Despite Desi's reputation, the two end up getting married and moving to a nice ranch, and becoming friends with the likes of Clark Gable and Carole Lombard.  Desi's mother does not approve of Lucy, while Desi does not care for being considered 'Mr. Ball', since his wife is more famous than he is. World War II contributes to the strain in the relationship, as Desi serves in the military as a musician working for the campaign for War Bonds. Later, however, when the marriage appears headed for an end, a tragedy brings Lucy and Desi together.Television is the future, and Lucy and Desi take advantage of the chance to further their careers.  First, they do a Vaudeville act in front of a live audience, proving that they have what it takes to make people laugh.  A radio series follows, and then the TV series that ranks as one of the all-time favorites of many.  But despite the faces they show to the world, Lucy and Desi still have their problems.Madeline Zima does a fine job as young Lucy.  But Rachel York is absolutely wonderful, showing the spark immediately after taking over the role in 1931. She is beautiful (better-looking than the real Lucy, actually), confident and determined, and she has that wonderful personality.  And Daniel Pino captures Desi perfectly.  The accent and the voice make it sound as if the real Desi is actually speaking to us. In the Vaudeville routine, they are perfect.  I wish I could say the same for York's performances in re-enactments of the TV series.  She was good, but no one could play Lucy Ricardo like Lucille Ball.  Pino, however, does a fine job as Ricky.  Unfortunately, the actress playing Vivian Vance falls flat as Ethel.  We never do see the actor who played William Frawley in the role of Fred, and he didn't stand out much as Frawley.  I did enjoy the scenes where the producers and writers tried to solve various problems the series was having, even before production began.I enjoyed one scene where Lucy trained in silent-movie acting with Buster Keaton, who was considerably older and fatter than he was when he was popular, though the man playing him made him likeable. Other good acting performances:  Lucy's African-American maid, who wanted to be in show business but experienced discrimination; Desi's mother (classy, but not on screen very long); Carole Lombard, one of Lucy's closest friends; and Jess Oppenheimer, one of the driving forces behind the TV series.I was afraid this movie would focus too much on the negative, sordid side of the Lucy-Desi romance.  This was true during the third hour, but enough of the positives were shown to provide a balance.This movie was based on fact but certain details were changed.  In the famous chocolate factory scene with Lucy and Ethel, Lucy spoke a line delivered by a third actress in reality.  After Lucy celebrated her company's purchase of RKO in 1958 (according to an on-screen graphic), filming on 'I Love Lucy' continued, even though that series had ended production in 1957, succeeded by the hour-long show set in Connecticut. Another gaffe:  an early 1960s Cadillac was shown in a scene from the early 1950s.The following might be SPOILERS:  Some of Pino's best scenes came during the third hour of the movie.  In one, Pino tearfully explains to the studio audience for the TV show how Lucy is not a Communist and how much he hates Communism.  As good as the performance is, the Communists had yet to take over Cuba, and they were in fact enemies of Batista, the dictator who ran the affluent Arnaz family out of Cuba and took away everything they had. Another wonderful scene had Desi and Lucy explaining to their children what divorce meant.  The young actress playing Lucie did a fine job there.I enjoyed this movie, in spite of the negatives in the lives of these two wonderful stars.","I saw \"Lucy\" last night and found it to be a pretty good general overview of the star's rise.  It seemed to dwell a bit too much on her relationship with Desi(which never really changed) instead of the other things going on in her life as she became more and more famous.The acting was very good.  I remember Rachel York from Les Mis back in 1991. She has a great deal of talent.  Danny Pino, I don't remember seeing in anything before.All in all - worth seeing.","I have no idea how historically accurate the story is. But to my own surprise, I found myself crying through most of this movie. Gradually--very gradually--the (I must say amazing) actress Rachel York uncannily takes on the appearance and personae of the Lucille Ball we all knew from the wildly popular sitcom people my age grew up with many years ago. Though we read stories of the tensions between Ball and her husband/TV co-star, Desi Arnez, none of it seemed very real. This drama drives it home. It is a true tragi-comedy. Neither of these two enormously talented personalities come across as villains.It is, in the end, simply a tragic clash of cultures.All performers in this production are top notch.","I've read a lot of negative reviews of this film and I can only say that yes, there are some errors in the chronology and anachronisms regarding the cars used. If you can get beyond all that, the film will entertain you. The acting and the portrayals are quite good of Lucy and Desi, and acceptable for Viv and Bill Frawley. There are some not-bad impersonations of some legends like Eddie Cantor and young Bette Davis. A standout is the young woman portraying Carole Lombard, and the 20s period stuff looks good. I wish they would have gone more into Desi's background as his early life was filled with at least as much drama as Lucy's. The woman who plays DeDe Ball really looks exactly like the real thing. The re-creations of Lucy's best routines are pretty good. It must be hard to near-impossible to try an imitate a comic genius credibly, but Rachel York does a very good job. I've read nearly everything ever written about Lucy and Desi, and while this film is not perfect, it is generally pretty accurate.","Before I watched this tv movie I did not know much about one of my favorite actresses.  After watching it, I realized how sad Lucille Ball's life really was.  It had it's great moments too, but I didn't realize how sad it was. This movie was very good and told the story of the beloved Lucille Ball very well.  I highly reccommend it.","This film failed before we evan saw who directed it. Even the casting chosen for this movie didn't do well.  It's a shame that this movie is nothing more then Lucy's marriage problems with just a touch of her show. If you want to see the true Lucy go to A&E and see it there. You will get a better idea of this great lady.","When I first saw a glimpse of this movie, I quickly noticed the actress who was playing the role of Lucille Ball. Rachel York's portrayal of Lucy is absolutely awful. Lucille Ball was an astounding comedian with incredible talent. To think about a legend like Lucille Ball being portrayed the way she was in the movie is horrendous. I cannot believe out of all the actresses in the world who could play a much better Lucy, the producers decided to get Rachel York. She might be a good actress in other roles but to play the role of Lucille Ball is tough. It is pretty hard to find someone who could resemble Lucille Ball, but they could at least find someone a bit similar in looks and talent.  If you noticed York's portrayal of Lucy in episodes of I Love Lucy like the chocolate factory or vitavetavegamin, nothing is similar in any way-her expression, voice, or movement.To top it all off, Danny Pino playing Desi Arnaz is horrible. Pino does not qualify to play as Ricky. He's small and skinny, his accent is unreal, and once again, his acting is unbelievable. Although Fred and Ethel were not similar either, they were not as bad as the characters of Lucy and Ricky.Overall, extremely horrible casting and the story is badly told. If people want to understand the real life situation of Lucille Ball, I suggest watching A&E Biography of Lucy and Desi, read the book from Lucille Ball herself, or PBS' American Masters: Finding Lucy. If you want to see a docudrama, \"Before the Laughter\" would be a better choice. The casting of Lucille Ball and Desi Arnaz in \"Before the Laughter\" is much better compared to this.  At least, a similar aspect is shown rather than nothing.","Lucille Ball was a great comedian, but her life really does not lend itself to a 3 hour dramatic interpretation like this. There just isn't much that dramatic that happened.  This biopic covers a lot of familiar territory, while adding nothing really new and interesting. There have been a number of documentaries on Lucy covering all this material, and watching the real people and archival footage is a lot more interesting than this play acting.   It came across as a rote dramatization of events rather than an involving drama.\nThe script is not at all good, and the \"recreations\" served only to illustrate why the real Lucy et al. were comic geniuses and these actors are not.Rachel York as Lucy fails to capture Lucy's essence. She definitely does not have her edge, especially as an older woman. As Ball approached middle age she came across as very tough and coarse, with a very raspy voice.  (Though in fairness, I would think playing someone like Lucille Ball convincingly would be near impossible). Fred and Ethel are pathetic. And Bette Davis??!!Danny Pinto as Desi fares the best. He really got the accent down, and had some of Desi's swagger if not his hard edge as well.  Needless to say, Desi was no where near as thin, handsome (and young) as Pinto. Not that was really a problem - staring at him was the main reason to watch this!Anyone expcecing something along the lines of the Judy Garland bio of a few years back will be sorely disappointed. Not even close."],"review-user":["lovesclassics","ApolloBoy109","greshfam7","SnowBrian","dannymike","IStillAmBig","TxMike","amorellehill","CarmellaSoprano","froufrou","KKaliforniApril22","vchimpanzee","macarl","JimTom-2","earlytalkie","americanjules04","Two1980","thien314","bilahn"],"review-date":["24 May 2003","5 May 2003","3 August 2004","5 March 2008","9 February 2012","6 May 2003","26 October 2015","25 October 2015","4 October 2015","5 May 2003","5 May 2003","5 May 2003","5 May 2003","4 May 2003","25 May 2012","4 May 2003","13 September 2003","11 May 2003","7 May 2003"],"review-rating":["9","7","9","9","1","6","9","1","5"],"review-title":[" Rachel York was fantastic in \"Lucy\"\n"," A Stunning Re-creation of TV's Famous Couple\n"," I liked it.\n"," A decent and enjoyable film, though far from perfect.\n"," 90% Accurate TV Movie; Excellent Overall Production\n"," Playing fast and loose with history\n"," 'We close Monday nights, we love Lucy.'\n"," She was EXCELLENT\n"," Oh, really...\n"," That grape-stomping scene still rules!\n"," Pretty cool..very worth watching\n"," Good performances by the lead actors, not as negative as I expected\n"," A fairly good treatment\n"," Moving\n"," Entertaining\n"," The ups and downs of America's greatest comedienne\n"," Didn't work for me\n"," The worst representation of a truly classic legend\n"," Mediocre\n"]}