{"review-url":["http://www.imdb.com/title/tt0387462/reviews"],"review-text":["Nothing authentic about this movie... Frankly this movie has no spirit and no story underneath at all... Its more like an mixture of many alike films come together with a amateur director's vision. The story is such a ship-wreck and the cast is like a bunch of street walkers. There is an actual feeling of many commercials come together so as to form a no-story film. Fantastic cinema however more likely based on storytelling theories, conspiracies etc. which none of these you may find in this move content. Its hard to tell the concept of this film is based on the reality and fear of students who are attending to get the university degree with a reference exam called O.S.S . This is unfortunately all you can get from this amateur film. Well, for sure there is a cheap effort under those production circumstances but let me tell you; DON'T WASTE YOUR TIME to watch it anyway...","I was not expecting a classic, but at least a funny film. There were only a few scenes that makes you laugh but nothing more. You don't scare it is full of American teen-slasher cliches and you can guess what will happen easily.But it tells much about a senior student in a Turkish High-School. Pressure of Student Selection Exam (OSS) that 3-hour-exam determines which university you'll go and thinking about the exam when a ghost is after you is not exaggeration. The movie is bad. Don't waste your time to watch it.","Okul\"The School\" is a result of a new trend in Turkish cinema. Having used the same stories over and over again new generation directors finally come up with different ideas. Of course, it doesn't mean that they are all grand. I think Okul is one of them. It is supposed to be a scary movie but it is not. It is not successful on being scary either. So what is it? Actors are so average especially Deniz Akkaya is pretty annoying with the teacher role. I am sure it could have been better if it was tried on harder. Maybe concentrating on one topic such as making it scary or vice versa. But directors have missed the target this time. ** out of *****","There was nothing about horror.The movie was not horror or something close.It was just a funny teenage movie with lots of swaering and a stupid ghost(he was such a dork when he was alive and the same when he is dead). The producers tried to sell it by the young and beautiful(I dont think so)actresses and some of Turkish celebrites such as Deniz Akkaya.Yes it worked and lots of 11-16 year old boys watched it.And producers made money with that.But is making movies like this develops Turkish cinema...I don't think so... There are some frightening moments but they don't affect you because of the pointless swearing and stupid scenes(the boys in the movie swears everything and anytime).After watching you don't remember the scary scenes you remember the stupid dialogues for example \"This is salty...the school is crying\"(after tasting the water coming from the walls).","Okul is the first of its kind in Turkish cinema, and it's way better than I expected. Those people who say it's neither scary nor funny have a point, it's not all that great indeed. But it must be kept in mind that everyone involved with the movie is rather amateur, so it's basically a maiden voyage. And comparing this one to Sinan Çetin's other films such as the 1st class garbage \"Propaganda\", this movie is pretty damn good.One thing that MUST be said: It deals with the highschool students' life in Turkey VERY realistically! That's exactly how it goes! The scenes that are meant to scare are somewhat cheap, and Hollywoodish. Most of them even if not all. But that religion lesson scene made me laugh in tears, and Emre Kýnay performs the best acting of this flick as a religion teacher.It's NOT a waste of your time, go and watch it! You'll find it rather amusing especially if you know Turkey enough to relate to Turkish youngsters' school lives.","I remember first time I watched that movie I was 8 or 9. I couldnt sleep like 3-4 nights. Today I am 21 years old and I realize movie is not scary at all. But I like the cast. Every one of cast member became famous and successful. Especially Nehir Erdogan and Melisa Sozen. My biggest dissapoitment is Sinem Kobal's acting skills. I havent seen worse acting in professional movie. I enjoyed to movie.","the movie is: the return of the soul of a student who has chosen suicide after being teased by all the school because of his love to a girl and the stories he wrote to her.. eventually, his revenge will be a \"terrifying comedy\"... it's obvious that it wont be something to watch with pleasure but still the attempt is good and wish the rest of the road will be brighter in this sector of turkey..","Okul is one of the most interesting Turkish movies.  Its concept has been called \"korkunc komik\", which means something like \"scary and funny\" in Turkish.  It has many elements inspired from American teen-slasher movies; however \"Okul\" somehow shows the Turkish way of \"humor\".","This movie coming from Turkey where you can't find any tradition of horror movies. First I was afraid of watching just  an adaptation but after seeing it I have changed my mind. It has original scenario.A love movie using horror thema. Most of the players are not famous young people but their performance is proofing that a new generation is coming. Maybe this is a sign that turkish cinema is coming back after 20 years.","A ghost story on a typical Turkish high school with nice sound and visual effects. Taylan biraderler(taylan brothers) had made their first shots on a tv-show a couple of years ago, as far as i know. That was kind of a Turkish X-Files, they had very nice stories but lacked on visual effects. This time it seems they had what they needed and used them well. This movie will make you laugh that's for sure, and as well it might have you scared. It has a nice plot and some young, bright actors in it. If you are a high school student in Turkey you will find so many things about you here. There are many clues in the movie about its story and ending, some you understand at the moment, some will make sense afterwords, the dialogs were written very cleverly. So these make the movie one of the best Turk movies made in the last years. Do not forget, this movie is the first of its kind in the Turkish film industry.","I've watched the movie actually several times. And what i want to say about it is the only thing that made this movie high rank was the Burak Altay's incredible performance, absolutely nothing but that. Not even those silly model named Deniz Akkaya and some of these popular names at times in the movie... Burak is definitely very talented i've seen a few jobs he made and been through. Even though this is kind of horror movie, he's doing really good job in comedy movies and also in dramas too. I bet most of you all saw Asmali Konak the movie and TV series, those two would go for an example... All i'm gonna say is you better watch out for the new works coming out from Burak then you'll see.. Keep the good work bro, much love..","This film is the most impressing turkish film that I have ever seen. Probably \"Okul\" is the first turkish horror film. I must say that I were excited while watching the movie because of some reasons, The first reason is that the story is impressive, I mean that at the end of the film you realised all the details about movie, this makes the film attractive and the other reason is that no turkish man made such a movie like that before. This shows that turkish film improves itself by time. Although the first trial to make a horror movie, It was really successful. I advice all of you not to miss this movie..."],"review-user":["fofosus","uergun","mustican","freefall_06","Exiled_Archangel","ozanss55","cihanbilir","suerdas","Birgezgin","can_uzun","mournyoutillijoinyou","oraygungor"],"review-date":["4 September 2004","14 February 2004","6 July 2007","4 March 2004","9 September 2004","26 June 2018","10 January 2004","17 January 2004","6 February 2004","9 January 2004","17 August 2005","10 January 2004"],"review-rating":["3","4","8","5","6","7","9","8","10"],"review-title":[" Nothing authentic at all\n"," Neither scary nor funny\n"," A Failure\n"," was it horror?\n"," Not an excellent movie, yet a great attempt!\n"," Interesting movie\n"," an interesting attempt on the movie sector of turkey\n"," scary and funny\n"," Congratulations Taylan Brothers\n"," Nice plot, realistic characters, extremely uncensored language, 8/10\n"," Burak Altay is the man\n"," 8/10 Such a good turkish horror film!\n"]}