{"review-url":["http://www.imdb.com/title/tt0306273/reviews"],"review-text":["This show is like one of those cheap videos that they would show at school to try and inform you about racial awareness and people with disabilities while trying to add some cheap jokes to keep your attention. It's a nice idea using the kid who can't speak as a narrator though he is hardly ever used and only speaks about 5 or 6 times per show. You will smile, at the most, about 3 times during the half hour and cringe a lot more wondering how Jasper Carrot ever got lumbered with this pile of tree-hugging crap.","It says a lot about the United Kingdom when television programmes like this not only get made but also run for three series. Unfunny, politically correct to the point of sickening and poorly acted and written. Meera Syal has not been funny or accomplished in anything that she has been in, go on tell me I am wrong, and Jasper Carrott, funny guy as he is, is well past his eighties prime. This is such a bad comedy that it could have been made by ITV but even stinkers like The Upper Hand and the one with James Bolam as a car park attendant look like Fawlty Towers compared to this rubbish. I would love to sit down with the writer/director of this show so that they can point out the humour in this programme. Admittedly the majority of the UK's population is made up of poorly educated chavs but this would not tickle their funny bones. That's if they could tear themselves away from Big Brother or from their mobile phones but that's another story. Complete and utter dirt!","STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsI was interested in giving this show a glance 'cos it's set in my home city of Birmingham and,of course,who better to headbill it than that legendary stelwart of our comedic prowess,Jasper Carrott.But I have to say,the results are certainly not very encouraging.Jasper was fantastic in The Detectives,which I happen to regard as one of the finest comedy series ever created by the BBC,but here he just can't seem to help matters at all.The premise rests around Colin the Builder (Carrott),his three children from his previous marriage,new wife Rupinder (Nina Wadia) and her disabled son (Jamil Dhillon) and the various mis-adventures they get up to in each weekly episode.It opens to various shots around Birmingham (i.e.,the BT tower,the Brindley Place canals) shot in a cheap,almost camcorder esque fashion,which plays to a rather unappealing opening soundtrack.It also sets the tone for the rest of the series.Indeed,as one IMDB reviewer already pointed out,it feels more like one of those videos they might have played to you as a class back at primary school as opposed to a professionally made BBC production.Such shoddy,see through production values are complimented by poorly executed gags,with dire delivery and almost non-existent comic timing from the mainly inexperienced younger cast members.Jasper merely seems trapped by such a witless,dire script that even the greatest comedic expertise in the world probably could not save.It's no wonder,in fact,that Meera Syal appeared to have walked out by the second series.The high notes lie in it's ingenuitive plot angles,that of the problems and adversities that may lie in a mixed-race family,and of having a child with a disability as one of it's main characters.These are certainly very inspired angles to explore.Unfortunately,this dismal series is never able to exploit them to their full potential,and ultimately emerges as a waste not only of some creative ideas,but of the talents of one of our finest funnymen ever to hit the big time.*","Oh my god! The Beeb hit a new low with this gutless act of political correctness, A mixed race family living in Birmingham with a disabled kid thrown in for good measure. Whoever commissioned this tripe should be hunted down and thrown to the dogs. The usually funny Jasper Carrott is about as funny as piles in this show and don't get me started about the others. They have the timing and subtly of a Nuclear bomb. I only hope comedy will get better but with the likes of Little Britain and Catherine Tate about I severely doubt this. I think you'd be better off getting the box set for a decent comedy from yesteryear such as Fawlty Towers or Bottom if you want a laugh.BAN THIS SQUEAKY CLEAN RUBBISH!","BIG Jasper Carrott fan. I loved The Detectives (BIG FAN) and have most episodes on tape. BRILLIANT stand-up comic, but sadly only a so/so actor. THE DETECTIVES simply worked because of Jasper's comic timing, the storylines, the guest stars...and of course not forgetting Mr. Robert Powell(!) ALL ABOUT ME...decidedly dodgy. Not very funny at all. I do remember watching just a couple of episodes when it first was broadcast over a year ago. I found it extremely tacky looking. Why was Jasper involved in this. He is the best comedian ever by far, and yet even he cannot save this drivvel. The first series, I'm sorry to say, definately does deserve to be panned good and proper. I suppose the real reason why I am writing this review is because there is a new series of ALL ABOUT ME starting this Friday which doesn't look too bad on the reviews so I'll give it another chance. It'll have to be greatly improved though! MJG",".... But only if someone is kicking you in the ribs very very hard.Yes you can guess this is going to get a poor review from me . I had the fortune of not seeing the first series and if it was ten times better than the second series it still wouldn`t have deserved a second series . This is awful with punchlines you can see coming a mile a way . I`ll give you an example . Young daughter dressed up in bandages says to her father at Halloween : \" Would you like to become a mummy ? \" and her father replies * Answer at the bottom of the review .But it`s not only the flat jokes that caused me to hate this - It`s the flat jokes combined with a politically correct agenda . The plot revolves around a mixed race step family and one of the children suffers from cerebral palsy. If this was a politically incorrect show it might possibly be sick but it might also possibly be funny in a sick way , but being PC there`s no chance of offence and no chance of a smile either as most of the running time seems to be taken up with issues like handicapped relationships and Hindu festivals , and the cynic in me believes that the BBC will counter-act anyone criticising this flop comedy with cries of \" racist \" or worse . I`m not racist but I do have a sense of humour ( You need one if you`re a working class Scot called Theodore ) and this sentenious garbage is just not funny    Jasper Carrott is a comedian I can take or leave but like any other comedian he`s at his best when he`s at his most politically incorrect . He had me in stiches with a sketch spoofing  CORONATION STREET from 20 years ago :\" Oh we`ve just received a wedding card \"\" What`s it say ? \" \" All the best and thumbs up \" \" That`s nice . Who sent it ? \" \" The Faircloughs \" You`ll get the joke if you can remember a certain court case from 20 years back . * And the punch line is \" No thank you it`s bad enough being a daddy \" . Bet you didn`t see that coming","Oh how I laughed....this has it all...an Asian/White family, a disabled Asian boy...everything a healthy person needs to see in the eyes of the BBC.What utter tribe: This was a total insult to my eyes that viewed this rubbish for one episode and ONE EPISODE ONLY.When you think of some of the quality the BBC has put out over the years (Fawlty Towers for example) and then this comes rolling in...Its a disgusting disgrace.Its all geared on political-correctness and is devoid of any humour whatsoever.This is straight from the bowels of hell: but what would you expect from the ultra left-wing BPC...I mean BBC.","Jasper Carrott is a brilliant stand up comic and always makes me laugh (Back to the front is evidence enough) but hes only in this disappointment of a sitcom because the producers wanted to get more people to watch it. Its not something anyone will remember in years to come but Jasper Carrott will. Don't watch this show if you want to see Jasper. Watch the show i recommended earlier. This sitcom does him no justice and i tend to find this is the BBC trying to be politically correct as most shows on British TV seem to be trying to do these days. Its also generally not very funny and tends to be too predictable in terms of Joke execution.","Critically panned when it aired, and never picked up for a second series, I think I was the only viewer who liked it...but I really did. I liked this modern family before the wonderful US sitcom 'Modern Family'). Multi racial, multi cultural, with a prominent character with visible disabilities (that were not simply a plot device for one episode) I thought it was forward looking in its sensibilities. The married couples dynamic was not new, but I liked the chemistry between the leading players. Carrot has tried his hand at acting successfully previously (with the Detectives)but this failure seems to have shut down any acting ambitions, I think he should go again, he had warmth, and that's a rare characteristic in modern English comedians. It will probably be confined to the vaults, but if it does resurface, give it a go and you may be surprised.","HiI have been watching this programme from the first episode. I am grateful to the writer for including within the family unit a person who has a disability.  In doing so you are raising awareness of disability issues in a way that is inclusive and portrays,with humour, the `normalness' of family life.  Respect!However, As this particular sit com developes, I am becoming very interested in the writer for one reason.  The characters portrayed are beginning to eclipse my own family, with the exception that we are not a divorced couple with children and neither are we of different cultural backgrounds.  The uncanny similarities lay primarily with the disabilities portrayed.Our eldest son had a rare metabolic illness which meant he had no co-ordinated movement or speech but was intellegent and communicated, like Rhaj through facial expression. My youngest son has, yes, you have guessed it, Aspergers Autism.  I watched this evenings episode and the script unveiled explaining to my `Builder' husband that I suspected that the youngest boy had autism.  At that point my daughter rang me to ask if I was watching the programme and if I had been instrumental in providing the plot. As she is a script writer she was mortified to think I had given away a potential story line which she could have used.So my question to the writer is this.  Out of pure curiosity who did you base the script on and what research did you undertake?.  Is this co-incidence or it there some divine explanation for the similarities. Scaaaarrrrry or what!P.s  Has Ruvinda got a job and if so what?. (hopefully she hasn't or if she has, is it the same occupation as mine!)pass me the garlic please!RegardsSandra Duncan","I cant understand why some people don't like this show. True its not a classic sitcom like last of the summer wine, or more recently Spaces...But none the less its a cute, charming show. Jasper Carots performance is great as usual, and Jamil Dhillion/ Luke Allder provides a wonderful insight.Sadly the second series was forced to become more politically correct, and destroyed the format of the show. The whole reason why it worked was the some of the social awkwardness that came about, which made it very realistic.Watch the first series, the second series was a disappointment, but the first series remains a highly watchable piece of TV","I think ive seen every episode but am not sure. I just saw the last episode a couple of hours ago(holiday episode) and i think it was the best so far. I would like to think the type of racism shown in the episode doesn't happen in a modern day society but unfortunately it does. I think Rupinder dealt with it well by not letting it bother her and giving a good example to the children, of both races.I came onto the website looking for more information on the older coloured daughter but am not sure which actress or character she plays so i would appreciate some help with this if anyone knows."],"review-user":["Twinnie","bigdukemckenna","davideo-2","hgchif","GrantCAGE","Theo Robertson","melon_hands","Mmyers2003","HillstreetBunz","kscaduncan","thedoomsdaybegins","The_Diab"],"review-date":["12 April 2002","29 June 2006","6 December 2003","11 July 2007","13 October 2003","13 November 2003","25 May 2006","29 December 2002","22 March 2014","22 March 2002","28 May 2005","5 April 2002"],"review-rating":["1","1","1","7"],"review-title":[" Avoid\n"," Is this for real?\n"," Is this the best we can manage?\n"," What is this?\n"," Jasper...Just what were you thinking of!!\n"," Your Sides Will Hurt Watching This ....\n"," The worst 'comedy' ever, Official\n"," Not great\n"," Missed opportunity\n"," They are copying our life! Or are they...?\n"," A charming and witty show...\n"," Mixed race family with very real problems\n"]}