{"review-url":["http://www.imdb.com/title/tt0329224/reviews"],"review-text":["Hey, I don't know why folks are down on this film.  It was awfully cool! I just watched this in April of 2004.  I was pleasantly suprised by what I at first thought would be a crummy \"HBO Family\" movie inexplicably categorized as a horror-film.  It was decently acted, creepy, and scared the crap out of the kids in the house! ;)  The make-up for the goblins was quite well-done. I of course, love the \"rapid-strobe/jerky movement\" technique employed so well in fave flicks of mine like \"House on Haunted Hill\". And of course, the always cool Malcolm McDowell is the baddie, I mean, \"helpful doctor\"! ;) I should also mention that the Lady playing the mom is awfully cute! If you can, catch this one on cable, it's worth checking out if you like \"creepy little creature\" flicks and folklore.  ****  out of ****!!  It's nice to actually see a good horror-film on Cable once in a while...","This little flick is reminiscent of several other movies, but manages to keep its own style & mood.  \"Troll\" & \"Don't Be Afraid of the Dark\" come to mind.  The suspense builders were good, & just cross the line from G to PG. I especially liked the non-cliche choices with the parents;  in other movies, I could predict the dialog verbatim, but the writing in this movie made better selections.  If you want a movie that's not gross but gives you some chills, this is a great choice.","Malcolm McDowell diagnoses Megan Gallagher's daughter and she as having a form of illness, when they believe they are seeing \"The Huldre\", troll-like creatures which live with \"the rocks and the roots\" (to quote the movie).Basically a family moves into an older house, which has a smaller doll-house in the backyard. The daughter (well played by Sofia Vassiliova) starts to befriend the creatures, until they become vindictive. The family cat also disappears.There are a few good scenes with Megan Gallagher (\"Millennium\") and Malcolm McDowell as the psychiatrist. There is also something strange which occurred to one of McDowell's patients.If you enjoy this type of story, you may also like \"Bad Ronald\", which had a similar odd theme, and the house is haunted by bad Ronald (Scott Jacoby) only that movie is from the 70's. 7/10.","A family of four moves into an old house with an even older 'doll house' in the backyard inhabited by the Huldre -- little troll-like people with an attitude. Fans of gore should look elsewhere, but those people with time enough to watch a relatively 'family-friendly' horror movie will not be disappointed. Other reviewers have called this a made-for-cable movie. If it is, I'm curious which channel produced it. It definitely has the feel of something that might have been produced for USA or TBS. It's not really scary, but it has a very professional veneer and solid performances. This film, however, falls apart at the end the same way so many other horror movies do by showing too much of the monsters. The Huldre seem fierce and mysterious when seen in short glimpses, but, when they are overexposed, you start to think you could take care of them all with a baseball bat.","A family of four has moved into a new house that needs a real makeover. Out the back happens to be a fancy old looking playhouse, which the young daughter, Gina grows attach it. This is where she talks to her fairy friends and her parents (mother) believe she's just getting used to the move. Soon small, but dangerous accidents start occurring and Gina claims it's the fairies. To that response they seek the aid of a doctor who specialises in these cases, but is she telling the truth?Two things were on my mind when I decided to give the film a view. That I'd be watching a haunted house flick and a real stinker too. The director, Kelly Sandefur brought us the laughably dumb and irritable family horror TV movie \"Fangs (2001)\". So I was in store for a childish themed movie. So there was another fact that wouldn't budge from my mind. Anyhow, I don't shoot me. I guess going in with extremely LOW expectations rubbed off nicely.There's something about this ho hum fairy-tale family (yes, family-friendly) horror film that kept me more than occupied and rather surprised. I liked the concept behind it, although in the long run it's mechanical and there's a familiar pattern that developments. It seems to take its thunder from the likes of the third short story \"The General\" in the omnibus flick \"Cat's Eye (1985)\" and \"Don't be Afraid of the Dark (1973)\". The enchantingly, silly material has some imagination amongst its shallowness. It can get little rushed and over-stated in certain details. The mystery around \"are they're real or not\" isn't much, as we know how it's going to eventuate in first place.Sandefur's direction is generic and lacks atmosphere, but workable with a certain professionalism and slickness coming off the cheap production. The quick flashes and ragged editing worked out when they showed glimpses of the nasty little critters. But when the main focus was on them the visual effects was a different story. The creative designs of the artful trolls are well crafted and so is the odd looking playhouse. In these TV movies the violence is lacking, and that's the scenario here. Most of it happens off screen and is very watered down. The scares are ineffective and you see them miles before they hit. What cues it up is an out-of-sorts score that doesn't translate well with the action and feel. The performances were shockingly above average with the likes of Patty McCormack and a manipulative toned down Malcolm McDowell leading the way. Megan Gallagher makes a potently strong heroine as the worried mother figure.Yep, it's predictable. Throw in cheesy. Definitely risible. And how about a truckload of clichés. Oh, what a nice onslaught I can see you thinking. Despite that, it's hard not to be simply amused by it all.I found it hard to recommend, as I thought it got me on a good night and I don't think I'm its target audience. It isn't aiming for anything big, but for an enjoyably relaxing viewing on the couch. I found it to be bemusedly watchable, PG b-grade horror.","When the Russell family invests all their savings and move to a huge old house, their young daughter Gina (Sofia Vassilieva) claims to have some small new friends, The Huldre, living in the doll house in the yard. Her reluctant mother believes it is fruit of Gina's imagination, but finally she accepts the advice of the schoolteacher and takes the girl to the psychiatrist Dr. Werner (Malcom McDowell). In the end, the family realizes that there are many Trolls living nearby their house. \"Inhabited\" is almost a good movie. The story has a good atmosphere, but the effects of the monsters are very poor and the conclusion of the plot is not good. In the end, \"Inhabited\" is nothing but a conventional horror B-movie of haunted house. One of the best movies about Trolls that I have seen is \"Cat's Eye (1985)\", in the module with a young Drew Barrymore. My vote is six.Title (Brazil): \"A Casa Do Medo\" (\"The House of the Fear\")","Not a bad little TV Movie!  INHABITED breaks no new ground in terms of classic Supernatural Thrillers, but it does pick up he themes of Classic Thriller DON'T BE AFRAID OF THE DARK and tones down the violence enough so that kids can probably watch it without having massive nightmares.  The EFX would have been rather pedestrian but the Production team employs the Old Joel Peter Witkin technique ALA JACOB'S LADDER and speeds up the evil fairies' movements enough that the step-printing effect makes them look like they are treading the border between two worlds. It works!This is your basic Family-in-peril flick where a likable and fairly believably cast bunch of Surburban cliches face a supernatural menace. Typcially, one parent refuses to believe that it could be a supernatural evil.\nWarning.... Very mild spoiler ahead.. doesn't reveal ending but does reveal some of the twists for parents who might want to know what is coming before letting kids watch..........************************Do not read further unless you want to know details in order to decide if your kids should watch.***************** ***** ** *The red-herring of the house having been the site of a gruesome murder 50 years prior adds a little spice before the Family closes ranks and takes the Nasty Little Folk on for a fight to the death. However, that element might upset very little kids. While there is a death and another serious Fairy Attack...there isn't any truly gross violence and even the predicatable heavy metal music at the end is justified by the presence of a male teen in the family whose screams cannot be heard over his loud stereo.... at least for a moment.Overall, not bad.","Thanks to silly horror movies like \"Troll\" and the indescribably atrocious cult-favorite \"Troll 2\", it has become practically impossible to take movies with kobolds, gnomes and various other types of little green hobgoblins seriously these days. Only just recently I watched the 70's made-for-TV movie \"Don't Be Afraid of the Dark\", which is basically a quite terrifying and serious-toned film about domestic little goblin monsters, and yet I still couldn't help thinking back about the laugh-inducing potato headed critters dressed in garbage bags that were running amok in \"Troll 2\". Same thing happened to me now. As much as I tried going into \"Inhabited\" with a clear mindset, unconsciously I kept comparing the supposedly creepy and menacing garden fairies with the badly sculptured goblins of Nilbog! Still, even without all the prejudices, \"Inhabited\" is a remotely entertaining albeit unmemorable straight-to-video horror flick. It's a cheesy, soft and politically correct pastiche of family drama and Northern Europe mythology. The annoying and murderous little creatures in this movie aren't your plain average goblins; they are \"The Huldre\": wicked little Norwegian demons that live underground and attempt to chase happy families out of their houses through influencing the youngest children. This overcomes the Russell family as they move into their ramshackle dream house in a remote little town. The cherubic blond daughter of MILF-actress Megan Gallagher starts to behave strangely whenever she hangs out in the cute play house in the back of the garden. She claims her friends are fairies, and even though the sinister handyman also warns for strange occurrences in the past, Gina's parents simply think the girl has troubles adjusting to her new neighborhood. When she keeps rattling about fairies, they arrange an appointment with the acclaimed psychologist Dr. Werner whilst \"The Huldre\" are slowly coming out of their botanical shelter. Not much special to mention here. The pace is acceptable and the attempts to build up suspense are pretty cute. You understand this is a family-friendly horror movie, so no bloody murder sequences are graphically being shown here. Heck, even the cadaver of the family's pet cat is kept off-screen. This is the umpteenth nonsensical horror movie in which Malcolm McDowell pops up and he practically always depicts an unreliable, greedy and self-centered authority figure.","*Minor Spoiler* Inhabited isn't scary, but it is creepy. It is an interesting 'little' story with good acting and great special effects makeup.Basic plot: A little girl blames the strange things going on at her family's new house and accompanying playhouse on her faerie friends.The movie doesn't waste time getting moving, though the ending could have been more involved.I don't recommend this movie to those expecting/wanting hardcore horror, but I do recommend it to those who want a chiller and not necessarily a thriller.","Two things make \"Inhabited (2003)\" worth watching :(1)Mrs. Megan Gallagher (if she is not a splendid Goodliness,then who is?),and we get plentifully her charm;she alone gives this movie an interest unhoped for;(2)the snappy and slender McDowell,who has taken over Pleasence 's function in the B movies. McDowell has a supporting role,but a sufficiently large one.He is an oldish doctor,that seems slippery,but will be a victim.His character is rather solidly woven in the story.I have seen this movie for these two actors,Megan Gallagher and McDowell.I feel the director (Kelly Sandefur) knows exactly Inhabited's value.I guess it is fashionable to show your good taste by mocking movies like this one.The movie is minutely--but also openly and peacefully--predictable.It's a movie made honestly and without pretenses ;it's suspenseful enough,for an average movie,especially towards the ending.The bizarre characters (the well-wisher Peter Looney, James Otis) are not as bizarre as intended,but they strike the right note.Everyone acts badly,but diligently.There are no more than 9 characters (the family,the doctor,a schoolteacher and three bizarre individuals).Most movies are as scary as their score is. Inhabited uses a very UN-frightening music. Inhabited is not scary,nor gory,and it doesn't seem meant to scare anyone.It also never seems to intend to be frightful,moreover:it ignores any such intentions.A family is harassed by some malicious underground horrid Plutonian beings (the Huldre ) .Mrs. Gallagher refuses to knuckle under.Also,she's not very well-behaved.Inhabited (2003) is not a horror,as it is claimed,but a B fairy-tale that bets everything on the grotesque of the malevolent Trolls' appearance. McDowell has a fine line about the 2 Grimms' literature.The plot is very awkward and hollow.If you do need to engulf at least one trashy movie a day,pick this one.You can't pretend it's a bad one.I had my 95 min of Mrs. Megan Gallagher show.","The movie \" Inhabited\" is about a family of four moving into a new house not knowing that dangers are lurking.The daughter befriends the dangerous creatures as they gain her trust. When they do they use it against her. A man who use to live there as a child or a teen, knows about the creatures and try's to warn them. The creatures steel and take shiny objects to make new stuff out of them , mostly weapons.They has a cat and it murderously disappeared. The man that tried to warn the little sister was tricked by them and end up into a Psyciatric ward. She then help them defeat the creatures and destroy the man one. After they do they leave for good with nothing but each other and something happens to the doctor","This isn't a well-executed horror film but given its limited blood, lack of guts and gore and no harsh language that I can recall, it is a pleasant diversion from all that disgusting garbage passed off as horror nowadays. This is a frightfest that kids, lest the troll images should scare them, can watch.The film focuses on a family of four, with the emphasis on the mother (Gallagher) and daughter. The six-year-old girl claims to see fairies in her new playhouse in the backyard. Since the family has just moved to this new house, mother imagines the concept of fairies is her little girls outlet for creativity. But when her daughter's teacher expresses concern about the girl's inability to fit in, she suggests that Gallagher take her to a shrink. Meg is reluctant at first but when the fairy tales get out of hand, she seems to have no other choice but to take the girl to visit nefarious doctor Malcolm McDowell.The film has some flimsy messages, taking stabs at psychology as well as those acceptable lies we all tell are children: Santa Clause, the Easter Bunny and so forth. Meg never loses faith in her little girl and she begins to believe her even when all signs don't point to fairies. But when mysterious things continue to occur, and Tyler (Greg Cipes) gets attacked by an unseen creature, Meg and her husband (Lutes) begin to believe their daughter might not be off her rocker.STORY: $$ (The story was fine at first but the end result reeks of a rushed denouement. When we hit the climax of the story, things become too rushed and overly clichéd, and it seems like the director lost all control on set. There is a scene near the close of the film where Gallagher and Lutes are seated on the sofa discussing the likelihood of their daughter's fairies. I got the impression, given the half-hearted way they delivered their lines, that Meg and Eric both voiced their concern with the insipid dialogue just before they shot the scene but the director shrugged them off and said, \"Just shoot that darn thing.\"ACTING: $$$ (The focus throughout the film rests predominately on Megan Gallagher. She gives a very strong performance as a caring mother, even though the end of the film was rushed and thus so was her acting. But take away the rushed final fifteen minutes and you won't find anything wrong with her performance. She does an exceptional job. Malcolm McDowell is effective as the shrink: masking his nefarious ways under the guise of compassion. Eric Lutes has little to do as the father other than offer support to Gallagher. Looney gives a good performance as the mysterious handyman Megan hires to fix up the house who might know more than he lets on.SEXUALITY: $ (Nothing doing here. This is essentially a family-friendly horror film, if such a thing exists. The only inkling of sexuality in the film comes when Megan invites Dr. McDowell to her home to commune with her little girl. Her for-the-company dress is a bit on the lowcut side, displaying some cleavage, but that's all you'll get out of this decent time-waster.","This run-of-the-mill chiller owes a little bit to \"Troll\" and a whole lot to \"Poltergeist,\" but it lacks the fun of the former and the suspense of the latter.A dream home turns out to be a nightmare for the Russell family, who encounter strange noises and an even stranger handyman shortly after moving in. If that's not enough, their daughter seems to be communicating with ancient monsters in the cottage, their cat dies violently, and the children's toys crumble mysteriously. It seems the house has a tragic history, which the mother investigates and the family finally confronts.The performances are adequate, though the script contains no surprises. Especially notable is Malcolm McDowell, who continues his unfortunate habit of slumming in B-movies, here playing a psychologist who treats the girl but winds up confronting the creatures. The biggest problem with \"Inhabited\" is that, except for gimmicky quick-cuts, we rarely get a good look at the troll-like creatures until the end of the film.This film appears to be geared toward families, and as such it's adequate, inoffensive entertainment. Children are likely to be more entertained than their parents, who will be neither bored nor challenged here.","Okay, this wasn't the greatest horror movie I've ever seen in my life. Despite the fact that it's lower budget, it's a pretty decent movie, though. The monsters are unique and believable. Heck, they're even kind of scary in the scenes where they show them briefly wreaking havoc on this poor family. Although, when you finally do get to see the monsters completely, you really think \"WTF!? those itty bitty things are after them?!\" The only part that really disturbed me is when *sniff* they killed the kitty! Not the kitty, noooooo, why? Seriously though, if you are looking for hardcore violence and gore, this is not the movie for you. Go rent The Hills Have Eyes or something along those lines. If you have small children, I wouldn't recommend watching this with them though; probably would give them nightmares about trolls in their room.","This is a good example of a tv movie. The only qualms i havewould be the IDIOT son/brother and the fact that the synopsis callsthe 'faries'  'trolls' and this kind of confused me. But, overall it is a substantial example of the genre it represents... I would recommend it to anyone who wants to freak their kids outJUST before bedtime.... kidding... kidding! a joke!","Greetings;I never thought I would see the day when I would be so disgusted by A movie that it would be a burden to finish it... I was always a fan of horror movies, B'C and C's included. But in this case it's hard to describe how a movie could fail to qualify for any letters in that scale...\nThe movie is centered on a poorly developed back story, a mix of folklore with an after taste. And to top it up, the performance of the actors is questionable. Horror B movies usually fall in two categories... 1) A gem that was under looked, and under funded 2) So bad it's funny, laugh or your money back. Well this movie falls in between. I wasn't scare, didn't laugh... So I guess if you really need to see it you could but I recommend you don't...","I bought this film from e-bay as part of a lot of about twenty horror flicks, all about a dollar a piece. When watching this, my first impression was that it probably was from the late 80s. Later on I began thinking - the Linkin Park posters on the wall and everything else seemed to hint that I was dealing with a more recent film. Realizing that, the flick became an unbearable torment. The last 3 minutes were the longest in the movie history - the film just refused to end. Is there a genre such as \"horror for children\"? In that case this film is definitely it. If there are parents, perverse enough to want to introduce their offspring to horror, I suggest this would be perfect for kids of about 6-8. The only thing I really liked was Greg Cipes who was much too good an actor for that kind of nostalgic retro bottom part of a drive-in double-bill.","A solid, natural performance from Megan Gallagher makes this movie, which is underwritten but worth viewing for her performance and some interesting camera work and a 'something's not right here' atmosphere. Offbeat performers include Patty McCormack (\"The Bad Seed\")and Malcolm McDowell (\"A Clockwork Orange\"), hamming it up as a shrink. There is nothing more distracting than bad child actors, and this film suffers a blow from what seems to be a miscast little girl (Sofia Vassilieva), but she redeems her performance towards the end of the film. Horror films succeed or fail based on their ability to convince us there is something to be afraid of (whether or not the fear is rational); this film plays it too conservatively and then rushes the ending. Still, not a bad film that combines family dynamics with the horror genre.","*Spoilers herein* Where do I begin with just how silly this movie was? 'Mole sized people, living under the garden attacking residents of a big house'!!! When I first sat down to watch this movie I was unaware that the protagonists where not poltergeists etc but 10 inch high goblins that looked mighty easy to kick hard and far. I carried on watching it because I like to see movies through to the end even awful ones. this movie was terrible. My girlfriend, who went to sleep inside the first ten minutes, apart from finding it a good aid to sleep thought it was hilarious that I had bothered to watch it all.Tiny goblins even in large numbers (the thought is silly I know) are about as scary and menacing as flat cola. They only managed to trip one guy up 'fatally' and kill a cat before they were blown up, The End. I did mention it sucked right?","To be honest, I was hoping for this movie to have a lot more bite than it actually had. Watching it, more often than not I thought I was watching something that was made for television. There's no real gore, no swearing, not even any shocks. Even the way the movie has been photographed reminded me of a made-for-television production. But the biggest problem that the movie has isn't really its low-tech feel, but that for almost all of the movie, NOTHING terrifying or creepy happens. The movie feels like it is spinning its wheels over and over by not delivering anything for its horror-wanting audience. Movie is not a complete loss - towards the end of the movie, we are given several special effect sequences that look very impressive for a movie that had a low budget. Had there been more of these special effects throughout, it's possible the movie might have been livened enough to recommend. But as it is, there's not enough to recommend this movie even for a casual viewing experience.","I work in a video store - so generally I take home everything as it is free. Well this little anti-gem came in today and I thought it looked decent. Goblin like dwellers living in a house and looking all scary like, the premise seemed like it could have been creepy.  But it was handled in every wrong way possible.\nThey focused more on dialog between characters we do not care about.  It follows every cliche in the book(two cat jump out scenes in the first 15 minutes) and even then it does horribly.  Traditionally, if you are going to use the old \"sneak up behind someone\" routine and cue the scary jump music, you do so in a way where the person sneaks up behind them.  In this, they cue the scary music, and the woman jumps, but the guy doing the sneaking is slowly walking into the scene, it was downright hilarious.\nAnd they do the thing that really bugs me a lot..the characters act as if they know it is a horror movie.  In the very beginning, the mother stumbles across a doll with her head off, so after finding out the son didn't do it, she starts panicking like something horridly is the matter.  Doesn't make much sense.  And the fairies themselves just aren't done creepily at all. Just a bunch of evil dead style camera running, quick flashes of their faces, and a lot of skipped frames.  The whole movie has a definite made for tv feel, although not nearly as scary as a made for tv movie.  Rather than trying to make the movie creepy, they went the route of the film being nothing but a slow unravel as to what the things are and people involved in the past..but we don't care."],"review-user":["KolobosRexx","bison257","MarieGabrielle","moviemanic07","lost-in-limbo","claudio_carvalho","FionualaO","Coventry","VonMalcolm","Cristi_Ciopron","Deadzombie1","BloodTheTelepathicDog","WarpedRecord","Kritter1985","slug_queen","papyruss","mart-45","Portable_universe","eddy-49","Wizard-8","Ikari9"],"review-date":["6 April 2004","14 October 2003","24 October 2006","19 November 2004","24 November 2006","16 March 2005","9 April 2004","3 May 2009","4 April 2008","1 September 2006","14 January 2005","6 August 2011","24 October 2007","22 September 2006","26 January 2004","16 January 2004","1 November 2006","10 April 2005","25 May 2004","19 February 2012","12 August 2003"],"review-rating":["8","7","5","6","5","4","8","10","8","1","3","6","1"],"review-title":[" Suprisingly nifty \"family\" horror film!\n"," Better than the average STV\n"," Folie a deus.....\n"," Relatively family-friendly horror\n"," Blame it on the fairies.\n"," Conventional Horror B-Movie of Haunted House\n"," Pretty Basic PG Thriller about evil fairyfolk\n"," Troll 3: Nilbog goes Domestic!\n"," Entertaining 'little' creature feature\n"," A Megan Gallagher flick\n"," Movie Summary\n"," A Family Friendly Horror\n"," Could have been worse, could have been better\n"," Kind of Freaky\n"," Substantial Example of the Genre\n"," Never thought I would see the day...\n"," Inhabited and unwatchable\n"," Bad Seed fans take note\n"," Possibly the least scary movie since jaws 4\n"," As if made for television\n"," Browse past this one\n"]}