{"review-url":["http://www.imdb.com/title/tt0306836/reviews"],"review-text":["I had no idea who Bruce Haack was before seeing this film. I had just seen the MOOG doc, which was alright, the only problem was Moog led a very content life, and the doc was well... content. Haack's story is filled with all the marketable tragedy people buy into these days, but it carries a great deal of heart with it. Though the film doesn't go into the tragic stuff so much, one can sense that Bruce accepted the price of making music his way. There are so many elements that make up his legacy IE. invention of the Peopleodian, where Bruce could actually play music by touching people. It must have been challenging to document Haack's 'scatter-brained' output, which pretty much fell into every musical category imaginable (even rap music), but the director cut the piece together very coherently and managed to capture the spirit. And the cast... what a group of characters Bruce surrounded himself with, but what do you expect from a telepathic guru, tripping with kids, fighting against the music industry. I recommend this film to anyone interested in music history, it's that mainstream, but that important.","I had heard about Bruce Haack in college, when I studied electronic music. He was presented to me at the time in the same vein as Theremin, Paul, and Moog; that is, as an innovator in technology who was also an accomplished musician. But that was all he was, a name in my textbook.Then, a few years ago I was doing some research on synthesizers, and I came across his name again. This time I read about his children's songs, and his Electric Lucifer album. I was intrigued, but couldn't locate any of his work easily, and eventually his name dropped to the bottom of my \"must get\" lists.So, when this was released on DVD, it caught my eye and I found a copy. I already knew a little about Mr. Haack, and this film definitely expanded my knowledge of his life, his work, and to some degree his thoughts on his life and work. There are some interviews with his friends and colleagues, many examples of his work, and even some amazing video footage from \"What's My Line?\" and \"Mister Rogers Neighborhood\".But the film has weak spots. There are many interviews with DJs and modern electronica artists who come off as not very articulate, and they add very little except to say \"Bruce Haack used synthesizers and now I do too\"... kind of a rah-rah chorus section (\"GOOOOOO BRUCE!\").There isn't enough interview time with Esther Nelson, the children's dance instructor with whom Mr. Haack made so much wonderful music. And there is too much time spent with Chris Kachulis, who for some reason wears a wife-beater shirt and looks as if he is homeless.While it seemed to me that most of the important, nexus-type events in Mr. Haack's life were presented, there was scant mention of the alcohol and drug use that was apparently VERY prevalent in his lifestyle. I thought that was a self-censoring mistake... it was a part of his life, a part of him and his music, and should have been presented in an up-front, matter-of-fact manner rather than glossed over. It's even directly relevant to The Electric Lucifer album (the music scene in America at the time, his state of mind when composing and recording, etc.)I would have liked to have seen more of his inventions. I was left feeling that anything he made was lost or buried with him, and I think it would have been cool to have seen them demonstrated with recently shot footage (the video clips from the 60s are less than excellent quality).Also, the flow of the film is uneven; it frequently abandons any kind of linear or chronological format to show a DJ interview and then a TV clip and then back to something else... it's somewhat disjointed, and seems more like a 45 minute TV show with lots of DJ interview filler.Like I said, tho, I DID come away knowing more than when I sat down, so this is by no means a waste of time or money. It's just not quite as entertaining (or quite as informative) as I would have liked.Bo","I was greatly disappointed by the quality of this documentary. The content is poorly produced, very poor quality video and, especially awful audio. There's extremely little about how Bruce Haack produced his music and virtually no examples of direct connection to later and contemporary electronic music. The interviews of people who knew Bruce Haack are ad-hoc mostly inarticulate mumbo-jumbo. Too much yak and not enough Haack. Although I have a serious personal interest in electronic music and have a higher than average attention span, even for slow and/or difficult subject matter, I fell asleep while watching this documentary and had to review it to see the parts I slept through. If you watch this, make sure that you are set up, before viewing, like Alex in A Clockwork Orange. Bruce Haack deserves much better than this. Shame on the producer and director.","I want to start my review by thanking the makers of this documentary, it is obviously a labor of love and I think they did a pretty good job of putting together an enjoyable documentary about a person who has had so such little info available about him. It definitely has a fan worship feel about it, which is a good thing.I had heard of Bruce Haack but didn't know much about him, and I found the start of this documentary frustrating because I could hear other musicians talk about him, but Bruce Haack himself was kept way too far off in the distance. I wanted to see this Bruce Haack guy!! I felt as though the makers assumed I already knew him as well as these musicians on the screen which I didn't, so I felt a bit left in the dark.When Bruce was finally shown in action it was great and gave me a taste of who Bruce Haack was, but it was only a taste. We got treated to more musicians and I felt as though I was being told \"Look - all these cool musicians are into him, so he must be cool!\" I didn't really care much for the musician's commentary on Bruce.I wanted to see Bruce, as a person. You know, the important stuff - more interviews with people who worked with him or knew him. More about his life, and yes, his use of drugs and other issues. I would of liked to know so much more about his \"Hackula\" project. I wanted to get inside his mind. Even if they did this via some \"voice of god\" commentary and photos it would of been OK.The animations were good, but again I felt these were used as filler, they didn't really do anything other than allow me to hear his music and see some imagery based on the Dimension 5 records. I did think it was clever and creative, but again... I wanted to learn more about Bruce! Maybe Bruce Haack was this elusive in real life?Anyway - in the end I enjoyed this documentary and felt a sort of sadness that such amazing pioneers and geniuses such as Mr. Haack get forgotten as the march of time stamps ever onwards. I am glad that this film is around to educate people about Bruce Haack, even with its flaws.","First of all, kudos to the director for making a documentary about Bruce Haack. I doubt anyone else would have due to Haack's obscurity. However, that also puts a lot of obligation on the shoulders of the director, since his work will probably be one of the sole reference works about Haack in the future. Unfortunately I think there's problems in that aspect, but more on that later.The documentary starts off well by introducing Haack with some basic background information. There's some good insights into Haack's personality as a musician, with some interesting anecdotes and facts. I was under the impression that Haack eventually ended up dropping out of Julliard, so I thought it was odd that there was no mention of this. Furthermore, there was no mention of the fact that he had a degree psychology, which I think is important to his approach to music. From the relatively good start, the movies goes into a somewhat confusing segment which features a group of people who had known Haack when they were kids. I never really came to understand their relationship to Haack, and I think the director used their commentaries to little effect. This is also a problem in the various interviews with modern day DJs and electronic musicians. Few of them seemed to be particularly inspired or influenced by him, and merely seemed to be interested in his music because of his status as an obscure pioneer of the genre. As such, they added very little to the documentary. I'm not putting down the artists for their comments, but merely the way their commentary had been integrated into the documentary as such.There is little information about Haack's methods of composition as an electronic musician. His use of vocoders, which I personally think is one of Haack's principle distinctions as a pioneer, is not mentioned once. I was also disappointed that no real attempts were made to draw any parallels between Haack's lyrics and his life. Especially since I have always found his lyrical themes and concepts (religion, powerlove, computerization of mankind etc) to be particularly unique. Generally, there should have been made a better distinction between his work as a composer of children's music and his more serious outputs. There are huge differences. Ideally, the director should have gone through and properly described (sort of like how he did with \"Haackula,\" but more thoroughly) some of Haack's most important albums. So, all in all, this documentary is not that bad, but it definitely has its share of problems. Frankly, the angle of trying to make Haack into the \"Godfather of Techno\" does not really work. It's a shame, because this is probably the only time someone will do a serious attempt of shedding some light on the otherwise enigmatic and obscure Bruce Haack.","This is a fascinating documentary. It's nice to discover a long-forgotten cache of unique music. In this case it comes in the form of a DVD about Bruce Haack. In the ten years since I began seeking out interesting nuggets of electronic music, I had accepted the notion that the rise of Kraftwerk marked the beginning of electronically produced music as we know it. Clearly, I was wrong. Bruce Haack was a man who probably came from the future. My only real complaint has to do with the sound quality on the DVD I watched; It's terrible!! The entire thing is muddy and distorted to a point far below professional standards. My copy came from Netflix and I'm wondering if they all sound like that, including the master(s)? I know this was the filmmakers first ever movie, but how could you ever settle for that sound quality? In all fairness, the distorted low-fi sound of the DVD did well to match some of the recordings that inspired it. However, after hearing a copy of 'This Old Man,' it's clear that the songs featured in the documentary from this CD are completely distorted on the DVD. Oh well . . . this flick is still a mind-blower."],"review-user":["blindinglight","snowboarderbo","golem_number1","bagzi","Apogee_","janhammer"],"review-date":["28 September 2005","21 May 2005","3 April 2006","15 December 2005","29 April 2006","8 August 2006"],"review-rating":["10","6","2","7","5"],"review-title":[" Timeless story\n"," not great, but better than nothing\n"," Producer and director should be ashamed of themselves for such a poorly produced documentary.\n"," Bruce Haak, musician, composer, avant-guardist, genius\n"," Not that bad, but suffers from overall mistakes and lack of direction.\n"," Fascinating. How's the sound quality on your copy?\n"]}