{"review-url":["http://www.imdb.com/title/tt0366518/reviews"],"review-text":["I thoroughly enjoyed this movie and to date, this year, it is one of my favorites. The story was excellent although the twist at the end was far too predictable and I knew what would happen far too early. Usually when this happens the film is spoiled for me (like \"The Others\") but even knowing the outcome I still enjoyed it right up to the end. Looking through the comments of others many people were impressed with the performance from Kelly Overton (Eve), I'm afraid I was not. Her performance seemed to be the weak part of the film to me, in contrast to the amazing performance (or characterization) by James Haven (Don Wake) ... I hope we see more of him. What a great little film, highly recommended to all!","Saw the film at the Hollywood Film Festival in Oct '04 . Mark Robertson took a huge chance writing an extremely difficult part for his first film and it paid off big in his casting of Kelly Overton. I had a strong feeling she came from the theater so I looked her up here and ...surprise, I'm right. More Hollywood actors should follow her lead, give up the expensive acting classes and get back to theater because only with that kind of training will you be prepared for a ride like this. For all the great things I can say about the film and the director (and there are many) I just can't stop talking to people about Kelly Overton's masterful performance. We'll be seeing a LOT MORE of her work, no doubt. Congratulations to Mark and Kelly on a daring film. Get it out in the theaters so I can bring all the people I made want to see the film ASAP!","When i saw this movie the first thing that jumped at me was the acting of Kelly Overton a young (and op and coming star) actress that i saw for the first time totally blew me away.. she is amazing on screen and I'm really looking forward to see what the future brings her....The movie it self was good in the sense that it let Kelly Overton do her stuff and take the wiever for a ride... not much new tho i had the feeling that i had seen it all before.. but a good experience :) I would recommend this movie... if only to see Kelly Overton.. this stage actor takes the screen by storm.. i give this movie a vote of 7... 5 for the acting performance and 2 for the rest of the movie.And on a last note.. sorry about my bad English.. if this is gibberish for you :P plz ignore me...","I saw the film yesterday and really enjoyed it.Although there were several clues which I could realize after second time watching ,I was not able to awake the Dow-Dawn case. Maybe this was my carelessness.The subconsciousness of a woman was became concrete with personalization.'Let me go out'the key sentence of the film.Let me go out from deep deep inside of your brain and we will both be free.A discrete film that forcing the limits of human conscious and brain.Anybody who have seen the 'Machinist' would realize the similarities with breaking dawn.A man that could not escape from his conscience (again a psychological and an abstract concept)meets it in an human body.And he will just be free of accepting and realizing there is no way of escape.Also I want to mention about the performances of 'breking dawn's stuffs.In spite of having not many experiences, from actors and actresses to director all exhibited separately reasonable performance that have created a synergy which would increase the quality of the movie","This was a surprisingly very good movie, and an interesting idea.. However, it was just a little bit disappointing in that the 'Twist' was a little too predictable and just a bit too early on in the movie. Whilst watching, it started to get a little bizarre and confusing to the point that, the only reasonable outcome possible was the inevitable plot twist, but it certainly did not ruin this movies flow. There were superb performances, there was never a dull boring moment, so totally well worth watching this one. It kept me interested right up until the end, and for me there isn't many movies that can do that these days. I highly recommend people watch this terrific little movie.","The medical student Eve (Kelly Overton) is assigned to care of Don Wake (James Haven), a catatonic patient of a psychiatric Cape State Hospital who was found covered with blood near his dead mother. She must succeed in disclosing the truth about the murder of his mother and improve his conditions to conclude her medical course. She secretly changes his medications and he starts talking to her about a theory of conspiracy leaded by the mysterious Malachi. Eve becomes obsessed and paranoid with her patient while Don dominates her mind deeper and deeper. When she breaks with Don out of the mental institution, she finally discloses the truth about the crime.\"Breaking Dawn\" is reasonable and too long, since the twist is very predictable. In spite of having good performances of Kelly Overton and James Haven, the screenplay is very weak and does not work well. My vote is five.Title (Brazil): \"À Beira do Abismo\" (\"Near to the Abyss\")","This movie is a mystery. It's not scary, it's spooky. You'll probably jump at some points and for some of it you'll be scratching your head to figure it out. It unfolds its mystery through the main character Eve and her psychotic college project at an insane asylum, Don. He needs her to search for some clues to vindicate himself from murdering his mother, and once Eve agrees to help him, she completely opens up pandora's box and unleashes some very strange things, including Malachi. I won't go into Malachi, but I thought the way that played out was complete genius. I know movie buffs won't regard this movie with the same prestige as other classics because it doesn't have anyone very famous in it (Angelina Jolie's brother was excellent, but maybe he should have asked his sister to show her face just so this movie could get some recognition) but I do think the way the Malachi ending works is something to talk about. I've recommended this to my friends, definitely worth the purchase or rental price.","Whenever I see comments here along the lines \"the movie is crap, but at least so-and-so was a hot chick / guy\", whenever this happens I know: a certain kind of people doesn't like it, and that is exactly the kind of people I want to dislike \"my\" movies.So this one has a decent script and the end is NOT disappointing - it is, indeed, a not quite so fresh twist, but it was far more plausible than anything M. Night Shyamalan has dreamt up so far, and that DOES include the highly overrated \"Sixth Sense\".On the other hand: the ending, though presenting a good conclusion for the plot, is overly optimistic and feel-good that it gets cheesy (1 star reduced for that fact alone).But the 85 or so minutes up front work remarkably well, and script and directing give the viewer a more than fair chance to deduce the final twist well in advance. Besides that, the acting is decent, the low budget doesn't show at all and the whole thing is very aptly written and directed. When I learned how young the writer / director is, and that this was his first film, I was truly impressed.I hope to see more of his work.P.S: Kelly Overton acted well, but she really isn't that hot. Sorry.","I caught this movie on local t.v. at about 4:30 a.m. I didn't have expectations for it but after the opening credits I knew I was into something good.There are situations that are left for your interpretation to \"find out\" what really happened so your attention is a key factor.The whole psychological thriller situation deals a lot with character development and the way things are executed by the main character.Your sub-conscience also plays an important part because through a series of events and dialogs you will be able to make a correct interpretation and generate an opinion.The technical aspects are very good. Really good in fact. Kelly Overtone is extremely sexy and she's candy for the eye although she's most of the time in her white clothes.The fear factor is almost inexistent but there's plenty of mystery and tension to dig from.I would recommend it for those who enjoy supernatural and psychological thrillers.","The film was at best a mish-mash of ideas. First, it tried to add an element of horror, by showing a man in a black robe called Malacai, which never materialized. The ending really didn't make sense, and the acting was uneven. While the head doctor and the mental patient were good, Kelly Overton, the lead actress was pretty weak. She did not talk or act in the least like a medical doctor, and so this automatically gives away the plot of the movie: she's not the doctor, she's the mental patient! (Like we haven't seen *that* before.) The reason for institutionalization and the way she is \"cured\" are stupid and not believable (even for a movie). I mean if you're tired on a Friday and want a mildly entertaining film, this might fit the bill. Just be prepared to be slightly disappointed.","The unknown actress Kelly Overton plays a young doctor who is starting her job with psychiatry in a proper hospital for mental sick people. Once the young physician starts talking to a problematic patient with a visible mental sickness, strange things start happening to her-- that's a cliché line, I know. She hears voices in her room when she's by herself, weird people come by in her apartment and one mysterious voice calls her on the intercom. The problematic patience tells her to look around and be careful about something he never specifies, which catenate to an intriguing plot. Several scenes are tense and extremely entertaining due to the good directing and acting. Kelly Overton varies from good to bad, depending on what the scene is requesting from her. In the end we have a surprise-- which isn't very understandable-- and a feel good ending, mainly because of the photography direction and the beautiful last song. Considering the subject chosen and how original it was back when released, this film deserves nothing less than a 7. Give it a chance.","These days, writers, directors and producers are relying more and more on the \"surprise\" ending. The old art of bringing a movie to closure, taking all of the information we have learned through out the movie and bringing it to a nice complete ending, has been lost. Now what we have is a movie that, no matter how complex, detailed, or frivolous, can be wrapped up in 5 minutes. It was all in his/her head. That explanation is the director's safety net. If all else fails, or if the writing wasn't that good, or if we ran out of money to complete the movie, we can always say \"it was all in his/her head\" and end the movie that way. The audience will buy it because, well, none of us are psychologists, and none of us are suffering from schizophrenia (not that we know about) so we take the story and believe it. After all, the mind is a powerful thing. Some movies have pulled it off. But those movies are the reason why we are getting more and more of these crap endings. Every director/writer now thinks they can pull it off because, well, Fight Club did it and it made a lot of money. So we get movies like The Machinist, Secret Window, Identity, and this movie (just to name a few).","I watched this movie on Amazon. I had avoided it because the title was similar to a series (Twilight) for which I had no interest. The movie was well written, directed, and performed. It was worth the time invested to watch it. I won't include a spoiler because one needs to watch this film without any warnings. The movie shows the treatment of a young man being treated by a medical student at a state hospital. He hasn't responded to anyone for years. As the student brings the patient out of his withdrawn state, she begins to learn about herself as he pulls her into his perceived world. The ending is well crafted and actually makes the movie great.","Breaking Dawn starts in a Californian college as Professor Simon (associate producer Joe Morton) tells his students that they have to perform an intensive six week study of a mental patient in Cape State Hospital as a crucial part of their education, fail & they will never become qualified Doctors. A bright, young, attractive & intelligent student named Eve (Kelly Overton) is given a particularly difficult patient to study. His name is Don Wake (James Haven) & is a convicted killer, he was found covered in blood besides the dead body of a woman (Diane Verona) & her young daughter (Jenette McCurdy). At first Don won't even look at Eve much less talk to her, but like the trooper she is Eve persists in trying to figure him out. Eventually Don begins to talk but what he says frightens Eve, he says that someone is watching her & mentions the name Malachay. Eve then begins to see a dark shadowy figure at her every turn, as Don churns out the conspiracy theories & bizarre statements Eve slowly begins to lose her mind as the line between fantasy & reality becomes more & more blurred. Is there something more to the supposed nonsense that Don talks other than being the insane ravings of a psychiatric patient...?Written & directed by Mark Edwin Robinson I have nothing but negative feelings towards Breaking Dawn. Now, we all like a good twist ending, the sort of ending which catches us unawares, surprises us, works well with the rest of the film & stays in our memory like the cool twist endings to The Sixth Sense (1999) & Fight Club (1999) to name just two good examples & to a lesser extent the endings to films such as Scream (1996) where the identity of the killer comes a nice surprise & isn't that obvious. Then, of course, there are films whose endings spoil everything that has gone before & as an example lets take, oh I don't know lets say Breaking Dawn because I have never seen such an awful ending to a film, never. Breaking Dawn starts out as a decent psychological horror thriller with spooky things starting to happen to Eve, it's not the most action packed film ever by any stretch of the imagination but it holds ones interest, it's not the most absorbing film ever either but it is more than watchable & it's not that bad a film until the twist ending, I have to keep mentioning it because everything else up to that point (which was OK to be fair to it) suddenly becomes irrelevant. I am sure there are people out there who think they have this muddled mess of an ending figured out down to the last detail, all I can say is that no one will be able to explain this thing in a satisfactory way to me & as far as I'm concerned it doesn't make a bit of sense & never will. Breaking Dawn is crap & it's a waste of time watching it to be rewarded with the lamest ending in film history, it's as simple & straight forward as that.Director Robinson doesn't half make a mess of what could have been a decent thriller, maybe he thought what he had shot would play out OK or maybe it was ruined in the editing room but I'd imagine it was more likely down to a rubbish script as he tries to tie all the absurdities together within the space of a few muddled minutes & give us all a happier than happy final shot. He builds the tension quite well during the first 80 odd minutes but it's all for nought at the end of the day.Technically Breaking Dawn is fine & it is generally well made throughout. The acting is pretty good, Overton is nice & easy on the eyes & puts in a decent performance. Was it just me or did the guy who played Don look like John Morghen star of such Italian sleaze classics as Cannibal Apocalypse (1980), City of the Living Dead (1980), The House on the Edge of the Park (1980), Cannibal Ferox (1981), Stagefright (1987) & The Church (1989)? OK, maybe it was just me...Breaking Dawn is rubbish, I hated it all because of the final few minutes. Don't get me wrong it wasn't exactly getting me excited up to that point but it was OK. Definitely one to avoid as far as I'm concerned although it seems to have it's fair share of positive comments on the IMDb...","Let me first start out by saying 1 out of 10 is too good for this movie. It's unfortunate that IMDb doesn't have tenths of a star... I watched this abortion of a movie in the middle of the night due to insomnia, and it was absolute garbage. The plot was horrible. The acting was horrible. The movie was utterly boring. \"malachi\" looked like the Shadow with Alec Baldwin (The Shadow is infinitely better than this as well) The character Eve was so undeveloped and 2 dimensional she didn't even grab my attention. I didn't even know her name was Eve. Don was interesting when he kept his mouth shut. The \"TWIST\" (if you can call it that) was laughable and pathetic. When it came, the movie had done such a horrid job of building suspense or attachment to any character that I simply thought \"Who gives a S***.\" The only thing that made me even lift an eyebrow about this movie was the fact the med. teacher was Dyson in Terminator 2 (Also a movie that was light years ahead of this motion picture massacre.) Anyone who was involved in this movie should be ashamed of themselves for wasting 90 minutes of countless people's time. It's no wonder no actor from this movie ever had a fruitful career. In summary.... This movie is so bad, I feel dirty and need a shower. Worst movie in history, Gigli was better, Prom Night (the remake) was better and dare I say it Saw IV was better...........","I cant explain what a load of rubbish this film is. Like really i cant. its just that bad.plot=crap acting=crap budget=so low its laughableJesus, its like the only good thing in this movie is the fact the main character was fairly hot.The only people i feel, that think this movie is good are the ones who took part in the film. I'm sure they are not the ones who funded it because there was no money put into this. (HAHAhaha to the bit where there heads get shaved)This movie has already wasted too much of my life so i am not going to waste anymore time writing my review for it.","WARNING: SPOILERS It was a good movie. Tension builds up nicely. Ending kills it.-1 star for horrible ending. Seriously, half of the stuff in the movie could've been cut out and that ending would've made sense. I have a feeling the ending was rushed. Spoiler: I felt from the beginning the movie was building up to a \"the-head-guy-was-evil\" type ending. A lot of the buildup just doesn't make sense without it actually being real.-1 star for the lead actress' acting. All other acting was spot on. All she did was look good through the movie. Her acting wasn't just wasn't believable."],"review-user":["Fizzwizz","kublakhanpics","Fed7haS","dont_panic06","nibblitz","claudio_carvalho","palovalde009","adiradathel","insomniac_rod","innerboyka","raulfaust","tywaters3000","zapepper","poolandrews","MasterAmongPuppets","gelooo69","zamininc0"],"review-date":["6 April 2005","19 October 2004","10 February 2005","30 April 2005","23 February 2005","28 December 2006","12 October 2007","3 January 2007","3 January 2010","6 August 2013","6 August 2012","7 May 2006","2 August 2016","27 February 2006","29 September 2008","20 March 2005","30 December 2013"],"review-rating":["7","9","7","8","7","5","9","7","5","7","1","10","1","1","1","8"],"review-title":[" Highly recommended\n"," Kelly Overton - Whoa!\n"," Interesting movie... and a surprise performance!!\n"," synergy\n"," Surprisingly Very Good, but....\n"," Predictable Twist\n"," Spooky and clever\n"," A pleasant surprise\n"," Interesting enough.\n"," Fair movie... not really horror, just a trick ending really\n"," Breaking up\n"," what is a movie\n"," Well done\n"," Terrible purely because of the awful twist ending.\n"," Probably the worst movie ever created.\n"," definition of rubbish\n"," Spoilers\n"]}