{"review-url":["http://www.imdb.com/title/tt0350022/reviews"],"review-text":["So tonight my friends and I rented two amazing movies both starring the sensational Gary Busey, this movie and the wonderful Gingerdead Man and I just have to say this movie is not only hilarious, but beautiful as well. You really knew where the characters were coming from and could relate. I mean, when haven't any of us been in a situation like this. The movie was terrificly written, each line added a new twist to the film. Don't even get me started on the special effects...alright, i will get started. The only word that comes to mind is astounding. I've seen a lot of family movies in my life, but this one just takes the cake. I also really appreciated the underlying biblical references, although i thought they could have been more subtle. The ending was also great and I definitely hope they will do the right thing and make at least one sequel. This is up there not only as one of my favorite Gary Busey movies (Along with Point Break, Rookie of the Year, and of course, The Gingerdead Man), but one of my favorite movies ever. This movie touched my heart and I know if you watch it, it will change your life like it did mind. After watching this, i will never look at the world the same way again.","Very seldom do I or my family go to the movies but we do rent a lot of movies once they are released to the general public.This movie will never be one of the all time greats. However, it is well done and very cute. I would have never thought of Gary Busey in this move, but the character he plays fits right in with the villain type roles he is usually in.I think the entire point of this move is \"you reap what you sow.\" In that regard it promotes good moral values and enforces the saying \"do unto others what you would have them do unto you.\"My wife and I, as well as two of our grandchildren enjoyed this movie and didn't feel it was a waste of money to rent it.","If you ever plan on renting (hopefully not buying) this movie, think again. It was as if Gary Busey had a gun to his head and was forced to act or die. I only wonder if Busey was arrested for something and was sentenced to play in this movie because I just don't see the guy that acted so much better with Keanu Reeves in Point Break play in this disaster. It was a feel-good movie, but there are thousands of other feel-good movies that make you laugh without wanting you to get your money back.The only reason I would ever tell someone to rent this movie is to watch this movie is to see Gary Busey jump up and down like a monkey. If you want a good funny movie, pass up Quigley and go rent Spongebob or something.","This is a really bad waste of your time. I would probably rather go watch some documentary than this; it's really that bad.The acting is really terrible, and you can tell that the producers had a low budget because of the terrible picture quality. It's by far on the low end of the scale; don't waste your money on it.I have a really hard time believing the person who made this movie that it would fare well. I had to watch it with the kids when my mother rented it because she thought it would be good for the kids. Even the kids (3, 4, 6, and 8) all thought it was pretty boring.I agree with the other commenter, Spongebob would be a lot better to watch than this.Overall: Just don't watch it. Don't. Don't.","While the dog was cute, the film was not. It wasn't the premise, or the theme that was a problem. The premise had great possibilities for humor and pathos both. The theme is a worthy one. Helping other people is more important than amassing a fortune.Sadly, the adorable dog, the unique premise, and the theme were undercut by poor acting, stilted dialogue, and amateurish filming.Even my youngest child who will sit through almost anything gave up before we had gotten halfway through. How many times can that dog run up and down the same hallway? I can't spoil it for you, as I never saw the end. It just was not worth watching all the way to the end.","My wife rented this movie and then conveniently never got to see it. If I ever want to torture her I will make her watch this movie. I've watched many movies with my 4 year old and I can take almost anything. Barney is refreshing after a shot of Quigley. The plot, dialog, cinematography, & acting were one step above (or equal to) a cheap porn film. I feel cheated out of $3.69 that we paid to rent it and then 90 minutes of my life I will never get back. I will say my 4 year old liked it, luckily it was a rental we had to return right away.I just hope that the younger actor's careers are not ruined from being in this movie.","Archie (Gary Busey) is a ruthless businessman who gets what he wants, hook or by crook. Having no personal life, he concentrates on \"getting\" way ahead of the competition. Curiously, he also has a strong dislike for dogs. One day, as he is driving, he spots a dog in the road and swerves to miss the canine. Both of them, however, end up dead. Now Archie appears before the pearly gates, where the angels see no reason whatsoever to let Archie in. But Sweeney (Oz Perkins) suggests a possible route to redemption. If they send Archie back to earth as the little dog, and he can make two huge gestures of goodwill, he can enter heaven. It's agreed. Archie returns to earth as a beautiful white Pomeranian named Quigley, with Sweeney along as a guide. The former businessman is ordered to set things right for employees at his firm and to make amends with his long-forgotten brother, Woodward (Christopher Atkins) and his family, a wife and two kids. But, how can he do this, all as a tiny dog? We'll see! Actually, this family-friendly film has some very nice messages and a truly great cast. Busey is too funny as the canine, for we see him talking to Sweeney as himself, only in a \"begging\" pose. Cute. Atkins, Perkins, and all of the rest are very, very fine as well. The production has also been made with great care, for it has lovely camera work, costumes, sets and scenery. The main thing it lacks is a sure-fire script and good direction/editing. For example, most kids will be lost in the first half of the film, for Archie's trip back to his former firm is a bit fuzzy. Why is he looking for a \"disc\" and how can he make amends with his former employees. Once, however, the story goes in the direction of the family, the pace picks up and children will be entertained. Therefore, it is too bad that there can't be a few \"teaser\" scenes, in the beginning, about the family and have the corporate scenes worked into the middle. Nevertheless, if you love dogs, family films, and movies with good morality lessons, pick up Quigley. In truth, few folks will not adore this darling little dog's abundant talents and tricks.","This movie comes down like a square peg in a square hole. A poorly made peg. A peg so cheap it couldn't even be produced in a sweatshop assembly line in Chinatown, Mexico. In fact, when you try to press the peg into the hole for which it is obviously designed, it crumbles into sticky, disgusting pieces that smell like rotting fruit and won't wash off. Quigly is such a peg.This movie is so mind-bendingly awful, it couldn't have even been created. A movie like this must have been the result of some accident of nature; some freakish entity that congealed in the corner of a dank office somewhere and festered and grew until it was too big and terrifying to look at. Only science would be interested in such a thing; anyone not bent on studying it would exhume it from this world.What it comes down to is this: if you're the kind to enjoy first year violin recitals, racism, or Coke Zero, it might just be your birthday.","What a waste of precious time! My 5-year-old daughter brought this home from my mother's house, and we watched it as a family. None of us liked it. This wretched little film, rife with glaring inconsistencies, overt Christian themes and horrible film quality, is not worth watching even on a dare. It felt a bit like a bad high-school drama class attempt at film making. How sad to see talented actors (Chris Atkins, Gary Busey, and company) flounder their way through this trite and insipid storyline. The only good thing I can say about this movie is that the dog is cute. The film can should have gone straight to the pound. Avoid this film - your time is better spent watching paint dry.","This movie actually deserves less than a 1. Talented actors went and played roles that could've cost them their career, if this movie hadn't sucked so bad that people didn't watch it. I could even stomach the bad writing and horrible film quality for less than half of the 90 minute runtime. It Wasn't worth the $5.00 at wal-mart for a children's movie.. Don't SEE THIS MOVIE! ITS NOT WORTH YOUR TIME!! WATCH SOMETHING ELSE INSTEAD!! Im having to make up extra lines to fill the 10 line minimum because this movie was so bad, its not worth it to point out flaws that you can see from the start. this Movie was so horrible, I wouldn't want to watch it if i was given a million dollars. this movie was absolutely terrible, and definitely not worth your money..","Seeing Gary Busey in a G rated film was a first and a nice one at that. I don't know much about the director, but he obviously knows how to spend a few dollars and get the most out of them. Where did Jillian Clare come from? My kids love her! The only thing I remember Christopher Atkins doing was Blue Lagoon. Disney needs to see this film and put him to work. The wife thinks he is very cute. I liked what he did with his character. He seemed so real. What we liked most was the message this film sends out. Greed sucks and faith, love and family wins! This is the first low-budget DVD we've bought that had so much stuff on it. The producers made this one for kids and the kids loved it. They liked the music and all the extras on the DVD. The director probably won't stick to family movies, but I hope he does - cause he really knows how to get the most out of kids, animals and stars like Gary Busey. The dog was great and seeing Gary Busey act like a dog was even funnier. There wasn't much we didn't like about this one. It hard to find a family film without all the crude humor, and Quigley was a delightful surprise.","This is by far one of the greatest movies ever created. The story by itself is outstanding and goes above and beyond any other movie I have seen to this date. And it isn't just the story which proves that this movie is one of the best but also the acting, watching Gary Busey pretend to be a dog and walk on all fours is outstanding, it adds so much character that words could never do. The fact that this movie doesn't have to tell you what is going on constantly is what makes it one of the best because it treats its audience like adults. I know that this movie will go down as one of the best classics ever created.","My entire family enjoyed this film, including 2 small children. Great values without sex, violence, drugs, nudity, or profanity. Also no zillion dollar special effects were added to try to misdirect viewers from a poorly written storyline. A simple little family fun movie. We especially like the songs in the movie. But we only got to hear a portion of the songs ... Mostly during the end credits... Would love to buy a sound track CD from this movie. This is my 4th Bill Hillman movie and they all have the same guidelines as mentioned above. With all the movies out there that you don't want your kids to watch, this Hillman fella has a no risk rating. We love his movies.","This movie should go down in the annals of fiefdom as one of the worst of all time. I will stop short of saying it's the worst movie ever, only because I have yet to see every movie ever made. I cannot make such lofty claims until then. The story is stale, the acting is horrible, at best, the \"special\" effects are no more than a couple of lbs. of dry ice and a fan. Somebody must have been related to someone to get this movie made. Mr. Busey mailed this one in! The dog is well trained and cute, making it the only redeeming quality in this never-should-have-made-it movie. Two hours and $3 of my life I will never get back.","I was looking to buy the original Benji movie on DVD, and this movie was included with it. I chose to watch this movie basically because I like pomeranians.No it's not Oscar material and no it doesn't have state of the art special effects, but I also don't think it's as bad as some people have made it out to be. It was an okay movie. They did what they could with the money they had.Big budgets and high quality special effects don't always equal a good movie. Seems like most big budget movies that come out nowadays are either all about the special effects (aka: weak storyline), low brow humor, or it's yet another twisted horror movie.So this movie was nice in the sense that it wasn't the usual one of the above.","I had to watch this movie with my 5-year-old. He didn't laugh once during the entire movie...and he loves dogs and will laugh at nearly anything! This movie was horrible from all aspects: poor script (even accounting for a children's G-rated movie), poor production (the jittery camera shots made me feel nauseous for the first ten minutes), poor acting (perhaps they were \"directed\" to act cartoonish), and even poor sound quality (there are parts where the audio level seems fine, then you can't hear what the next actor is saying). I'm willing to put up with quite a lot when it comes to watching a child's movie, but this was worse than having a stick in my eye. I also didn't like being battered over the head with the god-heaven-belief thing. In all, it was the biggest waste of 90 minutes in my life...and I've done some serious time-wasting in my day!","I couldn't help but uttering a sigh when I saw Quigley. Especially the beginning credits. It showed a poorly drawn dog in different environments. Not the best beginning credits. The text effects were so BORING and didn't match Quigley at all.Quigley had no lighting effects what so ever. The background was OBVIOUSLY blue-screened. The makers didn't even BOTHER to add good effects. (Especially when Archie is in heaven. I mean LOOK at those clouds.) Through all of this, I will give Quigley two stars. One for the Special effects and one for the plot.2/10, */****.","How can anyone hate a movie with Gary Busey, an adorable little dog, cute kids, a beautiful family who love each other and God, and they get by on trust in God? It's a beautiful story! So, low budget or not, they did an excellent job at making it! The only thing I didn't like about it was the guards and how over-the-top dumb they were! They could have been made intelligent and made for a good chase scene for drama effect or something like that. And the music was nice, but it kept repeating throughout the movie. It would have been nice to have more really good songs. Gary Busey's acting is great, as is everyone else's. Jillian Clare is wonderful! And so is her on-screen brother! It is simply a great movie, and on the extras, on the interview with Gary Busey, I see exactly why he wanted this movie made,and that is an extremely special circumstance! What an amazing guy!","I show this movie at a nursing home I work at almost every night because they like dogs.At first I thought it was very awful. I love this this movie because it is pretty awful but in a good way.My favorite thing about this movie is seeing Gary Busey's goofy face. He's just so goofy looking in this movie. The camera shakes a little. The plot and story is good. If only they could of made it better. Maybe they should of put more time and money in it.Oh and I like the song in the beginning. It has many good qualities and a lot of things that could be worked on."],"review-user":["lunchbox42288","ldlacyguam","Gornprose","fareezle","halinja","netpup","inkblot11","po-gai","falwest","orangemankb4","survayguy2","farismatthew-53074","calicam-1","corkandtee","dartween73","Amy-60","dinoqueen","djk-930-38279","peterhunt58"],"review-date":["19 February 2006","24 July 2005","11 July 2005","4 November 2006","4 December 2005","7 January 2006","12 January 2010","28 January 2008","30 July 2007","2 January 2011","3 August 2005","2 November 2017","1 January 2006","13 February 2006","26 August 2007","15 April 2007","28 January 2007","14 October 2013","28 March 2013"],"review-rating":["6","1","1","2","1","6","1","1","1","10","8","8","1","5","1","10","5"],"review-title":[" Honestly the single greatest piece of cinema ever.\n"," Very cute and funny.\n"," One of the corniest movies that you will ever see\n"," Terrible movie, never watch it.\n"," Poor quality film-making\n"," The worst movie I have ever seen\n"," This film has some beautiful messages, a great cast and a darling, darling dog but is not perfect, by any means\n"," Worst. Ever.\n"," Complete Stinker\n"," Worst Movie Ever.\n"," Where has Jillian Clare and Christopher Atkins been?\n"," An unexpected classic\n"," Charming Movie\n"," Avoid at all costs!\n"," Not as bad as people make it out to be\n"," One of the worst movies I've ever seen\n"," Poorly Made\n"," I love this movie!\n"," not as bad as some of the reviews say.\n"]}