{"review-url":["http://www.imdb.com/title/tt0367623/reviews"],"review-text":["I just watched National Lampoon's Christmas Vacation 2 on DVD, hoping to see something at least close to the original, great holiday comedy, 'Christmas Vacation'. I saw nothing of the kind. You can tell right from the start that this movie just wasn't going to measure up. It's too bad it has a title that links it to the original Christmas Vacation. It's really kind of sad. The film can't stand on it's own merits. I think too many people will view this film on the strength of the title and it does not come close to that level of comedy. Other than the title, there is very little connecting the movie to the original 'Christmas Vacation' and even less of a connection to Christmas at all. The comedy is very simplistic and the plot poor. Children might find some humor here but most adults would only get a chuckle here and there. This movie is a flop. Don't waste your time with it.","I am a fan of a few of the Vacation films, but when a movie franchise goes from the big screen to the TV screen, you know it's out of steam. Made for TV National Lampoon films do not do well on TV. This movie is another reason.I think a lot of us were excited when this was coming out, but we also had to face the reality...it's a TV movie. Randy Quaid is fine as Cousin Eddie, but is better in a supporting role than the lead. Dana Barron sets history as the first actor to reprise her role as one of the Griswold kids. She is just as pretty, but it doesn't help a thin script. Why was this movie even made? It was probably because NBC recently picked up another few years of presenting X-mas Vacation. There is nothing wrong with the acting. It's all in the script. It's just not that funny. People need to think before they write stuff like this. It is one Christmas movie I do not recommend.","Why oh why did they have to try and make a sequel to one of the greatest Christmas movies of all time. The movie is a train wreck on every level and should have never been made. Randy Quaid's portrayal of cousin Eddie is an over the top caricature of his previous outings as cousin Eddie. Also, the Eddie character is not interesting enough to carry an entire movie. Even \"eye candy\" Sung Hi Lee could not redeem this hunk of holiday crap. Please do not waste your time on this move, just watch the original again.","This movie was a disaster. Why do movie producers insist on tarnishing the name of something that was truly great? They did not HAVE to use the \"vacation\" name to make a story out of this piece of crap, but that is the ONLY way anyone would have EVER watched I suppose. First off, what is Vacation without Chevy Chase? He WAS the movie. The original vacation was hilarious and I still laugh when I see it. The second was not as good, but still pretty decent. The Christmas one,....hmmmm, not crazy about, but not horrid. This one basically found the long lost Audrey and put her together with her trailer trash cousins, which if you had seen the first movie know would NEVER happen. So it was her, cousin eddie, and his wife and the grandfather, played by Ed Asner. All these characters were morally depraved, and just disgusting all together. The story was rediculous and not the least bit funny, but really sad.They did the same thing to such greats as \"Jaws\", \"Crocodile Dundee\", \"Superman\" and so many others. They milked these stories for all they were worth. They took the original piece of work and dragged it through the mud!!!! Why? So Sad!","I sat through all 2 hours. I do not know what was worse, the awful plot, the lame characters or the hawaiian hottie that Eddie's 11 yearold kid and 80 year old grandpa made sexual advances toward. The money spent on this was just flushed down the throne. Matty Simmons should be ashamed. The original idea for this movie was \"A Swiss Family Griswold\" and it somehow turned into this mess. The only bright spot is that it's ratings were so bad we will never see this on TV again. AVOID AT ALL COSTS...RENT ERNEST SAVES XMAS or something else.","I knew this would be one of the worst movies I could have imagined...but in just 20 short minutes it actually exceeded my low expections by being possibly THE worst movie I have ever seen.I have already wasted too much time typing about it...trust me, it sucks.","I was hoping that this would be funny, boy was I wrong!   Any Gilligan's Island would have been funnier.   Not only was it boring but the quantity of commercials was absurd.  I was glad when it was over. Looks like I resume going to the video store soon.","I'm a big fan of the \"Vacation\" franchise, and I love Randy Quaid as Cousin Eddie, and at least a couple of the behind-the-scenes names were involved in this project (most notably Matty Simmons, who produced or executive-produced all 4 of the theatrical releases, as well as \"Animal House\"). For those reasons I figured this made-for-TV spin off might be worth checking out, even without Chevy Chase.For the record, I did not expect it to be very good; I just thought it might be a slightly amusing diversion. Therefore, my high level of disappointment goes to prove just how bad this utter turd of a movie really was. It was mind-numbingly, jaw-droppingly, heart-stoppingly, head-explodingly terrible. Yet, somehow, I could not stop watching it. It's a sickness I have; I can't seem to walk out on a film or give up on a TV show before it ends. Nothing has ever made me want two hours of my life back more than this movie.","I loved the original, I watch it every year. but the second is a piece of garbage and it never should have been made. The second could have worked if there was a different location. The son was not an original or didn't even act like one of Eddie's kids. Third was too smart for Eddie which downplayed his father role. None of the other kids where in it. It just could of been a lot better. I don't know why they even tried to make this movie. There was no continuncy from the first movie. I will pretend that this one doesn't even exist. It is sad that the actors didn't even see that they where made fools of. A really bad movie. I just think that i wasted an hour or more on a bad movie and i really love all of the national lampoon films.","I watched about the first 30 - 40 minutes of this movie on television the other night and can agree that this is by far the worst of the series. Not any of it is funny, even Randy Quaid can't save this mess. Eric Idle wasn't funny in N.L. Euro. Vacation, and he's even worse here. The sole laugh in this is when they're at the airport, and some guy dressed as Santa walks by the camera yelling \"Did anybody lose this?\" as he holds up a prosthetic leg.Then again, what can anyone expect from an in-name-only, made-for-television sequel to a classic movie released fourteen years earlier?","BEWARE OF FALSE REVIEWS & REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE FILM. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST! This made for television film is the worse movie ever made. Randy Quaid & Miriam Flynn return to play Cousin Eddie and Katherine. Shocking thing is that Dana Barron returns to play Audrey the role she originated in 1983. Audrey was played later by Julia Lewis, Dana Hill, and Marisol Nichols. Chevy Chase and Beverly D'Angelo wisely passed on this.The story begins with Cousin Eddie at his latest workplace, a nuclear facility where he 'works' alongside a monkey. When the monkey outperforms him in every test (specifically mental agility), the decision is made to fire him. Upon finding out the news, the two get into an argument which results in the monkey biting him.With Christmas approaching, Eddie is worried about what this job loss will mean for him and his family and he decides to talk to his former boss. Although the thought never occurs to him, the nuclear company is convinced that he will sue. As a preemptive countermeasure, they offer him and his family (along with Audrey Griswold and his Uncle Nick) a free vacation to an island in the South Pacific. While on holiday they take a trip on a boat, while Eddie attempts to catch a shark, they get lost and eventually shipwrecked on an isolated island.There is not one laugh in this movie. Avoid!","OK...this MAY contain Spoilers...but who really cares?  Do not, if you value the seconds in your life, waste your time on this pile of garbage.  There is not one redeeming quality in this movie...and I say that as a full fan of the Vacation Series of movies.  I LOVED the Cousin Eddie character from the other Vacation movies...but he only works well as a supporting character. Do I blame Randy Quaid for the failure of this movie?  Not at all.  I think he's a great actor...but this film lacks any cohesion...the pacing is off...it's just plain unfunny.  And the actor who plays the \"Third\"...Jake Thomas...was just  awful, more than likely due to a real lack of direction. I don't know why...but his whole character creeped me out.Some people say that this is a horrible movie because Chevy Chase and Beverly D'Angelo aren't in it...that has nothing to do with it.  The script, directing, acting...special effects...everything is a train wreck.  With Orphans.  And kittens.  Oh...and the Train ran over some old people too.Please, whatever you do...stay away from this filth!  I call it filth because it dirties the name of the Vacation Franchise.","Eddie has had about half a dozen jobs since the foreclosure of his farm. His latest, in nuclear research, is in jeopardy because Roy the Chimp seems to be smarter than he is, and there is only enough funding for one of the two positions.  Christmas is looking pretty bleak. Already, Eddie and his wife, and only one of his four children--Clark Griswold III Johnson, named for a favorite relative--have moved in with Cousin Audrey, who has had yet another disastrous relationship.But on Eddie's last day at the workplace, an unfortunate incident leads his company to offer him and his family a free vacation to a South Pacific island where the company has an office--so Eddie won't sue.  Eddie is not smart enough to realize he should sue, and he won't listen to his son, who is.  At the last minute, Uncle Nick shows up wearing part of a Santa suit because his wife may be cheating on him, so he joins the group.The trip leads to one laugh after another.  Once they arrive, the family is greeted by Muka Kaka Miki, a beautiful island woman who works for Eddie's former company.  She and the group are scheduled to take a tour of the islands, but the skipper of the boat (should I have said skipper?) cannot make it.  Nick, who has experience in the navy, thinks he can run the boat... Anyone who enjoyed \"Gilligan's Island\" should appreciate what happens next. In fact, one would have to have enjoyed \"Gilligan's Island\" in order to like this movie. The first half of the movie was enjoyable, but not all that great.  Later, the family realizes that the usual traditions of Christmas are not as important as being with loved ones, and between that realization and the comic adventures, the second half made the movie work.I liked Randy Quaid as Eddie, but I wouldn't exactly call it good acting. Ed Asner was good as Nick but no Lou Grant.  The younger women looked good wearing next to nothing. Jake Thomas was good too as Clark III.  But Eric Idle was the standout performer, as the poor passenger on the plane who has the bad luck of being the victim of Eddie's tendency to mess things up.  I was so disappointed we didn't get to see more of him. \nAlso, two performers we didn't see, who may have been the same guy, were also quite funny.  The first was the recorded voice on the very annoying answering machine at the plumber's office, which announced various menu options that didn't help with the disaster the family was experiencing, along with very enthusiastic holiday greetings.  The plumbing incident was a highlight early in the movie.  The second was an air traffic controller, who started out very calm, positive and reassuring but later became very nervous (I won't say why).This was a pretty good movie overall.","Sorry Randy. I love your comedy but in this case you really laid a 'Golden Turkey' egg.The plot was thinner than a single layer of my skin, the acting more wooden than a Giant Redwood and I think the direction was non existent.There certainly appeared to be pathetic attempts at take-offs of other films, Jaws and European Vacation to name but two.If memory serves me right Eric Idle played the same type of character in Nat Lamp European Vacation, but much better.I am wondering if Chevy Chase and Beverley D'Angelo were approached to make this sequel. If so, they certainly knew what they were doing when they turned their parts down.In my opinion no one can better Chevy and Beverley in their roles as the Griswolds and Randy Quaid complemented them admirably in the earlier movies.Randy Quaid should have quit National Lampoon whilst he was ahead.","This movie was awful.  It centered too much around Eddie, Clark Griswald's brother-in-law.  Eddie works much better when changing good quips such as in \"Christmas Vacation\" and \"Vacation\".I really don't understand how a movie like this would be given the thumbs up.  Now, don't get me wrong, I like Randy Quaid, but just felt this movie was totally wrong for him and for the character in general.  This movie leaves much to be desired and really needed some bigger name actors.","God bless Randy Quaid...his leachorous Cousin Eddie in Vacation and Christmas Vacation hilariously stole the show. He even made the awful Vegas Vacation at least worth a look.I will say that he tries hard in this made for TV sequel, but that the script is so NON funny that the movie never really gets anywhere. Quaid and the rest of the returning Vacation vets (including the orginal Audrey, Dana Barron) are wasted here. Even European Vacation's Eric Idle cannot save the show in a brief cameo....Pathetic and sad...actually painful to watch....Christmas Vacation 2 is the worst of the Vacation franchise.","I was shocked at how bad it was and unable to turn away from the disaster. This made 'Major League II' and 'Blues Brothers 2000' Oscar-worthy in comparison.I have tried to remember watching anything as bad as this in my life and was unable to come up with anything even close.","Christmas Vacation 2 is nowhere near as classic as the original. But that doesn't mean it's not worth a few laughs. Just switch your brain off and enjoy an afternoon of stupidness.Cousin Eddie (the ever lovable Randy Quaid) is housesitting for Audrey (the totally sexy Dana Barron) during the Xmas holidays but loses his job at the Nuclear research plant to a chimp. Feeling down about how hopeless he is, Eddie is cheered up when the company offer his family and all expenses paid trip to Hawaii. So off they go (uncle Nick and Audrey too) for their dream Christmas Vacation. Obviously disaster is never too far away.This movie is basically pointless. The first was about Clark Griswald wishing to give his family the best Xmas ever. This 'un is just an excuse for a string of bad jokes with terrible comic timing. In this regard it's kinda similar to Vegas Vacation, the wit and sentiment of John Hughes is sorely missed.Quaid does his best, but there is a lot of not funniness to it. He deserves better material, Matty Simmons may have produced all the other Vacation movies but he hasn't a clue how to write a good script. Christmas Vacation 2 is to the original what Home Alone 4 was to Home Alone.Plus I have a few questions, which I am sure a lot of other people will be asking. Why does Audrey's plumbing go mental? Why do Eddie's clothes stay impossibly white for the entire film? Why is there an elephant on the island?Plus there isn't that much of an Xmas feel to it. Sure the scenes in Chicago and quaint and snowy but a Hawaiian Island is hardly the best setting for a festive movie. However, Eddie does whistle and hum enough Xmas tunes to make up for it. But where the hell is the wonderful Christmas Vacation song?Buy if you're a fan of the first. Rent if you're only curious. It's nice to see a great character such as Cousin Eddie given the center spotlight but I just wish he was given funnier stuff to do.The DVD is in above average 1.85:1 anamorphic widescreen with okay Dolby 2.0 surround that is mainly used for general ambiance but still sounds fine whenever required. A handful of trailers, a brief featurette and a commentary make up the extras.","I can't believe I bought this movie on DVD. I don't even remember it being shown on TV last year. Why in the world couldn't they have just done a real sequel to one of the best Christmas movies ever made? Damn and Randy Quaid looks like he's been on the same drugs as Jerry Lewis. I didn't know about this movie until I bought it tonight and thought I would check it out on IMDb and see how it was rated. Boy did I make a mistake. If your reading this review be warned stay away from it and just stick to the first Christmas Vacation. Well at least I didn't pay more then 10 bucks for it. Maybe I can trade it in and get half of that back at Tower Records. Then again maybe not. PS I still haven't watched it yet, my DVD player went on the fritz tonight watching another wonderful movie, The Chronicles of Riddick (Unrated Director's Cut) woo freaking hoo.","Randy Quaid reprises his role as Cousin Eddie from National Lampoon's Vacation Series. This film sets out to prove that even a looser like Eddie has a winner deep down inside just waiting to get out. The first thing I thought of as I watched this movie was that Quaid forgot his character but it became apparent that the writers forgot his character also. The former dirt farmers looked completely out of place in a modern middle-class suburban home; clean, neat, these things clash with the Cousin Eddie persona. The explanation for this 'Leave it to Beaver' lifestyle is that Eddie's daughter has become a very successful stripper and keeps her parents in the lifestyle they've never been accustomed to.Eddie loses his job as a test subject to a chimp who also bites him on the rearend. Fearing a lawsuit, his former boss sends Eddie and assorted family on an all expense paid trip to Hawaii. Eddie and family take a little boat trip and end up marooned, ala Gilligan style, on a deserted isle. The rest of the movie is 'Eddie the loser' transforming into 'Eddie the normal guy' and winning the respect of his family.Unless you're a hardcore Cousin Eddie fan, give this one a pass and watch him in one of the Vacation movies. Stinky acting, stinky script, stinky directing, cute Hawaiian girls, I give it a 3 out of 10.","Absolutely the worst experience I have ever been through. I think my eyes started bleeding. I actually got sick the night after watching this. I don't even consider this a movie. Movies are supposed to be worthwhile and entertaining. This fails horribly. I could not make it through the entire film, so because the ending could be greatest phenomenon in motion picture history, this gets a 1 for that small chance. Otherwise It would be a flat 0.I can't see how National Lampoon, or let alone any organization, would sponsor this atrocity. Renting this DVD is currently one of the worst mistakes of my life. Only watch this if you want to make ever other movie you will ever watch seem great. Without question this is the worst movie I have ever seen.","It'll be a blue Christmas indeed if you subject you're family to this. I loved the original movie, and this one was not worthy of being its sequel. Actually, for all intents and purposes, it is not its sequel. Only one character from the original cast returns. Granted, that character happened to be the hilarious cousin Eddie, but he simply is not hilarious being the protagonist of a movie. His niche is that of the wacky relative who performs zany antics--alongside Chevy Chase. Chevy Chase was needed in this film for it to be a success, and he definitely was not there. As far as I am concerned, a movie is not a \"Vacation\" movie unless good ole' Clark Griswold is at the helm.","I watched this movie last night, and let me say, it's the absolute worst thing I have ever seen. The entire film is a train wreck, and it's not the actors. It is the horrible script.** Spoilers ** Alright, Eddie loses his job to a monkey. His nerdy son is disappointed. The bathroom goes crazy.He gets a free vacation. He goes along with Uncle Nick and the original Audry. Their boats crashes. They stay on an island. They are stupid and don't even bother to look at the nearby hotel.OK, so that's that. What makes this movie pathetic is the humor. It is so horrid, hillybillyish, and stupid, you can't even laugh. ANd it's not stupid funny humor either. I couldn't laugh the entire thing.","Obviously with this film going straight to DVD I wasn't expecting a lot but this film is so unfunny it is unbelievable. The only part of the film that you actually may find remotely funny is before they even get to the island, where Eddie's son is blasted out of the bathroom by a jet of water and then that's it! Why do they bother at all? The first Christmas Vacation with Chevy Chase was brilliant and hilarious. This is not. They rely on jokes concerning a dog with flatulence, and a character called Uncle Nick who is about 80 and keeps trying to get his way with beautiful women. When they approach the island on the boat, the island in the background just looks so fake and Randy Quaid although funny in the previous film, just overacts and seems like he's trying too hard to be funny. You have been warned!","This has got to be the worst piece of crap I have ever seen. Randy Quaid funny as a supporting actor in the original, but not as the leading. Too much Eddie. The original is a classic. Like the original, the supporting actor carried the show. Ed Asner was very funny. He is the Eddie of Christmas Vaction 2! How come Snots still looks the same after all those years and everyone else in the original looks 14 years older. After 15 minutes of watching this movie I don't believe I had even laughed yet. The island thing just didn't work. If it wasn't for the good looking South Pacific female guide on the island the movie would have been a total loss. I sat on this review for a week and yes, I still think the movie should never have been made. Lets hope there is not a THIRD!Shawn Gearin"],"review-user":["ChuckStraub","MichaelMovieLoft","jymcgr","missygoldstein","milky-4","srbestafka","TC-4","cully16","rrorlo","Zbigniew_Krycsiwiki","Christmas-Reviewer","obiemookie","vchimpanzee","plutus1947","popeye7973","xman1974","elvis68","CuriosityKilledShawn","Sjsharksfan19","McQualude","bmw_wag_13","simmon4-1","skodousek","leeg1974","slgearin"],"review-date":["27 November 2004","4 April 2004","24 December 2003","22 December 2003","31 December 2003","5 January 2004","24 December 2003","20 January 2006","26 November 2004","22 December 2003","17 December 2016","23 December 2003","31 December 2003","20 June 2005","20 December 2003","20 December 2003","23 December 2003","20 December 2004","28 November 2004","22 December 2003","29 January 2008","16 September 2007","4 March 2007","29 December 2006","24 December 2006"],"review-rating":["4","2","1","1","1","1","1","1","1","1","3","1","1","1","5","1","3","1","2","1","2","1"],"review-title":[" Doesn't live up to it's title.\n"," Vomitous\n"," Oh My God!!!\n"," Hall Of Shame!!!!\n"," Horrendous Waste of Time...I was Embarrased\n"," uhm?\n"," Good reason why I usually don't watch TV Movies\n"," If I could choose zero stars I would have.\n"," Cousin Eddie possessed\n"," All I want for Christmas is for them to stop making these awful \"Vacation\" sequels\n"," This was awful\n"," My brain hurts...\n"," Second half was better\n"," Not in my Xmas stocking thanks\n"," Eddie doesn't work as main character\n"," The worst of the series...It cannot get worse than this\n"," It was like watching a train wreck...\n"," Nice to watch, but don't expect greatness\n"," WTF\n"," Cousin Eddie is back in a bad way\n"," This movie makes you ashamed of the human race.\n"," Without Chevy Chase There Is No Christmas Vacation . . .\n"," Horrible...\n"," How unfunny is this film?\n"," The worst\n"]}