{"review-url":["http://www.imdb.com/title/tt0373024/reviews"],"review-text":["Saw this film when it was an entry in Santa Fe Film Festival. Heavy film! Depiction of a completely dysfunctional family taken to another level of the extreme, might have left me depressed to the extreme, had it not been for very funny sight gags and dialogue along the way which lightened the film's overall tone. The relatively \"uplifting\" ending gave hope for those affected by the initial tragedy. Still, I did not walk out of the theatre ready to go to a fun party. The film stayed with me for several days.Brought back memories of \"Ordinary People\", but with humor mixed in with the tragedy. I thought the acting was excellent, especially by Sigourney Weaver and Emile Hirsh. How each character dealt with the tragedy was at times sad, self-defeating, but also at times hilarious. Clever dialogue, and situations.","This film is chock-full of little surprises, many of them funny. The fact that it's written and directed by a 24-year old blows my mind. Some of the scenes where the high school kids are using ecstasy made me very uncomfortable because I have a kid that age and I could picture her using it. As parent of a teen, I found the depictions of the parent-child interactions to be dead-on accurate.I enjoyed the film's many little jokes, and I enjoyed the fact that not everything made perfect sense and not all the issues were resolved by the end. To paraphrase Mark Twain, truth is stranger than fiction, because fiction is required to stick to that which is possible, while truth is not.This is a film which plays with the viewer, allowing us believe that people are what other people think they are, only to allow us later to realize that the folks we assumed were right were completely ignorant of the real situation. One of the film's strongest scenes, a scene about which we feel very relieved and sympathetic about what the character is doing, turns out to be based on a completely wrong assumption, and the character, while admirable, is totally wrong. It's very subtly done, I think. Very realistic.I liked the score a lot -- I thought it really aided the film, really helped set the mood -- the film has a couple of screwball moments, and the background music helps establish that.The valedictorian speech is a hoot and a half -- got a big laugh! The movie is really in my head right now -- saw it this morning. Will try to see it again, time allowing. Tens are hard to come by, but a solid nine in my book.","This film is a powerful commentary on family life in North America today. The story is so well constructed, it almost feels like its happening across the street, right now! If you are connected with your family and community in any way, this film will grab you and transport you to the Travis' home and not allow you to leave until the credits are done.Our imaginary heroes, through a myriad of innocent circumstances, often unwittingly, lead us down a path of sorrow, confusion and isolation. The Travis family, after a terrible tragedy, invite each of us; father, mother, brother and sister, into their respective lives to share their experience in a dynamic set of circumstances that just doesn't quit. We see all of the above and eventually the joy, in powerful performances by the major players and the rest of the cast, making this film a movie-goers absolute treasure.In a film so well done as this, it is usually difficult to to find something special, but Sigourney Weaver's portrayal of Sandy Travis was outstanding. I would be surprised if others didn't recognize it as such.Clearly a 10. Well done!","Wow. When I went to this film at the Toronto film festival I had no idea what I was in for. This movie takes you on an emotional roller-coaster in the best sense of the term. Sigourney Weaver was better than I've seen from her in years; Emile Hirsch was great and Jeff Daniels broke my heart. I can see how this won't be every person's cup of tea, as at times it deals with some pretty harsh things that can happen to a family. Don't get me wrong -- it's really funny too -- at my screening the audience burst out in applause after laughing over and over again. I just think if you're open to examining your own life, Imaginary Heroes will sincerely touch you. I can't wait until it comes out in theaters.","It is hard to judge 'Imaginary Heroes' without referring to the fact that director and script writer Dan Harris is only 25. You can hardly believe seeing this film, which is not only a mature piece of work, professional and deep, but also with some of the defects of routine specific to older directors.The setting is the American suburb, too familiar from 'American Beauty' or 'Desperate Housewives'. As in 'American Beauty'the film turns around a suicide, but here it happens at the beginning of the movie, and we are left watching a mid-class family coping with the death of the gifted sportsman brother and son. Emile Hirsch plays the younger brother, Sigourney Weaver is the mother, both are excellent trying to cope with the loss, to find the reason and motivation to survive. Harris drives his actors with a sure hand, and the first two sections of the film (there are four in total, as the seasons of the year) build a wonderful tension, with credible dilemmas and real questions. It is the second part of the film that disappoints slightly, it looks too tired and conventional, and I suspect that the producers may have interfered in the work of the young script-writer and director, trying to bring him closer to the Hollywood convention. That's how this film fails to be a somber version of 'American Beauty', with a different focus. I am sure however that we will hear a lot about Dan Harris in the coming years.","IMAGINARY HEROES (2004) **1/2 Sigourney Weaver, Emile Hirsch, Jeff Daniels, Michelle Williams, Kip Pardue, Deirdre O'Connell, Ryan Donowho, Suzanne Santo, Jay Paulson, Luke Robertson. (Dir : Dan Harris)\"Ordinary People\" Meets \"American Beauty\" by way of \"The Ice Storm\"Just what is it about the suburbs that have been portrayed as an American cousin to Norway's fjords in which nothing but despair, suicidal tendencies and infidelities run rampant at the corner of Angst and Anomie? In the latest endeavor by Harris, a screenwriter who shared credit for the first \"X-Men\" film and several other comic book hero adaptations down the pike, makes his directorial debut questioning just that: Why does a family fall completely apart when a serious crisis occurs? Well in the case of the Travis family it is the shocking, out-of-nowhere sudden horrific suicide by their eldest son Matt (Pardue), a star athlete with nothing but a bright, shiny future ahead who inexplicably offs himself sending his relatives into a whirlwind of emotions (and lack of to boot). Sharp tongued yet surprisingly loving mother Sandy (Weaver, the best thing about the film) resorts to smoking marijuana when she's not dodging the next door neighbor (O'Connell) ; ineffectual father Ben (Daniels in the trickiest performance  making an asshole likable) whose undying love for his dead son sends him into the deepest depths of depression and lashes out at his remaining brood; college age sister Penny (Williams) who attempts to anchor her grief in brief return visits only to party with blinders on and namely middle son Tim (Hirsch) who just is trying to move on with the whole affair and not dwelling on it as best he can yet still getting himself into a series of situations leading to a fall he may not be able to recover from. The black comic pitch Harris attempts to filter into the various stages of grief are a mixed bag but often leave their marks of ridiculous moments of suburban oddness with a few brief elements of genuine loss and heartbreak. Leavened with a good dose of humor the film none-the-less is a listless addition to the quasi -genre of suburban angst films.","Imaginary Heroes is clearly the best film of the year. It was a complete and utter joy to watch. I was riveted. The whole audience up at the Sunset Five was riveted, when the film ended no one moved, spoke, nothing. I think this film is a perfect example of the of the power that drama has. Especially in so much as it sets an example of the quality of drama/ work of this younger generation. There were moments in your film, many, like at least seven, where I was struck by such a great amount of beauty, emotional beauty, that I actually couldn't breathe for a while. And for a catharsis junkie like me, that's about the best censorial experience I could ask for. It is the result of powerful, masterful storytelling and direction. Like heavyweight stuff, like Burtolucci and those guys. Each element of the film fit tightly together. There were no missteps at all. The cast was amazing. I have been a huge fan of Emile's and Ryan's for a long time, and I thought they have never been better. I was/am/will be continuously stunned by this film. And I promise I will drag every person I know to see it. It should be seen. It should win awards.","The Kinks warned about media heroes. Outside the movies, most heroes are also \"Ordinary People.\" Society demands some role playing, but what happens when that extends to the parent-child relationship? Do some parents try to improve themselves through their children rather than vice versa? How do you provide a role-model but not a role? A brilliant swimmer who hates to swim; a brilliant musician who won't play. Offbeat, funny (despite depiction of \"serious\" problems), very good multi-dimensional acting by everyone. Lots of plot twists complement the emotional tension. Celluloid heroes never feel any pain. I don't recall ever being disappointed in a Sigourney Weaver film (I even liked \"The Village\"!).","It occurred to me while watching \"Imaginary Heroes\" that any screenwriter attempting to make a drama about family relationships should seriously consider killing off a kid or two in the opening reel as a way of getting his characters to open up and reveal themselves. There must be something to this storyline, for it seems as if every other family drama that comes down the pike uses this device in one form or another (\"Paradise\" and \"Moonlight Mile\" are just two of the more recent examples that spring immediately to mind, although one could reach back to a golden oldie like \"Who's Afraid of Virginia Woolf?\" to make the point as well). It's not that the death of a child is an illegitimate subject for serious films to explore. Far from it. It's just that, like any topic, it can be so overused that it becomes just another movie cliché, a convenient bit of narrative shorthand to get the ball rolling and to give the characters something to grapple with for the remainder of the time we get to spend with them.The latest such work is \"Imaginary Heroes,\" a film that borrows heavily from what is one of the earliest and, perhaps, best known examples of the \"family coping with the death of a child\" genre, the Academy Award winning \"Ordinary People.\" Like the characters in that earlier film, the Travises seem, on the surface, to be the ideal suburban family, until, one fateful day, their oldest son, Matt, who is the \"golden boy\" athlete and, thus, the apple of his father's eye, kills himself with no explanation (one minor difference is that the son in \"Ordinary People\" dies as a result of an accident, not a suicide). It is Matt's younger brother, Tim, who winds up finding the body, and who assumes the role of protagonist in the film. Each of the remaining family members copes with the tragedy in his or her own way. Matt, who has always lived in the shadow of his older brother, becomes more and more estranged from the father who has virtually ignored him all his life and begins to turn to drugs for surcease. Ben, the father, becomes swallowed up in feelings of remorse and guilt, turning away from both his job and his family. His wife, Sandy, is the most complex character in the film, a free-spirited child of the '60's who feels oddly adrift in the role of mother and wife as she endures a basically loveless marriage in sterile suburbia. She spends most of her time after the tragedy trying to reconnect with her pot-smoking past.As written and directed by Dan Harris, \"Imaginary Heroes\" emerges as a wildly uneven film. For every scene that feels real and authentic, there is another that comes across as arbitrary and inauthentic. One sometimes has the sense that Harris would like to cram every possible life situation he can think of into his screenplay, an admirable goal, perhaps, but one that makes the film unnecessarily melodramatic in the process. Instead of identifying with the characters and being caught up in their plight, we often find ourselves thinking, \"Oh, come nowwhat next?\" For teen suicide is just the tip of the iceberg when it comes to the hot-button topics covered in this film; the screenplay also touches on drug and alcohol abuse, physical abuse, sexual identity conflict, life-threatening illness, even inadvertent gay incest. It is this \"everything but the kitchen sink\" mentality in the writing that robs the movie of much of the credibility it needs to really make us care.That is not to say that \"Imaginary Heroes\" is a bad or unrewarding film. Much of what it has to say about familial relationships and values in the 21st Century is insightful, original, pointed and profound. Prime credit for its success goes to the actors, Emile Hirsch, Sigourney Weaver and Jeff Daniels, who deliver incisive, sensitive performances in their respective roles. It is they who triumph over the narrative excesses to stimulate our brains and touch our hearts. Moreover, Harris, in his direction, achieves an effectively melancholic tone throughout, but one that is frequently augmented by some badly-needed flashes of daring dark comedy.\"Imaginary Heroes\" may appear unfocused and derivative at times, but its fine performances and subtle mood shifts make it a film worth watching.","As Salinger's \"A Perfect Day for Bananafish\" ends with the suicide of a prodigy, this movie opens with the death of the star high school swimmer legend, Matt, who shoots himself in the head with a revolver after in the opening scene. But the death of Matt Travis serves as a key to unlock the door of another prodigy, his brother, Tim who never in his life seriously bothered with the question, \"What am I going to do?\"When he finds his brother dead, his head broken like a dropped watermelon, the Travis family starts vomiting out its secrets one by one. The film focuses on Tim. He is a victim of bullying, domestic abuse, family alienation, heartbreak, issues of sexuality and friendship. Tim reveals his wounds by physical bruises, but these are not the only injuries to his person, as we slowly come to realize, as the script painfully unveils the origins and outcome of Tim scars. Everyone who loves him hurts him. Hirsch plays out the character quite well, revealing frame after frame in the visual expression of his body, a host of conflicting emotions inside the soul of a kid whom no one seems to listen to or know very well, unknowing and unaware of his depth of soul and prodigious talent. Two siblings sharing a doobie, curled up on a red, spinnable playground saucer, Tim asks Penny, \"What am I going to do with the rest of my life?\" The scene is framed in a familiar, recurring image of the film: the comfortable playground where Tim obviously feels at home, filmed from a bird's eye view, because with every character Tim feels comfortable to share a part of himself, and we view these intimate moments he shares in the red, spinnable playground saucer, complete with childish graffiti carved in pencil, from above. After advising him curtly to pass the joint, Penny tells him, \"Tim, well, the secret to the success of life is to find something you love. And you have to do that for the rest of your life  And you better hope to hell that you're good at it because if you're not then you'll probably fail.\" This simple line of advice from Penny serves as the movie's central theme, the responsibility of talent and the possibility of failure. Why does one person have a talent he cannot stand, like Matt, who hated the attention his swimming fame brought, but no one notices Tim's talent  no one  because no one bothers to ask him? Not even us. The film makes us aware that we ourselves do not know Tim as well as we thought we did when we first meet this handsome, sad, guy; in our intimate understanding of Tim, as it progresses, we are reminded that not everyone is as they seem to be. This is the other side of the film, the failure of those who should  parents, friends, teachers  whoever  to notice and see the gifts of the people they claim to love. Not even his mother Sandy, played by Sigourney Weaver, sees Tim's gift, despite her love for her son. Weaver does a deft job of a middle-aged woman grappling with her own inner demons as she haphazardly tries to play the roles of domesticity and support. When Tim is found to be bullied at school, she storms the boy's trailer, threatening his life, \"You can tease, torture, punch, drive drunk with me, I can forgive you. Hell I can understand it, I'm a good Christian, you know, I can forgive and forget, but you mess with my kid and may God himself descend from heaven to protect you because as long as I live  and I will outlive you all  I will wake up and go to sleep at night just dreaming of ways to make your petty insignificant lives into hell on earth.\" After flicking a paper cup into the mother's face, she looks around the trailer, and looking at them both, the kid and his stunned mother, comments, \"nice trailer\" and leaves as quickly as she came. Weaver scores in her ability to match gusto with visceral wit that is acid and witty. And Tim's father, played by Jeff Daniels, is blind to who his son is, treating him like a stranger, not telling his family that he took time off from the office, spending his days in the city park, listless, a carved out soul, and sleeping in Matt's bed, tucked in with his high school letter jacket. Jeff Daniels does a superb job of making us believe that he can be both a bastard and lovable because, we grow to see that even an inept father can show his love for his son. In an emotional scene, Tim confronts his father. Just when you think his dad is going to hit him, he grabs for him to embrace him. Not letting him go, he tells Tim, \"I am your father and you're are my son and I'm here okay but you've gotta talk to me. I don't know how to do this by myself\". It is here at this moment in the film that a father tells his son, you have to tell me what's going on inside of you, you have to tell me who you are; I want to know who you are. It is in this scene that the film reaches a cathartic moment, the visual movement from Tim, angry and alone, to his father embracing him as he breaks downs and weeps, revealing the emotions hidden beneath his shell. Tim experiences this moment of cleansing with his dad as a catharsis, especially when you consider the mistreatment, manipulation, disregard, violence and betrayal he has been dealt in the long year the film encompasses. I recommend this film.","To have to wait all that time to find out who's clobbering Tim? And it went on and on with dreary people with dreary lives. If I had watched it alone I would not have made it through the first hour. Excellent acting of course from the actors, except (not as an actor but as character) Jeff Daniels was not believable in in change or when he was in the hospital with the wife. And then, boom, at the end, everything's tickety-boo and hunky dory. The things that went on in that family were too monumental to get off that easy. And nutty neighbors didn't add to the feeling. Just because there were no explosions or chases didn't make this into a very good film.","Viewers of independent films know that once or twice a year they are going to see stories about dysfunctional families and they have come to expect them and it's becoming more of a challenge to keep them fresh but here despite the good cast it just seems more of the same. Story is about the Travis family who is trying to recover from the suicide of Matt (Kip Pardue) who was a very promising high school swimmer. Ben (Jeff Daniels) is the father who withdraws from everyone and has never treated his other son Tim (Emile Hirsch) as well as Matt but he does communicate (of some sort) to his mother Sandy (Sigourney Weaver) who finds his stash of pot and starts to smoke it.*****SPOILER ALERT***** Sandy also starts to flirt with much younger men like the check-out cashier at the grocery store but when she attempts to buy more marijuana she gets busted and hauled off to jail. She doesn't tell anyone what happened but she does discover bruises on Tim's body and also that Ben has taken a leave of absence from work. After all this happens Sandy falls ill and lands in the hospital where her life is in danger which forces Ben to realize that he may have to come to terms with losing another part of his family.This film is written and directed by Dan Harris who has worked with Bryan Singer on \"X2\" and also the upcoming Superman film and while his script allows these characters to have genuine moments of expressing their pain and confusion the story (for me) just has too many things thrown in. The script touches on so many different areas that you need a scorecard to keep track of them all including drugs, sex, love, infidelity, abuse, neglect, experimentation with homosexuality, and a life threatening illness. If all those scenarios weren't enough for you Harris then tacks on a plot twist at the end that's supposed to sum up and explain most of everyone's feelings towards Tim. While I did roll my eyes at least 2 or 3 times with the way the script kept unrolling one thing after another I must admit that I didn't hate this film and I have to credit the actors for that. Everyone has at least one good scene somewhere in the film but I wish the story would have concentrated more on Weaver and her character than Hirsch. Weaver is exceptional and with a sharper script she could have had a role that maybe would have led to an Oscar nomination but instead we get endless scenes of Hirsch at parties or his shenanigans with the neighbor next door. Harris shows he can be a good writer/director but with this effort he just throws so many different things at the audience that the material just becomes labored and contrived.","===========BIG SPOILER================================== This is a terrible movie with no likable characters. So many clichés and senseless scenes. It needs a good editor but then there might not be any movie left. Please save your two hours. The only decent and unpredictable scene in the movie was when the younger brother refuses to stop his brother from killing himself. The description read \"moments of dark comedy\". Perhaps I missed those when I blinked. The horrible characters start right with the funeral. The funeral goers are laughing and complaining about the food while at the funeral of a very young man who has committed suicide? Then the father makes digs at the only son left? Right at the funeral? How is it that the next door neighbor whose husband cheated on her with Sigourney Weaver's character is the bad guy for telling the husband? The father doesn't even know his son can play the piano though everyone else around him seems to know he is a great pianist. The movie tries to shove every dramatic cliché possible into one movie: father over-driving athletic son to succeed, dysfunctional family losing a chosen son to suicide, the son left feeling lost and alone, drugs, marital affairs, child conceived via affair but raised as husband's son, incest, homosexual tendencies, bullies, possible terminal illness, etc, etc, etc. DO NOT WASTE YOUR 2 HOURS.","This was a character's movie. The plot wasn't that hot when it was there, but the characters were interesting and very well-acted. The story focuses on the Travis family in the wake of the eldest son's suicide. I say that loosely, because the story is mostly about the surviving son and the mother, because if the father WAS supposed to have the story focus on him too, they edited the movie pretty poorly. The acting on all parts was very good, particularly Emile Hirsch as the surviving, confused son. The characters were all very interesting and I didn't mind watching them until late in the film, when it just seemed to drag. My big complaint, however, was the story. The son killing himself was supposed to be the center of the plot. However, it really wasn't. It was something that happened at the start of the story, but then everything went every which way. Then they'd mention that the son killed himself to remind you that that was the central thread. The other thing was that the big plot twists, of which there were plenty, were never really explained or built up to, but just thrown in there randomly and often from far left field. In fairness, the ending was very, very cool. But it was also clear where the inspiration for the story came from: about half of it (the half that wasn't padding) was pretty much lifted from the story in the Pearl Jam song Alive. Which reminds me... There was a \"poem\" in the movie that was supposedly written by someone who killed themself. I could not have been the only one who recognized that said poem was lifted, word for word, from that very same song. I dunno, this was a movie I had hope for, and they really, really dropped the ball.","This wretched psychodrama uses every shabby device in the book to wheedle attention and sympathy from us for its characters, who, with one exception, are not worthy of any notice at all, let alone two precious hours of filmgoers' time.As in Robert Redford's \"Ordinary People\" (a superb film that, in comparison, clearly shows up the vacuity of \"Heroes\"), a late teenage boy has died, leaving his family in the throes of bereavement. In this case, the death was a suicide, an event that nearly always poisons the emotional well of the survivors in a particularly corrosive way. We follow these people over the next 8 or 9 months.The father (Jeff Daniels) becomes a withdrawn, virtually mute, usually drunken stiff who secretly takes leave from his job for months, sits instead on a park bench all day, and insists on setting a full plate of food at the deceased son's place for every meal. He treats everyone else in the family with unerring nastiness. He sees his doctor regularly but the issue of therapeutic intervention in his obviously dysfunctional state never comes up.The mother (Sigourney Weaver) yells at the neighbor woman, among others, gets busted when she stupidly tries to buy \"marijuana\" (her term) at a head shop (what adult in reality would ever try such a dumb stunt?), and, near the end, swoons into coma with a lung condition that everyone in the theater assumes is cancer (she's a heavy smoker). Ms. Weaver has a few flip lines but generally behaves too unintelligently to merit much empathy. It's not that there aren't people out there who behave in these silly ways when severely stressful circumstances arise. But why make a film of such drivel? What can anyone learn from this pair's conduct? The deceased's older sister (Michelle Williams) is away at college and all too happy to distance herself from the family zoo. The younger brother (played by Emile Hirsch) is the only credible member of the family. His suffering is genuine, its causes multifold, and his conduct is coherent within the circumstances. But Hirsch's character is too soft spoken, too morose and beaten down, to carry the movie. The other bit players, subtexts and cutesy, unreal dialogue don't help.The suicide theme is echoed in an almost nonchalant manner in the case of two other minor characters. So what is the writer-director, Dan Harris, trying to say about this subject? That it isn't a serious matter? Why Jeff Daniels agreed to play the sap of a father as written in this screenplay is something only his therapist might possibly be able to answer. Avoid this dog. Instead rent Redford's classic. My rating: 4/10 (C-). (Seen on 2/17/05). If you'd like to read more of my reviews, send me a message for directions to my websites.","I just finished watching this horribly depressing drama and realized that, in light of recent dramas such as these, the only ones who could be considered abnormal are those who are least aware that life is nothing more than tragic. I would suggest how nauseatingly defeatist and counter-productive this conclusion is, even if relationships and outlooks like those presented in this movie are grounded in fact to some degree. But, instead, I realized that these films have made the very determination of the great \"tragedy\" trivial when the same boring situations, the same suffocating dysfunctional families and friendships continue to play out just have they been over and over again in some sort of attempt to knock out previous distortions of family life (much of it existing in the 1950s and earlier with personality and character aberrations being made ever so subtle), supplanting it instead with the \"reality\" of how things actually are. That in fact, what we are watching is no longer the dysfunctional, but in fact, a normal existence and set of circumstances that has actually existed all along, but of which we may have been previously been unaware and thus, have ignored or at least denied.Only problem is, that too many films have been trying to make this point. And by doing so in nearly identical form. When I had read the synopsis for the film, I immediately thought of 'Ice Storm.' While watching the depressing lifelessness of the Travis family, which seemed to endure repeated emotional berating, I immediately recalled 'American Beauty.' And, in some regards, the interactions between the parents and the middle child, Tim, I drew similarities from 'Igby Goes Down.' 'Imaginary Heroes' may be a novel experience, maybe a refreshing one deemed so for an honest portrayal of character that, as said before, is often not permitted to exist in the films of family (which is idiotic to think anyways, considering we were already seeing these kinds of relationships displayed in films like 'Ordinary People' as early as 1980 and which go back even further than that). But, to the well-versed viewer, these films may offer nothing new. They have in fact, become a rather tired testimony of too many filmmakers who may try to out-do the other with the amount of trauma and apathy they can pack into one family (and here, it extends to neighbors and friends). In fact, 'Imaginary Heroes,' the latest in this genre (I do think there have been enough films to accurately declare it a 'genre'), crams so many disasters and surprises into one family, that they would make prize finds for a daytime talk show host. It is the story of a family who is tested by the suicide of the eldest son, a talented and decorated swimmer who hated the sport with a passion. The youngest son knew this, the father was in a daze and blinded by the push for competitiveness in his all-star son. And it's not clear that the mother and sister had much of a relationship with the young man.Granted, it is no less entertaining (to some extent, for those who find this material exhaustively depressing after a while), and the performances are quite good, especially by Sigourney Weaver and Jeff Daniels. But, I sure hope that filmmakers in the future wishing to add to the commentary of struggling familial relationships (which coincidentally or not always seem to be upper-middle class white suburban families) intend to offer something new by way of material and insight. I should see no distinction (and consequently, no purpose) otherwise.","\"Imaginary Heroes\" treads some of the same territory of WASPs in Grief that \"Ordinary People\" and the as-yet-not widely distributed \"Bereft\" but full-length debut writer/director Dan Harris takes a decidedly quirky approach with considerable leavening humor.While he gives almost equal time to the impact of guilt and grief on both generations, the parents and the teen kids, Sigourney Weaver's mom brilliantly dominates the screen, so much that it feels like those single mom leaving kids in her wake movies \"Tumbleweeds\" and \"Anywhere But Here.\" Weaver and Emile Hirsch as her son have a wonderful dynamic and chemistry. While Jeff Daniels as the dad and Michelle Williams as the older sister have tiny roles, Hirsch is so good that it would be a shame if he continued stooping to do more silly teen comedies, as he sensitively rises to the \"Y Tu Mama Tambien\"-like turns of the story.The devastating impact of parent-induced sibling rivalry is shown almost as intensely as in \"Swimming Upstream,\" ironically also with swimming as a focus, and in \"The Great Santini,\" but with the emphasis kept more on the emotional trauma.The odd mix of humor and pathos occurs both within scenes and between scenes as almost no scene ends as we expect it, as each encounter has surprises, secrets are revealed and character's actions have unanticipated consequences. The comedy is accentuated by the light musical underscoring, though the song selections throughout are also excellent and unusual, particularly in emphasizing that life goes on after a family tragedy.Some unnecessary clichés creep in, such as the school bully living in a trailer park, even though this was mostly shot in Glen Ridge, NJ. I haven't seen a teen boy since \"Cruel Intentions\" have a personal notebook as opposed to pouring his heart on to a computer. It's also not explained why this upper middle class family is not seeking therapy or some kind of counseling for their problems.The title was briefly explained fleetingly in passing conversation.The film looked a bit grainy so I wasn't sure if it was shot on digital video.","This film was so disappointing, it was almost beyond belief. It's essentially about upper- middle class white people abusing themselves in every twisted way imaginable, over the suicide of a kid who was the biggest jerk of them all.Sigourney Weaver is my favorite American actress of all time, which is why I was so surprised she'd agree to appear in such a pile of garbage. It's just that sort of script... the type that seems so good when you first read it. I can only assume the draft Harris handed the entire cast at the beginning of shooting, was not the final shooting script.Please do yourselves a favor and avoid this film like the plague. If you really want to fix that uncontrollable urge to see people suffer over suicide, rent 'Ordinary People' again.","IMAGINARY HEROES is one fine little film! Written and directed by Dan Harris this story is classic theater, weaving comedy and tragedy together so tightly that the climax of the film takes your breath away.The Travis family is an odd bunch: no member is who each appears to be. Beginning with a suicide of the reluctant 'hero' child swimming champion Matt (Kip Pardue), the father Ben (Jeff Daniels) falls apart and isolates himself from his family and himself while the mother Sandy (Sigourney Weaver) turns to pot and rage and sarcasm, the daughter Penny (Michelle Williams) returns from school repulsed by her family's behavior, and the remaining son Tim (Emile Hirsch) takes the brunt of all of the above by avoiding his classmates, girlfriend, and teams with his neighbor Kyle (Ryan Donowho) to leap into drugs and sexual experimentation. Throughout the film Tim tries to hide bruises on his body that have a secret all their own yet lead his girlfriend to feel rejection, his mother to rage against the trailer park trash bully she believes is the cause, and finally open the window to the deep scars this family has suffered for years. Secrets and lies, here, and the resolution of them is painfully dramatic.This may be Sigourney Weaver's finest role, although Emile Hirsh, Jeff Daniels, Ryan Donowho, and Kip Pardue (despite the brevity of his role) all contribute top-notch performances. The story begins slowly and seems to meander and that fact may lose some viewers' attention, but stay with this little powerhouse film and the impact of the work will stun you. Highly Recommended. Grady Harp","The Travis family has to deal with the popular athletic older son Matt's suicide. Tim (Emile Hirsch) is trying to live with everybody's sympathies. Mother Sandy (Sigourney Weaver) starts smoking marijuana. Father Ben (Jeff Daniels) abandons work and spends his days in the park. Sister Penny (Michelle Williams) returns home from college on occasions.I like Tim and Sandy's journey in dealing with the lost in the first half. It would be a fine quiet small indie if that's the movie. However writer/director Dan Harris wants this movie to be about secrets. He holds all of it back until the second half. It leaves the first half with an emptiness like the movie is refusing to let the audience into the story. Once the reveals start happening, it diminishes the power of the lost somehow. It tries to give it meaning and loses its value.","Not exactly the happiest movie, it's a suburban drama along the lines of The Ice Storm or American Beauty combining dark humour with tragedy just not quite as well as those movies did.Still strong performances especially from Sigourney Weaver who gives a penetrating portrait as the mother of this dysfunctional clan as we follow year in the life of her family, left devastated by the suicide of the eldest son, a champion swimmer. Jeff Daniels is, wow, quite an a-hole here. Very unlikeable and unredeemed by the end. He shows his pain by verbally striking out at his family. Emile Hirshe is young here but does a fantastic job and I really enjoyed the relationship he had with his mother. 8/20/14","Another slice of darkness and denial hiding beneath the surface of American suburbia, Imaginary Heroes chronicles the lives of the Travis family, all recovering following the suicide of their eldest son.The pair at the center of the film is mother and son Sandy (Sigourney Weaver) and Tim (Emile Hirsch), both acting out in different ways as a result of the death. While Tim experiments with prescription medication and his own sexuality, Sandy regresses to her former self, smoking marijuana and coming to terms with an old act of infidelity.The relationship between Sandy and Tim is explored well, especially when references are made to both of them being outcast from their own family: Sandy due to her affair and Tim, initially, due to always being in the shadow of his more successful older brother. Considerably less time is allowed for Sandy's husband Ben (Jeff Daniels) who, in a devastating depiction of denial, orders Sandy to make an additional plate of food for his dead son and place it in his old spot at the dinner table. Michelle Williams' older sister Penny is underwritten and could easily be taken out of the film.Despite its long runtime, Imaginary Heroes doesn't explore its many subplots as much as the individual stories deserve, while some of the movie's black comedy doesn't translate as well as writer/director Dan Harris may have liked. And the depiction of a disturbed family dynamic isn't depicted as strongly as the many other films out there with similar ideas. But despite some issues, the central performances from Weaver and Hirsch are stunning, and easily carry the film to its successfully subdued conclusion.Rating: B-","This film does not have the outstanding visuals that American Beauty or The Ice Storm offered and because it was made after those films, it cannot be marked as very original either: the music, though subtly brilliant, sounds very much like that of American Beauty. The story has some similarities with The Ice Storm in particular (besides Sigourney Weaver). Without intent perhaps, the film seems to try to recreate the success of the two aforementioned movies too much. At times, the story tends to stay a bit more shallow than it's bigger, more successful \"brothers\" by having too much going on, or by not delivering the most effective dialogs. Here, the writing cannot measure with that of American Beauty. But that can be said about most movies ever made, even the best and there is still a lot to like: said music score and (expectable, given the cast) effective performances. Of note is Emile Hirsch who would shine a couple of years later in the outstanding \"Into The Wild\".Overall I can recommend this film if you like suburban dramas though it's not the first one on a list of must-sees, which would be topped by: 1 American beauty 2 The Ice Storm 3 Little Children.After you've seen and liked those, check out this one.","Have just seen this film, in Australia on satellite. As i have been avoiding the news more so than usual over the last week coming from the US of A regarding gunmen, well to be absolutely blunt, this film is a prescient gem. A big bravo to all involved. i had only a small idea of what the film entailed as is most often the case for good effect and this certainly came up with cinematic goods. the setting of the scene is effective in the truest sense of the word, with all the hairy confronting subjects of today's world in relation to one's own faltering family, albeit suburb. The first forty minutes sets such a professional theater i was not ready for the out loud laughs when they came. Although the cathartic moment built via comedy and character as the family and neighbors came together in an extraordinary way.All in all a foreseeing of who and what we are. A most meaningful film and a must see.please note the date of this review.","so. i was completely in love with this movie. gaga for it, even with all its plot twists...but the one thing i found really disturbing was the connection between the two best friends in Tim and Kyle. While the writer of the film gave us such a poignant moment between the two, and their sexual experimentation/confusion, he then gives us a plot twist that makes them half brothers?!?! (Although the subject isn't brought up in the film....and left unexplained and unaccounted for) I just thought that it was in bad taste, and the fact that it wasn't even discussed is even worse. (Oops we've created a taboo...now let's not address the situation, because that wouldn't really be P.C.) Otherwise a spectacular film"],"review-user":["kmwilson36","plkldf","gepin045","uclajt","dromasca","george.schmidt","minorityinfluence","urnotdb","Buddy-51","greigroselli","mfsor","rosscinema","bfollenweider","kingmattress","roland-104","vertigo_14","noralee","jbmoy","gradyharp","SnoopyStyle","juneebuggy","maxpower03","FlorisV","holdenstevie","skapunkpopemogal"],"review-date":["19 February 2005","3 April 2005","14 February 2005","1 October 2004","4 October 2005","20 December 2004","23 December 2004","14 April 2005","27 June 2005","17 April 2007","9 April 2006","6 March 2005","2 January 2006","12 December 2005","5 December 2005","2 August 2005","7 March 2005","16 December 2004","9 June 2005","30 December 2015","24 September 2014","28 May 2009","3 January 2009","19 April 2007","22 January 2007"],"review-rating":["9","9","10","10","7","6","10","7","7","8","5","4","2","4","4","4","8","1","10","5","6","7","7","10","7"],"review-title":[" Heavy film about a dysfunctional family, well worth seeing.\n"," Excellent, smart, funny, scary\n"," Well written - Well acted - Great story\n"," Outstanding!\n"," mature work from a very young script-writer and director\n"," \"Ordinary People\" Meets \"American Beauty\" by way of \"The Ice Storm\"\n"," Simply the best film of the year.\n"," Rock n' Roll Fantasy\n"," a bit derivative but effective overall\n"," A Kind of Salinger/Lynch Sundae with the Cute Emile Hirsh as Lead\n"," Boring, unpurposeful\n"," Story of dysfunctional family is all too familiar\n"," One of the worst movies\n"," Not that good, really\n"," This mess makes you long to revisit Redford's \"Ordinary People\"\n"," So life is nothing more than a tragedy? (spoilers)\n"," Life Staggers On One Pratfall After Another Post- Family Tragedy\n"," Absolutely Horrible\n"," Family Implosion and the Fascinating Afterburn\n"," too desperate to hold onto its secrets\n"," A decent movie about a family fighting to hold on and make sense of it all.\n"," Sometimes impressive, but a film not without its faults\n"," Good soundtrack and performances, not too original\n"," 20th April 2007\n"," brotherly love\n"]}