{"review-url":["http://www.imdb.com/title/tt0159145/reviews"],"review-text":["Believe me when I say this show is just plain hilarious. The basic story is about Kintaro Oe who travels from town to town taking part time jobs, chasing women, and learning all he can about life. Kintaro has to be one of the easiest to relate to characters ever made. He takes everything to the extreme, and it's just laugh out loud funny every time. From his constant never ending quest to study life, to tiny things he instantly blows up into life or death matters.One of the funniest things about this show is simply Kintaro's constantly extremely over the top expressions and reactions. He spends a great amount of time in various super deformed modes like Dragon Half or Trigun. Other times in less then 0.1 seconds his face will turn not just serious, but manga-fighter-style life or death expressions like a weight lifter trying to benchpress a new record. It's hilarious.If that wasn't enough, the writing is superb and the english voice acting couldn't possibly be better. Kintaro's English VA is just perfect and will have you rolling around when he's not even really saying anything. The one thing to mention though is this is without a doubt an Ecchi series. It practically defines the word. If you're an adult anime fan who can get a laugh out of movies like American Pie, you'll love this.Rirath_com","Although I'm a girl, thankfully I have a sense of humor and realize that this really IS a funny anime! Watching it does give you an overwhelming feeling that it's definitely a guy show but that doesn't take away from the fact that its hilarious! 10/10","I liked this quite a bit but I have friends that hated this. There's no sex, but there's very little nudity in any of the episodes - which is a good thing. Also, Keitaro has a toilet fixation that's explored in at least half the episodes. (Toilets are way more advanced in Japan.) Hmm, I'm wondering why I rated this so high myself...? It certainly isn't that I like naked cartoon girls. In some ways, Keitaro Oe (the main character) is analogous to Johnny Bravo except instead of being an obnoxious, musclebound jock, Keitaro is a hyperactive nerd. Or you can think of him as Japan's answer to Leisure Suit Larry. He's easier to take if you watch it subtitled rather than dubbed, but he grows on you either way if you give him a chance. He IS the Goldenboy. The formula is the same for each episode. Boy meets girl, boy tries to win girl's heart despite being a dorky pervert, boy somehow succeeds against all odds. Typically, the girl doesn't realize she likes Keitaro until after he's beaten to a pulp and/or pulled off some spectacular stunt like engineering a modern operating system in one week or winning a race against a gasoline-powered motorcycle using his bicycle.Episode #1 features a rich software tycoon. I think animating her boobs put a major dent in the budget because she's the only female that has this kind of animation. She also dresses completely unprofessionally. Most people who rate this negatively probably never got past the first episode.Episode #2 has the rich, young daughter who likes to tease. She's only 16 but that's legal age in Japan (and in some states in the US, I might add). Her father is also a brutal yakuzza type that has a reputation for killing guys interested in his daughter. Girl #3 is the sweet innocent daughter of a noodle shop owner that's mixed up with a bad boyfriend. Aside from Keitaro running interference for the maiden and being kissed by a guy, there's almost no ecchi of any kind in this episode - a sharp drop from the previous two. Nevertheless, Keitaro and the evil boyfriend really pound each other.Episode #4 has Keitaro trying to impress a top-notch swimming coach. Keitaro seems more 'direct' about his intentions with this particular girl than any other... and she's pretty direct in return...Girl #5 is the biker babe. She's probably the most top-heavy of the 6 (although not super-buoyant like girl #1) and 'raciest' in terms of sexuality and vulgarity. This particular episode is easily the most over-the-top in terms of (lack of) realism. Keitaro should have broken every bone in his body at least twice during the race against the biker babe but I think the producers and writers said, \"It's just a cartoon! We can do anything!\" This lapse in realism makes it a fan favorite.Finally, episode #6 introduces a new girl (that's works in animation) and the previous 5 girls help Keitaro as he tries to cope with impossible time and resource constraints to get an OAV out the door by the deadline. In terms of ecchi, this one's very tame as well, but there's plenty of humor. The ending has all 5 extremely pretty girls from the past team up to hunt Keitaro, who slips away unnoticed, ostensibly with the intention of gang-raping him. Yeah, that -ALMOST- happens in real life. Someone crossed Ukyo Tachibana (ala Samurai Shodown) with Steve Urkel(ala Family Matters)...All in all, there's no middle ground for this. You'll either hate it or love it. If you're new to anime, you probably don't want to start with this. At the same time, if you can stand characters like Happosai (from Ranma 1/2) or Johnny Bravo... or you like comedies that lean more heavily towards silliness but have very sexual overtones, you should give it a shot.","Simply put, there are two parts of this series that made me cry till my eyes fell out. First: The part where he was set to wash the toilet, but ended up drinking the toilet water while imagining it was the hot director giving him a golden shower!!! (I laughed so hard!)Second: The part where he tried to prove worthy of a swimming school instructor. He seemed like a pro diving in, but as expected, he couldn't swim (proper at least^^). However the funny part of this was when he finally reached the end and said \"how was that\" or something. That was so friggin hilarious, I couldn't stop laughing. If you get the chance to see this anime series, I strongly recommend it. One of the best I've seen. Definitely the funniest!","Golden Boy is ecchi humor (bordering on hentai) in the guise of \"educational moments.\" The main character, Kintaro, wanders around getting himself into the silliest situations involving women... It's just that he's shy on the surface but analyses everything until he can learn something from it. The most striking feature of the series are the circumstances surrounding his \"education\", which are outright embarrassing, yet funny at the same time.","I am a woman, and I found Golden boy to be absolutely hilarious.  I guess I could be offended by the fact that most of the female characters are portrayed as scantily-clad sex objects, but men could be just as offended by the main male character, Kintaro, who makes all men seem like sex-crazy dorks.  Just don't take the show too seriously.  It does have a lot of animated nudity and dirty sex jokes, so don't watch it if that type of thing offends you.  Also, I suggest watching it in the english dub rather than subtitled, because the english voice of Kintaro is much funnier than the japanese voice.","I chose to wrote this review because most others I saw were just commenting on the humor.This anime is very sexist. It crosses a lot of lines. But it is done in such an extreme way that you can't honestly think this is done without a winking eye. More interestingly, the women in this series represent different types of women in Japanese society, stereotyped to a caricature, and thus shows the sad gender roles in modern Japan. You can still die laughing if your humor knows no political boundaries.This anime is very philosophical. Kintaro is an almost Buddha-like figure. Though this aspect, as everything else, is way over the top, Kintaro inspired me a lot during my youth, to the point that I chose to cycle through Japan, which I did two years ago.But really, not to forget, this anime is ridiculously funny. I rarely spend so much time laughing to the point I can't breathe, even though I've seen all episodes for about ten times now.I recommend this to any one who can laugh about themselves, who is interested in Japanese culture, or who's looking for some inspiration on how to lead his life.","Golden Boy is in my opinion one the sleeper / lost treasures animes out there. A sexy comedy, about a young man quest to find his nitch in life and he blunders into all sort of odd jobs that somehow has this rather sexy girl who ultimately falls for him but he not really realizing it!  Its truly something that you can easily miss if you at the name, but once viewing it...will fall for the comedy/silliness that lies inside. Truly a crime that only produced 6 OVA episodes and pilot movie were made. However, being unique as it is.  I'm surprised it survived to produce that many. If you want a good laugh, with high quality anime that is (100% CGI free), check this anime out.  Boy who one day may save the world....or maybe not.","Someone says this anime could be offensive for girls... not really. Embarrassing situations are funny; first time i see this series i was in the video store, people around me started laughing, doesn't matter the age or gender. A teacher said that in order to guarantee the attention of someone in a book the beginning must be entertaining and the ending shouldn't be obvious by just reading the last page. During the first minutes in the series the boy is hit by a car, during the last moments of the series, the same car appears.. Episodes had a touching and funny ending, specially last one. I don't regret to buy these series.","Finally! Other people who have actually seen this show! It is the funniest anime I have ever seen, but most people have even heard about it. It is just hilarious. 'And so kintaro will continue to ride his trusty bike and maybe one day, he will save the world....or maybe not'. tare just some classic bits in it 'and so he will ride onto the next city...because he has no choice since his brakes are broken (study study study)' And some of the lessons that he writes down in his little notebook, 'today i had a very educational experience. I tried to look backwards, but unfortunately I was already looking that way. It hurt. Todays lesson, the human head cannot turn 360 degrees.'","Quite Frankly you'll pee in your pants if you see the entire series but this anime is the funniest there is. i hope they make a new series one day. on the downside i don't see how women could see this anime without being offended.","This is the last episode of the Goldenboy OVA series. Kentaro finds himself working in an animation studio, which is rather interesting if you don't know anything about the way anime studios were run. Besides episode 3, this was probably the least risqué, but it had a nice girl interest, as well as a surprise reunion from others in the previous episodes. My only complaint about this episode is it seemed a little too short, but at the same time this may have only been because it was the only original script for the show that wasn't based on one of the manga chapters. but it ended well, leaving us with the nice feeling that Kentaro is permanently 25, studying on. Definitely watch the rest of the series all the way through, you can buy the whole series for like $17, you can watch it all the way through in about 2 1/2 hours, or watch your favorite episode if you have 20 minutes free time (which i do if i have a lunch break at school.) good series, check it out.","Endearingly silly anime, only six episodes in duration, about a hapless delivery boy called Kintaro (well, he's called a delivery boy, though he is meant to be in his 20's), and the adventures he has on his travels. Each episode sees him arriving in a new town, acquiring a new job, developing something of a love interest before each episode ends with him leaving.Gently sexist, juvenile, very immature at times, this is the kind of anime that just puts a smile on the face.Not one to start with if you are not a fan of anime, as this certainly won't convince you about the genre, but for those who are already converted, this is entertaining fluff.","Though this probably isn't for everyone, I would still highly recommend it. Its funny, interesting, short, and entertaining. Visuals - The animation is some of the best I've seen (so far) in anime. Character movements are smooth and fluid, and the character designs are incredibly detailed. I know that anime backgrounds are often incredibly detailed, but the images combined with the constant movement of characters is just gorgeous. Story - The basic premise is fairly simple. A perverted genius travels around taking on part-time jobs which he quickly masters before moving on. Wherever he goes, he improves the lives of the people he meets. This show actually has several sweet messages about life in there buried beneath the sexual comedy. Characters - Though there is a new cast in every episode, pretty much all the characters have depth and interesting personalities. The writing is very good. The girls featured in this show could've been one-dimensional bimbos, but all of them have lives and are written well enough so that while watching the show it feels like the characters are real and have lives outside of the episode.","The best English dub of an anime I've seen (and I've seen a lot.) It's very funny with a lot of sexual humor, but the main character always acts with restraint even though his inner monologue is going crazy. He oogles too much but is respectful in conversation---It's an interesting watch in this period of reckoning on sexual harassment and assault. Funny stuff, short so no big commitment, I definitely endorse watching this series.","I'll never forget the first time that I saw Golden Boy because I don't think I had ever laughed so hard at anything in my life at that point. This show is absolutely jam-packed with hilarious gags that work almost every time, many of them visual jokes centered around Kintaro's facial expressions. I really have to give props to the animators for how they were able to depict his various emotions. To this day this show can have me in stitches every time I watch it. My only word of warning is that our fearless hero is a huge pervert and this is reflected in his various adventures. The show is about as close to hentai as you can get without actually being there - there are no sex scenes or anything like that but it's still rife with perversion.Nearly a perfect comedy. -1 star because, while the show is funny throughout its entire length, I do find that it peaks early.","Seriously, I think he was extremely daft and he really isn't afraid to be a complete utter pervert! Doug Smith must have had the time of his life when he played Kintaro for the English dub like he was pure nuts lol! The humour I tell ya, was so funny that my jaws nearly broke from laughing so much while watching this anime! Ladies and gents, if you ever feel low or just fed up with life, Kintato would be at your service in making you laugh all day long!","We were excited to rent this one after reading a few reviews and seeing that it scored so highly here.  Well, we got it home and could not believe what we saw.  Its basically comes off as if its written by some hard up perverted old guy who could not help inserting his sexual frustrations and fantasies into an anime film that really lacks in plot and humor.  The main character is all over the place... one moment, he is like an immature little kid, the next moment he is mature and intelligent, then heroic, then a perverted stalker.The worst part is all of the out of place sexual content.  I have no problem with sex and dig a movie that has some good sexual energy, but this is just presented in a way that is creepy.  Nipple slips, close ups of a girls crotch (many times) in white panties, or a swimsuit.  It was totally out of place and it seemed as if the person who wrote it was trying to live out some fantasies through his cartoon characters.  We were expecting something of a mature nature, but we just kept looking at each other and asking what the heck the point of this was... besides jiggling cartoon boobs and poor dialogue.  If you want to see some cartoon characters cleavage and crotch's...  this is for you.   If you are looking for something beyond that, this movie was empty.  The characters and dialogue were just plain irritating."],"review-user":["Rirath_com","brichtr1","ikarix","knut_eugen","blackhawk.sc","Heather21","phraine","Fury9033","elay145","elpollodiablo-3","Hypno-2","wolfecastle86","smellthecult-com-1","invisibleunicornninja","blakejohnson-00273","DoctorNordo","Irishchatter","samkarip"],"review-date":["22 June 2003","10 July 2002","7 May 2006","2 August 2006","7 March 2001","30 April 2002","15 December 2011","1 November 2003","22 June 2008","2 October 2007","22 May 1999","14 March 2007","13 January 2010","19 June 2018","22 November 2017","11 January 2015","10 September 2018","20 April 2004"],"review-rating":["10","10","9","10","8","10","9","10","10","9","7","9","10","9","8","3"],"review-title":[" Solid comedy\n"," funny stuff (regardless of gender)\n"," There's little middle ground for this...\n"," hilarious\n"," The most embarrassing situations\n"," This is one of the funniest anime series ever!\n"," For me one of the best animes of all time\n"," One of a kind naughty Comedy\n"," funny anime even for girls (little spoilers here)\n"," Thank god!!\n"," The funniest anime you will ever see..........if you're a guy\n"," series finale\n"," Harmless nonsense\n"," Really good.\n"," Best English dub ever\n"," One of the funniest shows I've ever seen\n"," I really laughed at Kintaro!\n"," Softcore Anime Erotica with a little humor and plot as filler.\n"]}