{"review-url":["http://www.imdb.com/title/tt0388364/reviews"],"review-text":["Archbishop Desmond Tutu, who is seldom a favorite of mine, said that everyone should see this film as it is something that can help heal the world....It is one of the most poignant movies I have seen and delivers on Tutu's comments.... I have read many comments and while they range from good to average to comments on the choice of actors... The fact is that it deals with one of the most extra-ordinary events in our world. The Truth and Reconciliation Commission.... for the first time a country has opted to air it's horrific history, to find a way forward and to create a way for people to heal...WHile the movie starts out with the White Policeman being offered a chance to absolve himself for brutal crimes and the Black guy is trying to ensure that he does not get away with it, it delves into the humanity of the people and the enormous need for healing that we all need....Definitely a thumbs up..... To everyone involved.... Once again, I am proud to be a South African.....An interesting comment can be found here: http://www.biz-community.com/Article/196/97/5223.html","Not knowing a great deal about the Truth and Reconciliation commission, I can only look at this as a piece of entertainment. I started watching it too late in the evening (recorded from BBC2 earlier this year) but once I'd started I had to watch to the end.The down-side is that it's effectively a courtroom drama - never my favourite genre - but it's stunningly photographed (largely in super-saturated ochres) and well acted. Like a good novel, I couldn't put it down. All the way through, I wished I was watching it in a cinema to do the music and photography justice. What happened to its release in theatres? I'm an admirer of Chiwetel Ejiofor since I saw him in Dirty Pretty Things, and Hilary Swank looks terrific in this - very female and sexy for a change (possibly out of place, but she adds to the visual attractiveness of the film).This picture deserves a wider audience than it seems to be getting.","The Truth and Reconciliation process in South Africa is a vital and probably unique human experiment. This movie does an excellent job of revealing the complexity of the task and the incredible challenges facing South Africa. I believe every one should see this movie as I think few people outside of South Africa understand its past and what is being attempted in the Truth and Reconciliation process. Almost every country has some part of its own history which is still a source of continuing hatred and bitterness. We all need to understand ways of dealing with the past. What's happening in South Africa should guide us all. I found it credible, moving and at times upsetting. There were no outstanding acting performances but this added to the strength of the narrative. Once again the BBC has been instrumental in taking a complex topic and turning out a top class movie.","I saw this film at the 2005 Palm Springs International Film Festival. I went in with the assumption that if it stars Chiwetel Ejiofor and Hilary Swank it had to be at least decent. Well, after a kind of a slow start, I was far from disappointed. In fact, I was quite pleased with the final product.I must admit the Afrikaaner and Xhosa(?) accented English of some of the actors were kind of hard to understand but like seeing \"Waking Ned Devine\", \"Trainspotting\" or any other film with heavy-accented actors I adjusted after about 15 minutes. And I was trying to figure out why Hilary Swank was supposed to be South African and sounded like she was trying to put on an accent but sounded very American... as if she was making a weak attempt at putting on the accent. But later in the film as more is revealed about her character and how she moved to the US as a teen you begin to understand how she might have lost some or most of her accent. So it began to make sense that only certain words might have a Afrikaaner lilt to them.I know it's a little weak for one to use film as education but one of the great things about this film is that it was interesting to see a dramatization of a Truth and Reconciliation trial. I'd heard about the T and R process in South Africa after the fall of apartheid but I didn't really know how it worked.The final verdict is that although some of the scenes felt a little contrived, this was overall a very strong film. The closing sequence where the \"truth\" comes out was the strong finish every film hopes for. A definite must see for anyone who cares about what happens outside their borders.","I was unsure of this movie before renting and did so on the assurance that Hilary Swank has always given excellent performances in her movies. She seems to rely on restraint to gain the emotional impact that she does. And she didn't prove me wrong in this movie.However the movie also had fantastic performances from all other members of the cast both speaking and non-speaking. I have to single out Jamie Bartlett and Chiwetel Ejiofor - the two main protagonists - for their outstanding acting abilities and portrayal of true human feelings and failings. The whole movie ran almost like a documentary.I must applaud Tom Hooper as the director and Avril Beukes as the editor for keeping a multiple layered story being revealed smoothly whilst keeping dialogue and action moving along in an understandable fashion. The opening sequence of the South African landscape was striking and I had to push the pause button to savour the photography.Why can't a movie like this ever get nominated for an International award. It seems to me to hit the high-rating button on all counts. It was not just a film it was a true experience of life in a country coming out of apartheid. A life of poverty was all around but it celebrated the dignity of the human spirit.","The South African lawyer Sarah Barcant (Hilary Swank) travels from New York back to her hometown to represent the member of the Parliament Alex Mpondo (Chiwetel Ejiofor) in the Truth and Reconciliation Commission since torturer police officer Dirk Hendricks (Jamie Bartlett) has made an application for amnesty. The parents of Steve Sizela request Sarah to represent them also since their son that was arrested with Mpondo but has gone missing. Hendricks uses one break in the trial to threaten Mpondo, promising to destroy his political career telling that he was a traitor. But Mpondo, who is a man traumatized with the torture, anticipates and tells what has happened to Steve Sizela and him in the hands of Hendricks and his superior Piet Müller (Ian Roberts). Will the remains of Steve be found and the truth disclosed?\"Red Dust\" is a very well-acted drama about amnesty of torturers, with stunning performance of Chiwetel Ejiofor. The story takes place in South Africa post-Apartheid but could have been in South America, for example, where many torturers have granted their amnesty despite their cruel past during dictatorships. Truth and reconciliation seem to be very difficult to achieve in these situations, when usually torturers grant their freedom and victims are forced to forget what they did to them and live with their traumas and losses. My vote is seven.Title (Brazil): Not Available","I haven't seen a film in a long time that moved me and gripped me in such a way; that I couldn't take my eyes off the screen. I was busting for the loo; and I didn't even want to pause it because I was drawn right in. Emotive; powerful; very moving; horrific and heart-breaking. It gives you an amazing insight to South Africa; their struggles and their lives. The acting by the leads were mind-blowing and the script was incredible. Despite the terrible events that unfold in this film and how horrific the story is; I was captivated. I don't want to even try and explain the story; it's way too complex and I wouldn't do it justice. Please see this; you'll understand why when you do. Cheers, Hol","As a South African, living in South Africa again after a 32 year stay in the UK, I am sorry to say that this movie is a huge disappointment. The three main problems I had with the movie was a) why Swank and Ejiofor - an American and a Nigerian - to play the leads. This country is bursting with talent and has no need of imports... b) Gillian Slovo has been trading off her Struggle credentials for years now. She's a very mediocre writer and even her novel doesn't stand up the flaccid direction of Mr Hooper... and c) Hilary Swank again, such a great actor, as proved in Million Dollar Baby (but that's Eastwood too), here dressed in the contemporary New York style whilst roaming freely around the poverty of the Karoo. Where was the consideration and sensitivity needed by the costumer and director? Yes, the film is ultimately moving - how could it not be? - but the overall mood at the conclusion is one of tremendous letdown. Heart's in the right place but needs a pace maker.","In South Africa the Truth & Reconciliation Commission hear the confessions of those in the former power who took part in crimes, torture and violations of human rights. Those that confess are granted immunity and it is only those that try to conceal their involvement who are open for prosecution. When former police officer Hendricks confesses to the torture of Alex Mpondo, it starts a chain of events. Mpondo pans to contest the amnesty of Hendricks despite his hazy recollection and wants to know what became of fellow activist Steve Sizela, who was arrested at the same time and never seen again. South African born lawyer Sarah Barcant returns at the request of her father to represent Mpondo and try to uncover the truth behind the story.Forgiveness and healing are two words that are easy to say but very difficult to do. It is near impossible for me to understand what the village councils held in Rwanda must be like, where those that massacred others must confess all to gain amnesty; likewise I cannot comprehend the challenges that all involved with the TRC in South Africa have faced  to have people admit to so much but get off with nothing, as it were. This film doesn't really manage to get close to examining that pain because instead it goes for more of a courtroom drama approach that uses the TRC as its frame rather than being the focus. In doing this it still manages to be interesting, even though the serious tone and real setting means it ploughs a pretty straight furrow and cannot indulge in the genre histrionics that it occasionally suggests it wants to do.As a bit of basic insight into the Truth & Reconciliation Commission, the film is still interesting and will probably move those that are somewhat unaware of the situation. However for me it would have been much more interesting to allow a debate to rage, for the sheer complexities of the situation to be aired but, by going for a mystery approach it becomes morally quite clean-cut and not as reality has shown it often can be  only towards the end does it take the time for a bit of thought, which is fine but I would have liked it to have been part of the film rather than an epilogue. The cast would probably have taken to this challenge as well because, although they are quite good, nobody really sets the world on fire. Swank deserves credit for doing the film but she is not that good and seems to have been added to provide a bankable star to drive the courtroom action. Ejiofor is better because he has more complexity to him, although I would have liked him to share more scenes with Bartlett, who is also strong in a difficult role. Roberts is poor because the film uses him as a nice clear baddie for the audience to hate. The direction is mostly good, setting up interesting shots here and there  but the film is mostly helped by the good use of locations, which are convincing and set the sense of place very well.Overall this is a good film but not as moving or as thought-provoking as it could have been. By leading with a straight thriller type plot, the debate and the insight is left to the minority of moments and, although interesting is not all that I had hoped for. The cast are good and the Western cast deserve credit for taking on a worthy subject. This deserves a bigger audience than it is have received and is worth watching if you get the chance.","Red dust is both well acted and well made but what the movie is about i think will bore many viewers as it did to me. There was a film that was out earlier called \"in my Country\" with Sam Jackson and it was not that well received and both films were about nearly the same exact thing, I do think Red dust was better because of the more interesting performances especially by future Oscar winner Chiwton Ejofor but the plot is just to lacking, it starts off pretty strong but then the film hits the viewers with countless un-interesting court room sessions, this could have been a great film if the writing was not so lacking. But see if for the performances.","POSSIBLE SPOILERSNo one is likely to pick up a DVD of Red Dust without knowing that it is about South Africa's Truth and Reconciliation Commission. Hilary Swank stars as a South African exile who returns to her home town as a lawyer representing Alex Mpondo (Chiwetel Ejiofer), a member of the South African parliament who was tortured by a prison guard, Pete Muller (Ian Roberts), who is seeking to escape prison by testifying before the Truth and Reconciliation Commission. They could certainly have found an actress who has or could imitate a South African accent; Ms. Swank makes no attempt whatsoever to cover her unmistakably American accent. Nevertheless she is the only well-known actor in the movie, and it would probably not have been made without her or someone equally well known. She does a passable job. However, Ejiofer and Muller (pronounced in the German way with an umlat over the \"u\") are outstanding as is Jamie Barlett as the chief of police, responsible for murdering Mpondo's comrade and fellow prisoner. The torture scenes are shown in brief flashes but they are vivid and believable. What is not believable is the Truth and Reconciliation process -- except that it actually happened. \"Red Dust\" should be seen for that reason alone because it was and is unbelievable that the ANC prisoners could actually forgive the torturers, and this is as close as we are likely to get to seeing the process in action.","what was the quote by archbishop tutu at the end of the film about a person's past? this film was very disturbing to watch in the sense that it was a true story and to think that humanity is still so cruel after all these years makes me ashamed everyone is human and everyone has the right to live their life in peace and harmony live and let liveif anyone knows the quote please let me know Thank youthis film should be shown a lot more publicly as true events as horrific as these shown in the film should be known to all in the hope that things will change sooner rather than later.","Sarah Barcant(Hilary Swank)is a beautiful human rights lawyer in New York that returns to her childhood village in South Africa. She is returning to work on the case of Alex Mpondo(Chiwetel Ejoiofor), now a member of South African Parliment, who is bringing charges against policeman Henricks(Jamie Bartlett), who beat and tortured him in 1986, because of his political activism. Alex's best friend was arrested at the same time and suffered the same injustices, but was never seen again. Police Captain Muller(Ian Roberts)has a lot to do with what happened, but wants to be left out of the proceedings. An emotional driven story about South Africa's Truth and Reconciliation Commisson, that traveled the country in 2000, conducting hearings to grant amnesty for apartheid atrocities. Gripping and provocative.","Where this movies differs from traditional Hollywood movie is that it shows a true depth of feelings. In Europe for example we've had years of war and though one nation could never eradicate the other, the old enemies always ended living next to each other or WITH each other at the end of the conflict. In the US, the immigrants white population exterminated the aboriginal population to near extinction. the US citizen never had to live with its enemy. This explains in my view the often simplistic nature of Hollywood movie when they try and explain a foreign country's strife. But in this movie, the director and screenplay did not fall into this cliché. It turns out everyone in the story has some right and some wrong. it's a great story of morality, hidden truth and compromise.","...and normally i don't like surprises!! Watch this movie by chance in a motel in South Africa second week of a three month motorbiking holiday in ZA. Apart from being well shot and acted it helped me in understanding the countries problems tremendously. Just watched the \" Million Dollar Baby\" and had to look up Hillary Swank since the name sounded somewhat familiar and her acting was superb. Didn't realise she was the solicitor in the \"Red Dust\". Well now i'm not to worried that she will disappear as so many other sidekicks of Clint before... Now i am being asked to write ten whole lines of comment which is rather ridiculous for i have written what i wanted to write. OK, here it goes: I think if you are from a western country, especially Europe, watching will help you to understand a little better why what is happening is happening down there! So this hopefully will fill ten lines.","We saw this film in Toronto at the Film Festival last year. It was a truly moving experience. I had heard of the Truth and Reconcilliation process, but as others have written, did not know much about the details of the process. This film demonstrated the process and the growth that can occur when people are able to face up to their pasts, understand the events from the points of view of others involved, and grieve together. Archbishop Tutu and the others involved in developing the T & R process deserve recognition for their understanding of human emotions. Seeing this film gave me hope for the human race. If we can do T & R, we just might not destroy ourselves. People will look back at T and R as the first step out of human adolescence and toward maturity.As a film, of course there were flaws. I did not notice any major problems in acting, directing, or writing - but for the first time in years I was totally lost in a film, so perhaps I did not notice.See this film. The audience in Toronto would not give up the stage for the next film, we had so many questions and comments for the stars and director. Tom Hooper, Jamie Bartlett, and Chiwetel Ejiofor went outside to the sidewalk to continue the conversation. People came by just to shake their hands and thank them for the film. It moved us all."],"review-user":["fastisfun","davek28","joekea","puckhead95","karenst-2","claudio_carvalho","holza1980","MikeL90","bob the moo","Johnny10","gelman@attglobal.net","sarahmumoftwo","michaelRokeefe","imdb-olivierboennec","michieichi","NancyMich"],"review-date":["5 June 2005","18 August 2005","9 July 2005","2 March 2005","4 June 2006","13 January 2014","15 October 2006","17 May 2005","11 August 2005","4 August 2006","30 June 2008","25 November 2008","20 January 2007","12 July 2006","22 December 2005","4 August 2005"],"review-rating":["10","8","10","8","9","7","10","3","7","7","10","6","9","8","10"],"review-title":[" Red Dust\n"," Beautiful, absorbing and thought-provoking\n"," A movie everyone should see\n"," not perfect, but very good\n"," An amazing movie about personal redemption\n"," Truth and Reconciliation?\n"," Very Emotive and Powerful\n"," A great shame\n"," Loses potential by being based on a typical genre plot but is still worth seeing for what it does do well\n"," brought down because of the story\n"," Truth and Reconciliation\n"," quote\n"," Sometimes justice is debatable; but fair?\n"," Living with your enemy\n"," a positive surprise...\n"," A moving film about a historic process\n"]}