{"review-url":["http://www.imdb.com/title/tt0312859/reviews"],"review-text":["I am a big follower of Indian Movies especially Malayalam and Tamil.Shame on India for not sending this movie as their official Oscar entry. I have seen this movie and it has clearly revealed to me the maturity Tamil cinema has in its screenplay and narrative which bollywood better catch up with.By the way to all we westerners, Tamil Cinema is more qualitative and very different from Bollywood which is all about good looks glamour and promotion.Coming to the point what was India thinking when they sent a movie like 'Devdas' to the Oscars? That was a really a Masochist move. I think they are trying to punish Oscar judges with boredom by sending Devdas since the judges toppled Lagaan last year.'Devdas' is just a brigthly colored but stale and predictable melodrama of Love, fate and destiny. I would keep away from it. Anyway, not sending a movie like Kanathil Muthital shows how much of a revamp Indian administration needs to save them from poor administrators who lack intelligence. Now I know why this country has so many issues. They are heavily talented but not showcased properly.","I saw this film at the 2002 Toronto International Film Festival.This is the first Indian film I've seen in the Tamil language, and while it does share some similarities with other Indian films (wonderful music and choreography, sweeping storyline), the director attempts more than just to entertain. The film tells the story of Amudha, a precocious nine-year old whose parents reveal to her that she was adopted, thus beginning an odyssey that takes them all from India to war-torn Sri Lanka. Gorgeous visuals mix with horrifying scenes of violence expressly to make a point, though it is a simplistic one. Amudha is played by P.S. Keerthana, and she is one of the few child actors I've seen who can be precocious and yet not annoying. Her charm and beauty held the film together.","This movie was astonishing how good it was! The plot is extraordinary, and the acting spectacular. At first I thought this wasn't going to be that great because of a summary, but after about the first five or ten minutes of the movie, it struck me that I was dead wrong. I literally cried about four or five times in this movie, and despite this, I must've watched the same scenes over and over again about thirty times in one week! No, the song scenes were not as awesome as they could've been, but the plot is what really gets you. American or Asain, I would recommend this to anyone--and I have now. I guarantee that after seeing this one, you'll get the best out of it, and its plot. I hope you feel the same, and write a rave review too!","The Director of Kannathil Muthamittal directed the first Indian film I had seen \"Dil Se\" which led me down the path of buying well over 122 Hindi DVDs in thecourse of four months.  I can say I understood the total attraction, I wassomehow confused as to why the film would stop for \"music videos\".  It was an excellent movie, I didn't know what to make of the dancing and the femalevocals were a bit shrill for my western ears, but somehow I found AR Rahmen's score hypnotic. I bought the soundtrack the following day and then Lagan, Kuch Kuch Hota Hai and K3G the following week and with the exception of \"Ichi thekiller\" a few other Korean films , I can't be bothered to watch much else. Kind of strange for someone who has only watched a strict diet of Hong Kong, Horrorand Action/Science fiction films for the past 30 years.\nBut I should get back to Kannathil Muthamittal, It is one of the Mani Ratman's latest efforts and I laughed, Cried, Got totally mad, terrified and most of all I didn't feel manipulated. The acting was superb, the photography was beautiful, I think you could stop the movie at any given time and would notice that any give frame would be worthy of painting. The music fit the movie perfectly and after thecredits rolled, I wanted to watch again... so I did.It would be foolish to discuss the plot for fear that you may miss the pleasure of watching the events unfold and the characters develop. This is what great film is all about! I stood and applauded in my home theater when it was over!My wife is watching now, and I can't wait for her reaction, I can't expect it will be anything less than mine.","Kannathil Muthamittal was simply one of the most touching and sincere movies ive seen in a long time. the story of an adopted girl who on her 9th birthday learns the truth about her parentage. she sets out in an endeavour to find out more about her real mother and learns that her mother is now a terrorist.the greatness of the movie lies in its simplicity. mani ratnam generally has a tendency to create unreal and pompous overblown characters in this movie, every person seems real and their interactions are touching and sincere. this is the reason why this ranks as one of his best movies.the movie is emotionally draining and tugs at the heart of the viewer, keerthana as the 9 year old amudha and simran as her adopted mother are simply brilliant. their relationship is the cornerstone of this movie. there are some notable flaws here, particularly the scene where amudha learns that she is an adopted child is jarring and seems totally unreal. it is hard to believe that such sensitive parents would break such a news in the manner that they did. another flaw is, surprisingly enough, the brilliant songs. they again seem forced and stand out, not gelling with the rest of the script.having said these, this still is one of the most poignant and beautiful movies to come out of india in a long long time. this beauty is not just in the script or characters but in teh technical brilliance as well, ravi chandran's camera work is sheer poetry. all characters perform creditably and the realistic humour, especially in teh flashback scenes are entertaining.a sincere 9!!","Sri Lanka... not a country I've ever given much thought to, I have to admit. I didn't even know it was near India, let alone that there has been a bloody civil war going on there since 1983. It seems that the rebels of the Tamil minority have been in an ongoing conflict with the military regime that runs the country for many years, causing many deaths and widespread suffering on the island.Mani Ratman's latest film, A PECK ON THE CHEEK, tells the story of a young girl named Amudha, who is separated from her Sri Lankan parents by the war and raised by a young Indian couple. Amudha is a bright and mischievous girl, whose life is turned upside down when her parents tell her that she was adopted as a child. Although her adopted parents love her as much as could be, and have raised her without prejudice along with their biological children, Amudha cannot help but want to learn more about her biological family.Mani Ratman is probably best known for his 1998 film DIL SE, which hides a story about terrorism and politics inside a love story (or is it the other way around?). A PECK ON THE CHEEK inhabits similar territory, but is perhaps more ambitious in the ground it covers. The central theme that binds the movie is of love between all the various members of a family, and especially that between a child and her adopted parents. It's a pretty honest and open look at feelings, that can be extremely touching and heartwarming at some times and quite painful at others. It's an emotionally complex film, with characters that are somewhat idealised but still behave in a very human way.The film revolves around 9 year old Amudha, played with charm and vivaciousness by young actress P.S. Keerthana in her first and only acting role. She's a princess and a monster, always getting into trouble but so disarmingly charming nobody can stay mad at her for long. The young actress is perfectly cast for the role, and does a tremendous job in the various and often difficult emotional scenes required of her.A PECK ON THE CHEEK has such an innocent name I was quite unprepared for the intensity of the experience. Never has such a small act come with such an enormous emotional impact, I dare say. The film is a bold and artistic effort to explore issues that are not frequently covered on the silver screen.Mani Ratman's direction is superb, very confident and mature - the most sophisticated work I've seen from this director yet. The film is visually very stylish, with some excellent camerawork and imagery. A.R. Rahman provides the film's soundtrack, which is not as good as his classic DIL SE or BOMBAY music (based on first impressions at least) but still shows his great musical talent.I'm not aware of a DVD release for the film yet - I saw it in Tamil with English subtitles thanks to the San Francisco International Film Festival, of which the film was undoubtedly the highlight. The production is a truly world class effort, and I am sure it will be popular with western audiences as it begins to receive wider exposure.Recommended.","In Sri Lanka, a country divided by religion and language, the civil war between the pro-Sinhalese government and the Liberation Tigers of Tamil Eelam (LTTE), a separatist organization, has claimed an estimated 68,000 lives since 1983. Human rights groups have said that, as a result of the war, more than one million people have been displaced, homeless or living in camps. The impact on children and families caught in the conflict is sensitively dramatized by acclaimed Tamil director Mani Ratnam in his 2002 film A Peck on the Cheek, winner of several awards at the National Film Awards in India. While the civil war is merely a backdrop for the story of a young girl's voyage of discovery, the human cost of war is made quite clear and Ratnam gives the fighting a universal context, pointing the finger at global arms traffickers as the source of wrongdoing.Beautifully photographed in Southern India by cinematographer Ravi K Chandran in a setting mirroring the terrain of Sri Lanka, the film tells a moving story about an adopted 9-year old girl who sets out to find her real mother in the middle of the fighting in Sri Lanka. Played with deep feeling and expressiveness by P.S. Keerthana in a memorable performance, Amudha is brought up by a loving middle class family with two younger brothers after her natural parents Shyama (Nandita Das) and Dileepan (J.D. Chakravarthi) were forced to flee when the fighting broke out, leaving her in a Red Cross camp. In a loving flashback, we see Amudha's adoptive parents, father Thiru (Madhavan) a prominent Tamil writer, and mother Indra (Simran) a TV personality, marry to facilitate their adoption of the darker-skinned little girl.Young Amudha has no idea that she is adopted until it is sprung upon her abruptly on her ninth birthday, according to the parents' prior agreement. While she is playing, Thiru tells her almost in a matter of fact tone that \"you are not our daughter\" and the response is predictable. Distraught, she questions who her father was, what her mother's name was, why she gave her up, and so forth but few answers are forthcoming. Amudha runs away several times until her parents agree to go to Sri Lanka to help her find her true mother, now a fighter for the Tamil separatists. The family's immersion in the reality of the civil war leads to some traumatic moments and difficult decisions, handled mostly with skill by Ratnam, though a sequence where the family was caught in a crossfire felt amateurish.A Peck on the Cheek is of course a Bollywood-style film and that means tons of music and melodrama. The melodrama did not get in the way because of the strong performances by the lead actors; however, I found the musical dramatizations of songs by A. R. Rahman counter to the mood of the film with their slick, high production techniques and fast-paced music video-style editing. Yet the compelling nature of the story and the honesty in which it is told transcend the film's limitations. Tamil cinema has been criticized by many, even within the country as being too clichéd and commercial, yet A Peck on the Cheek is both a film of entertainment and one that tackles serious issues. That it successfully straddles the line between art and commerce is not a rejection but a tribute.","Mani Ratnam's 'Kannathil Muthamittal' is another of the movie from his 'political terror' series (along with films like 'Roja', 'Bombay' and 'Dil se'). It tells an intense story about 9 year old Amudha who, with the help of her adopted parents, seeks to find her birth mother in Sri Lanka. The movie is set with the backdrop of the civil war in Sri Lanka. With the help of the actors, Ratnam terrifically demonstrates the depth of the relationships between the adopt parents and the child. Their unconditional love for Amudha brings them all the way to war-driven and terror stricken villages in search for Amudha's answers. In a beautiful scene, even after being attacked and escaping a fatal encounter, Indra, for her daughter's satisfaction, bravely suggests without hesitation that they go to the park to check if Shama has arrived.The cinematography is wonderful and the sets and the exotic locations are mindblowing. In addition to that there is A.R. Rahman's soulful score. I loved the songs, the title song being my favourite. The soundtrack reminds us Rahman's older music. I did not like how the last song was visualized on the father and daughter. It uses the clichéd meditation scenes, the Buddha statue (ridiculously positioned at different angles) and the typical monks-walking-at-the back. While many of the songs are beautiful, they look a little out of place. A question, why was Amudha so obsessed with finding her biological mother while she asks no questions regarding her biological father.'Kannathil Muthamittal' boasts of some very strong performances. Simran delivers a beautifully understated performance who loves her daughter no matter what. Madhavan is sublime. His intensity and restraint prove what a skillful actor he is. Young actress P.S. Keerthana holds her own with these professional actors. The film centres around her and she does a fine job by pulling it off. Nandita Das is fabulous. Prakash Raj is irritating and his Sinhalese is all wrong.Though 'Kannathil Muthamittal' revolves mainly around the Tamil people, the film is, in a way, arguably a bit partial as it shows how the war has affected the Tamil people in Sri Lanka without implying how this also had severely dangerous consequences for the non-Tamil Sri Lankan. Then again, the war is only a part of the film as 'Kannathil Muthamittal' is more about the unconditional love between two parents and their daughter. This is another outstanding movie by Mani Ratnam before he went downhill with movies like 'Yuva' and 'Guru'.","I finally snagged a copy of Kannathil Muthamittal through Netflix and spent New Yera's Eve watching an amazing drama unfold. It began with Shyama (a winsome Nandita Das) getting married to Dhileepan in the backwaters of Sri Lanka and then a war takes over their romance. Shyama has to flee to India and is in a refugee camp as she gives birth to a child. Several years later we see Amudha, a playful well-loved child (P. S. Keerthana), who is the darling (or burden) of teachers, parents and fellow schoolmates alike, in a very How to Solve a Problem Like Maria sequence. On her birthday she is told by her parents Thiru (Madhavan) and Indra (Simran) that she is not their biological child, she was adopted. This tilts her confident love-filled world and she constantly dwells on why her birth mother left her. Several attempts at truancy later the adoptive parents take her to Sri Lanka to try to find her birth mother. The country is torn asunder by a raging civil war and the trio are inevitably caught up in the mess. But this also leads to their meeting the new Shyama - one who finally is confronted by Amudha and asked why she abandoned her daughter.The story of a child who has to grapple with the fact that she was abandoned at birth, her obsessive drive to reconnect with her birth mother, the unconditional love of the adoptive parents, the demons that drive the birth mother, the normalcy of Chennai and the horrors of terrorism ravaged Sri Lanka - Mani Ratnam made a masterful film that blended many ingredients into a saga that is soul stirring. AR Rahman's music beautifully complements the magical and the poignant moments in the film. The film has excellent performances from Madhavan, Nandita Das, Simran and an absolute stunner role as Amudha - the abandoned one - done by the child artiste P. S. Keerthana. This performance won her a National award.The cinematography is visual poetry - each frame is beautifully crafted and breathtakingly shot. I am intrigued by the connection Mani Ratnam has with terrorism, love and obsessions. I think his exploration of these subjects is absolutely outstanding. Mahadevan's character was quite unique - his passion and idealism did not make him selfish, rather was well matched with how much he cared for the little girl. His one liners were hilarious. The mother played by Simran was also quite multi-dimensional - she was idealistic, loved the adopted daughter but also worried about her biological kids. The shock, angst, and obsession of the child Amudha was outstandingly portrayed by P. S. Keerthana. Her wide accusing eyes did most of the talking. In fact the enigmatic characters were those of Nandita Das, and her husband. Perhaps Mani deliberately made them mysterious so as to not give us overt ideas of why they were the way they were - the enigma of why a terrorist becomes what he or she becomes. It also kept him from being judgmental - this was another conflict in which he took no sides but merely reported while showing the human tragedy.Kannathil Muthamittal is visual poetry and a soul stirring drama - I rarely weep in the movies, but this one left me moist eyed and a little heartsick. This is a beautiful film - a treasure and a keeper if you can find a copy; beg borrow or steal one today and watch the film!","The film has Maniratnam written all over it. It is subtle in its content, yet manages to be in-your-face with some trademark-Maniratnam blunt dialogs and blunt visuals too. I've only seen Spielberg and Benigni who have managed to balance subtlety and directness wonderfully. Maniratnam is not their class but very close on their heels. At times he is better than them!The performances are superb, the production values are excellent, particularly the camera and art direction. Yet I have to mention two let downs in the movie. One is sort of major - Rahman's background score. It had a widely fluctuating quality - at times (in the final scenes and in the scenes following Amudha's birthday) bordering on superb and at times (in most of the war scenes, in the scene when Amudha sees the young LTTE girls) downright intrusive. The second one is a minor let down - editing. The movie could have used a good 10 minute trimming in the middle stages.\nThe first half hour is a series of disjointed events thrown at you at a rapidfire pace, which may not be easy for even Tamilians to follow, not to say how difficult it is for the Western audience. Yet, being a Tamilian, while I relished the first half hour of the movie so much, I can't help but wonder how much of that brilliance remained after translating the dialogs. Personally I had a very hard time translating all the comedy in the movie when I attempted it for North Indians and Americans!That said, I have watched the movie 5 times already. I don't think I'll stop watching it anytime soon. One of the best to come out of India, heck, one of the finest movies ever made. Kudos to Maniratnam and the entire team!A hearty 8.5 out of 10.0!","Mani Rathnam is seriously a World Class Talent. If he had been working in Western Countries he would be considered in the same league as Stanley Kubrick, Stephen Spielberg or Martin Scorsese.With Kannathil Muthamittal ( A Peck on the Cheek) he has taken the two sensitive subjects of Adoption and the Civil War in Sri Lanka and linked them together to make a heart wrenching story.The entire cast is superb. Special Mention should go to P.S. Keertana who acts like a veteran despite being so young. Simran and Nadita Das should also not be forgotten.Mani Rathnam's directs as always with flair and purpose. He is not as flashy as in his other films but this suits the story.Overall this is an excellent film. Mani Rathnam please make more films! Also hopefully he will soon get the international recognition he so richly deserves.","When I stepped into the theater, I thought this was going to be a great movie. And I was not disappointed one bit. WOW! This movie is brilliant! The emotions felt through out the whole movie are extraordinary! Great acting by Madhavan and Simran. Beautiful music by A.R. Rahman. This might most probably be the best Tamil movie I've seen in ages. Mani Ratnam has yet again proved that he is the best in making meaningful and heartfelt movies.This movie is basically about a young girl (P.S. Keerthana) who is in search of her biological mother (Nandita Das) who abandoned her in a refugee camp to fight for her country just like her husband (J.D. Chakravathy). A young novelist (Madhavan) finds out about this young girl's story and decides to write a story about her. He and his wife (Simran) decide to adopt this young child but one day she finds out that they are not her real parents and decides to search for her biological mother.This movie really screams EXCELLENT. The way Mani Ratnam presented the movie is magnificent. My Rating - 10/10","This film is absolute gold. If you haven't seen it, do. Mani Ratnam outdoes himself once again. This film introduced me to Nandita Das as well, though everyone shines in this movie. My only regret is I've never found a copy with subtitles to the lyrics of the songs. We are led from the jungle of northern Sri Lanka to the serene beaches of Southern India, as well as from the terror of war to the ultimate conquest by love of the human heart. Beautiful, subtle, witty, with a few hidden surprises waiting for the viewer, this movie stands up to being seen again and again, and the story within the story, The Umbrella, is done so well, as we watch the scene unfold from drawings in a book. Lovely. Watch it.","Mani is back wit a Rathnam(gem) he manages to capture the mental trauma of a small girl searching 4 her mother they way he goes about showing the problems-in Ceylon is a treat.. .. Tis movie is a must watch.the musical score does enhance the viewing pleasure.. Rahman a find of Rathnam has given some great tunes the lyrics r apt 4 the movie the locations used for the movie are very good and makes viewing pleasant the movie starts of in a light manner moves over to capture the feelings of the girl finally goes on o shed light into the life of people in war torn places across the world this is yet another classic from ManiRathnam","One more classic performance by Maniratnam and his team. They can be proud to show this movie at all film festivals for it has got everything that needs to name it as an \"all time classic\". The war and its impacts in Sri Lanka through the eyes of a ten year old girl is the movie all about but the scenes and circumstances will surely be not the one that you will expect. Madhavan no wonder he is one of the best actors in the country who can always add beauty and unique identity for the role he plays, and it needs real daringness to act as a father for three kids when he is considered as a dream boy with a glamorous personality in the industry. Music by AR Rahman makes the movie a special one for those who love melodies. Above all the story and the way it is told makes it as the best movie in the recent times.","I think this is one of the best tamil movies i've seen in a while. i love the fact that it doesn't revolve around a guy and girl falling in love and they made the movie brilliantly. The cast did a great job and i especially congratulate the litte girl. She was brilliant and really brought out the feeling of an adopted child searching for her real mother. Best of all are the songs, beautiful music and moving lyrics. There are some great songs in this move ya'll! especially 'Kannathil Mutthamittal' and 'Velai Pookal'. Great songs, both of them. I highly recommend this movie to anyone who wants to enjoy a good cry and some great acting (and superb songs! ). Cheers Simran.","You don't have to be a tamilian to appreciate this gem of a movie.I don't know a word of tamil and saw this movie only because a friend had recommended it to me.Understanding a movie without knowing the language is quite tough but I could make out the story because the lead actors (and actresses)emoted really well.And the little girl was really cute (she wasn't irritating like child actors in most hindi movies).The story is really touching and hats off to Mr. Ratnam  for trying something different.The relationship between the parents and their children are shown quite realistically.(I could identify with the characters in the movie).It was alltogether a movie that will remain  in my heart forever and I wouldn't hesitate to recommend it to my friends.Also the songs are just out of this world!They were beautifully and meaningfully picturised.If only I could understand the right meaning of the lyrics:(","To tell you the truth, I do not speak Tamil, and I did not understand the film. My good Tamil friend, Kaneswaran Kumarswamypillai (wow, what a long name), explained every thing to me. What a great movie!!! After watching this movie, I felt I should have watched many more movies from Tollywood (Tamil Film Industry). The war scenes were amazing, camera work excellent, and plot beautiful. The actress \"Simran\", what a beauty. Give her an award for best looking someone. Ding, Ding, Ding, come on I smell a OSCAR winner. I didnt understand the songs, but they were excellent. Mani Ratnam is a great director, and I hope his next film was a success.","Hello all! I went to this movie without any expectation though I knew Maniratnam would've given an excellent film! I was stunned!! The backdrop is the struggle between the tamils settled in Sri Lanka and the government.  The story is about how an young girl Amudha who lives with her foster parents at Chennai, India leaves to Sri Lanka in search of her real mother. The high points of the film are the performances of every actor and actress and ofcourse, the cinematography, editing and all other technical details. Full marks to the cast and crew. I have to mention about the cinematography as it brings out the war in such a way that you feel yourself being there. Excellent work! Though the war sequences reminded me of Saving Private Ryan, such a work was never attempted on Indian Screen. Overall the movie is great! And hats off to Mr.Maniratnam.Mani Ratnam has once again proved that he is a director who can take Indian cinema to great heights! I would love to watch this film again and again. An excellent film and a must see.","Kannathil Muthamittal is for sure a great movie. I have to give it to Mani Ratnam for a great directing job and A.R. Rahman for great songs. The camera work is just excellent and is similar to Black Hawk Down and Saving Private Ryan. I will be shocked if this movie does not win an Oscar for Best Foreign Film or even Best Camera Work.","Separated from her new husband by the war, Shyama flees Shi Lanka with other refugees despite being pregnant with their child. Alone, young and with no real hope for a future Shyama puts her girl up for adoption. Years later and the girl (T. Amudha) is living with her mother and father (Indra and Thiruchelvan) happily. Despite her still being quite young, Indra and Thiuchelvan take the decision to tell Amudha that she is adopted  causing her a certain amount of distress and making her run away fro a short time. Back home and forgiven, Thiruchelvan tells Amudha the story of how she inspired his writing and how she caused the marriage between him and Indra.Inspired by real stories of adopted children from this area, I was attracted to this film because it appeared to be different from some other Indian films I had seen (specifically not a three hour romance with an album full of songs in it). Although I am aware of the situation in Sri Lanka, I had never learnt enough to appreciate the impact on the populace in terms of refugees etc and this film did shed light on that to a certain extent. The plot focuses on the impact on Amudha  born out of her country and into an adopted family. For no other reason than to kick-start the story, her adopted parents decide to tell her that she is adopted and seem genuinely surprised when she is upset and then wants to find her mother! This sort of thing happened a couple of times and, although it got the film moving into wider issues, it was a problem that it was written in such an unconvincing fashion and not attached to reality. This also takes away from the emotional impact because you might find the characters hard to believe in. Despite this the film is still worth seeing and just about manages to get away with the sudden sea change between small story to conflict zone footage and moralising.Of course it is still a bit moving and is generally quite interesting while avoiding the terrible clichés of all the Bollywood films that tend to make it to the UK cinemas. Those films are usually overblown affairs about a boy and girl in love (but with an obstacle to happiness) and loads of songs. Here the film still tends to overdo things but it is a smaller story based in reality and was more interesting and accessible to me. The script is a bit problem and the sudden move to depicting the civil war in Sri Lanka is a big step that would have been a problem had I not been interesting in it already. A big part of it working is a natural and convincing performance from first timer Keerthana. She is very good and I found myself easily caring about Amudha because of her work. Madhavan wasd a lot less convincing and was too stiff and unrealistic in his character  maybe this sort of performance is OK in crowd-pleasing fairy tales but it was just poor for the most part in this film. Simran was pretty good but the real maternal emotion comes from Das in a small but key role in the film. With all the adults doing OK it is left to Keerthana to lead the film and she does very well apart from a few moment where you can she her giggling behind her hands when she shouldn't be.Overall this is an OK film but not as smooth and as effective as many others have said. Unlike many Indian films, the songs are restrained numbers that support the story rather than dominate it and the direction is good  again quite restrained and good at drawing the beauty out of the surrounding as well as staging large action sequences. The acting is a bit mixed but Keerthana is impressive with a natural, convincing and likable performance.The material is a problem though as some plot turns lack any sense of reality or logic while the jump from domestic drama to social commentary and moralising is a pretty bit one and is also a jump too far.","Hey sophocles, Indian Movies generally SUCK!!!Can you name an Indian film that is as powerful as The Godfather? Or Gandhi>? Or Amadeus? Beautiful Mind? Schindler's List?\nIndian actors rely on artifice rather than reality. There are few character actors in Indian cinema. I admit I am speaking mainly from the perspective of Tamil Cinema, but I am familiar w/ Hindi movies as well.\nalmost ALL Indian films rely on actors that portray the same stock characters. These actors seem to have NO range whatsoever. Where's the Indian Brando? (Amitah Bacchan doesn't count). Pacino? Daniel Day-Lewis? Where's the actor willing to bury his personality for the sake of the character?Why are Indian films ALL frickin' musicals?Kannathil Muthamittal has GREAT acting, ok, not great, only great comp'd w/ Indian movies, but good even by western standards. In contrast, I tried to watch Lagaan, and I couldn't watch such pointless drivel\"Emotional hammering of Indian cinema.\" You're kiddding me right?How about, boring, stupid, inane, unrealistic, over the top, melodramatic?\nThe only indian films I liked so far are this one, the Terrorist, and another of Ratnams' films, Thalaapathy.Perhaps, b/c you are a N. Indian, and don't understand Tamil, maybe it put you in the position of a foreigner? I noticed that all the other films you have reviewed are Hindi ones.I am a Sri Lankan by birth, Tamil-speaking and I LOVED this film; perhaps I am biased though.","I have seen this movie when it was released and no doubt it is heart touching. I liked the point of view of a kid who came to know that what she was thinking about her were actually not true. It's a shatter to that small kid. And her search to find out who she is. And before and after she knows about her, the relationship between her and her foster-mom. That's a nice view. A R Rahman adds his stress by a good re-recording and songs. In this movie mani ratnam does not exaggerate or give advices (like in Vuyire) but simply narrates the characters as they are . And because of that the film exactly strikes the audience. The pool bath scene of chakkarvarthy and nandhitadas did not convey perfectly what it meant for. Mani Ratnam has amazingly improved.21-04-2010: Now I can see how cunningly lots of scenes are put in this movie against the (so called) terrorists. E.g. The kids with guns and in terrorists uniform is a much deliberated scene to damage the freedom movement's motives. But the director clearly captures the 'deadliness' of the rebellion movement (wheel chair sequence). No leader will cry like a baby as Nandita Das cried here. It was completely unnatural but a good masala to Tamil audience.","When you want to celebrate life and love, especially for precious little daughters, you have to shout it from the countryside.  And what gorgeous countrysides!  There are so many tears of joy even God joins in.  See this movie.","Mani Ratnam has made movies similar in plot to Kannathil Muthamittal, which were Roja (narrating a love story amidst The Indo-Pak cold war for Kashmir) and Bombay (Another love story with Mumbai communal riots of the 90's in the background).This one is also a love story.. but of the love between a daughter longing for her mother who was compelled to leave her behind in the predicamental situation created by the war between the Sinhalese and Srilankan tamils. So much so for a story which can be summed up in one line.But this is where the mastery of Mani Ratnam (his name rightly translates as a 'gem') comes in place. He has the immense talent of weaving a violent situation with an equally tranquil and lovable plot with so much of an ease that one wonders how could he make this possible ! His delicate narrative style of story telling is visible in each and every frame of his celluloidal portrayal. Be it the light moments between the girl and her adopted family, her constant frustration and persistent desire to meet her real mother, the miniature representation of the clashes between Sri-Lankans and resident Indians telling the story of an otherwise vast catastrophic situation present around, or the brilliant climax where even a cold hearted murderer would sob... He is all around with perfection personified.And I must add that this is not limited to only one of his movie, it's there in every film which he presents as a gift to cinema lovers who crave for the element which makes it all the worth watching. Like all the other movies of his.. he makes a statement strongly conveying that peace and love be abided where violence and animosity prevails...Equally commendable is the award winning score of the Oscar winning musical wizard A R Rahman. Mani gives justice to every song of Rahman and like in all of his movies, Rahman's true genius gets revealed yet again. The cinematography is also worth more than a mention.Hats-off to this brilliant effort of conveying a message of affection and harmony... Let there be more of it because the world needs it the most now..."],"review-user":["ashcoounter","mcnally","rang_de_basanti_girl_976","mitch-97","m_madhu","simon_booth","howard.schumann","Chrysanthepop","HeadleyLamarr","learnnew","raamjaane","nhariharan91","jbrooksci","johnjeevinth2","mugamoodi7","candycloudz13","mystique13","Cycan","mayagrafx","Tamil Cobra","bob the moo","ponduranga2002","AshokePrabha","vvanpo","nupur_230361"],"review-date":["30 January 2003","11 September 2002","3 May 2007","10 September 2002","14 April 2002","1 May 2003","11 June 2007","19 November 2008","2 January 2008","12 September 2002","25 April 2002","24 August 2005","9 January 2009","11 November 2006","30 October 2006","4 September 2004","8 July 2002","7 April 2002","5 April 2002","31 March 2002","9 November 2004","7 April 2003","31 October 2002","26 May 2003","17 December 2011"],"review-rating":["10","9","10","10","9","9","9","9","10","10","10","10","10","10","10","10","10","9","10","10"],"review-title":[" How did they miss this movie?\n"," Deeply touching...\n"," Wow!\n"," If not perfect, what is?\n"," realistic and touching ... an emotional drainer\n"," Splendid\n"," An entertaining film that also tackles serious issues\n"," The Unconditional Love Of Two Parents\n"," The two faces of motherhood.\n"," Sensitive, top-notch film from a great director ...\n"," A Great Film by a world class talent.\n"," Most probably the best Tamil movie I've ever seen in my life\n"," Absolute gold\n"," a great movie\n"," The best in the recent times\n"," superb movie\n"," A cinematic gem!!\n"," WOW!!!\n"," An excellent film!!!!!\n"," Maybe the greatest Tamil Film I have ever seen.\n"," Refreshingly different from the normal Indian fare pumped out into our multiplexes but a tad overdone and in need of just an extra kick in the script\n"," That sophocles guy is WRONG!!! This movie RULES!!!\n"," Search of a kid.\n"," Sumptuous\n"," A peck ... not on the cheek.. but in the heart\n"]}