{"review-url":["http://www.imdb.com/title/tt0370244/reviews"],"review-text":["The third film I got to watch at the philly film fest was this outstanding drama from Japan. After breaking out of prison nine escaped convicts plan to find the \"key to the universe\" that a tenth convict who didn't break out told them about. Along the way we get to know each of these men fairly well. Each has their own dreams. For much of the movie it seems to be mostly a comedy, but a shift takes place that the film ends up a tragedy. All of the actors give great performances. I can't say much more without spoiling the film, but suffice it to say that you end up feeling for some of these individuals. At 2 hours, this film is a tad to long, but good none the less. I have no qualms recommending it with the warning that it does have a bit unsettling violence for the tender-hearted. Toshiaki Toyoda hit a home-run this time out, and it makes me want to search out his prior films as well as look forward eagerly to his future ones.My Grade: A","What I got was something better.Just like many movies I've commented on as of recently, I'd been looking forward to this one for a while. Especially after I saw one of Toshiaki Toyoda's other films, \"Blue Spring\" which is easily in my top 20 favorite films. I loved the trailer for \"9 Souls\", and I thought it sounded very good. I didn't hear anything bad about it. Now I know why.This movie starts up as sort of a comedy, then during the last half of the film, it quickly becomes something else. It becomes more dramatic as each of the characters face their own tragedies. Each character gets just enough screen time, and you care about what happens to each of them. Even though there are 9 characters we have to learn, and care about, within just two hours, Toshiaki Toyoda pulls it off brilliantly.After I saw \"Blue Spring\" I was hoping the soundtrack would be at least a little bit as good, as it was in that film. I got my wish, because the soundtrack to \"9 Souls\" was also incredible. The music used in each scene, more specifically the more dramatic ones, is just simply wonderful. I loved every second of it.I wasn't sure whether or not I wanted to see another Toshiaki Toyoda film, \"Pornostar\", but after I saw this, I'm going to. Definitely. Also, because I read the plot for it, and I think it sounds really good. I'm looking forward to it. On the R1 DVD of \"9 Souls\", there are two interviews with Toyoda. He says he's completed another film, and he wants to start writing the screenplay for his next. I can't wait for both.I highly recommend this film. You must see it. Now.","Finally! Third time lucky. This film has been always been on my mind, but my first viewing I forgot about it and only caught the second half of the film. Then only a couple months later I had the my second chance of watching of it, so I decided I would record it. Only to discover that my timer went off late and again I missed the first half of the flick. I wasn't going to allow that to happen again. So, when it came on TV again, I thought bugger it I'll wait until it comes on, then I will record it. And it was a good choice. I would have just watched the film, but they always put on weeknights around midnight. After discovering a hole in their crowded cell, nine prisoners escape their confinement to track down the key of the universe, which a fellow prisoner known as the Counterfeit King said he had hidden. They think that this key could be an opening for a hidden loot of counterfeit bills. On this journey they naturally see this as an opportunity to pick up their lives before they were gaoled. Although things don't turn out the way that they intended to, with most of the criminals plans going astray. \"9 Souls\" is an perky spiritual journey from Japanese director Toshiaki Toyada, which flung it's viewers into a film of two totally different halves. The first half of the story plays out more like a psychical comedy with the criminals bonds and the situations they find themselves being the selling point, but all that makes way to a moralistic and consequence drama-packed second half, where the real trouble begins with some quite nasty and bloody moments replacing the goofball tone it started off with. While, the first half is quite amusing with its on the road, screwball doodling and offbeat banter. But it's really the genuinely haunting latter half with it's peculiar turn of events that hit you so hard with some surprising touches that make you really sympathise for these very human characters. Even though they are not truly innocent from their crimes, you just become entrenched by these flesh-out characters in the first half that when you see them spiral into their downfall, you know it's an effective drama when you become shell-shocked in the dramatic change. The nine characters get enough screen time to truly understand their personal story and what weakness would eventually bring them down. The way the plot works out is that Michiru and Torakichi are the lead characters and we mostly see it from their perspectives. The escapism tale is an unquestionably engaging character study that's clear in it's goal and puts to you many questions on society and the path you choice to take to escape life and free yourself from these restraints. While, the symbolic story is full of clarity and vividly told. The visual element doesn't go by unnoticed, because there's just a dreamy and trance-like vibe that channels itself into the unique atmosphere. What HIGHLY contributed to that factor and gave the film a lift was the sweepingly, moody instrumental rock soundtrack. The mellow atmospheric gel it was able to create in many scenes left me rather breathless with the everlasting emotions it was able to provoke. Simply beautiful and downright powerful control on that front. The pacing for such an long film ( 2 hours ) seems to breeze by and editing is swiftly done, because we are just so wrapped up in it all. The hypnotic photography is crisp in detail. While, the performances by the cast as a odd bunch of criminals are that of high quality with each one providing enough personality and features to separate themselves. I found \"9 Souls\" to be a pleasing and quite an amazing surreal film that stirs up the emotions and then it smacks you with an almighty wallop when it changes direction. Highly recommended.","To be totally honest I wasn't expecting much at all going into 9 Souls even after reading heap upon heap of praise plied upon it but to say I was surprised would be a major understatement, in short I was totally blown away.The basic plot is as simple as they come, nine prison inmates ranging from a drug pusher all the way up to multiple murderer's escape from prison and go in search of a secret stash presumed to be forged money hidden by a tenth inmate who cracked and was dragged away by guards shortly before their escape but it's the direction that director Toshiaki Toyoda takes this simple story that is so brilliant and original perfectly blending drama, comedy and violence creating a truly one of kind movie that deserve's to be seen not only fans of Asian cinema but cinema in general.Superbly acted, emotional, funny, violent and at times very surreal this is a movie has it all.","Highly recommended to all those who appreciate watching movies. Great acting, perfectly surreal awkward humor, requisite prison sh-t, accurate depiction of the male condition. Music is also spot-on. I think the artist is \"Dip\" but not sure. The short loop of the title credit song on the DVD menu is well-timed, and sounds like Slint. (one thing to know is that IMDb maintains a ridiculous policy of a MINIMUM comment length based on, not CHARACTERS, not WORDS, but rather LINES. Measuring post quality and quantity based on LINES in the bold era of UNICODE and flexible, web-based typography, is like smoking poles.) ! Your comment does not contain enough lines - the minimum length for comments is 10 lines of text. Please see the guidelines. Attempts to pad the comment with junk words can result in your account being blocked from future submissions.","When a bomber, a patricide, a pornographer, and a mad biker, together with various other forms of social scum, have had enough of their sh** infested cell, they spot a rat and look for the hole. Escaping from the sewage the group of 9 souls, take advantage of their new found freedom and head for civilization. What soon follows is not surprising. Complete mayhem and terror follow in their wake. It seems that each has some unfinished business to take care of.Loosely based on The Great Escape, 9 SOULS is by far in the top 5 best films I've seen this year. Running at right around 2 hours 9 SOULS will deliver a story so powerful it'll literally leave you breathless. The beautiful, yet subtle, use of the rolling country sides adds the realism that is expected from this story. The vision of director Toshiaki Toyoda (Blue Spring, Porno Star), is completely mind boggling as he implements a sense of pity towards the characters. As quickly as each character grasps their dream, it's as quick as it's torn from them. Now, all responsibility of the success of this film should not fall solely on the shoulders of the director, yet props must go to the actors as well. This film was full of excellent acting from top to bottom. Ryuhei Matsuda (the son of Miyuki Matsuda of Audition) delivers a stellar performance, and seems to bring some of his mothers eeriness to the screen.I must give props to Artsmagic DVD as well. This is the 6th film of theirs I've seen now, and they seem to get better and better each DVD. The sound quality is perfect and the picture; clean and crisp. It's very annoying trying to watch a film that is too dark in transfer, so the discs from theses cats are nice.Bottom line is this film will soon receive masterpiece status by viewers' world wide. Keep an eye out in 2005 for 9 SOULS; it's really amazing film to watch.","A great film. Every moment masterfully conducted by Toyoda and his crew. The actors give credible performances all around.The visuals are haunting,beautiful and sometimes hauntingly beautiful shots of the Japanese country and city landscapes.The sounds,courtesy of Japanese band 'Dig', are never overly edgy as one would expect from band-made soundtracks. It's strangely atmospheric and well suited to the scenes they're on. All in all, they worked everything out perfectly....Well, if they were to give any justice to the story, perfection is the only thing anyone could have accepted. The real greatness of 9 Souls is the compelling story. The prison break movie maybe something of a lost genre these days, and road trip movie losing it's appeal due to the way the world is getting smaller. But this story easily mixes something fresh to those two genres.9 convicts are given freedom and possibly the opportunity to regain their places in society. will society accept them? will they be truly free of their dark pasts? and can they stick together long enough to stay alive and find out? Each convict has an interesting history. Their crimes are as varied as their apparent fates. A sense of brotherhood among them keeps the story high on drama and supplies it with hilariously comedic situations. And due to the nature of their backgrounds, violence is always something waiting to happen.After all that, all i can say is go give it a watch.","This 2002 Japanese film is the third feature film showcased in the inaugural Singapore Fantastic Film Festival (The first two being Kontroll and Immortel, which I should be able to watch by the end of the fest).9 Souls is at times a complex movie, and at times one which has a simple tale to tell. It blurs and crosses the line so often, it makes it difficult to try and classify its genre - part gore, part comedy, part social commentary.The title refers to 9 prisoners, who are introduced in more detail during their escape from prison (in a very creative introduction by the way), ranging from murderers to a porn king, from a juvenile delinquent to a vertically challenged escape artist. It turns into part comedy once they escape, and have to find the means and substinence to help keep themselves alive in a strange new world.Prior to their escape, their world is their prison cell, rudely interrupted by a tenth crazed prisoner, a counterfeit king who leaks out the secret to the whereabouts of his stash. With this bit of information, they embark on a quest to recover this lost promise of treasure before going their separate ways.Which forms the second half of the movie. Throughout the first half, we are exposed to the dreams and hopes of these escape convicts. Being locked up for some time, they each have a secret desire to either reunite with their loved one, or have plans to live a better life. At some point, you will ponder if it was wise of them to each seek their dream, knowing its dire consequences, or would rather choose to stick together in their new found family.Thoughts on second chances in life also crosses your mind, if these serious crime offenders deserve another break in life, or are forever condemned in the eyes of society for their one moment of folly which has kept them locked up.The pacing of the film is at times choppy, and you'd have scenes that come out of the blue (like cross-dressing as a disguise). I heard quite a number of people around me give the \"hmm... where did that come from\" comment.The soundtrack is kept simple, to a constantly played guitar tune, which in scenes of peace are kept soft, and in scenes of angst, being played to a crescendo. I find this effective in conveying emotions in the film, without the need of a bloated soundtrack.Rated R21 here for its subject content and scenes of gore which is not really shown on screen, this film is recommended for those who seek a different film offering, which is what this film fest is striving to achieve.","'9 Souls' is a title that fits the movie's psychological slant very well. The plot revolves around a group of prison fugitives so the narrative touches upon the flight itself but there is more of device to explore the inner realities of the characters and how these relate to the world at large. This explains the moments of surreal oddity that interrupt the linear flow of events at pivotal points.This aspect of introspective lyricism is steeped in several social contexts, some of which are typically Japanese like the yakuza orphan or the hikikomori. So that the movie never loses a sense of structure even as it progresses further into character study territory. And tragedy is at the heart of each of these criminals. True to its calling this movie is gritty, violent and has no qualms in disturbing the viewer. There is more to freedom than simply escaping from behind bars and reconnecting with life on the outside is fraught with difficulties that some simply cannot handle. A sense of dark fatalism seems to motivate these prisoners and their fanciful fantasies are but a result of this.Its one great flaw is that the cast is somewhat bloated. Nine complex characters are bundled together and it is not easy to give them all the required screen time to flesh out properly so a few fall by the wayside. The same goes with the relationships between these but here the pair of a father who killed his son and of the young man who killed his father emerge naturally as counterparts of sorts. They form an uneasy bond that results in a somewhat perplexing ending.'9 Souls' does not settle for illusions of regeneration but it does not deny a desire for betterment. Torn between this two extremes and enlivened by a great cast it is a movie that is off beat and intense. Well worth watching.","I watched \"9 souls\" in Athens' 12th International Film Festival (September 2006), where Toshiaki Toyoda, the films's director was also present and answered many questions of the audience. This road film is about 9 fugitives, all very different characters from each other. They decide to stay together travelling with their red van across Japan. Every time the van stops, we see these 9 fugitives trying to escape from their past in order to build up a new life or to fulfil a dream. However, no matter how hard they try, it seems impossible and their violent past comes after them and leads them to their final destruction.Though a very pessimistic film, it is not a dark film. On the contrary, it is full of beautiful pictures, surreal elements and elegant humor. Toyoda's heroes cannot escape their \"prison\" and they face a divine(?) punishment for their \"crimes\". They are small pieces of a beautiful painting, where the tower of Tokyo depicted as a huge knife turned upside down prevails!","this is film is probably one of the best i've seen so far. i would put it only second to All About Lily Chou-chou because it kind of gives me the same vibes....'9 souls' is about 9 prisoners who have just escaped prison to go and find some counterfeit money stored in a time capsule at Mount Fuji Primary School. they later find out that there wasn't much there and set off on their own ways. the first half of the movie is just a time for the characters to be introduced and for the main points to be stated. it is a comedic yet serious part of the journey. the second half, moved me to tears. as the movie progresses, each character goes and tries to fulfill their dreams, but unfortunately ending somewhat badly. in the end only 2 of the 9 escapees are left. the way that each character left the scene was very sad and you will probably feel tears in your eyes. a beautiful film directed fantastically. this is a movie for people who have enjoyed Toshiaki Toyoda's other films such as 'Blue Spring'.","Critics love this movie. I personally found it senseless and tasteless. This is the millionth time I've fallen into the \"critics love it\" trap and came out wishing someone would throw boiling hot water on my testicles because it was less painful than watching the movie. There are many scenes that are completely unnecessary. A warning to Animal lovers: Don't see this movie if you don't want to see sheep killed and molested.If you want to see a good Asian film, see Afrika. If you want to see a film about escaped convicts, see the Gene Wilder/Richard Pryor classic Stir Crazy. Avoid 9 Souls like the plague.","Here is another great film critics will love. The problem is that it is not a very good movie.The films premise is simple. Nine convicts escape a prison after the tenth one goes crazy and tells them where the treasure is.The first half has a lot of slapstick some of it very broad while the second half is a character driven descent into fantasy and melancholy.The two halves simply don't mix. Individual scenes do work very well (The guys crashing a friends house who has a new Filipino bride is hilarious While a later scene with the big guy working in the restaurant tugs at the heartstrings.) They simply don't mesh with each other.The movie as well is missing entire set-ups. One scene shows the guys desperately looking for change under a deserted vending machine to buy a snack. The very next scene has the whole crew in drag sitting down in a restaurant. Where did they get the dresses and wigs? (The crew includes both the big guy and a midget) How did they get all the clothes and money to buy the meal? And most puzzling is why are they in drag? They are clearly guys in drag and lets face it is there anything more memorable to witnesses than a big guy and a dwarf eating a meal dressed as women? I mention the big guy and the dwarf because besides the old guy everyone else seems to blend into each other. (In fact they wear matching white jumpsuits throughout most of the movie) The movie has very little character development in the first half and as a result the second half really lacks an emotional punch. As we are often trying to figure out who is who in their individual payoff scenes.Speaking of a drag the second half has all those wonderful sweeping camera shots and big emotional moments and great symbolism that makes a great film. It is also excruciatingly slow which makes for a boring movie.9 Souls is a big disappointment, the reviews gush about a great film and it's in there somewhere, good luck finding it yourself.","There were a few disturbing scenes in this movie. One early in the beginning, and most in the later parts. I'm the type of movie viewer that goes out of my way to avoid violence and gore, and I didn't see this one coming from the description and being that it is billed as a comedy.But having said all that, I found it to be an interesting look into Japanese life that we never see including scenes of run down neighborhoods and poverty. Also the way the gang communicated to each other goes against everything we were taught or shown about Japanese culture.I think it's a good movie. The gore and the one disturbing scene was totally unnecessary in my eyes. If that had been omitted, I would probably have given this a rating of 8 or 9.","The idea of nine stupid prisoners escaping and going on a road trip sounds pretty good for a movie. Especially because it's meant to be funny and I guess heart-warming in some weird way. The problem is, the movie was very rarely funny and often just seemed pointless and needlessly gross. It was as if jokes or interesting scenes were being set up again and again but no one bothered finishing any of them--there was just no payoff. Also, the movie was just brainless and had the crooks meandering across Japan even though they left so many crime victims alive that it's impossible to believe they wouldn't have been caught almost immediately--especially since they continued to keep using the same stolen camper for days on end. And as far as being gross goes, I just didn't need to see scene after scene after scene of guys peeing along the side of the road. Plus, believe it or not, there is a scene where four of the guys are out raping sheep!All in all, I really hated this movie. And it's a shame, as I almost always love Japanese films--just not poorly made and uninteresting ones like this one."],"review-user":["movieman_kev","Dxamanda","lost-in-limbo","troika19","jm3","spellcaster-1","nerd_punk21","DICK STEEL","gothic_a666","europanos","tofu-fudge","yellowmask73","juliankennedy23","salewit","MartinHafer"],"review-date":["15 April 2004","22 February 2005","7 June 2006","22 February 2005","9 June 2007","1 January 2005","29 August 2005","24 June 2005","26 September 2010","23 September 2006","23 April 2005","22 September 2007","6 March 2005","9 February 2004","30 September 2006"],"review-rating":["9","10","8","10","10","10","10","6","8","9","9","1","3","6","2"],"review-title":[" Outstanding\n"," I was expecting a great film.\n"," Escaping the guilt that hangs over you is never easy.\n"," A true masterpiece.\n"," best movie i've seen in six months, easily.\n"," 9 souls\n"," great storytelling\n"," A Nutshell Review: 9 Souls\n"," Off beat and great\n"," A violent road-film about 9 fugitives trying to escape their past in modern Japan. Beautiful, surreal and very original!\n"," fantastic film\n"," Viewers beware...\n"," David Soul tragically not included.\n"," Very bloody and violent, strays off course, but unique.\n"," It must be hard to start out with this premise and STILL make a bad picture\n"]}