{"review-url":["http://www.imdb.com/title/tt0369053/reviews"],"review-text":["Although this film is set amongst the sophisticated English upper classes it is a simple story of a couple torn asunder. It has a slightly dated air, being an adaptation of \"A Way Through the Wood\", a 1950 novel by Nigel Balchin (once hugely popular and now forgotten). Julian Fellowes, who despite an academy award for the script of \"Gosford Park\", has a somewhat anachronistic persona himself, wrote the script and directed (the latter for the first time). With the DVD version I saw there is a most illuminating audio commentary by Julian. His primary focus was on getting his characters right, and by and large he has succeeded. In this he was helped by two outstanding performances from Tom Wilkinson as James, the stitched up City lawyer, and Emily Watson as his attractive wife Anne. He also kept it short; the running time is only 80 minutes.James and Anne have a town house in Chelsea and a comfortable former vicarage in Buckinghamshire. Anne is some years younger but they are childless. Outwardly they seem happy, but James, one of nature's moralists (unusual for a city lawyer), is a control freak. Just down the road is the aristocratic the Hon. William Buel, who is not one for middle-class morality, and he is more than happy to take advantage. But there's a complication, a road accident, in which an elderly cyclist is knocked over in a country lane by a ruthlessly driven Range Rover just like the Hon. Bill's. Soon James, Anne, Bill and the victim's widow (who happens to be James' and Anne's cleaner) are drawn in to a conspiracy to conceal what really happened. The primary focus is on the corrosive effect of all this on James and Anne's relationship.The third person in this ménage a trios, Bill, is played by Rupert Everett. From the point of view of casting, his languid, superior manner is right for the part, yet somehow he doesn't quite get there. Partly this is because he is supposed to be sick for some of the time and he looks well when he is supposed to be sick, and vice-versa. The part seems underdeveloped. It is interesting that John Neville as Bill's father who has only one significant scene manages to establish his character beautifully in the time he has.The world of five star hotels and superior restaurants is nicely evoked. As Julian Fellowes says in the audio commentary, these people are able to convince themselves that the Edwardian age still exists. At bottom though, the film is about what draws a couple together and what tears them apart. Nigel Balchin was going through a marriage break-up when he wrote the book, and Fellowes has made a good fist of conveying the atmosphere. As he says, his is a fairly free adaptation, but the central theme is the same.","Nigel Balchin's maze-like novel 'A Way Through the Wood' has been adapted by Julian Fellowes who also directs this 'terribly British' drawing room suspense piece. It is a film whose effect relies on the cast portraying the varyingly benign/malignant characters and it is here that Fellowes' directorial choices are superb. The story has a linear line that is easy to follow, but the beauty of the film is the metamorphosis of each player as a single incident ignites a minefield of disasters.James Manning (Tom Wilkinson) is a successful business obsessed solicitor in London, married to Anne (Emily Watson) who needs more in her life: the couple being childless live in the country in a beautiful estate, assisted by their long term 'cleaner' Maggie (Linda Bassett). They attend social outings and meet, among others, William Bule (Rupert Everett), the passively lazy wealthy neighbor. Anne decides they should entertain their neighbors and against gruff James' protestation Anne proceeds with planning: James arranges to 'not attend due to business'. On the night of the party there is a hit and run accident in which Maggie's husband is accidentally killed by someone in a Range Rover (she observed). When James returns home he sees a scratch on William's Range Rover and suspects William to be the perpetrator. Anne discourages James from going to the police with the information -'what possible good can it do but ruin Bill's life as a socialite and father and son of an important scion?'. From this first 'lie' the virus spreads: James confronts Bill who talks James out of going to the police, Anne confesses it was she who was driving Bill's Rover and is the one responsible, James convinces Anne to keep it quiet because it would ruin his reputation, Anne confesses she is having an affair with Bill, and the three of them concur that they will stick together on their big lie for the sake of the greater good. Anne eventually succumbs to the guilt of not telling her beloved Maggie that she is the one responsible and Maggie, herself guilty of a previous theft whose life was saved by Anne's mercy to hire her anyway, is the agent who draws the story to its surprising conclusion. Lies begat lies that begat lies, et cetera.The major impact of this intrigue is the manner in which the isolated tragedy impacts each of the characters involved. Each changes in a dramatic way. Tome Wilkinson gives the finest performance of a career filled with brilliant performances: he is able to say more with his posture and facial expressions than about any actor before the audience today. Likewise the gifted Emily Watson adds yet another fine role to her repertoire as does the surprisingly smarmy Rupert Everett who, despite being yet another wealthy British 'gentleman', gives us a man both arid of spirit and yet ultimately needy. And the always-fine Linda Bassett takes a small role and finesses it making her character quietly central to the chaotic web of lies.The cinematography by Tony Pierce-Roberts and the musical score by Stanislas Syrewicz add immeasurably to the multiple atmospheres the story encounters. This is ensemble playing at its finest, which always means that the director (Julian Fellowes) has a fine grasp on the piece. The interplay of these fine people makes the dodgy story work very well indeed. Grady Harp","SEPARATE LIES is such an elegant, intelligent and thought provoking film and I could have watched Tom Wilkinson forever on the screen. The locations in the English countryside, the marvelous London locations, the interiors, smart wardrobes and of course, the writing and dialog made SEPARATE LIES a thrilling adventure.With that said, and perhaps this is just an American viewpoint, as the British are so much more sophisticated in handling sexual escapades, I found it hard to watch Tom Wilkinson just stand by, as his wife goes merrily on her way in a sexual journey that really brings her very little joy, creates much despair for her husband, with the cad that is Rupert Everett. Yes, I saw the failings of Wilkinson's character-his aim for perfection, the desire for everything in its place-but in Emily Watson, she should have looked deeper into his true character and solid goodness, to realize what she has thrown away.Tom Wilkinson makes SEPARATE LIES into a powerful film by watching him experience all the pain, embarrassment, and despair on the screen as his wife goes off with another man. And he himself makes the journey in SEPARATE LIES by understanding his faults, embracing his wife, despite all that has gone on, and leading her back to London. Bravo, Tom!","This is a stunning movie. Raw and sublimely moving. It felt like a very gripping, intelligent stage play (but without the overly theatrical feeling one actually gets from watching people on a stage) which plays on everyone's terror of a white lie escalating to monstrous consequences. All of the main players are mesmerising. Tom Wilkinson broke my heart at the end... and everyone else's judging by the amount of fumbling for hankies and hands going up to faces among males and females alike. Julian Fellowes has triumphed again. He's a national treasure. Gosford Park, Vanity Fair, Mary Poppins... and now this. Can he do no wrong?! GO AND SEE IT! This is a film for real grown-ups.","Fellowes's directorial debut takes us into a tangle of complex adult relationships. His story unfolds after an accident takes place which is followed by a web of lies. Fellowes gets to the point right from the very beginning. The wonderful score and cinematography set the tone. Fellowes uses less close-ups as he stresses on the full body gesture of his actors. I also liked his attention to detail and the subtle nuances of his actors, notice his choice of location and props which are all a relevant part of the scenes. I must further add that the authentic locations are quite breathtaking.He has wisely chosen gifted actors like Tom Wilkinson and Emily Watson to play the key roles. Wilkinson is at his best while the sublime Ms. Watson downplays her part with grace and complete ease. Hermione Norris has an effective presence. The always dependent Linda Bassett stands out. Rupert Everett looks a little awkward but is quite adequate.At first glance, 'Separate Lies' may not appeal to all as it's quite easy to miss some of the important details and misinterpret the nuances of the actors. However, on second viewing, I was able to appreciate the film on a much deeper level. On an additional note, the director's commentary is a brilliant bonus. Fellowes provides some great insights into 'Separate Lies' and he has put a lot of efforts into its making.","\"Separate Lies\" is a veddy English take on \"Unfaithful\" and \"Crash\" crossed with a Ruth Rendell mystery about guilt and responsibility.The setting is very smoothly established of a high-powered solicitor who works in the City, has a country house and an in town apartment and has everything ordered beautifully and under control, including his wife. The surroundings completely capture the mood. A sense of portent and uneasiness is only introduced with fast flashbacks to a car accident until Emily Watson as the wife starts showing some out of place hairs and breath.The coincidences are a bit claustrophobically theatrical so that it almost feels like a stage play. For the first half the suspense and revelations keep our attention, but then the film just ducks it all and deteriorates into relationships that are so civilized as to be devoid of emotion or reason. I haven't read the book so don't know if director/adapter Julian Fellowes changed it. This is the best Tom Wilkinson performance since \"In the Bedroom.\" He holds the film together. He's used so often in films to fulfill the stereotype of a self-satisfied suburban or aristocratic executive that one forgets it can be done with subtlety and verve. This may be the first film that he gets to use so many four letter words with his own accent.Rupert Everett is so distant and even repellent to every one that it's hard to see his appeal that is critical to the plot. I kept thinking who else could have been cast for at least some magnetism. While it is amusing to see him as a Milord in casual jeans, explained disdainfully that he's been living in America so long that he's practically become an American (a line I've heard in a couple of other Brit movies lately).While we get a frisson of background on relationships that is supposed to help, it's not enough. All the background and relationships are revealed off screen through talky explication. We certainly can't tell in terms of how people relate. We have to take revelations for their word for it. The injection of old-fashioned Movie Star's Disease makes the characters' interactions get even phonier. And then suddenly there's narration that's unnecessary and jarring. While there's flashes of some action and emotion, this is drawing room drama. That stiff upper lip just gets plain annoying.There was probably some symbolic significance to a Paris interlude that included a rendez-vous by the Guy de Maupassant statue but if so it was a long time coming for a not worth it punch line.There's an amusing inside joke of a character watching \"Monarch of the Glen\" on the TV, as Fellowes was featured in that series.","I wish there were more films about middle aged people. The intellectual journey and the twists and turns of life's moral highway make interesting viewing. There seems to be a different standard of judgement on women who have extra marital affairs than on men. Amy Watson's hurtful and humiliating behaviour towards her husband seems to pass without comment. Reverse the roles and one could expect a torrent of condemnation towards the man. If she found her husband boring and judgmental she could could have told him so, left and waited for a no doubt large financial settlement upon divorce. The country and London scenes are wonderfully authentic and rich while the autumnal weather adds to the melancholy background superbly. The ending is perfect, so in tune with real adult life.","An old man is riding his bike down a village road when a car comes out of nowhere, strikes him down dead, and keeps driving. The rest of the film is spent discovering who hit him, why he was hit, and what consequences this murder will have on the rest of the village. Separate Lies is a very British movie indeed. I'm not saying that hit-and-run car accidents are a particularly British phenomenon, but the way everyone reacts to this tragedy is very British. Tom Wilkinson plays James Manning, a hard-working, respectable citizen with a \"stiff-upper-lip\" attitude towards tragedy. His wife Anne (Emily Watson), who is twenty years younger than her husband, is more emotional, more impulsive, and more prone to drama.The man who really spices up life in this sleepy village is playboy millionaire William Bule, played by a deliciously devilish Rupert Everett (most American audiences will eternally remember him as Julia Roberts' gay friend who completely stole every scene in My Best Friend's Wedding). In Separate Lies, Everett is cruel, cold, and selfish, but he's an absolute blast on screen. No, it's not that exciting of a movie title (Separate Lies  how did they end up with that lame and forgettable title? Did they just not have a marketing team? Did they just now care about getting people to see this film?), but beyond the title is a heartbreaking drama about the power of forgiveness.","wanted to strangle all three of them before the film finished.James Manning (Tom Wilkinson) is a nice, older man, an attorney of some sort, perhaps dealing with corporate law - he seemed to have a lot of meetings about various projects.His wife, Anne Manning (Emily Watson)seems to be somewhat younger than him, although she, too, is middle-aged.They are a childless couple, living in a huge manor house in the English countryside.Life seems perfect for them. James thinks they are happy, but his world is about to fall shatteringly apart as one betrayal after another is revealed by his wife.Anne Manning is a selfish piece of work and why James kept putting up with her and her lover,(the trashy, worthless Bill Bule--played by Rupert Everett), time and time again I don't know. James Manning must have been born a saint, or perhaps he wasn't human, he was an angel descended from heaven! Eventually he practically apologizes to Anne for not understanding sooner and stepping completely aside so she could enjoy her sordid affair guilt-free.I don't advocate violence, but in this instance I think I would have greatly enjoyed it if James had at least given Anne a good solid kick in the backside.However, I have to acknowledge the acting, dialog, directing and storyline are all extremely well done and, surprising for today's films--it even has a clearly defined plot. The ending is somewhat non-conclusive, but considering how things had been going, one can almost guess what dumb, good-hearted, ol' James will do, yet again! 6 stars out of 10","Another popular screening for a British picture at Coalville's Century Theatre. A well crafted, solid drama with an ever developing plot and ongoing 'twists in the tale'...as the lies piled up! A masterclass of acting by a flawless cast, well marshaled by first time director Julian Fellowes. Outstanding performance, as usual, by Tom Wilkinson but good turns by all concerned including supporting actors Linda Bassett and John Neville. Our audience was engrossed by this film, which includes a couple of shock incidents which really make you 'jump'. A good tight production at around only 80 minutes, probably produced on a very limited budget, but a success, which should see Fellowes directing again for the big screen. Some publicity for the film seemed to suggest it was set in the 50s (as per Nigel Balchin's novel)but obviously this is not the case. Recommended viewing.","Julian Fellowes, the distinguished writer of \"Godsford Park\", presents us with another civilized tale of self contained emotions. This time however, the ingredients are somehow at odds with each other and the strange taste that left in my palate indicates that, perhaps, it was removed from the oven a little too soon. I longed for Joseph Losey at the helm and Dirk Bogarde, Sarah Miles and Alan Bates as the protagonists. Emily Watson is always marvelous but here, she doesn't have the kind of support she, as an actress or as a character, deserved and/or needed. Tom Wilkinson, as good as he is, doesn't have the layers of a Dirk Bogarde or James Mason. He is exactly what you get and Rupert Everett, who became a star overnight with Julian Mitchell's \"Another Country\" has taken a strange and puzzling road. His close ups are kind of frightening. His mouth has become the center of attention and not the kind of attention one would expect. It belongs to the villain in a horror movie. I noticed that already in his comedy with Madonna. I know, perhaps, all this sounds irrelevant but it conditioned my response to \"Separate Lies\" I wanted to be riveted and I wasn't.","As a police inspector says in one of Dorothy Sayers's Peter Wimsey mysteries, \"There's nobody like the British aristocracy to tell you a good, stiff lie without batting an eyelash.\" -SPOILER- The moral McGuffin driving this movie is the cover-up of a fatal hit and run accident. The victim is the husband of Maggie, who is the housekeeper of James and Anne's country house. Anne was the driver. Her fear of the consequences, and her husband's fear of losing her, lead them to conceal Anne's involvement from Maggie (as well as the police), with plenty of feigned condolence and repeated bare faced lies. Eventually Anne's conscience gets the better of her, her nerve breaks, and she confesses all -- whereupon Maggie immediately forgives her and cooperates in lying to the police. Why? Because some years ago Maggie had been convicted of stealing from her former employer, the \"local milord.\" By hiring her, Anne had restored Maggie to reputation, dignity, and a respectable place in the village community &c. &c, and Maggie's gratitude goes far enough to forgive not only Anne's accidental killing of her husband but also her employers' repeated lies to her about it. As far as the movie tells us, Maggie's forgiveness and complicity are freely offered, and even forced upon a guilt-ridden, unwilling Anne. Anne and James don't even have to write her a thumping cheque in compensation for her loss. It all seems implausibly Vera Drake for a story set in the present day.","Another great Tom Wilkinson performance punctuates \"Separate Lies,\" a 2005 film also starring Emily Watson, Linda Bassett and Rupert Everett. Directed by Julian Fellowes, it's the story of a married couple, James and Ann Manning where the husband (Wilkinson) believes he and his wife (Watson) are happy together. An accident near their house on the night they have a party brings the police around. It is a hit and run that killed their maid Maggie's (Bassett) husband. James becomes suspicious of a neighbor, Bill Bule (Everett) when he sees some damage on his car. He confronts Bule, who admits he did it and promises to go to the police the next day. When James arrives home, Ann is angry that he is making such a big deal out of it and states that she was driving the car. Of course, James then isn't so eager to rush to the police. She suggests that they call Bule and tell him their decision. \"Oh, f___ Bule,\" James says. \"Well, that's just it,\" Ann says. \"I am f___ing Bule.\" James' devastation is just the beginning in this well-crafted drama. Without giving the plot away, this is a good example of how gender switching changes a story. Example of what I mean: Susan Smith drives her car into a lake and her children drown. She gets life in prison. What if the father had done it? The chair. You'd be surprised how often the outcome would be different. The same is true here - if it had been James having the affair and doing the subsequent activities, viewers might feel differently about the story. If Ann were in James' place, it would be shattering. As it is, it's tremendously sad.Tom Wilkinson is heartbreaking as a man blindsided by the woman he adores, and Emily Watson does a beautiful job as Ann, who, once she frees herself from her lies - her involvement in the accident and the happy marriage - knows what she has to do. Rupert Everett as Bule is very effective - indolent, uppity and ultimately in need. Everyone here is very civilized in their dealings with one another, and no one is all good or all bad.There are separate lies - James that his marriage is happy, Ann's as listed above - and there is one uniting lie - the accident, about which all parties keep quiet. It's enough for Ann that Maggie knows. In the end, all must deal with the separate lies that the single lie uncovered.Brilliant film.","Separate LIES changed my life. Actually, the Q&A did.SPOILERS BELOW. Read only if you watch trailers or if you've already seen it:The Emily Watson character cheats on the Tom Wilkonson character. My first reaction to the puppy-dog-eyed Emily was \"It's Over. Dump her. Bad riddance.\" For some reason, he stuck around. Not in a pathetic way. He just listened. And tried to accept her needs. At times he needed to leave. But he stuck by her and let her live her life. But I still wanted to see her Afterwards, Julian, the screenwriter and director, talked about the film. I'm glad he did, because frankly I am too you and was too immature to get the point before he broke it down for me. Tom's character loved her, and no matter how much her pursuit of her needs might disagree with what he wants, he would always love her. The relationship and love they shared wasn't a lie, all of a sudden, just because she wanted to be with someone else. The fact that she wanted to be with someone else didn't make her who she was. When you get past fifty, there's a strong chance that finding the love of your life won't come around again, so you can't be as dismissive as you were when you were younger. You have to try and make things work, because the alternative may be much worse.She needed what she needed, and she couldn't help that. He had to learn to let go of her if he wanted to be the full man he could be. He helped her in pursuit of her lover, even when it hurt him.Another thing: Julian said that the strongest tool of a controller is guilt. Again: The strongest tool of a controller is guilt.At the end of the film, Tom released her from her burden. He felt a need to let her know that he loved her, but not to in order to get her back; he wanted to let her know she didn't need to feel guilty or think poorly about the relationship, just because it ended in such a terrible way.It is not my way to review a film based on the message, rather than the execution, especially when I understand that message better when it is explained to me by the director, but I make an exception here, as I feel one more mature than I would benefit from seeing the film.The execution of the film-making was a nice, British pace. Rupert was slimy and revolting. Tom and Emily were their usually solid, real characters.","Can the intensity of a husband's love for his wife lead him to cover up a crime,despite betrayal on many levels? Tom Wilkinson is no brutal Othello, in the setting of modern day England. So, gradually a web of deceit begins to be woven. And, we witness cycles of jealousy and drunkenness and guilt and fornication. And so the web of \"separate lies\" begins to fail and then hold together again. And life (and death) goes on, despite the bright flame of the husband's love and the deep despair and guilt woven into so many lives. How many webs of deceit are to be displayed in this growing tapestry? The impulse is to prop up sterling reputations and careers and relationships in this most civilized corner of the world. Wilkinson gives an emotional performance, full of grace and discretion and decorum, and yet humanity, of those who have much to hide. Those who desire clarity and openness on the way to justice will be disappointed with the wickedness of so much deception. And yet, who among us, has not something similar to hide about his loved ones? Nevertheless, the viewer may wonder if this web is fated to crumble some day.","Emily Watson and Tom Wilkinson together - what a treat! With Rupert Everett and Linda Bassett rounding off the supporting roles to the foursome of lies and intrigue. Yet at the heart of it all, each character maintains a streak of decency - moral conscience held up in spite of obvious contradictions. \"Contradictions are the source of all movement and of all life.\" How true these words are. Watson's Anne Manning is at the core of this intrigue - she's the central conscience that the other three latched on. She is the decency undeterred. The circumstances of lies are to each its own: one to defend one's professional name; one to hold back due to family/partner pressure; one simply don't want to face the consequence; one ironically can't believe the truth and lies to save friendship. These are all precarious situations. There lies the intrigue - fascinating to watch how each tackles truth and lies. Contradictions, indeed. In spite of the seeming dishonor, decency and heart remain strong. The treatment of the subject involved and how each of the character behaves are masterfully delivered simple with clarity. It's not sensational or complex as another film \"Where the Truth Lies\" 2005. Credits due to Fellowes' writing and the nuanced performances of both Watson and Wilkinson. There is warmth somehow that comes through the seemingly boldface or frustratingly hidden lies. Beneath it all, human frailty not excluded, they meant well. And following along with the story, the turn of events provided satisfaction and smiles to how the two Manning's seem to have grown and matured in their relationship. You might say there's no obvious action drama or thrilling scenes in \"Separate Lies,\" yet the intrigue is there and it will hold your attention. The deserving production efforts include cinematography by Tony Pierce-Roberts (a veteran to the Merchant-Ivory films) and music by Stanislas Syrewicz, with mood and tone reminiscent of composer Zbignew Priesner (of filmmaker Krzysztof Kieslowski's Trois Couleurs, especially: Bleu 1993.) This is a British film you just might not want to miss. Emily Watson (Anne, the wife): Breaking the Waves 1996 debut; Hilary and Jackie 1998; The Luzhin Defence 2000; Gosford Park 2001; Punch-Drunk Love, Red Dragon, Equilibrium in 2002. Tom Wilkinson (James, the husband): The Full Monty 1997; The Governess, Rush Hour (as villain) in 1998; In the Bedroom 2001, Normal (HBO cable movie) 2003, Eternal Sunshine of the Spotless Mind 2004, recently as Father Moore in: The Exorcism of Emily Rose 2005 opposite Laura Linney. Rupert Everett (Bill): He is simply delightful in \"My Best Friend's Wedding\" 1997 opposite Julia Roberts and marvelous in \"An Ideal Husband\" 1999 d: Oliver Parker, an Oscar Wilde play. Recently as Sherlock Holmes with Ian Hart as Dr. Watson, in PBS Mystery: Sherlock Holmes and the Case of the Silk Stockings 2004 TV. Linda Bassett (Maggie): she was very effective as Ella Khan opposite Om Puri in \"East is East\" 1999.","The successful, honest and methodic lawyer James Manning (Tom Wilkinson) works in London and is living in the country with his beloved wife Anne (Emily Watson). Anne decides to have a party at their home, and the husband of their housemaid Maggie (Linda Bassett) is hit by a car at the same time nearby her house and Maggie witnesses that a Land Rover caused the accident. James associates the scratch on the car of his acquaintance Bill Bule (Rupert Everett) with the accident, and forces him to confess and promise to go to the police on the next morning. When he arrives home, Anne tells him that she was driving the car; further, Bill is her lover. James changes his opinion and decides to support the lie, while a persistent detective is investigating the case and the list of guests.\"Separate Lies\" is not a bad movie, but the behaviors and the way of life of the characters are too British, at least follow the stereotype. It is almost unbelievable the way and fair-play that James Manning accepts his situation of cuckold, no matter how much he loved his wife. Further, he lies, what would be unacceptable for his ethical standards and rules of living. Anne Manning is a real bitch, betraying a man that loves her for a crook. I cannot see this story with Italian, Brazilian or any other Latin people. In the end, the truth, the betrayal, the corruption, the moral are blurred in a hypocrite dirty lie. My vote is six.Title (Brazil): \"Mentiras Sinceras\" (\"Sincere Lies\")","Well, what's wrong with the title \"Separate Lies\" (accused elsewhere of not being \"exciting\"). It's cunning, subtle and a bit poetic. (Of course there's a Phil Collins song and a James Belushi film called \"Separate Lives\", which are alluded to here.) But the real point is the ethical dilemmas of telling lies at different levels that the film probes. OK, it's not an \"in-your-face\" hilarious title, but then it's not an in-your-face hilarious film. Please give British films like this a chance. They do try to make people think about important things, as here: how far do you go to protect your life (even if it is a bit rotten) against unexpected disaster. Maybe you tell lies. Maybe you ignore your loved ones' lies. That can wear a lot of people out. American movies on this theme are abundant, but they usually go much further by involving the use of firearms, which are not a part of everyday life here in Europe. Maybe we're not so \"exciting\" over here, but we don't expect slogan-like film titles for films that are not aimed at a massive public.","First of all, I would like to say that I am a fan of all of the actors that appear in this film and at the time that I rented it, I wanted to like it.I think that the main reason that I was so disappointed was that the outside box promised me a suspense thriller. In my eyes, a suspense thriller for British movies is like something out of a Ruth Rendell novel, something that has a lot of dark twist and turns and leaves the viewer with an ending that is unlikely to be forgotten anytime soon.This movie started out with the promising note of being such a film. We have our main character, that suspects a man that he does not like, of being involved in a hit and run that killed the husband of one of his servants.His notions prove to be right, but the idea that his wife might be involved, does not occur to him until that she confesses to him that she was a part of the crime.The elements of a good suspense thriller were in place, at this point, but from there, I felt that the film took a different direction and became almost some sort of a mild soap opera about who wants to be with who and what the love of a real relationship is. The film might have been enjoyable to me, if the outside box had talked of a twisted lover's triangle and had not been labeled as suspense thriller.This seemed to be more of a soap opera story and the beginning setting seemed to be a mild distraction to the true content of the film. I felt like this film could have done a whole lot better than it did. I felt like it kept leading the viewer up to a big event that never materialized. So, I have to give it a lower rating than I would have liked to and say that it fell short of my expectations.","I agree with other commenters that the acting was intense (life-like? depends on whose life it's supposed to be), but what irritated me most was the contempt of law.A cyclist is killed in a car accident. This certainly is a crime, but the police (embodied by a single black, and obviously contempted, officer) try to solve the case in vain. The titular Lies prevent that. And the second funeral, of the adultering \"milord\", seems to be of more interest than the first, the accident victim.I like cynical movies where sympathetic perpetrators win in the end, but here? I'd have preferred better police work (even with Miss Marple or such) that would have solved the case.","This movie, Separate Lies, shows a relationship of characters after an incident occurs. The incident, an accidental hit-and-run killing of an elderly neighbor man on a bicycle, unleashes behaviors of the major players in the movie. They are: the wife, Anne, who is the driver and who causes the death of the bicyclist. Her husband, played by Tom Wilkerson, a not-particularly-attractive middle aged London solicitor. A playboy who is the secret lover of Anne and who was in the car with her when she ran into the bicyclist. And Anne's maid, an older woman who was the wife of the killed bicyclist.The gist of the movie is that the husband learns, eventually, that the hit-and-run driver was his wife, Anne, who is also having an affair with the playboy. Both Anne and the playboy have mixed feelings about owning up, to the police, that she caused the man's death. But after discussing things with Anne's husband as well as the maid, it was decided that Anne should not be punished for the accident and each character then lies to the police to save Anne.Anne, although the culprit, controls each of the other characters. Her husband loves her even after being told of her affair and even after she ultimately leaves him to be with the playboy when he succumbs to cancer.The playboy loves her and was even willing to tell the police that he was the driver, not her, so she could remain unpunished. The playboy's father loves her and tells the husband that through her love, his son's life was extended to 15 months instead of a matter of weeks, as the doctors forecast.And finally, the maid loves Anne because Anne hired her even though she had previously been incarcerated for shoplifting from a previous employer.Yet I am writing this review because I am flabbergasted by the overvaluing of Anne by the others. This woman, Anne, first causes another's death not merely through negligence, which might be bad enough, but by driving wildly through the London streets without having a care in the world about how her id-like behavior might harm another. When it does, she continues in her me-me-me-and-only-me attitude by continuing her wild and crazy driving rather than be stopping to render aid.Everyone on Earth has a duty to not cause physical harm to others. This woman causes another's death, fails to stop and render aid or even check on the injured cyclist, and later continues to exhibit her wild driving, giddy-as-a-schoolgirl, because she's found a carefree lover. So why is everyone lie and go to extraordinary lengths to protect this woman who couldn't care less about anyone but herself? She dumps her husband who has always loved her. She later dumps the lover to return to the husband merely for convenience. And she cares so little for the maid that she kills her husband through willfully speeding and driving erratically and not even bothering to help him after she's knocked him off his bike. This woman is, in essence, all id. She has few deep loving qualities but loads of superficial ones. She is, therefore, way overvalued, as I see it. And the movie, correspondingly, is way off.","A well written screenplay. A moving story showing the middle class English at it's best. Some great acting by Tom Wilkinson and Emily Watson. Tom Wilkinson is one of Britain's best actors. He knows how to be subtle and honest. Emily Watson is an actress I was not familiar with, but to her credit she does a great job of playing the ****** wife. The director, Julian Fellowes did not succumb to the typical Hollywood gimmicks to give the film some meaty storyline. It has not over dramatized it's portrayal of the English middle class. The films pace does not falter although it is not a faced paced film. A good twist in the plot, that is not predictable A lovely English country village setting. I enjoyed this film very much The locations were also very well selected. If you enjoy films about relationships this is one to watch. Better to have some tissues ready!","I saw this movie today, had looked forward to it, and I am not sure if it is just me but if asked to describe how it ended, I don't think I could say. I thought it was well cast and enjoyed following the plot and felt we were never sure who was really driving and that perhaps we were being led to a surprise twist.I kept expecting a 'big finish' and came away not knowing in what direction the main characters were going, either individually or as a couple as neither of them seemed to have altered from the start.am wondering if this was anybody else's experience? I confess that I like to come away from a film with a very clear ending (and even a small epilogue as to what happened to the characters).","I'm a huge fan of both Emily Watson (Breaking The Waves) and Tom Wilkinson (Normal) and was amused to see them upstaged by Rupert Everett (Dellamorte Dellamore) in this shockingly rather minor movie that had all the ingredients to be so much more. The too brief scenes in which he portrays a languid, infinitely entitled, worthless son of a rich Lord are spot-on and entertaining. But for a love triangle there was remarkably little chemistry to speak of between anyone. The music was annoyingly movie-of-the-week quality, and the voice-over jarring and totally unnecessary. Clearly the work of a first-time director with a small budget who either lacked or didn't sufficiently heed good advice. Too bad.I can appreciate how the people you kind of hate at the beginning are the ones you kind of like at the end, and vice-versa, so there is some sort of character arc, at least in terms of perception. For example, Watson's character, while refreshingly honest to her husband about her feelings for another man, began to grate on me near the end, particularly when she announced to her husband that she simply had absolutely no control over her actions, and later when she simply declared that she would be moving back into their marital flat, with no asking of permission, no apologies offered. And I went from disliking Wilkinson's control freak / moral relativist character to sort of understanding him and not really wanting him to change (unlike his wife).This movie awkwardly morphed from a whodunit to a \"Love Story\" or \"Steel Magnolias\" illness drama without sufficiently informing me of the fact, so I was left distractedly guessing what the next plot twist might be long after they had all been revealed (Was it the Lord driving the car? The Lord's dog?). The scene where the Lord visits Wilkinson and relates how brave Watson is, the bestest nurse any dying boyfriend could ever ask for, Florence Nightingale incarnate, etc. was OK until he started over-the-top sobbing like a baby. Good God! If you ask me she's just another flitty rich person with way too much time on her hands, and so she drives her hard working, well providing spouse crazy with unnecessary drama. Her screwing around was just another way to occupy her empty life; the dying guy thing was an added bonus for her as it somehow made her previous actions completely above reproach.Look, everyone would have been better off if Wilkinson had just left her for his secretary, who seemed to appreciate him for who he was. Instead he acted like an abused dog, his open craving for his wife's affection increasing with every kick she gives him. I'm not anti PC or anything, it just didn't ring true, even after taking into account all of the harsh realities of middle age we all tend to face. The ending for me was (and not the director's intention I am certain) depressing. The movie spent the last 80 minutes convincing me that these two people just don't belong together, so I found no joy in the promise of their relationship continuing. I'm not above wanting my emotions manipulated by a story, it just has to be somewhat plausible and not hackneyed. Is that asking too much?My score: 4/10","The basic genre is a thriller intercut with an uncomfortable menage-a-trois. Fellowes has tried to make a lot more out of this, using the lies of the title in order to bring about all manner of small twists, invariably designed to surprise the characters more than the audience.It's really rather messy though. Fellowes doesn't seem interested presenting the thriller elements in a fashion that will keep us seat-edged. Rather his focus is on the moral predicaments themselves.The dialogue is inconsistent, stagey here, vernacular there and with the constant surprise of realism undone by the occasional cliché-landmine. Though there is no fussing over the locations so that the actors can get on with existing in their space the dreadful score can't create a further dimension and often works against the emotional momentum of given set pieces. There's also a very prosaic, dare I say it British feel to the filming. I didn't want to see a document of two successful middle class people caught in an extraordinary situation, I wanted to see some sort of artful recounting of the story.Finally it is, in fact, the story which lets the rest down. Just as the elements of suspense are rather flat so the story is an asymmetric sum of subplots of different shapes and sizes, woven as a vehicle for character examination. Wilkinson and Watson support this meta-essay with good performances and John Warnaby's ebullient colleague Simon to Wilkinson is a welcome foil for much of the brow-furrowing.I'm disappointed; not that it's bad, but that it could have been much better. 3/10"],"review-user":["Philby-3","gradyharp","screenwriter-14","simplythunder","Chrysanthepop","noralee","peter-sharpe-1","leilapostgrad","MagicStarfire","keithmp","fanaticusanonymous","JackCerf","blanche-2","hardcoresocrates","phillipstephenso","ruby_fff","claudio_carvalho","a-w-j","vpalme2","suchenwi","Tom2000-3","rochejagu","ijdelahoy","rice_a_roni","Framescourer"],"review-date":["11 November 2007","24 February 2006","30 September 2005","31 January 2005","1 March 2008","7 October 2005","10 June 2006","30 October 2005","16 November 2006","18 June 2006","25 January 2009","9 October 2005","7 July 2008","21 September 2005","17 November 2005","29 October 2005","30 January 2007","6 September 2007","23 December 2006","30 November 2008","5 April 2008","14 February 2007","10 August 2006","6 March 2008","19 May 2006"],"review-rating":["7","10","8","10","5","8","7","6","7","6","6","8","7","10","7","6","9","3","6","5","7","5","4","3"],"review-title":[" Unhappy marriages are unhappy in their own way\n"," The Ensemble Effect\n"," Sex...Lies....And, NO Video Tapes...\n"," intelligent, moving, exquisite\n"," Separate Lies But One Truth\n"," Stiff Upper Lip Drawing Room Drama But Wilkinson is Dynamic\n"," Double standards that are never discussed\n"," Austin Movie Show review (very British drama, very powerful)\n"," Well written, well done film, but with characters so annoying I just\n"," Solid British drama.\n"," No fuss please, we're British\n"," Implausible Saintliness\n"," Excellent depiction of a relationship and its complexities\n"," Sometimes Holding On For Too Long... Isn't Too Long\n"," A Powerful Tale\n"," There is a stem of decency at the core of \"Separate Lies,\" writer Julian Fellowes' directorial debut\n"," Too British Way of Life\n"," Film to see over and over...\n"," Wanted to Like this Film, but it fell short\n"," Deeply cynical\n"," Movie evidences lack of philosophical foundation\n"," very watchable film with great acting and good storyline\n"," Not clear on ending\n"," Substantially less than the sum of its parts\n"," Messy\n"]}