{"review-url":["http://www.imdb.com/title/tt0394894/reviews"],"review-text":["Well, I saw that yesterday and It was much better than the other making-off from VH1, too bad than this one it's pretty outdated but you get to see all the staff who makes south park, very interesting stuff.It's also funny than this documentary portrays Trey and Matt like selfish greedy snobs creators who doesn't work and spend all the time having fun or relaxing (which is kinda ironic because they work pretty hard on the show).It also shows all the animation process to make a south park episode, interview with the actors who brings character's voices and much more.If you're a fan of south park I highly recommend you this.","Trey Parker and Matt Stone, the creators of South Park, finally get out of their grueling schedule to talk to the cameras while sipping champagne in their hot tub. At first, when watching this, I did not sense as much sarcasm as there was in this. I knew they were joking when they would complain about different actors on the show and when Trey said he wasn't going to give his mother any of his money, but there is so much sarcasm throughout, that this documentary, is more of a mockumentary full of inside jokes.This \"documentary\" shows everything about South Park (up until the second season anyways). It shows what goes on behind the scenes with the animation and the recording. It has interviews, many of which are fake interviews, but some, amongst all the fabrications, give insight into the show. Clips from both of Trey Parker's Spirit of Christmas shorts are shown, as are many good clips from the show. If you were a South Park fan, then this should have quenched your thirst for show knowledge back in late 1998 when this was made. Now, obviously the show has changed, but this is still interesting.What we have here is an amusing documentary where Trey Parker (especially) and Matt Stone come off as arrogant jerks, and that's exactly what they wanted to come off as. They may be this way in real life, but here it was a joke, a 51 minute long insightful joke.My rating: *** out of ****. 51 mins. Not rated, contains Language and Sexual Content.","Going' Down To South Park is a 1hr long documentary about South Park with interviews with Trey Parker and Matt STone and all the other people who work on South Park.There really isn't much to say, it shows the history of South Park and what it takes to make one episode.It is basically a behind the scenes of the show. It shows the different merchandise that south park has made(it was really comedy central who put it out). It also shows the controversy which was caused by South Park.It shows plenty of funny clips from the show as well.It's a fairly funny documentary.Any fan of South Park should check this out.You can find it on youtube.9/10","This British documentary was recently shown on Comedy Central during their \"Best of\" week and can also be seen on South Park's second season DVD.  I remember seeing many commercials for the DVD showing clips of this documentary, most of which occurs with Matt Stone, Trey Parker, and some other guy in a hot tub.  It was funny when I saw it in the commercials, but I was used to seeing it by the time I saw the actual documentary.Overall, \"Goin' Down to South Park\" is a fairly funny and interesting look at how South Park episodes are made and of the series' history going back to when Matt and Trey came up with the idea in college.  However, there was something about the tone of this documentary that actually felt sort of depressing.  It's not as fast-paced, rapid-fire, and as lively as the actual South Park episodes.  Instead, it kind of has a slow, dry-wit style, which at times can be funny, but most of the time you're just waiting for something to happen.  If you get the chance to watch it, by all means go for it, but I don't think you're really missing much if you never see it.My IMDb Rating: 7/10","I know that Trey Parker and Matt Stone really hate celebrities and spoof them in every single episode of South Park (if not showing them, then mentioning them) and they love to mock and joke and make fun of themselves too, but I felt this mockumentary went too far.For one thing, the most common running theme in the \"documentary\" is that they're episodes are meaningless pieces of crap they put out just for the money. Obviously, that's completely untrue if you even bother to watch any episode, and the constant \"You know, I learned something today...\"'s said at the end of almost every episode by the main characters. The creators are also depicted as pompous, arrogant asses who only care about money, including a supposed-to-be-funny-but-isn't scene involving Isaac Hayes delivering lines for Chef (over the phone) and Trey Parker yelling and screaming at him for sucking and hanging up. I guess it's supposed to be funny, but the pretension in it just really made it... cringe.The way they interview employees working for Trey and Matt shows the duo as tyrants who push their employees to the limit, all just for money, in the end. Completely untrue, obviously, and all a joke, but it's just not funny. It's disturbing, even though it's just a joke."],"review-user":["estomped","TOMNEL","gangstahippie","travisimo","phenomynouss"],"review-date":["4 December 2004","8 July 2008","12 October 2008","23 April 2004","19 May 2006"],"review-rating":["10","8","9","7","1"],"review-title":[" Great documentary\n"," An amusing 50 minutes of complete sarcasm from Matt Stone and Trey Parker.\n"," Great South Park Documentary\n"," A Somewhat Funny Behind-the-Scenes\n"," Terrible. Completely lies to us (in a joking, mocking way) about how South Park is done, and portrays false creators\n"]}