{"review-url":["http://www.imdb.com/title/tt0397065/reviews"],"review-text":["I wanted to avoid this when it released in theatre because of being a fan of Vincent Prices original House of wax. But when i saw this in theatre i was surprised that it wasn't the remake of the original. In fact it has shades of Tourist trap. Nevertheles this film is very entertaining n has some very good cool death scenes. The deaths r gruesome. It is effectively paced with some lovely cinematography, good character development, good background story of the creepy villain. Hilton's death scene was the best one. Yeehaw!","House of wax is a typical slasher in many respects but that does not take away from the certain charm it holds...it has pretty much everything you would want in a horror film.The plot is simple and standard for the genre. We are introduced to a group of young adults on their way to a football game. Carly Jones (Elisha Cuthbert) a sweet yet sassy girl who is nervous about moving to the city for a new job. Her trouble-making bad-boy brother Nick (Chad Michael Murray), supportive best friend Paige (Paris Hilton). Along with Carly's sweet and protective boyfriend Wade (Jared Padalecki) and rounding off the cast Dalton (Jon Abrahams) proving comic relief, and Blake (Robert Ri'chard) Paige's boyfriend who is really just a token character. whilst hoping to score tickets to the final football game of the season. Along the way, they run into some car trouble, and are forced to camp in the woods where they enter a desolate town where nothing is what it appears to be. What's nice about House of Wax is its relatively slow burning, sure there are some jump scares and creepy moments but the real action does not start until around the 40 minute mark, some might call this dull but for me it only makes the third act even more impressive.Despite the little character development, the acting is surprisingly good and helps make the characters likable. Jared makes a sympathetic turn as Wade but the real stars are Elisha and Chad. Elisha gives a great performance as Carly and is one of the better lead actresses I've seen in recent horror. She is vulnerable and strong at the same time, portraying fear very well indeed. Chad despite his pretty boy image does a good job as the bad-boy and unlikely hero of the film, he is strong and protective and you root for him as he tries to save himself and his sister. The only problem i had with this paring was the high sexual tension there seemed to be between them. There were many moments where you felt as if they were about to kiss and its almost better to just picture them as girlfriend and boyfriend during the final act.The film is of course not perfect, the dialog was weak and the big \"twist\" was hardly anything surprising as you could have predicted it from the start. The ending tried to give you another \"twist\" which again failed in the same way the previous one did....in fact the whole ending was a let down. The characters make very stupid choices through out the film such as not making sure the attacker is dead, splitting up etc and whilst these are also a given in slasher films it never stops being annoying. The third act was pretty intense though if a little short but all in all the film is a great fun ride full of scares and tension....also great kills and leads you want to live instead of hoping they would die.","I do not think that this movie deserves the low rating that most will give it. It's one of the best \"teenager\" horror films I've ever seen; and that's saying a lot. Nothing is left without an explanation to back it up, the characters and plot break countless horror movie stereotypes, and it has got nothing to do with some other horrible pieces we've been submitted to lately. (A clear example is the mindless \"Saint Ange\".) The first 30-40 minutes might be downright boring with the exception of the beginning, although some minor light mistakes can be easily spotted. After the arrival to the village, though, the horror -a different, twisted kind of horror- begins.With the plot and the details, goofs are minor; the characters are this movie's strongest point, given that so many clichés are broken in it. For example, the two main male characters, Nick and Wade, are not by any means the idiotic types we're used to; although Dalton might fit better in this stereotype, not is he the only one to pay for this lack of consciousness. Some scenes are truly, satisfyingly horrible, making up for tense moments scattered around all the film. And, in the end, and although everything is decorously explained, it's easy to see that things won't go so easy to the surviving characters.The only errors I can see, and which do not imply continuity (IE, Carly not finding her own cut finger in the unconscious Bo's pockets) is the illumination, which is somehow annoying during the first, boring 30 minutes. Although, plot and effects-wise, everything is drastically and cruelly twisted with the arrival of the main characters to Ambrosia, that little village in the midst of nothing, so I'll give it that. It's been pretty much argued that about 70% of the movie is illogical; \"How can two people build an entire house of wax?\", \"Where do they get all the wax from?\". These wouldn't be uprising questions if people would have paid more attention to the movie. The Sinclair brothers did not build the House of Wax; their mother worked making actual wax figures, and they were exhibited at the museum. And the scenario where Paris Hilton's unfortunate character meets her untimely death is the answer to the second question; what is with all the personal objects (mobile phones, cars, clothes) of the dead people? Using their third brother as a connection with the exterior, it's pretty much arguable that the Sinclair twins should obtain the money necessary to buy the wax, in a WWII-type fashion.So, that aside, I think the movie deserves a lot more than it gets, and nobody should lose the chance to watch it. So go see the House of Wax. Right now.","This movie was just a scary festival! it was full of frights gore and stuff you expect to be in a good horror movie! it has no clichés that i have saw and has such original deaths and killers in it. also the actors were chosen carefully and Paris Hilton did surprisingly good in this! the movie went in the right pace, the killing order and was just a great horror movie the best and scariest i've seen in a while. the ending was awesome and i found the start quite entertaining. It was sexy, scary and hot. It is full of action and the start where they were being like friends and wasn't scary was great. the characters were young, sexy, suspicious and were all great actors.","House Of Wax is pretty much everything I like in a horror movie. The killers were creepy and freaky but not too over the top. The murders were genuine and realistic looking while the cinematography was great! Carly Jones (Elisha Cuthbert) and her boyfriend, Wade (Jared Padalecki) are going to the big college football game with a group of friends and her brother, Nick (Chad Michael Murray). Along the way, they get tired and look for a place to camp out for awhile and get some rest. As you can imagine, car problems end up keeping them from getting out of their hidden campsite. Carly and Wade head for the small town of Ambrose, which seems strange on the surface.This is where the real action begins. While I admit that the movie took it's time getting to the good stuff, it was well worth the wait. The special effects department have outdone themselves. Especially when it comes to the house made of wax, itself.I was very surprised by the low rating given by the IMDb users. I should not be, but I was. Do not be fooled. If you are into horror movies, then this one comes highly recommended. In fact, it has inspired me to see the original and will do so first chance I get. 8/10","This is a chiller flick with grisly horror , genuine thrills and shocks . This eerie story contains bit good fun with grisly killing , relentless horror and lots of blood and guts . The chiller version packs scary chills and terrifying deaths such as a horrible stabbing , quartering and beheading . It deals with a group of unwitting teens are stranded near a strange wax museum and soon must fight to survive and keep from becoming the next exhibit . One by one, the entire group ends up falling prey to two murderous brothers , the creators of the town's local 'House of Wax'. Carly (Elisa Cuthbert) and Wade (Jared Padalecki) decide to go to the nearest town to get a new fan belt while the rest of the group attempts to go to the game , while Paige (Paris Hilton) and Nick (Chad Murray) stay on countryside making love . They discover that two brothers have expanded upon the area's main attraction , the House of Wax . They enter house of wax suddenly closes itself and they encounter trapped inside and soon supernatural creepiness begin frightening the hosts . Then they'll spend a ghastly time in the spooky house with killings-laden history .This terrifying film contains chills , thrills , violent scenes and lots of blood and gore . From start to final the frantic horror images and fast movement is unstopped . It's a silly but amusing horror story and with abundant use of computer generator FX and special make-up in charge of Howard Berger , among others . The wax figures are the real stars of this production , being rightly realized by means of an excellent make-up and magnificent special effects . Some scenes are clumsily shot but the movie has some good moments here and there , the illogical parts in the argument are more than compensated for the excitement provided by the creepy wax models , eerie killers and many other things . Gorgeous actresses as Elisa Cuthbert and Paris Hilton along with young male actors as Brian Van Holt , Chad Murray , Jared Padalecki , Jon Abrahams accompanying efficiently to female starring . Colorful cinematography by cameraman Stephen H. Windon , using Steadicam . The musician John Ottman creates a stirring , moving soundtrack fitting to frenetic terror . Lavishly produced including spectacular scenes by the successful American producer Joel Silver who along with Robert Zemeckis and Gilbert Adler created ¨Dark House¨ , a production company specialized on terror genre ; both of them have produced successful terror movies dealing with eerie tales about horror , grisly killings and lots of blood and gore such as ¨House of haunted hill¨, ¨Return to house of haunted hill¨ , ¨Gothika¨, ¨Ghost ship¨, ¨House of wax¨ , Whiteout¨ , ¨Splice¨ , ¨The reaping¨ , ¨Orphan¨ , among others . The flick was compellingly directed by Jaume Collet-Serra . Collet is an expert director of terror movies as ¨Orphan¨, ¨House of wax¨ and for TV as ¨The river¨ , his greatest success was the action movie titled ¨Unknown¨ with Liam Neeson . Rating : Better than average, well worth seeing . The picture will appeal to terror fans .","I wasn't expecting to much of this movie when I went into the theater but I had been waiting for it for many years. To sum it up, it was pretty damn good! Chad Michael Murray was pretty good, I thought he was going to be another Chris Flynn from Wrong Turn but I was wrong. Elisha Cuthbert was also good but the best performance has to go to Brian Van Holt. He played the bad guy too well, I mean he was sick, sadistic, and very cruel. The back story between the brothers was good, plus I liked how no killings took place until about 40 minutes into the film. It gave you time to pick the character you wanted to see live and the one you wanted to see die. Jon Abrahams was pretty good as the goofy best bud of CMM. I liked how Chad kind of cried when he found him dead, it was better then just him being like, \"Whatever, my buddy is dead, who cares\". It showed how he really cared. So overall, this was a darn god slasher with some great effects. Bravo!","A lot of people are flaming this film for the presence of Paris Hilton, but this is not a fair reason to object to the movie. The reality is that Paris has a fairly minimal part, she spends the vast majority of the movie off screen. The film also makes fun of her on several occasions, usually involving a camera and at least once in night vision. For those who enjoy Paris Hiltons stage presence, this may be a movie to see at home when its released on video, because at the screening I was at, we all laughed at her misfortunes through the movie and she is portrayed as a \"woman of questionable values\".The movie itself was pretty good (unlike the recent flood of weak horror flicks), it has everything a good horror should; a creepy villain, excessive violence, acts which make that average person cringe...this movie hit all the bases. It is definitely worth a watch.","While HOUSE OF WAX will never be mistaken for Texas CHAINSAW MASSACRE or HALLOWEEN, it does try and ultimately succeed in being a worthy addition to quality horror film making. There is enough tension and enough implied gore in here to please the young audience of today and there is also enough explicit gore to please some of the purists of yesterday. Overall, it is quite a well done film that should do okay on DVD.Six kids on the way to a football game get stranded in a DELIVERANCE like setting and what ensues actually looks like it may have been taken out a discarded Deilverance sequel and the backwoods hicks seem to taunt the group. Eventually the group has to break up and half of them head into the desolate town to get some car parts. The other half of the group stays behind at camp and this sets up the second half of the film.House of Wax has many strengths. The first is that it is blessed with a very likable cast. Paris Hilton is fine in her role but she is far from the focal point. Chad Michael Murray, Elisabeth Cuthbert and Brian Van Holt are three very charismatic actors and their presence in the film adds some panache, some credibility and some flair. I had never really heard of Chad Michael Murray, only that he was a pin-up type teen heartthrob. But he has a presence to him. He imbues an intangible to him that seems to translate into his performance. He is instantly likable and he possesses a strong character trait. I enjoyed his performance much more than I figured I would and when he was on screen, the film flowed.The question now becomes, \"Is this film a worthy horror film?\" And the answer to that is a resounding YES. As I mentioned off the top, it is not in the same class a NIGHTMARE ON ELM STREET or LAST HOUSE ON THE LEFT, or even THE RING, but it is relatively tense, quite graphic and there are some very inventive death scenes. This is not the HOUSE OF WAX that your parents told you about. Vincent Price is nowhere to be seen and when you start seeing fingers being cut off and hot wax covering comatose bodies, you realize this film is a little on the edge.I'd like to see an uncut director's X rated version. I bet there is one out there somewhere that would be much more violent than this one. Be that as it may, this is a very good entry into the horror genre and it is heads and shoulders above weak films like I KNOW WHAT YOU DID LAST SUMMER and DARK WATER and a few others. It is definitely worth a look.8/10","I'm not sure why this film is averaging so low on IMDb when it's absolutely everything you could ever want in a horror film. This is the definition of being a horror film. I consider myself to be a big horror fan and I must say that this house delivers the goods. House of wax Is the story of a group of college kids on their way to a football game whom decide to camp out for the night and have a run in with a local weirdo. Upon waking the next morning they make a gruesome discovery and decide to go into town for a broken car part. The town is creepy and I'm just gonna stop there. Because thats when the truly gruesome mayhem begins. trust me when I say if your looking for a horror film go see this you will love it. It's wonderfully diabolical and inventive with it's killing scenes, the story is interesting and the characters are decently drawn with the actors giving them gobs of personality. Paris Hilton included whom does quite well with her part. the film lies a little on the shallow side but it's so much fun and who cares. This movie should eat up the box office and all horror fans should have part in it. Go see House of Wax the film that features skin being peeled, super glued lips, dead animal carcasses, hot wax sprayed on a still living person, a finger being cut off, a decapitation, a pole through the head and much more. I was lucky enough to witness this film at the Tribeca premiere and all the actors were on hand to promote the film. And boy do they have something to be proud of House of wax is the scariest roller coater ride of the year! 9/10","Watching this, you're reminded of a scene from reality show 'The Simple Life', in which socialites Paris Hilton and Nicole Richie attempted week after week to do normal jobs (and failed). In one episode they were spending the day as funeral home interns. It's a wonder the embalmed-looking pair weren't buried by accident. \"I don't know what's worse\", mused Paris at one point. \"Being buried in the mud, or burnt.\" It's a toughie. Eventually, a single thought emerged. \"I'd like to be frozen.\" House of Wax was partly sold with the wish-fulfilment tagline: 'See Paris Die!\" and although she's not turned into an unnaturally slender ice-pop, her dispatch would make a kebab shop owner coo with pleasure. The game bird reportedly cheered along at her own offing during a screening. And much of the film has its tongue firmly in cheek - or should that be its ear? No real relation to the vintage 1953 Vincent Price film, this really quite demented little movie (overly castigated on first release) sees six teens getting lost in the woods and stumbling on a near-deserted town that the AA wouldn't recognise. And whose residents look a bit candle-y. Madame Tussauds being so pricey nowadays, it's lucky the town's titular attraction is a just-walk-in kind of joint, with remarkably realistic-looking exhibits. Cue the carnage.","This movie turned out to be much better than it should have been. I found the opening few minutes involving the two villains when they were young, quite distressing to watch, which did surprise me.The special effects were very impressive, and were suitably gory enough to send a chill down your spine. This movie definitely plays on the notion of wax figures being somewhat creepy, and takes full advantage of it. The scene where one character discovers another fully waxed up, his tear-filled eyes still moving, and attempting to save him, is a highlight.Paris Hilton, the only real major 'star' name to this movie, acts to the best of her ability. Make of that what you will. She does provide one of the major highlights to the movie.I did enjoy the ending, although the so-called twist at the end was a bit of a let down.A great Friday night movie!","I typically prefer more \"underground\" horror films to the recent run of theatrical teenie-theater trash and remakes that have bombarded the cinemas recently...but honestly, even with all it's faults and annoyances - the HOUSE OF WAX remake wasn't too bad. I did hate the cast, made up of your typical pretty and popular Hollywood post-teens in typical and un-unique stereotypical roles (the tough-guy loner \"rebel\", the goofy but semi-hip dork thrown in for comic relief, the slut, the tough but innocent female lead, the nosy boyfriend, and of course the token black guy...). But of course, these films aren't typically praised for their performances or originality - so I won't bitch too much. Also, it's been far too long since I've watched the original HOUSE OF WAX for me to compare the two - so I'll rate this one strictly on its own \"merits\" (or lack thereof...).Six kids in two cars are on their way to an out-of-town football game. They camp for the night and have a brief run-in with a weirdo in a pickup truck. When they wake up one of the cars has a busted belt. 4 of the six continue on to the game, the other two decide to head to a small nearby town instead to get the part they need. Of course, the town isn't what it seems - and when the two discover a strange wax museum, things start to go nuts as the towns secrets are revealed...HOUSE OF WAX drags on for the first fifty minutes or so, but not so badly that it'll put you to sleep - especially if you sit around with a few friends and make fun of Paris Hilton and the \"tough-guy\" and the other dildo's on display here. But once things get moving the film stays pretty fast-paced for the rest of the run time. There are actually some very decent kill and gore scenes - much stronger than I would have expected for such a film (Paris Hilton's demise and the baseball-bat face-smash being particularly notable...) and are most of the reason this film gets an OK rating from me. No actual tits or ass, so sleaze fans will be disappointed. A good bit of typical horror cliché \"jumps\" and \"twists\" which I find annoying but are nothing out of the ordinary for this type of production. An OK way to blow a couple of hours - \"theatrical\" and younger horror fans will probably dig it a lot and may appeal to more \"hardcore\" horror fans due to a few relatively gruesome moments. 7/10","I do not think I am alone when I say that 2005 has not been particularly kind to the horror genre. While \"Cursed\", \"Hide and Seek\", \"The Ring Two\", and \"The Amityville Horror\" all showed glimpses of interest and potential, there have been more misses than hits. For proof, see: \"White Noise\", \"Boogeyman\", \"The Jacket\", \"Mindhunters\", and \"Alone in the Dark\". Imagine my surprise when \"House of Wax\", tightly written by siblings Chad and Carey Hayes, turned out to be... well, a surprise.Carly Jones (Elisha Cuthbert) is a young woman, traveling with her trouble-making brother, Nick (Chad Michael Murray), and boyfriend, Wade (Jared Padalecki). They are, along with Paige (Paris Hilton), Blake (Robert Ri'chard), and Dalton (Jon Abrahams), hoping to score tickets to the final football game of the season. Along the way, they run into some car trouble, and are forced to enter a desolate town where nothing is what it appears to be.Upon hearing of this, a remake of the classic Vincent Price B-movie, I rolled my eyes. I did not even want to think about what disaster freshman director Jaume Serra had cooked up for his audience. In a time when most high-profile horror films are disappointments, latent with bad writing, static direction, and amateur acting, I consider myself lucky that Serra and the Hayes brothers took it upon themselves to make a good, old-fashioned, spook fest. Unlike the disappointments that I named before, this flick pulls no punches, and uses every cinematic trick in the book to give everyone exactly what they came for.I am happy that the Hayes' actually took the time and effort to create likable and believable characters, thus making the events that much more urgent. It also gives the young actors portraying them something grip on. As she did in \"The Girl Next Door\", Elisha Cuthbert proves to audiences what a skilled actress she really is. In the 2003 remake of \"The Texas Chainsaw Massacre\", Jessica Biel silenced naysayers by delivering a raw and emotional performance, one that put the viewer right there with her. Here, Cuthbert does the same. Chad Michael Murray (\"A Cinderella Story\"), in one of his first more mature roles, is no slacker as Nick. Murray exudes charisma and a hard edge, as well as some impressive athleticism on top of it. Murray and Cuthbert gel perfectly, and have tangible, familial chemistry.More so than anything else, the press and the American public have made a field day about Paris Hilton's major acting debut. As I expected, Hilton does not embarrass herself. In fact, she is just as good as anyone else in the movie (do with that what you will). Like Cuthbert and Murray, Hilton has screen presence. She is sexy and playful. I cannot think one of reason why she's gotten the worst of the film's harsh reception, other than they are simply picking on her. Jared Padalecki (TV's 'Gilmore Girls') memorably manages to overcome his underwritten role. Robert Ri'chard (TV's 'Cousin Skeeter') and Jon Abrahams (\"Meet the Parents\") do not have much to work with, but get the job done. With only one scene, Damon Herriman (\"Soar\") makes an unforgettable impression, and his presence hangs over the rest of the film. Finally, Brian Van Holt (\"Basic\") is superb and threatening in a dual role.Once more, kudos must go to the screenwriters for avoiding clichés whenever possible. Despite popular opinion, \"House of Wax\" is quite unpredictable for a majority of its running time. Take this for example: It seems as if the killer is down for the count and Carly bends down to retrieve something from his pockets. What do you expect to happen? See the movie, and you will understand what I mean. It is also refreshing to see a horror film in which the characters show even a modicum of good sense.Unlike most horror scores, John Ottman's exhilarating work never distracts. However, as with Dark Castle's other releases, the visual aspects of \"Wax\" are award-worthy, and lift the film above its genre trappings. The talents of cinematographer Stephen F. Windon, production designer Graham Walker, art director Nicholas McCallum, and editor Joel Negron highlight the ghoulish imagery. Speaking of imagery, I believe that the gore hounds will be thrilled with the many makeup effects and tricks in store here. Each death scene is more stomach churning than the last. Considering his past in music videos and commercials, it is obvious that Jaume Serra has a great eye for style. His \"in-your-face\" approach is a great asset to this film's success. Just when you think the camera will turn away, it does not. He is also particularly good a building thick layers of dread and atmosphere. One standout shot is our introduction to the killer, as he slowly emerges from a trap door.In a case like this, I would usually admit when I am in the minority (Shut up, okay? I liked \"House of 1000 Corpses\"!). In this case, I firmly that the detractors have gotten it wrong. I am not sure why people are so hard on this film, considering it's much better than recent genre entries. Maybe they're afraid to admit that a horror flick starring Paris Hilton could possibly be worth watching... Who knows? This is a horror film, and a commendably stylish and effective one at that. As a lifelong horror fan, all I can say is that I thoroughly enjoyed \"House of Wax\", in all of its lurid and sadistic glory. I safely consider it a great accomplishment in modern horror, as well as (along with \"Sin City\") the first completely satisfying release of 2005.","I've never seen the original \"House Of Wax\" so I really didn't know what to expect when I went to a sneak preview of the new film. After a somewhat wobbly start introducing our young characters, \"House Of Wax\" shifts gears and becomes an extremely effective horror outing.The plot really doesn't matter too much here - I think most people know upon seeing this that these stranded kids are going to meet up with a nasty killer and find some awful things in the titular house of wax. It's all about the special effects here, and they are top notch. Viewers who like their horror movies with lots of blood will be satisfied here, but there are other ghoulish effects as well. The production design and sets are excellent, and the cast makes the most of their under-written roles.Of course, many people are probably wondering just how Paris Hilton's performance is. To be honest, Hilton acquits herself quite well, and she doesn't portray \"herself,\" as so many people are predicting. Her character is sexy and sweet, and I think her good work will hopefully change a lot of people's opinions about her. Elisha Cuthbert is also good, moving up from her previous movie, the atrocious \"The Girl Next Door.\" Her character is put through a lot, and Cuthbert proves to be a feisty heroine. Chad Michael Murray, like Hilton and Cuthbert, is pretty to look at, but unfortunately is not very convincing as the \"bad boy\" of the group.I predict good things for \"House Of Wax,\" as the audience at the screening I attended hollered, screamed and clapped through out many parts of the movie. Congrats to the cast and crew for a job well done.And a congrats to Paris Hilton for proving a lot of people wrong. Like she always says - \"That's hot.\"","I saw a sneak preview of this Tuesday night with a group of friends and we had a blast! After seeing sneak peaks for BOOGEYMAN (Horrible! 3/10) and Amityville Remake (so-so 6/10) I enjoyed this a lot more! As seen in the trailer, one knock I had was believing that a whole town could be \"forgotten\" but this is a cheesy popcorn horror movie so I accept it for what it is.My only major complaint is I assumed Paris Hilton would touch wax or get dipped etc. and moan \"that's hot\" but they didn't do that (how could they resist???).There is NO nudity from the 2 girls although Paris looks great in her lingerie! I'm surprised they didn't put a 3rd \"hot token victim\" in the movie for some needless nudity which is the norm for this type of flick! I won't list any death or plot spoilers BUT I will say that Paris & Eliza both get roughed up good! The characters are developed decently and are somewhat likable (not like Cabin Fever where you wanted them to die) and the movie has a decent pace although nothing happens in the 1st 30 minutes like most horror films.I give it a 8/10 as it delivered good scares and gore and I had low expectations going into it. If you go with some friends that like cheesy horror movies you'll have a good time.Noah","OK, maybe it doesn't deserve an Oscar. Or a Golden Globe. Or any award, for that matter. The acting isn't outstanding, there's no reason to give credits to the directing, and its really just another semi-gory 21st century slasher flick that MOST people will consider just decent. Or maybe even dreadful. But in my opinion, all of this doesn't matter a bit. And thats because i had a great time watching this movie.Sure, the first 40 minutes are pretty slow, but as the movie progresses, something in it you will like, if you are like I was, and anybody else should be when watching this movie. And that is: looking for 2 hours of fun, mindless violence. (And a kick-ass ending, which i won't spoil.) Yes, there are many flaws in this movie, but don't let the cast list on the front cover fool you. Hilton delivers a decent performance that nobody saw coming. Even her greatest haters like me and my friends had to agree that she surprised us greatly with her barely believable acting skills and a strip-tease that wasn't as nasty as anything an online pop-up would promise of her, but still not so unbearable as to fast-forward or turn off the DVD.The violence in this surprised me; nobody at school or on the horror board was talking about it like they were about \"these new movies called 'Saw' and 'Hostel'\" but I could safely say that \"Wax\" was more graphic than Saw, and some death scenes were actually quite disturbing.In conclusion, I'm not surprised House of Wax didn't make a place on the IMDb Top 250, but it is definitely worth a look.","Title-only remake of the 1953 Vincent Price thriller has more in common with The Texas Chainsaw Massacre (or the lesser-known 1979 movie Tourist Trap) than with the original film, but still it's a surprisingly good ride for horror fans.College kids stumble upon a backwoods town and make a deadly mistake when they decide to visit the creepy local wax museum.Upon first viewing this film last year I admittedly enjoyed it but still I was rather critical of it too. For one thing the presence of Hilton was just annoying (she has money, but no talent) and story-wise the movie felt all too familiar. Yet now when I review this movie again, it really seems more and more like one of the better horror films of 2005. While House of Wax does have some flaws, it also has a number of good qualities going for it too. The story does boast some good suspense, much of the cast isn't bad, the art direction is awesome, and the special FX are truly outstanding. The murder sequences in this film are quite good, allowing plenty of gore for the shock-fans. The FX for the climax are very impressive as well! The direction is slick and the soundtrack has some good rock numbers to boot.Cast-wise the film isn't bad either (except for Ms. Hilton of course). Elisha Cuthbert makes for a likable heroine, Chad Michael Murray does a good bad-boy performance as the bother, Brian van Holt is good as our villain, and Jared Padalecki is solid in the role of Cuthbert's ill-fated boy friend.So in retrospect House of Wax is a good time for horror fans, or those that would just like to see Ms. Hilton meet the wrong end of a spear.*** out of ****","\"House of Wax\" is a very formulaic horror movie, it follows all of the formulas that are used in modern slashers, but it still manages to keep itself entertaining and enjoyable enough for any horror fan to enjoy it. The film is about a group of teenagers are on their way to a college football game. They stop in the woods and set up a camp and party all night, hoping to leave early the next morning. A strange person in a truck arrives during their partying, and one of the kids throws a beer bottle, smashing out a headlight. The next day, they find that one of their cars is broken, so the group splits up, most of them leaving for the game, and the rest stay behind to head to an old abandoned town, where there is a magnificent wax museum and all kinds of odd things. But little do they know, the entire town is one giant wax museum - each wax sculpture an actual corpse, coated with a thick layer of wax...This movie was really clichéd in some instances, but it was still entertaining on many levels. The cast was good, and surprisingly, Paris Hilton can actually act - she's not amazing but she pulled it off better than I expected. Elisha Cuthbert is actually a pretty good actress too, and I was rooting for her throughout the whole movie. The chemistry between her character and her twin brother, Nick, was kind of awkward though. They seemed more like ex-boyfriend/girlfriend, but that's a minor problem really. Chad Michael Murry is Cuthbert's opposite twin brother, and Jared Padalecki plays Carly's polite boyfriend.Really, the most remarkable thing that I picked out of this film was the wax town, Ambrose. It was a really atmospheric and spooky location, and the wax figures were interesting too. The finale in the melting wax museum had some great visuals, probably my favorite scene from the whole movie. There's some decent (and realistic) gore in the film as well, but it doesn't go too far overboard and has it's limits. This film obviously ripped off the 1979 cult-horror film \"Tourist Trap\", go back and watch that and you will notice the many similarities between the two. According to IMDb though, this film is a semi-remake of that film, no surprise there.Bottom line - \"House of Wax\" is a pretty formulaic slasher movie, but it does what it's supposed to do, and it manages to be a pretty entertaining movie nonetheless. Expect a routine slasher movie that is slightly better than most (and don't forget to look out for the nicely done \"Whatever Happened To Baby Jane?\" theater scene). I enjoyed it for it's creativeness and the nicely told story - most horror fans won't be disappointed with it. 7/10.","Although not strictly a remake, House of Wax is the latest in the recent trend of Hollywood plundering old horror titles and repackaging them for a new younger audience. The story is as formulaic as you'd expect, six good looking young people go on a road trip for a big college football game, only to become stranded in a forest by nightfall. The next morning they find that their car has broken down/been sabotaged so searching for help this brings them to an isolated town that is home to the roadside attraction, the House of Wax. Here they meet a strange yet friendly local called Bo (Brian Van Holt) who is hiding a sinister secret and well you can probably guess the rest.The group is led by Carly (Elisha Cuthbert) her bad boy twin brother Nick (Chad Michael Murray) their friend Paige (Paris Hilton), the rest of the friends are all fairly one dimensional and therefore doomed. As the teens try to get help in the town they soon discover that it has long been deserted and is now being run by the sadistic Bo and his deformed twin brother Vincent who have been immortalizing their victims as wax sculptures all over the town. Each teen is killed in a more brutal way until it is only Carly and Nick left to face off against Bo and Vincent.I'll admit I went into this one with very low expectations; it has Paris Hilton in it for God's sake. But I was pleasantly surprised, Elisha Cuthbert and Chad Michael Murray both work hard with the material their given, which isn't much but both are convincing in their roles. Elisha Cuthbert gives a good Sigourney Weaver/ Jamie Lee Curtis heroine performance and Murray is good as the brooding bad boy. Fortunately for the film Paris Hilton is only a minor character in the films plot, she's kept away from the action most of the time and only pops up to make a few in jokes about her infamous sex tape and then to meet her demise.The film does have its faults though; it's very slow starting and tries desperately to create backstorys about characters you don't care too much for. In fact it's almost a third into the movie before a murder happens. Also the ending with twins versus twins seemed to be trying to be something more profound. The fact that the screenwriters are twins may be a clue, but I have a twin brother myself and I couldn't work it out.Serra, a first time film director does do a nice job though, especially with making the murders extremely graphic and inventive. There are no simple splatters of blood but more horrific incidents such as having your achilles tendon cut, skin peeled off and fingers chopped off. All these are done in close up with cringe inducing sound affects that will delight any horror fan. The special effects in the last twenty minutes as the House of Wax begins to burn are also very impressive and show clear influences from producer Robert Zemeckis.If your a big fan of Horror films you'll love this, if not just leave your brain at the door and enjoy yourself.","**1/2 Elisha Cuthbert, Chad Michael Murray, Brian Van Holt, Paris Hilton and Jon Abrahams. Directed by Jaume Collet-Serra.Yet another classic horror film remade with dunder-headed teenage acting despite grizzly and creative deaths. Based on the 1953 Vincent Price film House of Wax where a maniac kills unsuspecting teenage hooligans and turns them into priceless wax figures. Still with the fantastic set design to make the whole house into wax the movie is a typical classic horror remake like Tobe Hooper's 1974 classic Texas Chainsaw Massacre later remade, despite creativity and so-so acting the movie was still just a gore picture. Director Serra showed mild enthusiasm with his directing but still worth watching. My final rating 7/10.","Most of you who keep track of my reviews know my opinion of remakes. If you can't take the existing material and improve on the original idea, then don't waste the movie going public's time. Naturally, when I heard that a remake of the 1953 Vincent Price camp classic \"House of Wax\" was being made..and starring Paris HILTON for God's sake, I naturally assumed that this was going to be an epic suckfest just as every other remake for the past few years.I couldn't have been more wrong. The 2005 version of \"House of Wax\" is a suspenseful, savage, overly gory horror film that really packs a wallop. Director Jaume Serra has created an atmospheric film that, once it gets going, is relentless in it's goal to scare the hell out of you.Plot line is fairly simple, by the book horror film. Group of kids go on a trip (in this case, a football game), stop to camp in the backwoods and end up running into a vicious killer. In this case, a man and his separated Siamese twin take over the work done by their mother, turning an entire town (which, conveniently has been forgotten by the world) into wax. Once the somewhat stereotypical characters wander into this town after having car trouble, the viciousness begins and never relents.The lovely and talented Elisha Cuthbert leads the cast as Carly, a young woman who is about to begin her new life in New York interning at a popular magazine. She heads off to a football game with her boyfriend Wade (Jared Padalecki), his friend Blake (Robert Ri'chard), and his girlfriend Paige (Paris Hilton). Also along for the ride is Carly's troublemaking brother Nick (Chad Michael Murray, in a great characterization) and his buddy Dalton (Jon Abrahams). Nick steals the movie, but Carly more than holds her own, especially given the extreme brutality she endures during the last half of the movie. Blake and Dalton's characters were really throw away, I could have easily lived without them, but Paris never detracted from the film at all. In fact, up till her well publicized death, she got very little screen time.As I stated earlier, this was an extremely gory film. The death scenes are not only very creative, but very explicit in their on-screen execution. In fact, this movie's savagery is rivaled only by \"Saw\" in terms of graphic.I went into the theater expecting this movie to be horrible, I walked out two hours later feeling drained and breathless. Surprisingly good remake, and not for the squeamish.3 out of 5","My college theater just had a special screening last night of this film. I have got to say that I think everyone was impressed with how good this movie was. Though, my roommate didn't care for it but he's not into horror movies anyway and just went to see if Paris Hilton can act. By the way, if you're worried about that, don't be. I'm not exactly one of her fans, but I must be honest and say she was pretty good and she has the best death scene. Overall, all the actor's were very good. I'm not gonna go into detail for the plot since I'm sure you know about it. Surpirsisngly, the characters are pretty engaging and you actually care for them, especially Elisha Cuthbert and Chad Michael Murray's characters. We meet them as rival siblings and end with them having to work together. Another plus is that it does not have the sleek look of Amityville Horror or Texas Chainsaw Massacre and feels almost documentary-like rather than a music video (Don't get me wrong, I loved Texas Chainsaw and enjoyed Amityville).Now for the death scenes. In most slasher movies, whenever a character is stabbed or killed, the scene immediately cuts away to another scene,but not in this one. When a character is about to die, they die pretty gruesomely. But the filmmakers don't stop there and add a little something extra each time for each victim. I won't say anything about the death scenes and will let you see them for yourself.While this is a great slasher movies, it does have the flaws of almost all slasher films (exploring a creepy house when you shouldn't be, getting a ride with a suspicious character, splitting up, and screaming so the killer can hear you). Also, there is a kinda stupid plot twist that was unnecessary and didn't add to the film at all. You could tell it was just added in at the last moment and if you took it out, it would not have affected the movie at all.Basically, if you are a horror film fan, see this movie. You will not be disappointed. It's got all that's needed to make it a great slasher film, possibly the best of the year even though it's kinda early. The suspense is felt and it is at times a funny movie. If you hate horror films, chances are you may like this one and if you are divided, I encourage you to give it a shot.","A group of friends on their way to a college football game fall afoul of a pair of killers who trap them in a town made entirely out of wax, except for the eerie wax figures may actually be more real than they look.The premise is fairly simple and not that original. Recent horror films like Wrong Turn and The Texas Chainsaw Massacre have already covered this territory. However, this doesn't stop House of Wax from being an enjoyable and entertaining horror film. For starters, the story and characters have a lot more depth than recent slasher films. Instead of just rushing into the murders, the film moves at a slow pace and actually introduces the characters. The audience will actually feel sympathy for them later on since they aren't all one dimensional. Jaume Serra keeps the first half of the film bloodless yet still engaging and he manages to make the second half pretty suspenseful. I'm glad he took this route and it made the film a lot better than I was expecting.The acting is pretty good for this type of film with the best being Elisha Cuthbert. Her performance isn't amazing but she's easy to like and she also has an engaging quality that draws the viewer's attention to her. Chad Michael Murray gives an okay performance, nothing special. Jared Padalecki also gives an okay performance, again, nothing special. Paris Hilton just plays herself and she does an okay job. However, she's easily the worst out of everyone. Jon Abrahams just gives an annoying performance and his character isn't really needed.While the characters are developed, some of them are still kind of stupid. I know this is a horror film but some of their actions just left me confused. There were a lot of \"don't do that\" moments but this was kind of expected. The death scenes were pretty nice and stylish. There were some creative ones that are worth checking out. The killers looked scary and they were pretty effective. The ending was kind of disappointing though. I loved watching the whole museum melt down and it looked awesome but the ending still felt a little to simple. Also, I hope they do make a sequel since they left it open for one. In the end, House of Wax is a solid horror film that's worth checking out. Rating 7/10","A horrible, horrible, horrible film. I saw the original when I was a kid and it gave me nightmares into my teens. When I found out a remake was on the way, I groaned. WHY OH WHY remake a good film? Well, we can thank Dark Castle for buggering yet another classic horror film. This time they've replaced a somewhat interesting story with gore, slower than slow pacing, and yawn-inspired characters. Someone previously said that s/he was surprised that Paris Hilton can act. Uh, were you watching the film? She plays a prissy little tramp. Sounds like typecasting to me. Half of the people in the audience actually CHEERED when she died! That tells you why people are seeing this film. If that's your only reason, then find a better one, because like a black hole this thing will suck out more of your life than you'll want. Had I been alone, I would have left 10 minutes into the boring exposition. This thing is like a moron's guide to crap film-making: In bred Southern git, stupid but attractive leads, knives a plenty, gore a plenty, stock menacing truck, I could go on. After watching this film, I began to really appreciate Jeepers Creepers, and I thought that film sucked. Save yourself and avoid this crapfest at every cost."],"review-user":["Fella_shibby","lbabe29","Artistic_Differences","jawwwl","BigHardcoreRed","ma-cortes","jakewill78","daman2642","baumer","rcavellero","Ali_John_Catterall","sa_scott","EVOL666","robertrosado","CarolAE716","noazrk","FlipThePrinceCharming","Nightman85","drownnnsoda","jimmyneo1","EvLauster","Ace-38","pw04","christian123","editor-92"],"review-date":["13 July 2017","2 May 2010","16 July 2005","8 September 2009","11 May 2005","1 April 2013","14 May 2005","29 April 2005","18 October 2005","1 May 2005","3 December 2009","26 January 2009","8 March 2006","9 May 2005","4 May 2005","5 May 2005","24 April 2007","10 July 2006","6 July 2006","2 March 2006","8 November 2005","6 May 2005","26 April 2005","9 May 2005","3 May 2005"],"review-rating":["8","8","7","8","7","7","7","8","10","7","7","7","10","9","8","7","7","7","7","7","8","6","1"],"review-title":[" Some really good death scenes n Hilton's one the best.\n"," A guilty pleasure of mine, a fun and entertaining slasher.\n"," Beautifully twisted. Satisfyingly gross.\n"," Scaryy as hell!!\n"," Pretty Realistic, Intense Violence.\n"," Creepy and gory horror movie professionally by the Spanish director Jaume Collet -Serra,\n"," Great Slasher!\n"," ...and we all cheered\n"," Surprisingly violent, and lots of fun.\n"," Hot Wax at Tribeca\n"," Wax on, Wax off\n"," Surprisingly good\n"," Relatively Amusing Teenie-Horror Remake\n"," Home Sweet Home\n"," Very Entertaining!\n"," Great Gore & suspense....but NO Paris touching wax and saying THAT'S HOT!???\n"," A Guilty Favorite of Mine\n"," You gotta admit for a crazed murderer the guy's got talent!\n"," Routine, But Surprisingly Well Done.\n"," Not too bad at all\n"," \"Wrong Turn\" meets \"Texas Chainsaw massacre\". Still the fakest thing is Hilton's acting\n"," Yet another remake\n"," A Great Slasher/Horror Film\n"," Formulaic But It's Still Entertaining\n"," What a piece of sh*#\n"]}