{"review-url":["http://www.imdb.com/title/tt0370295/reviews"],"review-text":["Yep, it's good fun, somewhat low-buck, er, um, no-buck special effects of the Harryhausen school, unintentionally funny dialogue, actors who seem to be buying the preposterous plotline, a couple of cute girls for the guys, a suitably hunky leading man, and spiders, spiders, spiders! Highly recommended on the fun scale, if you're expecting Oscar winners, you're in the wrong place....definitely worth a rental! Oddly enough, none of the reviews I've seen have mentioned the chemistry between the two leads, nice sparks between the two, and believable, plus, she's quite hot, also, all the actors, except for the requisite slimeball come off as very likable folks. My only complaint is that the Vermont location used for shooting can never look anything like the supposed Arizona in the plot...","In a way, you have to respect Arachnia. It's clearly meant as a tribute to the big bug movies of the fifties, and while the special effects look terrible; at least the film doesn't feature CGI. However, on the other hand; you can't respect the film too much because it's a load of rubbish. The acting is terrible, the special effects (as mentioned) are impossible to take seriously, and once you've seen one giant spider being blown up; you've seen them all, so it gets boring rather quickly. The plot follows a bunch of people who are unlucky enough to be in a plane crash after a meteor shower. They go to the only house in the area; which just happens to be a house where a man has a huge spider he used to use as a circus attraction. Coincidently around the same time, the meteor shower has caused more giant spiders to rise from underground. All the characters in this film are poor caricatures; none of them have anything even resembling a third dimension and they will soon begin to thoroughly bore you. You've got to feel for director Brett Piper as he clearly didn't have much to work with for this film; but that doesn't make Arachnia worth a damn, and overall there are better giant bug films than this, and therefore Arachnia doesn't get the seal of approval from me.","\"Arachnia\" isn't that bad of a cheesy creature feature.**SPOILERS**Traveling to Arizona to examine a new fossil recently unearthed, pilot Sean Pachowski, (Rob Monkiewicz) with Professor Mugford, (David Bruce) and his assistants Chandra Weaver, (Irene Joseph) Trina, (Bevin McGraw) Kelly, (Alexxus Young) and Deke, (Dan Merriman) witness a meteor shower flying close-by, and a crashing one forces their plane down. Regrouping and attempting to find shelter, they come across an abandoned house in the middle of the desert. The owner of the house, Moses Cobb, (James Aspden) thinks them trespassers until they prove otherwise, and returning to his house, he shows them a gigantic spider that he claims was once alive. When giant spiders show up and attack the farm, they devise a plan to help survive against the ever-increasing number of spiders.The Good News: There is a lot of good here, most of it the campy nature of the film. Few films today are willing to pay homage to the creature features of the early 50s, opting instead to concentrate on the 70s films and leave the earlier ones alone . It's refreshing when one comes along to have the spirit of those films quite competently. From the easily explained and rendered plot to the blatant borrowing of other films to carry it's storyline, the exploitative elements of nudity and violence as well as the well-timed comic relief, this just screams giant camp-fest. The brief moments of greatness do come across as being quite nice. One of the best is the moment where a character runs from the crashed plane and nose dives at the point where the cliché would have the thing explode, only for nothing to happen. A quite inspired moment that left a well-deserved chuckle afterwards. The bathtub scene, and in general anything with the two women were nice to watch, even though one of them was a total cop-out. The ending is the real highlight, where the film shifts gears and becomes the all-out camp classic that it was destined to be but wasn't, with loads of action, a couple of witty moments, and some nice moments strung together. It's the real highlight of the film.The Bad News: As much as their was to like in the movie, there was also a couple of things hurting it. First off, the pacing is a big mess. The opening gets things off to a flying start, but then it seriously drags things out until the very end, only sporadically showing signs of life. That means the middle section will really test the most discriminating viewer's patience, even before they're rewarded with a grand conclusion. The spiders come into the movie much too late, and their low kill total does them no favors. Speaking about the spiders, they are so cheesily rendered and depicted that hardly anyone would be scared of these creatures. They are just beyond looking bad and instead are laughable. It's hard to believe what would be more realistic in this situation: cheap CGI or what was presented here. They were that bad. They invoke the tone they wanted quite admirably, but come nowhere close to being believable.The Final Verdict: While not the best giant spider flick, there's some others that aren't as good. Some pacing issues aside, this could've been a great little find. It has the potential, the ingredients, and the sense of fun, but it doesn't quite make it there. Only for those hardcore fans of the genre or those in desperate need of a new flick for their annual Friday Night MST party with friends.Rated R: Violence, Nudity and Language","This is a low budget stop motion monster movie from Brett (A Nymphoid Barbarian in Dinosaur Hell) Piper... and it delivers just what I'd expect from such a production: light-hearted (though cheesy) dialogue, some cute actresses and lots of stop motion critters. That's why I've given the film 10 out of 10 - because it delivers what I expected it to deliver... and a bit more: Brett doesn't penny-pinch when it comes to putting his critters on screen. He hurls lots of bugs at his cast for the finale. And, anyway, I LOVE stop motion monsters which, compared to CGI critters in bigger budgeted movies, just seem to be that much fun to watch.","Arachnia starts as Professor Mugford (David Bunce), his personal assistant Chandra (Irene Joseph), a grad student Deke (Dan Merriman) & two twins Kelly (Alexxus Young) & Trina (Bevin McGraw) are flying via a small chartered plane to an archaeological dig in Arizona where Mugford is due to give a lecture. Unfortunately a meteor shower forces the plane to crash in the middle of nowhere, the pilot Sean (Rob Monkiewicz) manages to crash land the plane without any fatalities (& not even a cut, bruise or scratch on anyone come to think of it) & the six survivors look for help. They come across an old farmhouse & decide to pitch up there for the night, however what they don't know is that the meteor shower has unleashed some huge mutant spider like creatures from under the ground who are on the look out for potential food & a host that they can lay their eggs into...Written & directed by Brett Piper who also credited with the special effects this is another low budget horror flick which is getting universally trashed here on the IMDb by people whom I assume are looking for Transformers (2007) style special effects & a hundred million dollar budget, if that sounds like you then avoid Arachnia at all costs but if you appreciate a nice little homage to the giant bug flicks of the 50's & 60's then this might interest you. The light hearted script by Piper doesn't take itself too seriously & starts off pretty well then it seems to get bogged down with not much happening for a large chunk of running time before the giant spider things attack & the fun kicks in. The character's are cheesy clichés but I felt the film had fun with them & were quite likable, I liked Chandra the obligatory 'strong' female, the air-headed lesbian twins were amusing as one wanted to get undressed & take a bath even in the situation they found themselves in (even though they had no bubble-bath, soap, etc...), the annoying geek is the first to die like the makers knew he'd be the one the audience wanted to see die first, the scheming selfish character who thinks of no-one but themselves is here & the hero feels like Ash from the Evil Dead films complete with chainsaw & the actor's physical appearance to Bruce Campbell who played Ash in the Evil Dead films. I also thought some of the dialogue was amusing, while drinking some alcohol Sean says 'I haven't tasted anything like that since I was in a Bangkok whorehouse' to which Chandra replies 'I take it you mean a beverage'! There were one or two surprises as well, there is a scene when Sean tries to call for help on a mobile & tells the police that giant creatures are attacking them at which point the entire audience is probably shouting out lie or something & then Chandra picks the phone up & does just that just to annoy anyone watching who has already made their minds up everyone in the film is stupid! Unfortunately it's not all good news, the film is a bit slow at times, some of it is rather stupid, there's a serious lack of gore & to many people survive, in fact the giant spider things only kill three people which just isn't enough I'm afraid.Director Piper does alright, he was obviously working on a low budget & he, or maybe someone else who knows, made the decision to use stop-motion animation rather than CGI computer effects. I see by the comments on the IMDb that a lot of viewers don't like stop-motion which is fine but I think it ties in with the 50's & 60's giant creature features very well & I'm one of those people who would rather see a bad stop-motion effect rather than a bad CGI one, it's take your pick really because I doubt Arachnia would have had the money to create good looking CGI effects anyway so either way the effects were always going to end up cheap looking. There's no gore here, someone is ripped in half seen from a distance & some baby spider things burst from someones chest which reminds me that it seems to pay homage to various other horror flicks like the chest-burster from Alien (1979) while people stranded in a farmhouse having to board it up reminded me of The Night of the Living Dead (1968). For some reason sometimes the point-of-view shots from the spider things is tinted red, other times it's tinted red but the picture is split up into several images while at other times the POV shots are simply normal film like the makers just randomly added the spider eye sight effects to some shots & not other's. I also have to mention the opening credit sequence, the credits are played over a never ending multi coloured tunnel effect that looks remarkably like the opening title sequence of Doctor Who from the Tom Baker era!Technically the film is OK, sure most will think the special effects are terrible but while I agree they generally are I always felt the makers at least tried. Apparently shot in Vermont. I actually quite liked the acting here, the two leads were pretty good actually.Arachnia is a fun little homage to the giant bug flicks from the 50's & 60's, unfortunately film-making has progressed a lot since that period & I suppose Arachnia is a good example as to why. I liked a lot of it but at the same time I disliked a lot of it if you know what I mean. Not to be confused with the similarly titled Arachnid (2001) or Spielberg's Arachnophobia (1990).","OK, I am a sucker. I loved it. I had no expectations and had them all fulfilled. It was a terrible movie. I loved it. I have managed to wear out a DVD from over use. No one can understand my obsession. I can't either, to tell the truth. For those who have seen the movie this will come as no surprise, but I asked the clerk at the video store if I could buy a copy and I could because there were two in stock and only one had been check out and over half of the time it had been to me.Now, the movie is terrible. The special effects are terrible. The acting is terrible, but I loved it. The actors are silly, the plot silly, the goofs numerous--like being able to see through the monsters, The \"arachnids\" looked like they were made out of plastic garbage bags (maybe they were), There was light underground, TNT wasn't deafening, etc...You must really love B-Movies to get any enjoyment out of this...alcohol helps enormously for others.","This is one of those movies that you watch because it's bad. Such a movie that you watch just to see it's shitty craftsmanship. Supposedly a horror, I cannot imagine how anyone can be afraid of a claymation bug, especially one that is translucent in nature where you can see the actor's legs behind it.Even with no budget, a little bit of attention to detail and even an attempt at making this movie believable would have sucked the fun right out of it, as they would have had to replace all of the actors and the entire story with it. If I had nothing to make fun of while it was playing, I would have stopped it after 10 minutes, and put on some quality show like Spunge Bob Square Pants (HAR HAR HAR).I Strongly recommend that Brett Piper get with Quintin Terrantino and Really pump out some feces.:)","In defense of this movie I must repeat what I had stated previously. The movie is called Arachina, it has a no name cast and I do not mean no name as in actors who play in little seen art house films. I mean no name as in your local high school decided to make a film no name and it might have a 2 dollar budget. So what does one expect? Hitchcock?I felt the movie never took itself seriously which automatically takes it out of the worst movie list. That list is only for big budget all star cast movies that takes itself way too seriously. THe movie The Oscar comes to mind, most of Sylvester Stallone's movies. THe two leads were not Hepburn and Tracy but they did their jobs well enough for this movie. The woman kicked butt and the guy was not a blithering idiot. The actor who played the old man was actually very good. The man who played anal retentive professor was no Clifton Webb but he did a god job. And the Bimbo's for lack of a better were played by two competent actors. I laughed at the 50 cent special effects. But that was part of the charm of the movie. It played like a hybrid Tremors meets Night of the Living Dead. The premise of the movie is just like all Giant Bug movies of the 50's. A Meteor or radiation stir up the ecosystem and before you know it we have Giant Ants, Lobsters, rocks or Lizards terrorizing the locals. A meteor was the cause of the problems this time. I was was very entertained. I didn't expect much and I go a lot more then I bargained for.","Overall, not a bad horror flick. The monster scenes were sketchy, choppy and unrealistic. There was Alexxus Young starring nude in it, which is nice to watch. I didn't find is as much horror as I did comedy but thats okay. I would give it a 5/10.","I usually love these movies. Give me a good old B movie any day but this one was simply awful. The acting(?) was terrible almost to the point of my turning the movie off completely. I thought I saw the all time worst but this one is right up there with Attack of the Killer Tomatoes! In all honesty - it was the acting that did this film in for me.I found the actor's to be clumsy and the lead male/female were extremely dull. This movie had absolutely nothing going for it. I may be asking a ridiculous question here but why the nudity and sex scene? Did the producers think nobody would watch if they left them out? I think they were probably right! Oh where is Price and The Tingler when you need them?","A meteor forces a small plane to make a crash landing. For the six passenger, their problems are just beginning. The survivors have landed in the middle of a giant spider invasion. Hold-up in an old, abandoned house, they'll have to use all their resources if they are to make it out alive.No beating around the bush here - Arachnia is bad. Everything about the movie scrapes the proverbial bottom of the barrel. The special effects are totally lame. The spider in Earth vs the Spider, made 45 years earlier, is more convincing. The acting is even worse. Most of these people have absolutely no business being in a film. Bevin McGraw as Trina is the worst. I'm not sure when I've seen a poorer performance. I've seen lines of dialogue in a 3rd grade play delivered more believably. Speaking of dialogue, these people say some of the most nonsensical things. They all sound like idiots. This is a complete mess of a movie.However, there are some things to enjoy. Granted, most of it is in that \"so bad it's good\" sort of way, but I found myself enjoying bits of the movie despite all the problems. The enjoyment was minimal, but I can see how a group of friends with enough alcohol might find some entertainment.","I like giant monster movies, hence I like giant spiders. So I guess I just had to see this one sooner or later. \"Arachnia\" is basically a total cheese-fest, bad to the bone. The nice touch was that it is sort of an homage to 50's & 60's giant monster/insect movies. So don't expect one original aspect here, story- or otherwise. The acting in general was, as to be expected, too bad for words. The effects aren't good either, actually, but they still are a lot of fun. Because the film-makers mostly used stop-motion (in the year 2003!, mind you) to bring the spiders to live. Needless to say, it's not on par with Ray Harryhausen's work. All-in-all: Kind of fun in a very bad way.","Brett Piper again makes a very good film that is trashed by the so called film \"experts.\" it is low budget, but fun, and the leading lady is very sexy. I wish i could see more of Irene Joseph. Good viewing fun. I bought the DVD and enjoyed it. The special effects are stop motion animation, and much better than the computer generated crap they call effects today. I always enjoy Brett Piper movies, and if you liked this I recommend Bite Me, Screaming Dead and anything else he has done. I look forward to seeing more of his work and well as more of Ms. Joseph. I simply cannot see why this woman hasn't been in more movies, as her acting is excellent.","I watched this movie based on the comments of a few that said that is was bad but funny. But you need to be warned that this movie has the worst special effects ever produced. They make 1950s science fiction movies look like works of art. This is funny at times, but annoying for the most part. And to compound the problem with the seriously pathetic special effects is the total lack of logic that characterized a majority of the events depicted. One of my favorites is where three of the characters drop hundreds of feet into a tunnel created by the arachnia and arrive to find it fully lit. Apparantely the arachnia have also managed to hook into the power grid. Very impressive. But this is just one example. And for what its worth, the music sucks, the acting sucks, the two cute girls are annoying, the obnoxious guy is annoying, the so-called handsome lead man is a geek, and the black girl who fall for him is a fool. Her father is the worst actor I have ever seen. I am not sure the brief moments of humor can possibly make up for the experience.","My wife and I watched this after DVR'ing it off of Encore action this past week. It has to be the worst horror flick either of us had ever seen. Predictable dialogue ( my wife and I were guessing the lines before they were spoken), hokey special effects, a screenplay that drifted all over the place. I think the part that was the most annoying was the stereotyping of the various characters in the plot, not to mention the gratuitous sex scene between two of the young heroines in the movie, neither of which had any real purpose other than to bare certain parts of their anatomy for the cameras. This movie should be categorized as comedy, not horror as the villains of the movie (spiders) were stop motion animated and not believable in the least. I can't say that I would have done a better job making a film myself, but it was very amateurish and wasn't even a \"B\" movie, somewhere closer to a \"d\" movie, or \"f\" if that is possible. I think even Science Fiction 3000 would have to pass on this one!","The title makes it sound like a cheesy B-movie and that's exactly what ARACHNIA is: a no-budget giant spider flick from the guy who brought us A NYMPHOID BARBARIAN IN DINOSAUR HELL. Thankfully this is a lot better film, better paced and more fun, although the budget is as equally low as in that film.The plot is predictable and routine from the outset: a bunch of B-movie types are in a plane crash (fun models) and then take refuge in a run-down farmhouse. The film manages to mix in various bits from lots of different genre movies and, admittedly, it is fun playing \"spot the rip-off\". We get the egg-hatching scene from ALIENS (complete with a queen spider – huh?), the chainsaw action from EVIL DEAD II and the besieged farmhouse scenario from NIGHT OF THE LIVING DEAD, plus lots of other bits and pieces along the way.The director goes all out for sleaze, with a one-dimensional female character that strips off for a gratuitous bath scene, and a ridiculous lesbian interlude that just serves to provide titillation for the male viewer. Acting is pretty bad, with the best role going to David Bunce as a despicable college professor; he's suitably slimy and weedy in the part. The female characters are bimbos, the actresses poor, but not as bad as Rob Monkiewicz, who thinks he's Bruce Campbell! Instead he looks like Richard Bacon, the former Blue Peter presenter, and he simply doesn't cut it as the heroic lead.The script acknowledges that the film is a cheesy B-movie through and through, so there's plenty of humour along the way. Some of it works, a lot of it falls flat, but for what it's worth I enjoyed the movie. The giant spiders are animated through stop-motion as opposed to CGI, and, while the animator is no Harryhausen, the special effects are surprisingly decent! The stand-out is when two spiders have a tug-of-war with a human corpse, tearing all the limbs off in the process. Lots of people are critical of the jerky fakeness of stop-motion but I know I'll always enjoy seeing it on screen; if I had to choose between the spiders here and the ones in EIGHT LEGGED FREAKS I'd pick this movie every single time. Sadly the bloodshed in the film is minimal, which is surprising considering the level of nudity on display.In the end, ARACHNIA succeeds because it offers up what B-movie fans are looking for. There's a guy battling a giant spider on a roof, wielding a chainsaw; there are Molotov cocktails galore, lots of exploding spiders, and an end-reel appearance by the air force, who kick ass. My favourite scene, though, is the kicker where a cocooned guy's chest explodes and mini-spiders dart-out, a virtual re-run of a similar moment in ALIENS. You've just gotta love the fact that the film-makers had the audacity to shoot this scene!","*SPOILER ALERT* *SPOILER ALERT*A bunch of people crash land in spider country. A meteor shower has awakened the beasts from the bowels of the Earth. They hook up with an old coot who tells them all about giant spiders. Soon claymation spiders attack as the heroes devise ways of killing the eight legged freaks.\"Arachnia\" did the best it could. It stretched its $200 budget as far as humanly possible. They could only afford one girl getting naked.  The brunette had to carry the workload for the other two women in the movie. She was a team player. That was nice. I give a lot of points for nudity and sleaze. It can save otherwise dismal movies for me.The spiders were as cheap and fake as you would expect. In fact, all of the effects were pretty bad. But this movie was fun. Sure, the acting wasn't stellar but everyone gave it their best shot. \"Arachnia\" was a B-movie and proud of it. The ending takes it over the top. I liked it.","This...... Movie.... Is..... Horrible!!!!!! You won't believe this hunk of junk is even a movie!!!! Critters4 was better then this!!! And Critters4 was pretty frigging bad too!!! A bunch of stupid teens crash in a desert, find an old run down bungalow, and end up fending off horrifically badly stop motion animated spiders. Pardon my french, but the acting was bad as hell!!! The person who wrote this probably didn't even know what a spider is, because he had the spiders living in a colony serving an alien-queen-ripoff queen spider! SPIDERS DO NOT LIVE IN COLONIES!!!!!!!!! THIS \"MOVIE\" IS A PIECE OF CRUD!!! At the end, the marines suddenly pop out of no where and kill all the spider without even being called!!!! If you see a copy of this movie at a video store, douse it in gasoline and throw a match at it!!!!","Wait no, we should call it an INSULT to the 50's monster movies!Atrocities like \"Monster of the Loch Ness\" are \"The Godfather\" compared to this utter piece of crap!I'm very angry. I can't believe I spent 80 mins. of my life watching it. It's not that I'm masoquist but I truly enjoy cheesy, low budget b-movies, but this THING went too far.The acting is sad! The F/X are horrible! laughable! The \"Evil Dead 2\" reference is atrocious! The lead male character dressing like Ash and sawing the \"creature\" made me wanna puke! Then there's a guy trying to act/look like Joe Pesci. That was the saddest thing. Horrible movie with horrible intentions.There's no fear to God and this movie proves it.PLEASE AVOID IT. PLEASE. 0/10!! Flush it! Probably the worst \"horror\" movie I've seen and that's a lot to say!","Well I just finished watching the movie and I regret wasting every second...There's 80 bad minutes of my life that I'm not getting back... The flick is unbelievably \"not good\". The actors suck, the not-so-special effects suck - at times they are worse than the movies shot at the 50s - the dialogue is tacky...The only scene that caught my attention was Alexxus' naked scene. I just CAN'T believe somebody actually WROTE a script and the whole movie was not improvised! I also can't believe that there is a director out there who was so happy with his work that he allowed this piece of...#### to be produced..DO NOT BY ANY MEANS RENT THIS MOVIE!! IT'S BOTH A WASTE OF TIME AND MONEY!","This is *not* \"Arachnophobia\". The monsters look like something out of a fifties drive-in movie flick, and tend to be more amusing than scary. Although the girls are pretty enough, this feature could give one-check \"B\" movies a bad name.","36/100. This is not to be confused with the decent Arachnophobia, this film is a very low budget and cheap rip-off of that movie. This one is so bad, it actually does have some entertainment value on that level. There are numerous unintended (I think) laugh out loud scenes. I wasn't expecting much from the film, and it was actually worse than I had imagined it would be.It's a cliché ridden and predictable direct to video mess. Fortunately, it doesn't take itself too seriously. The acting, as expected, is not quite Oscar caliber. The special effects are poor, worse than I would have thought they would be. Poorly edited and the score is intrusive."],"review-user":["duntrune","The_Void","slayrrr666","kenfreelance","poolandrews","tkucan","dj_oldfield-2","marbleann","jonpotzer","patty013","bensonmum2","Vomitron_G","coon12-1","rbirge-1","asticht-2","Leofwine_draca","Dr. Gore","hmckiel","insomniac_rod","pseira","gray1937-1","jazza923"],"review-date":["27 August 2003","13 December 2006","7 September 2006","17 February 2008","26 September 2007","11 March 2005","13 June 2006","2 September 2006","10 August 2003","18 June 2006","12 November 2017","15 August 2010","28 February 2007","5 October 2006","29 December 2006","8 July 2015","10 August 2003","10 July 2005","24 October 2004","5 June 2004","11 December 2003","19 March 2010"],"review-rating":["4","7","10","5","10","1","7","1","3","3","9","1","1","5","1","3"],"review-title":[" Just plain fun...\n"," Giant spiders!! In a boring film...\n"," Entertaining cheese fest\n"," Just what I expected it to be!\n"," You know, I actually though this had some nice moments & ideas.\n"," No real descriptions\n"," I took a crap and it looked like this movie\n"," Not Hitchcock, But Not Bad\n"," i watched the whole thing...\n"," Sorry, it did nothing for me\n"," Parts of it are minimally entertaining - not much of an endorsement\n"," As a homage thing, it barely passes the test. As a good movie, it severely flunks.\n"," A Good B Movie\n"," So bad its really bad\n"," Hokey, bad, awful, predictable\n"," Relatively decent B-movie fun\n"," Did the best it could\n"," Disgustingly bad!\n"," Let's think about \"Arachnia\" as a homage to 50's monster movies...\n"," The best movie $1000 can buy....\n"," It's amateurish\n"," Arachnia (2003)\n"]}