{"review-url":["http://www.imdb.com/title/tt0309059/reviews"],"review-text":["I'm a fan of independent film. Dialogue driven, character study pieces are where it's at for me. Some of the other posts are right: \"Wannabes\" isn't going to rival \"The Godfather\" for best mob film ever. On the other hand, \"Wannabes\" is a well-written and well-directed picture that has surprisingly good performances from every actor/actress. My problem with one of the other reviews:Conor Dubin stands out as the only Irishman in a cast of ItaliansDubin is a Jewish last name, and as such has a dark complexion, not a traditional ruddy one of an Irishman. He doesn't stand out at all, rather, delivers a great performance.This didn't win many awards, but it is deserving of a Saturday night with a bowl of popcorn. I found it for 7 bucks at Blockbuster and was pleasantly surprised to say the least! Highly recommended.","I like to watch these independent films that are produced and made out of New York City and it's boroughs. You get to see a lot of familiar faces (actors that have been in almost all NY \"mob\" movies and the ilk, as well as even family and friends who have bit parts) AND familiar places (streets and locations familiar to me.) Occasionally something will stand out, or have real potential but fall flat (probably more as a result of being so low budget). I've known who William DeMeo is/was since his bit part in 'A Bronx Tale'. He's from my neighborhood, as well, and I know people who know him personally. I saw his first film (directed by another neighbor, Frank Adonis- who's had bit parts in everything from 'GoodFellas' to 'The Sopranos') called 'One Deadly Road', which also starred a girl I went to junior high with. See?... small world. Anyway, that movie did NOT impress me.The story was run of the mill gangster fare, the characters and situations unbelievable, and the depiction of these kinds of people very unrealistic (to my experience anyway). Too over the top. The kind of movie that friends of mine started quoting more to make fun of it than to applaud it. Too bad.Well, awhile back, DeMeo's new low budget feature hit a local theater by us. We never got to see it, as it ran there very shortly, but I finally got it from Netflix this week. And I gotta say, I enjoyed it! There were certain moments where I thought I knew how the story would end up, and was pleasantly surprised that I was wrong! GOOD! Though DeMeo himself was a bit stiff, very one-dimensional in his starring portrayal of the protagonist Angelo, the rest of the cast were really good! Everyone seemed pretty natural, and some were straight-up funny, intentionally! Another plus. The people you may know in the film are Joe Viterelli (sp?) (\"Jelly\" from 'Analyze This!') and Joseph D'onoffrio (sp?)... who played the young Tommy (Pesci's character in 'Goodfellas').I thought this film did a better job of portraying this type of atmosphere and life than 'One Deadly Road' did. A lot better. More realistic for the most part. I really appreciated the \"fallen son\" aspect of the storyline as well (it rang true, though some of it was a bit out of line and kitschy... ***SPOLIER ALERT!!!!*** like Vinny killing his own father).Anyway, like I said, it wasn't groundbreaking... at this point what mob movie can be?... but it was thoroughly enjoyable and a real surprise. It's worth a view.DeMeo can be currently seen on 'The Sopranos', though I look forward to his next feature. Hopefully the guy'll just get better and better.","My wife rented it for me and I never heard of it, wasn't bad at all I recommend all new yorkers or mafia movie lovers to see. If you liked Bronx Tale you may enjoy this one. The characters played some good parts and it was worth buying for $6.99 for my collection","A nice little movie, that isn't as mobbed up as the sales pitch. Really a good story about a small family in a changing world, where clinging to the past isn't such a good idea no matter what side of the law you fall on. Strong performances by both Ray Serra and Joe Viterelli, and decent production values. 7/10","In my opinion, the movie was laughable--bad dialogue. Whoever wrote the script--please keep your day job. It's definitely NO Godfather or Goodfellas. It's good to be on the otherside of the table--poor choice of words. Some of the characters were clowns. But what do you expect from a low budget movie with no name actors.","This is a pretty decent movie about a young man, Angelo, and his friends who decide one day that they've had enough of being on the short end of things. They start out bookmaking and eventually work their way into the good graces of the local mob boss.  It's not a glorification of crime as a way of life, but rather a statement on what people do sometimes to get ahead in the city.I'd say the main weakness, what makes this come up short of being a really good movie, are the actors playing Angelo and his brother, Paulie.  William DeMeo just doesn't exude the leadership qualities you'd expect in the head of a crew.  He's isn't physically imposing enough and seems more like a follower not a leader.  And the actor playing his younger brother, Conor Dubin, seems out of place as the only Irishman in a cast of Italians. \nJoe Viterelli hands in a fine performance as Santo, the local mob boss. Viterelli was born to play the part - his face and voice are perfect.  Joe D'Onofrio plays Vinnie, his spoiled, ambitious son who clashes with Angelo throughout the film.This film wasn't shot on a big budget and there aren't any elaborate sets, but it has a nice feel to it.  The characters aren't overly violent or cartoonish like you'd see in a normal Hollywood treatment.  No one is screaming for attention.  Angelo and his friends act like regular neighborhood kids from Brooklyn wanting to move up in the world.A good story with a moral to the ending, and that's what it's all about."],"review-user":["SmoothGrooves","skellbag","ALopez3441","stavka","Zachery Speight","senortuffy"],"review-date":["24 March 2005","26 February 2007","13 November 2003","25 February 2003","27 February 2003","23 August 2003"],"review-rating":["8","6","6","6","1","6"],"review-title":[" Honest Review\n"," Not groundbreaking, but pretty decent!\n"," Not Bad\n"," They took a shot\n"," Movie is on the otherside of the table-poor!\n"," Kids from Bensonhurst try to make a name for themselves.\n"]}