{"review-url":["http://www.imdb.com/title/tt0380201/reviews"],"review-text":["\"Back in the Day\" is an interesting, but flawed effort. Ja Rule stars as Reggie Cooper, a honest but sad man trying to cope with the death of his father. He meets his old friend J-Bone (Ving Rhames) who tries to force Reggie into a life of crime. Reggie also falls in love with Alica (Tatyana Ali) who is the preacher's daughter. Now he has to choose: Love Or Crime.Ja Rule does a competent job as Reggie. At least he's trying to act. Ving Rhames is perfect as J-Bone. He brings a lot of energy and menace into the role. Joe Morton as the preacher is his usual excellent self, but he doesn't do much. The same problem for Giancarlo Esposito as Reggie's Dad. He needed more screen time. I don't want to say this, but Pam Grier is pretty awful as Mrs. Cooper. She overacts every scene and brings the movie down. Tia Carrere and Frank Langella are in it but don't do anything substantial for the plot.In the end: You should see it for the skilled performances of Ving Rhames and Joe Morton and the grittiness of the writing and directing.For more insanity, please visit: comeuppancereviews.com","Why did I buy this movie on DVD?, Well the short answer would be: I really don't know. As for the longer version, it pretty much comes down to the fact that I genuinely like Tatyana Ali and she plays Alicia in this.Now does Tatyana Ali give a genuinely good effort in this movie? I must say that it is one of the better, and she is shaping up to be a rather decent actress. I am very much looking forward to see her in action, when better material will be available.This being said, this movie was terrible - and my score is given based on this: 1 star for not being the worst movie I've seen, 1 star for the performance of Tatyana Ali, and 1 star for not thinking that it only deserves 2 stars, there are worse movies for that.Ja Rule should stick to rapping, not my favourite rapper to say the least, but some seem to like him - and if he is contained there, I would be delighted not to see him contaminate the acting scene.Ving Rhames: Ah man, Marcellus Wallace what are you doing here - you used to be cool man. Just because Michael Caine is a fiercely brilliant actor, who has been in so many terrible flicks as well as good, you don't have to copy him Ving.The rest of the semi big names in the cast: It's OK, there are bills to be paid, and we all have to do things we're not proud of time to time.The movie itself. It so massively flawed, it's pretty difficult to know where to start. It's more like a bunch of scenes thrown in together, as were the director to say \"we need to tell this, and we need to tell that\". There is a story, unfortunately there is nothing surprising about or within it. To say the least, the plot changes in the story were overly obvious and it was therefore predictable what was going to happen all the time.To sum up in one word: Reallynotgood","It was not as bad as SozeTheKeyser said it was. But then, I did not buy it. I saw it as a feature on one of the movie channels on the satellite service I use. I reserve purchasing for more family-oriented films. While this would not have met my criteria for purchasing, it was nonetheless an OK film.Ja Rule did a better-than-most-rappers-turned-actors job on what is apparently his first time out as an actor (in a leading role, no less!). There was another movie I saw on BET with another rapper in the starring role. It truly stunk, and even the merciful breaks from commercials did not save that one. In fact even when I was out of the room hearing the audio, it stunk even worse. \"Back In The Day\" was not such a stinker by far.Ja Rule did a decent job. Maybe even better than passable. He did not overplay the moments. He seemed to take directing well, which leads to the subject of directing. I think it was a very well directed film, and would like to see more from James Hunter. Even though he had some real power hitters to work with, there seemed to be a good gel among the actors that made the writing of Mr. Hunter and Michael Raffanello credible.It was a low budget film. There is no doubt about that. It was an indie. You put these two together and you get \"Back In The Day\". There were not the obligatory BOOM! SPLATTER! and ZOOM! that marks so many wannabe blockbusters, but instead the focus was on the story, which while common did bring some surprises that most may not anticipate. I did not, although usually I do. Sometimes it felt like a play without the music. This is not a bad thing, but a comment on the feel of the movie.I think Rhames (one of my top 5 favorite actors), Grier (who could not love this ageless beauty), Morton (my neighbor), Morgan (the dimples I wished I could have married) and Ali (ok, so Ms. Grier has competition) all did a wonderful job. This was far from a \"paying the bills\" project as I am sure that all of these in-demand actors can live very well off the residuals of their past work.That is all from me on \"Back in The Day\". It was not a film that I would purchase for my personal library, but if I see it in the TV listings again, I would watch it. I love morality plays that are honest yet sensitive. One thing I noticed in this film, which many lack, especially those surrounding Black characters,was the respect given to role of Christianity and its more conscientious leaders in the community. I appreciated the lack of hyperbolic and rhetorical dialog and character stereotypes. I would like to thank the writers, director and actors for a decent \"B\" movie.","I watched this movie out of a lack of anything else on at the time. Quickly the movie grabbed me with the depth of the characters and subtle plot. I was quite surprised to see that the rating given by my satellite provider did not show any stars.I will not give any spoilers to the plot-line or outcome but most of the characters had at least some redeeming value. Until the very last minute I did not know how it would turn out. Frequently, you can pick-up the formula and predict a story direction. I could not do that with this film.I would recommend this as one of the finer films of this genre.","It is difficult to rate a writer/director's first effort. After all, it is one more movie than I have written or directed. James Hunter wrote a story that was interesting, but suffered from an uneven flow.After all, the idea that a man (Ja Rule) has to choose between the thug life and going straight is common, and even falling in love with the daughter (Tatyana Ali) of the man you killed has been done. Doing it again demands something that is original, and originality is lacking in this film.I was drawn by the inclusion of so many favorites: Tia Carrere (Trues Lies, Wayne's World), Pam Grier (Jackie Brown), Frank Langella (Dracula, Good Night and Good Luck), and Ving Rhames (Rosewood, Dawn of the Dead). They did not disappoint in their performances, but they had little to work with.Direct to video is becoming more and more common, but that doesn't mean it has to be a waste of time. Maybe the sophomore effort of Hunter will be more enjoyable.","back in the day i watched this movie twice it wasn't very good the acting was pretty poor they just seem to grunt at each other there is no real communication between the characters although its not what i would call i low budget movie its i don't know just seems kinda i mean what I'm saying in comparison to other gangsta movies this is bottom of the pile check out eastsidaz or hustle and flow instead one thing positive i will say about this movie is the ending which kinda made me think about my own life and the difference between right and wrong this is my 1st review of a movie hope it has made sense to people i will try harder next time lol peace","The biggest problem with this movie is in real life, the niggard thugs have no conscience or regret. Whatever the film makers thought they were doing, whether they wanted to show a softer side or what, it was a farce. You know the old saying...\"art imitates life\"? Well if this movie were to imitate life, the bangers would shoot the brother, the sister and the mom. The good-hearted detective would never turn a banger loose for a second chance, never call and warn a banger that one of his own was out to get him and there would never be a SWAT team that saw 3 bangers with guns and only shoot one. And the salacious love scenes? I really don't know how Tia could sink this low. She is a quality actress.","A story of redemption that I found moving. Ving Rhames plays his usual gangster role well, as the evil influence. Ja Rule is Reggie - the young man torn between Godly influence and the lure of the streets. Tia Carrera plays a good supporting role, and is eye-candy besides! I didn't recognize Pam Grier, but good to see her outside the gangsta moll rut. Starting with a broken family, the youth goes through the stereotypical stages - 2 steps forward, 1 back. Joe Morton plays an honest and good preacher - itself a rarity on-screen nowadays. When a seminal and sad event occurs you can see the internal struggle going on within Reggie. The conclusion is somewhat predictable, but I like a positive movie anymore.","o dear god i suffered having to watch this film FOUR times in my sisters house and was it dreadful a story of sex and guns and very cheap unexplained acting unless you are at gunpoint being told to watch this avoid it Ja Rule just proved he cannot act Ving Rhames also gave the most dreadful acting ever in any of his films there was not one part of this film made me laugh or make me jump or feel any emotion i would be surprised people actually enjoyed this i have seem some dreadful films in my life but this would be in my five worst films ever the music in it wasn't good and the storyline i think was made up by a couple of guys who ordered a pizza and just sat down wrote ten bullet points and then made it into a film absolutely dreadful","by TyNesha Mells. In this drama, Ja Rule, who stars as Reggie, struggles with the loss of his father. His old friend J-Bone, who is a cold-blooded thug recently released from prison, helps Reggie find who murdered his father. A week after his dad died, a preacher, Reverend Packer, came up dead. Reggie was suppose to be the one to kill him, but did he? Did Reggie kill Reverend Packer or was it some type of a setup? Back in the Day also has a couple of romantic scenes. See, Reggie falls in love with the preacher's daughter and J-Bone doesn't approve of his love fiend. As J-Bone tries to destroy what they have, Reggie learns that love is about forgiveness. But what J-bone is doing, does it work? Do Reggie and his girlfriend break up, or does it bring them closer together? I like this movie because it leaves you wondering what's going to happen next and did this or that happen. I like movies with suspense! It kind of makes you want to be in the movie so that you could detect things. I also like this movie because everything falls in place, if you really pay attention to it!","Frank Langella steals my heart in everything he has ever been in! I love watching him!! i was 10 yrs old (1979) when i seen him for the first time.i eagerly await each and everything he'll be acting in. hopefully one day i can see him in person. he's very hypnotic and mysterious and that voice is commanding and strong! he is very attractive, even now at 65 he is absolutely stunning!!!! In my opinion he is the greatest actor iv'e ever seen! i adored him in \"Dracula\" ( along with a lot of other girls out there) and in \"god created woman\",\"house of D\",\"Jason and the argonauts\" and many more. i thought he was genius!!!!!! can't wait to see him in \"good night and good luck\""],"review-user":["tarbosh22000","SozeTheKeyser","LDeVose","Tisha-Hayes","lastliberal","johngamefreak","Sarge52411","billsoccer","rg_05_dhill","jpking-1","fallingrain034"],"review-date":["21 May 2005","25 July 2005","1 December 2005","15 November 2008","11 May 2008","30 January 2007","6 January 2015","25 December 2013","25 October 2005","15 October 2005","12 May 2005"],"review-rating":["7","3","6","7","4","5","1","6","1","10","10"],"review-title":[" Gritty And Well-Acted, but a little flawed.\n"," Not good - overrated - and that's just my vote\n"," Aww it wasn't THAT bad!\n"," Surprisingly Good\n"," I'd rather be feared than loved.\n"," okey dokey hokey pokey\n"," Not Real Life\n"," \"Message\" movie in style of TD Jakes\n"," hideous\n"," Back In the Day\n"," keep up the great work Frank!!!!\n"]}