{"review-url":["http://www.imdb.com/title/tt0365478/reviews"],"review-text":["I don't know what some people were thinking when they said this movie was bad. It Was Great. Classic Bruce Campbell, yes it was low budget and the special effect showed this but that is not what you see a Bruce movie for you watch it for Bruce. Also Ted Rami was excellent. I found this movie hilarious and entertaining I still crack up when I recall Bruce on that pink moped. Now I will admit this movie is not for everyone if you don't like B movies you probably won't like this one if you crave big budget effects and actors steer clear. But if you like slap stick and off the wall sci-fi plots this movie is for you.Hail The King Baby!","I was fortunate enough to catch a midnight screening of this movie tonight. I must say, I was expecting a horribly cheap movie with bad acting and a mediocre plot. I was completely mistaken. This movie was not only incredibly entertaining, but everything about it I simply loved. Bruce Campbell was as amazing as ever. The biggest surprise was none other than Ted Raimi, you know, Sam's little brother. He played the mad doctor's henchman to the greatest extent. Somewhere between physical comedy and clever dialogue, he did nothing but shine. But i really cannot ignore the magic that is Bruce Campbell. Though I did think that Ted Raimi stole the show, Bruce did what he does best on the big screen. Somewhere between the sketchy nasty American business man and the tragic victim, he displayed the same energy that he has always shown to be incredibly attractive to audiences. The movie itself was often interrupted by applause from the viewers. The crowd was definitely excited with each little turn that the movie took.This movie may not be Oscar material, but my goodness, it was amazing. I would highly recommend this to any Bruce Campbell fan. Also, anybody that likes campy sci-fi movies, do yourself a favor and watch this. Can't wait till this makes it out to DVD.Take it as you want to....the fed","I went to see this movie at a book signing in Lexington, Ky last night. After a wonderful night that consisted of a few brief words with Mr. Bruce Campbell (you have to say it all, not just Bruce or Mr. Campbell ;D), friends while the books were being signed, and a QnA session with our favorite deadite killer the lights dimmed.So as not to spoil anything, I wont go into detail...but I loved the movie! Mr. Bruce Campbell did a wonderful job keeping the classic b-movie feel. The characters were classic 'b' characters, the place was refreshing (what movies do *you* know of that are based in Bulgaria?) and the setting was both near-original and fun! On top of that the humor that is portioned throughout the movie that kept the audience laughing through much of the movie.While this movie dosen't have as great of a general appeal to people as some, it is a beacon of fun and laughter in a season of (as Mr. Bruce Campbell put it) 'b-movies' that are listed as 'a-movies' (Bewitched, Dukes of Hazard, Charlie and the Chocolate factory? Come on guys!).","These are the kinds of movies I loved, and still love growing up. Unlike big budget movies that crate huge plot holes and never acknowledge them. This movie takes in all in stride and just makes something you can sit back and enjoy.There was some film student earlier that complained it wasn't A list material. But that is not the point. The point of this movie is that no everyone likes huge CGI Cliché' filled movies. There are a lot of people who like movies that are meant to just entertain you, and not get as much money as they can.Besides, its also nice to know that good ol' Bruce isn't dead yet.","Ah, classic comedy. At the point in the movie where brains get messed together, a two minute scene with Bruce Campbell beating himself up partially, reminds me of how simplistic movies and ideas can grab you and wrap you into a whole movie.For years and years, Bruce Campbell knows what kind of movies we want out of him. We want to see weird movies like Bubba Ho Tep. We want to see cameo roles in Sam Raimi movies, and we want to see 'Man with the Screaming Brain'. With the title alone, one knows that it's going to border that completely silly type of movie, like Army of Darkness, only with more silly and less monsters.The idea of the movie is simple. Bruce sees doctor. Doctor has new idea. Bruce gets bad things happen to him on way to see doctor. Coincidentally, it's the thing the doctor wanted to show him that saves him. Hilarity ensues.With the addition of Ted Raimi as a weird Russian guy, and journeyman Stacy Keach as Dr. Ivan Ivanovich Ivanov, it's funny, that does this movie. Complete funny. Never a point of scary.If you like the silly Bruce Campbell, you'll like this. Then again, why would you be watching this if you didn't like Bruce Campbell?","Okay, so I love silly movies. If you enjoy silly sci-fi movies, over the top movies, or if you are a fan of Mr. Bruce Campbell, i would go see this movie. This movie is all that i wanted it to be. Being a fan of over the top movies, this fit the bill. Every time i thought to myself \"this movie would be the sillest, best movie ever if *blank* would happen....\" then just as i thought it, *blank* would happen. It's a wonderful silly 'b'-movie. If you are a fan of Campbell i'd say 'see it', bring your friends, laugh at it. It's fun. It's not classic, or anything, but if it's on TV some night, watch it. It has become, for me, a movie i would file under \"indulgent movies\". Movies that may not be good, but after a hard day of work, i could come home and watch, (this list also includes 'harold and kumar go to white castle', 'army of darkness', and ' Intolerable Cruelty' ) If you feel like a over the top, wonderfully slightly bad movie, watch this. if not, go rent \"Bubba Ho-tep\"","Shot entirely on location in Bulgaria, The Man With The Screaming Brain is a hilarious love story between two rich ugly-American types and a murderous hotel maid gypsy. William Cole and his wife Jackie arrive in Bulgaria on a business trip and catch a cab driven by hustler Yegor. Things start to go awry when Tatoya, the maid, murders Yegor and William and a mad scientist implants a piece of Yegor's brain in William's head. Robots eventually become involved, as do gypsies with broken fingers, head injuries, Bruce Campbell riding a pink Vespa with prissy little streamers, and All-Of-Me-style physical comedy by a character at war with a voice in his brain who controls half of his body.The Man With The Screaming Brain is an incredibly funny film. It has the most hilarious tracking shot I have ever seen (when Bruce Campbell's character, fresh from the lab and complete with giant forehead scar and blue hospital pajamas, runs into a square and scares a crowd of people) and a falling-down-the-steps murder scene that had the entire test screening audience screaming laughing. The whole thing is a damn riot from beginning to end and I would recommend it to any fan of physical comedy, Bruce Campbell, or B-movies in general.","Disappointing. That would be one way to put this film. Not that it's terrible or anything, but well, ahhh hell. Just read onThis film stars the legendary Bruce Campbelllegendary for his classic underground, cult, and, *ahem* \"B-movies.\" Well, hell, I love the guy. A lot of people do. His films are entertaining, he's entertaining. So why wouldn't a film starring the guy, written by him, and directed by him be good? It turns out there's a lot of reasons, but here's the quickie story:Capitalist American businessman (Bruce Campbell, of course) travels to former \"Red\" Socialist Bulgaria on business. Well, crap happens and suddenly he's dead. When next he's alive, well holy hell, he has half another man's brain in his cranium. A communist man's brain! Well, following this, some craziness ensues and Bruce and his \"dead\" wife, and his half-Commie brain hunt for the gypsy woman that done killed 'em all. Sounds pretty good so farHere's the breakdown:The Good:--The acting, for the most part, is much better than I would have expectedespecially from Stacy Keach and Ted Raimi.--Bruce Campbell beating himself upalways entertaining.--Bizarre storyalways good.--Some really good humor.--Wacky throw-back to bad 50's Science Fiction films with adequate cheesiness.Didn't Hurt It, Didn't Help:--The special effects are kind of poor, but entertaining nonetheless.--Over-all somewhat lackluster writing.--Decent action.The Bad:--Some pretty tedious parts, unfortunately.--Poor atmosphere. I personally wish Bruce had enlisted Don Coscarelli to Direct.--Capitalist brain melded with a Socialist brain? Seems like there should've been some more depth in those two extremes fighting each other. Pity.The Ugly:--Bruce is a great actor, and a funny and entertaining guyand really cool. Know what he really isn't? A director.--Again, for those like meBruce Campbell fansthis film is kind of a disappointment. Here's why: It was a long time coming, it was written, directed, and starring Bruce Campbell. And after the brilliant Bubba Ho-Tep (helmed by Phantasm's Don Coscarelli), the Evil Dead Trilogy, and many of Bruce's other successeswell, for fans, there's a lot of hype in preparing for this one. Also, the idea that it was kind of Bruce's \"pet-project\" and one he'd been planning and working on for years gave this film some added heft when it comes to \"getting one's hopes up.\" Memorable Scene:--When Bruce is first running around and battling the idea of having two brains.This is not a bad film, but it's not exactly great. And after the hype going into it, and after seeing how talented Bruce Campbell really is (Bubba Ho-Tep), this film just feels rather weak.Acting: 8/10 Story: 8/10 Atmosphere: 4/10 Cinematography: 6/10 Character Development: 6/10 Special Effects/Make-up: 5/10 Nudity/Sexuality: 0/10 Violence/Gore: 7/10 (not much of either, but decent quality for it) Dialogue: 7/10 Music: 6/10 Direction: 6/10Cheesiness: 5/10 Crappiness: 1/10Overall: 6/10This one is for general Science Fiction fans and Bruce Campbell fans. But don't get your hopes up too high. Like, watch it if you forgot a lot of his previous work, or haven't seen it at all. Not bad, not great, and don't get your hopes too high. (Also, it should be noted that I'm being awfully generous in this review...)www.ResidentHazard.com","This is screamingly funny (well, except when Bruce is in the hospital scene, which is a little sad). Ted Raimi and Stacy Keach are both excellent and worth watching.Sure, it's not a big budget-suit controlled blockbuster, but it's everything it promises to be and more- and BTW- the women are wonderful in their parts, though I don't know them from other movies, I'd welcome seeing them again.The two-brain walking scene is inspired and certainly a showcase for Bruce's outstanding physical comedy- he is one yummy guy!Thanks Bruce, for your brain, this is your baby!","I saw it last night and I was laughing out loud for the whole second half of the movie. The whole audience was. Bruce Campbell has made a damn funny movie! I don't want to give anything away, but when the film turns and gets wacky, it gets really wacky. Just one funny scene after another. My hats of to Mr. Campbell and crew for pulling this off on such a tiny budget. Bruce was there to introduce the film and do a Q and A, which was a treat. A lot of the questions people were asking were pretty lame, but Bruce would turn it around on them and be all sarcastic. He was great! Anyway, loved the film. I'll be looking forward to seeing this on DVD later this year. B sure to check it out on the Sci-Fi channel this fall. I highly recommend this one.","Granted, there wasn't actually a screaming brain.We (myself, the wife, a good friend, and my sister in law) just saw this in a local showing in conjunction with a book signing of his new book, \"Make Love The Bruce Campbell Way.\" And, keeping in mind I'm rather a big fan of the esteemed Mr. Campbell, and have been for years, I must, unfortunately, only give it a 6 of 10 score. And that partially due to Mr. Campbell's apologies in advance.The movie was a happy melange of slapstick and ideas happily lifted from a variety of other old horror films. Given that I was tipped by the title that this wouldn't probably be on this year's Oscar list, I didn't go in expecting too much.I was right. What I saw was an amusing little film (and I did find many of the jokes funny, by the way) which was a pleasant way to waste a couple of hours, along with a confirmation of long held ideas about Bulgarian motor sports which have plagued me for years. In addition, it does give an interesting view of Mr. Campbell's own world view.Don't walk into the movie expecting much and you won't be disappointed. Expect a masterpiece and you will be.(Now to avenge myself on Mr. Campbell for introducing my wife to an excitingly ethnic and film geek approved way to criticize my driving.)","As a Bruce Campbell fan for nearly two decades, I was thrilled to have an opportunity to see his latest film on the big screen with the man himself in attendance. Unfortunately, \"Man with the Screaming Brain\" was itself a disappointment.Set in Bulgaria--where the Sci-Fi Channel makes its Saturday night original films--\"Man with the Screaming Brain\" is a curious mix of '50s B-movie horror, body-switching comedy, violent revenge flick, and overdone slapstick with a touch of romantic reconciliation. If that doesn't make sense, well, neither does \"Man with the Screaming Brain.\" Campbell plays a pharmaceutical company CEO who visits Bulgaria with his estranged wife in an inexplicable attempt to invest in the former Communist country's half-finished subway system. The two fall in with a former KGB agent turned cab driver, and all three ultimately meet their demise at the hands of a vengeful gypsy woman.A local scientist (Stacy Keach) and his goofy assistant (Ted Raimi), who have developed a technique to allow tissue transplants without the possibility of rejection, steal the bodies and place a portion of the cab driver's brain into Campbell's damaged skull. Also, they put his wife's brain into a robotic body they just happen to have at hand.Campbell escapes, and with a hastily-restitched skull and the voice of the cab driver--whose transplanted brain tissue controls the left side of his body--echoing in his head, sets off to find and kill the gypsy. (His robot wife does the same.) But first, there's an attempt to emulate Steve Martin/Lily Tomlin's \"All of Me\" when Campbell's two personalities battle for dominance over a restaurant dinner. Just as he was playing his own evil hand in \"Evil Dead II,\" Campbell is adept at making his body appear to be inhabited by more than one mind.At times, \"Screaming\" comes closest to another Steve Martin film, \"The Man with Two Brains,\" as it also takes a silly approach to '50s sci-fi clichés. However, it tries too hard for too little result, and that goes double for Ted Raimi's semi-comprehensible Bulgarian oaf, who gets entirely too much screen time. (Nothing against Raimi, it's just that he's better in smaller doses.) In the end, it's neither outrageous (or funny) enough to satisfy as a spoof, nor is it serious enough to enjoy as a B-movie pastiche. I was glad that Campbell had already left the screening by the time it ground to a halt, as I feared having to say, \"Gee, Bruce, that was really...something.\"Perhaps the best praise I can give it as a film is that at least the images stuck to the emulsion. And it was twice as good as \"Alien Apocalypse.\"","I saw this film at a screening last night in Portland.In general, I would only recommend this film to people who are hardcore Bruce fans. It contains some humorous moments, and the final scene in which Bruce is cradling his dying robot wife almost makes up for the more boring stretches in the film.Considering that the film was made on such a low budget, I think that they did a relatively good job, but it just isn't a very proficient film in terms of the craft that went into it - but again, this is basically a consequence of working off an extremely small budget.The most interesting part of the screening was Bruce's opening Q&A with the audience, in which he revealed a future project of his. Apparently, he will be making a film in conjunction with Dark Horse comics in which he plays himself. The premise is that there is a town that is being terrorized by some monster and somebody suggests that they bring in \"the Evil Dead guy\" to help out. But since Bruce Campbell the actor doesn't really have any monster fighting abilities, his arrival only results in more people dying as a result, and things just end up getting much, much worse. I think the idea is brilliant and it will be interesting to see how it is executed.But getting back to The Man With The Screaming Brain, my suggestion is to not go in with your expectations too high. It's a disposable made-for-TV movie that has a few good Bruce Campbell moments. It isn't going to convert anybody over to Bruce, but if you're already converted, then it's worth a watch.","I saw this last week during Bruce Campbell's book tour. I thought it was amazing. Almost everything I would expect from a Bruce Campbell sci-fi movie. Its campy and very funny. Ted Raimi was also hilarious and extremely goofy. The plot is wacky, an American business man goes to Bulgaria and is killed. Stacy Keach plays a mad scientist who saves/brings Bruce Campbell back to life by implanting half of the brain of an ex-KGB turned cabbie. Bruce Campbell spends the rest of the film trying to avenge his death and has many internal arguments between himself and the KGB agent. The movie has all the great Bruce Campbell slap stick and humor. The movie is somewhat predictable, I knew once the wife was killed that she would be sharing a brain with her killer. However I didn't go to see this movie because I thought it would have an Oscar winning script, I went to see it because it was a Bruce Campbell sci-fi movie and I was not disappointed in the least. I highly recommend that you go see him on his book tour or wait and watch it on the sci-fi channel next month. Although before the movie he said the Sci-Fi channel did cut some of the movie out to make it TV friendly. If you are a fan of Bruce, I highly recommend it.","I haven't seen so many people packed outside a theater since Star Wars Episode III. Both shows sold out, and for good reason. The Man With the Screaming Brain was the best movie to see with a crowd full of geeks. (Hey, I'm a dork too.) Bruce Campbell was present and had the whole crowd in stitches! The movie was cheesy in the best possible way. It may be the funniest movie that Bruce has done. Ted Raimi steals the show with his Bulgarian hip hop-itude and zany facial expressions, he is a laugh riot! Who knew that Ted could rap? I changed my mind, the person who stole the show was actually a robot. There is nothing funnier than a robot...doing the robot.As for Bruce's performance: \"I take the 5th.\" Thanks Bruce. Thanks for being cool, thanks for taking the time, thanks for all of the fun.","Written by, directed by and starring the champ of camp Bruce Campbell. Easy on its easy to tell this is a budget on a shoestring affair; filmed independently in Bulgaria. All I can really say for sure is that silly is not always funny. Campbell plays an affluent American business man with a cheating wife(Antoinette Byron)and trying to close a business transaction before he is murdered. He hires a cabbie to drive him around a strange little town; not knowing that his wife is 'carrying on' with the taxi driver. Within moments of Campbell being bludgeoned; the cabbie is killed in the same location. A mad scientist(Stacy Keach)proceeds with an experiment putting the cabbie's brain inside the American's head. With massive stitches on his forehead, Campbell breaks free and roams the streets looking for his wife; all the while he is arguing with a strange voice inside his over-sized head. Campbell contorts his rubbery face making silly expressions as he argues with himself. Thus, Bruce is doing what he does best and no doubt his many fans will be pleased. I get the impression this must have been written as a straight comedy. Rounding out the cast are Ted Raimi, Tamara Gorski, and Vladmir Kolev. Watch for this on the Sci-Fi Channel.","I just saw this movie last night at a midnight sneak preview screening (I work for an independent theatre chain in Colorado - it's one of the perks)...I'm sorry, but this is one of THE WORST movies I've ever seen! I know that there are some Bruce Campbell fanatics out there who (like Star Wars die-hards) will string you up from the nearest tree if you DARE speak any ill of their beloved cinematic icon...nevertheless, Campbell-teers, this particular work from The Chin is a celluloid black hole.Before you make any assumptions that I'm some hoity-toity film buff who only watches \"real\" movies like \"Ladies in Lavender\" and \"Sideways\", think again - I'm a huge fan of B-movies, and Bruce Campbell in particular. His trademark character Ash is one of my favorites, and his portrayal of the aging Elvis in Bubba Ho-Tep was phenomenal.But hey, B-movies still have the potential to be reeeeally, reeeeally bad (and not in that \"good\" campy way we all love)...and that's what watching this particular one was like for me and my fellow co-workers. With the exception of that one tracking shot where Bruce runs through the square and scares the kids, there were no laughs to be had. Overall, we found the story to be mind-numbingly stoopid, the pacing mollasses-like, and the so-called humor dumber than a bag of hammers. (I'm sorry, but Ted Raimi's \"Pavel\" character was not comic relief...he was just plain retarded!) Believe me, we all went into this really wanting to like it, but left feeling incredibly disappointed and robbed of two hours.If you absolutely loved this movie, plan to see it multiple times, want to marry and have kids with it, etc., that's fantastic - we all like what we like, so you get no judgement from me. But don't go questioning the sense of humor or fan loyalty of those who aren't having multiple orgasms over Campbell's latest cinematic coupe. This flick was a steaming turd sandwich in my humble opinion...and as a true Campbell fan, I'm allowed to say that!","this was hands down the worst movie i've seen all year. i completely understand why it isn't in wide theatrical release and going to the sci-fi channel. it really felt like i was watching a piece of crap sci-fi channel movie. i guess that's because i was.i like bruce campbell from what i've previously seen. bubba ho-tep, jack of all trades, brisco county, and of course the evil dead movies. i've seen him at a book reading before and found he's pretty funny. none of this showed at all in this movie.i thought that since he was writing, directing, and starring, it had a chance of being alright. i cannot remember a time that i was this wrong.i wouldn't recommend wasting your time even if you get to see this for free. definitely not worth paying to see, unless bruce is there himself on a promotional tour (as he was when i saw it, he was funny, the movie still was not). in which case, pay to listen to him, ask him a question or something, then leave when the film is about to start. it may sound dumb, but trust me. you'd make better use of your time if you were doing anything else.i reiterate: awful, awful, awful, awful, awful, awful, awful, awful, awful, awful, awful, awful piece of cinema.","I saw this movie at a special screening in Dallas with Bruce himself doing a Q&A. I was so excited to see this movie and even more excited due to the fact that Bruce would be there. All he did was bash Hollywood and how the movies suck, I do agree him for the most part. But this movie was supposed to be his rebellion against Hollywood. Let me tell you, he needs to go back to acting and quit making movies. This movie was awful, its no surprise he tried to pitch this idea for the last 20 years. This movie was poorly acted, shot and written. The only thing I remember is wanting this movie to end and I finally realized why he did the Q&A before the movie instead of after due to the fact that a lot of people would want their $14 back we paid to see this thing.","I went to a screening of this movie where Bruce Campbell did a Q&A before revealing this film. After trashing A-List movies such as Batman Begins and War of the Worlds...Bruce exclaimed that there is no creativity in the realm of Hollywood Budget films. With that said, I expected an extremely well made and plotted out film. Boy, was I disappointed. I am a film student and I'm open to any kind of movie as I love them all...but watching The Man With A Screaming Brain left me in shock. I have no other way to describe it other than F-ing terrible. The events the title leads you to believe to take place don't happen until an hour into the film! The lack of exposition and a hook was staggering! I only wish Bruce had come back for some Q&A after the movie was over. Perhaps he didn't because he knew and couldn't face the audience.....","Or if you've seen the \"Evil Dead\" trilogy and/or \"Bubba Ho-Tep\", then you should know that his movies are total farces. With \"Man with the Screaming Brain\", he goes all out again. In this case, he plays smarmy American businessman William Cole visiting Bulgaria - when do we ever get to see that country? - when a woman kills him. So, strange scientist Ivan Ivanov (Stacy Keach) replaces half of Cole's brain with the brain of a former KGB agent, leaving him acting sort of like Steve Martin in \"All of Me\".Yes, the whole movie is pretty much an excuse for pure nonsense. Much of the real humor comes from \"Evil Dead\" director Sam Raimi's brother Ted as Ivanov's nearly brain-dead assistant Pavel. The two men have a relationship more like Laurel and Hardy or Gilligan and the Skipper.So just understand that this is a totally silly movie, and you won't be a bit disappointed. I liked it, anyway.","This was a funny movie. Just having seeing the Evil Dead trilogy not a week ago (and left wanting for more), I got as many Bruce Campbell movies as I could, including really bad ones. This one is funny, without being exceptional, but as sure as hell original.I mean you've got mad scientists, superhuman cyborgs, half brain freaks, gypsies, ex KGB cab drivers, jealousy, murders of passion, love, romance, sex, action and what more, all with the same 6 actors :)You really have to see it and enjoy it, I can't explain it in a text box. I guess it is not so much a cult movie as Evil Dead was, but it certainly has that Bruce Campbell touch I love. Ted Raimi lends a hand, Tamara Gorski looks both beautiful and interesting (she has gone a long way from the hooker in Friday the 13th) and Vladimir Kolev also shows a lot of promise as an actor, although he will probably be cast as secondary character in Hollywood movies his entire career.Bottom line: funny movie. If you liked Evil Dead you'll like this, too.","I'm 35. Bruce was THE man in Evil Dead, and I still love to watch ED1 and ED2. It was cool also to see him as The King two or three years ago in Bubba Ho Tep in which he showed versatility and great acting talent. But this Screaming Brain adventure is certainly not for Bruce's early fans. Either I'm getting too old for this sh17, or I'm just not part of Bruce's target audience anymore. I'm positive kids age 9 to 13 will love this film. But this over extended matinée sci-fi comedy contains about 5 minutes total of interesting moments, and the rest is cheap kids slapstick humor. Campbell better talk seriously with Sam Raimi and get their brains screaming together for a last Evil Dead reunion picture to get back my interest. At least there would be a good director behind the camera... Sorry Bruce, this just doesn't cut it for me. Take care.","My brain was screaming \"why do you keep watching! Turn it off and go to bed!\" But couch potatoness won out, and I watched until the predictable ending. I guess when it's Bruce Campbell I need to give it a chance.I find it hard to complain about a low budget movie purely because of the low budget... time and time again we see low budget movies proving that a good story, good writing and good acting are enough to make a good movie. Ted and Bruce got their start on just such a movie, but they didn't seem to learn from Sam that it takes a bit more than slapping it on film to make a movie.It's sad, too, because Bruce has always been a favorite. After the 70's and 80's, I just can't believe movies this bad are still being made. Bruce, I'm really disappointed.","This movie challenges the viewer to step out of their comfort zone and look into the deep and complex world of consumerism. It's a constant battle of consumerism and communism coming together to fight the common enemy of the gypsies. If you don't like this movie you also probably don't like puppies, vodka and the American dream. 10/10 any day , everyday."],"review-user":["jhegar","FedMex","bahamut810","Forlornxdrifter","aqua_swing","triggerthumbs","fraptacular","unakaczynski","shannpalmer","steve-449","Samizdata","Dodonna","brandonrerickson","party pat","frag-5","michaelRokeefe","kenstru","skammeraasen","mrph0enix","talktomccann","lee_eisenberg","siderite","DrJOnes666","NoHeadedHershel","zachdonaldson"],"review-date":["31 August 2005","7 August 2005","5 August 2005","4 September 2005","13 May 2006","9 August 2005","4 April 2005","27 September 2005","10 September 2005","10 July 2005","1 August 2005","2 August 2005","30 June 2005","21 August 2005","28 July 2005","11 September 2005","11 July 2005","6 August 2005","27 September 2005","21 August 2005","16 June 2007","25 April 2006","8 December 2005","3 October 2005","19 January 2018"],"review-rating":["10","8","10","8","8","7","10","6","10","9","6","3","6","9","7","3","1","1","1","2","7","7","3","2","10"],"review-title":[" It Was Great\n"," Thank god for Bruce Campbell\n"," A Grade 'A' B-movie\n"," A good fun movie.\n"," Bruce knows why we like him.\n"," Robots.\n"," Funnier than Bubba Ho-Tep\n"," *huge sigh*\n"," Wonderful, charming, Bruce in full !\n"," It's a laugh riot!\n"," Schlockorama\n"," A Disappointment For This Campbell Fan\n"," Only for Die-hard Bruce Fans\n"," From the wacky mind of Bruce Campbell\n"," A real treat! The best time I had at the movies! (mild spoilers)\n"," If he only had a brain.\n"," Wow...this movie is REALLY awful\n"," Damn this sucked.\n"," Stick with acting Bruce.\n"," I Hated this Movie...\n"," Well, you know Bruce Campbell...\n"," Evil Dead meets Eternal Shining of the Spotless Mind\n"," From one Bruce fan to another: AVOID like the pest\n"," My brain was screaming...\n"," If you don't like this you're a communist\n"]}