{"review-url":["http://www.imdb.com/title/tt0379489/reviews"],"review-text":["------ Spoilers----- Spoilers----- Spoilers--------just a few small ones Saw this on Satilite channel, missed the first 30 min of movie, will keep this comment short and informative.The movie is basically about 5 characters,The acting is very bad for afew characters. 1 girl with the help of another girl kidnaps 3 different people but it backfires and the 3 kidnap the 2. This is one of those types of movies where the script writers try to be thought provoking or philosophical, mysterious and ... you get the point; but do to their own, personal, lack in thinking they fall terribly short. Like one of the captives who is supposed to be some type of psychology nerd - looks the part but his tongue can't speak it. THe writers think that if the nerd uses a lot of 8 letter words amateurishly - unknowingly i believe - that the viewers will be ignorant enough to believe it. I wish i could give an example but i cant recall any - exactly as it was said. The ending was bad as well. But the one female captive acted her role as an old and relatively wise lady, although she, as well as the rest, had a lot of cliché s.So Why would i give this movie a 7 stars if I thought all the above? Simple, I give the entire seven stars to LISA KELLER - one sexy a$$ momma. SHE is FINE lol. I am an appreciator of beauty, and she is exactly that. But don't get me confused because I'm not a pervert and this movie is NOT a porno in any way. their is somethin about her I cant explain, but i like it. I remember the scene where a captive has broke free and as he looks for a way out, bumps into Keller. She tries to get way but she doesn't have a chance. He throws her down, kneeling on the stairs and he pulls her pants down, no panties ;). Now, although she has an AMAZING ass - and the this shot leaves little to the imagination for a long 30 seconds i think - it was her facial expression that got me. she wanted it, and that look had me thinking i was behind that. I would have torn that booty up! After that expression, i jus couldn't look at her objectively anymore, I WAS IN LOVE. lol. I am glad to have seen this movie but if Lisa Keller wasn't playing the lead role, I would have changed the channel.. well... after i had seen the scene i mentioned above. I am a LISA KELLER fan know, but is seems that she isn't a consistent actor, seeing this 2003 movie is her latest. But i am lookin forward to another movie with her in it.","The first thing that struck me about this movie was the terrible acting. The whole cast was so uniformly inept at delivering their lines that I started laughing at the awful dialog midway through the film. An even bigger issue with this movie is that at no point do we ever find out what motivates the actions of each character. The one somewhat redeeming aspect of the movie is Halfdan Hussey's innovative visual effects. However, as eye-catching as they may be, they do little to make up for the gaping flaws mentioned above. A dreadful script mixed with community theater level acting does not make for a pleasant viewing. I was honestly shocked at how bad this movie was.","This movie makes you think. It shows how a woman's weaknesses can result in nightmares for others. Her physically aggressive behavior is more often seen in men than women, so it made me feel even more uncomfortable to see the way the lead actress behaved. I think that women might think about this behavior, but I don't think they act on it. The dark scenes added to the sense of evil that needed to be hidden. I was relieved when the prisoners escaped. I was hopeful that the end would bring a satisfying solution, but it did not. Maybe that is more realistic. Life seems to run in the same direction instead of creating a new river bed running up hill.","I love to see a female protagonist, in this movie her name was Rose. Rose brought out a lot of interesting questions in her journey of fulfillment.Is is possible to attain peace and internal fulfillment through external means? Does our society teach this? Can one be a victim of memory which may lead to victimizing others? Is one responsible for being a product of one's environment? To what extent can one control or take control of one's environment? How is a \"typical\" human alike or different than Rose? Lastly, would the outcome or story change if it were from another country like France or Italy? I loved that this movie provoked all of these questions in me, while it entertained, stimulated, and kept me guessing to the end! Every time I've watched it, I have learned more about the film and myself.","I'm surprised by some of the comments on this site because I really liked this film. If you're looking for something different then this movie is a good choice. Definitely not your typical mindless story that seems to be everywhere starring Ben Idiot Affleck or some other Hollywood loser. It's an intellectual film, you actually need to pay attention so some people might be turned off by that. However, if you are looking for something that keeps you on your toes then this is a good choice. Warning to parents - it has some fairly graphic sex scenes so watch it once the kiddies are in bed. People who like Euro flicks will like this one. Adam Sandler fans should skip it because it will be over their heads and definitely NOT their style.","I'm not usually into dark/psychological thriller type things. However, SEIZING ME is really an amazing piece of work. The story, acting, filming, psychological themes, erotic quality and spiritual understanding are all really quite complex and compelling. Rose plays the complexities and shifts of a psychologically disturbed woman really quite accurately. My partner was particularly impressed with the sophisticated way the power exchange issues were handled. It was so intense for us to watch that we found ourselves leaving it three quarters through to \"get tea\" and I felt compelled to have a shower. The story was gripping but we were clearly unable to handle all the energy in one straight shot. (It delves into the gritty and grimy side of people, but doesn't leave you there). I thought about the characters and deeper meanings for a long time. I would highly recommend this one. Still be prepared for an experience you might not be expecting.","I shot this movie. I am very proud of the film. It was a great experience which shows up on the screen. Halfdan Hussey is an excellent collaborator who had a vision and was able to capture the movie in the exact way we envisioned while prepping the film. The sets are amazing and well crafted for each character. John York and his team built sets that not only fit the characters, they worked well in shooting the film, allowing us to move seamlessly through walls and from one set to another. Each character has an amazing arc, which makes for a great story. I feel like all of the actors gave excellent performances. I disagree with some of the other comments that say the acting was not good. Watch it and decide for yourself.","The best bit in the film was when Alan pulled down her knickers and ran the cut throat razor over her bum cheeks and around her bum hole. It was also brilliant to see Alan's bum going up and down like a fiddler's elbow later on in the film.Alan was tough as hell in it like when he got annoyed and pushed the four eyed wimp onto the sofa.I've been laughing for days about the cut throat razor bit. A brilliant idea by the script writers. Alan must be brought back into Eastenders so he can do the same to Peggy.Alan is back, and this time he's armed with a razor. Watch out if you're a girl and he finds you and pulls your knickers down."],"review-user":["masterhymes","uspirals","terrievans-1","darlingnickiez","dudeinlosgatos","maverick-153","byronwerner","mrroper68"],"review-date":["16 April 2006","16 December 2006","6 July 2007","16 November 2005","6 July 2007","5 July 2006","7 July 2007","27 March 2006"],"review-rating":["7","1","10","10","9","10","10","10"],"review-title":[" The one, GREAT, reason why u should watch this movie! SPOILERS\n"," The Worst I've Seen in a While\n"," Psychological thriller\n"," A female protagonist searching for internal fulfillment through external means.\n"," I liked this film - something different\n"," Strong psychological movie gets the power plays right\n"," A Film Worth Watching\n"," Cut throat razor\n"]}