{"review-url":["http://www.imdb.com/title/tt0409409/reviews"],"review-text":["Almost four years after the Iraq war started and we're in a bigger hole than ever. That's right, so all those flag wavers who were so sure of the right and might of the American way are now chasing their tails, isn't that true? You bet it is. This movie said so from the beginning. It is kind of freaky how much the film,or should I say, filmmaker, knew what was coming. It is almost like going to a fortune teller and hearing what was going to happen in the future. There was a point when I felt the hairs standing up on the back of my neck as GW announced that 'major combat operations are over\" on top of a visual of a broken down RV being towed away with the American flag waving in the rear-view mirror. You have to see it to understand what I mean. But even if you are apolitical or even if you are pro-war, this movie will have some kind of impact on you because it is so embedded in history.","At first I couldn't tell if it was an art film or a documentary. The day after I had a unique movie after taste experience or perhaps a revelation. The film is a human quest to destroy everything that exists, including life on earth. The lead is clueless and cold. He is like all of us he wants to get rich, to laugh, to travel, to eat and be entertained. He moves from one place to another in a giant RV without direction or motive only to pass time and entertain himself. By the end it's too late. Since my first viewing of USA it had grown on me like a custom fit dream where life on earth is nothing but a weird experience. I am an artist and a Buddhist and this film communicated to my senses. It was an ideal embodiment of impermanence. This may sound strange but somehow this film was able to touch me in a profound way like no other. I recommend it.","I saw it in Europe-plex. Great movie!! This film is an exploration of the Spirit and the Flesh in modern times. Protagonist Jim Kirk, drives an unwieldy RV across America, stopping often to fill his gas-guzzling tank. He is middle-aged and confused . He fuels his thick, diabetic body with cups of coffee and radio chatter. He is the Flesh: agitated and sometimes spaced out, fairly oblivious to the growing tension around him but feeling it as twinges of discomfort. The Spirit suffuses the film through speeches and other sounds, as well as what appears and goes by in the visual field. The Spirit eventually collides with the Flesh and Kirk goes down, unable to comprehend what has happened to him. He's been in denial about just how bad things have become due to he waywardness of all of us, because we are all focused on the needs and desires of our flesh. We're all in the same denial and so we, like Kirk are in danger of going down and being blown away by desert sands just like him.","Completely worth checking out. Saw it on MLK's birthday 2006 and it hit me big time. Sometimes it feels like we're all in a trap and are doomed to repeat the past no matter how much we try to change. All we can do is to keep on going and speaking out. Just keep on going. Don't mean to be a downer because that's not the point but maybe we need to get down before we see how much we need to work on ourselves. What happens when we keep being told by the best people like MLK what needs to happen to pull us out of our \"dead end road\" but we don't listen. I know that some of us do listen but how do we get the rest of the world to see things as they really are? Just keep going, I guess. This movie got me thinking even more about all of this so I guess it has done what it set out to do. That's what I consider to be a good movie or play or book or poem or speech or anything: something that gets you thinking and keyed up to move in an active direction instead of sitting stuck and bored and hopeless.","I have a little hobby of finding really cool pics out there that are pretty much unknown -and then letting people know about them This one is on top of my list for getting the word out this summer. This indie film (and I really mean indie--not Miramax, Fox Searchlight indie) might be easy to overlook in the big maze of celluloid, but if you want something completely different--you have to check this one out. Basically, I thought it was totally great. I should have known from the DVD cover, front and back ,that this was going to be something totally different, but, they ALL say that their stuff is different to hook you. Well this one really IS totally different. It's in your face: beautiful and scary and unashamed to tell you to wake up. War, peace, 9/11, poetry, even a eerie sort of music video set to an old time \"patriotic\" song and a weird guy in an RV. Need I say more? Just see it.","The whole shorthand for supposedly being more aware in this weird time is that you are \"Blue\". The Blue State mentality. This is supposed to get us off the hook for what is/was happening during the last few years in our country (The USA). It doesn't get anyone off the hook but it makes us feel better, as though we aren't benefiting in any way from living here and getting all the good stuff that a US citizen gets just by being a US citizen. But I'm so sick of bitching about this. It doesn't do any good. I haven't taken much action lately and I wonder how many people have. Maybe I'm just down because my job was \"outsourced\" last month and now I'm looking for work in the shrinking tech support field where most of the jobs are quickly going to India and other places overseas. I'm thinking that soon it's not going to pay off to be a citizen here with the screwed up infrastructure and the shrinking job market and the obsession with war. These days it seems like anyone who speaks out gets jumped and questioned about there \"patriotism\". Anyway, back to this review: USA The Movie is an obscure DVD that makes me realize that some people have taken action, whether it's through politics, protesting or arts or media. The filmmaker is obviously passionate, knowledgeable, willing to go outside the norm, frustrated, unique, astute etc. I looked through the whole site that's linked to the DVD and got lost in all the articles, essays etc.that are there. The DVD does that too, has references to different times, views and historical points. Sometimes someone does something out there.","A lot about USA The Movie can be summed up in its title. It draws parallels between the attitudes of this country in the face of war and a kind of Hollywood-like falseness that glorifies things that shouldn't be glorified. I'm not sure I agree with the filmmaker's take on recent events (although, truthfully, I can't always tell exactly where he stands) but I admire the unusual and artistic way of getting the point across. Audio tracks of speeches, radio interviews, poetry etc. play as large a role here as visuals. Most of the time the visuals of the story are accompanied by these audio elements to good effect. I'm kind of a radio buff so it was satisfying to hear the way that radio was integrated into the pace of the movie. In fact, most of the dialog takes place over the story rather than having characters talk to one another. That's not to say that there aren't \"characters\" (real people), but except for \"Jim\" the protagonist ( a kind of '60's drop out with an erratic state of mind) the others come and go pretty quickly. A few make a very powerful impression, especially a guru-like taxi driver who seems to be the voice of wisdom itself. When he breaks out into a spontaneous song of prayer while driving Jim to the subway, it is a very powerful moment. On the cover of the DVD is the quote \"The danger is clear\" which is taken from President Bush's speech that paved the way to our incursion into Iraq. In retrospect, hearing that speech at a climactic moment in the film brought home how we are living in a historically charged moment which will always be remembered.","A lot about USA The Movie can be summed up in its title. It draws parallels between the attitudes of this country in the face of war and a kind of Hollywood-like falseness that glorifies things that shouldn't be glorified. I'm not sure I agree with the filmmaker's take on recent events (although, truthfully, I can't always tell exactly where he stands) but I admire the unusual and artistic way of getting the point across. Audio tracks of speeches, radio interviews, poetry etc. play as large a role here as visuals. Most of the time the visuals of the story are accompanied by these audio elements to good effect. I'm kind of a radio buff so it was satisfying to hear the way that radio was integrated into the pace of the movie. In fact, most of the dialog takes place over the story rather than having characters talk to one another. That's not to say that there aren't \"characters\" (real people), but except for \"Jim\" the protagonist ( a kind of '60's drop out with an erratic state of mind) the others come and go pretty quickly. A few make a very powerful impression, especially a guru-like taxi driver who seems to be the voice of wisdom itself. When he breaks out into a spontaneous song of prayer while driving Jim to the subway, it is a very powerful moment. On the cover of the DVD is the quote \"The danger is clear\" which is taken from President Bush's speech that paved the way to our incursion into Iraq. In retrospect, hearing that speech at a climactic moment in the film brought home how we are living in a historically charged moment which will always be remembered.","I like movies that show real people \"Americans\" and tell truth. The movie is simple and that seems to be the great thing about it. It played here in Norway fine (Amazon says above that it's USA/Canda but the box states \"All Regions\". I have to say it is not for the American viewers. It played in here in World Raw Views, a theater. I saw it and later I ordered it. The cut was different and much better. See it and you will like it or maybe hate it. Sorry Bush lovers but this movie is driving you crazy because it makes sense. Get angry and hate it. Disagree with everything in it but I for one stand by it. It's not for the empty minds. It is long and too hard to keep up with but by the second viewing it makes more sense. I loved Owen's words and the poem made me cry.","The whole shorthand for supposedly being more aware in this weird time is that you are \"Blue\". The Blue State mentality. This is supposed to get us off the hook for what is/was happening during the last few years in our country (The USA). It doesn't get anyone off the hook but it makes us feel better, as though we aren't benefiting in any way from living here and getting all the good stuff that a US citizen gets just by being a US citizen. But I'm so sick of bitching about this. It doesn't do any good. I haven't taken much action lately and I wonder how many people have. Maybe I'm just down because my job was \"outsourced\" last month and now I'm looking for work in the shrinking tech support field where most of the jobs are quickly going to India and other places overseas. I'm thinking that soon it's not going to pay off to be a citizen here with the screwed up infrastructure and the shrinking job market and the obsession with war. These days it seems like anyone who speaks out gets jumped and questioned about there \"patriotism\". Anyway, back to this review: USA The Movie is an obscure DVD that makes me realize that some people have taken action, whether it's through politics, protesting or arts or media. The filmmaker is obviously passionate, knowledgeable, willing to go outside the norm, frustrated, unique, astute etc. I looked through the whole site that's linked to the DVD and got lost in all the articles, essays etc.that are there. The DVD does that too, has references to different times, views and historical points. Sometimes someone does something out there.","Thank God that there are films out there that don't follow the same old Hollywood crap formula. I think the digital revolution and the DVD revolution is actually making it possible for more interesting work to get out there even if you have to dig harder to find it. I love it when a film takes its time to draw you in deeper and deeper into its inner emotional reaches. It really was like taking a trip through the soul of America and that soul is disturbed and confused. What really blew my mind was the way they used Martin Luther King's speeches about Vietnam and references to his assassination in a way that hit me hard. I found myself choked up every time i heard his voice. I've heard him speak before, of course, but the way they used the speeches here made me feel like I understood his message in a way I'd never thought about.What can you say about a movie that has heavy statistics about war, oppression and a plea for compassion at the end of it where a credits crawl would usually be? In fact, there's no credits at all in the film. You have to access them by selecting them in the features. Somehow that made me think a lot. All in all I can't say enough about this DVD. Brilliant.","It's funny because I read all the reviews on this page after getting this movie and it's either a love it or hate it reaction. You'll probably either love it or hate it too. I think the best films are the ones that divide people because obviously they have some kind of impact. I'm in the five star camp because this film did a real number on me and made me want to go back and find out more about Afghanistan and Iraq. I have to admit that I was pretty tuned out when all that was taking place. Especially Afghanistan and I feel guilty about that. The music through the movie was beautiful. I kept getting lost in it especially during some of the historical flashbacks. Personally, I thought the audio was great. It seemed to me that the soundtrack with speeches, music and the radio was put together so that you feel like you're in the RV with Jim, the main character, or in his head. Everything not on the radio was very clear and everything on the radio sounded like it was really on the radio. Anyway, this is a very amazing DVD which made me cry.","USA The Movie is like this: You take a nap on a long hot Sunday afternoon. It feels great to close your eyes and let your worries drift away. Soon you're lost in one of those intense lucid dreams where you know you're dreaming but you still can't wake up--not that you want to. You go with the flow, and soon you're in a kind of weird Alice in Wonderland story complete with characters you didn't think you could dream up. They're telling you all kinds of crazy stuff about war and peace while taking you through a trip into the past and even the future. The dream starts to get heavier and you feel like it's going down a path you can't control. Maybe you want to wake up so you try to open your eyes but you can''t . Now there's destruction and sadness and confusion and scary voices telling you what could be truth or could be lies. You're seeing images that flicker and change and then get clear, but do you even want to see what you're brain is creating for you? Finally you're lost in a myth world and you realize the end has come. The end of the world and the end of the dream. It's over. What do you wake up to? What do you do next? Maybe you'll write down that dream because you know dreams like don't happen too often-- and when they do you better pay attention. Or maybe you'll crack a beer and forget the whole thing. Bad idea. Don't forget.","Just see it! It's a smart movie but too hard to understand the first time. See it more than once. Everything that is seen or heard on the screen is intentionally crafted to evoke a feeling, sensation or tone. The clarity of certain visuals and the crispness of certain sounds are deliberately contrasted with blurred images or pops, crackles, hisses and barely audible sounds. The structure is non-linear and cyclical. Motifs recur as time runs both clockwise and counterclockwise. Expectations regarding \"plot\" and character\" are broken signaling a non-traditional use of film to tell a story that is both contemporary and as old as humanity. This is a part of a review: \"USA The Movie is emotionally intense, intellectually intriguing and profoundly disturbing, in surprising and unconventional ways.\" Dion Dennis, PhD","In 1858 Tolstoy wrote this in his diary: \"The political is not compatible with the artistic, because the former, in order to prove, has to be one-sided.\" This thought from a great mind is applicable to USA The Movie. The film might be read by those with a narrow focus as a 90 minute slam of Bush, Cheney et. al. as well as a ripping of America as an out-of-control imperialistic force that will ultimately be destroyed by its own folly and thirst for power. The more open-minded viewer will take note of the recurring images and themes that make this DVD a testament to postmodernist thought, as the main character breaks up into bits and pieces surrounded by recurring visuals of the natural world contrasted with the man-made constructions; towers, roads, video monitors, radio, vehicles. Above all the ominous threat of wars that have been and are to come smolder throughout. War and rumors of war are what is created, destroyed and recreated on the screen, in our conscious world and in our unconscious minds.","I have wracked my brain for another film that reminds me of this one. I really can't come up with one. I think it's because most of the films that take on this topic (war, peace, violence) are in a fixed documentary style.There are some terrific ones out there, all of them better known than USA T.M., I'm sure, but they are intended to be informational and to bring your emotional response to the surface through intellectual means. This DVD, in some ways may seem more intellectual but it really isn't. It is philosophical, maybe, but it bypasses the information mode and goes directly to the same place that a piece of music does. It makes you feel but sometimes you don't even know why. You are just taken somewhere on a wave of feeling. When you watch it, notice how well it is put together. It may not be for everyone but it is for everyone who look for a rare cinematic creation that respects you.","This movie was recommended to me by some academics. From their comments, I had some pretty lofty expectations. But this movie was nothing but disappointing. The aim of the director is obvious--to use an interweaving of speeches/poems as a way to argue against the Bush doctrine. But the director fails miserably at this. Also I seriously question the director's choice of main character. It's a bum who is definitely not worthy of being heard. The rise of corporation power, so what? Most importantly, this movie gets a failing score in its persuasive power; it's clearly intended for those who've already formed their opinions. It's true that the movie's aesthetics are quite pleasing. But pretty much everything else in the movie simply sucks."],"review-user":["beatbeatlarry","kamatinma","mallmemes","jenmeck79","villasunday","salas8000","mrwoo1212","mankindf4040","zloulout","koolkarentoo","latzky1982","kellylooms","toandy200","allallan1","kfarmerjohn","darknessliftsoverthewate","kyleg82"],"review-date":["22 November 2006","24 November 2006","1 May 2006","24 January 2006","20 June 2004","23 January 2006","1 January 2006","20 December 2005","13 December 2005","18 December 2005","17 December 2005","9 December 2005","15 November 2005","10 November 2005","17 May 2005","15 May 2005","19 April 2005"],"review-rating":["10","10","10","10","10","8","10","10","10","10","10","10","10","10","10","10","3"],"review-title":[" Couldn't Be More Right\n"," USA The Movie: Maya and Dharma\n"," Great\n"," Ready!\n"," Different, Different, Different\n"," When we were blue\n"," The title tells the story\n"," Why USA THE MOVIE is not out in theaters\n"," Loved it - but too complex for me\n"," Great!!\n"," Thank God for USA\n"," Made me cry\n"," USA THE MOVIE - A dark dream\n"," I liked it...\n"," See Tolstoy\n"," On my mind\n"," Disappointing\n"]}