{"review-url":["http://www.imdb.com/title/tt0424738/reviews"],"review-text":["As a long time resident of western Pa I have an intimate knowledge of this topic and found it REGFRESHING to be so authentically captured on film! Kudos to the producers of this epic!!! And what a great legacy to the school children for years to come.The attention to detail and realistic depiction of this complicated web of events make it a one of a kind production.Viewers will find themselves mesmerized by the storyline and captivated by the storytelling.Grahame Greene is magnificent as the presenter.BRAVO!!!","When I tuned in to my local PBS station last night to watch \"The War That Made America\". I was expecting a dull documentary, instead I got a very good and believable reenactment of the major events of the time. Now I see the reasons for the American Revolution, and the part the Indian wars played. Larry Nehring IS George Washington, and he is perfect for that part. The narrative to the camera, also work fantastic. I'm looking forward to next week, to see the rest. It's good to see PBS really using the HD format to bring the 1700 right in to our living room.I hope Larry Nehring is seen more in the future, since he is such a talented actor.","Like many western Pennsylvania history buffs, I had been really looking forward to this much-heralded PBS program that was produced by Pittsburgh's WQED. However, I must say now that I was somewhat disappointed. On the positive side, I believe that overall this film did a fair job of explaining the main issues and describing the events of the so-called French and Indian War. In particular, its presentation of the Indians' point of view was somewhat new and quite interesting, although it certainly was at time over-emphasized. Also on the positive side, the blend of narrative and action scenes was well done and came across somewhat better than many of these typical documentaries made up of \"experts\" interviews and picture stills (a la Ken Burns). On the negative side, many of the battles did have a somewhat \"staged\" look and many important aspects of the war were overlooked. Most of all I was very disappointed and frustrated by how little importance was given to Forbes's successful campaign of 1758 against Fort Duquesne as compared to the earlier failures of 1754 by Washington and 1755 by Braddock. In particular, I was somewhat incredulous that there was NO mention of Colonel Henry Bouquet, the Swiss mercenary in the British service who was most responsible for Forbes' success. Finally I could not believe the complete omission of the 1763 Battle of Bushy Run that started as a re-run of Braddock's defeat but ended up as the victory that decided the outcome of Pontiac's War thanks to the wiles of the same Colonel Bouquet who certainly must rank as one of the most successful British commanders of this war.","I found this documentary to very biased and skewed. If you watch it, you'll understand where the sympathies lie with the producer of this film. He/she has decided for you who the protagonists are and who the antagonists are in this war. Some major events were left out, presumably, because it would make the producer's protagonists look bad, and draw sympathy for the producer's antagonists. (If you are a reader, one good example of what I'm referring to can be found in a book entitled \"Betrayals\".) I wouldn't recommend this documentary for entertainment or education, unless the educator has an agenda. I don't need for someone to tell me how to think and try to sway my opinion on a particular historical event. In a documentary, please just give me the facts and let me come to my own political, ethical, and moral conclusions.","For years, some of the best documentaries you can find have been made for Public Broadcasting here in the States. Shows like \"The American Experience\" and the documentaries of Ken Burns are just some of these great shows that not only educate but entertain. \"The War That Made America\" is every bit as good!It's expertly crafted--a quality production throughout. And, surprisingly, it was made with a very significant budget for PBS--$14,000,000. It shows, as the acting, narration and re-creations are great.As far as documentaries go, there just aren't very many about the French-Indian War (also called the Seven Years War). This is odd since it was so important historically, as it decided the futures of both Canada and the United States. And, of the ones I have seen on the topic, there is no comparison--\"The War That Made America\" is simply the best. Fascinating and compelling throughout.Note--despite the title, the documentaries have to do with both this war much of the American revolution--so perhaps \"The WARS That Made Amerca\" would be more accurate. Part four concludes with the ending of the war and then goes on to give an overview of events leading to revolution.","We learned little about the French and Indian Wars in high school. I remember only a few names and it was never clear what the whole business was about. It all seemed rather dull. It still does, in a way. There were no more than a handful of pitched battles and a lot of skirmishes and raids. Maybe it was the climate in which the war was fought, temperate northern forests -- green, dark, humid in the summer; dreadfully bare in winter. I went to college in Iroquois country in upstate New York. Some nights were so bitterly cold that the sap froze in the trees and the trunks split open with loud cracks. I remember wondering why the Cayuga just didn't give up and move to Florida.But this is a good documentary. It fills in the gaps, for one thing, and spells out the dynamic of the competition for resources (hello?) involving the three principal players -- the British in the south, the French in the north, and the various Indian tribes in between.George Washington was a colonel in the Virginia militia, who fought for territory on the side of the British. But there followed disagreements with the mother country over exactly how to pay for the monstrously expensive adventure. Britain at the time was also involved in what was called The Seven Years War, busy annexing territories that belonged to the French and Spanish. And Britain imposed some taxes on the colonials -- not ruinously high -- expecting that Americans would help pay for the war that saved them from the French. The Americans weren't too happy about that because they had no representatives in Parliament and viewed the taxes as alien, which led to the Boston Tea Party and all the rest of it.It's an admirably candid and honest history. Washington was friends with some of the Indian leaders but he went ahead and betrayed them to acquire personal land in what is now the Midwest. The Indians aren't portrayed as saints either. They were adept at playing one side against the other and weren't bothered if they had to \"tomahawk\" a few innocent heads to get what they wanted.Eventually the French gave up. Montcalm was in charge and HIS mother country starved him of troops and supplies because France's political structure was fragile and somewhat disorganized. His Indian allies deserted him too, once they saw which way the wind was blowing.There are maps -- just enough of them to make the geographical dynamics a bit easier to follow. Mostly we watch reenactments, which are well funded and adequately staged. The acting on the whole isn't bad but the poor guy playing Pontiac -- yes, Pontiac -- has a voice that suggests not an Indian but a nice Jewish kid from Brooklyn. As far as a non-historian can tell, the period decor is accurate.","I am no expert on history, but I enjoyed the series immensely and learned a lot. This series filled in a lot of gaps for me. It's just too bad that PBS aired it late at night in the region where many of the Native actors from NY live. There was little or no publicity about the show in Central New York. I do hope this film is made available to schools and public libraries and will be rebroadcast, if it hasn't been already.I also noticed some mistakes on your list of cast members. One actor is actually \"Elmer John, Jr.\" and Curtis D. Fishinghawk was completely omitted. Many of the same actors met on this film and became friends, then later worked together on other projects. Through these projects I met John Bert who is very talented, organized and professional. John- I wish you well in future endeavors and appreciate your kindness toward me. Let me know if you need to go SU ball cap shopping again! I will promise not to get you killed on the highway!","\"The War That Made America\" is an interesting look at a conflict that doesn't get much attention. Although known as The Seven Years War, it should be recognized as The First World War. But you wouldn't know that from this series. Other than a few passing paragraphs, the war seems confined to New England.A friend of mine pointed out one major fact. If this is, indeed, to be the war that made America, the series is much too small. If it is to be the war that made George Washington, it is too big. I found myself watching the story and learning some small items I didn't know about. But when Washington leaves our story after Braddock's Defeat in 1755, the writers seem obligated to try and find some way to return him, as if it were a drama where the main character dies in the first minutes of the movie. What we end up with is a machine-gunned history lesson about the politics of the era for the first three hours, followed by a lead up to the American Revolution in the final 50 minutes.This story would have been better laid out by describing the events leading up to the war and how the Indians were as much a part of the politics as the two kings were, thousands of miles away. Instead, they are regarded as helpless pawns in this world-wide chess game, a fact that is absolutely untrue.The look is fantastic. Great locations with great action. I could have done without the characters looking at the camera and Graham Greenes walk-thru. But, all in all, it should serve as a great ice-breaker to those interested in The French and Indian War. However, if you want a better story, go to the library."],"review-user":["Brandfirst","geir-mortil","GlorieuxJ","tryggvesen","MartinHafer","rmax304823","janeene-thrun1","johnbert1"],"review-date":["19 January 2006","19 January 2006","18 February 2006","15 August 2016","24 May 2012","16 March 2014","17 July 2007","1 February 2006"],"review-rating":["10","9","4","1","10","6","5"],"review-title":[" Awesome and Authentic\n"," Strong performance of Larry Nehring\n"," An Interesting, but Uneven Film\n"," Skewed\n"," The best documentaries on the subject--a war that is pretty much forgotten today.\n"," Well-Done Narrative.\n"," Wonderful Native Actors\n"," In Search of Its Meaning\n"]}