{"review-url":["http://www.imdb.com/title/tt0433624/reviews"],"review-text":["This film was a wonderful romp, intelligent, playful, mysterious, full of surprises, with humor in odd places and a tremendous energy. The famous film director (the protagonist) and the events he tries to manipulate through film all become entangled in fascinating ways as he is nearly out-maneuvered by a prince who has never heard of him. There are wonderfully rich images throughout and paths suggested but not followed (exactly what is going on with the somber wife of the pedestrian tourist wedding director?). The ending is so much the better for being untidy. Realism and logic are not what you should be looking for here. If we are going to turn our weddings and our imaginative lives over to film directors, we should be prepared for a wild ride, this film seems to suggest.","An esteemed filmmaker goes quietly on the lamb after his assistant jokingly makes inappropriate remarks to a woman he thinks is an actress waiting for an audition, implicating the director in a sex-scandal. While hiding out in a small town he has his arm twisted by a local prince into making a film of his daughter's impending wedding. This film has a lot on its mind about the current state of film-making, not much of it pleasant. Beneath the labyrinthine story levels lies an angry satire of an industry that reduces artistic directors to no more than metaphoric wedding film makers, and a society that rewards death over excellence when considering person's worth. These are only two of the many themes that expand to fathers and daughters, masculine identity, power games, even the old 'nature of art vs. reality' debate. Even when baffling with it's magical realism and surrealist touches it's never less than engaging. This is the kind of film that begs you to come back for a 2nd viewing, and you look forward to it.","There is something that one of the characters (the aging film director who pretends to be dead) says which may summarize all the film: \"In Italy it's the dead who rule\". True! This is a country without a future, in the hands of old and jaded men. And Bellocchio's cryptic portrait of the country, pivoted on the apparently senseless story of a director who has to film marriage parties to earn a living, manages to say a lot about what is not working here. But foreigners may miss the point, as it's not clearly expressed. I understand that Australian or Canadian people who watch this may get bored and wonder if there's a meaning--well, there's a meaning, but it's clear only to people who live here today, and keep their eyes wide open... like Bellocchio. Surely it's not one of his best films, and it's not as powerful as Buongiorno, notte, but it's worth seeing... for Italians who live in Italy.","If Sicily is a territory of the baroque, with its doubling of perspective, that's part of this movie's challenge to realism. And it's an exuberant pleasure here, outdoing Fellini with not one but three film directors, plus of course the actual Bellocchio, who has made some really great movies and shouldn't be touchy about his honor. There is a variety of takes and casting improvisations on Manzoni's \"I promessi sposi\" with, somewhere there, actual marriage. Sicily is also taken to be a territory of skulduggery (You already know this version of the island, so there's no spoiler involved), a comic version of which makes the picture worth seeing for Sergio Castellito's work with guard dogs on the floor of the great hall of a palazzo.","The film made no sense to me whatsoever. Good actors(SergioCastellittoaparticular favourite; he was great in \"Uomo DelleStelle\"/\"TheStarmaker\"but that was made by Giuseppe Tornatore, a great Italian director as opposed to the mediocre one who made this effort),but awful, rambling script, terrible editing,and a director who seemed to have no idea of what he was trying to say, and ended up saying exactly nothing. Apretentious load of rubbish, but the sort of film that certain Italianpseudo-intellectuals whom it was my misfortune to have known in the dim and distant past would have loved it, and unfortunately Italy has no monopoly on these, they can be found everywhere and probably acclaim this as a great masterpiece. I never thought much of Bellochio as director. I remember seeing his first film \"PugniNella Tasca\"/\"Fists in the Pocket\" (or some such title) in Rome when it was first shown close on 50 years ago (I was living thereat the time). All the usual pseudos raved about it, but it left me pretty cold. I didn't think he was much of a director then, and still don't. Age has certainly not improved him, and this film must rank as one of his worst.","This would have to rate as one of the worst films of all time. The film screened at the Italian Film Festival in Melbourne, Australia. After the screening, not only did I want my money refunded, I wanted the 1.5 wasted hours of my life back too. I have a very broad tolerance level when it comes to the indulgences of some European film-making, but this is one of those films that is selected for festivals based on the reputation of the filmmaker alone. This film is proof that while such selections may satisfy the egos of the film-maker and the selection panel, there is absolutely no joy for the audience. There is no character development whatsoever, the plot is a garbled mess, the style is nonsensical, the shot selection is appalling, and the editing is worse. By the end of the first reel, you'll wonder if you walked into the wrong cinema, and by the end of the third reel, you'll be begging to be put out of your misery. This film is an abomination.","I checked this out at the Vancouver International Film Festival and was not impressed.The only area of the film I enjoyed was the commentary on film-making. For the most part, this film seemed random and somewhat fantastical (I don't say that in a complimentary way, however) and just silly. It was as if he was mixing fantasy with everyday life, which may sounds intriguing in some films, but the fantasy merely seemed needlessly perverse.My criticism of this film is not upon the actors, rather the story itself. I found it boring and narcissistic. I wanted my money back, but considering it was a Film Festival, that wasn't about to happen.","I agree that this film is too pretentious, and it is not easy to know where it is going. I have been teaching literature and film for many years, and I find this film to be one of the most over rated, according to some of the previous reviews here. However, let me remind you that this is the same director who has L'ora di religione (Il sorriso di mia madre- My Mother's Smile) to his credit -- a gem of a film! Was he trying to outdo Fellini's 81/2 here???? The scene with the dogs, which has also been pointed out, is absurd and excessive – just one example. Others would take too much space, and some reviewers have already noted them. Overall, a most frustrating and annoying experience!","I generally love Italian cinema. I will forgive some pretensions for the sake of art. I watched at home - maybe the DVD transfer was the reason some scenes were so muddy and dark? This was a small part of the boredom that put me to sleep - worse was the lack of any compelling plot. Odd to note that the scene with the dogs which someone here wrote was \"absurd and excessive\" is actually a high point! OK there may be some interest in that this is a film about film making about films - with some filming in the film - but it it had been better shot, or had some characters of interest, it might have been worth the time it took to watch. But no. Mi dispiace per scrivere la triste verità..."],"review-user":["lanark1","runamokprods","latinese","RNQ","waldorin","FilmEdge","joelmbain","martita-2","ramito-1"],"review-date":["8 July 2007","18 March 2012","27 October 2008","24 September 2006","28 May 2009","8 November 2006","5 October 2006","7 February 2010","20 March 2011"],"review-rating":["8","8","7","7","1","1","1","3","3"],"review-title":[" Loved this movie\n"," Fascinating, sometimes confusing Kafka-esque comedy/drama\n"," Italy is like that--unfortunately\n"," Exuberance\n"," One of the most silly and boring films it has ever been my misfortune to watch...\n"," An insufferable waste of time\n"," Counted the minutes until it was over.\n"," Don't be too hard on Bellocchio!\n"," Not unless you have no options\n"]}