{"review-url":["http://www.imdb.com/title/tt0437179/reviews"],"review-text":["As far as mad stalker/Friday the 13th/Halloween type movies go I think it was effective. Kane makes a good \"monster\". The cast of unknowns seems to try reasonable hard. There were some gross-out gory parts, some effect atmosphere, some unexpected ways of getting killed, and for me anyway a surprise in some of the twists. It's a B-movie but in that context it works for me. The theater was full and the crowd seemed to get into it. If you want to see a \"maniac versus a group of teen agers\" movie this is a good one to see.The set up for the villain is effective and they actually did a good job in explaining how he got as messed up as he did. Actually by the end of the movie you get enough flash backs that you think he was twisted into shape and not just born evil ala Freddy or Jason.","When I heard about Kane being involved in an horror movie playing -surprise surprise- the \"badass\", I was extremely excited. I mean, he's huge and - let's say it- he's ugly. And also the character himself \"Kane\" is very dark and interesting (The athlete behind Kane-character is named Glen Jacobs). When I've seen, at the cinema, the logo \"WWE\" and Mr. MacMahon as the executive producer, I had my creeps. I said \"these money freaks are messing with my movie genre\". Fortunately, they aren't. This movie is pretty much a slasher, not so different from Friday 13, and it's about Jacob Goodnight, the killer, obsessed by sins and the eradication of them in the most radical way.This character is crafted in a very realistic way. All of his obsessions belong to his mother, which is obsessed as well by sins and by the holy scriptures. This mother creates, with a certain satisfaction, a monster, which has her same ideas and, more important, the proper physicality to \"do his job\". And he will \"perform his opera\" on a group of people, convicts working in an abandoned hotel, which reveals to be a trap for these \"sinners\". And, I'm afraid, the plot ends here. Should follow a description of some scenes, but, you know, I don't want to be boring; anyway, I trust you get what kind of movie this is. Now, the style is very modern, sometimes it resembles a video clip for a hip hop single. There are no boring points, but, being a slasher, there are a lot of strong violence scenes, and the whole movie it's a crescendo for the final challenge.Which is, like, 3 to 1, in terms of number, but Kane has the body he has. . . well it was some 3 vs 3, OK? The actors are \"kinda\" OK. There isn' t a lot to recite, except: a sex scene, a nude scene, and a lot of vulgarities, spoken and suggested. And the respective deaths, of course. Kane has been a surprise!! I expected a giant grunting all the time with an horrible expression (the same he has when he fights), and he actually was. But when talking to the \"lovely mum\" . . .more than a serial killer, seemed to be Forrest Gump! He has this mutable expression, at the end of the movie, which left me completely breathless. OK, he isn't Micheal Gambon, but . . . you see he's putting a lot more than his 6' 8 . . and that's something!!All in all, a movie that is entirely shot on the charisma of Kane, and that's why it works. This movie isn't \"the next big thing\" for the slashers, but it's way better than the latter 5 \"Friday 13\" and the latter 5 \"A Nightmare on Elm Street\" as well. Note for music lovers: the soundtrack SUCKS a load!!This movie has the same problem of all the slashers in the 90s. No evolution. It is what it is. If you like people being killed by a brutish guy with some serious mental problems, fine. If you don't. . . what are you doing here?","I was expecting this movie to suck, but what I got was a pretty good slasher/gore film. Most of the death scenes are adequately brutal. The teens are decent, with Penny McNamee definitely the best of the bunch. Rachael Taylor looks like a young Christie Brinkley, but doesn't bring much to the movie other than that. Kane was good as the killer, and is totally believable as a fearsome juggernaut. I saw the \"twist\" coming from miles away, but I still enjoyed the movie.But what really stood out to me was the direction. Gregory Dark might actually have a career in legit film ahead of him. Aside from overusing the horror film \"speed cam\"(you know, where like the guy's face shakes all fast?), there's some good shots here. The camera angles and environments really emphasize Kane's size, making him look even bigger than he actually is.If you're looking for deep story or characters, this ain't it. But that's not what slasher films are about. If you're looking for some good violence, or if you're into gory films, go check this out!","I remember way back when I was a manager at Toys R Us I had to watch this sad, pathetic \"Personnel Management\" training video. It lectured that whenever you say a criticism, you should ALSO include a compliment. This movie reminded me of that principal.First off, it's not all that bad, actually. Kane makes a pretty good \"Silent Psycho,\" and the character's back story is decently developed in a series of B&W flashbacks. His POV shots are nicely distorted, and, unlike the vast majority of psycho killers in film today, is not simply an \"unstoppable force.\" Kane actually manages to find a character in there. (A very minimal character, to be sure, but there is a TINY bit there more than just a \"Thing-That-Kills-People-For-No-Reason.\") On the whole, however, the acting in the film is best described as \"not-TOTALY-sucking.\" (I'm reminded of that Simpsons episode where Groundskeeper Willie sings a song that goes \"Wouldn't it be adequate?\" Yes, the acting here is, indeed, adequate, but only just. To be fair the actors aren't really being asked to act here, it's enough that they are clichéd stereotypes.) The art direction is generally good, if very, very derivative of other films like \"Hostel\" and the \"Saw\" series. It goes a bit over the top with the filth and grime at times, but for this kind of movie, that isn't really a problem from an aesthetic standpoint. It is a problem from a plot standpoint. The people are there (we learn this in the first 10 minutes, so don't worry, it isn't a spoiler) to do public service by cleaning an old, historic building. Unfortunately, the sheer SCALE of the mess at this building would take that guy from \"Dirty Jobs\" and a full hazmat crew a month to deal with. The place is practically a toxic waste dump. There are a few problems (which I will NOT detail in the interest of avoiding spoilers) with the set and set dressing that are later revealed as not problems at all, but rather plot points. Those I can forgive.The film delivers on what it promises: A creepy, disgusting setting with a creepy, violent psycho stalking creepy, dysfunctional people, with absolutely minimal story, plot, acting, direction, sense, or purpose to get in the way. It's almost Ed-Woodian in it's gleeful disregard of knowledge of it's own lack of ambition to greatness. (If I may be allowed to construct a sentence that convoluted without being arrested by the Language Police.)I had very few expectations from this film (Hell, after all, it IS a WWE film...), and the only thing that really disappointed me is the same thing I am disappointed by in most horror films. It was very, very predictable. At one point I was sitting there going, \"...and now someone runs in and saves them,\" only to be rewarded by just that.In the end, if you can accept the idea that a correctional institute would send a co-ed group of mixed violent and non-violent offenders to do heavy-duty industrial cleanup in street clothes and sandals for a weekend with only 2 chaperons, then nothing else the film asks you to accept will be much of a problem for you.","This, ladies and gentlemen, is truly a modern B-movie. The dialog is stilted and delivered with wooden rigidity, the premise is predictable (there are a few decent twists) and characters remain 2D for most of it. And yet there is a certain...charm. WWE wrestler Kane brings to life the sick, twisted monster of a man with a lot of pathos (though it is somewhat like his character that he's been playing around ten years) and so I'll find it quite amusing when people say it's \"not much of a reach for him,\" but Glen Jacobs is, apparently, quite the nice guy, so actually it is. In any event, he's cast perfectly as the hulking brute and the deaths are suitably over the top (Jason would be proud), but I heard at least four applause breaks for four different kills scenes. Frankly go into this movie thinking that you'll have some fun and a gorefest, oh it is QUITE the gorefest. The R-rating IS richly deserved and I actually got a little nauseous during some of the more graphic times. In any event, a very, very fun, but fairly bad, movie.","All right, let's be realistic about this. Nobody goes into a movie produced by WWE Films (whose owner has challenged God to a wrestling match), directed by a former porn director (the man gave the world the Between the Cheeks trilogy), starring a wrestler named Kane, and expects a little slice of art on a golden platter. If you do then you probably need to find something other than watching movies to occupy your time.So what exactly are we to expect from a movie like this? Well, here's what I was looking forward to:1) Bad acting. 2) A fairly non-existent, clichéd storyline. 3) Kane walking around with a scrunched, sour face that indicates his nostrils just found the potato salad he misplaced a month ago. 4) Tons and tons of gore. Well, if you're hungry for some \"so bad it's funny\" entertainment then this might satisfy your appetite because it delivers on all counts.Obviously, movies like this are best seen for free, but if you do choose to sacrifice box office bucks then have some fun and make a game out of it. The filmmakers are nice enough to introduce us to each of the annoying delinquents by flashing their names and legal offenses on the screen. This makes it easier for you to write down which ones you want to see killed and in what order. You and your friends can see whose predictions are most accurate.I also suggest that you and your pals write down every single moment of stupidity and inanity that you can find. Tally them up at the end and see who comes up with the most. I think my grand total was 107; can you beat that? I personally want to know how after 35 years and a fire does this abandoned hotel still have electricity, running water, and a working elevator?I know, I know, the filmmakers are assuming that if you pay to see this then you obviously don't put much thought into what you spend your money on and therefore likely won't put much thought into how silly the movie is, but that doesn't mean we can't point it out and laugh at it.I also like how the city wants to turn this huge hotel (which would be condemned and recommended for demolition by any sensible inspector) into a homeless shelter and they think the best way to get it cleaned up is to give eight punks a few mops and brooms. Uh-huh.I think you pretty much know what to expect, but I feel the need to provide you with a couple of warnings. First, if you hate crowd interaction no matter the movie then you might want to stay away. The people in the audience acted like they were at an actual wrestling show. Shouts of \"Kill him, Kane!\" and \"I hope you die first!\" and \"Chokeslam!\" echoed through the theater, showcasing what I hope is NOT the best of what America has to offer. I usually don't appreciate such audience interaction, but for a cheesefest like this I thought the commentary added to the entertainment value. However, I can see how others could be annoyed by it.Second, and this shouldn't even warrant explanation, the film doesn't shy away from the gore. If watching a big ugly dude rip eyeballs right out of their sockets doesn't scream \"fun night at the movies!\" for ya then you know good and well to save your dough.I must say that I was a little surprised by the extreme lack of dialogue on Kane's part. I wasn't expecting him to put on an acting clinic, but I was hoping he'd have some cute little catchphrase like \"Say goodnight\" (his character's last name is \"Goodnight\") right before he killed a victim. Instead he uttered four words in the entire film - \"Nooooooo!\" and \"I see it.\" But hey, he delivered them flawlessly!If I were a bad guy in a movie then my catchphrase would be something like \"Place your BETTS!\" or \"All BETTS are off!\" It'd rule and you know it. We need a new genre term for bad horror films like See No Evil that induce so much unintentional laughter that you almost have to label them comedic. Feel free to send me your suggestions. For now we'll just call 'em HOR-larious!","Eight teen convicts are brought to the abandoned Blackwell Hotel to clean it out as community service. They soon discover that it's the residence of a hulking psychopath (Kane) who has a thing for pulling out and collecting eyeballs. It doesn't help that the guard watching over them (Steven Vidler) has had a previous run-in with the beast four years earlier. A guilty pleasure of mine are slasher films. Most of them are poorly directed and acted but they still hold some appeal and entertainment value. See No Evil is a good example of this. It features atrocious writing and acting but the death scenes are pretty good and the movie proves to be entertaining. The premise sounds like a mixture between Friday the 13th, Saw 2 and Halloween: Resurrection. I really liked the idea but it didn't work out too well. It was really just a bunch of clichés and everything was predictable. Screenwriter Dan Madigan just focused on the death scenes and nothing else apparently. The death scenes themselves are pretty good and gruesome. Director Gregory Dark did a good job with them and he came up with some creative kills. The acting is pretty bland and unremarkable. This is because all of the characters are one dimensional and we don't know much about them. It was hard to feel for these people because they were pretty unlikable. Kane is surprisingly mediocre. I was expecting his on screen presence to be scarier but he didn't do that good of a job. A second rate Jason Voorhees, if you will. The rest of the actors are relatively unknown and this film will probably neither help nor hurt their careers. While the death scenes are gory, they aren't necessary scary. There's really no suspense just some gory death scenes. Because of this, the movie doesn't hold much of a repeat value. Also, if you don't like slasher films then don't waste your time with this one. It will do little to change your opinion. In the end, See No Evil is a decent slasher film but it is generic and forgettable so it's not exactly worth watching. Rating 6/10","Okay, this is a B-Movie, Horror by numbers. The good news is it doesn't try or pretend to be anything else. So it just concentrates on being the best B-Movie, horror by numbers flick it can manage. It succeeded, but as you can tell by the rating, that still doesn't make it a good film.Okay, so the positives. The acting is pretty reasonable and this lot, including Kane can probably do much better horrors in the future. The special effects, while simply being generic for this day and age were also pretty reasonable. Nothing ground breaking or stand out impressive for either of these. Probably the most notable thing was Kane himself, but it's not a great surprise seeing as his day job is to play a Psycho.On the downside however the whole plot was so incredibly bog standard you get bored with it early on, stop really caring who's going to live or die and just try and enjoy the visuals. The story naturally revolves around a couple of young but tough women (like that's new) who have a tendency of getting all the men around them killed. The older characters are very peripheral and somewhat wasted. But that's part of the hangover from the \"scary movie\" sub-genre, which fortunately seems to be slowly fading into the distance and morphing into marginally better films such as this.The worst part of the movie was the supposed plot twist. This was something that if you were to ask yourself what the most obvious, generic thing that could happen would be, you'll have guessed it long before it happens.Anyway, as I said the film is at least honest and for a short disposable hack and slash horror it's pretty reasonable. Having said that, there are better films even in for B-Movie slashers. So really, unless your a WWE fan, or you really like this kind of movie, I wouldn't bother.","So the WWE has done it. They have poured over into film;their first one being See No Evil, starring their very own Kane. I caught this movie and went in not expecting it to be a great film...It just seemed to cliché and looked like nothing new. To my surprise it actually wasn't half bad. A viewer stated above that it is good B-horror movie fun, and honestly thats the best way to describe it. Now the question I was asking myself was how was Kane going to hold up...Well let's just say he made an absolute bad ass out of the 'Jacob Goodnight' character. He sold the role really well, and really did look menacing. But what can you expect from someone who is almost 7 feet tall and weighs around 320 in solid muscle. The acting was decent, and the story was nothing new of course, but we all know that. The directing as well as the cinematography was done very well and the hotel backdrop really looked dilapidated and well done. Considering this was directed by a porn movie director, I was quite surprised. I'd recommend this movie if you're looking for mindless gore and killing and just some overall fun. Think of this movie as a modern day latter Friday the 13th film. And save room for the ending too, cuz it's a good one. And stick around after the credits too...","A dangerous psychopathic killer Jacob Goodnight is holed up in the abandoned and rotting Blackwell Hotel,alone with his nightmares until eight teenage delinquents show up for community service duty along with the cop who wounded Jacob four years ago.When one of their own is kidnapped by the killer and her fate uncertain,the remaining petty criminals must fight for their lives...\"See No Evil\" was directed by the porno filmmaker Gregory Dark and it stars WWE superstar Kane as remorseless psychopath.The supporting cast is terrible and there are no surprises to be found here,but there is enough extreme violence and gore for slasher fans to enjoy.Overall,I liked this film and you should too,if you are into mindless slasher flicks.Sure,it's cliché,but who cares.7 out of 10.","The first official release of World Wrestling Entertainment's film division is a pretty basic horror/slasher movie called \"See No Evil\" starring Kane, one of their big men wrestlers known for having an intimidating presence, hard-hitting moves, and one of the most convoluted backstories in wrestling. And let's not pull any punches here; while this movie is promoted as the greatest horror movie of all time (mostly by WWE), it goes without saying that after having seen this movie, I can confirm it as one of the greatest comedies of all time.\"See No Evil\" sees a bunch of juvenile delinquents sent to a hotel so they can clean up. Of course, a monstrous murderer (played by Kane) also happens to be living in this hotel and we all know where that goes. Without giving away too much of the movie plot, this film has all the semblance and structure of an early-1980s slasher flick with most of the clichés intact, but without any of the scares that those films accompany. And that's sort of the main problem with \"See No Evil\". It tries so many of the tricks implied by its predecessors in the genre that it comes off as predictable; veteran horror fans will easily recognize some of the gimmicks ahead of time and even those who have only seen a few flicks should tell what happens next. It's too generic to be scary.The movie's gory, no doubt, but it's only there for the effect. The dark atmosphere instilled in the movie gives off that feel of terror initially, but as you get towards the end, it somehow feels out of place and gets tiresome quickly. The death scenes don't come off as gory and horrific as much as they do laughable, although some of them are pretty inventive.And the acting in this movie is pretty bad too, as the main characters aren't developed enough for us to care when they eventually do get axed. Some can't even portray fear properly; they just scream and cry in a vain effort to emote. So when they die, it only adds to the comedy because you don't care enough about them that you simply consider them the equivalent of Starfleet Redshirts to the monster Kane.As for Kane, he simply portrayed his movie character the same way he portrays his wrestling character, only he uses axes and hooks instead of hellfire and brimstone. There's no doubt in my mind that Kane can be a great fixture in the horror genre. He has the look and presence for it; he just needs better material (specifically a script that isn't written by someone who writes wrestling shows) to work with.Now, despite what may seem like a harsh review, I actually enjoyed the film. It's one of those laughably bad movies that you can't help but sit down and enjoy. My main gripe with the film, again, is that it's simply an exercise in filming gory kills and doesn't have any frightening or shock moments. I enjoyed it, but I enjoyed because it was easy for me to laugh off some of what was supposed to be scary moments in the movie. If that happens because it was supposed to be that way, the movie would have been rated higher. But it didn't. It got laughs because it's a B-movie and it doesn't help that the director's previous experiences was porn flicks and music videos; not exactly overcomplicated things to direct anyway. Nonetheless, I enjoyed it tremendously.If you don't mind a fun B-movie or funny horror film, I'd highly recommend \"See No Evil.\" If you are a true enthusiast of the genre, I'd wait until the DVD comes out before checking it out. Everyone else should probably go watch something else.","Yeah, I do know the genre and I am aware of the fact that B-movies aren't the best movies in the world, but there are only two words to describe this one: hollow and empty.The main problem is that it's virtually impossible to care about the characters. Most of the characters in this movie are just meat, to be finished off in a very gory way. They're your typical inmates: foul-mouthed and self-centered. I for myself couldn't care less who would survive or not. Kane's character was a completely uninteresting killer. I mean, come on: even in a B-movie you should be able to put some sense to his actions. The main message he had was \"growl, I'm gonna kill you cause I'm ugly and my childhood sucked!\" He's really just a random bad guy.The only thing that kept this movie going for me was the gore. The death scenes were kind of okay with the right amount of painful experiences for our \"heroes\". One of them gets a particularly funny death (no, I'm not gonna spoil that one). But in a horror movie, I do expect some tension and some scares too. And that's what See No Evil lacks.Conclusion: if you expect a decent horror flick, don't watch this movie. And even if you like B-films because you're amused by bad acting and illogical plots, don't watch this one either. See No Evil is not scary, not funny, not interesting and not worth your time. It's nothing.","I remember first seeing the trailer for \"See No Evil\" in theatres and laughing heartlily when the WWE films logo appeared at the beginning. By the end, my laughter had increased. Yet somehow, I found myself watching it several months later on DVD. I'm a huge horror movie fan and I guess I just thought it would be at least entertaining.How wrong I was. It's not the bad acting or dialogue that does this movie in. It's just the complete lack of originality that makes this a task to sit through. The plot is so routine that it's laughable. A group of youth offenders are sent to clean up an old, dirty hotel for community service. This just happens to be the same hotel where a vicious, deranged serial killer is holed up. And then, as per usual in these films, they get killed off one by one. I know this is the standard slasher movie plot, but would it have killed them to add just one twist or interesting element to the story? Even the characters are the typical clichés. A backstory about the killer's childhood abuse is touched upon but never fully explained.You can usually count on the gore in these types of movies to at least provide some sort of visceral thrill but, with the exception of a few moments, it is all dull. Kane pretty much kills everyone with his hook on a chain and then gouges their eyes out, which gets repetitive by the second time he does it.Knowing that he has virtually no story, Gregory Dark, a famed porn director, overdoses us with every \"cool\" camera trick he can think of. Instead of jolting the picture to life, it just further numbs us to the film.The only thing \"See No Evil\" has going for it is Kane. Say what you will about him, but if I saw his character in real life, I would run away as fast as I could. He doesn't even need to act (I think he says a total of three words throughout the entire film) but he just oozes brutality. Too bad the writers couldn't give him a better vehicle.All in all, this is just a complete waste of time. Even if you're a die-hard slasher-flick fan, it will still manage to bore you. A couple more of these and the slasher film genre will be completely dead.Grade: D","While investigating a call in an abandoned house, Officer Frank Williams (Steven Vidler) and a rookie find a woman brutally blinded, but they are attacked by a huge psychopath with an ax; the rookie is killed and Frank shots the criminal in the head, but has a severed arm. Four years later, the mutilated Frank is relocated, working as a guard in the County Detention Center. Frank goes with some delinquents to the Blackwell Hotel, an abandoned place since a fire burnt the last two floors, with the purpose of cleaning the location, preparing it to work as a shelter for homeless; in return, the criminals will have their sentences reduced. During the night, the inmate Kira (Samantha Noble) that has some Christian tattoos in her body is kidnapped by the deranged serial-killer Kane (Glen Jacobs) that collect the eyes of his victims, while the rest of the group is attacked by the psychopath with his ax.The slasher \"See No Evil\" uses a similar argument of the cult Bigas Luna's \"Angustia\", i.e., a deranged man that collects eyes of sinners controlled by his insane mother. The forgettable story uses the usual clichés of the genre, with the most unreasonable attitudes of a group trapped in a place and beautiful naked bodies. However, this film is not bad, having a creepy murderer; gruesome locations and atmosphere that recall \"Se7en\"; a very insane fanatic religious mother; and some dark humor, specially during the credits. My vote is six.Title (Brazil): \"Noite do Terror\" (\"Night of the Terror\")","This film, by Gregory Dark, is about a group of juvenile delinquents who clean an abandoned hotel harboring a gigantic, murderous psychopath who enjoys killing people and taking out their eyeballs. Sound fun? It isn't.I feel like it has a pretty interesting premise. It takes the whole cliché of homicidal religious fanatics and teams it up with a group of kids getting into trouble. It's an all right idea, but it has disappointing execution. The actors are terrible. Not only the young actors, but the older ones as well. I wasn't expecting much out of this film when I saw it was a WWE production though, to be honest. I can't think of anyone who I think did a good job acting. Seriously, no one comes to mind. That's terrible. The dialogue was stupid. It was just really lame, C movie material. It was pretty predictable. It was gory, yeah, but I was pretty bored. I wasn't ever scared; however, I was clenching my fists in frustration often. It's one of those movies where the characters are completely oblivious to everything that's going on and just make stupid mistakes. It's annoying.There's one thing I liked about this movie and it is the cinematography. Things were well lit, there were nice angles, beautiful shots. It's a nice looking movie. Too bad it didn't have any substance.I watched this movie a couple years ago and hated it. I thought maybe I just had no taste back then and I might like it now, but no. It's still awful. I definitely don't recommend it. I certainly will not be buying it ever or watching it again.","I wasn't expecting a mind blowing horror film after I heard this movie was produced by a wresting company, but, hey, I gave it a try, and it wasn't a complete disappointment. The plot is fairly simple - a cop, now working at a detention facility for troubled youths, had his arm severed in a horrible accident while facing a brutal serial killer with religious motives - Jacob Goodnight. Now, four years later, he is sent to a huge dilapidated hotel where the delinquents are to clean up the place. But little do they know, Jacob Goodnight is hiding away in the rotting hotel somewhere, and he begins to emerge and kill off the teenagers, and seeks vengeance on the cop who shot him years ago. As night falls, the group becomes lost in the maze of the decomposing hotel, and Jacob Goodnight is close behind.\"See No Evil\" is a fairly methodical, formulaic horror film. It contains some typical clichés (although I was happy to see a character actually grab the gun from a dead police officer, rather than run off screaming and leaving the weapon behind), and features very archetypal characters - the tough guy, the normal guy, the bubbly girl, the punk chick, the tough girl, and others. While these characters are somewhat clichéd, it really doesn't matter much because the majority of them are placed in the film merely for body count. This movie is a popcorn flick all the way. I liked the film's idea - a serial killer with religious motives (which makes it a little more sinister), and I definitely loved the setting, although I think it could've been a little bit better. The CGI shots of the hotel weren't highly convincing, but that may have just been me.The performances in the film are mixed - some of them are alright, but most of them are passable and pretty wooden. Christina Vidal, the lead heroine is probably the best of them, with Samantha Noble being in second. Glen Jacobs (The WWE wrestler \"Kane\") plays the villain well - he's got a scary look to him naturally, and his character is very demented and disturbed. The ending was predictable but for whatever reason, I didn't really see it coming at all. There are some very predictable moments in the film (Jacob falling out of the window, but miraculously grabbing onto the ledge for one last grab at a victim), and some of the murder scenes, while not all of them, were a little bit over-the-top (the cell phone scene, while it was kind of morbidly funny, was just too much). For the most part though, the murders were really messy - this film is a pretty gory one at that.Overall, \"See No Evil\" is a decent horror movie. I think it could've been a lot better, but it is what it is - a methodical, by-the-numbers slasher movie with a little bit of a spin. Horror fans have probably seen it before, but it's not a bad rental. 6/10.","I found this movie to be very interesting. The gore was just a little more than what you see in the Saw series and the overall storyline is actually good. The way the characters are introduced makes it a lot easier to understand why certain things are being done/said. Although the only person I knew was Kane himself I found the other actors to be sufficient for what was needed. Despite all the hype that was built up for it on the WWE programming of RAW and SmackDown! (Although it was more RAW) I wasn't sure of what to expect. But I loved the twists, I loved the kill scenes, I loved Kane's character and I loved the storyline. Overall it is a good movie, I enjoyed it and I will definitely watch it again. I also definitely recommend it to those who love a good gore movie.","i saw this movie yesterday and absolutely loved it, in a time when all Hollywood seems to be able to do, is make 1 remake after another, comes a film, it takes a wrestling promoter who's in the business of 'sports entertainment' to get the movie fans back to the the theaters.Kane in the movie is enough to scare the heck out of you, and although some cheesy acting by the younger set, i was able to overlook that, because after all the movie was about a monster, and kane is the perfect monster, no makeup needed there.i've been going to horror movies for over 30 yrs and have seen some good and some that made me say, 'i spent all this money for this'? the village, and house of 1000 corpses comes to mind, i'm sure i can think of more, but you get the point.if i were to worry about a movie that supposedly's all about blood and gore, i would've never seen dawn of the dead (both) or land of the dead.so if you're tired of all the remakes that've come out in the past yr or so, go see this movie and send a message to the Hollywood big shots that you're tired of their copying movies and ready for something original.","Another movie with a star of a wrestling. So far I have noticed....wrestlers can't act on the movie screen. This movie is no exception.The action is dreadful. It makes you laugh at what they say, and they can't be serious, they try to act scared but they fail and look stupid. The acting is horrible, possibly from the bad director.The plot was stupid....Just some people get placed in a hotel because they're criminals, and they get randomly killed off. The movie is stupid all the way through, making it one of the worst I have ever seen.The only think and this is why I give it a 3 and not a 1 is because of the way Jacob Goodnight dies. The pole through the head and the stories of him plunging was awesome.Overall this is a really horrible movie, and you definitely shouldn't waste your time with it.","I find it a little unnerving that simple because the WWE name is attached to this film is automatically written off by all. Now too me this film wasn't that bad as far as the actual horror it does indeed make you jump out of your seat even moments that you feel like your in dis-belief at what you just saw. The CGI is quite good and the actual brutality of the murders is a little unsettling.The real critique I have of this movie is the fact that the storyline is kind lacking it seems a little direction less at times. But if you wanna have a good night at the cinema where you will jump feel scared even hug your significant other in fear.Have a good night at the cinema.","See No Evil is the first film from WWE films. Yes WWE, Word Wrestling Entertainment, pro wrestling. Of course being that it's a WWE film a wrestler has to star in it, the wrestler being Glenn Jacobs aka Kane. Which is not really important as if you didn't know Kane or what WWE stood for you would never know it had anything to do with the wild word of wrestling, as the movie has nothing to do with wrestling. See No Evil is gross out horror film, it has some moments were the some people may jump but for the most part it's just saying, hey look how gross we can get! Not that there is anything wrong with that. Jacob Goodnight (played by Kane) is sort of a Jason type character, his mother tortured him as a kid with strict (understatement) Christian beliefs and has warped his mind. Now he's a big scary chopping killing machine. 90% of the movie takes place in an abandon hotel where Jacob stalks six teenagers (surprised?) and a handful of adults. I could explain why they are in a creepy old hotel but eh, who cares? Despite it's lack of originality See No Evil is well made, for what it's supposed to be. Kane plays an awesome killer and needs little make up to be scary. One flaw in the movie is the most annoying possibility people survive, I really looking forward to having them being horribly killed, but alas, does not happen. I wish the film didn't have the stigma of wrestling attached to it, although like I said the film has nothing to with wrestling, people are still closed minded enough not to want to see it because, given of course if they are a wrestling hater. Then again the movie may also make money because Wrestling fans will want to see it. Either way, See No Evil has top notch effects and little CGI, and like I said, it's quite brutal so like I say it's good stuff....if you like that sort of thing.","After watching this movie, I have nothing but contempt for any of those who were involved in the making of this abysmal film. For one, as a general comment, the storyline was literally unbelievable and filled with incredible clichés all around. The same obviously goes for the dialogue which panders to the lowest common denominator and manages to offer absolutely zero unpredictable original lines. The acting was terrible as well with Kane showing, throughout the entire movie, at the very most 3 separate and distinct emotions. Even the use of modern special effects failed, as each prop was easily distinguishable from its real life counterpart. Overall, I would not recommend for anyone to even think about viewing this feature, as it will most surely waste 83(not even 90!) minutes of your life.","Well, I'm a few days late but what the hell....! Anyways, the word that best describes my reaction to \"See No Evil\" was....SURPRISE. The film is actually pretty good. There is definitely an ample amount of blood, gore & action in the film with a modest amount of suspense. It hearkens back to the good ole' slasher days of the late 70's & early 80s. Think \"Madman\" meets Leatherface with a dash of Norman Bates and you'll get a good feel for this flick. While SNE is thin on plot (most horror films are), it kind of makes up for it in the violence/methods of killing, the gore, suspense & the fact that Kane does a great job of playing the highly disturbed Jacob Goodnight. The title of the film comes from the fact that Jacob plucks out the eyes of his victims using just his fingers & stores them in big jars. Why?? You'll just have to watch it & see (pun intended). There are certain cinematic elements lifted from other horror films most notably Psycho, TCM, & Madman but they're not blatant. Finally, SNE really doesn't go into territory we long timers haven't seen before & granted, SNE is no \"Pyscho\" or \"TCM 74\" but it certainly merits a look imo. BloodStone's Recommendation: Take in a matinée showing of \"See No Evil\" Bloodstone's Rating: 7.5/10","Let me start off with the positives...Art Direction definitely provided us with this hotel that gives the visitors an environment of eerie fear and fright. However, I don't get it why they need to have bodies lying on the hallways.Story is nice. I've never seen movies with this kind of concept but definitely it carries itself throughout the film, staying at that point and not swerving to other story lines.Now for the fun part! First of all, I am a student nurse. The eyes can't be removed just that quick! And behind the eyes is the optic nerve. It is a single nerve fiber that provides signals to the brain regarding optic stimuli. However, how come I saw three? Inaccuracy. Never ever make a mockery of human anatomy. It comes handy even at these sort of circumstances.Acting is so poor. There is no \"afraid\" factor and well, although they do look afraid occasionally, they do not sound like it at all. Ugh.Too cliché-- from deaths to characters. The end... is also too clichéDefinitely this movie can still save itself.","Just watched the movie, and, I must say I've got mixed feelings. It *was* quite a good movie for its genre - seeing most horror-movies nowadays just s*ck. Aside from the blood and gore, there was some storyline hidden beneath the pulled out eyes and limbs. The acting was okay, but then again, not a lot was needed, as people got killed every 5-10 minutes at a time. That said, the atmosphere, on the other hand, was great. An eerie, filthy hotel with a dead-sick psycho running around stabbing people and pulling them around by a meat hook... Definitely not one for the squeamish.I didn't very much like the seemingly unnaturally beautiful women in sandals and tight tops, who were supposed to clean up the dump they were in. Moreover, I didn't really think running, hot water in a hotel which has been empty for 30 years, to be credible - either.Nonetheless, I gave it a 7, which makes it enjoyable to watch. Certainly better than some movies I've seen in this genre."],"review-user":["wrudd","gigioiaderosa","mrtacoman","sandman33","Daelock","TheMovieMark","christian123","Fenris Fil","JM007JB","HumanoidOfFlesh","dtm666","GeoffreyR","william_bill_wade","claudio_carvalho","carljessieson","drownnnsoda","margy_d25","freebird_heaven_1","typhill","yukxysm","PaulNewmanIsDead","vqld","BloodStone","unapalomablanca","acesomeone"],"review-date":["22 May 2006","2 August 2006","20 May 2006","21 May 2006","19 May 2006","19 May 2006","14 August 2006","18 August 2006","19 May 2006","30 August 2006","21 May 2006","13 September 2008","4 December 2006","23 June 2008","11 October 2010","30 November 2006","10 August 2006","20 May 2006","29 June 2006","21 May 2006","19 May 2006","14 February 2007","24 May 2006","30 March 2008","31 October 2006"],"review-rating":["6","6","7","7","4","4","5","8","7","4","3","6","2","6","6","3","6","9","1","8","3","7"],"review-title":[" Good for it's genre\n"," Classic Slasher - Kane is Great!!\n"," A decent gore flick\n"," I just saw it and...\n"," Good, B-movie Fun\n"," It's HOR-larious!\n"," A decent by-the-numbers slasher film\n"," It's honest at least, just not very good\n"," Fun movie and much better than expected...\n"," Routine slasher flick with some nasty bits of gore.\n"," One of the greatest comedies of all time... oh wait.\n"," Hollow and empty...\n"," What a joke\n"," The Eyes of the Sinners Are Mine\n"," A Horrible Horror Film\n"," Methodical and By-The-Numbers - Not A Complete Waste Though.\n"," Interesting movie\n"," i loved this movie possible spoiler?\n"," See No Evil\n"," Not as bad as some would leave you too believe\n"," Great Gore Film, if that's what you like\n"," Bad\n"," A violent, gory, fun-filled slasher romp!!\n"," Good... and bad\n"," Averagely good movie, some remarks, but generally enjoyable.\n"]}