{"review-url":["http://www.imdb.com/title/tt0426550/reviews"],"review-text":["Worst.film.ever Nothing more needs to be said. Aaron Carter is utterly repellent and the rest of the cast should fire their agents immediately. It really is a terrible terrible movie from beginning to end. I wish I could be more eloquent in describing the movies many (oh so many) flaws however I cant be bothered/get too angry to form proper sentences. In short I absolutely hated everything about this movie and not in \"so bad its good\" kinda way...It was unadulterated drek.Gavin","What really stood out to me about this movie was how little the plot made sense. So many characters were randomly introduced, it was like how I imagine Tommy Wiseau's \"THE ROOM\" would be re-envisioned for the Disney Channel set. We had the wise elderly couple who kept on hanging out where \"Jane\" worked, telling the same story about how \"soda\" brought them together, or Jane's Mom/Stepmom/random crying woman who would all show up at random times.Aaron Carter's acting is definitely the highlight of this film: I actually looked forward to every scene he appeared in. The editing is painfully bad, with scene cuts that make no sense. The \"Jane\" character is really irritating, mooning about and moping about \"J.D. McQueen.\" The scenes with the \"Music Awards\" are more depressing than anything else. And the ending of this movie is surreal.","Honestly, the only reason I picked up this movie from Blockbuster was because Aaron Carter was in it. Okay first thing's first. Do you notice how ugly Aaron Carter has become?? I mean, he used to be so cute but now..with that lanky body and blotchy skin - EW. I think he should stick with singing and the directors of the movie could've found a much better-looking guy who could lip-sync. No offense though. I thought this teen movie was majorly lame - and this is coming from me, being a teen myself. The 'mean girls' in there are oh-so predictable, the acting is so amateurish it makes you cringe at times (especially from Aaron) and overall I just didn't enjoy it. Although, I give out points for the storyline - that was alright, but not at all realistic. Anyway, stay away from this movie by all means you can unless you happen to have wads of cash on hand and have absolutely nothing better to do with 94 minutes of your time. It's not worth the $6.50!!(P.S; this review of mine may not be applicable to younger kids under the age of 13!)","The only people i would recommend this film to are both blind and deaf, although i'm sure a sadomasochist would get a kick out of it. This film had nothing; no acting, terrible music, awful script- only the power to suck any happiness from your soul. You may be wondering by now why or even how i managed to sit through the full hour and a half of sheer inanity, and it is honestly a difficult concept for even myself. Firstly, i had to pace up and down as the film progressed as i found it extremely hard to get comfortable. Secondly, i only made it without gnawing off my own arm in order to have something to beat myself to death with by phoning friends for moral support when the plot became particularly slow. The problem was it became a matter of pride for me to finish it after the opening thirty minutes, and that was a fatal error on my behalf. I normally like films to leave you with something by the end, but all this did was take..... For the sake of your sanity do not watch this film.","I rented this movie with my friend for a good laugh. We actually got laughed at by the clerk at the video store because of our questionable movie tastes. Unfortunately, I don't remember the first half of the movie because all I did was stare at the giant metal braces Jane wore. and I didn't hear anything either due to the incomprehensible lisp. The other thing that was able to grasp my attention besides her metal mouth was her questionable fashion sense. This movie was made in 2005 but it seems like the wardrobe people jumped all the way back to 2000 for the clothes. If you remember the days when Aaron Carter was considered a \"popstar\" and you like high waisted jeans, ankle socks and knee length skirts, then this little trip down memory lane is perfect for you.","My summary refers to the fact that this film has 1479 votes--just 21 short of making it eligible to be on IMDb's infamous Bottom 100 list--the 100 lowest rated films on the website. With a paltry score of only 1.8, this would place the film at approximately between #38 and 46 on the list--talk about a very dubious achievement!! My score of 3 isn't that bad--but it does bring the film that much closer to the dreaded list.As for the film, it stars the once-cute Aaron Carter--yet another prepackaged and forgettable pop star of the 1990s. When he first broke onto the scene, he was a cute kid with some songs that appealed to pre-teens and tweeners on Radio Disney. His songs, look and image were all scrupulously groomed and created by marketing folks and did the trick--leading to some huge album sales. Unfortunately, by 2005, sales were in decline and Carter had hit his awkward stage of life--something ALL kids his age have to deal with eventually. To put it bluntly, he isn't cute any more in this film and is at a very tough stage of life. I assume now he's a gorgeous young man...but in \"Popstar\" he's no longer the heart-throb he once was. Here, he is just very normal...a death sentence for a kid in his position as a \"pop sensation\".Interestingly, the film has some appearances by some other ex-teen heart-throbs from the last few decades--including a roles for David Cassidy and Leif Garrett--two guys who also know what it's like to disappear from the limelight. Cassidy managed to pick up the pieces and make a niche for himself, while Garrett is a great example of a pop star whose life after stardom has been a bit of a joke. Hopefully Carter will take after Cassidy in the future and so far, thankfully, he's managed to avoid the negative publicity and court appearances of many ex-pop idols. I was far from thrilled with the film but seriously wish him best in this department. It's not his fault he was plastered across the radio and television throughout the early to mid-1990s.In this film, Carter doesn't exactly need to stretch himself--he plays a pop star. However, despite making millions and being adored by girls, he doesn't \"have it all\". He's quite dense--mostly because he has little interest in learning. The problem is so bad that his mother decides to no longer home school him--forcing him to go to public school. The problem, though, is that he is rather phobic about taking tests...and making the grade in school is difficult. So, he gets the idea of finding a smart girl to date--one who would naturally be obliged to help him out in school. He picks the cute but bookish Jane (Alana Austin) and pretends to really like her in a sad attempt to make this scheme work.This plot, by the way, isn't bad and could work even though it seems a lot like an episode of a show like \"The Brady Bunch\" or a Nickelodeon sit-com. Sure, it's predictable and you KNOW that the formula will mean that she will eventually learn his plot and be hurt AND he will eventually realize that he actually does care for her AND by the end of the film, all will be forgiven and they'll be a real couple. But, given good acting and competent direction, this could be worth seeing for his teen fans, as predictable isn't always bad. And, as it turned out, this ISN'T exactly where the plot went...but it was awfully close.There are a few good things I liked about the film. Seeing Tom Bosley and Stella Stevens playing Jane's grandparents was very nice--their role was quite sweet and it was good seeing them again. Also, 1970s made for TV movie star Andrew Stevens appeared in the film--it was nice to see him again--though part of me hated him, as he looks so great after all these years and I look ever bit of my 45 years! He did a fine job and it was nice seeing him in the same film as his mother (Stella).As for Carter, with his many prior experiences on TV, he was, not surprisingly, pretty good. While his relationship with Jane didn't seem very believable, he and Ms. Austin gave it their best. The film wasn't great, but they did try and I think most of the problems with the film were in the writing--with a better and less formulaic plot, it could have worked much better. Plus the whole \"testophobia\" angle seemed pretty contrived...and rather insignificant. Who cares if a mega-millionaire star gets anxious taking tests in school?! Overall, not a rotten film as the current rating would imply, though there isn't much here to attract a wide audience. People who grew up loving Carter probably will enjoy the film. Older folks will probably care less as well as really young people who probably haven't heard of him. For them, there is no nostalgia value in the film.My favorite part of the film...Leif Garrett giving Aaron advice. I felt like screaming \"don't listen!!\" but didn't!","I am probably a little too old for this movie, 16, and being a guy, the story is a little too girlie, but I really thought it was a cool movie overall. All the girls in this movie are so hot and really great actresses, from Alana, to Adrianne, to Deena, to Kimberly, all the way down to the cute girl that plays Alana's little sister, Rachel. I am not a huge pop-star fan with the lovesick songs, but I thought that Aaron Carter did a really great job in this, and seems like he was really into this movie, and made it seem real. My mom liked all the older farts that she grew up with, so that's cool too. I kept thinking that I liked a lot of the people, and wonder if I will see them again? A sequel would be cool. I rented this, but I might buy it too, since I have a ton of DVD's, and like to go back to see something that I missed. I couldn't buy it at Blockbuster though, so I don't know where I could buy it right now, but I'll look into that. Anyway, I am a 16 year old guy, I already said that, I know, but I would totally take a date to see this. It's really good for all ages, really. I think even my little half sister who is 6 could see this. That's what is so cool about it, that it is something that all ages can see. I'm sure that was done on purpose, but it really works. Girls can dream about being with Aaron Carter, and guys like me can dream about all the hot chicks in this movie. There is something for everyone.","I know it sounds crazy, but I just cannot get enough of this embarrassing film. I have never felt emotions of sadness and laughter at the same time to this degree. Everything about this film is low budget crap, beginning from scene one. The montages are awful, too. I don't care about watching a girl brush her teeth (with no toothpaste!) for 15 seconds, or her using various facial products to rid of pimples. I just do not understand how this movie was made in 2005. I could have sworn that the \"tween\" craze was over with by 2000.Highlights of the film: The awkwardness. A lot of scenes end by being completely awkward, like when J.D. just randomly gives Jane a cell phone, though he had just randomly arrived at her house hours prior. Why are there dolphins so close to the ocean? Why did the bow on the car look like vomit? Why was it Gogle instead of Google? A lot of questions have not been answered for me or my friends.Lief Garrets song at the end. It's priceless.I am sure that TAG Entertainment thought this movie was going to do great. I mean, they rented one Porsche (or is it Nick Carters?) that is used by three different people throughout the whole movie. Lief Garret and David Cassidy (both two prominent child stars) are featured in the movie. The only thing they needed in this film was substance, which is what a film needs or else is pointless. So, in the end, watching this movie is pointless. Unless you like torture and want to scare your friends.","Well, I have to say, this movie was probably the funniest movie I have seen all year. And I don't exactly mean that in a good way. This is probably the most pathetic movie I have seen in a while, and yet that's what makes it so hilarious. you can tell these people are really trying to act, unfortunately for them they aren't doing such a good job, making it so even lines delivered in what is supposed to be a serious tone come out sounding really funny. Aaron Carter is essentially playing a character quite similar to himself in real life, and still he manages to make the character seem corny and not at all realistic. This movie is one of those movies where everything that is supposed to sound serious comes out really funny and all the things that are supposed to be funny are just so stupid and corny that you have to laugh because you know how hard they are trying. This movie is so bad, it's actually good. I would definitely recommend it if your in the mood for a good laugh.","I don't understand why everyone hates this movie, aside from the fact that they're just jealous their music careers never took off like mega Popstar Aaron Carter. Like it or not Aaron has seen more success in his young life than most people could ever dream of having, so it only seemed natural for him to do a movie. Lou Pearlman and company have been known for over-exploiting their pop protégées, you remember Justin Timberlake's foray into TV movie Model Behavior? Granted this movie isn't big scale and impressive, but it's not supposed to be. It's not trying to impress people or be an Emmy award winner, it was released straight to DVD. It's just a cute little movie about an awkward teen who gets her dream of being with her favorite Popstar; I know a lot of you out there have had that dream at some point or another about you favorite singer, don't deny it. It's sweet and gentle and I applaud it for not stepping into the realm of sex, violence, and vulgar language that seem to be creeping into more and more of our movies today. Where's the decency? Where's the line? Teen dramas come in dozens these days because teens are a big market for companies, at least this one is more tolerable to me than Bratz (aka Slutz) with all the fake little girls running around going \"Oh Mah Gawd!\" in tank tops and mini skirts and is fathoms better than those gore fest movies like Saw. I feel for the main character girl because I was nerdy outcast girl in High School who loved Aaron Carter and NSYNC and the Backstreet Boys and other pop music and still do; and like Aaron's character would get crushing \"testophobia\", especially in Math. If you judge this movie solely based on the fact that you don't like or are jealous of Aaron Carter and his fame, then of course you're going to hate it and trash talk it in reviews. The only reason Britney Spears' dribble Crossroads got a higher score is because she has boobs. Accept this movie for what it is, not what you want it to be. I think this happy formulaic teen movie ends on a high note and makes you want to sing.","This film goes, without saying, in my list of films that need to be censored. This is why the Soviets monopolized the economy, to prevent garbage like this from showing up. I hope that they put this review on the 2027 APUSH DBQ regarding the different perspectives and opinions on American Culture in the early 2000s. I feel sorry for the APUSH students because that's worse than the 2015 AP European History DBQ about French national identity and culture in the 1960s. 99% of the 5s and about 79% of the ignorant masses would put this review in \"The people who knew what they were talking about\" grouping (we all know that by this time, the College Board will preassign groupings). The moral of this... hypothesis... is that American culture is threatened by this garbage. The American dream is in danger of this nightmare, and we need to purge this impurity from our culture before we raise a generation of patrons of this garbage.","Despite what others may think, I like this movie. I thought it gave a positive message to kids and teens. It shows that celebrities are just normal people with normal problems like everyone else. Plus ever girl has always dreamed about getting to know her celebrity crush for real. They even sometimes wonder if they may be able to help them in someway.I know I've had my share of celebrity crushes over the years. It really made me think about them and just how cool this would have been if it had happened to me! It also is a cute love story. A love story that any girl who has had that crush would desire. It's what most young girls dream about. Aaron Carter is very talented and is a great singer/actor and performer. He's also a real cutie.","This is a really cute movie. I had a massive sleepover (girls 10-11) and they absolutely loved this movie. They watched it twice! Don't let the rating fool you. You have to be 13 or older to rate a movie on IMDb, that eliminates the movie's target audience. If you have a girl (or boy) between 7 and 13, I guarantee they'll enjoy this movie. Sort of a gender reversed \"Notting Hill\" set in high school. Aaron Carter plays a famous pop star who is failing his privately tutored classes. His mom sends him to a \"regular\" high school with the ultimatum, \"pass high school or no summer tour.\" Taking the advice of his Manager (former pop star David Cassidy) he befriends the smartest girl in school (Alana Austin) with plans to cheats off her. Look for the humorous and insightful Janitor (another former pop star Lief Garrett).","I do like a cheesy teen movie sometimes, and today I was in that sort of mood. But... what the hell was THIS??? What did I do wrong in my past life to bring this atrocity into my current live!? It was literally unwatchable! The only movie in this genre that I could say is worse than this, is \"Pledge This!\" with Paris Hilton. And that says a lot, doesn't it? Maybe, since Aaron Carter failed at being a pop-star in real life, he wanted to at least have the chance to ACT like one, but... he can't bloody act! No one in this lame excuse for a movie can.It's not even \"so bad it's funny\"; it's the opposite - so bad, it's NOT funny.Jeez, how does this kind of horse-s*** get approved to enter the public domain? It should be illegal to release something like this without a suitable warning! I'm not a teen, but I can't imagine how even the dumbest of teens could possibly enjoy something THIS lame... Hell, not even the learning disabled, I don't think.","I just got it and it is a great movie!! i loved it! Although Jane Brightons voice n the beginning is so annoying because of her braces she don't open her freaking mouth...but ya have to watch it cause its a great movie!! the things he says in here are so funny and extremely cute!! and I'm sure Aaron would probably say some of the things in real life cause i don't know, it just seems that way!! ha ha there is a part in tha movie that is really funny...its wen Jane's little sister meets him...but i cant tell ya what happens cause ill just have to let u see for your self!! i went to go see Aaron n concert and it was so much fun!! n he smelled so good ha ha...i still cant believe i got to meet him!!! i have pictures if anyone wants to see them!! Steph","wow is all i could say i really loved the movie and one thing i could say to Aaron carter is that i really think that you should be in a lot more movies cause you rock.i love Aaron carter so much hes hot and so i say thank you a lot for making this movie great.i really do so wish he would be able to make a lot more movies because he his a great dancer, actor, and singer. i so wish i could sing as good as he could. and I've been a fan of his for like ever and i will never ever stop loving him. i rented the movie and I've had it for two days and iv'e literally watched it over like 10 times. laugh out loud you could call me crazy but that just proves that i liked it a lot. if u wanna talk you can hit me up at dvlbab300@aol.com so e-mail me if you wanna. I LOVE YOU AARON CARTER!!!!!!!!!!!!!!!!!!!!!!!!!!!","Aaron Carter plays the pop star(J.D. McQueen) in this movie (surprise surprise). This is a typical movie where the leading lady (Jane) has a huge crush on J.D. McQueen the pop star (as well as many other girls) but she's the lucky one that gets to spend the days with J.D. and forms a relationship with him that is more like a fantasy. J.D. has to go to a public school to keep his math grade up in order to do his summer tour. Problem is J.D. isn't good at math. He finds the smartest person in school (Jane) to tutor him. Jane tutors and falls in love with J.D. J.D. in return falls in love with as well but J.D. screws up and has to fix everything in order to win the girl and make the summer tour. The movie is definitely worth watching. Aaron will be a GREAT actor!!!","I had heard how awful this movie was, and needless to say, I was not disappointed. The plot rarely made sense, was completely unrealistic, and characters were randomly introduced throughout the film for no apparent reason. The characters left a lot to be desired, they were one dimensional, and, as others have previously mentioned, were not nearly as mean or nerdy as they should have been. The acting was sub-par, to say the least. The female lead seemed to have a sort of speech impediment, which was likely not caused by the obviously fake braces she wore, as braces do not usually affect speech to the extent shown in the film. The music element of the film, especially the concert at the end, was so bad I had to skip through it.What I found hilarious is that the popstar character in this film was taking advice from a rather stoned looking cleaner. Look where these 'words of wisdom' got him- a low-paying job as school cleaner, and an obvious drug problem.I have watched some awful movies, but this is one of the worst I have ever seen. I would recommend this to anyone who likes torture/wants to torture someone, is deaf, or is under the age of 8.","The one word that best describes Popstar is \"lackluster\". It might be that they tried to make a film about a pop star on a low budget but everything abut it is just lazy and uninspired. The introduction scene is supposed to show that Aaron Carters character is a famous singer but it lacks grandeur and instead he comes off as a pretty mediocre artist. The obligatory high school mean girls are not nearly cruel enough to be true antagonists, in fact, the mean girls of any other high school film would eat these two for breakfast. The nerdy girl is nowhere near nerdy enough to take on that role and the strict teacher is pretty lame. There is conflict in the film but it is insignificant, the high school setting is done without any effort and the actors all seem tired and unmotivated. I could go on to talk about all the inexplicable events of the plot, the clunky character introductions and so but what would be the point? The lackluster feel is what defines this movie.","Horrendous! I'm a teenager and I don't mind teen movies but this is horrible! Aaron Carter plays this popstar named JD McQueen and to keep his grades up or something, he works together with the 'nerd', Jane whateverherlastnameis. But the 'mean girls' are too predictable and such The clothing most of the girls wear in the movie isn't realistic. How would any of those girls get away with wearing no bra, tube tops and shirts that expose the belly? IN HIGH SCHOOL? At my school, we'd be sent home for something like that.And one part of the movie where JD texts Jane, she says 'Sleep tight? He must think i'm an idiot! I didn't know texting was so stressful!' How is texting stressful? And how obsessed Jane is with JD and how he 'falls' in love with her is very stupid. The dialogue is cheesy and stupid, the acting's terrible. the music is somewhat enjoyable and the plot is little to none.For tweeny-boppers who still love Aaron Carter, you'll enjoy it. If you're a casual watcher like me, this is NOT the movie for you","Aaron Carter was rather popular when he was young. He had a hit single, girls really liked him and his older brother was in one of those boy bands. It looked like his career would never stop. Until it stopped because people realized he wasn't that good. As he grew older the cute kid demographic moved on and so did his career. So the next step was obvious, turn him into a teen heartthrob via movies. Not a great plan as this is the only movie he ever headlined. It's about a popstar which you should have gotten from the title. He's going to go on tour this summer but he's failing math and his mother won't let him. In the real world I don't see this happening but they have to get him back to school somehow and so he must do better in math or else there's no summer tour for him.Of course nobody knows who he is because he's wearing glasses. If it works for Clark Kent it's definitely going to work for him right? I mean it's not like he's the biggest popstar on the face of the planet and girls all over the place have his poster in their rooms or anything. Nah, glasses are fine.Well high school shenanigans ensue. He winds up with a cute girl who's also his math tutor, she finds out who he really is, they fall in love, he passes math and the summer tour is a go. End credits.Sure there's more that goes on but honestly who cares? Aaron Carter can't act and as far as I'm concerned can't sing either. There is literally no reason to see this other than if you're a masochist and love to watch bad movies.","Even though i am slightly older than the recommended age group, I really enjoyed this movie. It's a little break from reality and it must be every little girls dream to become friends with a pop star. I know it was mine, to be sure! The first 10 minutes were really cheesy and the mean girls said a few things that were also slightly cheesy. Once you get over that, you can really start to enjoy it. I loved the relationship between JD and Jane - it was really sweet and you could see how much they began to like each other. The soundtrack is perfect and it fits into the film really well. I also liked the family set up for Jane, her sisters seemed lovely. Very well made film.","I know what most of people will think about this movie without even seen it... 'The typical movie from a famous singer... It will be a pink movie,a teenage film,it will be stupid...' and stuff like that... And yes, it is...I mean, it's a pink movie... But, you know what?...I LOVED IT. Seriously...It's a very romantic film... I think that every girl in this world has dreamed with something like the plot of 'Popstar'... Met his favorite singer, know him as a person...and even have a romance with him...right? ^^ I really enjoyed watching that... In addition, it's really funny... I think the actors did a great job... There's a lot of loving characters...And, Aaron Carter (JD) is not the exception... To be honest, in the first five minutes of see him act, i thought 'this will be awful'...But then , he surprised me really pleasingly...Also, I gotta say that the music performances on the film are GREAT! I specially loved the part when JD ( Aaron) sings without music , (only with a guitar) a very beautiful song...This guy is really talented... Time will tell...My advice to you?...Watch it! Don't make a prejudice ;-)","This film brought me to tears. I have to say, that if I did not have a beautiful husband at home, I would ask this beautiful piece of art to marry me. Aaron Carter gives a masterful performance as a confused young pop star, while Timothy Barton writes quick and witty dialogue that only furthers the genius of Carter's performance. Kyle is pretty gay, but his performance was nothing less than spectacular. He is also very handsome and cute. I'm thinking about asking him out on a date and giving him a very sweet goodnight gift.;)If you would like to discuss this film in the future, please contact me.Nick Burrell Vassar Class of 2012 Malibu, California Malibu West 310 924 0126","This is the first American film I have seen at this year and I think it will be the greatest one because of the feeling . As a teenage singer in America,Aaron is not as pop as before,most Americans I met said his song is fake and that he even didn't know how to rap.But attention,everyone,he is a kid,how many people can understand him.Being a pop fan is difficult,and being a pop star is more difficult.I think this time Aaron(JD) has shows something real to us.And I think people should learn to understand each other. At another hand,I like the music in the film very much.I remember the first song appeared in the film is \"Saturday Night\" and it also include some Aaron's real live show,And the second one is \"One Better\",so I think if you enjoy this film,maybe you'll be a pop fan,too. At last,I hope you will have a great time^^ A voice from a Chinese boy."],"review-user":["gavin_andrews","thornstar18","melon_wawa","mlchastings","fefeisgreat","MartinHafer","rickygabble","lizyordy","sfwalaboo","chrissyj84","cloverlanderc","deemac1979","martirez","vip-danii","softballchick009230","dvlbab3","taz_tw_88","h_arriet","a-twetman","marlene_scott","Java_Joe","dani_baba","lamanme","nickburrell69","DanCarter"],"review-date":["8 August 2006","17 February 2007","6 October 2006","31 January 2008","9 July 2006","4 March 2010","18 November 2005","16 February 2008","31 December 2005","25 October 2009","14 May 2015","6 December 2010","18 November 2005","11 April 2013","17 November 2005","7 March 2006","5 February 2006","22 January 2013","13 January 2013","10 January 2010","8 July 2018","2 January 2007","16 January 2006","12 May 2008","24 January 2006"],"review-rating":["1","1","1","1","4","3","10","10","9","1","8","9","1","10","10","7","1","1","1","1","8","9","10","10"],"review-title":[" My take.\n"," A plot that makes no sense...\n"," Uhh... LAME-O!!\n"," Made me want to weep.....\n"," Not quite Popstar material\n"," Just 21 more votes....\n"," highly recommend this to all young teens\n"," This movie traps my soul\n"," Hilarious!\n"," Why all the haters?\n"," This is what modern culture has come to.\n"," PopStar movie\n"," A famous pop star must attend regular high school.\n"," What The F*** Did I Just Watch??\n"," great movie\n"," i liked it a lot\n"," Popstar is awesome!!\n"," One of the worst movies I have ever seen\n"," Completely and utterly uninspired\n"," HORRIBLE, only for Tweeny-Boppers who are in love with Aaron Carter\n"," What were you expecting?\n"," Great Movie\n"," My opinion\n"," Much better than expected!!!!\n"," It's worth to seeing the film.\n"]}