{"review-url":["http://www.imdb.com/title/tt0472582/reviews"],"review-text":["At 2:37pm in a bathroom at an Adelaide highschool a student takes their own life and the different worlds of six teenagers are changed forever.2:37 is a brutal, honest and breathtaking film centered on the pain of being a teenager. The film follows one day in the lives of six teenagers, all intertwined, all dealing with their own personal dramas. While there are a couple of stereotypes in the mix  the beautiful would-be popular girl dealing with body issues, the over-achiever obsessed with his grades, there are several horrors that are as far from main-stream as you can get, including a social outcast dealing with a brutal illness and a young girl trying to make sense of a devastating event in her past.The movie is mixed with documentary-style interviews from the characters, which some viewers may find a little out of place in the otherwise seamless narrative. The pace is also a little slow, but it fits with the feel of the movie. The young Australian actors are all stars in their own right, in particular Theresa Palmer who's heartbreaking performance earned her an AFI nomination.The film is very well shot, with terrific direction. Some scenes are a little hard to watch  in particular the five-minute-long suicide scene, but overall it is a film that leaves a big impact on its' viewers. It draws you in right from it's shocking opening scene and keeps you guessing as to which of the six main characters is going to be the one to end up in the bathroom. Ultimately, it's a beautiful made, but slightly disturbing look at teenage life.","Well... What to say.I think i shall start with a confession. I have cried 4 times in my life. once when my dad died, twice due to a girlfriend in high school, and at the end of this film. This film deals with the real confronting issues of 6 school kids, forcing them quite uncomfortably into the open for all the world to see. i have never seen a film that deals with the human emotional condition as well as this. everything from incest to incontinence is covered here and i doubt there are many people who are safe from the sting of familiarity with at least a couple of scenes.It starts off with a suicide. at 2:37pm. then without letting you know who it was that died, the story begins to be told from the start of the day. it follows the lives of 6 school kids up until 2:37pm. it interchangeably, and edited with personal interviews of the 6 teenagers, lets you know everything about their lives. their loves, hates, dreams, desires, secrets, shame, false confidence, self loathing, corruption and arrogance. the overall outcome of which is a sort of \"whodunnit\" trying to discover the identity of the suicidal before it is revealed at the end of the film. without spoiling anything i must let you know. do not feel cheated by the ending. it contains a very important lesson.And now a warning. this film is definitely NOT for the faint hearted. Many people actually walked out of the cinema half way through when i saw it. Disgusted by some of it's content. Or perhaps it's that it's sometimes hard to face the cold hard truth of reality. This is what high school is like for many people. i'm sure most would agree.","I think this film has to be one of the most moving, and heartbreaking films of recent times.The film basically starts off with a suicide in a school toilet. U don't see who it is, then from there it goes to the beginning of the day, and we get to know 6 characters, and they are going through some pretty heavy things, anyway eventually one of them will commit suicide.I've been teaching Physical Education in schools for 8 years now, and never in a film have I seen such an accurate portrayal of what 'really' goes on in school life.The film is shot beautifully, and sounds incredible.The ending is so shocking, and so what one would not expect, it is something that will haunt me for days to come. This is Definitely one to watch.I think the fact that the Director/Writer was in school only a few years ago is a major contributing factor to the raw honesty expressed in the film. The film is shot in two separate 'modes' if you will. Firstly there is the smooth observation style where we get to know the characters in their school environment as they go through their drama, but the stunning part of the film is in the interview sections, where we get to know the characters back stories, and their deepest, darkest thoughts.You keep wondering, who is it going to be (who commits suicide) and as the drama unfolds you keep changing your mind, until bam, it hits you in the face in the final five minutes. I am all over the place in my writing, but I've just seen it at a Media screening in Australia, and I am still in a bit of shock. It's one of the best Australian Films I have seen in recent years.","It was riveting. I just could not look away. As the movie rolled on I started to feel that it was powerful and confronting, but i had no idea how much more intense it would get. The movie gives an insight into what unfortunately is everyday life for a lot of school kids. Some of us live outside that environment and would walk by and not know what is happening.Parents need to see this film in particular, just to see a glimpse of what their kids go through. Often parent dismiss their kids problems as trivial, but unfortunately to a high schooler they are massive. And unfortunately the problems can escalate into a tragedy.Definitively a must see for all.","This movie really touched me. Above being \"the exact thing in teenagers generally troubled times\" it goes one step beyond by showing detailed description of the characters in a rather pleasant and unexpected way. There is one part that I really liked about this movie. The mix of perspectives, that the unconventional characters show, is in my opinion the best segment in any teenage-related movie, I have ever seen. Makes me think back and realize that my teenage isn't as bright as expected of my common honesty, kindness, but seeing this movie made me realize a lot of other things, which would never occur to me, if I hadn't seen it. I recommend this movie to everyone, it really dazzled me, and sent my heart beat way up!I'm still shaking!","2:37 succeeds admirably at showing us what Australian teenagers feel and don't say. These are the stories of real kids and I think we would be naive to think otherwise. The only new thing 2:37 really brings us is an Australian point of view. We often watch troubled American children but often fail to link the same problems to our own teens. Executed with clever and artful cinematography, I did however (upon immediate recognition of the disappointing final song) find the musical direction lacking in sophistication. I applaud the fabulous casting of this film. These are regular looking Aussie kids who invite plenty of sympathy because of this. Great performances all round and you can't top Gary Sweet, this film made me remember why sometimes high school sucked and unless you're squeamish, or you like to leave with warm and fuzzies, go and see 2:37.","I had the pleasure of witnessing this brilliant film at a preview screening in Sydney. Although it was a pleasure to see it. Pleasure is not the emotion you are left with as the credits roll.2:37 is a film that tackles not just one stigma felt by young individuals but all of them. Chief of which is isolation. It is not just to place the films final galvanising scene on a pedestal above the others, but rather it is important to see it as the culmination. And from that, it is important to realise what it represents to both you as the viewer and to the people directly effected by it.2:37 is not a soft picture but the manner in which Mr Thalluri handles it's subject matter with a profound dignity and it's no holds barred approach acts as credit to it's message.I do not believe films such as 2:37 should be scaled by votes of favour. Rather it should be recommended to those looking for purpose in their viewing.A brilliantly crafted portrait of innocence lost. And a master stroke for a as of yet untaped talent.Not to be missed.","Three parts Gus van Sant's 'Elephant' to one part Gregg Araki's 'Totally F***ed Up', the debut feature from 19 year old director Murali K Thalluri - which replaces a high school massacre with suicide - is a film so derivative that it borders on plagiarism.This re-creation of Van Sant's 'an ordinary high school day - except that it's not' opened this year's 55th Melbourne International Film Festival to a largely underwhelmed audience.Key elements such as tracking shots, temporal displacement, soundtrack and cinematography were copied almost verbatim from Van Sant's film.Awkward dialogue and pacing, coupled with inconsistent performances from the amateur cast, ensured that the majority of the film's plot 'twists' were telegraphed to viewers far too soon.While the inexperienced young director deserves kudos for financing his debut feature totally independently, the only merit in this earnest, awkward and unoriginal film lies in the fact that it was made at all.","I caught 2:37 at the AFI Fest in Los Angeles. It's a very well shot first film (though the DV format begins to show itself in outside scenes), and I'm sure it has good intentions of showing us the \"dark side\" of high school - in other words every side of high school. But the filmmaker doesn't have the talent to write or direct up to the premise's promise. There are several characters, but none of them are any more than what the plot requires them to be. There's no depth to these caricatures beyond the machinations of \"I am troubled teen X, I have Y problem.\" The perceived roles of men and women in this story are phenomenally troublesome.Let's start with the men. You have the stoner kid who's gay, the jock who's also gay, the boy who rapes his sister, and Mr. Peepants. As the stereotype requires, all gay men must be sexually unfulfilled and violent toward women and themselves. Naturally (or unnaturally as the stereotype assumes), the two gay male characters beat up women, Peepants, and themselves. I'd be perfectly fine with these characterizations if the stereotypes were turned on their heads, or if the characters somehow transcended them. Yet neither took place, and that's all there is to these characters' stories.Next, the ladies. One young woman wants to be a bulimic housewife, another is the pregnant rapee of the sister-raping brother, and there's the girl who kills herself (I'll get to that later). Again, I don't think there's a requirement of political correctness for filmmakers (I'd be out of a job were that the case), but I do think that it's only justified if there's more to that character or story. If that archetype were being used to reveal something about character other than \"I'm a teenager and life sucks,\" I'd be happy as a clam. But nothing new is revealed! Nothing is subverted, or changed, or sublimated.Finally, the girl who kills herself. This is blunt and HIGHLY sloppy storytelling. We're supposed to sit through 5 minutes of a girl violently killing herself who we've seen for maybe 30 seconds through the whole film? We've followed all these other stories for an hour and a half, and now we're invited to torture ourselves for a character that isn't part of the story? It's cheap, exploitative, and sloppy. Despite the millions of crappy indie films that came before this, you have to EARN something like that. You can't simply purchase it on credit. So this suicide happens, we get wrap-ups from the characters that go similarly nowhere but down, and the film ends. What have I learned? I already knew high school sucked - been there, done that. I already knew people have stereotypical views of gay men and young women. I already knew that kids with disabilities are mocked.What else is there, then? Smoke, mirrors, and some really nice views of leaves. Oh, and the nastiest deus ex machina I've seen in a while.","I saw this movie tonight in a preview showing and it was fantastic. It does well in portraying issues that the average High School student is subjected to. I left the movie feeling stunned and saddened and yet grateful that this movie will have a chance to raise awareness through its audiences regarding these issues (bullying, rape, suicide and depression).Its a Fantastic Aussie Film.Go see it.Support it.Learn from it.","after watch more than 4000 movies, this one caught my attention.after Reading the plot, i had a minimum of curiosity.10 minutes after the beginning there was some movements from the movie, that caught my attention until the end. this is because i normally see only half of a movie, and than the other half the next day.off course, along the movie you star wondering to whom is going to happen.when the film is going towards the end, the twists begin.that's when you pay even more attention, and watch an unpredictable end.for me, the movie is wheel written, and very well shot.good directing, good characters. the characters even show almost all type of students in high school.8/10","It is fascinating how this title manages to slip by the average viewer as something new and groundbreaking (quoting some of the comments). Murali K. Thalluri must have thought by himself: \"Oh, great! Elephant ... What a fantastic movie! I'll try hard to do exactly the same movie and see if anyone notices!\", sadly enough, he even failed with his outrageous idea. The movie turns out a complete failure. Considering that it tries hard to catch the brilliance of Gus Van Sants \"Elephant\", it makes it look even more ridiculous - a most embarrassing faux pas for a film director.The movie starts off with the suicide of a student in the schools bathroom. This scene, already, shows the awkward acting skills of each one involved in this scene. You don't buy a single word they say. In carries on, interrupted by short interview-styled bits of the kids who \"live on their marry lives\" with each bit rather distressing in its plain stupidity on the basis of each worthless monologue. Thalluri means to introduce the characters this way, to give a kind of fast-as-junk-food insight look into their hearts ... and fails once again. Not five minutes later, Thalluri ultimately screams at the audience \"Yes, people! I stole this movie and for some curious reason, I am proud of it!\" by taking Gus Van Sants most unmistakable narrative style from \"Elephant\": He shot scenes twice to let the viewer follow each character involved in a scene on his particular way and role in a school situation. Hm, doesn't this seem awfully familiar? To me, this certain level of very forgiving tolerance had been infringed right there to a point at which I couldn't stand this dreadful movie any more. Shame on you, Murali K. Thalluri, I say! I am especially surprised that \"2:37\" has reached the official selections in Cannes as of 2006, whereas everyone must have certainly remembered \"Elephant\" (2003) at the very same Film Festival just a few years ago! So, how in the name of the lord did this most disgraceful rip-off end up being shown there? I find myself absolutely puzzled by this mistake.Directors like Thalluri use the ignorance of audiences who aren't (and cannot completely be) aware of every independent film out there. As Elephant has little to do with mainstream cinema (although it is without a doubt a masterpiece), few people notice that the story as told in \"2:37\" had been told before! How that is possible at a Film Festival of such importance as attributed to Cannes, I cannot say. It is sad and shameful that such things are passed on and hardly anyone sees the true fraud in it.2:37 is by all means solely commercial, worthless as an independent film and (on a certain level) rather a phoney parody of its obvious idol, \"Elephant\".","I'm sure some people will enjoy it, and find it powerful, or have some sort of personal connection with the characters and story, but from an unbiased stand point, it's not very well done. The film revolves around atypical angst-ridden teenagers, each one playing out a different stereotype making us believe this is what it's like to be a teenager. We get to see a bit of each teenager's lifestyle, but the entire project just came off as pretentious to me, whether it be the constant low angle shots of tree branches in the wind, or the black and white \"interviews\" with the students, there was nothing new or original showcased in this movie, and nothing I needed to see. Yes, it deals with some strong subject material, and the dramatic scenes are played and acted well, but the entire project seems unnecessary, especially when it seems almost an exact replica to Van Sant's \"Elephant\" (one dealing with suicide, the other with a school shooting). As I said, some people will probably enjoy this, and the director/writer clearly had some sort of inspiration to make this movie based on the death of a close one, so it's nice the movie was made with some heart in it, but I feel it's incredibly ineffective, and when dealing with material that can be so easily clichéd to do something original with it. I would not recommend this movie.","I truly hate and despise this film and the filmmakers behind it.Sure, I'm all for making a hard hitting and honest film about youth and youth culture.1987's \"River's Edge\" is an excellent example of a well-made teen drama. However, what I take exception to is the infantile, grubby and sensationalist approach that the makers of \"2:37\" took.A prime example is how it raises so many issues and yet fails in any significant way to comment or reach a resolution on even one of them.My other major problem with this film, apart from its complete plagiarism of Gus Van Sant's \"Elephant\" (surprised Van Sant didn't sue) is its 'bull loose in a china shop' attitude to quite delicate issues such as incest and particularly suicide.In short, avoid this film like the plague and anything that this filmmaker ever is involved with subsequently. I've heard that his motivation for making \"2:37\" may or may not be based on lies. Having seen the substandard result, this doesn't surprise me in the slightest. This is a glorified student film exercise that has no place whatsoever being in a cinema or on DVD. Pure and simple.","I couldn't relate to this film. I'm surprised that people are lauding it for being so 'realistic'. How many people at your school were victim to incest? How many closet homosexual jocks were there? How many quiet people that you never noticed committed suicide? Hmmm. OK you wouldn't know even if their were. But really these are explosive problems which many us never deal with. And yet there are so many teenagers with subtle problems which could have been explored. But hey, where's the 'entertainment' in that?With regards to the girl who committed suicide - I found this to be exploitative. I actually think MANY people in High School at some stage feel invisible, ignored and unwanted. But what possesses someone to violently commit suicide on just another day of being ignored and unnoticed? The filmmaker decided this girl would suicide to make the film more provocative. And the graphic nature of the suicide to make it even more provocative. I didn't buy it as a real life scenario.And the problems of the other students I didn't fully relate to. Bullying is explored but that's been done to death, we all know it goes on and it truly is a matter of resolve within that person. Closet homosexuality? Pfft, another cliché gets rolled out. Thats the thing really, too many clichés. I guessed the ending at the start. There was a predictable unpredictability if that makes sense. You've got all these characters with explosive problems, and one with apparently none. And I thought, what is the point of this character unless she's the unsuspecting suicide victim? And surely enough..One thing I will say, and it is the saving grace of the film, is that it does NOT glamourise suicide. The suicide is very graphic and heart-breaking to watch. It is a powerful scene (regardless of how contrived it is)and one that dismisses suicide as the easy option. But the film is really not very imaginative and used stereotypes.Not bad but certainly not groundbreaking OR worthy of a 17-minute standing ovation at Cannes???","There is nothing original,humane or insightful in this film. The acting is average, images are amateurish, the writing lacks subtlety and the scenes are very basic...something close to a soap.In 2:37,a suicide is used to turn the film into a suspense drama. We watch, partly, because we want to know who dies. The various characters each have a problem, and the film shows how bad each problem is for them, but only as a way to get them each to a place where you think they might kill themselves. Despite the different points of view offered by the camera on the key events, there is NEVER another way of seeing the events themselves. So in 2:37, the arseholes are arseholes, the angels are angels. This is simple stuff.Without this complexity, the film emerges as a voyeuristic tale of youth sex and violence. You hardly get to know the kids as much as the breasts, bodies and limps that the filmmaker passes off as characterisation.In the end, if you know ANYTHING about film in the last 5 years, 2:37 is just an immature rip off of Elephant - not a meditation, not a progression. Yet while the filmmaker and distributor use the alleged suicide of a friend at every chance to give the film some legitimacy, they never talk about Gus Van Sant or Elephant. The positive posts on IMDb curiously avoid any mention of this, or simply don't value originality. If you do want something with heart and voice - avoid this piece of youth exploitation. I was surprised by the filmmakers age when I found out after seeing this film - I had assumed a 13 year old had made it. The Twenty Somethings I've always known are too busy trying to express something real in them to lift the work of an old man.","\"No man is an island\" wrote John Donne in a poem. And, certainly, to think of the human being as an isolated creature makes little sense. We are, after all, social animals. We need others, and we need them desperately. Thalluri's film deals with the intensity of high school and the need of the other, presenting a handful of characters that coexist in the same place. We cannot say they are friends, they barely know each other, each of them carries a burden so heavy that they become estranged, alone, and that's when the fear of losing one's own humanity is ignited.We have the case of Marcus and Melody: brother and sister. They come from a wealthy family, well structured around male hegemony. Their father is very much alike the primordial father from a tribe that Fred describes in Totem and Taboo. This primordial father can have carnal knowledge with his offspring, because in these mythical prehistoric time no such thing as incest exists; however, the jealous sons will savagely kill the father, this powerful alpha male (a figure that bears some resemblance with Lacan's inverted E, which symbolized \"the one man not castrated\"). By killing the totem-father only taboo remains, and thus incest becomes the ultimate sin. When Marcus witnesses his father having sex he attributes this attitude as a total disregard for moral codes, after all, Marcus seems to imply that his father acts in such a way that he has no choice but to witness the coitus. This traumatic event triggers something deep inside his consciousness and as a result the incest fantasy and the rape fantasy will become firmly inserted in his psyche.The first scene with Luke, the high school jock, is most revealing, as we see him in his bedroom, in front of his computer, stroking his penis most vigorously. What images appear in the computer screen? Luke is struggling with his own sexuality, he is in a place that Lacan would denominate 'minus phi' which is the inscription of a point of fracture in the imaginary, that indicates a certain fissure that affects the constitution of the libidinal object in which one's own image finds support.\"Uneven\" Steven is a kid that suffers of genetic malformations, not only does he have one leg longer than the other, but he also has a condition that makes him lose control of his sphincters, and as a result he wets himself in class, becoming the target for everyone's cruel jokes.Then there is Sean, a boy that openly assumes his homosexuality and pays the price for it, being constantly mocked by Luke's friends and other guys in school. The only way for him to cope with this is escaping into a world of stupor produced by his marijuana consumption.Finally there are two girls that play a very relevant role in this film, that owes much to Gus Van Sant's (listed in the credits) realistic and insightful approach of adolescence: Sarah, Luke's girlfriend, makes the mistake of caring too much for her boyfriend, and consequently once she begins to have doubts about her future with him, everything falls apart. Kelly, on the other hand, is perhaps the nicest person in school. She seems to genuinely try to help everyone, she is kind with boys and girls, instead of creating problems she tries to find a solution for them. When everyone attacks Steven she makes sure he's going to be OK.However, all of them suffer from teenage angst. But this is not the typical, cliché angst. Lacanian psychoanalysts might ask why despite all the amount of scientific knowledge that has been accumulated, and the efforts to establish theories that presuppose to grant us reassurance (Levis Straus structuralism and Hegel historicism that aims towards the acquisition of the Absolute Knowledge, in other words a conceptualization that implies a theory without remainders) we still experience restlessness? Lacan asked himself \"why is it that we so much want to preserve the dimension of anxiety?\". Anxiety is a horrible thing and yet is there a human need to preserve it? In this regard Kierkegaard may be closer to the question of angst when he speaks about the psychological ambiguity concerning this concept \"Anxiety is a sympathetic antipathy and an antipathetic sympathy\". Arguably, the existence of angst points out to something that cannot be reduced to a rational category, and without which a truly reflection on the question of ethics is useless. We find this sympathetic antipathy in characters like Marcus, who has a strong relationship with his sister and at the same time despises her. The antipathetic sympathy is present in Kelly, the sweetest girl that treats everyone kindly but that secretly feels alienated, incapable of anything but antipathy for herself.However they are all connected, and what they do will affect the lives of the others. What happens then when during the first minutes of the film someone commits suicide? Life is a tricky business, that's for sure. But life as teenagers can be even trickier.","This would have some merit if it wasn't a carbon copy of Gus Van Sant's Elephant. From the use of classical music to the long tracking shots to shots occasional cutting to shots of tree leaves (Van Sant does this also but uses clouds for the cutaways). Furthermore, the rape scene and the \"twist\" behind it is simply there to be controversial and shock audiences. It's intentions (these aforementioned devices) are so transparent that it fails dysmally.The events leading up to the suicide are so melodramatic and exaggerated and completely lack any subtlety that they'd be better suited to an episode of Home and Away.The fact that the story plays out more like a whodunnit thriller ends up undermining the whole point of the film. It's so caught up in it's own supposed cleverness that the viewer would almost feel cheated if they weren't treated to a suicide at the end.What does the film say about suicide that we don't already know? It presents us with stock standard teenage problems without any new insight.The acting is the only redeemable aspect of the film.","This movie made me think....of how I could write something about it without personally dissing the director and all the actors, who, as an Australian, I am proud of for actually getting out there and making a film.But the movie itself? Let me tell you a story....Found this DVD in my local rental shop yesterday and had vague recollections of the reviews at the time of cinema release here, so I thought I would give it a go.For some reason, I decided to watch the 'special features' before I watched the actual movie, not something that I usually do. Turned the 'making of' off halfway through, as I'd had enough cringing at the 'aren't we so wonderful for putting together such a hard hitting film with such a raw script' attitude.The movie? Ugh. Full of clichés and pathetic character development. The actors? Well done guys, you are Aussies and I applaud you. And, just like a footy team is only as good as the coach that directs them, you unfortunately did NOT have a great script to work with.I felt that the movie actually trivialised so many of the subjects that it seemed to want to cover. I have seen many reviews here that refer to it as nothing more than a soap. Agreed.Finally (and forgive me if I don't phrase this correctly), I was extremely disappointed that there were no optimistic overtones at all. Yes, we all know that life is full of hard stuff, and yes we know that things such as incest DO occur, but I really find it hard to applaud a movie that has not one piece of joy in it. I believe that a director has a responsibility to put it in there SOMEWHERE. Otherwise, the movie is all about THEM and THEIR feelings, they have created it for themselves, not for an audience.Which I think is the basis of why this movie isn't so great. The special features mention that the director wrote the screenplay in a 36 hour sitting, the day after he himself tried to end his own life. Well, it may have been cathartic for him to do this, however the movie reeks of self-indulgence when you know the story behind why it was written. \"I feel horrid, I'm going to write a movie about feeling horrid\". (Note: I have read the interview with Andrew Urban, and understand WHY Thalluri needed to write something to help him through his own issues, but I believe there is a line in film that cannot be crossed - the line of making a movie purely for your own emotional needs, and I feel that this is what has unintentionally happened here)By his own admission, the director had no technical experience at all, and sadly, this makes the movie come off looking like nothing more than a year twelve media project.As for any recommendations that this movie should be studied at school, or that all teenagers should watch it - not sure there either. Because there is a VERY dangerous line at the end. I too have been in a place where I have thought that someone who no longer has to 'face life' is 'lucky', but as an adult, I do worry that this line could be influential on a young viewer that was in a vulnerable frame of mind. Might be in there to promote discussion, but again, it reflects no possibility of redemption or joy in this story as a whole. In fact, it almost indicates that there is more sadness to come.I haven't seen Elephant, but I just might go find it, given all the comparisons here.Nothing personal here guys, I do hope you can make another movie someday, and we all have to start out somewhere, so forgive me if I've been too harsh. I am glad that you are proud of what you created, which in the end is what life is all about. It's not a movie I would recommend though.Oh, I DID like the way the time-frames often collided, thought that was an interesting way to film. But the whole \"Its the quiet ones you have to watch\" - we already know that.","I saw 2:37 at the Toronto International Film Festival in September and was blown away by it! A scene of panic opens this film, at 2:37 pm set in an Adelaide high school. This scene is left unresolved as we revert to the beginning of the day, and are introduced to the teenagers getting ready to go to school. The audience becomes intimate with each of the main characters, and explores the day-to-day issues facing teenagers - including drugs, promiscuity, being gay, bullying and violence. Each scene is played again and again from different teens' perspectives, and is reminiscent of Gus Van Sant's Elephant. This is a remarkable film by first-time director Murali K. Thalluri. It was made with non-professional student actors, and work-shopped through an unprecedented 76 drafts of a script. It features stunning performances by a number of the student actors, particularly Teresa Palmer in the role of Melody. This coming-of-age film is both intimate and thought-provoking with a surprising and disturbing ending.","Honestly, Mr. Thalluri.... if you do a drama movie in a high-school setting following a bunch of teenagers through a school day and if you mess up the time-frame and jump back and forth... if you do that, you can't use the exact same visual story telling device of \"Elephant\" which is using a camera that is passing of from one character to the next and having scenes shown 3 times from different angles. You just can't do that because this is such a blunt rip off its hard to believe anyone gave this more than a 5 rating.Where \"Elephant\" (which was released 3 years prior to this movie) uses school shootings (or to be exact the Columbine shooting) as the focal point for its script 2:37 uses teen suicide and seeing the reviews the shock value of that subject worked. Its the same slow story telling, a lot of dramatic piano music all leading to a finale you know from the beginning. At least the characters look like they tried hard to be somewhat different in that department. So you got a untypical gay guy who looks acts like a stoner/skater, a hunky lover-boy who can't deal with his gay side, brother and sister from a rich family who both got their very own problems and here comes the nose dive. You also get a spoiled bulimic chick and one of the most ridiculous characters ever... a guy with medical conditions who wets his pants because of \"2 urethra syndrome\" who actually never heard of the invention of diapers but rather pisses his pants in the classroom and then change into new clothes and does so EVERY DAY! WOW, as hard as this movie tries to be realistic this is the most absurd thing I have ever heard. He gets beaten up on the toilet and is obviously ashamed of it but doesn't wipe the blood of his nose when going through the whole school with wet pants and a bleeding nose. Thats new-age realism directly leading to \"the twist\" and final character who turns out to be the suicide victim...After watching the \"very realistic\" life of teenagers (one day including, incest-rape, teen pregnancy, bulimia, parental pressure for grades and appearance and the gay subject mentioned before, kind of like your \"very realistic\" daily soap... trying hard to be) we watch a girl die we met once in the beginning of this movie and who has no reason but that the guy she had a crush on left the room when she was talking to him (in a thoughtful piano playing sequence BTW, seen that somewhere before??). And it gets even better... before slitting her wrist in a painful long scene of \"Yes\" and \"No\" she asks 2-urethra-guy if he is OK, constantly smiling and then she cuts her wrist with scissors in a school toilet. Now you got a movie that is a total rip-off of Elephant, fails with some really sloppy story telling (the whole rape-incest thing was pretty unbelievable too by the way) and people call this a shocker.What the heck is going on?? Is all it takes to take some pseudo-dramatic music, boring story telling and adding a shock subject on top and people think there is a major deep message here?? I think Elephant is way overrated already but that movie was the original while this here is an obvious rip-off failing on many more levels. I have never ever seen a more brazen stealing of a whole movie concept in my life... and believe me I watched a hundred of horror movies so I know how low you can go there. This is a total let down in all departments... its nor realistic, its stolen, its damn slow and by all means I wonder whats more useless... another romantic suicide (many give this point to the movie which makes me wonder if they only watch Romeo+Juliet all day long because there is dozens of movies which deal with the subject in a clear non-romantic and MORE REALISTIC way) or this ridiculous set up... Come on! I am still trying to work out if 2-urethra-guy or the suicide itself is more unrealistic and ridiculous.","At 2:37, a high school student commits suicide. Not shown who has taken their lives or reasons known, time skips back to the start of the day. From here we follow six separate students; Marcus, Melody, Luke, Steven, Sarah and Sean. Each student is struggling with their own moral dilemmas, all reaching boiling point, hitting to an end for one.After losing a friend to suicide, and surviving his own suicide attempt, writer/director Murali K. Thalluri has created a revetting drama focusing on teen life and the horrible act of suicide. Suicide has been a topic that has been kept in the shadows, 2:37 is Thalluri's attempt to bring it to light. If you have been touched by the act of suicide or anyone who has, 2:37 becomes all the harder to view.With heavy and hard subject matter, Thalluri also tackles everyday teenage life crisis's. Sex, pregnancy, sexual identity, bullying, friendship, Thalluri manages and shows them in an extremely realistic manner. The factor on Thalluri's talent is his subtlety. He respect his subject and the problems that everyone will have suffered through at sometime. It verges near documentary at times, it has such a painful realism; the interviews with each character spliced through the film only heightens this.2:37 has a distinctive similarity to Gus Van Sants film Elephant. While the core of each film is different, both tackle teen life. Like Sant, Thalluri utilizes long tracking shots, with time skipping back and forth, to show each characters interaction from different perspectives. A defining point to Elephant was its ethereal ambiance. With spare conversation, little development of characters, and the long tracking shots, Sant created a haunting and mesmerizing atmosphere to a coming dread. While there resides this dread in 2:37, the emotional connection to the characters reaches a higher level Sant couldn't reach. As time goes by, each characters fragility creeps out, dragging you along their emotional roller-coaster.The real hit in this film comes with the inevitable suicide, foretold at the very beginning. The hard part about this scene is the complete intrusion and discomfort we have as an audience watching someones life end in a gruesome fashion. Though many films that have shown suicide, gloss over the act or romanticizes the act. Thalluri shows the pain and agony involved with this act and that its not the best solution. With unknowns in the leads and their first major roles; Teresa Palmereach, Frank Sweet, Joel Mackenzie, Marni Spillane, Charles Baird and Sam Harris all show immense talent and promising acting careers.Compelling and revetting, 2:37 is an absolutely unmissable film.","I don't understand what is hard hitting about this movie! I don't understand why high school kids should watch this! I don't understand why this should have made me think about anything in the slightest!*Spoiler*When the un-noticed girl is on her way to commit suicide, was I the only person cheering her on? The cliché'd classical music, long tracking shots, melancholy emotion of the film by that stage had me in reversal to what was intended. I would have only been happy if she walked into the room and the entire cast was in there with her holding scissors to slit their wrists up. Why?Cause I went to high school.... and frankly im sick to death of seeing movie after movie in Australia with teenagers in it being solely based on terrible clichés. I've been waiting ages for a younger person to write a movie that im able to relate to and this stereotype driven piece of emo garbage is what I got instead. It was like a dark version of heartbreak high that needed a predictable ending. Why are all teenagers in Aussie dramas depressed or have really weird problems that just aren't plausibly told? On the plus side, this was funnier then 'Blurred'. And I needed a good laugh.","All those that identify this as a simple rip-off of 'Elephant' - are there no other comments that you can make towards the movie on its own merits as an individual film (regardless of its apparent similarities to other movies).All those that question the validity of the movie - in terms of its stereotypical characters (the obligatory gay, the jock, the disabled kid, etc) - I'm not sure how long it has been since you were at school - but regardless of how amateurish the acting may be - the happenings that go one are surprisingly close to what may actually happen.And all those that disregard the film as being so simple: just six teenagers with the regular teenage angst that pushes one over the edge... did anyone stop to think, and take notice that the girl who took her life wasn't actually one of those six!! As one comment points out - she had screen time of maybe 2min max (excluding the final scenes). I think the point of the film is not only to make an issue of teenage angst, and how far it can take someone - but also that it is no apparently obvious who is always in danger of committing such an act (suicide)...","This film is so copy-cat, cliché-ridden, clumsy, and laboured, I find it astounding that anyone could not feel cheated by the experience of sitting through it. Here is the range of idiotic clichés, ridiculous psychologising, and simply unfeasible storytelling in this \"hard hitting\" representation of high school: The tough guy jock is really a homosexual. The A-student is unhappy because his father pushes him and somehow this causes him to commit incest. A teacher is mean to a student who wets his pants in class. A girl who is going out with the above-mentioned jock is really in love with him and \"just wants a family\".Maybe the only saving grace is the student counsellor scenes which are vaguely interesting, but most of the devices in this film are so leaden that it beggars belief. This film shows me no insight into teenagers and I will not be surprised when it bombs, especially with teenagers. The people who like this film seem to be parents worried about their teenagers, and boy are they barking up the wrong tree if they think this film will help with \"understanding\" teen issues. I mean, what is the moral of this film? \"Hey guys, let's all look out for each other and hug each other\" GIVE ME A BREAK. Anyone who thinks you can get through to a 14 year old with that kind of message needs to think back. In the 1980s we were watching Kentucky Fried Movie, Xtro, Porky's, Evil Dead, Terminator, etc. This film will fall on deaf ears. 2:37 is right up there with another Australian \"indepedent\" film, 'One Perfect Day,' which was as bad as this utter turkey of a film. Thank god no taxpayers money was spent on this boloney.AVOID!!!!"],"review-user":["Izzy_Duquette","john_keats","movieman2121","jolbromski","ml_kitarist","ndiva","mbilbetaylor","burntime-1","sethrp-1","sbayley84","joaosamarques","PaulFranklyn","DanielKurland","kentuckyfriedpanda42","shermanlazzar","YouamI","atlantis2006","snia0003","janeane-baker","tonyw-21","dschmeding","nobbytatoes","Mader45","ben_dalton","useranon99"],"review-date":["7 September 2008","19 August 2006","26 June 2006","22 August 2006","1 February 2007","23 August 2006","7 August 2006","26 July 2006","11 November 2006","10 August 2006","25 October 2016","26 April 2008","27 March 2007","22 August 2007","5 December 2007","19 August 2006","31 March 2011","19 August 2006","17 November 2007","1 December 2006","22 February 2009","23 August 2006","22 January 2008","7 February 2007","20 August 2006"],"review-rating":["9","9","10","10","8","10","2","10","8","1","4","1","4","1","1","3","9","2","9","2","8","1"],"review-title":[" Beautiful Yet Disturbing\n"," Not for the faint hearted. it's difficult to tell who will love this film and who will find it thoroughly abhorred\n"," Moving/Heartbreaking/Honest Film\n"," Must see for anyone in high school or with kids in school.\n"," It changed my perspective ...\n"," frighteningly real\n"," A strong and brilliant portrayal of school life.\n"," Derivative ensemble teen drama\n"," Well shot, well intentioned, and utterly wrong headed.\n"," Very revealing and moving piece if film 10\\10\n"," despite some comments, this movie is innovating\n"," Total Rip-off (of 2003s \"Elephant\")\n"," Hardly anything new or worth seeing...\n"," Whiny, self-pitying glorified student film.\n"," Exploitative but with one saving grace\n"," All hype, no imagination - wait for the DVD\n"," Teenage angst\n"," Plagiarising +Expolitative\n"," I guess we all have to start somewhere.....\n"," 2:37 - A remarkable 1st feature film\n"," Sorry, but this movie is a total scam\n"," revetting\n"," I really don't get it......\n"," Question\n"," You've got to be kidding\n"]}