{"review-url":["http://www.imdb.com/title/tt0453494/reviews"],"review-text":["My family (two 40-somethings, an 8 year old and my 71 yr old mother) saw this at a sneak preview on April 29th. We all enjoyed the movie very much. The story was a good one, and knowing it was based on real-life events made it that much more enjoyable. Luke Wilson was a hoot (pun intended) to watch as was Tim Blake Nelson. And seeing Neil Flynn play something other than \"the mean janitor from Scrubs\" was nice. The kids in movie did well and I'm sure they will all appeal to a certain demographic on the heartthrob level. The visuals were just lovely and the Jimmy Buffet music added to the \"Florida feel\". OK, maybe the story was a little too neat and well packaged for some adults, but hey, who cares? I can't compare it to the book, I honestly hadn't heard of it until the movie came out. It was just a NICE movie and it had a good message. Plain and simple.","what a refreshing change from the PG movies that have teen girls jumping in and out of bed, young high school boys counting how many girls they can \"hook up\" with, kids drinking, doing drugs, etc., etc., etc. Carl Hiaasen has written so many books that are enjoyable but hardly classic literature. but he has finally written something that Middle School kids WANT to read. And this movie sends a message to kids that maybe they can make a difference, that maybe their voices can be heard. Filmed in South Florida, the scenery is beautiful and natural and REAL. Who cares if its predictable, and a little corny. So was FREE WILLY and look how well that did. This is a good family movie..........a rare breed.","It is great to see a film starring kids whose idea of \"acting adult\" is not engaging in sensuality. Instead, these kids see a problem in their community and take responsibility for helping to solve it. Hoot is a film aimed squarely at families looking for a fun day at the cinema. The production values are good, especially sweeping shots of Montana and Florida. The soundtrack by Jimmy Buffet is a perfect fit. The young actors are spirited and refreshing.The plot, about a trio of kids who work together to save some burrowing owls from death at the hands of an unscrupulous pancake house empire builder, will engage kids. So many films make children appear powerless, it is nice to see a movie that shows children working hard to make a difference. And even though parents are absent or temporarily distracted, it was pleasant to see kids who want to follow in their parents footsteps and try to right injustices.If you are tired of all of the self-indulgent story lines about children that fill the cinema, give Hoot a shot. Then take some time to talk to your kids about the adventure of serving others and caring about the world they live in. A positive message from a positive film.","I took a group of young people who were the same age as the protagonists and it appealed to us all. I agree with the other post, the Wilson guy worked a thankless script into a great minor character. It is good to have a movie for a certain age demographic (too old for PG, too young for R). It also shows how they think and maneuver in junior high school. You had to love how well Jimmy Buffet did as the cool teacher. He kept us adults awake. The level of kids questioning authority was kept reasonable. Their motives were specific and not like some A.D.D. rebel. The setting and music were beautiful. Overall, if you enjoyed Holes, this is really similar.","If you read the book by Carl Hiaasen, the movie follows pretty much true to form, with a few minor changes for Hollywood. In my opinion this is a great family movie. Luke Wilson (Officer Delinko)pretty well steals the show from an all-star cast that includes Robert Wagner and Jimmy Buffet. The kids in the movie do a great job led by Logan Lerman, Brie Larson, and Cody Linley.Brie Larson is maybe a little too petite to play Beatrice. I pictured a bigger girl, maybe 6 foot, 175 lbs, in the role of Beatrice. This might have made her more believable in her role of beating up Dana. They should have developed her \"tough girl\" character more, and had her bite through a tire, or kick a soccer ball through a person. She is very pretty, and I understand why she was cast, she is a box office attraction.This is about as PG as a movie gets these days, no sex, and very little violence. This movie is a parents'dream come true, a movie with a strong environmental message, with kids that have deep appreciation for the beauty of Florida and its wildlife. It shows how adults have fallen short in the stewardship of our planet, and that our children can demand better. One of my favorite lines in the movie is when Mullet Fingers says, \"Florida could use some mountains like Montana. Florida is so flat there is nothing to stop developers from clearing it coast to coast\". Also, the photography of Florida wildlife spoke volumes without dialog. As a family movie with kids ages 5-15, this is a great movie! As a bonus parents' will be entertained, especially if they're \"parrotheads\".","(Synopsis) Roy Eberhardt (Logan Lerman) is a teenager who loves living in the wide open spaces and mountains of Montana. Unfortunately for him, his father's job is forcing him to move once again, this time to a small town in Florida. As the new kid in school, Roy has the usual encounter with the school bully on the bus. While riding on the bus, Roy is also intrigued by a teenage boy who was running like the wind and passed the bus in his bare feet. The next day, Roy gets off the bus and tries to catch him, but loses him at the golf course. Roy eventually meets the boy, known as Mullet Fingers (Cody Linley). Mullet Fingers is a runaway living on an abandoned boat near the golf course and a vacant lot that is about to have a pancake house built on it. All by himself, Mullet Fingers has taken up the cause of protecting the burrow owls that are nesting on the vacant lot. If a pancake house is built on the lot, it will destroy the habitat of the burrow owls. Roy joins forces with Mullet Fingers and his sister Beatrice (Brie Larson) to save the owls.(My Comment) This is one movie the whole family can see. The story is entertaining and heart-warming for all ages. You will love the music of Jimmy Buffett that was played throughout the movie. Jimmy Buffett produced and played a small part as the marine science teacher. This is a pro-environmental film that shows what can be accomplished by three teenagers using the act of civil disobedience. The film has lots of humor, and a message of saving the environment and some beautiful cinematography of Montana and Florida. And of course, don't forget the owls. (New Line Cinema, Run time 1:30, Rated PG)(6/10)","In 'Hoot' Logan Lerman plays Roy Eberhardt, the new kid in school who has just moved from Montana. But Florida is a lot different from Montana. Despite is troubles in blending in, Roy discovers a bigger problem. A new franchise restaurant is coming to town and families of burrowing owls are in trouble. Can the new kid, a tomboy (Brie Larson) and a runaway (Cody Linley) stop big business from destroying these owls' home? This movie was pretty good. The kids (Logan Lerman, Brie Larson and Cody Linley) are the real stars of this film. Luke Wilson (Officer Delinko) is okay, but really does not have a very big part. Neither does Robert Wagner (Mayor) or Jimmy Buffett (Mr. Ryan).Nevertheless this was a fun film that the whole family will enjoy. For a first time producer, I thought Jimmy Buffett put together a quality piece of work. Plus the owls were really cute.","I took my younger niece to an early showing and she LOVED it (I enjoyed it myself as well). I don't need to explain the plot, since the movie remains completely true to the award-winning, top-selling book by famed author Carl Hiaasen. The movie takes the popular book and layers it with beautiful cinematography (I want to go to Florida now!), humor (thanks to funny-man, Luke Wilson and some new-comers), and Great music! I have to get to get a Jimmy Buffet CD now! I know a movie is good when I get goose-bumps in the end. Overall, it was great family film that I felt comfortable taking my younger niece to. I'd recommend it to any and everyone.","If you're a kid liking fairy tale \"real life\" adventures, see it. If you're a youth liking kids movies, why not see it? :) If you're a parent going to see a movie with your kids, you're WAY better of opting for the squirrel!The start of this film was a bit funny, and set some good premises for the happenings to take place. But after the kind of funny introduction of characters, settings and potential conflicts, the story turned out kinda dull. When more or less the same things happen for the third and fourth time, the word \"predictable\" repeatedly comes to mind just like parts of a dented LP or those commercials you really hate. And the culmination of the plot... *oh sigh*... poor, poor, poor!","Saw the movie today and thought it was a good effort, good messages for kids. A bit predictable. The book was better, gave more plot details, ore about the environment and how the kids uncovered the conspiracy. I think Hiassen's warped humor comes across better in the book than the movie, but there were lots of funny moments in the movie as well. It is probably a bit too slow paced for kids under 6 yrs of age. Loved the casting of Jimmy Buffet as the science teacher. And those baby owls were adorable. I wonder how they managed to film them. The movie showed a lot of Florida at it's best, made it look very appealing. Am I imagining it, or did the author Carl Hiassen make a brief appearance?","Hoot is a nice young person's film about a group of middle school kids that try and keep a pancake house chain from bulldozing a plot of land that is home to some endangered burrowing owls. The acting is pretty good and the fresh faces are nice to see. Many well known comedians are in this film and keep the humor going almost nonstop. It is a film for the young crowd, perhaps 5 to 11 years of age. I thought it was a nice change of pace from the adult films that pervade the screen these days. There is no realism here or accuracy about life in general for adults or kids. It's just a bunch of fun with a constant message about saving the beautiful places in this country from becoming over developed. If you can remember back to the day when you weren't fight for a buck you may remember that money isn't everything. Not many people over 12 are going to enjoy it unless they really have a soft spot for the old after school special series.","Poor Roy Eberhardt, teenager, his parents' jobs require them to move often, so he never gets any stability in one location. The movie begins with them in the beautiful mountainous country of Montana. What would be the exact opposite? How about Florida?? Yep, they move to Florida, the Gulf Coast area not too far from Tampa. As Roy gets to know his new environment, he meets the big bully kid on the bus, and has to break his nose to get away. Out the bus window he sees a kid about his age running very fast with no shoes. And, he somehow befriends a no-nonsense girl named Beatrice.Luke Wilson plays a hapless local cop, Officer David Delinko, but Wilson plays it with enough sympathy that we actually learn to like him. His heart is in the right place. Underrated actor Tim Blake Nelson is Curly Branitt, hired to guard a near future construction site for a new pancake house, the 100th in its chain. Manager Chuck Muckle is determined to get that feather in his cap, the 100th one.The problem is, the land set aside is also habitat for a ground dwelling owl (I don't even know if those exist, but no matter...) and building the new pancake house would be the death of them. So much of the movie is Roy, Beatrice, and Mullet Fingers doing things on the sly to prevent the dozers from beginning construction.Robert Wagner has a token appearance as Mayor Grandy. Jimmy Buffett, who was a producer, wrote some of the songs, also has a good part as teacher Mr. Ryan. I don't know Buffett, and didn't realize at first it was him, but was impressed with his natural acting manner.SPOILERS. As the teenagers begin to learn more about the construction project, they follow the paper trail. Specifically, they wonder how the environmental impact was overlooked. They found it wasn't, and the company was hiding the fact that owls were threatened. Straightening that out just in time, the location was spared and 3 teens were new best friends.","Terrible, terrible movie. Not that the thought behind it was terrible, but the execution was. Yes, kids might like it, but if a grown-up subjects him or herself to this farcical, poorly written, and pitifully acted Movie then you should be looked after in a nice nursing home in years to come.I found a few things to like..um..the kids had a common goal (chasing off the greedy profit-driven corporation..teamwork--working with a hodgepodge of folks usually outside their social caste. But let's be honest, the teenage kid who is \"neglected\" or \"misunderstood\" by his parents is pretty lame material. Then pair him up with the \"bad boy\" and cute little girl and worry about plot development later. 13 year olds breaking into government buildings, vandalizing private property and being lauded as heroes is not cool to most parents. So..the movie just stunk. Watch at your own peril.","Logan Lerman plays Roy Eberhart, the son and only child of a Justice Department official who's been transferred six times over the last ten years. And, for Roy, Cocoanut Cove, Florida, definitely doesn't seem like a case of \"saving the best-for-last.\"But, he changes his mind after meeting Beatrice \"the Bear\" (a pre-teen Amazon who plays soccer), and her eco-activist stepbrother. A barefoot speed demon nicknamed \"Mullet Fingers,\" for his manual fishing skills.The three of them team up to thwart a greedy restaurant executive, who's out to win a much-coveted promotion at the expense of some Federally-protected burrowing owls. And, the Marx Brotherly way they go about it provides many of the charming laughs for this movie.How they save the day provides a nice environmental moral to this story. Without being overly-preachy about it!In short, HOOT lives up to its name. And, one more thing. The marine biology teacher is Jimmy Buffett; the office flunkie who interrupts Muckle's argument with \"Mother Paula\" is Carl Hiaasen; and the file clerk at city hall is Kin Shriner (the director's brother from GENERAL HOSPITAL).","Hoot was terrific. The owls are adorable and the movie highlights an interesting environmental issue I didn't know existed. Florida is full of so many fun characters and the film does a great job of bringing that to the screen. My kids particularly loved all the different animals, from snakes, to owls to alligators. It's really a simple story, but also one that they need to hear at this age. When kids are young that's when they really develop their sense of values, and yes one of those must be caring for our environment and all the creatures that live in it. I think it was great that the film even sparked a conversation with them on the ride home about animals and how to help them. It was just truly sweet and enduring to hear my little girl talk about how she wanted to save the baby birds. Anyway, overall it was really a great time and I'd recommend the movie to anyone looking for something entertaining AND meaningful.","It's a kids movie. I saw it a week early. If you're over 15, you will think it's a dumb movie. It's sort of like the thinking in 1971 when \"Billy Jack\" came out. I saw it again in 1975, and thought, \"What a piece of crap.\" Anyway, it's a nice thought -- protecting the owls -- but the problem I have with the movie is that too much of it is illogical. While he is getting bullied, the main character sees another kid running barefoot. So he immediately thinks the barefoot kid is somehow connected to the vandalism that's taking place at the construction site. He immediately becomes friends with the girl, who had threatened him. She then tells her life story to him. Jimmy Buffett, as a teacher on the first day of school, is teaching a college course to a bunch of seventh-graders. A hospital begins treatment of the barefoot kid without bothering to contact his parents. A policeman just walks into a classroom without bother to contact the office. My son liked it. I didn't hate it. But I've seen better.","The composition of this film is actually not as bad as I expected it to be. The characters were one-dimensional but not unwatchable. The plot had more holes than a wedge of swiss cheese but as long as you turned your brain off it was OK. And all the characters were ridiculously photogenic in a young teen O.C. kind of way which could be good or bad depending on your tastes. So why awful rating? The message it conveys is that IT IS OK TO BREAK THE LAW IF YOU ARE TRYING TO SAVE SOME WILDLIFE!!! The main characters in the move break more laws than I care to mention in order to save some endangered owls on a piece of property. The thing that ultimately saves the owls is a environmental report that was ON THE PROPERTY IN QUESTION!(which in itself was the biggest plot hole of the film in my opinion) Now don't get me wrong, I know it was a movie, but if they were going to show these kids as eco-heroes than why didn't they show them doing their sleuthing by going down to city hall and digging through the records in a proper fashion, INSTEAD OF KIDNAPPING AND TYING UP THE FORMAN OF THE SITE AFTER BREAKING AN ENTERING ON THE PROPERTY! This movie sends a terrible message. And it's a shame because if they had changed it slightly and had the kids use legal methods instead of ECO-TERRORISM to achieve their aims this movies might have been worth something.","I must confess, I was surprised at how good this movie was when I first watched it. I had planned to see it in theaters during the summer but found out unpleasantly that it had already been and gone. Therefore, I expected it to have been removed from theaters because it was bad. Then, today, I rented it and watched it and really enjoyed it. The speed that events were occurring was questionable, it could have been a little longer. I found it was very true to the book, however it left out some crucial parts: Mullet Finger's real name, etc. I felt as if I hadn't read the book I wouldn't have really understand what was going on. The acting was quite good, another thing I had expected to be poor, however the cop, sorry I can't remember the actor's name, could have done a little better. All in all, I found this to be a very entertaining movie and would recommend it to all audiences!","Saw a pre-screen today with 6 & 9 y/o. The cop was corny - possibly worse than Barney Fife. I would not have chosen to go see this on my own, but I'm really glad I did. It was wholesome. Several scenes made me laugh. One actually made me jump out of my seat. Yes, mild violence, but so mild I probably would've rated it G. It was interesting to see Roy & Beatrice become fast-friends after their initial run-in. Some of the scenes of the untouched nature in the Everglades were beautiful. The character of Mullet-Fingers was a little unbelievable - how he could actually survive. How did he manage to leave the hospital after a few short hours on an IV antibiotic? His strength couldn't have returned yet. And then his swimming (not in a chlorinated pool, either), with his yet unhealed wound. Even so, I still highly recommend it.","I am not going to lie and say Hoot is the best family film I have seen, but I am going to say I actually rather liked it. True, the pacing is a little too slow at times, the story perhaps a little predictable and some of the characters are rather clichéd particularly the bully. However, Hoot is beautifully photographed with lovely scenery and the cinematography was very nice. The soundtrack was a pleasant touch and had a somewhat nostalgic feel to it, while the dialogue is humorous and has some sweet parts too, the message is admirable and the direction is above-adequate. And the acting was good on the whole, Logan Lerman is an appealing lead and Brie Larson while petite is alluring and likable enough, while Tim Blake Nelson does a very good job with his role as does Luke Wilson. Overall, very nice and likable, nothing outstanding but it's not awful either. 7/10 Bethany Cox","Watching Disney's \"Hoot\", based on Carl Hiaasen's young adult novel, one's mind begins to wander early in the proceedings, conjuring up images of the casting process wherein presumably thousands of juvenile actors auditioned for the leading roles. If true, how then did they come up with the utterly talentless kid-performers seen here? Casting agents in Hollywood seem to be perpetually out-of-touch with reality; they overload films like \"Hoot\" with unnatural, exasperating, self-conscious young people who act as if they were being assigned the next sequel to \"Home Alone\". Eyeball-rolling high schooler, moved from Montana to Florida (an excuse to give us a nifty travelogue credits sequence!), is immediately picked on by bullies but fights back. His success gives him the courage (I presume) to track down a Tarzan-like older kid who runs like the wind and lives in the foliage just outside the country club; together, the two boys hope to save endangered owls who are burrowing on land designated for a new pancake restaurant. The picture is a series of bad ideas, misconceived sequences, and hopeless attempts at comedy while offering us a plastic kind of youthful conviction which was already molding over as far back as the 1950s. NO STARS from ****","I will give it this: it tried. It did try to make it good and even got Luke Wilson involved. Luke Wilson is good, but he can only do so much. He can't make up for the fact that the story was very flawed and the characters were underdeveloped.The running \"gag\" with the bully was asinine. He was never funny and I got tired of the gag really fast. And the barefooted kid bit was kind of weak too. He hitchhiked to Florida? Yeah OK.The movie felt like an average kiddie film at times with this underlining mantra: adults stupid, kids smart. And that bit gets tiresome.But the only moments that were funny was the police cart Wilson drove around when he lost his squad car. I loved that little cart, especially when Wilson turned on the sirens. But, other than that, nothing else was worth my time. \"D-\"","HOOT is about these three teenage kids who try to save a bunch of burrowing owls. now to me i thinks that right they stand up to whats right and whats wrong. in this film a kid name Roy Eberhardt ( Logan lerman)moved from Montana to Florida. and once he gets on the bus a bully name Dana Matherson starts bullying him finally the next day Roy punches the bully and runs off the bus chasing the mysterious running boy. after all that Roy finally meets the Running boy who's name is Mullet Fingers ( Cody linley) well actually his nickname his step-sister Beatrice ( Brie Larson) gave it to him because he can catch Mullets with his bare hands. anyway Mullet Fingers and Roy becomes friends and they join together with Beatrice to stop the construction of a new pancake restaurant. Mullet Fingers is the one behind all the vandalism's that happened there and also later he gets bit by one of the dogs that put there to guard the construction site. so they stood up to the muckle that was driving the bulldozer and everybody got to see the owls it turned out to be a great movie because it showed where kids can make a difference in life by standing up to whats right and whats wrong. thats what is great about this movie. it teaches a lot to everyone about wildlife and how important it is.","i thought Hoot was a great, imaginative movie and fit the book's description pretty well. i also thought the cast was well picked out and everything was in order. i can't really say the clothing was good because it was normal clothing. but other then those miner details i though it was terrific movie and i advise you and your family to see it as soon as possible. i tell you!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!please see it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!. it was the best movie in the whole big world!!!!!!!!!!!!!!ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","Oh my god!!!! Hoot is so good. Mullet fingers, aka Cody Linley is soooooooooooo HOT!!!!!!!!! Oh my god, I am so freaking' serious. I was sad when he got bit by the dog, but he looked so hot in that scene. Beatrice was really good too. Roy started as a total nerd. I'm talking, tucked in shirt, tall socks, all of it. He gets better towards the end. THe owls are adorable. They are soo cute. Mullet is soooooo HOT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I can't stand it. If you don't think he's hot, you're stupid. The end it the best. The mother Paula's people got what was coming to them. Mullet had a six pack and a pair of guns, and i'm talking muscals. It is a must see. I'm going to see it again."],"review-user":["BlackCat725","gpazan","marc-262","DanaWarren","nethoppers","the-movie-guy","Movieguy_blogs_com","fam143","shub-4","dedicatedCFfan","wrlang","TxMike","donavanman1969","Carycomic","oclivingiseasy","lakewoodoh2002","squeakhawk01","tunnel_dweller_kidd","benson1958","TheLittleSongbird","moonspinner55","freakfire-1","mullet_fingers17","hyenalover","gymnast102992"],"review-date":["2 May 2006","20 May 2006","4 May 2006","1 June 2006","7 May 2006","2 May 2006","28 April 2006","5 May 2006","13 February 2007","7 May 2006","26 August 2006","17 September 2006","12 June 2010","7 May 2006","12 May 2006","29 April 2006","27 August 2006","19 August 2006","29 April 2006","3 September 2010","12 January 2010","24 March 2008","26 June 2006","25 June 2006","13 May 2006"],"review-rating":["7","10","8","8","10","6","8","10","3","8","9","1","10","9","7","1","10","9","7","1","2","10","10","10"],"review-title":[" Plain and simple, a NICE movie\n"," a refreshing change\n"," Hoot is a good family film\n"," review of Hoot\n"," Great family movie, strong Florida Ecology Message.\n"," The film has lots of humor, and a message of saving the environment\n"," For a first time producer, I thought Jimmy Buffett put together a quality piece of work\n"," Against all odds, three kids take it into their hands to make a change for the better.\n"," Definitely a movie for kids, and kids only\n"," The author?\n"," Good clean fun for the young or young at heart\n"," Cute, lightweight movie that is entertaining if you are in the mood.\n"," terrible\n"," Good old-fashioned Disney fun for the whole family.\n"," Excellent film that our whole family enjoyed.\n"," A new kid is school becomes friends with two kids who are trying to stop construction of a pancake house that will destroy the homes of 18 owls.\n"," Not a terrible flick, but a terrible message\n"," All in all a well put together movie!\n"," Good for the family\n"," Very nice family film\n"," Execrable Disney do-gooder with inept teenagers...\n"," Luke Wilson or Luke Perry?\n"," i think hoot is the best movie i've seen\n"," terrific\n"," Hoot is Amazing, Mullet Fingers, aka Cody Linley is so Hot!\n"]}