{"review-url":["http://www.imdb.com/title/tt0462219/reviews"],"review-text":["As most people I am tired of the by the numbers clichéd movies that Hollywood makes. There seems to be no creativity in Hollywood. Companies only want to spend money on remakes are sequels that have an audience built in.This movie is a welcome change. It could be classified as romantic comedy for it's genre but don't let that turn you off this movie. This is a very original movie which is not like most things Hollywood produces.If you are reading this, you already know the basic plot so I will not bother going over that. The only movies that come to mind to compare this to are \"Interstate 60\" and \"Art of Travel\" which are little known gems that take a different path than most of the Hollywood garbage.This is well worth seeing if you are tired of watching more of the same.Dean","An unusual movie, which starts off with the classic premise of a hooligan who marries a girl who loves him in order to escape the country. But a twist soon turns the tale upside down. Most of the film hits the right buttons: the story develops smoothly, acting is solid (Sienna Miller's drawl is priceless, she really can act!), chemistry between both leads works, and rolling American rural scapes and quirky side characters really make for a good time. The mood, which starts off as light and romantic soon moves into something darker and downright eery at times.At times though the pace slows just a tad more than we would like, but don't let this stop you watching this unusual little cinematic treat. Alexandre Montin, Paris","Super original. Really great movie! James Franco and Sienna Miller really do go so well together on screen. I sure hope it comes out soon. I first saw this movie at a screening. Because of my age and gender, I was asked to stay for a \"talk.\" We all got to comment on the movie and a lot of people didn't seem to like it. I really loved it and I don't know why so many people didn't think it was that good. Go see it when it comes out and decide for yourself! One thing that you might want to do if you are going to see this movie is to go into it not knowing anything about it. I had not known anything when I went to the screening other than, it was called, \"Camile.\" It really is worth seeing.","I loved it. Others have revealed spoilers, but I won't. It was an unusual premise, actually sort of weird, but I went along with it completely. Camille was a difficult part to pull off convincingly; maybe that's why some people hated it. But I think Sienna was excellent and her acting skills enabled her to nail the part perfectly - without being maudlin or ridiculous. I don't know why she was even interested in a loser like James Franco, but married him anyway. I like him as an actor and also thought he did a terrific job. He has nothing to be ashamed of. There have been movies with with similar setups e.g. \"Ghost\". I simply love Sienna Miller and went along with the situation as written in the script. I feel her great acting talent is vastly underrated, and hope it becomes more recognized by the public. I thought all of the actors played their parts very well, and hope more people get to see the movie. I highly recommend it. I was surprised that my local Block Buster store had about 10 copies available. I definitely plan to buy it.","When I first saw this movie, I only saw the last 25 minutes. I thought it was hilarious and a typical Hollywood piece of crap.... until I watched it later on from the beginning.I won't spoil the ending for you, but if I told you what happens in the end you too would probably think this movie was horrible and ridiculous. \"Camille\" is quite far-fetched and strays from the normal love story, except for it's another movie where a female character believes she can change her man. What surprised me about this movie is how deep of a character Camille really is. Her emotions and free spirit kept me interested. I always considered Sienna Miller to be overrated, until the movie \"Camille\" came along. She is from England yet her southern drawl is quite convincing. Her character is well-written. She's is the stereotypical foolish southern girl who is foolishly in love with a petty thief who is just interested in escaping to Canada to get away from the authorities. While I didn't find James Franco to be very convincing (not that I ever have), he did do an adequate job of playing the inconsiderate bad-boy. Sienna Miller, however, draws you into the story. You can feel her heart break when she finally realizes that Silas truly doesn't love her. For the rest of the movie you can't help but feel terrible for this innocent woman who only seems to be full of love. The supporting cast is also complete. David Carradine (Cowboy Bob) and Scott Glenn (another underrated actor) compliment Sienna Miller and the story perfectly. There is some great cohesiveness going on between the actors in this feature. I would definitely recommend this movie for people who can suspend disbelief for the corny parts of the movie but who love heart-wrenching films. It's a true gem for romance-seekers out there!","I saw this movie at a screener and its the best movie I have seen in a loooong time. I loved it!!!! James Franco is sooo hot and him and Sienna Miller make the perfect couple. I don't want to give away what happens but they play a pair of newlyweds who go off on their honeymoon to Niagara Falls and some pretty wild stuff happens along the way....The movie is really really funny and sad and original. I can't even say what it reminded me of, but go see it! I cried so hard but really loved it and wanna see it again as soon as it comes out! My friends cried too. I hope it comes out soon - does anyone know when? i would really go see it if i were you","Boy, is this one different movie. It totally bombed on previews and pretty much went straight to DVD, and no one's heard much of it since. A pity, because it's not THAT bad, even if it's entire premise is completely absurd. Bad-boy James Franco marries Sienna Miller, the niece of his parole officer, in order to get of the States. Franco can barely stand Camille (\"Sometimes I just want to punch her in the head!\"), who is madly in love with her \"Tiger\", blind to his faults and heartbroken when he leaves her at a gas station on their honeymoon motorcycle trip (she's riding sidecar). But then Camille dies. And becomes \"undead\"! Yes, that is where the film becomes ridiculous, with Miller walking around undead but actually in the process of dying (she starts to physically decay). I'm confused too. Franco falls in love with Miller, amidst thefts, blue horses and a cross-country chase for Franco, who is mistakenly thought to have murdered his wife. But somehow, amidst all the crazy, inane happenings, \"Camille\" becomes moving and memorable. Miller's love is so strong that it can't be stopped even in death, and it's really just a different kind of love story. Franco hates the movie (he blasted it in an interview) but he's pretty good in it, as is Miller, who consistently does excellent work but never gets noticed for it (see her wonderful work in \"The Edge of Love\" for instance). And they have some nice chemistry together. Not a good film by any means, but kind of sweet in it's own odd way.","If you like realist fantasies such as Groundhog Day, or Stranger than Fiction, Camille is the movie for you. It qualifies as a good movie, although barely. It feels like more could have been done with the story, but it is definitely safe to say that Camille is original, and charming. For some people that may be enough. This is the story of the most contrived and surreal honeymoon trip to Niagra Falls. A young thief, Silias, is on parole so he can marry Camille, the sheriff's niece. He doesn't love her, and she is kind of self centred, but if he doesn't go ahead with this, he goes back in the hole. They depart for the falls in a lousy little bike and side car, and they barely get a mile before they have an accident, which becomes a chain reaction for a weird and wonderful remainder of the journey, and perhaps a chance for Silias feelings to grow.There are two things that Camille would've needed to be on par with the great realist fantasies (such as Groundhog Day). It feels a bit shallow for one thing, and its beauty is only skin deep. For another, it is obvious that the story doesn't take itself seriously and some bits are played for laughs, but not enough to make it work as a comedy. It could have been a tad funnier.Sienna Miller's career is still young, but each time I see her, I realize that she is capable of variety. She has been to the Venitian Baroque era (Casanova), To Edwardian England (The Edge of Love), A killer super villain in black leather (G.I. Joe) although she wasn't all that great there. Here she plays a really big narcissist but one with a cute touch. She totally upstages James Franco, who has never really done much for me.I don't think Camille will disappoint. It could use a few touches here and there, but it is likable.","Camille stars Sienna Miller(Camille) and James Franco(Silas) as a pair of lovers who just go married. Camille is joyful and enthusiastic while Silas is a moody ex-fellon who's not sure of his feelings for Camille. They go on a trip for their honeymoon, but soon after they leave, Camille realizes she might be having illusions when it comes to Silas. When the motorcycle-riding couple has an accident, Silas begins to notice some strange things about his blushing bride as her hair falls out and grows pale soon concluding that she's death.But he promises her, no matter what, he'll get Camille to their destination, Niagara Falls... Camille is a sweet and romantic little film, with a somewhat original plot. It's almost a fantasy tale because what happens is unreasonable and there's no explanation given to why things are happening the way they are but it's still quite enjoyable. Both actors did a fine job and the beautiful Miller, who's British, really pulled off her character's southern accent. As a character, Camille might be annoying at times but that has nothing to do with the actress playing her but, with the way the character was written. I guess it comes down to a question of mood and disposition, if you want to watch a serious, realistic and well thought film this is not for you, if you want to see a decent and harmless romantic story then you can watch Camille.6.5/10","This movie is really strange. I still don't really know if i'm impressed with it or not. Certainly Sienna Miller and James Franco did a wonderful job, they're both superb and likable actors, and they had good chemistry together. They really carry the film for me, otherwise I probably would have turned it off.However the concept was pretty, well... to sum it up \"WTF?\".The concept of Camille being 'undead' is just so strange. Why? Someone else said it was 'Pavlovian'. I don't really get that, but then again I didn't particular understand the movie. Was it Pavlovian because she still /thought/ she was alive and therefore she was? And she's so in love with Silas too that she held on? It's pretty odd. There was no real explanation, it was kind of just like 'we're going to throw that key event part in there and roll along with the story now'. So is she a zombie, is she a ghost? The last 15 minutes in particular are ludicrous.However it's definitely an intriguing film, and reasonably enjoyable to watch, if you can manage not to let all the silliness and strangeness distract you. I think the overall result would have been hugely improved by a lot more work on the script - there just wasn't enough framework in place to carry off the storyline with any finesse or credibility.","The less you know about the plot, the better. The best way to enjoy this movie is to just expect a fairytale. Be ready for a crazy, surreal, comedic & romantic story, and don't try to rationalize any of the wacky things that happen.I picked up this DVD for $2 at my local Blockbuster, and if you hurry down to yours there may be a few left in the bargain bin. You'll get your money's worth and then some! Packaged as a romantic comedy about a good girl & a bad boy, the description hardly begins to scratch the surface. But I have to commend the DVD distributors for not giving away the story. The fun is when it hits you and you realize what an original, cute & slightly creepy story this is. And the humour follows brilliantly. I advise you not to even watch the trailer (which gives away the story somewhat).Still, you're probably wondering what the heck this movie is about. I won't say, but you can probably compare it to such surreal modern fantasies as \"Eternal Sunshine of the Spotless Mind\", \"Stranger than Fiction\", \"Being John Malkovich\" and an obscure gem called \"Grand Theft Parsons\". All these excellent films share the common approach of dealing with heavy, soul-searching themes in light-hearted ways. They make you think about your life & your philosophy of living, or... you could just enjoy some laughs & silly times. There's something in it for everyone.\"Camille\" is rated PG-13 and even that is a bit stern. There's no nudity, no gratuitous sex or violence, and hardly any profanity that I can remember. Compared to other modern rom-coms, it may seem watered down to some, but to me it was even more refreshing. Like a fairytale, there's something about it that makes you feel like a kid again, even though the story can get pretty weird.The acting & casting is perfect. Sienna pulls off the lead role of being a hopelessly cheerful girl without being sappy or annoying. Her beau is the perfect counterpart: a cynical rogue but with a boyish innocence and cute crooked smile that makes you instantly like him, even when he's being a total butt. And David Carradine as the wise- yet-kooky cowboy... wow, what can I say but he has a great comedy career ahead of him if he chooses to go that way.So don't hesitate to go see this film. It's a rom-com, a road movie, an emotional drama, a fantasy & above all else a fairytale. If more movies were like this, I'd probably start going to the theater again.","What a truly moronic movie, all I can say is the writer must be very fond of magic mushrooms and LSD because this must be the result of one of his 'trips'.You follow the whole movie thinking alright this is very weird but hey I'm sure at the end there will be a perfectly good explanation for all of this... Only to be disappointed to find erm no there's no explanation at all and the twist at the end makes it even more confusing. At the end of the movie you'll probably have the same facial expression as if you were standing in a Que paying for you groceries and the merchant told you, that'll be 11.95 please and proceeded to elbow you in the balls for no apparent reason. There are so many factors in this movie that go unexplained and I think it leaves it to the imagination of the viewer in an entirely bizarre way. Don't get me wrong I like weird movies, 'The Cell' could easily be described as weird and twisted but in my eyes it's a brilliant movie (despite casting J-Lo who I dislike to the maximum even that didn't manage to sway my opinion). This isn't one of those movies, and I think you should take in to consideration the characters of those who praise this movie. I can tell you they are probably the sort of people that would go to an art exhibition, see a splat of pigeon excrement on a white board and say \"Oooooh what a masterpiece, the artist has truly found a unique way to portray eternity\" when in actual fact all it is, is bird excrement on a board.Keep that last bit in mind when watching this movie, Thanks for reading!","Quite an entertaining movie. I would not call it great, though and it certainly didn't make me cry ( I was rather hoping for a chick flick with a few tears but alas my friends and myself must be more hard hearted than some of the others who have commented on this film!) It was unusual, I liked the twist in the story and I thought all the characters involved were appealing in their own ways. David Carradine seems to have cornered the market in 'quirky but likable' nowadays and he does it yet again here (Im not knocking him, I think he's great) For those of you looking for a watchable romantic film with a difference this is probably it - if you don't want to look too hard....","This movie rocked!!!! saw it at a screener a coupla weeks ago. Kinda a strange story, where James Franco plays this jerk who marries Sienna Miller just to get out of the country and they go to Niagara Falls for their honeymoon. Don't wanna give it away cuz the movie isn't released yet but its totally cool and you would never expect the stuff that happens. I kinda thought I would hate it cuz its a romance but its also kinda twisted and stuff which I like a lot. The acting is really good and Sienna Miller is totally smokin' and plays this really sweet girl. I think she should do more roles like this. James plays a jerk but you end up liking him and the end of the movie is really good. David Carradine plays a cowboy and he is good. I gave this movie a 10 because I came out of the movie really liking it and wanting to see it again which I didn't expect and my girlfriend really liked it and cried. good date flick","I recently saw this movie at a screening and honestly, Bizarre is the only word that can completely describe this story. The acting was great and there was really nothing the actors could do about the storyline. I think whoever wrote this was on another planet. The actors did an excellent job with their characters, but I think this movie kind of brings down (especially James Franco) their creditability. I wonder if they signed for the money, cuz honestly I don't see anyone after reading the script say \"This is an amazing story that I must be a part of\".I guarantee you, when the credits roll you will look at your movie buddy and say \"HUH?!\".","I saw this at a test screening in Chatsworth a week or so ago, and went with a bunch of my girlfriends. we all really loved it a lot. James Franco is amazing and so hot, I would see it just for him!!!!!!! but Sienna Miller is also really good and plays a southern girl who is in love with him so much that she can't let go. David Caradine who was in Kill Bill plays a cowboy and he is perfect for that. The story is kind of strange but if you believe in the power of love and magical things you will love it!!! It is really original, and it is also very funny and everyone laughed a lot but by the end it gets more serious and we all ended up crying. I am going to see it again with my friends as soon as it comes out, it is really good!!!!!!!","I have no idea why this movie just hits all the right spots but it does. Of course the acting was solid; Milller and Franco did an excellent job. But if I try to think what exactly is so touching, I can't specify it at all, it just is. Period. It's strange and bazaar to say the least and yet it draws out real emotion. You be the judge. It definitely was refreshing and worth the time. I'm usually very picky about story lines, characters..etc.,but for some reason this breaks all my rules and it just draws you in. It's quite smooth and wasn't forced considering how strange the events were. I don't think anyone can forget a movie like this one. I know I won't.","I'm somewhat puzzled by the reviewers (many professional) that couldn't appreciate the fairy-tale storyline and suspend their disbelief. This is one of the cutest, most romantic movies I have ever seen. It is all about the power of love, a fast-forward view of a whole lifetime lived within a short honeymoon. From a spotless wedding-gown to withering away as we age, with love that only grows stronger and more true. This is definitely a love-it or hate-it movie, though everyone seems to agree that the acting was superb. It's the size and softness of your heart that will determine if you love it, some people just don't get romance. I have seen it now several times on video, and I still can't help but cry when it rains rice and when Silas and Camille dance in the rain to the \"Ways of Way Back When.\" And I'm a grown man, go figure. Beautiful, stunning movie, a fairy tale for those who have lived long enough to understand true love, whether they've found it or not.","this flick is strange but i liked it a lot. its about a good girl who loves her bad boy and their messed up honeymoon. he doesn't love her back and he's a mean son of a bitch. he starts to love her after some really whacked stuff happens on their honeymoon i wont give it away. its weird yeah!! but different than other movies in a good way i think. i don't know what to compare it to but its a love story. but has lots of funny stuff too. like get to see James Franco in a wig. i liked the Notebook a lot and it kinda felt like that because of the love story. but the rest is way different. nothing like that. Sienna Miller is really good. i saw this movie at a test screener because i like her a lot and her fashion. i liked her in factory girl but this is a better movie than that was. her and james franco look really in love in this movie and i hope they are together in real life but don't knowsee it!!!!","I am giving this two stars for the two lead actors, James Franco and Sienna Miller. One star for each who had to give their time to this ridiculous script. Here is my thought on how the writer came up with this script. Drop Acid>Go To Daughters Room>Play with Strawberry Patch Dolls (for \"strawberry festival and wig reference\") and Care Bears (for \"rainbow over Niagra Falls reference\"). >Drop More Acid>Put in Wizard of Oz Video (for \"horse of a different color reference\".) Rip out tape and puts in his old Kung Fu VideoS (for \"David Carradine Asian and Otherworldly Wisdom reference\".) >Drop more acid fall back on bean bag and dream a Shakespeare dream of Romeo and Juliet.Give me a break I could go on about this horrible movie, but I am even more bored writing this than I was watching it. O I forgot to mention the (\"cinderalla reference\") when Sienna glows in the grass and rises from her deep sleep thanks to the help of her prince. To the writer, STOP DOING DRUGS AND GET OUT OF YOUR DAUGHTERS BEDROOM. Please stop writing failure Folk Tales.I love you James and Sienna but please be more discerning next time.","I watched this movie with my girlfriend at her request, since she thought it was time to see a \"romantic/comedy\" movie, so we gave it a shot. To be honest the first half hour of the move was pretty decent and not bad, however, after an accident, I don't want to give away any spoilers, the plot in my opinion goes downhill. You can start picking up the weak story lines and characters. There are many instances you can go \"What the heck\"! How could that happen, weren't there other people around?? Any witnesses or that is completely bull. When the story reaches toward the end the plot becomes so cheesy that you have a very hard time believing it and you expect an ending like Sixth Sense, or at least something like that. I understand the ending could resemble \"symbolism\" or other stuff like that but it was complete disappointment for a movie with a great beginning. I can assure you if you are a mature audience and don't live in some kind of fairy land you will not like this movie, just giving heads up.","\"Tiger, I had a great honeymoon\".Camille is a must see. It's a fantastic honeymoon story with some interesting twists (for the most part you wouldn't expect the different twists). The creators did terrific job of turning what might have been a typical \"honeymoon in Niagara Falls\" story into a moving drama/adventure with some comedic moments. And the acting, writing, directing is all excellent.With a budget of around $6 million, Camille definitely flew under the radar. I'd never heard of Camille before seeing it listed in on the guide. That's a shame. I'm sure that it would have been a success at the box office if they'd advertised it a bit.Camille (2007) is a must see. You'll really enjoy it!","I found this movie as a recommendation on Netflix.com. I have about 500 movies in my online queue and randomly go through it while working at home, cleaning etc. I thought this would be a silly movie with some ridiculous \"ghostlike\" copies, but wow was I wrong. I'm not a sap and am a hardcore fan of action, thriller and sci-fi but i almost got a little emotional during this movie. James Franco is the ultimate guy's guy and a complete ass most of the time - which makes everything so much more believable and the feelings you feel at the end seem natural as well. I'm not familiar with the actress but her performance was amazing. And because the slow scenes give lots of make out opportunities, it's definitely a date-night movie.","This film tells the story of a man who often has trouble with the law, marrying a sheriff's niece and go to Niagara falls for honeymoon. Unexpected things happen which make their trip very memorable, even bizarre.After watching so many very bad James Franco low budget films, I expected \"Camille\" to be equally bad. I think \"Camille\" successfully set the scene with a strong character buildup, and the film is consistently fun, engaging and suspenseful. It's quite sad to see how Sienna Miller enjoys the wedding while James Franco hates every minute of it, but this exactly makes me look forward to a change in the later parts of a film. Their honeymoon is mysterious to the point of almost bizarre, but it keeps me interested. For the ending, I was really hoping that the policemen acknowledge their mistake, but it ended in an unexpected way. I enjoyed watching this film, I think it's quite refreshing to see a romantic comedy with a twist.","I love this movie. It's not one of the greatest films but it's very surprisingly delightful. It has a surrealistic plot but it also had a lot of real human emotions in it. It's done in a very intriguing way that at times you would be wondering >> is this a comedy, a sad story, a fantasy or a suspense/horror???? Well, it's all of above and done with a smooth natural flow. {{{ Spoiler Alert }}} .... All actors did an amazing job in it, especially the 2 leads. James Franco, once again, is just a terrific terrific actor as a small time criminal who is extremely moody and cruel to her new wife. Sienna Miller also pulled off playing this role as a bubbly chatterbox with unconditional love for her newlywed husband who treats her like she was a nuisance. Franco displayed great acting skill as a stone-cold bad boy and slowly becoming a caring lover only it was too late. { A good lesson here: we must appreciate and cherish what we have when we still have them, for all can be gone the next hour! } He played the role with great control, especially at the ending when he became a caring man. He did it with great contrast but without any overacting."],"review-user":["dean2900","almontin","coolsisy2000","ajjroth","zaisjr","sashabarr","jem132","Samiam3","BernardoLima","elfinium","rooprect","psychopathicmofo","JenEvans1","nooneelsewillhavethi-1","BriarRose1959-1","starsky1987555","unconventionalwitt","jszijarto","bluebellblair","llandersen-1","navid_bastani","tsmithjr","charitydotson","Gordon-11","Meansnow"],"review-date":["17 January 2009","1 February 2009","4 May 2008","21 October 2009","18 February 2012","10 May 2007","9 April 2009","22 May 2010","29 December 2009","27 February 2009","29 September 2011","13 July 2009","19 January 2009","10 May 2007","14 April 2007","13 June 2007","3 March 2011","23 July 2010","14 June 2007","12 October 2010","18 September 2009","9 November 2010","5 October 2010","1 July 2015","4 November 2013"],"review-rating":["7","7","10","10","7","10","5","6","6","8","2","6","10","5","10","9","9","2","5","8","10","7"],"review-title":[" Finally something original (No Spoilers)\n"," Unusual road trip cum love story\n"," Amazing movie!!!\n"," Loved It. Plan to buy it. Hope many others get to see it!\n"," Odd, ridiculous, silly but very sweet and sad.\n"," Loved This Movie!!!!\n"," Crazy, but also kind of sweet\n"," Weird but cute\n"," Sweet fantasy\n"," so weird\n"," Expect a fairytale!\n"," Brilliantly awful!\n"," Good, entertaining movie\n"," cool movie - take your girlfriend\n"," One word... Bizarre....\n"," funny and really good movie\n"," Strangely touching and romantic\n"," For true romantics\n"," no other flick like this\n"," R U Kidding Me\n"," This movie is not for male audience\n"," Camille is a must see!\n"," Surprisingly touching.\n"," A romantic comedy with a twist\n"," Edward Scissorhands-ques but less cartoonish : }\n"]}