{"review-url":["http://www.imdb.com/title/tt0482163/reviews"],"review-text":["Bats: Human Harvest is not a good or great movie, but I can think of far worse ways to waste my time. I did like the setting, not quite exotic but atmospheric enough, the photography is not too slipshod and the editing and music were decent. The effects and acting were uneven but by no means across-the-board-distractingly-bad. Some of the effects do look artificial, but the bats are ferocious enough. In terms of acting, there are some who do put effort into their roles, but also others who look as though they are just reading lines. The real problems though were with the characters, story and especially the script. The characters are stereotypical with not much development going on. The story is not exactly dull, but it is never exactly exciting either, and holds few surprises too. The script is the worst offender, often cheesy and stilted than not. All in all, one of the movies that falls into the some good/some bad category. 5/10 Bethany Cox","On a routine mission in Iraq a group of Delta soldiers recover a computer hard drive from an Alqueda training camp detailing the location of weapons specialist Dr Walsh. After witnessing the termination of his top secret weapons development program Dr Walsh finds an alternative funding source and sets up a new research facility deep in the notorious Belzan forest in Chechnya where he is developing weapons and selling them to Chechnyan rebels.The team of Deltas is sent on a black ops mission to retrieve the doctor and his technology before the Russians find him and his lab.What the Delta team soon discover is that the doctors latest weapons is a flock of large carnivorous bats that have been genetically altered to develop a taste for human flesh. I found this movie to be much better than what I was expecting.There is lots of action and lots of blood. Its more or less what you would expect from a creature feature. The acting isn't great but its passable. I have certainly seen worse.Overall its an enjoyable movie for what it is. A good popcorn movie.","Dull one-note characters with next to no development, unimpressive performances by people who sound like they're simply reading lines, and ludicrous special effects combine to make this a genuine stinker. The story begins with eminently bland commando Russo and his fellow soldiers attacking an Al-Qaeda training base. The scene tells us that Al-Qaeda has recently come to seek an ultimate weapon, and also serves to illustrate Russo's only character trait, a tendency to eschew teamwork. With the help of a collection of blank slates and walking stereotypes, including a Russian spy, Russo travels to Chechnyan territory to catch a mad scientist working for the terrorists. Along the way, they encounter vast hordes of flesh-eating bats that fly in broad daylight for some reason. From there, the movie becomes nothing more than a dragging morass of ridiculous action, including a scene in which a swarm of bats slices a soldier's arm off!","This is about some soldiers (Delta force, of course) who are sent into Chechnya to retrieve an American (mad) scientist who has decided to sell his services to the highest bidder. In this case, the Chechen rebels. He's made some killer bats for them. There are also some Russian soldiers (Spetsnaz of course) wandering around providing fodder for the bats. I don't think the Russians were too highly trained, they pile out of their truck and are ordered to secure the area, yet they stand around like a bunch of high school kids waiting for band practice to start. Anyhow, the Americans capture the mad scientist, but then the Chechen rebels show up and try to get him back. We get plenty of bat attacks, a lot of bats flying around ominously and unnoticed, and the requisite number of explosions.The acting is actually pretty descent and the special effects looked alright. You can tell all the helicopters are CGI but it doesn't jump out at you like a laughable special effect, unlike most of these Sci-Fi Originals. The bats looked pretty good, though I find it a bit hard to believe that a bat has enough mass and velocity to actually sever someone's arm, but oh well...it's sci-fi. The story is a bit of a mess, especially near the end when one of the Americans is captured by the Russians and is about to be taken away on a helicopter. But then the helicopter pilot flips up her visor and it turns out to be the American CIA operative. So she infiltrated the Russian base, took out the pilot, hid his body someplace, changed into his clothes, and can even pilot a helicopter? I guess those Russian's really are poorly trained. You know they just had to have that flipping up the visor scene because it was sooooo cool, the \"money shot\", lol.If you're the type of person who watches these Sci-Fi Channel Originals, this one is a cut above the majority of them. I'd recommend a few beers to dull your senses to some of its flaws, but it's a fairly enjoyable film overall. The characters are basically likable, the action moves along okay, and stuff blows up. The scene where the mad scientist meets his fate is quite cool and actually was a really interesting twist on the whole \"camouflaging yourself from the enemy\" thing.","Sent to investigate a colleague's disappearance, a team of soldiers along the Russian forest finds the area overrun by genetically-altered bats created as a biological weapon and try to get out alive.On the whole, this is much better than expected and is overall quite fun. One of the best elements about this one is that the films beginnings as an Action film work incredibly well in placing rather impressive action scenes in the film. the first ambush in the forest is one of these great scenes with a lot going on to take control of the bats as they're valiantly fighting the creatures swarming all over the area, making for an impressive sequence. Likewise, the take-over of the bunker and the later ambush in the woods help keep the action going with the fire-fights, explosions and creature attacks to work in a rather impressive amount of action. Aside from the fine action pieces, there's some rather good times here with the film making the most of the bats as the central villains as the swarm here is just big enough to do some real damage as this is gory enough to matter and the special effects used for them are actually very well done with the CGI swarms getting good definition by letting each creature be spotted and the close-ups for the individuals being kept to a minimum so that the focus remains on the group in action. There are a few flaws here, mainly in the rather flimsy story about the purpose behind the mission to get the scientist. It's all quite haphazard as it was done in just a few brief segments that don't make a lot of sense. Otherwise, the bat attacks comprise so few moments of screen time that it's bound to be somewhat disappointing with that factor keeping the creatures to a few select scenes, but this isn't enough of a flaw to really hold back the rather important factors here.Rated R: Graphic Violence and Language.","This one i think is better than the 3.5 rating the movie gets on here. Although it's nothing like the first one,, i think this one might be able to stand on it's own , had the movie had a bigger budget. The acting wasn't too horribly bad, the location was nice,, the plot takes place in a forest of all places,, a Delta team goes in there to find WMD's, and upon arriving there find these genetically altered bats, that have a taste for human blood, what a great way to keep people out who you don't want find you're WMD's, anyway the mission is to get the Dr. out of there and capture the weapons, or destroy them,, the Delta team has to fight a bunch of Chechyn rebels in Southern Russia in the forest, where of course all of the bats are,, this isn't bad if you're looking for something fun to watch,, but don't expect it to be like the first, or too deep in thought.","Released to TV in 2007, \"Bats: Human Harvest\" chronicles events after info is uncovered in an Alqueda camp in Iraq on the location of an important weapons specialist, American Dr. Walsh (Tomas Arana). It turns out the doctor has found an alternative funding source and sets up a new research facility deep in the mysterious Belzan forest in Chechnya, Russia, where he is developing weapons and selling them to Chechnyan rebels. A Delta team is sent on a covert mission to retrieve the doctor and his technology before the Russians find him and his lab. What the team soon discovers is that the doctor's latest weapon is a flock of large carnivorous bats that have been genetically altered to desire human flesh. The Delta team includes characters played by David Chokachi, Michael Jace and Melissa De Sousa with help by a Russian biyatch played by Pollyanna McIntosh.This is a sequel-in-name-only to 1999's \"Bats,\" which was a conventional nature-runs-amok flick about government-funded mutated bats that escape and harass the citizens of a West Texas town. You have to give credit to \"Bats: Human Harvest\" for trying something different. Practically the entire movie takes place in or near the supposedly cursed Russian forest with the various militaristic groups fighting each other and the mutated bats. So there's a lot of action, albeit in a comic booky manner a la \"Rambo: First Blood Part II.\" Speaking of the bats, they're more menacing here and there are some close-ups, but they're still a relatively weak \"monster.\" Thankfully, the movie is well made for what it is, a made-for-TV creature feature, and there are plenty of stunning visuals in the forest, the bats, etc. And the soundtrack rocks. Unfortunately, the babe factor is almost zero. Don't get me wrong, De Sousa is an exotic curvy beauty, but she's clothed in military fatigues the entire flick. As for McIntosh, she's definitely an interesting character, but she lacks sex appeal (for me, anyway). Lastly, whereas there's a lot of action and cool visuals the story generally fails to pull the viewer into the events. That said, I DID care when a certain character buys the farm. The film runs 87 minutes and was shot in Sofia, Bulgaria.GRADE: C","I have yet to watch the first entry in this series, however, fortunately, I was still able to follow the complex and intricate plot, with all its unexpected twists and turns, and I applaud them for the utter originality of the concepts herein. In case there is any confusion, let me leave no doubt as to the fact that everything I've just said is coated in pure, carefully nurtured sarcasm, the kind that flourishes and grows exponentially when exposed to crap like this flick. A clear sign that this is unimpressive is that it was directed by a visual effects creator, whose only other credit in that field is a Henry Rooker film that wasn't well received. The acting is average at best, and I defy anyone to not find... Scottish computer-woman(come on, seriously, what is with that last name?)'s Russian accent laughable and/or irritating. There is an attempt or two at stylization in this, and they are reasonable. The action isn't terrible. Cinematography and editing are fine. The music is cool enough. Language is infrequent, if even that. Violence is fairly bloody. I recommend this solely to fans of B-movies, and I will say that you can do worse than this. 1/10","After watching many horror films over the years, the idea of bats being the central feature of a film never really crossed my mind. Bats sometimes are in the background but not the stars of the show. These little mammals are obviously small and maybe a little creepy but unless you get very close, I just don't find them very scary.That said in 1999 came the movie Bats which received negative reviews and has been long forgotten. Bats was only for die hard horror fans. Then close to ten years later in 2007 and really out of nowhere, came this sequel on the SyFy channel, Bats: Human Harvest.The setting is supposed to be Afghanistan but unfortunately it looks nothing like Afghanistan. Here there is a Delta Force groups of soldiers trying to track down a terrorist who is a rogue American weapons researcher but along the way, they are attacked by genetically-altered killer bats. Looking at this, the main reason this film fails is because of the bats. There are no close ups of the bats and they are very generic and boring. They just don't work as a villain or a source of danger. Being a SyFy film, there are many unknown actors who are shallow and really struggle at times. All in all, the horror aspects as well as the CGI here is just of very low quality.One thing I was wondering is just what does this film want to be? It has horror aspects to it but it also contains a war story that is itself pretty shallow and wouldn't work on it's own as a war film. Frankly, I do not think war stories mesh well with horror ideas so this puzzle doesn't really fit even though it is original no doubt.Bats: Human Harvest is frankly very low quality junk horror that is very hard to sit through and I couldn't wait until it was over. Frankly this series is useless and unnecessary.","An elite American military team which of course happens to include two good looking women and a guy who can't quite grasp teamwork, lots of bats, some terrorists, and a Spetznaz team that acts like the gang that can't shoot straight -- all thrown together in a jumbled plot with mediocre acting. This one has nothing much going for it. The characters are not compelling. Even the setting, which has great possibilities, looks like something out of the middle of rural Pennsylvania, not an exotic Boreal forest in Eastern Europe.The bats are certainly ferocious looking. They can even pick up a man and fly with him for a few feet (harpies?) or chop off an arm. You see Delta force surrounded by hundreds of bats with a guys shooting assault rifles and pistols at them and bat flopping to the ground. It would be like trying to shoot skeet with a rifle from a distance of 3 feet. Utterly clueless. The dialogue is rancidly unrealistic, with boy/girl jokes and flirts in the middle of tense parts of the mission. One of the team is blown up by a mine and the first one on the scene just stares sadly at his body, stunned, not even bothering to take cover or secure the area. In fact AFTER the rest of the group shows up he talks about how the area is laid out like a minefield -- thanks for the heads up bub.If you want a contrast in how a horror movie involving a small military group can be done well on a low budget check out Outpost. Harvest is not the movie you want to see. In fact I think I'm going to give it a two instead of a three if I can make it through the second half. Seems unlikely at this point.","I started to watch this flick thinking it was the Bats movie shot in 99 which is known for being bad but at least entertaining. Within the first minutes I realized a.this is not it and b.this is still bad but not entertaining at least a little. It is such a small budget that you would think some college dropouts shot it within a weekend, while they are terribly intoxicated. There is no plot to think of, no characters. Okay, you can say in a movie called bats:human harvest, I should be mad to look for engaging story or characters but the main character is so full of clichés that you can guess they were trying to establish him as one. He is this loose cannon who clearly endangers his and the teammates lives to get the job done. Now I am no soldier but I can say this kind of behavior could get you jail time, not a slap on the wrist like what he gets. Anyway, the team is dropped in a jungle full of Russian spetsnaz, chechen militia and of course, giant mutated flesh eating bats because, why not. The main enemy is the doctor who modified the bats and was using them as a bio-weapon. Long story short we get lots of scenes of bad cgi flocking on people, plush bats being thrown at characters and some bad Russian accents. It is 90 minute bore and no memorable scenes to even make fun of. Pass this on, watch Troll 2 or something.","It's called \"Bats: Human Harvest\", I'm pretty sure I can end the review there. You know it's going to be good for some marginal entertainment, you know it's going to be bad in any other field you can think of. What's up with the special effects in this one? CGI always looks laughable in low-budget movies but Jesus, this is just insane. The acting is universally terrible, but the Scottish chick who tries and completely fails to do a Russian accent ought to receive special mention. The weirdest thing about that though: this movie was shot in the former Soviet state of Bulgaria! How hard is it to find someone with a genuine Russian accent there? The logics behind a B-movie production, I guess I'll never get it. The comic relief scenes look like they've been written by Germans or something, most awful lines ever. Check out the hilarious interplay between the first victims, move over Laurel and Hardy. When a bunch of corpses are found in the forest, one guy reacts: \"Who did this? Stalin's ghost?\". Even Ed Wood would throw that in his wastebasket. The movie's filled with action though, it's not a total bore. If you can get over the fact that it sucks, you might even have fun with it.","Okay, I can sit through almost any movie, and I tend to get a real kick out of Sci Fi Originals, but there was a major flaw in this movie that made me have to turn it off half an hour into it.Having served in the US Army, there are certain expectations in a movie including the military. At least some semblance of attention to proper military rank, uniform, and terminology is necessary if you expect a viewer to actually enjoy the experience. \"Bats: Human Harvest\" had characters wearing rank that was facing the wrong direction on the lapel and, later in the movie, the time was listed as 11:00 hours, but it was full dark outside. Even if the script was perfectly done, and the dialogue spectacular, and the acting Oscar-worthy, if the people making the movie don't care enough about the movie to even bother to look up the proper way to display military time, why should anybody bother to attempt to watch it?","This movie over does it on the cgi i mean sci-fi really they over did it the original '' BATS'' is better it does not use cgi like the sequel. in this movie its the simple people running from mutated killer bats. and really bats in Afghanistan?! the plot involves u.s army soldiers finding a terrorist and being attack by bats and dying<_< but the reason i gave this movie 3 stars is because the way the camera zooms in on the soldiers. the acting is bad and this doesn't even look like a horror movie. in all this movie is a fairly good TV movie for sci-fi channel. but if like sci-fi's movies you'll like this movie because you just like channel 43 oh and if you fall asleep during the movie don't be surprised. oh sorry i think i give it 2 stars instead."],"review-user":["TheLittleSongbird","shaman1969","etg1701","gtc83","kannibalcorpsegrinder","kairingler","Wuchakk","TBJCSKCNRRQTreviews","alexcomputerkid","rlange-3","poyrazbaklan","Sandcooler","flynniv","ab-332"],"review-date":["1 May 2012","28 July 2008","11 November 2007","11 November 2007","2 November 2014","20 August 2008","13 January 2016","13 June 2009","20 September 2013","7 July 2008","1 January 2013","23 January 2011","14 February 2009","11 November 2007"],"review-rating":["5","7","1","5","7","5","5","1","2","2","1","3","1","2"],"review-title":[" Some good/some bad\n"," A good popcorn movie\n"," Every bit as bad as it sounds\n"," Not too bad\n"," A little flawed, but acceptable enough\n"," Killer Bats\n"," Mediocre action-packed sequel with fighting military groups in Russia\n"," When there is no more grain in the fields... wait, what?\n"," very low quality junk horror that is very hard to sit through and I couldn't wait until it was over\n"," I've seen worse, but not intentionally\n"," so awful...just so...awful\n"," The essence of crap filmmaking\n"," Unwatchable\n"," i give it a 3.0\n"]}