{"review-url":["http://www.imdb.com/title/tt0425659/reviews"],"review-text":["If you're tired by the same repetitive, unintelligent material that the mainstream movie industry releases, you'll enjoy \"You Are Alone\". It is thought provoking, well shot and riveting.Without revealing anything that you don't find out in the first few minutes of the movie, this is the story of a young white high school girl from an upper middle class environment who is working as an escort and is discovered by her neighbor. The vast majority of the movie occurs in a hotel room where he hired her to come.Through their discussion, you explore two shifting views of prostitution, depression, loneliness. Yet the movie is not depressing. It talks about dark things without being depressing.As a viewer, your emotions and preconceived notions are moved around, but gently. You come out of it with a lot to think about. I like that in a movie.","generally speaking I don't make negative comments on here. But since this is a festival piece, I don't want you to waste your time when you could see something else that might not be playing again.I thought the actors were pretty bad. For instance, they totally didn't play off each other, rather, they waited to RECITE their lines which were pretty poor to begin with. The dialogue sounded really forced. Norman or whatever his name tried, or so it would appear, to be witty and biting in the lines he chose but just fell really short.After words he asked if anyone saw the ending coming and some people were all \"yea\", and he all but called them liars. Look there were so many clues, the biggest being a briefcase full of cash for a $500 an hour whore. I mean the john gave her at least 20g's... tell tale sign. Now no you couldn't see exactly what was going to happen but by the time the twist actually occurred, I for one, didn't even care. I was just glad to get out of there. I asked him which draft he shot and he said 8.1, maybe next time he will wait to shoot 'til 15.3 cause this needed a lot of work.But he seemed like a fairly nice guy, he is making his own films, he'll probably get better and I hope he does, not in a snotty way either, I mean it, I wish him luck. Just remember, this is just my opinion.","You Are Alone is a beautiful, almost delicate film, smart directed, crisply written, with two complex and riveting performances, and a twist of an ending that no one will see coming, but will make you want to see the film a second time to go back and catch up on all the clues you misread.The story, about a highschool girl who drowns her depression and awkwardness by working a few hours a week as a $500 an hour \"schoolgirl\" escort, and the depressed next-door neighbor who discovers her secret and hires her for an afternoon call in a downtown New Haven hotel, features breathtaking performances from both Jessica Bohl, as the girl, and Richard Brundage, as her neighbor.Bohl as Daphne gives a breakthrough performance on par with Maggie Gyllenhaal in Secretary. She so captures a teenager's angst of growing into her own skin, and when she talks about always being in control, you start to realize she's not in control at all, but in danger of going over the deep end, which I guess in a way she does.Brundage as Buddy is depressed, angry, heartbroken, a shell of a man. But it isn't until the film's startling conclusion that you grasp a full comprehension of his pain.After a very brief opening segment, which will hook most independent film lovers, and have the religious right running towards the exits, we are brought into the hotel room. At first you're not sure about these people, or the film-making style. Shaky, annoying...like the characters. Until you realize their back story, told in short flashbacks. They're confrontational at first for a reason, and so is the camera. But as they open up, as the story settles down, likewise, so does the camera. And, I don't know, 20 minutes in, give or take, you find yourself unable to take your eyes away from the screen.Having just seen the world premiere screening at the Brooklyn Film Fest -- where the director asked the audience if anyone expected the ending and not one person answered yes  I almost wish the film were already on video so I could watch it again. Because thinking back now on some of the conversations in the film, particularly a very candid dialog regarding fantasy and climax, I really thought things were going in a very different direction. But I realize now so much of their conversation meant something completely different than what I imagined. I need to see it again!!! But as dark and sexual as much of the talk is, blunt to say the least, I found myself laughing more than I might have expected at some of its candor, which definitely falls into the \"things we think, but lack the nerve to say out loud\" category. It's very blunt, especially when you realize so much of it has a completely different meaning. Some of it will make you uncomfortable, especially if you're watching You Are Alone with a partner. You'll definitely have something to talk about  perhaps argue about  afterwards. Perhaps it should come with a warning: You SHOULD be alone when watching! The music is amazing. I would have come home, and purchased the soundtrack at my favorite online music store if I could have. The film looks as good as anything shot on film. After the screening director Gorman Bechard was asked what sort of process he used to get the digital footage to look so good. His answer: none. They couldn't afford it.I have to give Bechard credit. I am a big fan of his two shorts, The Pretty Girl and Objects in the Mirror, but even they could not have prepared me for the complexities and surprises of this film.To everyone involved: bravo.","Jessica Bohl plays Daphne, the sexually precocious suburban teenager struggling with the hell of high school. Daphne's neighbor is Buddy (Richard Brundage), a depressed middle-aged man still angry over loosing his wife. Daphne is attracted to world of prostitution because it promises to cure her of barely legal boredom and loneliness. Once Buddy strips Daphne of her secret, he hires her to help him accept the loss of his wife. The entire film takes place at the Hotel Duncan, yet details of each character's history are exposed through dialogue and flashbacks. Their appointment climaxes with the story's concluding twist.Both actors truly understand and become their particular character, delivering a convincing, sincere performance. Their on-screen chemistry, critical to the entire film, is genuine.The film's dialogue is natural, real to life. The writer, Gorman Bechard, undoubtedly did his homework because all references are industry and character-age appropriate. Daphne is intelligent, yet clearly still an eighteen year old. Buddy may be middle-aged, but still not the hackneyed naïve type normally depicted in film. Daphne and Buddy's conversation primarily deals with their despair and frustration with life, but is still comical at the right times. Although the general mood is very relaxed, the dialogue has its own vivacity, forcing the audience to become empathetic toward the character's conditions and uncomfortable at their straightforward vulgarities.The incredible soundtrack truly captures the essence of the film. Each track commands sentiment, actually contributing to the scenes and characters. Even existing independently from the film, the compilation truly expresses You Are Alone's central theme-- loneliness.You Are Alone is a less conventional piece that deals with of notions typically not spoken. Definitely worth seeing it's the sort of thought provoking film that forces you to question your own threshold of loneliness.","I caught this at the Chicago IndieFest and have to say YOU ARE ALONE is a lot funnier than the other reviews and even the website would lead you to think. Not HA HA Wedding Crashers' funny, but sick, twisted, I can't believe she just said that but it's so damn true funny.Jessica Bohl, who deservedly won Best Actress, is amazing to watch. There's never a moment when you think oh, I'm watching a movie and she's an actress. She's too damn real for words.In fact there's 2 scenes that I'm still giggling over, and I won't give them away, but in one she's in the bathroom talking about how much she gets paid for performing a certain service and how \"awesome\" it is. (I almost wonder how many people in the audience are secretly thinking the same thing!!!) In another she talks about a teenagers definition of \"sex\" versus an adults, and if it isn't the truest dialog I've heard in a movie in a long time, I don't know what is.","The 1980's 'My Dinner with Andre,' with Wallace Shawn and Andre Gregory, is essentially a dialog about the world and how it affects and can lift the spirit. 2005's 'You Are Alone' demonstrates how common worldly events can shatter the soul. The story revolves around three principal characters. There's Daphne, a pretty teenage student who frets about virtually every decision in her life. Then there's the prostitute, or paid escort, Britney, as self-confident as Daphne is self-conscious. What makes them interesting is that they share the same body, if not the same personae. Part of the magic of this film occurs in one of the early scenes where Daphne approaches a door of an aged hotel room. She halts and is obviously torn by the decision of whether or not to knock on the door  but it is Britney that effortlessly glides into the room when the door is opened.On the other side of that door is Buddy, a middle-aged nobody with few, if any, personal qualities that anyone would find attractive. He goes so far as to be confrontational about Britney's chosen profession as soon as she enters the room. However, we soon learn that Buddy is Daphne's next-door neighbor and has watched through the years as she grew from little girl to womanhood. This complicates things for the audience. Is Buddy just being a concerned neighbor or does he want something else?If it's sex that Buddy wants, here it is. Britney loves sex. Her definitions may be Clintonesque but that doesn't lesson her enthusiasm. She prefers older men and wears a rainbow of plastic wristbands that her clients are invited to chose from. Each color band denotes a specific act that she'll perform  but exactly which act isn't revealed until after the band is broken off her wrist and the choice is irrevocably made. Britney is, or believes that she is, in control of every encounter. Even when blindfolded and bound, as she is by one of her regular clients, she imagines her arms and body being stroked by multiple men but her legs and pubic area being caressed by a woman in blood red lingerie. The film's imagery just keeps coming.Buddy's pathetic life is one of acceptance. He's lost his wife, his dog, even his fantasies of the pretty teenager next-door. It's no coincidence that he's lured Daphne or Britney to this particular hotel room. There's a painting on the wall of a dinner plate with only a fish head left. This is a perfect metaphor for Buddy's life; all of the good parts are finished. So it's here, where he brought his wife when they were still college students, that he makes his stand  to regain some control of his own life, to make his statement.The director of 'You Are Alone,' Gorman Bechard, knows his craft. The principal action in the hotel room serves as a solid anchor for the film, assisted by a myriad of inter-cut scenes that add dimension to the characters, their circumstances and conflicts.As the film progresses, Britney asks Buddy if she should get undressed. He says yes, but she strips only to her underwear. An actual prostitute would probably remove all of her clothes (one of the profession's five gets). But it isn't Buddy that's being teased, we are. As the film concludes, we find that there are far deeper human emotions and motivations in play. A tease doesn't work unless it actually delivers. Britney does, so does 'You Are Alone'.","There were moments when watching, \"You Are Alone\" at the New England Film + Video Festival recently, when I felt the lead characters seemed very familiar, like old college friends, who gradually become larger than life. The journey these characters undertake is at turns, poignant and hilarious, and a testament to the artistry of screenwriter/director, Gorman Bechard, who wrought such authentic characters, and the actors, Jessica Bohl (Daphne/Britney) and Richard Brundage (Buddy), who brought them to life.Several comparisons have been made to Coppola's, \"Lost in Translation.\" To me, the film was more reminiscent of Pen-ek Ratanaruang's, \"Last Life In the Universe,\" in terms of its edgy, melancholic beauty, laced with the kind of smoky humor I associate with Jarmusch and the hermetic intimacy of Roehmer. Finally, much well-deserved ado has already been made about Bechard and Bohl, about which I heartily agree. The only new comment I might add is that the unsung hero in all of this is Richard Brundage, whose nuanced portrayal of Buddy blends equal parts sweetness and menace with deft, and who provides an aching flow of innocence and Weltschmerz to counterpoint and draw out the character of Daphne/Britney. Kudos to all involved in, \"You Are Alone.\"","I have a hard time putting into words just how wonderful this was. Once in a while you see a film that just sticks with you. \"You Are Alone\" is that movie (for me). The film is constantly in my head and in my heart. I replay the scenes mentally every day and analyze them and go through the emotions all over again, as if I am seeing it for the first time.There is nothing I did not like about the movie. Amazing soundtrack!!! The ending was perfect. Very emotionally stirring!!! It was compelling and riveting.I adored Jessica Bohl and her performance was the greatest I have ever witnessed. I admired Brittany's strength (what a strong woman).The tag line is \"When your darkest moments come to life\". We never know what we are capable of doing. Everyone says oh I would never do that, when really we have no idea what we would do in a situation. We are very capable of anything and this movies delves straight into that subject. The honesty of the movie may be my absolute favorite part.Thank you Gorman Becherd for a perfect piece of art!!!!","Some people are born with mourning souls with their song sung singularly until they encounter another soul as tortured and/or as bitterly sweetly beautiful as their own and an unusual magic happens. YOU ARE ALONE is a brutally honest look into two tortured souls that intertwine for a moment of understanding and oneness only to be torn apart by the differences in the oneness between they're pain. Death is explored figuratively and literally. It is what happens when ones soul is dead or similarly too alive, too awake to reality. It is the life NOT which you imagined behind the eyes of passer-by's. This film explores the aching pain in us all, the frown beneath the cheery facade, the ache below. The ugly instinctual animalistic thoughts and acts become honest and matter of fact and then Bechard sprinkles a dash of unexpected innocence and beauty into the mix knowing both linger in us all. Bechard, the writer, is a expert observer of the human condition and because of his non judgmental attitude presents life in a light we often shield our eyes from but yearn to see and understand. He, as director, focuses on the nuances of the actors spirit that shines through the character they're playing to the actors own personal familiarity with the emotions brought on by each situation. This is the most accurately written and directed character portrayal of a man and woman's experience together I have encountered as of yet, even though the two characters encounter is probably not the \"normal\" encounter.The soundtrack encapsulates in each songs lyrics what the characters would let their hearts spill out if able and strong enough. It is each characters real voice sung through the beauty, pain, talent, and emotional intelligence of emerging indie artists ready to explode onto the alternative music market. The perfect soundtrack for those of us with issues - those of us who admit that we have issues and those of us that hide it.I always enjoy exploring the darker sides of life with Mr. Bechard's both fascinatingly creative and realistic view of life and the characters that revolve within it.","I wanted to like You Are Alone as I found the subject interesting, but the lines were either poorly written or poorly delivered, and possibly both. All I could think the entire time was that it sounded like a table read. The actors weren't believable as real people, and in a story like this that's a must have. Additionally, I found the ending completely unbelievable. Not sure where all the 9 and 10-rated reviews are coming from. Not a chance.","This film is Engaging and Complex while maintaining simple beauty .Our two characters come together sharing the base of curiosity and loneliness, but it is a springboard for learning these people, they 're life styles and pasts which support this.The two lead actors (Bohl, Brundruge) were in the moment as any two actors I have ever seen. %100 believable, they transport the audience seemingly effortlessly, into their world. The actors' seamless acting teamed with Bechard's Beautiful, realistic dialog and his truthful direction drives the story forward into a striking and moving finale.This film is visual treat- soft ,increasing the intensity of The story. The soundtrack serenades the viewer, soothing yet drawing out the emotional content of the film. I find this project to be nothing short of a masterpiece. intriguing.intense.","This movie is like Happiness meets Lost in Translation with a Sixth Sense ending (or maybe a Crying Game surprise), and the best soundtrack I've probably ever heard...if that all make sense.The first 30 seconds pretty much tells you you're in for a twisted ride. (I was surprised no one walked out right away during the Brooklyn premiere.) But from there, the film settles down into a talk-fest between two really damaged people, Daphne and Buddy.They're lonely, mess-up, and boy do they talk about sex. Daphne brings to life her most interesting tales of escorting, some are quite funny (Mr. Chang) some disturbing (the Harlan scenes with music that tells us what we see might now be what's going on, or what Daphne is really feeling), and because I have a friend who used to escort, I might add, most seem quite real. You Are Alone is multi-layered and mostly brilliant. Okay, maybe a couple minutes less of the talking, and I don't know that we'd have missed anything. Then again, I need to see it again knowing the ending.I like this movie.(The director asked people in the Brooklyn audience to write a review on IMDb because a lot of people read them. Request granted.)","The actors in this dark film are truly believable and well cast. The quality of the camera work makes you feel as if you are there The screenplay is intense and does not wander. The plot is one that makes you want to watch it a second time from the new perspective gained by the ending. We showed this film to a small group of patrons at Gadsden's Center for Cultural Arts. After the film, ever patron was eager to discuss the film and one person called me the next day to say that they were still \"bothered\". While we put an 18 and up age restriction on the film, I would watch the film with a youth group as it is a very real portrayal of an ugly situation and sets the stage for great conversation.","Good show, really good acting, and the director takes us swimming through his storyline in an interesting, unpredictable way, especially since, essentially, it's two people in a room. It doesn't race through like many modern films, but doesn't drag, either. Bohl is flippant enough to believe her in the \"now\" of her character, which is still involved and not going back on her 'career' choices - so it is believable without the need for her to show us a deep, self-examination of her soul...Brundage has the delicate balance of weight, innocence, meekness, and class to pull off 'Buddy' very well. A bit grainy on the film quality, but it fits the tone of the story. Could use a little polishing on the hair and makeup end of things, but definitely worth watching.","I saw the film at the Brooklyn International Film Festival (World Premiere).A haunting, intimate portrait of Loneliness, and the repercussions of letting it grow and turn into something darker.The acting of the two leads (Jessica Bohl & Richard Brundage) is excellent, and makes one wish you had met these characters before they became so damaged.Reminded me in theme of the works of Atom Egoyan (Exotica) and Raymond Carver (Where I'm Calling From).The Soundtrack (Tywanna Jo Baskette, Crooked Fingers) is excellent and reinforces moments in the film without drawing attention to itself.Highly recommend the Film and the Soundtrack.","You Are Alone was a good movie overall, but it lacked a lot of action, the entire movie kept you in anticipation for the end, which is good, but it got pretty boring waiting on it. One good thing about it was that you started really being interested about the two main characters, because they were pretty much all that you saw the entire movie. i will have to say though that the end was quite surprising, and it caught me off guard. I started feeling pretty sorry for buddy, and started feeling his pains and wanting to relate to him, but at the same time it was hard to sit and watch what he was doing, although it was understandable. overall, the film wasn't bad, but it also lacked a lot of something, but i cant quite put my finger on what it was that it lacked.","Striking, intelligent micro budget film about loneliness, as captured during an afternoon encounter between a Yale bound high school senior who's a prostitute in her spare time, and an older, depressed neighbor. Both the film and the two generally excellent lead performances (by unknowns Jessica Bohl and Richard Brundage) do get stagy at times. The film takes place largely in one room. And I wish I didn't see the twist ending coming. In fact, I sort of wish it wasn't there at all. While it almost works, I didn't think the film needed it, and it felt tacked on, as if from another, more conventionally 'dramatic' film. The film is at it's best when it's dealing in simple emotional honesty, and the complexity of these characters lives. That's where this film shines – in avoiding the clichés we've come to expect in two characters like this. She may be living a dark existence, but she's getting something from it too. He's a man who can't let himself even indulge in fantasy, and it's part of why he's so blocked as a human being. For a film that's all about sex and sexuality, it's surprisingly chaste, while still having uncomfortable erotic overtones and questions – both for the characters and the audience. Are we sick for having moments when this young girl turns us on? Is she sick for enjoying that power? I also appreciated that the dialogue is often elliptical, and that silence is as important as words. Not quite a great film, but an impressive effort to do something original.","This was a fantastic movie about two people, one a young teenage girl, and the other, a middle aged man, who are each looking for someone to help them fulfill a certain emptiness left by former loved ones.Both actors give brilliant performances that various audiences can relate to. The script, although written by Gorman Bechard, seems as though it was written from a woman's point of view. And at the same time, men can relate to the male characters because of how well they were developed and described in the movie.The end of the movie has an unusual but powerful and unexpected twist that leaves you speechless. I would recommend this film to anyone who has ever felt lonely or abandoned by a loved one. It is clear in this film that you are not alone.","This really is a movie that you need to see twice. When I first saw this film I was really drawn into the story. While the majority of the story takes place inside of a hotel room, the stories that Buddy (Nick Drake, wonderful allusion) and Daphne share take you outside of their room and into their world. Through their conversations you get a feel for the loneliness and pain that each feels. The soundtrack accompanies the movie perfectly, dark, lo-fi and intriguing. When you see the film the second time around you can pick up all of the clues that you missed the first time around leading up to one of the best ending I have seen in a long time. I hope to see this movie find a distributor for the DVD so that it will be more accessible. Great movie, you won't be disappointed.","One of the BEST movies I have seen in a very long time. Bechard has a way of looking at things that is completely unique and this movie does not disappoint.This movie has you guessing throughout, and with the seemingly taboo topics addressed it keeps you glued to the screen. There are no bad guys or good guys, Bechard makes sure of that. The characters are so perfectly complex you feel for each of them, you care about what they have been through.Bechard's use an attention to details is unmatched in this world of \"FAST FOOD MOVIES\" and while some of the topics may make some uncomfortable - you love the feeling it gives you.I have heard it said too often that there are no NEW stories to tell. Thank you Gorman Bechard for proving that false.Run, don't walk, to see this movie.","Although it was dark, depressing, and at times hard to watch, You Are Alone held my attention and was refreshingly honest in its dialog. It truly captured the angst of teenage romantic relationships. In addition, the soundtrack was amazing. The lyrics and the tone of the songs complemented the sadness of the film so well that it made you wonder if the tracks were created specifically for the movie. Jessica Bohl is the best actress I have ever watched. Her compelling and believable performance made the movie. It made me wonder if she really IS a prostitute. Who knows. Anyway, the movie was very worth seeing. LOVE, YOUR SISTER! yeah, that's right....","I just saw this film at the Sidewalk Film Festival in Birmingham, AL, which was actually a really fun festival, and was blown away by it. It was the best movie I saw all day by a long shot. A school aged prostitute meets with a middle age man and attempt to end there deep depression together. It's an inner look into the darkest parts of human sexuality. Story stems from real life occurrences, ripped straight from the headlines. Raw, blunt dialog and a killer twist at the end. The film does contain graphic sexual dialog and nudity. Definitely not suitable for kids. Too depressing for some people's tastes. Definitely worth checking out in my opinion though.","I don't like to have spoilers in my reviews but since my thoughts are specifically about the ending and how it developed, be warned. Many spoilers.***SPOILERS*** This movie is so well done which many reviews have already pointed out. I agree completely, but I will not elaborate any more on it except to say that even though I was totally surprised by the ending, looking back, I see so many clues. The large amount of money was a big one. Buddy at one point questions her life choice which seems unlikely if you are going to take advantage of it. Toward the end we see him in a flashback at home with a gun. And then something that raised a flag for me that I couldn't figure out until it happened - he never took his own clothes off. It may have appeared that he was starting to get sexual when he took off her underwear, but that was necessary to keep her from getting blood on her clothes.***SPOILERS*** I have a serious problem when I think about what comes after. Buddy had affection for Daphne which wasn't sexual or at least not totally. And as he grew to know her, that affection grew. He kissed her like a lover, but more than a sexual lover. He kissed her soul. And then toward the end he asks her if any of her clients fell in love with her. Yes. But did she fall in love with any of them? No? But is it possible? This could have been a red herring for the viewer, but since I was falling in love with this girl, I think that it is more than possible he was too. So thin is the line between fantasy and what we think can actually happen. So my problem is this. If he cared at all for this girl, even if he wasn't falling in love with the unattainable, how could he do what he did to her? He asked her to kill a human being. Regardless of how much she agreed with his need, this act will haunt her brutally for the rest of her life. He was too chicken to do it himself, so he added so much pain and loneliness to this poor girl who was already desperate in her loneliness. I can't help but think that she may not be far behind in choosing this path. True, she walked out of the hotel with her mask of indifference back in place, but we have already seen that this girl cannot keep her pain from encroaching that indifference.***SPOILERS*** I need to add that this movie was extremely titillating. The director used this almost perfectly sexy woman to tease us throughout. She was in her simple but sexy underwear for a big part of it and eventually shed that. When she knelt at the edge of the bed and carefully folded her uniform, that was so sexy. And it was more than a few shots of bare skin and exposed nudity. The conversation itself was teasing as we learned details about the life of this call girl. She did so well at teasing us with her sexiness, the outcome was even more of a shock.","I am a film directors nightmare... especially of the mega buck, multiplex variety. While not a student of the art I still have a high threshold for disbelief suspension and buying into the film maker's vision, if I can find it. That's why a gem such as 'You Are Alone' is such an exhilarating find. The intimacy and pacing drew me in and never let me go. Jessica Bohl and Richard Brundage give thoughtful nuanced performances and director Gorman Bechard displays a deft hand in presenting what is an understandably disturbing day in the lives of two terribly damaged people.Spoiler belowI bought the DVD version and have shared it with several people. The reactions have been varied, from disbelief in the ability of Daphne to complete the assignment for which Buddy has paid her to an inability to watch the whole film because it was just too real and emotionally devastating. As a compulsively skeptical moviegoer I have to be either grabbed by the collars and hauled for the ride or sidled up to and seduced by the filmmaker. This film took the later route for me and by the end I was so involved that I felt Daphne's horror and pain at her role in Buddy's demise. My reaction to this film reminded me of watching 'The Cook, the Thief, His Wife and Her Lover' by Peter Greenaway many, many years ago. By the end I was fascinated and repelled and utterly unable to tear my eyes away from that film too. I've watched this film several times now and truly appreciate the eye and ear the director has demonstrated. I am familiar with other works he has been done including a couple of cheeky movies, 'Galactic Gigolo' and 'Attack of the Killer Bimbos' and a mixed bag 'The Kiss' which I recently learned was killed in the cradle by the producer and doesn't really represent the directors vision. Too bad, because I loved the prior two films and even found 'The Kiss' interesting but wish 'The Kiss' was available in a director's cut with all of the original vision and music in tact. I look forward to future work by this interesting director and the leads Jessica Bohl and Richard Brundage.","I had actually considered investing in this movie when Gorman was out drumming up funding. I loved most of the script but did not like the ending. Gorman insisted the ending was as it had to be.Seeing the completed movie I have to say I am amazed. Reading the script I had not imagined the acting (and Gorman's directing) would be as powerful and moving as it is here. The two leads did an amazing job. They were very believable and this movie is well worth watching just for the performances of these two amazing stars.Now, for the spoiler and if you have not seen the movie please don't read further as you need to see the movie first. (I actually wish I had never read the script just so I could have experienced the movie ending first hand.) ----------------------------- SPOILER I have two main problems with the movie. First off, and I'm sure I mentioned this when I read the script, the wife should have died. If she were dead the ending would be much more believable. As it is, we have this guy who has been agonizing over a woman who left him 'years ago.' If she left him and he is still in love after so long he'd have to be seriously delusional. But he doesn't come across that way in the script. (There is also the problem of why he did not expend all this energy going after the wife he still loves.)Plus, if the wife were dead we would actually be able to believe that they had a fulfilling, reciprocating love, and therefore believe that the guy is devastated enough for the ending to be reasonable.However, I don't buy Daphne doing what she does in the ending. I'd need a heck of a lot of convincing to believe that this naive girl (very naive for a whore but believable due to Bohl's performance) did what she did. The character is simply not cold enough. And if she did this out of some kind of love, or something else, then there is a whole piece of the movie/story missing.Much of this movie is reminiscent of \"Sex, Lies, and Video Tape.\" I think it could have been as popular if Gorman had chosen to give the movie a more believable ending. So watch the movie, enjoy the performance. And make up your own mind."],"review-user":["thecyclops","jacobdtober","SoSickOfTheRain","barracudababy","2cute4ChiTown","ldish007","poshlostph8","rachelcoggins","acouchon","rs-91886","labeans7-1","LetsPlaySNAP","bobwelch-1","michaelmmcguire","casbury","welch022","runamokprods","mollyaustad1","jonwelch2003","stephen-250","aaholman","colinp1-1","Jackbv123","jonrhys801","dfcurran"],"review-date":["16 November 2005","25 September 2005","10 June 2005","11 December 2005","13 August 2005","16 March 2006","14 October 2005","8 October 2005","4 August 2005","23 July 2018","15 December 2005","19 July 2005","19 April 2006","1 October 2005","11 June 2005","26 April 2006","20 December 2011","9 August 2006","19 April 2006","18 December 2005","19 November 2005","24 September 2005","22 August 2017","25 September 2009","18 August 2007"],"review-rating":["10","4","9","9","9","9","10","8","4","10","8","8","7","8","8","10","9","10","10","8","9","10","9"],"review-title":[" Best movie I've seen all year\n"," not really good. no offense\n"," Dark, candid & beautiful with powerful performances and an ending that will blow your mind!\n"," Thought provoking, brilliant dialogue\n"," Funnier than I expected. Jesscia Bohl ROCKS!\n"," A Dialog for the Soul\n"," A teenager and her middle-aged suburban neighbor, meet at a hotel room and discuss business.\n"," Perfect piece of art!!!!\n"," Letting the movie and the music be one's hidden voice for a moment\n"," Interesting subject, mediocre delivery\n"," Beautiful!\n"," I was not prepared for the ending.\n"," I recommend this film\n"," wicked indie\n"," Haunting, intimate portrait of Loneliness\n"," review on you are alone\n"," An impressive micro budget film\n"," a short description and a few opinions on the movie \"you are alone\"\n"," Brilliant and Engaging\n"," Shockingly Moving, Sad, Perfectly shot\n"," Jessica Bohl is THE BEST!\n"," A school aged prostitute and a middle age man deal with there depression together.\n"," Shocking\n"," Fascinating film and deserving of wider audience\n"," There is a warning before a spoiler appears in this review: Script vs Movie\n"]}