{"review-url":["http://www.imdb.com/title/tt0402590/reviews"],"review-text":["This was a nice film. It had a interesting storyline, that was executed pretty well in the later part of the film. The storyline kinda reminded me of The City of God. But this one is done in a more nicer way in comparison. It had what i really loved:a tinge of surrealism. Some pretty interesting cinematography (thru the wooden camera) I'm not sure if it was culturally correct, but it definitely widens you're view of south Africa. The actors were good (for 1st timers, most of them anyway), i especially liked Estelle character, which made this movie pretty enjoyable. What is interesting though, was that it makes you ask about your own life. Are you really doing what you really love? Or do you consent to the norm, the conventionalism around you. Definitely worth a watch.","Yes, maybe there are parts of this film which require suspending belief a little but that doesn't take anything away from the film's charm and wonder. It was shown as part of our town's youth film festival and was the organising committee's favourite. Which is not surprising. The subject matter - coming together in a race-torn, though post-apartheid South Africa is highly topical and the treatment of the theme is inspirational. Of course, as the previous comment mentions the film does have its shortcomings, but the realism of the setting and the way the director treats his subject matter belies these shortcomings. I saw this with my wife and we returned the same evening with the children. A film to watch, meditate, discuss and act upon.","This was a random rental at the video store. But I was impressed from the start. Wooden Camera is a gem of a 2nd feature by an engaging director. The film captures deeply insightful moments and several often times frustrating and complicated social interactions young interracial friends would experience in a modern post apartheid South Africa. The young actors are quite good and well directed in their approach to the core material and the dialogue is natural and interesting. The film is very rich in visuals providing a frame by frame study of deeper understanding and fulfillment without falling into iconic stereotypes and clichés. The musical score to the film adds body to the film without being obtrusive. After watching it the second time, I tracked down the DVD on amazon and have been happy ever since.","This film is amazing, while not perfect by Hollywood standards it encompasses a gentle look at the wide divide between rich and poor, black and white that is true in many parts of the world. It handles the audience with kid gloves while delivering a truthful look at societal problems. The children are beautiful, take special note of the young man who plays Sipho. The friendships that develop are universally true, anyone can relate to the choices these young people have to make. The influence of adults is interesting - it appears to be taken from real life experiences as there are snip-its of conversations and interactions-much like a child would remember experiencing. I would highly recommend this film.","I enjoyed very much the movie wooden camera. I think it's a little bit influenced by the Brazilian movie \"City of God\", but maybe this parallelism between the two tracks possible to follow (crime and art) in social neighborhood are a reality. I think the films made by Madiba are really beautiful. I don't think it's unreal that he shoot such good films, because there's a lot of artists that don't have any type of education and can be really genius. I enjoyed very much the soundtrack. It's adjusted to the pictures.See the movie...it's good to show how can be a life in a social neighborhood.","One should not be too critical about the director's second feature.I really like the camera work of Madiba. As Mr. Shawn pointed out, he had a unique way of looking at things.\nHowever, howcome a 14 year old boy shoot such beautiful images? Remember he has not got any education of any sort. I don't think english is the common tongue in Cape Town ghettos. Worse still, Madiba looks even smaller than his supposed age of 14.Any way, if you overcome above-mentioned peculiarities, you can watch the film and still enjoy it because of nice camera work.","First of all I am white. I lived in Observatory and I swear that the music teacher's house is right next my old house on Perth Rd. I worked in Khayelitsha in 1992 and for the skeptics out there, the film was very true to life. I never saw the \"beach\" where Sipho lived, but the shacks, Shabines, and drunken life was a reality. Many sweet kids like Madiba lived in Khayelitcha when I was there in 1992. The limits of their social mobility as portrayed were very real. I think Ntshavhen must have simply taken a camera (hidden) into the township and filmed. It was that realistic. Believe me, I have been there, spent five days a week 7 hours a day there. Very Real and Madiba is small because many black children are small in ZA.","Okay, I'm not too good reviewing movies but I think there should be more movies like this one. It's gonna be a blockbuster or rated too high on or become a cult but it's a simple man's movie. Cause it won't make you thrilled or keep you thinking but there is a sense of innocence and the characters are natural. The actors have done a great job especially the actors in the role of Sipho and Estelle.The ending of the films is really good. I always thought if there can be such care-free move in the movie and they did it. Maybe, it's possible.I don't get to see such kinda movies a lot. The only one I remember is 'Bluebird' that I recommend to all who liked this movie.","This movie is not at all like City of God, you might get the same feeling but it isn't, there's no intense shooting nor intense drug scenes, you get the idea. If you ask me I think this film was a waste of time, there are a lot of other films which gives 100 times better meaning and teaching than \"Wooden Camera\". Yes I might be the only one to give a negative comment for this film but it's only in my opinion. It's one of those films where I can get the feeling that I'll be blown away but when the credits start to role my friends and I all gave mutual looks, and we all laughed at how ridiculous this movie was. So to conclude this matter, I advise not to watch it.Personal note - Making Africans talk English was a big mistake. In City of God they used their native language which gave the film much more power and reality."],"review-user":["enraptinreverie","paul-servini2","angellebon","jpoma5","magodobosque","okurs","fivefoxesranfast","deadly_farrel373","Alexander-T"],"review-date":["18 October 2005","17 July 2005","17 June 2005","26 June 2005","12 June 2005","1 April 2004","16 November 2013","23 July 2010","16 August 2007"],"review-rating":["7","9","9","8","7","7","10","8","3"],"review-title":[" loved: a tinge of surrealism.\n"," A charming film\n"," a film with purpose.\n"," Excellent Film\n"," Wooden Camera similar to the city of God\n"," Good Camera Work\n"," True to Life and not exaggerated\n"," A Simple Man's movie that somehow manages to keep it real\n"," Similar to City of God?\n"]}