{"review-url":["http://www.imdb.com/title/tt0490078/reviews"],"review-text":["The Lifetime channel aired this in October but I only got around to watching it now. It's the old eternal triangle again  small-town Connecticut boy Dave Ford (Matt Long) has a quick fling with his best friend's girlfriend, Emily Darrow (Emmanuelle Chriqui), on the eve of his departure for law school in New York, thinks about her for the next five years while he isn't doing contracts and briefs, runs into her again when he returns home after the death of his father on the eve of a big exam five years later, and gets involved with her romantically again. But director and co-writer Matthew Cole Weiss goes way over the top, framing the whole thing in flashback as Dave confesses to murdering Emily, her husband and another one of her lovers in front of (here comes the spoiler) a Lesbian cop who's also a flame of Emily's. Weiss overdoes the \"flanging\" effect by which Dave gets to see chunks of his previous life flash before his eyes even before he's actually dead, cutting those in even while Dave and Emily are having sex and thereby ruining the soft-core porn shots that give even some otherwise pretty lame Lifetime movies at least a bit of audience appeal. I couldn't help but flash back myself to James M. Cain and how much better he wrote women like this in his classic thrillers (all adapted into hit movies) \"The Postman Always Rings Twice,\" \"Double Indemnity\" and \"Mildred Pierce.\" It also doesn't help that the film ends with the bad guys (the bad girls, actually) triumphant and the decent, if naïve and stupid, hero seemingly on his way to the lethal injection table  or that the actors playing the people Dave and Emily are cheating on are both better looking than they are. Incidentally, though this film went straight to cable in the U.S. there were some blank spots on the soundtrack indicating where swear words were blipped, so I presume this got a theatrical release somewhere in the world.","All I can say is, this movie is made for the Lifetime Channel on TV, which means no solid characters, no particular style, weak acting all kinds of suggested sex but no-breasts and tushs (because boy, that would just catapult the film into the depths of sleaze wouldn't it?) but the heavily simulated sex, well, that's OK. When watching these films I have to ask myself, when will these types of TV channels and their advertisers ever grow up? I think these companies are actually way behind the times. They really have no clue what the younger generation is in tune with and if they knew they would demand we change. The whole point of many American TV channels like these seems mostly to regurgitate the same sanitized, diluded garbage over and over like a generic movie assembly line. I guess it works for them... or at least it has. Not sure about the future though. Don't bore yourself to death like I did. Seek out some real TV movies on HBO, Showtime, IFC, Starz, etc. Any channel that puts effort into their work and doesn't have to ask a priest what they can or cannot show.","I saw this movie considering this as a normal Hollywood movie but then came to know that its a Movie made for TV channel.On my DVD cover out of 2 critics comments one of the critic stephen farber from moviline reveiwed it as A best movie of the Year..All the character were simple and decent performances except the Brain's character which never gets scope which director wanted to keeps mystery till end.. there was suspense till end but when you see the end that lady Police Officer and main culprit had a Lesbian affair seems to be totally stupid idea.God knows what happens to DAVE the male lead character..The other Critic from Mr. Brown's Movies said that Shocking and Effective but doesn't quite live up to all the Hype... which i saw after watching the Movie .for which i was partially aggree...i should have read this first before taking the movie..","almost boring, white page for a lot of Hitchcock influences but without the science to use it, interesting actors and poor characters, a labyrinth with not solid walls, it desires present a smart story but , if, few parts can be nice, the whole construction s far t be attractive.one of many dusty movies, without real value but useful to remember old ideas of other directors. and occasion for actors to improve a story , fascinating as idea but not on TV screen. that is all. a film like many others, about nothing and for nobody. the sparkles, love story, pyramid of details are only pebbles in desert. because it is not credible and the script possibilities are almost imaginary. for the desire to be original using, in not inspired manner, old fragments in a chaotic puzzle.","I was watching the beginning of this on a Friday, mid-day, while working at computer at home, relaxing a bit after a hectic week, and cleaning-up some files and answering some communications. Got interrupted a couple of times, so had trouble getting all the details straight (although it's hardly a work of Hitchcock proportions, where missing a detail can through the whole story off-kilter), and besides it was not exactly an \"engrossing\" piece of work.So during a commercial, read the only prior comment here (by \"mgconlan-1\"), and pretty much can agree with its details.Not quite in the category of a film so awful it is fascinatingly \"good,\" but I'd like to catch on tape when run again (rather than seeing it as aired), so I can fast forward as needed and see the parts which I missed this first time.Give it a \"3*\" because of the attractiveness of the four primary characters.","I do not know what some of these filmmakers are thinking, by making the same type of clichéd film over and over, where the bad guys (bad girls in this case) win. Weak acting and very predictable. Nothing original about it. This same movie has been made over and over again- not different from GOODBYE LOVER (1989), SLOW BURN (2005), or at least ten other movies with the exact same storyline and ending. There are a lot of holes in the movie too. It is as if they ran out of money and just stopped filming. Or perhaps they ran out of ideas. But do not waste your time with this one. It will only leave you upset by having wasted your time watching it."],"review-user":["mgconlan-1","mike_panikhouse","makarand_coolkarni","Vincentiu","caa821","Tailgunner1944"],"review-date":["2 December 2006","24 September 2007","25 December 2007","16 September 2013","5 January 2007","8 February 2009"],"review-rating":["4","2","4","3","1"],"review-title":[" This is pretty bad even for Lifetime\n"," A movie trying to be erotic but isn't even remotely.\n"," Movie was OK till the end which was Pathetic\n"," white page\n"," Not a lot to recommend\n"," Waste of time. Such a cliché!\n"]}