{"review-url":["http://www.imdb.com/title/tt0442709/reviews"],"review-text":["The Royal Rumble has traditionally been one of my favourite events, and i've been a wrestling fan for a good few years now. The other shows may have better matches, but i've always found the actual rumble match to be full of excitement.I'm not going to reveal the winners of any match as i don't see it as fair to ruin the results on a review. I will comment on the quality of them though.We have the standard 4 matches, and then the big rumble event. Two from Smackdown and two from Raw.Shawn Michaels and Edge open up for Raw. This proves to be a good match from two talented guys. This is a match i'd recommend watching. It's hard to sum up without giving away the winner.Next we have the usual Undertaker against some big nasty monster, be whoever it is. Giant Gonzales, Yokozuna, Kamala... well this time it's Heidenreich. Its also a casket match. Typical Undertaker fare. Watch if you're a fan. I have to admit i am, purely for the entertainment factor. It can hardly be regarded as a classic wrestling match.The next two matches are the title matches. For once Smackdown manages to upstage Raw. Their title match is pretty thrilling and enjoyable, but with a anti-climax and let down to end it. Raw's match is a pretty dull and boring affair, which is a pity as i'm a fan of both guys involved.Now to the main reason i love the event, the rumble. It's a pretty good one this year. Coming up to the event we all had a pretty good idea of who might win, and it may not prove a big surprise, but hey, its very enjoyable. There are the usual diverse ways of people being eliminated. There is the token guy who doesn't make it to the ring, the entrant who is ridiculous and we all want to see vanquished, and someone gets eliminated by a previously eliminated combatant. It has its usual highs and lows, and i loved the ending, in particular the Vince McMahon entrance.I'd recommend this show. Not the WWE on top form, but its still good. Add it to your collection.","The 2005 edition of the Royal Rumble came live from the Save Mart Centre in Fresno, California. The two top Championships of the WWE were being defended, The Undertaker was battling Heidenreich in a Casket match, Shawn Michaels was taking on Edge in a grudge match that had been building up since last October and of course the every man for himself over the top rope Royal Rumble match itself. Who was going to take the price this year? Chris Benoit? Edge? Eddie Guerrero? Edge? John Cena? Batista? Edge? Shawn Michaels? There was no shortage of contenders.It was Batista that picked up the popular victory in the main event battle but not without controversy, or should I say, a botched finish. Batista and John Cena were the final two men in the ring. Batista was supposed to dump the young Smackdown! star over the top rope but it all went wrong and they both went toppling to the floor. The referees acted on their feet as we had an arm-raising contest similar to that of Bret hart and Lex Luger back in 1994. This brought out the chairman of the board. Vinnie Mac walked down to the ring the way only he can but injured himself badly getting into the ring. It was unusual to see Vince McMahon sitting, legs out, telling the two men to restart the match. Batista then did was he was supposed to do first time round and dumped Cena to the floor sealing his own future with a Championship match at WrestleMania 21.The undercard for this years Royal Rumble had a very solid line up, with many of WWE's biggest stars competing in matches. Each brand had two big matches each.Raw opened the night with the match between Shawn Michaels and Edge. This was a good technical contest. Back and fourth all the way until Edge got the pinfall. This was a smart booking decision and kept Edge as a contender to the World Heavyweight Championship.The second match of the night was the feud ending Casket match between The Undertaker and Heidenreich. The match was not a classic, but then again have their been any classic Casket matches? It was entertaining. Especially when Snitsky got involved and then Kane popped out the casket to a great pop. The Undertaker surprised no one when he got the win, slamming the lid on Heidenreich and this mediocre feud.The first of the two Championship matches of the night was John Bradshaw Layfields defence of the WWE Championship in a triple Threat match against both Kurt Angle and the Big Show. This match was very good. Again, not a classic but entertaining none the less. JBL took the win after pinning Kurt Angle. His celebration was short lived however when backstage teddy Long informed him at No Way Out he would defend the WWE Championship in a Barbed Wire Steel cage match against Big Show. Not a very nice way to spend a Sunday night.And of course there is no show without Punch. Punch of course being reigning World Heavyweight Champion Triple H. His rematch from Unforgiven 2004 with Randy Orton was lot better than the original encounter. It's a pity because they just don't seem to click to well in the ring and this would be an excellent feud if they did. Orton played the concussion role very well and went down in defeat to The Game.So the first big one of 2005 was a good one. It achieved its goals. Feuds ended and new ones began. We were now officially on the road to WrestleMania 21.","A respectable royal rumble event1. Edge Vs Shawn Michaels7.5/10 A very strong opener...edge's heel performance was sublime as it was during the rumble event ..overall id say EDGES NIGHT....2. Undertaker Vs Heidenreich CASKET MATCH7/10 a lot of people hated this rivalry though i liked it, i thought heidenreich really played his character well. the match wasn't amazing in excitement that was until kane and snitcky get involved .it gets better as it goes on.3. Kurt Angle Vs Big Show Vs JBL(WWE CHAMP) WWE TITLE MATCH7.5/10 a surprisingly good match , as there was only 1 really exciting in ringer in it ..angle of course......very good title match ..good pace.. though a predictable end .but aren't all royal rumble title matches predictable.4. Triple H (WORLD TITLE) Vs Randy Orton WORLD TITLE MATCH6.5/10 actually not that good for the guys involved, went on too many dry patches, orton sold his concussion amazingly, ending though was some what of an anti climax.5. ROYAL RUMBLE EVENT... btw during the other matches there were a few segments...two which were really cool ...cena rapping on Christian and guerrero stealing flairs number 30 entry ticket. the event was good 7/10 would have got a 9 if cena won but unfortunately my biggest enemy batista wins(THOUGH I UNDERSTooD WHY) ..vince comes down and takes a drop and the whole arena crack up in laughter.","The last pay per view in the WWE was New Years Revolution 2005. All the matches in that event were pretty poor other than the main event. This PPV on the other hand was much better in my opinion. The matches had good build up and anticipation. It is always good to see the RAW and Smackdown Superstars on the same show every once in a while.Match 1: Shawn Michaels vs Edge - This match was good as i was expecting. It consisted of many near falls and was unpredictable. I am glad that HBK put Edge over. Edge is doing great as a heel and he should be the next HHH in terms of main eventing. A great match with a lot of build up.Match 2: Undertaker vs Heidenreich (Casket Match) - I find this feud to be going on for too long now. And the fact that this match was a casket match did not provide any further satisfaction. Both men have their turns at dominating the match. This was the worst match of the night i think. Highlights of the match include the undertaker leg-dropping heidenreich while he was halfway in the casket. Another good part was Snitsky and Kane interfering. All in all boring match though. Taker wins much to no surprise.Match 3: Triple Threat (WWE Championship JBL vs Big Show vs Kurt Angle) - Does JBl have to go over the entire smackdown roster including the main events? His title reign has beem good in the beginning but now is becoming tedious and way too long. The match is good but is short. Nice bumps taken by all three men, including big show falling through the announce table and big show and JBL crashing through the guard railings. Disappointments include JBL cheating once gain by Interference. I think Angle should have won this he is a much more credible main eventer for Wrestlemania than Bradshaw.Match 4: Triple H vs Randy Orton (World Heavyweight Championship) Better than expected to say the least. Nice surprise to see Triple H win without cheating. Long match and Orton did do a good job of it. I got to love Orton's selling of the concussion. But it is time for this rivalry to end already. Royal Rumble match: There have been batter Rumbles in the past but this one was not bad. Somewhat Average. Batista wins it. The question is will he face Triple H or JBL at WM. The rumble match was a tad predictable as many people i know were picking that batista would win and he did. The good: Edge vs Michaels was a classic match.Batista wins. Triple H has a clean win for once in his life.The bad: The casket match, this feud needs to end ASAP. JBL winning over Angle.","This has to be one of the funniest RRs in recent memory. For me the best moment was when everyone in the ring stopped and ganged up on Muhammad Hassan. A close second has to be the one at the end when Mr McMahon came down to the ring and banged his knee on the edge and couldn't stand up (It was obvious everyone in the ring was trying not to crack up). And what about the ending itself, how the hell are they going to explain why the match was continued even though it was crystal clear that Batista hit the floor first (you could see that without the slow-mo). As my friend said at the time: Deny! Deny! Deny! In any case I'm glad Batista won. It's about time he got a push and all signs point to him becoming champ at WM21. In the last few months he's really gotten over with the fans, even though he's still technically a heel. Go Big Dave! the next World Heavyweight Champion!","Probably the best Royal Rumble in years.Match 1 sees Edge battle Shawn Michaels in a good but very long match. Next up one of the worst wrestlers on the roster - Heidenreich takes on The Undertaker in a boring casket match. Match number 3 sees Bradshaw defend his WWE title against Big Show and Kurt Angle in a surprisingly good contest. The next match up sees Triple H defending his 10th heavyweight title reign against Randy Orton in a great match up.Next up the Royal Rumble takes place in which 15 Raw superstars and 15 Smackdown! superstars hit the ring to try and win the rumble and face the champion whoever that may be at Wrestlemania 21. Highlights included Tough Enough 3 winner Daniel Puder getting his ass kicked by Chris Benoit, Eddie Guerrero and Hardcore Holly! All of the superstars beating the crap out of Muhammad Hassan, and Raw superstars vs Smackdown! superstars!Not a bad PPV at all.Edge vs HBK - 8/10 Taker vs Heidenreich - 4/10 JBL vs Angle vs Big Show - 7.5/10 Triple H vs Orton - 8.5/10 The Royal Rumble match - 9/10","The biggest Superstars of RAW and SmackDown! clash at Royal Rumble to determine who will go to WrestleMania 21 as the heavyweight contender. The Road to WrestleMania begins as RAW and SmackDown! present WWE Royal Rumble. WWE Royal Rumble of 2005 was another impressive Rumble match with a pretty good winner as well also which pretty much went on Wrestlemania 21 next and destroyed a big champion as a whole too. So overall i'd totally recommend this Rumble once again cause it's very good like the others too. (A+)","Edge Vs. Michaels-Boring in general (loved the sweet chin music into the chair) 4/10 Taker Vs. Heidenreich-One of the worst matches I've seen, predictable as hell 1/10 Tripe Threat WWE match-Why do I watch them, nobody ever wins a championship at the rumble, its not the main event. Liked it when Show drove JBL through the wall. 3/10 World Heavyweight Championship-Pretty OK match, kind of more a beat-down by Tripe H than a match, but I was happy to see it after watching crap. 5/10 Royal Rumble-Good Rumble,Liked the brand showdown,the Hassan thing, and the end. 7/10 Overall still crap. Why does anyone watch the rumble???","This Royal Rumble basically had the message of wrestling these days. Gimmick and image are more popular then wrestling ability.HBK vs Edge. Pretty good match. A lot of heat for Edge who was just starting out as a heel again and what better way to go into a match with HBK. It kind of got a little slower at the end then usual. Overall this match gets a 6/10. Undertaker vs Hedinreich. Not a good match. Undertaker had to carry Hedinreich through this match who seemed to be really lost and screwed up his moves. It did get interesting to see Raws Gene Snitsky and a bit later Kane come into this match. Overall the fans seemed more interested when this match ended. 2/10 Kurt Angle vs JBL vs Big Show. This match was slow at first but got pretty good at the end when Angle managed to speed up the match.Kurt Angle did some really good wrestling moves and proves he is the best wrestler out of the match. JBL and Big Show put on a slow match. The ending to this match was bad. Over all this match was a 5/10 mainlly because of Kurt Angle. Randy Orton vs HHH. Good match,surprising heat for Randy Orton who was the face in this match. Randy proved he can go the limit with any top star. This match also marked the first match HHH has wrestled where someone dosn't run down and save him from a loss. Over all this match was about a 6/10.Royal Rumble match was OK. Some surprises. Some not so good surprises. I was kind of upset that Kurt Angle wasn't given enough time in this match. But over all this match had a guy who I never thought would be pushed so soon. I won't tell ya who wins. I give this match a 8/10","This year's Royal Rumble wasn't really bad, but last year's was definitely way better.FIRST MATCH- SHAWN MICHAELS VS. EDGE Even though this match did take a little too long, it was still alright. Edge wins after using the ropes to pin Shawn Michaels. 4/10SECOND MATCH- UNDERTAKER VS. HEIDENREICH IN A CASKET MATCH Now I don't really like Casket matches, this match was boring & sloppy but in the end it picked up it's pace as Undertaker nailed the Tombstone then rolled Heidenreich in the casket for the victory. 4/10THIRD MATCH- JBL VS. KURT ANGLE VS. BIG SHOW IN A TRIPLE-THREAT MATCH FOR THE WWE WOMEN'S CHAMPIONSHIP Not a bad triple-threat match. Too bad JBL wins again to retain his title after nailing a Clothesline From Hell on Angle for the win. 5/10FOURTH MATCH- RANDY ORTON VS. TRIPLE H FOR THE WORLD HEAVYWEIGHT CHAMPIONSHIP Great match by these two men, the match was a bit sloppy but it was still good & it picked up pretty towards the end. Even though Orton lost the match was fast paced & great towards the end. HHH nails the Pedigree on Orton for the win to retain his World Title. 5/10FIFTH MATCH- ROYAL RUMBLE This was a cool Royal Rumble {Every Royal Rumble is good}. After all 30 men entered, the last four remaining superstars in the Rumble were Cena, Edge, Mysterio & Batista. Edge was able to spear Mysterio out, later Batista & Cena clotheslined Edge out together. It was now up to Cena & Batista. First after reversing an F-U, Batista went for the Batista Bomb but suddenly both men crumbled on the outside at the same time. After a controversial decision & Mr. McMahon making his way to the ring to settle the matter. The match was restarted again as Batista & Cena battled it out, but Batista got the better out of Cena, nailed a spine-buster & threw Cena out to win the 2005 Royal Rumble & go on to Wrestlemania 21 to face the Champion in the mainevent. 10/10 This was a very good Royal Rumble, but last year's would always top every Royal Rumble in history.Overall: I'll give it 8/10 & B+"],"review-user":["blinkchester","stitch_1981","Ikepoiyen668894","dominator2004-2005","gibranm","wrestlingsitewebmaster","BatmanFunReviews2018","nascarsucks","SteveDonnachie20022001","kliko400"],"review-date":["30 April 2005","17 August 2006","19 September 2005","7 February 2005","30 January 2005","16 June 2005","16 October 2018","29 September 2005","29 May 2005","8 January 2007"],"review-rating":["7","8","7","8","10","4","7","8"],"review-title":[" Not brilliant, but definitely worth a viewing\n"," Batista seals the deal at the West Side Rumble\n"," Royal rumble 2005\n"," Quite good which is rare these days (Spoilers)\n"," Hilarious!\n"," Royal Rumble 2005\n"," Must See!!!\n"," Bad, Bad, and Bad\n"," Not the best Rumble ending but pretty good\n"," Not a bad Royal Rumble at all\n"]}