{"review-url":["http://www.imdb.com/title/tt0439179/reviews"],"review-text":["\"Fat Girls\" is among the worst films within the indie gay genre.The premise is promising: an average-looking gay teen is trapped in a repressive small TX town. His only kindred spirits are the other village HS misfits: the class 'fat girl', a naïve immigrant from Cuba, and the sensitive drama teacher. So far, interesting. In theory, this plot line creates a decent setup for an appealing coming of age story with a built-in audience---the thousands of gay men who grew up in small towns across America and experienced this adolescent anxiety first hand, peppered with a dose of self-deprecating humor.Unfortunately, rather than a nuanced dramedy, Ash Christian approaches his autobiographical subject matter with a poorly executed attempt at irony and dark humor. The result is a cast of unlikeable, derivative, two-dimensional characters which the viewer cannot but help feel indifferent toward. Sabrina (Fink) is a quasi-Goth bitter navel-gazer. She is such a prickly, unsympathetic person; there is little doubt as to the reason for her friendless condition. The chemistry between her and Rodney (Christian) registers zero. This may have been bad casting, but is more likely due to a screenplay which is simply unsalvageable. Consequently, one is left wondering when there is such a non-existent bond, what could possibly warrant their near-constant companionship throughout the story.Sabrina's newfound boyfriend, Rudy (de Jesus), and Rodney's mother Judy (Theaker) are among the most exaggerated of the clichéd stock characters ripped off from dozens of other films. Rudy is the horny undersexed immigrant/nerd lifted directly from every raunchy adolescent \"comedy\" ever made within the realm of TV or film. Judy is the born-again obsessed with Jesus- talk and big hair. Just when you thought the Tammy Faye thing had been done to death, Christian inserts a scene where Judy's mascara is running with her tears! Is there anyone in the civilized world that can possibly think this tired old stereotype gag is still funny after seeing it ad nauseum for 20 years?In addition to the failed attempts at sardonic humor, there are many puzzling story inconsistencies. Rodney considers himself a \"fat ugly\" loser. However, he simultaneously manages to participate in casual and regular impromptu trysts with the ubiquitous school jock/hunk, Ted (Miller). Although these liaisons are devoid of emotional fulfillment, most gay teens (filled with raging testosterone, just like their hetero brethren) would find this to be a rather enviable arrangement given the more common alternative of involuntary celibacy.Rodney finds an object for his affection in Bobby (Bruening), an exotic transplant from England. Against all believable odds, the lad not only happens to land in this tiny TX hamlet, but is conveniently openly gay to boot. Like Sabrina, Bobby is an icy, angry smart aleck and the viewer is left head-scratching as to his magnetic appeal. Much to his delight, Rodney is invited by his new crush to the town gay bar, where Bobby claims to be the DJ. Upon arrival, the boyfriend-to-be promptly leaves Rodney solo and heads off to another area of the bar for a quick encounter with a rather handsome young man. This is yet one more of the ridiculously inexplicable plot elements since Rodney's feeling as an outcast are supposedly derived largely from his lonely existence in a parochial town. As tiny as the town is, they have openly gay students at the high school? A secretly bisexual football captain? Lesbian moms? A Gay teacher? and it has a gay bar downtown (patronized by attractive men, no less)? Apparently, the place is not so backwater after all.Ten years earlier, Todd Stephens' \"Edge of Seventeen\" covered nearly the same material with a much more creative, honest, touching, and humorous film.","I had read up on the film and thought it would be cute, a feel good Saturday night movie. I wasn't expecting anything great, figured it would be mostly fluff but hopefully not a totally bad experience. I have to admit I was pleasantly surprised.The dialogue was pitch perfect, most of the actors were exceptionally good and it flowed nicely. Ash Christian was perfect, his ability to turn an awkward moment into something touching was nice to see. He could have turned this character into something we've all seen before but instead strayed away from stereotypes and focused on the wittiness of the character. It was wonderful to see Jonathan Caouette again, I didn't know what he would do after Tarnation. Ashley Fink is gem, a great young character actress that hopefully will get more work.There are moments in the film that could have used some work, but all in all not a bad time at the cinema. My friend described it as a gay Angus/Napoleon Dynamite but it's something more than that. It's a character study into what it's like to grow up gay in a small town, the pain is there but the humor behind that pain (that only age can make clearer) is magnified. I look forward to seeing more of Ash Christian, Ashley Fink and Jonathan Caouette soon.","I caught this film at an OutFest screening in Los Angeles in July, 2006. It's rough around the edges (sound recording in particular is wobbly) and often very funny. The script is rather jarringly episodic and ends abruptly, but Ash Christian infuses the film with lots of genuine heart. It's also a refreshing change of pace to have a gay film that doesn't star underwear models obsessed with partying and chasing straight guys. Props to a warmly sympathetic Jonathan Caouette as Mr. Cox, a kindred spirit to Rodney (Ash Christian), the lively and spirited Ashley Finke as Rodney's best friend, and Deborah Theaker as Rodney's mom, who is given the best one-liners in the script and steals her every scene. The film is like its writer/director/starlumpy and a bit odd, but also very sweet.","My friends and I saw the movie last night in Austin at a showing for AGLIFF (a film festival). This movie was one of the best I've seen this year. It was a great comedy - very original and heartfelt - and FUNNY AS HELL! Everyone in the audience was laughing throughout the entire movie. Texas is a big state - with LOTS of small towns - and of course, plenty of teenagers who grew up as \"fat girls.\" I know a lot of people will relate to this film on a personal level. Ashley Fink and Robin de Jesus were awesome - they were so great in these rolls, it was like the script was written with them in mind. And speaking of the script, it was very well written (very believable), and Ash is a great actor (his facial expressions alone made me giggle). It IS an independent film - but don't let that fool you...It's a good one! Seeing this caliber of work from someone so young is truly inspiring.","This is a movie, that has all the basic elements of its genre. It makes you wanna cry, it makes you laugh, it disgust you, it makes you angry etc. The topic of the story is fortunately not about some disease or drugs, what is the common trend in gay themed movies in these days, but it focuses on the social interactions between characters what could be considered not to be in the high school elite. The play and the direction could be a little bit more sophisticated, but on the other hand it's somehow better so, because it really shows the distress of the characters, that they are experiencing. If this was intended, then this is a remarkable job and assuredly an achievement, specially for such an young director. It's actually a good story that gives you a little inside into, how it is to be a fat girl and to acknowledge it to yourself.","The premise of the film was very promising - sort of a gay Napoleon Dynamite type of film. And to be fair, there were some funny moments and funny lines but it really wasn't very good overall. The script and dialog felt like a local sketch production, full of clichés and scenes that were predictable.However, there was enough that was amusing, that I stuck around to see how it finished, since there were hints that something special happens at the end. But it seems that either the film ran out of money or the writer ran out of ideas because the ending is extremely abrupt, almost skipping directly from what looked to be the key conflict in the film to the final credits.Overall, it was very disappointing but not completely unwatchable...","This movie has been done before. It is basically a unoriginal combo of \"Napoleon Dynamite\" and \"Sordid Lives.\" There are some funny bits, but otherwise it is a cliché bore. It is a good first film attempt and the director (who also stars in and wrote the feature) shows a lot of promise. But the writing was kind of choppy and the story was not very original. I swear I had heard some of the lines in other films. However, the acting was very good and the film was shot in an interesting way. It is also refreshing to see gay-themed movies not be so bogged down with political correctness and tired stories of angst. The main character seemed fairly well adjusted for a gay teen in rural Texas so no saccharine, coming out drama here!","I wasted enough time actually WATCHING this chore of a movie, I don't want to waste more writing a big review. Not once did I so much as crack a smile. ALL the jokes were boring, forced and lacked any kind of wit. I kept saying, \"wheres the punchline?\" Almost every single character was an obnoxious stereotype and all the situations were clichéd and half the time there wasn't even any kind of solution. Things just happened to get to the next scene. For the life of me I can't understand how this got as many good reviews as it did. If you like clunky acting and poorly composed film making Fat Girls is the movie for you.","I saw this last night in Fort Lauderdale. In general it was funny and I liked the characters especially Sabrina. The acting is good and the story line was OK except for the ending which left way to many strings dangling and we were like (what?) I wanted to know what happened to the characters and it was a strange ending that could have been done so much better.The film did portray rule life really well and we laughed throughout. It has flaws that is for sure but for a first time film for Ash Christian I thought it was good. You might want to wait for the DVD on this one. But if you get a chance to see it give it a shot","If you go into this knowing that it's basically some kid's film project, it's fantastic! Or, it's fantastic if you were drunk while watching it like I was the first time. It wasn't so great 10 years later when I was sober.It was written, directed, and starred 20-year-old Ash Christian, and it was obviously a school film project that was cultivated during his teen years, and was somehow granted a bigger budget than could be achieved in high school. The bigger budget wasn't really needed as it's nothing you and I couldn't do with our phones and friends. Though I'm sure renting prom props wasn't cheap.This is a fairly entertaining movie if you like movies that rely only on the verbal exchanges of supposedly witty teen angsters. It's got no real plot, but the general idea is something about the slice of life revolving around the prom. People have compared it to Napoleon Dynamite, but there's a heavy dose of a Will & Grace inspiration, but if Grace was overweight instead of underweight, and Will got laid.None of the 20-somethings who played the teens look young for their age. Ash doesn't look like a fresh teen, but a man in his 20s who has been sleep-deprived and stressed out from being a triple threat on his first real movie project.However, if you do enjoy this movie, I recommend watching 29th and Gay. It almost seems like a sequel since they seem so similar."],"review-user":["glennh69","scott82-3","Turtle-48","boxergirl75","jernej_n","lhhung_himself","missamerica1974","blackismylove","jbarnes-10","NostalgicMom"],"review-date":["23 September 2008","7 May 2006","15 July 2006","4 October 2006","12 March 2008","17 February 2008","24 June 2006","2 December 2009","31 January 2008","26 February 2017"],"review-rating":["1","8","8","8","9","2","2","2","7","5"],"review-title":[" Beyond Bad\n"," Surprisingly good\n"," Rough-edged, but sweet\n"," Very original - VERY funny!\n"," It has anything you expect from a movie\n"," Really wanted to like this - but...\n"," A Cliché Bore\n"," Fat Girls.\" Im on a diet to lose about 60 minutes.\"\n"," Funny but flawed\n"," Watchable\n"]}