{"review-url":["http://www.imdb.com/title/tt0471032/reviews"],"review-text":["After a weekend of Hammer Frankenstein films, I decided to take a chance on this flick, whose description claimed it was a tribute to Hammer Studios. \"Sea of Dust\" got the look and feel right, but fans of those old movies should know that it's nothing like its predecessors.The biggest problem with the film is this preconception that it's supposed to be structured like a Hammer film. It starts out like that, with a medical student called to a small town to help investigate strange goings on.The next thing you know, it becomes a totally different kind of film. It's funny in spots. It's a complete bloodbath in others. It seems to be winking at its audience, but is so intent on being unusual that it sometimes loses focus.This is not a film for the easily offended or people who don't like weird cinema. It takes some pointed jabs at politics and organized religion, which I found pretty entertaining on the eve of another worthless election, but might rub others the wrong way.","There I was on vacation when my host suggested we take in this B-Movie festival in Breda. I was resistant, as I hadn't gone on the trip to sit in a movie theater, but I've got to admit that I don't regret a second of this one (especially with Stephen Malkmus' contribution). It probably helped that I had no idea what to expect.SEA OF DUST starts out like a typical costume drama. We've got a young medical student going to help a doctor whose town is being destroyed by a crazy plague (which somehow involves exploding heads). On the way, he stops to visit his fiancé and gets thrown off the property by her father. Traveling on, he finds a girl lying on the road, another plague victim, and takes her along to the doctor's. Yawn, I thought. It all seemed pretty predicable.And then everything went crazy and it suddenly turned into a completely different film. Tom Savini shows up looking like Dracula, characters begin traveling to \"the other side\" of reality, and the dialog gets increasingly humorous.And just when I thought it had settled into a groove, the picture changes again, becoming really dark and bizarre. I won't spoil it for first time viewers, but there's an amazing sequence about hollow people, lots of chat about the abuse of religion by society, and some over-the-top gore effects. And did I mention Stephen Malkmus? This isn't a perfect movie (in case you haven't figured that out from its appearance at a B-Movie festival), but it's well worth the time for adventurous viewers. Great visuals, cool soundtrack, lots of interesting ideas. The acting is a little zany at times, but I think that's the point.Funny I had to go to Breda to see find an American picture that looked like a British horror movie. You figure that one out...","I saw SEA OF DUST as part of a NYC screening audience several years ago. I enjoyed the film at that time, so I was a little confused by some of the amendments that had been made since. Perhaps it's my memory, but there seemed to be chunks of exposition missing from the version that was shown at the Rhode Island Film Festival. I'm really not sure which version I prefer, but I can honestly say that I found something to appreciate it both.Let me begin by warning everyone that this is not a popcorn movie. Although it's been promoted as a Hammer Films tribute, people expecting a showdown between Van Helsing and Dracula are going to be sorely disappointed. There's some cleavage, but no nudity (a staple of the British production house's later movies). And while SEA OF DUST is filled with gorgeous eye candy (it really is shot like a sixties film), and features Hammer starlet Ingrid Pitt, it's not like any of the company's pictures in tone or execution. This film is very dark, very confusing, and (at times) very funny. I don't remember the earlier version being quite as nutty as this one, but that's not a bad thing (especially the showdown in the Black Forest that plays like a Three Stooges short). And some of Ms Pitt's rantings are quite entertaining. It's like somebody wound her up and turned her loose.The uniqueness of this film doesn't lie with the borrowed details, though. It's in the ideas. As an occasional Sci Fi Channel viewer, I've regularly taken the network to task for its one-note variations on a theme (CGI monster kills, then gets destroyed). SEA OF DUST is so full of ideas that you start to trip over them after a while.But don't get me wrong. I'm not complaining. If anything, I applaud these guys for making such an enterprising low-budget picture and for having the courage to pack it with so many concepts. It's not going to be a picnic for people who hate to think at the movies (you know who you are). But for the rest of us, those of us who are tired of the formula of modern horror films, the predictability, the lack of respect for the audience, this may just be your ticket.","Tom Savini plays an imaginary Christian king who is trying to mount a war against nonbelievers. He does this by kidnapping people's souls and torturing them until their bodies comply. Brilliant stuff but then the film throws so many ideas at the wall that it is impossible to keep up.I will say that the filmmakers deserve praise for getting a good performance out of Savini. Having seen some of his other low budget pictures, that couldn't have been easy. Likewise Ingrid Pitt, who they manage to flatter with some great photography.The main problem with Sea of Dust is also its main strength. It seems determined to be completely different, even if it has to do it at the cost of the characters. For a film to be involving, there has to be somebody to identify with. This is an original idea. It needed more work to be a great film.","This movie is a homage to Hammer films, which means it was made by guys who watched a lot of Hammer films and just didn't get it.What we see are a lot of period costumes and a typical period town where something monstrous is happening....And if you stayed awake up to this point, you were doing better than I was...Terrible acting, bad sound, seen better stuff on YouTube.Ah, but I think I can fill out my requisite ten lines talking about Ingrid Pitt. Ingrid was a big Hammer star about the time Christopher Lee and Peter Cushing were, and she had no compunctions about taking off her clothes to sell the movie. In this movie, she's old, fat, clearly hasn't worked in a long time and the only nice thing I can say is she DIDN'T remove her clothing. Because once you've seen it, you can't unsee it.","I think that some of the other reviewers are being overly generous in their praise for this movie. The current rating from ALL users is much more accurate.As others point out, this is an homage to the Hammer films of fifty years ago. Unfortunately, it is an homage only in the camera-work, wardrobe, settings, and subject matter. It is very disappointing to see the majority of the film shot in broad daylight, completely missing the beautiful lighting and cinematography that Hammer used to convey a sense of gloom and claustrophobia. I also think it would have been far more effective if shot in B&W, but then how would you show off Savini's FX? The acting and dialogue are both quite bad. There's no single character who I found to be even minimally authentic or believable. Savini, as a weird Dracula-like religious figure, is waaay out ahead of everybody else in the bad acting department. Simply no contest. Fortunately, he's on-screen only for a short time. Unfortunately, nobody else is really much better than he is.As for the plot...wait, what plot? This movie makes \"Primer\" look fairly simple. There are dream sequences (or \"otherworldly\" sequences, whichever you prefer) within dream sequences, and you never really know what the director's intentions are. The satirical elements are extremely heavy-handed, and the entire script strikes me as something that a high-schooler would write after he reads his first philosophy of religion book. You can tell because the script uses the word \"ideology\" instead of \"religious belief\" or \"faith\" or any of a number of more accurate and descriptive terms. In other words, the characters are implementing an \"ideology\" and not just hare-brained religious ideas. The whole thing just rings false.Finally, let's get to the gore. There's lots of it, but it's really pretty poor. Savini has done much better work. I guess he was just distracted. As far as the need for the gore, there isn't any. The movie starts out as sort of an explanation of religious belief, then devolves into a gore-fest that's punctuated by weird ideas of what constitutes a myth.All in all, a very poor showing and not worth your time. On top of everything else, it is BORING!","Remember that friend in college who always insisted you rent the weirdest movie possible? This is the movie he would have made if he'd had the chance.I wish I could tell you exactly what Sea of Dust was about. It pretends to be the story of a doctor who gets sucked into weird goings on in the \"Black Forest.\" He goes there to help, but ends up being caught between two young women, both of whom he seems to have a thing for. But that's just scratching the surface. This is the kind of movie where things just randomly happen...and not nice thing. People are constantly being whipped and stabbed. There's a pair of creepy little girls who appear to have walked out of The Shining. Tom Savini is some kind of imaginary religious figure who decides he doesn't want to be imaginary anymore. He's got a plan to take over the world by sharing Jesus suffering.On some level, this is a movie about sex. It's one without nudity, which was a disappointment, but there's no mistaking the intent. On another whole level, it's a stoner's paradise. Unexpected stuff happens so often that it stops being unexpected. By the time the doctor travels through his girlfriend's birth canal to be reborn, you'll just chalk it up to the crazy nature of the flick.On the down side, the film is pretty wordy. Some of the points are hammered home over and over. If you're watching it with a bunch of stoned friends, this might prove an asset.","Just saw this at the Madison Horror Film Festival and was disappointed. A few shocking, funny moments (fisting the hollow Carla, a urinating harpy in the Dreamland) and two competing interesting premises (similar to New Nightmare with belief bringing a mythical character to life and also Lost Highway with a man living out a fantasy in his head) but had long stretches of no movement and incoherent plot development. Just because you use the framework of dreams or a mental fugue state doesn't make it Lynchian. You need the compelling visuals and creepy performances.Positive things: Dr. Maitland had real comic timing and all the girls were very cute. Carla's Father, Chalmers, and Ingrid Pitt looked like they were having some fun. And Tom Savini at least looked like he had his lines memorized and we couldn't see if he was just reading cue cards.I get the Hammer references, but it looks like the director realized the script was a snoozer and just added some shocks to try and get some laughs out of whatever footage he could put together. But they don't work because they're too few and far between and create an inconsistent tone. Condense this to 30 minutes of all the fun parts and you could have a surreal goofy short, but at feature length, skip it. It's not \"so bad it's good\" it's just \"so bad it's boring\".","Synopsis:Some weed in a costume (Troy Holland) is whining to some older bloke about some thing and Prester John (Tom Savini) gets mentioned. Prester John lives on the other side. I'm not sure what other side they mean but I might have drifted off at that point.The weed then goes to a big house full of costumed loonies where he tries to propose to some bird he loves and then gets thrown out by daddy loony. After leaving the house he finds an unconscious woman on the road and takes her to a doctor to be tied up, a service rarely offered in modern socialized medicine. Then he takes her home where her dad tries to kill him for tying up his daughter but he kills the dad and then some truly pathetic special effects take him to beach where he gets hooked and taken to a castle full of loonies presided over by Prester John who recruits the weed into his army as his general – amazingly rapid promotion especially since from then on all he bangs on about is stopping Prester John.This film is very badly written and the story is incoherent and making anyone watch should be considered a form of abuse. The acting is so awful that there are scenes littered with corpses and they can't even act dead convincingly.Tom Savini really is very hammy in this with a big purple cloak that he swishes around a lot. There is also Ingrid Pitt who seems very lost and confused and that wasn't much to do with her acting. I really cannot think of a single redeeming feature of this film and I cannot recommend it at allRating 0/10","I watched SEA OF DUST at the Rhode Island Horror Film Festival in Providence. It was the Festival's featured film and won Best Picture out of I think a couple hundred entries. The director and a few of the stars answered questions after the showing. One star, Suzy Lorraine, was even hotter in person than in the film, and she was an eye catcher in the movie.This film is independent, yet it has a lot of cinematic touches that give it a quality feel. It even has an original classical style musical score.I am a Savini fan and he's the star villain here, in black cape, he's more of an evil force than a real person I think. He is sucking the souls out of people and using them as soldiers in a twisted attempt to establish his version of the Kingdom of God on Earth. In his view, Christ was all about suffering and Savini intends to make everyone suffer.The main story line that holds your interest is about a young doctor, Stefan, who is sent to investigate the strange events Savini is causing in an isolated town. He proposes to an aristocrat chick on the way but her SOB father tells him to get lost. Then he meets up with a strangely possessed but alluring country girl. I think she falls in love with him, but she also tries to kill him, as do a number of hot women in the film.I found the scenes shot in the woods to be the creepiest and most eye catching, with strange people along the road (the evil little twin girls scared the hell out of me).The film has a lot to it, too much to list. There is a lot of blood, torture and gore. Hot chicks licking blood off of guys' fingers. A terrified girl's head explodes. That was unexpected. Throats get slit. Some brutal stabbings.Then they play it for laughs sometimes, poking a bit of fun at the whole evil black forest genre.If you're a fan of Hammer films and Ingrid Pitt, it is fascinating to see her in this movie. She offs one of the leads by plunging a cross in his skull. Excellent. The guy who played \"Multiple Miggs\" in Silence of the Lambs is great in an axe fight.The movie is surreal and with the ending, I'm not sure the events happened or if they were in Stefan's head because of his rejection by his would-be fiancée. He returns in vengeance and that scene is brutal.The director also talked about the theme of religion being misused to back wars and killings. I can see that for sure, Savini's view of religion was scary.This was a strangely exceptional movie with some stars like Savini and Pitt, a lot of good supporting cast including hot babes, great gore scenes, action, and all the time you're wondering what the hell is going on and what is going to happen next.This deserves ten stars because it's an excellent independent film effort, I don't think it was low budget but it had to be way less than a big studio budget, and yet they managed to make something really attractive, unique and thought provoking.","An imaginary Christian deity is brought to life through the belief of his followers and promptly proceeds to judge them in kind.PROS: This is one gorgeous picture. It's also packed with ideas and so much surreal imagery that it meanders a bit, but fans of head movies will get a kick out of it. I saw it with a festival audience who voted it Best Feature for the second time running, which speaks volumes for its uniqueness and quirky humor. For those who want to look, there are also a few messages about organized religion. Just be prepared to take a time machine back to the early days of midnight cinema, because they don't make films this strange any more.CONS: The film's dreamy surrealism is often sandwiched between scenes of brutal gore and endless wordiness. There's a weird juxtaposition. Ideas and characters seem to spring out of left field and then disappear again. For example, what's up with the urinating harpy? Who saw that coming? This definitely isn't a film for the easily offended.","I also attended the RI International Horror Film Festival and I can easily see why this film won best of show.SEA OF DUST is a wild romp of Horror, Comedy and beautiful scenery. A back in time tale of strange goings on. An increasingly wide spread illness with an overwhelmingly irritating side effect of people's heads exploding, brings a young Professor's apprentice; Stefan, to investigate. Along his travels, he decides to briefly detour and once again ask for his long time love's hand in marriage, only to once again be sent packing by her extremely stubborn father Along the way \"out of town\" he comes across an ill girl in the road and delivers her to Dr. Maitland, (brilliantly played by up and coming Vincent Price like actor: Edward X Young.) Who fills Stefan in on the Evils a foot. Only the Dr. is insulted that he had called for the Professor and only received a boy in trainingNone the less, Stefan turns out to be much more than a common bystander. Horror Icon; Tom Savini portrays the ultimate religious torment monger; Prester John. Scream Queen; Ingrid Pitt comes out of retirement to give a stellar performance as Anna. Many beautiful and talented supporting actors seamlessly held the story together and helped to effectively move it along to the climax.Dark Religion and over the top, but fun and sometimes very original, gore scenes play heavily in this Hammer tribute flick. This stylish movie goes back and forth between flashbacks, surreal worlds, dreams and the character's reality.Horror and Gore aside; This is also a very Funny movie! Slapstick, tongue and cheek humor and dark comedy raise their heads among the dark story line. Like others have stated; this really is like three great movies in one. Very Entertaining and Original.","My husband and I had big disagreements about this film. He felt it was like the second coming and I felt it was kind of offensive.Like a number of other movies at the Rhode Island Festival it looked like an older movie. Instead of being a black and white silent movie like THE CALL OF CTHULU, it looked like a horror movie from the 1960s. It wass very colorful and as much as I hate to admit it, it was really beautiful to look at. The music also added to the feel. You don't hear stuff like that anymore.There were some problems with it though. In case my headline didn't tell you, it is terribly bloody. A girl's head blows off before you're a minute into the movie and that's just the start. The hero gets stuck in the throat with a hook, people have their skulls stabbed with knives and pitchforks, and I won't get into some of the other stuff that goes on. My jaw was hanging open for most of the time.The biggest source of our disagreement was that I couldn't tell what was real and what wasn't. I couldn't tell if the hero was imagining everything including the people around him or if he was giving in to the evil forces. This was another time when my husband said, \"That's the whole point.\" I still think it was kind of insane.I might have given this movie a lower score, but the cast were so nice during the question and answer session that followed that I couldn't help but like them. They also helped explain some of the religious symbolism that was really bothering me.To be honest, I'm not even sure this was a horror movie. There were a couple of moments when I laughed out loud, a lott where I shrank down in my seat because of all the blood, and a few others where I shook my head and said, \"Where did that come from?\"","I met Ingrid Pitt at a convention many years ago and found her to be engaging and entertaining. She took time to chat with me, more than I can say for some of the other celebrities at the event. I was sorry to hear about her death last week. It did focus my attention on some of her recent films that I missed.Let me start by saying that I can understand why this would be an easy film to dislike. It's confusing and unfocused. As other reviewers have pointed out, it's brutal in its assessment of organized religion. It's not much more flattering of America's current political circus. I can see how it would offend a lot of Conservatives, which may account for the IMDb score in spite of its excellent web reviews.That's not the reason I signed up for IMDb to write this review. I wanted to respond to the insulting notion that the only value Ingrid Pitt could bring to a movie was her nudity. This idea not only insults Ingrid's memory, it insults all women. The sad thing is that I've not only read this type of review on IMDb, but in professional reviews. Maybe I'm looking in the wrong places, but I don't see reviewers making fun of Jack Nicholson for getting \"old and fat\" and complimenting him for not taking his clothing off. It's pathetic that this can be used as the justification for disliking Ingrid's performance, let alone disliking a film she is in.In summary, Ingrid was great and the film was much funnier than I was led to believe it would be.","I loved Sea of Dust! A wild, unpredictable,film with the Legendary Tom Savini and Ingrid Pitt,how can you go wrong? Though my favorite villain was Pete Barker as Chalmers the mad butler.He reminded me of Phantasm's Tall Man. Sea of Dust might have had some political messages,but they went completely over my head.I was too busy enjoying it as a trippy nightmare set in the 1800's. Speaking of which,the locations were awesome.Their real historic locations look much better that the CGI backgrounds that saturated the recent \"Wolfman\" movie(which made me feel like I was watching someone play a video game for two hours). Prester John reminded me of Lovecraft's Nyarlathotep.A crazed entity from beyond, out to devour our reality,taking the form of a Medieval heroic figure. Judging from the Necronomicon-like grimoire that held Prestor's secrets, He may have actually been one of Lovecraft's Yog-Sothery.","After writing reviews on two similarly themed but larger budgeted movies, Inception and eXistenZ I felt the need to give this nutty little picture its due. If it owes a debt to David Cronenberg's eXistenZ it is one tempered with lots of love for Hammer Films and lots of anger at the American political system.The story concerns an 18th century medical student who becomes trapped in a village that has been taken over by a myth. It is equal turns funny, violent and sexy. Like Inception and eXistenZ, it deals with characters traveling through multiple layers of reality and struggling with how they define their own existences.Less you think that I am being sacrilegious by comparing Sea Of Dust to Cronenberg and Nolan's more accomplished films, all you have to do is note that the Sea of Dust catch phrase \"Take the leap of faith\" shows up repeatedly in Inception. Coicidence? Probably, although the two films share a lot more than just a catch phrase despite Sea coming out years before its bigger budgeted cousin.I bought this after reading so many web reviews extolling how different Sea was. I can vouch for that but let me forewarn you that it will also prove offense to the Fox News generation, which may be why it has such an undeservedly low rating on IMDb.","The first movie at the Fangoria Festival in Vegas and the most challenging. It's not a movie for everyone. A number of the films that followed used predictable classic horror formulas to tell predictable stories. This picture seemed determined to do its own thing.Tom Savini showed some comic chops as the over the top villain. He dominated every scene he was in, flipping his cape about like Leslie Neilson playing Dracula. It was great to hear his explanation after the film. He had such a good sense of humor about the role.I was glad I didn't have too many preconceptions going in, because the movie offered a lot of surprises. The story was funny and profane and unusual. There was a lot of love lavished on the look. Most important, it had a weird edge to it. Unlike many of the movies that followed and tried to use a similar classic horror style, this was a movie that used its look for a purpose.There were a lot of movies at the Fangoria Festival with bigger budgets, but none that dared to be this different."],"review-user":["tommyknobnocker","jimmygeekrock","bobwildhorror","kinglouie40","JoeB131","innocuous","cougarxavier","mike-2272","peteranderson975","eflegal-1","georgeislive21","management-19","mrstafty","IngridFan","Ghoulman24601","monstermanforever","locohombre80"],"review-date":["2 November 2010","9 October 2008","29 October 2008","21 February 2009","5 September 2010","19 October 2010","6 December 2008","5 October 2009","20 June 2011","13 November 2008","24 January 2014","17 November 2008","1 November 2008","3 December 2010","8 September 2010","22 August 2010","13 November 2009"],"review-rating":["8","9","9","6","1","3","8","2","1","10","8","10","6","8","9","8","9"],"review-title":[" Won't Be Everyone's Cup of Tea\n"," A Funny Thing Happened on the Way to Amsterdam....\n"," Heavy Concepts and Hammer Nods\n"," Flawed but worth a look\n"," Cure for Insomnia\n"," Not as good as some reviewers would have you believe.\n"," Ultimate Stoner Movie\n"," Did Savini and Pitt Owe Someone A Favor?\n"," Is there a prize for getting through this film?\n"," A HIigh Quality Independent Horror Mind Bender\n"," Who Saw That Coming?\n"," Best of Show!!!\n"," Insane bloodbath\n"," Strange But Funny Film\n"," I Love Sea of Dust!\n"," Unusual and Unique Mind Mess\n"," Unpredictable and Humorous\n"]}