{"review-url":["http://www.imdb.com/title/tt0436992/reviews"],"review-text":["You looking for Sci-Fi? It's got it. Action? It's got it. Drama? That too! This show has got it all. With tastes of Horror, Romance, Mystery, even some Western. It really depends on the episode. While not episode is perfect, every episode can be appreciated. While the main idea of the show doesn't change, the show has experimented in many ways. The show is ever changing, with the main cast being swapped every few years. With such a big history, there's a reason the show still stands strong to this day. The episodes give nods to the past, and hints to the future. With this capability, it truly has an infinite potential. This show truly has affected my life in ways I'd never believed. I went into the show believing it to be a cliché, boring Sci-Fi (I'd never been a fan of the genre), but after just a few episodes I was absolutely hooked. With each new main character added, you quickly learn to love them, despite your disbelief in the ability to after such a heartbreaking exit, which I'll get into later. The characters are written brilliantly, and by the end there run, you always say that the next person coming along will never be as good. Every time, your proved wrong. While everyone has their favorites, each Companion and Doctor have moments to shine, and are all brilliant in their own way. This show truly is something special. I'll support this show for decades, and I give it a very easy 10/10.","For as long as I can remember, I've heard about the good Doctor, references, inside jokes and the like. Such as \"Real Daleks don't climb stairs, they flatten the building\".The quandary was this: Where do I begin, with thousands of episodes aired? I was afraid of getting myself into something deep, dense, voluminous and possibly repetitive, impossible to get back out of.The very simple yet belated answer was, of course, by accident.On one of those sleepless nights, flipping channels, I saw astronauts in a Victorian library, and was immediately intrigued by the weird homage to Kubrick. Before the commercial break, I was treated to electronic ghosts and invisible floating piranhas.Then this absolute beauty comes up, I paraphrase - \"You've been living in a computer simulation, your physical body is elsewhere\" - \"But I've been dieting\"Bleak, subtle and sophisticated humor? Check, and count me in.As it turned out, I had stumbled into the middle of a Sy-Fy Channel short marathon of Doctor Who. I resisted going to sleep until the damn thing ended five or six episodes later, at ten in the morning.What wildly imaginative premises, what a high-quality level of writing, what a gem this is! There is serious brain-power at work here, courtesy of the BBC yet again, on a continuing heroic mission to sacrifice short-term profit for long-term legacy. As evidence, I present \"Monty Python's Flying Circus\", \"Tinker, Tailor, Soldier, Spy\", \"The Singing Detective\", \"Brideshead Revisited\".From what little I've seen in half of a short marathon, Doctor Who deserves a ten out of ten.","I cannot believe it's been back on our screens for ten years, it seems like only yesterday the show returned with Rose.What I've loved so much about interacting with people on IMDb is that no series seems to split opinion more then Doctor Who, fundamentally we all love it, it's why we tune in each week to see what's on offer.We've experienced highs and lows and will no doubt continue along the same vein for many years to come.Each Doctor has offered something, some perhaps more then others. Same for its producers, there are people that have loved and loathed both Moffat and Davies, both have given us some excellent and not so excellent episodes.The format and premise of the show remains its key strength, he can literally go anywhere and do anything, most shows are faced with multiple constraints, that isn't the case here, the possibilities are endless.We've had episodes that are widely loved, some of my own favourites include Blink, Silence in the Library/Forest of the Dead and Vincent and the Doctor. Others have positively split opinion, Love and Monsters is a good idea, personally it's one I enjoy. I can appreciate an attempt at doing something different, it's a show that could become tiresome if it became to formulaic.I like the format of the two part serial, it allows a greater character development, sometimes with the single episode there's sometimes a feeling that some characters are a little shy of screen time.They have been guilty of using some of the Doctor's foes too often, the Daleks for example, they've popped up a few times too many, once they were the adversary I desperately wanted to see, not it's a feeling of indifference. Long may it continue!! I couldn't contemplate Christmas Day without my hour of Who, Baileys and Ferrero Rocher.Great big 10/10","Doctor Who just works. However you watch it, as a fan or casual viewer, there is something there for you; and if there's not, well, try a different era. It helps that it's got 52 years currently under its belt, and so there is and has been for a long time, an element of nostalgia to the show-- recurring villains, references, companions or places/planets that get revisited just to please the people who've been watching long enough. But that's not all there is to it: because every year, there's some kind of hidden gem of an episode that's a shining example of great television, along with the scary, funny, tense episodes we have all come to expect from this show. One of its strongest merits is its constant adaptability. There are different writers almost every week, different companions every other series, different doctors, different locations, directors, genres, threats and ideas. For every one abysmal episode (and there are a few of them), there are some absolutely stunning ones too. I'd recommend Heaven Sent, Bad Wolf/Parting of the Ways, The Empty Child/The Doctor Dances, Blink, The Pandorica Opens, A Good Man Goes to War, Asylum of the Daleks, Flatline, and The Day of the Doctor. It's a show that never dies. Of course, it will get cancelled at some point, maybe, just as it did before; and then it will live on. It will get picked up again. TV just isn't the same without it. If you're new, it's best to start with some classic stand-alone stories to get into them. Maybe try a few from each series to work out who your favourite Doctor/companion combination are. 'Smith and Jones' is a lovely episode to start with (it's where I started)--the season 3 opener, with a new, companion, a reintroduction to the Tenth Doctor, and a wholly entertaining episode. Other great places to start are Rose (although there's a lot of catching up to do), The Eleventh Hour (a completely brand new start-- perfect if you know absolutely nothing about anything in the show), and Deep Breath (an introduction to the current Doctor, with a few entertaining characters who have already been in the show before). Generally, starting with a Series 1-4 episode will be much easier, with simpler stories, a new companion/Doctor each series, and some enjoyable, if upsetting, season finales. Series 6-9 are harder to start at, with characters carried over from previous seasons, and plot lines and mysteries also carried on with. The individual episodes within the seasons, however, need no foreknowledge at all: for Season 6, be sure to try The Doctor's Wife and The Girl Who Waited; Season 7, try Asylum of the Daleks, Dinosaurs on a Spaceship and The Bells of St John; Season 8, try Flatline, Listen, or Kill the Moon; and Season 9, try The Girl Who Died/The Woman Who Lived, The Zygon Invasion/Inversion; and Heaven Sent (which is absolutely incredible). It's a lot of episodes, which for some seems too much. For me, however, it's never enough.","In all honesty, all I can say about Doctor Who is positive. It might have inconsistencies here and there, but as a franchise it's the best television series ever produced. Doctor Who is thrilling, action packed, emotional, funny, and dramatic- and it does this in a way that makes it fun to watch while not being too heavy like The Walking Dead or Breaking Bad. The main reason why Doctor Who is my favorite show is because it encapsulates everything good and bad about humanity to create a feel good series. It's plain old fun, yet its scary, surprisingly emotional, and thought provoking. The acting, the music, and the script writing as a whole are phenomenal, especially as the show progresses. I strongly recommend that if you do want to watch, start from Series 1 in 2005. Starting from Series 5 is a quicker way to catch up to the upcoming series, as the show gets a minor reboot and a much bigger budget, but in my opinion Series 1 does a much better job at introducing the show: the mystery it builds is fantastic, the arcs are phenomenal, and the characters are incredibly fleshed out. The earlier series look dated, but it's really the characters and the story that hit home. I have loved every series I have seen, especially Series 1, 3, 4, and 9. I think the best aspect of the show is how it has an overlying story that develops across each series and every episode, but most episodes have enough to be self contained stories themselves. I highly recommend that everyone watch Doctor Who, especially with their families. It has themes that adults will love, and enough adventure, action and silliness for the kids as well. While Doctor Who isn't perfect, its as close to perfection as any series I have ever seen.","I have been a fan of this series since almost the beginning of Series 2; my first proper episode was School Reunion, however I had seen the last 20 minutes of Dalek back in 2005, but I didn't remember to tune back in the next week! Ever since then, I've pretty much caught every episode on its broadcast, except for the odd one where I've been away or indisposed. In 2007, I decided to take a look at the Classic Series - my first story was Genesis of the Daleks, and I've loved it ever since. Slowly, I've collected and watched almost every Classic episode available, following the \"junking\" back in the 60s, and I've come to love Doctor Who as part of my life, like a dog or a cat, something I can be with from time to time and have a smile on my face. In 2008, I even started scouring for Big Finish Audios, novels and comics, and I'm still collecting them to this day. By now, of course, we've had thirty-four series with the \"New Who\" batch included, twelve Doctors (thirteen with Hurt), 812 episodes, 252 stories and 50 years of history. In many ways, with the extreme amount of miscellany as part of the franchise, you could compare Doctor Who very nearly to the Star Wars franchise, and has its own culture and everything.What really gives this television show ten stars though is the continuity. This may be hard to explain, because not many people usually comment on it. What I mean by continuity is that every single episode of Doctor Who is linked in some way or another by threads of storyline that cross the 50 years it has been in existence! Whether it's a returning nemesis, an item of clothing or a passing reference, there's always something to look out for and shout \"Ooh, another easter egg for the Whovians!\"A simple example for you was back in the 5th series, following Amy and Rory's wedding, the Eleventh Doctor has just received a phone call in the TARDIS from someone claiming there is an Egyptian goddess loose on the Orient Express. Whilst there are a few slight changes to the context, which could also have been a ploy, three series later, the Twelfth Doctor finally replies by visiting the Orient Express and discovers that it was a computerized identity known as Gus who had brought him there in the first place. It's simple, yet in my mind, it allows me a pause of nostalgia as I think back to how I watched the 5th series.The greatest example I've ever seen was again quite recent. In Moffat's polarising episode, Listen, Clara tells the young Doctor what she heard from his twelfth incarnation. One part of the speech springs to mind, however, \"Fear makes companions of us all\". Not many will have perhaps realised, but this was in reference to what the First Doctor once said to Barbara Wright in the Cave of Skulls, in the third ever episode of the television show. In a very sublime way, the series is never far away from reminding us about the past.As a recommendation, I would give this show an open-mind, especially the \"New Series\", starting 2005. Some episodes are superb, but others drop to the very bottom of the mediocre barrel. What I love about it though is its timeless story, consistently great acting and the fact that the next series could bring absolutely anything to the table - there's just no way of predicting what is to come!Top 10 Doctor Who Stories: 1. Silence in the Library/Forest of the Dead (10th Doctor - 2008) 2. Human Nature/The Family of Blood (10th Doctor - 2007) 3. A Good Man Goes to War (11th Doctor - 2011) 4. Genesis of the Daleks (4th Doctor - 1975) 5. The Talons of Weng-Chiang (4th Doctor - 1977) 6. Blink (10th Doctor - 2007) 7. The Impossible Planet/The Satan Pit (10th Doctor - 2006) 8. Dark Water/Death in Heaven (12th Doctor - 2014) 9. The Day of the Doctor (10th/11th Doctor - 2013) 10. Doctor Who and the Silurians (3rd Doctor - 1970)P.S. IMDb should join both this page and the Classic Series; it's the same bloody show!","Ladies and gentlemen, I want to say that that posting this review is such a pleasure. Never have I had the experience of fun and emotions than I have watching this series. I truly feel that this is a show that anyone and everyone can relate to, no matter the generation, age, or background.I have to start with how I was introduced to the series. It was a Monday night and I was watching wrestling (of course, right? I mean, what else is on on a Monday night for a then-male bachelor?!). Around 9 PM, I got a phone call from my best friend, Hannah, who said, \"Hey, dude! You need to turn it to BBC America, now!\" My response? \"Why? I'm not British...\" She proceeded to tell me of this great series called \"Doctor Who\" and I was about to protest when I thought, \"What the hell? Why not?\"As soon as I tuned in, I loved it. The episode I watched starred the 10th Doctor, David Tennant, and I loved how I was on the edge of my seat at one moment and laughing the next. That's what started my voyage to becoming a Whovian.The series began in 1963 on BBC and is centered around a character simply known as the Doctor, who is the last Time Lord from the planet Gallifrey. He travels through the far reaches of time and space in a time machine called the TARDIS (Time and Relative Dimension in Space), which is stuck in the disguise of a 1950s blue police box. With the aid of time-traveling companions, he battles with different robotic and organic adversaries in the attempt to save other planets from suffering the same fate as Gallifrey. In addition, instead of dying per se, he regenerates into a different outer appearance. There has been 12 reincarnations of the Doctor, who is currently played by Peter Capaldi.I absolutely love the entire series, even those in the \"Classic Who\" series (pre-2005). The character has the ability to speak to many people in different ways. I think that is why there are so many people who like different reincarnations of the Doctor. My favorite reincarnation is the 10th Doctor, masterfully played by David Tennant (\"Fright Night,\" \"Harry Potter and the Goblet of Fire\"), because he has a sense of humor but also has a maniacal dark side.The best thing that I love about it is that is has action, suspense, drama, and comedy that can be seen even by children. My oldest son absolutely loves the Doctor (who started with the 4th Doctor, Tom Baker). Even though it is indeed geared toward children, there is a tremendous fan base made up of all ages. It's a great show with a great story line that can show children that even if you have the power to go through time, you still don't have everything. The Doctor shows the audience that he still longs for acceptance, if not from his companions but from himself as well. He must fight his internal demons that threaten to crush him as much as his adversaries.If you're looking for a family-friendly fun ride that you can continuously watch, particularly if you're a fan of science-fiction and/or fantasy, please consider \"Doctor Who.\" By the end, I promise that you'll be saying the famous line from the 10th Doctor: \"Allons- y!\"","It seems that there is a huge diversity in the reaction to this show. Fortunately for the IL' Doc, I think this means he will be around for awhile again. I have seen \"Rose,\" The first episode in the revamped BBC series, and I have to say I am thrilled. The majority of the negative reviews seem to be coming from ultra-die hard Whovians. I myself was a giant DR.Who nerd in my younger years. I had a subscription to Dr.Who magazine, I sent Tom Baker a letter when I was 10 years old, (I still have the autograph he sent me back, thank you Tom!)My grandmother knitted me an eight foot long scarf etc..etc..I could tell you who Roger Delgado is and why when he looked like Geoffery Beevers he really wanted to go on Holiday to Traken.In early 1984 when I was 8 years old, I met the Doctor and his friends Sarah and Harry. It was at midnight in Arizona on a black in white television that was barely 10 inches wide. I was transported to somewhere I had never been and have never been since. It was like Peter Pan taking you to Neverland. Anyone who met Doctor Who at such an early age will agree with me that the magic was that vivid and so real that you felt you were right there side by side with those characters.As I grew up, I grew out of it. Real life takes a hold, and while Perpugilliam Brown was amazing to stare at, it became a lot more important to go talk to a girl in person on a Saturday night than stay home by the time 16 years old came around. A passing interest in Sylv and Sophie was there, but ultimately, Puff the magic dragon let out a mighty roar because this Jackie Paper had grown up.Having said that, I watched \"Rose\" with two hats. The former obsessive fan with the critical eye, and the adult who wanted to be whisked away by Pan again.I feel the show succeeds in the latter department. I had a huge smile on my face the entire 45 minutes, and if I had to guess, this show is going to capture the fancy of a lot of young ones, and even though Doctor Who was always my best friend, I'm ready to share him with the people who he was made for in the first place. Thank you Russell and welcome back Doc!","I was so looking forward to a female Dr. Who. But instead we got a nothing Dr. Who. And it probably isn't the actress' fault--in fact, she's done excellent work elsewhere. It's just that the scripts are atrocious. These new episodes are unimaginative, unsurprising, and unbearably dull. Some of them feel like after-school specials. Some of them feel as though they were rejected story ideas. Some of them don't feel like anything, they're so poorly created and produced. What a disappointment: creating a female Dr. Who and then not giving her anything to work with.Such a shame. When Dr. Who has been good, it's been great. Now it's not even mediocre.","I remember being so excited on Saturday nights when I was a kid, waiting for Dr. Who. I thought it was the best show ever made. Then, I grew up, Dr. Who went off the air, and no one I knew had ever heard of it. Then I found out there was going to be a new series. I was a little nervous about it. Was it going to live up to the expectations I had carried around since I was little? Would they screw it up? Would the Dr. suck? Would his assistant suck? Would they create a more intimate relationship with the Dr. and his assistant? YES, NO, NO, NO, NO!!! This show is wonderful!! I love the new Dr. I love his assistant. I love the show. And I find myself excited on Friday nights now, waiting for the \"new\" episode. I'm just now seeing 2005 episodes, as I live in the States, so I'm a little behind the rest of you. I hope the next Dr. is as great as this one!","Yuck.The whimsy is gone. The heroics are gone. This is certainly the Doctor for millennials: childlike, post heroic and literally emasculated. With a wave of her Harry Potter-ish sonic screwdriver, Doctor Who becomes a sad little parody of itself. The writers are far more interested in teaching lessons than telling stories with actual villains and (gasp) things that happen and building tension. And perhaps that's merely sign of the current zeitgeist, of who we are as a culture.It saddens me to say this, but it appears I am no longer the target audience. I remember staying up on Sunday night watching Tom Baker stories on PBS. The special effects were atrocious. But my goodness, the stories! Now we have fabulous special effects and a monstrous brand.Adieu, Doctor.","I have watched the first three episodes of the new season and I'm sorry to say that Chris Chibnall's writing has let down both Doctor Who and Jodie Whittaker.I thought the show was meant to be 'family entertainment', but the infantile writing has aimed it at just the children. Chris Chibnall has a fantastic budget to write with, but so far has failed (imo) to come up with anything with dramatic tension. And Jodie Whittaker has had some god-awful lines that will make it difficult for anyone to endear to her.Episode 3 'Spiders in the UK' left me aghast at how bad the ending was. The build up was OK and the SFX with the spiders was very good, but to end with 'Oh, well, they'll die. Let's go home' was the writing of a teenager who just wanted to finish his homework.The episode also contained an attempt at a Donald Trump joke - a contemporary reference in a sci-fi show is not a good idea. It just helped to show the amateurish nature of the writing.This might be a little unfair on poor Jodie - David Tennant could run and it was used to generate tension in many episodes. Jodie can't run! She looks like your mum in an egg-and-spoon race at a primary school sports day - not good for dramatic tension.Having three 'companions' is the dumbest idea I have ever seen in Doctor Who. The point of the companion was they either got into trouble or they helped the Doctor out of trouble. Is that possible with three companions? So far they have just been an advert for inclusivity (BBC at it again!).I loved the reboot by Russell T. Davies, but this show no longer tries to equal the standards set by the man. Disappointed.","I was not expecting to like a female Doctor but Jodie is quite endearing. However she cannot save the show .I have just seen the Rosa Parks episode and the programmer has now gone full cultural Marxist.A whole episode dedicated to patronizing self righteous hectoring rubbish about the evils of 1950s racism Ir is supposed to be at least a bit sci fi.Abysmal.","Make what you will of the pilot episode of the new Doctor Who. I myself was fairly dubious upon first viewing, yet by the second episode, Russell T Davies had established a mark that makes this series his own! Gone are the wobbly sets and loose plots without continuity. Despite the episodes being manned by several writers, Davies manages to ingeniously weave them together. From the very first episode, he leaves the slight inkling of an epic subplot; the Doctor's heartfelt, almost-apologetic excuse to the Nestene Consciousness (\"I couldn't save your world - I couldn't save ANY of them) is incredibly engaging and it was this very line that drew me in to offer the series a second chance.And I'm incredibly glad I did. The series takes everything that made the original series popular and updates it for a new generation. The villains, the ideals and the themes all reflect a world that people are living in today. And then Davies also adds something new to the character of the Doctor - a REAL mythology. He no longer has that familiar skip in his step that he was famous for - he's running on low battery power - and he has something no other Doctor had; a survivor's guilt. A man left homeless by an epic war between an ancient and familiar enemy. He carries both the burden of the loss of his home and people, but also the guilt that he somehow had a hand in it.This subplot runs through the course of the series and works incredibly well; that no matter how random the location or episode plot, beneath it lays that familiar drive that is guiding the audience toward the two-part finale. And what a finale! Not to spoil it for those who haven't seen the series, but everything regarding the Time War comes to an explosive crescendo and at long last the Doctor appears to be able to put his demons to rest.And then there's Rose! Well, I thought she was amazing and such a well-rounded character. You can believe her and the fact that she is very much our eyes and ears on both the Doctor and the life he gives her makes her even more endearing. But what sets her out from her predecessors (as with the Doctor) is she has a mythology of her own. A life, a family, a home - and Davies taps into those unanswered questions from the old series excellently. What happens to her life away from the Doctor? Do her friends and family miss her? Will she come back? If anything, Rose is just as important as the Doctor. They have the electrifying chemistry that bristled with Lois Lane and Clark Kent, Mulder and Scully and all the other great \"Will-they/won't-they\" characters. With some shows, pairing off the characters kills off a program, but with these - you almost feel that it would only take the future plots and scenes even further! This series is fantastic - despite its one of two slight hiccups (Episodes 4/5) - and it is clear that both Davies and the BBC have taken slight influences from popular sci-fi shows such as Buffy and Angel. Though, this is in no way a criticism. If you want to be the best, you have to study the best. Adapting the story arc (episode 6), placing a Big Bad to the forefront of the series and throwing in an enigmatic hook (Bad Wolf) gives the show an excellent feel of continuity and does not feel out of place in today's society.The Doctor's back - and he's here to stay! (and PS - things, in my opinion, look VERY promising with Mr. Tennant.)","On the positive: No problem with a female doctor at all.\nOn the negative: These story lines are bad enough on their own. Where's the adventure? Where's the fun? Poof! Capaldi was not a very good choice (not blaming the actor, but it was getting a bit too dark and the fun was vaporizing - I blame the writers, though there were some good, non predictable, episodes), but many of the story lines were energetic, but since his arrival, the show has begun to descend into PC hell. Now it's firmly entrenched in it and, along with it, any creativity. What happened to the side kicks? They're written in a woefully lame way (must they be so average and banal? - Is this to make up for the weaker doctor(s)?). Why not poke fun at the establishment instead of a few bullies from the past?\nVery disappointing. Jodie Whittaker could benefit from better writing, for sure - she has what it takes, but with the story writing lameness (and bad acting side kicks - characters), she doesn't stand a chance.","And this is how my favorite show was ruined ...thanks to chibnall uninspired dull writing ...the show lost it's wit and spirit ,The episode is mono tone from the begining to mid to the end ...\nand the \"doctor\" now is just a secondary character with uninteresting lines and one facial expression ...Jodie Whittaker is clearly not a doctor who material .\nAs long as Chibnell is not replaced by a better writer and Whittaker by a more suited actress to the role...this show is nothing .","I have been a big fan of Doctor Who for 38 years, and watched it ever since I was 5. I have always looked forward to watching every episode.However they definitely dropped the ball with Capaldi, not that he is a bad actor, but they rammed SJW agendas down your throat. So much so, that many episodes were basically unwatchable.Rather than get better writers they have decided to throw the entire essence and character out the window and replace it with a woman!!! Why on earth would you make such a bad decision. Don't get me wrong, I was a big fan of Broadchurch, great show, and Jodi was perfect in that role, as she is a very talented actor.It's just that I have always looked up to the doctor as a role model since I was a kid. He was my hero and now he is gone. And I don't resist change....I just love my hero!! Nothing wrong with that.Episode 1 I am forced to watch a women, carrying a phallic shaped sonic screwdriver, with a rainbow LGBT gender neutral T-shirt, who judgmentally rolls her eyes at the nerdy white guy (yeah I noticed it) who wants to leave the train in the first 5 minutes of the first episode, and seems to give up hope in the second episode towards the end (something that the doctor would never ever do...as the Doctor has always been the bastion of hope even when all hope was gone). Episode 3 = save the repressed African Americans from the evil racist white people. Episode 4 = Parody of Trump, but.....I'm not from America. I d o n ' t c a r e.Oh please. No.... Just No. It's beyond tedious and lame.\nWhat on Earth are they thinking? Have the writers lost their minds?\nNo-one wants to watch this. Absolutely no-one.\nIt's less than pathetic.Plus to add injury to insult all the millions of fans who love the doctor are lambasted as sexist, anti-change, man-babies blah blah bah.\nI don't think so.They just want some fun escapist sci fi fantasy with an epic hopeful hero who they have grown to trust, respect and admire.\nI know I do.Please bring back The Doctor, and end this travesty.Pretty Pretty Pretty Please","Watching the first episode I couldn't help but feel that this didn't feel right. No, I don't approve of changing the gender of the Doctor, even though it was done (for laughs) in a comedy special over a decade and a half ago. There's absolutely no reason why the Doctor needed to change sex, it was never part of canon.\nWhile the show has the name 'Doctor Who', it's essentially using an established brand to do a 180 on the fans. And that's not always a good thing. It reminds me of the Star Wars side story movies, like Solo. All the characters are there, but it was missing something that made it feel 'Star Wars', even though it had all the right pieces.\nIf they had gone and done this as a spin-off of the series, I'd be okay with it. Why not have a female Time Lord who goes around helping solve problems. But do not call the character The Doctor, because it just feels like a gimmick to satisfy some sort of agenda. Without good writing and good stories, it doesn't matter what you make the Doctor, the series will fail. And that is what was hurting the series, not the fact that the Doctor was a man.\nLet's have this experiment end by the end of the season, and go back to the real Doctor Who we have all known and loved.","As a child I used to love the Dr Who series and apparently I used to hide behind the sofa whenever the Daleks appeared. I think it must have been the voice. But over time the whole idea lost so much of its charm that it became a real pain to watch. Well all that has changed, Every nostalgic moment I ever had about the doctor has come flooding back with this highly enjoyable reanimation of a childhood favourite, even though I am now well into my thirties.Christopher Eccleston is great in the lead and Billy Piper makes the archetypal sidekick. This new incarnation is full of the humour and tongue in cheek appeal that I hoped it would be. I just hope it keeps going as it started.I have to give this a ten even if it's just because it's filmed in my home town of Cardiff, If not for the fact that is gives me a glimmer of what I liked in this series from when I was a very small child.Thanks to everyone involved and keep it coming.","I just cant understand why people are saying 'Rose' was just OK. I thoroughly enjoyed it. I think that the new series excels itself compared to previous series e.g 6th doctor stories. I commend Russel T Davies for doing a fantastic job of propelling doctor who into the 21st century.I pity the old doctor who fans who say 'oh its just not the same'and Eccleston is 'too different to be the doctor'. They are right! its not the same! Neither are we! We are living in a different century to the old episodes and many things have changed. Set in modern day I think the episode was more realistic and 10 times more enjoyable. So boo to the criticisms Everyone I have spoken to had a whale of a time even many children cant wait for next week.Lets hope the rest of the series fails to disappoint us! Congratulations BBC!!","I've been open to a female Doctor and the new showrunner wanting to change things up, but the writing has been atrocious. First, they rip off the Predator, and in Rosa, they've ripped off Timeless (and just about every other time travel cliche). Has Doctor Who series run out of ideas? Any more sci-fi tropes to exploit? Perhaps this Doctor should really be the very last regeneration and a very short stint at that, because it's just too painful to watch. After Davies and Moffat, Chibnall's turn at the Doctor is an abomination so far. Jodie Whittaker deserves better than this, and so do we. And to read the critics who are fawning over the show just to prop up its PC agenda tells me that it's time for us to move onto Doctor What.","Some of my favourite televisual memories were of Doctor Who saving the world, the universe even! And the new series had brought me back to that! It was amazing! But the BBC has now turned it into some kind of soap. Please make decisions on what the expectations are for doctor who. It was never sexist was it? It was an impartial story about battling evil surely.","I eagerly awaited the new Dr Who, and I wasn't disappointed. My first memories of the Doctor are Jn Pertwee battling robots, giant maggots and giant spiders in the early seventies. Then Tom Baker took over and it was a must watch programme. Tonight I was transported back to those days, in so much as I felt just as I did back then. With one big difference, this is very much a programme for the twenty first century.Christopher Eccleston was wonderful as the Doctor, combining the off the wall behaviour of Tom Baker's Doctor, with the mystery of Silvester McCoy's; the action of Jon Pertwee's and the hard edge of Colin Baker's; together with the wisdom of William Hartnell's Doctor and the tom-foolery of Patrick Troughton's. All wrapped together in an incarnation with the same physical appeal as Paul McGann's Doctor. I would quite happily travel through space and time with this Doctor.The effects were the best we'd seen on the programme but I felt they didn't overwhelm it. But where they needed to be, the effects were 'crap'. The Autons always were faintly ridiculous back when Jon Pertwee fought them and they are still ridiculous, but just as deadly. The script was witty in the right places and serious where it needed to be.I can't wait for next week!PS. Billie Piper didn't suck!","I live in Germany and Doctor Who is not as Popluar as in the Uk. This may by the Reason why I've discover this SCIFI Marvel so late. Late means in this case at the age of 32. I'm a huge SCIFI fan and STAR TREK and STAR WARS practically raised me. But back to DOCTOR WHO. It was This Time when you have nothing left to watch, and netflix just started in Germany. So I've think lets give it a try. It Takes just a few Seconds of the First Episode Rose(Doctor Who 2005) and I became a Whovian. It is the best TV Show I've seen ever!!! Amazing Script, Actor, Heart and this incredible British Style. I hope this Show runs for ever.10 out of 10 SCIFI at his Best","Three episodes in to the 'new' Doctor Who (Jodie Whittaker) and each one worse than the last. The acting is ok-ish, although the new companions don't get a lot of chance to demonstrate it, but the show is let down by some terrible writing and the need to be so Politically Correct that it can't see beyond the end of its nose.The show began it's latest decline after Jenna Coleman left Peter Capaldi. Bill and Nardol were very average companions to Capaldi's rather average Doctor - although admittedly Tennant and Smith were hard acts to follow.\nThen of course the Doctor became female. Absolutely no need for it at all, and no need for all the fuss about it either and it could have worked, but poor Jodie Whittaker has nothing to work with. They writers haven't actually given her a character.Then there is today's Episode 3 - Rosa Parks. Why? Just make a documentary about her and the segregation issues in 1955 USA instead, not have a very boring episode with no jeopardy and a random unexplained bigoted time-travelling non-villain (oh how so very convenient). Then rub everyone's brains into the dust by ending with the Rosa Parks asteroid - was that all the woman was worth? A bloody asteroid!\nAs a history lesson about Rosa Parks and segregation it didn't work.\nAs an indication of the racism still prevalent in society today it didn't work.\nAs an episode of what has been one of the most enduring and loved sci-fi series on British telly it didn't work.\nAs an example of woolly thinking, abysmal characterisation, poor scriptwriting and bad TV it worked perfectly."],"review-user":["willrichardmuse","niktemadur","Sleepin_Dragon","forshawaj","pjgs200","tlfirth","jeldridge-28771","Lonniemackfan","Laight","marannsjunk","michaeljohnsauer","dgjones-62258","sjhvii","pete_da_slag","dave-20412","bittenapplesss","ash1975","peeedeee-94281","NeilCardiff","Edzunca","yooniverse","tjb16","cyberspice","burntiger","igmu"],"review-date":["7 December 2015","9 July 2010","27 October 2015","1 December 2015","28 June 2016","5 December 2014","23 September 2015","26 March 2005","25 October 2018","5 May 2006","29 October 2018","30 October 2018","10 October 2018","24 October 2005","24 October 2018","22 October 2018","17 October 2018","13 October 2018","26 March 2005","26 March 2005","22 October 2018","17 October 2018","26 March 2005","29 May 2015","21 October 2018"],"review-rating":["10","10","10","10","10","10","10","4","10","2","3","1","2","1","1","1","2","2","10","4"],"review-title":[" One of the greatest television programs of all time\n"," Blew the mind of an uninitiated, long time sci-fi lover\n"," Time passes by so quickly.\n"," Invincible, imaginative, inspiring\n"," Easily one of the best shows ever produced\n"," Doctor Who works better as a 50-year-old franchise, rather than just choosing one episode!\n"," A Great Ride for Both Kids and Adults\n"," My Ten Cents on my best friend\n"," Terrible new season\n"," Love the New Dr. Who!\n"," Adieu, Doctor\n"," I wanted Jodie to succeed, but...\n"," Doctor Cultural Marxist\n"," A slow-runner to a fantastic finish of a race!\n"," Terrible story lines so far. Drags on. PC infested & droll.\n"," Where's the doctor ?\n"," Please bring back my hero....The Doctor.\n"," A Doctor Who Story...\n"," The Doctor is back, so are my childhood memories\n"," Excellent\n"," The New Doctor needs to regenerate ASAP!\n"," What was it about and what is about now?\n"," Ace!\n"," A late discovery\n"," Going downhill fast\n"]}