{"review-url":["http://www.imdb.com/title/tt0490798/reviews"],"review-text":["\"When a Killer Calls\" is an unusually nasty slasher flick, with some very unpleasant and unsettling sequences. The decision was clearly made to try and cash in on the remake of \"When a Stranger Calls\" by pretty much putting in -- almost word for word -- the phone call sequences from that movie. They seem very forced.Additionally, the filmmaker commits the cardinal (but all too common) sin of having the heroine's friends being repulsive jerks. So for the beginning of the film, we really like and are rooting for the babysitter (a nice believable job by Rebekah Kochan), but then she's joined by standard slasher-flick teenage friends and the mood is ruined.The flick sort of works, but it probably a lot more unpleasant than you'll be expected, so be fore-warned.","After wading through a morass of God awful horror films of late, this was, by comparison, a pleasant surprise.Granted this is a knock-off (to be kind) of another B movie, I found it didn't have the flaws that run rampant through other entries in this genre.It had a professional look, was decently directed and the acting was better than average for this type of film. Most importantly, the script was at least thought out, and didn't have the gut-wrenching plot holes and improbable logic (or lack there of) I've come to expect.Don't get me wrong, it certainly isn't a horror classic by any means but if you're looking for something in this vein and there's nothing else to rent (as was my case), it won't feel like a waste of time.Back-handed compliments to be sure, but I don't think the remake of When a Stranger Calls will be a whole lot better.","This is one of those movies from the studio known to put out similarly titled and themed DVD's to conveniently coincide with the real studio release movie. In this case we get When a Killer Calls, ripping on the Sony remake of When A Stranger Calls (2006). The movies are about an isolated teen babysitter getting terrorized by a prank caller. While Stranger was rated PG-13, Killer is unrated offering up graphic violence, nudity and language. Killer is obviously low budget, with passable-at-best special effects for the gore, though the acting is surprisingly decent for the most part. The storyline differs just enough from Stranger to keep them from getting sued, but it's your standard cliché slasher fare. I was expecting MUCH worse though.","Well I have to admit Asylum has done it once again. Nothing like ripping off a theatrical release. I have to say while the killings were creative like a Saw or Saw II. They were very violent and vicious. I mean the first killing of the woman at the beginning stabbing her in the mouth was vicious. The acting was your typical slasher film acting but probably about as good as When a Stranger Calls. The lead girl was attractive and the rest of the cast filled their roles well. Plus I have to say I spotted the director Peter Mervis as one of the cops. I recognize that Toby Keith look anywhere. I have to say the characters were sub par and not very smart and killings the kids was pretty wrong but at least they didn't hold back on that. So overall I would say it was worth a watch if you like violence and gore","Just want to inform you guys that this movie was actually pretty good !!! Thought it was a lame ass movie, but not at all, many moments in this movie wore pretty horrifying. This movie has enough blood, gore, and some sexy make out scenes of course, to keep any horror buff like me 100% satisfied! The cast was also pretty good IMO. Even though its not a high budget movie, the effects wore definitely kinda creepy sometimes. Worth watching if u like a kick ass horror movie thats for sure!!Tom","My first indication that this was a true DIY production was how it opened completely cold...no 55 studio cards, no, not even one! That's not necessarily a bad thing, but it got me wondering about this movie and if it was really a labor of love or a labor of cash. That answer quickly became apparent in the last half hour, but more about that later. It is plausible that the filmmakers wanted to do a completely no-holds-barred retelling of the famous Urban Legendy/When a Stranger Calls chestnut, and if their goal was to show us things we don't expect, mission accomplished.This has to be the ONLY film I have ever seen (out of tens of thousands) that features the \"realistic\" on screen killing of children. This is one of those areas I can't see any reason to go into, except to shock and sicken. Following that, there are many voyeuristic scenes of torture and bondage (as in the \"please please don't hurt me, Mr. Bad Man\" variety). While I'm not entirely averse to such scenes, these just seemed needless and gratuitous.The plot needs no elaboration, you've seen it a gillion time before. The only positive thing I will say about this lamely named C-grade copycat is that the performances by the teens (and their dialog) are very natural, and Rebekah Kochen is actually good to very good in eliciting your sympathies. Hopefully starring in this doesn't end her young career. The suspense aspect of it is pretty much diffused by the disgusting subtext.Watch this at your own risk, because, while it isn't \"scary\" technically, it will get under your skin and creep you out, if only for its unabashed luridness.","An extremely amateurish rip off of When A Stranger Calls but unlike the well filmed, atmospheric remake of the 1970's chiller this one has balls. Right from the beginning of the film it has the feeling of unease and dread with brutal and effective yet generic kills that were disturbing and gutsy. This movie has a very visibly low budget and less than impressive acting that were the movie's downfall but the body count was decent and the killer was sadistic and stopped at nothing to bring fear to this poor babysitter and the stalk sequences though handled in a silly amateurish way did bring some suspense and creepyness to the film enough to make you look over your shoulder especially if you watch it alone in your home. The acting was beyond atrocious thanks to a horrible script and unoriginal story but towards the end it seems like everyone tried their best to step up their game which led to an effective, harrowing finale which might make you think twice about babysitting. Overall it's obviously a ripoff, unoriginal, flimsy but its brutality, creepyness and ballsy nature will creep under your skin, sure it wasn't amazing but as a generic rip off of stalk and slash it isn't half bad. Rent it. Have zero expectations, leave your brains at the door, grab some popcorn and enjoy. 6 out of 10","When a Killer Calls is clearly an obvious rip off to the remade 2006 film \"When a Stranger Calls\". The plot is pretty much the same too. A babysitter named Trisha receives anonymous and scary phone calls late at night, asking her if she checked the child she is babysitting. The exact same thing the stalker asks in \"When a Stranger Calls\". This film opens up with a rather chilling murder scene, which also includes us seeing two young children and their mother being stabbed to death. Probably a first in horror to actually see children being murdered on screen, it was pretty brutal. Then we meet Trisha who is babysitting little Molly. The scenes with them had a real Laurie and Tommy from \"Halloween\" feel to it which was nice.Most of the call scenes involving Trisha and the killer were actually very well done and a little unsettling. The house was lit just well enough to give that spooky atmosphere. We get introduced to some other characters as well. Trisha's boyfriend Matt, their two friends Chrissy and Frank, as well as a nosy neighbour. All of course are put in the film to add to the body count. The murders are pretty brutal. Not really gruesome, but the number of times he stabs each victim is just brutal.There is a decent revelations to the killer's identity, but the last twenty to thirty minutes of the movie is where it fails for me. I don't need to see Trisha tied up and being tortured by watching her friends be cut and stabbed. It was REALLY overdone. There was a scene at the end that lasted almost five minutes of just her tied up screaming and crying. It was definitely overkill to say the least. I also didn't think showing three kids being murdered by the killer was necessary.Overall, an average low budget horror movie. The acting is decent, but you could clearly tell it was low budget. There were some unnecessary torture/murder scenes, but some genuine creepy moments during the phone calls helps make the movie watchable at least once.5/10","Trisha has a night of babysitting ahead of her and she has no idea that what awaits her is sheer terror in the form of a conscienceless psychopath who we see murdering a family at the beginning of the movie(a mother, her daughter and son). This killer is so cold-blooded and remorseless, he ties up his prey with rope, takes phone photos, and makes them wait out their execution. Like Michael Meyers, the killer breathes across the phone when he's across the phone with Trisha, and this is the device he uses to torment her over the period of the night. She believes that the one calling her repeatedly on the cell phone is Matt, her boyfriend. The parents of the child Trisha's babysitting actually know the killer(which means he's a local citizen and we hear his voice which sounds surprisingly friendly)and they make the unfortunate mistake of stopping off to see if he needs assistance. Ring. Ring. Ring. Prepare to hear a hell of a lot of ringing because the phone jingles over and over in this movie, THE ASYLUM's answer to WHEN A STRANGER CALLS which might also bring to mind SCREAM. Matt brings over his pal, Frank, and Frank's girlfriend(some victims to stab and slice)after Trisha specifically ordered him to not allow anyone else to come. The killer continues to threaten Trisha on the phone until she Star 57's his ass(the killer also sends her pictures of victims he butchered). Frank is a rabble rouser, a trouble maker who made a previous baby-sitting job for Trisha a disaster, smashing the parents' china cabinet. His gal, Chrissy, is also a bit of a bad girl and when the two go into the basement, a little surprise will be in store for them, interrupting their make-out session.There's a murder similar to what you might remember from BLACK Christmas(the use of a plastic bag to suffocate a victim while he's being stabbed several times). The killer is savage in how he beats and stabs victims, with blunt force, in furious anger, the sound effects on the soundtrack extra loud to emphasize the brutality of his actions. Regarding the endless phone call harassments, I did keep asking myself why she just didn't silence her phone as to keep it from ringing continuously, but then the movie would lose it's purpose, the heart of the terror of the situation is the killer's menacing voice and what he says to the heroine over the course of the running time. There's a particular scene directly lifted from WHEN A STRANGER CALLS which is more than a bit insulting. There's included the typical staircase scene where the killer falls down the steps and the heroine must cross over him, with the usual hand grabbing ankle. The barbarism towards children is especially disquieting in that the killer was just as violent towards them as other more adult victims. One victim takes a shot to the mouth with a lead pipe which knocks his teeth out! And, the killer plays with Trisha by having her rope-tied while slaughtering a victim(not to mention he rips her shirt, exposing her breasts, humiliating her). With Rebekah Kochan(one of several in THE ASYLUM's HALLOWEEN NIGHT, another slasher which ripped off various classics including HALLOWEEN)as Trisha, Robert Buckley as Matt, Sarah Hall as Chrissy, Derek Osedach as Frank, and Mark Irvingsen as the psycho. This came out the same year as the official remake of WHEN A STRANGER CALLS(starring Camille Bell)which proves once again that those of THE ASYLUM have no shame.","When A Killer Calls has got to be the biggest ripoff released by Asylum so far. It's about a sexy babysitter on duty who receives spooky calls from a creepy voice who asks her repeatedly, \"Have you checked the girl?\" Naturally she has the calls traced by the cops (after having to perform some realistically unnecessary tasks -- hanging up when \"he\" calls, waiting ten seconds, and dialing *57). Sound familiar? Yeah, that's why I rented it, too.Well, it should. And I hate to say it, but this could've been more entertaining than the big-screen crapfest that was released around the same time if not for one fatal mistake -- Rather than revelling in B-movie ripoff glory, it tried to do something original. It tried to make the lead character sympathetic, rather than having clichéd, campy fun with her. Mind you, this could've worked with a talented actress. But she wasn't. Sure, she looked good, and she screamed, and cried, but . . . oh well, whatever.Then came the horrific ending. Not horrific in that it was horrifying, horrific in that it was BORING. The pacing up until that point (about an hour in) was campy, clichéd, and fun. Then it heads in another direction, and it veers away from just another dumb, fun slasher movie with a sexy \"teenage\" cast to a Hostel-esquire gore/borefest.I guess this falls into the \"Oh well, whatever\" category. The lead actress flubbed a line? Oh well, whatever, I don't feel like reshooting it. We forgot to give the killer motivation? Oh well, whatever, I don't feel like rewriting it. The pacing completely changes halfway through? Oh well, whatever, I don't feel like shaving fifteen minutes off. Continuity errors? Oh well, whatever.If you like this kind of movie (dumb, cheesy, predictable, campy splatter movie with sexy cast), then you'll be fine up until the ending. The ending is stupid, it's not fun, it's not scary, it's not campy or cheesy or quickly-paced. In fact, there was almost exactly five minutes of the character doing nothing but being tied up (and that's not a spoiler because it's on the back of the DVD) and looking around at the stuff in the room, then screaming, and . . . whatever.","When a Killer Calls (2006) ** 1/2 (out of 4) The Asylum's mockbuster of WHEN A STRANGER CALLS (the remake) has Trisha (Rebekah Kochan) going to babysit when she starts tor receive harassing phone calls. Pretty soon she starts to think it's her boyfriend but when he shows up at the house she knows it must be someone else and soon they're all under attack. WHEN A KILLER CALLS is a film that you'd think would be horrible but I have to give director Peter Mervis credit for actually delivering a pretty strong film and one that certainly isn't going to be for the weak. I say it's a film that's not for the weak because it has quite a bit of guts to go as far as it actually does. There's certainly lines that you don't cross in movies and especially in American movies but this film here pushes those lines to the side within the first five minutes of the picture. Normally killing a child or children is a major no no and when a film does it you know it means business. The body count here is extremely high, which is something that was missing from the remake. I think fans of gore should be entertained by this thing because it's quite savage in regards to the violence and there's a lot of the run stuff going around. I even thought Mervis built up some nice tension early on in the film, which must be a first for The Asylum. With all of that said, there are still some problems in the film including a pretty boring second act. Once all the teens get to the house things really slow down quite a bit and the 91-minute running time could have probably benefited from some of this stuff being cut out. Another problem is that some of the performances really weren't all that believable but Kochan is decent in the lead and Mark Irvingsen is good as the killer. WHEN A KILLER CALLS really shorts itself because many people are going to pass it up because of it being a rip of another movie but that would be a shame. While this falls well short of the 1979 film, this is much better than the remake and I'd say better than several genre pictures out there.","Basically a sick and depraved version of Fred Walton's \"When a Stranger Calls\" (1979), but not as bad as you might think. It has the same basic plot to \"When a Stranger Calls\", such as a girl babysitting a child and then gets harassing phone calls from some mysterious guy which then turns threatening. Considering that it comes from Asylum a low budget studio who are known for their less than average movies. Compared to the other films that they have released from that studio, I would say that this is the best that you're going to get from them. Some of the scenes may offend and can be pretty intense and more violent than what you'd expect it to be, but If you got nothing better to do and you're bored, give it a shot, but don't expect it to be that great.","A lot of people find this movie to be something amazing, but I can't help but feel that the people voting for this film are people upset by the fact \"When a Stranger Calls\" didn't live up to their horror expectations.The producer must've got the entire cast and crew to come here and make \"kick-ass movie!\" comments because, unfortunately, no one with human taste would find this movie to be as good as they claim it to be.Watching this movie, I just can't help but feel this is done by a 17 year old dude who just learned a couple of new camera effects. The \"special effects\" in this film come up as high as weak lighting, twitchy cameras, and rain storms that doesn't even seem to cover an entire patio. Seriously, did these people use lamps and hose pipes for these effects? The deaths come up very short to today's standard creative deaths. Nothing but stabbings and slitting throats. And when I say nothing but, I mean it literally. It's 2006, at least someone could've burned! These stabbings (which looks VERY fake, by the way) just don't do for anyone anymore, it's not 1980 anymore.The characters are all predictable, and unlike it's alternate, \"When a Stranger Calls\" (which I think this title is only a lure for the emo-kiddies who were upset with the lack of gore from it's alternate), you have no reason to care for these characters. The protagonist, Trisha, comes up nothing bigger than the average blue-eyed teenage blondie with a hottie boyfriend, slutty attitude, and mistaken rep from the adults. She is the character we used to love to see get killed back in the early \"Halloween\" series. You know, back when characters were stereotyped. The only thing this movie is missing is the shower scene that literally turns into a blood bath.I do like the idea that this movie gives no mercy to the children. You rarely get to see children die, and if they do die, then you never get to see them actually get killed. It was actually disturbing but never done before. I doubt it'll start a new wave for the horror genre, but it's a good moment to look back on.The acting was... it was... unnoticeable. It's hard to throw a compliment or a complaint because I doubt you'll be paying attention. Not because the film itself is so engaging but because no one really cares about no name cast. I could easily talk about how the protagnist's, scared reactions and frightening faces come up super short but that would be like trying to prove to someone that a pickle is green.Overall, the only reason I might've given it this high of a number is because I was air-drunken enough to watch the fake ass looking slashes.","this film is basically a poor take on the old urban legend of the babysitter who gets crank calls telling her to check the children, she calls the police who trace the calls and find there coming from inside the house. when a killer calls has a story so simplistic a little kid could have written it. not much suspense, it becomes clear who the killer is halfway through the film. at the beginning, when the first victim is killed it looks like a bondage fetish scene from a porn site or something. whats up with that? the film is oh so typical slasher fare with a plot about as original as a Beatles concert. even by low budget slasher standards its cheesy. don't waste your time with this. nuff said","To sum it up in a nutshell, this film was disappointing and could have been shortened by twenty minutes.The acting was sub-par, the only decent actors of the bunch being Trisha, the killer and Molly. The music was slightly lame but fitting and the special effects were much too overused. The story/scriptwriting was poor, the unnecessary torture/romantic scenes being dragged on for way too long and a disappointing ending.The start of the film was rather slow, the fake-looking gore not much of interest. Trisha arrived at the house, and there was some premise for a good storyline.Trisha started to receive the threatening phone calls, which heightened the suspense. This momentary suspense, the best feature of the movie began to build, but then the friends crashed the place, wrecking all potential suspense/horror in the film.The plot then becomes obtuse from here on. Chemistry sparks between the two couples, and then the killer picks off Frank and the other girl. This scene was dragged on and unnecessary.The killer then makes her way for Trisha and ties her up. There is an overdone torture scene which goes on for at least ten minutes too long. As the gore is done badly this is not entertaining at all, and it bores more than shocks.In summary, the first thirty minutes of this film sound promising but then poorly written dialogue and general lack of plot ruins this film.3/10.","i found this movie to be mostly a P.O.S.it was low budget,but that isn't the problem.the problem is,the movie is just lame.it doesn't really make a lot of sense.yes,it does explain why things happened,but that's not what i mean.there was just no reason for it all.the movie also moved very slow.the last ice age was quicker than this.also, i think they went overboard a bit in the kills.i don't mean they were too gross,but the killer just seemed to spend too much time smashing his victim over the head,or stabbing his victim. maybe i'm being petty,but i just didn't like the movie.the whole thing seemed like a lower rate version of \"When a Stranger Calls\" and maybe that was the whole point.but so what.for me \"When A Stranger Kills\" is a 4/10*","I've read most of the reviews on here and not one mentions these points, so here they are. Chick is on the cell, walking to a house to babysit, in the dark no less, and has to refer to directions to get there. Did she click her heels together to get to the neighborhood? She must have, because if she lived on the road she'd know where the house was. If someone dropped her off? Why not AT the house duh!?! She feels like someone is watching her walking, yet HANGS UP with her friend?!? Swiss cheese for brains?!? THE BIG ONE. She assumes it's her boyfriend calling her cell phone all the times it's really the killer? She looks at the phone screen a lot, yet doesn't know it's NOT him?!? YOU SHOW ME A CELL PHONE THAT DOESN'T HAVE CALLER ID. I'VE NEVER SEEN ONE. If you answer a cell phone call that comes up blocked? Dumber than dirt. If they don't leave voice mail, they don't know ya. THE PARENTS. They spot the killer to let the audience know that the killer is KNOWN the dad says to mom \" is that who I think it is?\" Really?!?! Why not \" wonder if they need help. Mentally challenged writer. I like my plots to have common sense. Not a good movie without that. There's \"Suspension of disbelief\" used to further a plot, then there's WTF. GUESS which one this is.","By all means it is far from great, but compared to the usual schlock from The Asylum, along with I Am Omega When a Killer Calls was actually tolerable. It does have its flaws certainly, most acting is not good, often pretty bad, though Robert Buckley's eyes are gorgeous. They were disadvantaged by that the characters really got on my nerves, not because they were stereotypical but they were made to do irritating things and just weren't that likable. The script also is left wanting, a lot of it has a corny and senseless quality to it, and the story aside from being very derivative has one too many moments where it is predictable and unexciting particularly in the middle. The stalking sequences are on the silly side. However, it doesn't look too bad, you don't expect much from The Asylum in this regard but it does at least have a decently atmospheric feel to it. Even the effects were creepy. The killings are bloody with some suspense too and the finale is truly harrowing. The killer, played by Mark Irvingson in the best performance of the movie, is quite sadistic and exudes menace, if there was any character that was at least convincing it was certainly him. Rebekah Kochan was also believable as the babysitter. All in all, not that bad for The Asylum. 5/10 Bethany Cox","WHEN A KILLER CALLS a TheAsylum release Starring Rebekah Kochan and Chriss Anglin \"MOVIEMAKER magazine recently said this about TheAsylum movie paradigm,to piggy back your film upon other studios marketing-commercials-perhaps threats of lawsuits This is why you can have 3 War Of The Worlds( including TheAsylum w/C.Thomas Howell) make money.\" This is a brutal movie,We can blame the success of SAW and HOSTEL,They must be painful to sell to today's teen audience(Which a whole other article). Guestar was surprised how smart some scenes are,The phone has not been this abused since SCREAM. We were glad to see Chriss Anglin again,and the lead was impressive-REBEKAH KOCHAN,the lady is so sweet and strong in When A Killer Calls,This is most impressive after the mean-spirited friend she played in EXORCISM:THE POSSESSION OF GAIL BOWERS. Hey,Are we wrong or are all text messages on phone props-wasted. The special effects by Mili Rendler are brutal,yet real looking.Faces are contorted in a cutting fashion,and Hands get hammered(NOT DRUNK ).Two other performances we liked are Mark Irvingsen as the suspect and Sarah Hall as the other girl,Mark comes on as time-bombish and Sarah is oddly compelling to the viewer.Peter Mervis ( interviewed last time)delivers a smoother film than DEAD MEN WALKING,his first TheAsylum picture and shows the learning of a craft.","This movie had horrible lighting and terrible camera movements. This movie is a jumpy horror flick with no meaning at all. The slashes are totally fake looking. It looks like some 17 year-old idiot wrote this movie and a 10 year old kid shot it. With the worst acting you can ever find. People are tired of knives. At least move on to guns or fire. It has almost exact lines from \"When A Stranger Calls\". With gruesome killings, only crazy people would enjoy this movie. It is obvious the writer doesn't have kids or even care for them. I mean at show some mercy. Just to sum it up, this movie is a \"B\" movie and it sucked. Just for your own sake, don't even think about wasting your time watching this crappy movie."],"review-user":["stsinger","bugaboo-7","dpags01","bignasty-99","yzerxvid","bob_meg","mdnobles19","Toronto85","Scarecrow-88","mfinsnakesonamfinplane","Michael_Elliott","db96-151-815457","Firetears_X","mysticalgirl","dcaustralia","disdressed12","Aquatica8-540-339259","TheLittleSongbird","guestar57","bayfasoccer96"],"review-date":["1 December 2007","16 May 2006","28 July 2008","19 September 2006","15 April 2006","10 July 2011","4 September 2011","29 April 2011","26 September 2010","13 June 2006","17 June 2012","22 July 2013","19 June 2006","5 April 2006","27 September 2007","22 April 2007","25 December 2012","25 October 2012","22 December 2009","10 February 2007"],"review-rating":["4","5","6","5","4","5","4","3","5","5","1","3","4","1","5","5","1"],"review-title":[" Nasty little film....\n"," Better than average\n"," Better than I expected for a ripoff movie\n"," A decent slasher flick with lots of vicious killing\n"," B movie done well !!\n"," It's creepy alright, but probably in ways you'd least suspect\n"," A rip off it is, horrible it isn't\n"," When a Killer Calls\n"," When a Killer Calls\n"," A great example of \"Oh well, whatever\" in film-making\n"," Better Than You'd Expect\n"," A depraved version to \"When a Stranger Calls\",\n"," Just barely made an average flick!\n"," cliché cliché\n"," Potentially good, but a disappointment\n"," i wasn't too impressed with this\n"," Basic Common Sense\n"," For The Asylum, actually When a Killer Calls is not that bad\n"," Scary Good Fun !\n"," One Word: Sucked\n"]}