{"review-url":["http://www.imdb.com/title/tt0446621/reviews"],"review-text":["Well, the episode I just watched had the older \"Gastineau Girl\" whining about why people keep mentioning her husband (Mr Gastineau, a famous American Football player apparently). She seems unwilling to accept that he's the only reason she isn't flipping burgers, she married someone famous and that's why she has cameras pointed at her.When challenged by an interviewer to explain what she actually does, she gave a wonderfully circular reason for why people should pay attention to her: \"I work really hard on my reality TV show\". Then she said \"I'm not a celebrity... I'm a personality.\"I'm not quite sure who this series is meant to appeal to, except people who've had all their intelligence removed. It's certainly no role model to anyone except gold-diggers as the two stars do nothing but spend money, and all it tells you about rich people is that they have no money problems.","of anything except how not to be in this world and certainly not how real US woman are, these two represent the worst - superficially surgically enhanced money hungry air heads who destroy the value of beauty. My hope is that E! TV is trying to show how not to be and Lisa is too stupid to realize we are disgusted with her not jealous, disgusted at her bleached stringy hair, attitude of entitlement and the emotional damage done to those who are unfortunate enough to cross her path - the recent assistant is so much more beautiful inside and out than she or her lazy ignorant daughter will ever be. Give it up and stay in your Moroccan dug out in shame.","The Ghastly-No-Girls!!!! Having seen the 1st series on TV, I must agree with the vast majority of criticism of this series...Here are two women (albeit good-looking), who only manage to make themselves look consistently worse by simply just being 'themselves'... They have no talent, no concept of professionalism in any capacity, and chillingly... no personality AT ALL!!! There is nothing about them that can sustain any interest at all and I actually agree that the only emotion a viewer can feel is one of profound embarrassment and well-intentioned pity...they look superficial, talentless, easily bored and distracted by the world around them, whilst being sickeningly intolerant of the normal people who try ironically to help them put this excuse of a reality TV show together.","Wow. Just watched this for the first and only time. They are two of the most horrifying women I've been exposed to and I live in New York, where horrifying people are everywhere. They agreed to teach a \"class\" for the Learning Annex? Did they move to New York yesterday? No one teaches at the Learning Annex if they know better. They're desperate and talentless and it would be fun to watch the roadkill of their lives if it wasn't real - if it was fiction it would be funny - but these women actually exist. The producers should be ashamed of themselves - they are making asses out of these women and ensuring them a place in the Talentless and Vile Hall of Fame. Hey Gastineau Girls - get out, if you can, with whatever dignity you might be able to scrape up. I'm so sorry. I'm sure this seemed like a good idea. I'm sure you're not bad people - but this show makes you look desperate, pathetic, talentless, and just a bit disgusting. I would love to laugh at you but it's just too totally sad.","These two beautiful and sexy ladies can remind you of why some equally beautiful and sexy women in revolutionary France had their heads cut off. They seem totally useless! However, we all make it possible for them to thrive. We watch them so we can feel better and more valuable to society. But, these ladies must have their uses, or else why would they be able to live such a high and pampered lifestyle? Why would we otherwise watch them? They've been \"famous\" for more than 15 minutes. In a recent episode, mother and daughter flew down to Miami in a large private jet to celebrate daughter Brittny's birthday. Who paid for the airplane? A whole group of Brittny's friend came down. So did the mother's personal makeup artist. Who paid for him? The two ladies had to make an appearance at some restaurant/club so that all of Brittny's friends could stay for free. Would the rest of us be charged extra to cover the costs to the hotel? They are very entertaining, but certainly not on purpose. The gorgeous daughter has the attention span of a flea Except for a strong desire to wiggle herself and show her terrific figure, and her insatiable desire for her boyfriend, she has absolutely no interest in anything but clothes, makeup and parties. The strongest feature of her otherwise bland personality is her strong sense of personal entitlement. She expects everything and wants to pay nothing. How can you not just love a person like that? And as for Mama, she keeps the people in the beauty business fully employed. Whoever pays for that stuff, it does keep the economy moving! No one ever says a kind word about them on camera. All their employees constantly slam them. No one has the slightest respect for them. Can they possibly be watching their own show? So, why do we?"],"review-user":["catharton","OHBOY","charlesnapier-1","romanceproject","lee8301"],"review-date":["2 October 2006","21 December 2005","28 October 2006","11 January 2006","25 January 2006"],"review-rating":["2"],"review-title":[" Awful, talentless parasitic trash\n"," Gold diggers, lazy worthless women not good examples\n"," The Ghast(ly)NoGirls.....\n"," Sad sad sad.\n"," They make us feel superior\n"]}