{"review-url":["http://www.imdb.com/title/tt0411674/reviews"],"review-text":["I saw this film at the 2004 Toronto International Film Festival. Since I work in the wine business, I had been quite eager to see this documentary, and I wasn't disappointed. Reportedly drawn from over 500 hours of footage, the good news is that Nossiter will be releasing not only a theatrical cut, but a ten-part, ten hour series of the film on DVD by next Christmas (ThinkFilm is distributing it). The bad news is that it's still a bit of an unwieldy beast. When it was shown in Cannes, it was close to three hours long. For Toronto, he's cut about half an hour but it still clocked in at 135 minutes. Now, for me, that's fine. I love wine and I love hearing about the controversies raging in my business. But not everyone wants that much.Nossiter flits around the globe, from Brazil to France to California to Italy to Argentina, talking to wine makers and PR people and consultants and critics about the state of the wine world. The theme that emerges is that globalization and the undue influence of wine critic Robert Parker are forcing a kind of sameness on wine. Small local producers are either being bought up by larger conglomerates (American as well as local), or are being pressured by market forces to change their wines to suit the palate of Mr. Parker, who dictates taste to most of the American (and world) markets.It's a complicated subject, and I can understand why Nossiter wants to let his subjects talk. There is Robert Mondavi, patriarch of the Napa wine industry, and his sons Tim and Michael, whose efforts to buy land in Languedoc faced opposition from local vignerons and government officials. There is Aimé Guibert, founder and wine maker of Daumas Gassac, iconoclastic opponent of Mondavi's plans and crusader for wines that express local terror. There is Robert Parker himself, expressing some discomfort with his influence while refusing to stop writing about the wines that he favours. There is \"flying wine maker\" Michel Rolland, consultant for dozens of wineries all over the world, advising them how to make Parker- friendly wines. There are many many more fascinating personalities in this documentary.If you are a wine lover, you will want to seek out the ten-part series as well as the theatrical version of this film. But even if you're not into wine, the film is an interesting look at how the forces of globalization are changing many of the world's oldest and most established traditions. The effects on local cultures and economies cannot be ignored.(8/10)","Mondovino is an extraordinary documentary. It's self-indulgent, quirky, opinionated and overlong, but it's likely to be indespensible, because it's a devastating anatomy of the growing conflict between authentic local production (the French key word is \"terroir\") and the globalization of wine by which family origins are forgotten and the emphasis is on quick satisfaction, forward flavor, and standardized tastes.The maker of this film is Jonathan Nossiter, polyglot, sommelier, happy tippler, photographer, director, and star interviewer in his documentary film  which began as a quickie, but wound up taking four years to make. Nossiter appears as fluent in Italian as he is in French, and perhaps in Spanish and Portuguese too. He's often on screen, addressing everyone in their native language, but it's his camera that's obsessed with sometimes annoying details, above all dogs.Never mind, though; he manages to get everybody to open up to him, including many of the leading \"players\" of the international wine market, including those who come off the worst in Nossiter's documentary. And even those dogs turn out to have meaning. Isn't one's dog the clearest metaphor for a person's true nature? It's obvious Nossiter likes Battista Columbu in Sardinia and Hubert de Montille in Volnay best  and it's obvious why. They're different sorts of men: Columbu is radiant and serene, de Montille querulous and acerbic. But they stand equally for what may be a vanishing world -- one where wine-making is authentic, personal, local, humane, where it's identified with place of origin not brand, done for pride of craft not profit, or  what the Michel Rollands and Mondavis want  for worldwide, nay, universe-wide market domination. Both dream openly on camera of making wine on other planets and of selling it to everyone.De Montille comes across as mattering more than the Mondavis or any of the other aristos and plutocrats. He has only a few hectares. He makes wine that's severe, edgy, not for everyone  like himself -- and long-lasting. He's true to himself. A big focus of Mondovino is how the California Mondavis  who've already collaborated with overblown first growth bordeaux Mouton Rothchild to produce a pricey California hybrid, Opus One, since the Eighties -- recently tried to get hold of a big slice of burgundy. But a communist mayor took over the town from a socialist one and the sweetheart deal was off. The Wine Spectator becomes, as Nossiter shows, one of the manipulators, and manipulation is an essential aspect of globalization. So too is Robert Parker, of Monkton, Maryland (who gets interviewed and his flatulent bulldogs thoroughly photographed). Parker has always been independent, but his wine ratings (and his taste) have come to wield too much power over the world wine market. French wine-makers are terrified of him, and that situation has undermined their independence. Parker, it turns out, has long been very friendly with Michel Rolland, a super-star French wine consultant (whose Mercedes limo we get to ride around in), and it turns out that the kind of heady, forward, fast-developing wine Parker likes is also what Rolland encourages wine-makers to produce  and globalization means not only eliminating small producers but homogenizing wine styles. Hence Rolland's ebullient charm is suspect, but so are Parker's so-called authenticity and independence. The richness of Nossiter's picture comes out in the way he delineates wine families and their different, sometimes squabbling, members  most of all the de Montilles, the stubborn, feisty and wise old Hubert; his energetic son Etienne, who works for the powerful negociant, Boisset; and his daughter, Alix, in personality closer to Hubert, who decided to leave Boisset because they want her to lie -- to put her seal on wines she hasn't supervised the making of. Nossiter's eye and ear can be devastating. The rich Staglin family in Napa Valley emerges as self-congratulatory and self-deceiving nouveaux bores. Their and other ruling wine families' condescension, outright racism, and covert or past links with the fascists and even the Nazis is another of the persistent filmmaker's gradual revelations. As one Nossiter interviewer has said, \"don't get him on the subject of Berlusconi and Bush\"; but Berlusconi is just fine with the wealthy Italian wine-making families.Another sympathetic dissenter to the globalizing bandwagon is New York wine importer Neal Rosenthal, who knows the importance of terroir and the inroads against it. Rosenthal was present as a speaker after two of Film Forum's afternoon showings of Mondovino -- a local hero, of sorts, for the documentary's US premiere. It's hard to do justice to the film or even list its full roster of figures. Michael Broadbent, longtime Wine Director at Christie's, a dry, aristocratic Englishman, once a leading authority and wine tastemaker, now eclipsed, as all are, by Parker, appears on screen to fill in the central role the English played in the growth of France's finest wines. Bernard Magrez, head of a huge Bordeaux dealership; the Antinoris of Florence (aristocrats with fascist lineage). . .the list goes on and on. One doesn't want to stop, and one sees why Nossiter's film is too long. Because it's all there in the details: this is what the controversy is about. Little things matter. Mondovino is annoying (the jumpy camera, the dog farts), but also riveting and important  a film not to be missed. And for the truly interested, there is a ten-part TV series from this material on the way.","I saw this at the London Film Festival last night, apparently the shorter version. James McNally's summary of the content of the film is very good. Nossiter very deftly blends his investigation of the wine business into wider concerns about globalisation, homogenisation, the effect of the mass media, the power of capital and the need for diversity.The film is shot on hand-held DV which some might find offputting, but which does enable Nossiter to catch people off guard on a number of occasions which probably would not have been possible using more conventional equipment.Despite the sprawling feel of the film, the editing is very sharp, not only giving us a parade of the world's dogs, but also undercutting a number of interviewees' comments with somewhat contradictory visual images, and giving others sufficient rope to hang themselves. To a degree this evoked Michael Moore's recent work (although Nossiter operates in a more subtle way), but probably the roots of the film go back to Marcel Ophuls' \"The Sorrow and the Pity\", both in the way the film is constructed and in the emergence of 'salt of the earth' French peasants as the stars. De Montille pere et fils were present at the LFF screening and answered questions afterwards. We do indeed all need a little disorder - bravo Hubert!Overall an excellent film with implications that go way beyond the world of wine into the way we construct ourselves as people, and organise our world.","Business vs. personal conviction. Profit vs. art.As with any documentary that pits the capitalist large corporations against the small producer, the viewer will invariably have to take the side of one or the other based on their own believes. This is as much a documentary of the new standardized way of doing things that globalization is bringing us, against the old traditional ways where character and the art of making things matters almost more than getting the product sold.If you have to remember one thing from this movie, it is that the masses can no longer decide by themselves, they just follow the taste of one or a couple of critics that tend to equalize and standardize taste in the same way as MacDonalds used to do for the fast bite (something Parker himself admits to in the film against a backdrop of a Burger King sign). \"It is all about image\" against content as another interviewee says. That is the easy way, the standardized way. Easier than taking the time for a nice wine to mature, easier than to forge your own taste by trying and trying yet over again. Controlled branded taste is easier.There is a glitter of hope when even some of our cousins across the ocean agree that a few people are \"levelling\" the taste of wines to maximize the profits and ensure a maximum of it gets sold to the \"grey masses\". Individuality and difference is sacrificed for the extra buck. It is nice to see that not everything or everyone is giving in to standardization, even across the ocean.As in many other areas of today's world, dominance of a few and reduced freedom of choice impacts us all... let everyone make up their mind and decide what to go for. Too much standardization kills the mind and taste; difference brings innovation and healthy competition and will allow for choice - and not just vacuum-packed \"more of the same\". Standardization sells easily and a lot, and brings everyone to the same level - the lower one.On this, I am going to open up a nice bottle and wish you a hearthy \"sante\".","Mondovino is a dense, rich, and complex documentary on the power struggles and major players of the \"wine world\" elite. It depicts the endless struggle of the old world versus the new global capitalist order. On one hand we have the older, aging, independent grape-growers and wine makers of Burgundy and Tuscany. They have a philosophy of wine as a symbol of civilization. It's not simply a commodity to them. The production and consumption of wine is a religious experience between man and the earth.On the other side of the \"war\" are the major wine-producing conglomerates, such as the Mondavi family of Napa Valley or the producers of Ornelliai wine in Italy. No, these aren't bad people. They simply have a different philosophy on wine production, and they eagerly embrace the new technologies and innovations in wine fermentation, such as the \"New Oak\" barrels that speed up production. They also hire Michel Rollan, a world-famous \"wine consultant,\" who tells people how they can better the quality of their wine through different production processes. But the smaller, more independent wineries see \"wine consultants\" as harmful to diversity, because they worry that consultants seek to make all wine the same. Just because one consultant likes or doesn't like a wine, does not mean that every pallet will agree.Mondovino also shows the dark histories of many of the world's most powerful wine producers. Some of the most successful wine makers in France collaborated with Nazi Germany in World War II, and most of the major wine producers in Italy supported Fascism and Mussolini. There are still racist and elitist undertones in much of the wine world today. Mondovino carefully weaves together the web of land, power, politics, and wine.This film is a lot a great bottle of wine. It's complex, multifaceted, and can't be rushed. I'm not going to lie -- Mondovino is not a short movie. It's over two hours long. But like a great wine gets better with age, so to does this movie get better as time progresses.If you've ever wanted to know more about wine and the people who make it, this film is a great resource to learn from. \"Wine people\" are going to love it. But for the average Joe who just wants a good time at the theater, this probably is not the best selection for him. It's not entertaining as much as it's educational, and if you're not in the mood, you're not going to feel it. Just like how you can't enjoy a savory glass of Pinot Noir if all you want is a beer.","I was expecting a lot from this movie, and I can say I haven't been disappointed. First of all, this movie, as a world tour of wine making, let the spectator enjoy beautiful places. The people interviewed are really interesting and funny too, in particular Hubert de Montille. The shooting may be confusing, the camera always being unsteady and often focusing on secondary elements in the backgrounds. You may not like it, but I don't consider it as a defect.The themes raised in the movie may be kind of confusing as well, since globalization isn't the only issue discussed. But Nossiter managed to give his movie a consistency all along. A great achievement of this movie is revealing all the characters involved in the wine industry as they really are, avoiding a cliché \"Good against Evil\". This could be the main difference between \"Mondovino\" and Michael Moore's documentaries; Nossiter's point of view appears in a subtle way, through opinions expressed by his favorite characters. The richness of this documentary relies mainly upon the characters, the history of long-time wine-making families, such as the De Montilles, the Mondavis, the Antinori and the Frescobaldi. Nossiter lets the spectator discover that wine is somehow related to families, rather than just being a business and an industry. This movie doesn't make you want to drink wine, but certainly make you want to discover vineyards and wine-makers.I watched this movie as a student in Enology, and let's just there are many ways to learn. I give this documentary 10 out of 10, despite his technical particularities.","A very interesting documentary - certainly a lot more than Sideways, a pseudo wino drama - where the capitalist conspiracy is revealed in all its greed. According to the documentary - and confirmed by the recent publication of a biography on Parker - only two men dictate the nature of wines in the world: Robert Parker of Massachussets and Michel Rolland, a French wine industry expert based in Bordeaux and also known as a \"flying winemaker\". The director is clever enough to insert interviews of local wine producers from many different regions of France, from Sicily to Argentina and interviews of the biggest players in the industry such as the Mondavi family to uncover the wraps on the globalization of wine making and marketing. A must see for anyone interested in the dark side of the industry. Drinking a glass of wine will not be the same political and commercial act after watching this well made documentray.","Just saw this movie 2 days ago. A very interesting look at people and our world through the world of wine. I have no special interest in wine, and yet I found this very enlightening. The director gave me the impression that he has the ability to show people as they are. While he exposes a lot of things that are below the surface he manages not to take a stand and leave that for the viewer. He shows a lot of compassion to people (and dogs) and sympathy and let people tell their story and in the same time exposes what they don't want to tell.The movie shows us where our world is going to, what are the benefits and what is the heavy price we pay. It is a movie about the love of wine and the love of making it big, personal and global, character and formula.The real stars of the people for me are the older wine makers with their disillusioned look at the world and themselves.It takes some time to get use to the hectic camera moves and editing, but it's worth it.Highly recommended.","It's not really about wine. No, Nossiter's real targets are those who would streamline and assimilate the peculiarities of local (wine) production for business purposes. To this end he has made an excellent, objective film. Spirited, bumptious, emotional and flawed independent wine producers are juxtaposed with media-finessed, anodynesprech Amercians and auld-Europeans: the art of wine-making against market-driven, laboratorised product manufacture. It's an open show that doesn't lead conclusion.Nossiter's film is occasionally infuriating to watch - cameras are neither concealed, nor steadicam, by any means. There are also plenty of captions as well as subtitles to wade through, often too short a time on screen.However it does outdo Michael Moore at the game Moore can't play anyway. The characters speak for - and therefore condemn - themselves. Well worth a viewing 7/10","Our reviewer from Toronto told you what you need to know about this film (except note that it needs editing-the hand held technique gets really old, really fast). I saw this film last night in Menerbes, France-we are in the Luberon Valley, which is covered with vineyards and of course wine makers. They were all there in the Salle de Polyvalente for the showing-crammed in. Polite, patient, genial. Although my French is testy, I got the gist of the film but noted that the audience loved the \"old\" terror growers interviewed-esp. the one from a communist village in Languedoc. He got a lot of laughs. This is unusual in France-laughing aloud. There is no question which side of the terror-globalization war they are on! SM","mondovino is a moving and rewarding documentary. in the world of wine there is a huge different between the big winery and the small one. it's not just about size of of your vineyard but also the amount of money and power you have. if you have enough money to place ads in the wine spectator and hire a so called \"wine except\" then it doesn't matter the size of your estate. also in business world of today wine often has to mass marketed and suited to people's taste. what is means many times wine filtered of it's origin. mondovino shows the commercial side of wine in that of mega producer Robert mondavi, and Michael Rolland the wine expert who shapes wine to the taste of today's critics like Robert parker who is also in the film. now these men are not evil or wrong for they have done a great deal of good for wine. but they have power on a grand scale. as we all know power corrupts. mondovino also shows small wine makers such as Aime Guilbert of the languedoc and Hubert de montille of volnay in burgundy. these wine makers are not starving wine makers but they know like all great wine makers that it's about where the grapes are from. the best example of this is explained not by a wine maker but by a Haitian man working for Neal rosenthal the wine importer. the area the grapes are grown the terroir that matters, that a guiding hand that knows this makes important real wine.","The film is annoying.Technically, there are too many times you see unfocused and very roughly edited scenes. One could easily get a cleaner film using a decent amateur camera and 100$ video editing software. Down to earth, man on the street doesn't mean sloppy editing. Unfocused scenes that don't contain important statement should have been deleted. The same goes for making sure that the object's head/hand/others stay in the frame. My 8 years old son knows that by now.The film is way too long. The main point (anti globalization) is understood after 30 minutes, why bother with all the rest. After the interview with James Suckling I pressed the \"stop\" button. What a waist of time.The main theme just doesn't work for me anymore. I've seen too many small wineries which produce mediocre, commercialized wines and many big wineries that produce great and unique wines. The movie identifies the small producers as the ones that are producing wines with more Identity, or terroir. The bigger ones are accused of producing \"internationalized\" or \"commercialized\" wines. The film is trying to make a black and white statement in a world full of gray tones. However, the movie hasn't proved this claim. They look at a couple of sporadic examples, \"tie\" some of the big producers (Frescobaldi) with fascism and provided \"interviews\" with key people. Well, did all the small producers spent WWII in the resistance? Is it relevant to see that Parker has a thing with Bulldogs? The movie is very manipulative and unconvincing.","Did Beavis and Butthead make this movie? It is just that bad. Truly an uneven and unfair portrayal of \"bad\" vs. \"good\" in the wine world. Did you notice the filmmaker trying any of the wines from the featured protectors of individual wines and terroir. The camera work is dizzying at best while the content may put you to sleep before long. This is not insightful journalism. What I got from this movie was that the filmmaker was trying hard to make a point about the globalism of wine by showing, for example, that the Mondavi family owned wineries in all parts of the world. Okay, that is a good start. So, how do these wines compare? Does the Mondavi Napa cab taste like their Italian wines. We never find out because no one in the film comments on this. Instead, there is a lot of innuendo about Nazi's and fascism. Well, those things don't grow grapes. Hmmmm.","The spoiler warning exists solely because I will discuss specific details. Not because there is anything like a dramatic arc to be spoiled here.My friends and I watched this one night during our weekly wine club. It was unanimously panned and long enough that by the time everyone was sick of it there was still 45 minutes left to openly mock it. The movie is sprawling and unfocused. Unfortunately, it does not appear that it will age as well as, say, a wine. Its topic, globalization, was a much more ripe one when filming of this began. Perhaps in this regard the movie's focus on the many eccentric parts once felt more fresh. Pre-Thomas Friedman, Al Gore, the rise of the global economy and global catastrophe, perhaps it was much more novel to realize how a village in France and blowhards in California (the movie's perception) could be so intertwined and yet maintain their eccentricities. Unfortunately, in 2008 it feels stale and its large scope seems unfocused and prone to repetition and rambling.In fact, I would not hesitate to give this documentary a lower score but the film maker's camera antics occasionally provide some real, if non- productive, laughter. (Spoilers) Examples include zooming over a woman's shoulder as she talks, to the presumably more interesting goldfish in the background, zooming in on the nostril of a winegrower waxing eloquent of wine-making as art whilst considerable mucus oozes from his nose. Allowing a California couple to provide an in depth tour of their stucco 'mcmansion' while sounding like they are describing Versailles is also hilarious. All of which are kind of mean and a lot of work for their relative contributions to the story.","It is truly interesting to have the opportunity to read all this disappointed reviews now, that the documentary has more than ten years.\nAll the silly comments about the directing that wasn't enough \"movie\" and glamorous as expected.\nAll the silly comments about the director that, in a \"war\" between the old world, European style of wine, and new world, Californian style, push for the first when it's clear that the winner is the second.\nNow history can tell us who is the winner...","I watched this documentary because it said that it is about the globalization of wine and how this is impacting different wine regions of the world. My interest in wine is rather new and I am still in the initial research phase, so I thought that this would be something educational for me. Instead, it brought me mostly frustration.Basically the movie is about this: in Nappa valley there is this guy named Bob Mondavi, a real power player in the wine world. He tried to buy in his way into a french wine producing village to extend his \"domain\". He failed. He goes to Italy instead where he has more success. Oh, and he has set up shop in other parts of the world as well, mainly south America.In detail, 3/4 of the documentary is about the french affair, where the locals are presented, the small players, the big players, Mondavi is being presented, some fancy wine consultant is presented and a guy named Parker who is a wine critic that can make or brake wine companies worldwide. The french bicker amongst themselves and lament about how Mondavi, Parker and the consultant has changed the way of doing business and these 3 in return say that there is nothing wrong with their way. In the last quarter of the documentary, the focus is shifted towards Italy, how they came in contact with Mondavi and have found that everything is OK. At the very end there is about 10 minutes of shots from south America, not that it matters anyway.This documentary bothers me. First, it doesn't knows what it wants to be. It is not about globalization, because it covers only one business deal and its consequences (barely). Its scope is not global, it doesn't even mentions the emerging Asian markets, hell, it doesn't even covers Europe, just some parts of France and Italy... Also, it tries to give an insight into the way of life of the wine makers, on a personal level, but does so in a manner that is totally distracts the focus about the main theme of the documentary. However, the main problem with this documentary is the low technical quality, that make its weak substance even worse. Whoever shot the movie had no idea what it is doing. The camera shakes, the angles are all wrong and the focus is all over the place. Some wine maker is being interviewed and the camera just zooms in on hie eye, or his mouth so I can see how bad his teeth are. Or it zooms in on the fat old guy in the background that is going down a latter. The dialog still goes on but all I can see is Santa coming down from the roof. The editing is also abysmal. Every dog that the crew encountered during the making of the documentary gets a good 5 seconds of close ups in the movie. I know now that the worlds most influential wine critics french bulldog farts... Why is this important? Why was this not cut out? I know that the wine consultant sends out his driver to buy him newspapers and cigars. The maid comes in, sees the camera, gets shy but eventually asks if anybody wants to have a drink or something. Some guy passes trough the room where a woman is being interviewed, than passes back a moment later, both times they have a brief chat that has no value to the documentary whatsoever, yet everything makes it into the documentary. Some kid is being washed in a sink, on a porch in south America, I can see clearly that its a boy. An ugly/old piano player woman puts up makeup at a dinner event.There are countless such distracting elements that have no relevance, no added value, no contribution for the subject whatsoever. They should have been cut out. High-school kids could achieve better production value with their cell phones. And even if this movie is from 2004, I expect better quality from somebody that has the budget to travel around and the access to talk to VIPs. Over all, this is a mediocre at best, shoddy, narrow view documentary that does not worth your time and effort.","Brilliant film, shows how far greedy men go to create illusions and magazines and clowns that dictate \"taste\" as if it can be dictated, it shows so well how greed and abundance of the cheesy gets to destroy \"craft\" and \"beauty of making\" is the Wallmart of wines against small true wine makers, David vs Goliath A true inside story into the world of wine, loved the tone, the real style that reveals men's intentions and puts a face to greed. From Italy to France you see the real deal, you discover so much in this documentary, like the racist Argentine who talks about natives in the most disturbing way but excuses how he is part of the big global cheap crafted wine making","A terroir consists of - Climate, Soil type, Topography, and Other plants growing in and around the vine plots Now seeing this film, we are convinced the human factors will play an even critical role than most of the above. Wine reviews guide you to read (not physically touch) the terroir of the wine you are tasting, while the production, distribution, advertising and the pre-determined taste buds determined by a few individuals, during the course, shaped what you think you are having.This is a film for wine lovers to re-think why you fall in love with wine. You can be not so subjective to reviews, just like not seeing a review before going to a theater, or like being open-minded to know someone, without first checking his or her resume.Like all the characters in the film, though more towards those who are pressed by the more financially dominant side.","I've heard people compare this movie to Sideways. How this comparison was made, I'll never guess because this movie was in no way comparable to Sideways.These 2 films were as different as Star Wars and the Thornbirds. The only thing they had in common at all was they both had wine as a subject.Though the interviews in this documentary were semi-interesting, they were ruined by the absolute worst camera work ever...attempted. I've never seen worse camera work in my life and I'm comparing it to home videos accidentally taken by 5 year olds.I give this two stars, ONLY for the interesting interviews with French wine types and for showing how pushy and corrupt the American wine companies are (Aren't all companies pushy and corrupt?) I'd give it -10 stars (Yes, that's NEGATIVE 10) for the deplorable, terrible, horrible, awful, VERTIGO-INDUCING, 5-year-old-could-do-better camera mess.","eddy_mercury in his comments misses the point. The film maker is regretting the standardisation of taste that has occurred because of the way in which the value of the American market in wine has led to a steady and stealthy narrowing of choice when it comes to the style of wine. Nobody would deny that the standard of wine has improved. Nobody would deny the French have been too arrogant for too long. However it is to be regretted that the American public as a whole is so sheep like in following the taste of Robert Parker. He know what he likes and the great American public, which doesn't, is happy to say \"Yeah and I like it too\". Unfortunately what you will end up with is less choice. Look at what passes for cheese in America, and compare it with the wealth of choice that is available still in the Old World. Do you really want wines that will be like Kraft slices compared with Brie? Trust me, not all wines have to be big tasting reds barrelled in new oak, and giving endless, unchallenging, \"easy-drinking\". What next - Château Yquem Lite?","The filmmakers try to paint the influence of the Mondovis and Robert Parker as a travesty on par with the German occupation of France and the reign of Fascism. But they never find a victim in this film. We hear wine makers, critics and distributors bemoan that while the wine industry grows it becomes increasingly homogeneous. But the film never makes a case that this has resulted in the loss of any good wine or exploitation of any person or culture other than naive Wine Spectator readers with lots of cash. If they want to pay hundreds of dollars for a dull wine, so be it.If this were a film about the diamond trade, where the DeBeers corporation's market domination results in human suffering, the muckraking style might have been appropriate. But as it is it just comes off as anti-American, anti-modernization and anti-capitalist. Had the filmmakers been around in the 1870s they most likely would have protested the grafting of American vines in the effort to save French wine.","As noted in other comments here, the camera-work is laughably bad. I am tempted to say that the director of photography is a 7-year-old, but that would be mean -- to 7-year-olds.Okay, but what about the subject? I was looking for some insight into the state of the wine industry worldwide, you know, Mondovino. What the film is about is a very narrow view of one intrigue in that world: the struggle between Mondavi and the French and Italian wineries that they would like to buy. There is no enlightening narration that would put the whole deal into context, so we are left with the selective process of the director and the interviews with the various characters in this little psychodrama. There's no shortage of despicable characters, or even despicable dogs, in sight. There is a shortage of evenhandedness, however. Is the director a Marxist? I wondered as I tried to maintain some semblance of focus as the camera dipped, swerved, zoomed in a chaotic flourish. Small grower in France: good. Huge grower in USA: very, very bad. Forget about the hundreds of small wineries throughout North America, Australia, and South America. There is a dead horse to beat here for over two hours.To learn about the intrigue more, you are better off reading about it elsewhere. And you will be able to sample your favorite wine without feeling sick while doing so.I suggest a new award at Cannes for Best America-bashing Diatribe.","i was looking forward to this, and to be honest there were some bright spots, but it would have worked better if it had concentrated on one story rather than shooting all over the world. The many dogs were a lot of fun but i got bored of the wine fascists pompously whining (;-)) on about their achievements.I felt it would have worked better as an hour long TV documentary, concentrating on one of the many different issues it explored. The most interesting being the french town near montpelier fighting off a an American wine company's campaign to get rid of the historic forests. A socialist mayor agreed to a deal, a nicely timed election arrived, and a communist mayor was elected, who turned it down, much to the exasperation of the American wine execs...hopefully the director's cut will be shorter than the original..","Oh God! It could be a very interesting film and in fact it is. I would have like to give it a 5 but i give a 2 for my vote. Why? I saw it in a theatre! See this film on DVD or on TV! The shooting is really really POOR!!!!! It keeps shaking all the time, in a completely tasteless framing!Its really painful to see this very interesting film in a cinema. You got quickly seasick and you have to make some huge effort not to puke on your neighbor 's seat! It's really a shame 'cos, the story is edited in a non-linear way which is quite rare (and a very good idea!) for a documentary. Watch this at home!","An interesting movie, but what a load of hooey! The movie completely ignores the fact that in blind tastings, French critics who dismiss the pretensions of the Napa vintners and claim to prefer the pure, natural taste of terroir, choose the American wines. This movie is about hype all right, but it's not Mondavi; its about the pretentious claim of many a traditional winery that only centuries of winemaking culture and knowledge of terroir can lead to a good product. This is about as ridiculous as the claim that good bread can only be produced in certain traditional locales, i.e., that a Parisian baguette can only be good if it is from Paris. I'm glad to say that both good bread and good wine can be found in many, many places, and more every year. And speaking from experience, the Chilean and Argentinian wines of 30 years ago were dreadful! Nothing has been lost in adopting international standards for their wine industry."],"review-user":["mcnally","Chris Knipp","Krustallos","The_Pc","leilapostgrad","legalerien","jjlasne","OzOsman","Framescourer","housesforhire","tomstrock","yaronz","quadi","coolerdenu182","sergiodibari","tagheue","humanitarione","kickall","scotking","Simon_peters","monkey-84","Nog","mj_togher","boromus-1","eddy_mercury"],"review-date":["12 September 2004","1 April 2005","25 October 2004","21 January 2006","12 June 2005","30 November 2005","11 October 2005","27 May 2006","29 October 2006","15 April 2005","24 March 2005","19 March 2007","28 September 2007","5 April 2008","1 May 2018","26 April 2015","10 August 2011","3 August 2010","18 December 2005","6 February 2006","7 January 2006","5 September 2005","17 April 2005","16 November 2004","18 December 2005"],"review-rating":["8","8","9","6","10","8","9","7","8","8","1","1","5","8","5","10","10","2","6","3","4","4","2","6"],"review-title":[" Too much of a good thing?\n"," Dry, but fruity, and long on the palate\n"," Don't Ask About the Dogs\n"," The incorruptibles of the wine business\n"," Austin Movie Show review\n"," Micro oxygenate this!\n"," A flawed industry\n"," Interesting, real, compassionate and full of dogs :-)\n"," A simple, powerful anti-globalisation documentary\n"," Standing Room Only Audience\n"," not just for people who love wine\n"," Don't bother - its a waste of time\n"," This sucks change it\n"," I guess not my taste.\n"," A life ago...\n"," Maybe my expectations were to high....\n"," Small real wine makers battle against Walmarters and pop magazine\n"," Terroir, and people attached to it\n"," Semi interesting interviews ruined by deplorably horrible camera work.\n"," Interesting film, with irritating camera-work.\n"," Schlock by a wannabe Ophuls\n"," Not terribly informative, dogmatic, and yes, undisciplined camera\n"," long rambling film, would have been better, shorter\n"," OK if you are a sailor!\n"," Typical French Bad-Mouthing of American Wines\n"]}