{"review-url":["http://www.imdb.com/title/tt0457342/reviews"],"review-text":["This movie probably began with a good idea but that's as far as it went. When I read the cover at Blockbuster I thought it had promise but that was based on the overall idea for the movie. The movie began with a professor talking about how in the future we will be able to see creatures from other dimensions. There was no explanation of how that would happen but that's okay I thought it would be developed that in the movie. It wasn't. In the next scene we see two young men lying on tables with tubes taped to their heads. Beside each one are two attractive women. The men begin asking \"Do you hear that\" or \"Do you see them\". We conclude they think they are seeing ghosts or some other creature that seem invisible or they are hallucinating. The women do not see these creatures. This was fine for the first five minutes BUT THIS SCENE GOES ON FOR A FULL HOUR. It is briefly punctuated by flashbacks that have no correlation to the so called \"plot\" of the film. We are also introduced to a man in a lab coat and what appear to be Middle Eastern terrorists. What is this about? We never find out. The flash backs lead us to believe that the terrorists are forcing the man in the lab coat to perform diabolical experiments on these young people but we never understand why. At the end of the movie the terrorists finally do what terrorists do  they blow up the lab, but why? What is the point? We have no idea. This film contains so many disconnected thoughts and ideas that there are too many to enumerate but one more notable one is that fact that the man in the lab coats and the terrorist pop in and out of the room throughout the movie and not once do the young men attempt to escape or even leave the tables on which they are laying even though they are not strapped down! The makers of the movie also bring in cameo appearances by cockroaches on several occasions but again we never learn what that has to do with the storyline. Sorry but this movie was a waste of $4 and the time I spent driving to the rental store and then watching it. Take my advice. Don't rent it.","I would have given this LESS than a 1 rating if it were possible. The entire film should have been left on the cutting-room floor. What a pathetic waste of time, money and effort! Let's see...assemble the prettiest cast you can find (which of course is in direct proportion to the amount of talent they lack)...throw together the thinnest plot you can dig up...and viola! An abominable piece of trash that the director and/or producer should be ashamed to put their name on. How much WORSE can the horror genre get? And don't use \"low budget\" as an excuse...I have seen many GREAT low-budget films....in fact some of the best horror classics of all time were low-budget. If you don't have the talent and ingenuity to make a GOOD horror film, then for God's sake don't make one at all!!!","I gave this movie a four-star rating for a few reasons. First, I felt that this movie was definitely preaching and I hate that. Still, it's my own fault for watching a Christian movie in the first place.My friend and I rented this movie because it sounded interesting. The back of the case said something along the lines of a spiritual battle, someone opening some sort of boundary that let demons into our world and the like. Something I am very interested in, indeed. This movie almost hit the target. It was more like on the edge of the target, more on the tree than the target itself...The basic plot of this movie is two couples are abducted by a group of terrorists to be victim to experiments. However, because their experimental serum is derived from the research of a scientist who claimed to be able to bridge the gap between the physical and the spiritual realms, the men of the couples are now able to feel, smell, hear, and see the demons of the spiritual world. In that order. Apparently the sense of taste is not present in that realm.This movie is very clichéd. They took the title seriously as the men, while chained to the beds, demand their women look behind them because there is something there.Although a good effort for what it was, I think the special effects could have been done so much better. The demon scratching at the woman was, in a word, hilarious. The wife was obnoxious as hell and everyone in the room practically cheered when she died. We were all hoping she'd be beaten by the other woman with the chair, though.The message is one that I don't care to comment on, other than I think the Christian filmmakers should have found a better medium for it.And so I give it four stars because it is not the movie's fault I am not a Christian and don't like this type of message, and I got a kick out of making comments throughout. My friend and I watching this movie seemed to resemble an episode of MST3K.","Evil Behind You, was created for a specific purpose in mind, to shove the writer/directors personal views on who either gets to walk on water or who gets to dance with the devil. Sadly it would seem that the creators were so focused on making their point that they took it's power away completely by force feeding their point to the viewer.The way its message is presented Almost reminds me of the stories I've heard of the Spanish inquisition! From one real Christian to another, Avoid this like the plague, fear tactics never work when trying to send this kind of message!!The acting was horrible,the selection of Muslim terrorists was racist and unfair(they're terrorists so they must be Muslims). The premise of this was good, the story provided a great conduit for its message, however it was the execution of these ideas that fell short making it very difficult to even separate the message from the messenger so to speak.You'd be better off dusting off your old \"Ghost\" DVD with Mr Swayze to better receive this message. at least that movie didn't try to shove itself down your throat. Or if you like Good Christian movies with a powerful message, try \"End of the Spear\"","Do not waste your money or time. Terrible movie. Bad acting, plot all over the place. Really, really bad acting. Man, this movie is just plain bad. I shut it off at 7 minutes. The script is bad, the directing is bad, it seems to me that a high school group got together to do a project for their drama class. Yes, it's that bad. The acting is not convincing at all, mind you I saw only 7 minutes of it. How this movie made it to DVD, is beyond me. It should have been left in the editing storage room. I saw the cover and thought it was pretty cool, I sure's heck won't do that next time :_)","Let's see, cardboard characters like Muslim terrorists have forced a cardboard scientist to perform some exotic drug tests on some cardboard people who have been drugged and kidnapped. You'll be sure to laugh when these pathetic excuses for humanoids get their just deserts! Turns out the drug experiments have given them the ability to sense another world....the world of religious fantasy!--complete with cardboard demons who look like they are made of Papier Mache. Everybody gets dragged off to Hell except for one poor chap who goes to Heaven where he can presumably spend Eternity with the blockheads that created this Masterpiece of the Absurd. I think I'd opt for Hellfire myself. Go see something else, unless you are stoned, in which case, you might actually like it! Couldn't hurt!","I am completely into this type of story line but once the movie fired up, I honestly said out loud, \" I just rented a two dollar budget Christian POS\". The only thing I could find to like about this film was it has a descent story but it was awfully executed. Horrible actors, horrible direction and producing.The director and producer need to go watch the cube before trying to pull off a movie in a single room. There was absolutely nothing that kept you intrigued to the point that you didn't notice you were in the same room the entire movie. Horrible! The two main actresses were very easy on the eyes and you could tell that was the director counting on to hold your attention. But these two and their bios can speak to this, are horrible in front of the camera.Don't rent this. Unless you are blind, because it might go up a few stars if you only listen to it.","I watched this on Hulu yesterday and did stick with it to the end. The film is misrepresented as horror as far as I'm concerned. This was more like the type of film you'd see on a Christian TV station since the message is more about where your soul ends up after death. It was made with production company of mostly first timers and based on that I have to give them credit for doing better than many \"professional\" Hollywood productions I have seen. Remember \"Battlefield Earth\"? I wanted to gouge my eyes out after 10 minutes of that abomination. I did think some of the acting was OK. The Dr., Lisa and David characters had some good moments. Lighting, sound and cinematography were impressive for a first time effort. The special effects should have been left out. If you are a true horror fan you will be disappointed. If you prefer the type of Christian films that deal with end times, mark of the beast, etc you'll probably like this.","As far as Christian film goes,it's typical.Lacking of a mega-budget they try their best.Some times falling short,sometimes hitting the mark.This one almost hit, great acting can only carry a movie so far.A combining of H.P. Lovecraft,and Frank Peretti was a good idea.All's it needed was better back story, and better character development to make it great movie.The visuals are not that bad,also smart holding off the demons till the last few minutes helped keep the suspense at a good pace.Could of used a better ending though.Not a bad premise having terrorists experiments go wrong.Much better than typical Hollywood treatment about the demonic realm.Maybe someone will finally do \"This present darkness\" as a movie.","When the movie first started I thought cheesy. The first ten minutes were really boring. After the slow beginning and some of the soap opera antics, I started liking it. The plot was different than anything I had ever seen. Now, was it a horror? Not really. It shouldn't have been classied as a horror or the producers should have put more money into the movie to make it scary. As it was, the creatures where only there for a short time. I can only assume this was for money reason.The good side was that the movie was very entertaining. It held my interest (after the start) and did make me wonder about creatures from another dimension.It was obvious that this was a first time movie for the director, but there were a couple of highlights. By the end, I was hooked. Too bad Hollywood didn't put more money behind this.","All those who are into being PC are aghast at the dogmatic Christian view of this film, claiming it contains racist ideation and/or religious intolerance.Those who don't care about being PC, but are oriented towards slick production values and competent acting are dismayed at the lack of such here.Those who decry this film for both of these points are apoplectic that this production was let loose on the general public, as evidenced in comments here.What is an interesting premise, which isn't original, but is a combination of GHOST and FROM BEYOND, is dealt with in a rather immature manner, yet done with gusto. What the crew and actors lacked in sensibility, professional abilities and technical expertise is somewhat offset by the effort displayed.It isn't nearly as bad as many here think, and would have been fine in the hands of someone with maturity and common sense, though it is enough below mediocrity to elicit laughs and groans. However, it unfolds with enough intensity to keep interest throughout, and is close to on par with a Corman-produced entry of his earliest period of work, or the material of Arkoff or Sam Katzman. If you get it for $2 (or less) as did I, you won't feel disappointed, but will wish you could have had a say in how it was made.","This is possibly the worst movie I have ever seen. I saw Motor Home Massacre and thought it was the worst, but after watching this one, I changed my mind. I paid 49 cents for the movie at a going out of business sale and I overpaid. Honestly, I don't know what the movie was even about. The whole thing take place in one room with people lying in bed with gaze over their ears. Their bimbo girlfriends/wife say \"I wonder if they've been operated on\". They are screaming for a nurse. Oh,he's probably just feeling effects of the anesthesia. Their in this filthy room that reminded me of the opening to Saw. The girls starting bickering amongst each other and the boys laying in the bed pop up ever so often giving these weird looks, saying \"There's something in the bed with me, get it out.\" They say \"Did you hear that\"? What the heck is this movie even about? There are some skeleton looking people near the end. And then a girl escapes, picks up a hitch-hiker which disappears in her SUV (which doesn't seem to bother the girl at all), then she picks up a boy on the road. That was 80 minutes of my life that I'll never get back.","The film opens in 1952 with a guy telling us about dimensions that exist on the same plane with \"things\" that can see us but we can't see them. We know this is true because he is wearing a white lab coat. Two couples are abducted by something that looks like the Serbian cartel and are part of forced experiments where they can see the other side, which look like black and white low budget effects,The acting was bad throughout the film as it consisted mostly of four people in a room whining about something being in there with them...and they have a few flashbacks which are basically meaningless.Hilary Kennedy provides eye candy and cleavage shots.","Four couples wake up in a room with the men chained to beds and the women trying to help them. They are being used in an experiment with a mind altering bacteria that has deadly results.This thing is at a whole new level of bad. It felt like I was watching a grade 8 play. The acting was even more incredibly bad. For an hour and a half we have to listen to the guys give us a play by play of what these creatures are doing that nobody can see but them.Then I realize what's going on. This is a Christian film. They quickly slap a lame scenario together just to show us that demons won't pull you into hell when you die if you're a Christian. So that explains the acting because you know a guy got his friends from the church to be in his film no previous experience required."],"review-user":["craftware","atomic_age57","hollie_haley","madigan356","mdancingcutie01","yurshta","medifetish","mcarrrr","ak6702","jc1-7","rixrex","ilvpugz","nogodnomasters","shawnblackman"],"review-date":["27 April 2008","22 March 2007","17 September 2007","1 April 2007","27 July 2007","19 February 2007","23 December 2009","6 September 2010","24 February 2007","25 May 2007","18 April 2008","16 October 2010","28 March 2018","18 November 2016"],"review-rating":["1","1","4","1","1","1","1","6","7","9","1","2","2"],"review-title":[" No plot, poor writing, no sense\n"," How in the WORLD did this end up on DVD???\n"," Could have done so much better\n"," Make no mistake, this is a Christian Movie\n"," Terrible, awful, horrible, bad, DO NOT RENT\n"," This Film is Pathetic.\n"," A complete Waste - Horrible Directing and the budget had to be 200 dollars\n"," Not a horror film\n"," Not a bad rental.\n"," Low Budget .... but enjoyable\n"," Dogmatic & simplistic viewpoint elicits groans from many but...\n"," Huh? I don't get it.\n"," There is something here with us\n"," Leave This Evil Behind You\n"]}