{"review-url":["http://www.imdb.com/title/tt0476614/reviews"],"review-text":["I went to the pilot show last summer and as funny as it was I'm not sure how this would work on a weekly basis. All the guest we're played by Mathew Holness (Garth Merenghi)and a lot of the humour came from the banter and mistakes between the two of them. I thought it was really funny but i don't know how much would be lost in the editing room. There was a seriously hilarious music video with Mathew Holness and Matt Berry which opens the box to more surreal musical humour giving the show a bit of backbone. I think Richard ayoade is seriously funny guy and i think if he gets the rest of the boosh and darkplace crews involved it could be another cult classic.","The first episode of 'Man to Man with Dean Learner' that just aired was at least up to scratch with most episodes of 'Garth Marenghi's Darkplace' and had me at \"My Maisonette\". Hope it keeps up the good work of 'faux terribles' on my TV. Richard Ayoade is one of the best in the new breed of \"alternative comedy\"(I hate this phrase but am too lazy too think of another one.) comedians on TV today.I'm glad that on a trip of local DVD retailers today \"Garth Marenghi's Darkplace\" was sold out across the board. Even from his brief stint in Nathan Barley I knew that Ayoade was a serious talent and I'm sure he would have been great as Dixon Bainbridge in 'The Mighty Boosh' To continued success! In the vein of these programs I also felt it necessary to extend my review, in order to secure a place on this public domain.","After the highs of darkplace it was never conceivable that Holness and Adobye would be able to create anything half as good as garth marengi. Yet i think that man to man in its own right is as good a show (on the good episodes) as darkplace. i cant argue that 2 of the episodes really are'nt that good but the other 4 certainly make up for it. if i had to pick 2 great episodes id go for formula4 driver Steve Pising (pronounced Pissing) and the great Garth Marengi. to already have a bit of understanding of the programme is a real plus as Dean Learner makes many inside jokes but even if you have'nt seen much Dean id recommend this as some of the rants he launches into are genius ie. His argument with Def Lepord over their name. All in All a great show which just misses full marks because of the couple of less funny episodes.","'Man to Man with Dean Learner' is fabulous continuation to 'Garth Marenghi's Darkplace' with its continuing universe of absurd and crude humor and continuity errors (on one moment Dean Learner lights a cigarette and in the next one he smokes a cigar). Dean Learner continues to surprise us with his own egocentric and disillusioned genius persona, like he himself single handedly created the (entertainment)world. At this point in the history Dean Learner's character comes across like distorted hybrid of Harvey Weinstein and Donald Trump.But the real treat of the series is the showcase of Matthew Holness's talents who portrays all the six quests in the show, including infamous Garth Marenghi. Those six different characters are very different, and they don't feel simply comedic routines, but comedic characters with real person in them. What I mean is, when you watch them, you don't see Matthew Holness doing absurd cross parodies of different artists, but you see an actual person like Merriman Weir, or Randolph Caer. In the comedic key of course. If you loved 'Darplace' there is very high chance that you will like 'Man to Man'.","A spin off comedy talk show from the creators of 'Garth Marenghi's Darkplace' The new series, Man to Man with Dean Learner, focuses on Garth's manager, publisher and publicity agent, as played by Richard Ayoade.Nightclub owner, restaurateur, publisher, international playboy - Dean Learner is a one-man brand. After his co-funded Channel 4 television hit Garth Marenghi's Darkplace he now invites you into his luxury penthouse flat for an all-new, entertaining and immensely stylish TV talk show.Man to Man with Dean Learner will feature all Dean's remaining celebrity friends, as well as plenty of live music and fine fish-dish cuisine in a show that reeks of class - but not fish!I attended two of the live recordings and it had me in stitches. There are distinct comparisons to Alan Partridge's 'Knowing me Knowing you' in the layout but Richard Ayoade and Matt Holness's unique writing style take it to another level.If your a fan of Darkplace then you can't miss it. Catch it when its aired late this summer","I am so disappointed. After waiting for 3 years for repeats/the DVD of the original masterpiece series \"Darkplace\" i couldn't wait for this series. The first episode just ended and I am appalled. Everything that was great about Darkplace has been erased here, pretty much. Worst introduction: canned laughter. this takes the original point of it away and just renders it nearly unwatchable. (one joke about Garth's eyes fertilizing the audience was good... the rest i can hardly remember...) it feels like a poor quality \"Knowing Me, Knowing You.\" I hope this improves as the series goes on, otherwise i shall be seriously disappointed. back to \"Darkplace...\"\"You are the most compassionate man I ever known. And i know God...\"","This is a very strange series with Dean Learner. I really didn't understand the guests. I knew they weren't serious but whether they were really them was unclear because...i guess i'm just that stupid. I don't know if this classes as a spoiler but the guests aren't real like in Ali g or anything they're played by one man or so i believe. I love the serious look that he's got going on. Its like that programme that was on on a Sunday morning that i forget the name of lol. I also really like the suit and moustache thing he has got going on. Its quite hot. He's insensitive which is one of the funniest qualities. I also like the way he has subsections of the programme. It makes it seem more authentic.","When I first saw the advert for this spoof chat show, I immediately recognised Richard Ayoade from The IT Crowd playing Dean Learner. Throughout the show Learner invited fake guests played by Matthew Holness (who played Garth Marenghi), Matt Berry (who played Sanchez), Kim Noble and Stuart Silver. It was mainly just humorous chat and the audience reaction, but there were clips of fake television shows and their fake career traits and trends focused on in episodes. It was not always the funniest comedy/spoof show I had ever seen, but it was Richard Ayoade as well as the unusual fake guests that made it quite an enjoyable original show. Good!"],"review-user":["b-davies912","metal_slugger-1","lerwick","SendiTolver","thom_ohz","thecrazymongoose","samrudland","jboothmillard"],"review-date":["30 April 2006","20 October 2006","27 November 2008","22 July 2018","8 June 2006","20 October 2006","3 November 2006","20 November 2006"],"review-rating":["9","9","8","9","3","7","6"],"review-title":[" Saw the Pilot\n"," Quality London-Based entertainment\n"," comedy gold\n"," Learn from Dean\n"," Spin off comedy talk show from the creators of 'Garth Marenghi's Darkplace'\n"," Episode 1\n"," Strange\n"," Man to Man with Dean Learner\n"]}