{"review-url":["http://www.imdb.com/title/tt0446320/reviews"],"review-text":["This documentary was my first introduction to Peak Oil theory. A fascinating concept that has a lot of frightening consequences if it turns out to be correct. I had absolutely no idea that the effects of oil depletion would come so soon, it literally took my breath away. This movie will probably open your eyes as to how strongly the American way of life is dependent on the \"abundance of cheap oil\" - a term used throughout the film. A lot of the topics are plain common sense, and they don't go into a huge amount of depth about any of them. But you've probably never put all the pieces together like this movie does. The interviews with the authors and energy experts are all very interesting. I don't think this film is meant to scare people. It's merely meant to inform people about what to expect in the years ahead, and maybe to encourage you to think twice about commuting 100miles to work and leaving your lights on all day long.After watching this film I was no longer able to look at the cars and buses zooming by quite the same. Great documentary, everyone should see it.","I always knew the day was coming. We all knew. There's only so much oil in the ground, and one day we'll run short. But isn't there supposed to be enough coal to use instead? And wind power, or something. Things for future generations to worry about.Then this documentary hit me smack between the eyes. Oil makes the fertilizer that is the reason for the first time in world history practically no one lives on farms. When the inevitable oil shortages hit, a lot of things -- air travel, many drugs, plastics, life in the suburbs -- will become impossible. But the craziest insight from the documentary is this: oil gives us so much energy with so little effort, that without it our lives must change. Even if substitutes and conservation are implemented immediately, at best they'll smooth our landing into a strange post-oil world which (the documentary claims) could be starting NOW.Despite its gloomy message, the documentary is often highly entertaining. It contains fabulous historical footage (sober images of dark urban factories, and campy funny stuff from the 1950's) which reminds us of why we moved to the suburbs in the first place. It also offers hope that a massive effort started now could both ease our transition from oil and make the world a better place.My only complaint about the documentary is that it does not spend time on the mystery of why we are finding this stuff out now. How can this be a big emergency all of a sudden? We knew in the 1970s we should be preparing for a post-oil world -- and we started to prepare with alternative energy research and smaller cars. If our failure to follow through on President Jimmy Carter's initiatives 25 years ago has doomed us to a hard landing in a post-oil world, why was no one shouting about it on soapboxes?In the end I found the documentary highly persuasive; and it left me with the terrible chill of being dragged out of a very lovely dream. This is must viewing for everyone not afraid to face a very likely near future that we still have time to do something about.Charles","I have the good common logical sense to know that oil cannot last forever and I am acutely aware of how much of my life in the suburbs revolves around petrochemical products. I've been an avid consumer of new technology and I keep running out of space on powerboards - so I know that even the energy crunch associated with Peak Oil will change my life appreciably.The End Of Suburbia shows, in a rational and entertaining manner, just how much my whole family's lifestyle will have to change in my lifetime. I am particularly concerned for the future generations who will have to pick up the tab for our excesses, however the film-makers do offer a glimmer of hope in that they acknowledge human resourcefulness and determination - and the sense of community that tends to be engendered by shared hardship.There is no point in trying to pretend that Peak Oil is baseless propaganda - or in treating it like the approaching radioactive cloud in \"On The Beach\" (i.e. with suicide pills at the ready). Even with our best efforts, times will get harder all over, and I'm hoping there's enough compassion and humanity to go around.","The End of Suburbia neatly collects many of the concerns with the coming \"Peak\" of the world's oil supply. As the world population grows, so does demand for oil and power. As we extract oil and power, we come to a \"peak\" in production. More oil is demanded, less oil is generated. The inevitable outcome is conflict, and major change. This film will be disturbing, and alarming if you're new to the topic. You may react at first with anger and denial because the implications are so grim. It should be required viewing. Beyond politics, beyond optimism, the math is undeniable. Suburbia is the focus, because our suburban living areas will be the communities most impacted when the price of energy skyrockets. While intuitive logic would tell you that the big cities will be the places to avoid during a time of crisis, the spread out nature of suburbia will make it difficult if not impossible to maintain an efficient community without our vehicles to transport us. Peak oil is no longer a topic for discussion by survivalists and backwoods crazies. This issue will be at our doorstep sooner than we think. This film is a lucid, coherent look at it.","I own a Video store with hundreds of documentaries. I have seen loads of them and love all of the great info out there. Only a small handful though even come close to offering info as important as this one. I have been reading through other peoples reviews of this film and can't help but notice that the main things people are criticizing are irrelevant. Such as \"It is very one sided\" Such a pathetic criticism, every where in society that you look you will see the other side, and if you still need help go to globalpublicmedia.com. \"It is the same people over and over\" Uh one might be led to believe that these people are the experts, so maybe they are the best people to interview. \"filming style is all the same, head shots with few exceptions\" If you want flash and dazzle watch Micheal Moore if you want info watch real docs such as this one. As you can plainly see none of these complaints have any relevance to the information contained. My guess is that these people are just missing the point and don't wanna give up there SUV's.My recommendation: Watch it. Learn from it, and continue your education about such subjects. It is very important stuff for EVERYONE.","A truly scary film. Happening across curmudgeon James Kunstler's rants led me to recently-formed web logs like Life After the Oil Crash (LATOC), Energy Bulletin, and The Oil Drum, and the data behind the theory of Hubbert's Peak. Like this film, LATOC and Kunstler paint a grim picture of die-off or die-back. I hope they're premature, but in mid-2005 rising gasoline prices, rising oil prices, Chevron's Will You Join Us campaign, BP becoming Beyond Petroleum and even T Boone Pickens lend credence to the idea that we are at or near a peak of oil production.After copious research of limited data, oil investment banker Matt Simmons has suggested that the Saudis may no longer be able to increase production in their immense, but aging fields. In the face of increased demand (primarily from the US and China), the Saudis have not responded with higher production, despite previous assurances. Stated world production from 2000 and 2004 indicates that light, sweet crude has indeed peaked. which means that refining will become more costly.The film seems aimed at baby boomers, but younger people, our children, also need to understand the implications of an energy-depleted future.","A friend of mine works at an engineering company and has shown this to her office. She also holds a masters degree in energy efficient buildings (!).This documentary focuses on energy issues, but there is so much more to counteracting suburbia (anti-social issues, global warming, etc).I've read some negative reviews out there claiming there is a \"junk science\" to this documentary, but these reviewers do not provide any of their own \"science\" to back up their claims. Where is their documentary, \"The Bottomless Well\"? It's just as Kunstler says in the interviews - people will be very resistant to the idea suburbia will end. People tend to get hostile when their whole lifestyle has been put into question, and The End of Suburbia does that with efficiency and style.Intead of changing lifestyles, many suburb dwellers will simply force the status-quo, and become very hostile to those like EOS blowing the whistle. Sad.","Strengths: Good job of showing suburban bloat and complacent lifestyles that go with it. The half dozen talking heads seem bright and believable, not eccentric. Covers the myth of hydrogen and bio-fuels as energy \"sources\" (they are primarily carriers and not self-sustaining). Offers good commentary on mass-media denial of the pending oil peak, plus how suburbs might be transformed in the future.Weaknesses: Could have gone into more detail about petroleum geology to educate the public. People are still left with a vague idea of where oil comes from and exactly why it will peak soon. No mention of the critical overpopulation factor in the creation of suburbs and how continued growth will make it even harder to meet future demands. In fact, I think that's half the problem we face.Conclusion: I would have liked this a little better if it was done more along the lines of \"NOVA\" or other science programs, but I thought it was well presented. It does leave unanswered questions that can be filled with denial, and there's plenty of that when it comes to public perceptions of oil.Technical: The DVD quality is spotty, with block compression artifacts and something that looks like a burn hole in the same location on some older footage.","The End of Suburbia, as it should appeal to general citizens & mass consumers alike, is likely to become of cultural reform status. The film uses super-cynical analysis by authors, policy makers, and social philosophers on the paradox created by Suburban-Style living--mainly in the Post-War era.What we have created in America is a place with \"none of the amenities of country life, and none of the amenities of urban city life.\" This is the prescription that is laid out for suburbia, and the film focus's on the singular idea of \"Oil\". Basically, in the most general sense, that the world is nearing or at it's peak oil production, and when we realize this in full, major lifestyle changes will be in effect, whether by our best interest or forced violently upon us by a quality of living even the slum-dwellers of Calcutta couldn't describe to us.If nothing more, the end of Suburbia will siphon the viewer flush in their gut, creating a sickening feeling. This is bound to happen. It's a bleak outlook on our inherent way of life. The ambivalence lies particularly in each respective viewers critical analysis of the film. I foresee many unprepared viewers slandering the film as smug liberal propaganda--like a Michale Moore film. What they fail to consider is that a reaction like this is all too normal when such a message hits so unbelievably hard to the lifestyle of the vast majority of the masses.This is the truth, and as a student studying City Planning, I can tell you that we better get prepared now, because what slim chance we have of maintaining quality of life in this dwindling cesspool of tampered resources is fading faster than a race of people stricken by the black plague.","The End Of Suburbia (TEOS) is a very useful film. It's also important and provocative. There seems to be no middle ground with either the film or its main source of entertainment, the anti-sprawl Meister, James Howard Kunstler. While I am not a big fan of the New Urbanism, my criticism of it is because of its small vision. In the case of New Urbanist Peter Calthorpe - another talking head - you finally hear what's somewhat obvious in and amongst the special added TEOS out-takes... Calthorpe just doesn't understand peak oil. I've used this as a teaching tool in economics classes to get at the importance of land as a factor of production - a fact long diminished by Neoclassical Economics - and also as a vehicle for educating about: peak oil, our wastrel land use, global warming, our threatened food production, public transit our compromised futureMove over South Park! .... Made by Canadians from Toronto for $25,000 and released in May 2004, this video sold over 24,000 copies by October 2005. One major DVD rental vendor recently ordered almost 400 more copies.The End Of Suburbia sales were actually climbing 1 1/2 years after its release and it has also been available on one of the major online video services since September 2005.A sequel, Escape From Suburbia, is in the works with a possible release by August 2006.","The End of Suburbia is an important documentary about modern dependence on cheap energy and the coming peak in world oil production. The film is an excellent introduction to the peak oil phenomenon, and includes interviews with experts like adviser to Vice President Dick Cheney's 2001 Energy Task Force. Mathew Simmons, author Richard Heinberg, \"Powerdown - Options and Actions for a Post-Carbon World\" and author Michael T. Klare, \"Blood and Oil - The Dangers and Consequences of America's Growing Dependency on Imported Petroleum.\"Economic growth is predicated upon more electricity. Electricity is predicated on hydro-carbon energy. Period. And Mathew Simmons made a very clear statement, he said: \"Future growth is not possible\". And for a guy from his background to say that was one of the most.. that's like the catholic church saying the earth is round before Galileo\" - Michael C. Ruppert \"The peak has happened. And now, instead of being prophets, we're now historians.\" - Kenneth Deffeyes","I was recommended this movie by my professor in an Intro to Urbanism class at a Canadian university. I was expecting a fair and balanced analysis of why suburbia is going to end, voiced by professional planners, theorists, and scholars. What I got was a bunch of anti-oil, doom-saying, fear-mongering talking heads who, as far as I could tell, had no association with any universities, government organizations, or think-tanks. The most professional speaker involved was a consultant for the oil companies. Each person featured in the film either had a book to sell on the subject of anti-oil or otherwise had an interest in the field.That said, I find this film more in line of those by Michael Moore and less of actual documentaries. Fair and balanced this was not. Now I do enjoy Moore's films, but calling them \"American History\" is a bit out of line, the same way this film stretched it's educational worth. The amount of fear-mongering and doom-saying involved was enough to seriously anger me at the film. I was severely upset at how low these pundits stooped to get an emotional reaction.And they barely made you feel any better about the future. Between a depression we will never escape to visions of a oil-depleted Holocaust they really didn't give the viewer any hope about the alternatives. Personally I feel that rising oil prices will make environmentally progressive energy sources look more appealing to the energy companies, which is a very good thing. Needless to say this film didn't affirm my positive views of the future.So, if you want an emotionally charged, propaganda-esq film filled with \"holier than thou\" individuals who probably also believe JFK was killed by aliens, this may be for you. But if you want a serious, educational film about the how's and why's of suburbia's eventual decline, stay away. Needless to say this film pushed my buttons, and not in the ways I wanted.","This documentary consists primarily of interviews of the same few people discussing the impending \"peak oil crisis\". Its viewpoint is a very one-sided gloom and doom perspective about the great changes that will be required in our lifestyles as oil production peaks and costs escalate. However, it suffers from a limited number of viewpoints, including some interviewees that seem too over-the-top to be credible. Also, it became tedious with the endless interviews of the same few people.One point where it did break with the standard head-shot interview format was when it should a conference on energy depletion that took place in San Francisco. However, again, it was the same people presenting at the conference. And furthermore, the shots of the audience showed that it did not attract a business audience, but instead was filled with what looked like casually dressed locals. Obviously, the message here is just going out to the choir, and hasn't resonated with the general public.The outtakes section contains some interesting 50s era promo pieces that are some of the better features of the movie.","In addition to consumption of very limited resource, there are other factors: pollution, eating species into extinction and massacre of environment happens on global scale: sacred and very needed by life on Earth trees are being massacred by human predator. Gold mining, illegal tree cutting, illegal ranching in Amazon already destroyed a lot of sacred trees. Films: \"AMAZON with Bruce Perry\", \"The End of the Line (2009)\". Most vicious predator (human) must learn to stop destroying its own environment. Nature and animals disappear at exponential (unbounded) rates while most vicious predator (human) multiplies exponentially (without bounds). Most vicious predator must stop unbounded (exponential) reproduction: it leaves no space for healthy environment for most vicious predator and leaves no space for animals. CONSUMPTION is not \"cool\" anymore, no matter what it is: consumption of oil, food, or of any other very limited remaining resources.","I have been most fortunate this year to have seen several films at my university's art museum. On occasion, well, more like half of the time, I am unable to watch the films there. I have systematically attempted to view each of the films that I have missed. So far Plagues and Pleasures on the Salton Sea and Who Killed the Electric Car? are the other films that I have had to watch this way. The film covers an intriguing subject matter and is well-theorized (emphasis on this later) but not as successful as Plagues and Pleasures, but far superior to Electric Car. The film's thesis concern's the future of the American concept of suburban living. It questions the feasibility of such a practice as oil prices rise. So, the film discusses the origin of the suburb, and it's evolution until the early 2000s. One theme the film discusses at length is the alienation the suburb creates among its inhabitants. While several people may live together, they do not \"know\" each other as we define the word. This, to me, represents the strength of the film: its appeal to actual human emotion. We are able to understand the filmmakers' argument so much easier because they do not have to convince us of their argument's legitimacy. This is also one of the reasons Salton Sea is such a wonderful documentary. Unfortunately, Suburbia loses its message in firebrand explanation in support of its central argument. As those interviewed speak, their arguments become progressively more akin to those made by militant environmentalists. We are told that oil production will hit its peak in this decade, but are given no scientific evidence (professional reports, statistics, graphs, etc) in support of this claim. We are given little information as to how this date was calculated. Fortunately, this was the only significant flaw that I was able to detect in the film's argument yet it's a glaring one nevertheless. Another less-important discrepancy I noticed was the liberal (political) bias which could polarize some viewers. However, this bias is revealed thorough clips of various events and not the filmmakers themselves. The clips, especially those from the 1950's, seemed a tad unnecessary to me. The film was no better with their presence, and would have been more concise in their absence. As I thought more of this film before composing this review, I thought about why I found its argument more convincing than other documentaries that I'd recently viewed. Finally, I realized that the filmmakers actually offered analysis to the suburban problem. They propose a decentralized village-system where pockets of people would live together. They posit this practice would lower the necessity for fossil fuels and reduce wasted space. They define wasted space as the long stretches of parking lots between shopping areas, for instance. What is incredible about this supposition is that it's actually conceivable. Most documentaries vaguely state that some problem should be ended but offer no method of doing so. Thinking more about the film, I decided that this analysis is what saved the film for me and why I give it a favorable review. While neither perfectly convincing nor fluid in presentation, The End of Suburbia is a worthwhile investment of one's time. It not only addresses the contemporary problem of sprawl, but it also provides realistic insight on how to amend it. The audience can also enjoy the high production value with various clips from the 1950's spliced with the modern arguers. People living in Atlanta, Georgia or the Triad region of North Carolina will particularly enjoy this documentary as sprawl is the most established there.","I'm giving this film 9 out of 10 only because there aren't enough specific scientific references to the amount of energy it takes to produce food to satisfy the science haters. mdixon seems to believe the admittedly biased commentators are making this stuff up, but even an elementary understanding of resources and the laws of thermodynamics will indicate that at the very least, they are on solid scientific ground when they state that we cannot continue to depend on oil, we must transition to different types of energy, and do not have a plan that will replace the amount of energy we get from oil. Other civilizations have refused to face the facts of life, and have perished. Read Jared Diamond's \"Collapse\" which is a popular book, or any elementary Ecology or Earth Science textbook and you can verify the basic premise of this movie. Go ahead, fiddle while Rome burns!","A good documentary reviewing the background behind our societies oil addiction, the problem concerning our present energy usage and finally discusses the effects of the coming energy deficit originating from the peak oil production problem.This movie should be educated to all students as part of their education. Show it to your children, parents, relatives and friends. They will thank you eventually.After reviewing the contents of this documentary and comparing its mentioned sources I would say that the facts in this movie are well scientifically supported.","The topics presented are very interesting; suburban culture, suburban sprawl, public transportation, oil & gas depletion, energy dependence, alternative energy sources, etc.The problem is that this is a pure and shameless propaganda piece. One viewpoint is presented, then hammered upon the viewer over and over. You see the same handful of 'experts' repeatedly making their case. The supposed 'narrator' starts off sounding like a news reporter, but by the end even he is preaching the film's dogma.The dark side of the film is not so much the gloom and doom message about oil depletion, but the sense that the folks in the film are actually wishful for a post-oil society and all that it entails. They paint this picture of a utopian society where we all return to the self-contained local village model; walk to work, shop locally, grow our own food, and generally live an idyllic 19th century lifestyle. For them, the post-oil society would seem a grand vision of a better world. It would certainly spell the end of globalization, and better still, the end of Walmart. I will give them some credit for applying actual math in exposing the weaknesses of several over-touted alternative energy sources, including ethanol and hydrogen.I gave it 3 stars because I appreciated the old footage and the premise.","My review covered the documentary 'The End of Suburbia'. This documentary is about the end of the modern suburbs thanks to the end of cheap oil. It covers many different aspects of this topic. These topics are layout for the viewer to understand the issues. I want to begin the review with an analysis of quality of the film. The first topic is the about how suburbs come about. Then the next subject is the unfortunate fact about oil. Finally, the documentary talks about 'New Urbanism' as a way help ease the issue. I found the documentary to be very interesting.I think the film is well produced and setup. It is highly organized with a chronological movement. The video does features abstract shots of television and particular the news with the interviewees talking over it. Various music tracks are used in the film. The music is used to make light of certain situation and a creepy soundtrack is used to express the direness of peak oil. The film is well shot in the best way a 'Talking Head' documentary can possible be. It features many interviews with several important people in the peak oil field. This includes Matthew Simmons, Richard Heinberg, Michael Ruppert, and James Howard Kunstler. Their interviews are cut throughout the documentary. They seem very 'Dooms Day' oriented. All of their predictions are apocalyptic in nature and I can clearly see their negative ideology. The film kept my interest with its content and pace.The first topic is the about how the suburbs come about. According to the documentary suburbs came about because the city had a low quality of life and technology gave people a way out. First it was the train, then the street car, and followed by the automobile. The automobile has helped to bring about the suburban dream. The government and the auto companies worked to together to help make the car the new form of mass transit. Then the next subject is the unfortunate fact about oil. The way we built the suburbs are entirely depend on cheap oil. Cheap oil is the blood in the veins of America. The movie provided several fun facts about oil like when oil was first discovered in Texas it was cheaper than drinking water. The unfortunate reality is that oil peaked in the 1970s and this was predicted by the geologist Dr. M. King Hubbert. He saw it coming and people ridiculed him. They said his predictions were a joke because that year oil production was at its highest. The people who doubted Hubbert's prediction were in the year of peak oil. This peak oil stuff is very scary and really sent shock waves down my spine. Finally, the documentary talks about 'New Urbanism' as a way to help ease the issue of peak oil. The 'New Urbanism' is a movement that started in the 80s and seeks to create more walkable cities setups. The ideas want to bring back the old style of planning, which the great American cities were built upon. The demand is actually higher for these areas. The documentary talks about a new development called Stapleton, which was developed along the lines of 'New Urbanism' and it sells at about 25% higher. People want a more walkable and neighborly place to live. I really liked how the documentary expressed the concept of 'New Urbanism'.","In The End of Suburbia, experts including Barrie Zwicker, James Howard Kunstler, and Richard Heinberg discuss the explosion of suburbia, how it relates to the global peak of oil extraction, and what the future may hold for this way of life. With the turn of the 21st century critical reflection and questions have surfaced about the sustainability of this iconic American life style. We know for sure now that Earth has met its oil peak and the decline of fossil fuels is here. This means that global demand for fossil fuels is now exceeding supply and there is no other way of life that uses more oil than suburbia. This film illustrates the history and narrative of suburbia, the marketing of the \"American Dream\" post WWII and the sprawling suburbs that followed. With the extreme dependence our society has built on oil, the instability of suburban life is now obvious and the effects of inaction in the face of this catastrophe are huge, not only for suburban residents, but for American and the world as a whole. They present their arguments throughout the film alongside historical footage and through a series of interviews with experts raging in fields from authors and scientists to historians and urban planners. I found this method to be fairly effective, although it would also have been interesting to hear perspectives from \"everyday people\" as well. The questions we're left with are \"how will the populations of suburbia react to the collapse of their dream? Are today's suburbs destined to become the slums of tomorrow?\"1 The voices and researchers articulately address these questions and more in The End of Suburbia. This film opens with one of its main arguments; suburbia is a failed experiment that has put a huge strain on the world's resources, especially fossil fuels. James Howard Kunstler, author of The Geography of Nowhere: The rise and Decline of America's Man Made Landscape, states that the whole suburban project can be summarized very succinctly as \"The greatest misallocation of resources in the history of the world. America took all of its post war wealth and invested it in a living arrangement that has no future\"1. One can safely conclude that suburbia and all its promises plaid a heavy hand in constructing the \"American dream\" of independence, family, freedom, peace, and prosperity. Experts in this film concluded that this dream was in large part constructed as a reaction to city life, specifically life in the industrial city. Early on in the 19th century these cities became \"a pretty horrible\" place\" as stated by Kunstler1. Horrible things came out of the cities, like pollution, high infant mortality, over crowding, hunger, crime, etc. This impacted cities because during this time city communities were almost often gutted through processes like urban renewal. Planners believed that in order to compete with the allure of suburban life they needed to build housing and buildings with more space in the city, so they decided to tear them down and rebuild. Meanwhile there was a huge demand for suburban housing; millions of house built across the US in the suburbs every year1. Houses were close together and had none of the real amenities of country living (such as nature and farmland) neither did they have the amenities of city living (such as convenient businesses, services, and public transit). In fact it had the disadvantages of both – inconvenience and traffic congestion. This brings us to another large problem discussed in the film, the dependence on cars and oil. And because of this oil abundance cars became the main way America could profit from oil. As we entered the 21st century and met peak oil production we see serious issues emerging that this film attempts to address. With the suburbs being a living arrangement reliant on oil, critics and researchers are now speculating that suburbs could become the \"slums of the future\"1. Though that is only one of many compelling theories. Another central argument discussed in The End of Suburbia is how suburbia can meet the challenges of living with less oil. Several experts in the film examined a prevailing idea on how we could address these challenges through a movement called New Urbanism. One big thing I believe this film is overlooked is the potential behind renewable and alternative energy. This film was released in 2004 and they seemed to be very skeptical about the possibility of cars that ran on alternative energy – I wonder what they would say now with the popularity and success of hybrid and electric cars like Tesla and SmartCar. Although I believe the film is missing a large aspect within planning and sustainability – in regards to how renewable energy could transform suburbia and America society – they conveyed a great deal of information on possibilities for the future and I believe they were correct with their implication that; a successful outcome for we humans in the imminent oil-poor era will emerge through thinking and planning on the scale of small communities. The End of Suburbia applies a wide variety of experts and data on the topics of oil and American development to shed a bright light on the facts, while it's analysis on the issues create a convincing portrait of what the future could bring. It utilized historical footage in order to efficiently portray the history of suburbia accurately, artistically, and sometimes even humorously. It is a strong film that outlines the variety of issues that have threatened suburbia and a uniquely American way of life. Works Cited 1. THE END OF SUBURBIA. 2. Aleklett, Kjell. \"Study of Peak Oil and Gas.\" ASPO International | The Association for the Study of Peak Oil and Gas. 3. Dittmar, Hank. \"Canons of Sustainable Architecture and Urbanism.\" The Charter of the New Urbanism","In Gregory Greene's \"The End of Suburbia: Oil Depletion and the Collapse of the American Dream\", James Howard Kunstler, Peter Calthorpe, and many others enter into the conversation about the impending \"plateau\" of fossil fuel extraction. This documentary recognizes and validates the existence and imminence of oil depletion. Through the testimony of many experts, Greene's movie defines oil depletion, investigates its causes, and develops arguments about its implications for the future. Mainly, the documentary asserts that oil depletion will completely end the suburban lifestyle as we know it. Throughout, it tries to disprove any solution to maintaining a suburban way of life. Consequently, the points of the film become diluted with futility and are blind to more imaginative solutions. The film turns down all hopes of saving suburban life. The people in the film are rightfully concerned however. The IPCC today has provided the world with more than ample empirical evidence supporting and proving the imminence of oil depletion (IPCC). If someone believes it is not an issue, they can be immediately and wholly dismissed on multiple scientific levels. And so in this regard, the documentary is sound. Then the film goes on to discuss the causes of the issue, and it more narrowly defines the issue. The combination of cheap fossil fuels along with the cheap production of the Model T on the assembly line during the industrial revolution of the United States created an entire country based off of the assumption that car travel would always be easy, cheap, and convenient. Now that it is not – or becoming less so – problems emerge. Here is when the documentary begins to lose credibility in the conversation. Although it defines that causes of the problems, it fails to actually define what the real problem is. From watching it, I got the sense that they believe that problem is oil depletion. From the title, I expected to see the problem as being unable to save the suburban way of life. However, the speakers in the film want neither to have more oil nor keep suburbia alive and well. In fact, what the many speakers in the film never do is define what they do want. No wonder the film is so incredibly depressing when it comes to looking at the future; it has no cohesive vision of what a good future would look like. The brief parts where it does talk about a better future, it never realizes ways to make it happen. And these problems in the film are just in the problem definition.When it comes to looking at the future, this film is incredibly negative. It claims there is no possible way to sustain even a comparable level of consumerism to what we have today as oil depletion becomes reality. However, this is not necessarily true. Many of the criticisms of this film say that it is too quick to dismiss alternative energy sources. The speakers in the film say we must cease to consume, but I say, \"consume on!\" Can the US ever be told to cease its levels of consumption? There are two factors that exist today that will forever characterize the future of American development: alternative energy and \"new urbanism.\" In his interview, James Howard Kunstler claims that there will never be powerful enough alternative energy sources to compete with fossil fuels. But that was in 2004 when the movie was made, and today there are solar powered cars, off the grid commercial buildings, and exponentially more innovative alternative energy sources. To say the argument in the film is dated is an understatement, not to mention the average age of the people interviewed in the film must be somewhere around 65. It lacks diversity of imagination. It lacks perspective. Most of all it lacks the level of idealism needed to effectively create change in the world. Until today, development has been made for cars. Robert Moses tore apart cities for expressways. Today he is demonized as one of the worst planners to ever exact their \"efficiency plans\" on a city. So the world is changing, but the stringent views of the people in the film are not. I would like to say that, if the people in this video were educated about today's energy possibilities and the ideas behind new urbanism, that they may expand their arguments. However, if Kunstler is anything to go by, this is not the case. Today he actively writes on economic and environmental issues like the ones touched on in this film on his website Kunstler.com, however he still writes with an irrational alarmist voice, utilizing several exclamation points and figurative language. For every fact he cites, he draws a handful of loosely based conclusions that support an argument he obviously already had in mind before he retrieved the fact. And sadly the entire film speaks with a similar voice. The film pulls out a fact, spouts off a few things about it, and then goes on a path that is only tied enough to the fact to develop a façade of credibility. Essentially this documentary is the result of what happens too often to people who do not value the discipline of academic discourse. Instead of gathering facts, investigating a subject, and then drawing conclusions, this film obviously had all of its conclusions on mind and felt only the need to establish them loosely on fact and propagate the rest of them with alarmism and absolutist claims. If you want to watch a documentary about what oil depletion is doing to the American way of life, keep looking. The End of Suburbia: Oil Depletion and the Collapse of the American Dream. Dir. George Greene. Prod. Barry Silverthorn. The Electric Wallpaper Co., 2004. Film. Fifth Assessment Report. Intergovernmental Panel on Climate Change. 2013. Web.","In The End of Suburbia: Oil Depletion and the Collapse of the American Dream, Director Gregory Greene, addresses the issues that the world more specifically suburbs, is going to face when oil peaks. Greene is educating his audience on what to expect when the production of oil peaks. The meaning of oil peaking comes from M. King Hubbert's theory, in which the production of oil reaches its maximum and starts to decline, which causes the price of oil to increase. Greene presents the issues humanity will face when oil production starts to decline, with many authors and experts explaining the situation. These experts explain we can no longer ignore this gigantic issue.The End of Suburbia opens up with the history on the development on the suburbs we have today. In the late 1800s, society no longer wished to live in the city, due to pollution, factories, and noise. The upper middle class, moved into the suburbs seeking to live in peace, away from the city. The suburbs started off as a single home on a large estate isolated from everyone. However, after WWII soldiers were given homes in the suburbs as gifts for their services to our country and thus began the development of the suburbs we have today.The suburbs started to grow and grow due to the fact that people were now able to buy and own their own homes. As the suburbs grew, the issue of transportation grew because people needed to get around. People could no longer walk to places, so society turned to automobiles. The reason automobiles was such an easier solution over railroads and buses, was due to the fact that suburbs were large and people were spread out making railroads and buses inefficient. People started to depend more and more on cars to get around and it wasn't an issue at the time because gas was very inexpensive. If oil wasn't cheap suburbs wouldn't have existed.As suburbs continued to grow so did the demand on oil and natural gasses. In the suburbs, people rely on oil to get around and on natural gasses to provide heat and many other things. As the demand on oil grew because the growth of suburbs, the amount of oil is now running out. Julian Darley an expert provided by Greene explains how oil is obtained. He explains that there are two layers of oil; the first (top layer) is easily obtained, while the second is very difficult and expensive to get. Once the first layer is gone no matter how much effort you put in you cannot get same rate of production as before, in other words the production of oil is peaked.M. King Hubbert, a very famous expert on this issue and a worker for shell, he conducted a speech on this issue in the mid-late 20th century. He calculated by 1970, we would peak and oil production would start to decline. At first, although he was much respected, nobody took his theory and calculations serious. Until in 1970, when they found out his theory proved to be true, that oil production would peak and start to decline. M. King Hubbert's theory also calculated that the world's oil production would peak in the mid-1990s. M. King Hubbert's theory would have been correct about that as well, if not had been for the prices of oil shooting up in 1970 due to the scare of oil peaking. Today experts are calculating that the world's oil production will peak 10-15 after M. King Hubbert's original production.As time passes we now expect to live this same lifestyle forever, we are not ready to move backwards. We expect that oil and natural gas will always be there to fuel our cars and heat our homes but to believe that is unrealistic. Suburbs use tons oil and natural gas that it is suggested it was the reason behind the power outage in 2003. From 4-6pm that is when the most energy is being used, commercially, industrial, and private homes are all using energy at this time. On August 13, 2003, roughly a little past 4pm, the blackout occurred leaving millions without power. Although, it was officially said to have been caused by faulty transmission lines; experts like Matthew Simmons think there is a deeper story. He believes the reason 57million people went through a blackout wasn't because faulty lines but because the natural gas everyone was using reached its limit.With the demand of oil being so high in order to maintain the lifestyle we live today, what happens after the production of oil peaks? Experts and authors such as Michal Ruppert, James Howard and Steve Andrew discuss what the outcome will be. When oil production peaks, suburbs will soon come to end, due to the fact it cannot function without affordable and reliable fuel. The prices of food will increase, because the price of oil to fuel the machine will shoot up. Another gigantic issue we will face is war; people will fight over control of the last oil refineries. People all throughout our nation do not know this issue is alive due to the media not covering these issues. The reason behind the media keeping quiet on this entire issue is because oil peaking is bad for business. We as a society must face these facts and prepare for the future. There is no alternative fuel or substance to keep up with the way we are living today. We must change, we have to become aware of this issue and educate others on this matter. We must design smaller towns in order to walk to places instead of drive. We can no longer ignore the issue of oil production peaking and start preparing for the issues we are going to have to face.","Well someone who enjoys traveling down the highway at 120kmph, eating McDonalds, and running the air conditioner twenty four seven, and watching Fox News non-stop, I found this documentary interesting. One thing I picked up, when they being they talk about North America, I assume this documentary was Fabrique Au Canadie. For the Canadian bashing I will leave that to Bill O'Reilly.The consequence of the depletion of oil will affect everyone, especially those who live in big countries of Australia, Canada and the United States. I am sure that Green Peace are cheering no more gas, means no more SUVs, without realizing people who live in the sub zero temperatures could starve to death. As someone who has studied economics, I know for a fact we are living in a world of finite resources. I will give the documentary props for trying to present a balanced point of view about the depletion of oil. However I am studying a degree in journalism, this documentary is full of loaded messages - Republican as warmongers. What the Democrats didn't send troops to Vietnam? If you are going to present a documentary about economics and resources, it is best to leave the political bashing to one side, because it could cause a potential audience member to totally shut down. Concentrate on the issue of finite resources. At the end of the day, it is best to open the minds of the mainstream, as it is no good preaching to the minuscule choir. I really do enjoy watching documentaries such as Fahrenheit 911, and End of Suburbia not for their political bias, because they do remind us the world isn't so safe. Sure I like to shop, and consumer junk food like there is no tomorrow, but if the world is going to end tomorrow I would rather die rich and consume the living beep out of it. For the potential documentary makers out there, just give the people facts, and let the viewers make up their own minds. If you are trying package your political views as a balanced documentary the people are going to smell a rat a mile away.","A modern scare film? Yep it is..The hippies, peaceniks and environmentalists got together to deliver us a fear film.. I didn't recognize it when watching it only 2 years ago that it was a fear film but that's exactly what it is..There's no difference between this film and films the nazi made about us in ww2 and the same films we made about them.. this is pure propaganda and speaks only to those.. that believe in aliens, 9/11 conspiracy plots, faked moon landings, peak oil and major environmentalism What I can say is this film does push buttons, make you ask questions and ultimately just forget about it.. It's a scare film.. so if your scarred get in your houses, lock your doors and stock up for that nuclear winter we all know is coming when bush provokes the Chinese into nuclear war..","Doesn't anyone bother to check where this kind of sludge comes from before blathering on about its supposed revelations? Ask yourself a question: Is my skull an open bucket that I allow anyone to dump their propaganda into? Do yourself a favor and take a look at the bomb-shelter mentality of pathtofreedom.com before you waste your time with this screed.These sorts of Mother Earth/People's Republic of Berkeley urbanite fruitcakes that openly despise a way of life only because it doesn't match theirs must believe their case fails miserably on facts and objectivity. Else why resort to willful distortion and blatant one-sidedness? Pathetic.Don't be a sap. Take two seconds and cast a skeptical eye before falling for yet more 'end of the world' hysteria from it-takes-a-village types with a political agenda that's probably even to the left of your own. Mi. Moore (rather his unthinking followers) have really opened the floodgates with this kind of one-sided political trash passed off as a *cough* documentary. But apparently they understand the sentiment of an ever-gullible public: \"If it's on a movie screen, it must be true.\" God gave you a brain - act like you know what you're supposed to do with it..."],"review-user":["falser","Tilyou1","jvframe","simon-carr","leo_bartels","dlfagan","wirving345","A.N.","G_Mac85","HGSPhila-1","Nordlyd","c_huggard01","jeremy-47","youAreCrazyDude","doctorsmoothlove","iskylark-1","adocious","coreysguard-imdb","danbenyamin19","alexissmyser","dominic951","juderules_95","rohan_g","theemaster","mdixon"],"review-date":["23 February 2005","9 April 2005","18 June 2005","28 April 2005","8 February 2007","25 June 2005","7 August 2005","6 April 2005","10 May 2005","8 December 2005","30 November 2005","11 October 2005","9 March 2005","4 March 2011","12 April 2008","21 April 2006","30 March 2006","29 March 2005","30 October 2014","29 October 2014","28 October 2014","18 March 2014","25 November 2005","2 April 2005","20 March 2005"],"review-rating":["9","10","10","8","10","8","9","9","10","9","5","5","10","7","9","10","3","8","7","4","8","7","3","1"],"review-title":[" A real eye-opener for SUV-loving America\n"," Fun, campy historical clips, but in the end like waking out of a dream into horror\n"," the truth in a not so bitter pill\n"," A great introduction to Peak Oil and the coming oil shortage\n"," 1st place award for most useful information\n"," Stating the problem\n"," The beginning of the end\n"," Effectively done but lacking in some specifics\n"," We're Living in the Bubble of a Consensus Trance!!!\n"," The End Of Suburbia\n"," An excellent introduction to peak oil\n"," If you want a scholarly discussion, stay away.\n"," Preaching to the choir\n"," Exponential (unbounded) propagation of human vs. exponential disappearance of nature and animals\n"," An effective proposal.\n"," the laws of energy apply - learn something before you dismiss\n"," Insightful, frightening and eye-opening\n"," Wishful Thinking?\n"," Upp 101\n"," strong film that outlines the variety of issues that have threatened suburbia and a uniquely American way of life\n"," Outdated and Biased\n"," End of Suburbia\n"," Interesting\n"," A re-review..\n"," 8.9/10??? As the prophet P.T. Barnum said...\n"]}