{"review-url":["http://www.imdb.com/title/tt0437856/reviews"],"review-text":["I just watched this movie on it's premier night out of curiosity and sheer nostalgia. I liked (not loved) \"Mork & Mindy\" as a kid, mostly for Robin William's zany energetic performance. This movie made me remember why. Was the original show great? Not really, but Robin certainly was. Which brings me to this movie.I was pleasantly surprised, expecting nothing more than a paint by numbers chronological retelling of the show (which in a way it was). But, of course, the real focus was on Robin. It was interesting to see Robin's journey from struggling street jester to national t.v star, and how such a drastic difference affected him and his long suffering wife. And my hat is off to star Chris Diamantopoulos as he portrayed Mr. Williams with integrity, sensitivity, and heart; not just a cute impression, although it was even dead-on. (On an unrelated note, I noticed that Robin's struggles were in some ways similar to Andy Kaufman, who was under-appreciated by network t.v. and held back creatively, but that's the \"Taxi\" behind the scenes biopic.)All in all, this was a very enjoyable flick, in which I felt I got to know a little more of the man behind the Orkan. The acting was solid by all- never melodramatic like I suspected- and the story moved along well. Performances that were particularly good were by those who played Garry Marshall and John Belushi (the scene in which Belushi heckles Robin was a hoot!). Not a great masterpiece by any means (I would have liked to have seen a tad more about Pam Dawber), but definitely watchable, especially for those Robin Williams and \"Mork & Mindy\" fans out there. Nanoo, nanoo!","I don't now know where this kid came from who played Robin Williams but he was channeling. It was astounding at times. The writing was as good as it could get for someone trying to capture Robin's crazy improv in a script. And I gotta tell you, it made me cry. I really felt empathy with Robin and Valerie. When Robin walked away from his crippling vice and into the best years of his marriage and fatherhood and a mostly sparkling movie career, I was moved to tears.Sometimes, these insider TV movies can be terribly cheesy. This one benefited greatly by the lead performance and Daniel Roebuck's loving turn as Garry Marshall. These people are heroes of mine and I came out of this movie with even more admiration for them than ever before.","For those fans of the original \"Mork & Mindy\" show in the 70's, this was a believable look into the early career of Robin Williams, now widely regarded as a comic genius and respected actor. The fact that it was \"unauthorized\" is probably meant to convey that no punches were pulled, and the dirty laundry gets aired. This was the case here as well. The producers took pains to recreate the characters from the show both physically with regard to personality. They go out of their way to put forth the fact that Williams almost became typecast for his Mork role, and the tedium and frustration that the part produced for him. After all, his fans knew he was something special when they saw him for 5 minutes on \"Happy Days\". His manic, rapid fire improvisational brilliance continues to amaze to this day, and yet, through this TV movie, we see how close he may have come to losing it all in the early 80's. My only qualm is that I have been unable to locate the credit for the actor who played John Belushi.","I have to agree with the first reviewer, the actor who played Robin Williams was amazing. If I wasn't looking at the screen, I would have sworn it was really him talking. But his performance was more than just an imitation of Robin Williams; he also showed a lot of the same skills that Robin Williams has. Skills like the ability to mimic others and the ability to switch characters practically mid-breath. I can't imagine that many people could capture so much of his character and personality. That performance alone made it a worthwhile watch. The actors chosen to play other actors were good choices as well, they looked enough like the originals that it was easy to see who they were supposed to be. I was pleasantly surprised by this movie. I enjoyed it a lot more than I thought I would.","Diamontopolous and Roebuck had the voices and mannerisms of their characters dead on. It was either great casting or great performances.The rest of the show was pretty average for behind-the-scenes-of-a-TV-show kind of stuff. But it wasn't camped up like a couple of them have been. Ironically, they made references to Gilligans' Island within the show, but this movie felt a lot like that behind the scenes movie.Surprisingly, it was interesting most of the time. There was a decent mixture of things commonly recognized and a few things not known so readily.","In the 1920's they called it \"going Hollywood\"  talented but naïve kid from the sticks gets a big movie deal, becomes an overnight sensation, gets big-headed, blows his money on alcohol (an illegal substance in the U.S. back then) and sex, then either dies young or pulls himself together, gives up the booze and returns to the woman who loved him before he became famous. In 1933 Raoul Walsh directed a film with that title, starring Bing Crosby and Marion Davies, and \"Behind the Camera: The Unauthorized Story of 'Mork and Mindy'\" could almost be considered a remake. It takes the known facts of Robin Williams' early success and presses them into the familiar cliché mold, with cocaine instead of alcohol and John Belushi as a sort of Mephistopheles to Williams' Faust. Best things here are Chris Diamantopoulos' eerily exact reproduction of the early Robin Williams and some bits of felicitous creativity in the writing (especially when Diamantopoulos as Williams encounters a busker doing him doing Williams and gives him $100).","GREAT, Chris Diamantopoulos has got to be the best Robim Williams that I have every seen.. He acts it up, perfectly. This was like watching Robim Williams as he really was and is.. It almost made me cry watching him.I had no idea that Robin was as close a friend to John Belushi as he was. The portrayal of this relationship was very good and could almost stand on it's own merits.. Very sad, what both of them went through.I really felt for both Val and Robin during his rough times. I am glad that they ended it in a high note!I hope Robin puts a $100 bill in this guy's hat !!And it was great that it was filmed in Vancouver!","I caught this on TV last night and actually watched the whole thing. These kinds of flicks (tabloid-like, unauthorized biography, etc.) aren't really my thing, but the guy who played Robin Williams really did a fantastic job! Since I'm already a fan of Mr. Williams' work, I couldn't help but root for the Hero in this story - and the guy playing him was really stretched to play the various levels of Robin's character and characters. Kudos to him for what I'm sure was an exhausting effort! I also really liked the guy who did the almost spot-on impression of Garry Marshall. LOVE the teeth! As for the story - it's \"unauthorized,\" so who knows how much TRUTH is in there, but certainly held my attention for the whole 2 hours. Definitely worth a look!","I just want to say that Chris Diamantopoulos's role as Williams for that entire show, was Emmy worthy. It was uncanny how well he did. And to be as rapid-fire and as random and as creative as Robin Williams really is....WOW. There were scenes where Diamantopoulos had to say probably 20 rapid fire lines and do 15 different characters while delivering those lines, all while sounds as much like ROBIN WILLIAMS doing those characters.....well, that my friends is impressive acting. Its one thing to do a Robin Williams impersonation for a couple of minutes. Its another to do it for a whole TV movie.I don't know how I felt about the whole show, and I don't know how much they played with the facts, but I do know that it was Chris Diamantopoulos that kept me watching. So for that, I give HIM a 10.","My wife and I attended the same High School as Chris and my wife, Karen H. appeared in Man of La Mancha with Chris. We knew he was destined for great things then, and the performance we saw last night proved that right. We were told of his role minutes before the movie aired and was very glad that we got the call. Chris did a fantastic job as Robin, we were both very impressed. Daniel Roebuck was excellent as Gary Marshall. I understand that with every \"unauthorized\" biopic there is always some artistic license taken, I always watch these movies with some apprehension. But thanks to the terrific performances by the cast, it was more entertainment, than educational.Great job Chris! Karen H. East York Collegiatge and myself are all proud of you.","I wanted to watch this, to get a inside look at the show. It told the story more of Robin Williams, then Mork & Mindy. Still, thought it was great. We got to see, Robin always being 'on', no matter what. The performance of Diamontopolous was awesome.The introductions of the main players, seem so real to me. Roebuck as Garry Marshall was wonderful. He was so charming in this, which helped me get through all the Williams energy. The little behind the scenes pieces of his other shows (Happy Days, and Laverne & Shirley), was enlightening. I also thought Richmond-Peck's Harvey was also a nice rock in the pond. (This is a good thing).This movie told the age old story of Hollywood folks, going through the ups and downs of stardom. It kept me glued to my TV, and I learned to love Robin, well hell, mostly everybody seem to be the super people I sometimes think Hollywood is. Go figure.I sometimes wonder why the network people are always played to be idiots. We never saw the head of ABC. Just heard him, like Charlie from Charlie Angels (I wonder if this way planed?). It seems so sad, that a show at number 1, could be so destroy by their own network.I think this story could be told about anyone's life, as they climb the ladder of any job. Movie, and TV stars are always loved or hated by so many people, that you grew up with, you just want to reach back in their past, to remember your own past. I Remember watching the show, and always wondering what does happen in their personal lives.Mork and Mindy, will always be part of me, and I got to see part of them. It may not all be the truth, it's also all not a lie, but in the end, it told me a wonderful sad, happy story.","I just watched this show, and the whole time I was wondering if it was robin Williams playing himself. Of course it would have to have been around the years after Mork and Mindy. I did not think that this show was a recent production, it seemed as it was made in the early 80's.The energy and character that Chris brings out is captivating and draws one to attention. The voice, the actions... everything is almost identical to Robin.The acting is superb and the characters are identical. It looked exactly like the Mork and Mindy set. If you have any chance to watch this show, do so. The only negative comments I have with this show is the actor playing John Belushi. The whole feel to John just did not seem right and I was somewhat disappointed with his portrayal.","Much like Robin Williams being the main headliner for Mork and Mindy, Chris Diamantopoulos is amazing as a young / out of control Robin Williams in this decent made for television movie. Although this is a movie dealing with cocaine, NBC manages to only show the drug for about 10 seconds in this 90 minute movie. Daniel Roebuck is OK as Gary Marshall. Since his portrayal of Jay Leno in HBO's Late Shift, it's hard to see him in any other role. Although a strong character actor like Chris Diamantopoulos, he manages to give a good enough performance. Even though the Gary Marshall story is woven into the Robin Williams story, it is Robin's story that keeps the audience watching. Some interesting moments throughout the movie, you are unable to turn the television off until the end credits.","I was a fan of 'Mork and Mindy' and I forgot that the show went through all these problems. I just remembered what was good.Chris Diamantopoulos imitated Robin Williams' comic style perfectly; I could easily imagine what it was like to see Williams himself doing all those crazy things. Whoever wrote Williams' funny lines did an excellent job, whether this included ad libbing or not. Still, at least early on I felt like all I could do was imagine it was Williams. I don't think anyone could truly master his style, though Diamantopoulos made a valiant effort. In one of the final scenes, Diamantopoulos did a very good job imitating Williams' co-workers.When Williams was not funny, Diamantopoulos did not always show talent. But in a couple of scenes associated with an unusual episode of the show which was Williams' idea (not the network's), Diamantopoulos really shined as a dramatic performer, and really made me believe he was Williams. He also did well in a couple of instances where Williams criticized Mork's portrayal.Other than Diamantopoulos, unfortunately, and except for the actors playing John Belushi (Tyler Labine was fantastic) and Raquel Welch, I didn't see any real acting ability among those playing celebrities. Though the actors playing Laverne (Stacy Fair) and The Fonz (David Josefberg) portrayed those characters better than they did the real-life actors. Daniel Roebuck especially needs to be singled out, because unless he was intended to be a parody of the genius director/producer Garry Marshall, he did not achieve what he was attempting. Marshall was not a moron, though Roebuck did the moron role very well on 'Matlock'. Later in the movie, though, Roebuck did come across nicely. And I loved the stunned looks on the faces of Marshall and Harvey after Williams auditioned for them. Of those actors not playing celebrities, Michelle Harrison did the best job, as Williams' wife Val. David Richmond-Peck did a capable job as Harvey.I enjoyed the scenes related to the show itself the most, though I couldn't help but think the show's live audience was doing a fine job of acting. Except for Diamantopoulos, I didn't think anyone was that funny. I was especially disappointed in the portrayal of Jonathan Winters.Of course, the usual constant criticism by the network just had to be included, as it often is in movies like this. That was fun, though, especially when the censors were kept hopping by Williams' antics.The scenes related to Williams' personal life were well done but not that pleasant, though not as bad as I expected. The scene where Williams met Belushi while doing his stand-up routine, and the one where they got to know each other afterward, were quite enjoyable. Overall, I was fairly happy with this movie.","I recently came across this TV show while watching videos of the real Robin Williams and I thought to myself, eh, what the hell. I don't know what version people were watching who gave this glowing reviews, because I did not see that version. Chris D. did a pretty good imitation, but it wasn't as fabulous as folks here are gushing. It also did give us a peek at the horse-jockeying that goes on behind the scenes at the networks. Other than that, it was a lukewarm depiction of a gossip magazine's take on this part of Robin's life. The scene where a fan runs up with a gift for Robin that he flings away with some harsh words was actually BS, because he would not have done that. Don't misunderstand, I know he was not a saint, but he also wasn't a whiny unappreciative ass hole either, as is also portrayed here. I can only imagine that when this aired on TV, it had been a while since people had seen the real thing, and there are young people who never saw it, so they were satisfied with this \"movie of the week\" garbage, but for folks who did see the real Mork & Mindy, and have followed Robin throughout the years should be truly disappointed. Which brings me to my original question. WHY? Did these people really imagine that they would be able to capture Robin's brilliance in a slapped together \"docudrama\"? Well it's obvious that they thought it possible, and the result was this unworthy attempt. And the actual meaning of unauthorized, means that the star or his family refused to sign off on this. Please, don't waste your time on this and watch the original series. You're welcome.","I don't know if these are really spoilers, except to a non-existent project, but I'm being safe.Memo to Paramount: 1. Chris Diamantopoulos did a great job as Robin Williams here.2. For years, Robin Williams has been firmly against doing a Mork and Mindy follow-up movie.3. The fact that Orkans age backward makes #2 a moot point.4. Chris could play Mork. Pam Dawber might be available to play Mindy again. If Williams plays anyone, it should be Mirth.5. There is room to explore the characters, and the idea that Mindy would be a (still good looking) fifty year old \"post-cougar\" apparently married to a man in his twenties. Now, suppose Mork is a pillar of the Boulder community when a flaky Orkan female finally catches up with him (say, Ellen Degeneres) having slowly and ineptly stalked him through the universe. And suppose that outs him to the Boulder community. Now there would be stakes.If the studio was interested in a good movie, it can be done.","Tolerable tele-pic about the (probably) somewhat forgotten sitcom of the late 70s, early 80s. The title is a bit of a misnomer as this mostly deals with Williams life, leaving co-star Pam Dawber virtually unseen. Right off the bat, I gotta say the guy playing Williams, Chris Diamantopoulos, is a virtuoso. A good example? He's so convincingly annoying as Williams can be at times! His talent with voices and kinetic energy is astounding. Unfortunately at times the film falls into schmaltz as most TV biographies do, such as the unseen, badly dubbed head of ABC. Or the dramatic \"intro\" of John Belushi who, because he's played by a look-a-like, we don't recognize as anybody! 1995's \"The Late Shift\", about the Jay Leno/David Letterman debacle handled that area much more deftly with the on-screen graphics of who each person was. Here, you have to be familiar with the story or wait for a corny announcing of a name. But, again, most of this is erased by Diamantopoulos' masterful performance. Which is why I was disappointed that it wasn't a straight Robin Williams bio, which could then delve into life after M&M and his second marriage. But Thanks to Diamantopoulos I have some new zingers to use on friends, such as a knock at his door, to which he replies, \"Please take off your clothes and come in\"; \"A boyfriend? A wonderful alternative to m*sturbation!\"; \"Now we can reach that balding, over 40, boring, white male demographic\". And Daniel Roebuck is becoming a pro at this, having now played Jay Leno, Don Bergman in the \"Three's Company\" story, and now Garry Marshall. The downside is that this isn't one of those \"rush out and get it\" movies because who knows when it'll air again. But if you get the chance, give it a try.","who's responsible for these \"behind the scenes\" things? who are these actors? did they crawl out from beneath rocks? 'yuks, lots of yuks!' no. no yuks for me. only loathing and shame that i am a human being. i have to avert my eyes from the set, it's so embarrassing. in fact, i changed the channel.i've always had a problem with robin williams' non-stop 'i forgot my lithium today' rantings, but at least he's funny once in a blue moon. watching someone who isn't funny at all impersonating robin williams is like having each tooth in your head pulled slowly and sadistically, without novocaine, for all eternity.please stop making these absolutely horrifying TV movies. please.","Robin Williams is one of my favorite performers and he has had a very interesting life, easily could be transformed into a great movie, made for TV or otherwise. Unfortunately the creators of this TV film chose to focus on one very small aspect of William's life and condense it.The Unauthorized Story of Mork and Mindy begins when William's career is about to take off. He's living in a small apartment with his girlfriend working the clubs, and the park trying his over the top comedy on everyone. He's losing hope that he'll ever make it big. Big time TV producer Garry Marshall has two of the top TV shows on television in Happy Days and Laverne and Shirley and is looking for another hit. Together with his writer Harvey they are looking for something different to bring back high ratings for the sloping Happy Days. They want to write in an Alien. Someone suggest newcomer comedian Jay Leno for the role and when Harvey goes to meet Leno he runs into Robin Williams who blows him away. Williams does a whirlwind audition for Marshall and he gets hired. The appearance of Mork on Happy Days is so successful that Marhsall creates the classic series spin off starring Williams. The show launches Williams into stardom and a life of women, drugs, and more money than he can imagine. After the first season the network tries to change Mork and Mindy and it's not for the better. Despite their attempts to keep it afloat the show is crashing and so is Williams. His partying lifestyle has caused him to lose his wife and his sanity. He is in danger of losing it all. With the help of his estranged wife and his co-stars he realizes he must stop and overcome his addiction.The movie is NOT about Mork and Mindy...vaguely. It's more about Williams rise and fall and his addiction. Not that it shouldn't be but it should have done a better job of telling the story. The shining point is the cast. Relative newcomer Chris Diamantopoulos is absolutely amazing as Williams. His look, his mannerisms, his voice and the fact that he is able to become not only Williams but every aspect of Williams' characters and behavior. He is astounding!! Not only is he amazing but his supporting cast Erinn Hayes as Pam Dawber, Daniel Roebuck as Garry Marshall, Tyler Labine as John Belushi, David Richmond-Peck, Michelle Harrison as Valerie Velardi, they are all magnificent in their roles!! Unfortunately they are wasted on a condensed rushed script that was churned out for May sweeps...except in April. I hope to see someone do a better story with equally great casting. 6.5/10"],"review-user":["polidori969","sisterdebmac","hairgut","studla","JGAS","mgconlan","Digger_doo","sara-216","Outsider-15","swordsmith75","patm-mich","obfh","caspian1978","vchimpanzee","sandylbc","Jawsphobia","mcfly-31","jinx_malone","Robert_duder"],"review-date":["4 April 2005","4 April 2005","4 April 2005","5 April 2005","4 April 2005","5 April 2005","4 April 2005","5 April 2005","5 April 2005","5 April 2005","5 April 2005","4 April 2005","5 April 2005","6 April 2005","4 January 2015","10 April 2005","5 April 2005","4 April 2005","24 April 2005"],"review-rating":["8","6","9","10","9","1","1","6"],"review-title":[" Robin's Interesting Story\n"," Awesome!\n"," well done docudrama\n"," An amazing performance\n"," Excellent mimics\n"," Typical \"Going Hollywood\" Movie\n"," Fantastic\n"," Not too shabby!\n"," The best impersonation of Robin Williams I have ever seen\n"," Fantastic Job Chris!\n"," Told a wonderfully, sad, happy story.\n"," Wow\n"," For NBC, this is as good as it gets\n"," Can anyone really capture Robin Williams?\n"," Unauthorized Mork . . .WHY????\n"," Eggs Over Boulder\n"," Robin from Ork...\n"," sickening horror and despair\n"," Made for TV...enough said....\n"]}