{"review-url":["http://www.imdb.com/title/tt0419887/reviews"],"review-text":["I just watched this film at an advanced screening. I had not read the book, and knew nothing of the story, but went because the book was voted \"Book of the Year\" by two local colleges. So I cannot compare the book with the movie as others have done.In short, I thought this was an incredibly moving story. The acting was believable, and the insight into Afghan culture and political history was both interesting and shocking. My oldest friend is Iranian-American, and so I felt an affinity for certain Middle Eastern values and traditions that were portrayed in the movie, as they reminded me of the times I spent with his family.The themes of friendship, family, human values, and courage under fire are universal, and are well developed in the film. I won't list the plot details, as these can be obtained elsewhere. But based on the film's technical aspects, the acting, and, above all, its heart-wrenching story, I would definitely recommend this movie.","I recently was lucky enough to see \"The Kite Runner\" in a small theater, surrounded by seasoned movie-goers who knew how to enjoy a masterpiece of such sophistication. With all the controversy surrounding this film's central scene these days, I was expecting a piece both crude and violent. But the way Mr. Forster handled the delicate subject was touching and really, deeply moving. Even though the film's credits indicated China as the main location for the shoot, I could have sworn I was seeing Kabul throughout the scenes which are meant to be taking place in Afghanistan. The acting, by non-professionals as well as professional actors, is excellent and the casting is magnificent. So, this is a movie I would see again and again, because though it is undeniably sad in its subject, the masterful way it has been made awakens a whole new hope in modern cinema.","Amazing, Astounding, Brilliant, Superb. Those are the four adjectives that prop up in my head when I start describing \"The Kite Runner\". Khaled Hosseini's book adaptation had already captured many minds, in fact it is rumored that he himself broke down in to tears after watching the premier. I must say before I even start that I had read the book before I saw the advanced screening of \"The Kite Runner\". So my judgment and views may be slightly biased.Firstly, let me say it, that even though in my opinion the book was better than the final product of the movie, it is by no means a bad adaptation. I mean for a two hour movie it's got the deserved response. Things do appear a tad fast in the final twenty odd minutes, but apart from that it has succeeded what the book did. It has captured the minds and imagination of millions all across the globe. The magic woven by Khaled Hosseini, to give us a sense of remorse of joy, of sadness, of pain, of loyalty is astute in this adaptation. Especially in the very first scene, when young Hassan says, \"If you tell me to eat dirt, I will. but I know you won't ask me to.\" Such a touching line, is bound to capture the hearts of many. The two young actors were brilliant, absolutely superb. Especially the boy who played the innocent but loyal Hassan, a boy, who refuses to give up a kite he caught because he promised his best friend that he would bring it to him, only to be abused by large bullies who beat him up and use him sexually, and then to be rebuked by his best friend as a coward. The entire act is so touching that it cannot but wet your eyes.The entire movie is well placed save the last bit. The point when Amir learns of his true relationship with Hassan and reads Hassan's first and last not to him, when he breaks down in tears feeling helpless, lonely and remorseful, that appeared a bit rushed and felt that Amir was behind a facade. In the book, Khaled Hosseini had dedicated some 10-12 pages to describe Amir's state of mind in that position. But that his made up for in the penultimate segment of the movie, when Amir stands up for Hassan's boy, his nephew, Sohrab in front of his commanding father-in-law. The ending was well deserved and I am sure will be well appreciated. It felt witnessing the torch pass down from one generation to another.Coming over to the technical aspects. First of all, the acting. Just one word-Superb. From start to finish, young Hassan and Amir, their father, his friend Rahim Khan. Everyone has been superb, especially young Hassan. Second, the direction was amazing, coupled with some brilliant camera work. The background score was also impressive. Right from the start credit track to the end credit, and I especially loved the one when Amir is in the mosque in Pakistan the western and Islamic fusion, made that extra special.All in all, this is definitely one of the better movies, and it's a welcome break from all those Iran inspired movies that we have floating all over this year. 9/10 !!!","The Kite Runner was beautiful, poignant and very moving. I particularly loved the two child actors in the film as well as the actor portraying the father. It really made me want to go back and read the book again.The music was a wonderful part of the fabric of the movie. If there is a soundtrack coming out for the film, I will buy it to accompany my second reading of the book. It is also a visually stunning film. The cinematography was gorgeous and really added to experience.The Brazilian word 'saudades' is very descriptive of how I felt at the end of the film...\"it is a deep feeling of longing for someone or someplace, which is very sweet but also tinged with an inescapable sadness\" (definition provided years ago by Antonio Carlos Jobim).Saw it at a small cinema here for an advance screening. I would love to see it again on a really large screen with a tricked out sound system.Can't wait for the formal release. I will definitely recommend the film to friends.","I know that to include everything in the book, the film would have to have been several hours long, so I think they did their best to include things that were crucial and pivotal to the story. I thought the casting was great, the children who played Amir and Hassan were very good actors. And the guy who played Amir as an adult was great! The scenes between him and Baba were especially touching. I thought the locations they used were interesting... scenes set in Afghanistan were shot in China, and one scene that took place in Fremont, CA (the graduation scene) was actually shot on Treasure Island in San Francisco. I worked one day as an extra on \"Kite Runner\" and it was that day, the day they shot the graduation scene. We reported to Treasure Island in the morning, they checked everyone's wardrobe to make sure it looked like the late 80s, an then we took our places in the audience. They shot the scene over and over again until they were happy with it. It was cool to see the actors up close and also to see the book's author, who was on hand as a story consultant. I thought this book was excellent and I recommend both the book and the movie to anyone. This is a moving story about friendship, love, guilt and eventual redemption. \"There is a way to be good again.\"","This really is a film of two halves. The first detailing the lives and friendship of two boys (one a privileged Pashtun and the other a down-trodden Hazara) in late 70s Afghanistan before the invasion by the USSR works extremely well. The young actors turn in convincing performances and seeing Afghanistan as it once was throws the present situation there into stark relief.The real problem comes when we move into the later phase of the story where we join the Pashtun as a man living in America. Ancient debts to his young friend lead him to return to his homeland and it is really at this point that things break down. The central adult character is clearly supposed to be sympathetic, but in fact comes across as wimpish and wallowing in self pity. It is hard to really care for him and one cannot help but feel that the really interesting story is the one we do not get to see - that of his boyhood friend.Once he returns to Afghanistan the narrative becomes bogged down in a series of highly contrived coincidences. Most remarkably he manages to come across his childhood enemy after all these years almost immediately (even though he is not looking for him), despite the chaos that has since consumed the country. This enables him to confront past demons in a way that is simply too convenient to be credible. The resolution of the narrative is also run through with an awful, mawkish sentimentality which undermines any really serious points the film may be trying to make.Although it is possible to start seeing characters and the abuses of their lives as symbols of a state which has been torn apart by world politics it is hard to really see this as a film which engages with any wider political discussion. Instead the narrative becomes reduced to one character's emotional journey of self discovery and healing. Unfortunately this character is so dull and wrapped up in himself that it is hard to really become engaged in his story, while opportunities to make a really interesting film about Afghanistan itself are wasted.","The Kite Runner should win an Oscar! It's perfect in every sense, the story, the script, the acting, the cinematography... One would never guess it was filmed in China. The story of two childhood friends and what follows in their adult lives will leave a lasting impression. The depiction of life in Afghanistan under the Taliban is all too real and horrifying. I have not read the book, but I have seen comments that put down the movie because \"the book is always better\"... It doesn't really matter. No one put down \"Gone With The Wind\" because it wasn't true to the book! As a matter of fact, it won the Academy Award for best picture and several other Oscars. I think this movie is brilliant - BRAVO to the writer and director, and the actors!","i loved the book, but this movie just didn't do it justice. i understand that to fit everything in would have made it six hours long, but if you never read the book (which is a crime in its own right) you missed the whole meaning behind the story. Assef is one of the most important characters in the book, and in the movie he is an insignificant bully. not only that but the movie shortened some important lines and completely cut others, especially from Rahim Khan. they changed other things that just didn't need to be changed like when Assef was reintroduced. the head of the orphanage sent them to see another man for no reason. and Assef didn't give Amir and Sohrab the free getaway which actually would have saved a little time. Assef isn't even German which was a small, but important part of his character and his obsession with Hitler at least explained more of why he was so crazy at the end. oh, i almost forgot i HATED that they gave the blue kite a face. it was unnecessary and leaving it out would have allowed more important things from the book to be put into the movie. the movie on its own was pretty good but just lacked the overall feeling of the book and there were WAY too many pointless changes from the book for me to like it.","Having just read the book and a day later watched the film I can tell you I was severely disappointed. To be fair there was quite a bit to shoehorn into the film and as a result the film moved at an amazing pace compared with the book. Plenty was left some of it quite important in my opinion. A good example - Hassan actually had an operation for his birthday present from Amir's father to correct his harelip not a kite! I think because so many of the scenes in the film were very short as they were trying to fit so much into the film there is little time to engage with the characters and have any emotional attachment to them. This made the film almost not caring about its purpose. The emotion of the book never appeared in the film. I was not upset or distressed at all. I should have been. The truth of the tale is devastating. But the actors didn't seem engaged in the weight of their portrayal. In short PLEASE READ THE BOOK! The film is weak and soulless.","\"The Kite Runner\" is one of the most controversial films of the year, and it's not just one of those controversies invented by PR people to sell tickets. No, this is a film that was actually pulled from release because the producers began to fear for their safety of their actors. That may give you an idea of just how sensitive and topical some of the material is. \"The Kite Runner\" is an important film for our modern world, because now more than ever, we need stories that show the reality of war, not just action movies that glamorize the violence. It was adapted from the best-selling book, and some critics have charged that something was lost in translation, but if you don't bring the baggage of the novel into the screening, you will be very moved.","It was AMAZING. As a librarian and an attendee at the New York Library Association's Vitality Fund Event on Thursday night, October 18, I was privileged to see a pre-release screening of the new movie, The Kite Runner. The release of the movie has been delayed because of concerns about the welfare of the child actors involved. I am grateful that the NYLA event was allowed to go on as planned.Regarding the movie, I feel it was masterfully done. It had as much impact on me, I think, as Stanley Kubrik's A Clockwork Orange, even though it is much less graphic - MUCH less. There is no comparison between the horrendous, shocking violence and rape shown in A Clockwork Orange and the small amount of violence actually shown in Kite Runner; only the subject matter and the implications for the human psyche are comparable. (I have written more details about the violence and child rape and how it was handled on my MySpace blog.) My overall impression was that this film was fantastic; one of the best-made films I have seen. The depiction of the Afghani boys flying their kites captured some of the beauty and grace of an art form unknown to most of the world. The subject matter is intensely serious, and the movie carries the emotions of the audience into that subject matter without many jarring \"Hollywood touches\" which have ruined other movies. Although the overturned cart of pomegranates was an obvious bit of symbolism (to me).Finally, I must mention the excellence of the sound track. The recitation by the boy of poetry by Rumi as two main characters are fleeing the country during the Russian invasion - under terrifying circumstances - truly showed the power of those poems. I urge anyone watching to disregard the subtitles in that scene to the extent that you can, and just listen to the beauty of the language. I don't even know what language Amir is quoting, whether his normal Dari Persian dialect is the same as Rumi's original Persian dialect. Also, please note the sound heard every time a kite line is cut. I found it a profound, distinctive sound, though the librarians who were with me did not notice it at all. I can't help but wonder if kites actually make a sound like that when they are \"cut\", or if it gives a sense of the vibration/sound experienced by the kite flyer during competition.","After seeing the prosthetic legs dropping from the sky by parachute in Kandahar (2001), one of the most memorable images in all of cinema, I wondered why there weren't more stories coming out of such a tumultuous country, tied to Americans forever by 9/11. And now I think I know why.Such a beautifully-wrought adaptation of the wildly-popular novel of the same name, The Kite Runner is a model of fine film-making in almost all respects except one: It's too pat. So maybe Charlie Wilson's War will show me that films about Afghanistan will not revolve around formulae and clichés.The redemption of the protagonist, Amir (Khalid Abdalla), has been told forever in literature and film, just not in Afghanistan. So no matter how tear-jerking the film may be, it is still a story told many times of a man who commits an egregious sin as a child but redeems himself in the end with an act of courage. Meanwhile, director Marc Forster and screenwriter David Beniof lace the film with the major motif, kite running, to such an ingenious extent that it not only ties in the hero's youth with his maturity, it also provides a figurative way of showing the desolation and hope of the country mixed of course with contradictory elements such as cutting string and blessed artificial legs.Thus the film as metaphor is a success in showing the dismal past of a struggling country and its hopeful future. The cinematic images also emphasize this duality: The vistas with snow capped mountains and endless plains deflect the vision of a barren land where trees that manage to grow have been cut down by invaders, in this case 1979 Russia. The titular activity flourishes in large part because the arid, stony land offers few other possibilities. When the land is revisited in 2000, the limited country seems almost completely bereft of color and resources, a gray prison that parades adulterers to be stoned in the soccer stadium and little boys abused by an out-of-control Taliban.But true to the formula, Amir has a second chance. I hope Afghanistan shares a similar fate.","I just saw it at an advance screening I haven't read the book, but heard many good things about it.The movie was absolutely fantastic, very moving. With a roller coaster of emotions you totally connect with the characters. Shaun Toub was great, it was a complete departure from his usual roles, and his acting for those who understand Persian/Dari was incredible.One thing to notes it that Khaled Hosseini actually loved the film which is unusual for book adaptation movies. Even after seeing the movie several times \"he was sobbing\".Also the animation from the intro was exquisite, with names displayed as if it were Persian calligraphy, very unique! At times the translation was not clearly conveying the message efficiently, but all in all this was a great movie.","I rated this movie poorly because it didn't at all capture the heart of the book: Amir's relationship with Hassan, his relationship with his father, his agonizing guilt over his betrayal of Hassan, his longing for his father's affection, and the emotion surrounding all of these things. These are what made the book so great. I didn't find any of it in the movie. I realize a movie has limits, but maybe sometimes it's better to just leave a story in book form.To be fair, the movie does have many exact or close to exact quotes from the book. It also appears to be, for the most part, historically and culturally accurate. There were several important scenes that were left out or changed, but this did not bother me as much as what I stated in the first paragraph.","Greetings again from the darkness. Based on the mega-best seller from author Khaled Hosseini, the film provides us a peak at the ugliness of post-Russia invaded Afghanistan and the terror of the Taliban. Director Marc Foster adds a gem to his resume, which already includes \"Monster's Ball\", \"Finding Neverland\" and \"Stranger Than Fiction\".The story of young friends Amir and Hassan and the unknown bond they share into the next generation. This is a story of honor and courage and loyalty and is an unusual coming-of-age tale. Some great scenes of the boys when they are kids and then a couple of truly amazing scenes as Amir returns as an adult to find Hassan's imprisoned son.This is tight, compelling story telling with a message. The acting is solid throughout, with no one actor stealing the screen. Although not a pleasant story to watch unfold, it is certainly meaningful and heart felt. Plus a quick shot of Midnight Oil playing in the pool hall is a welcome gift.","I just recently read The Kite Runner for a college course I am taking. It was fantastic a book and I was very excited to watch this film. Almost right from the start I started seeing signs that the film was not going to be quite as good as the book, but I tried to remain entirely optimistic and separate my expectation from the book as opposed to the movie. The script ended up being very underdeveloped and did not give the viewer the opportunity to emotionally connect with many of the primary characters.I ended up giving the film a rating 5 out of 10 when I weighed in the beautiful cinematography which was absolutely breathtaking... but not worth the bore. Look for a picture instead.","First of all, the hype about The Kite Runner was wildly over-blown, and sadly, the movie is just as disappointing as the book. Most of the novel is outstanding, but it completely falls off a cliff at the end, and then closes with a happily-ever-after ending that seems just as tacked-on as the worst of the Hollywood offenders. True, the movie is remarkably faithful to the novel, but the whole story, especially because of the cartoonish confrontation at the end, gives me the feeling that it is little more than a childish revenge fantasy which is only legitimized because author Khaled Hosseini really can write. I was an English major when I was in college, and one of the things that I noticed in any creative writing class that I ever took was that, because almost every single person wrote stories starring themselves (as Hosseini has clearly done and like, for example, Stephen King almost always does), many of them wrote stories about something bad that happened to them, in which they augmented the wrong committed against them and then issued a perfectly planned and executed retribution against their offender. This, ladies and gentlemen, is what you have with The Kite Runner.Now, I won't say that Hosseini was bullied as a child lived in a harsh environment and therefore wrote a heroic story about that. Indeed the setting in Afghanistan and the oppressive atmosphere is both well-presented and an important, real life issue. But when the Taliban appears and starts stoning adulterous women to death in front of packed stadiums and bad guys parade little boys around in make-up and get shot in the eye with sling-shots, then it all becomes clear what's really going on. I remember that the novel was extremely popular when it was released and I remember being at a loss to explain the fame after I read it. It is, indeed, a page-turner, but it has an unfortunately combination of amazingly realistic descriptions and situations with goofy, over-blown movie villains that gives the whole thing a feeling of being an artificial contraption drummed up by someone trying to make his way into the writing business. But hey, Hosseini has succeeded in making the artificial successful twice now, so maybe it's me who should take some advice. But I think it would be difficult for anyone to argue that Hosseini has succeeded as much in the quality of his story-telling as he has in the BUSINESS of story-telling. In that regard, this is definitely a success story!I also feel like a lot of people are going to pick up on the arrogance of presenting America as this holy land, a paradise on earth where all you have to do is get there and everything will be okay. Of course, it is true of the little boy living under the iron fist of the Taliban, but it's that kind of thinking that has gotten America into a lot of trouble in the past. And I also love how Amir, our hero, goes to Afghanistan but doesn't know enough not to stare at a passing pickup truck full of bearded guys holding AK-47's. Smart.And by the way, can I just say one thing? What is the deal with the Taliban? Those people are totally insane. Oh, and the best thing about the movie is that little kid who played Hassan. He had the most important role in the movie and he was OUTSTANDING.","In the 70's in Afghanistan, the Pushtun boy Amir (Zekeria Ebrahimi) and the Hazara boy Hassan (Ahmad Khan Mahmoodzada), who is his loyal friend and son of their Hazara servant Ali (Nabi Tanha), are raised together in Amir's father house, playing and kitting on the streets of a peaceful Kabul. Amir feels that his wise and good father Baba (Homayoun Ershadi) blames him for the death of his mother in the delivery, and also that his father loves and prefers Hassam to him. In return, Amir feels a great respect for his father's best friend Rahim Khan (Shaun Toub), who supports his intention to become a writer. After Amir winning a competition of kitting, Hassam runs to bring a kite to Amir, but he is beaten and raped by the brutal Assef (Elham Ehsas) in an empty street to protect Amir's kite; the coward Amir witness the assault but does not help the loyal Hassam. On the day after his birthday party, Amir hides his new watch in Hassam's bed to frame the boy as a thief and force his father to fire Ali, releasing his conscience from recalling his cowardice and betrayal. In 1979, the Russians invade Afghanistan and Baba and Amir escape to Pakistan. In 1988, they have a simple life in Fremont, California, when Amir graduates in a public college for the pride and joy of Baba. Later Amir meets his countrywoman Soraya (Atossa Leoni) and they get married. In 2000, after the death of Baba, Amir is a famous novelist and receives a phone call from the terminal Rahim Khan, who discloses secrets about his family, forcing Amir to return to Peshawar, in Pakistan, in a journey of redemption.I am not familiar with the Afghan culture and I did not read this novel in spite of the recommendation of my daughter, and yesterday I decided to watch this movie on DVD. I found a good story of loyalty, cowardice, betrayal and redemption, with a brief insight in the recent history of Afghanistan, from a peaceful period in the 70's to the present days with the Taliban. The actors and actresses have great performances, giving credibility to the realistic story. The arid locations in China recall the images we see in television from Afghanistan. In the end, I found \"The Kite Runner\" a good movie. My vote is seven.Title (Brazil): \"O Caçador de Pipa\" (\"The Kite Chaser\")","THE KITE RUNNER is one of these movies that' gains a limited release on the art house/ foreign language circuit is totally loved by critics and people who never pay a penny to watch a mainstream movie . It's also a film with a message and a deep subtext about friendship in the face of adversity which can be a rather hit and miss concept for a movie . Knowing this I delayed watching the film until tonight where I chanced upon it . It's a fair enough film though certainly not a great one What the film does succeed in doing is not painting 1970s Afghanistan as some sort of third world cess pit . For an adventurous backpacker from the period it was a favourite destination on the Kathmandu - Istanbul \" Hippy trail \" and the Afghans are painted as sophisticated intellectuals whose only link to the past is in keeping with an honor system along with the portrayal of division among the differing Afghan tribes . Unfortunately bad things in both films and life happen to nice people and the upper class Baba and his young son Amir flee the Soviet invasion to Pakistan and there to America where Amir grows up to be a novelist unable to shake off a feeling of guilt about abandoning his childhood friend Hassan THE KITE RUNNER also deserves slight credit for the portrayal of the Taliban . To quote Christopher Hitchens \" They're not the wretched of the Earth - they're the scum of the Earth \" They patrol the rubble of Afghanistan on beard patrols , provide half time entertainment during soccer matches by stoning adulterers and despite banning music visit orphanages to satisfy their lust for children ( Along with flying kites ) they're not above keeping a ghetto blaster or two for themselves Why did I say \" slight credit \" ? To be honest I don't think the violent , stomach churning and often hypocritical theocratic tyranny of the Taliban was shown harshly enough . You can't give a dog like the Taliban a bad enough name and would have liked to seen the way they treat the inhabitants of Afghanistan . There's also a Pashtun character who is introduced early in the story and appears later in he film which gives the impression that the Taaliban are an Afghan organisation when in reality they're a Pakistani militia which invaded the country of Afghanistan in the mid 1990s . Many Pastuns did join the Taliban , but many didn't and they suffered by the regime along with Hazaras , Tadjiks , Uzbeks and the other Afghan tribes Undoubtedly the biggest failing of the film is that I never felt engaged for much of the running time . It's difficult not to compare this movie with THE KILLING FIELDS since both movies feature a deep subtext of the bond of friendship enduring through adversity and war . . Of course THE KILLING FIELDS is based upon a true story whilst this merely based upon a novel . It's a film that's directed in a rather flat manner by Marc Forster which isn't necessarily a criticism because the acting is convincing and was shocked to find Khalid Abdalla is Glasgow born , I genuinely though he was an Afghan , but I was left with the feeling that despite THE KITE RUNNER being a fair movie it should have been a great and unforgettable movie experience","I have read both the book and saw the movie today. The storyline is so powerful that almost any script or screenplay would have done justice to it. So nothing much there. However, this is still a beautiful movie because it makes one think and feel, just like the book. Watching it is not like watching a documentary on a failed state and feeling sympathetic towards people suffering under an oppressive regime, but is like watching any other common man's story unfold, across generations, across continents. Amir's cowardice, his guilt, his dilemmas and finally his choosing a way of redemption could have been a story of any of us. There isn't a single infallible character to look up to and idolize but all of them are gray, just like all of us.Another important observation is that the movie does a great job of chronicling the lives of Afghans through the twenty some years of turbulent political scenarios. The vibrant, care-free childhood represents Kabul before the Russian invasion and the desolate, shattered remains of the city echo what the Taliban has done to it.The child actors deserve 'thumbs up' all the way. They can put any matured actor to shame.If you have not yet seen the movie or read the book, just walk into the theater keeping in mind that you are going to witness a multi-layered story woven on a multi-colored fabric of human emotions and sentiments. This movie is not meant to stir anti-Soviet and anti-Taliban feelings but to feel the trials of human existence.I read some of the external reviews linked to the site and I must confess I do not see the point in writing reviews that summarize the storyline like a distant spectator and point out technical details about amazing cinematography or something similar. At least for this movie, one should try to connect to it rather than judging it objectively.","Okay, so this contains spoilers, so if you have not seen it, look away or actually do not bother to watch this film at all and this is why.... Tell me, how can the main protagonist walk into a Taliban Camp, unarmed, with a fake beard, demand to be given a 10 year old boy that has been sodomized and raped and made to be a dancer his whole life, by...now get this, getting found out, having his beard ripped off, being almost beaten to death by the Taliban Boss...only to escape by the little boy victim suddenly changing from a puppet who is scared and helpless, to pull out a sling shot and knock out the Taliban leader in one shot, by taking out is eye, in sudden heroic style and run out with his wounded protagonist, being chased by armed Taliban firing machine guns, be able to get into only Jeep unharmed and get this, get across the Afghan border! Oh come on. Why insult us the viewers????","Like Mark Twain's \"The War Prayer\" - with both a spoken and unspoken prayer  for me, \"The Kite Runner\" has both a spoken and unspoken message. The spoken message is a message of redemption. After returning to Afghanistan to rescue (and be rescued by) his half-brother's son, Amir finds a degree of contentment upon \"becoming good again.\" It was not until I continued to reflect upon the movie that I recognized the unspoken message. I was troubled by what drove Amir to find the courage, the backbone, the character to stand up to his \"General\" father-in-law when he was disrespectful regarding his half-brother's son. Although I can see where finding contentment from \"becoming good again\" contributed to finding the character to stand up to the \"General\" - of itself - it did not seem sufficient.Throughout the movie, Amir desired to be like his father, to have his father's character and to be respected by his father for the character that his father recognized in Hassan. Amir saw his father as an individual of towering and unassailable character, which he was. One of the reasons Amir did not see himself with the character of his father, was because he saw himself with flaws that would prevent the attainment of those heights. It was not until Amir learned that his father was not without faults (fathering a child with his servant's wife), that he recognized that his father's flaws did not prevent his father from developing and attaining character. It is this recognition (the unspoken message  that we can have flaws and still have character) that allows Amir to find his own character to stand up to the \"General.\"In essence, the unspoken message is telling us that we, as individuals, may have deficiencies, but that should not stop us from developing, enhancing and embracing our own character. We are too often overly critical of our own shortcomings, and do not give ourselves credit for the quality person that we are. If we are not perfect today, there is always tomorrow! This is an ongoing, ever evolving, ever improving process. The past cannot be changed, only tomorrow can be improved!","I have never read the book, but had always heard good things about it. So when the movie came out I considered going to see it, but never did. Now it has come out on DVD and I have thought of renting for a few weeks now. Last night I finally picked it up. I am very glad that I did.Cinematography was incredible in this movie. The scenery, etc,... all made you feel like you were in Kabul. The acting was all very good, although I am sure some of the emotions were lost in the translation. And the story itself was good and pure and uplifting. Yes the story was very sad, but at the same time uplifting.And I will be honest, as a white American,... made me see aside of Kabul and Afghanistan that I never picture in my mind when I think about it. Showed me a Afghanistan before the Taliban. Showed me a place that was beautiful. Showed me a place with good hearted people. I community that was like a family, aside from a few bullies.Anyways, I recommend this movie to everyone. It is one of the best I have ever seen.","For those of you who have read the Kite Runner, you know how powerful of a story it is. For those who haven't, I advice you to read the book and avoid the film, as does not hold a candle to its source.The big problem with the film is its apparent lack of care for its source material, as all the big events are simply glossed over and never given the impact they should have. The movie seems to just want to hit its mark, and leave it at that. This gives everything a rushed feel, with big moments from the novel happening in the film way too soon and only lasting a couple of seconds.Another problem it has are the parts that it leaves out. I know a movie based on a book can't get everything in from the book, but The Kite Runner leaves out way too much, mostly in its attempts to get to the bigger parts of the story. It doesn't realize that having those smaller moments are what make the big moments have impact, because through these smaller moments we learn who these characters are and why we should care about them. Without them, they might as well be completely different characters in every other scene.That's about all I can say about The Kite Runner other than it is in desperate need of a narrator. To sum it all up, this adaptation is more based on the Spark Notes of the novel than it is on the novel itself. Just avoid it and read the book instead.","A fairly solid, mildly gripping drama dealing mainly in the unique perspectives of two Afghani children, The Kite Runner nonetheless feels overextended in it's third act and a tad unbelievable with some of the moral complexities which drive the film. Adapted from the novel by Khaled Hosseini, the movie did feel slightly less genuine then it should have in the hands of Marc Forster-an odd choice for directing, but not a surprising one, given the massive number of Middle Eastern-themed films targeted at American audiences being released over the next few years.Despite some strong performances by most of the cast, including these two young children who guide the film's heart in the beginning and a dominating, charismatic turn by Homayoun Ershadi as one of the boy's fathers, the main character in The Kite Runner (relative newcomer Khalid Abdalla) simply does not exude the quiet strength needed to demonstrate his character's commitment, instead appearing rather puny and taking the overall thematic integrity from being emotionally involving to simply being interesting from afar."],"review-user":["aka_Sumiyoshi","happilyunmarriedeveraftr","Sparrowmaniac","ictconnect","FilmPolice","joshbaileynch","leiser18","keepaskin","cssmonkey","desperationnumberfive","jschult","jdesando","who_took_ID_edifer","amandagblakely","ferguson-6","plastikisses","Anonymous_Maxine","claudio_carvalho","Theo Robertson","debi_chat","aaronkalvani","rogermehus","DaleP1979","Alex_Pete_Georgie_Dim","oneloveall"],"review-date":["7 November 2007","15 October 2007","28 December 2007","28 November 2007","26 October 2007","11 June 2008","16 December 2007","7 February 2008","12 October 2008","30 November 2007","20 October 2007","17 December 2007","28 November 2007","28 November 2010","16 December 2007","20 October 2010","17 June 2008","10 October 2008","13 April 2011","11 January 2008","5 January 2008","13 January 2008","8 April 2008","17 May 2013","7 December 2007"],"review-rating":["10","10","9","10","10","4","10","3","5","8","9","10","2","7","5","6","7","6","8","1","9","9","5","6"],"review-title":[" Very moving and personal\n"," This is truly one of those times when a film does great justice to a book!\n"," Amazing, Astounding, Brilliant, Superb !!!\n"," Excellent film, music & cinematography\n"," Nice transition from book to film\n"," Don't believe the hype\n"," And the Oscar goes to ...\n"," Disappointing...\n"," READ THE BOOK.... very disappointing film.\n"," Not a totally faithful adaptation, but stands on its own.\n"," A fantastic, classic movie.\n"," I hope Afghanistan shares a similar fate.\n"," Fantastic Cinematography\n"," Story should have been left in book form\n"," Variance on Theft\n"," Very underdeveloped script and not worthy of the GREAT BOOK.\n"," \"This country is not kind to invaders\"\n"," Loyalty, Cowardice, Betrayal and Redemption\n"," Could Have Been A Great Movie But Is Let Down By An Unengaging Nature\n"," Humane, humble and honest\n"," The film has to be worst thought out script in the world...\n"," Spoken & Unspoken Theme or Message\n"," My Review Wont Do This Movie Justice....\n"," A Rushed And Poorly Executed Adaptation.\n"," Potentially effective tale suffers a few missteps\n"]}