{"review-url":["http://www.imdb.com/title/tt0469050/reviews"],"review-text":["Director Jeff Lau, who brought us Chow Sing Chi's impressive Chinese Odyssey saga, and many, many other exciting action comedies, delivers an updated version of the aforementioned Monkey King tale.And yet again, strange as it may seem it works.And I do want to focus on the word 'strange'.Anyone who isn't used to the weird and wonderful world of HK cinema will think that both their eyes and mind has just been raped after their first viewing of A Chinese Tall Story. And I don't mean that in a bad way!As much as I think this is possibly one of the strangest adaptations of the Monkey King, wait – this is the strangest adaptation of that very famous story – it is also one of the most entertaining, marred only just, by some OTT moments and Jeff Lau's usual fault of trying to cram too much into one show. But hey, you get over it.As a film maker, I do appreciate the amount of work that goes into a film, and this one deserves to be seen at least for what went into it.The handsome Nicholas Tse plays Prince Tripitaka, who has to rescue the Monkey King and his other friends after they get captured by an army of giant insects (no, really). Along the way, he meets a mixture of characters who all play a 'who's who' of those you'd recognise from the superb Dragon Ball Z series – including the criminally underused Yuen Wah as the Turtle King. Classic Shaw Brothers stars Gordon Lui and Kara Hui co-star in non-action roles, but all in all, there is plenty here to let that all pass.Check it out – I guarantee you'll not have seen anything like it","STORY Chinese Tall Story tells the story of righteous monk Tripitaka, who, along with his guardians Monkey, Sandy and Pigsy make their journey west on a quest to recover ancient Sutras, finally, they reach the final leg of their journey in Shache City But all is not as it seems when the city is attacked by evil tree demons. Monkey tries his best to battle them but is overwhelmed, knowing his master is in grave danger, he uses his trusty golden staff to thrust Tripitaka to safety.The monk ends up being knocked out when he land and when he wakes up he finds himself in the presence of a young lizard imp named Maiyan who takes quite a shine to our young hero, after many verbal misunderstandings Maiyan becomes convinced Tripitaka loves her, so when the monk decides he must rescue Monkey and the others, she insists on accompanying him. So the mismatched pair begins their adventure together.REVIEW Okay, so, it's another Journey To The West movie, which isn't a bad thing to me since I love the story and the characters associated with it, so I was a little excited to get my hands on the DVD. So I think I'll start off my review with the story, which is all over the place, at first it was your standard fantasy film, then it became a ridiculous comedy then suddenly became full blown sci-fi, if the director Jeff Lau was experimenting with mixing genres then he did a pretty scatological job with this movie. I think it's a pretty unique approach by having the story centre on a character other then the infamous Monkey King, especially taking a character as pacifistic as Tripitaka and then putting him into what is at it's core a love story. So overall, I liked it.The acting is for the most part solid, with leads Nicholas Tse and Charlene Choi putting in some really good performances, though Ah Char does spend most of her screen time behind some rather ugly make up. The supporting cast is nicely put together, it includes all the usual EEG main stays so Boy'Z and Isabella Leong make appearances, one actor I'd like to mention is Wilson Chen, who plays the Monkey King, he did a good job with the limited material he seemed to have been given, he played a version of the Monkey King who was subdued yet arrogant, I had a feeling he'd be retreading Twins Effect II territory but fortunately that's not the case here. I hope he gets to do a follow up to this with himself in the central role, since the film does leave itself open for a sequel.Okay, so let's get down to the directing, which again is kinda all over the place, Lau gives too much time to the Stephen Chow-esquire nonsense comedy, which includes a scene where Tripitaka in order to toughen himself up, dresses up as Spider-Man, which I assume lead to many a head scratching moment since the film is meant to be set in Ancient China. He does create some really nice and tender moments between the two leads and does delve into sappy territory but this reviewer does enjoy a bit of sap on occasion so it didn't bother me in the slightest.Right, now onto the CGI, which for the most part is quite bearable, there are a lot of moments which probably belong on a PS2 like many other reviews have stated but there are some cool moments particularly the scene in which Monkey battles a flying minion. A lot of the CG gags are provided in the form of the golden staff which turns into a range of different things, ranging from a giant fly swatter to a mech suit straight out of The Matrix Revolutions. So yeah, it sounds crazy but I guess you'd have to see it to believe it.Right, so in closing A Chinese Tall Story isn't a movie without it's flaws but it keeps itself together long enough to be able to entertain and generally be a overall enjoyable movie. If all of the above doesn't swing you to see it how about I put it this way, it's much better then Twins Effect II.","The weakness of this comes from the confusing storytelling, plots often coming out of nowhere. But it really didn't matter because I still enjoyed it to it's full length. Once you actually accept that this movies not to be taken too seriously then you'll enjoy it even more. It's basically a love story, a confusing one at first but as it evolves it really is something worthwhile. Sure it's been done so many times before but the complicated version of this is quite inspiring and touching.The over the top fantasy and cgi was overwhelming at first but I still enjoyed its purpose. And people quit whining about how it borrowed from other movies!! Guess what we know!! And it doesn't really matter because its purpose was to humour and entertain. Sometimes people has to stop being so critical and think for a moment before they start yapping about. Comparing this to Hollywood standards is utterly stupid and ignorant, It's a totally different style and target audience. As far as I'm concerned some the best films I've feasted my eyes upon are from eastern producers and directors. There's your Police story 4,shaolin soccer, kung fu hustle, dragon tiger gate, fist of legend, hero, crouching tiger etc...I for one like this movie and haling from the Philippines, US, england, Libya and now Australia, I'll always be interested in these types of films. Now try and judge my perception, but I warn you I do see things from from the point of view of those 5 countries I've lived in. So you better be as experienced and open minded.","Well, first of all, don't listen to the people complaining about the CGI (special effects). This is a comedy movie and its all about the story, the beautiful scenarios, clothing, the jokes, the acting, originality. The story is very funny and original, besides, the director is one of the most recognized of Chinese culture. It also have the background stories and legends of Chinese folklore, like journey to the west, among others, so there are many layers of meaning about the jokes and the story. Its a silly story but it also has its deepness and tenderness. The CGI are used only for the sake of the story, the director Jeffrey Lau and many folk stories like this in Chinese cinema have an approach of cinema more like a theatre play, not like a hoolywood movie that want to impress with special effects. So you have to expect very cheesy and bad CGI. I put 10 stars not because it's perfect movie, but because it's so underrated that it hurts, its the kind of movie that many people who aren't aware of Chinese cinema tradition will rate it as garbage. An extremely original, fun and even beautiful (at moments) experience for me.","are you crazy or what? this movie has talent who are you to criticize a movie that was made by famous directors and producers? i mean you must be watching some crappy version because if you had a proper version you wouldn't think its some low resolution game graphics..this movie is for people who enjoy hongkong cinema the other side to what Asian people enjoy watching.. you are such a sellout.. hongkong cinema is totally different to that of Hollywood, hk cinema is in a class of its own...so if you don't enjoy watching movies from hongkong producers don't go and ramble on about how its a waste of time to watch.. just let other people enjoy the movie..and personally I've seen this movie and i love its story and the way it was made..","If the description: ...then the angel flew into the tree demon's mouth, and her golden staff turned into a gatling gun wielding robot which proceeded to shoot down the evil demon birds...sounds intriguing, then this is a movie for you! This CGI infused tale travels between the realms of fantasy and science fiction with a very confusing, but ultimately enjoyable result. The plot follows the exploits of a young monk traveling with an ugly demon, and the love that blossoms between them. Their quest to rescue one of the monk's companions takes them from earth to heaven through time and space.The story is fairly confusing, mainly due to the ever stranger plot twists, so its best just to sit back and watch without trying to make too much sense of things. The movie relies heavily on CGI effects, but no more than the Matrix or Star Wars movies. The two leads are likable, and they encounter many interesting characters along their journey. There are a few tongue in cheek moments, but thankfully the characters don't interact with their audience. Make no mistake, this movie is often very weird, and goes beyond the realm of 'serious' fantasy movies, but it stays away from being too silly, making it a pretty enjoyable experience.","Flattering comparisons have been made between this holiday 2005 special effects bundle and Steve Chow's seminal Journey to the West rendition of the Monkey King legend, a film now over ten years old. While some similarity does come to pass, the awkwardly-titled newer film has more to do with stuff from the first half of this decade, namely goofball comedies like The Lion Roars and Himalaya Singh. And when we tell you that Tall Story's not even as accomplished as those, that should be enough to seal its fate and consign the thing to that dubious realm of half-baked movie projects hovering somewhere between the recycle and bargain bins.Not wanting to be harsh, really, but how can we possibly gloss over a meager story that's clearly never intended to become anything remotely attractive, instead playing distant runner-up to visual stimulants that, quite frankly, not only seem like true lifts out of Tsui Hark's Legend of Zu (2001), but also add nothing to the pantheon of video bonanzas when considering much older fare, to wit Storm Riders (yes, some eight years ago if memory serves us right).Indeed, Tall Story compiles various components in a feeble attempt to sway audiences, but sadly possesses nary a bona fide element worthy of acclaim, save perhaps for the surprising amount of gore evident throughout. Considering its kid-friendly rating, one must surely feel satisfied with the producers' decision to go ahead and include several instances of such sheer carnage.The main issue with Jeff Lau's latest project is that, unlike his own heartfelt but humorous Chinese Odyssey 2002, Tall Story plays out a connect-the-dots scenario, thus leaving folks with almost no tangible merits to cling on to. And with its focus on effects not coming up roses due to their rather formulaic execution, the movie perhaps could have hoped for increased reliance on a strong cast. Alas, it has none.Nicholas Tse flies in from leftfield in his second release of the season, hot on the heels of also-ran, likewise-failed The Promise. Here reformed rebel Tse plays naughty Buddhist monk Tripitaka, on a pilgrimage to hallowed city Shache, which turns out to be yet another stereotypical portrayal of what moviegoers in China today are supposed to expect India to look like. Thus, the place comes nestled around some hills and you get people dancing in the streets to the merry tune of off-screen snake tamers. Whoa, as Neo would probably have quipped.Tirpitaka's in town with his apostles, or hangers-on, questing to obtain ancient knowledge on their way to nirvana. The three stooges accompanying him (Steven Cheung, Chen Bo Lin and Kenny Kwan) could have passed for the Monkey King's posse were they actually good for anything, but as the picture stands all receive very little play and produce next to no effect.Later monk and holy city come under attack from nefarious evil forces known as the Tree Spirits, although they don't mind being called Insomnia, 'cause that's the baddie from Legend of Zu, their obvious source of \"inspiration\". At least these mean, ugly bastards look passable on screen, more than can be said for much of the film's video contingent.Literally shot out of harm's way, Tripitaka falls into the custody of a deviant clan of reprobate imps, especially assigned caretaker Meiyan, who's under orders from her mom to eat the pilgrim for his fountain of youth-like flesh. Meiyan's cavewoman visage should be enough to send anyone packing, and we're meant to observe her as the embodiment of everything repulsive (played by Charlene Choi of Twins, and hey, we're not saying anything). Naturally, as the would-be plot progresses, that turns out to be quite misleading.Mostly, the bulk of this story revolves around Tripitaka and the nasty, devilish imps as they try to subvert him away from righteousness. This leads to numerous gags and routines that truly arrive at scant funny conclusions. Even likable Isabella Leung (Bug Me Not) makes no difference at all.Other influences on the story include a spacefaring, aristocratic beauty (Fan Bingbing) who returns to earth in order to combat the overzealous Tree Spirits with her armada of googley-eyed Ultraman clones. Again, these guys do look OK, and also serve to garnish Tall Story with its much-vaunted SF categorization, something most genre-purists, understandably enough, have been balking (and hurling) at.Additionally, we witness one slightly courageous scene where Tripitaka, a prettified Meiyan (now looking like Charlene Choi minus the heavy makeup, and hey, we're still not saying anything) plus everyone else takes on the Yellow Emperor himself. On the off-chance Lau wants us to deem it as some sort of sly political comment, well, all the more power to him, but it remains highly doubtful.That about sums up the extent of A Chinese Tall Story, and here's hoping the next one soars taller. It's too bad the last big HK release of the year doesn't deliver on its promises of action, laughs, frights and CG superlatives. With a bland, often dragging, storyline, characters that don't really go anywhere and sights of a distinctly average persuasion, we can't honestly issue a recommendation, and it doesn't matter if the folks involved in this project wanted it to come out right and gave their best.And shouldn't it have been a tall tale, anyway? Rating * * 1/2","Right this may be the wine talking but this could be the best movie I've seen in a very long time. Granted I spent much of the first half an hour wondering what the hell was going on but once I had accepted that I would never understand everything from the subtitles I was able to enjoy the film.Can you really hate a film where a staff turns into a flock of birds that defecate over the enemy? What does character development matter when faced with a lesbian alien princess whose people built the pyramids? Why does Buddha wear seriously blinging diamond earrings? Does any of this matter when faced with the sheer sumptuousness of the visuals and the sly humour of the characters. Any battle for my heart was won once I saw the main protagonist dressed as spider-man - awesome! Many people will complain about a lack of story cohesion but for a fun movie to laugh about with a bunch of mates you can't do better, especially if you do an alcoholic shot every time someone says \"I will love you 10,000 years\".","Another go round with the monkey king going west....sort of.Beginning in the middle of some action the movie just goes from the first frame onward.A monk and his three disciples go to a town to get the sacred suras that will bring peace to the world once they are translated and spoken to the world.But an evil force has intervened and kidnapped all of the children of the town. The evil force wants the monk because if you eat him you will live forever. The retainers battle the forces of darkness before forcibly sending the monk off for safety (The monk thinks he can win simply by reasoning with the bad guys). The monk ends up with a bunch of lizard imps who plan at some point eating him... however the bad guys arrive and he's off an odyssey with the ugliest of the lot.Can a movie that starts off the rails go off the rails? Don't get me wrong I really liked this movie but its so scatter shot and all over the place that plot and logic simply fall away as some scenes simply pick up mid action with no way of knowing how we got there (The final battle to rescue the disciples is completely out of left field). This is one of the messiest movies I've seen in a while, but it made me laugh and smile like no get out. The movie starts and you have no idea where things are and then whats on screen is either interesting or funny and you just go with it. How do we get from thing to thing is often beyond me. Its full of odd asides and strange references as we go from heaven to the ocean to space to the rib cage of some mythic beast to god knows where. This movie floats all over the place which helps keep it fun since you don't know where it will end up (and is the reason\"m keeping details to a minimum) And its funny. Very very funny at times.And the action is very good, even if a good chunk of it is unabashed CGI animation (which provides for some cool images, the golden staff, the spider attack formation, the angel in flight...) And its very touching. Action and comedy aside this is actually a wonderful love story. Its the story of an ugly imp and a monk who end up falling in love (and having other complications). Its a interesting look at the nature of love and what is true love. You will be moved.However much I enjoyed it I was still annoyed by its scatter shot construction. The films inability to hold its ideas together and to tell a complete story really hurts the film and takes away from the enjoyment every time we get to a bump in the road. the bumps take you out of the movie itself and make you realize how much is being cribbed from other sources.Absolutely worth seeing since it does have many choice moments, just be prepared for some bumps and you'll have a good time.","This film was adapted from the well known sutra on Journey to the West where a monk with his three students seek out to find a long lost book with regards to the teaching of Buddha.Though this movie is not as solemn as the previous films made according to the legend, it did however, managed to bring in romance and fun-filled humorous scene.This real objective of this movie revolves around more on the monk who were primarily saved from being eaten by demonic flying creatures. One of his student, the Monkey God managed to get him out from the battle in the nick of time, but were in turn captured by the demons and cast into the deep throat of a dragon, locked up in that particular dungeon.The monk awoke in a small village where he found Mei Yan (the so called ugly serpent daughter) who fell in love over him at first sight. Though ugly, she did not let her appearance be casted aside from getting to him. However, a quest for rescuing his three students soon turn out to be filled with obstacles and each of which turned out to get worse with Mei Yan following the monk. Problems crept deeper and this is where conflicts between the relationship gets worse.The rest of the tale would be left at your own disposal, but suffice to say, this film does not depict the typical storyline of the book, it is more for those who wants to seek out for a funny and light picture of what Journey to the West and the love obstacles really mean.Towards the very end, the whole summary could be described with only one word, and that is love. The monk went to show the Heavenly Gates, the Celestial Palace and Buddha himself how love can overcome even the worst fear of all and deemed fit as the most powerful weapon that can be used against any enemy of superior powers.A wonderfully created and funny acts awaits those who buys this ticket. There would be of course, no regrets, at least from my side and those who were with me at the cinema that day watching the same film.","Is this a game FMV or a movie? In all honesty, I watched this one out of \"choice-less-ness\". It is a very big waste of time and money.It seems HK movies are heading in the opposite direction of the rest of the world.Try to put more effort and money into a production and make us want to watch, rather than something you want us to watch.The graphics are so horrible than they looked like something out of the early to mid-90s low resolution games (in comparison to today's).The way they made this movie is almost exactly what they did in the 90s' Wing Commander game, namely the third installment of the series. Stop regressing and make us Asian look so bad at this compared to the big guns in Hollywood.Sure! They have big budgets and better actors. But we have some of the oldest histories, the myths and the legends, the best technophiles and possibly the largest computer graphic talent base in the world! So what went so very very wrong? Did you start using the same old companies that have been working with you for so many films?! Please stop wasting our time and money. This is the reason why HK movies are heading downhill so rapidly. Didn't you claim to be the Hollywood of the Orient? Guess not.","First there was Tsui Hark's Zu Warriors (2001), which is visually ground-breaking, but much lacking in the acting and writing departments, now this movie, which is visually almost as good as Zu (though no longer ground-breaking), but is even worse in the acting and writing departments. It's really sad that there seems to be an almost complete lack of acting and writing talents in the HK movie industry. I guess you need to understand Cantonese to understand how bad and vulgar the dialogs in the movie really are. It's like some delinquent kids talking in the street, it's that bad. To make it worse, the actors and actresses themselves look like delinquent kids, and can't act even if their life depend on it. I understand that this movie is supposed to be a comedy aimed at the younger generation in HK, but has HK youths really become so brain-dead that they can't appreciate anything but such juvenile and vulgar acting/writing? If that's the case, it makes me ashamed to be from HK.I wish HK movie makers will learn some lessons from directors like Zhang Yi-Mou or Ang Lee, and finally make a movie that's both visually stunning as well as competent and mature in the acting and writing departments. And stop using young singers/idols/heartthrobs as actors because they can't act however many fans they may have in HK!","Lovely sets,spectacular action choreography and costumes","It borrowed scenes from LOTR, Matrix, Star Wars, etc. The humor is so dry, contrived, and corny, that you can't help but laugh occasionally at its inanity and the fact that you are watching it. Exactly what you'd expect from an HK comedy. The average person would enter with an IQ of 100 and leave with less than 80. Stephen Chow is an obvious omission from this movie. The humor would have worked better with Stephen. The Mandarin version of this movie is not as good as the Cantonese original. The graphics are poor compared to its Hollywood counterparts. There is overdependence on low quality CG. My biggest complaint is its ending. The origin of the white horse is so clearly described in the \"Journey to the West\" (JW), that this alternate explanation does not work well with story line. Despite its many flaws this movie has far more entertainment value than the other movie Nicholas Tse starred in--The Promise."],"review-user":["george-844-384633","himboy32","sendoh15","andoarviernes","petedelite","gwailo247","Adorable","Sloathgirl","dbborroughs","symeon_chiam","darkmax","MooovieFan","StarEntertainment","mail-kan"],"review-date":["2 July 2014","21 April 2006","25 May 2007","16 May 2017","12 January 2006","28 April 2006","1 January 2006","23 November 2009","10 March 2006","31 December 2005","5 January 2006","12 March 2006","31 July 2018","9 January 2006"],"review-rating":["8","9","10","10","8","6","5","10","7","8","2","4","8","3"],"review-title":[" Monkey King meets Star Wars!\n"," Hayao Miyazaki Meets Wong Jing!\n"," Confusing but one hell of an entertainment.....\n"," Donkeys don't appreciate honey\n"," pretty good movie pity some people have no taste\n"," ...and then the movie got really weird.\n"," Few Feet Short of a Goliath\n"," Amazing but confusing!\n"," Off the rails comedy/action/romance is full of wild action and humor but is wounded by a disjointed narrative that starts and stops at will\n"," Unexpected!\n"," What is wrong with Hong Kong Movie makers?\n"," Another visually pleasing but otherwise silly HK flick - what a waste!\n"," Super fantasy\n"," HK's Scary Movie\n"]}