{"review-url":["http://www.imdb.com/title/tt0468442/reviews"],"review-text":["In the midst of a documentary about his parents, the filmmaker's mother dies, but he continues making the documentary, discovering a story he did not anticipate. The result is an absorbing drama that has the quality of fiction in the best sense of that word, where a likable but unknowing narrator unwittingly privileges the audience. The narrative thus has a double weave, the story of the documentary and the story of the documentary-maker.Our admiration is with the filmmaker, not only for doggedly pursuing his story though it risks his entire notion of his parents' relationship, but also for never giving in to sensationalism or melodrama. Although the stuff of Hollywood lurks in the details, Doug Block treats the story as he would everyday life. For those of us who have always speculated about our parents' life before we came on the scene (or after we arrived, but while we were too self- absorbed to notice they had a life independent of ourselves), 51 Birch Street gives fair warning: There are wondrous things back there in fatherland, but beware if you choose to enter there.But that caution is for the audience to go slow wandering about in the details of their parents' past. It is not a warning for those offered a glimpse into the life of Block's parents. The film is a marvel at making the mother come alive as a vibrant and passionate yet introspective person who makes her own conscious decisions during the 50's. The filmmaker's particular success is to make the viewers actually see the young woman behind the elderly parent and grandparent. We all know our parents were once young and vigorous, but in 51 Birch Street, the mother is. The father who has been distant while the filmmaker and his sister were growing up ultimately remains distant in the film, but that is due more to his own elusive nature than to his portrayal. This biography turned autobiography is dramatic, intense, and unforgettable, sure to send viewers scurrying for a closer look at their own family albums but more hesitant about looking at the backs of those photographs.","I always thought my father had a second life and was eagerly awaiting the development of 51 Birch Street when I sat down and viewed it for the first time. Amazingly, this movie's journey took me to places I had not expected and made me rethink assumptions and judgments.Truly a remarkable personal story told in clever but straightforward manner. I especially enjoyed the film maker's use of pulling out the type of his mother's daily diary - very effective. I read the previous comment and wish to note that the sound was fine when I watched this and suspect either the film was changed somewhat or the theater could have contributed to the poorer quality of sound for the other writer.","This is definitely one of the better documentaries I have seen looking at family relationships and marriage. I saw \"capturing the friedmans\" a short while ago and have to admit I thought this was better.The story is not an incredibly shocking one, but it is a great examination of trapped personalities and relational cold war. Block deftly guides the viewer through diaries, family footage and after-the-fact interviews; his interview style is sensitive and probing, and his insights are clear and measured.51 Birch Street is a great examination of personalities and relationships over 40-50 years of social change, the social fallout, and potential for redemption.","This film took me by surprise. I make it a habit of finding out as little as possible about films before attending because trailers and reviews provide spoiler after spoiler. All I knew upon entering the theater is that it was a documentary about a long married couple and that IMDb readers gave it a 7.8, Rotten Tomatoes users ranked it at 7.9 and the critics averaged an amazing 8.2! If anything, they UNDERRATED this little gem.Filmmaker Doug Block decided to record his parents \"for posterity\" and at the beginning of the film we are treated to the requisite interviews with his parents, outspoken mother Mina, and less than forthcoming dad, Mike. I immediately found this couple interesting and had no idea where the filmmaker (Mike & Mina's son Doug) was going to take us. As a matter of fact, I doubt that Doug himself knew where he was going with this!Life takes unexpected twists and turns and this beautifully expressive film follows the journey. It is difficult to verbalize just how moved I was with this story and the unique way in which it was told. Absolutely riveting from beginning to end and it really is a must-see even if you aren't a fan of the documentary genre. This film will make you think of your own life and might even evoke memories that you thought were long forgotten. \"51 Birch Street\" is one of those rare filmgoing experiences that makes a deep impression and never leaves you. The best news of all is that HBO had a hand in the production so instead of playing to a limited art house audience, eventually, millions of people will have a chance to view this incredible piece of work. BRAVO!!!!!!!!","For those who still prefer films focusing on human relationships, 51 Birch Street is a must see.By training the spotlight on his own family, Block covers terrain that is off-limits for most filmmakers. He explores a common but often unspoken family dynamic and does so without resorting to hyperbole or sensationalism. In fact, the film is deceptively low key at the outset. In addition to providing a probing look at one family - and, by extension, every family - Block has also chronicled a very specific period in recent history. I don't know if this was intentional, but unavoidable due to archival content.Highly recommended.","Watching this film caused quite an emotional reaction. This is what today's documentaries are all about. It's refreshing to watch something so personal, honest and real. Mr. Block's thoughts, opinions and disclosure are rarely seen these days and are incredibly well displayed here. It's a fine line to walk between personal truth and exploitation. This film treads very carefully and quite successfully.One would think that learning about how a seemingly normal couple falls short of society's expectations would give birth to pessimism...but it doesn't. Quite the opposite: it made me feel good. I feel that I now know more about marriage...about women.Definitely check this out, it'll make you think - exactly what a good documentary should be designed to do.","This is a really great film! It gets you thinking about your parents. How we all have fragile relationships we all have with them, unless we really make an effort to know who they are as people. And just as important, we should remember to open up and show them our real selves, not just who we think they want us to be. Definitely see this documentary! IMDb is making me write more text before they will post my comment, how odd. Usually online comments need to be short short, and here I am being asked to write more! Well I went to see the film with my parents, I thought afterward they would want to talk about their parents, but my dad kept wanting to talk about himself and things in his life he feels he screwed up, which was unusual, my dad is not a reticent man, but I was surprised that he wanted to talk about mistakes he thinks he made. Mike and Kitty came to the film to do a Q & A and there was a hilarious moment afterward when my dad was talking with Mike, while my mom spoke with Kitty! Really just disregard my last few sentences to pad this comment, and just remember '51 Birch Street,' go see it!","This film is remarkable in how unremarkable it is. This is the true story of one woman and one man and their quest for happiness amid the dull, rote life of a housewife and \"man of the house\". It could be any couple, any family, in any town... but that's what makes the story so moving. It touches each of us in some way and reminds us of someone we know and love, or of ourselves. I laughed, I cried, I couldn't stop thinking about it... and what more could you ask for from a film, really? Especially a documentary. This is an excellent film and one that I highly recommended to anyone who enjoys documentaries, stories about families like yours, stories about love, life, parenting, loss, expectations, soul searching, yearning, wandering through life and finding your way, or not.","A fascinating slice of life documentary about a husband and wife and their marriage told through the eyes of their son. We all like to think that our parents lived happy lives, that their marriages were full of fulfilment, love, and happy memories. Sadly many of us know this not to be the case of their own families and that of their parents. This wonderful little documentary is told through the camera lens and emotional perspective of the son of a family that has just experienced the death of their mother. The son being a documentary film maker has filmed his elder family for many years, for as he states \"posterity\". Three months after the death of his mother his father remarries his long time secretary. The suddenness of this occurrence stuns the family and pushes the son to dig into the past lives of his mother and father. What he reveals is a fascinating look into the lives of two rather ordinary people who like so many of their generation married early for the wrong reasons and found themselves stuck in a family life where they found they just had to \"make do\". A wife who found herself at times bitterly lonely and unloved and a husband who buries himself in his work. She and intellectual at heart, he a much simpler individual who seems to find most of his pleasures in the quiet solitude of work. They are obviously wrong for each other, this much is clear. Yet they stick it out, for what? Well that's part of the mystery, they clearly show affection for each other at times if not ever much love. You won't find any truly shocking disclosures here, aside from infidelity on both sides, which in good part is what makes this such a gem. You really feel that these could be your own parents if circumstances were different and indeed makes one question the lives of ones own parents.","Fantastic documentary. A movie within a movie. I'm so glad Block forged on after his Mother's death. Makes one wonder about the time and money spent in therapy. What might have happened if she didn't have that outlet? Did the therapist help her or just foster a dependency that kept his bank account flush? The audience needs to understand that divorce was less of an option in those days. She was a housewife - went to therapy instead of going to college or job training. She seemed to feel trapped by the situation. I wonder if the therapist ever tried to get her to think about what she could have done to change her situation and free herself? Meanwhile, wife #2 was just the opposite. She was out there, working with his Dad; ended her bad marriage, supported herself and appears to be a very confident, giving person. Whatever the state of the marriage, the Blocks did something right in raising 3 kids who could look at their parents' story, be OK with it and share it with us and maybe lead us to start conversations with our parents and spouses.","Doug, First, I want to tell you how brave I think you were in your willingness to separate your mother from the woman she was. As I watched and looked back upon my life with my parents (both deceased now), I am still not willing to view them as anything other than my parents. Secondly, I am so happy that out of something so devastating (losing a parent, particularly your mother) you received something good... a new appreciation for and a better relationship with.. your father. My father and I had the connection, and my relationship with my mother was always difficult. When he died, the revelation to me was that they were not the Unit they had presented to the world, there were things that he did that they both took credit for, and when he was gone, my mother seemed happy to live out her the rest of her life alone. Your film was sad but not bleak, warm, intelligent, and you brought a lot of yourself to it, and I believe I have an appreciation for who you are in it, a kind man like your father. I also cared very much for the people in the film, your sisters, your family. The film was, overall, uplifting, a tribute to both your parents, and I enjoyed it very much. Thank you for making it. I hope you experience great success both in your marriage and in your career.","The director seems like a good, solid man. His parents struggle with the same issues we all cope with. They strayed from each other. They loved each other. They misunderstood each other. And the poor audience has to sit through ninety minutes of what is possibly the trials and tribulations of one of the most boring families ever to come out of Long Island.There are few interesting choices in this documentary--the music is banal, the filming uninspired, and the story is the same story that has played out on every Birch Street in every town in America. I don't mean to sound too harsh--seldom has a sweeter, more well-intentioned documentary been made. The director is the kind of man with whom you'd want to be friends. You just wish he had struggled as much presenting the material as his parents did keeping their marriage alive.","I started watching the film and wondered \"What sort of man marries someone else when his wife is barely cold in the ground?\" By the end my heart was a little sadder and my soul much wiser.It was a fantastic, and beautifully candid, piece of film making.I really hope that by the end Doug realised (and I hope feels) that his father, Mike, really did/does love him, and was very proud of him.The thought this has left me with is - At what point do you call your failing relationship quits? Mike and Mina's relationship appeared to be incredibly complex with Mina's affairs of the heart, and the mind, being a hugely impactive factor on the overall tone of the relationship.From it outside looking in it appeared that Mike spent 54 years doing what was right by his wife and his family regardless of his own feelings.It proves that you cannot judge without the facts, and in fact should not judge at all.","After seeing the movie, I feel the father and the mother are both reasonable person, although not perfect at all. On the contrary, I don't like the author, and his two sisters.Is a person's journal an accurate portrait of herself? No. Most of time people only write problems in her journal because she want to solve the problem. So a journal is always a more negative side of a person. In this movie, the author judge his mother's life by her journal. Not a wise choice.The author's elder sister is so ugly, external and internal. First, she said her father's second marriage is \"not fair\" for her mother. Then, she said she doesn't love her mother. So, she don't love both father and mother. I doubt she love anybody in the world. Her face is so ugly, just a reflection of her heart. Through out the movie, I feel the author and his sisters are lack of love and respect to their parents. However, I feel the father are mother are very loving to their children, even the author try to portrait them as cold, deceitful person.","This documentary is rife with problems.How arrogant is it to make a documentary about your own family? I understand you think the subject is interesting. I was bored with it. This isn't a fascinating story to me, and I don't know why you would think it was.I don't want to come off as mean, but I have to say: Most of the people in this film are just not attractive. And that's OK, not everyone is pretty. But your camera technique, to stick the lens in their face so you can't help but be overwhelmed by their unpleasant appearance because it is filling your 47\" TV, is not enjoyable. I had to put my hand up half the time to shield myself from the warts, wrinkles, bags under eyes and yellow teeth. Really, I'm trying not to sound inhuman, but pull the camera back so its not like total strangers are breathing in my face.The camera work in this \"film\" is rank amateur level. It's the kind of camera work you see from everyone with a camcorder at a family picnic. Uninteresting framing, unsteady, even static shots are done carelessly. Put a little effort into it, if you're going to do this for a living.I honestly can't see what the big deal is about this thing.","I saw this movie at the Philadelphia Film Festival today and enjoyed it overall. It is an interesting and adept analysis of the all-too-common revelation that our parent's marriage was more flawed and difficult than we originally imagined. In addition, this movie is an excellent example of process of discovering truths about our parent's lives after their death and the issues associated with that. However, i found the sound quality (recording and editing) to be relatively poor and annoying. *** It may very well have been related to the specific theater and projection conditions *** i am not a film maker / student or anything and claim no real understanding of the sound production process, but as a consumer, i found the audio portion of the movie distracting. Specifically, i heard very unpleasant lip smacking noises through out (especially one long interview with the younger sister) the film, and often the background noise level was higher in volume than people's voices (for example the scene when a small group was sorting through the mothers papers). has anyone else seen this movie, noticed anything about the sound... thanks"],"review-user":["friedt","rgwright1","darrenr-4","anasamas","dpalpert","badhatharry","saraboothyo","drichmond123","Locut0s","scotpond","klscribe-885-448363","Laight","LadyCoops","new859","bureau203","yannii"],"review-date":["25 March 2007","6 July 2006","20 July 2006","18 November 2006","17 October 2006","15 January 2008","16 November 2006","24 September 2007","14 January 2010","27 July 2008","31 October 2010","19 November 2006","21 February 2011","6 July 2009","13 October 2008","6 April 2006"],"review-rating":["10","9","9","10","10","10","10","9","8","10","9","2","8","4","3","8"],"review-title":[" the biography turns into a fascinating autobiography\n"," Loved this film\n"," clever, sensitive, insightful\n"," *****Highest recommendation*****\n"," Riveting Exploration\n"," Great documentary!\n"," Great Film\n"," Remarkable\n"," No marriage is perfect. Some are less perfect than others.\n"," A movie that could start deep conversations on a lot of subjects\n"," Warm, human, uplifting and highly entertaining.\n"," Sweet, well-meaning, and boring\n"," Thought Provoking\n"," not appropriate subject\n"," Thoroughly unpleasant\n"," Thought provoking and touching, but sound quality was annoying\n"]}