{"review-url":["http://www.imdb.com/title/tt0470000/reviews"],"review-text":["In 1913, in Carlton Mine, Addytown, Pennsylvania, the cruel owner of a mine uses poor children in the exploration and after an explosion, a group of children is buried alive. On the present days, Karen Tunny (Lori Heuring) has just lost her husband after a long period of terminal disease when the family savings have been spent in the treatment. Without any money, she moves with her daughters Sarah (Scout Taylor-Compton) and Emma (Chloe Moretz) to an old house in the mountains that belonged to her husband. Karen is advised by her neighbors to stay at home in the night, and Sarah hears that there are zombies in the area. When Emma becomes friend of Mary, he mother believes she is an imaginary friend. However, when Sarah's friends are attacked and eaten alive by zombie children and Emma vanishes, Karen and Sarah chase her nearby the mine.\"Wicked Little Things\" is not a totally bad movie: the acting is good; the make-up is creepy; and the cinematography and the music score are excellent. However, the story, and consequently the screenplay, are very weak, indeed a bad collection of clichés. The beginning is reasonable, with a widow moving to a house in a remote location because the family spent all their resources with the illness of the patriarch. But when she arrives, coincidently the little zombies attack people without any consequences, for example, families do not search the missing persons. Then the wicked Mr. Carlton comes to the place with the most disgusting attitudes, a typical clichés that he will die in the end. There is no explanation why the children attacked innocent people and why they should stop after killing Mr. Carlton. When Sarah is running away with her mother and says that she is tired and cannot run anymore, it is one the most stupid lines that I have ever seen in a horror movie. My vote is four.Title (Brazil): \"Zombies\"","I'm guessing that the folks talking up this drivel are cronies of the director or something. This is bad, and not in the Michael Jackson song kind of way. To compare the pacing of this movie to the progress of a snail would be to insult the snail. This movie limps along for what seems like an eternity, all to introduce us to some un-scary zombie kids with silly makeup and some sort of vendetta, or thirst for blood, or whatever. Believe me, you won't care. The thought alone that Mom would move her two daughters into this dilapidated and FILTHY home is absurd. And worse, I found myself simply not caring. Backstory about the zombie kids? Snore. Endangerment of Mom and/or daughters? Don't care.In short, WOW was this dull. Don't bother.","I saw Wicked Little Things as part of the \"8 Films To Die For\" Horrorfest, and this was the only film that disappointed me. To wit, a mom, her little girl and her teenage daughter settle down in an abandoned house in the Pennsylvania mountains. Every night, however, the vengeful spirits of children killed in a coal mine run about and slaughter anyone they find.I guess the director was banking on his viewers being repulsed that children would be capable of pickaxe murders and eating human flesh (of which there are lavish close-ups, as a nice homage to George Romero) because the film just isn't scary otherwise. Simply put, there are far too many establishing shots of the evil kids jogging to their next murder site. If someone's gonna get it in the barn, there will be a shot of the kids ARRIVING at the barn (oh the suspense) and then moving in for the kill.Come to think of it, why do the kids suddenly walk SO SLOWLY when they corner their prey? And not that I have any experience in this, but I think a shotgun blast will throw a child A LOT FARTHER than this film implies...? Nor does it help that the mom is one of the worst parents I've ever seen in any film. \"The lock on the front door is busted\"? You have an EIGHT-YEAR-OLD DAUGHTER in the WOODS with BEARS and MOUNTAIN LIONS! FIX IT, you MORON!!! Plus, Mom and her oldest daughter look waaaay too close together in age- even for a teen pregnancy, and there's a pretty unbelievable death which involves sneaking up on somebody trying to push a car out of the mud with their butt.I'm giving this a 3 because it tried. As a splatter film it's not bad. But for good scares, go elsewhere.","Great camera work. Great set work. Great acting. The story is every cliché from the hard starting engine, the kooky locals, the 4 teenagers in the car hearing a noise outside, on up. But I think if we are honest with ourselves... it is what we want from a horror movie. The cliché haunted house.... the dark woods. But the zombie kids... they are about as creepy as a bunch of french mimes. Ignore the fact that they look like school children in their Sunday best and not mine digging zombies, enjoy the atmosphere, watch it in the dark, and it is definitely worthwhile.But don't look for any originality here. I mean none.","A young widow and her two daughters move to a new house in a Pennsylvanian mountain town. Soon, her daughter's imaginary friend starts to let the family know she's just a little too real.This movie was enjoyable. I liked the characters (especially the older daughter and the neighbor Hanks) and the situations. The atmosphere was perfect and dark, as one would expect from a movie about zombies roaming through the woods. And the pacing was decent, revealing the story in a good speed.The gore was decent: not over-the-top, but not ignored. Entrails are eaten and heads are smashed in. Sure, it's not as cool as \"Necromantic\" or \"Anthropophagus\", but it's alright. (Actually, since most of the film was so blah and standard fare, this Goldilocks level of gore should be no surprise.) Some blood scenes were welcome and I could have used more.But this film is also riddled with countless clichés. An imaginary friend who might be real. Single mom with daughters moves to new town. Vehicles that won't start. Tripping in the middle of a running scene. I could probably go on.Some good can be said. Chloe Moretz is really blossoming into a supreme actress, and this early work deserves to be seen. Scout Taylor-Compton is another genre favorite. And the DVD has audio commentary with director J. S. Cardone and actress Lori Heuring (though I haven't listened to it yet), so that's an extra treat for those who do enjoy the film.I found the movie too \"polished\": the target seemed to be Hollywood and teenage girls, rather than those who would go to see a film festival called \"8 Films to Die For\" (which is where I saw this). The dirty, gritty scenes were just too clean. Sure, the movie was dark... but dark in a very sanitary way. (There are better ways to word this, but I don't know what they are.) If you don't see this film, that's fine. More than likely it will fade into the background and within a few years won't even be found on video store shelves. You'll see it on Netflix and be like \"what is this?\", but don't bother ordering it... for all the film lacks, it will probably lack even more in a few years as it becomes stale (if it hasn't already).","Even with the low standards of a dedicated horror fan, I found this film to be beyond awful. It was a huge disappointment since it was featured as one of the eight Horrorfest films. I can only hope the other seven were better. I was actually embarrassed for the friends I was able to convince to see this, and these are the same friends I made watch the remake of The Wicker Man. It has every cliché in the book. In fact, it went out of its way to include them. Let's start with the characters. Instead of one young damsel in distress, we get three: the single, hot mom with two daughters a blossoming yet brainless teenager and a cute yet simultaneously creepy little girl that you just know is going to have 'special' skills including supernatural knowledge and the ability to communicate with the dead. The little girl is the same one that was in the remake of The Amityville Horror. She was a little annoying but not nearly as irritating Dakota Fanning.Overall, these characters seemed like escapees from a LifeTime movie. I thought perhaps horror movies had moved on from scenes where the female characters go to bed in full makeup and run around in the dark announcing their presence to anyone with ears, but not this one. I also find it inconceivable that none of them could be bothered to secure the front door from arbitrarily opening day and night. To give you an idea about how uninvolved I was with these characters, I spent most of my time thinking about how cold it must have been on the set because everyone was in a coat even in their houses and how white their teeth were.Despite all the formulaic plot machinations, the film does not build any suspense at all except to wonder when it will be over. There is more atmosphere at the local Giant in the middle of the most mundane of weekday afternoons. As for the dialogue, I could have sampled quotes from ten other films and cobbled together better, more believable discourse. The gore level, the eye candy for a horror fan, was minimal at best. Without their tiny weapons, the 'zombies' were not menacing at all. You could probably drop kick a couple of them across the room.What really kills it is its banality. Horror films, more than any other genre, cannot survive uninspired mediocrity. Give me a horror movie that is comically inept or outrageously over the top with gore. I can even take the new ones with their cringe inducing torture. Every once in a while I'd appreciate a truly frightening one, anything but this.","(May be slight spoilers of random silly plot points, but nothing major) This movie opens with a horrible disaster that leads to the death of a bunch of little brats. Flash forward a few decades later, and we have a widow (Lori Heuring, terrible as ever) and her two daughters moving to a creepy old house in the middle of the woods. Apparently her hubby owned (err...leased) this property and she never knew about it. Guess she thought that $500/mo was going to his porn addiction! Anyways, the obnoxious teen daughter (played by the deliriously awful Scout-Taylor-Compton, who will be the star of the upcoming Rob Zombie's Halloween) hears of local legends about killer kids that stalk the woods at night. Creeeepy! She doesn't believe them, but her lil sis befriends some little ghost girl named Mary, so maybe it's true after all? Hell yeah, the legends are true, which she finds out while necking with the buddy of some guy who sexually harassed her the day before. And boy, these little tykes are P-O'ed! The attack scenes are really gross and funny, and the faces on the child actors are priceless. Apparently the kids are after one person in particular, but kill other people too just for ha-has. Who wouldn't? And Mary isn't a threat to the daughters because apparently she's their great-aunt or something. Stupid movie, but amusing enough to warrant a rental. One of the \"8 Films That Could Only Get Distribution as Part of a Package Deal.\"","The concept of this movie is pretty compelling: zombie children climbing out of an abandoned mine to seek revenge for their deaths in the backwoods of Pennsylvania. Cool. The problem I had with the movie is the lack of creativity when dealing with the zombies. The makers could have really spiced this film up with some terror-like imagery a la \"The Ring\" such as stop action, reverse camera walking or stuff like that. When the zombie children are strolling through the woods they look like a bunch of 9 year-olds walking to a playground in West Philadelphia. Instead of pick axes and shovels they could have easily been carrying baseball bats and gloves. Why would I fear these little kids? Anyone could just run away in a straight line to safety. Also, who in their right mind would have stayed one night with their children in that creepy, run-down house? The moment I opened that front door and looked around I would have said, \"Mm-hmm. Mm-hmm. Son, go start the car. I'm going around back to pee on a bush and then we're out of here.\" Totally unbelievable movie. Don't waste your time.","I thought Wicked Little Things was a really good movie, in my honest opinion. I will say at some parts it seemed really unbelievable, and at others it seemed as if there was just not enough thought put into the actions of the characters, as it became mediocre, but overall it was exciting and entertaining with a nice premise, even though many commenters thought it was boring. I do not understand why so many comments are bashing this movie when other B-movies that are most definitely not better get much more recognition and praise. It's an excellent movie overall, and nothing more or less. Wicked Little Things provides great entertainment and mostly did not have many major flaws at all other than, like I said, being mediocre because of production value. This is definitely worth a look, because you will not be disappointed with the outcome, regardless of what other comments may have you believe and if you know what you are looking for and getting into. Wicked Little Things is one of the best 1st Annual Afterdark Horrorfest films, and compared to a lot of other films in the 8 Films to Die For series, this is one of the best overall. As a movie, it's a darn good one, even though it's of course no masterpiece. It's just fun, and I am glad I own it.","Having spent all of her money caring for her terminally ill spouse, recently widowed Karen Tunny (Lori Heuring) moves with her two daughters Sarah (Scout Taylor-Compton) and Emma (Chloe Moretz) to her late husband's run-down family home in rural Pennsylvania, where local legends speak of zombies who roam the woods at night.Just seeing the names of this film's writer and director in the opening credits was enough to send shivers up my spine: Boaz Davidson is the 'genius' responsible for penning the scripts for such STV titles as Octopus 1 & 2, Spiders and Crocodile, whilst J.S. Cardone gave us the godawful 'video nasty' The Slayer and dull vampire flick The Forsaken. With such dubious talent responsible, I didn't expect much from Wicked Little things.And having just finished the film, I'm glad I kept my expectations low.Although the movie looks good at times, with lovely use of the eerie woodland locale, and the cast give reasonable performances given the clichéd drivel that they are working with, the plot is so laboured, poorly written, and derivative that it's impossible to be enthusiastic about. Most importantly, perhaps, the film's killers, undead children who rise each night from the mine in which they died, aren't in the least bit scary, a smudge of makeup, black contacts and some crappy joke shop scars doing very little to add to the sense of menace. Scout Taylor-Compton and company do their best to look afraid of the tiny terrors, screaming convincingly with every confrontation, but their admirable attempts to instill a sense of fear in the audience is to little avail: the little blighters just ain't got what it takes to chill the blood.There are a few lacklustre zombie chow scenes in a futile bid to win over gore-hounds, and the final kill, which sees the victim's blood drench both Compton and Heuring, is suitably tasteless, but on the whole, Wicked Little Things (AKA Zombies in the UK) is instantly forgettable trash—just another clunker in the filmographies of Cardone and Davidson.","...will, sadly, probably be my last, except if I can find them for free at my library, and if this is, indeed, one of the better ones, I won't really be looking for them with any great enthusiasm. \"Wicked Little Things\" was shot on the cheap in Bulgaria, and despite some decent photography of evocative locations, and some tolerable acting from the likes of Lori \"Runaway Jury\" Heuring, Scout \"Halloween 2007\" Taylor-Compton, Chloe \"The Eye\" Moretz, the always dependable Geoffrey \"Salem's Lot\" Lewis, and Ben \"First Knight\" Cross, the film suffers from a script that wonderfully illustrates Sturgeon's Law (or Revelation, if you must). \"Wicked Little Things\" is part of the ninety percent. In brief, a young family, sans recently-deceased Dad, move into the paternal family home in mountainous eastern Pennsylvania, only to attract the attention of vengeful ghost children who'd been murdered a hundred years ago. There's not a shock or surprise to be found in the entire script; we've seen this stuff a thousand times in far better films. Strictly for insomniacs or those with a high tolerance for boredom. The only thing it left me intrigued by is seeing how well Cross does with Sarek in the upcoming J.J. Abrams-helmed \"Star Trek\".","I really wanted to like this movie. A film with zombie children getting out of a mine to kill people at night really seemed like a great idea for a horror film. Unfortunately, the film was in the bottom 3 of films played at horror fest.A mother and her two daughters attempt to move on after her husband/father had passed away from an illness that cost their family a lot of money. They have to adapt to their new environment. They end up struggling due to all the surroundings for different reasons.(Crazy Zombie kids go into this category) The film never gives any sentimental attachment for anyone that lives or dies, the film produces no scares or jump worthy moments, the film barely shows the children doing what they're supposed to do...Kill! With a bigger budget and a better cast this film could have hope. Until then, pass on it.3.5/10 actually.","This is definitely the biggest surprise of the festival so far and without a doubt the best the festival has had to offer. I went into this film with little to no expectations after learning that the director was responsible for the awful vampire flick The Forsaken. and I left pleasantly surprised. The film stars Lori heuring of In Crowd fame as a young mother whose husband has just passed. She moves into an old family home in the mountains with her two daughters next to a mine that is a gravesite to overworked children back in the day. Unlucky for them the children return with a vengeance killing and eating everyone in their path. The film works on many levels. It's well done, suspenseful, it has spots of good cinematography and capable performances by Compton especially. The atmosphere is spooky yet slightly underwhelming, the score is decent and the makeup effects are gruesome and simplistic. The film keeps up a creepy and unsettling tone and the kids themselves with pale skin, torn up lips and hollow eyes are pretty scary and unrelenting. The film is original and inventive without being to artsy or complicated. I can't see this film making it into a wide release without some trimming and slight fine tuning. But they definitely have a good product on there hands and should pursue some type of theatrical distribution. However the theatre in which i saw it in was horrible. The sound was dreadfully messed up which i felt took away from the film majorly and it stopped in the middle because they couldn't center it on the screen which killed the mood a bit. All in all though it was the most satisfying of horrorfests entries maybe because it had the least expectations but nonetheless was a welcome addition to genre films.","If you described any of the scenes; nightmares of children murdering you in your sleep, your infant daughter talking to ghosts, searching for your lost child in an abandoned mine at night, so petrified with fear that you can't move even though the blood from a murder victim is dripping onto you from the floor above  then I'd say you had a horror movie. But some how 'Wicked Little Things' just wasn't scary. I am a horror fan and I loved the location, the plot in principal and I liked the three leading ladies. I didn't want to see them come to harm, I wanted the 'bad guy' to get his just desserts, the rest of the cast are always simply cannon fodder so I was indifferent either way with them and it played out every cliché in the book - even down to the torch battery running out in the pitch dark just as you start to here whispering voices closing in on you.I would still recommend that you watch it, but unless you are new to horror movies or under 12 years, you will have seen it all before.","Wicked Little Things has an excellent synopsis: empty house beside abandoned mine in woods with tragic past; family moves into house and strange things begin to happen; little creepy children begin to pop up here and there doing creepy-little-children-things. But that is where the cleverness and potential fun ends. This group of kids was sealed in the mine many decades earlier, and now appear roving the woods (poor make-up) with weapons looking for flesh to eat. Oh I get it, this is a ghost-zombie movie. Hmmm....while I can appreciate someone trying something new with this genre, this just didn't work. What was the children's motivation in seeking to devour flesh? Why did they need weapons? Did anyone else imagine the filmmakers all gathered around the daily footage giggling because they felt this was going to be a cool/scary movie? I found that after thirty minutes I felt the familiar resignation that I had just wasted my time on another modern crap-fest. While the acting was good, and the setting/cinematography of good quality as well, the script itself suffered from what seems to be a lack of knowledge about the supernatural horror genre altogether. A bunch of kids walking down the mall is scarier than this pack of poorly disguised rodents.This movie is not scary, and while I can appreciate the story, perhaps have even enjoyed it if I had read it instead of watched it, I still have to say that Wicked Little Things is more accurately called Wicked Little Turd.","First off, I'am a horror fan. But this \"Tobe Hooper\" production (come on, the man from the original Texas Chainsaw and Poltergeist !!) was below standards, even for a fan. The acting was not bad at all, some characters were unbelievable, but the leading ladies were OK. The story was something we've seen a hundred times already, without any surprising twist or whatever. Never exciting or intense, and do not count on any special effects besides blood splashing up. The scary zombie kids are white paled faces with dark eyes and that is it.. That might have worked in the early 70's but not now. Director J.S. Cardone didn't do a good job in keeping the suspense, half way thru there is a risk you will fall asleep. My vote is based primarily on the leading acting, but this could have easily have been called Children Of The Corn 8: From The Corn Fields to the Mines... Enough said..","One of the few reasons to make these pointlss films is to give some actors a chance to hopefully star in better films if they're acting is any good. The only good thing in this movie is the acting, the three female leads are better than most horror films like this. There's 2 scenes that may cause an unexpected jump.Young small children are use to crawl through holes and lay dynamite to explode mines. When one does collapse causing a cave in all the children die, becoming zombies. The adults in the mine stay dead, no reasons are given as why the children become flesh eaters. When still alive they looked terrified before the cave in, innocent, so they must become enraged at any adult which exploited them int he mines (only reason that come to mind).A mother and her 2 daughters move into a house near the mine, along with a land devoloper who wants to build a resort and another of those creepy people who seem to know exactly what's going on yet no one believes him.Nothing new here, you're usual clichés, predictable, a lot of negatives for this film, very few positives.","I generally love this type of movie. However, this time I found myself wanting to kick the screen. Since I can't do that, I will just complain about it. This was absolutely idiotic. The things that happen with the dead kids are very cool, but the alive people are absolute idiots. I am a grown man, pretty big, and I can defend myself well. However, I would not do half the stuff the little girl does in this movie. Also, the mother in this movie is reckless with her children, to the point of neglect. I wish I wasn't so angry about her and her actions because I would have otherwise enjoyed the flick. What a number she was, take my advise and fast forward through everything you see her do until the end. Also, is anyone else getting sick of watching movies that are filmed so dark. Anymore, one can hardly see what is being filmed. As an audience, we are impossibly involved with the actions on the screen. So then, why the hell can't we have night vision?","If you are looking for a really scary movie, this is not the case. I am always amazed how some directors/producers thinks cliché + dark locations results in good terror movies when it is not so easy.The plot of this movie is not too much imaginative (working kids of a mining complex in the 1900's are killed in an explosion and seeks revenge against the descendants of the mine's owner. A windows with her two girls goes to the house near the mine and you know the rest of it).Dialogues are weak, actors are so so, no fx at all, poor characterization and just a little tension all along the movie, none really scary moment and a dull ending.If you're looking for a light terror movies for watching in a lazy Wednesday night or with friends just for fun of watching a terror movie with your buddies, this is the right choice.","Saw this film in it's early stages in a college Com class when the director was screening it for opinions. Just saw it at Horrorfest, finished. Wow. Very cool. Very different. Great performances all around. Great score. Awesome photography. Story to die for. Touching family issues blended with shocking images. There hasn't been many horror films over the years where the killers are children and these kids are bloody killers. But they still make you feel for them while repulsing you at the same time. That's a very hard trick to pull off. I haven't seen a film like this in a long time. Sad that it probably won't be widely released in theaters but don't miss it on DVD.","All I could think while watching this movie was: \"Will it ever end?!\" It was unbearably boring to watch. I was wishing I could just turn it off, but I wanted to do this review justice so I fought the good fight and withstood the torture of watching this movie all the way through so that you, the good reader, need not bear that pain also.This movie sounds like it has a great premise if you read the premise on paper. However, the actual movie does not deliver on this premise at all.The opening scene features a mineshaft in the early 1900's, where they are forcing kids to carry dynamite into the tunnels that aren't big enough for the adults to fit into. This seems to be setting up the premise for an interesting movie. But after 4 minutes, it becomes clear that is not the case. The adults who committed these crimes are never punished; there is no consequences shown in the movie for their actions. The opening scene is way better than, and completely irrelevant to, the rest of the movie. The last time an opening scene misrepresented a movie so grievously was the opening scene of 28 Days Later which was the only good scene in *that* whole movie. Wicked Little Things/Zombies (a movie so crappy they changed the title to try to disguise it's crappiness and sell it again) is exactly the same in this regard. The opening scene is the only watchable scene in the whole movie.Instead, the movie flashes forward to present-day. A single mother and her two bratty, foul-mouthed kids. Right here is when it would have been wise to press the STOP button and never go near the movie again.In the first hour, the zombie kids are barely even seen. They get maybe 3 minutes of screen-time, total. All they do is kill a pig, that's it. The rest of the hour is spent showing the dumb mother and her dumb kids buy things at the local store, wander around the forest, and have inane conversations with each other. The dumb teenage daughter goes and hangs out with some other idiot teenagers and smokes weed with them.There would be no reason to care at all if the zombie kids dispatched anyone in this movie. Every single character is both dumb & annoying, with no redeeming qualities at all. Not to mention one-dimensional and clichéd.This movie would have been *vastly improved* if the mother and her dumb kids were dispatched in the first 10 minutes by the zombie kids, as they were driving up to their new house, then the end credits rolled. That right there would instantly change the score from 1/10, to 10/10. Honestly! When the dumb mother takes her eyes off the road and almost crashes into a pedestrian on the road, her daughter scolds her: \"You almost killed us, mom!\" Of course, anyone with common sense knows that if the mom had hit the pedestrian, it would be the pedestrian who would be dead --- not the people safely encased *inside* the car. I guess this line was put into the movie to show firsthand that the utter stupidity of the main characters knows no bounds, and runs in the family.Wicked Little Things/Zombies runs for 1 hour and 34 minutes, but it definitely felt like 5 hours or more to me. Trying to not fall asleep was a tremendous challenge. It's not until over an hour has passed into the 1 hour and 34 minutes that the zombie children actually bother to kill any person. Then the scene shows the dumb teenagers drinking beer and making out in a car and saying lines like, \"If you ever wanna get in my pants again, you better start the car and get my ass out of here right now.\" Seriously, that's verbatim from the movie. The teenagers are so clichéd, one-dimensional, badly-acted, dumb & annoying that when the zombie kids finally get around to hacking 3 of them up 1 hour and 5 minutes into the movie, it feels like a cause for celebration. Of course the \"Princess\" dumb weed-smoking foul-mouthed beer-drinking loser daughter of the main mother character gets away scott-free. What a buzzkill that was! She was on the screen longer than the others and hence the most annoying of the 4 of them, and most deserving of a pickaxe to the head. All the more reason why she should have been dispatched within the first 10 minutes, as aforementioned. To still keep her around past 1 hour and 5 minutes though, is totally inexcusable.The reason for this of course is that feature length movies need to be padded to at least 1 hour and 30 minutes. So by keeping her alive long-past when she should be, they have an extra 27 minutes to pad the movie with her and her mother running through the woods. By 1 hour and 22 minutes in, it's the *second* time in the movie where the annoying daughter is trapped in a vehicle where the engine won't start whilst the zombie kids are coming to get her.The zombie kids are completely generic. Never say anything. No character development at all for any of them.In the end, all 3 of the annoying, idiotic main characters live. Which in my opinion, is the filmmakers' way of giving a final flipping the bird gesture to the viewing audience. In my opinion, the filmmakers surely know that they have bamboozled anyone who has had the great misfortune to watch the whole movie. Why not rub their faces in it by not even giving them the satisfaction of seeing any of the 3 main characters who should have been dispatched within the first 10 minutes, die.Avoid Wicked Little Things/Zombies like the Bubonic Plague.","Lori Heuring of 8mm 2 fame is back in the lead with two children in tow. They inherit an abandoned farmhouse way out in the country after her husband dies. Can you already see the set up? Eerie sounds, things that go bump in the night, and bloodthirsty children; all the makings of a Gothic horror film.Just like Pamela in The Tooth Fairy, Emma (Chloe Moretz, currently in The Eye remake) sees and talks to one of the dead children - well, in this case, the undead children.Soon, everyone sees the children and the carnage begins as they are hungry, very hungry. They do not stop until they get the one they are after - the last of the Carlton line; the family responsible for their death. Bwa ha ha ha! Very creepy as most action takes place at night in the woods. A really good zombie flick.Also features one of my favorite character actors, Geoffrey Lewis, who I loved in the \"Highway to Heaven\" episode where he played Fast Eddie.","I'm trying to think of the few films that moved me to tears - you know us stiff upper lipped males can't be seen with a tear in our eyes - not very macho. The first film that achieved this was for me was 'One Flew Over the Cuckoo's Nest' an all-together more serious adventure. So what was it about this lighter weight film, which could so easily have veered into corny territory, which remains, for me, a contemporary classic horror story? - I'm not sure - it could be the sincere performances, it could be the sound track but I think it is probably the way it explores that area of love and horror that goes beyond the boundaries of mortal souls, beyond the realms of this world, a bond which transcends that fragile hold we have on life to an unknown world of hopefully everlasting love. Yes it is gory and it is horror and people get killed, but the real essence of this film is the love that still lives in the souls of these kids. Great work!","Amazing movie. Slightly gory, don't go if you are strongly opposed to seeing a few people get hacked up. But the little kids look SWEET, and the story is definitely cool. Slightly creepy, freaky vibe to it, so definitely a horror movie, but not really scary, as in keep-you-up-at-night, scar-you-for-life type scary. But I thought it was really good, though some people might think the ending is sappy, I thought it was fitting. Yeah, so I definitely enjoyed it but other than the fact that it was kids killing and eating the people, I didn't really understand why it was in \"Horrorfest\", I mean weren't the movies supposed to not have been released because they were too violent and scary? I didn't think that this movie was terribly disturbing, I mean it is slightly graphic at the points when they show the half-eaten bodies and pig carcass, and I guess the fact that these were like 10 year old kids and what not eating and mutilating people could make it so they wouldn't want to release it but I didn't understand why they would say it was unreleasable. In my opinion it is a good movie, and definitely a horror movie, but not terribly scary (as I stated before), and not amazingly graphic and disgusting, which is one of the reasons I liked the movie, because it was not excessively graphic and violent. I also really liked the forest scenes, and the way the kids have no eyes, I think that was cool. Also, I really liked the fact the child miner zombie characters. They weren't corny looking, they looked really, really amazing, in my opinion. I don't know why I thought that. But yeah, my favorite part of the movie was actually was when the mother and here older daughter come out of the mine and look behind and see the one little girl and then the camera zooms out and you see that all of the kids are standing there. Anyways, enough about how cool the kids looked, right? I really liked the feel of the movie, it was scary when you were watching it and not completely predictable, but it wasn't excessively gory, and it wasn't a total letdown when you see the zombies, they actually look decent, unlike some movies. Also, the acting wasn't horrible, like in some movies where no matter how cool you thought the story was, the acting ends up being so bad that you can't stand to watch the movie. That seems to be the case in a lot of horror movies especially, so kudos for that.That's about all I have to say, sorry if anyone who reads this is bored to death by my rambling.","This was a real tear jerker. The performances were excellent. The music was beautiful. This was a powerful movie that teaches us a good lesson. Love is forever. How many horror movies out there deal with a love so great that it goes on even after your dead? I believe this movie is one of a kind. I recommend this movie to anyone who loves a very touching and beautiful and horror movies. A really rare mix of scare and love at the same time. Really well done. I like the story the best and would suggest it for an award. The essence of the idea and the story are all there is to make a good film. This film has this. I am not particularly fond of horror films, but this one is different. The best coming out of this mysterious film festival, that wouldn't sell tickets for its own shows...."],"review-user":["claudio_carvalho","cmsacco-1","the-gil-monster","LovinMoviesMakinGames","gavin6942","amytooty","ThrownMuse","dhooper1972","Dragoneyed363","BA_Harrison","MrGKB","KyleWest","rivertam26","timwebley","mtess-1","homecoming8","gandalf_a_1999","gulffl","charlesdias","darkregion8","Navaros","lastliberal","devon-bracken","nothing_will_breed_nothi","alison-natter"],"review-date":["29 November 2007","22 February 2007","20 November 2006","28 March 2007","22 November 2006","19 November 2006","6 June 2007","7 June 2007","4 June 2008","23 March 2010","14 May 2008","19 November 2006","19 November 2006","3 May 2007","19 July 2007","19 July 2007","27 April 2007","26 August 2007","2 November 2007","19 November 2006","15 June 2008","21 February 2008","19 November 2006","19 November 2006","19 November 2006"],"review-rating":["4","2","3","6","6","1","5","3","7","4","5","3","7","3","3","4","2","1","9","1","6","8","10","10"],"review-title":[" Little Zombies in a Bad Collection of Clichés\n"," Don't believe the ill-gotten hype\n"," A strict curfew upon an Appalachian town is enforced by The Living Dead Dolls\n"," A complete Cliché, and an entertaining one at that\n"," A Derivative Horror Film: Little Imagination, Little Homage\n"," Wicked Boring\n"," Wicked Little Snots\n"," I wasted 94 minutes of my life...\n"," Fun and overlooked\n"," Cardone working from a Davidson script is definitely the stuff of nightmares. But not in a good way.\n"," My first exposure to the After Dark series...\n"," It had such promise....\n"," horrorfest\n"," Works in theory but not in practice.\n"," Zombie-Ghost Children in Bad Makeup\n"," A Poor Man's Children of the Corn...\n"," yet another forgetful horror\n"," Cool if you fast forward all the parts with the mother, she is stupid\n"," Terror clichè for the dozen\n"," Shocking Horror with Heart\n"," Immensely boring garbage that will keep you asking: \"Will it ever end?!\"\n"," Little zombies seeking revenge!\n"," Great work!\n"," The movie is snazzy and rad to the max fools.\n"," Wicket\n"]}