{"review-url":["http://www.imdb.com/title/tt0419146/reviews"],"review-text":["This film is a very beautiful and slow film. There is nothing Hollywood about it. It is very danish and the characters are very real. It is the first danish film to take up this transsexual theme. It is really about love that has no gender. I would not say it is about lesbian love even though the two main characters (the transsexual veronika and Charlotte) are attracted to each other. It is a story about love and life.The story pretty much takes place in the two apartments. There is almost no background music, which makes it seem more real and intense. The two actors playing the main characters are great. They really make them seem real. They are not archetypes, but real people you could meet in the street. I think it is the first time I have seen a transsexual portrayed this well. Very well done.","To me, neither of them knows what love is.Charlotte can leave her 4-year-living- together-love relationship behind and sleeps with every man she met without feelings or guilt. It seems only sensation counts to her; only herself is important to her. She doesn't know how to love and cares only for herself.Veronica is a transsexual to be. S/He tries to look like women, dress like women, and act like women. S/He wishes to become a real woman, but before that s/he is a woman trapped in a man's body. Under this condition, s/he couldn't face herself/himself; s/he finds herself/himself ugly, lonely, and stuck. Being like this, s/he can not love herself/himself, not to speak loving other people.The encounter between these two unloving people sparks. They seem trying to find the ability and strength to love one another, but failed and failed again. This love pilgrim goes on and on; till the end of film, we still can't tell if they find the love they want. Perhaps this film really is a reflection of life in everydayness.","Some spoilers**** A Soap has some wonderful moments to recommend it. When Charlotte and Veronica get close to intimacy is a beautiful, low key, truly erotic scene. I also loved the music score and the soft, muted cinematography. I'm not clear if the curious stop and start structure of the film comes from it being digested originally in serialized form (the announcer describing the action in sections is quite annoying). My biggest problem with this film is its rather absurd depiction of a transwomen and her life. Of course, she has to be shown as a sexworker (what else), scatterbrained, impractical, absurdly frilly/girly, completely hopeless when it comes to dressing and incapable of making any interpersonal attachments in the world. Moreover, she's always shown with two days growth of beard (for some bizarre reason) as if to emphasize how tawdry her life is. And she's waiting to get gender reassignment surgery when she seemingly has done nothing else to forward her transitioning. In truth, the character resembles a drag queen, not someone in the midst of transitioning.These are typical fantasies of people from the outside who really aren't connected to transpeople. The film's fetishization of GRS surgery is a way of objectifying people who are going through transition. Not impressed with this aspect of the film in the least. At the very least, why not have the character played by someone who really is transgender... I thought the male actor portraying Veronica was okay but no better than that. Much better was the woman portraying Charlotte, a very complex character full of energy, self-loathing, desire and contradictions. If she was so fascinated by someone with female energy, a Charlotte could go out to a women's bar in two seconds and find it. Yes, she was drawn to Veronica but more as an abstract idea of someone with male/female characteristics (a gentle touch but with a good punch), not as a unique person. Yes, what A Soap says about love is often lovely and moving, but that doesn't mean an already stereotyped minority has to be stereotyped some more in the process.This film also proves that Danes are lousy dancers. For such a promising premise (better executed in a film like \"Different For Girls\") the final film is a letdown.","A strange relationship between a middle-aged woman and a transsexual who gonna be a woman soon. Charlotte and Venorica, both trapped by their inanimate lives and don't know how to get out of them. Charlotte is an owner of a beauty clinic, she has broken up with her aggressive ex-husband, moved into an apartment alone with all the furniture packed except her big bed. Veronica lives downstairs with her poor dog, She's sensitive and desperately bothered by her mother's visiting and the bad relationship with her dad. Her only hope is that the upcoming transsexual operation will turn her into a real woman and then everything will be fine. All she can do now is waiting for an approval certificate.Then these two individuals meet by chance and gradually they are all involved into other's lives, there are some sparkles between them, but no one is brave enough to face the truth because they are not willing to accept the change as most people do. Eventually the ending is quite satisfying and leaves some imagination for us to think about it.The director's great work gives me an great impression, she handles the development of characters very well, the emotional atmosphere is quite full and intense. Also I am so obsessed with the gloomy lights all over the apartment, Delphic but full of desire.Two main characters are played by Trine Dyrholm and David Dencik, they are amazing in their roles, a very impressive performance and the chemical reaction between them is genuine and convincing.This Swedish indie film is about encountering and change, no matter you're homosexual or heterosexual, male or female, the oddness of life exists everywhere, whenever you fall across it, you'll be hesitate and bewildered, but at least don't be afraid, follow your heart and choose the right way.","The film starts with Carolina, hectic owner of a beauty parlor having just moved out from boyfriend Kristian, into the apartment over Veronika. Veronika drags along watching soaps, occasionally fulfilling wishes of sex clients, and desperately awaiting her operation transforming her into the woman she wants to be. After yet another confrontation with her well meaning mother Veronika attempts suicide. Carolina above wakes up, finds her, gets her to hospital and takes Veronika's dog, miss Daisy into her care. After Veronika returns, the neighbours find an interest for each other, in the turmoil of their search for affection with others. During a wild party à deux they even come to feel more, for which however there seems to be no room.At the beginning the film made me fear I'd come to watch a trendy and fatiguing freak show frenzy, but hanging on it got me more and more interested in the slowly developing strand of tenderness in the middle of these rather chaotic scenes.With the pink borders of kitsch the film owns to its title (the cliffhanger like voice-over asking the viewer what may come next, the zooming in on the blossoms outside the apartment block where it all takes place) the film convinced me eventually with its moving depiction of the ensuing blossoming of feelings between the main characters. All of this filmed with Dogma-inspired directness, closeness en nervousness, which I don't mind at all.","The Soap is an interesting movie and very brilliant at parts. You must watch it for its strong characterisation and the risks the plot about two troubled individuals falling in love takes. You must know the story through various other reviews, so lets speak about what is brilliant about this movie.Firstly, the two protagonists are so real and such intriguing personalities. The first being a woman who has opted out of a four year relationship and is angry enough to sleep with anyone coming her way. The second being a man who has always wanted to be a woman, whose pain and loneliness is shown with so much sensitivity and brilliance. You hate the former and your heart bleeds for the latter.The second thing about this movie is the entire concept of loving one for who one is, irrespective of gender. So, would you still love your partner if he/she were to change his/her sex? The movie explores that idea and it is a beautiful one.But there is one point where the movie fails. I wish the relationship between the protagonists had developed in a better way. That what they feel is love doesn't come across till the end. But watch it, and post your thoughts on it here......."],"review-user":["mepaloma","Jolucy","anyajzb","lasttimeisaw","michel-tillie","scarletpimpernel_avanti"],"review-date":["13 May 2006","21 March 2007","19 February 2007","28 March 2007","17 January 2007","11 December 2006"],"review-rating":["10","6","4","8","7"],"review-title":[" A beautiful film\n"," A pilgrim to love.\n"," some nice moments but very poorly conceived\n"," En Soap - En Soap\n"," convincing towards the end\n"," En Soap - an interesting film\n"]}