{"review-url":["http://www.imdb.com/title/tt0439491/reviews"],"review-text":["Costa Rica's cinema is practically non-existent, so this movie is actually a good attempt, something that could've been decent with a better director and writer, this would've been quite and upgrade for character description and their motivations. Actors are not terrible, music, editing, photography are not awful; this again brings me to my conclusion, taking into account that Costa Rica is not a movie producing country, it's a movie that's actually not that horrible but is very far from being a good movie. Costa Rica is not like Mexico, Argentina or Brazil that actually produce motion pictures. It would be of irrational thinking that Costa Rica in the next 20 years produces something like Iñarritu's \"Amores Perros\" or Meirrelle's \"Cidade de Deus\". Those Latin American movies (there are lots of other example just to make my point I mention this two)are art works due to long processes conducted by those countries that actually incentive movie production and support (financially, logistically, promotionally) domestic movie production. Costa Rica is far from that, but with \"Caribe\" things started going on a different direction, it seemed like everyone wanted it to triumph (a little counterproductive since it was too overrated) but at least support was shown to a local production, and that is quite a start to generate more movies form Costa Rica. A 5 is fairly decent for Caribe, maybe a 4 but then again I'm Costa Rican so 5 is fine.","I saw this film at the Palm Springs International Film Festival and it's director Esteban Ramirez introduced the film and took Q&A after. The four lead actors in the roles of Vicente, Abigail, Irene and Jackson are all good but only Cuca Escribano as Abigail stands out as the best of the four. The character of Jackson doesn't have much to do in the movie and I wondered why it was even in the film. The rest of the acting by the other characters in this movie is nothing special and the characters are all kind of cartoonish. The film has a good look to it though despite being shot in a brief five weeks. It had some elements of a good story but wasn't enough to be a film. A made-for-TV movie maybe but not a theatrical release. The final scene was a little far fetched concerning everything that went on in the film. I did think it was a good movie on the low end of good but I wouldn't see it twice. I would rate it a 6.0 out of a possible 10.","\"Caribe\" is not a masterpiece in any of its storytelling aspects. However, it delivers a perfectly enjoyable story, along with a magnificent cinematography. The narrative structure is set around two narrative axes, one of them embedding the other, each one having elements that relate and co-exist in excellent harmony. The story never loses the right pacing, and it shows a very good blending of the human figure with its natural environment (which is a character in itself). The acting is great, and for that we owe credit to the emerging director, Esteban Ramírez. Furthermore, the characters are very well written and masterfully complex; so, once you become familiarized with them, you can perceive their feelings without them even saying anything. I can't say I liked this picture because of all the hype it generated(in Costa Rica), but rather because of the way it really achieves in showing an interesting portrait of what happens when you interfere with the equilibrium of people's lives. Hopefully, Caribe will establish a reference for future projects in Costa Rica, as it is a very good example of nice movie making.","...or Soap on the Beach.What we have here is a love triangle between Vincente, his wife Abigail and her long-lost sister Irene. And then we have the tale of the American oil company preparing to despoil Costa Rica's fishing grounds, beaches and tourist economy in exchange for a few low-paying jobs.From the moment Maya Zapata arises in the morning, turning her snow-white panties to the camera, we know this isn't going to end well (no pun initially intended). She and Vincente fall in lust, with Vincente being unable to decide between the women in his life. This plot moves predictably, with one very nice beach/lightning storm scene and a lovely lecture of Vincente by his cook Marva about \"You've got to decide!...chicken or fish?!). No spoilers, but I wasn't satisfied with this story's resolution.The bulk of the oil story must be on the cutting room floor, as it's given short shrift as far more than a minor plot element and far less than a plot. This story is based on actual Costa Rican history and worth looking at.Neither story is done justice here. It's too bad Senor Ramirez didn't make two movies; I would have loved a documentary about the oil.","This movie has to be one of the most boring and stupid movies that Perrugorria have done. It looks like a commercial from beginning to end. The ¨director¨spent the whole time on a tripod, it doesn't have pace, rhythm. It's illogical. what a mess. You can tell what's gonna happen since the first 15 minutes, and the ending...Wow------spoiler-------Jesus Christ, how the hell Perrugorria got shot? Are you serious? Worst scene of someone getting shot ever!------end of spoiler-----Bad directing, bad script, bad acting...Really bad overall. I wouldn't recommend this movie at all. It's a waste of money and time.","This movie was produced by the biggest producer in Costa Rica. Although their authors brag about it as a the biggest movie in Costa Rica ever made and their actors even dare to say that they didn't get an Oscar Nomination due to it's political relevance with oil (-he he, right) ...Well, this is all a lie. This movie was supposedly based on a book written by Carlos Salazar Herrera about a love triangle (super cliché soap opera-like subject) and it secondary story is about an oil problem on the Atlantic Coast of Costa Rica with an American oil company who wanted to explore oil deposits on the region, but at the end it never was approved by the government. Now, it may have some nice footage about the beaches, but that's it; nothing bigger than that... it is all in the camera. Most of the actors are lousy, except for two or three. The rest lack of sense of what acting means: they overact most of the time. The story is completely common and cliché, worthy of a cheap Mexican soap opera as I said.. because the crew advertised it as a protest movie about oil, but 80% of the movie is based on a stupid love triangle. The script is nothing impressing, it is very simple and the dialogs are not very thought. It has also got some editing problem on a couple of scene changes... but besides that is pretty decent. The director did an alright job, I mean, he is not like an Oliver Stone,but he did his job with the resources he had handy. I would like to question him why instead of using Costarican actor he spent most of the money on foreign ones.. I mean after all they bragged about being an 100% Costarican Production... that's what you at least expect. Final the end is is not well done, there are flaws and details that don't match or are useless. Besides being the most elaborated movie in all Costarican history, I think it's mediocre. You can make way more interesting and better pictures with less cash. Never heard of \"Pi\"? Anyway, if you are curious about Costa Rican or Central American movies, this one will do, but you are definitively not missing anything.","I have just seen Caribe a couple of nights ago at the annual Vistas Film Festival held here in Dallas, and I must express my discontent. The opening caption tries to tell us that the film is a portrayal of the current invasion of South American countries (Costa Rica, in this particular case) by North American oil companies, and the negative effects, both economic and environmental, of this invasion. The main characters are a married couple who live a simple, pleasant life maintaining a banana farm. Right away, a woman arrives and announces that she is the wife's half-sister. I'm not going to go into specifics about this (and to be honest, I don't feel that I'm spoiling anything with this review), yet another key point is that the company to whom they distribute their bananas drops them due to budget demands in a poor economy. So, the main conflict that is supposed to be addressed in the movie is of the husband between the rock and the hard place, trying to preserve his livelihood. On one hand, the Reynolds oil company has basically offered him employment and financial compensation (basically a bribe) to use his public influence to encourage the town to allow the company to begin drilling in their town (compromising his standing with the community and the community itself). On the other hand, he is faced with being dead broke, but on the side of his community, protesting the drilling. Given the length of this film, it would have been ample time to explore the issues just described, but it just doesn't happen, and I'll tell you why. You will notice that this film has won a couple of awards so far, one for direction and an audience award. I'm not going to pick apart Esteban's direction, it wasn't bad or good enough for me to be all that passionate about writing anything. The audience award was at a film festival in Spain, and for it to gain an audience award, I'd have to imagine that Spanish people just dig soap operas. In fact, Central and South America dig soap operas as well, I know that much. I assume that Esteban was either aiming to take advantage of this or that he himself digs soap operas, because that is what unfolds over the course of this film, so much to the point that it kicks the whole oil company plot to the side, almost as if they imagined halfway through the making of this film that it had become tiresome, because it seems like at least three of the supporting characters have had their back story and character development severely compromised to make room for more sex and crying scenes. The only true villain in the movie is one of these three characters, and at no point do you actually get to find out who the hell he is. It's almost as if they cut his screen time just short of taking him out of the film entirely. From time to time, they toy with the oil against community plot, but these are digressions at best. What we see a lot more of are scenes of passion, jealousy, betrayal, adultery, etc. These themes saturate the story to such a degree that the oil company 'sub'plot becomes unnecessary. It's almost as if this was a stunt to legitimize a romantic drama (soap opera) by throwing in a little political relevance. Nevertheless, the film gets so caught up in the romance that it ultimately doesn't know what to do with itself, resulting in an ending so tacked on that you're left wondering what it is that you've been waiting around for, or if there was ever anything to begin with. Here are two things that I think could have saved this movie: either cut out the half-sister or cut out the oil company. It's obvious which one of the two they were more interested in. Or, perhaps if Caribe had been an hour longer, they could have worked this all out. Regardless, I'd have been fine with a straight-up soap opera and I think that the subject of oil companies exploiting foreign nations is in dire need of addressing by the film community. Caribe is both and neither. These two angles could have worked together had they been balanced accordingly, but with a romantic plot running around in circles and taking up almost twice as much time as necessary at the expense of an oil plot that's barely been established to begin with, both sides suffer. Best of all, the romance plot is never even resolved. I'd like to say I'd watch this movie again to see what I've missed, but I have a strong feeling that I already know what it is. As far as I'm concerned, it wouldn't matter if I saw Caribe ten more times. I've missed it because it is simply not there.","Esteban Ramírez is the only movie maker from Costa Rica that has achieved some heavy international recognition for his work, being \"Caribe\" his cornerstone. The movie is based on a short tale that Ramírez and co writer Ana Istarú achieved to transform in a contemporary story with two main axis: a story of love and betrayal on one hand and a subplot that involves the resistance of some groups to explore and exploit oil fields in Costa Rica shores. The first story goes quite OK. The second, nowadays, with the fuel prices as high as they are I really don't care if foreign companies, or national ones, exploit oil or uranium if the Costa Rican people can save some money. But it was a good stroke because by doing so, to criticize the oil exploitation, the movie got the spontaneous backup from many environmentalist and Anti U.S. leftist groups. Not a masterwork it speaks very well of the producer-director Ramírez who achieved a good work for his curriculum. As far as I'm concerned he has a \"10\" in Costa Rica and expect to see more of his.","Caribe feels like somebody said, \"Let's make a movie that shows off the splendid beauty and culture of Costa Rica! It will be a magnificent advertisement for our beautiful country.\" And then someone else (probably a writer) said \"But it should have a serious message, too!.\" And then some produ$er chimed in, \"No one wants to watch a boring, preachy documentary--no matter how beautiful. It needs to have plenty of sex and nudity! And while we're at it, let's throw in a bit of violence. *THAT* will make it a good movie!\" There was no justification for most of the characters' major decisions. It oscillated between a character sketch of a man at the edge of breakdown and a \"movie-of-the-week\" with action bits thrown in."],"review-user":["cocojaen85","johno-21","Man_of_the_West","fnorful","jesssfernandez","xxarikxx","Lavinkli","karlfred","alainsane-1"],"review-date":["30 June 2006","6 February 2006","13 June 2006","27 March 2006","16 June 2009","24 September 2005","23 September 2005","22 May 2006","26 October 2007"],"review-rating":["5","6","8","5","2","2","3","5","5"],"review-title":[" Good attempt, but not a good movie\n"," OK as a made-for-TV movie on Lifetime\n"," A splendid motion picture\n"," Oil on the water ...\n"," Awful TV Movie\n"," Kind of a nice try.. still a long road to hike\n"," A TORRID, PASSIONATE LOVE AFFAIR........and something about an oil company\n"," Costa Rica's best movie yet\n"," Too Many Cooks....\n"]}