{"review-url":["http://www.imdb.com/title/tt0449159/reviews"],"review-text":["After Mr. and Mrs. Iyer it's again Aparna Sen's take on so-called 'parallel' films, this time again with the same lead cast of Konkona Sen and Rahul Bose, both highly gifted actors. And along with them this time she's got the genius of Shabana Azmi. Now as far as the theme of the movie is concerned, I must say it is indeed very mature especially in terms of Indian cinema. It deals with a very common yet disturbing example of social problems. And Sen included many social clichés to make that flavor of this film complete. Though there are a few (romantic) subplots that I personally feel unnecessary.I won't waste space discussing the story. It's better to dive straight into the film's analysis. Sen is indeed lucky to have a cast that deliver excellent performances altogether. Konkona is her usual natural talented self as the schizophrenic girl Meethi. After \"Page 3\" and this, it is quite clear that she's going to be one of those very few actresses who are remembered for a long time solely for their acting abilities. But Azmi is just magnificent as Meethi's tough and over-protective elder sister. Her performance is indeed worthy to be nominated for any international award. Rahul Bose, though appears in a much shorter duration of the film, does a perfect job as Meethi's love interest Joydeep. There are also fine performances by Dhritiman Chatterjee and Waheeda Rehman.There are three minor drawbacks of this film, if I'm at all to discuss them. One is screenplay. Overall it's not bad, but should have been better especially when it deals with such a ripe subject. There are many places where the script lacked the necessary sharpness. And Sen sometimes seemed to forget that the characters are actually peoples of Calcutta. No Calcuttan, even when speaking English, refers to a taxi as \"cab\"; or the drug Diazepam is never marketed in India as \"Valium\" -- it's only a US trade name. Such examples only make the script appear a tad artificial. Two is background music. Well, it utterly lacked variation. Every time I paid attention to the background music it appeared as if some horror film is going on... even during Joy and Meethi's wedding. And three is the ending.I heard many people who think that the ending is highly influenced by a famous scene in the film \"Finding Neverland\". I don't argue with them... in fact in a way they are quite right. I can only say that though the 'presenting fashion' of this ending is indeed similar to that scene, the substances of the two are hardly comparable as these two are completely different kinds of films. Even though I didn't like its presentation, I still think the ending (and perhaps only the ending) carries the best signature of Sen's creative genius.","This is a multi-faceted, insightful and bold story about the people in the life of a schizophrenic patient, their (and our) perception and realities. Although the main theme revolves around a delusional young woman, the story delightfully flirts with physics, medicine, religion and even politics as it questions our perceptions about what is true and what is real. Konkona Sensharma beautifully conveys that the world Mithi is living in is as real to her as ours is to us. Within that world, she is logical and her thoughts are internally consistent, not the gibberish that they seem to us in our world.Here are a few outstanding scenes to look out for while watching the movie (don't worry, these are not spoilers). I absolutely loved the way Aparna Sen wove these commentaries into the story.The references to quantum mechanics and relativity intermingled with the witch-doctor (\"ojha\" in Hindi) performing his religious rituals that he believes will drive away the \"ghosts\" sitting in Mithi's brain. The doctor prescribing shock-treatment as a solution that is \"believed\" to work Windows of perception - The scene about the review of Anu's book. The allusion to illusion in a conversation about a director looking for \"maya\". News footage of George Bush telling the whole world that there is \"no doubt in his mind\" that there are WMD in Iraq (now, that is not as much about Bush's perception, who I suspect knew the truth, as the gullible public's perception about WMD in Iraq.)One of the best scenes in the movie is where Mithi tells Anu \"Charu sent this man to beat me\" and Anu dismisses it as a matter of course. Konkona did a fantastic job, bringing out the strange mix of muddled thoughts in a schizophrenic's brain when her world and the real world clash.Aparna Sen was bold, but not bold enough to pose one big question: Is nearly all of mankind delusional to believe in God? She could have inserted some scenes about \"normal\", \"healthy\" people praying to and sacrificing for a Being that no one has ever seen or heard from in all of human history (The ritual/exorcism scene doesn't go far enough). That would be the ultimate question: What is normal? Who's reality is right, the Believer's or the Atheist's?IMHO, this movie is a far more intricate exploration of the schizophrenic mind than \"A Beautiful Mind\". It looks at the minds of not just the sick person, but also the healthy, and does so from many different angles and illuminates our understanding of our own minds and our world. If the former got 4 Oscars, this deserves more - At least one each for story, screenplay, direction, Konkona, and Shabana Azmi. It was truly a treat to watch this movie and I'm glad I bought the DVD for my collection. This was a story very well-told indeed.","15 Park Avenue, well the name mystifies initially being an address from New York and film being set in Kolkata. However as the story unfolds, one realize the thin line that director tries to walk between Relationships, Social Cause and of course the world of Schizophrenia. I would say Aparna Sen is one director who has so much more to say and has so less time at disposal. Well no doubt she has managed to make a good movie. In a way she makes us realize that probably each one of us is looking for our own '15 Park Avenue'. Its an unending search within each of one of us...The powerhouse performance from Shabana Azmi is a treat to watch. Her screen presence brings whole lot of life into the scene. Indeed it was surprising to see her in such a powerful act after long because I expected it to be all the way Konkona Sen's terrain. Shabana makes you feel skin deep of an elder sister who is running the whole show for a rather unfortunate family and during this time she almost forgets to live her own life. She burdens all her ambitions and desires with ailing 18 year younger sister ( who is more like a daughter to her ) and an aging mother played by veteran Waheeda Rehman. As for the leading actress from Guide ( that's how I can recall her instantly ) there is hardly anything to say except few lines and tear drops here and there. Ever dependable Rahul Bose plays another pivotal role in the film, he shows the emotions of a middle age man with repent on his face to near perfection. This man really amazes me with the variety of work he has done. From a musician in Jhankar Beats to a liberal Muslim in Mr. & Mrs. Iyer and so many others. He is one versatile I really wish if he had some more shots in the first part of the movie as well. The cameo in the movie is by Shefali Shah (remember Satya and Monsoon Wedding). She looks really beautiful and depicts the role of a mother of 2 kids with real ease. She gives you a glimpse of today's Indian woman who is modern in approach but still conventional when it comes to her husband's prior relationships. The focus of camera has been Meethi, portrayed by Konkona. She and her schizophrenic world constitute the nucleus of 15 Park Avenue. She has really worked hard for the character but there are times when she is not able to relate with the audience. The fateful accident of her life tries to rope in sympathy and it has been only partially successful. The movie tries to address quite a few things in one go starting from the unique world of a disabled person to the unequal status of a female even in today's modern India and also the twisted relationships in a tattered family. And I believe Aparna has succeeded to certain extent. The helplessness of Meethi while she works as a journalist in a rural eastern state really gives us all a naked picture of the country we are so proud of. Well after I finished 15 Park Avenue, there was a sense of unquenched thirst within me. I wanted more out of this movie to drench me emotionally. It has been a commendable effort on the part of director except few hiccups. Must watch for all those who like to see a different cinema, something with a strong purpose.","If you repeat a lie enough number of times will it become the truth? 15 park avenue is the story of an alternative reality of a schizophrenic (Mithi). The movie is about her search for her home at a fictitious address where her imaginary husband and 5 children live. Aparna Sen delivers yet another masterpiece. Each and every actor of the movie was better than the other. Konkona Sen looks unbelievably convincing as a schizophrenic. She pulls off the role with such ease and maturity beyond her age. Shabana Azmi is incredible as usual. She plays the dominating and fiercely independent elder sister of Mithi who takes care of her ailing sister and aging mother. She refuses to accept that in-spite of all her strength and courage, she still feels lonely at times. This should have been a very easy movie for Rahul Bose. The role was least bit demanding and anyone could have done the role.The ending of the movie was the most surreal part of the whole park avenue experience. It took me a while to digest that the movie had ended. It left me confused and maybe even a bit disturbed. But later on, it started sinking in. My eyes are black. But if everyone says they are blue, will I still believe that its black??!","Boasting of a host of talented cast and one of the most acclaimed filmmakers, 15 Park Avenue takes us to a dark philosophical journey. It's about a young schizophrenic lady, her intellectual sister, her ex-fiancée, her mother and the people surrounding them who are looking for only one thing...something they can never find. Konkona Sen Sharma is without any doubt the most talented actress of today's generation. Her portrayal of the schizophrenic Meethi is so realistic (more so than that of Russell Crowe in A Beautiful Mind). Shabana Azmi is always dependable and here too she is fantastic, as is Waheeda Rehman who plays the helpless mother, Rahul Bose and Shefali Shah. The film takes place in India and Bhutan and the cinematography adds more to the mysteriousness of the world these characters live in. The film is open to interpretation and I have my own but I won't mention it as you should have your own view. I strongly recommend all to watch this wonderful movie.","SPOILERS AHEAD 15 PARK AVENUE: My Humble take on this film Now, for a viewer of cinema having tastes as severely limited as mine, niche films like 15 Park Avenue ought to be palatable to my sensibilities. With this thought, and a mild sense of embarrassment that I hadn't watched the complete film earlier, I watched this film last Saturday. There are some starting similarities with other works like the legendary Mulholland Drive (David Lynch) from which, this film borrows at least 3 concepts:- a) That (at least some) truths are relative b) The first scene of Shabana and Konkonam going around in a car as the opening credits roll, is uncannily similar to the car ride that Betty and Rita undertook in Mulholland Drive. In both cases, the object of inquiry happens to be a place which is probably mythical in both cases and perhaps more openly symbolic in Aparna's film c) The incident revolving around the mad beggar woman is again extremely reminiscent of the whole 'occurence behind Winkies' involving a bum but while that scary creature is an embodiment of something and that that 'something' as well as the character per Se is seamlessly linked to other works of Lynch (notice carefully the disheveled long hair), the effect of the beggar woman in 15 PA appears to be a tribute and therefore insignificant in the context of the film and its message The other films from which 15 PA also borrows is Blow Up (especially the last scene is a throw back to the truth Vs. perceived truth poser presented towards the end of Antonioni's masterpiece). Of course, the professor and schizophrenia angle also bring to the mind, \"A Beautiful mind\". Although, admittedly the subject here is high brow physics and Shabana, who professes it, inadvertently ends up being the brilliant antithesis to the delusional hallucinations of Konkona's character through those very prophecies. In an outstanding scene in the movie, some of these elements are juxtaposed with each other and that scene cuts back and forth from the 'real' world of Shabana, where Quantum Physics and the Theory of Relativity justify the finiteness and composition of the universe, to the artificial edifice of the 'make believe' world of Mithi But for all their differences, the sisters are alike too. Both are incapable of forming long lasting relationships- one out of choice and the other out of nature. So, Mithi's pain at being rejected in love by Joydeep is in harmony with the inability of Shaban to form a special bond with either Kunal(Dhritiman) or Sanjeev (Kanwaljeet). But I'm getting ahead of myself. Viewers generally tend to view this film in one of the following two ways:- Hypothesis 1: \"It was Shabana all along\" There is a certain section of the audience who think so. But that explanation is not only too far fetched but also contrived as that would mean she was dreaming up so many other characters too (i.e. all those characters whom she visualized as visualizing Mithi along with her) Hypothesis 2: \"There WAS a REAL Mithi and the ending is a metaphor\" This POV says that the film's essence is summarized in one dialog in the film, when in response to a statement by Joy (Rahul Bose), that Mithi is looking for something that she will never find, his wife Laxmi (Shefali Shah) philosophizes that we all are looking indeed for that illusive utopia, the end of the rainbow wherein appears to lie the mirage of happiness and contentment There are other more minor possibilities which have not been embraced that much by our knowledgeable audience like:- Hypothesis 3:\" Shabana and Konkona are alter egos of the same person\" Hypothesis 4: \"Shabana too is a figment of Mithi's imagination\" Hypothesis 5: \"The old, haggard, perhaps mad, beggar woman is the real protagonist of the story\" Are these hypotheses worthy of even being tested? Well, your guess is as good as mine \"Why 15 Park Avenue?\" Contrary to the popular perception that she was thinking of the Park Avenue in NY, I believe that she got the name from the brand name of a semi popular bathing soap. Remember, her stating Jo Jo's profession as \"Prime minister of Shikakai\", which as you may be knowing is a popular ingredient used in manufacturing Shampoos. The prefix '15' is used as it was on 15th December that Mithi got engaged to Joydeep and after his walkout, she remains forever in a time warp. The film has its fair share of flaws- lack of use of a strong background score, which in films like these can really augment the narrative, some sloppy dialogs unabated by some forced dialog delivery. Inconsistent performances (Shabana and Dhritimaan are excellent though IMO) by a few of the cast members albeit many members of this ensemble cast have been wasted. Shefali Chaya's sudden insecurity about her husband seems to be an unimaginatively introduced dimension in the plot. I give it 7/10 as it made me think but not any higher than that because I can easily fathom its sources of inspiration and having experienced (and for the most part, thoroughly enjoyed) those previously, I have already thought on similar lines earlier. So, the experience post 15 PA is bound to be sans a certain degree of novelty. Where am I coming from? I gave 9.5/10 to '36 Chowringhee Lane' (though rumors still persist that one Satyajit Ray ghost directed it), 7.5 to 'Paromiter Ek Din', 7 to 'Mr and Mrs Iyer' and 5 to 'Paroma'. On an existential level, it failed to invoke my interest, not even as much as say a 'Truman Show'","I must say it was a let down. Overall its great to see the way Aparna Sen has handled the issue of schizophrenia, I am not much knowledgeable on this and got whatever it was depicted in A Beautiful Mind, and here too its interesting portrayal.But the thing that caused the let down for me was the artificial dialogues and over use of English. Its true that a new class is being formed/ has been formed in India which talks in English even at home, but I am sure its not as formal as in the movie. Moreover, Waheeda Rehmaan did not seem very comfortable talking everything in English. Charu's dialogue in Bihari tone was seemingly much more realistic and digestible.The second thing, its about the abstract flavor she has tried to give to the movie. I generally like movies with open ending, but here there were many loose ends. Its like cut pieces are joined together to make the movie. Also there seemed no central theme to the movie. Schizophernia for sure was the main line but intermingling sister-sister, mother-daughter, adding doctor-azmi relation, no real use of brother, Bose - Bose's wife relations..... all were not required and made the audience loose track of what actually did she try to depict.On the whole, a watch for people who like off-beat movies, a must avoid for the ones who just see movies as an entertainment tool.","i went to watch this film with my family who were expecting a neatly conclusive story like ''mr.& mrs.iyer''.and they returned home thoroughly disappointed.so,this is a warning to all ''conclusive story lovers'' to stay away.15 park avenue does not seek to answer questions or provide moral solutions on how to treat the mentally challenged.rather its intention is loud and clear.it questions every human being's,sane or not,sense of reality.in fact for me it even arouses doubts about my taken-for-granted sense of sanity.the security,bondage,satisfaction that i find in my present,is it really what i am or does it really create an illusion that all of us desperately and sometimes ignorantly cling on to just to falsely console the neglected 'meethi' which exists in all of us in some way or the other? so,why does anjali so maniacally makes it a point to show off her strength of mind when she is really harrowed by the realization that she is becoming a monster?aren't we all who think we are ''normal'' ,really monstrous and helplessly vulnerable about it deep down inside? is it not better to be happy even insanely,than to create the impression of 'normalcy' while suppressing one's fragility? meethi bravely,madly,sincerely does that.and society labels her as ''schizophrenic''.the ending did confound me at first,but then you realise that meethi bravery and sincere belief took her where she wanted to go.she found what she was searching for,not caring what society had to comment upon her search. and it is the seemingly 'real' people - anjali,the psychiatrist,and jojo- who never reach anywhere.my family thinks that i am schizophrenic too in trying to make sense of a film that is largely 'insane' to the rest of the world.anyone else willing to believe in my sense of reality...........?","15 PARK AVENUE is the address \"Mithi/Mithali\" (Konkona) is in search for from the movies beginning. \"Prof.Anu\" (Shabhana Azmi)is Mithi's extremely caring and loving half sister from Mithi's mom's earlier marriage. The movie revolves around these characters and looks into the life of a schizophrenic patient (Mithi). The director tries to explain to the viewer the imaginary world of Mithi, through her continuous blabbering to Anu and others. Konkona deserves not one but thousands of awards (which I am sure, she will be getting)for this rendition of Mithi in this movie. You can see the look of a patient written on her face, by the drooping lips and sleepy eyes, from the first scene itself. Rahul Bose has done a good job, but has been reduced to one half of the movie in spite of his importance in their life.Watch out for the intense relationships shown between the characters of the movie, Mithi & Anu, Anu & Anu's Mom and between Anu & Sanjiv (Kanwaljit Singh). Shabhana Azmi, as usual has done a riveting performance to be remembered as the sister, who sacrificed her life for Mithi.The movie might not be your usual Hindi potboiler, but can certainly make people look at the schizophrenic patients in a different light altogether.As usual, Aparna Sen brings the movie to a different ending rather than any clichéd ones, we might think off. Hats off to her, for this great movie!!!","A movie about Schizophrenia, an educational effort on the part of the director at times when most movie seem to be just about skin show. Konkana Sen is a Schizophrenia patient who lives with her sister and mother. The movie is about how the family tries to cope with this disease, while Konkana continues to live in her delusional world. I would have given a 10 to this movie if not for the ending which seemed pretty pointless. Without letting in on the ending, I must say that I do not see the point of having an ending which forces the viewers to try and understand what actually happened in a movie..15 park avenue ended up being a movie like that. I would not call such an ending intellectual, just plain lack of insight on the part of the director, or whoever was responsible for the ending, to realize that the audience would like to know everything when seeing with a movie that deals with such a sensitive topic. That said, Shabana Aazmi,Rahul Bose, Konkana Sen and Wahida Rehman are a delight to watch in the movie. Acting can never be an issue in a movie with Shabana Aazmi and Rahul Bose. I just wish that the end was different. It was the ending that let the movie down a bit. However, still a movie with such an excellent director and wonderful actors should be seen.","Ms Aparna Sen, the maker of Mr & Mrs Iyer, directs this movie about a young girl's struggle to cope with her debilitating condition.Meethi (Konkona Sen) has been an aloof kid ever since childhood and has shown signs of delusion, no one knows why. The dormant tendency however slips out of control, when the job assignment takes her to neighboring Bihar where she's raped by some political goons. The resulting trauma also leads to episodes of manic-depressive psychosis in addition to her schizophrenia. She careens out of control over the years, progressively getting worse and sinking deeper into her private 'world'.The juxtaposition of an 'unsettled' (divorced) elder sister and how her domineering ways make an already bad situation worse, is indicative of what a fine line there is between abnormal and *seemingly normal*. Ms Sen also makes an excellent commentary on the social alienation of such individuals. Social rehab is standard therapy along with all the deadly mind-altering drugs. But what about the poor and the destitute, who're always left to fend for themselves and usually fall by the wayside?The romantic connection between Dr Kunal and Anu was unnecessary. Also the cafeteria scene where Dr Kunal explains to Anu how real their world really is to them, was redundant. Anu should already know all that. The English dialog is a bit awkward at times though the acting compensates for that. Konkona and Shabana prove that their reputation is every bit worth it. Waheeda, Rahul and Shefali play their limited roles very well. Extensive research seems to have been done about this illness, its very evident. But its not clear if MDP can coexist with schizophrenia in the same patient, side-by-side. Also in the early part, Dr Kunal recommends E.C.T (shock therapy) while invalidating the fact that it doesn't work for schizophrenics, only for extreme MDP with suicidal tendencies and other forms of bipolar disorder.The ending of the remarkable story is suggestive of an unknown solution (maybe no solution). The movie could have ended on a nicer note, since worldwide the mentally ill can and do lead balanced and fruitful if not very fulfilling, lives under good medical care.Nonetheless, its an excellent film made with extreme sensitivity to the subject. HATS OFF to Ms Sen! No one in India could've done it better.","i have just seen the movie \"15 park avenue\" which was the first night presentation movie in the asia society human rights film festival in new york.i was really moved by the subject matter of this movie and also the excellent portrayal of \"mithi\" by the lead actor konkona sen sharma.i have just one word for everyone who is reading this comment,run to get a copy of this gem and watch it.my sincere thanks to director aparna sen who has done a excellent job again.movie like this comes on once in a blue moon and i was lucky enough to see this movie on screen and also took part in a after movie discussion/question and answer session with konkona sen sharma.in a simple word \"a wonderful experience.","Aparna Sen casts some great actors for this wonderful fantastical story of perception which conveys the many ambiguous faces of the human cognitive mind and imagination. 15 Park Avenue is an appreciable effort, but not fully realised, with several aspects seeking to be explored a little more. The fact that it was shot entirely in English is also quite a mystery, because it automatically makes much of it look unnatural. That said, the film is very entertaining, very slick in terms of cinematography and production, and brilliantly acted. Needless to say, it is Konkona Sen Sharma who steals the thunder. Sharma dazzles as Meethie, erasing everything she is and disappearing into the role to deliver a disturbingly convincing performance which is one of the most impressive of our times. She is just mind-blowing, dominating her scenes with amazing intensity and wavering between comic and entertaining, and moving and unsettling. It's sad that such a brilliant act was hardly noticed. Waheeda Rehman is as good as one would imagine her be, but Shabana Azmi, and I can't believe I'm saying this, is probably the weakest link. This is one of her least impressive performances, and much of it might be due to the English dialogue, which took its toll on one of the greatest actresses of Indian cinema. She often seems to be too cerebral, too thoughtful, and as a result, not very relatable. Rahul Bose and Shefali Shah provide good support. 15 Park Avenue is an interesting and well made picture which could have been better, but the performance of Sen Sharma makes up for many of its flaws.","At the surface, it's the story of a Schizophreniac Meethi being taken care of by her elder sister Annu while their past is slowly unveiled. But there were so many moments that felt out of the place or repetitive or felt like pointing to something but never getting there which I thought as part of the pretentiousness of director Aparna Sen but the open ending made it all more sensible. The ending can be viewed as a very simple one and dismiss it but if you think about it there were a lot of subtle pointers throughout the film that can possibly lead to multiple conclusions about the ending. The structure of the film is crafted in a way that the more you think about it the placement of dialogues, some sudden cuts and some reveals all can mean a lot than it appeared to be.","Viewed at the River to River Indian film festival, Firenze, December 2005. The title of Aparna Sen's latest film, \"15 Park Avenue\", is an oblique reference to that most exclusive of New York streets where many of the wealthiest people in America used to have their private residences. Meethi, an attractive young woman who can be very charming and appealing in her lucid moments, suffers from extreme delusions and has been diagnosed as incurably schizophrenic, although for a time she was engaged to a sincere young man whom she called Jojo. Jojo was aware of her condition but deeply in love, however, when her spells became too traumatic, the wedding was called off and he married another woman. Meetha has always been under the care of her much older, intellectual, and domineering sister Anjali. Anjali, herself a very attractive divorced woman of a certain age, supports the family, herself, her sister and their aged mother, by lecturing on Nuclear Physics and Quantum Mechanics at the local university -- (a nice touch attesting to India's highly advanced state in the theoretical sciences, of which there is precious little awareness in the Western world). A middle-aged academic colleague of hers keeps throwing himself at her feet, but Anjali has become much more interested in the white-haired psychiatrist, Kuman, who has been called in as a consultant on Meethi's difficult case and is more of an intellectual challenge to her. This is also a tricky relationship because Kuman is still committed to his own marriage, though obviously interested in the still very attractive quantum professorial Anjali. To complicate matters even more, Jojo who has been out of the picture for years with wife and young children, suddenly reappears to share in Meethi's delusionary world which has long been centered on the fixation of being happily married to him and living a number \"Fifteen Park Avenue\" in Bombay -- an address which doesn't exist except in her feverish mind -- During this chance meeting at a Himalayan mountain resort Mheeti fails to recognize him as her long-lost Jojo, but accepts his complicity in her dream world as she feels that everyone else is against her. In the strangely mystical ending of the address on the Monopoly board which is mistakenly mentioned as \"Park Avenue\" at several points in the film ...There is actually much more to this picture than the cursory plot summary above might indicate, for the insights it provides into the lives of the contemporary Indian intelligentsia as well as for the depiction of the constant battle between cold rationalism and subjective emotionalism which is a leit motif throughout the film. The dialogue, especially in the first half of the picture, may sound excessively stiff and unreal to Western ears, but, apparently, this is the way westernized Indian intellectuals talk. Moreover, the Freudian analyses which take up much of the second half of the film, sound like a throwback to Hollywood movies of the forties when Freud was all the thing -- and makes it seem like the Indians of today are just now catching up on long over-baked Western psychology ... However -- and it is a big \"however\" -- whatever the trivialities of the plot from a jaded western point of view, it is the personalities of the players, the excellence of the acting, and the humanitarian warmth throughout which makes all else secondary. There are really two, if not three central figures: (1) Meethi, the disturbed young lady as portrayed by Konkona Sensharma, a talented actress who happens to be the daughter of director Aparna Sen, (2) the charismatic Shabana Azmi , who portrays the older protective sister and is one of India's leading older movie stars -- to see her is to understand why, and (3) \"Jojo\" -- the long-lost lover with an overweaning sense of responsibility, played by now 40 year old actor Rahul Bose, a favourite leading man of the director's and an unforgettable presence of every film he's in. Whether a striking piece of work like this will ever be seen outside of festivals is an open question, however it seems to me that an enterprising American distributor could do very well with this pic because it has universal appeal and universally appealing performers.","Indian FILM // APRIL 18, 2014 APARNA SEN'S 15 PARK AVE.15 PARK AVENUE REVIEWED AT FLORENCE Indian FILM FESTIVAL, 2005, by ALEX DELEON (alexfarba@hotmail.com) This review originally written for Amazon on Line The title of Aparna Sen's latest film, \"15 PARK AVENUE\", is an oblique reference to that most exclusive of New York streets where many of the wealthiest people in America used to have their private residences. Meethi, (Konkana Sen) an attractive young woman who can be very charming and appealing in her lucid moments, suffers from extreme delusions and has been diagnosed as incurably schizophrenic, although for a time she was engaged to a sincere young man whom she called \"Jojo\". Jojo (Rahul Bose) was aware of her condition but deeply in love, however, when her spells became too traumatic, the wedding was called off and he married another woman. Meethi has always been under the care of her much older, intellectual, and domineering sister Anjali (SHABANA AZMI). Anjali, herself a very attractive divorced woman of a certain age, supports the family, consisting of herself, her sister and their aged mother (Waheda Rehman), by lecturing on Nuclear Physics and Quantum Mechanics (!!) at the local university — (a nice touch attesting to India's highly advanced state in the theoretical sciences, of which there is precious little awareness in the Western world). A middle-aged academic colleague of hers keeps throwing himself at her feet, but Anjali has become much more interested in the white-haired psychiatrist, Kuman, who has been called in as a consultant on Meethi's difficult case and is more of an intellectual challenge to her. This is also a tricky relationship because Kuman is still committed to his own marriage, though obviously interested in the still very attractive quantum professorial Anjali. To complicate matters even more, Jojo who has been out of the picture for years with wife and young children, suddenly reappears to share in Meethi's delusionary world which has long been centered on the fixation of being happily married to him and living at number \"Fifteen Park Avenue\" in Bombay — an address which doesn't exist except in her feverish mind — During this chance meeting at a Himalayan mountain resort Meethi fails to recognize him as her long-lost Jojo, but accepts his complicity in her dream world as she feels that everyone else is against her. In the strangely mystical ending Meethi steps out of this world into the perfect world at the non-existent address 15 Park Avenue, where she is joined by her loving husband and a gaggle of joyful kids — but bear in mind that the Monopoly board location, which is mistakenly mentioned as \"Park Avenue\" at several points in the film, is actually Park Place! There is much more to this picture than the cursory plot summary above might indicate, for the insights it provides into the lives of the contemporary Indian intelligentsia as well as for the depiction of the constant battle between cold rationalism and subjective emotionalism which is a leit motif throughout the film. The dialog, especially in the first half of the picture, may sound excessively stiff and unreal to Western ears, but, apparently, this is the way westernized Indian intellectuals actually talk. Moreover, the Freudian analyses which take up much of the second half of the film, sound like a throwback to Hollywood movies of the forties when Freud was all the thing — and makes it seem like the Indians of today are just now catching up on long over-baked Western psychology  However — and it is a big \"however\" — whatever the trivialities of the plot from a jaded western point of view, it is the personalities of the players, the excellence of the acting, and the humanitarian warmth throughout which makes all else secondary. There are really two, if not three central figures: (1) Meethi, the disturbed young lady as portrayed by Konkona Sen Sharma, a talented actress who happens to be the daughter of director Aparna Sen, (2) the charismatic Shabana Azmi, who portrays the older protective sister and is one of India's leading older movie stars — to see her is to understand why, and (3) \"Jojo\" — the long-lost lover with an overweaning sense of responsibility, played by now 40 year old actor Rahul Bose, a favorite leading man of the director's and an unforgettable presence of every film he's in. Whether a striking piece of work like this will ever be seen outside of film festivals is an open question, however it seems to me that an enterprising American distributor could do very well with this pic because it has universal appeal and universally appealing performers. AMAZON FILM REVIEWS","Once in a while one come across a movie that forces one to rethink about society's reaction to people who differ from its definition of normal.Mitthi having suffered at the hands of unsocial elements,left all alone to cope with her tragedy, retreats into her idyllic world....one which according to her is the real world.....Surreal(Mitthi's world) superimposes itself on the real(her family).Mitthi, suffering from schizophrenia, forces us to reconsider our priorities about trying to rehabilitate 'patients' like them. Are we right to drag them back to our reality when all we have to offer them in ours is pain and suffering? What right have we to deprive them of their source of happiness? What right do we have to take away their joy when we are unable to help them in their sorrow? 15 Park Avenue is one of the best movies on social issues...showing us the need that any patient needs empathy and not plain sympathy.","The most beautiful film. If one is looking for serious depth, meaning and excellent performance then you have to get to watch this movie. excellent performances by the whole cast. Even more beautiful than A Beautiful Mind itself. Simply awesome!! I wish this movie entered the Oscars. I cried through the whole movie for the schizophrenic character. ..The most beautiful film. If one is looking for serious depth, meaning and excellent performance then you have to get to watch this movie. excellent performances by the whole cast. Even more beautiful than A Beautiful Mind itself. Simply awesome!! I wish this movie entered the Oscars. I cried through the whole movie for the schizophrenic character.","Aparna Sen's 15 Park Avenue is a film about nature of reality. A young delusional girl, prone to imagining things and hearing voices, possibly out of sheer boredom, is taken to be schizophrenic by her educated father and control-freak educated elder step-sister. Controlled, pitied and treated like an invalid (even if out of love and affection), she has ghost of a chance to develop as a normal person. When a boy offers to marry her, her father and step-sister passionately try to convince him against taking such a step. A traumatic experience, caused primarily due to her sheltered existence, finally takes her across the line of no return, and she lives full time in a delusional world of her own. The family and society around her are intolerant of her delusions,and want to suppress them with medicines, electric shock therapy, anything, even though they all have delusions of one kind or other of their own. Her mother doesn't see the irony in allowing a ghost-buster to treat her of the delusions. Her step-sister is a professor of Physics, teaching among other things Quantum Mechanics, a subject in which a stream of experts accept parallel multi-universes and many more dimensions in space than the 3 we see. A friend recounts with admiration an experience with a holy person claiming to hear hallucinatory voices. Far away, George W Bush has real or fake delusions of Saddam's weapons of mass destruction, and is allowed to invade Iraq. As some viewers have already pointed out, Aparna Sen shied away from attacking the mother of all delusions -mainstream religions, which is a pity. In other words, accepted reality is what a majority or an influential minority believe in. That's been the case since the beginning, and lot more powerful people than Mithali in the film, among them Bruno and Galileo, have suffered as a consequence. The film's controversial and difficult ending was necessary to show it's a film about nature of reality, and not the case study of a schizophrenic girl. All the cast have given great performances, but Shabana Azmi and Konkona Sen Sharma have excelled. Aparna Sen has produced an outstanding philosophical film.","Well its a great work by Aparnaji and some where people like this makes us believe that there is a lot more concepts till now which has to be expressed and the film is a great media to do that. Well all great actors together hence nothing to say about acting or directing but the film gave us a great message through out. It has nicely predicted the conditioning of human minds with that of the patient. We all believe that what we believe is true with our own point of view and we want to solve all the problem accordingly.Hence from the professor to the maid servant all tried their own ways. So when JOydeep was discussing with her wife he says that , 'she is looking for a thing which she will never get' and the wife replies 'are not we all?'. So that was a great comment which after the film left me with a great question, 'are we all sick?'","Very deep and thought provoking movie  much to learn as well !Let me make it point wise for better understanding for the readers :1. An Indian Army Officer's wife (Waheeda Reheman) was already a mother of 2 kids  a son and a daughter (Shabana Azmi as Anjali)  when her husband dies. She decides to marry again  with her husband's friend Sunil (Soumitra) and because she is a typical Indian woman  takes it her responsibility to beget her new husband a child !!So when her daughter (Shabana Azmi) is already 18, she gives birth to Mitali (Konkona Sen)  which also means she must have already crossed the age of 40 when she delivers Mitali ! 2. Now science has already discovered that after 30 , there are high chances of the birth of an abnormal child suffering from Idiocy or other genetic disorders since the ovum begins to disintegrate after a certain age in women  children are less immune and more prone to diseases !Moreover pregnancy problems and other related tensions & headaches are too much of a torture as one grows older ! Such symptoms creeps in the child  invariable and definitely  and this is what exactly happens to their last born child  Mitali ! 3. She is a quiet child  she is shy and ashamed to play with other kids  who must be having younger looking parents and moreover some servant had told her that the ones she addresses as brother & sister are not her own  all this makes her an unconfident , secluded child who likes to remain alone and aloof with her own thoughts. She is diagnosed as a patient of Schizophrenia and epilepsy and given medicines to keep her normal . 4. Somehow she grows up and behaves normally  singing with friends, doing facials , manicure, pedicure (all symptoms of normal life for a girl) and also falls in love. She could not stay in one job for a longer period of time but once she joined as a reporter , her lover suggested her to stick to the job. Just to prove him her worth she sticks to the job and even agrees to go alone to a Bengal-Bihar border to shoot and interview some thugs. The thugs rape her for 3 continuous hours and leave her bleeding in the corridor of the hotel ! Her life changes from hereafter  well, anyone's life would have changed after the gory rape that happened to her. Her engagement breaks off and she becomes more lonelier and starts imagining and counseling herself of her good life  with husband , children. Often they show her looking at mad people on the streets and the mad people kind of acknowledged her state / behavior as if they understood her realm probably they also belonged to the same state as hers. 5. Her step sister (Shabana) is shown as a very practical and sacrificing and responsible woman but no one really understands her. She refuses to have any good time but takes on the responsibility of the aged mother along with her insane sister  all this she was basically doing thanklessly as the sister believed that she makes her do the household chores etc. and is not letting her enjoy life !She lets go of her handsome boyfriend (Kanwaljeet) and even agrees to go for an older & not at all looking looking doctor just with the hope that a doctor in the family can be of some help after all !The brother , is as usual , shown as a typical Indian, thankless , selfish & irresponsible man  happy to be with his wife and children and not bothering about his aging mother or his sister ! 6. In the last scene, Mitali's ex boyfriend meets her again after 11 years and tries to help her out to find an imaginary house for her  the number being 15 Park avenue  Mitali is seen entering a house numbered as 15  but not Park Avenue and finds all her imaginary characters there and is very happy to see them all there  along with her husband  her ex boyfriend actually who she fails to recognize in real life  and happily leaves with them  basically goes with them  and in reality just vanishes from the scene  and the rest of her relatives are shown searching for her. Probably she will join the league of other mad people who are often seen on the streets talking to themselves or other imaginary characters !! 7. If the rape episode had'nt happened to her  she would not have become that mad... but would have survived on medicines  therefore it is highly recommended that Ladies should not take up such jobs as reporters and go alone in places inhabited by thugs ! Parents should be more careful .","As everyone knows by now, 15 Park Avenue is the story of a schizophrenic girl and her half-sister.The manifestation of Schizophrenia is still viewed as being an illness which people often feel might disappear if ignored. There are also those, who, however far fetched it may seem when it's shown in the film, think that the illness manifests itself as a result of some sort of supernatural influence. I think Ms. Sen deserves a lot of praise for \"15 Park Avenue\". She has done a good turn, not only to the general public, but also to those who deal with schizophrenics ... relatives, social workers, psycho-analysts. The film actually helps in dispelling a lot of myths and misconceptions about the exact nature of this psychological disorder. I'm told that the film is largely based on her own personal experiences with a person very close to her, who suffers from this mental affliction. To that effect, I'm sure that none of what has been shown, is blown out of proportion ... on the contrary, it is a true representation of facts.The performances are good, on the whole, as can be expected. Konkona Sen Sharma, Shabana Azmi and of course Rahul Bose, are very good indeed. They emerge as very \"real\" characters ... credible enough for one to be able to identify with them at times. People may think me terribly queer, but I think there are moments when one can identify with Meethi as well! I suppose all of us have a streak of \"insanity\" inside us .... perhaps some more than others. These are the people who are singled out. After all, don't we all have our secret fantasies and dreams? Impossible ones, at times? Would we be dubbed as being \"off our rockers\" if people could glimpse into these areas of our minds? Would a person with low self-esteem, be considered a schizophrenic because he/she shuns company ... preferring instead to live in a world of his/her own because that's the only space where there is a sense of security?Konkona, as Meethi, is outstanding!! Her performance is so effortless ... she lives her part. She has shown the ability to lull the audience into forgetting the divide between reality and acting! A case in point is the part where she's distressed at the scene, shown on TV, of Saddam Hussein's arrest. Her reaction seems so uninhibited and intense ...as if she's really heart-broken at this tragedy! Her brand of Indian English too, is so spontaneous and natural. However, the same cannot be said for at least a couple of the other actors. Kanwaljeet and Waheeda Rehman, splendid actors both, seem ill at ease when delivering their dialogue in English. Their diction is less than perfect ... stilted and affected, the fact that they are making a supreme effort, becomes more than apparent. Their dialogue delivery is jarring and tends to break the smooth flow of the unfolding of the tale.The brutal rape of Meethi (Konkona), seems somewhat unnecessary. Any other incident would have sufficed just as well, I feel. The point here is that something triggers off the extreme manifestation of the illness. As the psychiatrist explains, one cannot, with any modicum of conviction or certainty, say that the incident of the rape was instrumental in bringing the hitherto latent propensity towards schizophrenia, to the fore. Then why are we subjected to the scene where Meethi lies bleeding and unconscious. Was Ms. Sen trying to make a social statement about the state of politics in our country, where the voice of the masses is silenced by a handful of people who resort to violence in order to stay in power?? If so, then the scene of the rape is warranted but not strictly in the context of the main body of the film.The ending seems somewhat abrupt. Is the audience expected to find a solution? Where does Meethi disappear to? Does Ms. Sen want us to feel that perhaps what the psychiatrist says about whose reality is more real and hence credible, holds true? In other words, is she trying to say that we are not without bias when judging who is on this side of the fine line between sanity and insanity? I'm not very sure.A thought-provoking film on the whole and well worth watching. However, IF you are the sort of person who likes things to be neat and tidy ... everything cut and dried, with a water-tight solution to each issue that comes up ... this film is clearly not meant for you!","From \"36 Chowringhee Lane\" to \"15 Park Avenue\", Aparna Sen has indeed traveled a long way. If the first one goes down in history as a débutant's clean sweep the latter will definitely carve a special place as a \"mature\" film. Until you see 15 Park Avenue you cannot imagine feeling thrilled and moved at the same time. Thrilled to see the director's ingenuity and agility in portraying seriously challenging situations and moved by the sensitivity echoing throughout the film. It is not a movie that merely makes you feel 'tchh tchh, how difficult life must be for schizophrenics', but makes you ask a much deeper question about the reality that you see and believe. Sen has done a brilliant job in highlighting this supreme fact of our existence that we all are, in some way or other, trying to live in a make-believe world of our own, trying to run after mirages called happiness, peace, contentment. Along with the depiction of a delusional mind, Sen's magic has brought forth many little nuances of human relationships as they sustain stress and strain. The fact that at times we all lose calm, break down, make wrong choices, be haunted by guilt, behave selfishly and so on, is captured with extreme adroitness by Sen. She showed the cruel dilemma which Shabana had to deal with all her life, of having to choose between a schizophrenic sister and a normal life with a husband and kids for herself. And in the act of always being beside her sister, always being a strong persona, providing support, making judgments and so on, she unknowingly cut off some of the oxygen that her sister needed to bloom. Isn't this a very harsh truth that at times, in an attempt to do the best for someone, we strangle their assertiveness and end up hurting their self-esteem? Of course Konkona's and Shabana's acting deserves laurels as always because had the ingredients not been so good, the dish could not have turned out to be so extraordinary. Aparna Sen once again made a masterpiece of a movie for those who crave for some \"food-for-thought\" . Bravo !","After Mrs and Mr. Iyer this is yet another very good film by Aparna sen(mostly in English). In the earlier film she treated a contemporary political environment and its effect on individuals. In this film it is the impact of mentally disabled member of the family and its impact on the family. As a parallel sub theme she treats a philosophical concept on \"reality\". It is a film which leads to thinking after seeing the film.Mithee the younger sister (Konkana Sen Sharma, the daughter of Aparna Sen) is suffering from Schizophrenia being taken care of by the dominant elder sister Anjali (Shabana Azmi) . Mithee after her marriage with Jojo and separation from him believes that she is still with JOJO and her five children in 15 Park avenue in Kolkotta.(there is no such address in Kolkotta-it seems there is one in New York) and she is intense in her belief. It is almost like an intense religious belief. Ultimately what is reality? In one scene she tells Anjali \"if I tell you that you are not a professor but only imagine that you are a professor\". The open ending reflects this reality. In a supposedly search for her home in park avenue, Mithee is lost. The penultimate scene is Mithee looking at a group of five children playing and her looking at them with joy of returning to her family and then she is lost. About this concept of reality I am reminded of another film of fifties called HARRY with James Stewart. The protagonist believes that a big sized rabbit (?), called Harry is always with him and he is always conversing with him. At the end even the doctor believes perhaps there is Harry. What is reality, is it what the protagonist believes or what other believe Shabhna Azmi dominates the film with her sterling performance as the strong elder sister with undercurrent of frustration. Konkana Sen Sharma gives equally befitting performance as the schizophrenic.Yet the film is not as tight as Mrs and Mr. Iyer. There appear to be some loose ends. And perhaps there are too many characters. Those who want a closed ending may not appreciate the open ending here. But the ending befits the theme of the film.Yet another good film by Aparana sen.","exquisite!! in simple words... both Aparna Sen and Konkona Sen seem to understand each other quite well or maybe they both are just too good.this might just be her best performance as an actor and Aparna's best as a director. yeah maybe better than Mr and Mrs Iyer. Konkona plays the role of a schizophrenic. Shabana Azmi plays the role of Anjali,Mithi's(Konkona Sen's) elder sister. Shabana Azmi made the best out of Anjali's character for she had to play a strong,responsible,arrogant role of an elder sister who had the full responsibility of her family. Aparna Sen has beautifully crafted Anjali's character,a strong woman who had to sacrifice her personal life,her love for her family.Mithi's behavior was'not juvenile at all,for you can expect this from most of Indian directors for this role.looks like a lot of research has been done to understand the role of Mithi,a schizophrenic. When at times Mithi is a normal,sweet college going girl,she also scares you when she is shown ill..both the sides have been beautifully judged and played..believe me it at times reminds you of the girl in Exorcist..not that scary though.. Overall..Marvellous piece of work by Aparna Sen,Konkona Sen and Shabana Azmi..."],"review-user":["shanfloyd","emailraja","gauravb21","rekha-r-nair","Chrysanthepop","kunalsen_7684","nikux","comeundone","kjaggu","sattire_gal","Aam_Aadmi","tufan1951","Peter_Young","Jithindurden","alexdeleonfilm","Barev2013","candida-100","sowmyashree","manjits","pande_rome","g_aparna","kammaz","debi_chat","venkat1926","mailsunny-1"],"review-date":["25 January 2006","19 February 2006","10 January 2006","9 January 2006","10 March 2007","1 May 2007","4 February 2006","14 January 2006","6 January 2006","25 February 2006","1 February 2006","7 April 2006","18 April 2017","15 April 2018","19 November 2016","1 December 2014","9 July 2007","4 April 2007","26 January 2007","14 September 2006","29 March 2006","15 March 2006","1 March 2006","12 February 2006","11 January 2006"],"review-rating":["6","9","7","9","7","7","8","8","5","9","10","9","9","10","10","10","10","7","8","5","7","8","8","8"],"review-title":[" A quite mature theme and excellent performances... but Sen is not at her creative peak.\n"," A very courageous exploration of perception and reality. Oscar worthy!\n"," 15 Park Avenue : A Search within ...\n"," How real is reality?\n"," Aparna Sen's Ambiguous Masterpiece\n"," Deconstruction of the Persistence of Memory\n"," A watch for people who like off-beat movies, a must avoid for the ones who just see movies as an entertainment tool.\n"," meethi's reality\n"," A movie for a different crowd\n"," 15 Park Avenue\n"," 'Address'ing the taboo subject of mental illness\n"," 15 park avenue(a movie that really moved me)\n"," Magnificent Konkona\n"," What is real?\n"," Exceptional Indian Study of Schizophreniai\n"," A minor Bengali Masterpiece from Aparna Sen\n"," What is 'normal'?......sympathy or empathy?\n"," excellent\n"," An outstanding philosophical film\n"," Are we all sick?\n"," The other side of Schizophrenia .\n"," A guideline to understanding schizophrenia\n"," An intellectually and emotionally stimulating movie\n"," sterling performance by Shabana Azmi\n"," exquisite!!\n"]}