{"review-url":["http://www.imdb.com/title/tt0498878/reviews"],"review-text":["Most of the criticism of \"Attack of Show\" is from people who are unfairly comparing it to an old computer TV program called \"The Screen Savers.\" People are upset because G4 decided to cancel the \"Screen Savers\" and replace it with the pop culture based \"Attack of the Show.\" To compare the two shows is like comparing apples to oranges!\"Attack of the Show\" is a unique hour long program that covers current Generation X/Y culture. It features segments on movies/television, panel discussions, video games, new DVD releases, sex advice, new gadgets (MP3 players, cell phones, etc), comic books/graphic novels, magazines, and internet fads. It's a fun show, definitely worth checking out you are in your 20s or 30s. I give it an 8 out of 10.","As a flagship show, Attack of the Show (AOTS) is endemic of the larger fall of G4 TV; it is a show (and a station) that has fallen so far that it parades sex to try and cover its glaring faults. Its predecessor, The Screen Savers, was a venue for troubleshooting technology problems and scouting out the latest and greatest in technology. It was a nice show with a likable staff and it was fun to see some of the modding and other experiments the crew could put to together.The acquisition of TechTV by G4 bothered some longtime fans of the station, but early returns were actually promising. The emphasis on gaming was a nice addition and I really enjoyed a lot of the coverage of E3 and other big entertainment events.Unfortunately, AOTS now stands as but a shell of its former self. Those overseeing the channel have shifted the focus of the channel away from technology and gaming and toward anything that might elicit drool from young adult men. The result is that AOTS spends as much time parading Olivia Munn or touting the adult film industry as it does covering games. It is so bad it is practically unwatchable.While some may get puerile joy out of this sort of thing, those who genuinely enjoy gaming may wonder where the good coverage went. Equally troubling, young gamers who might tune into G4 thinking their getting gaming - that active gaming group between 10-15 - are instead being fed things aimed toward a more mature audience. On a channel like HBO or Cinemax, things like that are expected. On G4, it's tragic.At least SpikeTV, another male-aimed channel, has good programming like CSI. AOTS, and G4, has very little good left to offer.Too bad, really.","I cannot hate on the show. When the old (and better) tech TV had to hit the bricks, the channel was reformatted and new shows stepped in. \"Attack of the Show\" is the replacement for the Screen Savers, with 3 co-hosts in the beginning. They were Kevin Rose, Kevin Pereira and Sarah Lane. Brendan Moran came to be something of a co-host as well, but he mostly did prerecorded pieces for the show. Kevin Rose decided to leave the show, and eventually there was a contest to see who would be the third host, but that didn't pan out for some reason.Eventually (I just learned this from this very IMDb messageboard) Sarah Lane and Brendan Moran moved on because (hey, this is what I read) the two got married. That was a big secret to me! Now there is a new female co-host, the not-as-hot (my opinion) Olivia Munn. She's hiding something in those tops she wears, while Sarah Lane had a perfect body and she wasn't afraid to show it.AHEM! Sorry.\"Attack of the Show\" deals with everything young people want to know about. It's music, movies, comic books, the internet and television. This is what's great about the show. If you don't want to bother with scouring the net or waste time watching MTV, you can get all you want on AOTS. Some segments and bits they do are funny. They have regular guests and contributors who are in the industry, as well as guests who range from insignificant internet stars to actual big names.Even though the hosts aren't as geek as I'd like them to be, I still have found \"Attack of the Show\" to be entertaining, even with its latest lineup.","Attack of the Show! (formaly screen savers) is a live gaming and entertainment TV show shown weeknights on G4 in the United States and G4techTV in Canada. It is co-hosted by Kevin Pereira, Sarah Lane, and Brendan Moran. On occasion, Wil O'Neal will fill in for any co-host when they're not.Often, before the theme song and introduction to an episode, a short skit may include the co-hosts changing the appearance of the set, or involve Office Jesus, a passive-aggressive Jesus who haunts the workrooms and cubicles with practical jokes and antics. AOTS presents gaming and technology related news, product demonstrations, software clinics, MTV-style technology entertainment, interviews with notable people, and such original segments as:Top of the Show - Short segment at the start of each show where Kevin and his co-host (typically Sarah) review new and interesting gadgets and/or websites.The Feed - Technology news delivered by Sarah Lane.Frugality (formerly \"Dark Deals\") - Cheap and low-cost deals on the internet; sometimes free Gems of the Internet - The Internet's strange and bizarre websites Damn Good Website - Sarah's selection of the best internet websites. Live Music Thursday (formerly Boost Mobile Live Band) - Live performances, often by little-known, independent artists shown on Thursdays (formerly on Fridays).It Came From eBay - Strange and bizarre items being sold on eBay, from a Hitler Skunk to a bull penis walking stick and more.Chat Questions - Segment at end of each show where the hosts answer questions from the chat room while sitting on The Couch.DVDuesday - Chris Gore's selections of DVDs, and rates them as: Buy - Many extras, great movie; excellent Rent - Do not buy, but check it out; good Pass - Do not buy or rent at all; bad User Created - Showing the best of AOTS-themed creations made by the viewers of the show.The Lush - Segment in which the hosts discuss alcohol related websites, drink recipes, and drinking games.First 50 - Kevin plays new games for 50 minutes and gives a review.Fresh Ink - A new segment that displays the chosen new comics that came out the week of the airing, such as Desolation Jones. This segment features a special correspondent, one-time X-Play senior writer, recently promoted Blair Butler. Buy - Purchase because of the comic's quality Browse - Look at it on the stands for a few minutes, but isn't a must have Burn - Comics that are not worthy to be read, rather fitting to be burned or shredded!Jimmy the Geek - A segment where a producer of the show, dressed up in costume, gives his picks and information on big (football) games.As of January 2006, Live Music Fridays were moved to Thursday and Friday shows are now a \"week in review\" show, called a Mash-Up, with clips from the previous four days.there used to be another episode featuring margarita fridays which was replaced by the lush.","I watch the show every day and it is very entertaining. It provides updates of tech news, video games pretty much everything geek. They are also the official broadcasters of E3 and Comiccon. If you are a geek, gamers or anything really, you will enjoy this show. They have definitely upped their game since the guy below me's review (2006). It's the only place that I get my tech info. Kevin Pereira and Olivia Munn work beautifully with each other and the show always has segments referring to things in the game, movie, comic... Universe. If you know those universes you will understand the jokes. Long story short, aots is a hilarious show that gives me and anyone all the news about anything and everything that you care about. I'm watching it right now as I type this, they are 'in' San Diego covering the red bull air races. Sweet.","The hosts of this show are terrible... I've sat through the show multiple times and not even cracked a smile. These people just aren't funny. Plus they are just unpleasantly awkward and impossible to relate to. The skits are horrible, only made worse by their terrible acting and their capitalization on sex. I'm not biased by having seen Screen Savers as other people have mentioned... I am young and love gadgets and stupid random humor... But this just simply a bad show and I don't get why it is still in a prime time slot. Their short bits during commercials of other shows are pretty good because they are informative and short... But I change the channel when Attack of the Show actually comes on.","This show is what happened to The Screen Savers after G4 got its hands on it, taking it from a useful source of computer-related information to a show that had as its high point the shoving of a miniature web server up someone's posterior.As G4's ratings plummeted, they moved away from their original target audience, gamers, to generic hormone-driven young men, adding eye candy to the staff and a sex advice segment. Now even the gamers who applauded the show initially are turning away in disgust. I look forward to the show's, and the network's, overwhelmingly overdue and well-deserved demise.UPDATE: O frabjous day! AOTS is over, as is G4 as a whole. In a single lapse into worthwhile viewing, there was a Newhart-style ending with Leo Laporte telling Patrick Norton what a weird dream he had.","When I 1st seen Screen Savers-about 2002 up 2004.... It was a decent show-about PC stuff-other useful hardware suggestions-great skits-it was great...Then Kevin Rose and the others just disappeared...Sara Lane led the show with the other Kevin-even though he was smart-Sarah thought she was a prima donna or star or something...Her finds on the net on Screen Savers wheren't bad at 1st- then it just got boring...She was boring-Good looking yes...But the star of the show...Heck No!!!!G4 TV in itself in the beginning was fun-know it's reruns-other show's that really have anything to do with gamming except X-Play-but the current 2006 E-3 coverage-that all G-4 soldout to Sony for the PS-3-dissing the X-box-360....Well anyways I give AOTS * .....","Really the only thing that I ever watch on the G4 network is \"Attack of the Show\" mostly I catch it on late night reruns. I mostly watch it for the internet news and it's fun seeing the wild you tube video clips. And on occasion the latest movie news is informative and from time to time the show shows trailers of upcoming blockbusters before anyone else. Also the interviews with stars and computer tech people is okay, and the games and DVD reviews are worth a look. Most of all the spice and icing on the cake is the show's good eye candy of young hot sexy female host. First up is Candace Bailey yet she's a runner up to my main viewing squeeze Sara Underwood. Sara's so hot I remember her \"Playboy\" past and her recent \"Maxim\" photo shot of her in a flowered pink bra was so hot! Overall the series \"Attack of the Show\" was a fun little ride it never took it's time to serious, but it was a fun informative watch with some Sara sugar and Candace spice.","This show is one of my favorites. I love coming home and sitting down to watch AOTS. Great, funny and informative show. The one thing I agree with viewers is it's a bit to inappropriate at times. But there are times when that can be funny. The hosts I enjoy. Kevin is hilarious whenever he torments Candace, who always has something to comeback at him with. Watching The Feed and Gadget Pr0n are my two favorite segments of the show. I am a total nerd (@ times) and watch for new hardware or news about my favored companies. But other than that I don't pay much attention to anything else on the show unless it catches my interest, like humor. Overall \"I give this a 4 out of 5\" (9/10)- Chris Hardwick.","It is true the show and the very station has become somewhat mediocre in comparison to the former line up. Popular and gamer geared shows such as \"Judgment Day\" and \"Portal\" are replaced by re hatches such as \"Cops\" and \"Unbeatable Banzuke.\" But the reason why in my opinion is much different than trying to sex up the network. Its very easy to point the blame at the \"sex sells' theory that plagues the televisions world, but i think the change is a result of big business taking over a small network. The network use to be great, i stayed turned in daily in fact, but the great things they did costs a lot of money. Thus to obtain more money they need more high name sponsors, and with sponsorship comes changes, usually negative one.Now I admit the change on cheat from Corey Rouse to a sexier ex cheerleader Kristin Holt(Adams) was a bit of a sex sells ploy, but there are still some good things about the network. The much debated attack of the show does focus on sex a lot at times, but what is it that gamers do with their spare time, i believe the concept that gamers do nothing but play games and get fat is absolutely retarded. I have a life and the new content to the network attracts the non hardcore audience. Now my girl will watch G4 with me because it just doesn't talk about games anymore. Now by no means am i saying that the changes are good, but they are not all bad, and you can't fault them for trying to bring in new viewers. So my stand is one of neutrality.","I watch Attack of the Show daily, as it tends to cover subjects that are passed by other, bigger news shows. The flaws that come with watching this tends to come from the hosts of the show and the lackluster comedy here and there. While good to look at, the hosts are not the most charismatic bunch of people, in fact, I don't think a lot of people will be able to relate to them. The comedy really falls flat, as the segments and skits they produce are nicely conceived, but poorly executed.Other than the comedy, the only reasons to watch the show are...THE FEED - A short, five-minute segment discussing the current events dealing with pop-culture, such as films, TV, and games.DVDUESDAY - A segment that usually airs on Tuesdays -- sometimes it is pushed back a day or two depending on releases -- that is good to get comments on new releases, though Chris Gore has a one-track mind, and what he finds as bad/good, you might find good/bad. His appreciation of films would make other critics look away in embarrassment, at times.THE LOOP - A ten-minute (can be longer and shorter) segment delving into a subject recently mentioned in a prior show or from The Feed. It is a conversation between the host and a guest (sometimes more than one) that can be easily passed-on due to some of the lame topics they discuss.All in all, there's just not enough intriguing stuff to keep this show afloat. The segments get disappointing should nothing \"big\" be happening, the hosts are lackluster, and as far as entertainment, it is scarce.I could only recommend Attack of the Show to gamers and fans of anything technological.Fans of anything pop-culture, you may want to stick with the parts I listed above.","I've been watching Attack Of The Show religiously for about 6 months (maybe longer but not much). I was very infatuated with Olivia and I found Kevin to be very witty and the repertoire between them very good. Lately though it's starting to wear thin due to many factors for me. First my favorite segment is the first 15 minutes called Around The Net, that shows 5 video clips that you would find on a site like Youtube, that are generally funny, or of people getting hurt inadvertently (some intentionally). Umm, this when watched 4 to 5 times a week shows again and again the same stuff, I really haven't seen anything that good and I can only laugh at people actually probably breaking their necks and being paralyzed so many times. The show is like a Late Show wanna be/Colbert Report wanna be with it's politics also, if you do not live in a blue state and are not an automatic liberal, this humor gets old also, McCain is old, yeah yeah, whatever. Libs have no guts to make fun of themselves because they are not smart enough to realize that would endear themselves as having a sense of humor that they can laugh at themselves, so it's almost every show bash McCain or Palin, sheesh. So we get the same old vids of people getting hurt that we are supposed to keep laughing at and then some leftist political humor that never laugh's at itself out of it's own weakness. I'll keep watching since I watch at work and it's all that's on, hoping that I'll be entertained but it is getting somewhat old. I did like the fill in host's of Chris and Alison though, they were actually a good change of pace; maybe this show could do a rotating host thing. Olivia who I thought at times in the beginning was really funny has resorted to this constant pouting response and it's getting old, lol. 7 of 10; it will keep you in a young mindset which is good if you're a younger Baby Boomer like me (mid 40's). Maybe a cartoon of the day would be another segment they should do, there is a ton of stuff available they could use. 7 out of 10 (in 2008)UPDATE+++++It's late 2012 now, still tune into AOTS to catch around the net which they now do not show at the top of the show all the time and do not show 5 web videos anymore now it's like 3 videos. So the main reason why I tuned back into the show has been cut back. Kevin and Olivia are both gone, both were long time hosts. Kevin was a total liberal metro sexual I guess he got too old for the age demo of the show (under 21), or maybe he realized staying on a G4 show his whole career would typecast him, I can't say I really miss him since he was such a pansy and very brainwashed for anything Democrat and not white (years and years of him chanting USA USA and making fun of American success is basically just a liberal propaganda thing, it's not comedy). Olivia bailed out and rightly so she's on to much bigger and better things. She was the reason why I loved the show. So who is there now? Candice who is from Florida and OK but not nearly as hot as Olivia, and a rotation of even more metro sexual leaning and out right gay \"men\" host. This show has NEVER had a guy host on who you would think is actually manly or cool, never. The closest was the stand up comedian guy who did another show on G4 called The Soup I think, and I have not seen him enough oh and they did have a back packer guy do some spots but he's few and far between, so thats about it. It's not funny anymore, the chick hosts are not so hot or funny or raunchy and they cut most of the Around the Net segment out. Will I still tune in? If it's on when I'm home but thats about it. The show has jumped the shark with Kevin and Olivia leaving. Bring back an Asian woman who's hot I guess (or another ethnicity then pale white) to improve the show. Late 2012 rating 3 out of 10"],"review-user":["jedihurley","joshofstl1","VichusSmith","garrettc-1","Fabiobollinger","jcleveland","jamesjones01-1","TufenHuden","blanbrn","clk-93-288606","teztiment","fearfulofspiders","verbusen"],"review-date":["28 October 2006","13 February 2007","17 May 2006","3 March 2006","21 May 2009","5 July 2010","30 August 2006","5 June 2006","19 November 2012","29 June 2011","6 February 2009","27 September 2008","24 September 2008"],"review-rating":["8","2","7","8","2","1","6","9","6","5","3"],"review-title":[" Great Show About Current Pop Culture\n"," A once-decent tech show that has degraded to a senseless sexpot\n"," It's Screen Savers \"sexed-up\" and dumbed down\n"," It is one of the best TV shows ever!\n"," I love it, they are putting more work into it.\n"," Just a bad show... It's just bad.\n"," Makes the local cable access channel look like PBS\n"," Attack of the Show Bites!!!!!\n"," A good news show for the computer, game and high tech geek nerd, plus it's spiced with some eye candy!\n"," Funny, informative, and inappropriate?\n"," Neutrality\n"," Not For Everyone, But It's Okay...\n"," It's OK, It Wears Thin If You Watch Everyday\n"]}