{"review-url":["http://www.imdb.com/title/tt0450258/reviews"],"review-text":["Alien Express is one of the worst movies I've bothered to experience.The plot is predictable. The aliens look like rubber sock puppets. The effects would have been mediocre in the 70's, but are just atrocious by today's standards. Couldn't they take a shot of a real train instead of using an obvious model?The acting isn't great but, really, the dialogue is the worst part. It gouges its way into your mind. \"Don't you die on me. Not now.\" If you ever manage to suspend disbelief long enough to be absorbed into the movie, you'll rapidly be jolted painfully back to reality by the aliens, the model train, or the clichéd dialogue.The only reason I didn't give this movie a \"1\" is that it doesn't deserve to be rated so badly that some poor suckers might watch it for the pleasure inherent in a truly bad film.","This is a truly awful film. Lou Diamond Phillips simply calls this one in. The use of miniature models of the train are laughable. The plot seems to develop on the run (there is an alien on board; oh, and an eco-terrorist is on board too; oh, and the conductor is dead and the train is out of control; oh, and the train is going to run into another train one hour ahead; oh, and that train has nuclear waste on it...). I mean, come on really! The alien monsters are not scary (although there are a lot of them), and the acting is abysmal. Check out the guy playing the \"next President\" - do you really think he could be President? For goodness sake, he has spent his whole acting career playing bad guys!","\"Eh-heh eh-heh hey, dude - look at these aliens. They're like - biting the humans and stuff! Eh-heh eh-heh eh-heh\" This must rank amongst the worst movies of all time. It's utter drivel for anyone with a modicum of a brain. Sure, you have the reviewers on the payroll who give glowing reviews and vote highly for this abomination but it's easy to tell who these sell-outs are. Their reviews are TOO good. To give a movie like this even a mediocre review claiming it had some B-movie remedial appeal would be a glowing review! Calling this a great movie tips the hands of the corporate shills.But enough of that.This movie had about all the bad characteristics a movie can have without being SO bad that it's enjoyable just to laugh at. The old Japanese 60's monster films had a quality that this movie lacked. At least in those 60's films you could laugh at just how bad the rubber monster suit looked. Or laugh at seeing the strings holding the space ships, how the models dangled on the strings and how the flames curved UPWARDS out of the back. Those movies made fun of how BAD they were. Alien Express (aka Dead Rail) seems to actually think of itself as a GOOD movie - which makes it incredibly absurd.The effects were awful by today's standards. Beyond awful. However not quite as bad as the 60's monster movies hence they lacked the comedic appeal. The plot and dialogue were about as sophomoric as I've ever seen, made even worse by being every bit as predictable as you might expect. I won't even point out the plot and logic holes in this one; it just wouldn't be fair to this pitiable plot (plus it would take to long to even get started). Most of the acting was awful; Lou Diamond Phillips must have been very desperate to agree to touch this one.SciFi Channel is rapidly becoming the \"cheap thrills channel\", producing movie after movie without an iota of concept or intelligence in the lot. I can only wonder - why bother?Don't bother with this tripe. It doesn't get any worse.","I am a big fan of sci-fi movies. So, when I saw this movie in the EPG, I thought I was in for a pleasant evening. What a disappointment ! Such a poor display of \"special\" effects I could not imagine in 1980, but in 2005 ? Come on, why would you do special effects of an helicopter flying in the desert when you can film a real one for a much lower price (I guess) ? And those killer \"muppets\"... well, I could do better than that in a couple of hours in the garage. You can expect to have a low budget on a movie, but I don't think it's reasonable to have a low movie for any budget. As for the \"star\" of the movie (I use a lot of quotes tonight...), Lou Diamond Philips, the guy is not even remotely an actor. Maybe he should have stayed to the martial arts movies. All in all, an awful movie. Maybe I am in a bad mood tonight. Then again, maybe not. A sincere 1 out of 10.","What do you get when you put Lou Diamond Philips, Todd Bridges, Barry Corbin with a bad toupee, and an alien all on a train? You get a very bad movie called \"Alien Express\" or \"Dead Rail\" that would be more entertaining on Comedy Central's old series \"Mystery Science Theater 3000.\" You name it, this awful movie suffered in areas of acting, plot, storyline, and special effects. In fact, the exterior passenger train shots looked like the production staff used a common HO scale model in front of a painted background! The rest of the special effects goes downhill from there.The plot is very predictable and is similar to two 1970's movies called \"Horror Express\" and a disaster movie called \"The Cassandra Crossing.\" At least \"The Cassandra Crossing\" had a better cast, an engaging storyline, and real train scenes.If you want a good laugh and a movie to mock at a \"B movie\" party then watch this; otherwise, \"Alien Express\" derailed long before departing from the station!","I stumbled into this mess of a movie whilst too amped from viewing sports history. The Giants just upset the Patriots in the Super Bowl, and I couldn't sleep. I assumed/hoped this movie would put me to sleep, so I didn't surf away after only 1 minute, as I probably should have. Life is too precious. Puzzled, I IMDb'd it, and soon ended up in the reviews. They were better than what I was simultaneously watching, and I could only try/hope to watch the whole movie just to verify the unanimous disdain (excepting one apparent idiot). I don't know exactly how to say this, but I think that all of the reviews sell this movie short. It is worse than Plan 9. It takes the cake. It's unbelievably stupid. Actually, that last sentence could be misinterpreted. Not only is it unbelievable, it's unbelievable that it was even conceived and completed as a \"movie\". And it's way beyond unbelievably stupid. The hemorrhoid commercials every 12 minutes were a real relief, and I've never felt that way before! This movie must have been a pet project of Sci-Fi channel's accounting dept., as it can only be some sort of tax write-off against capital gains. If that's the case, the accountant should get any positive recognition as a true visionary. Other than as a wonderful way to rewrite off all of the company's cheepo garbage props out in desert storage (one last time, maybe), and give a bunch of slumming B-actors, a busman's holiday out in the desert, it must have been a way to hold a clinic for all of their new upcoming producers, directors, techs, etc. They should all consider themselves survivors. And they should all look for new lines of work.A truly deplorable effort. But not exactly a waste of time. I now have a new bar to judge other movies by. And I can't wait to revisit Battlefield Earth. That movie is infinitely better than Alien Express. And to think that they left room for a sequel!!!","It is way beyond me how this script was ever sold much less produced and distributed. The dialogue was so bad it was sickening. The train and helicopter scenes appeared to have been done on flash cards by high school students. Lou Diamond Phillips must have hidden under his seat when this --- this \"movie\"? was shown at a private screening afterwhich he most likely left by the back door. The only emotion it aroused in me was pity for the cast, they had to \"bite the bullet\" to get through this one. I couldn't stand to watch all of it, it was so predictable that it was funny. Who knows maybe it will be picked up by one of the networks as a situation comedy.","This is fairly typical for the Sci-Fi Channel: one-dimensional characters, a ridiculous plot, and terrible special effects. We've got some alien sock puppets loose on a train, and Lou Diamond Phillips does his best with what little he's given to eke out a performance. And save the day. Everyone else in this is utterly dispensable; the ex-wife who goes through the time-honored cliché of first disliking Lou, then of course comes to love him again at the end. The obnoxious State Senator who gets munched early on, and a gaggle of dull security guards who run around a lot. Then there's an eco-terrorist who is in this movie for absolutely no reason whatsoever, except to provide us with 3% more running around. He spends the whole middle part of the movie hiding in a box.The special effects really deserve their own paragraph. We start with a meteorite that flies through the air, trailing flames behind it, at about 100 miles per hour. According to the physics of this movie, if you exceed the posted speed limit in your car, atmospheric friction may cause you to burst into flames. Then it lands on the hood of a car, coming in horizontally. Sort of like a velcro ball landing on a velcro floor I guess. It really doesn't damage the car much, just bends up the hood a little bit. Later on Lou gets in a helicopter and goes chasing after the train. Even though the train only had a two minute head start, it takes a good half hour to catch it. The CGI is so bad that the helicopter looks like it's as big as the hills it's flying over. Then it flies into the side of a mountain - this effect must be seen to be believed. It looks like they took a jar of gasoline and threw it against a wall, then superimposed the flame effect over the helicopter. About 10 times too big. No wonder the helicopter couldn't pull up in time, it was carrying five tons of nitro glycerine. Then the eco-terrorist eventually blows himself up, but instead of exploding in all directions like most explosions do, he explodes upwards like a cannon aimed into the air. Then there's the whole deal with not being able to stop the train because that would allow the little aliens to get off, but it appears that the aliens can actually fly faster than the train is traveling, so why this would keep them on the train I have no idea.Overall, if you've got a couple of hours that absolutely need killing, and it's down to this movie or reruns on the Food Network, well, come to think of it, some of those chefs are kind of cute. Usually these movies have at least one or two things about them that make it possible to sit through them; maybe there's a sexy girl, some T&A, or a character that actually has some personality, or some suspense or, well, something. I really didn't see any of that here.","I did my best to watch this two hour fiasco. It combined the awful special effects and plot of the original \"Blob,\" with an execrable boosting of the (outstanding in the original) screenplay of \"Runaway Train.\" The only explanation for this movie is that someone needed to take a huge tax deduction and figured they'd combine it with a shot at hosting a casting couch. What an incredible stinker! Lou Diamond Phillips is anxious to show us why he will take any part, no matter how bad. Barry Corbin continues his career as a typecast creep, a U.S. Senator from Texas and plays it well. He should next do the lead role in the story of Trent Lott or Jesse Helms. The women in this flick all seem to have gotten their roles as consolation prizes in the Fay Wray Memorial screaming contest. Special effects are unbelievably bad. H.S. kids in film class in North Dakota could have done a better job. The writers must have pulled a heist at the cliché bank to accumulate this many. I couldn't watch any more without being forced to sit in the Clockwork Orange chair. I have no idea how it ended, except obviously, 119 minutes too late. Ugh! Caveat emptor.","Really don't care that no one on here likes this movie,, i do , and that's what this review is about. Lou Diamond Phillips is great in this comedic role. that line about train a b and c is now to me an instant classic, the cg is great, yeah train looks a little fake,, but the aliens wow do they ever rock,, Todd Bridges,, where's Arnold, and Mr. Drummond,, wow he's been out of the loop , guess that's what jail does to you.. a bullet train is on it's way to Las Vegas with the Senator for him to deliver a big speech, a meteor has just hit,, and now all of a sudden we got aliens running loose aboard the train, and our hero cop has to save the day, to make matters worse his ex-wife is on board arguing with him. i just thought this movie was so wonderful,, a must see if you like action.","Watching ALIEN EXPRESS inspired feelings of awe, shock, pity and, yes, sheer terror. To think that actors who have done good work in the past should come to something like this. The horror, the horror.Tell me if any of this sounds familiar.A train especially built for a political campaign is on it's way to Las Vegas for a big rally for the candidate, a Senator from Texas (Barry Corbin, the only actor with roles both ALIEN EXPRESS and NO COUNTRY FOR OLD MEN in the same decade). At a railroad crossing in Utah a meteor incinerates a car waiting for the train to pass.The train stops. Local law enforcement is summoned. Oh, can it be? The Senator has a lovely young lady (Amy Locane from CRY-BABY and MELROSE PLACE) who just happened to have once been married to one of the officers answering the 911 call. Lou Diamond Phillips (STAND AND DELIVER, LA BAMBA) is the ex-husband.Meanwhile eeeeevil aliens have managed to stow away on the train.The train leaves. Lou gets his buddy to pilot a helicopter so that Lou can drop onto the moving train (about 70 miles per hour) so that he can save the day. As the buddy's reward, he crashes the helicopter into the mountain.Which is another example of how poorly written ALIEN EXPRESS is. The cop hero's sidekick must die, we all know that. But he's supposed to die near the end of the third act, usually while saving several lives.Once on the train, Lou manages to lose his shirt so that he can channel Bruce Willis in DIE HARD by wearing a wife beater t-shirt. Yeah, Lou is 46 years old but he hits the gym. The part he's playing isn't worth bothering with, but he's in good shape.The Senator is going to have an afternoon delight with Miss Utah, but aliens intercede and both he and the woman young enough to be his granddaughter pay the ultimate price.Soon we have bomb threats, multiplying aliens, and of course the train goes out of control and speeds toward its date with destiny while Lou and Todd Bridges (DIFF'RENT STROKES) try to save as many lives as they can.There is exactly one surprise in the entire movie. Early in the story a couple lift wine glasses to their thirty-fifth anniversary, with hopes for thirty-five more years together. The dude gets banged up, but he and the Mrs. both live. Maybe the writers just lost track of them.This is the kind of movie that you'd love to be a fly on the wall. These actors who have done better work (and, really, deserve much better than this) are probably just happy for the work. Did they actually think they were working on something worthwhile, or did they cry (and/or drink) themselves to sleep at night? At the end of the story the (fairly numerous, all things considered) survivors gather in the last car of the train, which is unhooked. The other cars go over a cliff but the one containing the protagonists stops just inches short of the cliff.Lou and his ex are reunited. Happiness reigns. I'd have thought that the first thing they'd do was get off the train so they'd have solid ground under their feet, but I digress.Someone looks out the window and sees a shooting star. Look, make a wish. Then another. Then more and more. The Earth is being bombarded with meteors that will crack open and creepy crawly hand puppets with big teeth will be everywhere.It's gotten to a point that seeing the words \"The Sci-Fi Channel Presents\" on an \"original\" movie tells us that we'll be glad we have Ti-Vo so that we can fast forward through the next two hours. Or, better yet, just go ahead and erase it two minutes into the story and spend that time more wisely.","We all know that special effects cost money, but it seems as if they could have used the money they saved writing the script to get some better shots. The train is obviously a model in most moving shots, the helicopter is obviously computer generated, the alien looks like the one from the end of Spaceballs, except it's a decade later and Spaceballs had an excuse.The only smart thing they did was blur all of the special effects to make them harder to see.Not even the actors could compensate for such a poorly written script and it's pretty obvious they didn't really try either.Please, don't waste your time. Please.","I have seen worse movies off the SyFy channel, but that is not saying much. Everything that I dislike generally about the SyFy original movies is here. And where to begin is going to be start.1) The special effects are not quite Titanic II bad, but they still have a very artificial look to them. The train itself is not convincing at all, almost reminiscent of a miniature train with the inside shot elsewhere. That may not be the case, but that's how it seemed to me.2) A lot of SyFy movies have slipshod editing, and Alien Express is no exception. Actually a lot of it is so bad that everything in some scenes look blurred together.3) If you are looking for a good story, or a good telling of it, look elsewhere. The concept is okay if barely original, but like other SyFy movies the execution is awful. The story itself is leaden in pace, thin in structure and predictable in how it is written. There is also no real tension, thrills or suspense.4) Not only that, if you are looking for likable characters, Alien Express is not for you. The characters aren't just clichés of the genre, but also SyFy clichés. But clichés don't actually bother me as such, as long as they are well written and not annoying. Alien Express fails on both counts. The characters are underdeveloped, and at the end of the day, while there have been far annoying character before especially in the SyFy movies of the past three or so years, I just didn't care for any of them.5) Was I expecting the acting to be great? No, not really. But I was expecting some enthusiasm. I didn't get that. Everyone seemed wooden and pretty much phone in their performances.6) But if I were to single out the worst asset of Alien Express, it has to be the script. Although I do dislike most of the SyFy movies, I do keep watching them for the novelty value and to curiously see if they do anything worthwhile. I may have seen about 40 or so SyFy movies in the past couple of months, but few have had dialogue as atrociously bad as that of Alien Express. It's all stilted and spoils any attempts to give some tension or thrills with how unintentionally funny it is.Overall, a terrible film, even for SyFy. Not their worst, but towards the bottom end. 1/10 Bethany Cox","Yes, it is not James Cameron or Ridley Scott. However, my little sister is the costume designer and everyone looked well-costumed. Concidentally, the character of \"Phil\" is also a friend of mine so I root for him as well.It's good to see friends and loved ones get work - even if they are in lesser productions. For my sister, it was a good break and has led to other movies, etc. I wouldn't have watched it but for the connection.It is hard to see how some of these get made, though. I guess I don't understand the biz.While it was good opportunity for my sister, it has hard to watch how some careers have fallen. From La Bamba to Alien Express, ouch.","Not a terrible movie... But there are monster scenes where you will be rolling on the floor laughing - not a good thing for a action/thriller. The acting is generally pretty decent for a SciFi channel movie. Barry Corbin plays a credible US senator, and Lou Diamond Phillips again gives us a decent military/police/sheriff/agent/marshal figure. The special effects are well, \"special\" - for example, the external train shots are very obviously a model train.Goofs: A meteor strikes a stationary car in the opening scene. The car bursts into flames but does not budge an inch. After the impact, the meteor is lodged in the top of the car's hood - impossible from the low angle that the meteor came in at.Spoilers...A good portion of the movie's events are predictable, from the helicopter crash (\"Pull up, pull up!\"), to the fact that the annoying people get it in the end, to the classic blown bridge over a 1000 foot gorge awaiting the train, to the sequel set-up at the end.The scenes showing the aliens attacking are hilarious. They are vicious cute puppets and move at lightening speed - remember the Monty Python rabbit? Spoiler Goof: In one scene four people shooting clip after clip cannot hit a single creature because they move at lightning speed. Later in the movie Todd Bridges rigs up a mini flame thrower which he uses to dispatch a number of creatures at close range. On several occasions, Lou Diamond Phillips is able to easily grab creatures with his bare hands.","There is a threshold in any theatrical work, when the technical/dramatic flaws become so bad (or distracting), that the effort actually become far more entertaining as a comedy, rather than viewed as a serious drama. \"Dead Rail\" (or as it was billed on SciFi as \"Alien Express\") definitely makes that transition. With a combination of eco-terrorist takeover/runaway train disaster/alien invasion (with a critter very similar to the chest burster's from Alien)/re-found love genre, everyone is guaranteed to find something humorous in this made-for-TV movie. The acting is mainly forgettable, but with such a outrageously unbelievable plot line who cares? Really fake looking special effects further enhance the shlock nature of this production. Did anybody in the production group have even a vague clue how a real train runs? If you like train movies just for their own sake, you'll need oxygen to be revived after passing out from laughing too long at the absolute nonsense in this film. Watch Dead Rail/Alien Express for some unchallenging entertainment; just don't take it seriously.","I have to say that this film was excellently produced and tops the ratings as a typical sci fi film! I enjoyed it.. its a sci fi film, if you want a thriller watch another channel.. This is what the scifi lovers want. Excellently produced by one of Sci-fi's best producers Scot Vandiver ! OK the special effects weren't excellent, but what a great cast! Some more money could have been used for effects but then again what sci fi has high budgeted effects. Stop complaining and change the channel if you don't like these type of films.. Films like Mission Impossible and Braveheart are great but these aren't Sci fi films.. Sci fi produces excellent films like Sabretooth , Alien Hunters etc .. Well done .. keep them churning out!","I played Sam (the porter, Lou's sidekick) in the Film \"Dead Rail\" Which later aired as \"Alien Express.\" And, I have to say that for my part I thoroughly enjoyed watching this film. As a struggling actor this was a chance for me to work with fantastic people, it gave me great scenes to include on my reel, and it allowed me to work on a dream job for a month and a half (no waiting tables!) Turi(the director) And Steve and Scott (the producers) Were very kind by giving me this opportunity to participate in the production. I made many friends (Lou, Todd, Steven) and I consider myself very fortunate to have been able to work with these incredibly talented people. There was not a day that went by that I did not laugh my butt off. The real tragedy isn't so much the special effects, it's that every single person who watched this film didn't get to see what happened behind the scenes and all the talent that truly went into it. Craftsmen building the set, prop masters, gaffers,wardrobe, makeup artists, script supervisors, the cinematographer, production assistants, extras, craft services, producers, director, and actors. It's a given that Sci fi didn't spend a terrible amount of money on the film (2 million) But There was a lot of time, energy, and man power that was instilled into it. I look on the film now as a production that brought a lot of talented people together for a fun project that was shot without complications in less than two months. It was a magnificent cast and crew and I'm just so glad to be apart of it! On a further note to those of you who don't know Lou Diamond Phillips, Todd Bridges, and Steven Brand. They are fantastic people who are incredibly funny. Lou I still am working on my Deniro impression and can't thank you enough for introducing me to \"midnight Run.\" Todd, every time I hear an Elvis song I can't forget the story you told me about hanging out with him at his house for dinner. \"Can you please pass me the pa tators?\" (IM A HUGE ELVIS FAN!) Steven, \"Mr. Brand!\" You are a true gent and all the advice and encouragement I received from you will always be appreciated. I miss you guys and hope you are well. Thanks for the good memories, stories, jokes,and friendship. Oh and miss Utah says hello! wink wink.joe-","\"Dead Rail\" isn't the worst Sci-Fi Channel original film.**SPOILERS**Senator Frank Rawlings (Barry Corbin) is traveling on his new high-speed bullet train on his way to a campaign rally on his way to becoming president, but in the desert, a meteorite crashes near the train, stopping it long enough for Vic Holden, (Lou Diamond Phillips) a detective, to investigate the crash. Rawlings wants nothing to do with the crash, and orders his train to move, which it finally does. Convinced the accident is nothing to just throw away, Vic chases after the train and climbs on-board. When his suspicions were right, he discovers the train is infested with strange creatures from space that eat human flesh. Discovering this, he gets the Senator's Secret Service to help him in dealing with the deadly creatures. When all seems lost, he and his wife Rosie (Amy Locane) find out that the train is on a collision course with a gorge that has no support for it. Finding out that fire works best to destroy the creatures, Vic and Rosie decide to plunge the train into the gorge and get the passengers safely out of the way, but the creatures make it harder than they thought.The Good News: OK, I know all about the hate that this movie has generated, and while I agree to some extent, this isn't the worst movie Sci-Fi has shown. That was \"Parasite\" not this movie. This does have a few redeeming factors. Despite what most of you say, I think most of the special effects work for the film. It has the same kind of charm that the old monster movies have: a cheep-looking creature but nicely imagined that has its own personality. The creatures themselves are given a nice new \"power,\" they can fly around at super-sonic speeds, making them nearly invisible. There is a small flash that follows them around, so you can tell where they were a few seconds earlier. There is a good amount of gore in the film, so this has a small redeeming factor for those fans. We see several bodies completely ripped up, lots of skin missing, a giant pool of blood around the body, as well as the interior being devoured. There is also some great looking dismemberment, a gaggle of scratches and rips, and even some blood splatter. This does fit the tradition of hardly-dry Sci-Fi films. The film is also fast-paced, as there is always something happening. What is happening may not be the most exciting or convincing thing ever put on celluloid, something is always on screen. Explosions galore, lots of blood, and some minor trappings of suspense filter through, and it does have some great action.The Bad News: Frankly, where to start. The effects, as mentioned above, could've been done more convincingly by a second-grader, the explosions are so cheaply made they cost more than the computer used to create them, and the dialog uttered by the \"adults\" in this film is so mind-nerving that a sledgehammer to the face might seem like a more tolerable activity are only a few things that frankly bugged the hell out of me. If you want more in depth reasons as to why this is, read the other comments on here. They cover it in much better detail and more accurately than I ever could.The Final Verdict: With juvenile effects, laughable dialog, and a pathetic creature, I know it's shocking that I had some good things to say about it. The only people I can really recommend this too are those that perform their own \"Mystery Science Theater 3000\" on the movies they watch or those that loved the 60's monster films and miss the charm in the creatures from then. Otherwise, stay away; that isn't an option.Rated R: Graphic Violence and some Language."],"review-user":["craig69","wsmith-26","Asteri-Atypical","sorin61","Amtrak_Mike","DizzQuixote","proscribe-1","gtc83","Kansas-5","kairingler","bababear","mentor397","TheLittleSongbird","jack-558","stephen-riese","mchalup","Giannila","bravovegas","slayrrr666"],"review-date":["15 August 2005","3 November 2006","14 August 2005","18 July 2006","20 August 2005","4 February 2008","18 August 2005","19 August 2005","19 August 2005","18 January 2010","25 August 2008","3 February 2008","17 May 2012","21 August 2005","14 August 2005","14 August 2005","24 August 2005","28 November 2005","22 September 2005"],"review-rating":["2","1","1","1","1","1","3","1","10","2","1","1","5","4","6","9","10","6"],"review-title":[" Rubber sock-puppet aliens aren't the worst part!\n"," Badness is Relative\n"," Only Beavis and Butt-Head would like this movie...\n"," Really, you would think they learned how to do special effects.\n"," A Candidate for \"Mystery Science Theater 3000\"\n"," Wow, a new low for me in cinoexperience\n"," Dead Rail - A sit-com in disguise.\n"," Nothing much to like\n"," The bane of the Sci-Fi channel\n"," kick butt movie\n"," Derailed\n"," If only I could think of something nice to say\n"," Completely off the rails\n"," I have a personal connection to this movie\n"," Alien meets Runaway Train with 60's Godzilla special effects\n"," So bad, its was actually good\n"," Typical scifi film don't complain!\n"," I participated in the film so heres my perspective\n"," A very laughable Sci-Fi Channel flick\n"]}