{"review-url":["http://www.imdb.com/title/tt0483726/reviews"],"review-text":["\"Man of the Year\" tells the story of Tom Dobbs (Robin Williams) a political comedian (like Jon Stewart or Stephen Colbert) who has his own television show. On his show he talks about all sorts of things but his main focus are political issues which he is very opinionated about. One day on his show, a fan from the audience raises the idea that Dobbs should run for President of the United States. After that episode aired, millions flocked to the web to create various petitions and voice their opinions on why Dobbs would make a great candidate for the President for the United States. A few weeks later, Dobbs decides to run for President and low and behold wins the election. Everything seems to be going as planned until a woman by the name of Eleanor Green (Laura Linney) shows up and starts some controversy regarding his position. A funny yet serious political thriller ensues Man anyone walking into this film expecting to see a brainless comedy will surely be disappointed. I always wonder how some people are film marketers when I see how misleading their marketing campaigns. \"Man of the Year\" is a great example of bad and misleading marketing, because everything from the poster, to the trailer, to the online advertisements makes this movie look and feel like a comedy. I would honestly have to say about 1/3 of the film is funny while the rest of it plays off as a political thriller that makes good arguments and allows its audience to think. I kind of wonder in this case if the marketing was done on purpose since this film addresses pretty serious issues in-between its comedy routine.But enough about marketing, lets get down to the film itself.I really liked \"Man of the Year\" even though I was expecting to see a comedy instead of a serious film. One of the many things I will give this film credit for is that the film does a decent job switching between comedy and drama even though at first it seems a little awkward. I really think that after you figure this out that the movie is going to be more of a political thriller than a comedy you get comfortable with it. Some may not because they are lead to believe that they are seeing a comedy and don't understand what this film is trying to say in the end but for those people they can blame the marketers for not advertising this film right.\"Man of the Year\" talks about a lot of things and seems to have a very strong opinion. As Tom Dobbs speaks he is saying things that need to be said and isn't about candy coating them. I also think the whole political subplot, while most critics say hurt the film probably again because of the misleading marketing, was very good. The idea of computerize voting has been tossed around the last few years and with all the problems computers have the issue being addressed in this film could surely be realistic. Also the control big businesses have over voting also gets addressed.As far as acting goes, I think everyone involved did a good job. Robin Williams had a chance to be funny yet serious at the same time by playing Tom Dobbs. Some say that Williams has overstayed his welcome as a comedian but I personally still think he is funny and he's a good serious actor as well. This is probably one of the few occasions though that we get to see him go back and forth from serious to funny and I think it works well. Also it's nice to see Lewis Black co-star in a decent film. Again I like Black when he appears on \"The Daily Show\" and does stand up however most of the films he has been in were awful. This was a good movie for him because I think his political views fit in with the story that director Barry Levinson was trying to convey. Laura Linney is a fine addition to the cast and proves once again that she is a very good actress and lastly Christopher Walken and Jeff Goldblum both do a very good job as always with this roles handed to them.\"Man of the Year\" was written and directed by Barry Levinson, the man who has brought us such films as \"Rain Man,\" \"Good Morning Vietnam,\" and \"Wag the Dog.\" Levinson does a fine job writing the film and directing it. Like I said I know a lot of critics didn't like the whole political thriller aspect of the film but I thought it fit in nicely. It was actually nice to watch a mainstream movie that allowed me to both think and laugh at the same time. Barry Levinson did a fine job with this film.In the end, don't go into this film expecting to see the movie that the commercials are selling you. It does have laughs but at the same time it plays off more as a political drama. It's not as stupid or silly as the marketing campaign leads you to believe. I really liked the fact that this film that this film wasn't a typical Hollywood film. It tried to be a comedy and a serious drama at the same time and worked at least for me. I like the fact that the film didn't really tone down any of the issues it addressed nor did it have a typical Hollywood ending. I was trying to call the ending from the get go but surprisingly it didn't end the way I thought which made me happy. It's a movie that will make you laugh but then a few minutes later allow you to think and wonder what's going to happen next. I think its a good movie that will be hurt by its bad marketing.","I completely disagree with the other comments! I too saw this film at an early screening and found it quite enjoyable. Robin Williams is in top form. True, the tone is familiar, but it is Williams of Good Morning Vietnam: smart, funny, on point. After too many dark turns, Williams is finally back to what he does best. The supporting actors give great performances, especially Laura Linney and Chris Walken. Chris plays himself, as usual, but as the \"agent\" to the next president he was a delight each time on screen. Lewis Black plays only himself basically, but he is wonderfully well used here. There is also a fun turn by Jeff Goldblum. The movie is more than what the trailer suggests, as well. The movie is funny, but it is not a pure comedy as suggested. It has a bit of a thriller line, which everyone should seriously consider, especially if you pay attention to the newspaper.","Man of the Year reviewed by Sam OsbornFrustrating is a good word to describe Man of the Year; frustrating because one half of this film shines. This half moves with ease and works off the unshakable glow of Robin Williams. The other halfthe evil half, if you willworks more like an infection: relatively harmless at first, but fatal and sort of repulsive when left untreated. What could have been a sweetly charming comedy is left suspending all means of reality to turn this wickedly funny political affair into a silly farce of a thriller. Robin Williams plays Tom Dobbs, a kind of fictional counterpart to Jon Stewart. Like Mr. Stewart, Dobbs hosts a nightly comedy talk show that discusses the absurd nature of current political news. In Dobbs' worldand more than likely, in oursmore people obtain their knowledge of current events through Dobbs' nightly sketch than from valid news sources. He's so popular in fact, that when one member of the audience suggests that he run for president in the upcoming election Dobbs takes it seriously. His campaign is fostered through a grassroots internet movement that manages to put him on thirteen of the fifty states' ballots and into the last of three national debates between the two party-aligned candidates. This segment requires that, yes, we suspend some belief in Director/Writer Barry Levinson's vision of reality. Could a talk show host with no political background really rise to such presidential heights? Probably not. But it's plausible enough. The true deception comes with the ornery sub-plot that Levinson plunks down like an anchor into this prim and simple tale. A new voting system has been implemented into the upcoming election, created by the corporation Delacroy. Eleanor Green (Laura Linney), an employee for Delacroy happens to find a glitch in the voting system only weeks before the national election. Her alarm is muffled by the legal head of the corporation, Alan Stewart (Jeff Goldblum), and her reputation put to tatters by a cocktail injection of illegal drugs a shadowy man sent from Delacroy gives her. And so when Dobbs wins the presidency by way of the glitch in the Delacroy voting system, Eleanor must evade assassination from corporate hit men and alert Dobbs to his undeserving position. I think it must first be said that I'm rarely one to penalize a film for lack of realism. In my opinion, a suspension of reality must align with the function of the film. Spiderman, for instance, doesn't require many laws of physics, while a film like Apollo 13 does. With Man of the Year, I have no issue overlooking Tom Dobbs rising to Presidential Elect, if it's a concession needed for the film to exist. At the same time, however, I find it difficult to believe that Ms. Green discovered the glitch in the Delacroy voting system by inadvertently testing the program at population volumes similar to those used during actual elections. The glitch is an alphabetical problem: candidates with pairs of letters that appear earlier in that alphabet will inevitably win the election (Dobbs beat Mills, for instance). Don't you think that the American Government might have tested this little gem of computer programming before relying on it to monitor the nation's votes? I think so. Should I be easier on this small puddle of disbelief? Well, I would if the subplot seemed at all necessary; which it doesn't. The Delacroy plot begins as an annoying thread but weaves itself into the delicate fabric of the entire tale. Soon, instead of following Mr. Dobbs' witty rise to power, we follow Ms. Green as she partakes in car chases, whispered phone calls, and FBI posturing. It's not exciting, it isn't thrilling, and it's certainly not tragic. Don't even ask if these segments are funny. When Dobbs could be grappling with the American political system and driving the film into a quiet and smarmily hilarious character comedy, Director Levinson chickens out and plays it dumb with this Delacroy farce.It's all just very frustrating, I suppose. Christopher Walken, Lewis Black, and Robin Williams are a comedic force. And allowing Williams to drift off into his own stand-up material was an ingenious creative decision. Mr. Levinson even has a convincing grasp on current politics and manages dozens of jokes surrounding them. And so why fall back on this Delacroy nonsense? Bah! i say. What a shame. Rating: 2 out of 4Sam Osborn","When taken as a whole for its ideas and dissection of the current 2-party system and political process, I think this is a great film. Granted the movie was not the comedy I expected, but once I got over that this film really made me think. So much of what we see and hear in regards to any election is such a joke. There is in particular a debate scene in this movie that I felt was a masterful critique of our political debates and how policies are \"discussed\" at them. I encourage anyone who thinks our process is fine to go see this film. If you want something to laugh at however, Robin Williams and Christopher Walken are not their usual selves. In this movie they show us that the truth hurts, not that the truth is funny.","Okay, I wasn't sure about this movie prior to going. I read the four or five reviews and they said it wasn't a comedy. Therefore, I expected it to be a thriller like they said.Well, they weren't exactly correct. It is funny, and no, not all the humor is in the trailer. I agree, this is not just a comedy, it's a dramady (drama/comedy) But if you know that going in, you won't be as disappointed. It is similar to Barry Levinsons other comedies, funny but also has some deep drama.This movie was advertised wrong, much like The Village. But it is still a good movie","The premise of this movie, of a comedian talk show host running for president as an independent just to shake things up, is funny, entertaining, brilliant and even a bit inspiring. (thought about the west wing debate when Tom Dobbs leaves his podium, thought about Steven Colbert announcing his candidacy, good times) The first 15 - 20 minutes of this movie are therefore very very entertaining, the debate especially. When he eventually get's elected, it's a pity that is because of a computer glitch, you'd want him to win fair (although that is unrealistic).But after that this movie goes completely downhill. I thought we'd get a great movie like 'Dave' (1993) in which we see how it would out if a comedian actually ran the country. Instead, the movie turns from comedy into a thriller, a romantic comedy and a drama and does none good. The computer glitch becomes the main storyline, which really sucks. Boy is this disappointing. I give it 3 stars just for the premise and because I actually managed to watch this movie from start to end without stopping it, which is usually a good thing with me.","This movie was advertised as a comedy but was far more serious than the trailers made it out to be. Don't get me wrong, I enjoyed the movie, but was expecting more laughs. Great performances from Robin Williams and Laura Linney. Worth seeing, but don't go expecting to be rolling on the floor. The movie left me wondering what it would be like if Robin Williams character was a real person that was running for president. Would we elect a comedian? I doubt it, unfortunately. That kind of stark honesty is something greatly lacking today. This is a movie that I will be adding to my DVD library as soon as it comes out on DVD. The movie has heart.","A political satire of a comedian (Williams) who after dissing the political campaigns and presidents is forced into the running. But shockingly we wins and makes a mockery of the office. \"Man of the Year\" is not the funniest movie nor the best but in small doses it does work. Williams again teaming with Levinson after a hit with \"Good Morning, Vietnam\". The two seem to have a great chemistry and work off each other. I am not comparing them to Scorsese and DeNiro but you can get the picture. Although I wouldn't quite say to rush out there and see the movie in theaters I would recommend renting it. This movie is a comedy but also has a great satire, please if you like movies like \"Scary Movie 4\" this is not for you, take your brain with you to see it. - ***","Robin Williams is a genius. One of the best comedians in the world. He really shows off in this one, cracking jokes left and right as the talk show comedian Tom Dobbs. From the previous this looked like it would be a side-splitting laugh fest. And it was funny. But there were a lot of serious parts in the movie that I was not expecting. I would describe it as a drama/comedy. But it's still worth the money to see, and I still found it to be almost everything that I expected. Robin Williams is at his best, along with the famous Christopher Walken. They play a very good team in this movie and I was actually shocked to see how well the two were able to work together. I recommend it to anyone who is looking for a light-hearted movie.","(contains spoilers) Tom Dobbs (Robin Williams) is a television talk show host gone political candidate; a Jon Stewart type that takes the plunge into contributing rather than heckling. This part of the movie works. Dobbs is credible, serious, and uses humor not for substance but to mock the ridiculous nature of the current lobby-ridden two party system. The political solutions offered by Dobbs are the standard third party 'common sense, but not too deep' solutions. Tom Dobbs wins and becomes the President Elect.But the movie is flawed with the 'other half'. Laura Linney portrays a computer programmer who discovers an error in the new, nationwide electronic voting system - one that caused Dobbs to win. She reports the error to her CEO ...who torpedoes her email, and then sets her up as a drug abusing burnout who may have caused the problem herself. Linney flies to Washington to inform Dobbs that the election was a sham - but them doesn't tell him.That's right, a sharp left turn away from suspension of disbelief and straight on to 'beg pardon? why?' It's clear that Linney's character understands that she MUST tell the truth, but for reasons we can only speculate, the writer chose to waste thirty minutes of screen time as she develops an emotional bond with Dobbs before telling him.The movie would have been much better had Linney's character revealed the problem right away, and then collectively the 'good people' spent their time solving the problem. Instead, the 'good people' spend their time doubting each other (while we are left to doubt the script writer).It's still enjoyable in parts, but maybe wait until DVD so you can skip the second act.","Saw this movie at a Saturday matinée with a friend. Theater was about 70% full.Although there are quite a few funny lines, it is more of a drama/suspense with humor sprinkled on top. Robin Williams gives a decent performance as does Laura Linney. Being a Daily Show fan, Lewis Black is pretty good in this. Christopher Walken gives a good performance also. The movie starts out slow and remains that way for about the first thirty minutes, then the suspense part kicks in and starts keeping you a little on edge throughout the rest of the movie. Suspense in a supposed comedy movie? I know that I, as well as everybody else in the place, was struggling a bit with this. A character would crack a joke during suspense sequence and you would hear just one or two laughs in the theater. In all fairness, after the movie was over there was smattering of applause. So, definitely, some people enjoyed this movie.I gave this movie a four out of ten, because I believe the comedy aspect doesn't work very well in a suspense/drama movie and the actors performances, while not bad, were just decent. Again, this movie isn't what was advertised.","The movie is more of a mockumentary of corruption in the whole American system. The correlations of those who vote who do not matter is so proved in the machines that end of voting a comedian to the oval office. Politicians are such a joke that we almost need a comic to represent us as we have been laughed at for years around the world. Bushism's have become a way of life for Americans and will be the only thing left after he leaves office none to soon. Oddly the only person of honesty is someone not even elected to the position and tells the truth in the end. The story is very subtle and if you go to it for laughs, it ain't happening. Leaves a lot for thought. Overall I enjoyed it.","Do not go to this movie and think it is a comedy!! Its about 1/4 comedy and all the jokes you get you've all ready seen in the trailer. I like Robin Williams and Christopher Walken but this movie is just not as advertised! The picture takes its self way to serious. I may have enjoyed it more if I wasn't looking for some laughs or a light hearted comedy. It's more of a drama/comedy. There is even a scene that made me jump in my seat. Who ever decided to promote this as a comedy should be fired. People will pay good money to see it before they realize they have been miss lead and the movie talks about the government not telling the truth.","I saw a screening of this movie last night. I had high expectations going into it, but was definitely disappointed. Within 5 minutes of the opening, Williams is already campaigning for his presidency. And he becomes president in the first 40 minutes. So there goes all that aspect of the movie. The first half hour are hilarious. Don't get me wrong, the movie has its moments. But after the first half hour, it takes a turn for the worst. It becomes less of a comedy, and more of a thriller/drama/love story...which is pointless. the movie goes nowhere and stands still for a good 30 minutes. there are laughs interspersed here and there, but the consistently funny part is in the beginning and only the beginning. at one point, the biggest cheer i heard in the audience is when a person in the crowd yelled 'boooo' during a very confusingly emotional scene. Williams gives a great performance, right on par with his comedic style. Walken also delivers a strong supporting role as only he can. I think the one character that goes underrated is Lewis Black. Consistently vulgar and political, its funny to see him tone it down for a PG-13 rating. Overall, I would not pay to see the movie. Afterall, I saw it for free and even I was disappointed. The first half hour is solid, and its all downhill from there. Not really fitting into a category, the movie realizes half way through that it should not have been anything more than a one-hour comedy central special. 4.5/10","Robin Williams as President elect, Tom Dobbs, could not have played the part any better. As a fan of the upcoming genre of Comedy News, character Tom Dobbs does an excellent job telling the political view point as we see it as common Americans. The movie as a whole was truly a roller-coaster of events. The beginning builds up to a climax, then its all down hill as events destabilize the plot for short periods of time, tosses your emotions around through barrel rolls of comedy and drama, and manages to re-assemble the story for a nice clean cut ending. I recommend Man of the Year to all Williams fans, and Comedy/Sit-Com. fans, alike.","I saw the movie with some friends, expecting to see a laugh out loud comedy, something smart and funny (like john Stewart) to my surprise the movie was more about the flaw in voting instead of the humour of this comedian. there were some parts where I did find my self laughing and robin Williams was quite charismatic when saying speeches, monologues or when on his talk show..too bad that only made up about 25 minutes of the 2 hour movie..i felt there was too much filler and the events were boring and slow. Would've been much better if it were a)shorter and b)focused more on him as a comedian/presidential funny-man instead of trying to solve the problem with the voting machine conspiracy and how he shouldn't be in office!!!!","The date was 13 October 2006: \"Mr. Levinson please tell us what your new movie is about?\" \"Well, it's a dark comedy, it's a political satire, it's a heavy melodrama, it's a modern love story, it's a taunt thriller, it's a.\" HUH? I guess we are doomed to heavy doses of this movie every election year from HBO. I had avoided it last cycle and finally figured I would just get it over with. I was expecting a liberal biased love letter to the Democrats and left leaning political hacks in general, after all it's a Hollywood movie and that's what they do, but they could not even get that right. This movie is simply a mess. Foreman in his prime could not have hit hard enough to punch up Robin Williams stale old material. It was painful to watch those cutaway shots of Lewis Black pretending laugh at it. Williams was doing his same act from Decision '88 and Decision '92. Politicians are out of touch and beholden to lobbyists? OK, we caught on to that about the Grant Administration! Then there were the gaping plot holes patched with preposterous tacked on lines like, \"You mean to tell me we didn't shut down her access when we let her go?\" Gee, that explains everything! For aspiring screenwriters Levinson gives an invaluable tip. Is your second act dragging? Then throw in a pointless Paint Ball scene for the kids! Yippee! Oh, and as a sure \"tension modifier,\" use plenty of cut off phone calls. Hello? Hello? Odd soundtrack choices you ask? It's got 'em. My favorite was the Thanksgiving dinner scene set to a French version of \"Beyond the Sea.\" Because nothing says Thanksgiving Day in America like a Frenchman singing about sailing, right? Come on Barry! Man of the Year was a good idea for a movie, but like bad politician's who try to be Everything to Everybody.they just end up disappointing Everyone.","How is it possible to make such a bad movie with such actors? Were they forced into it? The plot has nothing to do with an idea of how things would turn out if a comedian ran for president. They don't even try to give an impression of that. Just when you thought you were watching a comment from famous liberals on DC politics (the first five minutes), the movie runs off the road and into B-film drama about 1) a computer voting error, 2) the regular evil corporate suits who wants to cover it up with the most unoriginal lines in history, and 3) a neurotic but extremely pretty female programmer who tries to tell the coming president about this. She's soon the victim of the evil X-files master-lords of the computer company, who - instead of killing her - drug her to make her seem untrustworthy. But, when she gets to DC, she doesn't tell him. In fact, the movie then changes from B-film drama, to idiotic B-film-love-drama. Up to now, we are so far off the original starting point of the movie, that most people turn it off. I almost did. If it just could've been INTELLIGENT love drama, but no! It's not! It's the kind of \"oops I'm so nervous I'm being stupid all the time, so please love me for it\"-kind of love drama. All with a slow, slow pace, that has nothing to do with either the political plot of the movie, the X-files plot of the movie, or the comedy plot of the movie. All plots fail on all levels, which every annoying bit of meaningless dialog reminds you of. The love part has to be the result of deciding during a drinking binge \"hey, there has to be a dynamic of love between the president candidate and the extremely pretty female programmer, yeah, that'll work! Stick it in there!\"Meanwhile, Lewis Black is castrated and put into a role where he doesn't come up with one single Lewis Black line. The Lewis Black anger is replaced by a hope for it to surface sometime in the film, which it never does. And Christopher Walken is thrown into a hospital with heart trouble, to duplicate the dramatic effect of the heart attack of the President's closest aid in Westwing. Watching Christopher Walken being castrated like Lewis Black in roles that constantly struggles uphill to sound casual and Westwing-ish, but fail like Titanic every time, is like watching a great blue whale dying on a beach. Heartbreaking.And then, enter the low point of the whole movie: It raises the mindbogglingly, enormously difficult ethical question: Should Robin Williams go on to be president, knowing that he got elected because of a computer glitch? The American Dream And All Good prevails as he turns down the presidency on live TV, like Lassie the dog would. With the usual Patriotic Glamor Of The Presidency and the we're-so-smart-that-we're-making-history-atmosphere that Westwing cultivated in sickening abundance for the next million years.The director and screen writer, Barry Levinson, is now on my personal list of writers and directors I'm staying away from forever. This film must be seen as a symptom of a faulty production process, where people (inlcuding Barry Levinson) got to spend production money due to their personal relationships, and not their skills. This is a project made to satisfy poorly skilled people's wish for career success, and the formerly mentioned great actors were tricked into participating in it. That's the only explanation there can be. PS: The voting error in the computers was due to the double letters in Dobbs, Kellogs and Mills. Of course it was, what else could it be when you write a script and can't tell a computer from a dish-washing machine.","Man of the Year is an enjoyable film that should leave you at least somewhat satisfied. Yes, it's mostly a drama and partly a thriller, but it pulls it off better than many other films in the past few years that have had Presidential themes, most notably the very bad Mike Douglas film 'The Sentinel'.Comedian Tom Dobbs (Robin Williams) is the host of a talk show in the vein of The Daily Show who is prompted by an audience member to run for the Presidency. He takes her advice, throws one of the wildest presidential campaigns ever, and eventually wins the election to many people's surprise. All the while, Eleanor Green (Laura Linney) is a computer analyst who works for a new voting company (I'm not 100% sure, but I believe it was called Delacroy) that has supplied the entire country with their new voting machines. In the early stages, she finds it malfunctioning and tries to get the head honchos to listen to her, but they won't budge. After she gets fired, she is determined to tell Dobbs about his wrongful election all the while getting chased by corporate goons. I feel the movie focuses too much on her and not enough on Dobbs. If anything, she should have gotten top billing over Williams, she gets far more screen time.However, the film has comedic moments and they succeeded at making me laugh. Most of the funniest bits were already in the trailer, but there are just enough left in to recommend this to those looking for comedy. For those looking for a Political Dram Thriller, it comes close to succeeding at that, and the overall feeling when you leave the theater is mostly satisfying.Man of the Year could have been much better, given most of the cast and crews' previous outings, however it is good enough for me to give a mild recommendation with a rating of 6 1/2 out of 10.","I found this movie to be ... awkward. It wasn't bad. There are parts of it that are actually quite good. But it struck me as what you might call overly ambitious. There are basically two movies here. They're certainly connected; in fact in the context of this movie they're inseparable. But they're very different stories, and the combination of the two was - again - awkward.After what I thought was a pretty slow start with what was a rather lengthy narration style opening from Christopher Walken, playing Jack Menken, who was the manager for Tom Dobbs (Robin Williams), the movie started out really well. Dobbs is a political satirist, a la Jon Stewart. On his TV talk show he skewers politicians and rants against the system, and then suddenly and unexpectedly declares his candidacy for President of the United States. Starting out as a serious campaigner, he cuts loose as the political satirist he really is during a televised debate, his campaign catches fire and he gets elected, to everyone's surprise. This was working for me - and it was working really well. It wasn't outrageously funny, but it was a wonderful poke at the system, and I was seriously looking forward to seeing Dobbs poking the system from inside as he takes over the Oval Office.Then comes the awkwardness, as a completely unnecessary storyline gets introduced. The United States was trying out a new computer-based voting system. Now, I may not be an American but I'm familiar with the American electoral system. That's almost impossible. Each state runs its own version of the presidential election in its own way according to its own rules. To expect that every single state would sign on to this system is ridiculous. But that's the story. It then moves on to the fact that a computer glitch is what got Dobbs elected. You know what? I really wanted him as the legitimately elected President - a poke in the eye to the system from the voters. But he's not. The company that developed the computer voting system wants to cover the glitch up of course. So what if the glitch screwed democracy - it will hurt us in the pocketbook if people find out. But Eleanor (Laura Linney) - who works for the company - doesn't agree, wants to go public, and so the company sets out first to discredit her and then to eliminate her. So what started out as an enjoyable and light-hearted political satire becomes a political thriller about an electoral conspiracy. That could make for a good movie on its own, but to tie it in with the first part of the movie, where Dobbs gets elected in a huge upset was - I'll say it again - awkward. Both stories had a lot of potential. Because of the hybrid nature of the movie, neither story reached its full potential.To give credit where credit is due, though, Robin Williams was, I thought, superb in the role. He seemed credible, sincere and completely believable. I'm not always a big fan of Robin Williams; this movie was one of the best performances I've seen from him. Linney was good; Walken was probably underused. The movie's not bad. I just think it tried to do too much, and it would have been more fun and more interesting and maybe more thought-provoking if the whole political thriller angle had been dumped and we could have seen Dobbs actually and legitimately behind the desk in the Oval Office. (5/10)","Over the years, I've come to be a fan of director/writer Barry Levinson and he didn't let me down with this very funny look at politics. Popular TV comedian Tom Dobbs(Robin Williams)has enlightened the nation with his scathing jokes about the state of the country and elected politicians responsible. Night after night, he has his fans rolling in the isles; then the question is proposed that Dobbs run for president himself. His manager Jack Menken(Christopher Walken)says go for it. Dobb's flippant truisms flames a grass-root movement that puts him on the ballot. Comedian to President-Elect. Meanwhile, a young woman(Laura Linney)finds a flaw in the computer system that will count the ballots coast to coast. My favorite sequence is Linney's meltdown in the coffee shop.Williams is absolutely hysterical with his rapid quips. Others of note in the cast: Jeff Goldblum, Lewis Black and Rick Roberts.","I just had the opportunity to screen \"Man of The Year\" only to be completely shocked and disappointed. Not only is the movie barely a comedy, but the jokes are pretty much Robin Williams stand-up form 2002. Literally, if you've seen or heard his 2002 Broadway routine, you'll recognize jokes. In terms of how its not a comedy; well let's see, Williams plays Tom Dobbs, a TV political comedian who decides to run for president. OK, that sets up a great comedy idea, plenty of funny opportunities. Oh no. Instead, most of the movie is a complete political thriller. Laura Linney 's role turns the movie into a Manchurian Candidate meets a Robin Williams special. The movie has strong political messages, sure. But thats not why i went to see a movie.. basic equation should be: Robin Williams + Political Commentary = Funny Political commentary - its so simple. Well they messed something up (Barry Levinson not writing a comedy i suppose).","I am pretty surprised to see that this movie earned even lukewarm reviews, I found this movie downright awful. The plot flounders around trying to decide if it is a comedy or a thriller, then realizes it cannot achieve either. So it throws in the towel and continues with its absurd plot highlighted with a unintentional hilarious scene with Laura Linney, an injection, and spilled coffee that leaves the audience awkwardly squirming in their seats looking at one another like is this for real? Basically it is abysmal and really disappointing for Robin Williams fans, and it makes you think someone blackmailed Laura Linney into adding this piece of trash to her otherwise respectable resume. I wanted to leave after 10 minutes and wish I had, even seeing it for free I wanted someone to pay me for my wasted time. The computer glitch/twist in this movie was embarrassingly stupid, and by the end you don't care who wins the election. I vote for straight to DVD.","This movie is not that bad at all, but completely misleading. The movie show itself to be about a comedian winning the presidency. It is not. It is about an evil silicon-valley corporation that accidentally rigs the election but tries to cover it up. That's most of it. I don't know if there was a script of focus change, but it fails to deliver what it offered. Otherwise, it is simply a by-the-book film with a predictable conspiracy-minded plot. This left me puzzled more than anything else. Why would the comedian Robin Williams \"star\" in a comedy film where the real main character probably had just as much screen-time (who gets less than 3 seconds of air time in the trailers). This movie must've taken a turn after Rob signed on. This movie does not know what it's doing with itself, which is disappointing when there are funny Rob scenes you don't want them to end, but you're forced to watch a disgruntled employee try and figure out what she's doing instead of having fun with the \"Comedian for president ZOMG\" pull. Good idea that reeks of getting mucked up by producers and the like.","Surprisingly bad work from Barry Levinson and Robin Williams. I hadn't read any reviews of this movie; from the TV commercials, I expected it to be political satire like \"Wag the Dog\". It is not that: its political commentary never gets beyond one-liners (though a few of those are funny). It seems to want to be part thriller and part romantic comedy but doesn't succeed at either. Laura Linney's character (Eleanor Green) was especially unbelievable; her motivations were consistently unclear, and her acting was often excessive, well over the top.The list of plot holes could go on for days. Some of them have to do with computer programming. Having done computer programming, I can state from experience that this movie is completely wrong about almost every aspect of the process. One other example: not to give too much away, there is a scene in which Eleanor is in a shopping mall, pursued by a Known Bad Guy. Rather than making a scene in the mall with people around, she waits until they're alone in the parking garage to make a break for it. When she gets away, instead of going back into the mall for help, she gets into her car and apparently drives around at random for some time until she doesn't know where she is. She can't use her cell phone because the battery is dead, yet the Bad Guys are somehow using GPS to track her. Nearly every scene of the whole pursued-woman plat has similarly contrived and implausible incongruities.Several of the scenes between her and Robin Williams also seemed pointless, painfully boring, and far too long. Their interactions may have been intended to show that the two were developing feelings for each other, but I didn't feel that at all. Williams and Linney together seemed to be entirely devoid of chemistry."],"review-user":["MovieManMenzel","chrissyafrica","samseescinema","dead-canaanite","matz1036","hyperbart","bbw_vanessa","Doctor_No","chay-nicole-b","crako1","batson-robert","EricBosarge","thunder_storm9","ks283","sonnyboa","bflatt","fredrickstafford","hfurfjord-1","AldoTheApache","sddavis63","michaelRokeefe","GUzelac","molls93","orphanfrequently","imdb-15906"],"review-date":["13 October 2006","10 October 2006","15 October 2006","29 October 2006","13 October 2006","15 June 2009","24 October 2006","14 October 2006","26 October 2006","16 October 2006","15 October 2006","13 October 2006","13 October 2006","6 October 2006","23 October 2006","13 October 2006","23 July 2008","27 February 2007","13 October 2006","8 June 2012","24 February 2007","6 October 2006","14 October 2006","13 October 2006","14 October 2006"],"review-rating":["7","8","5","10","6","3","7","8","9","5","4","8","4","4","10","5","1","1","5","5","8","5","1","5","3"],"review-title":[" \"Man of the Year\" is a very good political thriller/comedy that will suffer at the box office because of its misleading marketing campaign.\n"," timely and funny, a worth see!\n"," It's all just very frustrating\n"," Better than people will say\n"," Is to comedy what The Village was to horror\n"," It started so good...\n"," Not what I expected\n"," Quaint political satire with notches of comedy, Williams shines again with Levinson at side\n"," More serious than what I would have thought... but still really good!\n"," Funny in parts, but flawed\n"," This is not the movie that was advertised\n"," Like Politics, most of America will appreciate this.\n"," Not a comedy\n"," Good for a little, bad for the rest\n"," Go See This Movie\n"," Advertised Wrong...Draged On\n"," Fraud At The Polls!\n"," Stay as far away from this film as humanly possible\n"," Enjoyable Political Drama Thriller with Comedic elements\n"," Two Very Different Stories In One Movie Seemed Awkward To Me\n"," The nation has spoken...but the result questionable.\n"," Totally advertised wrong!\n"," What the...\n"," Misleading\n"," Disappointing, contrived, and painfully boring\n"]}