{"review-url":["http://www.imdb.com/title/tt0446687/reviews"],"review-text":["I just saw this movie at the Tribeca Film Festival and i have to say that i thought it was amazing. The combination of humor and sincerity really made the movie worthwhile. The movie was about a seventeen year-old boy whose mother and father are very religious. The seventeen year old, Ben, decides to work for a retired actress who teaches him about girls and driving and life. It is very comical and touching. I honestly have to say that it is now one of my favorite movies. I recommend this movie to anyone and everyone. If you didn't catch one of the showings at the film festival, it's supposed to come out in theaters later in the year. Please go see it! It is a great film.","I only heard about Driving Lessons through the ITV adverts, and to be honest, I didn't know how much I would like it. I switched on the TV last night and was totally surprised. Driving Lessons is a modest, simple film which draws you in right from the start. Rupert Grint plays the part of socially awkward teenager Ben brilliantly. He's definitely one to look out for in the future. Dame Eve Walton is played by the fabulous Julie Walters. I loved the simple plot and the way the actors portrayed their characters with great sensitivity. The highlight of the film, for me was Evie's rather colourful poem. It shows how friendships can form between the most unlikely pairs. In my opinion, watching Driving Lessons is a great way to spend 2 hours. The scenery was also striking, especially the countryside. Anyone who can call this sparkling comedy forgettable, I strongly disagree with","Driving Lessons From the writer of the critically acclaimed films, Mrs. Brown and Charlotte Gray, Jeremy Brock brings a touching heartfelt dramedy starring Academy Award Nominees Julie Walters and Laura Linney and from the Harry Potter series, Rupert Grint. The beautiful portrait tells the story of Ben Marshall, (Rupert Grint) a seventeen year old boy being held captive in the heart of his religiously neurotic mother Laura (Laura Linney). After his school year ends he decides to take a job with a clever, free-spirited, and \"heavy on the bottle\" retired actress, Evie Walton (Julie Walters). The pair embarks upon wonderful adventures from camping to walks around the block to the simple conversations about life. Challenging the domineering mother, as well as each other along the way, the two develop a beautiful bond that revolutionizes both their lives.The comedic elements are flawless and precise especially coming from the British veteran, Julie Walters. Brock uses his unique style to create an infamous and loving nature that first time directors could only dream. Directing comes naturally to Brock as he builds up stunning imagery that breaks the surfaces and plunges the viewer down into an overabundance of adoration and creation. Even the subtle score by unknown composers Clive Carroll and John Renbourn accentuate the tone and manner Brock had no trouble in generating.Laura Linney is always making her mark in films as she does as \"Laura.\" The bossy and overbearing mother is at times unbearable and with Linney at the helm of it we are engulfed into that persona. The complexity of her character couldn't have been more flawlessly portrayed by anyone else. Rupert Grint breaks away from \"Ron Weasley\" and tries on someone new. His performance is more responsive than loquacious but Grint gives us someone brand new to a child performance and the viewer gets to enjoy it. But the standout is coming from Oscar nominated actress Julie Walters who gives \"Evie\" a life of her own. Despite the role being clearly a leading one, Walters fairs better in the supporting category where I believe she can simply take home the prize. \"Evie\" is a mix of \"Clementine Kruczynski\" and \"Mrs. Laura Henderson\" with her free spirit and lovable persona. Hopefully her role will not go unnoticed this awards season.Driving Lessons isn't an \"out of this world\" experience but a fine, enjoyable one that any viewer could just kick back and learn a little something about life, love, and friendship coming in the forms of the most beautiful colors and sizes.Grade: ***/****","\"Driving Lessons\" sees two middle class quintessential British families meet head on, when Grint's character comes into contact with Evee, (Walters), a slightly deranged out-of-touch actress with an ego. Grint betrays his overpowering, and over-Christian mother, (Linney), and goes off travelling with Evee to Scotland, to accompany her on a trip to participate in a Poetry reading, something she claims could be her last, due to an illness.Grint's portrayal of a caged youngster, brainwashed by an overbearing, and even hypocritical mother, is the masterpiece of this film. His portrayal of a downtrodden teen in search of his true morals, and happiness, is captivating to watch unfold throughout. The film is sharply shot, and well paced, with very few moments leaving you tired, an achievement, particularly considering the nature of the plot. Walters really grabs hold of her character with both hands, and successfully brings the audience to her side of things, emphasising Linney's ironic immorality throughout. Her role in \"Driving Lessons\" is enjoyable and memorable in every sense.The plot develops nicely, leaving the audience cheering on Grint as he chases back to Evee's place during his lunch break during his stint at a local bookshop to apologise for his wrongdoings. The values in the piece are continued and brought out thoroughly up until the final drag, in a very consistent way. The overbearing, (and relieving), main idea being that religion doesn't lead to happiness, and certainly doesn't lead to morality.The audience are left sympathising with the radical but lovable Evee, with her and Grint making an irresistible partnership on the big screen, transferred directly from their debut in the \"Harry Potter\" series. Charismatic and beautiful acting together with a tight and fact paced script make this a must-see this Christmas.","I can't disagree with a previous comment that \"Driving Lessons\" is more than a little twee, but one man's indictment is another's endorsement, I suppose. In my book this film succeeds on pure charm, no small feat in itself.I can't help but wish the story was a little less conventional given the amount of acting talent in it, but by the end the plot seems more like a backdrop for the character interactions anyway. Julie Walters' Dame Evie is a gloriously over the top and over the hill actress. Though Evie hasn't had steady work in years, it's unclear the last time she visited reality, if ever (think Edina from \"AbFab\" at 65, at one point she is even forced to come to grips with her kitsch-factor). Some may find her annoying, but I think that's the point, to emphasize just how much she pushes the reserved Ben's (Rupert Grint) buttons to force him out of his shell. Ben is equally isolated from reality, living his whole life under the thumb of his overly dependent mother, who Laura Linney manages to breath some life into, despite being a fairly one-dimensional character (ye olde overbearing religious mom). I was rather impressed with Rupert Grint who I found to give a very honest and believable performance (not to mention sweet as all get-out), I can't think of many teen actors today for whom I can say that.The heart of the movie is what happens when Ben and Evie's worlds collide. At first Ben is understandably tentative, but also intrigued, as Evie is essentially the exact opposite of everything he's ever known. With the combination of Evie's persistence and Ben's helpful nature a genuine sweetness develops between them, culminating in an unlikely road trip that gives Ben his first real taste of independence.The tone is consistently light even through a few brief melodramatic bits, but there was still a surprising amount of emotional resonance, a credit to the main actors. All in all I'd say that if you're willing to sit back and let yourself be charmed by some lovely performances, \"Driving Lessons\" shouldn't disappoint. However, if \"cute\" is not in your movie vocabulary, best to stay away.One other minor note, the soundtrack features the music of Sufjan Stevens prominently, a nice touch.","Growing up is maybe a bit like learning to drive: lots of things you're not meant to do - at least when those in authority are watching. Staying on the straight and narrow can be difficult, especially if your teachers are awful.Rupert Grint (Ron Weasley from the Harry Potter series) has had the misfortune to be born into a family with a preacher as a dad and a self-righteously over-bearing mother (Laura Linney). He breaks out of his imposed cocoon with the help of a retired actress (Julie Waters) and achieves his rite of passage. Driving Lessons is highly polished mainstream comedy that will keep you snickering under your breath all the way through your bible class. A large amount of f-words (and a UK 15 certificate) sadly prevent any 14yr-olds that haven't learnt to bluff effectively from seeing it. . . . oh, and there's a nice bit of sex, courtesy a good Scottish lass.Ben answers an advert for a young man to help a retired actress in the house and garden. The eccentric Evie (Julie Walters) has soon whisked him off camping, and then taken him to Scotland where he Become A Man. He has to get rid of what Evie describes as the 'social autism' inculcated by his religious upbringing. His mum has been determinedly teaching Ben to drive (he fails his test) and things are not good in the parental marriage (but they are God's ambassadors and must show the world a smiling face). Ben learns that, \"When the sh*t hits the fan, get a tent,\" although the road is long and sometimes hard. He also learns, through the power of impromptu drama and hard choices of conscience, that there is more to being a man than following the rules.The road to and from Scotland is apparently a single track road that passes through such unlikely places Holyrood Park (which also just happens to have one of the best views of the city). But hey! The boy could have got lost! The whole movie has such lovable pacing and unpretentious detail that it is easy to forgive such quirks. The glimpse of the Edinburgh Festival, which is the biggest arts festival in the world, is achieved with remarkable panache. Evie and Ben arrive at the Caledonian Hotel and the Book Festival contact soon has him off to a nightclub and then her bed in the true spirit of Scottish hospitality. The soundtrack concocts a heady blend of Scottish folk, Salsa Celtica, Richard Thompson, Nick Drake and Chopin's First Nocturne in B flat Minor. Loosely based on the director's own experiences growing up as a vicar's son and working for Dame Peggy Ashcroft, his portrait of middle class London suburbia hits all the right notes: perfectly correct on the outside, and full of abnormally screwed up people behind the net curtains. He pokes fun at religion without ever causing offence and is supported by superb actors and a talented crew.This is such a good movie that it is hard to say anything bad about it. Sadly the only flaw lies in the undeveloped substance of its central theme, meaning that Driving Lessons will be enjoyed to the hilt today, but too easily forgotten when its ideas are already second nature.","I saw this tonight with moderate expectations - if Tartan Films have picked up on something and are releasing it the that's generally a good sign, however I'm not normally a fan of Julie Walters, generally disliking her comedy roles (sorry to any fans, but it's a personal thing - I just don't find her funny in comedy).This was magnificent though - a great performance by all, but Grint and Walters are exceptional! Plenty of laughs, plenty of pathos, great timing and a wonderfully paced film - such a coming of age film wouldn't normally be something I'd expect to like so much but I can't recommend this highly enough - and watch Rupert Grint as he matures into a fine fine actor.","A British twist on Harold and Maude, Driving Lessons features a reined-in Rupert Grint and an over-the-top Julie Walters. While it is true that Grint is stone-faced like a redheaded Benjamin Braddock for the first half of the movie, it does not deter from the quirky family film--there are things going on that are out of his character's experience that would create a shell-shocked reaction. The chemistry between Walters and Grint carries the film, though Laura Linney's hard work to make her written stereotype human is also notable. These performances combined with a fun poppy soundtrack with artists like Sufjan Stevens, John Renbourn and Salsa Celtica make this kids popcorn flick worth a Saturday afternoon.","I caught the first screening of Driving Lessons at the Tribeca Film Festival. Rupert Grint shows he can act past Harry Potter. Laura Linney is amazing as the overbearing mother. Julie Walters is hilarious as Dame Evie Walton, with a mouth worse than a sailor. I hope that this film is picked up by an American distributor so that everyone can see it. This film is not only about Driving Lessons, but life lessons. Ben (Rupert Grint) is torn between wanting to obey his overbearing mother and vicar father and wanting to live his own life. It's an amazing film, from an amazing director whose taken his own life and put it on the screen for everyone to see, and everyone who can, should.","I wasn't expecting much out of this movie and I was slapped in the face. Julie Walters, Rupert Grint, and Laura Linney perform wonderfully as the main characters in this movie. Any teenager can relate to parental control and the urge to come out as who you really are, which is basically what this movie is about. Ben (Rupert Grint) does this when he meets retired actress Evie (Julie Walters) and begins to express his ideas with words. He slowly but surely breaks out of his shell and becomes much less awkward. Each and every viewer feels the ups and downs of the movie and the theatre is filled with laughter 75% of the time. The film satisfies all, and I hope that soon it might be released in all US theatres, because many do not have the chance to see the film unless they live in big cities. It is a MUST see!","I watched this film on ITV and I enjoyed it a lot. It was very watchable and very funny. Julie Walters and Rupert Grint were perfect in their roles. Julie Walters gets a special mention since she creates a wonderful diverse interesting character to watch. Ben's character is kinda shy and Stoic but the changes he goes through are wonderfully acted out by Rupert Grint, I would definitely say he has a future in acting after Harry Potter.Laura Linney is quite good in her role as Ben's over protective mother, the only thing they went wrong with is by making her too....Villain-y. Ben's father was also an interesting contrast to his mother, and in the end he is quite honourable too. The only character i wasn't keen on was Bryony, she was a bit plain and unnecessary i thought.Overall this is a great comedy drama that is very easy to watch. one of my favourite films of the year easily.","Loved this movie, what a hoot. Rupert and Julie are great together with Rupert being almost poker faced against Julie's animation, which worked well. Laura did a good job as the overbearing mother.Julie of course is marvellous as usual. While this movie will keep you laughing most of the time it also has a poignant side to it as it unravels the secrets in the lives of the main characters. Interesting that it was entitled Driving Lessons as this might lead you to believe this is the main feature of the movie which directly it is not though it certainly could be seen as \"Ben\" finally being in the driving seat in his own life. Like most things that are funny in life there is always the sad side and there are some moving moments in this movie. Very enjoyable movie and well worth watching.","The plot of this movie is a very old one. Religious people are weak at best or hypocrites at worst. Real life is to be found in friendship, drinks, one night stands, and secular art. The main character predictably discovers this in the end and is thereby saved from a life of saintly drudgery.That said, the performances are spectacular and save the movie from being a dull cliché. There are only really four main characters -- Rupert Grint (the parson's kid), Nicholas Farrell (his weak cuckolded father), Laura Linney (the parson's errant wife), and Julie Walters (the alcoholic aging actress who hires Grint on as a kind of personal servant and teaches him about \"real\" life).Grint can say more with his angry, furrowed stare than with any line. So they don't give him much to say. He even managed to maintain that stare when he sank beneath his bathwater. Linney plays a truly frightening holy witch. Farrell is depressingly repressed with a hopeless stoicism. Walters goes way over the top -- demanding, manipulating, cursing and generally playing the outrageous English eccentric. It's all been done many times before, but this cast does a very good job of it too.Yes, the film obviously was inspired by Harold and Maude, but thankfully Grint and Walters do not consummate their relationship. At least as far as we know, although they spend lots of time sleeping together in a tent. They just become pals and Grint grows up. He learns his \"driving lesson.\"It's not a bad movie, but I wouldn't fight for a parking place to see it. You've seen it all before.","Ben, (Rupert Grint), is a deeply unhappy adolescent, the son of his unhappily married parents. His father, (Nicholas Farrell), is a vicar and his mother, (Laura Linney), is ... well, let's just say she's a somewhat hypocritical soldier in Jesus' army. It's only when he takes a summer job as an assistant to a foul-mouthed, eccentric, once-famous and now-forgotten actress Evie Walton, (Julie Walters), that he finally finds himself in true 'Harold and Maude' fashion. Of course, Evie is deeply unhappy herself and it's only when these two sad sacks find each other that they can put their mutual misery aside and hit the road to happiness.Of course it's corny and sentimental and very predictable but it has a hard side to it, too and Walters, who could sleep-walk her way through this sort of thing if she wanted, is excellent. It's when she puts the craziness to one side and finds the pathos in the character, (like hitting the bottle and throwing up in the sink), that she's at her best. The problem is she's the only interesting character in the film (and it's not because of the script which doesn't do anybody any favours). Grint, on the other hand, isn't just unhappy; he's a bit of a bore as well while Linney's starched bitch is completely one-dimensional. (Still, she's got the English accent off pat). The best that can be said for it is that it's mildly enjoyable - with the emphasis on the mildly.","It is a pleasant surprise to see Rupert Grint get to grips with some proper acting. Only the most ardent Harry Potter fan would claim that he was any great shakes in the Potter franchise, so watching his affecting performance here is a relief as much as anything else.He is the put-upon teenager who manages to break free of his stifling mother (Laura Linney) when he goes to work for a has-been actress, played to hammy perfection by Julie Walters. Like Driving Miss Daisy and Transamerica, Driving Lessons is a film about two people with differing world views thrown together in the confines of a car.The acting is deft and the dialogue is strong, but ultimately it doesn't do anything new with the genre. While Driving Miss Daisy tackled race and Transamerica dealt with gender identity, Driving Lessons is much less ambitious. It is, at most, the reconcilement of a conservative middle class religious boy with a flamboyant middle class atheist woman. The denouement is neither as dramatic nor as poignant as we have come to expect from this type of film, but that is as much to do with writer/director Jeremy Thorpe's choice of subject matter as his handling of it.Moreover it is not, as other reviewers have suggested, a family film, unless your family has started using the c-word (one mention, as an adjective) and the f-word (all over the place).It is a lovely film as far as it goes, but Thorpe, in his directorial debut, never quite shakes off his L-plates.","I just finished watching this movie and am disappointed to say that I didn't enjoy it a bit. It is so slow Slow and uninteresting. This kid from Harry Potter plays a shy teenager with an rude mother, and then one day the rude mother tells the kid to find a job so that they could accommodate an old guy apparently having no place to live has started to live with his family and therefore the kid goes to work for a old lady. And this old lady who is living all alone teaches him about girls, driving car and life! I couldn't get how an 18 year old guy enjoy spending time with an awful lady in her 80s. Sorry if my comments on this movie has bothered people who might have enjoyed it, I could be wrong as I am not British and may not understand the social and their family structure and way of life. Mostly the movie is made for the British audience.","Every movie I have PPV'd because Leonard Maltin praised it to the skies has blown chunks! Every single one! When will I ever learn?Evie is a raving Old Bag who thinks nothing of saying she's dying of breast cancer to get her way! Laura is an insufferable Medusa filled with The Holy Spirit (and her hubby's protégé)! Caught between these harpies is Medusa's dumb-as-a-rock boy who has been pressed into weed-pulling servitude by The Old Bag!As I said, when will I ever learn?I was temporarily lifted out of my malaise when The Old Bag stuck her head in a sink, but, unfortunately, she did not die. I was temporarily lifted out of my malaise again when Medusa got mowed down, but, unfortunately, she did not die. It should be a capital offense to torture audiences like this!Without Harry Potter to kick him around, Rupert Grint is just a pair of big blue eyes that practically bulge out of its sockets. Julie Walters's scenery-chewing (especially the scene when she \"plays\" God) is even more shameless than her character.At least this Harold bangs some bimbo instead of Maude. For that, I am truly grateful. And if you're reading this Mr. Maltin, you owe me $3.99!","I really enjoyed this film. It's simple, and just natural. It reminds me a lot of the American film called Saved. Loved that movie too especially when I was in High School. Rupert Grint and Julie Walters are phenomenal. Rupert is a natural at this. Gah I love him! So talented. He shines brighter on his own aside from the HP films. I love seeing him in these different roles,and so far, the ones I've seen him in, he has done exceptionally well. I'll be looking out for more of what Rupert has to offer. Julie Walters is best old person I'd love to have as a BFF. She'd probably yank my head for calling her \"old\" haha.This film made me want to move to Britain :)","There were certain parts and pieces in the movie \"Driving Lessons\" that I was not thrilled by, but overall, I did enjoy this movie. The parts of the movie that intrigued me the most were the excellent actors and actresses, the random humor, and the beautiful scenery. I also enjoyed the overall plot and idea of this movie. I really liked how perfectly each actor or actress matched his or her part. Rupert Grint did a wonderful job playing his character, Ben. I thought Grint fit the image of the \"awkward teenager\" and did a great job expressing how each awkward teenager feels about certain situations. For example, when Ben senses that something between his parents is not quite right, he shuts down and keeps to himself. I think this represents how most teenage boys are. Grint also showed his acting skills when Ben was sharing his love poem to Sara. He showed how boys this age are a little unsure of themselves and how to talk to girls. Laura Linney, who played Ben's mother, also did an exceptional job portraying the stereotypical \"controlling mom\". She did this by acting as if she controlled the house and everything that goes on in it. She bosses Ben around to do things for her, like helping out at the church and even getting her some groceries. She also shows this controlling mom figure by lying and shutting the door on Evie, the woman who Ben has been keeping company. I think Linney was a great choice for the unpleasant mother of Ben role. The random spurts of humor in \"Driving Lessons\" were another entertaining part that grabbed my attention. Evie, played by Julie Walters, is the somewhat kooky older lady that Ben keeps company. She plays the most humorous role in this film with her funny yet a little inappropriate comments. I think the director, Jeremy Brock, made a smart move when adding Evie's funny sayings throughout the movie. The humor was unusual and not similar to other comedy movies, which is why I enjoyed it. For example, when Evie swallowed the car key and told Ben \"..the key will be back with us in the morning! I'm as regular as clock work.\" was humorous and grabbed my attention. Lastly, the overall idea and plot was something I liked throughout this movie. I loved the fact that they shot this film in England because it made the scenery like something I have never seen before. I also thought that the plot of the movie was very interesting and kept me wanting for more after each scene. I was very intrigued to see how Ben was going to be after taking care of Evie. I thought it was a good idea to incorporate the encounter of Evie and Laura, because they were the two opposites throughout the film. I also liked how Ben driving Evie everywhere related back to the beginning of the story, which was about his driving lessons.","Driving Lessons is a typical release in the \"quirky misfit finds quirky mentor\" subgenre of the coming-of-age film, and after the 2000s, this particular kind of movie isn't much to look at. While this particular kind of film might seem inspirational to some, seeing these same character types interact in this manner ends up being clichéd and just plain tired. However, this film has power in its execution, and it provides a delightful atmosphere; even at its bleakest, it has hope and a wonderful lust for life, which ultimately makes this film genuinely enjoyable. This film is about introverted Ben Marshall, who in-between learning how to drive takes up a job serving retired actress Evie Walton, who deals with her own personal demons. He struggles to stay true to his religious family while learning how to thrive with Evie's eccentric guidance. Rupert Grint and Julie Walters make this film work, and although their characters may seem archetypal, their performances hold up the rest of the film. At least for me, it was an honest delight to watch their relationship grow from the beginning to the end. Both Grint and Walters play the respective roles of Ben and Evie with so humbled and warm that it just feels good to watch these two in action. However, the rest of the films' aspects are lost in the wake of the two leads; the other characters are in my opinion somewhat underdeveloped; even though they are refreshing, we only get that in bursts and it doesn't nearly seem as natural as Grint and Walters' performance. The film's main theme of driving your own destiny and being your own advocate are tired; although writer/director Jeremy Brock puts this point across, it's stale; the audience can understand a theme, but it takes a little more effort to make it memorable than I felt Brock gave in the final product. Fortunately, a lot of what is missing in this movie is strengthened by a truly unique script; Jeremy Brock apparently based much of it on his own experiences working for British actress Peggy Ashcroft; maybe it explains why this portion of the plot seems stronger than the other half featuring Ben's religious family, but it does allow for some good emotional grab. The soundtrack is decent, nothing to write home about or detract from, but the inclusion of a band like Salsa Celtica is unique for something so explicitly British. We do also get to see a lot of the United Kingdom's countryside, which serves for a lot of good imagery. All in all, Driving Lessons, while not particularly groundbreaking or otherwise ingenious, is an enjoyable, pleasurable film. I do believe it could have stood more development in the sense that it could have more to say, but is a treat to watch nonetheless, and is something I think would be a good choice for a positive watch.","Driving Lessons starring Rupert Grint and Julie Walters was an extraordinary and inspirational movie about the coming of age of a very shy and timid boy named Ben. Jeremy Brock did a marvelous job in expressing the development of each character, and left viewers with a strong message about morals and lessons.The movie starts with Ben, a 17 year old boy, who is strongly dominated by his controlling mother. He is very shy and awkward, but has a strong love for poetry. Not many people understand his personality, until he has to work for a retired actress named Evie Walton. As he spends more time with Evie, he learns to speak his mind and stand up for himself. His true character is gradually shown throughout the movie, giving it a more realistic impact. I would strongly recommend watching this movie, not only because it had some laughable and comedic scenes, but also because through Ben, we are taught the importance of being true to ourselves. Jeremy Brock did an amazing job choosing the actors to portray his characters, making the plot even more interesting. I think that Rupert Grint was the perfect choice for Ben because he was able to demonstrate that quirky and timid personality that is not so easy to portray.Many people complain that the ending of the movie seemed rushed, however I think that was Jeremy Brock's personal intention. It showed the viewers how life can just fly by in a matter of seconds, and how our lives can change in a blink of an eye. That's certainly what happened to Ben. In a matter of minutes, he managed to turn his life around, and in a positive way. He started to speak out and make himself known in the world. Throughout the entire movie, there were many themes and symbols added, especially in the songs and soundtrack that was chosen. A very obvious song that left a huge impact on the ending was \"Auld Lang Syne\" for various reasons. Because of this, the tone and whole essence of the movie left me feeling content with the ending. Lastly, I liked how Jeremy Brock titled his movie. It may not seem relevant to the movie at first, but I think Jeremy Brock intended for his viewers to make their own interpretations and meanings regarding the title.","Driving Lessons is a wonderfully light-hearted yet touching comedy. It centres around the bizarre and unexpected friendship that develops between a shy and mild teenage boy, Ben (Grint) and eccentric retired actress Eve (Walters). Ben is trapped in a mundane and unhappy life that is still being controlled by his overly protective Christian mother. Eve is an old woman who still clings on to her glory days as a well known actress, and refuses to be the sweet older lady that society expects her to be. The only similarity that connects these two characters is their loneliness, and when Eve employs Ben to do odd jobs around her house, a very unlikely friendship forms. What is great about the storyline is that it has a clear message; conforming to other people's ideas of how to live your life, be it through religion, your relationship with family, or who your friends are, doesn't guarantee happiness - it doesn't matter whether your life is deemed normal, if it makes you happy then you should do it. Who doesn't love a movie with good morals? What makes this film different and, for me, quite fantastic, is how rather than being a couple of small, bland characters in a big action packed plot, it is two well developed, 3 dimensional characters in a simple yet realistic story. While some may find the plot to be boring, I think there is a well established balance between the simplicity of the storyline and the depth and intricacies of the characters. All in all a great movie, I would recommend to anybody.","Rupert Grint is a true find as a British teenager who gets a summer job working as the companion for an eccentric retired actress (Julie Walters) so, at his mother's request, they can help out the destitute elderly man she has taken in. Walters, once one of the most respected actresses of the RSC, ended her career on a British soap opera, and now lives in virtual seclusion. She becomes attached to him, and takes him off on the road against his mother's wishes, giving him an adventure and a view of life he wouldn't have had staying around his ultra-Christian surroundings.Laura Linney, one of the most likable American actresses of today on stage and screen, has usually played the type of character we'd all like to have as a wife, sister or aunt. But here, with a convincing British accent, she plays a very cheery woman who is hiding a lot of secrets underneath, most of which point her out to be a hypocrite and a sinner in secret. That said, her performance is excellent, but she has only a little bit of screen time. Red-headed Gint is a delightfully rich young actor who I hope gets the same popularity as his \"Harry Potter\" co-star Daniel Ratcliffe, reminding us that not every young actor has to be a pin-up boy looking like Justin Bieber or have a muscular, tanned body the teenage girls all drool over. As for Walters, I have adored this droll actress ever since before \"Educating Rita\", and here, she moves her character acting skills into Maggie Smith territory.The problem with the movie lies with the screenplay, moving in so many directions and leaving out some important details, so the ultimate result is sweet, yet unsatisfying. But with so few movies being made today that explore the relationships between young people and the delightful eccentrics around them, that is a small complaint. These characters benefit from each other's different kind of wisdoms, and for that, this film is truly worth exploring.","I was persuaded to watch this film but approached it with reluctance, expecting a tedious 'rites of passage' cliché cache with obligatory feel-good ending. But it was a lot better than that.The cast looked promising, and without exception, delivered. I've long felt that Rupert Grint, somewhat squashed by pedestrian screenplays in the Harry Potter series, had a lot more to offer than we've seen so far. Anything with Laura Linney has to be worth watching and with Nicholas Farrell there too, not to mention the incomparably hyper Julie Walters, one knew there'd be some terrific acting.The Linney character is so unspeakably zealous, self-righteous and awful that even her husband (Farrell,) seems unable to cope with her, despite his being an Anglican priest. Ben (Rupert Grint) desperately needs friendly guidance and a more helpful introduction to adulthood than appears to be forthcoming from his nearest and dearest - but from where? From whom?His relationship with the foul-mouthed, neurotic, failing actress, (Walters) follows predictable lines but these are carried off by a terrific chemistry, between the two actors and the story turns enough, just, to hold one's attention to the conclusion.A hugely enjoyable film but one that with a lot more work on the script, a sharper, more deftly plotted screenplay and ruthless elimination of hackneyed ideas, could have been a truly great one.Grint underplayed his role, particularly in the first third of the film, but to great effect.","I was unsure what to expect from \"driving lessons\"- unsure whether Rupert Grint could carry such a role, but within the first few minutes I was completely hooked. All the way through, the music, acting and scenery were absolutely stunning. Julie Walters, as always, gave a superb performance as the eccentric old actress Evie, and Rupert Grint, equally as good,gave a fantastic performance as the romantic Ben.Right from the beginning, I was forced into involuntary cringes, bursts of laughter and swellings of joy as Ben broke free from his controlling mother and fought for his friendship with his only friend, Evie. A very controversial story, probably rather exaggerated but none the less one of the best films i have seen in a long time.Highly recommend to anyone seeking a good British film and an evening to kick-back and just enjoy yourself."],"review-user":["Sugahun404","blondette-13","ClaytonDavis","adam_bloodworth","whats_the_secret_max","Chris_Docker","Mr_Alex","bridgef","SpeedBrat","afog09","Sky_Rider","jinty-reid","thutton-2","MOscarbradley","jack_malvern","shivugh","ldavis-2","tracyann_vaz","allykk05","ryanwilson_c30","Anonymous715","clare-skeldon","mark.waltz","ncolborn-1","ekartawick"],"review-date":["6 May 2006","18 December 2006","8 October 2006","17 December 2006","3 May 2006","26 August 2006","4 September 2006","2 May 2006","1 May 2006","27 October 2006","18 December 2006","21 January 2008","17 September 2006","18 December 2006","5 September 2006","23 January 2008","18 September 2007","12 January 2015","20 November 2013","20 November 2013","20 November 2013","9 March 2013","10 November 2012","11 July 2011","18 December 2006"],"review-rating":["10","9","8","8","9","6","9","8","9","10","9","8","6","4","6","1","2","10","8","6","7","7","5","7","10"],"review-title":[" Great movie\n"," Definitely NOT forgettable\n"," Drives its way right into your Heart.\n"," Moral and highly enjoyable\n"," Exceeded my expectations\n"," A young man's escape to Scotland - and from the ties that bind\n"," Exceeded any expectations I had\n"," Bubblegum Harold and Maude\n"," Rupert Grint shows his acting chops\n"," Great Comedy and Relatable Film\n"," Great Film\n"," Love this movie\n"," A cliché saved by its performers\n"," On the road to nowhere\n"," Interesting but fairly average relationship film\n"," Dull and uninteresting\n"," We're on the Road to Nowhere\n"," Light-Hearted and Poignant\n"," Review\n"," Enjoyable in feeling, if not in execution.\n"," Very Inspirational!\n"," A simple yet touching story with excellent characters\n"," Pleasing but somewhat strange comedy/drama with brilliant performances.\n"," Teenage angst, religious zeal and the frustrations of age - what a cocktail!\n"," Cringing, crying, laughing, dying- its all in there!\n"]}